{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:04:32", "date_modify": "2025-05-21 06:04:32", "date_publish": "2025-04-01 15:25:37", "description": "Somerset hope to have New Zealand pace bowler Matt Henry available for the second game of the County Championship says head coach Jason Kerr.", "filename": "sport_cricket_articles_c9w8kxe7w0jo_1747807472.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/bfbd/live/2294af90-0f08-11f0-8db0-89a142ea748b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c9w8kxe7w0jo_1747807472.html", "title": "Matt Henry: Somerset hope to have New Zealand pace bowler for Sussex match", "title_page": "Matt Henry: Somerset hope to have New Zealand pace bowler for Sussex match - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Somerset hope to have New Zealand pace bowler Matt Henry available for the second game of the County Championship season away to Sussex says head coach Jason Kerr.\nHenry has re-signed with the county until 25 June 2025, having enjoyed an impressive spell in Taunton during 2023.\nThe 33-year-old has taken 312 wickets in 142 matches across all formats for the Black Caps and finished the recent Champions Trophy as the highest wicket-taker, despite missing the final with a shoulder injury.\n\"To add that world-class [ability] into what is already an incredibly competitive bowling unit, we're hoping to see him for the second game we're still waiting for confirmation on that,\" Kerr told BBC Radio Somerset.\n\"He's had a bit of a niggle recently, missed out on the Champions Trophy final which is a shame for him and it's right that he's fit and able.\"\nHenry took 32 wickets in six County Championship matches during his last stint in Somerset, and was also the leading wicket-taker during the T20 Blast campaign when they went on to win the title.\nSomerset spinner Jack Leach said Henry is someone he \"looks up to\" and that when he was on the England tour before Christmas in New Zealand he spoke to him about returning.\n\"I was speaking to him a lot in New Zealand trying to convince him that it would be a good idea to come back,\" Leach said.\n\"He's a great lad to have, so much experience and absolutely nailing all three formats in international cricket for New Zealand and someone I definitely look up to and I think a lot of the guys do.\"", "url": "https://www.bbc.com/sport/cricket/articles/c9w8kxe7w0jo"}