{"authors": ["Amelia Warren", "www.facebook.com"], "date_download": "2025-05-21 03:57:32", "date_modify": "2025-05-21 03:57:32", "date_publish": "2025-04-07 08:49:08", "description": "Fan writer Amelia Warren reflects on Derby County's defeat at Swansea and the visit of Burnley to Pride Park.", "filename": "sport_football_articles_c0elg8x85e9o_1747799852.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5aeb/live/0a34bbf0-138d-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c0elg8x85e9o_1747799852.html", "title": "Derby County: Fan's Voice", "title_page": "Derby County: Fan's Voice - Rams missed legs of Jerry Yates at Swansea - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "After Wednesday night's game against Preston lacked quality, hopes were high that Derby's trip to Swansea would provide a bit more excitement.\nUnfortunately though, this wasn't to be the case.\nOnce again there was very little to report on for both sides in the first half, with a deja vu feeling from Wednesday night; a lot of hard-to-break-down defensive play and a lack of attacking impetus from both sides left the contest rightfully goalless.\nDerby fans were left sighing and scratching their heads at half-time, as the electronic board showed Oxford United and Plymouth Argyle had taken unexpected leads, making the Championship relegation picture look even tighter.\nThree points would've been ideal, of course, but as much as we have looked unstoppable in the past couple of weeks, small tweaks to the starting line-up for the Rams really disrupted our flow, and the consensus at the break seemed to be that we'd be happy to take a point.\nSwansea loanee Jerry Yates needing to sit this one out proved to be a big loss, with little attacking threat posed by the Rams all afternoon.\nThe legs of Yates up front have been a crucial cog in Derby's well-oiled machine for these last four games, applying pressure, creating space for others to advance into, and providing great link-up with Marcus Harness.\nDespite Kayden Jackson's work rate, and best efforts to replicate the role of Yates, things just wouldn't drop for him. With the mood in the stands becoming increasingly tense as many believed it just wouldn't be Derby's day.\nThat would be true, as with their only shot on target of the whole game Swansea took the lead. Extremely frustrating from a Derby perspective as it seemed we'd had the better moments in the match, but just weren't able to find the right decision at the end of a move, the killer pass, or the right strike to give us the advantage.\nThe old cliché of when it's not your day, it's not your day.\nI suppose no team in the bottom five is expected to win five games on the bounce, but to lose to a team who equally offered very little in the way of attacking threat is disappointing.\nDespite every other team in the bottom seven bettering Derby's result, the Rams have still managed to stay above the relegation places on goal difference. Really echoing how important wins against Blackburn, Coventry, Plymouth, and Preston have been to keeping Derby's survival hopes alive.\nJohn Eustace will now see his group of players go through a true test of character as they attempt to bounce back from the weekend's disappointment.\nBurnley make the trip to Pride Park on Tuesday evening, arriving with a great amount of incentive to win the game and increase their lead at the top of the table.\nIt will be interesting to see how the squad respond to having their great run of form halted, and how quickly they can dust themselves down and leave this game behind them.\nCrucial matches against Hull, Luton, and Stoke you feel will be the real season definers, it's just important we try and gain back some momentum as quick as we can to go into those games with as much confidence as possible.", "url": "https://www.bbc.com/sport/football/articles/c0elg8x85e9o"}