{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:41:16", "date_modify": "2025-05-21 03:41:16", "date_publish": "2025-02-09 18:05:05", "description": "Ireland interim head coach Simon Easterby praises his side's \"intent to attack\" in their Six Nations victory over Scotland.", "filename": "sport_rugby-union_articles_c1jgyjyrg0lo_1747798876.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/03e8/live/2fff8240-e70d-11ef-a5b2-6f302c2db239.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c1jgyjyrg0lo_1747798876.html", "title": "Six Nations: Interim boss Simon Easterby pleased with Irish 'control' in 32-18 win over Scotland", "title_page": "Six Nations: Interim boss Simon Easterby pleased with Irish 'control' in 32-18 win over Scotland - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ireland interim head coach Simon Easterby praised his side's \"intent to attack\" in their Six Nations victory over Scotland.\nThe back-to-back champions are two from two with a pair of bonus points after following up last week's win over England with a 32-18 success in Murrayfield on Sunday.\n\"We did what we set out to do in the game,\" Easterby told BBC Sport.\n\"We started strongly and limited Scotland to a few opportunities in the first half.\n\"We felt like we had control of the game in the first half and the scoreline reflected that.\"\nEasterby added that Scotland losing both Finn Russell and Darcy Graham to injury after the influential pair collided in the 21st minute had an impact on the game.\n\"We were good at not giving their individuals opportunities,\" he added.\n\"They were hamstrung by injuries to Finn Russell and Darcy Graham, but we delivered an intent to attack in the right way.\n\"I thought Sam Prendergast put us in the right areas more often than not and that is what you need. We managed the game well throughout.\"\nPrendergast, in his fifth Test outing, was named player of the match and felt his side were better in Edinburgh than they had been last week against England.\n\"I thought we started unbelievably in the game,\" he said.\n\"We put so much pressure on. We did really well in the second half when they got their purple patch to come back.\n\"It wasn't perfect from us but it was better than last week and we'll keep trying to get better week on week.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/c1jgyjyrg0lo"}