{"authors": ["Andrew Aloia", "Adam Whitty", "www.facebook.com"], "date_download": "2025-04-26 08:10:01", "date_modify": "2025-04-26 08:10:01", "date_publish": "2025-02-26 12:34:32", "description": "Harry Simmons opens up on the eye injury which forced him to retire at the age of 27 and move into coaching at Leicester Tigers.", "filename": "sport_rugby-union_articles_c0q1w11egz1o_1745655001.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c4df/live/533957a0-f42c-11ef-9822-d3d66c578726.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_c0q1w11egz1o_1745655001.html", "title": "Simmons' new start after career-ending eye injury", "title_page": "Leicester Tigers: Harry Simmons' new start after career-ending eye injury - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Harry Simmons knew he risked the permanent loss of vision in one eye if he attempted to play for Leicester Tigers again after suffering a freak injury in a game.\nStill, the versatile back admits it was difficult to accept - even with an irreparably damaged right eye - that his career had come to an abrupt end at the age of 27.\nIt was on medical advice in December that he retired because of an injury sustained 11 months earlier against Leinster in a European Champions Cup loss.\nHe underwent emergency surgery to save the sight in the injured eye, but the after-effects, and the danger of further serious damage being done while playing or training, led him to hang up his boots and move into a coaching role at Tigers.\n\"I was lucky enough to have good people around me, close friends and family, to help make those decisions because I didn't want to make them on my own,\" he told BBC Radio Leicester.\n\"It was tough and I say to a lot of people that I almost wish I was in pain. If it was a shoulder injury or knee injury, I could say that doesn't feel quite right, but with your eyes and you are using them 24-7, it just becomes your new normal.\n\"My vision now is normal to me, I can't remember what it was like before to be honest.\"\nWhat Simmons can recall, however, is the moment that ultimately ended his career.\nHe tracked a Leinster pass that sailed over his head and as he shaped up to try to stop his man, the fend-off from the visitors' Ireland winger James Lowe went horribly wrong for the scrambling Tiger, who described the incident as \"a freak accident\".\n\"His finger went up into my eye and did a fair bit of damage,\" Simmons recalls.\n\"Initially everything, the whole vision in my right eye, just went black. I didn't know if my eye was closed or open.\n\"There was blood pouring our of my eye, which is never a good sign.\"\nHe was rushed to hospital, but it was not for another two weeks that he underwent surgery as the initially swelling masked the severity of the injury.\n\"I had tried to train in that time, which was not the best idea, but we didn't know at the time,\" he said.\n\"Then I had an appointment in February and they said 'you need to go into emergency surgery right now'. That was pretty scary because it it went from thinking it was not too bad to thinking this is very serious.\"\nSimmons said the surgery to reattach his retina was deemed a success, although damage to his pupil could not be fixed.\nMonths of inactivity followed as his eye was given time to heal.\nIt was not until he returned to the pitch to train that \"different symptoms\" became apparent and that he had to consider what impact resurrecting his career could have on his sight.\n\"From the surgery, just the way the new structure of my eye was and how the muscles behind my eyes were damaged, meant my eyes were slightly off,\" Simmons said. \"And they were only off when I was looking up and to the side; my normal vision was quite fine so I hadn't really noticed it in the stand-down period.\n\"But when suddenly chucked into training you have got all sorts of stuff going on and I'm getting dizzy and light headed. My double vision was really bad.\n\"That, combined with the ruptured pupil, which means a lot more light goes into that eye, catching high balls under floodlight or under the sun suddenly became a lot harder.\"\nSimmons said that he, with the support coaches and staff at Leicester, \"threw the kitchen sink\" at trying to adapt his game to cope with the changes.\nAll the while, he was trying to push for a comeback despite \"the fear and risk of reinjury\".\n\"In my mind I always wanted to play again,\" he said.\n\"Once you have detached your retina once, you are a lot more likely to do it again. And doing it again for me meant I would lose all vision in that eye, which at 26 years old would not have been ideal.\n\"From surgery, really, I woke up a worse rugby player, which was even more frustrating for me than the risks of it was.\"", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/c0q1w11egz1o"}