{"authors": ["Ian Westbrook", "www.facebook.com"], "date_download": "2025-05-21 05:45:07", "date_modify": "2025-05-21 05:45:07", "date_publish": "2025-01-14 12:33:35", "description": "Brentford news: Opinion - Rico Henry a 'ray of light'", "filename": "sport_football_articles_crm7z2gymmlo_1747806307.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3eee/live/caf4a690-f0d7-11ee-b0e1-b9dd5ac46984.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_crm7z2gymmlo_1747806307.html", "title": "Opinion - Rico Henry a 'ray of light' - BBC Sport", "title_page": "Brentford news: Opinion - Rico Henry a 'ray of light' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The only ray of light to come out of Brentford's bitterly disappointing FA Cup defeat to Plymouth on Saturday was the return of Rico Henry.\nThe left-back had been sidelined since tearing his anterior cruciate ligament at Newcastle in September 2023 and, after coming close to a comeback a couple of times, finally made his first appearance in 16 months on Saturday.\nThe 27-year-old played the first hour of the match before being substituted and in that time produced a solid performance.\nHe withstood some hefty challenges from some Argyle players and slotted back into the side as if he had never been away.\nI am sure the club will manage his comeback carefully, so it will be interesting to see how much of a part he plays in this week's back-to-back home games against Manchester City and Liverpool.\nHenry's return would allow Keane Lewis-Potter to move into his more natural position on the left of a front three after admirably filling in at left-back this season.\nHis form earned a new contract running until 2031 and it is great to see players like KLP becoming part of the club's long-term future.\nAaron Hickey, who, like Henry, has been out injured since last autumn, also signed a new deal in the past few days, and said he appreciated the club standing by him during his absence from the side.\nThere was little else to celebrate on Saturday as, for the third season in a row, the Bees slipped out of the FA Cup at the first hurdle.\nGiven our mid-table Premier League position, it is frustrating for us not to have a cup run.", "url": "https://www.bbc.com/sport/football/articles/crm7z2gymmlo"}