{"authors": ["Karan Vinod", "www.facebook.com"], "date_download": "2025-05-21 07:36:26", "date_modify": "2025-05-21 07:36:26", "date_publish": "2025-05-20 15:19:27", "description": "Tottenham Hotspur news: Son 'physically ready' for Europa League final", "filename": "sport_football_articles_crk22x6rp34o_1747812986.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3f0d/live/244f19f0-358d-11f0-9b2c-138cad92aeb3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_crk22x6rp34o_1747812986.html", "title": "Tottenham Hotspur news: Son 'physically ready' for Europa League final", "title_page": "Tottenham Hotspur news: Son 'physically ready' for Europa League final - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tottenham Hotspur winger Son Heung-min spoke to the media before tomorrow's Europa League final against Manchester United.\nSon spoke about his return from injury and his fitness level: \"I am ready and obviously back from injury. It was my first game against Crystal Palace and afterwards I played against Villa. I didn't expect to play that long but I managed to play. Physically, I am ready to go and also the boys are ready to go for the biggest game of the season.\"\nThe Tottenham captain also spoke about using the 2019 Champions League final loss alongside another player who featured: \"Ben Davies is here. Let's not forget about his commitment and work rate. It's going to be a huge moment for both of us and also for the boys if we win. As we always say, the first step is going to be really the hardest. If we win that trophy, we can change the mentality and we can change the history and hopefully we can continue to compete for other trophies.\"\nSon was also asked if former Tottenham talisman Harry Kane had got in touch with him ahead of tomorrow's game: \"Everyone knows Harry is my best mate and it was a huge honour of playing alongside him. After he won his first title, we had a chat about his trophy. He is already on holiday so he doesn't have to text me. I am just concentrating myself with the boys and I'm sure Harry will be the biggest Spurs fan tomorrow and supporting us from his holidays.\"", "url": "https://www.bbc.com/sport/football/articles/crk22x6rp34o"}