{"authors": ["Joe Nelson", "www.facebook.com"], "date_download": "2025-05-20 14:25:38", "date_modify": "2025-05-20 14:25:38", "date_publish": "2023-07-29 14:01:37", "description": "Celine Boutier moves three strokes clear of Nasa Hataoka going into Sunday's final round of the Evian Championship.", "filename": "sport_golf_66349579_1747751138.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4EA0/production/_130582102_gettyimages-1578245502.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_golf_66349579_1747751138.html", "title": "Evian Championship: Celine Boutier closes in on first major with three-shot lead", "title_page": "Evian Championship: Celine Boutier closes in on first major with three-shot lead - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "France's Celine Boutier is closing in on her first major after a four-under-par 67 in the third round of the Evian Championship.\nBoutier, 29, is on 11-under, three strokes clear of Japan's Nasa Hataoka going into Sunday's final day.\nNew Zealand's Minjee Lee and Canada's Brooke Henderson are another shot behind in joint third.\nAmerica's Nelly Korda shot a seven-under-par 64 to move into contention at the Evian Resort Golf Club in France.\nAlongside Korda on six-under is Japan's Yuka Saso, who began the day joint second but shot a 71 to drop five strokes behind Boutier.\nThailand's Patty Tavatanakit was also joint second after two rounds, but has fallen to 14th place after she recorded a three-over par 74.\nDropped shots on holes four, six and 18, as well as a double bogey on 11, left her eight shots off the top.\nRepublic of Ireland's Leona Maguire recorded a four-under-par 67 on day three to move alongside Tavatanakit at three-under.\nScotland's Gemma Dryburgh hit 69 take her to ninth spot on four-under going into the final day.\nEngland's Georgia Hall recorded an impressive 68 to take her to one-under overall, but compatriot Jodi Ewart Shadoff's round of two-under was not enough to prevent her missing the cut.", "url": "https://www.bbc.com/sport/golf/66349579"}