{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:27:13", "date_modify": "2025-05-20 14:27:13", "date_publish": "2023-07-30 00:00:00", "description": "Relive the Croke Park drama as Dublin edge Kerry to lift the Sam Maguire Cup.", "filename": "sport_live_northern-ireland_66283986_1747751233.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9B08/production/_130588693_dublinvkerry-1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_northern-ireland_66283986_1747751233.html", "title": "Dublin beat Kerry to win All-Ireland title - as it happened", "title_page": "Dublin beat Kerry to win All-Ireland title - as it happened - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Final whistle\nFT: Dublin 1-15 Kerry 1-13\nIt was a meeting of football's two heavyweights and Dublin landed the winning punch late in the game to secure the Sam Maguire Cup.\nIt was so hard to call a winner throughout 70 minutes of top-notch action but the Dubs just about edged it.\nThat's all from us for now - thanks for your company.\nA fitting end to the season - Harte\nFT: Dublin 1-15 Kerry 1-13\nMickey Harte\nLouth manager & ex-Tyrone boss on BBC Sport\nIt was a fitting end to the season.\nYou had the two best teams in the country playing in this final and they took it the distance. They took it to the 76th minute for us to conclude who was going to win this game.\nYou also have to hand it to the referee. He let a certain amount of physicality go which the players went to town on.\nA brilliant battle - McConville\nFT: Dublin 1-15 Kerry 1-13\nOisin McConville\nArmagh All-Ireland winner on BBC Sport\nI suppose if you going to dig right into it, you could find holes.\nBut for entertainment and edge-of-the-seat stuff, you had two teams going at it with absolute honesty and endeavour.\nIt was a pleasure being here to watch it.\nGame had everthing - Murphy\nFT: Dublin 1-15 Kerry 1-13\nMichael Murphy\nFormer Donegal captain and All-Ireland winner on BBC Sport\nIt was an entertaining second half because it was so close. The pressure - you could feel it from the stands. It was so close. It had everything.\nAt one stage Dublin had 21 turnovers and that is something and from knowing this Dublin team, that is something we don't associate with them. So fair play to Kerry.\nEasy Dublin scores\nDublin 1-13 Kerry 1-12\nPhilly McMahon\nEight-time All-Ireland winner with Dublin on BBC Sport\nThe lads talked about Fenton at half time, about how Dublin are getting scores at ease and he's done it again.\nKerry haven't learnt from that and Kerry need to put him under pressure.", "url": "https://www.bbc.com/sport/live/northern-ireland/66283986"}