{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:28:37", "date_modify": "2025-05-21 07:28:37", "date_publish": "2025-01-03 22:49:09", "description": "Glentoran manager Declan Devine praises the character and application of his players after they recover from a one-goal deficit to defeat H&W Welders 4-2 in the Irish Cup fifth round.", "filename": "sport_articles_cj6z4nxn9g8o_1747812517.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a080/live/9308b6f0-ca24-11ef-a93b-571596df0d47.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cj6z4nxn9g8o_1747812517.html", "title": "Devine praises 'character and desire' of Glens", "title_page": "Irish Cup: Devine praises 'character and desire' of Glens in win over Welders - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Glentoran manager Declan Devine praised the character and desire of his side as they bounced back from a 2-1 deficit to see off Championship side H&W Welders 4-2 in the fifth round of the Irish Cup at Blanchflower Stadium.\nJames Singleton opened the scoring for the Premiership outfit but a double from Ewan McCoubrey saw the hosts rock their illustrious opponents by taking a shock lead in the east Belfast derby.\nA David Fisher strike, a Lewis Patterson own goal and Frankie Hvid's goal ensured the Glens booked their passage into the last-16 stage of the competition.\n\"We weren't at our best tonight but we still went away from home and scored four goals,\" reflected Glentoran manager Declan Devine.\n\"We had a couple of good chances before we scored but I think we showed good character.\n\"I felt we played too many long balls early in the game and we were very wasteful with our final pass but the most important thing at this stage of the competition is that you're in the draw for the next round and I have to give credit to the players as they kept working and our attacking players came to the fore in the second half and showed real quality.\"\nDevine acknowledged the role played by his substitutes on Friday night against a Welders side who impressed him.\n\"I'm disappointed with the goals we gave away but we had to dig in. Welders are a good side and they play a good brand of football and ask questions of you.\n\"In Josh Key I feel they had the outstanding player on the pitch, but credit to our lads. Our subs came off the bench and they gave us a fresh impetus in the game.\n\"The players showed really good levels of appetite and desire in the second half.\n\"We knew it was going to be a difficult game and that is what we got.\"", "url": "https://www.bbc.com/sport/articles/cj6z4nxn9g8o"}