{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:15:55", "date_modify": "2025-05-21 07:15:55", "date_publish": "2025-05-20 10:41:13", "description": "IPL 2025: Digvesh Rathi given one-game ban after 'notebook' send-off", "filename": "sport_cricket_articles_cd900qdzljqo_1747811755.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d069/live/eca83120-3565-11f0-bf15-094eef773db0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cd900qdzljqo_1747811755.html", "title": "IPL 2025: Digvesh Rathi given one-game ban after 'notebook' send-off", "title_page": "IPL 2025: Digvesh Rathi given one-game ban after 'notebook' send-off - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Spinner Digvesh Rathi has been banned from Lucknow Super Giants next match after his send-off to Abhishek Sharma and subsequent confrontation on Monday.\nAfter dismissing Sunrisers opener Abhishek, Digvesh performed his 'notebook celebration' - pretending to write a dismissal in an imaginary notebook - and dismissively waved Abhishek from the crease.\nThe pair then exchanged words and had to be separated by umpire Michael Gough.\nIt is the third time Digvesh has been charged after using the celebration during this year's IPL and takes him to five demerit points, resulting in a one-game ban.\nThe spinner was charged for breaching Article 2.5 of the International Cricket Council Code of conduct, which prevents players \"using language, actions or gestures which disparage or which could provoke an aggressive reaction from a batter\".\nArticle 2.5 includes actions that could be \"considered to disparage or demean\" the batter, including pointing towards the pavilion.\nDigvesh received one demerit point for a similar celebration against Punjab Kings on 1 April, when he also made minor contact with batter Priyansh Arya, and again on 4 April after dismissing Naman Dhir.\nHe was also fined 50% of his match fee for the latest infringement.\nAbhishek was fined 25% of his fee and given one demerit point under Article 2.6 - \"using a gesture that is obscene, offensive or insulting\" - following the confrontation.", "url": "https://www.bbc.com/sport/cricket/articles/cd900qdzljqo"}