{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:57:41", "date_modify": "2025-05-21 05:57:41", "date_publish": "2025-01-04 18:41:48", "description": "Boss Danny Rohl says Sheffield Wednesday defensive display in the 2-2 draw against Millwall was \"not good enough\".", "filename": "sport_football_articles_cn4xk4rk14no_1747807061.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7b11/live/af14df80-caca-11ef-bb47-87a9dea68aa1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cn4xk4rk14no_1747807061.html", "title": "Danny Rohl: Sheffield Wednesday defending is not good enough", "title_page": "Danny Rohl: Sheffield Wednesday defending is not good enough - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Sheffield Wednesday boss Danny Rohl said his side's defensive display in the 2-2 draw against Millwall at Hillsborough was \"not good enough\".\nThe Owls led 1-0 after an early Yan Valery strike but missed a number of chances - including a penalty that Ike Ugbo blazed over the bar - and then trailed 2-1 with five minutes remaining, before a late Gabriel Otegbayo shot earned a draw.\n\"I am very happy with the offensive play - how we created chances against a team who are normally very strong in the defence,\" Rohl told BBC Radio Sheffield.\n\"To score two times and have some good opportunities is great but we are conceding too many goals; that is 10 goals conceded in four games and that is not good enough.\n\"We are top six in the table for scoring but bottom six for conceding. It is not just a team tactical thing but individual decision-making and mistakes.\n\"We have to step up as a group if we want to achieve more. We have to improve the defending. We have to take responsibility. We entertain, but we entertain too much.\n\"We had good moments and movement attacking-wise, but to win games it is about clean sheets. We should win this game, but we didn't.\"", "url": "https://www.bbc.com/sport/football/articles/cn4xk4rk14no"}