{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:49:50", "date_modify": "2025-05-21 07:49:50", "date_publish": "2025-05-18 17:26:34", "description": "Crystal Palace news: Fan views on FA Cup victory", "filename": "sport_football_articles_ce9v2z4xx9xo_1747813790.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ce9v2z4xx9xo_1747813790.html", "title": "Crystal Palace news: Fan views on FA Cup victory", "title_page": "Crystal Palace news: Fan views on FA Cup victory - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked you to tell us how you're feeling after that victory - and hear your suggestions on how the club can progress from this point.\nHere are some of your comments:\nJosh: I'm still crying. I've just re-watched yesterday's Match of The Day, and I'm off again. The end-credits montage sent me. I've woken up in tears. I love football. I love my Palace.\nPedro: It's still sinking in. This wonderful achievement should prompt the board to stop squabbling, unite, back Glasner and move the club forward. With our brilliant fans behind you, this is our sliding doors moment. Let's not waste it. A brighter future awaits!\nTom: The best hangover I'm having. What a team!\nPeter: I've had to watch Match of The Day last night and this morning to confirm I wasn't dreaming. If we can back Glasner and keep most of the players, the future is a lot brighter. The board needs to unite for us to step forward. Do the right thing. Together, we can achieve much more.\nKarim: It still hasn't quite sunk in yet. FA Cup champions. All the talk about a Community Shield and a European tour is obviously great, but once the buzz is over I fear the euphoria of winning the trophy will be replaced by worrying about keeping our best players and, more importantly, our manager. Big summer coming up for us.", "url": "https://www.bbc.com/sport/football/articles/ce9v2z4xx9xo"}