{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:53:03", "date_modify": "2025-05-21 04:53:03", "date_publish": "2025-02-04 00:00:00", "description": "Jack Colback's 76th-minute strike earns Queens Park Rangers victory at home to Blackburn Rovers in the Championship.", "filename": "sport_football_live_c9qje0y9949t_1747803183.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c9qje0y9949t_1747803183.html", "title": "QPR 2-1 Blackburn Rovers: Colback strike boosts Rs' play-off hopes", "title_page": "QPR 2-1 Blackburn Rovers: Colback strike boosts Rs' play-off hopes - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jack Colback struck an emphatic 76th-minute winner to move Queens Park Rangers three points from the Championship play-off places with victory over visitors Blackburn Rovers.\nIn an intense, frequently end-to-end encounter, substitute Colback's first-time finish from the edge of the 18-yard box gave Rangers their first points in three games as they resumed their resurgence since December.\nHaving fallen behind to Michael Frey's fifth-minute header, Blackburn returned reinvigorated after the restart and equalised through Tyrhys Dolan's penalty eight minutes after the break.\nFifth-placed Blackburn remain a point above West Bromwich Albion and Middlesbrough, both of whom have a game in hand and a significant goal difference superiority over John Eustace's side.\nIlias Chair was a persistent threat for QPR, producing his fourth assist in seven games when his inswinging free-kick from the left was glanced in by fellow forward Frey for his seventh goal of the season.\nDolan was denied an equaliser four minutes later, hitting a close-range shot that was brilliantly saved by Paul Nardi after QPR failed to clear Makhtar Gueye's delivery.\nQPR almost doubled their lead when Aynsley Pears pawed Chair's curling shot from distance around a post.\nThe side who were bottom on 26 November went close again when Paul Smyth swerved a strike wide from just outside the box before Chair followed suit, having twisted skilfully to fashion space to shoot.\nThose misses appeared costly when Dolan took his chance to convert from the spot, scoring his first goal in 20 appearances following a foul by Koki Saito on Callum Brittain.\nAfter Blackburn's bristling start to the second half slowed, Colback powered QPR decisively back in front via Pears' fingertips for the midfielder's first goal since last February.\nQPR are 13th and have won five of their eight league games in 2025, while Blackburn have taken one point from their last five league away games and scored two fewer goals than any other side in the top half of the table this season.\nQPR boss Marti Cifuentes told BBC Radio London:\n\"Blackburn showed why they are that high in the table because they were dangerous every time they were in the final third. We spoke a lot about how they are a very good transition team. We showed energy, focus and commitment as a team, in that sense. The energy of the fans was fantastic and helped us very much.\n\"We had a very strong first half. We could have scored another and we said at half-time that it was time to keep pushing. The start of the second was more challenging, but we were very good overall.\n\"I'm very pleased for Jack. He's been having a difficult season with injuries. We really needed his experience in a moment when the team was struggling and it was a fantastic performance.\n\"We got 56 points last season and our target was to improve on that. I don't think we need to get very carried away.\"\nBlackburn boss John Eustace told BBC Radio Lancashire:\n\"It's a really tough place to come when they raise the tempo here. We had some great moments but we just weren't clinical enough. We conceded a couple of really sloppy goals.\n\"We've been very good defensively at set-pieces, but we weren't good enough at the start. I had a little word with the boys before the second half, but they sorted it out themselves as well.\n\"The manner of the second goal was really disappointing. We should have done better on the second phase of the attack and we've got to put our bodies on the line to keep the ball out of the net.\n\"A draw would have been a fair result and we would have taken 1-1. There are 15 games to go now and we can't look backwards. We've got to learn to keep the ball out of the net.\"", "url": "https://www.bbc.com/sport/football/live/c9qje0y9949t"}