{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:01:21", "date_modify": "2025-05-19 15:01:21", "date_publish": "2017-07-05 14:32:46", "description": "Celtic say they are confident a previous league ruling on Rangers' use of a tax-avoidance scheme will be re-examined.", "filename": "sport_football_40510207_1747666881.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/E84F/production/_96817495_larsson.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_40510207_1747666881.html", "title": "Celtic expect Rangers' EBT 'sporting advantage' review", "title_page": "Celtic expect Rangers' EBT 'sporting advantage' review - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Celtic are confident that a previous league ruling on Rangers' use of a tax-avoidance scheme will be reviewed.\nA Scottish Premier League commission found Rangers \"did not gain any unfair competitive advantage\" from the use of tax-free loans between 2001 and 2010.\nNow the Supreme Court has ruled in favour of HM Revenue and Customs over the use of Employee Benefit Trusts.\nThe Scottish FA has ruled out any disciplinary action, while the SPFL are considering the judgement.\n\"We are sure that the footballing authorities in Scotland will wish to review this matter,\" said Celtic.\nIn 2013, Rangers were fined for breaking player registration rules.\nBut the SPL commission, headed by Lord Nimmo-Smith, resisted calls for Rangers to be stripped of titles won in the period of EBT use.\nThe judgement was made at a time when the scheme was deemed acceptable by a 2012 tax tribunal.\nAnother tribunal in 2014 also found in Rangers' favour, but the Court of Session ruled the other way after an appeal in 2015.\nOn Wednesday, the Supreme Court unanimously dismissed RFC's appeal and ruled in favour of HMRC.\nRangers won five league titles between 2001 and 2010, with Celtic runners-up on each occasion.\nThe statement from the current champions added: \"Celtic's position on this issue has been consistent - that this has always been a matter for the courts of law and also the Scottish football authorities, whose rules are intended to uphold sporting integrity.\n\"In 2013, we expressed surprise - shared by many observers and supporters of the game - over the findings of the SPL commission that no competitive or sporting advantage had resulted. Today's decision only reaffirms that view.\n\"We are sure now that the footballing authorities in Scotland will wish to review this matter. Celtic awaits the outcome of their review.\"\nFollowing the Supreme Court announcement, a spokesman for the Scottish Professional Football League, which was formed in June 2013, said: \"We will take time to examine the judgement in detail and to consider any implications for the SPFL.\"\nNimmo-Smith also fronted a tribunal for the SFA following Rangers' administration in 2012. That resulted in a fine and transfer embargo and a lifetime ban for former owner Craig Whyte.\nThe SFA's statement said there was a \"very limited chance\" of succeeding with a complaint relating to rule breaches after the Supreme Court's ruling in favour of HMRC.\nThe governing body added: \"Even if successful, any sanctions available to a judicial panel would also be limited in their scope.\n\"Accordingly, having had time to consider the opinion from senior counsel, and having examined the judgment of the UK Supreme Court, the board has determined that no further disciplinary action should be taken by the Scottish FA at this time.\"", "url": "https://www.bbc.com/sport/football/40510207"}