{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:43:42", "date_modify": "2025-05-20 14:43:42", "date_publish": "2023-07-28 11:39:27", "description": "Eric Dier is upset he \"didn't do more\" to help former Tottenham team-mate Dele Alli, who spent time in rehab because of a sleeping pill addiction and mental health issues.", "filename": "sport_football_66337962_1747752222.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/E50D/production/_130573685_gettyimages-1063181470.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66337962_1747752222.html", "title": "Dele Alli: Eric Dier upset he 'didn't do more' for ex-Tottenham team-mate", "title_page": "Dele Alli: Eric Dier upset he 'didn't do more' for ex-Tottenham team-mate - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Eric Dier is upset he \"didn't do more\" to help former Tottenham team-mate Dele Alli.\nDele, who is now at Everton, recently said he was \"molested\" aged six, started smoking aged seven and was dealing drugs at eight years old.\nHe also revealed he spent six weeks in rehab because of a sleeping pill addiction and mental health issues.\n\"Obviously, it was difficult to watch,\" Spurs defender Dier told various newspapers, external about Dele's interview.\n\"Lots of stuff, not everything, but quite a lot of it I knew already. I was with him just a week before, he was at my wedding.\n\"I don't know what to say about it. I don't want to say anything that I haven't said to him. I wouldn't do that. For me it was, as I said, it was difficult to watch, upsetting.\n\"I think my overwhelming feeling, which I said to him as well, is probably I'm upset that I didn't do more.\"\nDier, who was speaking during Tottenham's pre-season tour of Singapore, said he had not known about the abuse Dele said he had suffered as a child before being adopted aged 12.\n\"No, I wasn't aware of it. There were things that I was and wasn't aware of,\" said 29-year-old England international Dier.\n\"A long time ago I went to Milton Keynes with him and he showed me around where he grew up. He showed me everything so I was aware of the outline of the picture, the frame, but not the picture itself.\"\nDele made his senior football debut aged 16 for MK Dons in 2012 and, after signing for Tottenham in February 2015, was loaned back to the then-League One side for the rest of that season.\nHe then joined up with Spurs, who had brought in Dier in August 2014.\nBoth were part of the England squad that reached the semi-finals of the 2018 World Cup and helped Tottenham to the Champions League final in 2019.\nHowever, Dele's form dipped and he left Spurs to join Everton in February 2022 before going on loan to Turkish side Besiktas last season.\nThe 27-year-old, who earned the most recent of his 37 England caps in 2019, returned to Everton at the end of last season because of injury.\nIn his interview with Gary Neville on The Overlap, Dele described Dier as a \"great friend\" and someone who, along with Tottenham's Harry Kane, Son Heung-min and Ben Davies, \"will always hold a special place in my heart\".\n\"Dele has a heart of gold,\" added Dier. \"He really does. I'm upset with myself and disappointed with myself that I didn't do more.\n\"He's a great friend to me as well, it's not all one way. He's done many things over the course of time that mean a lot to me.\n\"He's someone that I know that I could call him right now if I needed him to be here in Singapore and he'd come. That's the kind of friend he is.\"", "url": "https://www.bbc.com/sport/football/66337962"}