{"authors": ["Ellie Thomason", "www.facebook.com"], "date_download": "2025-04-26 06:55:26", "date_modify": "2025-04-26 06:55:26", "date_publish": "2025-02-28 15:30:52", "description": "Liverpool interim boss Amber Whiteley said she will \"put my name in the hat\" for the permanent role after Matt Beard's departure.", "filename": "sport_football_articles_c20dd033e72o_1745650526.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9888/live/68d32710-f5e1-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c20dd033e72o_1745650526.html", "title": "Amber Whiteley: Interim boss wants Liverpool job permanently", "title_page": "Amber Whiteley: Interim boss wants Liverpool job permanently - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Liverpool interim boss Amber Whiteley said she will \"put my name in the hat\" for the permanent role after Matt Beard's departure.\nThe 47-year-old was sacked on Thursday, bringing to an end his second spell at the club.\nIt is Whiteley's second spell as interim boss, after previously taking charge of the club from January until the end of the season in 2021 following Vicky Jepson's departure.\nWhiteley expects to lead the team until at least the end of the season, but is keen to land the job on a full-time basis.\n\"I will put my name in the hat,\" she said. \"The recruitment process has already started.\n\"When these opportunities come about, you have to stand up and show exactly what you are capable of. It's really important to do that and to do that as a female coach too.\n\"There are always mixed emotions when a manager leaves a club. It's never an easy thing to go through.\"\nWhiteley, who recently took up an additional role as Carla Ward's assistant with the Republic of Ireland women's team, believes she is better prepared this time around.\nLast time, Liverpool were in the Championship and Whiteley helped the team to a third-place finish, winning five of her nine league games in charge.\n\"From the interim period previously the biggest thing I took away was that I was capable of doing the job,\" she said.\n\"I am in a far better position having had the time with Matt and working under him. I am in a better spot now in terms of being able to take the team forward.\n\"I'm so grateful to Matt for everything that he has given to me personally over the last three and a bit years. I'm going to miss him.\"\nLiverpool are seventh in the WSL with eight league games remaining and face Arsenal in the FA Cup quarter-finals next weekend.", "url": "https://www.bbc.co.uk/sport/football/articles/c20dd033e72o"}