{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:37:23", "date_modify": "2025-04-26 07:37:23", "date_publish": "2025-02-27 14:24:37", "description": "Racers Peter Hickman and Davey Todd confirm that they will form and co-own the new 8Ten Racing team which will compete in the British Superbike Championship, North West 200 and Isle of Man TT.", "filename": "sport_motorsport_articles_cd655n4e0zxo_1745653043.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8e30/live/1b16cf20-f516-11ef-a276-596f7e6218f8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_motorsport_articles_cd655n4e0zxo_1745653043.html", "title": "Hickman and Todd confirm new team for BSB and road racing", "title_page": "Hickman and Todd confirm new team for BSB and road racing - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "It has been confirmed that international road racers Peter Hickman and Davey Todd will form a new BMW-backed team for the British Superbike Championship, North West 200 and Isle of Man TT.\nHickman and Todd will jointly act as team co-owners of the 8TEN Racing team, whose name is an amalgamation of the riders' TT start numbers.\nHickman is a 14-time TT winner, while Todd broke his duck in terms of wins at the event in 2024 by taking the honours in the Superstock and Senior races.\nTodd is moving up to compete in the feature British Superbike class in 2025 after securing the second National Superstock title of his career in 2024.\nBoth riders had been scheduled to ride BMW bikes for FHO Racing in the forthcoming season but a change of plan will see them compete under a new banner but with the same German manufacturer.\nTodd commented: I'm really looking forward to this new chapter of my career, riding and co-owning 8TEN Racing. This structure will be a new dynamic to learn, but I've seen it work across other motorcycle championships like Supercross.\n\"I'm excited to be more involved in the dealings of the team, as well as building on the success I had with BMW last year which ended with a National title and TT victories.\"\nHickman said: \"The opportunity provided by BMW Motorrad UK to co-own and run 8TEN Racing alongside Davey is an exciting concept, and having run my own team across other classes, the insight and experience I have gained over the last few years should put us in good stead to be competitive.\n\"We know the M1000 RR very well which will allow some continuity, we'll be looking to continue our success on the roads and relish the challenge of being competitive in the British Superbike Championship.\"", "url": "https://www.bbc.co.uk/sport/motorsport/articles/cd655n4e0zxo"}