{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:05:35", "date_modify": "2025-05-21 06:05:35", "date_publish": "2025-01-14 09:34:17", "description": "Nottingham Forest vs Liverpool: 'If Forest beat Reds they are title contenders'", "filename": "sport_football_articles_c805l1p9p0ro_1747807535.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8aa9/live/ecf8edb0-d253-11ef-afca-fd8d41ed4ae1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c805l1p9p0ro_1747807535.html", "title": "Nottingham Forest vs Liverpool: 'If Forest beat Reds they are title contenders'", "title_page": "Nottingham Forest vs Liverpool: 'If Forest beat Reds they are title contenders' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "\"If Nottingham Forest beat Liverpool, Arsenal are favourites for the title again and Forest are contenders to win it as well.\"\nThat is the view of The New York Times' chief soccer correspondent Rory Smith, previewing Tuesday's showdown between first and third in the Premier League.\n\"Forest have been extraordinary this season - they are the story of the season by some distance\", he told BBC Radio 5 Live's Monday Night Club.\n\"What Forest have done is astonishing. I think Liverpool being top is less of a surprise than Forest being third.\n\"They are both good stories and I didn't think Liverpool would be six points clear at the top, but given Forest finished 17th last season and Liverpool were in a title race until mid-April it is a bigger story.\n\"Liverpool have been much further along than anyone anticipated but Forest have been extraordinary.\n\"It feels like one of those seasons where Manchester City have had their slump, Manchester United are a work in progress, Chelsea have fallen away and Arsenal haven't won for five days so are in crisis!\n\"Liverpool have in the past couple of weeks started to look a little bit less smooth than they have at certain points.\n\"The last time that happened was the year Leicester won the league. It is possible, but very unlikely, and if Forest were to win - which is more than feasible - they would be three points behind having played a game less.\n\"If Forest win it would be ridiculous to talk about a team level on points with Arsenal and say they can't win it.\n\"It is possible Nottingham Forest could go all the way.\"", "url": "https://www.bbc.com/sport/football/articles/c805l1p9p0ro"}