{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:53:11", "date_modify": "2025-05-20 13:53:11", "date_publish": "2023-07-31 16:17:16", "description": "Wolves & Luton Town: Can Ryan Giles follow Morgan Gibbs-White?", "filename": "sport_articles_cw0wwk9wjeko_1747749191.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6a73/live/3af7a660-2fa2-11ee-b8f2-3fb6817a459c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cw0wwk9wjeko_1747749191.html", "title": "Wolves & Luton Town: Can Ryan Giles follow Morgan Gibbs-White?", "title_page": "Wolves & Luton Town: Can Ryan Giles follow Morgan Gibbs-White? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Joe Bradshaw, BBC Sport\nLast season, Wolves allowed an academy graduate who had never quite secured his place in their first team to move to a newly-promoted Premier League side.\nTen months later, Morgan Gibbs-White was on the fringe of the England set-up.\nFor Ryan Giles, it's a stellar trajectory - but Luton boss Rob Edwards will hope the player he coached at under-23 level in the West Midlands can make the step up.\nIt is not a surprise Giles has nabbed himself a move to the top flight. Twenty one assists across the past two seasons in the Championship is eyebrow-raising; not least when it comes from left-back.\nAlbeit the 23-year-old is far from your average left-back. Much more suited to playing left wing-back or even left midfield, Giles has terrorised second-tier defences in the shirts of Cardiff and Middlesbrough in the 2020-21 and 2021-22 season.\nLuton fans felt his quality up close in the first game back after the World Cup last season. One touch out of his feet, pinpoint cross and Chuba Akpom headed home a Boro equaliser.\nBoasting a quicksilver turn of pace, Giles loves to shift it down the line and back himself in a foot race against his full-back.\nNaturally, Premier League defences are quicker and he may need to show a bit more variety to truly thrive. Give him a yard of space though and his crosses will cause carnage.\nUnlike with Gibbs-White, Wolves have included a buy-back clause in the Giles deal. Perhaps they have learned their lesson.", "url": "https://www.bbc.com/sport/articles/cw0wwk9wjeko"}