{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:19:22", "date_modify": "2025-05-21 04:19:22", "date_publish": "2025-04-05 16:06:15", "description": "Truro City go top of the National League South after winning 2-1 at former league leaders Worthing.", "filename": "sport_football_articles_cx20nwzdz8no_1747801162.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/57c4/live/f7e2b850-1236-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cx20nwzdz8no_1747801162.html", "title": "Truro City go top of National League South after 2-1 Worthing win", "title_page": "Truro City go top of National League South after 2-1 Worthing win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Truro City went top of National League South after winning 2-1 at former leaders Worthing.\nThe victory sees the Tinners go above Worthing on goal difference, with both sides on 80 points with four games to play.\nDorking Wanderers are third, two points behind, after conceding a late goal in a 1-1 draw at St Albans City.\nWill Dean gave Truro the perfect start as he fired home after Worthing failed to deal with Christian Oxlade-Chamberlain's third-minute long throw.\nJaze Kabia had a second goal disallowed a minute later for offside, before Nick Wheeler struck the Truro bar in the eighth minute.\nDan Lavercombe did well to stop chances from Worthing's Temi Babalola before the Tinners keeper brought the forward down at the end of the first half and Danny Cashman converted the resulting penalty.\nBut Truro retook the lead midway through the second half as Yassine En-Neyah flicked the ball forward and Luke Jephcott got in behind the defence and fired in his fifth goal since joining City on loan.\nTruro held on despite Worthing pressure, as Jack Spong saw a header land on the roof of the net while Lavercombe pulled off a superb 90th-minute save to deny Babalola a second equaliser.\n\"It was vital that we got a result today to stay in it,\" Truro City manager Joh Askey told BBC Radio Cornwall.\n\"They've worked really hard, the players, again today and you can't ask any more of them.\n\"It was a dubious decision that gave them a goal, I thought we were up against it with the refereeing today and we've gone and pulled it out of the bag.\n\"Results have gone for us as well, so it couldn't have ended up a better day.\"", "url": "https://www.bbc.com/sport/football/articles/cx20nwzdz8no"}