{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:20:48", "date_modify": "2025-05-21 06:20:48", "date_publish": "2025-03-31 15:57:43", "description": "Norwegian athletics coach Gjert Ingebrigtsen tells a court he \"loves\" his children and was just an \"overly protective\" father as he denies abuse allegations.", "filename": "sport_athletics_articles_c4g4qzw6204o_1747808448.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ea8e/live/dfb17780-0e44-11f0-bfea-d170975f1d6a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_athletics_articles_c4g4qzw6204o_1747808448.html", "title": "Jakob Ingebrigtsen: Norwegian athletics coach Gjert tells court he is 'overly protective father', denies abuse", "title_page": "Jakob Ingebrigtsen: Norwegian athletics coach Gjert tells court he is 'overly protective father', denies abuse - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Norwegian athletics coach Gjert Ingebrigtsen told a court on Monday he \"loves\" his children and was just an \"overly protective\" father as he denied abuse allegations.\nIngebrigtsen, 59, is on trial in Norway accused of physically and mentally abusing his 24-year-old son Jakob and another of his children.\nDouble Olympic champion Jakob said when giving evidence last week that his father \"manipulated\" and \"controlled\" him throughout his upbringing and detailed a series of alleged incidents.\nGjert addressed the court at the criminal case in Sandnes in his own defence. He said he had tried to shield all seven of his children, two more of whom also became successful athletes.\n\"I became a father very early, with an enormous need to protect. I became what one might call overly protective,\" Gjert was quoted as saying in court by Norwegian state broadcaster NRK.\n\"Highlighting relevant incidents in relation to the charges may make it seem like I am being portrayed negatively towards my children. But I love my children immensely.\"\nGjert Ingebrigtsen told the court the ambition of some of his children had been \"absolutely extreme\" when they started to participate in sports.\n\"I never heard 'could you please', but rather entirely different demands and expectations,\" Gjert said.\n\"The demands from the children were about district level, national level, European level, and world level. Later, 'Dad' became 'Gjert', and 'Gjert' became 'the accused'.\"\nIt was alleged in court last week that Gjert struck Jakob several times after he received a negative report about his behaviour from school when he was aged eight.\nJakob also said that in 2008, when he was about the same age, his father hit him in the face because he was late for a race.\nHe described another incident a year later when he alleged Gjert kicked him in the stomach after he fell off a scooter.\nJakob also alleged his father threatened him in 2016, and another episode around the same time when Gjert was said to have thrown his games console out of the window.", "url": "https://www.bbc.com/sport/athletics/articles/c4g4qzw6204o"}