{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:14:14", "date_modify": "2025-05-20 14:14:14", "date_publish": "2023-07-29 20:26:32", "description": "St Johnstone cup defeat 'hard to swallow' - Considine", "filename": "sport_articles_c9xj9gw1267o_1747750454.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3df5/live/e761c2c0-2e4c-11ee-b485-4f3a43a1bd20.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c9xj9gw1267o_1747750454.html", "title": "St Johnstone cup defeat 'hard to swallow' - Considine", "title_page": "St Johnstone cup defeat 'hard to swallow' - Considine - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Andrew Considine was critical of \"slow, pedestrian\" St Johnstone following a 4-0 humbling at home by Stirling Albion.\nAlready out of the running in the Viaplay Cup after defeats to Stenhousemuir and Ayr United, the Perth side once again slipped up against lower league opposition.\n\"It's a really hard one to swallow,\" veteran defender Considine told SaintsTV. \"From the start of the game, we didn't look at it.\n\"We were slow, pedestrian. They didn't have to do anything special to get ahead. All four goals were extremely poor.\n\"Looking at the bigger picture, we should be topping that group. It's simply not good enough.\"\nSt Johnstone begin their Premiership campaign at home to Hearts next Saturday and Considine is calling for a major shift in application.\n\"Individually and collectively, we need to lift our standards when it comes to training and we can take that into games,\" he said. \"I feel, as a group, we haven't reached the standards that the manager set in the last six games of last season.\n\"I know were are missing boys through injury but when you pull on the jersey and cross the line there is a personal pride in you and you want to do well for yourself and your team-mates. There was certainly not enough of that.\"", "url": "https://www.bbc.com/sport/articles/c9xj9gw1267o"}