{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:39:53", "date_modify": "2025-05-21 05:39:53", "date_publish": "2025-04-06 00:00:00", "description": "Liverpool's 26-match unbeaten run in the Premier League comes to an end as Fulham beat them at Craven Cottage.", "filename": "sport_football_live_cr4nxgnexk5t_1747805993.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ee7b/live/645517a0-12ee-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cr4nxgnexk5t_1747805993.html", "title": "Fulham 3-2 Liverpool: Visitors 26-match unbeaten run ended at Craven Cottage", "title_page": "Fulham 3-2 Liverpool: Visitors 26-match unbeaten run ended at Craven Cottage - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Liverpool's 26-match unbeaten run in the Premier League came to an end as Fulham beat them at Craven Cottage.\nArne Slot's side had gone ahead through Alexis Mac Allister's superb 25-yard strike but three Fulham goals in 13 minutes turned the game on its head before half-time.\nRyan Sessegnon equalised with a smart first-time finish after Andreas Pereira's cross fell kindly for him in the box.\nAlex Iwobi put Marco Silva's side ahead nine minutes later as he collected Liverpool full-back Andy Robertson's poor cross-field ball on the edge of the box and, after his initial shot was blocked, his second flew in via a deflection off the Scotland captain.\nThe third came when a Fulham corner was only cleared to the edge of the box, Iwobi made of a mess of his attempt to put it back into the middle but Rodrigo Muniz kept it alive.\nA brilliant touch around the corner put him through on goal and the Brazilian striker finished calmly under Liverpool goalkeeper Caoimhin Kelleher.\nLuis Diaz pulled one back for the visitors in the 72nd minute, stabbing into the bottom corner from fellow substitute Conor Bradley's pass, but Liverpool were unable to force an equaliser.\nIt was another substitute, Harvey Elliott, who came closest to drawing the league leaders level but his curling effort bounced back off the bar.\nElliott and Federico Chiesa had half chances in stoppage time but neither unduly troubled Bernd Leno in the Fulham goal.\nLiverpool stay 11 points clear at the top with seven games remaining and need a maximum of 11 more points to secure a record-equalling 20th league title.\nMeanwhile, victory boosts Fulham's chances of European qualification as they move up to eighth, five points behind Chelsea in fourth.\nIn the grand scheme of things, this result is highly unlikely to affect Liverpool's final league position.\nFour wins from their last seven games will be enough to make the Reds champions but this was a reminder that - cliched as it may be - no victory comes easily in the Premier League.\nThere were second-best in the first half in west London with Mac Allister's fine goal coming slightly against the run of play after a strong start by Fulham.\nLiverpool's sloppiness was exemplified by Ibrahima Konate getting caught on the ball inside his own penalty inside the first 10 minutes.\nThat mistake did not lead to a goal but the away side will feel they could have done better for all three Fulham goals.\nCurtis Jones failed to clear Pereira's cross for the first, Robertson gifted the hosts the ball for the second and Virgil van Dijk lost out in a duel with Muniz for the third.\nIt was a different Liverpool side after the break with more urgency and intent in possession and carrying far more of a threat even with Fulham sitting deep.\nHad Diogo Jota been able to beat Leno when put through by Mohamed Salah early in the second half, it might have been a different story but, ultimately Liverpool left themselves too much to do.\nOf course, there is no need to panic, as they remain of the cusp of a second league title in five years.\nBut this was a reminder that, even at this stage, such things are not just handed out - you have to go out and win them.\nEight days on from a bruising home defeat by Crystal Palace that ended their dreams of FA Cup glory, Fulham produced a display that ensures there is still much to excite the fans before the end of the season.\nWith seven games left, they remain in the fight for Champions League places, especially given fifth is likely to be enough to qualify.\nUnlikely as that may have been at the start of the season, it should come as no shock to anyone who witnessed the first 45 minutes against Liverpool.\nOut of possession, they hassled and harried the would-be champions, pressing from the front, cutting off the passing line and preventing the visitors from playing through them.\nTime and again they won the ball back in the Liverpool half or around the halfway line and once they had it, they used it smartly.\nHaving worked so hard to get the ball, they had no desire to give it away cheaply.\nWith Muniz battling manfully to occupy both Konate and Van Dijk, those behind him probed to find the openings.\nThere is no doubt Fulham were helped by some Liverpool errors, but the build-up to the first goal was a prime example of the flowing football they're capable of, while their resilience shone through in the second.\nWith games in hand for Newcastle and Manchester City, the Champions League remains a long shot but if they can match their showing against Liverpool between now and the end of May, anything is possible.\nShould it come to it, a place in the Europa League or the Conference League is not a bad consolation.", "url": "https://www.bbc.com/sport/football/live/cr4nxgnexk5t"}