{"authors": ["Sam Drury", "www.facebook.com"], "date_download": "2025-05-21 04:27:30", "date_modify": "2025-05-21 04:27:30", "date_publish": "2025-01-05 17:43:27", "description": "Analysis: Fulham 2-2 Ipswich", "filename": "sport_football_articles_crk0yz3evpeo_1747801650.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8b22/live/74d101a0-cb88-11ef-9034-23bbe4015130.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_crk0yz3evpeo_1747801650.html", "title": "Analysis: Fulham 2-2 Ipswich", "title_page": "Analysis: Fulham 2-2 Ipswich - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ipswich may have ended up having to settle for one point rather than three but this was another encouraging display.\nDespite allowing Fulham almost 73% possession, they restricted the home side to very few chances in open play.\nThey defended resolutely and when the opportunity to counter-attack presented itself, there was no hesitation in getting numbers forward to support Liam Delap.\nSammie Szmodics' opener was a prime example of that with wing-back Ben Johnson advanced enough to ghost in at the far post and head Nathan Broadhead's cross onto the bar in the lead up.\nDelap was a handful throughout and Broadhead also came close to doubling Ipswich's lead before the first of Raul Jimenez's two penalties for Fulham.\nThe manner in which Ipswich responded to the the first of those two spot kicks could not have been better.\nThey were quickly on the front foot to win a penalty of their own, which Delap buried.\nNot managing to hold onto to take all three points will undoubtedly frustrate Ipswich and closing out such matches could prove crucial if they are to stay up.\nBut equally, so too could hard-fought points on the road. Especially if they can maintain the performance level shown in their last two games.", "url": "https://www.bbc.com/sport/football/articles/crk0yz3evpeo"}