{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:15:47", "date_modify": "2025-05-20 12:15:47", "date_publish": "2023-08-04 15:48:45", "description": "Watford head coach Valerien Ismael says he does not feel under extra pressure despite the club's record of sacking his predecessors.", "filename": "sport_football_66406813_1747743347.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5DC6/production/_130660042_shutterstock_editorial_14018276e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66406813_1747743347.html", "title": "Valerien Ismael: No extra pressure because of Watford coaches turnover", "title_page": "Valerien Ismael: No extra pressure because of Watford coaches turnover - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Watford head coach Valerien Ismael says he does not feel under extra pressure to succeed despite the club's record of sacking his predecessors.\nThe Hornets have had three different people in charge in both of the last two seasons.\nAnd former Besiktas boss Ismael is their 10th head coach since 2018.\n\"I have no more pressure than normal. Last season, everywhere around the world in the big leagues, they change a lot [of] the managers,\" he said.\n\"I think the pressure is not only on Watford, but everywhere. I am still confident here, I am exactly where I want to be and the work with the board, with the squad, with the people who run the club is excellent so far.\"\nWatford, who were relegated from the Premier League in 2022 and finished 11th last term, start the new Championship campaign at home to Queens Park Rangers and will be without two of their best players, Joao Pedro and Ismaila Sarr, who have both left the club.\n\"We are satisfied with our squad, all the players outgoing was a clear decision from us with the board,\" said Ismael, who was appointed at the end of May.\n\"We knew we needed to change a lot but we still have good quality in the squad and the pre-season was good. The players have improved, week in, week out and now everyone feels we are ready to compete.\"\nIsmael guided Barnsley to the Championship play-offs in 2021, but his subsequent spell in charge at West Brom was brief.\nDespite that, he does not see the job at Watford as a case of restoring his reputation in English football.\n\"If you see my statistics at West Brom, it was not that bad,\" he told BBC Three Counties Radio.\n\"From my point of view, it was a good job [I did] because you see what happened after I left and now it's all about being focused with Watford, to make sure that we start well and continue to improve.\n\"It's a long run, the Championship, but we are all on the same page, from the board to the players. Everyone was willing to change and the board gave me the feeling that I am the right manager for the club and that this club is the right one for me.\"\nElsewhere, Watford forward Jorge Cabezas Hurtado has joined Major League Soccer side New York Red Bulls on a six-month loan.\nThe 19-year-old Colombian has yet to make a first-team appearance for The Hornets.", "url": "https://www.bbc.com/sport/football/66406813"}