{"authors": ["Michael Short", "www.facebook.com"], "date_download": "2025-05-21 03:40:58", "date_modify": "2025-05-21 03:40:58", "date_publish": "2025-04-06 21:34:54", "description": "World number four Jessica Pegula mounts a huge second-set comeback to beat Sofia Kenin 6-3 7-5 and land her first clay-court title at the Charleston Open.", "filename": "sport_tennis_articles_cvg9e5dpky4o_1747798858.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/261f/live/c468f660-132b-11f0-a4be-07438a3933cb.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_tennis_articles_cvg9e5dpky4o_1747798858.html", "title": "Charleston Open: Jessica Pegula wins title", "title_page": "Charleston Open: Jessica Pegula wins title - Jenson Brooksby triumphs in Houston - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "World number four Jessica Pegula mounted a superb second-set fightback as she beat Sofia Kenin 6-3 7-5 to land her first clay-court title at the Charleston Open.\nIn what was the first all-American final at the tournament since 1990, the 31-year-old Pegula took charge initially, breaking Kenin in the opening game on her way to going a set ahead.\nBut 2020 Australian Open champion Kenin, 26, fought back to lead the second set 5-1 and appeared poised to take the match to a decider.\nHowever, top seed Pegula saved three set points and won six games in a row to seal victory against an opponent 40 places below her in the world rankings.\nThe success, coming a week after her Miami Open final loss to Aryna Sabalenka, was the eighth title of Pegula's career and second of the year after victory in Austin last month.\n\"To be able to come here this week after a long two weeks in Miami and take the title is just incredible,\" said Pegula, who will climb to number three in the rankings.\nThe 31-year-old told the Tennis Channel she felt tired in the second set in what were \"super windy\" conditions.\n\"In the second set, I just wanted to hold, I just wanted to tell myself to get momentum for the third, because coming into a third like that never feels good,\" she added.\n\"I honestly didn't think I was going to break her twice, but luckily I could play some good tennis.\"\nCompatriot Jenson Brooksby clinched his first ATP title at the US Men's Clay Court Championships in Houston.\nThe 24-year-old, who entered the tournament as a qualifying wild card, stunned the second seed and 2023 champion Frances Tiafoe 6-4 6-2.\nBrooksby, ranked a lowly 507th to Tiafoe's 17th on the ATP list, has returned to the tour this season after serving a 13-month ban for three doping test 'whereabouts' failures in a 12-month period.\nHe has a career-high ranking of 33rd and was voted the ATP Newcomer of the Year in 2021.", "url": "https://www.bbc.com/sport/tennis/articles/cvg9e5dpky4o"}