{"authors": ["Alex Pewter", "www.facebook.com"], "date_download": "2025-05-21 06:01:16", "date_modify": "2025-05-21 06:01:16", "date_publish": "2025-01-14 08:13:36", "description": "Crystal Palace news: Opinion - Will Romain Esse be an attacking spark?", "filename": "sport_football_articles_c5y232l2g5po_1747807276.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e6b0/live/3752ed40-b629-11ee-bc2f-cb5579b90709.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c5y232l2g5po_1747807276.html", "title": "Crystal Palace news: Opinion", "title_page": "Crystal Palace news: Opinion - Will Romain Esse be an attacking spark? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It appears that illness was mainly in the air at Copers Cope this week rather than the magic of the cup, giving manager Oliver Glasner a fresh challenge in preparing for Saturday's FA Cup game.\nHis side survived a relatively tepid 1-0 affair against Stockport County in the third round and have now secured a tie against Doncaster Rovers – the 'Rob Street' derby for those who know.\nOf course, the Premier League is unwilling to give the world's leading and historic domestic cup competition any breathing room in the schedule, which means Palace face a pair of league games in four days against two struggling sides, Leicester and West Ham.\nWhile those matches may offer large league ramifications, we are reminded that we are already at the mid-point in the transfer window, another plate that teams must keep spinning during January against the backdrop of games.\nOne player is on the immediate horizon for Palace, with 19-year-old winger Romain Esse the likely acquisition from Millwall. He will be a much-needed reinforcement in a position of need, even if that may come with added pressure to be the one that sparks life into an often one-dimensional attack.\nGlasner had been hoping that any attacking incoming transfer would also be joined by a returning Matheus Franca from injury, perhaps a 'new signing' in the cliched football sense, if not factual. The young Brazilian has not featured in a Palace squad since Glasner's second game in charge back at the start of March 2023.\nRepeated injuries have raised red flags about his future, and with no expectation he will be with the team until the spring, this is the next in a series of disappointing setbacks for the former Flamengo player.", "url": "https://www.bbc.com/sport/football/articles/c5y232l2g5po"}