{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:24:33", "date_modify": "2025-05-21 05:24:33", "date_publish": "2025-01-14 16:48:32", "description": "Liverpool news: Fan views on Darwin Nunez and Jayden Danns", "filename": "sport_football_articles_c1dgp2ker03o_1747805073.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ee5a/live/64920500-d281-11ef-9fd6-0be88a764111.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c1dgp2ker03o_1747805073.html", "title": "Liverpool news: Fan views on Darwin Nunez and Jayden Danns", "title_page": "Liverpool news: Fan views on Darwin Nunez and Jayden Danns - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your views on has Jayden Danns done enough to deserve selection ahead of Darwin Nunez?\nHere are some of your comments:\nBryan: Nunez has had plenty of opportunities at Liverpool. It is clear to everybody that he isn't a natural finisher, and adds very little to the team apart from his energetic style. He is becoming a liability. Fortunately for Liverpool, the misses he has had haven't mattered, but at some point they will. Danns took his chance, and should be back-up to the front four of Cody Gakpo, Luis Diaz, Diogo Jota and Mohamed Salah.\nIain: While Nunez is a Liverpool player he should be used but only for specific parts of games - unless he suddenly finds better form. Younger players need to be managed carefully and not overused but built up over time. Plenty of room for both to play.\nGed: Danns looks the part - he seems to have the striker's knack to be in the right place, plus the coolness to finish. Liverpool have been very patient with Nunez. However, he now needs to step to one side for Danns.\nIan: As much as I like the idea Nunez will turn out good, it is not going to happen for him at Anfield. We don't play the type of football that suits his game. We need a proper number nine to complement the rest of our attacking options. Jota can't play in every game and any pressure that is taken from Salah's shoulders has to be a good thing.\nAl: I'm a massive Nunez fan but I really don't think we can afford to keep playing him. His confidence is shot - even Danns looks a better bet. Need to send him out on loan maybe or cash in.", "url": "https://www.bbc.com/sport/football/articles/c1dgp2ker03o"}