{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:02:45", "date_modify": "2025-04-26 07:02:45", "date_publish": "2025-02-28 00:00:00", "description": "Afghanistan face Australia in the Champions in Lahore - follow live cricket scores, text updates, in-play video clips and radio commentary", "filename": "sport_cricket_live_cgrnp2wwzdyt_1745650965.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8fe6/live/487bea40-f5de-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_cricket_live_cgrnp2wwzdyt_1745650965.html", "title": "Relive Australia advancing to Champions League semi-finals despite washout against Afghanistan", "title_page": "Relive Australia advancing to Champions League semi-finals despite washout against Afghanistan - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Goodbye\nWell, thanks for sticking with us throughout a frustrating afternoon.\nWe will be back tomorrow for England's final group game - and Jos Buttler's final outing as white-ball captain - against South Africa at 9:00 GMT.\nYou can read more about Buttler's resignation from my colleague Matt Henry out in Pakistan, and also Timothy Abraham's match report from today's rain-affected encounter.\nWe look forward to your company again tomorrow - bye for now!\n'Hopefully England win big' - Hashmatullah\nAfghanistan captain Hashmatullah Shahidi: \"It's unfortunate. It was a good game and just because of the rain, nothing happens.\n\"I think we should've scored 300+ but they bowled really well, especially in the middle overs. 270 was good on this wicket but we didn't start well when it came to bowling. We gave too much width for them and too many hitting options. Hopefully, we will learn from this.\"\nOn Sediqullah Atal: \"He played really well. The first two games he didn't play the way we expected from him but his comeback was good. It's his first ICC event and he played really well under pressure. He's a talented guy.\"\nOn Azmatullah Omarzai: \"He's a top-class player. He always performs for us. Against England, he got five wickets and scored 40 quick runs. Today, he played with positive intent. Hopefully, he can carry on.\"\nOn Afghanistan's semi-final hopes: \"You never know! We still have hopes and hopefully England win big!\"\n'It's a different beast when you get to the finals'\nAustralian captain Steve Smith: \"I thought our guys did a good job.\n\"There were different changes - we tried to keep things simple, and tried to take wickets throughout the middle order. I thought the guys did a good job to restrict them to 270.\"\nOn extras: \"There were a few. Spencer [Johnson] was getting a few balls to swing after the bat today.\n\"Look, the guys did a good job. We created a few opportunities early on.\n\"We could have had a few more wickets up top. It was a good performance and shame we got washed out at the end.\"\nOn Matthew Short's injury: \"I think he'll be struggling. He wasn't moving very well and it is probably going to be too quick between games for him to recover.\"\nOn Travis Head's batting: \"He batted nicely. He hit the middle of the bat consistently. When he's going like that he's as good as anyone in the world.\n\"I think the guys have done a good job. The first objective was to get to the semi-finals.\n\"It's a different beast when you get to the finals.\"\nAfghanistan 'ran out of answers'\nMichael Carberry\nFormer England batter on BBC Radio 5 Sports Extra\nWith the bat Afghanistan got into block or slog mode. They seemed to lose their intent.\nWith the ball all the reliance was put on Fazalhaq Farooqi to swing the ball and Travis Head got after him.\nThey almost ran out of answers. It's part of their development and the more they play the better they'll get.\nPost\nRyan Campbell\nFormer Australia wicketkeeper on BBC Radio 5 Sports Extra\nWe never want to see contests end because of the weather, but at the end of the day it's cut-throat.\nI guess what Afghanistan have to take away from this tournament is they beat England.\nThat's their benchmark now. If they do that, more often than not, we will see Afghanistan popping up in a lot of big tournaments.", "url": "https://www.bbc.co.uk/sport/cricket/live/cgrnp2wwzdyt"}