{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:40:43", "date_modify": "2025-05-20 11:40:43", "date_publish": "2023-08-06 18:17:24", "description": "Cardiff City manager Erol Bulut says he would like to make two or three more signings before the transfer window shuts on 1 September.", "filename": "sport_football_66423112_1747741243.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/11AF/production/_130672540_cdf_060823_leeds_v_cardiff_27.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66423112_1747741243.html", "title": "Erol Bulut: Cardiff City boss wants 'two or three' more signings", "title_page": "Erol Bulut: Cardiff City boss wants 'two or three' more signings - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cardiff City manager Erol Bulut says he would like to make two or three more signings before the transfer window shuts on 1 September.\nSince taking charge in June, Bulut has made six signings, all free or loan moves because a transfer embargo means Cardiff cannot pay fees for players.\nThe Bluebirds started the season with a 2-2 draw at Leeds United on Sunday.\nCardiff face Colchester in the Carabao Cup on Wednesday and Bulut believes new signings could come in before then.\n\"Before the League Cup game, there can be [new players]. Not only one I think,\" he said.\nAsked how many players he would like to add to his squad before the window shuts, the former Fenerbahce boss said: \"Two or three.\"\nCardiff made an encouraging start to Bulut's reign in their Championship season opener against Leeds on Sunday, going 2-0 up at Elland Road before succumbing to an added-time equaliser.\nThe Bluebirds' goals came from two of their new signings, Josh Bowler and Ike Ugbo.\nKarlan Grant, Yakou Meite and Dimitrios Goutas also made their first appearances for the club, while Wales captain Aaron Ramsey made his third Cardiff debut.\nOther than squandering their 2-0 lead, the other main negative for Cardiff was losing captain Joe Ralls to a first-half injury.\n\"He had something with the abductor or hip. It was painful so that's why we changed him,\" said Bulut.\n\"When he has a scan, we will know more about the injury. I hope it is not serious.\"", "url": "https://www.bbc.com/sport/football/66423112"}