{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:18:59", "date_modify": "2025-05-19 15:18:59", "date_publish": "2015-02-13 15:02:28", "description": "The African division of global players' union FIFPro says Moroccan players are being made to \"pay a heavy price\".", "filename": "sport_football_31454750_1747667939.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/80993000/jpg/_80993671_160202549.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31454750_1747667939.html", "title": "FIFPro hits out at Morocco sanctions", "title_page": "FIFPro hits out at Morocco sanctions - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The African division of global players' union FIFPro has criticised Caf for their treatment of Morocco.\nMorocco has been banned from the next two Nations Cup tournaments for refusing to host this year's event.\nThe Atlas Lions were also kicked out of the 2015 edition when being replaced as hosts by Equatorial Guinea.\nMorocco were fined $1m and ordered to pay $9 million in compensation for pulling out at the last minute due to fears over the spread of Ebola.\nBut FIFPro said Moroccan players have been unfairly made to pay the price.\n\"It's not up to the African division of FIFPro to know whether Morocco acted within its rights in refusing to organise the last CAN,\" said a FIFPro statement.\n\"However, it is our place to express surprise that the Caf sanctions target first of all the players.\n\"Preventing a country from competing at three successive African Cup of Nations (2015, 2017 and 2019) is to sacrifice an entire generation of players, preventing them from expressing themselves on the highest international stage and preventing them from taking part in an important element of their job as a professional footballer.\nFIFPro said they favoured financial sanctions against the Moroccan FA or indeed a ban against hosting events for a certain period of time, rather than kicking the team out of those competitions.\nFIFPro added that it was \"astonished that the penalties imposed by the CAF should be directed above all and directly against the players.\"\n\"Why pick on the players in this way... making them pay, and such a heavy price, for the errors imputed to their executives?\"\nEarlier this week, the Moroccan federation rejected the sanctions, saying that \"the decisions taken by the executive committee of Caf are against the development of African football, and not based on any statutory basis.\"", "url": "https://www.bbc.com/sport/football/31454750"}