{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:38:03", "date_modify": "2025-05-21 07:38:03", "date_publish": "2024-12-23 00:00:00", "description": "Rob Cross, Dave Chisnall and Gian van Veen all suffer second-round exits at the World Darts Championship.", "filename": "sport_darts_live_cy53l6w5pv3t_1747813083.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_darts_live_cy53l6w5pv3t_1747813083.html", "title": "Relive day nine as Rob Cross, David Chisnall & Gian van Veen suffer second-round exits", "title_page": "Relive day nine as Rob Cross, David Chisnall & Gian van Veen suffer second-round exits - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "That's all from us\nA massive thank you to everyone who has stayed with us today and throughout the first nine days of the 2025 PDC World Darts Championship.\nThat's all from us for today. You can read about the day in full via Callum Matthews and Jonty Colman's report in full here.\nWe will be back on Friday for the start of the third round. Defending champion Luke Humphries is in action in the evening, while we have to wait until Saturday to see Luke Littler again.\nIf you do celebrate, have a very Merry Christmas.\nGoodbye!\nPost\nWe have some news just reaching us on the schedule for the third round after Christmas.\nWe now know that Luke Humphries will play his third-round match on Friday, 27 December and both Luke Littler and Michael van Gerwen will play on Saturday, 28 December.\nBefore we bring you that, let's look who will face who...\nIs darts a sport?\nIf you're reading this, our guess is you probably think it is - and while opinion differs, you'd be right.\nDarts has been officially recognised as a sport by all of the sports councils in the United Kingdom.\nSport England recognised darts as a sporting activity in March 2005 and Sport Wales, Sport Northern Ireland and Sport Scotland followed suit.\nHit the thumbs if you agree, or disagree.\nWhat height should a dartboard be?\nHere's a question a few of you have asked, so we consulted the official rules.\nStandard height from the floor to the bullseye on the dartboard is 5 feet 8 inches (1.72 metres), while the oche (distance between the front of the board and the toeline) should measure 7ft 9.25 ins.\nThat's a fair old way when you're under pressure.\nWilliams knocks Cross out of Worlds\nResult: Cross 1-3 Williams\nRob Cross has to hold his throw to stay in the match and the leg could not go any worse for him.\nScott WIlliams starts with a 180. He responds with a second 180. He's on a nine!\nIt ends for Shaggy after six darts, but after nine, both have a finish.\nCross can't land 170 and Williams, needing 80, went for tops, tops and missed both out of the board scoring 20. An awful decision.\nVoltage misses two at double eight and Williams comes back to pin double 20, following his error and takes the match.\nAnother former world champion is out!\nWilliams moves a leg away from victory\nCross 1-2 Williams (2-2)\nThis match is improving from both men as they trade two-treble visits.\nScott Williams will get three darts at a 120 out to level the set. Rob Cross waits on 126.\nShaggy hits 96 to leave double 12 and he will get invited back.\nWilliams pins double six after halving 24. He is one leg away from victory.\nCross takes fourth-set opener\nCross 1-2 Williams (1-0)\nTo sum up this meeting between former world champion Rob Cross and last year's semi-finalist Scott Williams, both men have failed to average 90 in a single set between them.\nShaggy has the big fish to break Cross. Treble 20 and treble 20 leave bull, which is just missed.\nCross takes double 20 for a 60 out for the leg.\nWilliams wins third set to lead Cross\nCross 1-2 Williams\nScott Williams gets a healthy lead as he looks to break Rob Cross to win this third set.\nA 140 from Shaggy sets up six darts at 90 for the set as Voltage continues to struggle.\nThe first three darts leave double 20 and the second three are all missed doubles across tops and the 10s.\nTreble 20 and 20 leave a dart at double 18 for Cross, which he misses.\nWilliams pins the 10s for the third set.\nWilliams leads match\nCross 1-1 Williams (1-2)\nIf Ricky Evans' 3-2 win over Dave Chisnall was the match of the tournament so far, this has been anything but.\nScott Williams can take the leg on 65 but splits double six to invite Rob Cross back 80.\n20, 20, 20. On we go.\nWilliams takes double three for a hold of throw.\nLevel match as Williams breaks back\nCross 1-1 Williams (1-1)\nScott Williams is the first down to a finish on 136, with Rob Cross waiting to go next on 125.\nWilliams cuts it down by less than half and on 125, Cross leaves 32.\nShaggy has 78 and puts the double 20 chance too low.\nCross needs double 16 and of three drats puts two low and one high.\nWilliams breaks back on double 10.\nCross breaks Williams with 130 finish\nCross 1-1 Williams (1-0)\nScott Williams starts the third set with the darts and does get down to a finish first, requiring 87 to take the leg.\nHe can't get it to go and needing 130, Rob Cross pins bull for a break of throw.\nDespite that, Voltage isn't looking happy.", "url": "https://www.bbc.com/sport/darts/live/cy53l6w5pv3t"}