{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:23:15", "date_modify": "2025-05-20 13:23:15", "date_publish": "2023-08-02 10:26:02", "description": "Hearts' new arrivals need to hit the ground running", "filename": "sport_articles_c2l983907v9o_1747747395.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/78d8/live/73a4c500-3110-11ee-8f52-fbf70e4bf742.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c2l983907v9o_1747747395.html", "title": "Hearts' new arrivals need to hit the ground running", "title_page": "Hearts' new arrivals need to hit the ground running - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Brian McLauchlin, BBC Sport Scotland\nWith the 'new' management team now firmly in place at Hearts, the fans will be looking for a solid start to the domestic campaign after what ultimately proved to be a disappointing 2022-23 season.\nThe club, with the enormous backing from the supporters, have invested hugely in the squad in the past 18 months and if nothing else the fans deserve to be roaring on a team that can push towards third spot and be in contention for the latter stages of cup competitions.\nWhenever new players arrive at a club there tends to be a settling-in period and those playing Scottish football for the first time tend to have to make adjustments to their game.\nBut time is precious nowadays, with little given before questions are asked about their abilities to cope with our game.\nHearts are once again recruiting from far and wide. Another Aussie in Calem Nieuwenhof has joined the three already in place. Further signings from Japan and Costa Rica are also expected in the coming days.\nProgression to the group stages of the Europa Conference League this season will be difficult with potential ties against the likes of Aston Villa or Eintracht Frankfurt waiting should they get past either Rosenborg or Crusaders.\nHowever, it’s Hearts' final league position that will ultimately decide if this has been a successful campaign. They get under way this weekend with a trip to under-fire St Johnstone.", "url": "https://www.bbc.com/sport/articles/c2l983907v9o"}