{"authors": ["Matt Warwick", "www.facebook.com"], "date_download": "2025-05-21 07:28:54", "date_modify": "2025-05-21 07:28:54", "date_publish": "2025-05-20 17:11:41", "description": "Several of Britain's best riders will compete in June's Lloyds Women's Tour of Britain, including Lizzie Deignan.", "filename": "sport_cycling_articles_cd900l9997eo_1747812534.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2c63/live/aad03bc0-3598-11f0-8947-7d6241f9fce9.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cycling_articles_cd900l9997eo_1747812534.html", "title": "Tour of Britain Women 2025: British stars set to race", "title_page": "Tour of Britain Women 2025: British stars set to race  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Several of Britain's best riders will compete in June's Lloyds Women's Tour of Britain, including Lizzie Deignan.\nHer Lidl-Trek team-mate and Olympic silver medallist from last year's Paris Games Anna Henderson will also take on the four stages across England and Scotland, from 5-8 June.\nAlso starring are two of British cycling's brightest prospects Cat Ferguson of Movistar and Imogen Wolff, who rides for Visma-Lease a Bike.\nSisters Elynor and Zoe Backstedt also compete, for UAE-Team ADQ and Canyon-Sram Zondacrypto respectively.\nDeignan, 36, is retiring at the end of this season after an illustrious career which includes twice winning the Tour of Britain Women and many of the sport's biggest races, including the inaugural Paris-Roubaix in 2021 and a silver medal at the London 2012 Olympics.\n\"I have such special memories from this race and over my career I have had a lot of success here,\" said Deignan, who won in 2016 and 2019.\n\"This will be my final Tour of Britain so it will be bittersweet but I am going to be surrounded by some incredible women.\"\nThe UCI World Tour race sees a peloton of world-class riders - including peerless sprinter Lorena Wiebes of the Netherlands - take on stages in the north east of England, including Hartlepool, and in Scotland, finishing in Glasgow.\nFerguson won last year's junior UCI Road World Championships in Switzerland, and is seen as one of the best young talents on the Women's World Tour.\nThe 19-year-old won last week's Navarra Women's Elite Classic one-day race while Wolff, also 19, won stage three and the young rider's white jersey at the Vuelta a Extremadura Femenina in March.\nThe Tour of Britain Women was rescued by British Cycling last year after being cancelled in 2023 because of funding issues.\nThe race is known for being one of the few races which pays equal prize money - relative the number of stages - to the men's event.\nThe Tour de France Femmes - women's cycling's biggest race - pays its winner 10% of that of the men's event, at 50,000 Euros.", "url": "https://www.bbc.com/sport/cycling/articles/cd900l9997eo"}