{"authors": ["Matty Fairnie", "www.facebook.com"], "date_download": "2025-05-21 07:15:05", "date_modify": "2025-05-21 07:15:05", "date_publish": "2025-05-20 11:01:14", "description": "Hibs fan voice: 'Sad to see the back of a great season'", "filename": "sport_articles_cn0g57qne52o_1747811705.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7828/live/396acad0-34f4-11f0-8519-3b5a01ebe413.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cn0g57qne52o_1747811705.html", "title": "Hibs fan voice: 'Sad to see the back of a great season'", "title_page": "Hibs fan voice: 'Sad to see the back of a great season' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Hibs brought the curtain down on a great season with a title-winning victory at Ibrox on Sunday. The women's team lifted the title for the first time in 18 years with the win over Rangers – a fantastic achievement.\nGrant Scott's team deserve huge credit for the way that they have come together as a team to defy the odds and win the title.\nIt was a fitting end to what's ended up a great season for Hibernian. The men's team finished third, well clear of fifth-placed Aberdeen and Dundee United in fourth.\nThe final league standings are a fair reflection of where the teams should be – Hibs' form since November has been stunning, with St Mirren finishing the season as the only top-flight side to have avoided defeat by Sir David Gray's team.\nEaster Road was buzzing on Saturday and we were treated to an entertaining match which saw Hibs come back twice to take a share of the points against Rangers.\nSunshine on Leith played out as the fans acknowledged the players at full-time, although not before the Under-18s had some fun celebrating their own league title win in front of the Rangers support at half-time.\nThere was controversy and a call for goalline technology (there always is when the Glasgow sides drop points to Hibs) after Rangers thought they'd scored.\nTV replays were inconclusive, and as we found out when Celtic complained about a similar decision earlier in the season, Willie Collum has directed his referees to defer to the on-field decision in instances where there's not conclusive proof of the ball crossing the line.\nRangers' frustrations were no doubt heightened by the fact Hibs' first equaliser was scored less than 30 seconds later. Had the VAR looked back at Rangers' 'goal', there's every chance Nicolas Raskin's two-handed shove on Rocky Bushiri would have been enough to disallow it in any case.\nI'm sad to see the back of this season, which couldn't come quickly enough back in October/November when we looked odds on to be pulled into a relegation fight.\nIt's a huge credit to Gray and his team, to Darren McGregor and his staff looking after the youth side, and to Grant Scott and his team on the women's side that Hibernian can look forward to European football now across the club next season.\nIt's been great fun, highlights being wins over Rangers, Celtic, Hearts, Aberdeen and Dundee United, with some huge season-defining moments that will live long in the memory. Roll on next season!", "url": "https://www.bbc.com/sport/articles/cn0g57qne52o"}