{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:59:53", "date_modify": "2025-05-21 03:59:53", "date_publish": "2025-04-07 07:21:36", "description": "Miron Muslic hails the goalscoring instinct of Plymouth Argyle striker Ryan Hardie after his goals secured a much-needed victory against Norwich City.", "filename": "sport_football_articles_cyvq4vl5r56o_1747799993.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2a73/live/179f5e20-137f-11f0-a9df-914426228455.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cyvq4vl5r56o_1747799993.html", "title": "Ryan Hardie: Plymouth Argyle striker's goalscoring instinct hailed by boss", "title_page": "Ryan Hardie: Plymouth Argyle striker's goalscoring instinct hailed by boss - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Miron Muslic has hailed the goalscoring instinct of Plymouth Argyle striker Ryan Hardie after his goals secured a much-needed victory.\nThe Scot's first-half double was enough to see the Pilgrims beat Norwich City 2-1 and keep their hopes of Championship survival alive.\nWhile Argyle are still bottom of the Championship, they cut their gap to safety to four points.\n\"When we were missing Hardie for five or six games it cost us a lot because if you can get Hardie in a finishing position that's half of the job,\" head coach Muslic told BBC Radio Devon.\n\"I think he did it brilliant, but that's just the instinct of a proper number nine.\"\nHardie - who scored the winning penalty in Argyle's famous FA Cup win over Liverpool in February - superbly controlled a high ball before calmly finishing for his 24th-minute opener.\nHe then deftly curled in his second five minutes later after the ball had broken to him in the box.\n\"It's a killer instinct for a number nine, clinical, and we missed that so, so many games,\" added Muslic, who has seen top scorer Hardie sit out seven games since the start of the year due to various injuries.\n\"If you want to win a game you need to score a goal and you need to rely then on a goalscorer and reliable goal source, and he's exactly that kind of player for Argyle.\n\"It's not coincidence that Ryan Hardie scored those two goals.\"", "url": "https://www.bbc.com/sport/football/articles/cyvq4vl5r56o"}