{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:36:40", "date_modify": "2025-05-21 05:36:40", "date_publish": "2025-01-31 16:45:52", "description": "Sheffield United boss Chris Wilder speaks to the press ahead of the Blades' trip to Derby County on Saturday.", "filename": "sport_football_articles_ckgxz0vjvn3o_1747805800.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7982/live/0ef515b0-dff1-11ef-ba4f-b100425dc741.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ckgxz0vjvn3o_1747805800.html", "title": "We've had a fabulous season so far - Wilder", "title_page": "Sheffield United: We've had a fabulous season so far - Wilder - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wilder said he is \"delighted\" to have signed a new contract until the end of the 2027-28 season. \"Pretty easy decision from my point of view. It goes under the radar how early we are into this rebuild. Delighted with the players, their attitude. The results - bumps in the road as seen last Friday but I'm still looking at that table that says 60 points, so we've had a fabulous start. It gives stability to the football club and the players.\"\nOn whether he cares about cementing a legacy: \"No, not at all. It's not about me, it's about servicing the football club.\"\nNew loan signing Harry Clarke, who joined from Ipswich, has been \"on our list for a long time\", according to Wilder. \"It was important that we strengthened. His pedigree is really good and he's tasted success in the last two seasons with two promotions, so he knows how to win.\"\nMidfielder Hamza Choudhury, who joined on loan until the end of the season from Leicester City, was a \"number one target right the way through\". Wilder added: \"A player that's been in and around a team that's won the Premier League, won the FA Cup, been in Europe, been in Champions League football. Delighted to have him on board.\"\nOn other January transfers: \"We're after a centre-half, there's no doubt about it. We've made a bid for a player and that's going through that dance as it always does.\"\nOn facing Derby on Saturday: \"They will be committed, they'll be on the front foot, and we have to earn the right to play and make sure we're right to gain a win. We have to be close to if not at our best to earn that right.\"", "url": "https://www.bbc.com/sport/football/articles/ckgxz0vjvn3o"}