{"authors": ["Phil McNulty", "www.facebook.com"], "date_download": "2025-05-19 15:18:16", "date_modify": "2025-05-19 15:18:16", "date_publish": "2015-02-27 15:09:47", "description": "Jose Mourinho lifts his first trophy since returning to Chelsea as his side see off Tottenham in the League Cup final.", "filename": "sport_football_31572594_1747667896.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81327000/jpg/_81327566_chelsea.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31572594_1747667896.html", "title": "Chelsea 2-0 Tottenham Hotspur", "title_page": "Chelsea 2-0 Tottenham Hotspur - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jose Mourinho claimed his first trophy since returning for his second spell as Chelsea manager with a comfortable Capital One Cup final victory over Tottenham at Wembley.\nJohn Terry and Diego Costa did the damage - both with the aid of deflections - either side of the interval as Spurs' hopes of repeating their success over Chelsea in this competition seven years ago, external never got off the ground.\nThe win gave Mourinho his first silverware since La Liga success with Real Madrid in 2012 and Chelsea their first since the Europa League final victory against Benfica in Amsterdam a year later.\nDespite a career laden with trophies, Mourinho claimed this was the most important final of his time in the game and Chelsea were never seriously troubled once Christian Eriksen's early free-kick rebounded to safety off the woodwork.\nMourinho's mastery of the big selection decision was also demonstrated once more by his deployment of Kurt Zouma, a central defender by trade, in midfield to fulfil the role left behind by the suspended Nemanja Matic to outstanding effect.\nSpurs, for all their endeavour, never looked close to repeating that convincing victory over Chelsea on New Year's Day, when Mourinho's side were beaten 5-3 at White Hart Lane.\nTottenham had the exertions of a Europa League tie - and painful exit - against Fiorentina in Italy on Thursday, and while this may have taken its toll, they never looked like rescuing the situation once Chelsea took the lead right on half-time.\nTottenham's usual suspects created early optimism for their fans as Eriksen bounced a 20-yard free-kick off the bar, although Petr Cech - preferred in goal to Thibaut Courtois - looked to have the situation under control, and Harry Kane ended a fine run with a low shot that was comfortably saved by Chelsea's keeper.\nAs usual, Costa was keeping Spurs fully occupied in the physical exchanges, angering Nabil Bentaleb with a hand-off, squaring up to Kyle Walker and getting involved in a running battle with Eric Dier that ended with the defender picking up a yellow card for a foul.", "url": "https://www.bbc.com/sport/football/31572594"}