{"authors": ["Nick Webb", "www.facebook.com"], "date_download": "2025-05-20 13:51:53", "date_modify": "2025-05-20 13:51:53", "date_publish": "2023-07-31 17:19:54", "description": "Welsh Fire captain Tammy Beaumont bids to turn round 'under-performing' side and feed off interest from the women's Ashes.", "filename": "sport_cricket_66364732_1747749113.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/16241/production/_130598609_gettyimages-1418245264.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66364732_1747749113.html", "title": "The Hundred: Beaumont bids to revive 'under-performing' Welsh Fire women", "title_page": "The Hundred: Beaumont bids to revive 'under-performing' Welsh Fire women - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Welsh Fire captain Tammy Beaumont is hoping The Hundred and the women's Ashes will feed off each other in promoting the women's game.\nBeaumont hit a Test double century as England drew the series against Australia.\n\"It was the best series I've been involved in and possibly the best series ever in women's cricket,\" said Beaumont.\n\"Hopefully that'll transfer (back) into people coming to watch The Hundred.\"\nEngland opener Beaumont, who played in the ODI series as well as the Test, will be without England team-mate Sophia Dunkley for the first two matches, with some of the international squad joining The Hundred late.\nBut Beaumont, 32, is keen to make the most of the professional opportunities denied to her at the start of her career as she tries to turn around an \"under-performing\" side, who finished bottom of the table in 2022.\n\"I was probably one of the last who wasn't professional when I started playing for England and one of the first to get professional contracts,\" she said.\n\"You used to play in front of your parents and a few other parents, I made my debut in front of 50 people in the West Indies, and the game's come such a long way and it's exciting to see how far it can go though it's still got a long way to go to match the men's game.\"\nWhile Beaumont may have been born on the other side of the UK in Dover and learned her cricket with Kent, she is determined to acknowledge the identity of her adopted side, heading for a Wales rugby international in August with her fiance, who served in the Royal Welsh Regiment.\n\"We've got a real unique opportunity being the Welsh Fire and almost representing a country within The Hundred, we've got to use Welsh culture, history and everything to galvanise us,\" said Beaumont.\n\"Both the men and the women's teams have under-performed for the whole competition so far, so this year we really need to shift results and play exciting cricket, not the same old story.\n\"So there's a bit of pressure on and I'm hoping we can turn it round.\"\nCoach Gareth Breese, the former Durham all-rounder once capped by the West Indies, also returns to Cardiff, but with a radically different squad after the draft, including South Africa pace bowler Shabnim Ismail as one of the top-rated buys.\n\"Getting Shabnim in will really offer us a boost in the fast bowling department, she's a strike bowler who gives everything. We don't want to get players in and change what they do, hopefully how we put the team together, they just come in and play their roles,\" Breese told BBC Sport Wales.\n\"When you look at the crowds they've had, the family engagement, it's been brilliant and for the women it's another layer of professional cricket which helps the development overall, it's gone massively over the last few years so it's very promising.\n\"It helps prep players for the pressures of playing in front of big crowds like the international series we had against Australia this year.\"\nWelsh all-rounder Alex Griffiths and spinner Claire Nicholas will bring local representation to the Fire squad, while Jamaican-born Breese has his own Welsh heritage.\n\"I've got family roots here, from mid-Wales. We've tried to chat to the girls about the pride the Welsh have in their teams if they come in, be professional and fight with all the qualities we expect of a team, especially with the Welsh badge on, hopefully they feel a part of it,\" he said.\nWelsh Fire begin against Manchester Originals at 11:30 BST on Wednesday, 2 August.", "url": "https://www.bbc.com/sport/cricket/66364732"}