{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:08:15", "date_modify": "2025-05-21 04:08:15", "date_publish": "2025-02-01 00:00:00", "description": "Reaction and analysis after Ireland start their Six Nations title defence with a crushing victory over England in Dublin.", "filename": "sport_rugby-union_live_c983v1814lgt_1747800495.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_live_c983v1814lgt_1747800495.html", "title": "Ireland vs England LIVE: Six Nations rugby", "title_page": "Ireland vs England LIVE: Six Nations rugby - reaction to Ireland's win, scorers and text updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The final whistle\nFT: Ireland 27-22 England\nThat's all from today's game in Dublin. The 2025 Six Nations is officially under way!\nYou can read Matt Gault's report from the Aviva Stadium here, and keep an eye on the BBC Sport website and app throughout the evening for more reaction and highlights from the game.\nDon't forget that the Rugby Union Weekly podcast is available every day throughout the Six Nations, so you can get your rugby fix on BBC Sounds.\nWe'll be back next week with the second round of fixtures, so catch you then!\nThanks for joining us, enjoy the rest of your weekend!\n'We would have taken that result'\nFT: Ireland 27-22 England\nIreland Rugby\nIreland interim head coach Simon Easterby on England's final try: \"It gives them a bonus point and that is in a competition where bonus points are important.\n\"The result stands and it didn't change it. We would have taken that result at the start of the day.\"\nOn Scotland: \"It sets us up for a huge challenge in Murrayfield. They are off a good result as well. It is an important place to go and get a result. It will be incredibly tough.\"\n'We needed to get back to doing things our way'\nFT: Ireland 27-22 England\nIreland Rugby\nIreland's captain Caelan Doris on the half-time conversation with players: \"We needed to get back to doing things our way.\n\"A feeling at the end of the first-half that we thought we were going to break them and when we were getting into their 22 and score zone, things were going to happen for us.\"\n'There is a strong belief in the plan we have'\nFT: Ireland 27-22 England\nIreland Rugby\nIreland's captain Caelan Doris: \"It is definitely satisfying [getting the win]. It's huge in this competition, you can’t win it in the first round, but you can lose it or dampen it essentially.\n\"I think we showed what we are capable of at times. It was a good 10 days leading up to this and there is a strong belief in the plan we have within our attack.\n\"As we get deeper into the tournament it’s going to be something we need to get stronger with and we need to develop.\"\n'The bench benefitted from the work done'\nFT: Ireland 27-22 England\nIreland Rugby\nIreland interim head coach Simon Easterby: \"We had to find a way. We felt if we did a few things better in the way we were doing things, then we would get the rewards.\n\"England defended well and made it tough for us. We are happy with how our set-piece went.\n\"The guys who started laid a good foundation as it wasn't easy. It was physical and all you'd expect. The bench benefitted from the work done.\"\n'Ireland's experience told'\nFT: Ireland 27-22 England\nEngland Rugby\nEngland head coach Steve Borthwick on France next weekend: \"We are looking forward to being back at Twickenham next week in front of our supporters. You are starting to see a team who are learning how to really move the ball and develop our attack.\n\"Ireland are a world-class team and have been for a long time. They have been in the top four consistently. That experience told in the third quarter.\"\n'It is what it is'\nFT: Ireland 27-22 England\nEngland Rugby\nEngland captain Maro Itoje: \"It is what it is.\n\"Our role is to learn from it and build and get better. There are large parts of our game which we took a step forward today. The energy we had on the field and the vibrancy we had in our attack is admirable.\n\"Of course there are things we need to learn and get better at.\"\n'You've seen two different teams'\nFT: Ireland 27-22 England\nEngland Rugby\nEngland head coach Steve Borthwick: \"You've seen two different teams. An Ireland team that have been together for a huge amount of time with nearly 1200 caps against an England team that has been building over the last six months.\n\"Just over half the number of caps. At the start you didn't see a difference. I thought we took a step forward with our attack.\"\n'The bonus point is admirable'\nFT: Ireland 27-22 England\nEngland Rugby\nEngland captain, Maro Itoje speaking on what he said in the changing room: \"We pretty much said look the first half was good the second half we didn’t execute the game plan in terms of territory.\n\"I am proud of the way the boys fought to the very end. We fought to get the bonus point at the end and that’s admirable.\"\n'I am very proud of how our players attacked the game'\nFT: Ireland 27-22 England\nEngland Rugby\nEngland head coach Steve Borthwick: \"Immense credit to Ireland they are such an experienced team. It was a tough Test match in that third quarter and I thought they did really well.\n\"That was the critical period and that allowed them to get scoreboard pressure. I am very proud of how our players attacked the game in the first half and came back at the end to score a few tries to get the bonus point.\n\"The team, against one of the best attacking sides in the world, have improved defensively.\"", "url": "https://www.bbc.com/sport/rugby-union/live/c983v1814lgt"}