{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:11:58", "date_modify": "2025-05-21 06:11:58", "date_publish": "2025-01-04 17:59:40", "description": "Rangers must build on Celtic win - Propper", "filename": "sport_articles_cz0rz0x3n4lo_1747807918.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/386f/live/c6d9bf80-cac2-11ef-87df-d575b9a434a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cz0rz0x3n4lo_1747807918.html", "title": "Rangers must build on Celtic win - Propper", "title_page": "Rangers must build on Celtic win - Propper - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Robin Propper says Rangers' impressive victory against Celtic will only matter if they can produce that level of performance consistently.\nThe Dutch defender scored Rangers' second goal in the 3-0 win at Ibrox, which narrowed Celtic's lead at the top of the Scottish Premiership to 11 points.\nThe result came as something of a shock given Celtic's domestic form and that Rangers went into the game off the back of a defeat at St Mirren and a draw at Motherwell.\nPhilippe Clement's side were also without several key players - James Tavernier, Jack Butland, Leon Balogun and John Souttar all missed the game/\n\"That was a big game, so everybody wants to step up,\" Propper said.\n\"Everybody wants to take another level, and especially if you see that James is away, Jack is away, John and Leon are away.\n\"Then everybody wants to be better and help each other. But I think the quality is there.\n\"We have a really good team and we have to show it every time and that is the hard part. We try to do that and I think we can and this was a game where you have seen that we can do a lot.\n\"I think that's the key, to be consistent. These kind of games are different than maybe away games at St Mirren or Motherwell. So you have to adjust every time in that kind of game.\n\"Of course, the key is consistency because you have seen in this game, we can win 3-0 over Celtic but the last time we had a draw at Motherwell so we need to be consistent in what we do and to win every game.\"", "url": "https://www.bbc.com/sport/articles/cz0rz0x3n4lo"}