{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:26:07", "date_modify": "2025-05-19 14:26:07", "date_publish": "2015-03-16 17:49:18", "description": "Championship promotion hopefuls Brentford twice come from behind to beat Blackburn Rovers 3-2 at Ewood Park.", "filename": "sport_football_31809774_1747664767.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81721000/jpg/_81721916_brantford_getty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31809774_1747664767.html", "title": "Blackburn Rovers 2-3 Brentford", "title_page": "Blackburn Rovers 2-3 Brentford - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Championship promotion hopefuls Brentford twice came from behind to beat Blackburn Rovers in a pulsating encounter at Ewood Park.\nRudy Gestede's 16th goal of the season gave the hosts a fifth-minute lead but Chris Long's deflected effort levelled the scores just before the break.\nChris Taylor's first league strike gave Rovers a half-time advantage but goals from Jota and Andre Gray after the break handed the Bees all three points.\nBrentford remain in sixth place.\nBlackburn boss Gary Bowyer paired Jordan Rhodes and Gestede up front for the first time since their most recent defeat at Norwich six games ago, and his decision soon paid off.\nA quick Ben Marshall free-kick caught the visitors off-guard, allowing Gestede to volley into the top corner.\nFormer Blackburn trainee Alan Judge rattled a free-kick against Rovers' bar before on-loan Everton striker Long saw his shot deflect off Matt Kilgallon and in to level the contest.\nBlackburn retook the lead four minutes into first-half injury time through Taylor's first league strike.\nBrentford equalised for a second time - and in spectacular fashion - on 52 minutes, Jota allowed space to run 60 yards before slotting past Jason Steele from the edge of the area.\nAnd with six minutes remaining Gray was on hand to tap in the winner after Steele could only parry Jota's initial effort.\nRovers are now 11 points off the play-off places with eight league games remaining, while Brentford, who occupy that last play-off berth, are seven points away from the automatic promotion berths.\nBlackburn manager Gary Bowyer:\n\"It is massively frustrating. To score two goals and not get anything out of the game is hugely disappointing.\n\"The lads showed a tremendous effort bearing in mind we are down to bare bones, but they dug deep and had a right good go.\n\"If you look at the goals we've conceded they are three poor goals, it is as simple as that. The nature of all three goals are poor, they are all preventable.\"\nBrentford manager Mark Warburton:\n\"We made individual errors in the first half and we were frustrated and angry at half-time.\n\"But I thought it was a fantastic response, and in the second half we looked strong. We were worthy winners in the end.\n\"We knew had we lost today Blackburn would have been very, very tight to us.\n\"You saw tonight late goals, equalisers, people dropping points and that will carry on week in, week out.\"", "url": "https://www.bbc.com/sport/football/31809774"}