{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:50:19", "date_modify": "2025-05-21 05:50:19", "date_publish": "2025-04-02 10:22:48", "description": "Wolves 1-0 West Ham: Fan views", "filename": "sport_football_articles_cjdxlnynd27o_1747806619.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cjdxlnynd27o_1747806619.html", "title": "Wolves 1-0 West Ham: Fan views", "title_page": "Wolves 1-0 West Ham: Fan views - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your views on Wolves' win over West Ham on Tuesday\nHere are some of your comments.\nWolves fans:\nNathan: Good first half. We withstood the pressure and did what we needed to do in the second. Wolves under Vitor Pereira have worked out how to win and stop conceding so many goals. Long may it continue! I hope the board back him in the summer and we can push on.\nSimon: Needlessly holding on at the end and subs should have come on much sooner. So many players were running on empty after playing a relentless pressing game in the first half. A lucky win - a point would have been worse than a defeat after playing so negatively and deep after scoring so early.\nKieran: Twelve points clear - we are staying up. Second half could have been better but we got the points and I think we are safe now.\nWest Ham fans:\nDave: Inexcusably poor. Wolves were on it in the first half and we decided not to close down at all. Slow passing, no attacking threat and terrible finishing for the three chances we managed to make. Very poor display. Graham Potter has a huge rebuilding job on his hands in the summer.\nAmmers: Performance was disgraceful. Potter looks dejected already and it goes to show that it wasn't all down to Julen Lopetegui, and the players owe some of their wages to the supporters.", "url": "https://www.bbc.com/sport/football/articles/cjdxlnynd27o"}