{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:39:10", "date_modify": "2025-05-20 11:39:10", "date_publish": "2023-08-06 19:31:23", "description": "Great Britain's Noah Williams wins men's 10m platform bronze on the final day of the World Aquatics Diving World Cup.", "filename": "sport_diving_66424198_1747741150.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/16FB9/production/_130673149_gettyimages-1596701370.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_diving_66424198_1747741150.html", "title": "Diving World Cup: Great Britain's Noah Williams wins bronze in men's 10m platform and mixed team event", "title_page": "Diving World Cup: Great Britain's Noah Williams wins bronze in men's 10m platform and mixed team event - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Great Britain's Noah Williams won men's 10m platform bronze on the last day of the Diving World Cup Super Final.\nChina's Hao Yang took gold in Berlin, finishing more than 56 points clear of Ukraine's Oleksii Sereda with Williams third on 468.05 points.\nWilliams sat fifth after five dives but earned 90.65 for a nerveless sixth and final routine to snatch bronze.\nThe 23-year-old ended the day with two bronze medals after Britain's mixed 3m and 10m team also placed third.\nThe team of Williams, Grace Reid, Lois Toulson and Jordan Houlden finished on 387.95 points after eight dives, behind silver medallists Australia and champions Canada.\nGreat Britain ended the competition with five medals - four bronze and one silver, the latter courtesy of Houlden and Anthony Harding in the men's 3m synchro event on Friday.\nThe other two bronze medals arrived via Andrea Spendolini-Sirieix, who finished third in both the women's 10m platform and the women's 10m synchro alongside Toulson.\nYasmin Harper was in contention for a medal after two dives of the women's 3m springboard final on Sunday but faded to finish 10th, two places above Reid in 12th.", "url": "https://www.bbc.com/sport/diving/66424198"}