{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:10:18", "date_modify": "2025-04-26 04:10:18", "date_publish": "2025-03-02 18:00:33", "description": "What the managers said: Brighton 2-2 Chelsea", "filename": "sport_football_articles_cy05j59e80do_1745640618.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ad5f/live/514a8810-75c9-11ef-b02d-c5f3b724a1ea.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cy05j59e80do_1745640618.html", "title": "What the managers said: Brighton 2-2 Chelsea", "title_page": "What the managers said: Brighton 2-2 Chelsea - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Chelsea came from behind to salvage a draw against Brighton in the Women's Super League. Here is what the managers said after the game:\nChelsea manager, Sonia Bompastor, speaking to Sky Sports: \"It is frustrating in terms of the result. I just said to my players that they needed to start the game with the same intention that we showed in the second half. I think we had some troubles in the first half because our intentions were not good enough.\n\"We dropped two points again today and it is important to keep the head up. We have a quick turnaround to Wednesday and we need to be ready for it.\"\nOn Naomi Girma: \"We need to assess her tomorrow and maybe do a scan to see what happened with her calf. Never easy for the first game, she needs to find the chemistry with the other players and the rhythm in the league. It is good for her to get the minutes and I hope she will be ready to play again soon.\"\nBrighton manager, Dario Vidosic, speaking to Sky Sports: \"I'm almost a little bit disappointed. I think we had the opportunities to go 3-1 up and we didn't and then it felt like the result maybe scared us, that we were winning 2-1. We had it there. But that is all part of the journey and the process.\"\nOn Chelsea's second goal: \"It is hard to tell [if Lauren James is offside] from the angle we have. You hope not because then it cuts a bit deeper.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cy05j59e80do"}