{"authors": ["Dafydd Pritchard", "www.facebook.com"], "date_download": "2025-05-21 06:53:25", "date_modify": "2025-05-21 06:53:25", "date_publish": "2025-03-29 18:18:53", "description": "Cardiff City manager Omer Riza questions his players' mentality after their deflating draw with Sheffield Wednesday.", "filename": "sport_football_articles_czxnxx728vgo_1747810405.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/dd7e/live/d580d650-0cc0-11f0-bffd-fb98b4c4f9e8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_czxnxx728vgo_1747810405.html", "title": "Omer Riza: Cardiff boss questions players' mentality after draw", "title_page": "Omer Riza: Cardiff boss questions players' mentality after draw - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cardiff City manager Omer Riza questioned his players' mentality after their deflating draw with Sheffield Wednesday.\nCardiff were in control as they led 1-0 on Saturday but were made to rue their many missed chances as Wednesday equalised in the second half.\nThe draw leaves the Bluebirds just two points clear of the Championship relegation zone, though they will drop into the bottom three on Wednesday night if Derby County win their game in hand against Preston North End.\n\"It just seems to be an element of a mental thing with the boys,\" Riza said after the draw at Cardiff City Stadium.\n\"They didn't apply enough pressure in the second half. They sat and allowed them to have a bit more time in the midfield areas, which put us on the back foot, which was disappointing.\n\"It's those moments in games, our players feel, maybe it's a subconscious thing, they know how important the three points are and it's a natural thing we are doing.\"\nCardiff have not played in the third tier of English football since 2003 but are perilously close to doing so next season.\nThis is the third campaign out of four in which they have battled against relegation in the Championship.\nRiza's side have seven games to save themselves, starting with next Saturday's trip to Queens Park Rangers.\n\"They [players] are going to be frustrated and disappointed,\" the manager added.\n\"But we have 90 minutes to get the job done and we haven't done that We can't find excuses, we have to find solutions.\n\"We've spoken about it [mentality] a lot. Until you're in this position you can never understand how difficult it is for them on the pitch. You have to keep plugging away and look to QPR on the weekend.\"", "url": "https://www.bbc.com/sport/football/articles/czxnxx728vgo"}