{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:41:04", "date_modify": "2025-05-21 07:41:04", "date_publish": "2025-03-28 11:24:32", "description": "Golfer Mimi Rhodes says she was \"just trying to make the cut\" after claiming her first win on the Ladies European Tour.", "filename": "sport_golf_articles_cm2d23jkmzro_1747813264.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d3a8/live/100d4b00-0bb8-11f0-9ca8-c5035ea95420.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_golf_articles_cm2d23jkmzro_1747813264.html", "title": "Mimi Rhodes: Golfer was 'just trying to make the cut' in maiden win", "title_page": "Mimi Rhodes: Golfer was 'just trying to make the cut' in maiden win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "\"I was just trying to focus on making the cut,\" says golfer Mimi Rhodes, fresh from claiming her first victory on the Ladies European Tour.\nThe 23-year-old showed great composure to produce a bogey-free final round to win by two shots at this month's Women's NSW Open in Australia.\n\"I wasn't expecting any of it,\" she told BBC Radio Somerset.\n\"It all feels like a bit of a dream and a bit of a blur. Being in Australia, a new country, it was all just an unbelievable experience.\n\"To have got my first LET win there, it's just the cherry on top.\"\nCompeting on the tour for just the fourth time in her career, the rookie stunned by hitting a course record nine-under 62 to take a share of the lead after two rounds.\nShe led by one shot heading into the final round in Wollongong, with a two-under score of 69 leading her to finish on 17 under.\nThe win over Australia's Kirsten Rudgeley and Italy's Alessandra Fanali followed missing the cut at the Australian Women's Classic the previous week.\n\"It's kind of weird how that happens in golf. Going from a missed cut and then suddenly a nine under,\" Rhodes said.\n\"That day was some of the best golf that I have played in my life. Every putt just kept rolling in.\nHaving enjoyed some time celebrating the victory, Rhodes' attention now turns to the new doors that have opened for her, including a place at the Women's Open.\n\"I can pretty much get into every event except for the US Open and The Evian [Championship], but there's still a lot of golf to be played,\" she said.\n\"It's a bit of a shock to know that I can now play in all of those events in my first year.\n\"I had no idea that I'd get into the British Open. My mum did, but she never told me, obviously, until I won.\"\nThis summer's event will be played at Royal Porthcawl Golf Club on the south coast of Wales from 31 July to 3 August, which is not all that far from Rhodes' hometown of Bath.\n\"I'm for sure going to have a lot of family coming to support. It's going to be really special,\" said Rhodes.\nRhodes and her sister Patience were introduced to golf by their grandmother Susan at a young age.\nThey were regular visitors to Somerset's Burnham and Barrow Golf Club, from where their progress is still followed.\n\"There are quite a few people who come up to me and remember me through my grandparents,\" she said.\n\"It's really lovely that they are supporting me and watching me from there.\"\nAfter returning to Somerset, Rhodes' parents joked that they could not believe that the victorious golfer that they had been watching on television was sat in their house.\nThe rookie is looking to keep her head on the ground, but certainly is not short of aspiration, with next year's Solheim Cup at the back of her mind.\n\"I obviously do think about it because it's one of my goals as well as all of the majors,\" she said.\n\"I was sat next to the LET director on the plane back and he mentioned to me about the Solheim Cup and showed me the table of points and I'm actually quite high up.\n\"The Solheim Cup, the Olympics, it's all on everyone's bucket list, but I'm not really going to put too much pressure on myself.\"\nThe one thing that would make the dream of playing a major championship even sweeter, would be to do it together with her younger sister.\n\"It's a long career, I've got a lot of a lot of time to do it and hopefully when Patience comes into the pro ranks, we can do it together,\" Rhodes said.\n\"She's got this year and then two more years [at university].\n\"Hopefully she doesn't beat me too many times.\"", "url": "https://www.bbc.com/sport/golf/articles/cm2d23jkmzro"}