{"authors": ["Elizabeth Hudson", "www.facebook.com"], "date_download": "2025-05-21 07:49:47", "date_modify": "2025-05-21 07:49:47", "date_publish": "2025-05-18 17:33:15", "description": "Britain's Daphne Schrager wins road race gold to add to her time trial title at the Para-cycling Road World Cup in Italy.", "filename": "sport_cycling_articles_ce39v2xq808o_1747813787.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d6f8/live/d8842970-340b-11f0-8944-2b1dd2bd7018.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cycling_articles_ce39v2xq808o_1747813787.html", "title": "Para-cycling Road World Cup: Britain's Daphne Schrager secures double", "title_page": "Para-cycling Road World Cup: Britain's Daphne Schrager secures double - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "British Paralympic medallist Daphne Schrager completed a double as she returned to international action at the Para-cycling Road World Cup in Italy.\nThe 24-year-old from Wiltshire, who won Britain's first medal at last year's Paris Games when she took individual pursuit silver, won both races in her C2 class in Maniago.\nShe was 12 seconds ahead of her nearest rival in Friday's time trial and dominant in Sunday's road race, going clear of American Allison Jones on the third of seven laps and finishing more than three minutes ahead.\nThere were also road race victories for Paris gold medallist Fin Graham in the C3 event with team-mate Ben Watson third, and Archie Atkinson in the C4 race.\nGB tandem pairs Lizzi Jordan and Danni Khan and Amelia Robertson and Corrine Hall were second and third in the women's B time trial, while Matthew Robertson claimed C2 road race silver and time trial bronze, and trike rider Felix Barrow was second in the T2 road race.\nHandcyclists Callum Russell (H4) and Marina Logacheva (H2) also finished third in their respective road races.\nThe next event in the calendar will be the Para-cycling Road World Championships which take place from 28-31 August in Ronse, Belgium.", "url": "https://www.bbc.com/sport/cycling/articles/ce39v2xq808o"}