{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:17:08", "date_modify": "2025-05-21 04:17:08", "date_publish": "2025-04-05 17:32:37", "description": "Swansea City: Alan Sheehan toasts Derby win as Swans edge towards survival", "filename": "sport_football_articles_cm25141g53yo_1747801028.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/19f2/live/ec73f1b0-123a-11f0-afc6-d1fc00c8c982.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cm25141g53yo_1747801028.html", "title": "Swansea City: Alan Sheehan toasts Derby win as Swans edge towards survival", "title_page": "Swansea City: Alan Sheehan toasts Derby win as Swans edge towards survival - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Alan Sheehan toasted a fine result – and a gritty performance – after Swansea City eased their relegation concerns with victory over Derby County.\nSubstitute Eom Ji-Sung's 79th-minute goal – which was Swansea's only shot on target – settled what was a dire contest.\nDerby, who arrived on the back of four straight victories, had looked the side most likely to find a breakthrough thanks chiefly to their long-throw threat.\nBut Eom's close-range finish saw Swansea claim a third triumph in four home games since Sheehan took charge following Luke Williams' departure in February.\n\"It wasn't a wonderful game, but it was a wonderful win,\" said caretaker head coach Sheehan.\n\"I tried to explain the magnitude of this game in the media and I didn't want to downplay it - I said it would be a dogfight. The ball goes out, long throws, set-plays, against a big physical team – we had to be more physical.\n\"At times that killed our fluidity but it's a fine balance to go and win a game against a team who are down there fighting and have a formula to win games at the moment.\n\"It was a wonderful defensive display, a win in the Championship and the one bit of quality in the whole game brought the goal. At this stage of the season, that's how it's going to be.\"", "url": "https://www.bbc.com/sport/football/articles/cm25141g53yo"}