{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:52:01", "date_modify": "2025-05-21 05:52:01", "date_publish": "2025-04-02 09:15:02", "description": "Bristol Rovers have to \"keep going\" says manager Inigo Calderon despite a fourth loss in a row against Birmingham City.", "filename": "sport_football_articles_ckg1vv7x8x3o_1747806721.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b597/live/15550c30-0f9e-11f0-b696-d3bfdfb825fc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ckg1vv7x8x3o_1747806721.html", "title": "Inigo Calderon: Bristol Rovers boss says struggling side must 'keep going'", "title_page": "Inigo Calderon: Bristol Rovers boss says struggling side must 'keep going' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Bristol Rovers have to \"keep going\" says manager Inigo Calderon despite a fourth loss in a row against Birmingham City leaving them precariously above the League One relegation zone.\nRovers conceded early against the Blues but drew level on the 19th minute and had looked to have earned a point against the runaway league leaders until Jay Stansfield's 85th-minute penalty sealed a 2-1 victory.\nThey remain 20th in the table but Burton's win against Leyton Orient means they are now just three points behind with a game in hand.\n\"If you watch back the last 180 minutes of the last two games, we were better in 170 minutes but the result is we have zero points from the last six,\" Calderon told BBC Radio Bristol.\n\"You cannot get crazy, you cannot feel sorry for yourself, you have to keep going because when you are down there in the table, football is like that - it's cruel, it's brutal against you.\"\nDespite Birmingham being 47 points ahead and almost certain to return to the Championship next season, the Gas should have been ahead at half-time and twice hit the woodwork.\nCalderon said they had to \"take the positives\".\n\"In a normal world it should be enough to get something from the game but when you are down there [in the table] the mistakes - especially against good teams - are going to punish you,\" he said.\n\"I think for 85 minutes we were better than the best team in the league, it was not enough so we have to do better.\"\nRovers, who have the worst form away from home in the division, face another test on Saturday when they travel to play-off hopefuls Bolton.\nThey have won only three games on the road, their last coming on 4 January against Cambridge - their only away win since Calderon was appointed on Boxing Day.\n\"It's going to be even more difficult because it's away and we know that away the form hasn't been good. Football is testing us and we have to be ready for that,\" Calderon said.", "url": "https://www.bbc.com/sport/football/articles/ckg1vv7x8x3o"}