{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:56:02", "date_modify": "2025-05-21 03:56:02", "date_publish": "2025-04-07 13:19:22", "description": "Swansea City: Andy Fisher shines in St Johnstone's shock Celtic win", "filename": "sport_football_articles_c1lmpnpd1gqo_1747799762.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e758/live/cf9baab0-13b1-11f0-92ad-eb42d450dc76.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c1lmpnpd1gqo_1747799762.html", "title": "Swansea City: Andy Fisher shines in St Johnstone's shock Celtic win", "title_page": "Swansea City: Andy Fisher shines in St Johnstone's shock Celtic win  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Swansea City goalkeeper Andy Fisher enjoyed his best day yet as a St Johnstone player as he helped the Scottish Premiership club to a shock victory over Celtic on Sunday.\nSt Johnstone were given little chance of claiming victory as they hosted Brendan Rodgers' champions-in-waiting.\nBut the division's bottom club stunned the leaders thanks to a goal from Daniels Balodis – and a number of fine saves from Fisher.\n\"There were a lot of good performances, starting from the striker all the way, of course, to our goalkeeper. You need in these matches to make saves and Andy Fisher made those saves,\" said St Johnstone manager Simo Valakari.\nFisher has made 12 appearances for St Johnstone – missing only one game so far, through illness – since joining on loan from Swansea in January.\nThe former MK Dons player has not played in a league fixture for Swansea since Russell Martin's final game in charge, which was in May 2023.\nHe spent the 2023-24 campaign as back-up to on-loan Brighton keeper Carl Rushworth, then picked up a significant injury in a friendly before the current campaign began.\nAs a result, Swansea brought in Jon McLaughlin to provide competition for new number one Lawrence Vigouroux, which meant Fisher was allowed to move to Scotland in search of some first-team football.\nThe 27-year-old is under contract at Swansea until the end of next season.", "url": "https://www.bbc.com/sport/football/articles/c1lmpnpd1gqo"}