{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:50:32", "date_modify": "2025-04-26 03:50:32", "date_publish": "2025-03-05 12:42:54", "description": "Wrexham: 'I know my role' - Steven Fletcher comfortable with super-sub tag", "filename": "sport_football_articles_c62zgvjllz5o_1745639432.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4df8/live/d21afd50-f9ac-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c62zgvjllz5o_1745639432.html", "title": "Wrexham: 'I know my role'", "title_page": "Wrexham: 'I know my role' - Steven Fletcher comfortable with super-sub tag - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Steven Fletcher says he knows his role at Wrexham after declaring he is comfortable with his super-sub tag.\nThe Scot bagged his seventh goal of the season little more than a minute after coming off the bench to earn Phil Parkinson's men a 1-0 win at Huddersfield Town on Tuesday night.\nIt was the sixth goal he has scored as a substitute this season but, at 37 years of age, Fletcher says he has no problem with having to contribute off the bench.\n\"I know my role, I'm enjoying it,\" he said.\n\"You want to play games but the two strikers that are playing now (Sam Smith and Jay Rodriguez), I can't speak highly enough of them for what they're doing for the team.\n\"You can see the impact they're making on the pitch and it makes my job easier when I come on because they tire everyone out.\n\"The gaffer added [to the squad] in the window which helps, it gives everyone a boost, and we've got experience on the pitch. We know how to handle these occasions. I'm 38 this month and I feel 28, it's good to still be rolling out there.\"\nVictory over the Terriers keeps Wrexham within two points of the League One automatic promotion spots with 12 games of the season remaining.\nAnd while his goal in west Yorkshire was a scrappy one, Fletcher said victory - Wrexham's fourth away league triumph in succession - was key as the club chase a third consecutive promotion.\n\"I just wanted to get the ball in the back of the net, it was a bit of a scramble but it was a good moment to score because they were pushing on a bit,\" added the forward.\n\"Every game now is vital for us to try to get as many points on the board as we can, especially when we come away to places like this.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c62zgvjllz5o"}