{"authors": ["Tyrese King", "www.facebook.com"], "date_download": "2025-05-21 07:25:22", "date_modify": "2025-05-21 07:25:22", "date_publish": "2025-03-28 15:03:00", "description": "Unai Emery press conference: Preston vs Aston Villa preview", "filename": "sport_football_articles_c5yryke15x3o_1747812322.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6296/live/dbade4a0-4907-11ef-b74c-bb483a802c97.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c5yryke15x3o_1747812322.html", "title": "Unai Emery press conference: Preston vs Aston Villa preview", "title_page": "Unai Emery press conference: Preston vs Aston Villa preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Midfielder Ross Barkley is a doubt. Emery said Emi Martinez, Leon Bailey and Andres Garcia are all expected to train on Friday and will be assessed.\nEmery wants \"consistency\" for Aston Villa as we approach the end of the campaign and admitted Villa \"conceded a lot of goals this season\" and lost \" a lot of matches at home\".\nHe added: \"Now we are in another moment where we have to be very demanding because our ambition is to get the objective we want for the season.\"\nThe tie on Sunday is \"very important\" as Emery's side aim to regain their \"style of play\" after the international break.\nOn the impact of the international break: \"When we [first] arrived here we didn't have a lot of players in the national team. Now we are seeing the players joining up with their national team because we were performing well, both collectively and individually.\"\nOn the players not selected for international duty: \"We have had a good break. Of course, we were working with the players [who were not on international duty] and used the time to analyse the matches we played.\"\nHe continued: \"We were in Dubai for four days. The players we worked with were fantastic, and we worked with them to get that consistency, but the players who were in the national team will have their first training session today.\"", "url": "https://www.bbc.com/sport/football/articles/c5yryke15x3o"}