{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:05:19", "date_modify": "2025-05-20 14:05:19", "date_publish": "2023-07-31 00:00:00", "description": "Chelsea agree Axel Disasi deal, PSG linked with Barcelona's Ousmane Dembele, plus will West Ham continue their Harry Maguire pursuit?", "filename": "sport_live_football_66356779_1747749919.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/B1BA/production/_130589454_bbc-sport-index-imagery-3-split-images-gradient-457c9d7d-75a9-4a74-839f-2e77de1d117d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_football_66356779_1747749919.html", "title": "Latest transfer news: Axel Disasi, Ousmane Dembele, Harry Maguire", "title_page": "Latest transfer news: Axel Disasi, Ousmane Dembele, Harry Maguire - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "See you tomorrow\nSo, England face China on Tuesday (12:00 BST) as Sarina Wiegman's side look to book their place in the knockout stages of the Women's World Cup.\nYou can, of course, follow that live on the BBC Sport website.\nIn the meantime, the build-up to the new Premier League season rumbles on.\nCheck out this BBC Sport index for all the latest news, analysis and comment on your side - just click on the team of your choice.\nAnd click on this index for all the latest breaking football news.\nGet started with some of these leading stories from today:\nOnana rants at Maguire during Man Utd defeat\nPlayers face harsher punishments for bad behaviour\nEverton close to agreeing deal for striker Chermiti\n'He's a winner' - the rise of Luton's Edwards\nChelsea agree deal to sign Monaco defender Disasi\nEngland's Stanway relishes filling in for Walsh\nEngland v China (Tue, 12:00 BST)\nEngland midfielder Georgia Stanway is confident she can fill in for injury-hit Keira Walsh in Tuesday's final Women's World Cup group game against China.\nBarcelona's Walsh, 26, is out through injury, though scans confirmed it was not an anterior cruciate ligament knee issue.\nHer role has been as a holding player, blessed with creativity, with former Manchester City team-mate Stanway alongside her but having a greater licence to roam forward.\n\"For me, it's just covering that discipline element and knowing I don't always have to be running to help with the attack,\" said Stanway, 24. \"I need to protect the back four too.\n\"I've played alongside Keira [Walsh] who is the best teacher without knowing it. I'm sure she will be giving me some tips. She's got trust in whoever is going to be on the pitch.\"\nManager Sarina Wiegman did not confirm how long Walsh would be out for, insisting she was solely focused on Tuesday's game against China. A point or better would see England progress to the last 16 as Group D winners.\nClick here for the full story.\nWhat's Pochettino's plan for latest Monaco raid?\nJoe Bradshaw\nBBC Sport\nA talented French defender signed from Monaco to strengthen an injury-affected backline?\nChelsea have been here before. Merely six months ago in fact.\nWhen Benoit Badiashile said his farewells to the Cote d'Azur, he probably did not expect to be seeing Axel Disasi quite so soon.\nHowever, now reunited with his former team-mate, it is worth contemplating how the two could fare together at Stamford Bridge.\nDisasi, 25, has played more minutes than the younger Badiashile, 22, and ought to be coming into his prime. He started all-but-one league game for Monaco last season and has been a virtual ever-present since his switch from Reims in 2020.\nTall, physically imposing and right-footed, he will be expecting to slot in alongside his left-sided French colleague Badiashile.\nHe has surely not come to London to sit on the bench.\nIn the two seasons they played together, Monaco finished third in Ligue 1, benefiting from the strong platform they provided. Between them, the pair only have six caps for France but they, along with fellow Blues centre-back Wesley Fofana, would seem to be the future for Didier Deschamps' defence.\nPochettino likes a settled backline with defenders who are comfortable together - think Toby Alderweireld and Jan Vertonghen at Spurs.\nDisasi and Badiashile certainly fit that mould, albeit two weeks is not long for the newest arrival to bed in - and the latter remains sidelined with injury.\nEven so, at 39, Thiago Silva cannot remain evergreen. If Disasi is his natural successor, then perhaps Trevoh Chalobah will be sacrificed, despite featuring prominently in pre-season.\nLevi Colwill, who has been expected to finally establish himself at Chelsea this season, will also be watching on with interest.\nPochettino was coy on Disasi links when asked after the Fulham game on Sunday - but he's not daft.\nHis first Premier League teamsheet against Liverpool on Sunday, 13 August will be very interesting indeed.\n'Patience is key' but Toon are 'thin' in areas\nTwo draws and a victory featured in Newcastle United's Premier League Summer Series.\nEddie Howe says the squad is returning to Newcastle \"more united\" after a positive trip to the US.\nWe asked what you made of the tour and who has impressed you the most.\nHere are some of your thoughts:\nLeonard: I'm impressed by the youngsters, particularly Elliot Anderson and Lewis Miley. I also think we’ve bought fantastic players in Sandro Tonali and Harvey Barnes. I'm betting Tonali will thrive at Newcastle.\nDan: We need a proper left-back and a centre-back, in case of injury to Schar or Botman. Lascelles is a bench player at best and Dan Burn covers left and centre but struggles against top-tier opposition. Same back four all last season and we'll struggle with defensive depth in Champions League at present.\nJohn: I think we should go with what we’ve got now, and if so strengthen in January. Matt Targett hasn’t really had a chance yet to prove himself. With the young blood we have coming through we’re in a great position. This is all experimental for the new owners and we’re a lot further ahead than we thought we could ever be. Patience is the key.\nSimon: I'm not sure what to make of this pre-season tour. There were some positives with Anderson, Miley and Gordon, but I just can't help feel we haven't done enough in the transfer market to take on next season, we are very thin in several areas.\nRichard: Chelsea, Man Utd, Liverpool and possibly Spurs are going to be a lot stronger this season and with our Champions League games added there’s going to be a lot of pressure on the lads. Eddie Howe knows this, of course, and will want to hit the ground running. The Summer Series has at least shown the manager who’s fit enough for an Eddie Howe team.\nWill Newcastle make the Champions League again next season?\n'Finishing in the top eight would make it a reasonable season'\nIn the latest BBC Newcastle United podcast, fan forum member Joshua Nichol outlines his hopes ahead of the upcoming season: \"I'd like to see us do well in one of the cups. If we can finish third in our Champions League group and then have a kick at the Europa League knockouts, that might be a good option.\n\"Finishing in the top eight would make it a reasonable season. We did overachieve last season, no one would've said we would finish fourth at the start.\n\"We overachieved and had players playing out of their skin to achieve that. But, if we earn another European spot, that would be a success.\"\nHe also shared his opinions on Newcastle's club membership, which should allow more fans to access games: \"I can certainly see why the club have created the membership scheme. It gives members the chance to enter a ballot to get tickets, which are hard to come by.\n\"It's been hard to get to games since the takeover. But, the cost is slightly prohibitive, £37 to potentially not even get a game might put people off.\n\"The club should increase accessibility, that's what the fan zone will do with screening games. The Supporters' Trust have called for more clarity with tickets. The first game of the season is 12th August, yet we still don't know how to get tickets.\"\nListen to the podcast in full here\nNew technical area protocols\nThe FA issued more than 20 fines to Premier League clubs last season for surrounding match officials or mass confrontations, totalling more than £1m.\nThe protocols for next season include a team's manager having to attend a pre-match briefing while \"players and team officials not listed on the team sheet must not enter the technical area\".\nIn addition, no occupants from the technical area can \"enter the pitch to confront any match official at half-time or full-time\".\nDuring the match only one person can stand at the front of the technical area and, while a second person can stand, they \"must remain very close to the technical area seating\" and \"all conversations between the two standing must happen close to the technical area seating\" as everyone else stays sitting down.\nAlso, players \"must not instigate or escalate a mass confrontation with opposing players and/or technical area occupants\".\nMatch officials are being given the power \"to take a robust approach\" and \"issue yellow and red cards where behaviour falls below expected standards\".\nIncidents are to be reported to the FA and it \"will apply stronger supplementary disciplinary action\" where necessary.\n\"We want players, managers and fans to continue showing their passion, but these new measures have been introduced to ensure that the line is not crossed when it comes to on-field and technical area behaviour,\" said Premier League chief executive Richard Masters.", "url": "https://www.bbc.com/sport/live/football/66356779"}