{"authors": ["Tino", "www.facebook.com"], "date_download": "2025-05-21 06:12:32", "date_modify": "2025-05-21 06:12:32", "date_publish": "2025-04-01 12:25:22", "description": "Fan voice: The 'incredible achievement' that will set Forrest apart in Celtic history", "filename": "sport_articles_cly2717wz3eo_1747807952.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/11bf/live/35c11220-0ef4-11f0-ba12-8d27eb561761.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cly2717wz3eo_1747807952.html", "title": "The 'incredible achievement' that will set Forrest apart in Celtic history", "title_page": "Fan voice: The 'incredible achievement' that will set Forrest apart in Celtic history - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The stage is set. Having not featured in a Celtic shirt since December, James Forrest finally made his first appearance of 2025 at the weekend, and what an end to the season it could be for the one-club man.\nNow, 15 years on from his debut – a game in which he also scored his first Celtic goal – 33-year-old Forrest is poised to stand alone as our most decorated player.\nThink about that for a minute. In over 136 years of Celtic history – which includes legendary figures such as Billy McNeill, Bobby Lennox and Henrik Larsson – Forrest is likely to soon be sitting with more medals than all of them.\nIt would be an incredible achievement and one that signifies both Celtic's modern-day dominance and the sheer dedication of Forrest as a professional.\nAs it stands – following our League Cup win against Rangers in December – Forrest is alongside Lisbon Lion Bobby Lennox on 25 trophies won for Celtic, but it would be fair to give Bobby the edge given that among his haul was the most important cup of all in 1967.\nHowever, with Celtic set to clinch the Premiership in the coming weeks - and the Scottish Cup still up for grabs - Forrest will find himself top of the pile.\nTeam-mate Callum McGregor – currently on 23 trophies along with McNeill - isn't far behind and the skipper would be the first to congratulate his fellow Celtic academy graduate.\nSpeaking of which, however, there's a shorter-term accolade the talented winger will also be targeting in the coming weeks.\nSince that goalscoring debut in May 2010, Forrest has netted for Celtic in 15 straight seasons - but has yet to get off the mark this term.\nThere is a maximum of nine games remaining and, with over 100 goals and 100 assists for the club, it would be a brave move to bet against Forrest hitting the net.\nShould he do that and also lift both the Premiership and Scottish Cup then there'll be little left for our number 49 to achieve in green and white.\nBut as a player who knows nothing but Celtic that won't stop him trying to add even more accolades next season.", "url": "https://www.bbc.com/sport/articles/cly2717wz3eo"}