{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:15:36", "date_modify": "2025-05-21 05:15:36", "date_publish": "2025-04-03 17:53:00", "description": "Preston North End boss Paul Heckingbottom says he is expecting a \"totally different proposition\" from next opponents Stoke City.", "filename": "sport_football_articles_c62g4y1rv73o_1747804536.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b5e6/live/4b47a380-10b0-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c62g4y1rv73o_1747804536.html", "title": "Heckingbottom on Stoke and scheduling", "title_page": "Preston boss Paul Heckingbottom on Stoke and scheduling - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Preston North End boss Paul Heckingbottom says he is expecting a \"totally different proposition\" from next opponents Stoke City as opposed to Derby County, who they lost to on Tuesday.\n\"I looked at the team at the weekend and a lot of big players for them were back. Then, watching the game, I got a good idea of what Mark [Robins] is trying to do there.\n\"[Stoke] will come at us more with the ball in different ways. We will have to defend well, better than [against Derby], but in different parts of the game.\"\nSaturday's match against Stoke will be their third since Sunday, having lost their FA Cup quarter-final against Aston Villa before the defeat by the Rams.\nHowever, Heckingbottom is hoping that third time's a charm when it comes to earning a victory.\n\"It's always in the back of your mind when you schedule changes because of the cup competition, it's always in the back of your mind that it costs you players,\" he added.\n\"We tried to mitigate against that and we prepared and I think we've done well. We've got those freaky silly injuries, ankles, ribs, things like that which we could have done without.\n\"We will make changes again for the weekend. These are games that we are wanting win and pick up points in.\"", "url": "https://www.bbc.com/sport/football/articles/c62g4y1rv73o"}