{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 08:00:54", "date_modify": "2025-05-21 08:00:54", "date_publish": "2025-01-25 00:00:00", "description": "Kylian Mbappe scores his first hat-trick for Real Madrid as they go four points clear at the top of La Liga with victory at Real Valladolid.", "filename": "sport_football_live_cq6g7zgm00mt_1747814454.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cq6g7zgm00mt_1747814454.html", "title": "Real Valladolid 0-3 Real Madrid: Kylian Mbappe hits hat-trick to send Real four points clear", "title_page": "Real Valladolid 0-3 Real Madrid: Kylian Mbappe hits hat-trick to send Real four points clear - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Kylian Mbappe scored his first hat-trick for Real Madrid as they went four points clear at the top of La Liga with the 3-0 victory at Real Valladolid.\nThe France captain curled into the far corner from Jude Bellingham's cross in the 30th minute.\nAfter the break, Mbappe latched on to Rodrygo's pass before cutting inside and unleashing a fierce shot into the bottom corner to increase Real's lead.\nMbappe completed his hat-trick in added time, sending goalkeeper Karl Hein the wrong way from the spot.\nReal loanee Mario Martin gave away the penalty after a reckless tackle on Jude Bellingham, which led to his dismissal.\nMbappe has 15 league goals this season, behind only Barcelona's Robert Lewandowski (16) in the standings, and 22 in all competitions.\nAtletico Madrid drew earlier on Saturday and Real took full advantage to move further clear at the top while Real Valladolid remain bottom of La Liga.\nAttention now turns to the Champions League for Carlo Ancelotti's side, when they travel to Brest on Wednesday, needing a win to stand any chance of a top-eight finish.", "url": "https://www.bbc.com/sport/football/live/cq6g7zgm00mt"}