{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:16:12", "date_modify": "2025-05-19 15:16:12", "date_publish": "2015-03-06 14:05:40", "description": "Worcester Warriors stretch their winning run to 23 games as they ease to a bonus-point victory over Plymouth at Sixways.", "filename": "sport_rugby-union_31444492_1747667772.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/80869000/jpg/_80869475_465415821.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_rugby-union_31444492_1747667772.html", "title": "Worcester 29-8 Plymouth: Warriors claim 23rd straight victory", "title_page": "Worcester 29-8 Plymouth: Warriors claim 23rd straight victory - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Worcester Warriors stretched their winning run to 23 matches as they eased to a bonus-point victory over Plymouth Albion at Sixways.\nDean Ryan's side led only 7-3 at half-time, thanks to Charlie Mulchrone's converted try.\nAlbion centre Ben Woods' early second half try then put the visitors ahead.\nBut second-half tries from Chris Pennell, Max Stelling and Ben Howard maintained Worcester's one-point lead at the top of the Championship.\nAndy Symons also kicked a second-half penalty, as well as his three conversions, while Plymouth's first-half points came from a Declan Cusack penalty.\nWarriors had been temporarily knocked off the top of the Championship by Bristol's thumping eight-try 51-17 win over Nottingham on Friday night.\nBut, with five games of the league campaign to go before the play-offs kick in, Worcester hold the edge, having rallied well since losing at Bristol on the opening weekend of the season.\nWorcester: Pennell; Howard, Stelling, Symons, Vuna; Mills, Mulchrone; Rapava Ruskin, Creevy, Schonert, Williams, Thomas, Senatore, Lewis, van Velze (capt).\nReplacements: Annett, Daniels, O'Shea, Cox, Arr, Mieres, Smith.\nPlymouth Albion: Rayner; Arnott, Woods, Howley-Berridge, Henry; Cusack (capt), Davies; Fidler, Stagg, Tiedemann, Patrick, Hicks, Grace, Simmonds, Grieve.", "url": "https://www.bbc.com/sport/rugby-union/31444492"}