{"authors": ["Alex Howell", "www.facebook.com"], "date_download": "2025-05-21 07:37:30", "date_modify": "2025-05-21 07:37:30", "date_publish": "2025-03-28 12:51:45", "description": "Arsenal news: What's on Berta's to-do list?", "filename": "sport_football_articles_c8e7ep217ndo_1747813050.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/77f7/live/fc75c660-0bd2-11f0-af58-ad3b17745e6c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c8e7ep217ndo_1747813050.html", "title": "Arsenal news: What's on Berta's to-do list?", "title_page": "Arsenal news: What's on Berta's to-do list? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "There are a few immediate issues he has to deal with.\nThe main and most obvious task is to ensure that Arsenal bring in a much-needed forward. The Gunners have suffered key injuries to key attackers this season and have not brought in a forward for two transfer windows in a row.\nKai Havertz has done excellently in filling that void but at times Arsenal's need for a natural goalscorer has been obvious.\nRB Leipzig striker Benjamin Sesko has long been monitored, while Newcastle forward Alexander Isak is also being linked with a move to north London.\nHowever, Eddie Howe's Magpies are in the mix for the Champions League places, making a deal for Isak expensive and more difficult to do.\nThere is also an argument that Arteta's side could do with a player who has some flair and the ability to make something happen when they play against teams that sit in a low block against them in the Premier League.\nIt's not only incomings that Berta will need to address. It's a big summer for the club with key players Bukayo Saka, William Saliba and Gabriel Magalhaes entering the last two years of their contracts.\nBerta will need to make sure that those players are locked down so that Arteta can continue to build on the impressive work he has done with the team.\nThere are also players who need to be moved on. Oleksandr Zinchenko has dropped further down the pecking order after the emergence of Myles Lewis-Skelly and the Gunners were willing to let him go in January if they received the right offer.\nIt is an exciting project for any sporting director to come into but with the Gunners challenging for silverware in recent seasons, this summer is not something that they can afford to get wrong.", "url": "https://www.bbc.com/sport/football/articles/c8e7ep217ndo"}