{"authors": ["Brent Pilnick", "www.facebook.com"], "date_download": "2025-05-20 12:28:17", "date_modify": "2025-05-20 12:28:17", "date_publish": "2023-08-04 06:59:39", "description": "Exeter City forward Jack Aitchison says he wants to prove himself in League One after his summer move to Exeter City.", "filename": "sport_football_66394432_1747744097.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/A78C/production/_130629824_jackaithcisonpreseasontqyrex1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66394432_1747744097.html", "title": "Jack Aitchison: Exeter City forward has 'a lot more to give' in League One", "title_page": "Jack Aitchison: Exeter City forward has 'a lot more to give' in League One - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Exeter City forward Jack Aitchison wants to prove himself in League One after his summer move to the club.\nThe 23-year-old ex-Scotland youngster moved to the Grecians in the summer after leaving Motherwell.\nHe joined Barnsley in 2020 from boyhood club Celtic, but struggled to establish himself at the League One side after loans at Stevenage and Forest Green.\n\"I played 20-odd games in League One, I feel that I've got a lot more to give,\" Aitchison told BBC Sport.\n\"Barnsley was really good, but it didn't work out in the second half of the season the way I wanted.\n\"I'm feeling good, my head's good and I'm ready to go for the season,\" he added.\nAitchison set the record as Celtic's youngest player and goalscorer when he netted against Motherwell in May 2016 aged 16 years and 71 days.\nBut after two more substitute appearances and some loan spells he moved to Barnsley and helped Forest Green win the League Two title in 2022 while on loan.\n\"He has experience of coming up through the ranks at a huge football club where the demands on winning are placed on you from under-eight's or nines at Celtic and right the way through,\" Exeter boss Gary Caldwell - a former Celtic player - told BBC Sport.\n\"He's got a great mentality to the game and attributes that we felt would be a huge boost for the team in terms of his ability to receive in between the lines, his ability to press from number 10.\n\"He has a fantastic ability to score goals. I think he'd be the first to say he needs to score more goals and we feel we can help him with that and help him develop in that area.\"\nAitchison scored three times in his 20 appearances in League One last year and says he feels Exeter are capable of pushing towards the play-off places.\n\"Obviously you want to get promoted, but this season I feel it's a really tough league,\" he said.\n\"But I think we're more than capable of getting play-offs if we do the right things, believe in the manager and try and do the basics well, not to to over-complicate stuff and put added pressure on ourselves.\n\"Being out on the training pitch and seeing the depth of the squad, we're more than capable.\"", "url": "https://www.bbc.com/sport/football/66394432"}