{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:33:00", "date_modify": "2025-04-26 04:33:00", "date_publish": "2025-03-06 00:00:00", "description": "Joshua Zirkzee scores his first goal in Europe for Manchester United but the Red Devils are held to a draw by Real Sociedad to leave their Europa League last-16 tie in the balance.", "filename": "sport_football_live_ce8mgexmy35t_1745641980.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6035/live/8850e610-fac1-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_ce8mgexmy35t_1745641980.html", "title": "Real Sociedad 1-1 Manchester United: Joshua Zirkzee scores but Red Devils held in Spain", "title_page": "Real Sociedad 1-1 Manchester United: Joshua Zirkzee scores but Red Devils held in Spain - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Joshua Zirkzee scored his first goal in Europe for Manchester United but the Red Devils were held to a draw by Real Sociedad to leave their Europa League last-16 tie in the balance.\nDutch forward Zirkzee deservedly put the visitors ahead in Spain 12 minutes into the second half with a low strike from the edge of the box that caught out home goalkeeper Alex Remiro.\nBut Real Sociedad equalised through a Mikel Oyarzabal penalty, awarded after a review by the video assistant referee for a handball by Bruno Fernandes.\nManchester United will feel disappointed not to have won after they dominated the game for almost an hour, with Andre Onana not having had a save to make before the hosts were given the penalty.\nFernandes had a goal-bound strike cleared off the line by Aritz Elustondo in the first half, while the United captain also sent a free-kick just wide.\nBut Real Sociedad's equaliser appeared to unsettle Manchester United and Onana had to dive to his right to palm away Brais Mendez's 25-yard curler, before Orri Oskarsson prodded wide from close range.\nOskarsson then had a chance to win it deep into added time but Onana pushed away his goalbound effort with a strong left hand.\n\"One thing that I am sure - they're anxious to score goals and win games,\" said Manchester United boss Ruben Amorim.\n\"They are doing their best and sometimes they want to do their best, but they're not deciding the best way in their position.\"\nThe second leg will take place at Old Trafford on Thursday, 13 March.\nDespite the disappointment of conceding an equaliser, Manchester United will feel confident of progressing to the quarter-finals on home soil.\nBut the pressure will be on them as they look to keep alive their sole route to trophy success this season, with last Sunday's penalty shootout loss to Fulham in the FA Cup ending their hopes of any domestic glory.\nWhile there is no hiding the fact this campaign has been a hugely disappointing one, the Europa League has been the one shining light for Manchester United.\nThey have not lost a game in Europe this season, recording five wins and four draws, while only Galatasaray (19), Lazio and Tottenham Hotspur (both 17) scored more goals than their 16 in the League Phase.\nThis was an unusual encounter in which they looked so comfortable for so long, but could easily have succumbed to defeat, with Real Sociedad's penalty changing the momentum of the game.\nAnd should Real Sociedad go out in a week's time then Oskarsson will no doubt rue his late opportunities in this game.\nIt was a good save by Onana to deny his strike from a narrow angle in added time, but the Icelandic forward should really have put away his big chance a few minutes earlier, when he toe-poked wide from six yards when in the middle of the goal.", "url": "https://www.bbc.co.uk/sport/football/live/ce8mgexmy35t"}