{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:37:39", "date_modify": "2025-05-21 05:37:39", "date_publish": "2025-01-31 16:27:10", "description": "Under-pressure Tottenham manager Ange Postecoglou hopes the club's recent injury woes will soon be behind them.", "filename": "sport_football_articles_cx2ygv1q7klo_1747805859.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a24b/live/a99fa570-dfed-11ef-be6c-9f3ec92972af.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cx2ygv1q7klo_1747805859.html", "title": "Ange Postecoglou: Tottenham head coach says: 'Every time I've seen the light it's been an oncoming train'", "title_page": "Ange Postecoglou: Tottenham head coach says: 'Every time I've seen the light it's been an oncoming train' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ange Postecoglou has summed up Tottenham's injury troubles by saying: \"Every time I've seen the light at the end of the tunnel, it's usually been an oncoming train.\"\nBut the Spurs head coach hopes their recent injury woes will soon be behind them.\nPostecoglou, 59, is under pressure following a seven-match winless streak in the Premier League, which has included six defeats and left Spurs 15th in the table.\nKey centre-back Micky van de Ven made a welcome return from a hamstring injury in Thursday's 3-0 Europa League win over Elfsborg.\nBut Spurs were without 12 players for that match because of injury and ineligibility, and they lost substitute defender Radu Dragusin to injury on the night.\n\"We've had to deal with a real extreme situation, which unfortunately once we got hit with what we got hit with, it is then very hard to rectify on the run,\" Postecoglou said.\n\"We obviously got some significant injuries early on, which hampered our progress, and then we had to rely on a small group of players to get us through and that then burdened them.\n\"It has been this vicious cycle. [With] the volume of games that clubs are playing, we've been in an extreme situation but a lot of clubs are facing similarities in Europe.\"\nPostecoglou hopes to have goalkeeper Guglielmo Vicario, Brennan Johnson, Destiny Udogie, Wilson Odobert, Timo Werner and James Maddison available again within the next 10 days.\nHowever, defender Cristian Romero and striker Dominic Solanke are expected to require longer before returning to the squad.\nSpurs begin a significant week in their season at Brentford in the Premier League on Sunday.\nThey will then continue their pursuit of a first trophy since 2008 when they take a 1-0 first-leg lead to Liverpool in the Carabao Cup semi-finals on Thursday, before facing Aston Villa in the FA Cup fourth round at Villa Park three days later.\n\"We seem to be losing players as we get them back,\" Postecoglou said.\n\"We don't want to lose anyone else, but again, best laid plans. We obviously tried to shield Radu last night, because he had played a lot of football. He comes on and he gets injured.\n\"You can't plan for these things. We've got a big week coming up, starting Sunday. We're going to have to do it with this core group of players, so we've just got to be careful about how we go about it.\"", "url": "https://www.bbc.com/sport/football/articles/cx2ygv1q7klo"}