{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:30:47", "date_modify": "2025-05-20 13:30:47", "date_publish": "2023-08-02 00:00:00", "description": "Watch live coverage and follow text and radio commentary as London Spirit host Oval Invincibles in the 2023 Men's Hundred.", "filename": "sport_live_cricket_66306318_1747747847.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1010/production/_130621140_gettyimages-1588265631.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_cricket_66306318_1747747847.html", "title": "The Hundred 2023 LIVE: Watch London Spirit vs Oval Invincibles in men's competition plus score, commentary, video highlights & updates", "title_page": "The Hundred 2023 LIVE: Watch London Spirit vs Oval Invincibles in men's competition plus score, commentary, video highlights & updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Join us tomorrow\nThat's your lot for today, folks! After a frustrating day of rain for the most part, it's good to end it with a full game - and another one that went down to the wire.\nUnfortunately, the women's games between Welsh Fire and Manchester Originals, and London Spirit and Oval Invincibles were both washed out.\nIt looked like the men's game in Cardiff would go the same way but the rain relented in time for a 40-ball per side match.\nLuke Wells and Shaheen Afridi were the stars for Welsh Fire as they beat Manchester Originals in a close one.\nThen it was back to Lord's where it is had also dried up and Oval Invincibles got over the line with a ball to spare thanks to Sunil Narine's heroics. Read Timothy Abraham's report here.\nWe'll be back tomorrow afternoon for another double header between Northern Superchargers and Birmingham Phoenix - join us then!\n'I try and keep it simple with the ball'\nOval Invincibles' Sunil Narine, talking on BBC Two: \"I'm trying my best. It is tough coming in at the end. It is cricket and when you come out on the winning side it gives you courage and momentum.\n\"I just tried to keep calm and make contact. If you make contact you never know what is going to happen. If you miss the ball you put yourself under pressure.\n\"I've watched Nathan Ellis for so many years. He backs his slower ball. You never know what he is thinking at the top of his mark.\n\"I just keep it simple with the ball. The wickets will come. That's something I've tried to do in my career and it just continues. Once it is on the stumps the batter has to make contact with the ball. I'm just bowling stump to stump and that is the most you can ask.\"\n'Narine shows what he brings to the side'\nOval Invincibles' Sam Billings, talking on BBC Two: \"We didn't quite play to our best but it is brilliant to get two points to start off the competition.\n\"It was pretty much a red-ball pitch to start with. The way we built a partnership in the middle changed the momentum a bit. Sunil Narine just showed what he brings to the side.\n\"I want to give Sunil the real tough overs, where we need to make a positive change and take a wicket. I want to spread his overs. I thought Nathan Sowter was brilliant today. You know they are going to come hard at him as the second spinner but he did brilliantly.\n\"Shoutout to the groundsman for getting a full game in.\"\n'We were 10-15 short'\nLondon Spirit captain Dan Lawrence talking on BBC Two: \"It was one of them where I thought we were 10-15 short at the half way point. That's fine, it can happen at Lord's. I thought we bowled amazing to almost defend 130. You are only a four or six away in short-format cricket.\n\"It was a really tough chance for Daryl Mitchell at the end. It might have been different if he'd caught, who knows. It's life and we'll move on.\n\"It's been great to captain. I'm new to it but I've learnt a lot from Eoin Morgan, Baz McCullum and Ben Stokes. I'm putting in bits of them and putting my own spin on it.\n\"We can definitely turn it round, we've got such a talented group of lads. It was promising and it would have been great to get over the line but it wasn't meant to be.\"\n'We know we can play a lot better'\nOval Invincibles captain Sam Billings, speaking on Sky Sports: \"We had a couple of bits of luck. You just need that sometimes. The rhythm of the game definitely differs to T20 in the field. But also as bowlers and batters, getting ahead early in the set is so key.\n“I thought the bowlers were outstanding throughout and we took 3-19 at the end - that really changed the game.\nOn recovering from losing early wickets: \"Initially it's about getting partnerships when you lose early wickets but also exerting pressure. Someone like Sammy Curran is great because he's a 360 player. You've just got to be flexible.\n\"It's taken me a bit of experience and time to learn that. We've got the players to do that and it's great that we just got over the line tonight.\n\"Everyone can take a huge amount from it, in the last couple of years those games have gone the other way. We know we can play a lot better than that but getting the win, we can take a lot from that.\"\nPost\nOval Invincibles' Sunil Narine, speaking on Sky Sports: \"When you bowl in the middle overs and pick up wickets, it makes it easier for the next guy coming in. Those wickets from Nathan Sowter put us in a good position and we took it forward.\n\"You try to win as many games as possible. When you win the close ones it's good for your momentum. Winning early helps you going forward in the tournament.\"", "url": "https://www.bbc.com/sport/live/cricket/66306318"}