{"authors": ["Adam Lanigan", "www.facebook.com"], "date_download": "2025-04-26 03:50:35", "date_modify": "2025-04-26 03:50:35", "date_publish": "2025-03-05 12:36:23", "description": "Six games into his tenure, Wales legend Mark Hughes is on a mission to keep Carlisle United in the English Football League.", "filename": "sport_football_articles_c9deg8p4p6eo_1745639435.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f1e7/live/2b65fcd0-f9ac-11ef-b257-2b725ccbdd87.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c9deg8p4p6eo_1745639435.html", "title": "Carlisle United: Wales legend Mark Hughes relishes battle to keep club in EFL", "title_page": "Carlisle United: Wales legend Mark Hughes relishes battle to keep club in EFL - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "During a career in football of over 40 years, as a player and manager, Mark Hughes has never been one to shy away from a challenge.\nAnd challenges don't come much bigger at the moment than trying to keep Carlisle United in the English Football League.\nA club looking for its third boss of the season, and staring at successive relegations, would be enough to put many off, but not Hughes.\nAfter a month at Brunton Park, with the team on an unbeaten run of four games, something has reignited the fire that has always burned within the Welshman.\nHughes had been out of work since his spell at Bradford City ended in October 2023 when the phone call came early last month from Carlisle.\nThe Blues had hit rock bottom with a 5-1 home defeat to Swindon Town which resulted in the dismissal of previous head coach Mike Williamson.\nThat Williamson was sacked on transfer deadline day after being permitted to bring in 11 players during the window properly encapsulated a feeling of chaos around the situation.\nAt that point, Carlisle were five points from safety, bereft of confidence and staring at National League football for the first time since 2005.\nNot an easy task for anyone, but in Hughes, the club's American owners brought in a man with a storied history.\nThere was his glorious playing career with Manchester United, Chelsea, Blackburn Rovers, Wales and others.\nAnd he also achieved 466 games as a Premier League manager for six clubs, eight top-half finishes and wins against the likes of Sir Alex Ferguson, Jose Mourinho and Arsene Wenger.\nAfter starting with two narrow defeats, Hughes has stemmed the bleeding with a run of three draws and a derby win at Barrow.\nThe gap to survival has narrowed to three points and there is growing belief that they can find a way to escape.\nCarlisle remain bottom, but Morecambe are only two points ahead and Tranmere three and within their sights.\nPerformances have improved markedly with Hughes getting buy-in from his players and backing from the club's long suffering and loyal supporters.\n\"You've just got to try and get messages across and the lads are responding,\" he said.\n\"They've been great since me and Glyn (Hodges) came into the building. They are trying to make things happen, and for the most part, they are trying to do what we tell them.\n\"Everyone is pulling in the right direction which is what we need, given the situation we find ourselves in.\n\"The fans can see we're trying to affect the game in the right way and that we're getting more positive results which was important, so we just have to keep going.\"\nNow 61, Hughes could have been holidaying in the Caribbean or living off past glories, but instead he was kicking every ball and contesting decisions on a Tuesday night at Brunton Park against League Two leaders Walsall.\nA switch to a back three was not working early on and with Carlisle one goal down and looking like they might be overrun, he changed to a four and they promptly equalised.\nWalsall had the better chances to win after that and hit the post, although the hosts almost won it in injury time.\nBut the display was enough to earn Hughes' side a good ovation as they left the pitch, with fans recognising the difference the Welshman has made, even if three home games have produced three consecutive draws.\nIt is worth noting that the starting line-up on Tuesday included just three of the 11 players who joined the club in January.\nNext up is a trip to Harrogate Town on Saturday, one of a number of fixtures against teams that Carlisle will hope to drag into the relegation battle.\nAnd Hughes is desperate to keep things moving in the right direction.\n\"We can feel the confidence growing,\" he said.\n\"We're four games unbeaten and sides at the bottom of the Football League don't normally go on runs of that length.\n\"We have to try to maintain that and add a few more wins to the draws. But I'm more than confident that we have the capability, so we just have to go out and do it.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c9deg8p4p6eo"}