{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:45:35", "date_modify": "2025-05-21 06:45:35", "date_publish": "2025-03-30 16:53:52", "description": "Critchley will 'live and die' by his principles of play", "filename": "sport_articles_c39jkp84gdeo_1747809935.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5a66/live/9fadc670-0d86-11f0-90c7-5b6be6271dbf.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c39jkp84gdeo_1747809935.html", "title": "Critchley will 'live and die' by his principles of play", "title_page": "Critchley will 'live and die' by his principles of play - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Neil Critchley said he will \"live and die\" by the principles of how he wants Hearts to play football, after they succumbed to a 3-0 loss against Celtic.\nThe Gorgie side started brightly at Celtic Park but soon lost three first-half goals and failed to land a punch on Celtic after that.\nThat led to Hearts boss Critchley admitted he was looking for \"damage limitation\" ahead of an uneventful second half.\n\"I don't want the players to lose belief in who I want us to be,\" he said. \"In my opinion, as a coach, you always have to protect or develop the traditions of the football club.\n\"It's always been built on going toe-to-toe, being on the front foot, being aggressive. We'll learn from that.\"\nHearts failed to have a shot between the 38th and 87th minute in the game, as they struggled to create anything in the second-half.\n\"I want us to be that team and get better at being the team we were in the first half and doing that for longer, and doing it better and doing it against top opponents.\n\"That's what we've got to strive for. That's where we want to be and this is the type of teams we want to be playing against and competing against for longer every week. That's my test as a coach and that's where I want us to move forward as a club.\n\"The principles of how we play the game, I will live and die by that and protect those principles that I think represent the club that I think we should be.\"", "url": "https://www.bbc.com/sport/articles/c39jkp84gdeo"}