{"authors": ["Adonis Storr", "www.facebook.com"], "date_download": "2025-05-21 08:02:01", "date_modify": "2025-05-21 08:02:01", "date_publish": "2025-05-19 16:10:34", "description": "Leeds United fan writer Adonis Storr says fans must trust Daniel Farke to bring in the right characters following promotion.", "filename": "sport_football_articles_c4gk2731rjno_1747814521.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4804/live/45c35930-34c4-11f0-96c3-cf669419a2b0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c4gk2731rjno_1747814521.html", "title": "Leeds United opinion: Fans must trust Daniel Farke over signings", "title_page": "Leeds United opinion: Fans must trust Daniel Farke over signings - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Leeds have been linked in recent days with out-of-contract players with Premier League experience and, among fans, the names have provoked a mixed response.\nThis is arguably the most important transfer window in the club's history and United must make every single signing count if they are to cement their place in England's top tier next season.\nSo caution is justified, but free agents have worked for Daniel Farke in the past.\nIn his first season in charge, Farke brought Sam Byram back to the club. An academy product, Byram's time away from Yorkshire was ravaged with injuries.\nWhen rumours emerged of a potential return, some questioned whether his best days were behind him.\nBut in the past two seasons Byram has played almost as many league games (69) as he did in total during his eight years away from Leeds (80), and he has been a solid performer.\nAnd when Ethan Ampadu and Illia Gruev got injured within the space of 70 minutes of football last September, United went looking for an emergency defensive midfielder and signed out-of-contract Josuha Guilavogui.\nIn Guilavogui they found more than a back-up player. The farewell messages written on his final matchday shirt indicate the impact he had on team morale.\nBrenden Aaronson wrote: \"Best mate, best player here, love you g\", Jayden Bogle wrote: \"The best human I have ever met\", another wrote: \"My brother, leader, legend, what a man you are mate\".\nThere is caution among the fan base and rightly so about some of the names Leeds have been linked with over the past few weeks - and an acceptance that Leeds need to be shopping in a different market than previous seasons.\nBut with a young side, Premier League experience is needed and hard to come by, and Leeds must trust Farke to find the right characters for the squad.", "url": "https://www.bbc.com/sport/football/articles/c4gk2731rjno"}