{"authors": ["Matt Gault", "www.facebook.com"], "date_download": "2025-05-21 04:17:27", "date_modify": "2025-05-21 04:17:27", "date_publish": "2025-04-05 17:14:06", "description": "Josh van der Flier credits his team-mates after being named player of the match in Leinster's remarkable 62-0 trouncing of Harlequins in Saturday's Champions Cup last-16 game at Croke Park.", "filename": "sport_rugby-union_articles_cz01l4rydveo_1747801047.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/78ad/live/097dd0e0-1241-11f0-9d46-3377f28968f3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cz01l4rydveo_1747801047.html", "title": "Leinster 62-0 Harlequins: Josh van der Flier credits team-mates after starring in resounding Croke Park win", "title_page": "Leinster 62-0 Harlequins: Josh van der Flier credits team-mates after starring in resounding Croke Park win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Josh van der Flier was quick to credit his team-mates after being named player of the match in Leinster's 62-0 trouncing of Harlequins in Saturday's Investec Champions Cup last-16 game at Croke Park.\nBack row Van der Flier was one of several Ireland internationals playing for the first time since the Six Nations.\nAnd the 2022 world player of the year began the last run of games before Andy Farrell's British and Irish Lions squad announcement on 8 May in superb fashion with a try and some big carries as the Irish province overwhelmed their Premiership opponents.\nAdmirably uninterested in soaking up the acclaim, though, Van der Flier insists he was able to flourish only because of the work done by those in blue around him.\n\"It was nice to get the ball a few times,\" said the 31-year-old.\n\"It's the way some games go, some games the ball comes your way a lot, some days it doesn't. I think there was a huge amount of work from the forwards and the backs found the width.\n\"I managed to find myself in places where I had one-on-ones or a bit of space, so I think it's off the back of some good teamwork that some individuals are able to get some space. It was good to get the ball a bit but there was some good attacking work from all of the lads.\"\nLeinster scored 10 tries to set up a home quarter-final against either Glasgow or Leicester next weekend and Van der Flier says the manner of Saturday's win will give the four-time champions \"great confidence\".\n\"Mentally, there's always a threat of forgetting how hard we had to work during the week to get there and forgetting the first 10, 20 minutes when we had to work unbelievably hard to keep them out,\" he added.\n\"You always have to balance it mentally, take the confidence in a positive way and make sure you're switched on and ready because some games can be like that but some are tight and can go the other way.\n\"We'll be ready for anything start again on Monday with a big week's prep.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/cz01l4rydveo"}