{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:43:15", "date_modify": "2025-05-21 03:43:15", "date_publish": "2025-04-06 16:24:18", "description": "Hearts 0-1 Dundee United: What the manager said", "filename": "sport_articles_c20xklz524wo_1747798995.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1d2d/live/5bc7c840-1301-11f0-baa6-cf6d1e060075.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c20xklz524wo_1747798995.html", "title": "Hearts 0-1 Dundee United: What the manager said", "title_page": "Hearts 0-1 Dundee United: What the manager said - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Hearts head coach Neil Critchley: \"Yeah, disappointed with the outcome, not with the way we played the game. I thought we were by far the better team with 11 men, arguably the better team with 10 men.\n\"We created more chances, more shots, and we just didn't take them, our quality let us down.\n\"Obviously, the red card has a huge bearing on the outcome in the game. The only one clear opportunity that they probably created from our mistake, that's on us.\n\"We gave Dalby too much room in the box, and he scored, and he punished us, and that's really the story of the game.\n\"We went right to the end, the spirit of the players and the effort was fantastic and [top six is] still in our hands, that's the most positive thing.\n\"I thought we played in a really good manner, positive, won the ball back off them a lot of times, played some really good football, and it was just our bit in the final third that we, for some reason, mistime things or rush things.\n\"We just need to show a little bit better quality and composure in the final third, and I think we would have been probably a good one or two goals up at that point.\"\nOn James Wilson's red card, he adds: \"My initial reaction is it wasn't a red card, I have to be honest, I thought he goes.. The ball gets away from him, he makes a genuine attempt to win the ball and I thought he actually got a little bit of the ball.\n\"His follow-through, obviously when you're sliding in there's going to be a natural follow-through, and he catches the player. You could say it's a little bit high and mistimed, so on reflection, I can understand the decision and James, he has to take his medicine and learn from it.\"", "url": "https://www.bbc.com/sport/articles/c20xklz524wo"}