{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:50:32", "date_modify": "2025-04-26 06:50:32", "date_publish": "2025-03-01 00:00:00", "description": "England's Champions Trophy campaign ends with a third successive defeat as Jos Buttler's side are thrashed by South Africa in Karachi.", "filename": "sport_cricket_live_c4g3903q3z3t_1745650232.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/60c6/live/4cd097f0-f69a-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_cricket_live_c4g3903q3z3t_1745650232.html", "title": "Champions Trophy LIVE: South Africa vs England, Karachi", "title_page": "Champions Trophy LIVE: South Africa vs England, Karachi – cricket score, radio commentary, video highlights & updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Goodbye\nWell, thanks for your company despite the nature of England's performance. As Jos Buttler said, there is some time now before their next international outing as the one-off Test match against Zimbabwe and a white-ball series against West Indies take place in May.\nWe know there will be no Buttler at the helm, but other changes are surely to be expected.\nIf you missed any of today's action, Matthew Henry's match report has got you covered and keep an eye on BBC Sounds for the Test Match Special podcast, too.\nBut we'll be back tomorrow for the final group stage match between India and New Zealand at 9:00 GMT, which will decide who plays who (and where) in the semi-finals.\nBetween two of the form teams, it promises to be a cracker, so join us then!\n'We've got a great squad with great options' - Markram\nSouth Africa captain Aiden Markram: \"The boys were really good. The wicket was quite slow, slower than we expected, and changed our initial plans. The boys adapted to the conditions out there and through that, we were able to take wickets throughout the innings and keep the momentum.\"\nOn Marco Jansen: \"He's been huge for us. We all know in the powerplay you need to be taking wickets up front and he finds different ways of doing it. He's been peaking at the right time for us and is leading the attack with Kagiso Rabada really well.\"\nOn Heinrich Klaasen: \"It's great to see him out in the middle. He's been in a ridiculous patch of form and for him to walk out after a little niggle and look like he's never left is great for us.\"\nOn potentially playing a semi-final in Dubai: \"We'll have to see when we get there what conditions are going to be like. We've got a great squad with great options and ultimately, we'll pick the squad to get the job done on the day.\"\nPost\nVic Marks\nFormer England spinner on BBC Radio 5 Sports Extra\nThere is an issue with personnel. 50-over is a different game to T20 cricket. Most of the sides tend to have their Test openers in the 50-over side.\nI'm not sure Salt is the type of player for this kind of cricket. He can be devastating but he looks out of form and does not have the ability to stay at the crease for long periods of time.\n'I believe it can be turned around'\nEngland captain Jos Buttler: \"That was a really disappointing performance. We were so far short of the mark there.\n\"It was a decent surface, a bit slow and two-paced at times. Joe Root, Ben Duckett and Harry Brook got us into decent positions but we're just not going on and making those big telling contributions, which has been the story of this side for a little while now.\n\"I don't know why. As a whole group, not just batters, we're not getting the results and that does take away your confidence. It's time for everyone to get away, get a change of scenery and work hard wherever cricket takes you next. From this point forward, there is a huge opportunity for people inside and outside the dressing room to really put their hand up and say they want to be part of the rebuild of this white-ball team.\n\"There is no doubt that the talent is there, there is all the makings of a really good side so I do believe it can be turned around. I'm sure Brendon and the guys at the top will formulate some plans and then it's down to individuals as well to put a marker down and be part of something moving forward to get the team back to where it should be.\"\nPost\nChris Woakes\nEngland all-rounder on BBC Sounds\nJos [Buttler] will be disappointed. It's not the way he will have wanted to sign-off. They haven't shown what they are capable of. On paper, this is a team that no-one should want to come up against. But they are just struggling to perform at the moment.\nA new voice is needed, but Jos is still one of the best players in the world and will still be integral to this England side.\n'We're going to rest up and take the win' - Jansen\nPlayer of the match Marco Jansen: \"Obviously it's a good feeling. The boys worked very hard. It's not the easiest conditions from a bowling point of view and even through it suits batting, it's not easy to bat for 50 over.\n\"There was no swing but I'm happy with my [bowling] performance. I used my options well and restricted them from scoring quickly.\"\nOn his catch to dismiss Harry Brook: \"I saw the ball going up and I was just trying to get as close to it as I could. Luckily, I got there quite easily and took the catch.\"\nOn waiting to find out whether they'll face India or New Zealand in the semi-finals: \"I just want to go to sleep now. We'll take it as it comes tomorrow. We're just going to rest up and take the win.\"", "url": "https://www.bbc.co.uk/sport/cricket/live/c4g3903q3z3t"}