{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:08:44", "date_modify": "2025-05-20 12:08:44", "date_publish": "2023-08-05 09:55:53", "description": "Four players score hat-tricks in the Women's Premiership as leaders Glentoran retain a six-point gap over their nearest challengers.", "filename": "sport_football_66415619_1747742924.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7D38/production/_130665023_joelyandrews.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66415619_1747742924.html", "title": "Women's Premiership: Four hat-tricks in full programme of Friday night action", "title_page": "Women's Premiership: Four hat-tricks in full programme of Friday night action - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Four players scored hat-tricks as Friday's five Women's Premiership game produced goals aplenty.\nSecond-placed Cliftonville duo Danielle Maxwell and Marissa Callaghan both scored three as their side comfortably saw off Derry City Women 8-1.\nThe Reds sit six points behind leaders Glentoran Women, for whom Joely Andrews grabbed a treble in a 5-0 victory over Mid Ulster Ladies.\nLarne's Erin Montgomery netted three in her side's 3-2 win over Lisburn Ladies.\nMontgomery was making her debut for Donald Malomo-Paris' side.\nElsewhere, Crusaders Strikers moved above Linfield Ladies into fourth place in the table with a 2-0 win over the Blues and third-placed Sion Swifts kept up their title challenge by beating Ballymena United Women 4-0.\nDarcie McNeill was on target twice for Linfield, scoring a goal in each half.\nLouise McDaniel and Katie Markey were Cliftonville's other scorers, with Abby Alexander netting a consolation for Derry City.\nStrikes from Megan Neill and Kerry Beattie set Glentoran on their way to a convincing triumph, followed by that hat-trick from Andrews within the space of a quarter of an hour late in the game.\nMorgan Shannon and Stacey Murdough got their names on the scoresheet for Lisburn Ladies at the Bluebell Stadium, but Montgomery's three goals, including a spectacular winner, carried the day for Larne.\nIt was a good night for Sion Swifts Ladies as they hit four goals without reply past Ballymena United Women at the Melvin Sports Complex.\nGoals from Chelsea Sheerin and Chloe McGlade inside the opening 20 minutes fired the Swifts into a strong position, with Caoirse Doherty and Naomi McLaughlin wrapping the scoring up in the latter part of the second half.", "url": "https://www.bbc.com/sport/football/66415619"}