{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:11:09", "date_modify": "2025-05-21 04:11:09", "date_publish": "2024-12-29 00:00:00", "description": "Dango Ouattara comes off the bench to rescue a point for Bournemouth at Fulham as both sides take their unbeaten runs to seven Premier League games.", "filename": "sport_football_live_cr4rkp76p52t_1747800669.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cr4rkp76p52t_1747800669.html", "title": "Fulham 2-2 Bournemouth: Dango Ouattara scores a late leveller at Craven Cottage", "title_page": "Fulham 2-2 Bournemouth: Dango Ouattara scores a late leveller at Craven Cottage - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Dango Ouattara came off the bench to rescue a point for Bournemouth at Fulham as both sides took their unbeaten runs to seven Premier League games.\nWith the Cherries pushing forward in search of a late leveller, Outtara latched on to a loose ball in the box in the 89th minute and produced a cheeky dink over the onrushing Bernd Leno.\nHarry Wilson thought he had given Fulham all three points in the 72nd minute with a superb header from Antonee Robinson's tempting ball into the box.\nMexican striker Raul Jimenez scored his sixth goal of the season to put the hosts ahead in the 40th minute after he capitalised on some poor Cherries defending from a corner.\nBournemouth made it 1-1 six minutes into the second half when Evanilson ended his barren run of seven games without scoring, producing an expertly executed finish from a tight angle.\nIn a feisty affair, Fulham were incensed in the first half when Cherries midfielder Ryan Christie avoided a red card for a studs-up tackle on Robinson, but the video assistant referee (VAR) review deemed a yellow card sufficient.\nMarco Silva's side may well be disappointed not to have claimed victory in an entertaining encounter, with Jimenez coming close to a second goal, but Dean Huijsen was positioned well to head off the line.\nWith his earlier effort, though, the Fulham forward became the joint-highest scoring Mexican in the Premier League as he drew level with former Manchester United and West Ham frontman Javier Hernandez on 53.\nFulham, who are in eighth place, host Ipswich Town next on 5 January, while sixth-placed Bournemouth welcome Everton to Vitality Stadium a day earlier.\nBournemouth fans love manager Andoni Iraola and it is no surprise at all. The Spaniard has taken the Cherries to lofty heights as they sit in sixth spot and their eyes firmly on European football for next season.\nThey started the game on the front foot and peppered Bernd Leno's goal, with efforts from David Brooks and Antoine Semenyo forcing fine saves from the German.\nAfter Fulham had taken the lead five minutes before the break, Bournemouth came out determined to put things right and equalised through a fabulous Evanilson finish.\nAnd they always pressed for the win, with Philip Billing missing a good chance, and pushing forward even after going behind again.\nThat never-say-die attitude came through at the end when Ouattara was the calmest man in the stadium as he lifted a lovely finish over Leno.\nWith their unbeaten run still intact, Iraola's side are now only a point adrift of defending champions Manchester City in fifth as they continue to grow under him.\nIn one of the most competitive Premier League seasons in recent memory, Fulham are also banging on the door for European football for next term.\nThe Cottagers have come through a tough December, with games against title hopefuls Arsenal, Liverpool and Chelsea, unscathed and now have reason to believe they can give their fans European football next season.\nThey would have overtaken Bournemouth in sixth spot had they held on to their lead, but are just two points off Manchester City.\nFulham are enjoying their best run of form under manager Silva after making it seven unbeaten in the league and he will want that to continue in the second half of the campaign.\nIt has been a year of improvement under him, with left-back Robinson attracting admirers for his impressive work in defence and attack, and Wales winger Wilson coming to the fore with his second goal in successive games.", "url": "https://www.bbc.com/sport/football/live/cr4rkp76p52t"}