{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:22:20", "date_modify": "2025-04-26 06:22:20", "date_publish": "2025-03-04 00:00:00", "description": "Bobby Kamwa scored a hat-trick for the second time this season as Newport County earned a League Two victory over Gillingham at Rodney Parade.", "filename": "sport_football_live_cm2nnr4j07pt_1745648540.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_cm2nnr4j07pt_1745648540.html", "title": "Newport County 3-1 Gillingham: Bobby Kamwa hat-trick earns Exiles victory", "title_page": "Newport County 3-1 Gillingham: Bobby Kamwa hat-trick earns Exiles victory - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Bobby Kamwa's second hat-trick of the season helped Newport County end their three-game winless run with victory over Gillingham.\nThe Exiles had not scored in their past three matches but took the lead after just eight minutes at Rodney Parade as Kamwa brilliantly curled a free-kick into the net from the edge of the 18-yard box.\nNelson Jardim's side doubled their lead as Kamwa latched on to David Ajiboye's lofted ball before lobbing goalkeeper Glenn Morris.\nAnd Kamwa completed his treble after just 30 minutes as he got a vital touch on Cameron Antwi's driven strike.\nJimmy-Jay Morgan gave John Coleman's side hope in the 69th minute as he headed into the net after Nick Townsend had denied Armani Little.\nBut Newport saw out the latter stages as they rose to 15th in the League Two table.\nGillingham - who are winless in eight away league games - sit 19th.\nNewport County head coach Nelson Jardim told BBC Radio Wales:\n\"It was a good game, especially the first half.\n\"It was just important to get back to winning ways, especially in the way we've done today.\n\"I mentioned last week that we are fighting for our lives and for next season, and the only way of doing that is finishing well this season.\"\nGillingham boss John Coleman told BBC Radio Kent:\n\"I'd like to apologise to the travelling fans for the result. Naivety in our defending in the first-half, I could see after three minutes it was too wide open.\n\"Normally you come away from home and get a foothold in the game; it's been our strength all season, we've defended solidly.\n\"Today we didn't and I've tried to get the information on to tighten up, maybe I've gone too gung ho with our approach for the game, so I have to take responsibility for that.\"", "url": "https://www.bbc.co.uk/sport/football/live/cm2nnr4j07pt"}