{"authors": ["Mark Mitchener", "www.facebook.com"], "date_download": "2025-05-21 05:35:06", "date_modify": "2025-05-21 05:35:06", "date_publish": "2025-04-02 14:50:08", "description": "Bournemouth news: Opinion - Andoni Iraola team selection", "filename": "sport_football_articles_cy70dge5pv4o_1747805706.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f341/live/53a1e480-4835-11ef-b74c-bb483a802c97.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy70dge5pv4o_1747805706.html", "title": "Opinion - Andoni Iraola team selection - BBC Sport", "title_page": "Bournemouth news: Opinion - Andoni Iraola team selection - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Bournemouth's FA Cup adventure is over, but as April begins, they find themselves in a situation for which most fans would have settled at the start of the season.\nWith nine games to go, despite only taking one point from their past four league games, they are only three points away from a likely European qualification spot.\nAndoni Iraola's side face two games in the space of four days against 18th-placed Ipswich and 16th-placed West Ham as they seek a first league win since mid-February.\nThey will welcome back defenders Dean Huijsen and Milos Kerkez, who both missed the FA Cup quarter-final through suspension.\nBut while fellow defenders Marcos Senesi and Adam Smith also made comebacks in the cup after several months on the sidelines, handing Iraola more options in defence than he had for most of the winter, the Cherries have depth concerns further forward.\nMarcus Tavernier missed the cup game with injury, while Iraola reported on Tuesday that Justin Kluivert was a doubt to face Ipswich. With Luis Sinisterra already back in the treatment room and Enes Unal out for the season, suddenly attacking options look limited.\nAnother potential selection headache involves possible suspensions. Ryan Christie and Antoine Semenyo are now both on nine yellow cards in the Premier League - though Christie has been walking that tightrope for a while, while also attempting to manage a groin problem that is llikely to need surgery in the summer.\nA 10th caution for either player in the next three games - against Ipswich, West Ham or Fulham - would mean a two-match ban as the cut-off point for 10 bookings is each team's 32nd league game.\nThankfully for Iraola, no other player has more than six league cautions to his name, so only Christie and Semenyo are at risk of totting up 10 before the deadline.", "url": "https://www.bbc.com/sport/football/articles/cy70dge5pv4o"}