{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:38:26", "date_modify": "2025-04-26 06:38:26", "date_publish": "2025-03-02 17:09:34", "description": "Gloucester-Hartpury will face Saracens in the final for a third Premiership Women's Rugby title after they defeat Bristol Bears.", "filename": "sport_rugby-union_articles_cz7v0q59x4yo_1745649506.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7681/live/53ce4f50-f787-11ef-a7e0-1fbd7c9e9e6f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_cz7v0q59x4yo_1745649506.html", "title": "Premiership Women's Rugby: Gloucester-Hartpury beat Bristol to secure final spot", "title_page": "Premiership Women's Rugby: Gloucester-Hartpury beat Bristol to secure final spot - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Defending champions Gloucester-Hartpury will face Saracens in the Premiership Women's Rugby final after they defeated Bristol Bears 36-20 at Queensholm.\nZoe Aldcroft and Emma Sing were among Gloucester-Hartpury's five try scorers, and they also kicked four of the conversions to none from the visitors.\nAmerican superstar Ilona Maher marked her final appearance for the Bears with one of their four tries, after joining the club in January.\nGloucester-Hartpury, who topped the league table again, will now look to secure a record third consecutive title in the final at the StoneX Stadium on 16 March.\n\"That game was an outstanding advert for women's rugby,\" Gloucester-Hartpury head coach Sean Lynn told BBC Radio Gloucestershire.\n\"You had it all - ball in play, the physicality, the territorial, the tactical game, it was outstanding and I'm hoping that we keep people coming to watch these games.\"\nThe match – at a renamed Kingsholm Stadium – was a repeat of last season's final and as they did last June the Bears came out dominating possession and territory, pinning the hosts inside their own half for the first 15 minutes.\nThey were rewarded when Lark Atkin-Davies spun out of a maul in the corner to open the scoring, and the England hooker doubled their advantage nine minutes later in the same fashion in the opposite corner.\nGloucester-Hartpury, however, showed their patience and clinical ruthless best, scoring on each of their first three visits to the Bears 22, with El Perry and Sarah Beckett both powering over.\nAnd when Bristol were reduced to 14 after number eight Evie Gallagher was sent to the sin-bin before the break, Sing darted through to make it 19-10.\nBristol were the last side to beat Gloucester-Hartpury in the league back in November and they stayed in the contest. Simi Pam broke through the hosts' line and a quick ball out wide found Maher to score her fourth try in seven matches.\nBristol had a bumpy path into the play-offs, having to rely on results elsewhere going their way to finish the regular season in fourth.\nHead coach Dave Ward has now seen his team twice beaten in the semi-finals and once in the final since he was appointed, with the title still proving elusive.\n\"We conceded some soft tries and that's probably been the story of our season unfortunately,\" Dave Ward told BBC Radio Bristol.\n\"It's a tough one to take right now, I'm incredibly proud of all the effort of the girls the way we even battled back to get in the semi-final was incredible.\n\"We'll come back again next year, we're still fighting for this title and we won't stop until we've got it.\"", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/cz7v0q59x4yo"}