{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:22:45", "date_modify": "2025-05-21 07:22:45", "date_publish": "2025-03-28 16:24:20", "description": "British teenager Matthew Brennan sprints to his second win of the Volta a Catalunya on Thursday's fifth stage.", "filename": "sport_cycling_articles_cm2d2l38g81o_1747812165.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2c16/live/b51a18f0-0be8-11f0-8ae9-2975efdc7f47.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cycling_articles_cm2d2l38g81o_1747812165.html", "title": "Volta a Catalunya: Great Britain's Matthew Brennan wins stage five", "title_page": "Volta a Catalunya: Great Britain's Matthew Brennan wins stage five  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "British teenager Matthew Brennan sprinted to his second stage win of the Volta a Catalunya.\nThe Visma-Lease a Bike rider, 19, edged past Dutchman Tibor del Grosso (Alpecin-Deceuninck) to clinch stage five in three hours, 28 minutes and 14 seconds.\nBrennan previously won the first stage of the race in a stunning sprint finish for his first World Tour victory.\nThursday's 172km fifth stage favoured the sprinters with only one categorised climb, but they were affected by strong winds in the final 20km.\n\"We've worked all day and we knew it would be a little bit hectic coming into the final stretch,\" Brennan said.\n\"I think the whole team was there [at the end] and we came into the finish in a good position. I'm so happy that I could finish off for them.\"\nSpain's Juan Ayoso, racing for UAE Team Emirates XRG, keeps his place at the top of the general classification but Red Bull-Bora-hansgrohe's Primoz Roglic has narrowed the gap between them to just one second.\nThe pair are pulling ahead with another Spaniard, Enric Mas, 21 seconds behind in third place.\nStage six, the penultimate day of the race, moves to the mountains for a 159km stretch.\nAlso on Friday, Mathieu van der Poel won the E3 Saxo Classic in Belgium for the second successive year.\nThe Dutch Alpecin–Deceuninck rider launched a solo attack from 38km out to seal his third win from three races this season, crossing the line more than one minute before Lidl-Trek's Mads Pedersen.\nIneos Grenadiers rider Filippo Ganna was a further 59 seconds back.", "url": "https://www.bbc.com/sport/cycling/articles/cm2d2l38g81o"}