{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:07:49", "date_modify": "2025-05-21 06:07:49", "date_publish": "2025-02-08 18:01:53", "description": "Bristol Bears move to fourth in the Premiership Women's Rugby after securing a comfortable 45-17 victory over Exeter Chiefs.", "filename": "sport_rugby-union_articles_cx2pxgn7wq6o_1747807669.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5067/live/3fe27de0-e643-11ef-bd2f-4722c55e5657.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cx2pxgn7wq6o_1747807669.html", "title": "Premiership Women's Rugby: Bristol Bears beat Exeter Chiefs and Trailfinders defeat Sale Sharks", "title_page": "Premiership Women's Rugby: Bristol Bears beat Exeter Chiefs and Trailfinders defeat Sale Sharks - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Bristol Bears moved up to fourth place in the Premiership Women's Rugby and boosted their play-off hopes with a comfortable 45-17 victory over Exeter Chiefs.\nFour first-half tries at Ashton Gate secured Bristol an early bonus point.\nExeter, who slip from fourth to fifth, are three points behind Bristol with a game in hand.\nBristol hooker Lark Atkin-Davies scored a hat-trick of tries, Olympic bronze medallist Ilona Maher added two and scrum-half Keira Bevan and lock Abbie Ward were also on the scoresheet.\nAmerican Maher, 28, signed for Bristol on a three-month deal in December to help her chances of making the US team for the 2025 Women's Rugby World Cup this summer.\nAlso on Saturday, Trailfinders took a step towards a top-six finish by beating bottom side Sale Sharks 33-20.\nTries by Kate Zackary, Grace White and Abi Burton, plus two by Julia Schell, secured a bonus point win for the visitors.\nTrailfinders are two points behind sixth-placed Loughborough Lightning with a game in hand.", "url": "https://www.bbc.com/sport/rugby-union/articles/cx2pxgn7wq6o"}