{"authors": ["Sandy Ryan", "www.facebook.com"], "date_download": "2025-05-21 07:45:58", "date_modify": "2025-05-21 07:45:58", "date_publish": "2025-03-28 08:25:30", "description": "Following on from Mikaela Mayer's column, Briton Sandy Ryan tells her side of the 'paint-gate' story before last September's welterweight title fight in New York.", "filename": "sport_boxing_articles_cp3y66nqxz7o_1747813558.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/564d/live/27618f50-0654-11f0-a36a-5754f8f333df.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_boxing_articles_cp3y66nqxz7o_1747813558.html", "title": "Mikaela Mayer vs Sandy Ryan: Briton Sandy Ryan relives her paint attack in New York", "title_page": "Mikaela Mayer vs Sandy Ryan: Briton Sandy Ryan relives her paint attack in New York - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "I was heading to the venue as usual on a fight night, meeting my team in reception and getting ready to go to the venue.\nSuddenly, I got hit with a can of paint and when I looked up there was a guy running back to his car. You could call it a hit and run.\nThat was three hours before the fight took place - it wasn't the usual fight night.\nI didn't see the person coming. I looked down, saw red. It was a bit of a shock at the time.\nEveryone around me must have been in shock because no-one chased him. It would have been a lot different if my brother Dave was there - and he will be there on Saturday.\nI didn't see anything suspicious but there were two people from Mikaela's team lingering around the bar and at reception when we were coming down to the car.\nWe didn't think anything of it at the time, though, because we were all staying in the same hotel.\nI went back up to my room to change and shower and then I had a security guard with me when we got back to the car to go to the venue.\nIt started to feel like a movie because the security guard was on his phone saying, 'I've got Sandy Ryan in the car, we'll be arriving in three minutes. Have all the doors ready'.\nWhen he got off the phone he said to me, 'don't get out of the car, I'll open your door and I want you to stay on my left shoulder to walk into the venue'.\nWhen I got to the changing room I went into fight mode and I was ready. I just knew I had to get on with it.\nI don't have any regrets about still fighting. I also understand where my coach, Kay, was coming from and why he wanted to pull me out. I respect his opinion but I'm a fighter so there was nothing that anyone could say to stop me.\nI was already so angry at the time. I was ready to fight three hours before it even took place.\nIf you speak to any fighter they aren't going to be doing any madness three hours before a bout.\nYou're trying to chill, trying to get your mind right and thinking of the fight. You have all your schedule in place and any little disturbance will have an impact. Having paint thrown all over me is another thing.\nBut I am past all that now.\nThe difference this time will be me winning and holding that belt at the end of the fight. I just know that a calm mind, calm heart and relaxed Sandy will beat Mikaela.\nAfter losing, I just wanted to go straight back in for the rematch. I know I can beat Mikaela.", "url": "https://www.bbc.com/sport/boxing/articles/cp3y66nqxz7o"}