{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:05:32", "date_modify": "2025-04-26 04:05:32", "date_publish": "2025-03-03 17:15:01", "description": "WPL 2025 results: Beth Mooney stars in Gujarat Giants' thrashing of UP Warriorz", "filename": "sport_cricket_articles_c8e76nde728o_1745640332.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5736/live/49be0e90-f84c-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_cricket_articles_c8e76nde728o_1745640332.html", "title": "WPL 2025 results: Beth Mooney stars in Gujarat Giants' thrashing of UP Warriorz", "title_page": "WPL 2025 results: Beth Mooney stars in Gujarat Giants' thrashing of UP Warriorz - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Beth Mooney hit an unbeaten 96 from 59 balls as Gujarat Giants claimed a crushing 81-run win over UP Warriorz in the Women's Premier League.\nThe Australia left-hander batted throughout the Gujarat innings, hitting a remarkable 17 boundaries, as they posted 186-5 in Lucknow.\nMooney shared a stand of 101 with India's Harleen Deol (45 off 32) for the second wicket, while Deandra Dottin's brief cameo of 17 off eight balls boosted the total late in the innings.\nEngland spinner Sophie Ecclestone was the pick of the bowlers for UP Warriorz, taking 2-34, but despite her efforts, the home side faced a challenging chase.\nDottin took two wickets in the first over of the reply, though, to leave the Warriorz 2-2 and they never recovered.\nIt was 25-4 by the end of the fourth over and when Grace Harris, the only batter in the top six to reach double figures, fell for 25 in the 10th, whatever lingering hopes of a dramatic comeback remained were dashed.\nThe Warriorz were eventually bowled out for 105 in the 18th over as seamer Kashvee Gautam and left-arm spinner Tanuja Kanwar took three wickets apiece.\nGujarat move up to second after their second win on the bounce, ahead of Mumbai Indians in third on net run-rate, while the Warriorz drop to fifth.", "url": "https://www.bbc.co.uk/sport/cricket/articles/c8e76nde728o"}