{"authors": ["Katie Stafford", "www.facebook.com"], "date_download": "2025-05-21 05:20:07", "date_modify": "2025-05-21 05:20:07", "date_publish": "2025-04-03 13:29:20", "description": "Nuno Espirito Santo press conference: Aston Villa vs Nottingham Forest preview", "filename": "sport_football_articles_c9ven4k0zm1o_1747804807.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e1af/live/755718e0-4923-11ef-96a8-e710c6bfc866.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c9ven4k0zm1o_1747804807.html", "title": "Nuno Espirito Santo press conference: Aston Villa vs Nottingham Forest preview", "title_page": "Nuno Espirito Santo press conference: Aston Villa vs Nottingham Forest preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ola Aina has had a scan on his calf and he will be \"out for a while\", with Nuno adding: \"It's a big blow and we are going to miss him.\"\nChris Wood will be assessed before a decision is made for Saturday as his recovery is \"day by day\". Callum Hudson-Odoi, who missed Tuesday's win over Manchester United, is available.\nOn Anthony Elanga's goal against his former club United: \"He is improving because he has been able to play game after game. His team-mates recognise his abilities and his space. That goal on Tuesday was a credit to him and his capacity to drive with the ball and keep increasing the speed while controlling it.\"\nHe said the players' grit and togetherness \"has been our foundation since the beginning\" but for the final run of games they \"have to keep it\" going.\nOn the team spirit: \"It is always nice to work in a good atmosphere and we have been able to spend time together, more than just our job obligations. Results help and you can see on the pitch that the boys are together.\"\nHe said \"it's natural\" for those relationships to form but sometimes \"special people get together and create special moments, and this is an example of that\".\nOn opponents Villa: \"They are a very good team. They reinforced and balanced the squad in the January window but they have been improving since I joined here. They have talent and quality.\"", "url": "https://www.bbc.com/sport/football/articles/c9ven4k0zm1o"}