{"authors": ["Andy Burke", "www.facebook.com"], "date_download": "2025-05-21 03:56:35", "date_modify": "2025-05-21 03:56:35", "date_publish": "2025-04-07 13:02:33", "description": "Headline", "filename": "sport_articles_cy5r379qq96o_1747799795.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/af57/live/5995b280-13b0-11f0-92ad-eb42d450dc76.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cy5r379qq96o_1747799795.html", "title": "Headline", "title_page": "Headline - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Goose cuts loose\nWith a number of Edinburgh's key players unavailable in recent times, either due to injury or international duties with Scotland, Wes Goosen has become one of the most important players in the team.\nHe was voted the club's players' player of the year last season, a testament to his consistently high level of performance.\nHis conversion from wing to full-back has been impressive. Against Lions on his 50th Edinburgh appearance, he set the tone with an early try and looked dangerous every time he got his hands on ball.\nHaving signed a new deal with the club, Goosen will qualify to play for Scotland on residency grounds in 2027. While there may be dismay in some quarters at the prospect of yet another non-Scottish player coming into the fold, if Goosen maintains this form he will be very hard for the national selectors to ignore.\nVellacott brings the tempo\nEdinburgh brought a tempo in the first half Lions could not live with and much of that can be traced back to the work of Ben Vellacott.\nThe scrum-half was buzzing around everywhere, getting the ball away from the breakdown quickly to maintain the attacking momentum.\nHe was quick to spot a gap to dart through for his try and was at the heart of most of Edinburgh's best stuff.\nVellacott has never managed to convince Gregor Townsend he is worthy of competing for the Scotland nine jersey, but he has rarely let Edinburgh down.\nFreddy ready for more game time\nFreddy Douglas is the most exciting talent in Scottish rugby and it's time to take off the L plates and let him motor.\nHe did not get a huge amount of time to do his thing against Lions, but his very first involvement was a crucial turnover just when the South African side looked like they might be about to work their way back into the game.\nSean Everitt identified Douglas' maturity in identifying which rucks to compete at and which to leave well alone, and that turnover was a perfect example.\nThe back-row enjoyed a terrific U20 Six Nations and, having made his full Test debut in the autumn, now is the time for Everitt to throw him in to start some matches.\nDouglas is going to be a key player for club and country for years and more exposure to top level rugby can only accelerate his development.", "url": "https://www.bbc.com/sport/articles/cy5r379qq96o"}