{"authors": ["Sean Kearns", "www.facebook.com"], "date_download": "2025-04-26 04:13:03", "date_modify": "2025-04-26 04:13:03", "date_publish": "2025-03-04 11:58:23", "description": "Paula Radcliffe says the experience of going through the perimenopause made completing the Tokyo Marathon even \"sweeter\".", "filename": "sport_athletics_articles_c4g0kwyve7vo_1745640783.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e0db/live/9334f570-f8e7-11ef-9628-add78e51db09.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_athletics_articles_c4g0kwyve7vo_1745640783.html", "title": "Paula Radcliffe: Perimenopause made Tokyo Marathon even 'sweeter'", "title_page": "Paula Radcliffe: Perimenopause made Tokyo Marathon even 'sweeter'  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Paula Radcliffe says the experience of going through the perimenopause made completing the Tokyo Marathon even \"sweeter\".\nThe 51-year-old finished in less than three hours on Sunday, her first marathon since retiring in 2015 aged 40.\nThe perimenopause typically starts a few years before the menopause, external and can cause symptoms such as hot flushes, heavy bleeding and heart palpitations.\nAsked about the differences compared to running during her competitive career, Radcliffe told BBC Radio 5 Live: \"It's very different. Not only the effects of perimenopause and managing the fatigue and fluctuations that come with that, energy and muscle recovery wise.\n\"When the children were smaller it was a little bit easier. There are lots of things to juggle now and it's no longer my career, now it's a hobby like lots of people.\n\"I really take my hat off to everyone who juggles the training with a career, and family life around that, because it's a different way - but it makes the achievement when you cross that finish line a little bit sweeter.\"", "url": "https://www.bbc.co.uk/sport/athletics/articles/c4g0kwyve7vo"}