{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:37:08", "date_modify": "2025-05-21 04:37:08", "date_publish": "2025-01-18 00:00:00", "description": "A clinical Fulham performance condemns Leicester City to their seventh straight Premier League defeat and piles the pressure on Foxes manager Ruud van Nistelrooy.", "filename": "sport_football_live_cly42rjvnqet_1747802228.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cly42rjvnqet_1747802228.html", "title": "Leicester City 0-2 Fulham: Emile Smith Rowe and Adama Traore score for visitors", "title_page": "Leicester City 0-2 Fulham: Emile Smith Rowe and Adama Traore score for visitors - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A clinical Fulham performance condemned Leicester City to their seventh straight Premier League defeat and piled the pressure on Foxes manager Ruud van Nistelrooy.\nLeicester, who remain 19th in the table, have lost seven of the nine league games the Dutchman has been in charge for.\nOn his 100th appearance in the Premier League, Emile Smith Rowe opened the scoring for the visitors just after half-time with a brave diving header.\nHarry Wilson's ball across the box was flicked on by Sasa Lukic and the former Arsenal midfielder threw himself in front of Jakub Stolarczyk to score his fourth of the season.\nSubstitute Adama Traore secured the points for Marco Silva's side in the 68th minute when his brilliant side-footed volley flew past Stolarczyk into the bottom corner.\nBoos, and shouts of \"you don't know what you're doing\", were aimed at Van Nistelrooy when he subsituted forward Bilal el Khannouss in the second half.\nAfter Smith Rowe's opener, Raul Jimenez missed a huge opportunity to double Fulham's lead but he could only direct his header wide.\nBoth teams had a case for a penalty, with Boubakary Soumare going down for Leicester before Traore's appeals were waved away.\nSubstitute Rodrigo Muniz looked to make it 3-0 with minutes to play but his effort went the wrong side of the post.\nThe Foxes remain on 14 points - two points adrift of safety - and face a trip to Tottenham next, while Fulham move up to ninth.\nLike Wednesday's defeat at home to Crystal Palace, Leicester started the game full of attacking intent and looked to break the deadlock early, but the same story eventually unfolded.\nFulham managed to settle into the match and took control, with the Foxes unable to provide an answer.\nVan Nistelrooy's decision to drop forward Facundo Buonanotte to the bench for the game had puzzled some of the home support, and ironic cheers sounded all around the King Power when the Argentine was brought on in the second half.\nWith empty seats from the start, unrest among supporters was made even clearer when they made their feelings known towards Van Nistelrooy's substitutes.\nThe introduction of Oliver Skipp and Kasey McAteer were met with boos in the first two changes of the afternoon.\nAnd the damning chants of \"you don't know what you're doing\" followed as Leicester fell to yet another defeat.\nAfter three games without a win, Fulham responded in fine fashion at the King Power and weathered the early Leicester storm before stamping their authority on proceedings.\nAfter struggling to find a way through a tight Foxes defence in the first half, Smith Rowe showed immense bravery to force in the opening goal with a diving header from a yard out on his 100th top-flight appearance.\nFulham were not content with just the one goal and came forward again, this time through Wilson on the right, and his pinpoint cross was converted expertly by Traore.\nSilva's side have only risen one place in the league but sit just five points adrift of Newcastle in fourth spot.\nWith a home fixture against Manchester United up next, Fulham will fancy making it two wins from two in their push for Europe.", "url": "https://www.bbc.com/sport/football/live/cly42rjvnqet"}