{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:06:51", "date_modify": "2025-05-21 04:06:51", "date_publish": "2025-01-23 19:01:54", "description": "Man City news: Marmoush is 'a mixture of Salah and Alvarez'", "filename": "sport_football_articles_cy48n3x2k5ko_1747800411.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d662/live/ff128b70-d9b8-11ef-abf7-8b2a99c77ef2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy48n3x2k5ko_1747800411.html", "title": "Man City news: Marmoush is 'a mixture of Salah and Alvarez'", "title_page": "Man City news: Marmoush is 'a mixture of Salah and Alvarez' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Watching new Manchester City signing Omar Marmoush feels like \"you're watching some magical performance happen in front of you,\" according to Bundesliga reporter Archie Rhind-Tutt.\nBut despite such praise, he doesn't know if he will be the perfect fit for the club.\nSpeaking about the Egyptian on the latest episode of BBC Radio 5 Live's Euro Leagues, Rhind-Tutt said: \"If he was playing through the middle I'd have more confidence of him fitting in, but they've got a guy up front who's just signed a nine year deal, so I wonder where he'll fit in and how he will.\n\"At Frankfurt he's proven himself as an incredibly quick, skilful, excellent reader of the game, sky high confidence, shooting technique out of this world, free-kicks - first player since Lionel Messi in Europe's top five leagues to score three free-kicks in consecutive games this season - he's on fire.\n\"When you watch him live, it does feel like you're watching some magical performance happen in front of you, just seeing someone like that - it's so engaging.\n\"The question is Pep Guardiola likes to have control in a game, and very specific moments of explosion. So I wonder how Marmoush, who has not been this explosively good until this half of the season with Frankfurt, how he will adapt to that.\n\"It's going to be fascinating to see how they work together. There is a player there. Being at Frankfurt on Friday and seeing how he was waved off by his team-mates and crowd was really beautiful.\n\"It's usually not the case when a player leaves for greater things where everybody is happy. It was nice to see a player get that appreciation in the moment.\"\nBBC Sport columnist Guillem Balague also questioned whether the 25-year-old will fit into Guardiola's style and said: \"I think he's a mixture of [Mohamed] Salah and Julian Alvarez - not really a winger, not really a number nine - he can be a number nine and has been, but he can fit in with another forward.\n\"Manchester City put a lot of players in front of the ball, as long as he does his role without the ball then that's it, that's the player they need to score goals as well.\"", "url": "https://www.bbc.com/sport/football/articles/cy48n3x2k5ko"}