{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:06:19", "date_modify": "2025-05-21 06:06:19", "date_publish": "2025-02-08 16:59:44", "description": "A superb goal from Danny Amos in the last minute gives Glentoran a 1-0 victory over Dungannon Swifts while Crusaders beat champions Larne and Coleraine edge Carrick.", "filename": "sport_football_articles_cx2mdkkj8p1o_1747807579.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/06da/live/c9fdd0b0-e63e-11ef-abf5-19b142cf30ba.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cx2mdkkj8p1o_1747807579.html", "title": "Glens hit late winner against Swifts as Crues beat Larne", "title_page": "Irish Premiership: Glens hit late winner against Swifts as Crues beat Larne - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Danny Amos hit a superb winner in the last minute as Glentoran clinched a 1-0 victory over Dungannon Swifts.\nThe second versus third meeting was on course for a dull stalemate until Amos blasted into the top corner of the net.\nThe win takes the Glens four points clear in second and 17 behind leaders Linfield with two games in hand.\nLarne's hopes of retaining the Premiership title were dealt a blow after a 1-0 defeat by Crusaders at Inver Park.\nJordan Forsythe connected with Jacob Blaney's cross to head home the only goal after 31 minutes.\nIt leaves Larne 21 adrift of the Blues with five games in hand while the Crues move up to fourth.\nRhyss Campbell bundled in at the the backpost after 76 minutes to give Coleraine a 1-0 victory at Carrick Rangers.\nA 90th-minute wonder strike from Amos secured all three points for Glentoran as they left it late to overcome a resilient Dungannon side.\nThe first half was a game of few chances, with Jordan Jenkins coming closest to breaking the deadlock midway through as his left-footed effort slid just wide of the far upright.\nJenkins should also have done better with a free header with Johnny Russell also wasting an opportunity with his head.\nCameron Palmer forced Declan Dunne into a smart save 10 minutes before half-time, with the Dungannon goalkeeper getting down well to his right-hand side.\nThe visitors could have taken the lead early in the second half but for Andrew Mitchell misplacing his pass to John McGovern, who would have had a tap-in.\nJust as it looked like the spoils were going to be shared, Amos won it for the hosts as he found the top corner with an absolutely stunning strike from at least 30 yards out.\nForsythe's first-half goal condemned Larne to their first league defeat since the end of November as they were leapfrogged by Crusaders, who jump into fourth.\nIt was a quiet and uneventful opening to this match but it tilted slightly in favour of the hosts with Tiarnan O'Connor causing some trouble for the Crusaders defence.\nWhile Sean Graham was also probing, it was Crusaders with their first, and only, chance of the first half who broke the deadlock just after the half-hour mark.\nBlaney was the provider as he hung an inviting cross that Forsythe met with a bullet header that he buried into the bottom corner.\nGary Haveron's men responded with efforts from Dylan Sloan and O'Connor but went in at the break trailing.\nPhillip Lowry came close to doubling his side's lead just after the break when he whistled wide from the edge of the box. O'Connor then forced a save from Jonathan Tuffey.\nShortly after, nobody in red could connect with Sloan's low, hard cross but opportunities began to dry up as frustration grew among the home fans.\nDespite Larne emptying their bench, there was to be no riposte and Blaney should have sewn it up in stoppage time but dragged wide. It mattered not as the visitors came out on top.\nCampbell's eighth league goal of the season earned Coleraine a hard fought win against Carrick at Taylors Avenue.\nThe winger bundled home Connor Murray's corner 14 minutes from time to give the Bannsiders a first league win of the year in a game lacking in quality.\nLevi Ives volleyed narrowly past the post in the opening minute following a lay-off from Matthew Shevlin but the remaining 44 minutes were largely bereft of chances.\nCian O'Malley proved a persistent threat with his trademark long throw-in but found the Coleraine defence, fresh from a scoreless draw in midweek, in defiant mood.\nAnd the defender forced Rory Brown into his first save of the game six minutes after half-time, the Coleraine goalkeeper reacting brilliantly to tip O'Malley's goal bound volley over his crossbar.\nJack Hastings dragged a left-foot shot past the post while Levi Ives did something similar at the opposite end moments later after being cleverly set up by Matthew Shevlin.\nCampbell should have done better when presented with a chance by a strong run from Lyndon Kane down the right while second-half substitute Adam Foley forced Brown into a good save from a Luke McCullough cross.\nCampbell, however, made amends for his earlier miss when he finished from Murray's corner at the back post to finally break the deadlock and earn a welcome three points for the visitors.", "url": "https://www.bbc.com/sport/football/articles/cx2mdkkj8p1o"}