{"authors": ["Sandy Armour", "www.facebook.com"], "date_download": "2025-04-26 04:11:56", "date_modify": "2025-04-26 04:11:56", "date_publish": "2025-03-04 12:41:29", "description": "Kilmarnock fan voice: 'Relegation form whatever way you dress it up'", "filename": "sport_articles_cd9201q4y0wo_1745640716.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2a9a/live/2c4d8b40-f87b-11ef-8c03-7dfdbeeb2526.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cd9201q4y0wo_1745640716.html", "title": "'Relegation form whatever way you dress it up'", "title_page": "Kilmarnock fan voice: 'Relegation form whatever way you dress it up' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "It was a long day for the 300 Killie fans who travelled to Dingwall on Saturday and it rounded off a very bad week for us.\nOur repeated bad habit of poor in-game management reared its ugly head again last midweek when we capitulated against Rangers.\nBoth management and players have to shoulder the blame and it could prove very costly as we plummet down the table.\nA win at Dingwall would have been massive, however no points in three games against County is relegation form whatever way you dress it up.\nWe have the worst away record in the league this season and the manager's record of eight wins in 53 games on the road over the past three seasons is horrendous.\nMany of the fans I spoke to in Dingwall were less than complimentary about the manager. It's time for him to take some responsibility, recognise things aren't working and make the changes that will help us retain our league status.\nWe have a free weekend upcoming so that may give us a chance to get some injured players back.\nKyle Magennis has had a terrible time with injuries and we hope he is back sooner rather than later following his latest setback on Saturday.", "url": "https://www.bbc.co.uk/sport/articles/cd9201q4y0wo"}