{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:10:45", "date_modify": "2025-05-21 07:10:45", "date_publish": "2025-03-30 10:02:35", "description": "Newcastle news: I'll never forget Carabao Cup success - Dan Burn", "filename": "sport_football_articles_cj9ellme73do_1747811445.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/45ef/live/15b4dce0-0cd4-11f0-9025-f3e7e963b60e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cj9ellme73do_1747811445.html", "title": "Newcastle news: I'll never forget Carabao Cup success", "title_page": "Newcastle news: I'll never forget Carabao Cup success - Dan Burn - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Dan Burn says he will \"never tire\" of watching his Carabao Cup final goal and Newcastle's celebrations, despite saying he was embarrassed on international duty by the number of times the goal was replayed - which even led to him turning televisions off.\nSpeaking to BBC Radio Newcastle about the club's open top bus parade, the defender said: \"It's something I'll never forget - I knew there would be a lot of people but when we saw the sheer amount of people it was amazing.\n\"It really hit home, what it means to the region and the city, the achievement that we've managed to do.\n\"The lads were starting chants all the way round and just being able to take in that moment, it was only an hour but it's an hour I'll never forget.\"\nThe 32-year-old has had a memorable few weeks, scoring in the Carabao Cup final victory and then making his England debut.\n\"It's been good, it's strange that everything I wanted to happen has happened within two weeks, I've tried to be as present as I can and focus on what I was doing,\" he said of the last fortnight.\n\"Today it's been nice to reflect on what I've been able to do the last couple of weeks, obviously now box off this whole little adventure before concentrating on the next game.\"\nWhen asked how many times he has watched his goal back, he replied: \"A lot.\n\"The first few days, my phone was getting constantly pinged with videos and remixes, when I was away with the England lads it was on TV all the time and I ended up having to switch the TVs off at the end because I was starting to get a bit embarrassed!\n\"I will watch it forever, I'll never tire of it - it was an amazing moment.\"", "url": "https://www.bbc.com/sport/football/articles/cj9ellme73do"}