{"authors": ["Dominic Dietrich", "www.facebook.com"], "date_download": "2025-05-21 07:39:03", "date_modify": "2025-05-21 07:39:03", "date_publish": "2025-01-13 16:18:08", "description": "BBC Radio Derby's Dominic Dietrich gives his thoughts on loanee Tawanda Chirewa's departure from Derby.", "filename": "sport_football_articles_c3w8q8ez3x0o_1747813143.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/515e/live/6ebe1f40-d1c9-11ef-87df-d575b9a434a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c3w8q8ez3x0o_1747813143.html", "title": "What next for Derby after Chirewa's return to Wolves", "title_page": "What next for Derby after Chirewa's return to Wolves - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "I'm not sure many will have known Tawanda Chirewa when his loan signing to Derby County was announced back on 26 August from Wolves.\nFast forward a few months and there has been little learned about the 21-year-old after just 196 minutes in a Derby shirt across six appearances.\nSometimes loan signings can pleasantly surprise you, like in the case of David Ozoh, who despite being injured for the past three months, showed his pedigree inside his first five matches.\nAnd then there are loan signings that leave you scratching your head, and this would be one of them.\nFor the battle Derby are in this season, they can't afford to let a player learn the hard way at Championship level, especially when money is tight and it takes up a precious loan slot, so they've made the decision to cut short his stay which, you'd think, means a player incoming won't be far away on loan.\nBy all accounts, Tawanda was a great lad around the training ground, intelligent and willing to learn - but it's one of those moves that probably came too soon for him in the situation Derby are in.\nHe's clearly got ability and I'm sure he will have learned lessons in his start at the Stadium of Light or on his debut at Barrow.\nBut ultimately, from a Derby County perspective, it hasn't worked.", "url": "https://www.bbc.com/sport/football/articles/c3w8q8ez3x0o"}