{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:51:35", "date_modify": "2025-05-20 12:51:35", "date_publish": "2023-08-03 12:22:35", "description": "Sheffield United: 'More than excited' - Blades sign defender Trusty from Arsenal", "filename": "sport_articles_cernk43kygzo_1747745495.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/21c0/live/e791f6d0-31f7-11ee-8f52-fbf70e4bf742.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cernk43kygzo_1747745495.html", "title": "Sheffield United: 'More than excited'", "title_page": "Sheffield United: 'More than excited' - Blades sign defender Trusty from Arsenal - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Sheffield United have signed central-defender Auston Trusty from Arsenal on a four-year contract.\nThe 24-year-old spent last season on loan at Birmingham City from the Gunners after five years in Major League Soccer.\nHe has also been capped twice by the USA national team - in the semi-final and final of this summer's CONCACAF Nations League Finals.\nSpeaking to the Blades' website, Trusty said: \"I am more than excited. The opportunity to be here at this historic club, and an opportunity to play in the Premier League and show my ability, it is everything I could have ever dreamed of growing up as a kid.\n\"In Pennsylvania, this was a dream - almost an impossible dream but I believed in myself and the opportunity has come around, it is everything that I dreamed for.\n\"Everything is coming to fruition for me. I am in the right place at the right time and in the right mindset. Everything has come together how I dreamed it.\"\nSheffield United boss Paul Heckingbottom said: \"I'm delighted we've managed to get this one over the line, it is one of the positions we've been looking to fill and it is with one our own, a permanent transfer rather than a loan.\n\"He is at a good age to progress, he has experience having played at international level and in the Championship last year, where we monitored him and he picked up Birmingham's player of the year award.\n\"As a coaching team we feel that he has the athleticism and desire to succeed in the Premier League.\"", "url": "https://www.bbc.com/sport/articles/cernk43kygzo"}