{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:53:17", "date_modify": "2025-05-20 14:53:17", "date_publish": "2023-07-27 14:13:11", "description": "Northampton Town chairman Kelvin Thomas expects them to be competitive this season despite \"crazy times\" financially in the lower divisions.", "filename": "sport_football_66324527_1747752797.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/D0B1/production/_130552435_shutterstock_editorial_5600971e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66324527_1747752797.html", "title": "Kelvin Thomas: Lower divisions hit by 'salary inflation', says Northampton chairman", "title_page": "Kelvin Thomas: Lower divisions hit by 'salary inflation', says Northampton chairman - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Northampton Town chairman Kelvin Thomas expects the team to be competitive this season despite \"crazy times\" financially in the lower divisions.\nThey won promotion by finishing third in League Two last season.\nBut Thomas said finding new players was tougher because of \"significant salary inflation\" from 12 months ago.\n\"A player doesn't become a different player just because you're paying them more money,\" he told BBC Radio Northampton's Cobblers Show.\n\"As an ownership, we're not going to put the club at risk by paying a little bit more for a player when you're not necessarily getting much more quality.\"\nEarlier this month, head coach Jon Brady said richer clubs had put the transfer market for Leagues One and Two \"out of kilter\" because of the amount of money they are prepared to spend.\nAsked how much some clubs were willing to pay in wages compared to last year, Thomas said: \"At the start of the window a lot more, probably double, but ... we do understand that as the window goes on those demands drop a little bit.\n\"The bigger clubs that are willing to pay what we would consider serious money, they can only take a certain amount of players, so other players that may have been demanding those sort of wages get a bit further down the road and suddenly realise they may not get that and start looking around at some of their other options.\"", "url": "https://www.bbc.com/sport/football/66324527"}