{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:41:19", "date_modify": "2025-05-21 05:41:19", "date_publish": "2025-04-04 00:00:00", "description": "Wales produce another competitive performance against a higher-ranked nation before slipping to a 2-1 Nations League defeat against Denmark at the Cardiff City Stadium.", "filename": "sport_football_live_c2kvjyze8pxt_1747806079.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/65c3/live/2acfffd0-1191-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c2kvjyze8pxt_1747806079.html", "title": "Wales 1-2 Denmark: Hosts beaten in Nations League despite spirited display", "title_page": "Wales 1-2 Denmark: Hosts beaten in Nations League despite spirited display - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wales produced another competitive performance against a higher-ranked nation before slipping to a 2-1 Nations League defeat against Denmark at the Cardiff City Stadium.\nWales fell behind in the seventh minute as Signe Bruun was given too much time and space in the penalty area to find the bottom corner of the net.\nThe visitors were entirely dominant for the opening 30 minutes of the match but saw their lead cancelled out by the first Welsh attack as Ceri Holland cut inside and powered the ball into the roof of the net.\nWales might have led through Hannah Cain but squandered their chance and saw substitute Amalie Vangsgaard punish them to the fullest extent as her composed finish gave Denmark the advantage.\nWales saw goalscorer Holland leave the field on a stretcher and in tears in the final exchanges, overshadowing another good display from the hosts.\nThis was a case of what might have been for Wales, but they once against produced an impressive performance.\nThis was another valuable experience against a top nation for Wales as they prepare for Euro 2025, the women's first major tournament appearance.\nWales boss Rhian Wilkinson says her policy is that \"there is no point calling up players and not using them,\" and was true to her word as she again heavily rotated her ranks, making five changes to the starting XI who held Sweden in Wrexham.\nStar performer and Wales' most-capped player and top goalscorer Jess Fishlock was left out after missing her last club much for Seattle Reign through injury, with Wales continuing to carefully manage her minutes, leaving her as an unused substitute.\nA slow start to proceedings was a feature of Wales' displays against both Italy and Sweden in their opening Nations League qualifiers in February and it was again the case at the Cardiff City Stadium as Denmark were able to seize the impetus.\nHaving won their previous visit to the Cardiff City Stadium 5-1, there was an understandable confidence and assuredness to the way the visitors started the match and they scored from their first opportunity as Bruun was given the space to turn and find the corner of the net.\nWales were struggling to contain the Danish attacking movements and Frederikke Thogersen might have doubled their lead on 11 minutes, but Gemma Evans produced a last-ditch block.\nDenmark were far too comfortable and they came close again on 22 minutes as Sofie Bredgaard's powerful effort was tipped over the crossbar by Wales goalkeeper Olivia Clark.\nClark's goal led a charmed life on 27 minutes as defender Stine Ballisager headed against the crossbar from point-blank range from a corner, before Kathrine Kuhl smashed the ball over through a crowded penalty area.\nThat exchange proved decisive, with the contest surprisingly turning on its head.\nWales could easily have been two or three goals behind, but they might have equalised on 32 minutes as Denmark failed to clear a cross, but Lily Woodham's shot was blocked.\nHowever, Denmark did not heed the warning and Wales did level less than 60 seconds later as Holland collected the ball, cut inside and powered a right-footed effort into the roof of the net.\nThe goal sparked Wales and Hannah Cain volleyed over after Woodham found her in space with a fine piece of skill and Rachel Rowe dragged a shot wide as they finished the half the stronger side.\nMore and more comfortable against the best in the world, Wales look a different proposition to the side beaten 5-1 in successive matches by Germany and Denmark in 2023 as they continued to rattle the Danes after the break.\nVisiting coach Andree Jeglertz made four substitutions before the hour mark with his side completely losing their impetus after Wales' equaliser.\nIndeed, having been dominant, it took until the 69th minute for Denmark to fashion another clear chance, but substitute Amalie Vangsgaard fired over the crossbar after a flowing move.\nThe contest swung decisively in the favour of Denmark in a frantic minute where Wales missed their best chance of the contest and fell behind within seconds.\nThey perhaps could and should have led as sub Alice Griffiths sent Cain clear, but she could only fire at goalkeeper Maja Ostergaard.\nThe punishment was swift from Denmark as Vangsgaard made no mistake after Emma Snerle's perfect pass caught Wales cold after their attack.\nThese are the fine margins in Nations League A and meant Wales were left to rue what might have been.\nA nasty looking injury to goalscorer Holland, who left the field on a stretcher after a collision with her leg in a protective boot, diminished the evening from a Welsh perspective and might overshadow the contest, less than 100 days before the start of the Euros.", "url": "https://www.bbc.com/sport/football/live/c2kvjyze8pxt"}