{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:23:02", "date_modify": "2025-05-21 06:23:02", "date_publish": "2025-03-31 13:48:31", "description": "BBC Sport takes a look at Super League coaches' views on the return of a three-Test Ashes series at the end of 2025.", "filename": "sport_rugby-league_articles_clyzd2v1916o_1747808582.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5424/live/45a31e70-0b2c-11f0-b1de-e342f84c59e9.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-league_articles_clyzd2v1916o_1747808582.html", "title": "2025 England v Australia Ashes series: Super League coaches have their say on tour's return", "title_page": "2025 England v Australia Ashes series: Super League coaches have their say on tour's return - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The news that Australia will travel to England to face a three-Test series later this year sent shockwaves through the sport.\nIt is the first time since 2003 the world champions will have faced a Test series, albeit that one 22 years ago came against a Great Britain side they whitewashed 3-0.\nThis time around, it is a chance for England to prove its mettle against one of the game's toughest nations when the series kicks off at Wembley on 25 October.\nBut what do some of Super League's head coaches think about the historic tour?\nBBC Sport takes a look at what they say it can do for the sport and whether it can reinvigorate rugby league in England.\nIt is eight years since England and Australia last met - that was in the 2017 World Cup final in Brisbane, with Australia winning the edgy encounter 6-0.\nShaun Wane's England could have set up another meeting with the Kangaroos five years later in the Covid-delayed World Cup final at Old Trafford.\nBut England were defeated by Samoa in the semi-final that year and missed the chance to tee off with Australia for World Cup glory.\nSince that defeat at Arsenal's Emirates Stadium home, England have gone on to beat Tonga 3-0 in a home Test series as well as winning two Tests against Samoa last year.\nOne person who is familiar with facing the Aussies is St Helens boss Paul Wellens who, in his playing days, featured for Great Britain during the 2001 Ashes series as well as in the 2004 Tri Nations series.\nWellens did not mince his words about the return of the Ashes.\n\"This is the biggest news for international rugby league in our country in over 20 years,\" he told BBC Radio Merseyside.\n\"Playing in an Ashes series should be the pinnacle of any player's career. The fact that we've got an Ashes series - and I know there's been talks for some time now - that's been finally confirmed is one of the most exciting things to happen to rugby league in this country for some time.\"\nWakefield Trinity head coach Daryl Powell had decent pedigree during his playing career, having featured in Ashes series against Australia for Great Britain in 1990, 1992 and 1994.\n\"It's massive. For the players it's such a pinnacle, playing against the Aussies. The Test series back in my time as a player, I'll never forget,\" he told BBC Radio Leeds.\n\"Even though we lost all three 2-1, we had some unbelievable times, getting so close to the Aussies.\"\nHis nostalgia for those times aside, Powell said the planning for this year's series is crucial to make it a success.\n\"I think it's great for the sport. If we get it right then it will be amazing,\" he added.\n\"Clearly the RFL have got to get a grip of the way the sport's being run. It needs to be managed in such a way that gets full houses and then you get it right.\n\"Shaun Wane and the players have got to get it right on the field. If you've got full houses at a game against Australia and it's competitive then I don't think there's a better sport in the world.\"\nWigan boss Matt Peet believes that rugby league needs the international game to boost the sport and the Ashes is the perfect chance to achieve that.\n\"For the game to get where it deserves to be, the international scene has to be growing, thriving, flourishing and it needs to be what every player is aspiring to do, which is to represent their country,\" he told BBC Radio Manchester.\n\"For that to happen, you need consistent games. You need a regular competition structure where you know what's coming up. I think this a step in the right direction.\n\"Hopefully the quality of the games and the fan experience and product that's on TV will be a positive step for rugby league and leave everyone wanting more.\"\nSuper League sides have outperformed expectations in recent years when pitted against Australian rivals.\nBoth St Helens and Wigan have beaten formidable NRL premiers Penrith Panthers in the World Club Challenge within the past two years, showing that English rugby league can still cut it with the best.\nSo what sets apart playing against Australia compared to other international ties?\nFor Powell it is speed.\n\"I've played against New Zealand, France, Papua New Guinea and Fiji, and the Kiwis were always pretty strong,\" he said.\n\"But the game against Australia is just like an unbelievably quick game where you're playing on instinct all the way through - it's that fast.\n\"The game's a little bit different now to when I played but it's still the same, the speed the game is played at is a couple of levels above anything else that you experience.\"\nAs for this season's series, will it rekindle the feeling the Ashes had in the nineties?\nSalford Red Devils boss Paul Rowley, a former England international, thinks it can.\n\"We're flooded with rugby now. Back in the day in the eighties you only had a rare chance to see televised games. Less is more in that respect so everybody was hungry for a game, whether it was on a Sunday or if it was an international then it was few and far between,\" Rowley said.\n\"However, marketed right then absolutely we can recapture that spirit.\"", "url": "https://www.bbc.com/sport/rugby-league/articles/clyzd2v1916o"}