{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:33:18", "date_modify": "2025-05-20 12:33:18", "date_publish": "2023-08-04 09:31:59", "description": "Boss Nigel Clough is confident an \"ever-improving\" Mansfield Town can challenge for promotion from League Two.", "filename": "sport_football_66403814_1747744398.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1027E/production/_130647166_gettyimages-1427002991.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66403814_1747744398.html", "title": "Nigel Clough: Mansfield Town boss confident of League Two promotion push", "title_page": "Nigel Clough: Mansfield Town boss confident of League Two promotion push - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Boss Nigel Clough is confident an \"ever-improving\" Mansfield Town can challenge for promotion from League Two as long as they steer clear of the injuries that plagued them last season.\nThe Stags missed out on a play-off place by just one goal last term.\nAnd they were beaten by Port Vale in the play-off final in 2021-22.\nClough told BBC Radio Nottingham the squad has improved each season and there were \"so many good things\" to build on.\n\"It's just the injuries that prevented us reaching the play-offs. This season we are in better shape,\" he said.\n\"Last season we conceded too many goals but that's down to injuries. Most squads can cope with three or four but when you have an average of eight players out, it is very difficult to cover that with any squad at our level.\"\nMansfield finished in eighth place last term, with a 2-0 final-day victory over Colchester United leaving them one goal short of making the top seven.\nMeanwhile, the disappointment of Wembley defeat the previous campaign remains in Clough's thoughts, even now.\n\"The disappointment last season wasn't as great although the margin of missing out by one goal was incredible after 46 games,\" he added.\n\"Defeats like the one at Wembley never go away. It's always there. You just have to learn to live with it as best you can and prepare for the next season.\n\"It increases the motivation. What do we need to make that next step? We have tried to address that in January and in this window.\n\"We are in better shape, in better nick. The players have had a better rest and a better pre-season and are looking forward to it.\n\"We have got a good amount of work into the players. The squad has improved each season we have gone on.\"", "url": "https://www.bbc.com/sport/football/66403814"}