{"authors": ["David Currie", "www.facebook.com"], "date_download": "2025-05-21 06:22:37", "date_modify": "2025-05-21 06:22:37", "date_publish": "2025-01-31 12:58:41", "description": "St Mirren's 'dangerous' strikers Mandron & Olusanya have 'everything' - Kerr", "filename": "sport_articles_cg5ymn7j8g6o_1747808557.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e92d/live/5681e640-dfd0-11ef-a108-5b0fc408bc51.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cg5ymn7j8g6o_1747808557.html", "title": "St Mirren's 'dangerous' strikers Mandron & Olusanya have 'everything'", "title_page": "St Mirren's 'dangerous' strikers Mandron & Olusanya have 'everything' - Kerr - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "St Mirren assistant manager Brian Kerr has hailed the collective abilities of striking duo Mikael Mandron and Toyosi Olusanya, saying they would strike fear into any opposition manager.\nMandron scored twice in the Buddies' 3-0 win at Pittodrie last time out, while Olusanya has 11 goals in all competitions this season.\n\"I think they have everything,\" Kerr said. \"When you put both of them together you get height and physicality, hold-up play and pace in behind.\n\"In terms of the two of them playing together, you have everything with that front two. A very dangerous pair to deal with.\n\"I wouldn't like playing against both of them when they're in that kind of form. Mika gives you a real platform to build off. And Toyosi's pace is incredible. That would put fear into any manager.\"\nOlusanya's contract is due to expire at the end of this season, and while Kerr accepts there is likely to be interest in the striker's services, he insists he will remain at St Mirren beyond the January transfer window.\n\"Toy will attract attention,\" Kerr said. \"Like I said, any team that watches him, how aggressive he is, his pace. He's obviously scored a number of goals for us this year as well.\n\"So he's got to attract interest. But at the minute we've got no intention of letting Toy go anywhere until the summer when it's ultimately his decision.\"", "url": "https://www.bbc.com/sport/articles/cg5ymn7j8g6o"}