{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:46:22", "date_modify": "2025-04-26 06:46:22", "date_publish": "2025-03-01 14:02:21", "description": "Swansea City fans forum postponed a second time", "filename": "sport_football_articles_c99np7p9mrgo_1745649982.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/325c/live/991d0910-f69d-11ef-a895-fbbe0f4341f5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c99np7p9mrgo_1745649982.html", "title": "Swansea City fans forum postponed a second time", "title_page": "Swansea City fans forum postponed a second time - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Swansea City have postponed a fans' forum for a second time with a new date not yet announced.\nIt was originally scheduled for Tuesday, 18 February, but was postponed in the wake of head coach Luke Williams' departure to Monday, 3 March.\nBut that has also now been called off with the club saying it had again \"made the difficult decision to postpone\" the gathering, citing the following night's home Championship encounter against Preston North End among the reasons.\nSwansea stated: \"The club remains committed to holding this event. Chairman Andy Coleman has met with several groups of fans over the past few weeks, and open communication with supporters and fan engagement remains a key element of the strategic direction of the club.\n\"The overwhelming interest from supporters has quite understandably been focused on football performance. Given the recent changes within this department and the required preparations for our game against Preston, it is felt that it is not the right time to hold this event.\"\nSwansea bosses say fans will be invited to take part in a survey to \"help shape the direction of the club for the new season\".\nThe statement added: \"We can also confirm that the Supporters' Trust have been advised of this decision and of the upcoming supporter survey.\n\"While they would have preferred the forum to go ahead, they understand it needs to be where the panel is in position to answer our supporters' questions. The club and the Trust will be working together to confirm a new date for the forum as soon as possible.\"\nSuch was the interest in the forum scheduled for 3 March, club bosses decided to move the gathering from a lounge with space for 250 people to one of the main stands in the Swansea.com stadium.", "url": "https://www.bbc.co.uk/sport/football/articles/c99np7p9mrgo"}