{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:37:02", "date_modify": "2025-05-19 15:37:02", "date_publish": "2017-08-07 09:09:28", "description": "Two-time Tour de France champion Alberto Contador will retire from cycling after the Vuelta a Espana, which starts on 19 August.", "filename": "sport_cycling_40848355_1747669022.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/100C5/production/_97233756_contador.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_cycling_40848355_1747669022.html", "title": "Alberto Contador: Two-time Tour de France champion to retire from cycling", "title_page": "Alberto Contador: Two-time Tour de France champion to retire from cycling - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Two-time Tour de France champion Alberto Contador is to retire from professional cycling after the Vuelta a Espana, which starts on 19 August.\nThe Spaniard, 34, won the Tour de France in 2007 and 2009, but he was stripped of the 2010 title for doping.\nHe is one of only six riders to have won all three Grand Tours - the Tour de France, Vuelta and Giro d'Italia.\n\"I don't think there is a better farewell than the home race in my home country,\" he said on Instragram., external\nContador, who turned professional in 2003, added: \"I'm saying this happy, I'm not saying it with sadness. It's a decision I've thought about very well.\"\nHe was banned for testing positive for clenbuterol - a powerful drug used to treat asthma, but which can also help build up lean muscle mass and burn off fat - at the 2010 Tour de France.\nContador blamed his positive test on eating contaminated steak.\nThe Court of Arbitration for Sport (Cas) banned Contador in February 2012, but backdated the ban to 25 January 2011.\nHaving served five months and 19 days of a provisional suspension in 2010-11, he returned to cycling in August 2012.\nContador won seven Grand Tour titles and was awarded the prestigious Velo d'Or, voted for by journalists, a record four times.\nOnly Eddy Merckx, Bernard Hinault, Jacques Anquetil, Felice Gimondi and Vincenzo Nibali have also won all three Grand Tours.", "url": "https://www.bbc.com/sport/cycling/40848355"}