{"authors": ["Jonathan Sutherland", "www.facebook.com"], "date_download": "2025-04-26 04:17:28", "date_modify": "2025-04-26 04:17:28", "date_publish": "2025-03-04 07:29:56", "description": "Watch Airdrieonians v Falkirk live on BBC Scotland and iPlayer on Tuesday night as the Scottish Championship title race enters its final stage.", "filename": "sport_football_articles_czdny6856ljo_1745641048.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0948/live/eed507f0-f877-11ef-a40e-1dcee1447ad7.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_czdny6856ljo_1745641048.html", "title": "Airdrieonians v Falkirk: Scottish Championship title race promises drama", "title_page": "Airdrieonians v Falkirk: Scottish Championship title race promises drama - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Simply put, this could be the best Scottish Championship title race since BBC Scotland started broadcasting the division six years ago.\nGiven the memorable moments of recent years, that is quite the statement.\nBut with Falkirk, Livingston and Ayr United all jostling for one automatic promotion spot there is still uncertainty over the destiny of the title with a quarter of the season to play.\nAll three sides have been dropping points - Falkirk at Hamilton Academical on Saturday, Livingston at Partick Thistle in front of the Sportscene cameras on Friday.\nThat fragility only adds to the excitement. Which side can be the most consistent?\nFalkirk and Ayr play their games in hand over Livingston on Tuesday night, with John McGlynn's league leaders facing bottom side Airdrieonians live on BBC Scotland and iPlayer.\nAt the same time, Scott Brown's third-place Ayr United visit play-off chasing Queen's Park.\nCome full-time Falkirk could be four points clear of Livingston and six in front of Ayr. Or, there could be three sides separated by a single point.\nThen it could all change again when Livingston play Raith Rovers on Wednesday.\nIt is only the start of a run-in that looks set to be compelling right to the final minutes of the season.\nRhys McCabe's Airdrieonians looked dead and buried not that long ago, having shocked the division last season by reaching the play-offs after promotion.\nBut in the past two months they have started to piece together what would be a highly improbable comeback.\nThey had won only one Championship match all season until their 3-0 victory over Dunfermline on 25 January - but a four-game unbeaten league run followed to breathe some life into their campaign.\nA 4-1 loss at the hands of Ayr at the weekend brought that to an end, and Airdrie are still 10 points adrift of their nearest rivals in the table, Dunfermline.\nBut if they were to somehow survive the drop it would have to go down as one of the greatest Scottish football survival stories.\nHowever, time is running out, as defender Lewis Strapp is all too aware of.\n\"I'm expecting a reaction, first and foremost,\" he said after the Ayr loss.\n\"We're all a bit devastated, but on Tuesday we expect to go out there and for everyone to be at it.\n\"Even the boys coming off the bench, everybody needs to be ready to go.\n\"We've got 10 games left, we can't sit back and look at these results – we just need to keep looking forward.\"\nAirdrieonians have lost both matches to Falkirk 2-0 this season, but they have won their past three home games.\nBoth sides are desperate for points, as is every team in a league of fine margins.", "url": "https://www.bbc.co.uk/sport/football/articles/czdny6856ljo"}