{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:26:24", "date_modify": "2025-05-20 12:26:24", "date_publish": "2023-08-04 11:33:12", "description": "Bristol Rovers manager Joey Barton says his conduct has \"got to be better\" as he starts the season with a three-game stadium ban.", "filename": "sport_football_66397486_1747743984.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/11E4E/production/_130649237_shutterstock_editorial_14022002l.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66397486_1747743984.html", "title": "Joey Barton: Bristol Rovers boss says his conduct must improve", "title_page": "Joey Barton: Bristol Rovers boss says his conduct must improve - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Bristol Rovers manager Joey Barton says his conduct has \"got to be better\" as he starts the season with a three-game stadium ban.\nBarton was shown a red card following the team's 2-1 defeat by Sheffield Wednesday on 18 April.\nThe 40-year-old admitted swearing at an official in the tunnel and officials' changing room after the game.\nBarton will miss Saturday's first game of the season at Portsmouth, as well as matches against Barnsley and Charlton.\n\"I've got to be better and I intend my conduct to referees and comments to referees to be better this season,\" Barton told BBC Radio Bristol.\n\"I'm learning the hard way by missing what will be a fantastic game on Saturday at Fratton Park.\"\nBarton, who was also fined £3,000 by the Football Association, said he did not know where he would be when the match was on.\n\"I'm hoping I'll be sitting comfortably watching the game but any way of me getting a feed will probably mean I'm 30, 40, 50 seconds behind. I'm not sure where the streams are at these days,\" he said.\n\"Ideally, I wouldn't be banned but I shouldn't have sworn at the referee and I've got to prove my behaviour certainly when decisions go wrong against you.\"\nRovers have made eight signings so far this transfer window with defender Connor Taylor - who was part of the promotion-winning side from League Two in 2021-22 - re-signing from Stoke on a permanent deal this week.\nBarton said the club would like to add more players before the end of the summer.\n\"We've got several more to do I think before we've got all the pieces of the jigsaw for the first part of the season,\" he said.\n\"But we've done the lion's share of the work. We'll be hanging around deadline day hopefully looking for one, that usually is a sign of good business and maybe just as an x-factor one there you're not wanting on three or four because it's never a good time.\n\"Once that window closes that's your group and you get cracking, you've had a few games before that but also you know where you are as a team and the work you've got to do.\"\nRovers finished 17th in League One last season and secured new investment this week through new co-owner Kuwaiti businessman Hussain AlSaeed.\n\"We've just got to get better. The recruitment we've chosen has certainly developed us in areas of the team we felt we were lacking last year,\" Barton added.\n\"I'm confident with our group where we are, the work we've got to do. We tend to improve over the course of a season and I think a lot of our lads will benefit from the experiences of last year and Saturday for us is an opportunity for us to learn more about our team.\"", "url": "https://www.bbc.com/sport/football/66397486"}