{"authors": ["Jack Herrall", "www.facebook.com"], "date_download": "2025-05-21 04:26:16", "date_modify": "2025-05-21 04:26:16", "date_publish": "2025-02-01 11:36:31", "description": "First episodes of Romanov: Czar of Hearts available now", "filename": "sport_articles_cwyj9xdjzv0o_1747801576.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/faa4/live/25831050-df0d-11ef-a319-fb4e7360c4ec.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cwyj9xdjzv0o_1747801576.html", "title": "First episodes of Romanov: Czar of Hearts available now", "title_page": "First episodes of Romanov: Czar of Hearts available now - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Vladimir Romanov is a name that conjures up all sorts of memories and emotions for Hearts fans.\nA new BBC Scotland podcast series, Czar of Hearts, chronicles the Russian-born Lithuainian's rise in the east and his dramatic introduction to Scottish football, when he swept into a packed annual meeting and saved the club's home stadium, Tynecastle, from being sold to property developers.\nWhen former players, managers and others in his orbit were asked to sum him up in one word for this project, the question was met, more often than not, with some variation of: \"Oh, that's a tricky question that.\"\nIndeed, he is a hero to many fans while still held in complete contempt for the mess he left in his wake when he disappeared and fled to Moscow with Interpol hot on his heels.\n\"Sad\", \"entertaining\" and \"magical\" were just a few of the answers offered up, with 2012 Scottish Cup winning manager Paulo Sergio adding: \"Mysterious. He's a man that you look at him but you don't see anything.\"\nAcross nine episodes, the series will dive into Romanov's character, as described by long-time business partners from Lithuania; seek answers for some of the inspired and not-so-inspired footballing decisions he made or meddled in; and try to find where he is now from investigative reporters and those most likely to know.\nAn abandoned submarine on the outskirts of Moscow, or something less clandestine under Vladimir Putin's watchful eye?", "url": "https://www.bbc.com/sport/articles/cwyj9xdjzv0o"}