{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:22:53", "date_modify": "2025-05-21 05:22:53", "date_publish": "2025-04-03 15:45:24", "description": "A women's fencer is disqualified from a competition in the United States after refusing to compete against a transgender opponent.", "filename": "sport_fencing_articles_cpdzv76gl49o_1747804973.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/eb89/live/be0bac60-108b-11f0-92f2-9df11cadb01a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_fencing_articles_cpdzv76gl49o_1747804973.html", "title": "Fencer disqualified for refusal to compete against transgender opponent", "title_page": "Fencer disqualified for refusal to compete against transgender opponent - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A fencer was disqualified from a women's competition in the United States after refusing to compete against a transgender opponent.\nStephanie Turner took a knee in protest after standing on the piste before her bout against Redmond Sullivan at the University of Maryland.\nShe was shown a black card and informed she would not be allowed to continue in the women's foil tournament.\nInternational Fencing Federation (FIE) rules state a fencer is not permitted to refuse to fence another properly entered fencer for any reason.\nUSA Fencing, which enacted its transgender and non-binary policy in 2023, said: \"The policy is based on the principle that everyone should have the ability to participate in sports and was based upon the research available of the day.\"\nIt added: \"USA Fencing will always err on the side of inclusion, and we're committed to amending the policy as more relevant evidence-based research emerges, or as policy changes take effect in the wider Olympic and Paralympic movement.\"\nExplaining her decision, Turner - of the Fencing Academy of Philadelphia - told Fox News, external: \"I saw that I was going to be in a pool with Redmond, and from there I said: 'OK, let's do it. I'm going to take the knee.'\n\"I knew what I had to do because USA Fencing had not been listening to women's objections regarding [its gender eligibility policy],\" she added.\n\"When I took the knee, I looked at the ref and I said: 'I'm sorry, I cannot do this. I am a woman, and this is a man, and this is a women's tournament. And I will not fence this individual.'\"\nResponding to Turner's disqualification on 30 March, USA Fencing said: \"In the case of Stephanie Turner, her disqualification, which applies to this tournament only, was not related to any personal statement but was merely the direct result of her decision to decline to fence an eligible opponent, which the FIE rules clearly prohibit.\n\"USA Fencing is obligated to follow the letter of those rules and ensure that participants respect the standards set at the international level. We remain committed to inclusivity within our sport while also upholding every requirement dictated by our governing body.\"\nWhile The Cherry Blossom competition was held at the University of Maryland, it was not an NCAA event.\nIn February, the NCAA changed its policy to say that only \"student-athletes assigned female at birth\" will be allowed to take part in collegiate competitions, after US President Donald Trump signed an executive order preventing transgender women from competing in female categories of sports.\nTurner has competed in more than 200 fencing matches, including the national championships, while Sullivan, of Wagner College, has won 18 of her 45 previous bouts. She placed 24th out of 39 fencers at the Maryland event.", "url": "https://www.bbc.com/sport/fencing/articles/cpdzv76gl49o"}