{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:38:17", "date_modify": "2025-05-21 06:38:17", "date_publish": "2025-04-01 00:00:00", "description": "Reeco Hackett's first-half strike secured a gritty 1-0 victory for Lincoln as Huddersfield's play-off hopes received another damaging blow.", "filename": "sport_football_live_cgq9q21kyp4t_1747809497.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/fa23/live/40874ad0-0f3f-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cgq9q21kyp4t_1747809497.html", "title": "Lincoln City 1-0 Huddersfield", "title_page": "Lincoln City 1-0 Huddersfield - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Reeco Hackett's first-half strike secured a gritty 1-0 victory for Lincoln as Huddersfield's play-off hopes received another damaging blow.\nHackett scored the only goal after 35 minutes and his side put in a terrific defensive display to keep out a Terriers team who have now suffered six defeats in eight games.\nIt took 21 minutes for the first attempt on goal, with Town midfielder David Kasumu blazing wildly over the crossbar.\nBut it was City who took the lead with their first effort of the match. Tom Bayliss' corner was flicked on by Adam Jackson and rushing in at the back post was Hackett, who stabbed the ball into the net.\nCallum Marshall almost burst through on goal for Huddersfield, but Tom Hamer made a brilliant last-ditch tackle to stop him in his tracks.\nTwice Josh Koroma curled efforts over the City bar, before Hamer blocked Ben Wiles' strike from the edge of the box.\nHackett cleared a dangerous shot from ex-City loanee Joe Taylor as the battling Imps were determined not to be breached by the ever-more desperate visitors.\nJovon Makama brought a save out of Town goalkeeper Lee Nicholls as Lincoln made a rare foray into their opponents' box.\nAnd despite a late flurry of balls into the Lincoln box, City coped with everything the visitors could throw at them.", "url": "https://www.bbc.com/sport/football/live/cgq9q21kyp4t"}