{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:23:47", "date_modify": "2025-05-19 15:23:47", "date_publish": "2015-02-13 07:50:20", "description": "Ex Wales and Cardiff boss Bobby Gould says Paul Trollope's expected move to the Bluebirds will help manager Russell Slade.", "filename": "sport_football_31449403_1747668227.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/80975000/jpg/_80975962_cdf_310115_cardiff_v_derby07.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31449403_1747668227.html", "title": "Cardiff City: Paul Trollope good for Russell Slade says Bobby Gould", "title_page": "Cardiff City: Paul Trollope good for Russell Slade says Bobby Gould - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Wales and Cardiff City manager Bobby Gould says a move to bring coach Paul Trollope to the club would not undermine Bluebirds boss Russell Slade.\nTrollope, who was given his first Wales call up as a player by Gould, looks set to be added to Slade's backroom staff, with the team just six points above the Championship relegation zone.\n\"Perhaps he [Slade] needs a little bit of help,\" said Gould.\n\"We don't know whether it's being done with the blessing of the manager.\"\nHowever, Gould believes it is unlikely the appointment would be made without Slade being consulted.\n\"If the club makes those decisions then the manager has to have had discussions with them and taken on board what the club want and therefore this is a way forward for Cardiff City,\" he said.\nTrollope was previously first-team coach at Birmingham City and Norwich City, working alongside Chris Hughton.\nDuring five years as manager of Bristol Rovers he guided the club to promotion to League One in 2007., external\nSwindon-born Trollope, who won nine caps for Wales between 1997 and 2003, was a guest in the Chairman's Suite for Cardiff City's 0-0 home draw with Brighton on Tuesday night.\nCardiff sources say an appointment is imminent, and Trollope, whose coaching skills are highly regarded in the game, is the favourite to land the role.\nGould admits he's not sure if Trollope's expected arrival will be with Slade's blessing, but is confident the pair can work together going forward.\n\"Trolls [Trollope] with the experience he's got and being under Chris Hughton as well, he will know what Russell Slade wants,\" he said.\n\"When to say something and when not to say something and that's the identification of a good coach.\"", "url": "https://www.bbc.com/sport/football/31449403"}