{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:11:01", "date_modify": "2025-04-26 04:11:01", "date_publish": "2025-03-04 19:13:48", "description": "Wataru Endo press conference: Paris St-Germain vs Liverpool preview", "filename": "sport_football_articles_czdnvv8p0edo_1745640661.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8728/live/a06f8320-f92a-11ef-9cc1-0f3c4de978dc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_czdnvv8p0edo_1745640661.html", "title": "Wataru Endo press conference: Paris St-Germain vs Liverpool preview", "title_page": "Wataru Endo press conference: Paris St-Germain vs Liverpool preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Liverpool midfielder Wataru Endo has said he feels he is \"trusted a lot\" by manager Arne Slot, despite only starting six games in all competitions for the Reds so far this season.\nThe Japan international, who has made a further 17 appearances as a substitute this term, said: \"I often come on for the last 15-20 minutes, especially when we are in a winning situation.\n\"I want to help my team-mates on the pitch. I think I've been playing well so far and can help the team in games. I'll try to keep playing well when I get the chance to play.\n\"I've had conversations with the manager a few times during the season. He has told me my attitude and what I have done for the team is always unbelievable.\n\"I feel like he trusts me a lot. I'm happy to be here, I will keep working hard in training and working hard on the pitch as well.\"\nEndo was speaking at a news conference previewing the first leg of Liverpool's Champions League last-16 tie against Paris St-Germain on Wednesday.\n\"Offensively, they always try to play football,\" he said of PSG. \"Their wingers are key when they attack, they have a lot of good wingers and I think [Ousmane] Dembele is the top scorer in the team so we need to take care of him.\n\"They are all good players, but also we are here to show [that] ourselves. It's going to be a very exciting game.\"", "url": "https://www.bbc.co.uk/sport/football/articles/czdnvv8p0edo"}