{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:53:13", "date_modify": "2025-04-26 07:53:13", "date_publish": "2025-02-25 14:14:54", "description": "Bristol Rovers face a \"difficult\" relegation battle but boss Inigo Calderon remains confident they will avoid the drop to League Two.", "filename": "sport_football_articles_c2lj005x49qo_1745653993.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/74eb/live/44fb46a0-f37b-11ef-958e-8b9bf28c4572.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c2lj005x49qo_1745653993.html", "title": "Rovers will survive League One relegation scrap - Calderon", "title_page": "Rovers will survive League One relegation scrap - Calderon - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Bristol Rovers face a \"difficult\" relegation battle \"until the end\" of the season but boss Inigo Calderon remains confident his side will avoid the drop to League Two.\nRovers fell to 19th in League One on Saturday following their sixth loss in 11 league outings under Calderon, letting a second-half lead slip away at fellow strugglers Northampton.\n\"[Saturday's loss was] a difficult one to take, especially playing against rivals where they are with us down in the table,\" the Spanish manager said.\n\"Probably we started to kill the game too early... but it is not unlucky, you have to be perfect if you want to get something in this moment now.\"\nDefeat left Rovers just three points above Burton Albion at the top of the relegation places, albeit with a game in hand over the Brewers and Shrewsbury, who are also currently in the drop zone.\nDiscussing the fight to avoid relegation with just over a dozen matches left to play, Calderon said his team \"knows what it takes\" to remain in the EFL's third tier.\n\"Losing for me is not final because you have plenty of games and you cannot think you have done everything because then the next week you are already dead,\" said the ex-Brighton player.\n\"It's going to be like that until the end, and the good thing is that we've been there already so we know what this takes. Maybe another team this is coming as a surprise for them, for us this is not a surprise. We know it is going to be difficult until the end but we will do it.\"\nRovers next face 14th-placed Rotherham back at the Memorial Ground, where Calderon acknowledged his side have played markedly better compared to their away matches during his tenure. They have now lost four straight on the road, but have won three of their last four at home.\n\"We are relying too much on home games because we are performing better,\" Calderon said. Prior to Saturday's latest loss, he had admitted that Rovers \"have to improve playing away\".\nHe added: \"I prefer to play at home always because of the environment with our fans. Obviously we have to improve, but we have a whole week to train for that so I'm happy with this.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c2lj005x49qo"}