{"authors": ["Jonathan Jurejko", "www.facebook.com"], "date_download": "2025-04-26 07:34:32", "date_modify": "2025-04-26 07:34:32", "date_publish": "2025-02-27 15:39:59", "description": "Britain's Emma Raducanu will travel to the WTA tournament in Indian Wells after deciding to play following her recent stalking ordeal.", "filename": "sport_tennis_articles_cy5nk1101zgo_1745652872.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b338/live/f867a400-f41f-11ef-b21d-b7e43192c885.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_tennis_articles_cy5nk1101zgo_1745652872.html", "title": "Emma Raducanu will play Indian Wells after Dubai stalking incident", "title_page": "Emma Raducanu will play Indian Wells after Dubai stalking incident - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Emma Raducanu has decided to play at the upcoming WTA tournament in Indian Wells following her recent stalking ordeal.\nBritain's Raducanu, 22, was deliberating whether to travel to the United States for the hard-court event which starts next week.\nThe former US Open champion was shaken after a man \"exhibited fixated behaviour\" towards her at last week's Dubai Tennis Championships.\nThe man was later detained and given a restraining order, Dubai Police said.\nRaducanu was visibly upset after seeing the man in the stands during her second-round match last week.\nThe BNP Paribas Open in Indian Wells begins on 5 March.\nThe Californian event is one of the biggest tournaments of the season outside of the four Grand Slams, with the world's best men and women competing in a combined ATP/WTA event over a fortnight.\nRaducanu had direct entry into the 128-player women's singles field having climbed up to 55th in the world rankings.\nLast year, the British number two was given a wildcard as she fought back from wrist and ankle surgeries which ruled her out of most of the 2023 season.", "url": "https://www.bbc.co.uk/sport/tennis/articles/cy5nk1101zgo"}