{"authors": ["Andrew Benson", "www.facebook.com"], "date_download": "2025-04-26 06:20:13", "date_modify": "2025-04-26 06:20:13", "date_publish": "2025-03-01 06:30:54", "description": "After three days of testing in Bahrain, McLaren have started as they finished last season, while Lewis Hamilton is positive about the beginning of his Ferrari career.", "filename": "sport_formula1_articles_czedde0p0pzo_1745648413.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e922/live/7559f9b0-f667-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_formula1_articles_czedde0p0pzo_1745648413.html", "title": "F1 2025 pre-season testing: McLaren impressive and Lewis Hamilton positive", "title_page": "F1 2025 pre-season testing: McLaren impressive and Lewis Hamilton positive - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Twenty-four hours of Formula 1 pre-season testing, over three days in Bahrain this week, left the impression that McLaren will start the new season as they ended the last - as the team to beat.\nThe usual caveats apply. It is next to impossible to make definitive judgements about performance in testing as there are just too many variables involved.\nNot only that, it takes place at only one track, with one set of characteristics, and F1 cars are prototypes that do not stay the same through a season.\nMercedes' George Russell ended the final day with the fastest time, just 0.021 seconds quicker than Red Bull's Max Verstappen. And the best lap of the entire test was set by Carlos Sainz, following his switch to Williams from Ferrari to make way for Lewis Hamilton.\nBut there seemed enough evidence to suggest that McLaren, who last year won their first constructors' title since 1998, have a definitive advantage.\nThis appears less pronounced over a single lap than it does over a race distance.\nAnd the biggest proviso is that the pace of Red Bull - for whom Verstappen won a fourth consecutive drivers' title last year - is particularly hard to divine.\nThe sense that McLaren were a step ahead of their rivals at Bahrain's Sakhir track was founded on some eye-catching pace on race-simulation runs.\nThese are always the most reliable indicators of true competitiveness in testing because a key variable is removed. Teams do a full grand prix distance so the level of fuel is known, even if other settings, such as engine modes, may still not be comparable from car to car.\nOn the afternoon of the second day of testing, McLaren's Lando Norris did a race-simulation run at the same time as Ferrari's Charles Leclerc and Mercedes' Andrea Kimi Antonelli. The Briton's pace was breathtaking.\nHe would have won the 'race' by more than 30 seconds, and was on average more than 0.5secs a lap quicker than his rivals.\nLeclerc would have finished about two seconds ahead of Antonelli.\nOn the final afternoon, Norris' team-mate Oscar Piastri and Mercedes' George Russell were out at the same time doing the same thing.\nAgain, the McLaren was faster, although not by as much. Piastri was an average of 0.2secs a lap quicker than Russell. That would mean winning by just over 10 seconds.\nHowever, Piastri's advantage was nearly all gained in the first stint, in which he was 0.5secs quicker than Russell. In the second and third stints, the McLaren's advantage was just 0.05secs.\nIt's pointless comparing the times of Norris, Leclerc and Antonelli with those of Piastri, Russell from one day to the next, because Thursday was cooler and less windy than Friday.\nF1 cars are faster in cooler conditions because the higher air density increases both downforce and engine performance, and wind is bad news for the cars' sensitive aerodynamics.\nOver one lap, the McLaren's pace was less outstanding - but then it's harder to tell that in testing. For what it's worth, McLaren seem pretty level-pegging over a single lap with Ferrari, a Verstappen-driven Red Bull and Mercedes.\nMcLaren were keen to play down any claims that they were ahead.\nTeam principal Andrea Stella said he \"would be very careful\" about drawing conclusions from Norris' run, suggesting the usually cool conditions in Bahrain \"were in a sweet spot for our car - they were conditions our car enjoys, cool, not much wind\".\nStella's point is that the conditions perhaps masked some of the weaknesses McLaren have had in Bahrain in recent years - the track's combination of mainly slow corners and traction-dominated layout do not play to the car's strengths, especially in the heat that is normally typical in the desert.\nBut there is another way of looking at that. If McLaren can be this quick on a circuit that does not suit their car, just how good could they be at Melbourne, which on paper is much more their kind of track?\nThe McLaren excels in the sort of medium-speed corners and low-grip surface that are typical at Albert Park, where front-end performance is the main limitation for an F1 car, not rear as in Bahrain.\nNorris, sitting in a news conference with Verstappen and Leclerc, said: \"If we want to improve anything at the moment, it's the rear, but the rest of it feels correct and feels in the same ball park.\n\"I don't think we are expecting to be a big step ahead of everyone. We are expecting to be close to the guys to my right. If we are there from the off, that's the main thing.\"\nHamilton has been full of optimism about the start of his Ferrari career, both before and during the Bahrain test.\nHe said the car was giving him \"the most positive feeling I've had for a long time\". Hardly a surprise after three difficult seasons with Mercedes.\nAnd he said his work getting used to the team could not have gone better, after a month embedded in Italy before Bahrain.\n\"I feel like we've built a really good foundation,\" Hamilton said. \"But these guys out there look really competitive. It looks very close. We won't know until Melbourne where we stand but we know we've got work to do.\"\nHamilton's test did not end on a particularly happy note - he stopped running early, and a planned race-simulation did not happen.\nLeclerc said the race run against Norris \"was a really important run to understand where we were lacking compared to them\".\nBut he also said the weather in Bahrain had made it harder than usual to understand where the teams sat.\n\"The conditions have been so inconsistent, which makes testing a lot more difficult to take anything out of,\" he said on Friday.\n\"The wind has changed a lot, yesterday we even had rain, and the temperature was very low on the first day. So very difficult to have a lap-time reference, which is important for the team.\n\"We are probably going into the first race with a bit more unknown than other years.\"\nAny assessment of testing is always going to be inexact, based as it is on hints and snapshots of something necessarily opaque. And that is especially the case with Red Bull.\nThe problem is that they did not do a full race simulation - and Verstappen appeared not to do a race run at all.\nOn Thursday, the Dutchman's new team-mate Liam Lawson did 43 laps of a 57-lap grand prix distance. The New Zealander was more than a second a lap on average slower than Norris. But it's hard to draw any conclusions about the car from that because Lawson's level is unknown.\nVerstappen did do one run on Friday that looked very quick - a stint of seven laps had him faster than the race-distance averages of Piastri and Russell.\nThat would put him at a similar level to Norris the day before.\nBut there are a lot of assumptions in that - his fuel load is unknown as the run was so short, the conditions were different to Thursday, the performance level of the individual Mercedes and McLaren drivers, and so on.\nVerstappen was fastest of all for a period on the final afternoon, until Russell pipped him with six minutes to go.\nBut single lap times are especially unreliable in testing, and on top of that the car did not look comfortable. Verstappen was visibly fighting it.\nIt lacked front grip in some places, rear grip in others - just as it did in the team's period of struggle last year, when Verstappen would talk about the car feeling \"disconnected\" - and he even had a spin at Turn One.\nRed Bull spent the day experimenting with new parts. A new front wing design was fitted early on Friday. But then the car spent considerable time in the garage with the doors closed - which means the floor was off, because that's the only circumstances in which teams are allowed to shut their garages.\nAnd by the end of the day, Verstappen had reverted to the original front wing.\nTechnical director Pierre Wache admitted the team had concerns. \"I am not as happy as I could be because the car did not respond how we wanted at times,\" he said in a video issued by the team.\n\"But it is going in the right direction, just maybe the magnitude of the direction was not as big as we expected.\"\nVerstappen's only comments to the media were made after he had had just half a day in the car.\nAsked if the team had solved the problems that turned his title campaign into a rear-guard battle last year, he said: \"It can't be worse than last year. The direction we are working in is good. It is really early days. It has improved everywhere compared to last year. It's positive.\"\nLawson said: \"Everyone has new cars but not a huge amount has changed. We can expect the performance, especially of McLaren, last year to probably start like that this year.\"\nWilliams had an eye-catching test. Sainz's fastest time came on a qualifying simulation on Thursday, and a similar run on Friday put team-mate Alex Albon fastest for a while, before he ended the final day third quickest.\nSainz's pace caught the eye of Stella, who said Williams looked \"very competitive - I'm really stating the obvious, because everyone will have seen the data\".\nAlpine, too, produced some decent lap times, particularly with Pierre Gasly.\nBut Williams team boss James Vowles does not believe the midfield will have significantly closed on the big teams.\n\"Top four will be the top four,\" Vowles said. \"[There is a] large gap between them and the midfield.\"\nAnd again surface impressions might be misleading.\nWilliams looked in decent shape judging by the headline lap times, while Aston Martin, who had a quiet test, appeared as if they may be in trouble.\nBut teams' data suggests otherwise - the info behind the headline numbers suggests Aston Martin and Alpine are best of the rest, followed by Williams, Racing Bulls and Haas, with Sauber bringing up the rear.\nBut form is likely to fluctuate race to race.\n\"The midfield is going to be very tight,\" Vowles said, \"and if I'm getting it right, 0.1secs separates a lot of us.\"\nThat could well be the case at the front as well.", "url": "https://www.bbc.co.uk/sport/formula1/articles/czedde0p0pzo"}