{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:08:56", "date_modify": "2025-05-21 07:08:56", "date_publish": "2025-03-30 12:13:17", "description": "'I want more' - Dessers 'proud' to be among Rangers greats", "filename": "sport_articles_c98g5d19g3eo_1747811336.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ec16/live/50944080-0d60-11f0-8cb6-ef080be5aa48.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c98g5d19g3eo_1747811336.html", "title": "'I want more' - Dessers 'proud' to be among Rangers greats", "title_page": "'I want more' - Dessers 'proud' to be among Rangers greats - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cyriel Dessers is \"proud\" to be among some of Rangers' 21st century greats when he made his 100th competitive appearance for the club.\nThe 30-year-old scored a dramatic late winner as the Ibrox club came from behind to beat Dundee 4-3 at Dens Park.\nThe strike marked his 45th goal in 100 appearances for the club, which ranks behind only Kris Boyd (68), Alfredo Morelos (57) and Shota Arveladze (48) for goals in their first 100 Rangers appearances this century.\n\"I had difficult times at this club, especially when I came in, but when you're amongst among these names I think you're doing something right,\" Dessers said.\n\"I know the people in the building see how hard I work in the gym, on the pitch, in training, and this is the reward so when you when you tell me this, that's a very nice thing to hear from you. These are big names in the history of this club.\"\nDessers has split opinion among Rangers fans, but his goalscoring feats are undeniable during a turbulent spell for the club.\n\"I know it has been two hard years for everybody with a lot of ups and downs,\" the Nigeria international added. \"We have had some unbelievable moments in Europe and winning a League Cup, but we didn't get the big prize last season, which we all fight for, so got some stick.\n\"I think that's normal when you don't win the league at Rangers, but on a personal level to hear that [record] fills me with pride.\n\"Obviously I want more, I think the fans want more, the gaffer wants more so I'm working hard for that every day.\"", "url": "https://www.bbc.com/sport/articles/c98g5d19g3eo"}