{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:28:05", "date_modify": "2025-05-20 13:28:05", "date_publish": "2023-07-25 13:02:06", "description": "Man City: Kyle Walker transfer update from Pep Guardiola", "filename": "sport_articles_cgxe4yne829o_1747747685.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a548/live/247afad0-2ae9-11ee-b1d7-8fdc93c2782e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cgxe4yne829o_1747747685.html", "title": "Man City: Kyle Walker transfer update from Pep Guardiola", "title_page": "Man City: Kyle Walker transfer update from Pep Guardiola - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Pep Guardiola has insisted Manchester City \"will fight\" to keep Kyle Walker.\nIt is understood the right-back is considering a move to Bayern Munich but no deal is yet in place.\nCity face Bayern in a pre-season friendly on Wednesday and Guardiola was coy when asked about Walker's future in his pre-match news conference.\n\"I hear the comments from Thomas Tuchel about Kyle [Walker] where he says no comments and I will say the same - no comments,\" said Guardiola.\n\"What I can say is he is an incredibly important player for us. He has very specific qualities that are so difficult to find worldwide, he has qualities that are irreplaceable obviously. So we want him here yes, but in the end I don't know what is going to happen. I know we are in touch, both clubs.\n\"We will fight for him, like I'm pretty sure Bayern [will]. I don't know how it is going to finish.\"\nThe Spaniard was bullish in his answer to questions on the likelihood of the England defender being included for the match.\n\"It's our player, so when we play Bayern we need the best players,\" he added.\n\"He's our player and we hope he's going to stay all the season with us, so why should he not play?\"", "url": "https://www.bbc.com/sport/articles/cgxe4yne829o"}