{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:24:24", "date_modify": "2025-05-21 07:24:24", "date_publish": "2025-03-28 15:33:26", "description": "Blackburn Rovers head coach Valerian Ismael says news of some supporters groups being unhappy with the owners is a difficult situation.", "filename": "sport_football_articles_c99n91d0k33o_1747812264.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/76b7/live/cb826440-0be2-11f0-8ae9-2975efdc7f47.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c99n91d0k33o_1747812264.html", "title": "Valerian Ismael: Blackburn Rovers fans' discontent 'a deep problem'", "title_page": "Valerian Ismael: Blackburn Rovers fans' discontent 'a deep problem' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The discontent among some Blackburn Rovers supporters shows they care, according to head coach Valerien Ismael.\nIt comes as a collection of fan groups are calling upon senior club officials to stay away from the side's remaining games this season.\n\"It's a difficult situation to hear that,\" Ismael told BBC Radio Lancashire.\n\"I know we have some issues between the fans and the board but I think it's important to show that they care about the club, that everyone cares about the club.\"\nBlackburn have lost three games and drawn once since Ismael replaced John Eustace as head coach last month, and the Rovers boss said he is trying to concentrate on football matters.\n\"My focus is the training and the game, it's why I'm here. Our job is to make sure that we can perform on the pitch and that the players are able to compete.\n\"I know it's not the first time that something has happened [between fans and owners]. It's a deep problem, not from yesterday. So I think that it's something to deal with, to accept, to know that and to be focused on your job.\"\nBlackburn go for their first victory under the Frenchman at Portsmouth on Saturday (15:00 GMT) with defenders Danny Batth and Owen Beck available for the first time since he took over.\nWide man Ryan Hedges is also in contention to play at Fratton Park after picking up an injury in the draw against Norwich City at the start of the month - Ismael's first match in charge.", "url": "https://www.bbc.com/sport/football/articles/c99n91d0k33o"}