{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:13:49", "date_modify": "2025-05-21 05:13:49", "date_publish": "2025-04-05 00:00:00", "description": "Two goals from Jaidon Anthony are enough to help Burnley win at Coventry City and go top of the Championship.", "filename": "sport_football_live_cy5ryez7vr2t_1747804429.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cy5ryez7vr2t_1747804429.html", "title": "Coventry City 1-2 Burnley: Clarets go top of the Championship", "title_page": "Coventry City 1-2 Burnley: Clarets go top of the Championship - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jaidon Anthony's double was enough to help Burnley win 2-1 at Coventry City and go top of the Championship.\nHaji Wright's controversial fifth-minute goal gave the Sky Blues the lead at a sun-kissed CBS Arena.\nBut winger Anthony scored a goal in each half to claim the three points and extend Burnley's astonishing unbeaten league run to 27 games.\nCoventry, who had head coach Frank Lampard sent off after the full-time whistle, dropped to seventh after Middlesbrough and Bristol City both won, one point outside the play-off positions while Scott Parker's Clarets are now a point clear after Sheffield United's defeat at Oxford.\nAnthony was a constant thorn in Coventry's side. Just 30 seconds in, he linked up well with Lyle Foster to fire an effort comfortably claimed by Coventry keeper Brad Collins, deputising for injured first-choice Oliver Dovin.\nYet, having conceded just 11 goals all season, Burnley's defence was breached on five minutes when a fabulous interception from Milan van Ewijk allowed the right-back to race down the wing and pick out Jack Rudoni.\nRudoni's left-footed effort was superbly pushed on to the post by Burnley keeper James Trafford and, after Ephron Mason-Clark's effort was blocked on the line by Connor Roberts, Wright smartly swivelled to score his 11th goal of the season from a yard out - before TV replays showed the American international was standing in an offside position.\nCoventry's lead lasted just 11 minutes after Matt Grimes gave the ball away in midfield, Marcus Edwards found Josh Cullen and his pull-back fell invitingly into the path of Anthony who had the simplest of tasks to tap into an empty net.\nIn a frantic first half hour, excellent play between Mason-Clark and Jay Dasilva allowed the left-back to pick out a pinpoint cross but the ball managed to go through the legs of Wright.\nThe Clarets continued to prove a threat down the left and, after Edwards' shot was blocked, the ball came back to Josh Laurent who volleyed narrowly over.\nCoventry City assistant coach Joe Edwards told BBC Radio CWR:\n\"I'm here because Frank Lampard was sent off, which I was informed of as we came off the pitch.\n\"Frank's received the red card. I'm not entirely sure what for, to be honest. Obviously there was a bit of frustration from everyone in the stadium and it's boiled over and Frank's been punished.\n\"The last thing I want to do is get punished myself by speaking too much.\n\"When you concede a goal like that against a Burnley side who are capable of shutting up shop, the big marker is what's the reaction going to be like and that was the positive thing for us because, for the remaining 30 minutes, the game was played in Burnley's half.\"\nBurnley boss Scott Parker told BBC Radio Lancashire:\n\"A massive result for us. First and foremost we've come to a really tough place. The stadium was bouncing, so we knew the challenge ahead of us and I thought we were superb.\n\"This division is highly competitive. To be 27 matches unbeaten is something to be really proud of. Hopefully we continue that.\nOn the winning goal: \"Great goal in terms of the timing of it in the second-half but one goal in this league - nine times out of 10 - and the match turns out how it turned out. For the last 15 minutes, any coach standing here suggesting there is a tactical element, there isn't. It's time to dig deep.\nOn Coventry's goal: \"It was puzzling really. I'm not level with the play. I'm standing in this box. You can instantly tell something didn't look right. That was very night and day. Our reaction was superb, but a little bit disappointed in that one.\"", "url": "https://www.bbc.com/sport/football/live/cy5ryez7vr2t"}