{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:56:08", "date_modify": "2025-05-21 05:56:08", "date_publish": "2025-04-02 06:01:37", "description": "Britain's Fran Jones says her heart \"worked a little too hard\" after she collapsed during a match in Colombia.", "filename": "sport_tennis_articles_c1lmg50vz1mo_1747806968.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1e49/live/f7c025b0-0f84-11f0-9dfb-d92aba7031b7.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_tennis_articles_c1lmg50vz1mo_1747806968.html", "title": "Fran Jones: British tennis player collapses on court in Colombia WTA event", "title_page": "Fran Jones: British tennis player collapses on court in Colombia WTA event - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "British tennis player Fran Jones said her heart had \"worked a little too hard\" after she collapsed during a match in Colombia.\nThe 24-year-old was helped off court in a wheelchair but says checks have shown there will be no longer-term impact from the scare.\nShe attributed her collapse to not acclimatising to the high-altitude conditions in Bogota, having had a practice session cancelled because of rain.\n\"Aside from my low-level pre match warm up, my first exposure to the limited oxygen levels at a high intensity was my match,\" Jones posted in an Instagram story., external\n\"As the match went on, I worked hard to give myself the opportunity to stay competitive while trying to get used to the conditions but progressively struggled.\"\nShe said \"blurry vision\" led to her collapse and she experienced no cramping.\n\"Overnight we conducted multiple studies and it seems my heart worked a little too hard on the day but thankfully no longer term impact,\" Jones added.\nJones was attempting to serve in the ninth game of a deciding third set at the Colsanitas Cup, a WTA 250 tournament, when she fell to the floor.\nThe British number five initially lay on her back before rolling on to her side as she was attended to by medical staff.\nArgentine opponent Julia Riera, who was ultimately awarded the first-round match, walked over to check on Jones and helped to lift her on to a wheelchair.\nJones beat Riera in straight sets last week on her way to winning the W75 Vacaria tournament in Brazil, the eighth ITF title of her career.\nMeanwhile, Heather Watson went out of the Charleston Open with a straight-set defeat by Iryna Shymanovich in the first round.\nThe British number seven was beaten 7-6 (10-8) 6-4 by the Belarusian world number 215.", "url": "https://www.bbc.com/sport/tennis/articles/c1lmg50vz1mo"}