{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:45:03", "date_modify": "2025-05-21 07:45:03", "date_publish": "2025-01-30 16:39:32", "description": "Plymouth Argyle boss Miron Muslic says the club could be close to signing Ukraine defender Maksym Talovierov from Austrian side LASK.", "filename": "sport_football_articles_cp8qz1dg8qdo_1747813503.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4cf5/live/7f63ac30-df24-11ef-a622-27240dd7c784.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cp8qz1dg8qdo_1747813503.html", "title": "Maksym Talovierov: Plymouth Argyle closing in on Ukraine defender", "title_page": "Maksym Talovierov: Plymouth Argyle closing in on Ukraine defender - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Plymouth Argyle head coach Miron Muslic says the club could be close to signing Ukraine defender Maksym Talovierov from Austrian side LASK.\nThe 24-year-old has been the subject of speculation linking him with a move to the Championship side for the past week.\nArgyle are in need of defensive reinforcements with Brendan Galloway out for the season and Lewis Gibson having left for Preston North End earlier this month.\n\"He's a nice player, he's a nice profile and that's a profile and a kind of player I like,\" Muslic said of Talovierov.\n\"So let's see, things are moving and hopefully very soon we will have some confirmation.\"\nArgyle have also been linked with Slovenia midfielder Adrian Zeljkovic from Spartak Trnava.\nThe 22-year-old made his full international debut a year ago against the United States.\nMuslic says he is confident he will have new faces in his squad in time for the visit of West Bromwich Albion on Saturday.\n\"I think we are very close - I think some names are already outside, some rumours already outside,\" he told BBC Radio Devon.\n\"I think the plan is to have some players arriving tonight, hopefully everything can be done so we could have them in the session tomorrow,\" he added on Thursday.\n\"It's a hectic transfer window, not only for us, for everyone involved.\"", "url": "https://www.bbc.com/sport/football/articles/cp8qz1dg8qdo"}