{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:33:10", "date_modify": "2025-05-21 04:33:10", "date_publish": "2025-02-01 10:13:58", "description": "Great Britain face a Davis Cup relegation play-off after losing their first-round tie 3-2 against Japan.", "filename": "sport_tennis_articles_c5ye5gzk23eo_1747801990.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ca50/live/b9cd7eb0-e081-11ef-9c8b-21164949e804.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_tennis_articles_c5ye5gzk23eo_1747801990.html", "title": "Davis Cup: GB face relegation play-off after Japan defeat", "title_page": "Davis Cup: GB face relegation play-off after Japan defeat - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Great Britain face a Davis Cup relegation play-off after losing their first-round tie 3-2 against Japan.\nWith the tie level at 1-1 after Friday's opening day, Britain took the lead when Neal Skupski and Joe Salisbury won Saturday's opening rubber 7-6 7-6 against Yosuke Watanuki and Takeru Yuzuki.\nBut Jacob Fearnley, who beat former world number four Kei Nishikori on Friday, was beaten 6-3 7-6 by Yoshihito Nishioka to force a decider.\nThe experienced Nishikori, 35, then cruised past Billy Harris 6-2 6-3 in an hour and 15 minutes to seal victory for the hosts in Miki, Japan.\n\"Losing is difficult, but I can't fault the efforts of the four players here over the last two days and for that matter the whole week,\" said GB captain Leon Smith. \"They've been great to work with, they gave everything they could on the match court. You win some, you lose some.\"\nAn inexperienced GB side were without British number one Jack Draper because of a hip injury, while British number two Cameron Norrie withdrew through illness.\nThey need to win their relegation play-off tie in September to stay in the top world group next season.", "url": "https://www.bbc.com/sport/tennis/articles/c5ye5gzk23eo"}