{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 15:00:39", "date_modify": "2025-05-20 15:00:39", "date_publish": "2023-07-27 12:41:37", "description": "'The fans are accustomed to success' - MacLean aims to rally from cup exit", "filename": "sport_articles_ckvyk80xe59o_1747753239.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5d32/live/e20e83c0-2c72-11ee-b1d7-8fdc93c2782e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_ckvyk80xe59o_1747753239.html", "title": "'The fans are accustomed to success' - MacLean aims to rally from cup exit", "title_page": "'The fans are accustomed to success' - MacLean aims to rally from cup exit - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Steven MacLean reckons St Johnstone fans have been \"spoilt\" with three trophy triumphs and European football in the past nine years, but he's intent on delivering a team to be proud of this season.\nWith their Viaplay Cup hopes already in tatters after a group-stage exit, MacLean is seeking up to four new signings to strengthen the squad.\nSpeaking to Sky Sports, the 40-year-old former striker and assistant, who was appointed permanent manager on a three-year deal in May, said: “I know the club really well and it means a lot to me.\n“If I can add that little bit of quality to the squad, and get the six or seven players we have injured back, we can have a good season.\n“I want to play a certain way and I want to get after teams and get off on the front foot, I want to excite the fans.\n“The crowd over the last seven or eight years have been very spoilt, we’ve won three cups and had European runs, so they’ve probably become accustomed to that success.\n“Hopefully we can build on that. I’m not going to say we’re going to win a cup but we’re going to try and play attractive football and be as successful as we can.\"\nMacLean, who has signed goalkeeper Dimitar Mitov and Luke Jephcott so far this summer, revealed the areas he still wants to strengthen and says Saints have missed out on targets because of finances.\n“Hopefully we can get three or four more over the line. We’re looking for a centre-half, an attacking midfielder and a wide player and maybe that something different later on in the window,\" he said.\n“It’s difficult, we’ve been in for quite a few players and we’ve missed out through different things but a lot of the time it was money, players got offered more elsewhere.\n“We know what we’re dealing with, especially with loans but we’re comfortable with it, we know what our budget is, we know where we want to be and we’ll get there.”", "url": "https://www.bbc.com/sport/articles/ckvyk80xe59o"}