{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:52:36", "date_modify": "2025-05-21 06:52:36", "date_publish": "2025-03-29 19:05:28", "description": "Cornish Pirates joint-head coach Gavin Cattle says a 'lack of physicality' cost his side as they lose 45-24 at Bedford in the Championship.", "filename": "sport_rugby-union_articles_cnvzv19zn3no_1747810356.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2d8d/live/3344b570-0e0d-11f0-90cb-6de76cd8d1c0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cnvzv19zn3no_1747810356.html", "title": "Cornish Pirates lose 45-24 at Bedford due to 'lack of physicality'", "title_page": "Cornish Pirates lose 45-24 at Bedford due to 'lack of physicality' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cornish Pirates joint-head coach Gavin Cattle says a 'lack of physicality' cost his side as they lost 45-24 at Bedford Blues.\nThe Pirates conceded six tries at second-placed Bedford as they lost for the third time in four Championship fixtures.\nDespite the defeat, they remain sixth in the table, having won seven and lost seven of their 14 games.\n\"Physicality-wise, I think we were definitely on the wrong side of the penalty count, I think it was 15 to nine or something like that,\" Cattle told BBC Radio Cornwall.\n\"But we were about nine at half-time, and what do you put that down to, it was a lack of physicality I felt.\n\"A lot of turnovers in attack where we're letting the breakdown evolve instead of just taking care of it ourselves.\"\nChester Ribbons gave Pirates the perfect start as he raced in after just 27 seconds, but Bedford levelled soon after through a Matt Worley try.\nMatt McNab restored Pirates' seven-point lead midway through the first half, but Will Maisey and Worley went over to help put Bedford 24-14 in front at the break.\nTries for Louis James and Joe Howard made it 38-14 before Arthur Relton marked his 50th Pirates appearance with a touchdown to cut the gap before a late Harry Yates try ensured a losing bonus point for the visitors.\nBut Bedford had the final say as Luke Frost crossed in the final moments of the game.\n\"At home we get a good vibe and a good flow into the game, but when you're travelling it's how you create that vibe,\" added Cattle.\n\"I just felt we were a bit flat today and then we were looking at each other in that first 20 minutes like 'what's happening here?'\n\"But we had opportunities, we just didn't take the pressure moments, Bedford did.\n\"I think it flattered them a bit in terms of the scoreline, but you've got to hand it to them, their maul dominance was clear to see and I think that had the grip of the game ultimately.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/cnvzv19zn3no"}