{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:31:28", "date_modify": "2025-05-21 06:31:28", "date_publish": "2025-03-31 19:21:12", "description": "Dundee report a £2.76m loss for the year to May 2024, despite last season's top-six finish.", "filename": "sport_football_articles_crld8k2l8k3o_1747809088.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a9f9/live/9919f8e0-0e64-11f0-9848-d7576b56a0e5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_crld8k2l8k3o_1747809088.html", "title": "Dundee report £2.8m loss for year to May 2024", "title_page": "Dundee report £2.8m loss for year to May 2024, club say it was 'expected' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Dundee have reported a £2.76m loss for the year to May 2024, which the club say was \"expected\".\nThe latest accounts relate to the Dens Park club's first season back in the Scottish Premiership following promotion. Under Tony Docherty, Dundee finished sixth.\nThe Dark Blues had reported a similar loss in the previous accounting period when they were in the Championship. The latest accounts show an increase in wages and salaries - £4.05m up from £3.06m.\nNet liabilities are up almost £1.85m to £8.1m. Debtors are listed at around £1.6m.\n\"After promotion from the Scottish Championship, the owners were determined to establish the club in the Scottish Premiership and this required continued investment in the playing and coaching staff,\" Dundee said on their website.\n\"Significant investment was made to upgrade and improve the pitch at Dens Park, which saw major work carried out on the playing surface.\n\"The club also increased its operational departments, bringing in further staff members due to the continued development of the football club.\n\"This resulted in a financial loss but this was expected on the club's return to the top flight.\"\nThis season, Dundee are 11th in the Premiership after 31 of their 38 fixtures - five points above bottom side St Johnstone. They will finish this term in the bottom six.", "url": "https://www.bbc.com/sport/football/articles/crld8k2l8k3o"}