{"authors": ["Ged Scott", "www.facebook.com"], "date_download": "2025-05-21 06:45:49", "date_modify": "2025-05-21 06:45:49", "date_publish": "2025-03-30 16:17:14", "description": "Wigan Warriors coast to victory over cash-strapped Salford Red Devils as they run in 10 tries against the game visitors at Brick Community Stadium.", "filename": "sport_rugby-league_articles_c17q4e7gpxzo_1747809949.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1642/live/659dd8d0-0d9f-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-league_articles_c17q4e7gpxzo_1747809949.html", "title": "Super League: Wigan 54-0 Salford: Ten-try loss for crisis club", "title_page": "Super League: Wigan 54-0 Salford: Ten-try loss for crisis club - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wigan Warriors coasted to victory over cash-strapped Salford Red Devils as they ran in 10 tries at a sun-kissed Brick Community Stadium.\nAfter successive narrow defeats by Hull FC in the Challenge Cup and at Leeds in Super League, last season's record-breaking quadruple winners restored a bit of order.\nBut they were still given a better game than they might have thought by crisis club Salford, whose unpaid players put in a far bigger shift than might have been expected in their current circumstances, especially after it was reported, by the PA Media news agency among others, that two players - Kallum Watkins and Chris Atkin - had refused to feature.\nHat-trick man Jake Wardle got Wigan's first, third and last tries, while Jai Field got two, and Junior Nsemba, Liam Marshall, Bevan French, Sam Walters and Zach Eckersley also crossed, all festooned by seven conversions out of 10 from Harry Smith.\nAgainst a Salford side who could so easily not have turned up at all, Wigan also had four other tries chalked off - and the home fans enjoyed a welcome return to action for young forward Brad O'Neill, who came back after last season's ACL injury for his first appearance since July.\nAlthough Wigan did all the scoring, and made it 13 straight wins over Salford in the process, this was also a day to praise the visitors' weakened, wearied and depleted troops for all the considerable and unrewarded effort they put in.\nAnd they nearly had a consolation late on, but Nathan Connell's last-minute try was cruelly ruled out for a perceived knock-on - to gasps of disappointment even from the home fans.\nAfter one early disallowed try for offside, Wigan were ahead inside 10 minutes when Nsemba weaved his way into a gap down the left before slipping the ball outside to allow Wardle to cross in the left corner unopposed.\nWigan were then down to 12 men after Salford old boy Tyler Dupree's 21st-minute yellow card for a high tackle when they scored their next three tries.\nWalters went clear before giving the scoring pass to Field, another big Nsemba break two minutes later set up Wardle's second try, and, shortly after, Nsemba twisted out of a tackle to get on the scoresheet himself.\nHaving hit the post with his first conversion attempt, Smith landed his next three to earn a 22-0 interval cushion.\nIt was again the same threat down the left which materialised with the first of Wigan's six second-half tries as full-back Field powered across the pitch on an arcing run before putting on the after-burners to slip an inside pass for Marshall to cross.\nThat went unconverted but French dummied his way over to touch down under the posts for Smith to convert this time - and there was more to come.\nAfter Patrick Mago broke the line, Walters combined with Wardle to get on the scoresheet, again unconverted.\nBut Smith had his range again for the final three tries, as Eckersley cantered over, followed by Field's second and centre Wardle's third.\nWigan boss Matt Peet:\n\"We just had to get the job done today and the players did it.\n\"If some of the lads dropped their standards a little bit, I wouldn't be judging them too harshly.\n\"Paul Rowley will be proud of his players. He can only do the job as best he can.\n\"His players are in a tough predicament at the moment and you hope to see them come out the other side.\"\nSalford head coach Paul Rowley:\n\"I've always been looking to the middle of April for the proposed stadium purchase. So logic tells me you might need a few quid to purchase a stadium.\n\"This is purely me, not fact, but my rationale was to fasten my seat belt and hold on, with a couple of bumpy months coming up. That's just my rationale, which I explained to the players the other day.\n\"If that is right, and I'm not saying I'm right, then I guess the lack of communication throughout, outwardly and inwardly, has led to people making their own mind up.\n\"The healthiest way for me is to focus on the players that were playing. They deserve my full attention. I'll give my full energy to them. They were fantastic. We don't like losing obviously and we won't accept mediocrity. But I can't have any complaints on effort.\"", "url": "https://www.bbc.com/sport/rugby-league/articles/c17q4e7gpxzo"}