{"authors": ["Phil Cartwright", "www.facebook.com"], "date_download": "2025-05-21 05:23:26", "date_modify": "2025-05-21 05:23:26", "date_publish": "2025-01-14 15:37:42", "description": "Former Masters champions Mark Allen and Judd Trump win their first-round matches to reach the quarter-finals at Alexandra Palace.", "filename": "sport_snooker_articles_cy9lj1r19x4o_1747805006.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/661b/live/5eeaf6c0-d2c2-11ef-87df-d575b9a434a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_snooker_articles_cy9lj1r19x4o_1747805006.html", "title": "Masters snooker: Judd Trump and Mark Allen win to reach quarter-finals", "title_page": "Masters snooker: Judd Trump and Mark Allen win to reach quarter-finals - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Mark Allen followed world number one Judd Trump into the last eight of the Masters by beating Si Jiahui at Alexandra Palace.\nThe left-hander from Northern Ireland made breaks of 111, 70, 94 and 80 in a 6-2 victory over Chinese debutant Si, setting up a quarter-final against four-time world champion Mark Selby on Thursday.\nEarlier on Tuesday, Trump was an impressive 6-1 winner over fellow Englishman Barry Hawkins, the man he defeated in the UK Championship final in December.\nThe 35-year-old compiled breaks of 59, 60 and 56 to establish a 5-0 lead and wrapped up victory with a 112 after Hawkins briefly responded with a 70 break.\nWorld number four Allen, who won the Riyadh Season Snooker Championship in December, came through the right side of an opening frame against Si which lasted more than 40 minutes.\nThat was despite Si producing a contender for the shot of the tournament by escaping from a difficult snooker.\nWith the cue ball tight behind the blue and only a couple of inches from the baulk cushion, Si was not close to hitting one of the two remaining reds with either of his first two tries - but drew huge cheers from the Alexandra Palace crowd when he did so with his third attempt.\nThe next five frames were all won with breaks of 60 or more, with former World Championship semi-finalist Si making 103 in frame two and Allen immediately replying with 111 on his way to a 4-2 lead.\nThe 2018 Masters champion then navigated his way through a seventh frame in which the reds fell awkwardly, before pouncing on Si's miss of a routine red to secure victory with a break of 80.\nAllen, who began the season top of the world rankings, told BBC Four: \"I didn't make many mistakes at all. That was a good performance and it needs to be like that against Si because he's so dangerous.\n\"You want to play well in any event, but it's sort of a little bit easier here because you know that if you don't play somewhere near your best, you're going to go home.\n\"If you're playing a lower-ranked player sometimes in other tournaments, you're thinking that they might let you off the hook a little bit, but that doesn't happen out there.\"\nTrump was clinical in his win over Hawkins, who scored only 59 points in the first five frames - the 45-year-old's cause not helped by knocking in a red when attempting to disturb the pack while potting the blue in the opening frame.\nIt was a foul that Hawkins repeated in frame four, by which time Trump was in full control of the match.\nTrump, who won the Masters in 2019 and 2023, told BBC Two: \"The first frame kind of turned the whole game. He was a bit unlucky. I didn't see if it was a plant, but a couple of times he knocked a ball in.\n\"You have to be so careful because, I'm not exaggerating, that just turns the match. If he gets in and makes a break, then he settles down and I miss an easy ball in the next frame, it's 2-0 or 3-0 the other way.\n\"The first frame is so important. Whenever I win that first frame I seem to be able to gain momentum. Little things like that can change the game.\"\nFormer world champion John Parrott, working as a BBC pundit, said: \"It was a very dominant display - the display of somebody who thinks he's number one in the world.\n\"The other thing is there was very little petrol used up. It was a nice 6-1 - you can expect to come here and have a 6-4 or 6-5 and go through the mill a little bit, but [there was] none of that at all. That bodes well for the rest of the event.\"", "url": "https://www.bbc.com/sport/snooker/articles/cy9lj1r19x4o"}