{"authors": ["Ben Collins", "www.facebook.com"], "date_download": "2025-05-21 07:07:26", "date_modify": "2025-05-21 07:07:26", "date_publish": "2025-02-08 08:39:55", "description": "Can the Kansas City Chiefs complete an unprecedented three-peat in Super Bowl 59 or will the Philadelphia Eagles gain revenge?", "filename": "sport_american-football_articles_ce85k98gz5po_1747811246.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b535/live/16603840-e5e9-11ef-bd1b-d536627785f2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_american-football_articles_ce85k98gz5po_1747811246.html", "title": "Super Bowl 2025: UK time, half-time show, Taylor Swift & Donald Trump", "title_page": "Super Bowl 2025: UK time, half-time show, Taylor Swift & Donald Trump - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The confetti was still falling after the Kansas City Chiefs defended their NFL title when Patrick Mahomes turned to a team-mate.\n\"We're not done, dog,\" said the Chiefs quarterback. \"I want three, no-one's ever got three. I want back to back to back.\"\nA year later, they are on the brink of doing just that as Mahomes has led the Chiefs back to the NFL's championship game.\nIf they win in New Orleans on Sunday they will become the first team to win three straight Super Bowls.\nTheir date with destiny is against the Philadelphia Eagles, the team they beat to begin their Super Bowl trilogy two years ago.\nAnd some of the world's biggest celebrities are heading to arguably the greatest Super Bowl city - as well as Donald Trump, who will become the first sitting US president to attend America's biggest sport event.\nJust getting this far is already historic. No previous back-to-back champion has made it to the Super Bowl the following season.\nMany neutrals hoped the Buffalo Bills, led by this season's Most Valuable Player Josh Allen, would make it to Super Bowl 59.\nBut the Chiefs beat them 32-29 in the AFC Conference Championship and as they clinched victory, the team's play-by-play announcer Mitch Holthus said the Chiefs had \"gone past Pluto\".\n\"To get to this point, to go further than any team has ever been, it transcends the NFL and becomes part of world sport history,\" he told BBC Sport.\n\"But to win this game, I think it would be an achievement that would never be done again.\"\nThis is Kansas City's fifth Super Bowl in six years and they are going for a fourth win.\nMany neutrals are bored of seeing them win; some have even claimed they receive preferential treatment from officials.\nWhen hosting the NFL's annual awards on Thursday, rapper Snoop Dogg even joked that Sunday's game will be an \"incredible match-up between the Eagles... and the refs\".\nBut Holthus dismissed that as a \"false narrative\" and this week NFL commissioner Roger Goodell said it was \"ridiculous\", while Mahomes is happy to keep being \"a villain\".\nThe traditional pre-game 'rooting map', external suggests that most of America wants Philadelphia to win, but speaking to neutrals in New Orleans, it seems a 50-50 split.\nThe Eagles will play in their third Super Bowl in eight years, claiming their first Super Bowl win in 2018 before losing 38-35 to Kansas City in 2023.\nThis time round, the Chiefs are slight favourites, but many of those backing 'the Birds' want to see Saquon Barkley cap a scintillating season in style.\nPhilly's running back needs just 30 yards to break the all-time record for most rushing yards in a season, including play-offs - 2,476.\nOthers want to see quarterback Jalen Hurts win after being unfortunate to miss out not just on Super Bowl glory two years ago, but also the season MVP and Super Bowl MVP awards.\nSuper Bowl 57 was also known as the 'Kelce Bowl' as it was the first to feature brothers on opposing teams - Jason and Travis Kelce.\nJason retired with Philadelphia in 2024 and is now a high-profile TV host/analyst while Travis remains a key man for Kansas City and is now more famous for being Taylor Swift's boyfriend.\nThe build-up to last year's Super Bowl was dominated by speculation over whether Swift would make it to Las Vegas in time as she was performing in Tokyo the night before. She did, and saw Kansas City beat the San Francisco 49ers in overtime.\nThis time there is little doubt over her presence, while former first lady Jill Biden – a lifelong Philly fan – is also expected to be there.\nSwift watched last year's game with Blake Lively and her boyfriend's brother Jason, who was wearing Kansas City dungarees - but this year he is backing his former team as his wife Kylie is a diehard Eagles fan.\nBradley Cooper and Rob McElhenney have watched games with Eagles owner Jeffrey Lurie, while other Philly fans include Will Smith, Kevin Hart and Tina Fey.\nKansas City fans Sheryl Crow and Paul Rudd were at Super Bowl 58, while Brad Pitt and Jason Sudeikis are also Chiefs fans.\nOther celebrities there last year included Elon Musk, Justin Bieber, Leonardo DiCaprio, Paul McCartney, Beyonce, Jay Z, LeBron James and Shaquille O'Neal.\nAnd David Beckham will feature in one of the Super Bowl commercials, with more than $8m (£6.4m) having been paid for the premium slots.\nThe Superdome has staged the Super Bowl more times than any other stadium, with this its eighth overall although first since 2013.\nIt has a capacity of about 75,000, has undergone a renovation costing $560m (£460m), and is air-conditioned - which will be welcome as the temperature is forecast to pass 25C on Sunday.\nThe city was rocked by the New Year's terror attack, which killed 14 people. Security has since been bolstered - even more so after it was confirmed this week that President Trump will attend - so organisers say the Superdome will be \"the safest place to be\".\nThe gates will open at 13:30 local time – four hours before kick-off – with fans encouraged to arrive early and enjoy the pre-game entertainment, which includes a tailgate concert headlined by Post Malone.\nThe half-time show will be headlined by American rapper Kendrick Lamar, who won five Grammys last Sunday for his hit Not Like Us.\nDrake has filed a defamation lawsuit over the diss track and Lamar did not confirm this week whether it will be censored.\nThere has also been speculation over whether Swift will make a guest appearance as Lamar sang on her 2015 hit Bad Blood, but so far SZA is the only confirmed guest.\nFox is broadcasting this year's Super Bowl, which means Tom Brady will end his first season as a TV analyst with his first Super Bowl broadcast.\nEven if the Chiefs win, Mahomes would still be three short of Brady's record of seven Super Bowl wins, but 'the GOAT' would be commentating on something even he never achieved – a Super Bowl three-peat.", "url": "https://www.bbc.com/sport/american-football/articles/ce85k98gz5po"}