{"authors": ["Oluwashina Okeleji", "www.facebook.com"], "date_download": "2025-05-19 14:41:46", "date_modify": "2025-05-19 14:41:46", "date_publish": "2017-08-05 13:11:13", "description": "Borussia Dortmund youngster Christian Pulisic praises Gabon's Pierre-Emerick Aubameyang for his 'leadership' and hopes he stays at the club 'for a long time.'", "filename": "sport_football_40838208_1747665706.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/C3CA/production/_97222105_gettyimages-817737012.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_40838208_1747665706.html", "title": "Dortmund youngster Pulisic praises Aubameyang's 'leadership'", "title_page": "Dortmund youngster Pulisic praises Aubameyang's 'leadership' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Borussia Dortmund youngster Christian Pulisic says he hopes Gabon international Pierre-Emerick Aubameyang stays at the club \"for a long time\" because his leadership has made him a crucial player at the German outfit.\nAubameyang, who is contracted with the Bundesliga club until 2020, scored 31 goals in the Bundesliga last season as his side won the German Cup and finished third in the league.\nHe had been expected to move but has been told he will continue his career in Dortmund, much to Pulisic's delight.\n\"Aubameyang is a leader, a big player for us and we love having him here and would love to have him here for a long time,\" USA international Pulisic told visiting foreign journalists inside the club's dressing room on Friday.\n\"Off the field he is just a good guy, always ready to have a laugh. But he knows when he needs to be serious. He is just a really good teammate.\"\nAubameyang has scored 120 goals and provided 33 assists in 189 appearances for Dortmund who he joined from French side Saint-Étienne in July 2013.\nDespite media reports linking Aubameyang to a move away, 18-year-old Pulisic refused to be drawn on speculation over the player's future and insists Aubameyang is hugely valued by his fellow players in the Dortmund dressing room.\n\"I only focus on myself but he [Aubameyang] has been great with me.\n\"I have learned a lot from him by just being around him in training and picking up small things. Obviously he is a great player and it is great to have him here.\n\"He creates the music in the dressing room. He is the DJ, but I want to have that job (of providing the music) but for now he stays in charge.\"\nLast season Aubameyang became only the second African player to win the golden boot in Germany after Ghana's Tony Yeboah achieved the feat twice whilst playing for Eintracht Frankfurt - in the 1992-93 season and the following year in the 1993-94 campaign.\nA former France youth international, he switched allegiance to Gabon in 2009 and has represented the Panthers at the 2012, 2015 and 2017 Africa Cup of Nations.\nThe 2015 African Player of the Year has scored 18 goals in 44 appearances for his country.", "url": "https://www.bbc.com/sport/football/40838208"}