{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:24:56", "date_modify": "2025-05-20 12:24:56", "date_publish": "2023-08-04 12:47:15", "description": "Manchester City: Pep Guardiola on Community Shield and Arsenal", "filename": "sport_articles_cpv7lvqwwpno_1747743896.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/fde9/live/c7ac2a50-32c1-11ee-9217-27b202a39e56.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cpv7lvqwwpno_1747743896.html", "title": "Manchester City: Pep Guardiola on Community Shield and Arsenal", "title_page": "Manchester City: Pep Guardiola on Community Shield and Arsenal - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Pep Guardiola doesn't feel his side are in \"the best way\", but insists they will \"try to win\" the Community Shield.\nManchester City face Arsenal on Sunday at Wembley in their final match before the Premier League season gets underway.\nSpeaking in his pre-match news conference, the Spaniard said: \"Normally when you win the titles that we won, they give you the chance to fight for new ones. Of course we are going to try.\n\"Knowing how we are right now, we finished two weeks later than Arsenal and started two weeks later. We are not in the best, best way.\n\"We struggle to start every season but it is a final and hopefully our mentality can help us to be there and compete like we have to against them and try to win the title.\"\nAfter the Gunners fell short in the Premier League title race with Manchester City last season, Guardiola still expects a tough challenge from Arteta's side again this campaign.\n\"Arsenal have been there since Arsene Wenger installed the club in that position,\" he added.\n\"Maybe the style dropped in the last years, but Mikel brought them again to where they have been. There is not one or two teams but a lot of teams who will fight for everything.\n\"The challenge is massive for us. Mentally, how we can grow as a team and football wise, the challenge is there. How starving are we? How is our desire to defend what we won? We will see during a process of 11 months during the lower moments. I think we will have more than ever, so it is how we overcome them.\"", "url": "https://www.bbc.com/sport/articles/cpv7lvqwwpno"}