{"authors": ["Andy Burke", "www.facebook.com"], "date_download": "2025-05-19 15:24:54", "date_modify": "2025-05-19 15:24:54", "date_publish": "2015-02-06 09:38:31", "description": "Five Camille Lopez penalties consign Scotland to defeat in their opening Six Nations match for the ninth consecutive year.", "filename": "sport_rugby-union_31156251_1747668294.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/80861000/jpg/_80861879_peter_horne.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_rugby-union_31156251_1747668294.html", "title": "Six Nations 2015: France 15-8 Scotland", "title_page": "Six Nations 2015: France 15-8 Scotland - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Five penalties from fly-half Camille Lopez consigned Scotland to defeat in their opening Six Nations match for the ninth consecutive year.\nThe Scots pushed France all the way, but the concession of too many penalties proved to be their undoing.\nDougie Fife crossed for the game's only try, finishing off a fine passage of play to put the Scots within a point.\nThe French reclaimed the initiative in the second half, and Lopez's accuracy with the boot saw them home.\nThe Scots arrived at Stade de France in buoyant mood. Reinvigorated since the arrival of Vern Cotter as head coach last summer, they had displayed real signs of progress in the autumn with wins over Argentina and Tonga, and a narrow loss to world champions New Zealand.\nThe French had plenty of motivation to perform too. In the first international since the recent terrorist attacks in Paris, the national anthem was belted out with added gusto, and the home fans had just two minutes to wait before fly-half Lopez kicked their side into a three-point lead.\nScotland captain Greig Laidlaw and Lopez then traded penalties in an opening period of furious intensity and ferocious defending.\nAfter weathering the expected early French storm, the visitors exerted some pressure of their own, with Finn Russell, Alex Dunbar and Stuart Hogg all finding gaps in the home defence, but some stellar defending close to the try-line kept the Scots at bay.\nLopez added a third penalty to stretch France's lead to 9-3, but Scotland hit back with the game's only try right on half-time, and it was a superbly crafted score.\nAnother break from Hogg put the Scots on the front foot deep in opposition territory, and after several attempts at the French line, the ball was spun wide to Mark Bennett who slipped a tackle and found Euan Murray, with the prop displaying the velvet hands of a fly-half to slip Fife in at the corner.\nLaidlaw's missed touchline conversion meant France led 9-8 at the break, and Lopez made it four from four with the boot early in the second half to take the sting out of the Scots' revival.\nFrance stepped up their game after the break, pinning the Scots back in their own half with some powerful running.\nAs they came under more pressure from the French, the visitors began to fall foul of referee Nigel Owens, and the loss of Johnnie Beattie to the sin bin did not help their cause.\nYoann Huget looked for all the world like he was about to put the Scots to the sword as he raced for the line after a failed interception attempt from Tim Visser, but an outstanding last-ditch tackle from Bennett forced Huget to fumble the ball over the line.\nThe game became loose in the closing stages, with the Scots desperately trying to fashion the score they needed, and the French looking to breach the visitors try-line for the first time.\nThe best Les Bleus could manage was a fifth penalty from Lopez, but that was enough to seal the win.\nThe Scots can take encouragement from many aspects of their play, but once again they are left with the bitter aftertaste of Six Nations defeat.", "url": "https://www.bbc.com/sport/rugby-union/31156251"}