{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:58:52", "date_modify": "2025-05-21 06:58:52", "date_publish": "2025-01-04 10:09:26", "description": "Nelson Jardim adamant Newport County are improving", "filename": "sport_football_articles_crmn94nmzk4o_1747810732.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9e97/live/ab3309b0-ca83-11ef-8ae6-9bd26f67e4c7.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_crmn94nmzk4o_1747810732.html", "title": "Nelson Jardim adamant Newport County are improving", "title_page": "Nelson Jardim adamant Newport County are improving - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Nelson Jardim has played down fears of a relegation fight at Newport County – and is adamant his young side are improving.\nJardim was left angry at his side's inability to turn an eye-catching first-half into a much-needed win against AFC Wimbledon in midweek.\nThe defeat – a third in a row – means it is just one league win in 10 for the Exiles, a run that has seen them slide towards spitting distance of League Two's bottom two.\nThey now welcome one of those teams - Morecambe - to Rodney Parade with Jardim fully aware of the need for a result.\nBut, in an impassioned defence of his tenure, the Portuguese head coach says there was always the need for patience in the project he was placed at the helm of.\nJardim succeeded Graham Coughlan in the summer with chairman Huw Jenkins orchestrating an overhaul of the playing squad, signing up a raft of young players of potential.\nConfident that they can rack up the seven wins from the second-half of the season that would ensure survival, Jardim does say improvements are needed.\nBut he added: \"It's quite clear there's a project which you can clearly see is shaping up, and it's not only for this season.\n\"You cannot change 17 players with 18, 19, 21-year-olds and think they can just roll over everyone. You have to be patient and we spoke about that at the beginning.\n\"Everyone can see this, but what you cannot say is that the team haven't improved. If you saw the team back in September, October, even November, and see the team now... if you don't agree with me then something is wrong.\"\nCounty are at the halfway stage of the campaign, one that many accepted would be a testing challenge given the changes.\nFurther blows have come with the loss of some of the few experienced players such as the injured Aaron Wildig and fellow midfielder Bryn Morris, recently allowed to leave for Harrogate for family reasons.\nJardim has stated he wants signings to help in January, but he says he will keep faith with his rookies and his style.\nHe said: \"We have to give them time to develop. We have to accept sometimes they don't play to the level that we want, but when you build a team with young players, we have to stick with them, stick to the plan, stick with what we've been doing.\n\"We have two choices: we can go the easy route blaming everyone, blaming the players; or we just do what we need to do, address things, improve them, and give them that confidence and trust they can go out there and put their talents out there for everyone to watch.\"\nOn facing Morecambe, who followed up a win over fellow strugglers Carlisle with a key victory against Tranmere, Jardim added: \"It's a tough game; they just came off a massive win, and every game they are always there and competing.\n\"We've seen apart from some of the teams at the top, anyone can beat anyone on the day and it will be a tough game for us, but if we improve on the performance we gave in the first half and Wimbledon and we score when we have our opportunities then things will be easier for us.\"", "url": "https://www.bbc.com/sport/football/articles/crmn94nmzk4o"}