{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:33:15", "date_modify": "2025-05-21 05:33:15", "date_publish": "2025-04-02 16:26:53", "description": "Celtic Q&A: Who's next academy star? And who's coming & going this summer?", "filename": "sport_articles_clyq2jd54wyo_1747805595.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9f4f/live/4dcc1b60-1077-11f0-ac9f-c37d6fd89579.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_clyq2jd54wyo_1747805595.html", "title": "Celtic Q&A: Who's next academy star? And who's coming & going this summer?", "title_page": "Celtic Q&A: Who's next academy star? And who's coming & going this summer? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "BBC Sport Scotland reporter Kheredine Idessane has been answering some of your questions on Celtic.\nMichael asked: Where are Celtic's academy stars? Where's the next Aiden McGeady, Shaun Maloney or Callum McGregor? Why are they not making it through?\nKheredine answered: Excellent question, and one which I am sure is being asked not just by Brendan Rodgers but also by his board.\nThe names you mention there are all excellent examples of the type of talent Celtic - indeed all Scottish clubs - must produce as part of a workable business model.\nI was at the Scottish Youth Cup final between Celtic and Rangers in 2023. An-11 goal thriller, you might recall. I remember being impressed by Daniel Cummings up front and Mitchel Frame at full-back.\nThe former is heading to West Ham this summer, it would seem, while the latter's only appearance for the first team came in a Champions League cameo against Feyenoord last season.\nFrame's problem is Celtic have been pretty well off in the left-back position and are about to get arguably stronger with the return of Kieran Tierney.\nBen Doak is the one who got away. Handed a debut under Ange Postecoglou, he preferred the chance to try his luck at Liverpool rather than stay at Celtic.\nIt can be a difficult balancing act. Will young players be patient enough to bide their time in the B team or on the fringes of the first team? Or can the manager find a better way to integrate top talent into the matchday squad?\nOne constant remains, of course - they have to be good enough in the first place.\nMichael asked: Where do Celtic need to strengthen for next season? Who will be the possible departures from Parkhead?\nKheredine answered: Crystal ball time, is it?\nThe easy one is Greg Taylor, who hasn't renewed and is out of contract. He's been a very good player for Celtic, and with Tierney's imminent return it's fair enough that he doesn't fancy being second pick and wants to test himself elsewhere.\nThe problematic one for the club would be Daizen Maeda. Celtic's star man is essential to the way Brendan Rodgers wants his side to play, which gives the Japan forward a pretty strong hand in his ongoing contract negotiations, right?\nImproved terms are on the table, and little wonder. Celtic will be keen as mustard to keep hold of him.\nThe platform of the Champions League, should Celtic qualify, might be enough to tempt Nicola Kuhn and Reo Hatate to hang around. That said, Celtic's business model is such that if good offers come in for them, and the players want to go, the club will take the money.\nThe summer budget should be spent on another striker to complement Maeda and Adam Idah, and also allow Rodgers to go with his preferred option of Maeda and Jota on the wings.\nAnother centre-half is probably required to vie with whoever plays alongside Cameron Carter-Vickers.\nIf Jeffrey Schlupp leaves in the summer, you could also argue Celtic need a couple of full-backs, with Taylor departing. Promote from the youth team with Frame? See above.\nTony asked: Have Rangers or Celtic ever lost three derbies in a season and still won the league?\nKheredine answered: Another excellent question, to which the answer is: No.\nCeltic and Rangers have played each other four times a season in the league since the 1975-76 campaign.\nNever in the near half-century since has either lost three top-flight derbies and won the league.\nLet me stress, of course, Rangers have to beat Celtic at Ibrox next month for your question not to be moot.\nI had a delve back through the stats to find seasons where one of the big two beat the other three times in the league and it's not all that common.\nRodgers has done it three times across his two spells in charge and Steven Gerrard's Rangers did it in the 2020-21 season. The derby dominance led to the title in those years though.\nAs it did for Martin O'Neill in 2003-04, when Celtic won all four league derbies and put Rangers out of the Scottish Cup. Referred to by your fellow fans, Tony, as the 'green and whitewash', if I'm not mistaken?\nWalter Smith's Rangers won all four league derbies to wrap up nine in a row in 1997. Celtic won three of the league derbies in the 1983 and 1984 seasons and didn't win the title in either year.\nBack then, of course, Jim McLean's Dundee United and Alex Ferguson's Aberdeen ruled the roost.", "url": "https://www.bbc.com/sport/articles/clyq2jd54wyo"}