{"authors": ["Jenna Thomson", "www.facebook.com"], "date_download": "2025-05-21 05:42:45", "date_modify": "2025-05-21 05:42:45", "date_publish": "2025-01-14 12:52:03", "description": "Motherwell fan column: 'Will we show up against St Johnstone after slap vs Hibs?'", "filename": "sport_articles_c5y23w52eg4o_1747806165.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/22d0/live/8eeec760-d273-11ef-87df-d575b9a434a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c5y23w52eg4o_1747806165.html", "title": "Motherwell fan column: 'Will we show up against St Johnstone after slap vs Hibs?'", "title_page": "Motherwell fan column: 'Will we show up against St Johnstone after slap vs Hibs?' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "After one of the worst performances of our season so far, I don't have much positivity to spread this week.\nOur injury problems have been a thing all season so that isn't anything new, but with Aston Oxborough hurting his hand and being out and our new first choice goalkeeper's first game seeing us concede three goals, it ain't a good start to boost confidence...\nI have said it before this season that I am waiting for the inevitable downward spiral to hit and if that performance at the weekend was anything to go by, we may be sliding headfirst down the table if it continues.\nPlaying St Johnstone away two weekends in a row is far from ideal, but, that's cup draws for you.\nI don't fancy us to win both, but at this point in the season, I don't know what is the better one to win.\nIf we win the Scottish Cup game to set up another Hampden visit that would be groundbreaking or win the league game since points are what matters most rather than an inevitable final against Celtic where we would lose if we somehow made it that far?\nI don't mean to be cynical, but it wasn't the reaction I was expecting from a team of players that have shown, despite injuries, we can still play well and pull together good performances. The show at Easter Road was a slap to the face.\nHopefully the team make me eat my words and we win both games against St Johnstone and this 'keeper can be the next Ballon D'or contender, but I won't hold my breathe...", "url": "https://www.bbc.com/sport/articles/c5y23w52eg4o"}