{"authors": ["Josh Lobley", "www.facebook.com"], "date_download": "2025-04-26 06:28:53", "date_modify": "2025-04-26 06:28:53", "date_publish": "2025-02-27 11:26:31", "description": "Man Utd news: Have your say on Alejandro Garnacho", "filename": "sport_football_articles_c8j00ejwpg3o_1745648933.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4168/live/86950c80-f4f3-11ef-be5b-6577f7dded4d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c8j00ejwpg3o_1745648933.html", "title": "Man Utd news: Have your say on Alejandro Garnacho", "title_page": "Man Utd news: Have your say on Alejandro Garnacho - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Alejandro Garnacho will be happy that his Manchester United team-mates held their nerve against Ipswich, but it was a night to forget for him individually.\nThe 20 year-old was the one to catch the collateral damage of Patrick Dorgu's red card when he was replaced by Noussair Mazraoui just before half-time. Some in Old Trafford were surprised it was Garnacho who was taken off instead of Rasmus Hojlund.\nInstead of joining his team-mates on the bench, Garnacho followed Dorgu down the tunnel, which has ruffled the feathers of some of the United faithful. An image he posted to his Instagram story after the match of himself heading to the tunnel has only added fuel to the fire in the aftermath.\nGarnacho's behaviour reminded some of a pre-season game in 2022 when Cristiano Ronaldo left Old Trafford early after he was substituted at half-time. Ronaldo's actions were arguably more contentious than Garnacho's, but given that the Argentine has made no secret of idolising Ronaldo in the past - has he been following his hero a little too closely?\nErik ten Hag warned Ronaldo about his behaviour in pre-season, but that didn't stop him from refusing to come on as a substitute in a league game against Tottenham a few months later. This sequence of events was the beginning of the end of his second stint at United, which ended with the termination of his contract in November 2022.\nRuben Amorim told the media after Wednesday's victory that he will speak to his player privately about Wednesday's incident - and it is not the first time he has taken issue with the winger. It was only two months ago that Garnacho was dropped for the Manchester derby, but the exact reasons for that omission are still unclear to this day.\nIf Garnacho steps out of line again, like his hero did three years prior, it could be curtains on his career at Old Trafford.\nWhat do you make of the Garnacho situation, United fans? Do you think it's being over-exaggerated, or was he out of line? Should he face consequences for his behaviour?", "url": "https://www.bbc.co.uk/sport/football/articles/c8j00ejwpg3o"}