{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:41:52", "date_modify": "2025-05-21 07:41:52", "date_publish": "2025-05-20 13:56:01", "description": "BBC Sport Scotland shares the views of Dundee fans after the sacking of manager Tony Docherty.", "filename": "sport_football_articles_clynnz523n6o_1747813312.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d6a5/live/70102e40-3580-11f0-9f00-498a49351714.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_clynnz523n6o_1747813312.html", "title": "Dundee: Fans' views on Tony Docherty's sacking", "title_page": "Dundee: Fans' views on Tony Docherty's sacking - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Dundee sacking Tony Docherty the day after the club secured Scottish Premiership survival came as a surprise to many.\nThe 54-year-old lead them to a top-six finish in his first season, but this campaign was more of a struggle.\nSo what do the supporters think? Unsurprisingly, there are mixed views. Here are the best of them.\nFatBoab: Good riddance. He had a lucky first season and then was found out this season. We need to get someone decent in who has a bit of experience of managing. Not someone else's assistant.\nJohnny: The goals against numbers were alarming. That along with tombola team selection, playing players out of position and poor in-game management would've resulted in another basement battle next season.\nKieran: 145 goals conceded in two seasons and a truck-load of points thrown away from winning positions. The media seem to make this out to be a surprise, but Dundee fans know better. It is no surprise to us.\nWhat I cannot get behind, is the manner in which the club have relieved Tony Docherty of his duties. It comes across as pretty classless - and not for the first time.\nDave: It took courage to replace the manager and staff especially after surviving relegation but I believe it was the correct thing to do. To have waited to see if there would be an improvement could have been disastrous as next year looks to be as tough as this one was. YOU CAN'T LOSE 77 GOALS AND SURVIVE.\nAlso the standard of signings and apparent lack of tactical awareness/ability to get this across to the squad was obvious.\nThe negative comments on this subject from certain members of the media was typical and very predictable.\nI wish Mr Docherty and staff best wishes and thanks.\nJames: 10th in the league with the budget he was given not really good enough. United getting European football didn't help Doc's situation either.\nStewart: I think Dundee are wrong to get rid of Doc. They are a team that has been up and down between the Premiership and Championship for years. To remain in the Premiership is good for Dundee. Yes finishing in top 6 would be good, but unrealistic every season. All clubs need to give their managers time.\nCraig: Why have Dundee done this? Best manager in years. Football is cruel to good managers, the only issue was a defensive side that had no consistency. Tony was a person who could have got it right, all the best for the future Tony you did a good job at Dundee.\nKAS: Absolutely shocking news. The Doc has delivered survival in the Premiership for the Dee working with limited resources and average home gates. The focus seems to be on a new stadium forgetting that the product on the pitch attracts the fans and their cash. Nelms should hang his head in shame.\nSteve: This is a complete shock. The manager got us over the line in a highly competitive league, worked hard and was committed to the club working with finite resources. Sure he made mistakes and had some bad patches but I believe he did enough so we can build enough to put in a good challenge for season 25/26. What do the Dundee Board want? We are not Rangers or Celtic. Are the board now prepared to put in a large amount of money for players including a large salary for a more experienced manager than Tony Doherty?\nA bad decision I'm afraid.\nFred: Dundee were a boring uninspiring team for many years before Docherty. He created a team that often played exciting attractive football. Not always but often enough for him to keep his job. He was not a 'showbiz' manager but he was a true professional who knew what the job entailed and he did it well. Dundee's board should be ashamed of treating him in such a callous manner.\nMurray: Dundee were exciting to watch going forward, but relied too heavily on one or two key defenders, when they suffered long lay-offs through injuries it was clear that the young attacking players had not been schooled in defensive tactics or tracking back to help a threadbare defence. Thank you, Tony, for that great win at Tannadice.\nFormer Dundee defender and fan Cammy Kerr believes Docherty was partially a victim of his own success after a top-six finish in his first campaign.\n\"I know what the fans expect and the Dundee fans can expect too much at times. They probably won't want to admit that, but they do,\" he told BBC Scotland.\n\"After last season, it was always going to be a hard feat to beat that this season and I think on the back of last season you need to remember that Hibs, Aberdeen, they had really poor seasons - not taking anything away from Dundee - so to go and do that again this year was going to be incredibly tough.\n\"I just think in the manner in which the results have come about this season, I think a lot of the performances haven't been what the fans have really thought a Dundee team should be.\"", "url": "https://www.bbc.com/sport/football/articles/clynnz523n6o"}