{"authors": ["Calum Macdonald", "www.facebook.com"], "date_download": "2025-05-21 08:00:33", "date_modify": "2025-05-21 08:00:33", "date_publish": "2025-03-27 16:58:35", "description": "ahksjhg", "filename": "sport_articles_c86p8nw9y61o_1747814433.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/328e/live/1bef4ea0-0b2c-11f0-b1de-e342f84c59e9.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c86p8nw9y61o_1747814433.html", "title": "ahksjhg", "title_page": "ahksjhg - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Lennon Miller will have a learned a huge amount from being in Steve Clarke's squad despite not making his Scotland debut, says Motherwell manager Michael Wimmer.\nFir Park midfielder Miller, 18, was an unused substitute in both legs of the Nations League play-off defeat to Greece.\n\"For Lennon it was the best thing to work with them for 10 days,\" said Wimmer.\n\"I often hear he didn't play, is he disappointed? This experience, to work with this coach, to work with John McGinn and Andy Robertson, Premier League players, if you sit with them, eat together and see them in the dressing room, see the work ethic, you can learn every day.\"\nMiller and his clubmates now turn their attention to Aberdeen on Saturday at a sold-out Pittodrie.\nAnd former Stuttgart assistant Wimmer is hoping to draw on his experience in Austria as the race for the top-six nears a conclusion.\nWith three pre-split games remaining, Motherwell are in seventh spot, a point behind Hearts and three adrift of Dundee United.\n\"I had similar situation when I took over at Austria Vienna, we had four games to go (until the split) and on the last day we had a derby with Rapid Vienna, and we won and were in the top six,\" said the German.\n\"The table is so tight, it will be a decision on gameday 33.\"\nThe game on Saturday will be only the fifth in charge for Wimmer, but he's enjoying Scottish football so far as he looks to make it four matches unbeaten.\n\"The challenge is so honest, each game is so honest. You make a foul, you say sorry and the game goes on. This is great. I love every day,\" he said.\n\"I've never had a team before where you don't have to say please run, work. The players do it, and this is great.\"", "url": "https://www.bbc.com/sport/articles/c86p8nw9y61o"}