{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:13:10", "date_modify": "2025-05-20 14:13:10", "date_publish": "2023-07-26 11:30:15", "description": "Southampton midfielder Will Smallbone says he has \"grown up a lot\" following his loan spell at Stoke.", "filename": "sport_football_66311382_1747750390.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/C096/production/_130520394_gettyimages-1408845836.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66311382_1747750390.html", "title": "Will Smallbone: Saints midfielder says he has grown as a player on loan", "title_page": "Will Smallbone: Saints midfielder says he has grown as a player on loan - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Southampton midfielder Will Smallbone says he has \"grown up a lot\" following his loan spell at Stoke.\nThe 23-year-old spent all of last season with the Potters in the Championship and believes his experience in the second tier will be invaluable to Saints.\n\"I learned that the Championship is a tough long season with a lot of good sides,\" he told BBC Radio Solent.\n\"Durability is important because every game will be different from the last.\"\nSmallbone made more than 40 appearances and scored three goals for Stoke last season and became a key member of Alex Neil's side as they finished 16th in the Championship.\nBefore his arrival in the Potteries, the Republic of Ireland international had only played in a handful of games for Saints and suffered an anterior cruciate ligament injury which sidelined him for six months.\nThe midfielder says with more minutes under his belt he is raring to go as Saints look to bounce back following their relegation from the Premier League last season.\n\"Going out on loan and getting my first season of proper men's football I think I've grown up a lot,\" he said.\n\"I can't thank Stoke enough for taking me in and letting me progress as a player and a person and I've come back to play a big part for Southampton this season.\n\"I think I can bring a lot of experience to a novice team in terms of Championship experience.\"", "url": "https://www.bbc.com/sport/football/66311382"}