{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:39:36", "date_modify": "2025-04-26 07:39:36", "date_publish": "2025-02-27 13:03:05", "description": "New director of football Richard Montague says Swansea City must learn the lessons from recent transfer windows and find \"good players\" for \"slightly lesser wages\".", "filename": "sport_football_articles_cg4kkv07qvro_1745653176.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/afec/live/ace12c00-f50e-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cg4kkv07qvro_1745653176.html", "title": "Richard Montague: Swansea City must learn transfer lessons says new director of football", "title_page": "Richard Montague: Swansea City must learn transfer lessons says new director of football - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "New director of football Richard Montague says Swansea City must learn the lessons from recent transfer windows and find \"good players\" for \"slightly lesser wages\".\nFormer Notts County man Montague, 45, was appointed earlier this month to help oversee recruitment and contracts as part of a major restructure at the Championship club - whose transfer business has been widely criticised in recent years.\nEx-head coach Luke Williams, who worked with Montague at Notts County, claimed that Swansea were \"duped too many times\" when trying to sign players in January.\n\"I think we need to learn the lessons from the window and I know that there were full reviews held here about the window and what we achieved and what we weren't able to achieve,\" said Montague.\n\"I think we will learn those lessons while recognising that every single window is wildly different.\n\"There can be a million reasons why a particular transfer falls through or it doesn't happen. I think that was the case at the back end of the window, but my job has been to come in and try and look at as much of what we have as possible and figure out what's useful and what's not useful, and how we can improve some elements of that process.\n\"I think that's what I've been brought in to do. To try and bring a bit of what we did at Notts County.\"\nDespite the step up in level, Montague believes he can replicate his work at Meadow Lane.\nIt was work that helped Notts County achieve promotion in 2023 from the National League and to a competitive place near the top of League Two this season.\n\"The idea really is to try and bring a lot of the learnings I've had from my experience at Notts into Swansea and see if we can try and achieve some of that over performance here and try to get better at measuring how good we are against everybody else,\" added Montague.\n\"It's not just using the league table, we need to try and get better with our decision-making across everything in the football area to try and over perform.\n\"And that ultimately means making the play-offs and hopefully getting promoted.\"\nMontague's approach using statistics and analytics is a well-trodden path and he is open in his admiration for Premier League success stories like Brentford and Bournemouth who use such methods in their player recruitment.\nThe approach has been likened to 'Moneyball', the Hollywood movie based on the book of the same name, starring Brad Pitt as Billy Bean - a baseball manager who challenged traditional selection methods using statistical analysis at Oakland Athletics.\n\"I finished university and I studied something completely different to football. I did a masters in social policy.\n\"Around that time I read Moneyball, which is the most cliched origin story of all time, but wondered whether there could be paths into that kind of work for me because I had this data background through my masters and obviously the love of the game as well, so wanted to see if there was pathway.\n\"Everyone talks about data, everyone has data. So it's actually how you use that data to make decisions. I think that's what the really smart clubs are actually doing, making better decisions more consistently.\n\"We need to find good players - but lots of people can do that - and we need to find good players who will accept slightly lesser wages. That's the reality of trying to punch up against the parachute payment clubs in this league.\"\nAlso on the agenda for Montague is the contractual status of current players, including defender Harry Darling.\nThe 24-year-old's current deal expires at the end of the season.\n\"I haven't caught up with Harry's agent on that just yet. I need to be fully up to speed with where we are with everything,\" said Montague.\n\"But obviously, it's an attractive proposition to be a free agent at this time. I think you can go into the summer knowing you've had a really good season like Harry has done and have a lot of options and he's going to have a lot of opportunities. So I think all we can do is make our best case to him and I'll make sure that we've done that.\n\"But we also have to recognise that there are points when the other options on offer might be too attractive for our players. So all I can do is make sure that we put our best foot forward and our most competitive offer forward and try to sell ourselves in the best way possible and we will do that.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cg4kkv07qvro"}