{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:52:57", "date_modify": "2025-05-21 05:52:57", "date_publish": "2025-04-02 08:30:20", "description": "Oxford United CEO Tim Williams says there will be no football club without a ground with the Kassam Stadium licence expiring next year.", "filename": "sport_football_articles_c4g7dx9nwz9o_1747806777.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4b42/live/dae59ab0-0f0c-11f0-8926-611e8cb1ab81.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c4g7dx9nwz9o_1747806777.html", "title": "Oxford United: Without a stadium, we don't have a club, says CEO", "title_page": "Oxford United: Without a stadium, we don't have a club, says CEO - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Oxford United chief executive Tim Williams has warned there will be no football club without a stadium to play in.\nThe lease on the Kassam Stadium, where the U's currently play, expires in June 2026 and the club is still awaiting a decision from planners about a proposed new ground at The Triangle site near Kidlington, which is expected this summer.\nBut the club, who are 19th in the Championship, will soon need to inform the English Football League (EFL) as to where they intend to play beyond then, with either a groundshare or license extension at the Kassam being considered until a potential new stadium is built.\n\"There is nothing more important - and I mean literally nothing more important,\" Williams told BBC Radio Oxford's The Dub podcast.\n\"We don't have a stadium to be in if this doesn't work out. I don't particularly like binary decisions. But this really is that binary.\n\"We are in a position where we have to move. This actually isn't now about moving into a stadium that will allow us to generate more revenue. This is about getting into a stadium.\n\"Fundamentally, if we don't have a stadium, we don't have a football club. It's appallingly as binary as that.\"", "url": "https://www.bbc.com/sport/football/articles/c4g7dx9nwz9o"}