{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:17:26", "date_modify": "2025-05-21 06:17:26", "date_publish": "2025-03-31 08:01:21", "description": "Fulham 0-3 Crystal Palace: Palace fans on the FA Cup win", "filename": "sport_football_articles_c15qygkqvqzo_1747808246.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c15qygkqvqzo_1747808246.html", "title": "Fulham 0-3 Crystal Palace: Palace fans on the FA Cup win", "title_page": "Fulham 0-3 Crystal Palace: Palace fans on the FA Cup win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your views on Crystal Palace's 3-0 victory over Fulham in the FA Cup quarter-finals.\nHere are some of your comments:\nRob: A terrific defensive performance meant that even with Fulham's domination of possession in the first 25 minutes, Palace never looked like conceding. Jefferson Lerma's long-distance effort seemed to spark things and from then on we moved up the gears. Eberechi Eze's goal was sensational and his assist for Ismaila Sarr was perfect. Defensively, Chris Richards was a rock at the centre of everything. Great for Eddie Nketiah to make the scoresheet too. A great overall performance. It was a really good overall team performance, well managed by Glasner and superb support as ever from the fans.\nTheo: Great Palace display! It will really help us with the fact that Mateta is back, and Eze can really show his true colours. We've been really solid at the back this season and that trend continued across the Thames.\nKeith: I believe we are only going to get stronger in the rest of the season. We were a bit rusty as it was the first competitive game in over three weeks. Mateta is going to get back to full fitness and the squad is fully fit apart from two long-term absentees. I believe a top-seven position in the league is there for the taking and FA Cup winners.\nJames: We missed Will Hughes for the first half hour but Eze's goal changed everything. In the end, it could have been more. What a strike from Lerma when he hit the bar - and how many headed clearances did Chris Richards make? We fear no-one. Well, maybe Man City, but nobody else!\nAl: What a professional and clinical performance. The three centre-backs were yet again incredible. Our wing-backs are a threat and when you have players like Eze, Sarr and Nketiah, you know there is a threat across the front line. In Glasner we believe - and now dare to dream.", "url": "https://www.bbc.com/sport/football/articles/c15qygkqvqzo"}