{"authors": ["Tom English", "www.facebook.com"], "date_download": "2025-05-21 03:56:21", "date_modify": "2025-05-21 03:56:21", "date_publish": "2025-02-01 16:12:51", "description": "A Huw Jones hat-trick gets Scotland off to a winning start in a nervy Six Nations opener against Italy at Murrayfield.", "filename": "sport_rugby-union_articles_cqjv2vyr09ko_1747799781.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6c3f/live/f7e9bb40-e0b4-11ef-a319-fb4e7360c4ec.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cqjv2vyr09ko_1747799781.html", "title": "Six Nations 2025: Scotland 31-19 Italy", "title_page": "Six Nations 2025: Scotland 31-19 Italy - Huw Jones hat-trick inspires nervy win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A Huw Jones hat-trick got Scotland off to a winning start in a nervy Six Nations opener against Italy at Murrayfield.\nGregor Townsend's team had raced into an early 14-0 lead when Rory Darge and Jones scored in the opening 10 minutes.\nScrum-half Ben White, from a gorgeous offload from hooker Dave Cherry, added a third before the end of a half that ended 19-9.\nItaly stayed in the contest thanks to Tommaso Allan's boot and what looked like being a pretty comfortable day for the Scots suddenly became anxious.\nAllan made it 19-12 early in the second half and, when Juan-Ignacio Brex intercepted Finn Russell for a converted try, it was level.\nScotland sped away from there, inspired by Darcy Graham's remarkable break from deep to set up Jones for his second, before the centre beat three Italians to complete his hat-trick just after the hour.\nDefence saw it out from there for Scotland as Townsend's side earned a bonus-point win and a measure of revenge for their defeat in Rome last year.\nScotland had come roaring out of the blocks early on. They had an intensity about them from the first whistle, a ferocity at the breakdown and a sharpness in a backline playing flat and with menace.\nIt took just two minutes to bring Murrayfield to its feet, Cherry tapping a close-range penalty and the brilliant Darge blasting through Tommaso Menoncello to score. Russell added the conversion.\nIt got even better soon after. Dominating the breakdown with Darge in ruthless mood, Scotland attacked Italy out wide and tore them apart.\nJamie Ritchie pulled his pass out the back to Russell and from there it was as slick as you like. Blair Kinghorn scampered away with Jones alongside. Kinghorn found his centre via the fingertips of Menoncello and the score was inevitable after that.\nRussell again banged over the extras.\nScotland's momentum was checked a little when Allan put over two penalties to narrow the gap to eight, but that was met with an emphatic response.\nThe home front five were relentless in putting Scotland into great areas, none more so than surprise selection Cherry.\nHe sped away from the side of a maul five metres out and slipped a pass out the side door to White, who had the easiest job to dot down in the corner. Cherry's skill was delightful and Scotland led 19-6.\nIt was soon to become 19-9 when Allan's unerring boot lashed over another penalty, and then another early in the second half to make it a just a seven-point game.\nAllan's boot kept Italy in the game and their confidence started to soar as a consequence. The game began to take on shades of Rome a year ago, when Scotland raced into a lead and then got pegged back slowly but surely.\nThat sense only hardened when Russell, in two minds around kicking or passing, threw a weak ball in Jones' direction which was picked off by Brex.\nThe centre ran away to the posts. Allan converted and the game was level. History repeating?\nIt was a scrap now, a disjointed, nervy slugfest, but when you have a little genius like Graham in your ranks then you always have hope. The try that put Scotland back in the lead, and gave them a bonus point, was startling.\nFrom a scrum on the edge of their own 22, they went right, eventually to Graham, who cut back inside, evading two defenders, put on the turbo boost to skip away from another and then found Jones who scampered away.\nBoy, did Scotland need something to happen at that time. They had become stodgy and error-prone until the wee man did his thing and electrified Murrayfield. A try from nothing that settled home nerves.\nRussell made it a 26-19 with the conversion. Graham's brilliance sparked something and Scotland scored again five minutes later.\nThis time, it was Jones at his outstanding best. He had three Italians to get by near the visitors' line and he did them all. A treble for the centre and precious breathing space for the Scots.\nItaly came again, piled on the heat, came close to another comeback but the belligerence in the home defence kept them out amid some hairy moments.\nScotland head coach Gregor Townsend: \"I think a lot of the forwards provided a platform at times, they worked really hard.\n\"We had to defend our line on two or three occasions in that second half so it was a tough opening game but we managed to get the win.\n\"There was a physical challenge today. The most important element today was the mental challenge. To come together as a team on the field to find solutions and find a way to win which will be important in the next games.\"\nScotland player of the match Huw Jones: \"It's not every day you manage to get on the end of three so thanks to the boys for setting me up.\n\"It was a big turning point [Jones' second try], there wasn't really anything on for him but Darcy [Graham] will find a gap when there isn't one. I just had to try and keep up with him.\n\"I don't want to say that our confidence is sky high, we're happy with the win today but our focus is on taking it week by week.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/cqjv2vyr09ko"}