{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:45:28", "date_modify": "2025-05-21 05:45:28", "date_publish": "2025-04-02 00:00:00", "description": "Follow live text & score updates from across Europe as Atletico Madrid face Barcelona & AC Milan take on Inter Milan in semi-final action.", "filename": "sport_football_live_c230841pz1xt_1747806328.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/692b/live/9ec41f30-0ff6-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c230841pz1xt_1747806328.html", "title": "Copa Del Rey & Coppa Italia LIVE: Atletico Madrid v Barcelona & AC Milan v Inter Milan", "title_page": "Copa Del Rey & Coppa Italia LIVE: Atletico Madrid v Barcelona & AC Milan v Inter Milan - live text & score updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Goodbye for now!\nThanks for joining us for coverage of tonight's cup games across Europe.\nHead to our European Football page for reports of selected matches that we've been covering on this live text page.\nUntil next time, goodbye!\nFULL-TIME\nAtletico Madrid 0-1 Barcelona (agg: 4-5)\nIt's all over.\nFerran Torres' first half goal settles a tense semi final second leg, setting up a Clasico final against old foes Real Madrid.\nAtletico's miserable March continues with an awful beginning to April as their last real hope of silverware disappears.\nPost\nAtletico Madrid 0-1 Barcelona (agg: 4-5)\nRodrigo de Paul floats the ball in but Barcelona head it clear.\nIt's flung back into the middle towards Jose Maria Gimenez who is playing as a centre forward now but Ronald Araujo gets it out.\nPost\nAtletico Madrid 0-1 Barcelona (agg: 4-5)\nFree kick to Atletico as Gerard Martin throws Marcos Llorente to the floor on the edge of the box.\nThis might well be it.\nJuan Musso has got the nod to race into the box.\nPost\nAtletico Madrid 0-1 Barcelona (agg: 4-5)\nHit and hope time for Atletico as they work the ball up the left flank.\nJavi Galan aims a cross into the middle but substitute Ronald Araujo gets his head to it first for Barcelona.\nINJURY TIME\nAtletico Madrid 0-1 Barcelona (agg: 4-5)\nPiercing whistles from the home fans as Barcelona pass the ball in their trademark triangles around the Atletico half.\nThe visitors have the final in their sights as the fourth official signals a minimum of four additional minutes to be played.\nPost\nAtletico Madrid 0-1 Barcelona (agg: 4-5)\nWe've got five minutes plus stoppage time to go and Atleti still need a goal here.\nThere was late drama in the first leg with Los Rojiblancos scoring in added time to make it 4-4 on aggregate.\nThe man who got that goal, Alexander Sorloth, is on the pitch, so you never know...\nCLOSE!\nAtletico Madrid 0-1 Barcelona (agg: 4-5)\nJules Kounde surges down the right before looking to drive a low ball through the six yard box towards Robert Lewandowski.\nFormer Blaugrana defender Clement Lenglet slides in at the last to knock it behind though and the corner comes to nothing.\nPost\nAtletico Madrid 0-1 Barcelona (agg: 4-5)\nThe home fans cheer in delight as Antoine Griezmann's cross is nodded out for a corner.\nThat spike in volume then drops moments later as Ronald Araujo gets above Jose Maria Gimenez to head it clear.\nPost\nAtletico Madrid 0-1 Barcelona (agg: 4-5)\nSpurred on by that disallowed goal Atletico continue to flood forward in search of a leveller.\nA reminder that if the tie ends level on aggregate after 90 minutes of normal time we would then head to extra time...And then the dreaded spot kicks.\nDISALLOWED GOAL ATLETICO MADRID\nAtletico Madrid 0-1 Barcelona (agg: 4-5)\nAtletico think they've got a leveller but the flag is up on the far side.\nIt was brilliant play from Alexander Sorloth, who broke past the Barcelona defence and smashed the ball across Wojciech Szczesny into the far corner.\nIt won't count though no matter how much he protests.\nPost\nAtletico Madrid 0-1 Barcelona (agg: 4-5)\nBarrios is back to his feet and back on the pitch after a bit of treatment from the physios.\nOn we go with Atletico still looking for an equaliser.\nPost\nAtletico Madrid 0-1 Barcelona (agg: 4-5)\nPablo Barrios looks to be in quite some pain as he lies stricken on the pitch.\nHe landed a little awkwardly on his shoulder after challenging for the ball a few moments ago.", "url": "https://www.bbc.com/sport/football/live/c230841pz1xt"}