{"authors": ["Nat Hayward", "www.facebook.com"], "date_download": "2025-04-26 07:51:32", "date_modify": "2025-04-26 07:51:32", "date_publish": "2025-02-25 15:07:49", "description": "David Moyes press conference: Brentford vs Everton preview", "filename": "sport_football_articles_cgq900qezk9o_1745653892.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a963/live/8e719b70-d19f-11ef-94cb-5f844ceb9e30.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cgq900qezk9o_1745653892.html", "title": "David Moyes press conference: Brentford vs Everton preview", "title_page": "David Moyes press conference: Brentford vs Everton preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Moyes said Jesper Lindstrom, Tim Iroegbunam and \"a few of the boys\" have been suffering with a fever and flu-like symptoms but they have all recovered.\nNathan Patterson is back in training after recovering from a hamstring injury but Wednesday's game \"will be too quick\" for his return.\nMoyes said Everton \"have spoken\" to PGMOL after the controversial decision to deny them a late penalty in Saturday's 2-2 draw with Manchester United: \"I still feel exactly the same as I did at the time in the game. I watched it again in the changing room and was really surprised he went to VAR. Obviously we've been in touch to check it out and spoke with PGMOL. It's gone, it's past now. We can't do anything about it. It was disappointing we didn't get it but we move on.\"\nHe believes there is \"still work to do\" to ensure survival: \"We used to talk about 40 points. I think because I'm an old one, I'm going to keep talking about 40 points. I think 40 sounds like the total you had to get. We have to make sure we get to 40.\"\nMore on the future: \"All the players will want their futures sorted out and I understand. I've said that until we're completely safe we're not going to look into anyone's contract. Hopefully that will be sooner rather than later. This club has just got its future sorted. I want to be positive and say we're going to be in the Premier League but there's still work to do to do that.\"\nOn whether Everton should aspire to be run like Brentford: \"I'm going to say no to that answer. I think they're a great-run club. I think what they have done over the years is remarkable. But I think Everton have got bigger aspirations than Brentford.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cgq900qezk9o"}