{"authors": ["Joe Rindl", "www.facebook.com"], "date_download": "2025-05-21 07:56:45", "date_modify": "2025-05-21 07:56:45", "date_publish": "2025-01-30 22:33:44", "description": "Manchester United's win over FCSB was full of tactical tweaks which might indicate manager Ruben Amorim's long-term thinking, writes Joe Rindl.", "filename": "sport_football_articles_cvg8qnl4x9lo_1747814205.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/adff/live/da978060-df59-11ef-88f5-9fd60bc5cfdc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cvg8qnl4x9lo_1747814205.html", "title": "FCSB 0-2 Manchester United: Ruben Amorim's tactical changes pay off", "title_page": "FCSB 0-2 Manchester United: Ruben Amorim's tactical changes pay off - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester United's win over FCSB was full of tactical tweaks which might indicate manager Ruben Amorim's long-term thinking.\nAmorim opted to start Kobbie Mainoo in a more advanced position and the midfielder rewarded the Portuguese's call with his first goal of the season, having not hit the net since United's win in last season's FA Cup final.\nBehind him Bruno Fernandes played as a number eight, collecting the ball in deeper pockets and feeding those ahead of him.\nThe Red Devils looked much stronger once half-time substitutes Alejandro Garnacho and Amad Diallo were in the wide positions with the pair replacing left wing-back Tyrell Malacia and defensive midfielder Toby Collyer at the break.\nBoth United's goals came from low crosses into the box.\nUltimately United always looked in control and, in a competition where the winner gets a Champions League spot, are the only side still unbeaten.\nThey will play one of Real Sociedad, Galatasaray, AZ Alkmaar or FC Midtjylland in a last-16 tie in March.\nWill Mainoo be playing as a number 10 on that day?", "url": "https://www.bbc.com/sport/football/articles/cvg8qnl4x9lo"}