{"authors": ["Bruce Pope", "www.facebook.com"], "date_download": "2025-05-19 15:09:16", "date_modify": "2025-05-19 15:09:16", "date_publish": "2015-03-06 12:48:31", "description": "Charlton Athletic come from a goal down to claim their fourth away win of the season at the Cardiff City Stadium.", "filename": "sport_football_31669894_1747667356.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81470000/jpg/_81470530_1watt.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31669894_1747667356.html", "title": "Cardiff City 1-2 Charlton Athletic", "title_page": "Cardiff City 1-2 Charlton Athletic - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Charlton staged a second-half recovery to take the spoils at Cardiff in a hotly-contested Championship contest.\nFederico Macheda gave Cardiff the lead early in the second half, turning in Kenwyne Jones' knock-back.\nBut Addicks substitute Chris Eagles cut back a cross for Tony Watt, who was lurking off his markers to fire home.\nThen Charlton substitute Simon Church went tumbling under Sean Morrison's challenge in the area, with Yoni Buyens tucking the penalty away.\nAlthough this was a contest between Championship mid-table teams - with Charlton in 12th just a point and two places above Cardiff - both sides came into the match in decent form.\nTwo wins in their last three games suggested Russell Slade was beginning to make his mark as Bluebirds boss, having endured some rocky patches since replacing Ole Gunnar Solskjaer in October 2014.\nGuy Luzon has had even less time in the Addicks dugout, but the Israeli has steadily improved their fortunes since arriving in January.\nCharlton came to Cardiff City Stadium with four wins from their last five matches, including the scalps of promotion-chasing Brentford and Nottingham Forest.\nBoth managers made four changes, with Cardiff's hand forced by an injury to goalkeeper David Marshall.\nSimon Moore deputised in goal, Jones was restored to attack, while Noone and Peter Whittingham - making his 300th league start - got the nod in midfield\nChris Solly, Roger Johnson, Johann Berg Gudmundsson returned for Charlton, with Christophe Lepoint making his first start for the Addicks.\nNeither keeper was unduly troubled until first-half injury time, when Joe Ralls - on for injured Cardiff skipper Aron Gunnarsson - was only denied by Stephen Henderson's smart low save at the near post.\nThe Charlton keeper had taken a knock during the first half and did not emerge after the break, with Marko Dmitrovic replacing him.\nThe deadlock was broken early in the second half thanks to the excellent Noone, who was a thorn in Charlton's side all afternoon.\nThe winger cut back inside and dug out a cross to the far post to find Jones, who nodded the ball back for strike partner Macheda to side-foot home.\nCharlton responded by replacing LePoint with Eagles, who wasted no time in getting a shot on target but his strike lacked power and was easily gathered by Moore.\nOnly Bruno Ecuele-Manga's full length block denied Jordan Cousins, before Watt claimed a deserved equaliser.\nEagles went to the by-line before cutting the ball back for Watt on the penalty spot, who had dropped off intelligently and stroked the ball inside the post.\nThen with four minutes remaining Charlton completed the comeback as their Wales striker Church, off the bench, went down in the area under Morrison's tackle.\nReferee Patrick Miller pointed to the spot and Buyens' cheeky dink over Moore sealed the Charlton recovery.\nCardiff manager Russell Slade: \"You could say we have been mugged.\n\"We dominated for long periods and should have put the three points to bed. But we have to learn to manage the game for the whole 90 minutes.\n\"We didn't clear the danger or get tight enough at one cross and the second goal was totally unnecessary.\"\nCharlton head coach Guy Luzon: \"We showed character when we were 1-0 down away from home to get the goal and then to continue playing after the goals.\n\"We didn't play well in the first half and I told the players at half-time that something had to change.\"", "url": "https://www.bbc.com/sport/football/31669894"}