{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:08:28", "date_modify": "2025-05-21 07:08:28", "date_publish": "2025-01-22 15:10:57", "description": "Man Utd news: Harry Maguire says 'we've got to stop looking for excuses'", "filename": "sport_football_articles_cgj28y5eg84o_1747811308.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/36ec/live/fe63f140-d8ce-11ef-86b5-b74cbf3823dc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cgj28y5eg84o_1747811308.html", "title": "Man Utd news: Harry Maguire says 'we've got to stop looking for excuses'", "title_page": "Man Utd news: Harry Maguire says 'we've got to stop looking for excuses' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester United defender Harry Maguire says the players have \"got to stop looking for excuses and blaming things\" after Sunday's home defeat by Brighton.\nMaguire said on Wednesday that \"players have to take responsibility\" for the poor results that led to Ruben Amorim calling them \"maybe the worst\" United side ever.\n\"I go home and think about where we want to get back to,\" he said. \"We're not playing well enough as a team.\n\"We have to stop giving away the first goal. You have to be mentally ready to win a match. At the moment we are not getting the small margins because we are not mentally focused.\"\nThe former captain also insisted his form has not been affected by being stripped of the role for Bruno Fernandes.\n\"I wouldn't put it down to that,\" he added. \"Whether I'm captain or not, I see myself as a leader in this group of players.\n\"There are so many ups and downs. In every game you lose, there's a lot of scrutiny - that's part and parcel of playing for this club.\n\"I look at previous players, and the likes of David Beckham and Wayne Rooney had a lot of scrutiny. If it can happen to them, it can happen to anyone.\"", "url": "https://www.bbc.com/sport/football/articles/cgj28y5eg84o"}