{"authors": ["Neil Johnston", "www.facebook.com"], "date_download": "2025-05-19 15:25:21", "date_modify": "2025-05-19 15:25:21", "date_publish": "2017-08-18 12:43:15", "description": "Sadio Mane earns Liverpool their first Premier League win of the season as Crystal Palace suffer a second straight defeat.", "filename": "sport_football_40908329_1747668321.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0702/production/_97449710_hi041154366-1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_40908329_1747668321.html", "title": "Liverpool 1-0 Crystal Palace", "title_page": "Liverpool 1-0 Crystal Palace - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Sadio Mane earned Liverpool their first Premier League win of the season as Crystal Palace suffered a second straight defeat despite an improved display at Anfield.\nJurgen Klopp's side were heading for a frustrating draw after wasting a string of chances when Mane prodded past Wayne Hennessey for his second league goal of the campaign.\nPalace, beaten 3-0 at home to Huddersfield in their opening match, should have scored when the game was goalless.\nChristian Benteke was unmarked and eight yards out but blazed over the bar from Ruben Loftus-Cheek's pass.\nThis was far from vintage Liverpool who, for once, struggled in front of goal despite peppering the Palace defence with 16 shots - half of them on target.\nJoel Matip headed a great chance wide, while Mane missed a glorious opportunity before he scored - both chances created by debutant Andrew Robertson.\nThe full-back impressed going forward while helping Liverpool produce a much-needed clean sheet after the defensive horror show in the 3-3 draw at Watford last week.\nKlopp made five changes to the team that started the Champions League play-off win at Hoffenheim in midweek and surprisingly left summer signing Mohamed Salah on the bench.\nDaniel Sturridge produced flashes of his best form in Salah's place before the £34m signing came on to help his team - who were much better in the second half - to a hard-fought victory.\nMane's goal punctured the frustration which was building inside Anfield.\nA one-two with substitute Dominic Solanke seemed to have been dealt with by Palace, only for the ball to roll kindly for the Senegal forward to poke past Hennessey.\nBenteke scored both goals in Palace's 2-1 win at Anfield in April and the former Liverpool striker will surely still be wondering how he failed to find the net in this game.\nMatip did a fine marking job on Benteke throughout. However, Benteke was well placed to give Palace a 57th-minute lead after excellent work by Loftus-Cheek but somehow hammered the ball over the bar. It was a huge let-off for Liverpool.\nCrystal Palace manager Frank de Boer:\n\"We were quite concentrated for almost all of the match. I saw a team who wants to fight for each other. It could be a draw, a Liverpool win or the other way - with our two chances it could have been different.\n\"A lot of times they were frustrated because we played very organised.\n\"Today this was the best tactic to get the result, but the coin could have fallen the other way.\"\nLiverpool will now look to finish off the job against Hoffenheim and secure a place in the Champions League group stage. The Reds lead the Bundesliga club 2-1 going into Wednesday's deciding play-off leg at Anfield (19:45 BST).\nPalace are also in midweek cup action. They entertain Ipswich Town in the second round of the EFL Cup on Tuesday (19:30 BST).", "url": "https://www.bbc.com/sport/football/40908329"}