{"authors": ["Emily Salley", "www.facebook.com"], "date_download": "2025-05-20 13:03:51", "date_modify": "2025-05-20 13:03:51", "date_publish": "2023-08-01 10:02:50", "description": "Goals from Pernille Harder and Sanne Troelsgaard help Denmark seal their place in the last 16 of the World Cup as they finish second in Group D.", "filename": "sport_football_66369813_1747746231.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/13FA6/production/_130603818_gettyimages-1584992475.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66369813_1747746231.html", "title": "Haiti 0-2 Denmark: Pernille Harder and Sanne Troelsgaard help Danes secure World Cup last-16 spot", "title_page": "Haiti 0-2 Denmark: Pernille Harder and Sanne Troelsgaard help Danes secure World Cup last-16 spot - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Denmark booked their place in the World Cup last 16 with a 2-0 win over Haiti to finish second in Group D behind England.\nHaiti were undone by a penalty for a third game in a row, with Pernille Harder scoring from the spot after Dayana Pierre-Louis' handball.\nSanne Troelsgaard sealed the Danes' progression to the knockout stages with a second goal deep into injury time.\nDenmark face Group B winners and co-hosts Australia in Sydney on Monday.\nIt will be Denmark's first World Cup knockout match in 28 years, since they lost to Norway in the quarter-finals of the 1995 tournament.\nRanked 13th in the world, the Danes were guaranteed of a place in the round of 16 with a win and a better outcome than China's result against England in the other match in the group.\nHaiti, meanwhile, needed a victory and the Lionesses to beat China if they were to have any chance of reaching the last 16.\nDenmark, who failed to get out of their group at last summer's European Championships, raced out of the blocks in Perth.\nSimone Boye thought she had netted the opener after just five minutes, but after a Video Assistant Referee delay, her effort was eventually chalked off for offside.\nVAR did not come to Haiti's rescue, though, when the ball struck Pierre-Louis' arm in the penalty area and referee Jeong Oh-hyeon pointed to the spot without the aid of the pitch-side monitor.\nHarder, who signed for Bayern Munich earlier this summer, sent goalkeeper Kerly Theus the wrong way in the 21st minute as she scored the 100th goal of this year's tournament.\nThe former Chelsea forward shone throughout for Denmark, finding the back of the net on two more occasions, only for both to be ruled out - the first was flagged for offside while the second was ruled out by VAR after Signe Bruun's late challenge on Theus.\nMelchie Dumornay, who impressed against England and China, once again proved to be Haiti's biggest attacking threat.\nBut their late charge for a first-ever World Cup goal allowed Denmark to counter-attack with venom and Lars Sondergaard's side got their second when Troelsgaard calmly slotted home when through one-on-one with Theus.", "url": "https://www.bbc.com/sport/football/66369813"}