{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:41:15", "date_modify": "2025-05-21 06:41:15", "date_publish": "2025-01-22 18:06:37", "description": "Ipswich news: Fan views on the one thing no-one is discussing", "filename": "sport_football_articles_c74mxpemrzdo_1747809675.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c74mxpemrzdo_1747809675.html", "title": "Ipswich news: Fan views on the one thing no-one is discussing", "title_page": "Ipswich news: Fan views on the one thing no-one is discussing - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for you what one thing - good or bad - that nobody is talking about at Ipswich but should be.\nHere are some of your comments:\nRaymond: We have to give McKenna time to adjust to the heights of the Premier League. It's still a work in progress and, as most of the team were playing in League One two seasons ago, I am sure he can turn things around by the end of the season.\nGavin: It ties in a bit with the fan's unity after the Manchester City game, but despite being in the relegation picture all season, we're one of the few teams that haven't been demanding the firing of our manager. While there are sometimes questions about correct tactics/subs, I think the Ipswich fans have a real love and respect for McKenna and his team, and would rather let him play the season out the way he wants to rather than the club panic and throw in the towel.\nSteve: No-one is talking abut the lack of a decisive selection at the back or in wide midfield at Ipswich. It still feels like Kieran McKenna doesn't know his preferred starters. It's fair to say he does change formation depending on the opposition and whether we are home or away, but other than Leif Davis at left-back, the centre-backs and right-back seem to be constantly shuffled as does the rest of the team ahead of them. Continuity is key at this level and Ipswich just don't appear to have that at all.\nAndrew: Ipswich need to be working on their goal threat. We are not scoring enough currently. We have spent a lot on forward players this season and recently we have looked toothless. To stay up we need to score goals!", "url": "https://www.bbc.com/sport/football/articles/c74mxpemrzdo"}