{"authors": ["Stephan Shemilt", "www.facebook.com"], "date_download": "2025-05-20 13:13:48", "date_modify": "2025-05-20 13:13:48", "date_publish": "2023-08-01 05:27:15", "description": "Few England cricketers connect with a crowd like Stuart Broad. On the final day of the last Ashes Test he showed why we will miss him so much.", "filename": "sport_cricket_66367525_1747746828.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/32C7/production/_130599921_broad.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66367525_1747746828.html", "title": "The Ashes 2023: 'Stuart Broad gives us the feels one last time'", "title_page": "The Ashes 2023: 'Stuart Broad gives us the feels one last time' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We love sport because of how it makes us feel.\nWithout the feelings, sport is just something that is happening. Someone trying to run fast, some players kicking a ball into a net, someone hitting a ball with a bat.\nWe can make a connection with stars we have never met, or are never likely to meet, because of how they make us feel. Andy Murray crying on Centre Court, Chloe Kelly twirling her shirt around her head, Jessica Ennis-Hill's sprint down the home straight on Super Saturday.\nWhich brings us to Stuart Broad.\nThere might have been better cricketers to play for England. Some have won more World Cups or Ashes series. One man has more wickets.\nFew gave us the feels like Broad.\nOn Saturday evening Broad had just announced that the fifth Ashes Test would be his last match as a professional cricketer. Speaking to the press, he said: \"I've given my heart and soul. I can't think there'll be too many cricket fans out there who would think I've slacked off for a moment.\"\nFor Broad, there were two days left to deliver the feelings. The joy and the nerves, the relief and the tension, the silliness and the sadness.\nHe got them all in. Hollywood is on strike so he had to write his own script. The Greatest Showman. Hugh Jackman had even been there watching.\nThe Oval is a place for goodbyes. Andrew Flintoff's run-out of Ricky Ponting. Courtney Walsh and Curtly Ambrose arm in arm. Donald Bradman's duck.\nThe night before his final day as a cricketer, Broad went for a drink with his old mate Alastair Cook, a man who nailed an Oval farewell like no-one else before him with a century in his final Test innings.\nIn the aftermath of his retirement, Cook had recurring dreams about making a comeback, to the point he even contacted some of his former team-mates. Only when he got back in the nets did he decide it was a bad idea.\nOn this occasion, Cook looked Broad in the eye and told him he had made the right decision to call time. What Cook couldn't have known was that Broad was about to conjure a finale to rival his own.\nBy this point, Broad had already been given a guard of honour by the Australians and swiped what turned out to be his final ball as a Test batter for six.\nHowever, that was about as good as it got for England on day four of the fifth Test. As Monday dawned, Australia had given themselves a decent chance of completing a chase of 384, winning the Ashes 3-1 and ruining Broad's farewell. David Warner, of all people, was still batting.\nBut if you want a party, Chris Woakes would be the perfect man to organise it. Ever-dependable, he would be the admin on the WhatsApp group, make the buffet and put you in a taxi home after having one drink too many. On this day, it was Woakes' mission to send Broad off in style.\nJagging the ball around, bending it to his will, Woakes took the vital wickets of Warner, Usman Khawaja and Steve Smith in his 4-50. Broad was living every minute to the fullest, applauding the crowd each time he went near to the boundary and celebrating the wickets with maniacal gusto.\nAt the other end, another fitting farewell was playing out.\nMoeen Ali had not explicitly told anyone that this would be his final Test - that's not his style - but we all knew.\nThe moment Moeen answered Ben Stokes' SOS to come out of retirement and replace the injured Jack Leach, he set himself on the path to a heroic performance.\nIf the return itself was not extraordinary enough, then what came after defied belief. A missed day of training to collect an OBE, a gash in his spinning finger like something from a horror film, a magical cure sent through the post by a fan.\nIt is sheer luck for England that Moeen ended the series as their number three and frontline spinner. No other cricketer in the country could have fulfilled the role and his beguiling spell on Monday, ending with 3-76 against an Australia team that have always been his tormentors, was just reward for one of the all-time great comebacks.\nIt was the work of Woakes and Moeen that set the stage for Broad. Two wickets to win and Broad with ball in hand. Captain Stokes can say it was because Broad was suited to bowling to the left-handers at the crease, but he would have known the theatre of the moment.\nBut all great fairytales have a bad guy and this was no different. Alex Carey had secured his place as persona non grata with his stumping of Jonny Bairstow at Lord's.\nHis sidekick was Todd Murphy, a man who wouldn't have been playing had it not been for an injury to Nathan Lyon. The villain and the replacement chipped away, a ninth-wicket partnership to evoke memories of Australia's win in the first Test at Edgbaston.\nBroad knew the feeling and knew what to do. Change the bails, change the luck, change the game. Murphy was powerless to stop it. Broad was off and running, The crowd released enough energy to restart Battersea Power Station.\nZak Crawley dropped the chance at the finale, but Broad was not to be denied. At Lord's, after he walked out to bat following the fall of Bairstow's wicket, Broad told Carey the stumping was what he would be remembered for.\nHe was wrong. Carey will instead be remembered as the man who Broad dismissed with his final ball in Test cricket. Bairstow completed the circle by taking the catch. At the instant the ball hit the gloves, Broad was a former cricketer, but he was running too fast in celebration to notice.\nBroad left the field with his arm draped around the shoulders of Moeen, two magnificent servants to English cricket exiting the Test stage for the final time.\nAs the teams shook hands, Broad embraced Warner, symbolically ending an era in Ashes cricket. These two sets of players having been doing battle for most of the past 10 years, but plenty won't make the next Ashes in 2025-26 and more still won't be around for the next series in this country in four years.\nBroad took off his bowling boots then returned to the middle to be interviewed by his long-time new-ball partner James Anderson.\nAt 41, Anderson has seen plenty who came after him leave before him, but this one must really cause pause for thought. It was telling that Anderson bowled only four overs on the final day at The Oval and he must be wondering if he will have the opportunity to go out on his own terms.\nThis day, though, belonged to Broad. The man who watched videos of his dad winning the Ashes and continued the family business, playing in 25 consecutive home Ashes Tests and ending with more wickets against Australia than any other Englishman.\nSo farewell, Broady.\nWe'll miss the headband, we'll miss the celebrappeals. We'll miss you revving up the crowd and we'll miss your reviews. We'll miss the Nighthawk and we'll miss you switching the bails.\nMost of all, we'll miss the feelings.", "url": "https://www.bbc.com/sport/cricket/66367525"}