{"authors": ["Alex Bysouth", "www.facebook.com"], "date_download": "2025-05-21 07:05:04", "date_modify": "2025-05-21 07:05:04", "date_publish": "2025-02-08 06:58:09", "description": "\"He's a real fighter\" - how Giuliano Simeone has become integral to his father's plans at Atletico Madrid.", "filename": "sport_football_articles_cy082r50wpyo_1747811104.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/051e/live/05862310-e49d-11ef-a319-fb4e7360c4ec.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy082r50wpyo_1747811104.html", "title": "Giuliano Simeone: How El Cholo's son emerged as key to Atletico Madrid", "title_page": "Giuliano Simeone: How El Cholo's son emerged as key to Atletico Madrid - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "As a child, over coffee and croissants in their native Argentina, Giuliano Simeone chatted with his father, Diego, about the merits of taking the Atletico Madrid job.\nAlmost 14 years later, and now the most decorated coach in Los Rojiblancos' history, there is no sense the boss is merely repaying the youngest of his three sons by giving him a chance at the Metropolitano.\nHaving swapped Buenos Aires for Madrid as a 16-year-old, leaving River Plate to join Atletico's youth ranks, the 22-year-old has had to bide his time for a chance in his father's side. Few can argue he has not earned it.\nIndeed, his older sibling Giovanni - when scoring regularly in Serie A - was told by 'El Cholo' that he would not sign him, external because \"it's hard to have a son in the dressing room\".\nGiuliano, meanwhile, scored 25 goals in 36 games for Atletico's B team in the Spanish fifth tier in 2021-22, earning his sole first-team appearance that year as a 91st-minute substitute in a goalless draw with Granada.\nHis development continued with loan spells at second-division Real Zaragoza and then Alaves in La Liga during the following campaigns.\nBut now, heading into a derby against Real Madrid at the Bernabeu on Saturday, where a win would send Atletico top of La Liga, the youngest brother suddenly finds himself a key protagonist in his father's plans.\nThe winger has four goal involvements in his past three games. After scoring and assisting in a Champions League win over Red Bull Salzburg, he set up another in a La Liga victory against Mallorca and wrapped up a dream week by putting two goals past Getafe in a 5-0 Copa del Rey quarter-final win on Tuesday.\n\"I'm very happy, it's been crazy,\" he told Teledeporte afterwards. \"I think about the things I have to improve day by day. I still have many flaws and details that I want to improve to keep growing.\"\nSimeone has seen his minutes managed. He only made four La Liga starts before December and has only completed 90 minutes four times in all competitions this term. But he has recently become integral, starting Atletico's past eight league games and their final five European group phase matches.\nIn November, he also earned his first cap for Argentina.\n\"He has worked hard, made a lot of sacrifices and assists,\" former Atletico Madrid striker Diego Forlan tells BBC Sport. \"He is playing well and he has shown us that he is a quality and professional player.\n\"He is very versatile, he is adaptable. He is in a really good time, he looks comfortable on the pitch. It is a great moment for him.\"\nWhile more of an attacking player than the tenacious central midfielder his father was, they share some similar traits.\nSimeone has shown that versatility by being deployed at centre forward early in the season but also wing-back during a 2-1 win against Bayer Leverkusen in January. As the touch map below shows, he is willing to cover the ground his father's system demands in his most common role as a right winger.\n\"We can see similar characteristics,\" explains Forlan. \"He's a real fighter. He knows his father is the coach, so he has to train more than normal, because everyone is always looking at him, probably more than other players.\n\"That will really encourage him, but also it means he really has to work match after match because people look at him all the time.\"\nGiuliano was born in Rome while his father was playing for Lazio, but returned to Argentina when still young.\nWhen he was eight years old, spending time with his dad in the coastal resort of Mar del Plata, Simeone senior took that call from Atletico Madrid.\nHe explained to The Coaches' Voice, external: \"I told him: 'Look, the chance has come to go to Atletico Madrid and I don't know what to do.' And he says to me: \"Are you going to manage Falcao? Falcao was there then. 'Are you going to play against Messi? Against Ronaldo?'.\n\"The kid was saying all this to me and I would say 'yes'. And, in between dipping the croissant in the milk, he said to me: 'Dad, but if you do well, you won't come back.' On the one hand that's lucky. But, on the other, it's unlucky, because I don't get to see my kids growing up.\"\nNow, however, Simeone has been joined by all three of his sons in Europe. Giuliano and Gianluca, who plays for fourth-tier Rayo Majadahonda, are in Madrid, while Giovanni, the eldest, plays for Napoli.\nForlan, whose father Pablo was also a Uruguay international, says it is natural they wanted to follow in his footsteps.\n\"It's part of your DNA, in your blood,\" he explains. \"You have been brought up focusing on football. You have seen your father play, seen your father travel.\n\"Simeone, as a father, has the opportunity to manage his son and no one is saying 'oh no, his son is playing there because his father is a coach'.\n\"No. He is having great performances and that will be of great satisfaction for himself and for his father.\"\nContinue his recent form in his first Madrid derby on Saturday, and the red-and-white half of the Spanish capital will all share in that satisfaction, too.", "url": "https://www.bbc.com/sport/football/articles/cy082r50wpyo"}