{"authors": ["Mantej Mann", "www.facebook.com"], "date_download": "2025-05-20 12:59:55", "date_modify": "2025-05-20 12:59:55", "date_publish": "2023-07-25 16:59:01", "description": "Jack van Poortvliet speaks to BBC Sport as he stands on the cusp of emulating his hero Ben Youngs, as an England scrum-half born in Norfolk and developed at Leicester, by playing at the World Cup.", "filename": "sport_rugby-union_66305450_1747745995.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4237/production/_130515961_gettyimages-1439640801.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-union_66305450_1747745995.html", "title": "Jack van Poortvliet: England scrum-half poised to emulate hero Ben Youngs", "title_page": "Jack van Poortvliet: England scrum-half poised to emulate hero Ben Youngs - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "As Jack van Poortvliet prepares to be interviewed in the Surrey sunshine, he carries himself with a poise and maturity which belies his years.\nThe 21-year-old stands on the cusp of emulating his hero Ben Youngs, as an England scrum-half born in Norfolk and developed at Leicester, by playing at a World Cup.\nA firm handshake is followed by a warm smile as he recalls not being allowed to watch England as a six-year-old, the last time they played at the World Cup in France, because the games were aired after his bedtime.\nAlmost 16 years later, he is readying himself at England's Pennyhill Park base as part of head coach Steve Borthwick's 40-man pre-tournament training squad.\nThe Tigers' academy graduate's long-standing dream of reaching the \"pinnacle of English rugby\" is close to becoming a reality.\n\"I would be kidding if I said I hadn't dreamed of playing in a World Cup,\" he told BBC Sport.\n\"I was two when we [England] won in 2003 so I can't remember that at all but I have watched back the whole experience on YouTube.\n\"Watching live, the biggest memories I have was in '07 when I was only six. My parents wouldn't let me watch the games because in France they were late kick-offs.\n\"I'd wake up in the morning and ask what happened and I remember being told the score when they had lost the final.\n\"But growing up, Ben Youngs was a massive inspiration for me, being a Norfolk lad and playing in the same position.\n\"When he was at his first World Cup in 2011 and he scored the winning try against Argentina it was massive and something I dreamed of doing.\n\"It would mean so much to me and my family - the sacrifices they have made and the hard work I have put in. It is the pinnacle of English rugby.\"\nBorthwick is set to name his final World Cup squad on 7 August.\nVeteran Youngs, 33, has 12 years of experience and 110 caps on Van Poortvliet, but the team-mates for both club and country share the same vision.\n\"It's surreal,\" added Van Poortvliet.\n\"I remember last year, when I got named to go to Australia and we sat down just after winning the Premiership with Leicester, we wanted to be two scrum-halves from the same club, the same county, living a few miles apart, to go to the World Cup together.\n\"It's something we have spoken about and wanting to push each other to get there.\"\nVan Poortvliet may have been moulded in the East Midlands, under Youngs' gaze, but this is a player also keen to make his own mark in the game.\n\"I try and break out from the Leicester clique,\" he joked.\n\"We are a very tight group at Tigers, especially with the young lads like Guy [Porter], George [Martin] and Freddie [Steward] that I have been around during my whole academy experience, but I really get along with Jamie [Blamire] and Bevan Rodd and we have a good time.\"\nThe Tigers' number nine says wagered card games have been supplementing intense training sessions to enhance the togetherness in the group.\n\"Steve [Borthwick] is massive on being [at the top of our game] when we are in training, but then also enjoying our downtime,\" added Van Poortvliet. \"I love being around the social [side], playing darts, pool and a lot of cards.\"\nEngland begin their World Cup campaign against Argentina on 9 September in Marseille, following a series of four warm-up games.\nBorthwick's men travel to Cardiff to face Wales on 5 August, and Van Poortvliet says the rivalry between the countries will not wane given the friendly status of the game.\n\"We want to win these games in pre-season,\" he said.\n\"When you have the opportunity to play against Wales with that rivalry, it is nothing but exciting to be able to experience the Millennium Stadium.\"", "url": "https://www.bbc.com/sport/rugby-union/66305450"}