{"authors": ["Bobbie Jackson", "www.facebook.com"], "date_download": "2025-05-21 03:39:35", "date_modify": "2025-05-21 03:39:35", "date_publish": "2025-02-08 23:59:17", "description": "Heavyweight Derek Chisora proves too much for Otto Wallin, picking up a unanimous points victory in his final fight in the UK.", "filename": "sport_boxing_articles_cdxed02ggw2o_1747798775.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e76b/live/4c5af1e0-e677-11ef-b7cf-dfdfcf878bb2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_boxing_articles_cdxed02ggw2o_1747798775.html", "title": "Chisora v Wallin: Bloodied Derek Chisora beats Otto Wallin in UK finale", "title_page": "Chisora v Wallin: Bloodied Derek Chisora beats Otto Wallin in UK finale - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Heavyweight Derek Chisora proved too much for Otto Wallin as he picked up a unanimous decision victory in his final fight in the UK.\nChisora was on top from the first bell and twice knocked Wallin down at a packed Co-op Live Arena in Manchester.\nThe judges scored it 117-109, 114-112 and 116-110 in favour of Chisora, who took his overall record to 36 wins in 49 fights.\n\"I thought he was going to gas out but he didn't and I was wrong,\" Chisora said. \"It was a firefight.\"\nThe bout had been elevated to an IBF world title eliminator earlier in the week, with Chisora now in line to face either champion Daniel Dubois or Joseph Parker, who meet on 22 February.\nFormer four-weight world champion Roberto Duran, WBA featherweight champion Nick Ball, who faces TJ Doheny on 15 March, Joe Joyce and Dillian Whyte were among those in attendance for Chisora's UK send-off.\nThe 41-year-old was joined in the ring by UK rappers Skepta, Tinie Tempah and Chipmunk after his victory was announced as he asked fans to vote on who his opponent should be for his 50th fight.\nChisora intends to retire after that fight, which he wants to take place overseas.\n\"Legacy isn't made by me - it is made by the fans,\" Chisora added.\nChisora spoke in the build-up to his UK send-off about it being an emotional week and those feelings got the better of him when he entered the venue earlier in the night, with the TNT broadcast showing him in tears.\nBy the time he made his walk to the ring wearing a cowboy hat, Chisora had steadied himself mentally and he was warmly welcomed into the arena as fans sang along to Hotel California.\n'Del Boy' set the tempo from the outset, fighting on the front foot and not allowing Wallin space to get behind his jab.\nShort bursts to body and head were enough to carry Chisora through the early stages and a looping right had Wallin backtracking in round three.\nChisora was cut above his right eye in round five but passed a check with the doctor in the sixth as he continued to enjoy the better of the close exchanges.\nA looping right sent Wallin tumbling across the ring and down in the ninth but he was back ready to go by the count of eight.\nUpon hearing the 10-second clapper in the final round, Chisora threw everything at Wallin and put down his rival, who was saved by the bell.\nChisora has faced some of the biggest names in the sport during his 18-year career, meeting Tyson Fury on three occasions, Whyte and Parker twice, and has also come up short against Vitali Klitschko and Oleksandr Usyk.\nIt is Chisora's third win in succession after victories over Gerald Washington and Joe Joyce.\nChisora is the third man to beat Wallin following losses against Fury and Anthony Joshua.\nJust seven of Chisora's 49 professional bouts have taken place outside of the UK and this was his fourth contest in Manchester.\nHis three previous fights in Manchester - two against Parker and one with Whyte - ended in defeat.", "url": "https://www.bbc.com/sport/boxing/articles/cdxed02ggw2o"}