{"authors": ["Mantej Mann", "www.facebook.com"], "date_download": "2025-05-21 03:40:56", "date_modify": "2025-05-21 03:40:56", "date_publish": "2025-04-06 22:32:47", "description": "Northampton Saints are the only English side left in the Champions Cup after Harlequins, Saracens, Leicester Tigers and Sale Sharks all go out in the last 16.", "filename": "sport_rugby-union_articles_cr5d3z0mz7ro_1747798856.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6946/live/bcdf4fa0-1323-11f0-9bc6-7b8c8db92747.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cr5d3z0mz7ro_1747798856.html", "title": "Investec Champions Cup: Northampton Saints flying English flag in quarter-finals", "title_page": "Investec Champions Cup: Northampton Saints flying English flag in quarter-finals - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Northampton Saints are the only English side left in this season's Investec Champions Cup after a disappointing weekend for the other Premiership quartet in the last 16.\nEight English sides began their Champions Cup campaigns last December, but after Bath, Bristol Bears and Exeter Chiefs went out in the pool stages, Harlequins, Saracens, Leicester Tigers and Sale Sharks all exited the competition in the first knockout round.\nSaints, seeking to become the Premiership's first Champions Cup winners since Exeter in 2020, are joined in the quarter-finals by four French teams, two from Ireland and Glasgow Warriors as Scotland's sole representation.\nSaints' victory was as good as it got for the English sides, who collectively conceded 34 tries across their five matches.\nSaracens rested England players Maro Itoje, Elliot Daly, Jamie George, Ben Earl and Tom Willis but raced into an early lead in France before being overpowered 72-42 by 10-try Toulon.\nHarlequins picked their internationals, including England's Marcus Smith, but failed to land a shot as they were thrashed 62-0 by 10-try Leinster at Croke Park.\nLeicester Tigers were comfortably beaten 43-19 at Glasgow in the final game on Saturday.\nSaracens left out their Test stars, in compliance with England's player welfare guidelines, after prioritising their pursuit of a Premiership play-off place over a fourth Champions Cup title.\nDirector of rugby Mark McCall chose to select his England regulars for their Premiership matches against Harlequins and Leicester, forcing his hand in Toulon.\nTigers head coach Michael Cheika said \"different teams are affected by different things\", citing injuries for his side after captain Julian Montoya, Wales back row Tommy Reffell and England lock Ollie Chessum all missed the trip to Scotstoun.\n\"People are always looking for trends but in reality you have to take each individual game as it is,\" Cheika told BBC Radio Leicester.\n\"Saracens were affected by the laws of having to rest players. We had to rest one and have injuries off the back of the Six Nations, but it comes down to game day.\n\"There were a couple of things that weren't good enough and we weren't good enough to win.\"\nIt did not get much easier for Sale Sharks on Sunday as they travelled to defending champions Toulouse, who trailed at half-time before closing out a 38-15 win in the south of France.\nThe Premiership salary cap has long been touted as a reason why English clubs may struggle in Europe.\nThe cap was increased from £5m to £6.4m at the start of this season but it is still considerably less than the £9m cap for Top 14 clubs in France.\nMany England internationals, including former Test captain Owen Farrell and wing Jack Nowell have moved to France on more lucrative deals.\nThere could be an argument that a lower salary cap means less squad depth, but for now the carrot of having to play in the Premiership to be available for England selection as well as an \"enhanced contract\" with the Rugby Football Union ensures most of the best players remain in the Premiership.\nHowever, the quality of opposition must also be a consideration, as well as home advantage.\nSaracens were beaten at three-time winners Toulon, who are third behind Toulouse and Bordeaux in the Top 14 and boast former England internationals David Ribbans, Kyle Sinckler and Lewis Ludlam in their squad.\nQuins were no match for Leinster, who have won four titles and featured in the past three finals and are packed full of Ireland internationals. They also had New Zealand centre Jordie Barrett and Ireland prop Tadhg Furlong on the bench.\nMeanwhile, Leicester's conquerors Glasgow are last season's United Rugby Championship winners and boast several Scotland internationals in their squad, while defending champions Toulouse maintained their bid for a record seventh star on the jersey, despite the unavailability of injured talisman Antoine Dupont.\nNorthampton Saints have endured a dismal defence of their Premiership title but their form in Europe has been a complete contrast.\nThe English champions won three of their four matches to finish top of Pool 3 and secure a home tie with Clermont Auvergne in the last 16.\nSaints kicked off the knockout stage on Friday at a packed Franklin's Gardens and recovered from a slow start to cruise past their French visitors.\nTommy Freeman scored a hat-trick and Juarno Augustus crossed twice as the hosts won 46-24 to secure a quarter-final home tie with Castres.\nWhile some lament the salary cap and its restrictions on signing top overseas talent, it could also be seen as a chance to develop homegrown talent such as Henry Pollock.\nThe young back row has burst on to the scene for club and country and his name got the loudest cheer when announced before kick-off, but would he have got the chance if Saints had fewer financial restrictions?\nAs it is, Northampton are in the last eight - and another victory over Top 14 opposition could set up a semi-final with Leinster in a rematch from the same stage last year.\nSaints have not been past the semis since 2011, while it is 25 years since they beat Munster to win the Champions Cup for the only time to date. They now carry the Premiership's hopes as they seek to march on once more.", "url": "https://www.bbc.com/sport/rugby-union/articles/cr5d3z0mz7ro"}