{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:31:35", "date_modify": "2025-04-26 07:31:35", "date_publish": "2025-02-27 17:10:10", "description": "With five games remaining before the split, can any team make a late charge to disrupt the current top six?", "filename": "sport_football_articles_cr722421xzdo_1745652695.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4119/live/bf495df0-f52b-11ef-8c03-7dfdbeeb2526.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cr722421xzdo_1745652695.html", "title": "Only one top-six place up for grabs in Scottish Premiership?", "title_page": "Only one top-six place up for grabs in Scottish Premiership? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "\"It's the team who finds a bit of consistency that might just nick that last spot for top six.\"\nDerek McInnes believes his Kilmarnock side are capable of doing just that, but is he correct to think there is only one remaining place up for grabs in the top half of the Scottish Premiership table?\nWith five matches remaining before the league split, 10th-placed Kilmarnock are nine points behind Dundee United in fifth.\nHibernian are on the same 40-point mark as United, while Aberdeen sit on 41, which just happens to be the joint-lowest tally for third place at this stage of the season since the turn of the century.\nWhile the arithmetic is possible, how likely is a slump from one or more of those clubs in tandem with a sudden surge from those in the bottom half?\nAberdeen have already endured one dramatic downturn in form, picking up a mere four points from a possible 42 between 23 November and 1 February.\nThe bleeding stopped with back-to-back wins over Dundee and Kilmarnock before Tuesday's thumping away to runaway leaders Celtic.\nUnited, who travel to Pittodrie on Sunday, have had a dip too, losing six of their past eight league outings.\nHibs, on the other hand, are undefeated in 12 Premiership games and have just beaten Celtic and United. On 7 December, they were rock bottom, so those with ground to make up can look to Easter Road for inspiration.\nNext up for Hibs is a home derby with Hearts, which brings us to the team currently occupying sixth place.\nLike their Edinburgh rivals, the Tynecastle side have recovered from an abysmal start to the season and have lost just one league match in 2025.\nOn Wednesday, Hearts came from behind to beat St Mirren, which moved them into the top half for the first time since the opening weekend.\nThey too have momentum, but something will have to give in the derby, as is the case at Pittodrie.", "url": "https://www.bbc.co.uk/sport/football/articles/cr722421xzdo"}