{"authors": ["Chris Jones", "www.facebook.com"], "date_download": "2025-05-19 14:57:29", "date_modify": "2025-05-19 14:57:29", "date_publish": "2017-07-04 12:55:05", "description": "BBC Sport looks at the reaction of New Zealanders after Saturday's second Test defeat to the Lions - their first on home soil for seven years.", "filename": "sport_rugby-union_40494689_1747666649.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/752F/production/_96799992_all_blacks_getty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_rugby-union_40494689_1747666649.html", "title": "British and Irish Lions facing a 'Black-lash' as New Zealanders plot revenge", "title_page": "British and Irish Lions facing a 'Black-lash' as New Zealanders plot revenge - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The All Blacks don't lose very often, especially in New Zealand.\nSaturday's defeat was their first loss at home in seven years - and their first to the British and Irish Lions in 24.\nAnd while they were beaten by Ireland as recently as November, that was in the relative anonymity of the American city of Chicago, not in their own backyard.\nThe Kiwi public is loyal, but expectant. The All Blacks are meant to win, even with 14 men. So how have they reacted to defeat?\nMinutes after the final whistle at the Westpac Stadium, as the Lions fans flocked deliriously into the Wellington evening, callers to Radio Sport NZ were jamming the airwaves.\n\"I hope you aren't going to make excuses - the Lions were too good,\" cried Owen, the first to have his say.\n\"I wonder if this would have been the Lions' night, even if Sonny Bill Williams had stayed on the field,\" reflected presenter Matthew Buck, who revelled in the sheer vibrancy of the occasion, as opposed to stewing in defeat.\n\"They were desperate,\" agreed expert summariser Ross Bond, who praised the Lions' inspired defence and smothering back row.\nThe next morning, the Herald on Sunday splashed on the Lions \"roaring back\" to square the series, with the Star majoring on the key flashpoint in the game - the red card to Williams and the influence of referee Jerome Garces.\nThe player ratings in the Herald caused a stir, with the irrepressible Lions lock Maro Itoje given a 4/10. Online ratings later had Itoje as a more realistic 9/10.\n\"The Lions were numerically and tactically superior,\" Marc Hinton wrote in The Press, and this sense of acceptance is echoed across the Kiwi media and public, albeit coupled with a fierce desire to restore normality in the Eden Park decider.\nSupport for the All Blacks permeates every level of New Zealand society, male and female, young and old.\nAt St Joseph's Primary School in Queenstown, in the heart of Otago, the children are still coming to terms with the hurt of defeat.\nAged between 10 and 11, they struggle to recall the last time the All Blacks were beaten on home soil.\n\"We normally win - it doesn't feel that good when we lose,\" was the reaction of 11-year-old Thomas, who says he dreams of one day becoming an All Black and following his hero Ben Smith.\n\"I felt like throwing the table at the TV - but they deserved it.\"\nBut disappointment turns to confidence when looking ahead to Saturday's decisive Test.\n\"We'll win 70-30 on Saturday,\" insists 10-year-old Samuel.\n\"You are dreaming,\" retorts his friend Mason, who opts for a more realistic scoreline - though the All Blacks still come out on top, of course.\nOn the flight from Queenstown to Auckland, stewardess Trudie insists the Auckland weather will be much more to the All Blacks' liking this weekend.\n\"Beauden is usually such a good kicker,\" she laments, referring to the three kickable penalties missed by fly-half Beauden Barrett at Westpac Stadium.\nWhile the Lions players have had two days off in scenic Queenstown, the All Blacks have done the complete opposite - spending the start of the week smarting and training hard in the Auckland bubble.\nBut the theme coming out of both camps is the same: the 'Blacklash' is coming, and the New Zealand players are embracing the magnitude of Saturday's showdown.\n\"We have learned a lot. I am really excited about what we can do this week back at Eden Park,\" says scrum-half Aaron Smith, who admits the All Blacks were too blunt in attack in Wellington.\n\"Hurt. Angered. Frustrated. You name it, the All Blacks are ready to mine the emotions for a week they're happy to say has a World Cup final feel about it,\" adds Hinton in The Press.\nThe All Blacks haven't lost successive matches since 2011, before head coach Steve Hansen took charge.\nLose to the Lions on Saturday, and the public inquest really will begin.", "url": "https://www.bbc.com/sport/rugby-union/40494689"}