{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:36:20", "date_modify": "2025-05-21 04:36:20", "date_publish": "2025-01-18 00:00:00", "description": "Joe Taylor and Brodie Spencer strike shortly after half-time as Huddersfield Town fight back to draw at Blackpool.", "filename": "sport_football_live_cd64vn504jqt_1747802180.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cd64vn504jqt_1747802180.html", "title": "Blackpool 2-2 Huddersfield Town", "title_page": "League One: Blackpool 2-2 Huddersfield Town - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Joe Taylor and Brodie Spencer struck shortly after half-time as Huddersfield fought back to draw at Blackpool.\nRob Apter opened the scoring after 11 minutes and Albie Morgan doubled Blackpool's lead in first-half stoppage time but promotion-chasing Town hit two goals inside five minutes after the break to salvage a point.\nThe hosts led on 11 minutes when debutant Tom Bloxham found Apter in the box and, after cutting in from the right, squeezed his finish inside the near post.\nBen Wiles went close to a leveller but Olly Casey rescued Blackpool with a goal-line clearance. Huddersfield captain Tom Lees was also called upon for a last-gasp stop when James Husband's cross seemed destined to sneak in.\nThe first half was extended by 10 minutes due to a medical emergency in the stands and, midway through that stoppage time, Morgan netted Blackpool's second.\nAshley Fletcher's shot was parried by Jacob Chapman and Morgan was quickest to react to the loose ball, his goal making it 2-0 at the break.\nTwo goals in quick succession at the start of the second half turned the game on its head, however. Firstly, Taylor halved the deficit with a debut goal after Blackpool failed to clear a corner.\nAnd, within a few minutes, the visitors were level. The advancing Spencer was not closed down in time and his shot curled into the top corner.\nFurther chances came but were not capitalised upon. Apter skied a golden opportunity and Bloxham fired wide for Blackpool, while at the other end Lees' header was brilliantly pushed wide by Harry Tyrer.", "url": "https://www.bbc.com/sport/football/live/cd64vn504jqt"}