{"authors": ["Kal Sajad", "www.facebook.com"], "date_download": "2025-05-21 05:26:09", "date_modify": "2025-05-21 05:26:09", "date_publish": "2025-01-13 19:22:38", "description": "Daniel Dubois and Joseph Parker become a sideshow at their own news conference after Tyson Fury announced his retirement earlier on Monday.", "filename": "sport_boxing_articles_cd0jgzrm4njo_1747805169.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/03aa/live/f4cd99e0-d1dc-11ef-80e5-9f0b215d3fef.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_boxing_articles_cd0jgzrm4njo_1747805169.html", "title": "Dubois vs Parker: Tyson Fury overshadows Daniel Dubois-Joseph Parker news conference", "title_page": "Dubois vs Parker: Tyson Fury overshadows Daniel Dubois-Joseph Parker news conference - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Daniel Dubois and Joseph Parker became a sideshow at their own news conference after fellow heavyweight Tyson Fury announced his second retirement from boxing earlier on Monday.\nBriton Dubois will defend his IBF world title against New Zealand's Parker on 22 February in Saudi Arabia, with the main event a rematch between light-heavyweight rivals Artur Beterbiev and Dmitry Bivol.\nThe heavyweight pair tried their utmost to promote their own fight, and one of the most talent-laden cards of recent times, but were continuously asked to field questions about former world champion Fury.\n\"If Tyson is ready to retire, then he should hang up his gloves and enjoy his life. He's achieved, he's content,\" Parker said of his friend and sparring partner.\nDubois, speaking to BBC Sport in London, questioned whether Fury - who announced his retirement in April 2022 but returned six months later - will stay retired.\n\"He might come back. You never know with Fury. Either way, he's a legend,\" the 27-year-old said.\nThe attention diverted back to next month's card as Dubois and Parker shared sometimes awkward exchanges at the top table.\nParker, 33, questioned why Dubois entered the ring to call out fellow champion Oleksandr Usyk after the latter's win over Fury in December.\n\"It's all about making noise. This is show business. That's what I want next. First I want to get through this guy,\" Dubois replied, promising a \"demolition job\" on Parker.\nGreenwich's Dubois made a successful first defence of his IBF title by dismantling Anthony Joshua in five rounds at Wembley Stadium in September.\nAddressing Fury's retirement, his promoter Frank Warren said: \"Daniel is the next Brit on the block coming though. He's the guy.\"\nDubois is eyeing a rematch with Usyk after being stopped by the Ukrainian in August 2023.\n\"You might be looking too far ahead,\" Parker warned him.\nDubois and Parker shared pleasantries when they crossed paths in a hotel lobby in Riyadh last month but there was an air of tension this time.\n\"I've got my mind firmly set on you,\" Dubois said.\n\"It better be,\" Parker, who held the WBO title between 2016 and 2018, replied.\nDespite three losses in a 38-fight career, Parker has revived his career with a four-fight winning streak, including solid victories over Deontay Wilder and Zhilei Zhang.\n\"I've been boxing for a while and I feel like I've only just started,\" the Auckland fighter added.\nDubois' sometimes awkward demeanour does not necessarily lend to trash talk, yet he drew a laugh as he quipped: \"I'll teach you a few things in there. A few new skills.\"", "url": "https://www.bbc.com/sport/boxing/articles/cd0jgzrm4njo"}