{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:22:23", "date_modify": "2025-05-21 07:22:23", "date_publish": "2025-04-01 00:00:00", "description": "Anthony Elanga fires Nottingham Forest closer to the Champions League as they earn a deserved win over Manchester United.", "filename": "sport_football_live_cpq2qj9x9rxt_1747812143.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a26c/live/8aef4580-0f37-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cpq2qj9x9rxt_1747812143.html", "title": "Nottingham Forest 1-0 Manchester United: Anthony Elanga winner boosts Champions League push", "title_page": "Nottingham Forest 1-0 Manchester United: Anthony Elanga winner boosts Champions League push - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Nottingham Forest moved closer to realising their Champions League dream as Anthony Elanga's solo strike defeated his former club Manchester United.\nThe winger, who joined United as a 12-year-old, sprinted 70 yards before finishing into the bottom corner to catch the visitors cold with an early winner.\nHe joined Forest from United for £15m in 2023, in search of regular football, and continued his excellent season against his former club.\nMurillo ensured the win with a dramatic goalline clearance from Harry Maguire in the final seconds.\nForest remain third in the Premier League with an eight-point lead over fourth-placed Chelsea, who host Tottenham on Thursday, and it is hard to see how Nuno Espirito Santo's side fail to secure Champions League football from here.\nInto the FA Cup semi-finals - where they face Manchester City at Wembley this month - and on the brink of a first European campaign since 1996, Forest are almost in dreamland.\nEfficient and effective, they completed a double over United for the first time since 1991-92 with a 13th clean sheet of the season and condemned the visitors to their 13th defeat of the campaign.\nRuben Amorim's side were neat and tidy in spells but there was little punch to their attack, as they were unable to break down their organised hosts, while they struggled to contain Elanga.\nDiogo Dalot's first-half header bounced off the bar and Bruno Fernandes tested goalkeeper Matz Sels early on but they are still looking for successive Premier League wins this season.\nUnited remain floundering in 13th before Sunday's derby with Manchester City and there was little suggestion at the City Ground their position will improve.\nManchester United did not perform badly and they weren't outclassed but they were still not good enough.\nAt times in the first half, they knocked the ball around effortlessly but they were fleeting moments, rather than the establishing of any consistent pressure on Nottingham Forest.\nIt was a performance which lacked a spark, urgency, potency in attack and steel at the back - exactly the reasons why they are 13th in the Premier League.\nYes, Dalot hit the bar and Forest did need Murillo to deny Maguire on the line at the death but it would have been a harsh on the hosts had they not won.\nStill without successive wins in the Premier League this season, United host Manchester City in the derby on Sunday before the first leg of their Europa League quarter final against Lyon in France next Thursday.\nSitting 13th in the Premier League, their season remains alive in Europe and they can have a say on the European qualification battle at the top end of the table - although only because they play so many teams vying for the top six in their final eight games.", "url": "https://www.bbc.com/sport/football/live/cpq2qj9x9rxt"}