{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:46:26", "date_modify": "2025-05-20 11:46:26", "date_publish": "2023-08-07 11:36:41", "description": "Tottenham Hotspur fan view: 'Still more questions than answers'", "filename": "sport_articles_c04xj0zy4m2o_1747741586.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e9f3/live/922d6080-310c-11ee-8f52-fbf70e4bf742.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c04xj0zy4m2o_1747741586.html", "title": "Tottenham Hotspur fan view: 'Still more questions than answers'", "title_page": "Tottenham Hotspur fan view: 'Still more questions than answers' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Anna Howells, Spurs XY, external\nIt is hard to believe the season is about to restart. I think we were all welcoming the summer break to get away from the mess that was last season, and while some things were addressed, there are still more questions than answers.\nFirst of all, the manager situation. Ange Postecoglou says the right things and he seems closer to the ‘Spurs DNA’ profile than his predecessors, but only time will tell whether he is truly the right fit or not. I genuinely hope it works out, because we need some sort of consistency on this front.\nSecond, players. I was pleasantly surprised when we announced the signing of James Maddison, I think that is actually a big win for us. Guglielmo Vicario seems promising so it is somewhat reassuring that we are covered on the goalkeeper front. However, we still have not addressed the centre-back situation, we have not sold enough of the surplus squad players and do not even get me started on the Harry Kane drama...\nThird, club management. Fans managed to negotiate a freeze in season ticket prices (I do know there are a number of fans who did not renew), however ticket prices have increased. There were also reports of interested parties buying a stake in the club, and I am sure most fans would welcome a change up top.", "url": "https://www.bbc.com/sport/articles/c04xj0zy4m2o"}