{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:33:30", "date_modify": "2025-04-26 04:33:30", "date_publish": "2025-03-06 00:00:00", "description": "Follow live text commentary, score updates and match stats from Ajax vs Eintracht Frankfurt in the UEFA Europa League", "filename": "sport_football_live_cpdez0nex6qt_1745642010.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_cpdez0nex6qt_1745642010.html", "title": "Ajax vs Eintracht Frankfurt: UEFA Europa League stats & head-to-head", "title_page": "Ajax vs Eintracht Frankfurt: UEFA Europa League stats & head-to-head - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "This will be the first ever meeting between Ajax and Eintracht Frankfurt with the Dutch side losing just one of their previous 21 home matches against German opposition in major European competition (W17 D3), a 1-4 loss to Borussia Dortmund in the group stage of the UEFA Champions League in 2012-13.\nEintracht Frankfurt have progressed from each of their previous two knockout ties against Dutch opposition in major European competition (eliminating Feyenoord at the last 16 stage in 1979-80 and FC Utrecht at the last 32 stage in 1980-81, both in the UEFA Cup), however they did lose both away games in those ties.\nAjax have failed to win any of their last six home games in the knockout stages of a major European competition (D3 L3), since beating Young Boys 3-0 in the last 16 first leg in this competition back in 2020-21.\nEintracht Frankfurt have progressed from six of their last eight last 16 ties in major European competition, although they have been eliminated from two of their last three (against Basel in the UEFA Europa League in 2019-20 and Napoli in the UEFA Champions League in 2022-23).\nAjax have had 10 different goalscorers in the UEFA Europa League this season (excluding own goals, only four sides have had more), their joint most in a single major European campaign.", "url": "https://www.bbc.co.uk/sport/football/live/cpdez0nex6qt"}