{"authors": ["Tyrone Smith", "www.facebook.com"], "date_download": "2025-05-21 04:59:50", "date_modify": "2025-05-21 04:59:50", "date_publish": "2025-04-04 11:47:44", "description": "Dundee casting 'negatives aside' says defender Aaron Donnelly", "filename": "sport_articles_czrv7z6yz7vo_1747803590.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b4fe/live/78cf3200-113c-11f0-8874-0979deb646d0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_czrv7z6yz7vo_1747803590.html", "title": "Dundee casting 'negatives aside' says defender Aaron Donnelly", "title_page": "Dundee casting 'negatives aside' says defender Aaron Donnelly - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Aaron Donnelly insists the defence shouldn't solely shoulder the blame for the alarming number of goals Dundee have conceded this season.\nDefender Donnelly is craving a clean sheet in Saturday's home game against St Mirren after the 4-3 defeat by Rangers last week kept the Dark Blues in the relegation play-off spot.\n\"We spoke after the game, we said that three goals should be enough to win any game but at the end of the day it comes down to us as a team,\" said the 21-year-old.\n\"It is not just the defenders and goalkeeper, it is the team to keep a clean sheet and that is what we will be striving for on Saturday.\n\"The mood is good, everyone knows we have to go in and try to take maximum points from every game.\n\"We know we are the only people that can get us out of this situation because we are the people who put us in it. But most importantly everyone is going to fight for each other and we know what the end objective is.\"\nDonnelly says casting aside the negatives is nothing new for Tony Docherty's side, who have just one win in 10 league games and have shipped 67 goals in their 31 Premiership matches.\n\"I think it has happened a lot this season where we have had to put the negatives aside and just think about the positives,\" he added.\n\"Especially when we conceded 12 goals in one week, we had to put the negatives away and think about the positives and it is no different this week.\n\"We know St Mirren are on a good run of form, they had a great result last week against Kilmarnock but we will be hoping to turn them over.\"", "url": "https://www.bbc.com/sport/articles/czrv7z6yz7vo"}