{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:27:20", "date_modify": "2025-05-20 13:27:20", "date_publish": "2023-07-26 10:32:20", "description": "Truro City sign former Plymouth Argyle left-back Ryan Law, AFC Wimbledon forward Obed Yeboah and York City defender Sam Sanders.", "filename": "sport_football_65059195_1747747640.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9094/production/_130521073_ryan_law_rex3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_65059195_1747747640.html", "title": "Ryan Law: Truro City sign former Plymouth Argyle defender", "title_page": "Ryan Law: Truro City sign former Plymouth Argyle defender - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Truro City have signed former Plymouth Argyle left-back Ryan Law and AFC Wimbledon forward Obed Yeboah on permanent deals as well as bringing in York City defender Sam Sanders on loan.\nLaw, 23, was released by Argyle in the summer and previously spent the 2019-20 campaign on loan at the White Tigers.\nHe played 31 times for Argyle and spent last season on loan at League Two side Gillingham and non-league Yeovil Town.\nYeboah, 18, is the nephew of former Leeds united forward Tony Yeboah.\nHaving come up through the Dons' youth academy he made his first-team debut last season and had a loan spell at Corinthian Casuals in the Isthmian League before being released by the London side in May.\nSanders, 21, has agreed a six-month loan deal, having helped York win promotion out of National League North in 2022.\nHe has 20 National League appearances for York and had a spell on loan with Boston United in the National League North towards the end of last season.\n\"Lawsy is someone I've known for a long time,\" manager Paul Wotton told the club website, external.\n\"He had an unbelievable season for us on loan when he was just 18.\n\"He's someone I've always kept my eye on. Persistence has paid off in the end and we've finally got our man. I'm thrilled to get him in.\"", "url": "https://www.bbc.com/sport/football/65059195"}