{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:29:09", "date_modify": "2025-04-26 06:29:09", "date_publish": "2025-02-27 11:13:37", "description": "Former England defence coach Felix Jones will become an assistant coach with South Africa from next week.", "filename": "sport_rugby-union_articles_cpdee4ey6qjo_1745648949.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/732d/live/bed38b20-f4fe-11ef-9808-4d9b058d1a40.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_cpdee4ey6qjo_1745648949.html", "title": "Felix Jones: Former England defence coach joins South Africa staff", "title_page": "Felix Jones: Former England defence coach joins South Africa staff - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Former England defence coach Felix Jones will become an assistant coach with South Africa from next week.\nJones stepped down from his position with England in December after becoming disillusioned in Steve Borthwick's set-up.\nThe 37-year-old was part of the Springboks' coaching staff during their 2019 and 2023 World Cup victories, working under head coach Rassie Erasmus in the first of those triumphs.\n\"We are delighted to welcome Felix back and we are excited to see him pick up where he left off in 2023,\" said Erasmus, who returned as head coach when Jacques Nienaber left for Leinster following the 2023 World Cup win.\n\"He was a vital cog in the coaching team from 2019 to 2023 and his experience, professionalism, and excellent work ethic will make him a great addition.\n\"After spending some time in England, his experience of studying opposition teams in the Six Nations and other international tournaments will add immense value in assisting us as we cast an eye on a tough international season ahead.\"\nFormer Ireland wing Jones is one of three new appointments to Erasmus' backroom staff along with physiotherapist Lance Lemmetjies and team dietician Robyn Moore.\n\"As a team we are well aware that we need to keep improving and growing if we want to remain one of the best teams in the world and to give ourselves the best possible chance to defend our World Cup title in Australia in 2027,\" Erasmus added.\n\"Felix, like all the other coaching and support staff, will play a key role in guiding us to do so.\"", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/cpdee4ey6qjo"}