{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:33:12", "date_modify": "2025-05-20 12:33:12", "date_publish": "2023-08-04 10:07:58", "description": "Newcastle: Elliot Anderson set for enhanced role this season", "filename": "sport_articles_crge167jkn7o_1747744392.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2f4f/live/9cc45b40-32a9-11ee-8412-a3db9e03faea.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_crge167jkn7o_1747744392.html", "title": "Newcastle: Elliot Anderson set for enhanced role this season", "title_page": "Newcastle: Elliot Anderson set for enhanced role this season - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Eddie Howe believes talented young forward Elliot Anderson has \"a big part to play\" as Newcastle compete on four fronts this season.\nThe 20-year-old started three times in the Premier League last year but did make 27 appearances in total and has impressed in pre-season.\n\"He's done very well,\" said Howe. \"He's come back very fit and looks very motivated.\n\"He's scored goals and I see a lot of aspects of his game improving. I have high hopes for him. We've got a load of games this year so he's got a big part to play.\"\nNewcastle have signed Sandro Tonali and Harvey Barnes this summer and have had a bid accepted for Southampton's Tino Livramento.\nWith one week to go before the season starts, Howe said every player will be important.\n\"We do not want a huge squad because we want everyone to feel they have a part to play,\" he said. \"We have a very good squad when everyone is fit but the problem is that we cannot guarantee that all season.\n\"We are in various competitions and have to be robust enough to deal with that challenge. Let's see what happens [regarding further new signings]. It would be a maximum of a couple of players.\"", "url": "https://www.bbc.com/sport/articles/crge167jkn7o"}