{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:08:50", "date_modify": "2025-05-21 05:08:50", "date_publish": "2025-04-05 00:00:00", "description": "Jamie Sterry and Rob Street score late goals as promotion-chasing Doncaster seal a League Two win at 10-man Cheltenham.", "filename": "sport_football_live_c8rgde61zz8t_1747804130.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/75df/live/c649f490-107c-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c8rgde61zz8t_1747804130.html", "title": "Cheltenham Town 0-2 Doncaster Rovers", "title_page": "Cheltenham Town 0-2 Doncaster Rovers - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jamie Sterry and Rob Street scored a late goal apiece as promotion-chasing Doncaster sealed a League Two win at 10-man Cheltenham.\nRight-back Sterry applied the perfect touch and strike past Joe Day in the 89th minute after good work from Luke Molyneux on the left.\nAnd substitute Street – a former Cheltenham striker – finished neatly in the fifth minute of second-half stoppage-time after a parry from Day, sealing the points against his old club.\nThe hosts had the first clear chance with Tim Dieng flicking Tom Bradbury's cross from the left wide in the fifth minute.\nDoncaster then threatened through Owen Bailey, who saw his header cleared off the line by Liam Kinsella before Jordan Gibson sent the ball wide.\nJordan Thomas fired a low effort just past the right post for Cheltenham before half-time but the scores remained level at the break.\nMolyneux saw one shot fly over the crossbar and another saved by Day early in the second half as the visitors pressed.\nCheltenham had Dieng sent off for a second yellow card in the 56th minute, following a foul on Jack Senior.\nGibson crashed a shot against the crossbar with Day beaten a minute later, but Cheltenham were close when Arkell Jude-Boyd's cross nearly deflected in off a defender.\nMolyneux fed Joe Ironside, who could not finish from close range in the 78th minute and Jude-Boyd forced Teddy Sharman-Lowe into a diving save at the other end with eight minutes remaining.\nBut the late Doncaster double sent the 683 travelling fans home happy and kept Grant McCann's side in title contention.", "url": "https://www.bbc.com/sport/football/live/c8rgde61zz8t"}