{"authors": ["Nigel Ringland", "www.facebook.com"], "date_download": "2025-05-20 14:12:55", "date_modify": "2025-05-20 14:12:55", "date_publish": "2023-07-26 11:28:08", "description": "Daniel Wiffen produced the best ever finish by an Irish swimmer at the World Championships to finish fourth in the men's 800m freestyle final in Fukuoka.", "filename": "sport_swimming_66312141_1747750375.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5489/production/_130514612_gettyimages-1552636503-1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_swimming_66312141_1747750375.html", "title": "World Aquatics Championships: NI's Daniel Wiffen breaks European record in 800m freestyle final", "title_page": "World Aquatics Championships: NI's Daniel Wiffen breaks European record in 800m freestyle final - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Daniel Wiffen produced the best ever finish by an Irish swimmer at the World Championships to finish fourth in the men's 800m freestyle final in European record time in Fukuoka.\nThe 22 year-old clocked a time of 7:39.19, lowering the figures from Tuesday of 7:43.81.\nWiffen sat off the early pace, confidently swimming his own race as a trio led by Tokyo Olympic 400m freestyle champion Ahmed Hafnaoui from Tunisia set off under world record pace.\nHafnaoui held on to take gold ahead of Australia's Sam Short, who won the 400m freestyle title on Sunday.\nThe defending world champion Bobby Finke from the USA came through strongly over the last 50m to take the bronze as the top three recorded the third, fourth and fifth quickest times in history.\nWiffen, who edged early pacesetter Lukas Martens of Germany in the closing stages for fourth place, missed out on the podium by 0.51 of a second.\nHowever, he had the consolation of the European record as he showcased impressive form ahead of the 1500m freestyle heats on Saturday as he continues to chase Ireland's first-ever long course World Championships medal.\n\"It was a good race, I'm really happy with the personal best and really looking forward to the 1500m freestyle later in the week, but that race was great to be part of,\" said Wiffen.\n\"Missing the podium, you know, I came into this, and I just wanted to be better than last year, and I've done that by a lot so I'm happy enough.\n\"That was definitely one of the best races I've ever had, and I loved every minute of it, I'm looking forward to what's next.\"\nOn his 1500m bid, Wiffen added: \"I said on poolside there that if I can take five seconds off my 1500m that I'm under the world record, so let's hope that happens.\"", "url": "https://www.bbc.com/sport/swimming/66312141"}