{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:53:13", "date_modify": "2025-04-26 03:53:13", "date_publish": "2025-03-03 09:00:14", "description": "Joe Highsmith goes from the bottom of the leaderboard after two rounds to victory by two shots at the Cognizant Classic in Florida.", "filename": "sport_golf_articles_c3e45dddngzo_1745639593.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2a0b/live/f5ec4170-f809-11ef-86bb-a924c748a1a8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_golf_articles_c3e45dddngzo_1745639593.html", "title": "Cognizant Classic: Joe Highsmith goes from bottom of leaderboard to top in thrilling win", "title_page": "Cognizant Classic: Joe Highsmith goes from bottom of leaderboard to top in thrilling win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A stunning comeback from Joe Highsmith helped the American go from the bottom of the leaderboard after two rounds to victory by two shots at the Cognizant Classic in Florida.\nHighsmith needed a five-foot putt on the 18th just to make the cut on Friday and went into the weekend eight shots behind the leaders.\nBut the 24-year-old hit back-to-back seven-under par 64s, the lowest 36-hole score in the 53-year history of the event, to finish on 19-under and secure his first PGA Tour win.\n\"I played probably the best round of my life,\" said Highsmith, whose bogey-free final round included a run of four birdies in five holes from ninth and a putt from nearly 21 feet on the 17th.\n\"[My mum] was supposed to leave at the turn but I was like, 'well what if I'm like five-under through nine, mom?'\n\"I played great on the front and then I saw her on the 12th hole and was like, 'yeah, she cancelled her flight'.\"\nIt is just the third time in 15 years a player has made the cut on the number and gone on to win and the first since since Brandt Snedeker at the 2016 Farmers Insurance Open.\nThe victory means Highsmith gains automatic entry to The Masters at Augusta next month and the PGA Championship in May. It also secures his PGA Tour card through to 2027 and entry to the remainder of this season's PGA Tour Signature Events, starting with the Arnold Palmer Invitational, which begins on Thursday.\n\"Those best players in the world, I don't really play in the same events as any of them, especially last year and even this year,\" said Highsmith.\n\"It'll be pretty fun to get to compete and kind of see how I stack up with some of them.\"\nJacob Bridgeman and JJ Spaun finished tied for second, with Max McGreevy and Ben Griffin one shot further back.", "url": "https://www.bbc.co.uk/sport/golf/articles/c3e45dddngzo"}