{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:40:30", "date_modify": "2025-05-21 04:40:30", "date_publish": "2025-04-03 09:28:44", "description": "Bristol City centre-back Rob Dickie has been \"terrific\" after putting a dip in form earlier this season behind him, says manager Liam Manning.", "filename": "sport_football_articles_ce92gmk42jro_1747802430.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f14d/live/f7951b00-1069-11f0-b72e-6314f702e779.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ce92gmk42jro_1747802430.html", "title": "Rob Dickie: Bristol City centre-back has been 'terrific', says Liam Manning", "title_page": "Rob Dickie: Bristol City centre-back has been 'terrific', says Liam Manning - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Bristol City centre-back Rob Dickie has been \"terrific\" for the club after putting a dip in form earlier this season behind him, says manager Liam Manning.\nThe 29-year-old has played every minute of the Robins' past 24 Championship matches stretching back to November when he returned from a hamstring injury.\nAgainst Burnley he was praised for an \"outstanding\" performance that prevented the Clarets adding to their 1-0 advantage.\n\"He's really got back to the level that he showed he's capable of,\" Manning told BBC Radio Bristol.\n\"I had a chat with him probably about two months ago where I thought he'd dipped a little bit for the standards he'd set last season working with him.\n\"He's definitely got back up there and I think when you look at it, the role of vice captain and the support he gives Knighty [Jason Knight], the voice he has in the changing room has only grown and grown over the course of the season and he's been terrific, the big man, and long may it continue.\"\nDickie signed from QPR in June 2023 on a three-year contract and was made vice captain at the start of this campaign.\nSince January he has been one of only two specialist centre-backs - along with Zak Vyner - available to Manning, due to Luke McNally being ruled out long-term with an anterior cruciate ligament injury plus Rob Atkinson and Kal Naismith leaving on loan.\nManning said that after the loss at Turf Moor last Saturday, Dickie was one of the most vocal players in the changing room.\n\"It's another sign of progress of the group, when you come in afterwards and the lads are so honest with the reflections,\" Manning said.\n\"In terms of that level of awareness, knowing when you've not quite been at it allows you to try and affect it and change it again in the future.\n\"Rob's got a big voice in the changing room and he was one that spoke really well afterwards, as did Knighty and a few of the other seniors.\"", "url": "https://www.bbc.com/sport/football/articles/ce92gmk42jro"}