{"authors": ["James Ledger", "www.facebook.com"], "date_download": "2025-05-21 06:54:46", "date_modify": "2025-05-21 06:54:46", "date_publish": "2024-12-24 08:09:36", "description": "After seeing his professional boxing career delayed by injury and epidemic, unbeaten Ben Crocker is wasting no more time after seizing the IBF European super-lightweight title.", "filename": "sport_boxing_articles_cy0nvv51zrdo_1747810486.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/eef2/live/32ba47f0-bdf9-11ef-8e9d-2d56144e0daf.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_boxing_articles_cy0nvv51zrdo_1747810486.html", "title": "Crocker targets bigger and better after European title", "title_page": "Ben Crocker targets bigger and better after European title - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Great things take time and Ben Crocker's moment has arrived after years of hard work and determination.\nThe 30-year-old from Swansea claimed the IBF European super-lightweight title, out-boxing opponent Stelios Papadopoulos to prove his grit, ability and belief in his dream.\nCrocker showed sharp defence and pinpoint counterpunching to clinch an unanimous decision at the Brentwood Centre in Essex on 7 December.\nIt was an impressive performance in the ring, produced under the guidance of Gary Lockett, the former WBU world middleweight champion turned renowned trainer.\nHaving always been involved in combat sport from a young age, it was not until Crocker joined Premier ABC at the age of 12, under the watchful eye of Stephen 'Spud' Brophy, that his boxing journey truly started.\n\"I've always done combat sports, I did kickboxing up until I was 12, I then found the boxing gym and I said to my dad I wanted to start boxing - I think it was from watching the Rocky movies,\" Crocker said.\nCrocker's goal was clear: turn professional by 23, reach 100 amateur bouts and pursue a path leading to the Commonwealth Games and the Olympics.\nHowever, a series of hand injuries and the Covid pandemic derailed those plans, delaying Crocker's progress to the professional ranks, a setback he describes as \"really frustrating\".\n\"From 12 I never looked back, turned pro when I was 25 but I had a couple of years out with hand operations, then Covid struck so I didn't have my debut until I was 27,\" he added.\nIt was \"now or never\" for Crocker, as he finally turned pro with a debut win over Naeem Ali in Cardiff in September 2021.\nCrocker wasted no time in racking up a 13-0 record, before facing Greek fighter Papadopoulos, 31, who boasted an impressive 15-1-2 record, for the vacant IBF European title.\nThis was the second time the pair had clashed, having fought over eight rounds at the same venue the previous April, and once again the result - this time over 10 rounds - was a repeat of their first encounter, with no redemption for Papadopoulos.\nCrocker said: \"I knew it would be completely different the second time. I had to elevate my game and stamina because I knew he was coming to win.\"\nThe Swansea fighter admitted he was \"nervous, wondering if it would go my way\", adding: \"When the fight is close and you're the away fighter, the judges sometimes lean towards the home fighter.\"\nBut all three judges favoured Crocker, scoring the bout 97-93 96-94 96-95 in the Welshman's favour against an opponent who now bases himself in Essex after a spell in Los Angeles in the United States.\nCrocker described that winning feeling as \"emotional - when you turn and see your family and friends there is no feeling like it\".\nThe fans never fail to turn out in full force, traveling across the country to support their Swansea hero. This time they braved Storm Darragh to make the journey to Essex to witness Crocker claim the European title.\n\"For them to make the effort, and they have from the start, it really means a lot,\" he said.\n\"Now that I have the belt, I finally have something to give back to them. It's my way of saying thank you.\"\nNow 14-0, Crocker hopes his European belt opens doors to bigger fights and more exposure, boosting his career and the chances of securing a top promoter contract to reach the highest level in boxing.", "url": "https://www.bbc.com/sport/boxing/articles/cy0nvv51zrdo"}