{"authors": ["Alex Hoad", "www.facebook.com"], "date_download": "2025-04-26 04:37:42", "date_modify": "2025-04-26 04:37:42", "date_publish": "2025-02-28 11:06:49", "description": "There are matches of potentially huge significance in the Championship, League One and League Two this weekend.", "filename": "sport_football_articles_c4g99wpnzqlo_1745642262.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6c4f/live/4ce7eb30-f5c3-11ef-97ab-abb74cabf06c.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c4g99wpnzqlo_1745642262.html", "title": "EFL preview: Marching on to the business end of the season", "title_page": "EFL preview: Marching on to the business end of the season - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "With five Championship sides involved in the FA Cup fifth round this weekend there is a reduced programme in the second tier, but it promises to be no less dramatic.\nAs the calendars flip over to March and with just four weeks until British Summer Time returns, plenty of teams will be aiming to spring forward on Saturday as the business end of the season begins.\nThere are also some huge games in both League One and Two which could prove pivotal in the final shake-up.\nLet's see what we have in store, shall we?\nThe Championship action kicks off on Friday night (20:00 GMT) as fourth-placed Sunderland seek to bounce back from consecutive defeats for the first time this season.\nThe Black Cats head to Hillsborough to face Sheffield Wednesday, who have slipped from the fringe of the play-off places to 13th off the back of a run of four points from their past five games - the last two also ending in defeat.\nLeeds have the opportunity to open up an eight-point lead at the top of the table, for a few hours at least, as they welcome West Bromwich Albion to Elland Road (12:30 GMT).\nDaniel Farke will be hoping it's not a case of 'after the Lord Mayor's Show' following dramatic victories over Sunderland and Sheffield United on Monday made it five straight wins and 16 league games unbeaten.\nIn-form Junior Firpo told BBC Radio Leeds: \"Obviously to win at Sheffield United, second in the league, fighting with us to win the league, to go five points clear feels unbelievable.\n\"There are still a lot of games to play, we have to stay humble, it's not done yet. We want to keep going and win as many games as possible.\"\nClosest challengers the Blades will aim to get back on track as they visit QPR at 15:00 GMT.\n\"We've got to go again,\" boss Chris Wilder told BBC Radio Sheffield. \"Nothing's been decided. We have to stay humble and work our way back into a performance and result on Saturday.\n\"Our reaction to disappointment has been outstanding all season. We've 12 games to go, we'll dust ourselves down and go again. There's a lot of points to be won.\"\nThe play-off race is tightening up with 10 teams separated by just seven points and the early kick-offs see Valerien Ismael taking charge of sixth-placed Blackburn for the first time as 10th-placed Norwich, just four points behind, are the visitors to Ewood Park.\nAt the same time Coventry's charge up the standings will be challenged by Oxford United at the Kassam, with Frank Lampard's Sky Blues just a point behind fifth-placed West Brom after collecting seven wins from their past eight games.\nAt 15:00 GMT, all eyes will turn to the lower reaches of the table with some intriguing fixtures, not least rock-bottom Luton hosting Portsmouth, who have pulled nine points clear of the drop zone thanks to three straight wins.\nAfter ending a five-match losing streak with victory at Stoke in midweek, Middlesbrough will host second-bottom Derby seeking to close a four-point gap to safety, while the Potters - in 20th and five points above the drop zone - entertain Watford, who have won two straight after going five without a win.\nNo question of the game of the day across the entire EFL, as League One leaders Birmingham will seek to go 12 points clear - with a game in hand - as they welcome second-placed Wycombe and their new boss Mike Dodds back to St Andrew's at 12:30 GMT.\nBlues have conceded just four goals in their past 17 league games since their last defeat at Shrewsbury on 23 November.\nBoss Chris Davies told BBC Radio WM: \"We've played game after game and just kept turning up. Whether Wycombe are second or 22nd, it doesn't matter to me, we've got to come and be ourselves and really get after them.\"\nThe Chairboys led the table as recently as December but have only scored eight goals in their past eight games, drawing four of their past six.\nDodds, who spent a decade coaching in the Blues academy, helping develop the likes of Jude Bellingham, told BBC 3CR: \"We have to find that little bit of quality, that little bit of magic in the top end of the pitch.\n\"It's a great opportunity for everyone associated with the football club to show how good we are, and we're looking forward to it.\"\nThe other lunchtime game in the third tier is another potential humdinger as third-placed Wrexham, stunned in the EFL Trophy semi-final on Wednesday, host Bolton Wanderers, who have won three straight under Steve Schumacher to lie outside the play-off places on goal difference alone.\nThe two sides directly above them, also on 53 points, face off in another potential cracker as Charlton make the short trip north of the River Thames to visit Leyton Orient.\nAmong the raft of 15:00 GMT games is Nigel Clough making a return to former club Burton Albion as manager of Mansfield, with the Stags having taken a single point from their past nine league games.\nTown have slipped within six points of the resurgent Brewers, who occupy the final spot in the relegation zone after picking up 17 points from their past eight matches.\nThere are also some huge games at the foot of the table with rock-bottom Cambridge United heading to third-bottom Crawley, three points ahead, while second-bottom Shrewsbury visit Peterborough, one place above the dotted line in 20th.\nAfter 13 points from a possible 15, without conceding a goal, Bradford City could close to within four points of League Two leaders Walsall with a win at play-off-chasing Salford on Saturday lunchtime.\nThe Saddlers look to be over their mini-wobble but are not in action until 15:00 GMT when they host Ian Holloway's upwardly mobile Swindon, who have lost just one of their past eight games to pull away from trouble.\nDoncaster lie third, two points behind the Bantams, and host mid-table Newport while fourth-placed AFC Wimbledon welcome Bromley, seeking to close a 10-point gap to top spot, having played a game fewer.\nAt the other end, basement-boys Carlisle's derby win at Barrow on Thursday night means the bottom three are separated by just two points.\nSecond-bottom Morecambe visit struggling Gillingham at 15:00 GMT while third-bottom Tranmere begin life after Nigel Adkins with the visit of Port Vale at 12:30 GMT.", "url": "https://www.bbc.co.uk/sport/football/articles/c4g99wpnzqlo"}