{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:32:06", "date_modify": "2025-04-26 06:32:06", "date_publish": "2025-02-27 08:36:53", "description": "Former Leicester Tigers coach Tom Hudson will take over at Premiership Women's Rugby rivals Sale Sharks at the end of the season.", "filename": "sport_rugby-union_articles_cx2rr8yvnlgo_1745649126.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b67f/live/4dea5d30-f4a9-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_cx2rr8yvnlgo_1745649126.html", "title": "Tom Hudson hired as Sale Sharks head coach", "title_page": "Tom Hudson hired as Sale Sharks head coach - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Former Leicester Tigers coach Tom Hudson will take over at Premiership Women's Rugby rivals Sale Sharks at the end of the season.\nThe 30-year-old will succeed former Wales captain Rachel Taylor, who confirmed in January she would step down as head coach at the end of this campaign.\nHudson's own departure from Leicester was confirmed at a similar time. He has been Tigers head coach for a year, having been promoted from within the ranks.\n\"I grew up in Heaton Moor, I was part of the DPP and Sale Sharks is my family club so I'm really excited to be coming back to a club, a city and a region that means so much to me,\" said Hudson.\n\"This club has so much potential and if we can build on the brilliant work that's gone before, and add to the talented group we've already got, then I know we can create a winning culture and something that young girls in the north aspire to be a part of.\"\n\"Tom is one of the brightest young coaches in the game and he has done wonders with the programme at Leicester in his two years there,\" said former England captain Katy Daley-Mclean, who is now Sale Sharks Women's programme lead .\nSale have also added Charlie Beckett, who played alongside Hudson at Gloucester during the pair's playing days, as defence coach. The 29-year-old has spent the last season as assistant coach at Loughborough Lightning.\nScrum coach Luke Stratford, who worked with Hudson at Leicester, also makes the switch to Sale.\nSale Sharks finished bottom of the PWR table, recording only one win in their 16 matches.", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/cx2rr8yvnlgo"}