{"authors": ["Joe Rindl", "www.facebook.com"], "date_download": "2025-05-20 12:38:03", "date_modify": "2025-05-20 12:38:03", "date_publish": "2023-08-03 18:34:24", "description": "Great Britain's William Tidball wins gold in the men's scratch race at the Cycling World Championships in Glasgow.", "filename": "sport_cycling_66396114_1747744683.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/14270/production/_130644528_gettyimages-1575075471-1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cycling_66396114_1747744683.html", "title": "UCI Cycling World Championships 2023: GB begin with two gold and two bronze medals", "title_page": "UCI Cycling World Championships 2023: GB begin with two gold and two bronze medals - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Great Britain won two golds, a silver and two bronze medals on day one at the Cycling World Championships in Glasgow.\nWilliam Tidball timed his sprint perfectly to win gold in the men's scratch race during an opening day of racing on the track.\nEarlier Britain collected gold and bronze in the women's B 1km time trial.\nGermany pipped Great Britain to gold in the women's elite team sprint with both teams beating the previous world record in the final.\nTidball edged out Japan's Kazushige Kuboki in a frantic finish in Thursday's final race on the Sir Chris Hoy velodrome with Dutch rider Tuur Dens taking bronze.\nTidball became the first Briton to be crowned world champion at the men's scratch since Ben Swift won in Melbourne in 2012.\nThe 23-year-old former European under-23 champion saw his chances fading when Switzerland's Alex Vogel broke away from the peloton with four laps to go.\nBut he latched on to Dens' wheel on the final lap, overtaking Vogel inside the final 200 metres, before sprinting around the Dutchman for victory.\nBritain's first medals of the championship came in the women's B 1km time trial with Sophie Unwin and pilot Jenny Holl claiming gold and Lizzi Jordan and Amy Cole winning bronze.\nUnwin and Holl were more than a second down on Jessica Gallagher and Caitlin Ward of Australia with a lap to go but beat the Australians to first place by 0.060 seconds.\nThe British pair had won bronze in the event last year and are the defending category B individual pursuit champions.\nThey qualified fastest and, setting the last time of the final, dramatically edged out Gallagher and Ward who had beaten Unwin to gold at the 1km time trial at the 2022 Commonwealth Games in Birmingham.\nJordan and Cole beat compatriots Lora Fachie and Corrine Hall who came fourth.\nIn the penultimate event of the day Britain were edged out by Germany in the women's elite sprint despite posting the world's second fastest time.\nSadly for Emma Finucane, Sophie Capewell and Lauren Bell defending champions Germany posted the fastest just 0.075 seconds earlier.\nLea Friedrich, Pauline Grabosch and Emma Hinze's winning time was 0.119 quicker than the world record they set in 2022.\nThe trio have now won the team sprint at the last three world championships together, four years ago Grabosch and Hinze won gold as a pair after Friedrich had raced in qualifying.", "url": "https://www.bbc.com/sport/cycling/66396114"}