{"authors": ["Ged Scott", "www.facebook.com"], "date_download": "2025-05-21 05:56:56", "date_modify": "2025-05-21 05:56:56", "date_publish": "2025-04-01 17:55:11", "description": "Shrewsbury owner Roland Wycherley feels \"let down\" by the failed process of selling the club.", "filename": "sport_football_articles_c2kvdyjj105o_1747807016.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c588/live/d1f04fd0-0f21-11f0-acc1-239a761fa7cf.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c2kvdyjj105o_1747807016.html", "title": "Shrewsbury Town: End of era for local owners", "title_page": "Shrewsbury Town: End of era for local owners - 'let down' Wycherley - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Shrewsbury Town owner Roland Wycherley says he feels \"deeply let down\" by the failed process of selling the Shropshire club.\nAfter official confirmation that the almost season-long negotiations with an American prospective buyer had come to an end, Wycherley says there is already interest in relegation-threatened Town, who are bottom of League One.\nBut the long-serving 83-year-old chairman, who previously ran two businesses in the town, has also warned that any other potential new buyers are still unlikely to be local.\n\"The era of a local businessman running clubs at this level is coming to an end,\" said Wycherley in a prepared statement.\n\"The reality is that football has moved on.\n\"Previously my intention has been to find a successor who was a local businessman who had the club's and town's best interests at heart.\n\"I twice believed I had found the right local investor, only for both parties to withdraw from the process after agreeing to the asking price.\n\"This time, we appointed an intermediary with a track record of success in selling clubs. When we entered into an exclusivity agreement, we were optimistic. This was the first time we had entered into an exclusivity agreement with an overseas investor.", "url": "https://www.bbc.com/sport/football/articles/c2kvdyjj105o"}