{"authors": ["Jonathan Bradley", "www.facebook.com"], "date_download": "2025-05-21 04:53:41", "date_modify": "2025-05-21 04:53:41", "date_publish": "2025-04-04 15:22:56", "description": "A two-time European Cup winner with Munster, La Rochelle's Ronan O'Gara faces his former side as a head coach for the first time this weekend.", "filename": "sport_rugby-union_articles_c05nzq2mr8po_1747803221.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/78fb/live/ed8c2620-1092-11f0-b234-07dc7691c360.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c05nzq2mr8po_1747803221.html", "title": "La Rochelle vs Munster: 'ROG derby' the latest chapter in Ronan O'Gara's Munster 'love story'", "title_page": "La Rochelle vs Munster: 'ROG derby' the latest chapter in Ronan O'Gara's Munster 'love story' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Having represented his native Munster as a player during the province's glory days and then ushered in an era of similar success as a head coach of La Rochelle, Ronan O'Gara has described Saturday's meeting between the pair as a coming together of the sides who have given him \"the most in rugby\".\nA two-time Heineken Cup winner as a player, O'Gara has matched that feat as a head coach in the new guises of European rugby's top competition and Saturday's Investec Champions Cup last-16 visit from his former side has certainly caught the imagination in his homeland where the game has been dubbed the 'ROG derby'.\nStill a familiar face to Irish rugby fans, both through regular media appearances and his side's rivalry with Leinster over recent seasons, this will be the first time he faces his old side in a head coaching role, although he was on the Racing 92 staff for Champions Cup meetings in 2017.\nO'Gara's former international coach Eddie O'Sullivan found himself in a similar situation when his USA team were paired with Ireland at the 2011 World Cup and predicts the Cork native will feel somewhat \"conflicted\" by the situation.\n\"You hear the anthem and it's your natural instinct to sing Ireland's Call,\" O'Sullivan told BBC Sport NI of the pre-match build-up in New Zealand.\n\"I'm not sure that will apply the same to ROG as it's not international, it's club against club, but there will be some tugging at his heartstrings for sure because he's a Munster man through and through.\n\"He played all his life as a player with Munster, but at the same time he's got a job to do and he's in a tight spot at the moment as well with results not going his way.\"\nAs O'Sullivan noted, this game has arrived at a difficult point in O'Gara's tenure.\nThe 48-year-old acknowledged in his pre-match media briefing that \"if you're to take a minute or five to reflect, it's a fantastic story\", one he later called a \"love story\".\nYet, there is a sense that this game comes at a time when the top points scorer in Munster's history has little time for such meditations.\nThe 2022 and 2023 European champions have reached their first knockout fixture of this season at a low ebb, without a win since beating an understrength Toulouse side on 4 January and sat 10th in the Top 14 with six games remaining.\nO'Sullivan, who had a spell coaching Biarritz in France, can relate to the pressures of a lull after success, recalling how after leading Ireland to a first Triple Crown for 19 years in 2004, a down season followed before the side rebounded to reach what was then a record high of third place in the world rankings.\nNolann Le Garrec and Davit Niniashvili, both 22-years-old, have already been recruited for next season to boost an aging La Rochelle squad.\nHowever, despite all his successes on the French Atlantic coast, O'Gara said that given his side's recent form, \"next year is too early\" to contemplate.\n\"Pressure builds very quickly in French rugby when things aren't going well,\" said O'Sullivan.\n\"It's tough because the longer it goes on it's like you're in a hole and it's getting deeper. All you can do is trust yourself as a coach to find a way out of it and trust the players to stay with you while you're doing it.\n\"Every team has their crisis moments, he's in that space at the moment, but I wouldn't have any doubt that he'll work it out because he'll be relentless in that pursuit.\"\nReflecting on the common thread of the best players he coached, O'Sullivan noted the same \"perfectionist\" streak in O'Gara that he also saw in Keith Wood, Brian O'Driscoll and Paul O'Connell, a trait he knows will make La Rochelle's current form all the harder to stomach.\nWith Andy Farrell leading the British and Irish Lions tour to Australia this summer, it was confirmed last week that it will be O'Connell who takes charge of Ireland's July games against Georgia and Portugal.\nAny game involving an O'Gara side against Irish opposition, however, will feature the subplot of the 128-times capped fly-half returning as coach of the national side in the future, perhaps as soon as 2027 should Farrell depart upon the conclusion of his current contract.\nO'Gara told BBC's Rugby Union Weekly in 2023 that he felt he had to \"earn the right\" to take on such a position, before, in his role as a BBC pundit during the Six Nations, he reiterated his desire to work in Test rugby.\nThe man who this week said he had too many problems with his own team to even review Munster's win over Connacht last time out will likely not be entertaining such long-term thinking come the weekend.\nInstead, he will surely view the much hyped visit from his old side as a potential spark in a season of struggle.\n\"As a coach, you have to believe the next one is going to be the game that is the watershed moment that will turn things around,\" said O'Sullivan.\n\"For him, it'll be trying to get a result which could flip that switch and energise the season.\n\"There'll be some mixed emotion, but at the end of the day, he's a professional coach, his only job is to try and beat Munster on the weekend.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/c05nzq2mr8po"}