{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:32:20", "date_modify": "2025-05-19 14:32:20", "date_publish": "2017-08-03 20:41:24", "description": "Wladimir Klitschko promised to retire if he lacked motivation and leaves boxing \"with nothing to prove\", says his manager.", "filename": "sport_boxing_40819187_1747665140.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0E74/production/_97200730_gettyimd.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_boxing_40819187_1747665140.html", "title": "Wladimir Klitschko: Manager Bernd Boente backs decision to end 21-year career", "title_page": "Wladimir Klitschko: Manager Bernd Boente backs decision to end 21-year career - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former world heavyweight champion Wladimir Klitschko retired because \"the fire wasn't there any more\", says his long-term manager Bernd Boente.\nKlitschko, 41, ended his 21-year professional career on Thursday, three months after losing to Briton Anthony Joshua in a thrilling bout at Wembley.\nThere had been reports, external the pair were close to agreeing a rematch.\n\"Wladimir has nothing to prove. He is one of the best heavyweights in the history of the sport,\" Boente said.\nSpeaking to BBC Radio 5 live, he added: \"He always said if I'm missing the motivation or health that I will retire.\"\nBoente said that, despite the decision, Ukrainian Klitschko still believed he could beat Joshua in that much-anticipated rematch, which many within the sport expected to take place in Las Vegas in November.\nBoxing record website BoxRec - which charts the progress of fighters - had even placed a 11 November rematch on the records of both men.\n\"The final decision was yesterday,\" added Boente. \"We met in a restaurant, we had dinner and then Wladimir said: 'I've listened to my stomach and my brain - and both tell me that this is it.'\n\"He said he'd had a fantastic career and didn't want to overdo it and that this is the right point. I definitely think that is the right decision and I support it 100%.\"\nKlitschko's accomplished career saw him follow Olympic gold in 1996 with a first world title in 2000 in his 36th bout as a professional.\nTwo defeats in 13 months between 2003 and 2004 prompted questions about his defensive skills but esteemed trainer Emanuel Steward helped banish any concerns.\nPrior to his death in 2012 after a battle with cancer - the year after Klitschko's father had died from the disease - Steward said his fighter would rank among the top 10 heavyweights in history.\n\"He has his jab and time has proven he has good stamina and unbelievable punching power all the way to the last minute,\" said Steward, who worked with 41 world champions in his career.\nKlitschko's run of 22 wins prior to defeat by Britain's Tyson Fury in 2015 earned him the WBO, WBA and IBF titles, though his dominance of the division was often set against critics describing his style as boring.\n\"He was probably taking what some fans thought were soft defences,\" said Eddie Hearn, promoter of Joshua. \"But Wladimir was dominating in an era where there weren't too many challenges to go through.\n\"The way he has acted - in and out of the ring, as an ambassador for charities and a real nice man - part of me is happy he can leave this sport with a healthy bank account and his health intact.\n\"And he can carry a legacy now, even though he lost at Wembley.\"\nDuring a career spanning 69 fights - of which 64 were wins - Klitschko mastered four languages and earned a PhD in sports science from the University of Kiev.\nArguably the only fight he avoided was a meeting to unify the division against his brother, Vitali, stating: \"It would break our mother's heart and no money could fix it.\"\nHis ability to communicate with poise and clarity endeared him to global media, with renowned ESPN boxing writer Dan Rafael quick to state Klitschko \"carried titles with class\" following the retirement.\nProvocation from the likes of David Haye, Dereck Chisora and Fury drew little reaction from 'Dr Steelhammer', who swore by a mantra of killing off emotions around a fight.\n\"Aggression means emotions and emotions mean you can lose the fight,\" Klitschko said in 2011. \"You have to be cold blooded.\"\nA picture of efficiency and humility, he has guarded his retirement plans for years, telling Time Magazine, external in 2012 he knew exactly what he will do post-boxing while refusing to share details.\nHis charitable foundation and motivational speaking commitments will undoubtedly receive more attention but, beyond that, the boxing public are in the dark.\n\"In the nearest future he will answer by himself about his further career plans,\" said Klitschko's elder brother. \"I am sure that he will be as successful as in sport.\"\nFive years must pass from retirement until a fighter enter's boxing's Hall of Fame. Vitali could be inducted in 2018 and his brother will likely join him in 2022.", "url": "https://www.bbc.com/sport/boxing/40819187"}