{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:25:55", "date_modify": "2025-05-20 13:25:55", "date_publish": "2023-08-02 06:57:52", "description": "Former Australian Open finalist Jennifer Brady marks her return to the WTA Tour after a two-year absence with victory over Anhelina Kalinina at the DC Open.", "filename": "sport_tennis_66380709_1747747555.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/93B3/production/_130611873_gettyimages-1567674620.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_tennis_66380709_1747747555.html", "title": "DC Open: Former Australian Open finalist Jennifer Brady makes winning return after two-year absence", "title_page": "DC Open: Former Australian Open finalist Jennifer Brady makes winning return after two-year absence - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Australian Open finalist Jennifer Brady marked her return to the WTA Tour after a two-year absence with a straight-set victory at the DC Open.\nThe 28-year-old American was sidelined by knee and foot injuries, falling from world number 16 to 1,056th during her recovery time.\nBack in action in Washington, Brady emphatically beat the 28th-ranked Anhelina Kalinina of Ukraine 6-2 6-1.\nShe will next face seventh seed Madison Keys, who is also her doubles partner.\n\"I'm pretty happy with the way I came out, handled my emotions, stayed true to my game plan and I was able to come out with a win,\" Brady said.\n\"Tennis is a part of who I am and I hope I never lose that. I'm happy to just be out here competing with the best.\"\nBrady retired against Jelena Ostapenko with a foot injury, later diagnosed as a torn plantar fascia, in the second round of the Western and Southern Open on 18 August 2021.\nA US Open semi-finalist in 2020, Brady reached the title match in Australia in 2021, losing to Naomi Osaka on both of those big occasions.\nShe played at an ITF World Tennis Tour $100,000 event in Canada two weeks ago to prepare for her WTA Tour return.\nOn Tuesday, it took her just one hour and eight minutes to clinch an opening victory over Kalinina, breaking her opponent's serve six times and winning 10 of the last 11 games.\nThat secured her best win by ranking since her Grand Slam final run in Australia.\nFormer US Open finalist Keys beat China's Zheng Qinwen 7-5 6-1 to set up a meeting with Brady, with whom she is through to the second round of the doubles competition.", "url": "https://www.bbc.com/sport/tennis/66380709"}