{"authors": ["Tom English", "www.facebook.com"], "date_download": "2025-05-19 14:54:45", "date_modify": "2025-05-19 14:54:45", "date_publish": "2017-08-11 06:08:44", "description": "Defending champions Celtic survive a late penalty claim to make it two wins out of two with a 1-0 victory over Partick Thistle at Firhill.", "filename": "sport_football_40822499_1747666485.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/96F0/production/_97304683_ntcham.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_40822499_1747666485.html", "title": "Partick Thistle 0-1 Celtic", "title_page": "Partick Thistle 0-1 Celtic - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Defending champions Celtic survived a late penalty claim to earn a 1-0 win over Partick Thistle at Firhill.\nOlivier Ntcham volleyed Celtic in front by virtue of a deflection off captain Scott Brown.\nKris Doolan passed up a golden opportunity to equalise when he put a free header over from close range.\nThere was late controversy when referee Andrew Dallas waved away strong shouts for a penalty after Nir Bitton appeared to shove Miles Storey in the box.\nBut Celtic, not at their fluid best, survived to maintain their winning start to the season and extend their unbeaten domestic run to 51 matches.\nThistle started one of their new signings, Conor Sammon, and the other, Storey came off the bench, as did Leigh Griffiths. James Forrest played through the middle until the striker made his appearance on the hour-mark.\nCeltic boss Brendan Rodgers said before kick-off that he was hopeful of bringing in another player, possibly even before the Astana game in the Champions League on Wednesday night.\nCeltic have been pushing hard to resign Patrick Roberts from Manchester City, a player whom the visiting support adore and a man whose name they chanted during the game.\nWas Rodgers referring to Roberts when talking about a new arrival? He wouldn't say. How Celtic people will hope that he comes back. How the rest of Scottish football will sigh if he does. It's hard enough to lay a glove on Rodgers' team as they are.\nThe Jags were one of the few sides who had any joy from Celtic last season in domestic competition, taking a 1-1 draw away from Parkhead. The last time they were at Firhill, of course, Celtic won 5-0, and they started off brightly here again, without ever hitting full stride.\nFilling in for Griffiths, Forrest had two early chances to opening the scoring, his first effort beaten away well by Tomas Cerny, his second driven wide of goal. The Jags' goalkeeper then made a fine save from a thumping Bitton free-kick.\nCeltic got their breakthrough when Jordan Turnbull's header was volleyed goalwards by Ntcham, the ball deflecting past Cerny off what Thistle claimed was the arm of Brown, not that Brown knew anything about it.\nHe turned his body away from Ntcham's shot and the ball looked to come off him and find the net. Had it not, Cerny would probably have dealt with it comfortably enough.", "url": "https://www.bbc.com/sport/football/40822499"}