{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:50:04", "date_modify": "2025-05-21 06:50:04", "date_publish": "2025-04-02 00:00:00", "description": "Marcus Rashford's first Premier League goal for Aston Villa sets them on the way to victory at Brighton.", "filename": "sport_football_live_c80y011dy59t_1747810204.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4c56/live/34269c50-1002-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c80y011dy59t_1747810204.html", "title": "Brighton & Hove Albion 0-3 Aston Villa: Marcus Rashford sets Villa on way to victory", "title_page": "Brighton & Hove Albion 0-3 Aston Villa: Marcus Rashford sets Villa on way to victory - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Marcus Rashford's revival continued as he set Aston Villa on the way to a comprehensive victory at Brighton.\nRashford, on loan from Manchester United, scored his first two Villa goals in their FA Cup quarter-final win at Preston North End on Sunday.\nAnd the England forward was on the mark for the first time in the Premier League for Villa with a composed finish after a counter-attack from a Brighton corner six minutes after half-time.\nBrighton thought they had mounted an instant response when Simon Adingra scrambled home from close range, but the goal was disallowed for Kaoru Mitoma's handball in the build-up.\nVilla wrapped up the win 12 minutes from time when Marco Asensio, on loan from Paris St-Germain, was the beneficiary of unselfish work from Morgan Rogers to beat Bart Verbruggen with an emphatic drive.\nIn the dying moments of 10 added minutes, Villa added a third when another substitute, Donyell Malen, fired across Verbruggen for his first goal for the club.\nIt was a result that hurt Brighton's European ambitions, but keeps Villa in the hunt for a top-four place - with an FA Cup semi-final against Crystal Palace at Wembley and a Champions League quarter-final against PSG to come.\nRashford's renaissance at Aston Villa has been slow and steady under the shrewd guidance of manager Unai Emery, as he rebuilt the forward's confidence and self-belief after being exiled under Ruben Amorim at Manchester United.\nAfter winning an England recall, Rashford rediscovered his goalscoring touch with a double at Deepdale, and his increasing self-belief was on show again at The Amex Stadium.\nThe 27-year-old showed high-quality touches in the first half, when he troubled the Brighton defence from wide positions - drawing regular applause and encouragement from Emery on the sidelines.\nEmery is renowned for his ability to improve players, restoring them when confidence is lost - and Rashford showed he is doing it again, demonstrating he still possesses class with the manner in which he broke the deadlock in a tight encounter.\nVilla caught Brighton from their own corner, and the finish never looked in doubt as Rashford raced from his own half, with defenders in vain chase, before lifting the ball coolly over Verbruggen as he came out.\nHe received a standing ovation from the travelling Villa fans when removed after 65 minutes, taking another step on his road to footballing recovery away from Old Trafford.\nIt was also a night when Emery's changes did the trick, with substitutes Asensio and Malen, a £19m January signing from Borussia Dortmund, also getting on the scoresheet.\nBrighton's fans delivered a smattering of boos when the final whistle sounded on a damaging defeat at The Amex Stadium.\nIt was more an expression of frustration than fury, this disappointing result following hot on the heels of Saturday's FA Cup quarter-final loss on penalties to Nottingham Forest.\nThe rigours of extra time and penalties, as well as the result, looked to have taken its toll on Brighton as they struggled for spark before running out of steam, ending well-beaten.\nThe scoreline was harsh but Villa fully merited the win, which puts them above Brighton into seventh place in the Premier League table.\nBrighton were offered brief hope when Adringra bundled home what they thought was an equaliser, shortly after Rashford opened the scoring, but it was correctly disallowed for Mitoma's handball.\nVilla then made the most of their reprieve to eventually overpower a tiring Brighton.", "url": "https://www.bbc.com/sport/football/live/c80y011dy59t"}