{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:59:49", "date_modify": "2025-05-21 03:59:49", "date_publish": "2025-02-01 15:20:36", "description": "Nottingham Forest 7-0 Brighton: Elanga and Wood 'work so hard for us'", "filename": "sport_football_articles_cz6py14yyvjo_1747799989.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/94db/live/b6415bd0-e0af-11ef-a544-6d6714619779.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cz6py14yyvjo_1747799989.html", "title": "Nottingham Forest 7-0 Brighton: Elanga and Wood 'work so hard for us'", "title_page": "Nottingham Forest 7-0 Brighton: Elanga and Wood 'work so hard for us' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Nottingham Forest captain Morgan Gibbs-White has been praising some of his team-mates on TNT Sports.\nSpeaking about Anthony Elanga's peformance, Gibbs-White said: \"He is incredible. He is incredibly fast, so you just know to put it in the space and he will get there. He has been really knuckling down on his end product this year, and it has been incredible.\n\"As you can see today, he has got three assists - so credit to him. I think he deserves a little bit more credit than what he has been getting because he works so hard on and off the pitch.\"\nOn Chris Wood's performance, Gibbs-White added: \"He is just one of those strikers that you know where he is going to be and where he wants to receive the ball. This season, he has just been so clinical. He is a real delight to play with.\n\"Off the ball, he works so hard for us. I don't think people notice that as much and that is one of his main strengths. He never gives up and is always fighting for any little tap in, and those are the best goals.\n\"He is mature and he is sensible. He is someone [in the dressing room] that you go to if there needs to be questions asked.\"", "url": "https://www.bbc.com/sport/football/articles/cz6py14yyvjo"}