{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:16:51", "date_modify": "2025-05-21 04:16:51", "date_publish": "2025-04-05 00:00:00", "description": "Live text commentary as the Belfast Giants face the Nottingham Panthers at the SSE Arena, Belfast plus updates from Sheffield Steelers against the Cardiff Devils", "filename": "sport_ice-hockey_live_c62x53qzg64t_1747801011.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a5a8/live/dbcf1260-0e32-11f0-ac9f-c37d6fd89579.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_ice-hockey_live_c62x53qzg64t_1747801011.html", "title": "Elite League title chase", "title_page": "Elite League title chase - Belfast v Nottingham plus updates from Sheffield v Cardiff - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Title race goes to the final day\nSheffield win the shootout against Cardiff which takes the race to the final day of the season.\nA win for the Giants secures the title.\nA defeat and a win for Sheffield would see the Steelers clinch the championship.\nIt’s going to be a tense and thrilling finish.\nBoth games - Panthers v Giants and Coventry v Steelers face-off at 5.30pm and we’ll be back with all the updates you’ll need as the title race comes to a conclusion.\nSee you then….\nWhistle keeps the Giants ahead at the end of the period\nBelfast Giants 1-0 Nottingham Panthers\nJackson Whistle with a fantastic double save in the closing seconds of the period.\nHe pads away a shot from the point but straight to Quinn Wichers but Whistle recovers to make a stick save\nThe Giants sat back in the second period, they have to find a way to raise the tempo again in the final 20 minutes.\nScott Conway had to leave the ice after blocking a shot. It looks serious and he hasn’t returned which is a huge blow.\nThe Devils still ahead 2-1 in Sheffield.\nGiants lead after first period; Still scoreless in Sheffield\nBelfast Giants 1-0 Nottingham Panthers\nGiants worthy of their lead at the end of the first period. They’ve almost had a second goal on a couple of occasions while offensively the Panthers have had nine shots but none have bothered Jackson Whistle all that much.\nThe game between Sheffield and Cardiff remains scoreless but started a few minutes after this one in Belfast", "url": "https://www.bbc.com/sport/ice-hockey/live/c62x53qzg64t"}