{"authors": ["Kheredine Idessane", "www.facebook.com"], "date_download": "2025-04-26 08:06:02", "date_modify": "2025-04-26 08:06:02", "date_publish": "2025-02-26 15:15:32", "description": "Relentless Celtic five wins from title", "filename": "sport_articles_c778r08kr8jo_1745654762.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7a6a/live/31c977b0-f451-11ef-896e-d7e7fb1719a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_c778r08kr8jo_1745654762.html", "title": "Relentless Celtic five wins from title", "title_page": "Relentless Celtic five wins from title - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "It's long since been a case of when, not if, Celtic secure yet another Scottish Premiership title.\nThe gap at the top is currently 16 points. Barry Ferguson could well reduce that in his first game in charge of Rangers. Even if he does, the championship is a done deal.\nIt will be Celtic's 13th in 14 years. A period of sustained dominance without precedent in the history of the Scottish game.\nThey are strong favourites to wrap up all three domestic prizes in what would be their sixth treble in nine seasons. It's not particularly healthy for the wider game but that's not Celtic's problem.\nTheir main concern now, you would think, is timing: How soon can they officially have the green and white ribbons ordered to adorn their favourite prize?\nThey've already amassed 72 points. With 10 games to go, they could well hit the century mark. They can even afford a draw along the way.\nOn the evidence of Tuesday night's dismantling of Aberdeen, the portents look pretty good. Celtic were nowhere near their top level against the third-place team and still added five goals to a Premiership tally that has risen to an impressive 82.\nBrendan Rodgers' men have only lost twice in the league all season and if the manager can ramp up the intensity levels for one last push, it could all be done and dusted before the top-flight split.\nCeltic only have two away fixtures before that point - at St Mirren and St Johnstone - with league games at home in between against Rangers and Hearts. Win all those, and Celtic would welcome Kilmarnock on 12 April for a potential title party. With five games to spare.\nThis is assuming, of course, that Rangers pile up some points under the interim Ferguson regime. If they don't, it could all be over even sooner, making a rebuild at Rangers all the more pressing if there's to be a more competitive Premiership in the near future.\nThe problem for everyone at Ibrox, however, is that Celtic continue to operate from a position of strength which shows no sign of weakening any time soon.", "url": "https://www.bbc.co.uk/sport/articles/c778r08kr8jo"}