{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:25:23", "date_modify": "2025-05-21 07:25:23", "date_publish": "2025-03-28 15:00:05", "description": "Wales centre Eddie James signs a new contract to remain with Scarlets.", "filename": "sport_rugby-union_articles_clyrygde2mzo_1747812323.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/990b/live/a4ca6190-0bdd-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_clyrygde2mzo_1747812323.html", "title": "Eddie James: Wales centre signs new Scarlets deal", "title_page": "Eddie James: Wales centre signs new Scarlets deal - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wales international Eddie James has signed a new contract to extend his stay with Scarlets.\nThe 22-year-old - who has featured 37 times for the west Wales region - joins the likes of Macs Page, Tomi Lewis and Joe Roberts in agreeing a new deal at Parc y Scarlets.\n\"My dad used to bring me here to watch the Scarlets, so to come through the age grades with my mates, be part of the academy and now the senior squad has been amazing,\" said James.\n\"We have such a young team, an exciting set of backs, the future looks bright.\n\"We are building as a squad. We have made good strides from last season and after starting this season well, hopefully we can finish it strongly.\"\nJames - who played junior rugby with Carmarthen Quins - scored a try against Edinburgh on his senior Scarlets debut at the start of the 2022-23 campaign.\nHe won the first of his four Wales caps against South Africa last summer and most recently featured for his country against Italy in the Six Nations.\n\"It is easy to forget that Eddie is still only 22. He is a player of real quality, strong, with great hands and he has produced some standout displays for us in the last couple of seasons,\" said Scarlets head coach Dwayne Peel.\n\"Like a lot of players here, Eddie is from the region, has come through the pathway and academy to graduate to the senior squad.\n\"The great thing is, there is still a lot more to come from him. He has already been part of the national squad and I am sure he will be part of that for a long time. We are putting together an exciting young squad here and Eddie is going to be a big part of that.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/clyrygde2mzo"}