{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:51:23", "date_modify": "2025-05-21 06:51:23", "date_publish": "2025-03-29 22:16:37", "description": "Tyrone are relegated to Division Two of the Ladies Football League after losing out 4-10 to 2-8 against Kildare at Newbridge.", "filename": "sport_articles_cvgprkl737xo_1747810283.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f5ca/live/53e24130-0ceb-11f0-a888-d5a5e1f2ffcf.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cvgprkl737xo_1747810283.html", "title": "Tyrone relegated from Division One after Kildare defeat", "title_page": "Ladies Football League: Tyrone relegated from Division One after Kildare defeat - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tyrone have been relegated to Division Two of the Ladies Football League after losing out 4-10 to 2-8 against Kildare at Newbridge.\nThe sides were level three times in a close first half before Tyrone went in 1-4 to 1-3 in front at the break.\nThe Lilywhites netted first through Aoife Murnane before Chloe McCaffrey's deflected free found the Kildare net.\nKildare equalised on the restart before Róisín Byrne scored the first of her three goals with her second coming from a free on 37 minutes.\nByrne completed her hat-trick three minutes later when she flicked into the net from Gillian Wheeler's long punt.\nTyrone substitute Aoife McGahan netted on the stroke of full-time but the Ulster side fell well short and will be playing in Division Two next year.\nMeanwhile, Armagh were beaten 2-12 to 4-5 by Meath in a Division One dead rubber at the Athletic Grounds.\nThe Orchard side had already secured a place in the final before Saturday's encounter.\nGoals from Niamh Coleman, Kelly Mallon and Aoife McCoy helped Armagh to a 3-3 to 0-6 half-time lead.\nSubstitute Caoimhe McNally added Armagh's fourth goal but Meath hit back with Ciara Smyth netting before they levelled through Emma Duggan's goal.\nMeath clinched victory when Duggan slotted over a free with the final play of the match.", "url": "https://www.bbc.com/sport/articles/cvgprkl737xo"}