{"authors": ["Sami Mokbel", "www.facebook.com"], "date_download": "2025-05-21 08:02:10", "date_modify": "2025-05-21 08:02:10", "date_publish": "2025-05-19 16:01:21", "description": "Wales assistant coach Piet Cremers is a strong contender to fill a key vacancy at Club Brugge ahead of next season.", "filename": "sport_football_articles_cdxvng2epnno_1747814530.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c90d/live/3aceee50-34aa-11f0-96c3-cf669419a2b0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cdxvng2epnno_1747814530.html", "title": "Piet Cremers: Wales assistant coach linked with Club Brugge role", "title_page": "Piet Cremers: Wales assistant coach linked with Club Brugge role - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wales assistant coach Piet Cremers has emerged as a candidate to fill a key vacancy at Club Brugge but has reservations about taking the job in Belgium.\nHe is currently working under head coach Craig Bellamy with the Welsh national team, but he has been linked to take up a position with the Belgian top-flight club's reserve side Club NXT - who play in the second tier.\nIt is understood the role could eventually open the prospect of Cremers becoming Brugge's senior head coach.\nCremers is currently preparing for Wales' World Cup qualification double header at home to Liechtenstein on 6 June and away to Belgium three days later. But despite the opportunity to take his first step as a head coach, it is understood he is minded to stay in his current role under Bellamy.\nNevertheless, Club Brugge have identified the Dutchman for a possible role within their set-up.\nAt just 30, Cremers is developing a reputation as one of the most exciting young coaches in British football.\nHaving already worked under Pep Guardiola at Manchester City and Vincent Kompany at Burnley, Cremers already has extensive experience of working alongside top coaches.\nHe was one of Guardiola's top analysts at the Etihad Stadium, playing a role in four Premier League title wins.\nUpon leaving his role as head of analysis and insights at City, Cremers took up the position as assistant coach under Kompany at Turf Moor - where he was integral in the club's 2023 promotion into the Premier League as champions with a points total of 101.\nAt the time, Bellamy was also at Burnley and the pair formed a close relationship.\nIndeed, Bellamy's appointment as Wales head coach in the summer of 2024 saw Cremers join up with the former Liverpool and Newcastle United striker in the national team set-up.\nIn November, when asked what Cremers added to his team, Bellamy replied: \"Everything. The year we had at Burnley was down to him.\n\"We murdered the league and it was that. It hadn't been done before.\n\"Piet really pushed us towards this way. Vinny was always very intelligent about sounding out the best people.\n\"He brought Piet into our world then and it was just like 'wow', he moved so many different areas for us.\"\nThe success Cremers has already enjoyed during the early days of his club career has followed him into international football.\nWales are unbeaten since Bellamy and Cremers arrived; the team have won four and drawn four of their eight matches in charge so far.", "url": "https://www.bbc.com/sport/football/articles/cdxvng2epnno"}