{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:14:32", "date_modify": "2025-05-20 12:14:32", "date_publish": "2023-08-04 16:34:01", "description": "British light-welterweight Jack Catterall will face three-weight world champion Jorge Linares at Liverpool's M&S Bank Arena on 21 October.", "filename": "sport_boxing_66406335_1747743272.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2DAE/production/_130649611_bbc-sport-index-imagery-2-split-images-gradient-e02813f0-b688-44a2-9d49-24933b506c56.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_boxing_66406335_1747743272.html", "title": "Jack Catterall to fight three-weight world champion Jorge Linares in Liverpool", "title_page": "Jack Catterall to fight three-weight world champion Jorge Linares in Liverpool - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "British light-welterweight Jack Catterall will face three-weight world champion Jorge Linares at Liverpool's M&S Bank Arena on 21 October.\nCatterall, 30, returns to the ring after beating Darragh Foley in May.\nHe is targeting a world-title shot, or a rematch with Josh Taylor, but says he is not overlooking Venezuela's Linares.\n\"There is talk of a huge fight for me after this, but it'll count for nothing if I take my eye off the ball,\" Catterall said.\nThe Chorley fighter has won 27 bouts since turning professional, with his one defeat being a controversial points loss to Scotland's Taylor in February 2022.\nMany ringside observers and fans scored Catterall as the clear winner in his challenge for Taylor's undisputed light-welterweight crown.\nA scheduled rematch was cancelled after an injury to Taylor, before Catterall signed with Eddie Hearn's Matchroom Boxing and ended a 15-month absence with a comfortable win over Foley in Manchester.\n\"It's no secret my career has lacked momentum, so after boxing in May and now October I genuinely believe you'll see the best version of me,\" Catterall added.\nAccording to reports, lightweight champion Devin Haney will move up a division to face WBC light-welterweight champion Regis Prograis, and Catterall would welcome a shot at the winner if the Taylor rematch again fails to materialise.", "url": "https://www.bbc.com/sport/boxing/66406335"}