{"authors": ["Nigel Ringland", "www.facebook.com"], "date_download": "2025-05-20 14:34:06", "date_modify": "2025-05-20 14:34:06", "date_publish": "2023-07-28 19:20:05", "description": "Ireland secure their place at the Olympic Qualification Tournaments after a 4-1 win over Scotland in the EuroHockey II semi-finals in Dublin.", "filename": "sport_hockey_66333355_1747751646.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/A8BD/production/_130579134_eloc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_hockey_66333355_1747751646.html", "title": "EuroHockey II: Irish beat Scots to earn spot in Olympic qualifiers", "title_page": "EuroHockey II: Irish beat Scots to earn spot in Olympic qualifiers - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ireland secured their place at the Olympic Qualification Tournaments after a 4-1 win over Scotland in the EuroHockey II semi-finals in Dublin.\nWith only two places available in the tournament, this was a massive game for Mark Tumilty's side.\nLee Cole struck twice for the hosts from penalty corners while Jeremy Duncan and Ben Johnson also netted.\nIreland will meet Ukraine in Saturday's final after they defeated Italy in a shootout.\nAn exciting game finished 3-3 in normal time with Ukraine edging the penalty run-ins 4-3 to secure their place in the Olympic qualifiers. The two sides met earlier in the week in the Pool stages with Ireland winning 7-0.\nThe victory over Scotland on Friday saw the Irish achieve the first of two targets for this week.\n\"That's been our goal for the last 12 months - to get the job done, to secure that Olympic qualifier place next January is one target, now we want to go on and win the tournament on home turf,\" explained Tumilty.\nIreland were guilty of throwing a number of inaccurate overheads and despite some penetrating circle entries from Michael Robson and Johnny McKee they failed to work goalkeeper Thomas Alexander, even from two penalty corners.\nScotland forced Davy Harte into two important saves as they grew in confidence in what was rapidly becoming a tight contest and where the first goal would be so important.\nTumilty added: \"We tried to force too much in the first half. We wanted to win the game too easily and we had a chat at half-time about showing some more composure and keeping possession and going through phases of play and we executed the game plan in the second half.\"\nWhatever Tumilty said, it took only 25 seconds to have an effect when Duncan swept home the opening goal of the game.\nIt lifted the shackles for the Irish and they began to dominate possession. McKee's ball into the circle was perfect for Johnson to double the home side's advantage.\nThe Irish penalty corner routine has been firing on all cylinders throughout the tournament and Cole added a pair of conversions in the fourth quarter to take the game away from the Scots.\nHowever, the visitors did have the consolation of converting a superbly worked penalty corner near the end from Alan Forsyth.\nIreland will now turn their attention to picking up some ranking points and winning a tournament in front of their home support on Saturday.\n\"We've got to realise that we want to win every time we put an Irish shirt on, and we will have matches in preparation for the Olympic qualifiers so the final here in the first step towards that - we have to win, and we have to produce a performance as well,\" said Tumilty.\nThe Olympic qualifiers in January will be held in Valencia and Lahore with eight countries in each tournament. Ireland will find out which one they will be in at the end of the Continental Championships in November.", "url": "https://www.bbc.com/sport/hockey/66333355"}