{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:39:07", "date_modify": "2025-05-21 03:39:07", "date_publish": "2025-04-08 00:00:00", "description": "Cardiff City claim what may prove a vital point in the Championship relegation fight as Yakou Meite's stoppage-time goal secures a dramatic 2-2 draw at Preston North End.", "filename": "sport_football_live_cewgx22e29qt_1747798747.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5d0f/live/2905dd30-14bd-11f0-8a1e-3ff815141b98.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cewgx22e29qt_1747798747.html", "title": "Preston North End 2-2 Cardiff City: Meite's last-gasp goal earns dramatic draw", "title_page": "Preston North End 2-2 Cardiff City: Meite's last-gasp goal earns dramatic draw - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cardiff City claimed what may prove a vital point in the Championship relegation fight as Yakou Meite's stoppage-time goal secured a dramatic 2-2 draw at Preston North End.\nMilutin Osmajic had drilled Preston into an early lead as Cardiff paid the price for a dispiriting first-half display.\nSubstitute Will Alves sparked a Bluebirds revival after the break, the on-loan Leicester City teenager scoring his first senior goal as his shot deflected beyond Preston keeper Dai Cornell.\nPreston reasserted their control of the contest in the final quarter, and looked destined for victory after Stefan Thordarson's header restored the home side's advantage.\nBut in the fourth minute of added time, substitute Meite stole in at the back post to guide in Cardiff's second equaliser.\nCardiff remain in the relegation places, though the nature of the draw should lift Omer Riza's players as they prepare for a potentially key game against fellow strugglers Stoke City on Saturday.\nIt is now four matches unbeaten for Riza's team, though this was a third successive draw.\nPreston, one of the division's draw specialists this season, stay 14th and are destined for a mid-table finish having won only one of their past eight league games.\nCardiff's urgent need for points was barely in evidence during a first period in which they were outbattled and outplayed.\nWhat was on display was the defensive vulnerability which has been such an issue this season, with Will Fish's attempt to turn in his own box almost presenting Preston with an opener, only for Will Keane's precise finish to be ruled out for offside.\nRiza's rearguard were soon opened up once more, as Dimitrios Goutas stretched to cut out Mads Frokjaer's through ball but only succeeded in teeing up Osmajic to drive a shot past Ethan Horvath at the near post.\nPreston North End boss Paul Heckingbottom told BBC Radio Lancashire:\n\"I feel a lot different in terms of performance to what I did at the weekend.\n\"You get punished when you switch off. I did feel comfortable in us seeing the game out. We switched off, left him, it's an error, but we did more than enough at the other end so we can't just look at that one error.\n\"It's a frustrating one but I'm pleased with the performance. Lots of things about it I really enjoyed.\"\nCardiff City manager Omer Riza told BBC Radio Wales:\n\"First half we weren't good enough, nowhere near it. First and second balls, again off the pace. We didn't press, didn't cover space, we didn't do anything really.\n\"Anything we spoke about we didn't do, which was disappointing.\n\"But second half I thought we addressed it. We made the changes that we needed to liven it up a little bit and my players are showing fight. I think that's what's important.\n\"They worked really hard second half. We have managed to get a point out of it and we have to take that. I think it's an important point looking at the other results today.\"", "url": "https://www.bbc.com/sport/football/live/cewgx22e29qt"}