{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:38:53", "date_modify": "2025-05-21 06:38:53", "date_publish": "2025-04-01 00:00:00", "description": "Real Madrid keep their Treble hopes alive in extraordinary fashion as Antonio Rudiger heads home an extra-time winner against Real Sociedad to reach the Copa del Rey final.", "filename": "sport_football_live_cg5d582nl4gt_1747809533.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c4f9/live/da23b630-0f4c-11f0-ba12-8d27eb561761.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cg5d582nl4gt_1747809533.html", "title": "Real Madrid 4-4 Real Sociedad (5-4 on aggregate): Antonio Rudiger scores winner in Copa del Rey semi-final", "title_page": "Real Madrid 4-4 Real Sociedad (5-4 on aggregate): Antonio Rudiger scores winner in Copa del Rey semi-final - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Real Madrid kept their Treble hopes alive in extraordinary fashion after Antonio Rudiger headed home an extra-time winner against Real Sociedad to book their place in the Copa del Rey final.\nSubstitute Rudiger climbed highest to meet Arda Guler's 115th-minute corner to flick a header beyond visiting keeper Alex Remiro, sparking wild celebrations from the home fans.\nIn a terrific end-to-end second half, five goals were scored in 21 minutes as both sides looked to confirm their spot in the Seville showpiece.\nWith a 1-0 deficit to overcome from the first leg, Sociedad struck in the 16th minute through Ander Barrenetxea.\nBut teenage Brazilian striker Endrick put the Madrid outfit back in front on aggregate with a fine chip for the 30th-minute leveller.\nA David Alaba own goal in the 72nd minute again put the visitors ahead on the night and sparked an incredible scoring spree in an amazing climax.\nMikel Oyarzabal made it 3-1, and 3-2 on aggregate, to Sociedad eight minutes later with a low drive that also struck Alaba, but England midfielder Jude Bellingham restored parity moments later with a lovely volleyed finish.\nAurelien Tchouameni thought he had headed Carlo's Ancelotti's side into the final in the 86th minute after a horrible attempt to save from goalkeeper Remiro.\nThe drama was not finished there as Sociedad captain Oyarzabal rose highest to power in a header in added time to put his side back ahead, forcing extra time at the Bernabeu.\nBut Rudiger broke their hearts in the extra period to make it 5-4 on aggregate.\nMadrid's pursuit of a first Treble still remains possible as they sit three points behind La Liga leaders Barcelona, face Arsenal in the Champions League quarter-finals and are looking to win the Copa del Rey for a 21st time.\nBarcelona visit Atletico Madrid on Wednesday to determine who will play Real Madrid in the final, with their last-four tie also finely poised after an enthralling 4-4 first-leg draw.", "url": "https://www.bbc.com/sport/football/live/cg5d582nl4gt"}