{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:08:03", "date_modify": "2025-05-21 06:08:03", "date_publish": "2025-04-01 18:48:17", "description": "Dundee United can achieve 'something special', says Goodwin", "filename": "sport_articles_cde2n9rdjzyo_1747807683.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/74ff/live/643d7050-0e61-11f0-b9e7-859c4282fe02.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cde2n9rdjzyo_1747807683.html", "title": "United can achieve 'something special', says Goodwin", "title_page": "Dundee United can achieve 'something special', says Goodwin - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Dundee United manager Jim Goodwin reckons his side have given themselves \"a great chance of achieving something special\" in the Premiership this season.\nUnited, who were promoted last summer, have not dropped out of the top half all season.\nThey all but secured a top-six finish with two games to spare thanks to victory at Ross County on Sunday and Goodwin now hopes they can take full advantage.\n\"We set ourselves a target at the beginning of the season of 45 points. We believed that was going to be the number [for top six], and it looks like that is going to be the magic number,\" he said.\n\"We're one point off of that with two games to go [before the split], and we've given ourselves a great chance.\n\"We've not been out of the top six all season. I think way back at the beginning of the season, we would have wanted enough points to make sure we avoided the mess at the bottom of the table.\n\"But because we've been in the top six for as long as we have, the expectations grow and people get greedy, and that's what's happened.\n\"The criticism that we've had over the last few weeks has been justified. We put ourselves out there, I make decisions, sometimes they don't work and I take the criticism on the chin.\n\"But we've given ourselves a great chance of achieving something special, I think, for a newly-promoted team.\"", "url": "https://www.bbc.com/sport/articles/cde2n9rdjzyo"}