{"authors": ["Thomas Woods", "www.facebook.com"], "date_download": "2025-05-21 06:34:26", "date_modify": "2025-05-21 06:34:26", "date_publish": "2025-03-31 05:26:37", "description": "This is one Fantasy Premier League week where you might consider an alternative to Mohamed Salah as captain, writes Thomas Woods.", "filename": "sport_football_articles_c62xep510wyo_1747809266.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0090/live/8daa0360-0db0-11f0-ac9f-c37d6fd89579.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c62xep510wyo_1747809266.html", "title": "FPL gameweek 30 tips: Omar Marmoush captain ahead of Mohamed Salah this week", "title_page": "FPL gameweek 30 tips: Omar Marmoush captain ahead of Mohamed Salah this week - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "This is the first Fantasy Premier League gameweek in a while where I am confident going against Mohamed Salah as captain.\nThat might seem daft to say if you look at the Egyptian's past seven scores - 16, 13, 8, 12, 14, 6, 15.\nBut he has only scored in one of his past five matches in all competitions, has been quiet in those fixtures and faces a Merseyside derby - which always has the capacity to turn into a tight game.\nMeanwhile, Manchester City face whipping boys Leicester City and, with Erling Haaland almost certainly out, it is a massive chance for their hot new striker Omar Marmoush to bag a hatful.\nThis would be a slightly easier call if Haaland - who hobbled out of City's FA Cup win at Bournemouth with his ankle in a protective boot - was fit.\nSix months ago, nine out of 10 FPL players would have captained Haaland over Salah in this fixture scenario.\nSo you should back his deputy with confidence - Marmoush had 15 goals in 17 Bundesliga games this season and has scored four in seven league matches for City so far.\nThe team of the week is selected based on current FPL prices to fit within a £100m budget, as if you were playing a Free Hit.\nDavid Raya, Arsenal, keeper, £5.5m - Fulham (h)\nRaya has four clean sheets in his past seven and Arsenal have the second-most clean sheets (11) this season. There could be a few clean sheets knocking about this week and this game is one of them.\nJosko Gvardiol, Manchester City, £6m - Leicester City (h)\nI know City can't keep a clean sheet this season but surely they will against a Leicester team who have scored in only three of their past 14 matches.\nThat's awful from the Foxes and Gvardiol could pop up with a goal and give you a 15-pointer.\nRuben Dias, Manchester City, £5.4m - Leicester City (h)\nDouble Manchester City defence this week for the reasons mentioned above. Dias has started the past three league games and appears to be first choice again.\nIf we're looking for a cheeky attacking return on top of a likely clean sheet, then Dias feels like the next best bet in City's defence.\nNo, he hasn't scored in the league in two seasons! But in 2021-22 he had seven attacking returns. There's a time for every drought to end.\nJarell Quansah, Liverpool, £3.9m - Everton (h)\n£3.9m for a piece of defence that has kept the most clean sheets this season is a major bargain.\nDerby games can go two ways but Liverpool are at home against Everton. They should dominate, will expect to win and could easily keep their rivals out.\nMilos Kerkez, Bournemouth, £5.2m - Ipswich (h)\nThe Hungarian is rolling at the moment with assists in his past three games. No clean sheets in that time but if he can put the two together he'll have a haul.\nBournemouth's stout home defensive record has disappeared, but Ipswich present a good chance to put things right.\nMohamed Salah, Liverpool, £13.7m - Everton (h)\nSalah is in without the armband this week. If you are going to follow my advice and bet against him you're just hoping he has a \"quiet\" game - which for him means just one goal or maybe even just an assist!\nJustin Kluivert, Bournemouth, £6.3m - Ipswich (h)\nOn paper, this should be a great game for Bournemouth attacking assets but they have tailed off recently.\nOn top of that, their FA Cup tie against Manchester City on Sunday means this game feels prime for at least a couple of players being rotated by Andoni Iraola.\nAnd that makes every Bournemouth player a slightly risky pick, but with Kluivert in form and on penalties, I'm punting on him.\nIsmaila Sarr, Crystal Palace, £5.7m - Southampton (a)\nSarr has 26 points in his past two games and, with Jean-Philippe Mateta likely to be back up front, Palace will fancy a handsome win against struggling Saints.\nSenegal midfielder Sarr is very efficient - he's had 43 shots this season (team-mate Eberechi Eze has taken 83) yet more than half (24) have been on target, which is the most by any Palace player.\nOnly Salah and Cole Palmer have had more big chances from midfield.\nChristopher Nkunku, Chelsea, £5.7m - Tottenham (h)\nNkunku is showing glimpses of what many FPL players thought he'd offer coming into the season.\nIn the past four games, only Palmer has had more shots in the box for Chelsea than Nkunku.\nThe Frenchman only has one goal in that time but this week should start against a Spurs side who have lost their past three games to Chelsea, conceding 10.", "url": "https://www.bbc.com/sport/football/articles/c62xep510wyo"}