{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:19:04", "date_modify": "2025-05-21 07:19:04", "date_publish": "2025-05-20 08:47:55", "description": "Carlisle United manager Mark Hughes will remain with the club after their relegation from League Two to the National League.", "filename": "sport_football_articles_c20nn6ez0rro_1747811944.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c0fd/live/e87b31a0-3557-11f0-b7a7-db7402bc2830.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c20nn6ez0rro_1747811944.html", "title": "Mark Hughes: Carlisle United boss agrees to stay on in National League", "title_page": "Mark Hughes: Carlisle United boss agrees to stay on in National League - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Carlisle United manager Mark Hughes will remain with the club following their relegation from League Two to the National League.\nHughes took over at Brunton Park in February after Mike Williamson was sacked, with Carlisle five points from safety and 18 games remaining.\nThe former Wales, Manchester City and Fulham boss could not keep the club in the league, however, and they were finally relegated after defeat at Cheltenham Town in their penultimate game of the season.\n\"Since joining back in February, the support I've received from the fans has been exceptional - thank you,\" Hughes told the club website, external.\n\"I hope to see more of the same next season as we aim for an immediate return to the EFL.\"\n\"Mark brought the squad together during the closing stretch of the season and gave us a fighting chance,\" chairman Tom Piatak added.\n\"His leadership, composure, and connection with the players was clear, and we're confident in his ability to lead us forward.\"\nDespite their relegation, Hughes reinvigorated his side for the end-of-season run-in as they lost just once at home under his tenure and won three consecutive games for the first time in more than two years.\nA run of 10 points from four games in April came too late to pull them out of trouble, however, with Hughes wanting to remain in post despite the drop into non-league football.\nNews of Hughes' continuing in the job is the latest in a busy few weeks at the club since relegation was confirmed.\nPrevious sporting director Rob Clarkson departed less than 48 hours after Carlisle's fate was sealed.\nMarc Tierney has been brought in from Altrincham as the Blues' new head of football operations, while Greg Abbott, a former manager at Brunton Park, has now left the club after three years as head of recruitment as the club seek to prepare for their first spell in the National League since 2005.\nAnalysis - BBC Radio Cumbria sports editor Paul Newton\nHe may not have been able to keep Carlisle United up – and there are some in the fanbase who feel he had enough time to do so – however, the retention of Mark Hughes has been roundly welcomed in the city.\nCarlisle were a mess on the pitch when he took over in February. Hughes was quick to recognise an unfit, top-heavy squad and was ruthless where needed.\nPerformances and, to an extent, results did improve towards the back end of the campaign while Hughes was also able to forge a connection with a fractious and disconnected fanbase.\nWhile those are clear positives to his appointment, there are negatives given a lack of experience managing at National League level and no promotion to his name.\nCarlisle's significant financial backing under their American owners, the Piatak family, will mean there is an expectancy for United to bounce back at the first attempt.\nWhether Hughes can deliver that remains to be seen.", "url": "https://www.bbc.com/sport/football/articles/c20nn6ez0rro"}