{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:22:16", "date_modify": "2025-05-21 05:22:16", "date_publish": "2025-04-03 16:02:43", "description": "You can watch six games from the 2025 Ulster Championship live on BBC iPlayer and BBC Two NI - here is all you need to know.", "filename": "sport_articles_cwy7472qxv7o_1747804936.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3f8d/live/3cfea380-10a3-11f0-9af0-9909a653fc84.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cwy7472qxv7o_1747804936.html", "title": "Ulster Championship 2025: How to watch and follow across BBC Sport NI", "title_page": "Ulster Championship 2025: How to watch and follow across BBC Sport NI - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The Ulster Championship is back and you can follow it right across BBC Sport NI.\nThe 2025 edition begins with a tasty rivalry as reigning champions Donegal host Derry in front of the BBC cameras.\nThat will be one of six matches shown live on BBC iPlayer and BBC Two NI, including the showpiece final on Sunday, 11 May.\nHere's all you need to know about this year's Ulster Championship.\nYou'll be able to watch six of this year's Ulster Championship matches on BBC Two NI, BBC iPlayer and the BBC Sport website with analysis and in-play clips available on the website too.\nAs well as the preliminary round and three of the quarter finals, BBC Sport will also show one semi-final and the decider.\nSunday 6 April\nPreliminary round: Donegal v Derry (14:00 BST) - Live on BBC iPlayer and BBC Two NI\nSaturday 12 April\nQuarter-final: Antrim v Armagh (12:30 BST) - Live on BBC iPlayer and BBC Two NI\nSunday 13 April\nQuarter-final: Cavan v Tyrone (16:15 BST) - Live on BBC iPlayer and BBC Two NI\nSaturday 19 April\nQuarter-final: Down v Fermanagh - Live on BBC iPlayer and BBC Two NI\nSunday 20 April\nQuarter-final: Monaghan v Donegal/Derry\nSaturday 26 April\nSemi-final: Antrim/Armagh v Cavan/Tyrone\nSunday 27 April\nSemi-final: Down/Fermanagh v Donegal/Derry/Monaghan - Live on BBC iPlayer and BBC Two NI\nSunday 11 May\nUlster Senior Football Championship final - Live on BBC iPlayer and BBC Two NI\nIt was a fairytale return for Jim McGuinness as he guided Donegal to Ulster Championship glory in his first season back as manager.\nAfter a 0-20 to 0-20 draw after extra time in Clones, Donegal defeated Armagh in a tense penalty shootout in the final, although Kieran McGeeney's side rebounded brilliantly to lift the All-Ireland title later in the summer.\nDown had a strong run to the semi-finals being falling to Armagh by a single point, while Tyrone were pipped to a spot in the decider by old rivals Donegal.\nMonaghan were the first team to exit the Championship after a preliminary round defeat by neighbours Cavan, who then lost to the Red Hands in the last eight, while Fermanagh, Antrim and Derry were also knocked out in the quarter-finals.\nDerry lost to old foes Donegal in their quarter-final tie, and the sides will meet again in the hotly-anticipated preliminary round of this year's Championship.", "url": "https://www.bbc.com/sport/articles/cwy7472qxv7o"}