{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:37:09", "date_modify": "2025-05-21 03:37:09", "date_publish": "2025-04-08 00:00:00", "description": "Teenager Kascie Weir scores her first international goal as Northern Ireland picked up a much-needed 1-0 win against Romania in the Nations League at Windsor Park.", "filename": "sport_football_live_c3v9rllq5nkt_1747798629.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c3v9rllq5nkt_1747798629.html", "title": "Northern Ireland 1-0 Romania: Early Kascie Weir goal helps Northern Ireland beat Romania", "title_page": "Northern Ireland 1-0 Romania: Early Kascie Weir goal helps Northern Ireland beat Romania - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Oxtoby made four changes to the side that started on Friday as Nadene Caldwell, Caragh Hamilton, Halliday and Weir were all handed starts.\nDespite the hosts dominating possession early on, Romania went close to scoring on five minutes.\nMaria Ficzay's free-kick deflected off Halliday and fell kindly into the path of Ana Maria Stanciu, who was unable to direct her header on target.\nNorthern Ireland then went ahead after a well-worked move involving two of the young players brought into the starting team.\nBrenna McPartlan released Halliday down the right and she squared the ball for Weir to sweep home from six yards.\nOxtoby's side continued to look dangerous every time they went forward but, like on Friday, they lacked the cutting edge in the final third to add to their advantage.\nTheir sloppiness in possession allowed Romania back into the game and they nearly equalised three minutes before half-time.\nFiczay floated in a free-kick which Jackie Burns could only punch out to Florentina Olar-Spanu and her fierce strike was cleared off the line by Ellie Mason.\nBurns then turned Olar-Spanu's looping effort over the crossbar after Stefania Vatafu found Romania's captain unmarked on the edge of the box, as NI were forced to dig deep to hold on to their lead heading into the break.\nNorthern Ireland made a fast start to the second half with Mason forcing Andreea Paraluta to palm her powerful effort over the crossbar two minutes after the restart.\nThey almost gifted Romania a goal before the hour as Hamilton, captain on her 50th appearance, gave the ball to Cristina Carp when trying to find Caldwell, but the Romania striker fired straight at Burns.\nAfter a lull in the game, Danielle Maxwell, who scored on Friday, had an immediate impact coming off the bench as she saw a shot blocked after a neat exchange with Simone Magill.\nFellow substitute Connie Scofield squandered a chance to double their lead on 81 minutes as her first-time effort was beaten away by Paraluta after the ball fell to her in the box.\nThe home side were indebted to Burns for preserving their lead in injury time as she thwarted Mihaela Ciolacu's volley from inside the box.\nThey managed to see out the victory despite the late Romanian pressure as they moved on to seven points in the standings.\nOxtoby's side will now have to battle it out with the Bosnia-Herzegovina for second place, after the Bosnians held group leaders Poland to a 1-1 draw on Tuesday to move within three points of Northern Ireland.", "url": "https://www.bbc.com/sport/football/live/c3v9rllq5nkt"}