{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:57:24", "date_modify": "2025-05-21 06:57:24", "date_publish": "2025-03-29 13:08:42", "description": "Bournemouth podcast: Third time FA Cup quarter-final lucky?", "filename": "sport_football_articles_c74k4nkkxk3o_1747810644.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/78d5/live/db88bbc0-0bdb-11f0-8ae9-2975efdc7f47.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c74k4nkkxk3o_1747810644.html", "title": "Bournemouth podcast: Third time FA Cup quarter-final lucky?", "title_page": "Bournemouth podcast: Third time FA Cup quarter-final lucky? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Will it be third time lucky for Bournemouth on Saturday?\nAndoni Iraola's men are one win away from an FA Cup semi-final under the Wembley arch, but to get there they will have to see off Manchester City.\nIn a special edition of BBC Radio Solent's Cherries: Unpicked podcast, Jordan Clark and former defender Joe Partington discuss what will be the club's third FA Cup quarter-final to date against a side they have already beaten at home this season.\n\"Anyone at home suits Bournemouth this season as they have shown enough class at the Vitality to get the better of almost anyone,\" said Partington. \"I don't see it as being as difficult as what some of the other potential ties could have been.\n\"I back Bournemouth at home against anybody this season and it should be a really exciting game - especially because they have already shown that they are capable of beating them. Those players don't need any more evidence that they can do it.\n\"Of course, no two games of football are the same and City probably have even more players that will only just be returning from international duty so it will be interesting to see their team selection.\n\"It is an amazing opportunity for Bournemouth.\"", "url": "https://www.bbc.com/sport/football/articles/c74k4nkkxk3o"}