{"authors": ["Clive Lindsay", "www.facebook.com"], "date_download": "2025-04-26 04:23:21", "date_modify": "2025-04-26 04:23:21", "date_publish": "2025-03-03 13:22:42", "description": "Glasgow Warriors 31-32 Ospreys: Three things we learned", "filename": "sport_articles_c7vz77j78nno_1745641401.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4621/live/6b16fcd0-f7b3-11ef-8576-192757e1481c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_c7vz77j78nno_1745641401.html", "title": "Glasgow Warriors 31-32 Ospreys: Three things we learned", "title_page": "Glasgow Warriors 31-32 Ospreys: Three things we learned - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Glasgow Warriors lost ground on United Rugby Championship leaders Leinster after a dramatic, stoppage-time penalty handed victory to Ospreys at Scotstoun on Saturday.\nBut what did we and, more importantly, head coach Franco Smith learn from the loss?\nWarriors shoot themselves in the foot\nSean Kennedy will rue his decision, as the clock turned red at Scotstoun, to attempt a pass rather than simply kick the ball out of play straight from the restart after Warriors had just taken what looked like a winning lead.\nThe scrum-half suddenly enveloped by Ospreys limbs, a needless penalty was conceded, Jack Walsh was handed the chance to seal the Welsh side's first win in Glasgow in nine years and four points were squirrelled away.\nKennedy will have been playing that one back in his mind all weekend and will surely not make the same mistake should such circumstances ever present themselves again.\nYoungsters yield positivity\nSome fans have questioned Warriors' strength in depth following their defeat by a side who only lie 11th despite their bonus-point win at Scotstoun.\nSmith preferred to accentuate the positives. His side had come so close to victory despite being without a slew of international players and others through injury - and showed \"character\" to come back from the concession of three early tries.\nIndeed, Smith suggested it showed they have young players waiting in the wings ready to take the step up when needed.\nDown, but far from doomed\nOn the one hand, while Leinster, with 12 wins out of 12, look a class apart from the rest of the league, Glasgow stay second top and remain well placed to finish in the top four and secure a home play-off quarter-final.\nOn the face of it, Glasgow will be disappointed to lose to Ospreys on their own patch, but they will be mindful that the improving Welsh side have lost just once in seven games and came close to beating the league leaders a couple of weeks ago only to lose 22-19.", "url": "https://www.bbc.co.uk/sport/articles/c7vz77j78nno"}