{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:35:01", "date_modify": "2025-04-26 03:35:01", "date_publish": "2025-03-08 00:00:00", "description": "Bradford miss out on the chance to go top of League Two as they suffer a 1-0 defeat away to Gillingham.", "filename": "sport_football_live_cqly2llppdlt_1745638501.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1be4/live/730ea4f0-f8ea-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_cqly2llppdlt_1745638501.html", "title": "Gillingham 1-0 Bradford City", "title_page": "Gillingham 1-0 Bradford City - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Bradford missed out on the chance to go top of League Two after suffering a 1-0 defeat away to Gillingham.\nConor Masterson slotted home the winner from close range early in the second half - his first goal for nearly a year - as Bradford failed to capitalise on defeat for leaders Walsall to Grimsby earlier in the day.\nBradford had an early chance to take the lead when a neat through pass from Jamie Walker found Tommy Leigh inside the box, but Glenn Morris was off his line quickly to make a smart save.\nArmani Little's free-kick at the other end was struck just over the crossbar, and the midfielder was on defensive duties shortly after, clearing off the line following Georgie Lapslie's hooked shot.\nLeigh was involved again following the break, stealing half a yard on Masterson before deciding to lob golakeeper Morris. But his ambitious effort nestled on top of the net.\nJohn Coleman's men took the lead in the 56th minute when Max Clark's corner was well trapped by Masterson, who turned and produced a clinical finish to find the bottom corner from six yards.\nGills could have had a second, but Joe Gbode's shot was saved, with Nelson Khumbeni striking wide in the closing stages.", "url": "https://www.bbc.co.uk/sport/football/live/cqly2llppdlt"}