{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:43:01", "date_modify": "2025-05-21 07:43:01", "date_publish": "2025-03-28 00:00:00", "description": "Coverage from Kingspan Stadium as Ulster host Stormers in round 14 of the United Rugby Championship.", "filename": "sport_rugby-union_live_c0mwe0exdv0t_1747813381.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_live_c0mwe0exdv0t_1747813381.html", "title": "Ulster vs Stormers - United Rugby Championship", "title_page": "Ulster vs Stormers - United Rugby Championship - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Full-time\nUlster 38-34 Stormers\nPhew!\nUlster hang on at the end to gain a superb bonus-point win.\nSix tries in total and a phenomonal comeback after trailing 17-0 early-on.\nThe visitors will be happy to collect two points with four home games remaining.\nPost\nUlster 38-34 Stormers\nUlster win the lineout and enter the Stormers 22.\nBut wait. They give away another penalty and the Stormers clear to halfway where they will have the lineout.\n30 seconds remain.\nConverted Try - Ulster 38-34 Stormers\nEvan Roos (try), Sacha Feinberg-Mngomezulu (conv.) - 75mins\nMy goodness what a finish we have!\nThe endless pressure pays off for the Stormers and it is Evan Roos who barges over from close range for his second of the night.\nSacha Feinberg-Mngomezulu scores with the conversion and it is a huge five minutes ahead for everyone.\nPost\nUlster 38-27 Stormers\nStormers take a scrum five-metres out.\nUlster look like they have a dramatic interception, but play is called back for another Stormers penalty within the Ulster 22. The away side need to score if they have any hope of snatching victory.\nSin-bin\nUlster 38-27 Stormers\nAnd it is found to be an unlawful act.\nSubstitute Harry Sheridan is given a yellow card and won't be back.\nPost\nUlster 38-27 Stormers\nThe Stormers get within six inches of the Ulster line but knock it on at the base of the ruck after Evan Roos places it backwards.\nHowever, the referee is looking to see if Ulster interfered there with the ball illegally.\nPost\nUlster 38-27 Stormers\nThe Stormers are still looking hungry here as they attack into the Ulster 22.\nAdvantage is being played for the visitors.\nConverted try - Ulster 38-27 Stormers\nStewart Moore (try), Nathan Doak (conv.) - 66mins\nIt is try number six of the evening for Ulster and the best of the bunch.\nMike Lowry gathers a kick outside his 22, before scorching dowmn the right flank.\nThe ball then goes inside to NIck Timoney, then Nathan Doak and then Moore who dashes over beside the uprights. Deadly attacking.\nNathan Doak bangs over the extra two.\nConverted Try - Ulster 31-27 Stormers\nWillie Engelbrecht (try), Sacha Feinberg-Mngomezulu (conv.) - 62mins\nThat poll may just get a little closer after that try.\nThe Stormers finding success down the Ulster blind-side before swapping back in-field unleasing the substitute Engelbrecht who darts in beside the posts.\nSacha Feinberg-Mngomezulu adds the extras, game on.\nPost\nUlster 31-20 Stormers\nUlster are really targeting Evan Roos around the ruck.\nThe imposing number-eight was on fire in the opening half-an-hour but seems to be swarmed everytime he gets the ball by numerous defenders in white.\nPoll time\nUlster 31-20 Stormers\nWe have seen one comeback so far this evening, is a second possible? Can the Stormers still get the win?\nThumbs up for an Ulster win and thumbs down for a Stormers victory.\nGet voting!\nConverted Try - Ulster 31-20 Stormers\nZac Ward (try), Jack Murphy (conv.) - 55mins\nSuperb score from the hosts and their fifth of the evening.\nJacob Stockdale bursts through the midfield before offloading to the right flank to the flying-win Ward who sprints over. Super stuff from Ulster.\nJack Murphy hits the conversion.", "url": "https://www.bbc.com/sport/rugby-union/live/c0mwe0exdv0t"}