{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:16:28", "date_modify": "2025-05-21 05:16:28", "date_publish": "2025-04-03 17:10:32", "description": "Did Liverpool's winning goal in the Merseyside derby highlight a flaw in the offside law?", "filename": "sport_football_articles_cg72gkr7yreo_1747804588.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cef9/live/1b5d5cb0-10af-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cg72gkr7yreo_1747804588.html", "title": "Liverpool in Premier League: Diego Jota goal", "title_page": "Liverpool in Premier League: Diego Jota goal - was it offside? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Had James Tarkowski not intercepted the ball, Luis Diaz would have been called offside.\nBut because the Everton defender did, his defensive instincts kicking in, Diaz was onside.\nThis moment in Wednesday's Merseyside derby led to Liverpool's winning goal, scored by Diogo Jota.\nEverton were not happy. So what are the offside laws and are they fair?\nSpeaking on Match of the Day, former England and Manchester City goalkeeper Joe Hart said: \"When that ball is played, Luis Diaz is making no attempt to stop Tarkowski from getting that ball. He's making absolutely no attempt to make an action towards the ball.\n\"When it comes to play, he is onside.\n\"There is a problem with the rules that David Moyes will have, but from a lawful point of view, it is a perfectly good goal for Liverpool.\"\nA controversial Manchester City goal against Aston Villa in January 2021 led to a tightening of the rules.\nCity's Rodri was returning from an offside position when he dispossessed Villa defender Tyrone Mings, who had controlled an aerial pass forward with his chest. Rodri set up Bernardo Silva and City went 1-0 up.\nAt the time, by the letter of the law, the goal was legitimate, because Mings played the ball deliberately and so the offside player was deemed not to have gained an advantage.\nBut referees group the Professional Game Match Officials Limited (PGMOL) then clarified how such an incident should be interpreted in the future.\n\"Where a player in an offside position immediately impacts on an opponent who has deliberately played the ball, the match officials should prioritise challenging an opponent for the ball, and thus the offside offence of 'interfering with an opponent by impacting on the opponent's ability to play the ball' should be penalised,\" the PGMOL said in 2021.\nSo what was the difference here?\nIt is understood that the goal was given as Diaz was judged by both the referee and the VAR officials not to have \"impacted\" Tarkowski.\nBlues boss Moyes told BBC Sport: \"It is an easy decision to give. I cannot understand any reason why that wasn't given offside.\n\"I am disappointed. He was along the line and it is quite an easy one to give offside.\"\nLiverpool manager Arne Slot said he would be frustrated if he conceded that goal.\n\"But then I'm frustrated about the rule and not the execution of the rule,\" he added.\n\"The rule itself is frustrating because I think you always have to help, in my opinion, the offensive team.\"\nFormer Premier League winning striker Chris Sutton said the law was well known among the players.\n\"It's clever from Luis Diaz really, because he knows he is onside once Tarkowski has played the ball,\" he told BBC Sport.\n\"I don't think changing the law is a good idea. It's more complicated than just this one scenario, because without having this subjective element, you would be back to where everything is offside.\n\"If you are Everton, you feel slightly hard done by - I get that. But everything can't be black and white unless you want to go back to the days where if anyone was offside, then that was the call.\"\nSpeaking on BBC Radio 5 Live, former Liverpool left-back Stephen Warnock had a different point of view.\n\"This is a problem within the rule book and this is where it stems from,\" he said.\n\"Because they look through the list of things and they go: 'Was he interfering with play? No.'\n\"Well, actually he is if you have played the game and understand the game.\n\"If you are a couple of yards behind me and I am defending the edge of the box, my body is always on the half-turn, thinking: 'Where are you and what are you doing?'\n\"Are you going to come and nip in front of me? Are you going to make a move and try to get yourself onside? So I am always reacting to you. My body is always sensing you and my eyeline is always drawn towards you and the ball, so I have constantly got my head on a swivel, so you're affecting me.\n\"And if you went in and spoke to all ex-professional players within the training centres or wherever they are and said 'is he active in this position?' they would all say 'he is affecting me, 100%'.\n\"But there is a tick-box sort of list within the offside rules, and that is an issue. You have got to use common sense at times, and you have got to understand the game.\"", "url": "https://www.bbc.com/sport/football/articles/cg72gkr7yreo"}