{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:10:55", "date_modify": "2025-05-19 15:10:55", "date_publish": "2015-02-28 18:19:03", "description": "Managers Ian Baraclough and John Hughes reflect on Motherwell's 2-1 Scottish Premiership win over Inverness at Fir Park.", "filename": "sport_football_31675691_1747667455.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81313000/jpg/_81313987_laing.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31675691_1747667455.html", "title": "Motherwell 2-1 ICT: Baraclough focused on his own side", "title_page": "Motherwell 2-1 ICT: Baraclough focused on his own side - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Motherwell manager Ian Baraclough refused to let wins for relegation rivals St Mirren and Ross County take the shine off his side's first victory of 2015.\nLouis Laing and Lionel Ainsworth scored either side of Edward Ofere's counter, but Motherwell remain bottom of the table.\n\"It doesn't matter. Take care of yourself, don't worry about anybody else, it's in your own hands,\" he told BBC Scotland.\n\"Go and take care of business yourself.\"\nHe continued: \"We've gone and put a massive shift in there today, we've come back from the disappointment of losing a goal, we've gone and driven on again, an impact from a substitute who was disappointed not to start, that's what you've got to get.\n\"That's what you're asking for and the lads have gone and given us that in abundance.\n\"There's lads in there who have played at a good level. They'll bring the younger lads through with them.\n\"There's hunger, there's desire, they don't want to be where they are at the moment but we are and we have to deal with it.\n\"It wasn't easy to play out there so we've played a style of football that obviously asked questions of Inverness, but then it got us into areas to go and play our football.\n\"I'm just delighted for everybody, for all the hard work they've put in. Not just this week but the weeks it's been building.\n\"It's been a difficult time, you get your rewards from putting in the hard work and the lads can go and enjoy a weekend where they've got the fruits of their labour.\"\nInverness manager John Hughes saw his side lose their unbeaten start to the year, but they are still seven points ahead of fourth place after their closest rivals for a Europa League spot, Dundee United, lost at home to Partick Thistle.\nHe said: \"After hitting the woodwork twice, putting a couple past the post, we certainly deserved to take something out of the match. I don't know if it's all three points but we could have took three points.\n\"We show character to come back having lost a goal. I felt we could have gone on to win the match but it wasn't to be.\n\"It's the first time we've been beaten [this year], on a heavy pitch, by a team that's fighting for their life.\"\nNigerian international Ofere made his debut for the Highlanders after signing a deal until the end of the season, and Hughes was delighted with his impact.\n\"You can see he's a lovely big guy, he's a gentleman and he plays the game in a fantastic manner,\" he said. \"[He is] a real good footballer and when we get him fit he'll be a fantastic player for Inverness.\"", "url": "https://www.bbc.com/sport/football/31675691"}