{"authors": ["James Jones", "www.facebook.com"], "date_download": "2025-05-21 05:36:49", "date_modify": "2025-05-21 05:36:49", "date_publish": "2025-01-14 12:38:24", "description": "West Ham news: Opinion - Fan writer on need for a striker", "filename": "sport_football_articles_clyk2219d1ko_1747805809.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b0c2/live/79c50fe0-b62f-11ee-beb5-e1400df560f2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_clyk2219d1ko_1747805809.html", "title": "West Ham news: Opinion", "title_page": "West Ham news: Opinion - Fan writer on need for a striker - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Graham Potter is at the wheel - and, despite losing to Aston Villa in the FA Cup in his first game in charge, there was such a vast improvement in West Ham's performance that there is some optimism we have finally got the right man in charge.\nHowever, performance and poor refereeing decisions aside, Friday's defeat cost us a lot more than a place in the FA Cup fourth round.\nWe have known ever since Michail Antonio's car crash in December that a new striker needs to be at the very top of the priority list this January. Niclas Fullkrug's hamstring injury means it needs to be at the very top of the priority list this week.\nReports claim the Hammers have ramped up efforts to get a deal for a striker done as soon as possible now that Potter has only Danny Ings available as a fit first-team forward. The manager has already hinted he sees Mohammed Kudus as a potential option, but while that might be a good short-term fix, it means removing him from a position where he is more effective.\nLinks to Evan Ferguson, Taiwo Awoniyi and Jonathan David are doing the rounds, and any one of them would no doubt be a welcome addition to Potter's squad.\nIt is all about whoever we can get in as quickly as possible. There are so many big games coming up and we cannot afford to spend too long having to play our best players out of position in order to fill gaps.\nPotter will have to make do with what he has got against Fulham on Tuesday but, in an ideal world, we will have a new striker through the door before hosting Crystal Palace on Saturday.\nWishful thinking? Perhaps, but that is how urgent this striker search needs to be.", "url": "https://www.bbc.com/sport/football/articles/clyk2219d1ko"}