{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:39:16", "date_modify": "2025-05-20 14:39:16", "date_publish": "2023-07-28 13:17:09", "description": "Graeme McDowell says he remains \"very close\" with Rory McIlroy and Shane Lowry despite having sat on opposite sides to them in the divide in men's professional golf over the last year.", "filename": "sport_golf_66329693_1747751956.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1213F/production/_130574047_gettyimages-1040666194.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_golf_66329693_1747751956.html", "title": "Rory McIlroy: Graeme McDowell says he's still close to Northern Ireland star despite golf's divide", "title_page": "Rory McIlroy: Graeme McDowell says he's still close to Northern Ireland star despite golf's divide - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Graeme McDowell says he remains \"very close\" with Rory McIlroy and Shane Lowry despite having sat on opposite sides to them in the divide in men's professional golf over the last year.\nWhile McDowell joined the breakaway LIV Golf tour, McIlroy and Lowry have both criticised the Saudi-backed circuit.\nHowever, McDowell says he is still in contact with his fellow major winners.\n\"Myself, Rory and Shane are very close and remain very close and have done through this process,\" he said.\nMcDowell added: \"I haven't seen the guys so that's the problem because of the way the schedules are.\n\"I've been in one part of the world but remain in contact, always looking out for them and always pulling for both of them and I think the same from their side as well.\"\nFormer US Open champion McDowell, who turns 44 on Sunday, said he met McIlroy and Lowry before the Open Championship.\nThey discussed the future of the men's game following last month's shock announcement of a proposed PGA Tour merger with Saudi Arabia's Public Investment Fund (PIF), which funds LIV Golf.\n\"It was great to see them and we're all positive about hopefully where the game of golf is going to go because I don't think anyone wanted the last 15 months of negativity,\" added the Northern Irishman, who has slipped to 561st in the world rankings since joining LIV.\n\"It's two-fold for the game of golf. On the upside the game of golf has never had so many eyeballs and so many people talking about it, positive or negative, so, that's the upside how much in the public eye our game has been.\n\"But the downside is the negativity and the talk about money and terms like 'sportswashing' - and just a lot of things that are dragging the game of golf down from a negative point of view.\"\nWhen asked if he can envisage himself playing alongside McIlroy and Lowry in the future, whether it is the PGA Tour or DP World Tour, McDowell said: \"I hope to play alongside the guys.\n\"I'd be hallucinating a bit if I felt like I was still one of the top-25 players in the world right now.\n\"My results over the last few years don't put me into that stratosphere, so I have a lot of work to do before I can picture myself and visualise myself back playing every week against the top players in the world.\"\nThe 11-time DP World Tour winner, who said he will continue to play on the LIV tour next year, also expressed his hope to participate in future Ryder Cups in some capacity.\nMcDowell was on the winning European team in three of his four appearances, clinching the decisive point at Celtic Manor in 2010, and was a vice-captain for the past two editions.\n\"Six months ago I really didn't know if I would ever play another Irish Open again or play another RBC Heritage at Hilton Head,\" he added.\n\"But now as we get into a better agreement status with everyone that maybe that can happen again, maybe I can be part of a Ryder Cup down the road somewhere.\n\"There's so many unknowns and speculation at this point but I'm just focused on the fact that I think the game is moving back in the right direction again and we all need to focus on where we are at in sport, like I say the eyeballs that this has brought to the sport and hopefully we can benefit from that going forward.\n\"I always hoped and prayed for the future that we would get some kind of agreement together and I'd be able to play some events in the European tour at some point. I still care a lot a lot about the DP World Tour.\n\"It's going to be disappointing to sit out another Irish Open in September but hopefully I'll be back to that event as soon as possible and supporting a tournament that I love a lot.\"", "url": "https://www.bbc.com/sport/golf/66329693"}