{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:38:34", "date_modify": "2025-05-20 12:38:34", "date_publish": "2023-08-03 19:24:24", "description": "England head coach Steve Borthwick says his final 33-man squad for the World Cup is \"pretty clear\" with only \"one or two places\" to be finalised.", "filename": "sport_rugby-union_66396814_1747744714.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8D30/production/_130644163_gettyimages-1470132137-1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-union_66396814_1747744714.html", "title": "England World Cup squad: Steve Borthwick set to take Marcus Smith to France", "title_page": "England World Cup squad: Steve Borthwick set to take Marcus Smith to France - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England head coach Steve Borthwick says his final 33-man squad for the World Cup is \"pretty clear\" with only \"one or two places\" to be finalised.\nBorthwick, who names his squad on Monday, said he will take three scrum-halves and fly-halves to France.\nThe decision means Marcus Smith and Danny Care are likely to be picked.\n\"Most of the 33 are pretty clear. There are obviously one or two places written in pencil which need to be written in pen,\" Borthwick told BBC Sport.\nFor the 2019 World Cup head coach Eddie Jones was allowed a 31-man squad and initially took two scrum-halves, calling up Ben Spencer as an injury replacement for the final, with Owen Farrell and George Ford as his fly-halves.\nFarrell, Ford and Smith are the fly-halves in Borthwick's current training squad, while Care and Leicester Tigers' Ben Youngs and Jack van Poortvliet are the scrum-halves.\nWith World Rugby increasing the squad size for the 2023 tournament, Borthwick says all six are all likely to travel.\n\"I think it is pretty clear given I have kept three scrum-halves and three fly-halves within the camp,\" he said.\nThe head coach also stressed that position flexibility is \"incredibly valuable\", prioritising players able to play in multiple roles.\n\"There is a need to be able to adapt,\" he added. \"We are going to have to do that during this tournament and we have kept our squad quite tight between each of our camps in terms of the number of players we have had in camp.\n\"I am really aware that there is going to be a need for the players outside the 33 that will be named on Monday to be ready to be the next man in. What I see with this squad now is that they have built togetherness and conditioning and a role clarity that anyone can slot into the 33.\"\nOn Saturday, fly-half Smith will start his first game for England since their record home defeat by France in the Six Nations.\nHowever, the Harlequin does not dwell on that game, or losing his starting place to Saracens' Farrell the following week.\n\"It was a tough day to be a part of and I have learned a lot of lessons from that,\" said the 24-year-old. \"It has definitely put me in a much better position as a person and as a player on the pitch.\"\nSale Sharks fly-half Ford missed the Six Nations because of injury but was called into camp to help prepare for the France game, and on Saturday is set to play his first England Test since March 2022 off the bench.\nWith competition alongside Farrell and Ford increasing, Smith has enjoyed Borthwick's openness in making clear \"the pecking order\" but is not taking for guaranteed his spot in the World Cup squad.\n\"Monday is a big day but there are still a few days to go,\" he said. \"I am going to enjoy Friday's team run and then the weekend. Cardiff is a special place to play and I am very grateful to play for England again.\"\nThe Harlequins playmaker also said it would be \"a dream come true\" to play for England at his first World Cup.\n\"It would be pretty surreal to be honest,\" he added. \"I haven't really thought about it. I can't define my emotions right now but fingers crossed for Monday. It would mean a lot to me personally and my mum, dad and two younger brothers who have sacrificed a lot for me growing up.\"\nEngland begin their World Cup campaign against Argentina on 9 September in Marseille, with three more warm-up games following Saturday's match against Wales.", "url": "https://www.bbc.com/sport/rugby-union/66396814"}