{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:55:58", "date_modify": "2025-05-21 03:55:58", "date_publish": "2025-04-07 13:25:38", "description": "Chelsea news: Enzo Maresca rotating squad - have your say", "filename": "sport_football_articles_cy4vlpy24p3o_1747799758.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0124/live/c23c6ab0-0914-11ef-82e8-cd354766a224.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy4vlpy24p3o_1747799758.html", "title": "Chelsea news: Enzo Maresca rotating squad", "title_page": "Chelsea news: Enzo Maresca rotating squad - have your say - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "After boosting their hopes of a Champions League place next season by beating Tottenham on Thursday, it was a surprise for many Chelsea fans to see so many changes in the starting XI at Brentford on Sunday.\nEnzo Maresca rested Nicolas Jackson, Cole Palmer, Marc Cucurella and an in-form Pedro Neto against their west London neighbours, bringing in Malo Gusto, Kiernan Dewsbury-Hall, Christopher Nkunku and Noni Madueke.\nHowever, with those starters failing to impress, all four of the rested players were brought on in the second half. They could not find the much-needed breakthrough as the game ended goalless.\nHaving returned from recent injuries, Maresca suggested not all of the rested players were \"100%\" for the game and that \"the plan nearly worked\" with the side creating more after the break.\nThe Blues are fourth, but their hopes of securing a guaranteed Champions League spot next campaign have been dented with those behind them closing in on their current tally of 53 points.\nWhether through choice or fitness issues, rotation has become a feature of Maresca's early time in charge at Stamford Bridge.\nAccording to Opta, the former Leicester manager has made 84 changes to his starting line-up so far this season - the fifth most of any side in the top flight, behind Manchester City, Ipswich Town, Southampton and Spurs.\nBrentford have made the fewest changes of any team (42).\nWith a trophy still on the line in the Europa Conference League, the strength of Maresca's starting line-up in the quarter-final first leg on Thursday will be interesting to see before Chelsea host Ipswich on Sunday.\nWhat do you make of Maresca's decision to rest players? Is it the right choice to rotate or should he be selecting a more consistent starting XI?", "url": "https://www.bbc.com/sport/football/articles/cy4vlpy24p3o"}