{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:08:54", "date_modify": "2025-05-20 13:08:54", "date_publish": "2023-08-02 14:05:25", "description": "Britain's Terri Harper will face Norwegian Cecilia Braekhus for the WBA and WBO light middleweight titles in Sheffield in October.", "filename": "sport_boxing_66386217_1747746534.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/05BF/production/_130617410_women.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_boxing_66386217_1747746534.html", "title": "Terri Harper & Cecilia Braekhus to fight for WBA & WBO light middleweight titles", "title_page": "Terri Harper & Cecilia Braekhus to fight for WBA & WBO light middleweight titles - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Britain's Terri Harper will fight Norway's Cecilia Braekhus for the WBA and WBO light middleweight titles on 7 October in Sheffield.\nThey were scheduled to fight in May but Braekhus withdrew on the morning of the fight because of illness.\nThe bout will take place on the undercard of the WBA featherweight title fight between Leigh Wood and Josh Warrington at the Utilita Arena.\n\"It would have been a shame for it to never happen,\" said Harper.\n\"When the fight fell through last time I sulked for the weekend, but thanks to Matchroom and Eddie (Hearn) I was back in the gym the following Monday ready for another fight week.\n\"Looking back, this experience has made me a stronger fighter with even more experience now gained.\"\nHarper, 26, holds the WBA title, while 41-year-old Braekhus is attempting to become a two-weight world champion after holding the undisputed belt at welterweight.\nFollowing two defeats by Jessica McCaskill, Braekhus decided to move up a division.\n\"Cecilia is an icon of the sport and has already done everything I want to achieve,\" said Harper.\n\"That's why me and my team were so keen to pursue this fight. I see this fight as a passing of the baton and another stepping stone towards my ultimate goal of becoming undisputed at the weight.\"\nHarper, who was born in Yorkshire, last fought in Sheffield in 2021, losing her WBC and IBO female super-featherweight titles to Alycia Baumgardner.\nShe beat Hannah Rankin to win the WBA and IBO super-welterweight titles in September, and last fought in May, when she beat Ivana Habazin one week after the bout with Braekhus was called off.\n\"It feels good to be back in front of my home crowd. From the beginning of my career I've had a great following and come fight night I'll have thousands in there showing their support,\" said Harper.\n\"I won my first world title at Sheffield Arena and then lost them there. Now it's time to become unified world champion at that same arena.\"", "url": "https://www.bbc.com/sport/boxing/66386217"}