{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:36:26", "date_modify": "2025-05-20 14:36:26", "date_publish": "2023-07-28 13:20:56", "description": "Yorkshire are deducted 48 points in the County Championship and fined £400,000 over the Azeem Rafiq racism scandal.", "filename": "sport_cricket_66339035_1747751786.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4BE8/production/_128723491_gettyimages-1236368021.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66339035_1747751786.html", "title": "Yorkshire issued points deduction and £400,000 fine over racism scandal", "title_page": "Yorkshire issued points deduction and £400,000 fine over racism scandal - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Yorkshire have been docked 48 points from the 2023 County Championship and fined for their handling of the Azeem Rafiq racism scandal.\nThey have also been deducted four points in the 2023 T20 Blast.\nYorkshire said they accepted the sanctions imposed by the Cricket Discipline Commission, which saw a £400,000 fine levied, £300,000 of which was suspended for two years.\nThe club had previously admitted four amended charges.\nFormer Yorkshire player Rafiq said English cricket was \"institutionally racist\", and racist language was used \"constantly\" at the club.\nThe immediate points deduction in the County Championship effectively all-but ends Yorkshire's hopes of the second promotion place, dropping them from sixth place to bottom of Division Two, 63 points behind second-placed Sussex.\nThis year's T20 Blast has already finished and Yorkshire have now dropped to eighth out of nine in the North Group final standings.\nIn a statement, Yorkshire said the CDC and ECB (England and Wales Cricket Board) had \"acknowledged the vast amount of work done by YCCC to overcome the cultural issues that existed within the club, which allowed racist and discriminatory behaviour to go unchallenged\".\n\"We are accountable for these issues, and we accepted four amended charges as part of a continued commitment to ensure we are able to move forward,\" the club added.\n\"We are disappointed to receive the points deductions which affect players and staff at the club, who were not responsible for the situation.\n\"They have worked tirelessly on and off the field to rebuild Yorkshire into an inclusive and welcoming club that reflects the communities it serves. Greater clarity over our situation will allow us all now to look ahead.\"\nSix ex-Yorkshire players found to have used racist language at Yorkshire were sanctioned with fines and bans by the CDC in May.\nFormer England captain Michael Vaughan was cleared \"on the balance of probabilities\" by the panel of using racist language towards Rafiq.\nThe ECB recommended a £500,000 fine, with £350,000 of it being suspended for three years, as well as points deductions.\nECB chief executive Richard Gould said penalties announced for Yorkshire \"mark the end of a thorough disciplinary process\".\n\"There can be no place for racism in our game,\" he added. \"No-one should have to experience what Azeem Rafiq went through in cricket, and we once again thank him for his courage in speaking out.\n\"Since this hearing took place, the Independent Commission for Equity in Cricket has published its report which demonstrates just how much there still is for our game to do in order to stamp out discrimination and become the inclusive sport we all want to be.\n\"We recognise that Yorkshire County Cricket Club has made significant progress since Azeem came forward, first under Lord Patel's leadership and since then under its current management, and is committed to becoming an inclusive club.\"\nIn its written reasons explaining why it arrived at the sanction, the CDC panel said: \"The overall misconduct in this case must be regarded as extremely serious within both the sporting and wider societal contexts.\n\"The message must be made clear to all who administer and who play the professional game, and to all those who administer cricket and who play elsewhere, that such conduct is wholly unacceptable and will not be tolerated.\"\nYorkshire chief executive Stephen Vaughan said in March the club had a £3.5m shortfall and a need to repay £14.9m to the Graves Trust, one of its major creditors.\nThe Headingley club's lawyer Daniel Stilitz KC asked the independent CDC panel to take into consideration the \"detriment\" Yorkshire has already \"suffered\".\nWhile Yorkshire said \"there remains much to do\" in the club's statement, they added that they had \"made significant investments to put in place best practice processes and procedures\".\nThey added: \"We look forward to continued dialogue with the ECB to ensure the financial penalty does not hinder our ongoing commitment to build on the strong foundations that have been laid.\n\"We remain focused on efforts to secure YCCC's sustainability, ensuring the stability required to create a brighter future for all associated with Yorkshire Cricket.\"\nYorkshire coach Ottis Gibson said \"at least we know where we stand\" over the points deduction.\n\"We have four games left in the Championship this season,\" he said. \"That's 96 points that we can play for. We'll try and win the next four games. That's all we're trying to do - win every game we play.\"", "url": "https://www.bbc.com/sport/cricket/66339035"}