{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:02:59", "date_modify": "2025-05-20 12:02:59", "date_publish": "2023-08-05 12:58:24", "description": "A first-half strike from Will Wright sees Crawley beat Bradford on the opening day of the season.", "filename": "sport_football_66345828_1747742579.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/15C36/production/_90724198_football_getty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66345828_1747742579.html", "title": "Crawley Town 1-0 Bradford City", "title_page": "Crawley Town 1-0 Bradford City - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ten-man Bradford suffered a blow in their opening match of the new season as a first-half strike from Will Wright condemned them to defeat at Crawley.\nCity, who were beaten in the League Two play-off semi-finals last season, have now won only one of eight visits to Broadfield Stadium after failing to recover from Wright's early effort and the 41st-minute dismissal of Dan Oyegoke.\nCrawley boss Scott Lindsey went into the curtain raiser scoffing at predictions making his side relegation favourites and insisting his new-look squad gives him what he needs to achieve his goals this season.\nAnd the Reds, unbeaten in their last eight home games under Lindsey, made a great start when debutant defender Wright gave them the lead in the 14th minute.\nThe former Gillingham man struck with a free-kick from 25 yards, the ball beating the outstretched left hand of keeper Harry Lewis into the bottom corner.\nCrawley threatened again midway through the half when Kellan Gordon saw a deflected shot go over after a move involving Danilo Orsi and Dom Telford.\nReds keeper Corey Addai saved shots from Jamie Walker and captain Richie Smallwood before Bradford were reduced to 10 men just before the break when Oyegoke picked up his second booking for a foul on Orsi.\nThe Bantams had a lucky escape on the stroke of half-time when a fierce shot from Orsi rebounded off the crossbar.\nBradford keeper Lewis did well to keep out a goalbound shot from substitute Klaidi Lolos as Crawley looked more threatening after the interval.\nCity rarely looked like rescuing a point, although Addai saved a Liam Ridehalgh header in stoppage time.", "url": "https://www.bbc.com/sport/football/66345828"}