{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:50:42", "date_modify": "2025-05-21 03:50:42", "date_publish": "2025-04-07 11:01:58", "description": "Ipswich 1-2 Wolves: Fan views on Premier League game", "filename": "sport_football_articles_cyvq45j7j2po_1747799442.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cyvq45j7j2po_1747799442.html", "title": "Ipswich 1-2 Wolves: Fan views on Premier League game", "title_page": "Ipswich 1-2 Wolves: Fan views on Premier League game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your thoughts after Saturday's Premier League game between Ipswich and Wolves.\nHere are some of your comments:\nIpswich fans\nJonny: With defeat by Wolves, the slim hope of a \"great escape\" was well and truly put to bed. Most level-headed Town fans will now be preparing for another season back in the Championship. Our hope is that we can play the rest of the season without fear now that the pressure is off, and who knows, maybe even pick up a few more points to send us down with our heads held high.\nBen: Another predictable watch. Lots of effort but no real quality to transition from the back. The lack of Premier League experience is telling - the league needs to have a good look at how any promoted team stands a chance.\nPaul: Unfortunately Ipswich do not have the players to survive in the Premier League just yet. They huffed and puffed to no real avail. It was quite an eye opener to witness the gulf in class between these two teams next to each other in the table. Another year in the Championship will help their development and they will have to add better quality players to their squad.\nTerry: Good display in the first half but no response after half-time when Wolves were on top. No bite up front in the second half. There appeared to be no belief that Town would win after the equaliser.\nWolves fans\nJohn: Good display after a shaky start. Joao Gomes and Andre were outstanding again and have a really good understanding together. Onwards and upwards, and hopefully Fosun will back us next season after the turnaround from Vitor Pereira.\nJen: Passion, resilience and a sprinkling of class. Wasn't the prettiest but who cares! The players want to play for the shirt, the connection is back with the fans and we have a manager who gets it. Roll on the next few games!\nJohn: Great result obviously against an Ipswich side that had not only beaten us already this season but who were absolutely desperate for points. I remember sitting in the pub five weeks ago and seeing the news of Matheus Cunha's red card against Bournemouth come through and thinking: \"OK, no points until Leicester - it's going to get tight.\" But 10 points from a possible 12 without him and we're flying. Safe with seven games to go - could not have dreamt of that after the farce that was the Ipswich game at Molineux back in December.", "url": "https://www.bbc.com/sport/football/articles/cyvq45j7j2po"}