{"authors": ["Timothy Abraham", "www.facebook.com"], "date_download": "2025-05-21 04:26:57", "date_modify": "2025-05-21 04:26:57", "date_publish": "2025-04-05 20:59:28", "description": "Mark Selby cruises to a 10-2 win over China's Ding Junhui to reach the final of the Tour Championship in Manchester.", "filename": "sport_snooker_articles_cy0xp94gez1o_1747801617.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d338/live/cda87340-125e-11f0-b4a4-c723e78819a3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_snooker_articles_cy0xp94gez1o_1747801617.html", "title": "Tour Championship: Mark Selby thrashes Ding Junhui 10-2 to set up final against John Higgins", "title_page": "Tour Championship: Mark Selby thrashes Ding Junhui 10-2 to set up final against John Higgins - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Mark Selby cruised to a 10-2 win over China's Ding Junhui to reach the final of the Tour Championship in Manchester.\nThe 41-year-old Englishman went into the evening session with a commanding 6-2 lead against Ding, then chalked up breaks of 104, 54 and 58 on his way to victory.\nSelby will face John Higgins, who beat Barry Hawkins in the other semi-final on Friday, in Sunday's best-of-19-frames final with the winner picking up £150,000 in prize money.\n\"I've been doubting myself for a little while, but I'm trying to up the tempo and get on with it a bit when I see the shot - and it seems to be working so far,\" Selby told ITV after his victory.\n\"I felt in control of myself all the way through the match. I'm going for my shots, and fancy them which is a good place to be.\"\nBoth Selby and Higgins are four-time world champions, and have met 24 times with the former having 16 victories to the Scot's eight.\nSelby, ranked third in the world, added: \"I've got so much respect for John as a player. He played phenomenally last night.\"", "url": "https://www.bbc.com/sport/snooker/articles/cy0xp94gez1o"}