{"authors": ["Kal Sajad", "www.facebook.com"], "date_download": "2025-05-20 13:41:55", "date_modify": "2025-05-20 13:41:55", "date_publish": "2023-08-01 13:37:54", "description": "The winner of Leigh Wood v Josh Warrington could be given the chance to become a two-weight world champion by facing super-featherweight Joe Cordina next, says promoter Eddie Hearn.", "filename": "sport_boxing_66361254_1747748515.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/E131/production/_130594675_bbc-sport-index-imagery-2-split-images-gradient-2c77c01e-3bd4-47e8-ae2e-8796535e71df.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_boxing_66361254_1747748515.html", "title": "Leigh Wood v Josh Warrington: Winner could face super-featherweight champion Joe Cordina", "title_page": "Leigh Wood v Josh Warrington: Winner could face super-featherweight champion Joe Cordina - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The winner of Leigh Wood v Josh Warrington could be given the chance to become a two-weight world champion by facing super-featherweight Joe Cordina next, says promoter Eddie Hearn.\nNottingham's Wood, 35, defends his WBA world featherweight title against 'Leeds Warrior' Warrington, 32, at Sheffield's Utility Arena on 7 October.\nUndefeated Welshman Cordina is the IBF super-featherweight champion.\n\"I spoke to Joe yesterday and he's up for it,\" said Matchroom Boxing's Hearn.\nSpeaking to BBC Sport, Hearn added: \"Josh and Leigh just want big fights - that's what motivates them.\n\"Once you see the build-up and the city support behind them, everyone - especially the fighters - know what's on the line and they'll fight with pride.\"\nWith the carrot of a momentous fight with 31-year-old Cordina - unbeaten in 16 pro fights - dangling, Wood is the more active and in-form fighter.\nHe is on a career-high after a sensational victory against hard-hitting Mauricio Lara in May, having lost his belt to the Mexican in February.\nThe success was even more impressive as Lara, 25, headed into the contest with a 4lb weight advantage having failed to make weight.\n\"In the Lara rematch I felt sharp in between my ears and physically. I feel those fights, with tiny little breaks while still training, has put me in a good position,\" added Wood.\nHe also feels experience - and fighting for the third time this year - could prove the difference against Warrington, who will have competed just once in 10 months when the two meet.\nWarrington beat veteran Kiko Martinez in March 2022 before losing the IBF title to Mexico's Luis Alberto Lopez later in December.\nBut having enjoyed notable victories over former world champions Lee Selby, Kid Galahad and Carl Frampton, he does not believe inactivity will play a part in the outcome of his world-title challenge.\n\"No-one ever thought I'd win a commonwealth title, let alone be a two-time world champion,\" said Warrington.\n\"So why can't I dream more? Why can't I dream to be a unified champion? To become a two-weight champion or treat my fans to a Las Vegas fight week?\"\nThe fighters came face to face in Tuesday's news conference at the Aspire events venue in Leeds, a day after their contest was announced.\nWood - celebrating his 35th birthday and with his two young daughters in tow - was wearing the colours of his beloved Nottingham Forest.\n\"I've got my girls with me and I'm taking them on training camp with me tomorrow as well. I've got my boxer and parenting head on,\" he said.\nAs a suited Warrington took his seat, he presented Wood with a birthday cake and joked \"there's no drugs in there\" and then led a round of applause for his rival.\n\"There's mutual respect,\" added Warrington. \"We don't have to be shouting and screaming or chucking tables at each other to have a barnstormer of a fight.\"\nSuch is the strong following from their respective cities, Warrington and Wood conducted the news conference in Leeds in the morning, before by heading to Nottingham, where they will take part in a question and answer session with fans.\nFollowing his win over Lara at Manchester's AO Arena, Wood told promoter Hearn to make his \"dream\" come true with a fight at Nottingham Forest's City Ground.\nHowever, with the football season in full flow and stadium fights in the winter months difficult to stage, Hearn revealed the proposal was overruled as the club's ground staff said \"it would have ruined the pitch\".\nA suitable compromise was reached in the Sheffield venue, but Wood - who says he may only have two fights left before retirement - has not given up hope of a fairytale ending to his career.\n\"I'm extremely disappointed but I've put things in place,\" he added. \"I told Eddie there was no way I'm signing this fight unless that clause was in there for my next fight.\n\"I'll never ever hang my gloves up until I've achieved that City ground fight.\"", "url": "https://www.bbc.com/sport/boxing/66361254"}