{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:16:17", "date_modify": "2025-05-21 05:16:17", "date_publish": "2025-04-03 17:30:54", "description": "Man City news: Kyle Walker on exit", "filename": "sport_football_articles_c1wdjy3q419o_1747804577.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9330/live/338d9360-1080-11f0-8c6c-d990c1c0e96b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c1wdjy3q419o_1747804577.html", "title": "Man City news: Kyle Walker on exit", "title_page": "Man City news: Kyle Walker on exit - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Kyle Walker has opened up about his January exit from Manchester City, saying what the club did for him was \"incredible\".\nWalker joined AC Milan on loan in January with an option to make the deal permanent in the summer.\nIn the return of his BBC Sounds podcast You'll Never Beat Kyle Walker - and the first since the move to Italy - he said: \"I've got no bad words - nothing negative to say whatsoever about Manchester City.\n\"What that club's done for me both on and off the field is incredible. When you take yourself away from the bubble, you think about how lucky you was.\n\"That's no disrespect to any of the other clubs I played for, but the seven years we had there, I don't think it will happen again in football.\"\nWalker was part of all six Premier League title wins at City under Pep Guardiola, having joined the club from Tottenham in 2017 in a £50m deal.\nThe 34-year-old was named City's joint-captain in 2023 as part of a five-player leadership group elected by his team-mates before the 2023-24 season.\n\"I said to the player liaison officer that I wanted to say goodbye to the lads in the canteen before I left when I knew the deal was complete,\" he said. \"He actually texted the whole building. There was 150 people there and I had to say goodbye to them, which was a little bit nerve-wracking.\n\"It was sad because, as much as people might have this persona of me, I did speak to completely everyone in that building from the cleaners to the cooks, to the kitmen to physios.\"", "url": "https://www.bbc.com/sport/football/articles/c1wdjy3q419o"}