{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:33:59", "date_modify": "2025-05-20 13:33:59", "date_publish": "2023-07-24 17:21:47", "description": "Western Storm get their first Rachael Heyhoe Flint Trophy win in almost three months as they beat fellow strugglers Sunrisers.", "filename": "sport_cricket_66293650_1747748039.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/13ECA/production/_130501618_westernstormindexgetty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66293650_1747748039.html", "title": "Rachael Heyhoe Flint Trophy: Western Storm beat fellow strugglers Sunrisers for rare win", "title_page": "Rachael Heyhoe Flint Trophy: Western Storm beat fellow strugglers Sunrisers for rare win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Western Storm got a first Rachael Heyhoe Flint Trophy win in almost three months as they beat fellow strugglers Sunrisers by six runs at Cheltenham.\nIn a match reduced to 22 overs per side because of rain Western Storm hit 165-3, as Fran Wilson top-scored with 56 off 52 balls and Alex Griffiths hit 46.\nIn reply Sunrisers could only muster 159-8, with opener Grace Scrivens top-scoring for the visitors with 39.\nIt means Storm move off the bottom of the table, ahead of Sunrisers.\nWilson and Griffiths put on an impressive partnership of 91 in 13 overs for the second wicket as Storm got just their second win of the season, and a first since a six-wicket win at Thunder on 29 April.\nBoth eventually fell victim to Amu Surenkumar, who took 2-37 as Wilson hit a six and five fours while Griffiths' 46 came off 47 balls.\nNiamh Holland chipped in with a useful 28 not out as Storm ended on 165-3.\nIn reply Sunrisers were always behind the run-rate, but they had hope when Scrivens and Dane van Niekerk made 51 for the third wicket - before Van Niekerk was caught and bowled by Chloe Skelton for 26.\nLess than two overs later Skelton claimed Scrivens' wicket to leave Sunrisers on 81-4 off 13.2 overs.\nEva Gray and Mady Villiers put on 40 for the fifth wicket as Gray made 27 off 19 balls, while Villiers went on to score 22.\nSunrisers ended with a flourish as they hit 34 runs off the final three overs to leave them on 159-8, with Sophia Smale taking 4-34 and Skelton 3-36.", "url": "https://www.bbc.com/sport/cricket/66293650"}