{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:53:57", "date_modify": "2025-05-21 05:53:57", "date_publish": "2025-04-02 07:55:17", "description": "Nottingham Forest 1-0 Man Utd: Andy Reid on Forest's challenge for Champions League", "filename": "sport_football_articles_cp34nwxdx0po_1747806837.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/41bc/live/54c54930-0f93-11f0-a6f6-db68eb2a81f7.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cp34nwxdx0po_1747806837.html", "title": "Nottingham Forest 1-0 Man Utd: Andy Reid on Forest's challenge for Champions League", "title_page": "Nottingham Forest 1-0 Man Utd: Andy Reid on Forest's challenge for Champions League - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Nottingham Forest's squad has \"evolved really nicely\" since their promotion three years ago and Champions League qualification would help them build upon it, says former midfielder Andy Reid.\nForest's win over Manchester United on Tuesday opened up an eight-point gap to fourth-placed Chelsea.\n\"It was tough after playing 120 minutes against Brighton with a lot of recovery and preparation involved but Nuno made some really good changes in game,\" Reid told BBC Radio 5 Live's Football Daily podcast. \"He replaced players at the right time and gave Forest a real good platform to hold out and win a massive three points.\n\"When you think back to Forest being promoted three years ago, the turnover in players has been massive. The squad has evolved really nicely and the recruitment over the last two years has been very well thought through.\"\nForest overcame injuries to key players Chris Wood and Callum Hudson-Odoi to hold off United but Reid recognises the squad will need investment to thrive at the next level.\n\"To get into the Champions League and hold onto your top players is obviously massive but the income that it generates and being able to invest again also is,\" he said. \"The owner is very ambitious and wants to have top-level success. He puts his money where his mouth is but with the financial rules you have to back it up with income.\n\"It's going to be very interesting to see where this journey takes us and it's so exciting for the Forest fans who for so many years have had it really tough.\n\"They can enjoy it and they are proud to come and support their team.\"", "url": "https://www.bbc.com/sport/football/articles/cp34nwxdx0po"}