{"authors": ["Daldeep Kaur", "www.facebook.com"], "date_download": "2025-04-26 06:26:57", "date_modify": "2025-04-26 06:26:57", "date_publish": "2025-02-28 19:19:44", "description": "Docherty urges Dundee resilience in relegation battle", "filename": "sport_articles_cy7x0811051o_1745648817.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0588/live/d679a460-f5fa-11ef-a576-211c964a64b2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cy7x0811051o_1745648817.html", "title": "Docherty urges Dundee resilience in relegation battle", "title_page": "Docherty urges Dundee resilience in relegation battle - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Tony Docherty insists Dundee have the resilience to salvage survival in a season \"blighted by injuries\".\nAfter suffering a fifth successive league defeat at Motherwell on Wednesday night, Docherty's side will drop to the bottom of the table if they lose by two or more goals at home to relegation rivals St Johnstone on Saturday.\nAsked if that was a concern, Docherty said: \"At this stage, no. There's no league standings in February, there's no prizes given out in February.\n\"It's a big game, they're all big games at this stage of the season. I don't put any more emphasis on this game than any other one.\n\"There's 10 games to go, there's five games until the split, it's important that although we want to stop the bad run we're on at the moment, we're still working hard towards that.\n\"What really encourages me as manager, all I want to see is that level of performance but a little bit more consistently.\n\"I thought the level of performance we got on Wednesday night against Motherwell certainly merited getting something from the game.\n\"You need to be buoyed and encouraged by that and make sure we're positive with the players.\"\nDundee are without five players through injury this weekend and Docherty says such problems are symptomatic of their season.\n\"We've proven that over the season, it wasn't even that long ago, we have been really blighted by injuries,\" he added.\n\"It's over 100 appearances, particularly senior players, that we've missed this season. Just recently when we had the episode with real significant injuries and we went into fixtures and we had the good performance results against Rangers and Celtic, we beat Dundee United in the cup, that was real mental toughness by the group.\n\"That was real resilience and now I'm looking for that at this stage of the season as well.\"", "url": "https://www.bbc.co.uk/sport/articles/cy7x0811051o"}