{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:15:46", "date_modify": "2025-05-21 07:15:46", "date_publish": "2025-05-20 10:47:20", "description": "Cornish Pirates coach Joe Walsh agrees a new deal to stay with the club next season.", "filename": "sport_rugby-union_articles_c0r11ndjexpo_1747811746.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0552/live/0a80a490-3564-11f0-bf15-094eef773db0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c0r11ndjexpo_1747811746.html", "title": "Joe Walsh: Cornish Pirates coach agrees to extend deal", "title_page": "Joe Walsh: Cornish Pirates coach agrees to extend deal - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cornish Pirates coach Joe Walsh has agreed a new deal to stay with the club next season.\nThe 25-year-old Irishman will take the role of lead forwards and defence coach for the Championship club.\nWalsh worked as a performance analyst for the Poland national team in the 2023 Rugby Europe Championship.\nHe has also been head of performance analysis at Rugby Academy Ireland and with the under-17s side at Leinster.\nJoint head coaches Alan Paver and Gavin Cattle agreed new deals last week\n\"It's been a privilege to work with such a great group of players and staff this season and I'm really looking forward to seeing what we can produce as a team next year,\" Walsh told the club's website.\nPaver said: \"We're absolutely over the moon to have him for another year.\n\"The way he's come in and contributed to what we do on the pitch, you've really got to see it on the inside.\"\nThe news comes as Pirates announced that prop James French ahs signed a new deal to stay for next season.\nThe Irishman, who moved to Penzance last summer, has made 21 appearances so far in his debut season and scored one try.", "url": "https://www.bbc.com/sport/rugby-union/articles/c0r11ndjexpo"}