{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:22:40", "date_modify": "2025-04-26 06:22:40", "date_publish": "2025-03-04 00:00:00", "description": "Hakon Haraldsson scores the equaliser as Lille fight back to earn a draw at Borussia Dortmund in the first leg of their Champions League last-16 tie.", "filename": "sport_football_live_ce300dqp6lqt_1745648560.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/fcaf/live/484dbf60-f941-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_ce300dqp6lqt_1745648560.html", "title": "Borussia Dortmund 1-1 Lille: Hakon Haraldsson goal earns Lille first-leg draw", "title_page": "Borussia Dortmund 1-1 Lille: Hakon Haraldsson goal earns Lille first-leg draw - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Hakon Haraldsson scored the equaliser as Lille fought back to earn a draw at Borussia Dortmund in the first leg of their Champions League last-16 tie.\nDortmund had taken the lead through a brilliant strike from Karim Adeyemi in a first half in which last season's runners-up were by far the superior side.\nBut Haraldsson's goal during Lille's much-improved showing after the break put the tie in the balance before the return leg in France on Wednesday, 12 March (17:45 GMT).\nThe game lacked spark in the early stages but Adeyemi produced a moment of brilliance after 22 minutes to score from a corner and put Dortmund ahead.\nJulian Ryerson's delivery was met by Lille defender Alexsandro Ribeiro but his weak headed clearance fell for Adeyemi, who planted a sublime half-volley from the edge of the box into the bottom corner.\nNiko Kovac's side had the ball in the back of the net from a corner again before the break, but the visitors were saved by the assistant referee's raised flag for offside when Pascal Gross turned in from close range.\nLille were barely given a look-in by the Dortmund defence in the first half and the closest they went to scoring was when Thomas Meunier exchanged passes with Haraldsson before firing into the side-netting.\nThe French side, however, were far more lively in the second period and deservedly secured the draw when Iceland midfielder Haraldsson ran on to a through ball from Jonathan David and poked past Dortmund goalkeeper Gregor Kobel while off-balance.\nLille substitute Andre Gomes was lucky to escape a late red card for an awful challenge which forced Daniel Svensson off with an injury as the visitors held on.\nLille have never reached the Champions League quarter-finals, but with this creditable draw at Dortmund, Bruno Genesio's side have put themselves in good stead.\nIn a poor first half for the visitors, they were a shadow of the side that beat Real Madrid and Atletico Madrid to finish seventh in the competition's league phase.\nBut their performance picked up after the break with the prolific David linking up with goalscorer Haraldsson far more fluently.\nDavid, soon to be out of contract, saw his effort blocked by Svensson after wriggling through Dortmund defenders in the box seven minutes into the second half.\nThough the Canada forward did not add to his six goals in Europe this season, he still played a pivotal role in the result by providing the assist for the equaliser.\nLille should be brimming with confidence before the return leg at Stade Pierre-Mauroy, where they have scored 11 goals in four games and not lost despite visits from Real Madrid, Juventus, Sturm Graz and Feyenoord.", "url": "https://www.bbc.co.uk/sport/football/live/ce300dqp6lqt"}