{"authors": ["Jonty Colman", "www.facebook.com"], "date_download": "2025-05-21 04:19:31", "date_modify": "2025-05-21 04:19:31", "date_publish": "2025-04-05 15:42:12", "description": "England's Mimi Rhodes leads by three shots going into the final round at the 2025 Joburg Ladies Open.", "filename": "sport_golf_articles_c7vnd589jeno_1747801171.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1613/live/10872610-1233-11f0-afc6-d1fc00c8c982.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_golf_articles_c7vnd589jeno_1747801171.html", "title": "Joburg Ladies Open: Mimi Rhodes takes three-shot lead before final round", "title_page": "Joburg Ladies Open: Mimi Rhodes takes three-shot lead before final round - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England's Mimi Rhodes will take a three-shot lead into Sunday's final round at the Joburg Ladies Open in South Africa.\nRhodes, who entered her second round with a one-shot lead, carded a four-under-par 69 to move to -12 for the tournament and three shots clear of South Africa's Casandra Alexander and Lauren Walsh of the Republic of Ireland (both nine under).\nThe 23-year-old is chasing her second Ladies European Tour (LET) win after claiming the Ford Women's NSW Open title last month in Wollongong, Australia.\nRhodes had five birdies and one bogey in her second round in the shortened competition.\nFollowing heavy rainfall and flooding in parts of the course, the LET and Sunshine Ladies Tour opted to reduce the competition from 72 holes to 54, with the final round to take place as planned on Sunday.\nRhodes was eight-under-par for the weekend when play was suspended on Friday before finishing the final 13 holes of her second round on Saturday.\nElsewhere, England's Alice Hewson went level par in her second round and sits four under par heading into the final round.", "url": "https://www.bbc.com/sport/golf/articles/c7vnd589jeno"}