{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:14:34", "date_modify": "2025-05-21 06:14:34", "date_publish": "2025-01-14 09:22:32", "description": "Defender Barry Douglas stresses 'livelihoods are at stake' at St Johnstone", "filename": "sport_articles_cg45leddyk9o_1747808074.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1fa9/live/a22e0f50-d257-11ef-afca-fd8d41ed4ae1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cg45leddyk9o_1747808074.html", "title": "Douglas stresses 'livelihoods are at stake' at St Johnstone", "title_page": "Defender Barry Douglas stresses 'livelihoods are at stake' at St Johnstone - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Barry Douglas has warned his St Johnstone team-mates that \"livelihoods are at stake\" as the club attempt to avoid relegation from the Scottish Premiership.\nThe Perthshire Saints are nine points adrift at the foot of the table and without a win in nine games, too.\nIn their latest defeat, a 3-1 loss to Rangers at Ibrox, Simo Valakari's side were all over the shop in the first half before a more collective and cohesive display in the second.\nFormer Scotland international Douglas appeared off the bench after the break, marking his return from a severe calf tear that was kept him out since November.\nNow back, the 35-year-old is aiming to use his vast experience to educate and inspire his side that their fate is not yet sealed.\n\"The challenge is there for us, and there's no more motivation we need than to just look at the table,\" the defender said.\n\"It's boys' livelihoods, and that's the reality of it. A lot of boys need to realise that. It's not just about what we do on a pitch, it affects everyone else surrounding the club.\n\"There's still loads to play for. In this league, two, three consecutive games changes the outlook of where you are in the table.\n\"So I'll be amplifying that in the dressing room, that it is one game at a time now, starting with the cup.\"", "url": "https://www.bbc.com/sport/articles/cg45leddyk9o"}