{"authors": ["Nizaar Kinsella", "www.facebook.com"], "date_download": "2025-05-21 06:55:24", "date_modify": "2025-05-21 06:55:24", "date_publish": "2025-01-31 09:12:53", "description": "Tottenham 3-0 Elfsborg: Dane Scarlett's appearance impacts Will Lankshear", "filename": "sport_football_articles_c627n5ejje3o_1747810524.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/76ef/live/907014b0-dfaf-11ef-88d3-dd7c96a87c10.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c627n5ejje3o_1747810524.html", "title": "Tottenham 3-0 Elfsborg: Dane Scarlett's appearance impacts Will Lankshear", "title_page": "Tottenham 3-0 Elfsborg: Dane Scarlett's appearance impacts Will Lankshear - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Dane Scarlett's return to the Tottenham team secured his immediate future at the club as he played for Spurs for the first time since pre-season and scored his maiden senior goal for his boyhood club.\nThe 20-year-old's strike during the 3-0 win was important for seeing off Elfsborg, but simply the act of coming on means that he will no longer be able to leave the club - having spent the first half of the season on loan at Oxford United in the Championship. Uefa rules prohibit players from appearing for more than two clubs in the same season.\n\"We had a look at his situation,\" manager Ange Postecoglou explained after the match. \"He has had a couple of disappointing loans. I think sending him out again without any sort of real prospect of him developing, we just felt to keep him training with us and give him an opportunity to play and see how it goes.\"\nSweden forward Dejan Kulusevski enjoyed Scarlett's performance and was in an upbeat mood after the game.\nSpurs are now focused on ending the season well while still in the Europa League, Carabao Cup and FA Cup.\n\"I love Dane Scarlett a lot,\" Kulusevski said. \"I think he is a great player and I believe he will help us these months. It was a great goal so I'm very happy for him. Also the other players that scored, they have to give the energy now. We have a lot of injuries and they did an amazing job today.\n\"A lot of players are coming back from injury now, like Micky [van de Ven], who is a world class centre-back. I believe we still can do it [win a trophy].\"\nScarlett's return to the squad will have an impact on talented striker Will Lankshear, 19, who is exploring his loan options in the Championship and in Europe.\nLankshear has been linked with a move to Burnley, Middlesbrough, West Brom, Cardiff or Luton.\nThe idea was that if no players got injured in attack then he would be cleared to move with four days left to secure that switch.\nMeanwhile, Spurs have refused to confirm that they have had a £50m bid accepted for wide forward Mathys Tel, 19, but widespread reports and sources in Germany insist that it is true.\nHowever, many of those same reports also suggest that Tel himself has not accepted the move - as he awaits further offers before deadline day - which might explain the cautiousness in north London.", "url": "https://www.bbc.com/sport/football/articles/c627n5ejje3o"}