{"authors": ["Steve Sutcliffe", "www.facebook.com"], "date_download": "2025-05-20 13:25:18", "date_modify": "2025-05-20 13:25:18", "date_publish": "2023-08-02 07:54:47", "description": "Will Katie Archibald shine? Can Geraint Thomas triumph? And will Dame Sarah Storey enjoy more success?", "filename": "sport_cycling_66367635_1747747518.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/10DCE/production/_130607096_bbc-sport-index-imagery-3-split-images-gradient-4fffb291-610a-4d22-a7fb-699ed584fa81.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cycling_66367635_1747747518.html", "title": "Cycling World Championships 2023: The riders to watch", "title_page": "Cycling World Championships 2023: The riders to watch - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The first combined UCI Cycling World Championships begin on Thursday at the Sir Chris Hoy Velodrome in Glasgow.\nThe 11-day event, which will be shown live on the BBC, ends on 13 August.\nAround 2,700 riders will compete for rainbow jerseys across seven disciplines with more than 200 world titles on the line.\nRoad racing, time trials, track, BMX, mountain bike, indoor cycling and para-cycling - which is fully integrated for the first time - are all included.\nOnly cyclo-cross, which took place in the Netherlands in February, is missing from a condensed schedule.\nBut which British riders are likely to shine? What exactly is the Gran Fondo? And who are the other stars of the sport and the races to watch in Scotland?\nBBC Sport looks at what is being billed as the biggest multi-discipline cycling event ever.\nLocal favourite and two-time Olympic champion Katie Archibald is poised to take centre stage when the action gets under way on the track as she goes for three world titles in the team pursuit, madison and omnium.\nCurrent points race world champion Neah Evans will also be looking to impress as Great Britain's track cyclists debut a new cutting-edge Hope-Lotus bike they intend to ride to Olympic glory in Paris in 2024.\nOlympic room-mates Elinor Barker and Katy Marchant both compete in their first world championships since giving birth to sons in 2022.\nMeanwhile Jack Carlin, who took a silver and bronze at Tokyo 2020, will be looking to add a first gold medal to his collection of six at world or Olympic level.\nThere will be high expectations on a para-track squad containing 16-time world champion Neil Fachie, while Jody Cundy will attempt to win a 14th consecutive kilo world title.\nTandem stoker Lora Fachie will make her return to the track - after the birth of her son last year - alongside pilot Corrine Hall, while the multi-talented Kadeena Cox will also look to add to her burgeoning medal collection across para-athletics and para-cycling.\nHaving finished 13th on the road in this year's gruelling Tour de France, Britain's Tom Pidcock turns his attention back to the mountain bike.\nThe Olympic gold medallist heads to picturesque Glentress Forest, south of Edinburgh, along with 2021 world champion Evie Richards, for the cross-country races taking place between 8 and 12 August.\nJunior world winner Jordan Williams and Rachel Atherton, who is looking to take her sixth senior world crown, will ride for rainbow jerseys in the downhill events being held in Fort William from 3 to 5 August.\nGB's BMX racing and freestyle squads include Olympic champions Beth Shriever and Charlotte Worthington as well as Olympic and world championship silver medallist Kye Whyte.\nOlympic bronze medallist Declan Brooks and newly crowned European champion Kieran Reilly are also taking part with aspirations of claiming a medal.", "url": "https://www.bbc.com/sport/cycling/66367635"}