{"authors": ["Elizabeth Hudson", "Sally Hurst", "www.facebook.com"], "date_download": "2025-04-26 04:39:52", "date_modify": "2025-04-26 04:39:52", "date_publish": "2025-02-28 08:53:26", "description": "After a torrid 18 months, wheelchair curler Jo Butterfield is ready to get her Paralympic dreams back on track.", "filename": "sport_articles_c70q275endro_1745642392.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cc27/live/587586d0-f382-11ef-bdb2-df3b1e28059d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_c70q275endro_1745642392.html", "title": "Jo Butterfield: Wheelchair curler eyes World Championships after breast cancer treatment", "title_page": "Jo Butterfield: Wheelchair curler eyes World Championships after breast cancer treatment - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "\"The potential of it being life-ending really shocked me.\"\nJo Butterfield was about to embark on her second season as a wheelchair curler when she was diagnosed with breast cancer in September 2023.\nWithin weeks of finding a lump, she was rushed into treatment - a 16-week course of chemotherapy followed by radiotherapy and surgery.\nThere were days when the 2016 Paralympic club throw champion struggled with the impact of the treatment, which left her fatigued and prone to infection, but she says her elite athlete mentality kept her going.\nTwelve years earlier, Butterfield was paralysed from the waist down in an operation to remove a spinal tumour, but her cancer diagnosis, she says, inflicted more fear.\n\"I have some innate strength and resilience, but this one knocked me harder than ever,\" Butterfield, who switched from Para-athletics to curling in 2022, tells BBC Sport.\n\"The spinal injury was life-changing but I was very matter of fact about it – this has happened, I can't change it but I'm still here, so let's get on with it and make life brilliant.\n\"The breast cancer was scarier. That support from family, friends and team really rallied me through.\n\"This was an eye opener that I am not invincible and we don't know what tomorrow holds, but as long as there's a struggle and a fight, I've got a tomorrow so let's live every day today because we don't know what tomorrow is going to be.\"\nDespite ongoing immunotherapy, the 45-year-old says she is now \"in a good place\" before the Wheelchair Curling World Championships which start in Stevenston, North Ayrshire, on Saturday.\nTraining with the rest of the Scotland squad in Stirling throughout her treatment was key for the Yorkshire-born athlete, whose ultimate aim is to become the first Briton to win gold at both a summer and winter Paralympics.\n\"Being able to come to the training centre once a week gave me something to focus on other than cancer,\" she says.\n\"Here I was 'Jo the athlete'. We could take the mickey out of each other like we always do, we could shoot some stones and forget about what was going on in the background.\"\nThis week's Worlds are the final chance for Butterfield's Scotland team to gain qualification points before next year's Winter Paralympics.\nShe will team up with Sochi bronze medallist Gregor Ewan and fellow Paralympians Hugh Nibloe and Gary Smith, as well as debutant Austin McKenzie, while England will be led by Stewart Pimblett along with Karen Aspey, Julian Mattison and Jason Kean.\nThey will be joined by Canada, China, Italy, Japan, Korea, Latvia, Norway, Slovakia, Sweden and the United States with the round-robin games going on until 6 March - a year to the day before the opening ceremony of the 2026 Winter Paralympics in Italy - before play-offs and semi-finals on 7 March and the final on 8 March.\nThe team event will be followed by the mixed doubles from 11-16 March with the latter making its Paralympic debut in Milan-Cortina next year.\nScotland are in a good position to qualify for the Games in the team event but the mixed doubles team of Nibloe and Charlotte McKenna will need a strong performance to secure a place for next year.\nFor Butterfield, going to a World Championships again \"almost feels like a gold medal\" but her Paralympic dream remains alive.\n\"There has been a speed bump and it has derailed things, but winning gold in Italy is still the ultimate aim,\" she says.\n\"I am working hard every day to make it happen and we are coming together as a team really well.\n\"I feel good and I feel strong. My strength is coming back every day and I feel healthy.\n\"I feel hugely fortunate to be sitting here because I had an eye-opener that this might not be possible.\n\"I want to cherish and enjoy it and make the most of it.\"", "url": "https://www.bbc.co.uk/sport/articles/c70q275endro"}