{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:25:09", "date_modify": "2025-05-21 07:25:09", "date_publish": "2025-05-20 00:00:00", "description": "Chennai Super Kings face Rajasthan Royals in the Indian Premier League - follow live scores, radio commentary and updates.", "filename": "sport_cricket_live_cn5yrx2ek1zt_1747812309.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f2fd/live/2c07cbe0-30f3-11f0-8519-3b5a01ebe413.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_live_cn5yrx2ek1zt_1747812309.html", "title": "IPL 2025 LIVE: CSK vs RR", "title_page": "IPL 2025 LIVE: CSK vs RR - cricket score, radio commentary & updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Suryavanshi hits 57 as Rajasthan end with consolation win\nFourteen-year-old Vaibhav Suryavanshi impressed again with 57 in Rajasthan Royals' six-wicket victory over Chennai Super Kings in the Indian Premier League.\nSuryavanshi, who became the youngest player to hit a professional men's T20 century earlier in the tournament, showed maturity beyond his years in accelerating after a careful start in pursuit of 188.\nHe took only 12 from his first 10 balls as opening partner Yashasvi Jaiswal dominated with a 19-ball 36.\nBut Suryavanshi took on the charge after Jaiswal fell, swinging his 11th ball for six off Noor Ahmed and driving the next two deliveries for four.\nHe powered two huge sixes over long-on in one over from India all-rounder Ravindra Jadeja and reached his fifty in 27 balls by heaving Afghanistan international Noor over square leg for his fourth six.\nHe was dismissed after 33 deliveries when he played a wild swipe to Ravichandran Ashwin and was caught at backward point but by that stage only 50 were needed from 36 balls.\nDhruv Jurel hit 31 not out as Rajasthan completed victory with 2.5 overs remaining to end the tournament with a consolation win.", "url": "https://www.bbc.com/sport/cricket/live/cn5yrx2ek1zt"}