{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:32:50", "date_modify": "2025-05-21 05:32:50", "date_publish": "2025-04-02 17:01:49", "description": "Four-cap Wales flanker Thomas Young will leave Cardiff for arch-rivals Dragons, for whom he has signed a \"long-term\" deal starting next season.", "filename": "sport_rugby-union_articles_cg72g2y8v75o_1747805570.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/71f6/live/861ab5f0-0fda-11f0-94e9-65dc0da473ff.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cg72g2y8v75o_1747805570.html", "title": "Thomas Young: Wales flanker to leave Cardiff for Dragons", "title_page": "Thomas Young: Wales flanker to leave Cardiff for Dragons - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wales flanker Thomas Young will leave Cardiff for east Wales rivals Dragons on a \"long-term\" deal starting next season.\nThe 32-year-old will fill a gap created by fellow Wales back row Taine Basham's move to the Arms Park from Rodney Parade for 2025-26.\nOpen-side flanker Young is Dragons' latest future recruit following their announcements that Wales prop Dillon Lewis will join from Harlequins and Wales U20s captain Harry Beddall will return to Wales from Leicester.\nDragons boss Filo Tiatia expects Young to \"be a real mentor and help develop our young loose forwards like Harry Beddall, Evan Minto and Owen Conquer\".\nAfter emerging from Cardiff's junior ranks, Young joined Gloucester before switching to Wasps in 2014 under his father Dai.\nYoung returned to the Arms Park from Wasps for the 2022-23 season, where Dai was then in charge.\nHe will leave Matt Sherratt's Cardiff, with Dragons boss Tiatia adding: \"We're looking forward to Thomas joining up with us. He's a talented loose forward with international experience who brings a competitive edge and is someone who will drive standards.\n\"Thomas is a player who plays at a high level and has a huge influence on games, both in attack and in defence.\"\nDragons have not specified the duration of Young's contract but hope he will help improve their standing in Welsh rugby. They currently lie bottom of the United Rugby Championship amid ongoing struggles on the field.", "url": "https://www.bbc.com/sport/rugby-union/articles/cg72g2y8v75o"}