{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:29:52", "date_modify": "2025-05-21 07:29:52", "date_publish": "2025-05-20 17:01:12", "description": "Georgia Elwiss makes a match-winning 75 not out and Maddy Green 97 as The Blaze beat Somerset by four wickets in the One-Day Cup.", "filename": "sport_cricket_articles_c5yqqqd3l25o_1747812592.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e841/live/e209a010-359b-11f0-a9d1-9382f03c2c54.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c5yqqqd3l25o_1747812592.html", "title": "One-Day Cup: Georgia Elwiss steers Blaze to victory over Somerset", "title_page": "One-Day Cup: Georgia Elwiss steers Blaze to victory over Somerset - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "All-rounder Georgia Elwiss defied the pain from an injured hand with a match-winning unbeaten 75 as The Blaze beat Somerset by four wickets with an over to spare in the women's One-Day Cup.\nVisiting skipper Sophie Luff struck 72 from 76 balls, backed up by a half-century from opener Rebecca Odgers and a swashbuckling 25-ball 48 from Australian all-rounder Amanda-Jade Wellington as Somerset set their opponents a tough challenge by posting 304-7 in their 50 overs.\nNew Zealand batter Maddy Green hit 12 boundaries in a 90-ball 97 as The Blaze responded, sharing a 125-run second-wicket stand with Kathryn Bryce (59) before they slipped to 238-6.\nBut 33-year-old England all-rounder Elwiss brought all her experience into play as she and skipper Kirstie Gordon (25) shared an unbroken 67-run partnership to clinch victory at the Haslegrave Ground in Loughborough.\nElwiss, who hit eight fours and faced 68 balls, batted despite suffering an injury fielding off her own bowling and spent the last 19 overs of the Somerset innings off the field receiving treatment.\nOdgers and opening partner Emma Corney earlier put on 88 for the first wicket as Somerset's innings got off to a flying start.\nThey were not parted until the the 17th over, when Odgers was unlucky to be run out after Corney changed her mind over a single.\nIt was the 22-year-old Cornish-born batter's second fifty in two innings in Somerset colours, making a good impression again after her 60 against Durham earlier in the month.\nLeg-spinner Josie Groves was expensive but picked up an important wicket when Corney was stumped and Elwiss was rewarded for an excellent spell by having Fran Wilson (28) caught at mid-off from a slower ball prior to suffering her injury.\nGrace Ballinger castled Katie Jones for eight but skipper Luff was the fulcrum for Somerset, the 69 added with Alex Griffiths (28) in 11 overs for the fifth wicket giving Somerset a platform to attack.\nGriffiths was bowled when she missed a slog-sweep and Luff was caught at short fine leg, having hit seven fours and a six. But then came a flurry of hitting by Wellington, seven of whose nine boundaries before she was run out off the final ball came in Ballinger's last three overs, which cost 37 runs.\nThe Blaze struggled for early momentum in response, with Georgie Boyce running herself out looking for a single that Green understandably declined.\nBut once Green and Kathryn Bryce found their range in the last three overs of the powerplay, turning 19-1 from seven into 50-1 from 10, Somerset suffered until Olivia Barnes, the former Kent left-arm spinner, claimed her maiden wicket for her new county as Bryce was bowled attempting to sweep.\nThe partnership had added 125 in 18.4 overs, Bryce's fourth half-century of the competition having come off 47 balls with eight fours, Green's first for The Blaze also containing eight fours off 51.\nNow the momentum shifted back to Somerset. A tidy spell from seamer Alex Griffiths was rewarded when Sarah Bryce, whom she had dropped on two in her follow-through, was bowled behind her legs.\nAnd though Green and Elwiss, at times in obvious pain from her injury, added another 47 for the fourth wicket, Somerset achieved the breakthrough they had been looking for when the former - in touching distance of a fifth List A hundred in this calendar year - was bowled by the returning Ellie Anderson.\nThe loss in the next over of Ella Claridge, whose top-edged sweep gave 18-year-old Barnes a second wicket, left The Blaze 203-5 in the 36th, still 102 short of their target, Wellington striking a further blow when the leg-spinner removed Michaela Kirk leg before.\nBut despite her discomfort, Elwiss took the responsibility for seeing her side over the line, a superbly judged innings giving her a third half-century for the Blaze as she and Gordon completed the job.\nECB Reporters' Network supported by Rothesay\nThe Blaze captain Kirstie Gordon:\n\"To chase down a total of that size is really pleasing. It was a really good pitch. We reckon par is about 280 and we probably gave them a few too many runs with the ball.\n\"But we felt good going into the second half of the match and the way Maddy Green batted up top in that partnership with Kathryn Bryce, that really gave Georgia (Elwiss) the platform to make sure we took it home.\n\"Georgia took a pretty bad knock on the hand so to go out and do that with one and a half hands is pretty special. And she did it under pressure too with the game really in the balance as well\"\nSomerset captain Sophie Luff:\n\"It was a close game on a really great wicket. Maybe we didn't have quite enough and we probably didn't do quite enough at the end to restrict them.\n\"We thought that if we got 300 we would be in the game but a couple of their batters played really nicely. We gave away a few loose balls towards the end of the powerplay that allowed them to get into their work.\n\"Georgia Elwiss has a lot of experience behind her but we created a few chances in the field that we created as a bowling unit and that cost us in the end.\"", "url": "https://www.bbc.com/sport/cricket/articles/c5yqqqd3l25o"}