{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:32:15", "date_modify": "2025-04-26 07:32:15", "date_publish": "2025-02-27 16:37:15", "description": "Derby County head coach John Eustace says having a settled team will help the Rams get results and climb the Championship table.", "filename": "sport_football_articles_c62zzqn2r6lo_1745652735.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/72cb/live/11120ce0-f527-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c62zzqn2r6lo_1745652735.html", "title": "John Eustace: 'Having a settled team will help Derby get results'", "title_page": "John Eustace: 'Having a settled team will help Derby get results' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Derby boss John Eustace says he needs a settled team to make things easier as the Rams battle against relegation from the Championship.\nEustace has lost the services of midfielder David Ozoh for the rest of the season and will also be missing defender Matt Clarke for this weekend's game at Middlesbrough.\n\"Matt came off last week at an important time and will be touch and go for the weekend although it's not as bad as we initially thought so we'll wait and see,\" Eustace told BBC Radio Derby.\nDerby have lost both games since Eustace replaced Paul Warne as boss earlier this month and are now second from bottom of the table.\n\"Once we get a settled team it will be a lot easier but when you're losing players from the two games we've had already it is difficult and challenging,\" Eustace added.\n\"I know when we win that first game there will be a real buzz about the place.\n\"If we don't win in the next couple of games there's no problems, we'll be very competitive to the end of the season and go on a run of games where we get results.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c62zzqn2r6lo"}