{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:14:29", "date_modify": "2025-05-21 04:14:29", "date_publish": "2025-04-06 07:43:41", "description": "Dundee striker tipped for Scotland, Celtic midfielder on Rangers counterpart and former Scotland defender linked with managerial return.", "filename": "sport_football_articles_ckgem9mrm1zo_1747800869.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a5e4/live/57fe8e40-12e0-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ckgem9mrm1zo_1747800869.html", "title": "Dundee's Simon Murray deserves Scotland call-up, says Tony Docherty", "title_page": "Dundee's Simon Murray deserves Scotland call-up, says Tony Docherty - Scottish gossip - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Dundee's Scottish forward Simon Murray, 33, deserves international recognition, believes his club boss Tony Docherty. (Scotsman - subscription required), external\nCeltic and Scotland left-back Greg Taylor, 27, could join Dinamo Zagreb as a free agent this summer. (Football Scotland), external\nRepublic of Ireland forward Adam Idah, 24, must leave Celtic to become a first choice striker, says former club midfielder Scott Allan. (Record), external\nFormer Scotland midfielder Callum McGregor, 31, believes having a break during international weekends has benefitted him as Celtic captain this season. (Football Scotland), external\nCeltic midfielder Arne Engels, 21, sees no rivalry between himself and Rangers counterpart Nico Raskin, 24, in the Belgium squad as he regards them as different types of players. (Record), external\nFormer Rangers defender Carlos Cuellar used to refer to current Ibrox interim head coach Barry Ferguson as manager Walter Smith's right-hand man when all were at the club in season 2007-08. (Record), external", "url": "https://www.bbc.com/sport/football/articles/ckgem9mrm1zo"}