{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:41:19", "date_modify": "2025-05-20 13:41:19", "date_publish": "2023-08-01 14:29:11", "description": "Veteran centre-back Curtis Davies might be the oldest player at new club Cheltenham Town but says he is embracing it.", "filename": "sport_football_66373091_1747748479.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/E8E4/production/_130602695_shutterstock_editorial_14021529cu.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66373091_1747748479.html", "title": "Curtis Davies: Defender on senior role at new club Cheltenham", "title_page": "Curtis Davies: Defender on senior role at new club Cheltenham - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Veteran centre-back Curtis Davies might be the oldest player at new club Cheltenham Town but says he is embracing it.\nThe 38-year-old joined the League One club on a one-year deal this summer following his release from Derby after six years.\nThe 2023-24 season will be his 19th as a player since making his debut for Luton Town in 2003.\nHe made 24 appearances for the Rams last season in all competitions.\n\"I did have Phil Jagielka (at Derby) play with me and made me feel young for a couple of months at least,\" Davies told BBC Points West.\n\"But I've always embraced the role of being the senior. I like to help people out on the pitch, off the pitch, it's part of my game that helps me concentrate and helps me do my job right.\n\"It's just something that I've become accustomed to. I think I said to a few of the lads I've got shin pads that are older than them that are 22 years old as well.\n\"It's interesting but when you get to this stage of my career I'm just pleased I can still be out there and running around with the young lads.\"\nDavies has made more than 600 appearances across his career at clubs including Aston Villa, Hull City, West Brom and Leicester.\nHe played alongside Robins head coach Wade Elliott at Birmingham City.\nYet he is one of only four players in the Robins' first team over the age of 25 and is five years older than Liam Sercombe, the next oldest in the squad.\nElliott said adding experience to the team was key.\n\"The predominant makeup of our group is 20 to 24, really good characters, sponges, want to soak up information and they'll lean on Curt for a lot,\" Elliott said.\n\"It was important that Curt's in there and he'll impart some wisdom to them.\"", "url": "https://www.bbc.com/sport/football/66373091"}