{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:15:50", "date_modify": "2025-04-26 06:15:50", "date_publish": "2025-03-01 21:01:45", "description": "Watford head coach Tom Cleverley says he is not concerned by his side's inability to score in their 0-0 draw with Stoke City.", "filename": "sport_football_articles_cy4v82kgmllo_1745648150.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/928b/live/97b8ad90-f6de-11ef-a7dd-3bc09b1d9495.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cy4v82kgmllo_1745648150.html", "title": "Tom Cleverley: Watford boss believes in his side's 'firepower and quality' despite 0-0 draw", "title_page": "Tom Cleverley: Watford boss believes in his side's 'firepower and quality' despite 0-0 draw - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Watford boss Tom Cleverley still believes the Hornets are good enough to reach the Championship play-offs despite being held to a goalless draw at struggling Stoke.\nSaturday's stalemate leaves Cleverley's men still three points off the top six after failing to score for the eighth time in 35 Championship games this term - and they have only hit 45 goals.\nBut he told BBC Three Counties Radio: \"If we continue to play like that for the last 11 games then I have no doubt we will achieve our goals because we have the firepower and the quality.\n\"In the first half we controlled it but didn't have much to show for it. I felt we needed more intent and to commit a few more numbers forward.\n\"We certainly took the initiative after half-time and for 25-30 minutes I thought we were going to break them down.\n\"It's something I haven't said too often this season, but we lacked a cutting edge in and around their box because we couldn't break them down.\n\"They came strong in the last five or 10 minutes and pushed us to the end. But we controlled the game enough to win it.\n\"After half-time we had five shots in seven minutes. Were they outstanding chances? No. But it felt like a matter of time.\n\"Unfortunately, you have these kinds of days. It's not something I can complain of too much this season. We have scored in a high percentage of our games.\n\"We are a little bit disappointed that we haven't come away with all three points, but it is a big turnaround from where we have been away from home.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cy4v82kgmllo"}