{"authors": ["Ffion Wynne", "www.facebook.com"], "date_download": "2025-05-21 06:31:47", "date_modify": "2025-05-21 06:31:47", "date_publish": "2025-01-31 11:12:43", "description": "A dismal fielding performance from England, alongside Annabel Sutherland's sparkling century, gives Australia complete control of the one-off Test match in Melbourne.", "filename": "sport_cricket_articles_c627l8dd1qmo_1747809107.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/57c7/live/f38b51c0-dfc5-11ef-a819-277e390a7a08.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c627l8dd1qmo_1747809107.html", "title": "Women's Ashes 2025: Annabel Sutherland hits 163 and England drop seven catches as Australia take control", "title_page": "Women's Ashes 2025: Annabel Sutherland hits 163 and England drop seven catches as Australia take control - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Annabel Sutherland's sparkling century and seven dropped catches from England gave Australia complete control of the one-off Ashes Test match in Melbourne.\nThe hosts, eyeing a 16-0 clean sweep for the series, finished day two on 422-5 and with a commanding lead of 252.\nSutherland was dropped on 29 and 31 by Danni Wyatt-Hodge and Amy Jones respectively before grinding England down to reach 163 from 258 balls, her third Test century in just six matches.\nBeth Mooney also ruthlessly punished England's mistakes, as she was dropped three times on eight, 11 and 18 before finishing the day unbeaten on 98.\nAll-rounder Sutherland added 80 for the second wicket with Phoebe Litchfield, who was caught behind for 45 off Lauren Bell after a fine opening spell, then added a further 71 with captain Alyssa Healy and 154 with Mooney as England's bowlers toiled admirably but were horribly let down in the field.\nEcclestone removed Ash Gardner for 44 late in the day after she had also been put down on 12 and 36, but Australia have a wilting England side at their mercy with two days to play. They even had the luxury of resting an injured Ellyse Perry as a precaution.\nEngland's selection was brought into question with Ecclestone bowling 39 overs in the innings so far, with Ryana Macdonald-Gay's medium pace preferred to Charlie Dean's off-spin.\nThe day also saw a new world record attendance for a women's Test with a crowd figure of 23,561 in just two days - surpassing the previous record of 23,207 at Trent Bridge in 2023.\nConsidering the dismal nature of the tour so far for England, the fact this was arguably their worst day speaks volumes.\nYoungsters Litchfield and Sutherland looked at ease in the morning session before Bell drew an outside edge from the former, gaining reward for a lively and economical spell which tested the batters' patience regularly.\nBut that was a very rare bright spark in England's day as the painfully familiar sight of spilled catches dominated the day.\nThough Macdonald-Gay dropped the first chance to get rid of Mooney - a straightforward catch at cover with the batter on eight - she responded admirably with the ball to produce three more chances.\nBut they were all spilled. Ecclestone and Maia Bouchier dropped the next two at slip and gully respectively, before Ecclestone also dropped Gardner off Macdonald-Gay on 12.\nGardner received another life from Lauren Filer on 36 but a much tougher effort was put down in her follow-through.\nMacdonald-Gay was rewarded with Sutherland's wicket but given her inexperience, she lacked the consistency to play a holding role for Heather Knight which led to the increased workload on Ecclestone.\nEngland's fielding has been below-par throughout the series but perhaps more of a concern is the immediate dip in body language and attitude which follows, and leads to the drops becoming seemingly contagious for all.\nAustralia all-rounder Annabel Sutherland on her century: \"It was pretty special. To have a Test match here at the G, have a good time and score some runs, it's pretty special. I got to do it in front of family and friends.\n\"I love batting. Anytime I get a chance I try and cash in. I know how important it is to get ahead in the game. We've kept them out there and we'll try to get as far ahead as we can.\n\"I think we were pretty keen to get more of a lead. Ideally we'll only bat once and look to take 10 as fast as we can.\"\nEngland fast bowler Lauren Filer: \"It's not been the tour we wanted. We all know we're better than this, we don't need reminding. Hopefully over the next few days we can show what we're made of.\"", "url": "https://www.bbc.com/sport/cricket/articles/c627l8dd1qmo"}