{"authors": ["Adam Blackmore", "www.facebook.com"], "date_download": "2025-05-21 06:15:04", "date_modify": "2025-05-21 06:15:04", "date_publish": "2025-04-01 10:45:39", "description": "Southampton Q&A: Any positives to cling to from this season?", "filename": "sport_football_articles_c62zggkgn97o_1747808104.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4b1f/live/8af30b60-0e4d-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c62zggkgn97o_1747808104.html", "title": "Southampton Q&A: Any positives to cling to from this season?", "title_page": "Southampton Q&A: Any positives to cling to from this season? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "On Tuesday, we are publishing a special Q&A with BBC Radio Solent's Adam Blackmore. In part two, we look at the positives Southampton can cling to from this season.\nNoah asked: What do you think about our positives this season? Not many people are talking about them, but I think we have quite a bit of talent behind our players, only they can't display it.\nAdam: It is hard to sell the positives during such a difficult season. But I think it is a good thing to do, and you are right to try to be positive.\nWe felt similarly forlorn after the 2023 relegation, which statistically was Saints' worst Premier League season. Twelve months later, the fans were all at Wembley having the best day out! Equally, this season could turn into something entirely more positive in the next 12 months.\nHaving said all that, how many positives can really be taken? Which players have improved over the course of this season? The two that stand out are of course Tyler Dibling and Mateus Fernandes. I also think Aaron Ramsdale has been worth every penny. But do we expect any of those three to be at the club come September? All talented yes, but also the most saleable players, unfortunately.\nThe only other positive, I think, is the supporters, to be honest. Their resilience and fortitude shows the owners of the club they should do everything in their power to get the club on an upward trajectory for the long term because those fans deserve it. Away from home in hopeless situations, they have been magnificent.", "url": "https://www.bbc.com/sport/football/articles/c62zggkgn97o"}