{"authors": ["Nick Webb", "www.facebook.com"], "date_download": "2025-05-19 15:12:20", "date_modify": "2025-05-19 15:12:20", "date_publish": "2017-07-04 16:01:21", "description": "Gloucestershire ease to a 10-wicket victory over Glamorgan after Liam Norwell's 6-38 sets them up to successfully chase 135.", "filename": "sport_cricket_40488968_1747667540.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/15F35/production/_96790998_norwell.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_cricket_40488968_1747667540.html", "title": "Gloucestershire v Glamorgan: Liam Norwell's 6-38 sets up victory for hosts", "title_page": "Gloucestershire v Glamorgan: Liam Norwell's 6-38 sets up victory for hosts - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Gloucestershire eased to a 10-wicket victory well inside two days after being set a modest target of 135 by Glamorgan at Cheltenham.\nCameron Bancroft and Chris Dent eased any nerves on a variable pitch with an unbeaten opening stand of 137.\nEarlier, Liam Norwell took the final three Glamorgan wickets for a season's best 6-38 as the visitors made 158.\nAndrew Salter (31), Graham Wagg (30) and Chris Cooke (23 not out) could not contrive a competitive lead.\nThe clatter of wickets slowed down dramatically after 25 fell on day one, though batting was still difficult early on because of inconsistent bounce, until Bancroft and Dent nearly trebled the previous best stand of 46.\nIt was Gloucestershire's second Championship win of the 2017 campaign, while Glamorgan suffered their third defeat in a row, as the teams now head into the T20 Blast, which begins on Friday, 7 July.\nGloucestershire captain Phil Mustard told BBC Radio Bristol:\n\"Cricket is a funny game and I have never been involved in a game quite like that. To be honest, the scores might not suggest it but the pitch was fine.\n\"I thought our bowlers bowled well as a team and we have got the job done today, that is pleasing. It sets us up and pulls things together for the T20.\"\nGlamorgan coach Robert Croft told BBC Wales Sport:\n\"The game was nailed on day one, 25 wickets fell and it did everything just enough, it swung, nothing to do with the pitch, it seamed just enough, there was just enough even bounce, and it was two-paced just enough.\n\"Both sides showed it was difficult to bat on and if we'd been none down overnight we could have capitalised. It wasn't to be, but (on the second day) the pitch was a heck of a lot better.\n\"It has been a challenging three weeks but we've got to regroup, reflect on those matches and the two wins before that (so we can) compare and contrast what was good and what wasn't.\"", "url": "https://www.bbc.com/sport/cricket/40488968"}