{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:28:18", "date_modify": "2025-05-21 07:28:18", "date_publish": "2025-03-28 13:07:42", "description": "England trio Marcus Smith, Fin Baxter and Chandler Cunningham-South will return to the Harlequins side for Saturday's match at Premiership leaders Bath.", "filename": "sport_rugby-union_articles_c4geg9kpydxo_1747812498.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0ef6/live/0306aee0-0bd3-11f0-af58-ad3b17745e6c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c4geg9kpydxo_1747812498.html", "title": "Bath v Harlequins: Quins recall England stars for Premiership match", "title_page": "Bath v Harlequins: Quins recall England stars for Premiership match - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England trio Marcus Smith, Fin Baxter and Chandler Cunningham-South will return to the Harlequins side for Saturday's match at Premiership leaders Bath.\nThe internationals sat out the 23-12 comeback victory against London rivals Saracens last weekend as they had a mandatory rest period following the Six Nations.\nThe win lifted the Twickenham-based club to fourth in the table with six games remaining.\n\"Great performance from everyone involved. I think there was an element of getting the tactics right and an element of grit and determination to stay in the fight,\" head coach Danny Wilson told BBC Radio London.\n\"The boys did that against a very good Saracens side at a venue where they would be 100% favourites.\"\nA win at the Recreation Ground on Saturday (15:05 GMT) would strengthen their grip on a spot for the end-of-season semi-finals.\n\"They're a very good side - [they have] unbelievable squad depth. The bench that they seem to be able to put out week in, week out is really impressive,\" Wilson said.", "url": "https://www.bbc.com/sport/rugby-union/articles/c4geg9kpydxo"}