{"authors": ["Rob Dugdale", "www.facebook.com"], "date_download": "2025-05-19 14:42:03", "date_modify": "2025-05-19 14:42:03", "date_publish": "2017-08-19 19:27:34", "description": "Great Britain are beaten 84-88 by Greece in a dramatic finish to their EuroBasket warm-up game at the Copper Box in London.", "filename": "sport_basketball_40989783_1747665723.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7283/production/_97451392_basketball2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_basketball_40989783_1747665723.html", "title": "Great Britain lose to Greece in tight EuroBasket warm-up", "title_page": "Great Britain lose to Greece in tight EuroBasket warm-up - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Great Britain lost to EuroBasket contenders Greece for the third time this summer, 84-88 in a dramatic finish to their warm-up game at the Copper Box.\nGB trailed 84-83 with 24 seconds remaining and stole the ball, but missed a shot and a free throw, with Greece's four free throws sealing the game.\nDan Clark had 23 points to lead GB's scoring, with Gabe Olaseni and Luke Nelson adding 20 and 13 points respectively.\nThe defeat is GB's fifth in their warm-up games for next month's EuroBasket finals.\nOn a four-game losing streak after a 72-68 behind-closed-doors loss on Friday to their visitors, GB looked eager to make a mark early, but had to come from behind to share the first quarter 22-22.\nGreece were missing four regulars, including NBA star Giannis Antetokounmpo and two other starters, but their wealth of talent - almost the entire squad plays in the continent's top league, the Euroleague - meant they were still tough opponents for head coach Joe Prunty's team.\nThat showed in the second quarter as centre George Papagiannis, fed by classy point guard Kostas Sloukas, ignited a 10-0 run for a 32-25 lead before Gabe Olaseni and newcomer Luke Nelson brought GB back to lead briefly, 40-39 on Nelson's assured three-pointer.", "url": "https://www.bbc.com/sport/basketball/40989783"}