{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:30:04", "date_modify": "2025-05-21 07:30:04", "date_publish": "2025-03-28 18:05:39", "description": "Dundee United have to 'make amends' for derby defeat - Goodwin", "filename": "sport_articles_cq8y8zwdx2eo_1747812604.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f025/live/6c7d4be0-0bf1-11f0-871c-d1f484049253.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cq8y8zwdx2eo_1747812604.html", "title": "Dundee United have to 'make amends' for derby defeat", "title_page": "Dundee United have to 'make amends' for derby defeat - Goodwin - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jim Goodwin has challenged Dundee United to \"make amends\" for their derby defeat by securing a top-six finish.\nUnited's 4-2 loss before the international break was their first home defeat to Dundee since 2004.\nNow they travel to Dingwall on Sunday knowing a win over Ross County, plus favourable results elsewhere, could secure their top-six spot with two games to spare before the split.\n\"That Dundee game was so out of character in terms of the manner of the defeat and the goals we conceded but we can't dwell on it,\" Goodwin said.\n\"We can't feel too sorry for ourselves. We've got an opportunity on Sunday to make amends.\n\"The next game is always the biggest and the most important one. We might have the opportunity, with a positive result, to try and cement that top-six position.\n\"It's really important we finish the job off now.\"\nUnited's planning for next season is already well under way and the club are seeking a new head of recruitment to replace the outgoing MIchael Cairney.\n\"I'm really disappointed to hear Michael is going to be leaving,\" Goodwin added.\n\"I think it's a compliment that we identified a really good head of recruitment who did a fantastic job for us.\n\"There's a lot to the decision-making process for Michael, the opportunity that has been offered is closer to home and I'd imagine there's a little bit more salary as well.\n\"For Michael it's the right move but we're disappointed to see him leave. We believe this is the beginning of a long-term project for us and Michael has been an important part of that.\"", "url": "https://www.bbc.com/sport/articles/cq8y8zwdx2eo"}