{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:04:07", "date_modify": "2025-05-21 04:04:07", "date_publish": "2025-04-04 06:17:40", "description": "Plymouth Argyle head coach Miron Muslic feels his side must beat Norwich City if they are to stand any hope of surviving in the Championship.", "filename": "sport_football_articles_c62g4jdnx35o_1747800247.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9511/live/edc48420-10a6-11f0-9af0-9909a653fc84.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c62g4jdnx35o_1747800247.html", "title": "Plymouth Argyle 'have to win' Norwich City clash", "title_page": "Plymouth Argyle 'have to win' Norwich City clash - Miron Muslic - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Plymouth Argyle head coach Miron Muslic feels his side must beat Norwich City if they are to stand any hope of avoiding relegation from the Championship.\nThe Pilgrims are seven points from safety at the bottom of the table, with seven games to play, including meetings with leaders Sheffield United and second-placed Leeds United.\nArgyle have won just one of their last eight league matches and were thrashed 6-1 by Norwich at Carrow Road in November when then-head coach Wayne Rooney said the club's youth team could have done better.\n\"We have to win on Saturday,\" Muslic told BBC Radio Devon.\n\"We have to have this desire and the heart to go outside and take this opportunity to grab the three points, then you never know.\n\"If we don't manage to do this then I think it's going to be very, very difficult, then I cannot be optimistic any more.\n\"But the desire is there to win these three points and then we will see.\"\nNorwich go into the game having been thrashed 6-2 on their last visit to Home Park in September 2023 - a result that is still Argyle's biggest win since they returned to the Championship that summer.\nBut victory will also be hugely important for the Canaries as they try and convert an outside chance of a play-off place - they are 10th and five points off the final spot.\n\"I think it will be an open game because I think they also have something to play for,\" added Muslic.\n\"They won't come here to defend, they won't come here in a deep block, they will try to attack because I think if they can manage to try and grab the three points the gate is also open for them to attack the play-offs.\n\"Our desire should be way, way bigger to win this game, and this is the plan.\"", "url": "https://www.bbc.com/sport/football/articles/c62g4jdnx35o"}