{"authors": ["Alex Hoad", "www.facebook.com"], "date_download": "2025-05-20 11:57:03", "date_modify": "2025-05-20 11:57:03", "date_publish": "2023-08-06 11:32:30", "description": "Ipswich Town celebrate their return to the Championship with victory against 10-man Sunderland at the Stadium of Light.", "filename": "sport_football_66352122_1747742223.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1470F/production/_130672738_shutterstock_editorial_14039963au.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66352122_1747742223.html", "title": "Sunderland 1-2 Ipswich Town: Goals in each half give Tractor Boys win on return to Championship", "title_page": "Sunderland 1-2 Ipswich Town: Goals in each half give Tractor Boys win on return to Championship - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ipswich made a dream return to the Championship after clinging on to record an eye-catching win at 10-man Sunderland.\nGoals either side of half-time from Nathan Broadhead, a former Sunderland loanee, and George Hirst, saw the Tractor Boys continue the momentum which saw them finish last season's League One campaign unbeaten in 19 matches.\nSunderland's youthful side looked good in the first half and, despite having Trai Hume sent-off 18 minutes from time, they ensured a rousing finale as Dan Neil clipped in a volley on 86 minutes and then hit the post 14 minutes into added time.\nIpswich held on and are now unbeaten in their opening league fixture over the past 10 seasons.\nSunderland started brightly and pinned the visitors back but it was Ipswich's Newcastle-born wing-back Leif Davis who came closest in the opening 20 minutes as he saw a far-post volley superbly hacked off the line by Luke O'Nien.\nAt the other end, Sunderland debutant Jobe Bellingham missed with the goal at his mercy, sending a first time shot over the bar after Pierre Ekwah's low strike was only parried by Vaclav Hladky, who was making his first start since December 2021 in place of the injured Christian Walton.\nNeil dragged past the base of the post for the hosts just before the half hour while Broadhead cleverly back-heeled to Conor Chaplin who saw a low strike deflect inches wide soon after.\nJack Clarke saw appeals for a penalty dismissed for the hosts after a tussle with Janoi Donacien before the deadlock was broken in first-half stoppage time when Sunderland failed to deal with a long throw and Davis' volley from outside the box deflected past Anthony Patterson off the shin of Broadhead, who did not celebrate against the side for who he scored 10 goals to help earn promotion to the Championship in 2022.\nKieran McKenna's half-time team-talk saw Ipswich look far more measured after the interval and Hirst - who made his loan switch from Leicester permanent in the summer - doubled Town's advantage eight minutes after the break, latching on to a sublime through ball from Broadhead and lashing a high shot past Patterson from an angle.\nChaplin came close to an immediate third with an opportunist strike from the centre circle which came back off the bar and appeals for a penalty for a foul on Hirst by Dan Ballard as he tried to connect with the rebound were waved away.\nPatterson had to dive to his left to deny Broadhead's curler before the hour and Sunderland's task was made harder when Hume saw red on 72 minutes as he picked-up a second booking for kicking the ball away in frustration after clipping the marauding Davis.\nDennis Cirkin and Clarke saw low drives deflected wide as the hosts sought to mount a late comeback and four minutes from time they were back in the game when Cirkin drove to the byline before crossing for Neil to clip a superb near-post volley past Hladky.\nPatrick Roberts' stooping volley was deflected wide by Ipswich sub Freddie Ladapo as Sunderland pushed for an equaliser, while Neil saw a far-post shot deflected onto the post by Hladky in the 14th minute of added time.\nIt was a first defeat against Ipswich in six matches as a manager for Tony Mowbray, whose last game as a player was for the Tractor Boys in the 2000 play-off final when they were promoted to the Premier League - the last time the club had been promoted until this year.\nSunderland manager Tony Mowbray told BBC Radio Newcastle:\n\"We have to respect that they [Ipswich] are a decent team, we've watched their pre-season (games), they are well structured, they've got good rotations and they're confident, they won a lot of games last season.\n\"The first 15 minutes it was all one-way traffic, I think they were catching their breath really and then gradually worked their way into the game.\n\"You have to put the ball in the net and I do think we need more options at the top end of the pitch and the club are trying really hard to do that.\n\"Is that what football's going to be like now - 13, 14, 15 minutes added on? I'm not trying to deflect from the match, I'm just trying to say 'is this what we have to do for the next 40 weeks?' Goodness me.\"\nIpswich boss Kieran McKenna told BBC Radio Suffolk:\n\"Getting points on the board early is important. More important is the application of the players. We talked about setting a tone and I think we set a good tone for how hard we work and how hard we are going to have to work.\n\"It was a really high level game. It was a big challenge against a very strong opponent at home with a full house and good momentum and it took every inch of effort from the whole squad to get the result.\n\"I think the level of the game and the opponent was certainly a step up and I think the players felt that in the first 20 minutes.\n\"It was bodies on the line at the end and we had to rely on a bit of luck and some good saves and good defending to get us over the line. We know how hard we're going to have to fight for points and how much we're going to have to work to improve every aspect of our game to keep delivering good performances.\"", "url": "https://www.bbc.com/sport/football/66352122"}