{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:44:42", "date_modify": "2025-05-21 06:44:42", "date_publish": "2025-03-30 18:15:18", "description": "IPL 2025 results: RR beat CSK as England's Jofra Archer rediscovers form", "filename": "sport_cricket_articles_c1jxlerj5nro_1747809882.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7675/live/224b7e70-0d90-11f0-80e2-6f5e46851467.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c1jxlerj5nro_1747809882.html", "title": "IPL 2025 results: RR beat CSK as England's Jofra Archer rediscovers form", "title_page": "IPL 2025 results: RR beat CSK as England's Jofra Archer rediscovers form - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England fast bowler Jofra Archer took his first wicket in this year's Indian Premier League as Rajasthan Royals beat Chennai Super Kings by six runs.\nArcher chalked up the most expensive figures in IPL history - 0-76 from four overs - in his first match of the 2025 tournament against Sunrisers Hyderabad a week ago.\nHis second outing for the Royals versus Kolkata Knight Riders last Wednesday was not much better as his 2.3 wicketless overs were dispatched for 33.\nHowever, the 29-year-old bowled with pace and aggression to finish with 1-13 from three overs in a gritty win over CSK as Rajasthan registered their first victory of the campaign.\nArcher conceded just one run in his first two overs and became the first player to bowl a maiden in this year's IPL.\nIt set the tone for Rajasthan in the field as CSK were kept in check by a disciplined bowling and fielding display.\nCSK skipper Ruturaj Gaikwad made 63 off 44 balls but he was one of four wickets to fall to Royals spinner Wanindu Hasaranga (4-35).\nHowever, with master finisher Mahendra Singh Dhoni at the crease, 20 needed off the last six balls, and a frenzied yellow wall roaring him on, CSK still had hope.\nRoyals skipper Riyan Parag opted to give Sandeep Sharma the final over of the game, instead of Archer, and he got the job done.\nDhoni whacked his first legal delivery to deep mid-wicket where Shimron Hetmyer took a spectacular catch before Sandeep kept his nerve to close out the game.\nEarlier, Nitish Rana clubbed a 36-ball 81 and Parag 37 made off 28 as Rajasthan posted 182-9 from their 20 overs.\nNoor Ahmad and Matheesha Pathirana both finished with 2-28 from their four overs for the Super Kings who had battled back gamely after Rana had got Rajasthan off to a flyer.", "url": "https://www.bbc.com/sport/cricket/articles/c1jxlerj5nro"}