{"authors": ["Nick Webb", "www.facebook.com"], "date_download": "2025-05-20 12:40:19", "date_modify": "2025-05-20 12:40:19", "date_publish": "2023-08-03 09:19:20", "description": "Glamorgan coach David Harrison is confident for One Day Cup progress ahead of Friday's Worcestershire opener, after a late coaching switch.", "filename": "sport_cricket_66384495_1747744819.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8D4B/production/_130617163_cdf_170822_ge_glamorgan_v_lancashire_039.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66384495_1747744819.html", "title": "One Day Cup: Glamorgan confident despite late changes", "title_page": "One Day Cup: Glamorgan confident despite late changes - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Glamorgan start their One Day Cup campaign away to Worcestershire on Friday in the wake of a surprise late change in the coaching staff.\nDavid Harrison resumes the role he has held for the last two summers after Mark Alleyne's switch to the Welsh Fire staff.\nGlamorgan were fourth in their group in 2022 while Worcestershire were bottom.\nBut the Pears have already won their first game, beating Durham by 42 runs away from home.\nHarrison was at the helm for Glamorgan's 2021 triumph, in the first season the 50-overs competition was played alongside the Hundred, while Alleyne's first T20 campaign with Glamorgan saw them collect just five wins from 14.\nThe Welsh side's squad have only lost Chris Cooke and Dan Douthwaite to the Hundred, while David Lloyd is an unexpected absentee after he was allowed to join Derbyshire on loan ahead of his move there.\nBut Sam Northeast and Timm van der Gugten are rested from the opening game, with potential debuts in the format for batter Will Smale, wicketkeeper Alex Horton, spin-bowling all-rounder Ben Kellaway and seamer Ben Morris- who would be playing his first competitive game for the county.\nWorcestershire are without England bowler Josh Tongue, Adam Hose, Mitchell Stanley and Pakistani spinner Usama Mir, who was drafted in by the Pears from Colwyn Bay CC.\nTeams in Glamorgan's group are on average missing two players fewer to the franchise event than the other nine counties, meaning stronger competition.\n\"I'm confident that the group of players we have can progress to the quarter-finals, but we know we've got a lot of work to do,\" said Harrison.\n\"The competition always provides an opportunity for young players to progress and we'll hopefully get to see that again this year.\"\nMost likely to have that opportunity is 19-year-old Horton, who played four T20 Blast matches in 2022 when Cooke was injured but has otherwise seen first-team chances blocked by the continuing excellence of the 37-year-old with the gloves.\n\"It's great that Chris got picked up by the Hundred, he deserved it, but it's an opportunity for me to get involved with the first team and show what I can do, so I'm really excited,\" Horton told BBC Sport Wales.\n\"It'll be nice to play a consistent amount of games for the first team, and we've got a strong team out so we're really confident.\n\"The T20s last season gave me experience, and coming from the (England) Under-19s, the professionalism of that was spot-on for how I want to be when I come into the first team. The World Cup was awesome, one of the best experiences of my life.\"\nKiran Carlson, 25, was always earmarked to lead Glamorgan in the One Day Cup, for the third year running, but has also captained them in the Championship and T20 during Lloyd's two-month injury absence.\n\"I've learned quite a lot and captained quite a bit this year while Lloydy was off injured, so I'm learning on the job as I go with support around me from the experienced guys,\" Carlson said.\n\"I'm being true to myself in how I want to captain, very positive and letting guys express themselves on the pitch.\"\nMeanwhile, Eddie Byrom, who made an impact in the early T20 games before injury, is likely to come into the 50-overs side for the first time, possibly opening alongside Tom Bevan.\n\"I was aiming to be fit for this tournament, so I'm looking forward to getting stuck in and hopefully having a good campaign. I love it at the top of the order and hopefully I can grab the opportunity with both hands, wherever I'm batting,\" Byrom told BBC Sport Wales.\n\"Our hopes are very high and I can't see why we can't do the same thing as a couple of years ago.\"\nWith Byrom, Colin Ingram, Carlson and Billy Root in the ranks, Glamorgan have batting experience even without Northeast.\nBut with no overseas bowler for this competition, the issue will be how to get enough bowling resources into the team, with only Carlson of the batters providing regular options with the ball this season.\nWorcestershire (from): A Ali, D'Oliveira, Pollock, R Jones, Libby (c), K Ali, Roderick, B Cox, Waite, Leach, Baker, Pennington, Gibbon, C Jones, Darley.\nGlamorgan (from): Byrom, Bevan, Ingram, Smale, Carlson (c), Root, Kellaway, Horton, Podmore, Gorvin, Sisodiya, Morris, McIlroy.", "url": "https://www.bbc.com/sport/cricket/66384495"}