{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:15:34", "date_modify": "2025-05-21 06:15:34", "date_publish": "2024-12-24 15:10:02", "description": "Stephen Robinson optimistic of extending Declan John's St Mirren deal", "filename": "sport_articles_cm2exwnyem7o_1747808134.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f87a/live/f4e88220-c208-11ef-8a89-27b3f287e995.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cm2exwnyem7o_1747808134.html", "title": "Stephen Robinson optimistic of extending Declan John's St Mirren deal", "title_page": "Stephen Robinson optimistic of extending Declan John's St Mirren deal - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manager Stephen Robinson is \"optimistic\" that talks with Declan John will result in the Wales defender staying at St Mirren until at least the summer.\nThe 29-year-old, who arrived in November on a short-term deal until January, has only made two substitute appearances so far but will replace the suspended Scott Tanser for the visit of Rangers on Boxing Day.\n\"It was short term initially but we're speaking to Declan currently about extending that deal, because we feel he's been very good cover,\" said Robinson.\n\"He's getting the fitness, he's played at very good levels, and he's added a bit of quality to us.\n\"And it's important that Scott has that competition, and they're both fighting to be the number one.\n\"I'm optimistic, at least until the end of the season. He's enjoyed himself without getting the game time. He was due to start on Saturday (at Ross County), but ended up coming down with an illness overnight in the hotel.\"\nFormer Rangers defender John said: \"We have been having a chat with the club over the last week or so, so we'll see where things go.\n\"When I got the phone call, it was an easy decision for me to come up. I know the league fairly well from when I was up here previously. So, it's been all good so far.\"\nRobinson also revealed skipper Mark O'Hara, thought to be out for four to six weeks with a thigh problem, is \"maybe not as bad as we first feared\" and could be back sooner.", "url": "https://www.bbc.com/sport/articles/cm2exwnyem7o"}