{"authors": ["David Currie", "www.facebook.com"], "date_download": "2025-05-21 05:17:27", "date_modify": "2025-05-21 05:17:27", "date_publish": "2025-04-03 17:11:42", "description": "Kilmarnock not 'sucking our thumbs & thinking everything's against us'", "filename": "sport_articles_cy0xlr12dnko_1747804647.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/201f/live/26350c10-10ae-11f0-a687-87f1851e5d51.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cy0xlr12dnko_1747804647.html", "title": "Kilmarnock not 'sucking our thumbs & thinking everything's against us'", "title_page": "Kilmarnock not 'sucking our thumbs & thinking everything's against us' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Derek McInnes says Kilmarnock are not \"sucking our thumbs and feeling sorry for ourselves\" as they attempt to rebound from the hammering at St Mirren by easing relegation worries this weekend.\nThe 5-1 loss in Paisley means Killie have suffered four defeats in a five-game winless run and are just a point above second-bottom Dundee.\n\"It was a sore one for us, now it's all about the response,\" said McInnes, whose side host Motherwell on Saturday.\n\"We've had some good results, last year we were celebrating there with the supporters, finishing fourth and securing a European spot. It was tough for the supporters on Saturday, it was tough for us all.\n\"I was gutted when I saw the Killie end empty as quickly as it did. But we're not feeling sorry for ourselves, we're not rolling over sucking our thumbs and thinking everything's against us.\"\nThe Killie boss is confident his players are up to the challenge, and says his experience will stand him in good stead for the remaining seven games of the season.\n\"I've worked with these players long enough now, I trust the players. I think no matter what people say, these boys care,\" he added.\n\"These are the boys that exceeded expectations last season, so I think they're deserving of a bit of trust, and certainly I trust how I work and how we work together as players.\n\"I've had a lot of good times as a manager, a lot of real highlights, and it's been more good than not.\n\"But I understand management, it can't always be sunshine and rainbows. You've got to make sure that you get through the tough games and the tough times.\"", "url": "https://www.bbc.com/sport/articles/cy0xlr12dnko"}