{"authors": ["Brent Pilnick", "www.facebook.com"], "date_download": "2025-05-21 05:48:24", "date_modify": "2025-05-21 05:48:24", "date_publish": "2025-04-02 11:30:19", "description": "League One side Cornwall RLFC fold due to financial issues, just four years after being formed.", "filename": "sport_rugby-league_articles_c87px8vlrvxo_1747806504.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/acce/live/bfe44990-0fb2-11f0-955c-1d008c063810.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-league_articles_c87px8vlrvxo_1747806504.html", "title": "Cornwall RLFC: League One side folds due to finance issues", "title_page": "Cornwall RLFC: League One side folds due to finance issues - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "League One side Cornwall RLFC have folded because of financial issues and have pulled out of League One with immediate effect as a result.\nThe club, which was formed in 2021, was taken over by Cornish businessman Kenny Stone in November.\nBut Stone says he is unable to bring in new investors to help fund them going forward.\nStone took over from a consortium led by Canadian owner Eric Perez with the aim of making it a community-based club.\nBut their record home loss - a 78-6 defeat by Whitehaven at Penryn - has proved to be their last match.\nThe news comes as Super League side Salford struggle with ongoing financial issues, which has seen the club lose a host of players and win just one game so far this season.\n\"The club's current ownership group, who gained control of Cornwall RLFC back in November, immediately sought further investment to try and stabilise the club and to grow the game of rugby league in the Duchy, through a professional club,\" a statement on Cornwall's website read.\n\"Significant progress was made with potential overseas investors to achieve this although sadly, due the current uncertainties in the United States of America, this has not been possible.\n\"The club have subsequently explored other avenues to secure required funding, but these have been extensively exhausted, leaving Cornwall RLFC with no option other than to withdraw immediately.\n\"Cornwall RLFC would like to place on record its thanks to the club's players, coaching staff, officials, sponsors and fans for their unwavering support over the past four years.\"\nThe demise of Cornwall is the latest from a 'non-heartland' area to fail in the professional game.\nClubs including Nottingham City and West Wales Raiders have folded in recent years, while London Skolars pulled out of League One in 2023.\nCornwall's RFL licence was that of Hemel Stags with the hope that the county, which has a rich rugby union history, would be able to provide a strong base for a rugby league side.\nBut they struggled in their three full seasons - winning just one game in 2022.\nInitially led by former Widnes and Dewsbury boss Neil Kelly, locally-based Mike Abbott became head coach in 2023.\nHe led the Choughs to their best season in his first year when they won five matches, including a first-ever win over a heartland side.\nLast season saw them register just three wins - two coming against struggling Newcastle Thunder - the same team they got their only win of 2025 against.\nIt ends an experiment in professional rugby league in Cornwall which saw the club set records for the furthest-ever away trip and saw a first-ever Challenge Cup game played in the county in 2023.", "url": "https://www.bbc.com/sport/rugby-league/articles/c87px8vlrvxo"}