{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-04-26 04:07:40", "date_modify": "2025-04-26 04:07:40", "date_publish": "2025-03-02 22:31:11", "description": "Manchester City boss Pep Guardiola says Ballon d'Or-winning midfielder Rodri could return before the end of the season.", "filename": "sport_football_articles_cgl0e47ge5jo_1745640460.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6304/live/d8eb94d0-f765-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cgl0e47ge5jo_1745640460.html", "title": "Rodri: Manchester City midfielder could return this season, says Pep Guardiola", "title_page": "Rodri: Manchester City midfielder could return this season, says Pep Guardiola - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Manchester City boss Pep Guardiola says Ballon d'Or winner Rodri could return to action this season.\nFootage of the Spain midfielder training was posted by the club on Friday, less than 24 hours before they advanced to the FA Cup quarter-finals by beating Plymouth Argyle.\nCity officials are desperate to play down any kind of immediate timescale on Rodri's return.\nBut given how much the Euro 2024 winner has been missed - the Premier League champions are currently fourth in the table, 20 points behind current leaders Liverpool after eight league defeats - it is not surprising the images generated a huge amount of excitement among their fans.\nAnd, for the first time since Rodri suffered a major knee injury against Arsenal in September, Guardiola feels the 28-year-old could feature before the end of the campaign, with the Fifa Club World Cup to follow in June.\n\"The fans must know they are not the only ones who are excited,\" said the City boss. \"It's been five months or six months.\n\"But [it's] one step at a time. We don't have to make stupid decisions [for him] to come weeks earlier. He's not close to coming back, but he's touching the ball and is in the locker room.\n\"He feels confident and happy.\n\"I could not expect before [him to return] before the end of the season, not even for the [Club] World Cup, but maybe it's going to happen.\"\nGuardiola also confirmed defender Nathan Ake will have more tests on a problem he fears might keep the Netherlands international out for some time.\n\"He struggles sometimes with the feet,\" he added. \"It's been like this the whole season with the central defenders.\"\nAke, 30, has been restricted to 18 appearances so far this season due to a succession of short-term injuries and was taken off at half-time against Plymouth. Fellow defenders John Stones and Manuel Akanji also missed the FA Cup win through injury.", "url": "https://www.bbc.co.uk/sport/football/articles/cgl0e47ge5jo"}