{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:01:24", "date_modify": "2025-05-20 12:01:24", "date_publish": "2023-08-05 15:30:59", "description": "Sheffield United 0-3 Vfb Stuttgart: Heckingbottom reaction", "filename": "sport_articles_cl7npnnexxdo_1747742484.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e173/live/0a530f20-33a5-11ee-bb19-d3389a1902ab.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cl7npnnexxdo_1747742484.html", "title": "3 Vfb Stuttgart: Heckingbottom reaction", "title_page": "Sheffield United 0-3 Vfb Stuttgart:  Heckingbottom reaction - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Paul Heckingbottom says Sheffield United are \"still way short\" of the numbers required for their Premier League campaign.\nSpeaking to the club's social media team, external after the Blades' 3-0 defeat to VfB Stuttgart in their final pre-season friendly, Heckingbottom declared himself pleased with the competition but stressed more bodies are needed.\n\"I am very happy fitness-wise but in terms of numbers I think it's clear to see that we are still way short,\" the manager said.\n\"I said last week that we had so much work to do and we are just a few days away now so have got to work really hard.\n\"This was a tough game against good opposition and was a real stretch for us. Arguably our games this season will be even tougher than that.\"\nUnited were able to hand a debut to Benie Traore after he was finally granted a work permit this week and the Ivorian showed hints of his quality in the first half.\n\"He is a young boy that is desperate to play in the Premier League,\" said Heckingbottom. \"We know his attributes and you could see them in moments today.\n\"He has pace, he plays on the shoulder and when we are playing higher up the pitch, he can be a real problem for defences.\"", "url": "https://www.bbc.com/sport/articles/cl7npnnexxdo"}