{"authors": ["Millie Sian", "www.facebook.com"], "date_download": "2025-04-26 06:55:39", "date_modify": "2025-04-26 06:55:39", "date_publish": "2025-02-28 15:15:43", "description": "Andoni Iraola press conference: Bournemouth vs Wolves preview", "filename": "sport_football_articles_c4g00ngjldqo_1745650539.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5908/live/85292f40-6de2-11ef-b970-9f202720b57a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c4g00ngjldqo_1745650539.html", "title": "Andoni Iraola press conference: Bournemouth vs Wolves preview", "title_page": "Andoni Iraola press conference: Bournemouth vs Wolves preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "It will be \"very difficult\" for Ryan Christie to be available, after he was forced off due to injury in their 2-1 defeat to Brighton. Iraola did not rule him out completely but said: \"He has been dealing with a groin injury for a lot of months, it's not something new. Sometimes, when you push and push, there is a moment where you cannot push anymore and you need a small break.\"\nHe has received \"good news\" about Julian Araujo's hamstring injury. The defender has been cleared to \"start training with no limitations\". Araujo is available for this weekend but it could still be \"early for him\".\nIt is not clear when Adam Smith will be back in contention, with Iraola stating: \"He is having some issues in his recovery. I think it was a hamstring injury but now he's having some issues in his calf.\"\nOn being without Illia Zabarnyi, who is serving a three-match suspension after picking up a straight red card, he said: \"It's difficult because when he has been available, we have used him. He is a very robust, reliable and key player for us. We'll have to show that we have more players that can do his job.\"\nAfter being on the end of a 1-0 defeat against Wolves last weekend, he is expecting more of a \"balanced\" game this time around, adding: \"We basically played 30 minutes against 11 players, so we just analysed that. You can use it as a reference, but most of the game was unbalanced. Playing with one player less means that tactically you cannot do a lot of things.\"\nOn Antoine Semenyo's comments about taking \"revenge\" after last weekend's result, he said: \"We can use it in a positive way, but I think they are different competitions. What happens in the cup isn't going to change what happened in the league. We want to go ahead and I suppose they are going to go with everything to win the game as well.\"\nIraola feels it is still \"far too early\" to dream about winning the FA Cup this season, adding: \"One of the teams is going to finish their journey in the competition tomorrow, but we want to be in the draw. We are talking about qualifying for the quarter-finals, which has started to sound really nice. We will try not to fail against Wolves.\"\nOn whether England manager Thomas Tuchel should be looking at recalling Lewis Cook, he said: \"It's not my decision to make. I love Lewis Cook. He's a very good player and I feel very lucky to have him in our squad, but I don't know the plans of the new international manager and I don't know what he thinks. For me, I feel very lucky to have him.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c4g00ngjldqo"}