{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:31:17", "date_modify": "2025-04-26 06:31:17", "date_publish": "2025-02-27 09:42:35", "description": "World number two Alexander Zverev suffers a shock early exit from the Mexican Open with a straight-set defeat against teenage qualifier Learner Tien.", "filename": "sport_tennis_articles_clyjjq1xjl8o_1745649077.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/17f1/live/ae461d90-f4ea-11ef-ae0a-4bca4f518eb0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_tennis_articles_clyjjq1xjl8o_1745649077.html", "title": "Mexican Open: Qualifier Learner Tien stuns world number two Alexander Zverev", "title_page": "Mexican Open: Qualifier Learner Tien stuns world number two Alexander Zverev - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "World number two Alexander Zverev suffered a shock early exit from the Mexican Open with a straight-set defeat against teenage qualifier Learner Tien.\nAustralian Open finalist Zverev, the top seed in Acapulco, put in an uncharacteristically error-strewn performance as American Tien won 6-3 6-4.\nTien, 19, beat Briton Cameron Norrie in the previous round and will face Czech Tomas Machac in the quarter-finals.\n\"I just went out there and tried to control my side of the court,\" said Tien.\n\"Obviously I knew it was going to be a tough match. To come through feels great... I think just focusing on what I can control and keeping my cool as best as I can has really taken me a long way.\"\nTien is the youngest American man to record a victory against a top-three opponent since Andy Roddick in 2001.\nHe has enjoyed a memorable few months, reaching the final at the Next Gen ATP Finals in December before making it through to the fourth round at the Australian Open in January.\nZverev is one of six seeds to exit the competition in the second round.\nCasper Ruud, Tommy Paul and Holger Rune all pulled out because of a stomach bug, while Ben Shelton and Frances Tiafoe were beaten by David Goffin and Alejandro Davidovich Fokina respectively.\nRuud finished runner-up at the ATP 500 event in 2024 but the second seed did not make it to the court for his encounter against local favourite Rodrigo Pacheco Mendez.\n\"I was hoping to overcome this stomach illness that showed up yesterday,\" Ruud said on Instagram.\n\"Hoping to come back stronger in a couple of days and come back here to Mexico next year.\"\nRune, seeded fourth, began his match against Brandon Nakashima but had to retire while trailing 3-0 in the first set.\n\"Furious and so sad at the same time. Had food poisoning and was unable to play today,\" Rune said on X.\n\"One of my favourite places is Mexico and I love this tournament. Absolutely not the way I wanted it to end.\"", "url": "https://www.bbc.co.uk/sport/tennis/articles/clyjjq1xjl8o"}