{"authors": ["Victoria Turner", "www.facebook.com"], "date_download": "2025-05-20 12:11:04", "date_modify": "2025-05-20 12:11:04", "date_publish": "2023-08-05 07:16:37", "description": "MotoGP rider Marc Marquez on rebuilding his confidence to get back to championship winning ways after years of injuries and crashes.", "filename": "sport_motorsport_66406229_1747743064.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3B7A/production/_130662251_marcmarquez.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_motorsport_66406229_1747743064.html", "title": "Marc Marquez: MotoGP great says 'some people around me say it is time to stop'", "title_page": "Marc Marquez: MotoGP great says 'some people around me say it is time to stop' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Marc Marquez is one of the greats of motorsport. An eight-time world champion, he is a born winner.\nBut as he reflects on a \"nightmare\" three years - during which he had doubts whether he would ever compete again and experienced the \"hardest moment\" of his career - the Spaniard is searingly honest.\n\"The reality right now is we are not ready to win,\" he tells BBC Sport. \"For me, for the bike, for many reasons.\"\nIt is almost unthinkable for a rider who four years ago won his sixth MotoGP title.\nBut broken bones and multiple operations after a series of crashes have tested Marquez more than ever before.\nHe has missed five of the eight races to have taken place so far this season, and has not completed a full race since the Malaysian Grand Prix in October 2022.\nAs he returns after the summer break and prepares to compete at this weekend's British Grand Prix, the 30-year-old is looking to rebuild his confidence.\n\"The summer break arrived at the best moment for me,\" he says. \"I got a lot of injuries during the first part of the season; I was quite empty in the last races.\n\"A lot of crashes - the rib was broken, the finger was broken, the ankle was broken. I took that time to rebuild my body and also to rebuild my energy.\"\nMarquez has achieved so much.\nHe remains the youngest Moto GP race winner, the only rider to take the title in his rookie year and the youngest champion of all time - achieving all of those feats at the age of 20. The following year he set a record for race wins in a season by taking the chequered flag first 14 times in 18 attempts.\nHe then dominated MotoGP from 2016-2019 - winning the series four years in a row by beating riders of the calibre of Valentino Rossi and Jorge Lorenzo, who have secured a combined 14 world titles.\nMarquez has had 92 pole positions, won 85 races and had 139 podium finishes in MotoGP alone.\nBut in 2020, a \"sweet\" career turned sour.\nAt the opening race of the 2020 season in Spain, Marquez broke his arm in a crash that ended his season.\nIn 2021, he did at least compete for much of the season - winning three times - but ended the year with concussion and missed the final two races after a motocross crash.\nDouble vision continued to affect him into the following season, which was further interrupted by him needing another operation - the fourth - on the arm he broke in 2020.\n\"All my career has been very sweet and everything easy - a lot of wins and eight World Championships, and then it was the start of my nightmare,\" he says.\n\"It was three years suffering a lot. I wouldn't lie to you if I say it was the time to say 'maybe it is time to stop my career', but this is not the kind of decision that you can take from one day to another one.\n\"Some people around me say it is time to stop, but most other people say to try to continue and that is what I am doing. The passion is there, the motivation is there, and I need to find a way to enjoy it on the race track - that is most important.\"\nThis year was meant to be a fresh start for Marquez.\nIt started well enough as he took pole for the opening round in Portugal, but he fractured his hand in a crash and was forced to sit out the next three races.\nReturning at Le Mans, he hit the tarmac again while fighting for a podium place, then crashed again at the next race in Italy.\nThe bad news just kept coming.\nA spill during warm-up at the following race in Germany caused a hand, rib and ankle fracture, which ruled him out of the last race before the summer break in the Netherlands.\nThat, he says, was the \"hardest moment\" of his career to date.\nAnd the damage was not only physical.\n\"I feel ready to fight for the victories, but for some reason I am not able to do it,\" he says.\n\"And then a lot of crashes and other injuries... it is difficult for the mental side.\n\"The personal life is the best moment in my life so this compensates a bit, and the people around me try to help.\"\nMarquez's old foe Rossi retired in 2021, but fans remained fascinated by the rivalry, and debate still rages about which of the riders was the best.\nMarquez is only one world title behind the Italian, and matching his tally remains a goal.\n\"Every single year, when I start the season it is to fight for the championship,\" says Marquez. \"Doesn't matter if it's for the ninth World Championship or the first World Championship, I will fight in the same way.\n\"MotoGP is constant evolution. You need to always be there and try to improve as other manufacturers and other riders are improving, so that is what I am looking for in this second part of the season.\n\"It is time to reveal that confidence and I hope next year to think again about the championship.\n\"The spirit is there.\"", "url": "https://www.bbc.com/sport/motorsport/66406229"}