{"authors": ["Dayna Strongman", "www.facebook.com"], "date_download": "2025-04-26 06:57:54", "date_modify": "2025-04-26 06:57:54", "date_publish": "2025-02-28 13:50:35", "description": "Head coach Nelson Jardim admits the lack of firepower amid injuries and lack of form is a growing concern.", "filename": "sport_football_articles_c99nnzz9pxjo_1745650674.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d869/live/ae139270-f5c7-11ef-97ab-abb74cabf06c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c99nnzz9pxjo_1745650674.html", "title": "County must 'find solution' to sharpen blunt attack", "title_page": "Newport County must 'find solution' to sharpen blunt attack - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Newport County head coach Nelson Jardim admits the lack of firepower is a growing concern.\nThe Exiles have been grappling with several key injuries and a lack of form up front that has seen them score just once in their last three games.\nOn-loan forward Kyle Hudlin is sidelined until April with a calf injury while midfielder Aaron Wildig is also out for the season.\nCourtney Baker-Richardson is suspended for Saturday's game at Doncaster while Bobby Kamwa has just one goal in his last 12 appearances and Geoffroy Bony has yet to find the net.\n\"We are always looking for the best options. No one has really grabbed the role this season, and that's something we have to think about,\" said Jardim.\n\"We all go through ups and downs but I don't think we've never had anyone standing out week in, week out.\n\"With [Baker-Richardson] not playing, we will have to find different solutions.\"\n\"When you're preparing for next season, have to assess how things are and striker is one area where we have to think.\"\nA potential boost is the return of winger David Ajiboye, who missed their most recent 3-0 defeat to Cheltenham Town for the birth of his first child.", "url": "https://www.bbc.co.uk/sport/football/articles/c99nnzz9pxjo"}