{"authors": ["Timothy Abraham", "Stephan Shemilt", "www.facebook.com"], "date_download": "2025-05-21 07:30:07", "date_modify": "2025-05-21 07:30:07", "date_publish": "2025-03-28 18:00:25", "description": "The deadline to finalise the sale of The Hundred franchises is extended by the England and Wales Cricket Board after a delay in negotiations.", "filename": "sport_cricket_articles_ce343n0p0jjo_1747812607.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b9be/live/946fa020-0bf2-11f0-a31d-7bdcf6d7d2f6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_ce343n0p0jjo_1747812607.html", "title": "The Hundred: Deadline for sale of franchises delayed by ECB", "title_page": "The Hundred: Deadline for sale of franchises delayed by ECB - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The deadline to finalise the sale of The Hundred franchises has been extended by the England and Wales Cricket Board after delays in negotiations.\nMultiple sources have told BBC Sport there are no major concerns over the hold-ups, with investors still fully committed to the deals agreed earlier this year which had an initial eight-week exclusivity period.\nDelays have centred on the participation agreement, the key legal document between the ECB and the Hundred franchise investors which includes how television rights for the tournament are sold in the future.\nIt is now hoped the sales process will be concluded by the end of April, but all parties are said to be relaxed about the time frame should the legal process take longer.\nAs reported by the Daily Telegraph,, external the prospective buyers of the two London franchises are among those who have raised concerns over the participation agreement.\nAn American consortium of tech billionaires agreed to pay £145m for a 49% stake in Lord's-based London Spirit, while India's richest family - the Ambanis - purchased the same stake in the Oval Invincibles for £60m.\nHowever, one investor told BBC Sport they would be \"flabbergasted\" if any of those who had agreed to buy a franchise would consider pulling out at this stage.\nThe overall valuation of the sales of The Hundred franchises came to more than £950m.\nThe total money raised to be shared among the 18 counties, Marylebone Cricket Club (MCC) and domestic game is more than £500m.\nThe ECB is retaining control of The Hundred competition, but sold stakes in the teams to provide a cash injection to the game in this country.\nFrom the total money raised, 10% will go straight to the recreational game. Proceeds from the 49% sales will be divided between the 18 first-class counties and the MCC.\nLittle change is expected to The Hundred for the forthcoming season, which is seen by both the ECB and the new investors as a transitional year.", "url": "https://www.bbc.com/sport/cricket/articles/ce343n0p0jjo"}