{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:53:37", "date_modify": "2025-05-21 06:53:37", "date_publish": "2025-03-29 18:03:23", "description": "Celtic 3-0 Hearts: What Neil Critchley said", "filename": "sport_articles_cvg1gyq70wgo_1747810417.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/06cd/live/904e0ce0-0c95-11f0-b48e-5512f98f3582.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cvg1gyq70wgo_1747810417.html", "title": "Celtic 3-0 Hearts: What Neil Critchley said", "title_page": "Celtic 3-0 Hearts: What Neil Critchley said - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Hearts head coach Neil Critchley: \"The players did exactly what I asked them to do.\n\"We wanted to come here and be on the front foot and give it a right go and the players did that and we created some good moments off the back of it.\n\"It's my responsibility because I've asked the team to play like that and you know there's a high risk and high reward because it can leave you exposed at the back and they go and score with their first two chances.\n\"We had a chance to go 2-1 and didn't take it, at 3-0 the game is pretty much done. You can only ask as a coach that the players try and do what you've asked them to do to the best of their abilities and I think they did that for the whole game.\n\"The team we were in the first half, that's what represents Hearts. It's a team that's on the front foot, goes toe-to-toe is brave and has a go. We created good moments by doing that but you know if you're going to open up half the pitch to good athletes there's a risk with that and I'm happy to take that.\n\"I don't want us to be the team we were in the second half and be passive but I did that because goal difference might come into play in the top six so we had to think about the final outcome of the game.\"", "url": "https://www.bbc.com/sport/articles/cvg1gyq70wgo"}