{"authors": ["Tyrese King", "www.facebook.com"], "date_download": "2025-05-21 06:23:32", "date_modify": "2025-05-21 06:23:32", "date_publish": "2025-03-31 13:33:03", "description": "Vitor Pereira press conference: Wolves vs West Ham", "filename": "sport_football_articles_cvgpd31lxr8o_1747808612.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4488/live/8cfca750-be1a-11ef-aff0-072ce821b6ab.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cvgpd31lxr8o_1747808612.html", "title": "Vitor Pereira press conference: Wolves vs West Ham", "title_page": "Vitor Pereira press conference: Wolves vs West Ham - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "On Brazil striker Matheus Cunha's future after comments he made to The Guardian newspaper about being ready to leave the club: \"He knows his potential as a top player. For me, it's normal that he wants to fight for titles. It's natural. What's important is that he is committed to helping the club to achieve their targets until the end of the season.\"\nPressed on whether this means Cunha will leave in the summer: \"Next season, I don't know [if Cunha stays]. The focus is the next game and the team, and Cunha is a part of the team. In the summer, we will see what happens but in my opinion, it is normal that a player of his potential is ambitious.\"\nOn whether Cunha will still play regularly for Wolves despite being linked to a move away: \"If the training gives me the confidence to go with Cunha, I will go with Cunha because he has the quality to help us and he has already helped us a lot with goals and assists.\"\nPereira said his squad has \"no new injuries\" and that the players who have returned from the international break are \"all in condition to play\".\nOn Jean-Ricner Bellegarde: \"I'm very happy for him. He's a team player. In the beginning, I had doubts about his position in the system but now he can play in different positions. He can play in midfield, he can play as a forward and he can play in between the lines. He's a worker, and I like these kind of players.\"\nOn Wolves' playing style: \"I believe that footballers aren't machines. I don't want a robot team - I want a team with brains. There are moments in the game when we need to take risks and there are others when we don't. I want them to have the confidence to appear on the ball in the box to take risks.\"\nOn West Ham: \"It's a big opportunity to get three points and to keep fighting for our supporters - to make them proud by playing with passion. We will face a strong team, technically and tactically. The work of the coach is very good. It's a team with confidence on the ball and high quality, but I have a fantastic team in a fantastic city.\"", "url": "https://www.bbc.com/sport/football/articles/cvgpd31lxr8o"}