{"authors": ["Joe Rindl", "www.facebook.com"], "date_download": "2025-05-21 04:45:39", "date_modify": "2025-05-21 04:45:39", "date_publish": "2025-01-14 23:51:36", "description": "Chelsea full-back reflects on a \"lonely\" injury lay-off after scoring a late leveller to announce his Premier League return.", "filename": "sport_football_articles_c9vmnwrwn7do_1747802739.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f1da/live/48e60ee0-d2cd-11ef-a95c-5b151e1edf12.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c9vmnwrwn7do_1747802739.html", "title": "Reece James: Chelsea defender shakes off 'lonely and frustrating' injuries to score equaliser", "title_page": "Reece James: Chelsea defender shakes off 'lonely and frustrating' injuries to score equaliser - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "\"I haven't had that feeling for quite a long time.\"\nChelsea captain Reece James marked his latest Premier League injury return by scoring a 95th-minute equaliser against Bournemouth with a pinpoint free-kick.\nThe full-back has missed 21 games with hamstring injuries this season, managing just five Premier League outings.\nHe looked elated after his brilliant free-kick hit the net, punching the air and roaring with delight while England manager Thomas Tuchel watched on from the stands.\n\"It was lonely and frustrating,\" James told BBC Radio 5 Live about his time away. \"I am really happy to be back helping the team.\"\nHas the 25-year-old finally turned a corner?\nJames has suffered from knee and repeated hamstring issues over the past few seasons.\nSince he was made Chelsea captain at the start of last campaign, he has started just eight top-flight games.\nHis previous league appearance had been an eight-minute cameo against Arsenal in November, with his last goal coming against AC Milan in October 2022.\nOn Saturday, the England international returned from his latest two-month setback when he played 45 minutes against Morecambe in the FA Cup.\nWith his game time being managed, he came on in the 56th minute against Bournemouth and generally impressed against tricky winger Antoine Semenyo.\nJames' biggest impact on Tuesday, though, was in front of goal.\nTalisman Cole Palmer passed free-kick duties to James, who rewarded his team-mate's trust by curling in from 20 yards out.\n\"Reece can compare with Cole in terms of free-kicks because he is very good,\" said Chelsea manager Enzo Maresca. \"We decided for Reece and he scored and we are all happy, because at least we took a point.\"\nIt was a strike that had \"pace, power and a little bit of swerve\", according to ex-Premier League striker Glenn Murray.\n\"He deserved it, those moments are difficult for every player,\" added Maresca.\n\"Now, the target for him is to be fit until the end and he will help us in the way we want to play.\"", "url": "https://www.bbc.com/sport/football/articles/c9vmnwrwn7do"}