{"authors": ["Nizaar Kinsella", "www.facebook.com"], "date_download": "2025-05-21 05:22:14", "date_modify": "2025-05-21 05:22:14", "date_publish": "2025-04-03 16:03:45", "description": "The Premier League will consider Chelsea's multimillion pound transaction to sell the women's team to a sister company.", "filename": "sport_football_articles_crkx431nr2do_1747804934.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/65c9/live/0cf48330-10a3-11f0-9af0-9909a653fc84.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_crkx431nr2do_1747804934.html", "title": "Chelsea Women: Premier League yet to approve 'fair market value' of team's sale", "title_page": "Chelsea Women: Premier League yet to approve 'fair market value' of team's sale - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The Premier League has yet to approve the sale of Chelsea's women's team to the club's parent company BlueCo through their 'fair market value' rules.\nChelsea reported a pre-tax profit of £128.4m on Monday but they effectively sold the women's team and potentially other subsidiaries to themselves for around £198.7m.\nThe league didn't bring any Profit and Sustainability (PSR) rule charges against Chelsea when assessing its members in January.\nHowever, as first reported in the Times, external, it has also not yet approved the value of the sale of Chelsea Women.\nThe worth of the Women's Super League champions is understood to have been benchmarked against the world's most valuable women's team, Angel City, a club in the US-based National Women's Soccer League which was sold for £190m in September.\nChelsea's valuation was made when seeking external investment and sponsorship in June 2024, when they announced the \"repositioning\" of the women's team into a separate entity from the men's team.\nBut although Chelsea continue to insist the move will benefit their women's team, it has also helped balance the spending of more than £1.5bn in transfers over three years on the men's side, avoiding huge losses.\nThe club also sold two hotels to another sister company to keep them compliant with PSR rules last season, which was deemed fair market value by the league at £76.5m.\nThe current Premier League financial rules do not address associated party transactions (APTs), after clubs were unable to close the loophole following its annual general meeting in June.\nHowever, European football's governing body Uefa has more stringent Financial Fair Play (FFP) rules which would discount APTs of all its members, with the sale of the hotels and the Chelsea women's team to be assessed in the summer.", "url": "https://www.bbc.com/sport/football/articles/crkx431nr2do"}