{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:27:20", "date_modify": "2025-05-19 15:27:20", "date_publish": "2017-07-18 00:00:00", "description": "Follow live text and BBC Radio 5 live sports extra commentary of the 2017 World Para-athletics Championships from the Olympic Park in London.", "filename": "sport_live_disability-sport_40381214_1747668440.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_live_disability-sport_40381214_1747668440.html", "title": "2017 World Para-athletics Championships - day five", "title_page": "2017 World Para-athletics Championships - day five - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Post\nSo Britain missed out on the medals on day five, but day six promises plenty more opportunities.\nSammi Kinghorn carries GB's greatest gold medal hope in the T53 400m.\nAnd on the international stage, can it be four medals in six days for Tatyana McFadden as she takes on the T54 800m?\nYou'll have to check back here tomorrow to find out...\nGold medal - Yassine Gharbi\nMen's 200m T54 final\nThat's it - no medals for Britain on day five at the London Stadium.\nYassine Gharbi of Tunisia storms to a championship record victory in 24.86 seconds.\nSilver goes to Kenny van Weeghel of the Netherlands and Leo Pekka Thati takes bronze.\nBritain's Richard Chaissaro rallied in the home straight but he had to settle for fourth place, ahead of compatriot Nathan Maguire who comes in sixth.\nMaguire does come up with a personal best of 25.86 seconds, though.\nThe final race\nMen's 200m T54 final (21:45 BST)\nLast up tonight there are not one but two Brits gunning for a medal: Nathan Maguire and Richard Chaissaro in the men's 200m T54 final.\nChiassaro has had to shake off a few problems from his race last night. He was coming up the inside of the pack in the 800m when he clashed with eventual winner Marcel Hug of Switzerland.\nThe 35-year-old, who looked to have damaged his arm, recovered to cross the line but was then disqualified. The race will be rerun on Friday without Chiassaro involved.\n\"I'm a bit sore,\" he told BBC Radio 5live earlier. \"I've watched it back a few times now. It was a 50/50 collision and it wasn't avoidable.\n\"I think the decision [to rerun] is a bit harsh. Anybody who had made a mistake, with a pack so tight, would have caused that crashed. But I'm happy they get to re-run it because of the guys I took out.\"\nMaguire, meanwhile, progressed to this final as the third qualifier after Saichon Konjen of Thailand was disqualified from the heats.\nRichard Whitehead on 5 live\nBritain's Richard Whitehead, the T42 200m world champion, has been speaking to BBC Radio 5 live about taking bronze in last night's 100m race.\n\"I am a perfectionist,\" he said. \"I put a lot of effort into my running. I pushed out great but I got left behind a little bit. With my style with the straight leg, I was always going to struggle. But I sneaked on to the podium. I can't complain too much but I wanted to be at the top of the podium to prove a point.\"\nThis X post cannot be displayed in your browser. Please enable Javascript or try a different browser.View original content on X\nThe BBC is not responsible for the content of external sites.\nSkip X post\nAllow X content?\nThis article contains content provided by X. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read X’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.\nThe BBC is not responsible for the content of external sites.\nEnd of X post\nApp users may need to see select 'view more' to see this content\n'We're all one accident away from being in this kind of position'\nEarlier we were discussing the switch between able-bodied and disability sport.\nBritish long jumper Luke Sinnott spoke to BBC Radio 5 live earlier on about how he came into para-athletics, after losing both his legs while on duty in Afghanistan.\n\"Before I got injured, the last Paralympic Games was in Beijing,\" he said. \"I remember catching a bit of it and thinking 'ah, good on them'. I never thought that two years later I would be in the same boat as a lot of them.\n\"We're all one accident and one illness away from being in this kind of position. The fact you can see all these people do all these amazing things with limited range of body movement, it's a fantastic thing to see. I hope in years to come that other countries show the same support to these athletes that we do in Great Britain.\"\nThe landscape of legacy\nChris Osborne\nBBC Sport at London Stadium\nThe five hours between the morning and evening session fly by each day, with athletes available to interview and medal ceremonies going on.\nBut today I managed to squeeze in a run and headed through the heart of the Olympic Park and towards the arterial stadiums used during London 2012.\nThe green space expands for miles and it's superb to see so many cyclists, runners and dog walkers, as well as families using the playgrounds.\nAnd with the virtues of Olympic/Paralympic legacy ringing in my ears I headed over the to the Lee Valley Hockey Stadium, optimistic there would be clubs, or schools or athletes whacking balls about on the blue synthetic surface.\nMaybe I was misguided or just timed it badly but the place was silent and vacant. The pitch looked in good nick though.\n'It's a complete dream to be here'\nBritain's Polly Maton spoke to BBC Radio 5 live after finishing fifth in the T46/47 100m: \"I’m quite happy, the time wasn’t great but I’ve had calf problems the last couple of days. You just try and be in the moment and forget about it.\n\"It’s a complete dream to be here - I was here at London 2012 and I came back for the grand prix in later years. It’s so great to be in the stadium and running.\n\"Thanks to the faith in British Athletics and funding I’ve been able to progress at a faster pace than expected. I’m really looking forward to coming back out for the long jump.\"\nYoung's London adventure\nWomen's 100m T47\nDeja Young is celebrating after adding another a second world gold to her collection.\n\"I feel pretty great,\" said the 100m T47 defending champion. \"I had a rough year this year and I’m excited to go from here. I wasn’t going to run this year so to achieve everything I wanted to was amazing. I’m here until the 24th so I’m going to explore London now.\"\nThe importance of gloves\nThese are Brent Lakatos' helmet and gloves, which he left on the floor while he went to have a chat with someone.\nIt turns out the type of gloves make a big difference to the type of race, as he tells BBC Radio 5 live.\n\"With the soft gloves you get much better grip when you're accelerating. But they lose a lot of energy. so in the longer distances the hard gloves work better.\"\nClegg's record stays intact\nWorld record holder Libby Clegg is in the crowd tonight and she's breathed a sigh of relief as no-one has beaten her time in the T11 100m.\nBritain's Clegg is out injured at the moment and told BBC Radio 5live: \"It's really frustrating. It would have been nice to compete but I wouldn't be at my best. It's such a shame I'm missing out on the atmosphere. A home crowd really makes a difference. I'm rehabbing really well. I'm not going to race the rest of the season but then I'll be back in training.\"\nNext up...\nWomen's 100m T47 final (20:55 BST)\nWe're back on Brit watch as Polly Maton goes in the women's 100m T47 final.\nMaton is an amputee athlete who was born without part of her right arm and was spotted at a talent event at the age of 14.\nShe made her World Championship debut on her 16th birthday in the long jump and was a multi-discipline athlete in Rio, when she added the 100m to her repertoire.\nMaton is being billed as one to watch in Tokyo 2020. Remember the name...\nSmyth celebrates second gold\nMore from Jason Smyth, who had a moment with his wife Elise and his daughter: \"It's important to have this moment with family. Those people are the most important in my life. Even though these moments are incredible my family will always be there and I'm so lucky to have such a supportive family.\n\"I first came on the scene in 2005 and won golds all the way, I really would love to continue that. I just want to be the best I can be and that's what drives me.\"", "url": "https://www.bbc.com/sport/live/disability-sport/40381214"}