{"authors": ["Kal Sajad", "www.facebook.com"], "date_download": "2025-05-21 05:56:23", "date_modify": "2025-05-21 05:56:23", "date_publish": "2024-12-22 09:11:58", "description": "After two classic bouts, Tyson Fury and Oleksandr Usyk have defined a heavyweight era. Where do they go next?", "filename": "sport_boxing_articles_c0kvd4n5pvjo_1747806983.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/10a2/live/62f39690-c012-11ef-aff0-072ce821b6ab.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_boxing_articles_c0kvd4n5pvjo_1747806983.html", "title": "Fury vs Usyk 2: What next for Tyson Fury, Oleksandr Usyk and heavyweight division?", "title_page": "Fury vs Usyk 2: What next for Tyson Fury, Oleksandr Usyk and heavyweight division? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Great fighters make great rivalries.\nOnce the dust settles and Tyson Fury comes to terms with a second successive loss to Oleksandr Usyk, the Briton may reflect on the part he played in a rivalry that transformed heavyweight boxing.\nFury and Usyk brought the best out of each other over 24 sensational rounds in Riyadh, with their close first fight in May giving cause for a rematch.\nTheir second bout was one that Fury insists he won, but the judges saw it differently with Usyk awarded a unanimous decision.\nThe kingdom's no-expense-spared influence on boxing was on show, with a sparkling hologram depicting the heavyweights and a musical interlude from a drummer performing to the tune of Survivor's Eye of the Tiger.\nYet for all of the Saudi riches and extravagance, Fury and Usyk were the star attractions. In both fights, they delivered on the hype to provide thrilling heavyweight spectacles.\n\"Tyson Fury makes me strong. Tyson Fury continues to motivate me, he is a great opponent,\" a bruised Usyk said in the post-fight news conference.\n\"A big man, a big boxer. He is a great man. I respect Tyson Fury. It is already history.\"\nBoxing is one of the easiest sports to follow, which is why a YouTuber fighting a 58-year-old can generate such global interest.\nYet only a few can truly grasp its intricacies. Fury and Usyk are not only students of the sport, they could set the sweet science's curriculum.\nFury had his first senior amateur bout almost 20 years ago, while Usyk has been boxing since 2006.\nAfter such long, arduous careers - the gruelling training camps, emotional and mental turmoil, damage suffered in sparring and on fight nights - they were still able to create a masterpiece.\nThe manner in which Fury battled substance abuse and mental health issues during a hiatus from boxing, before losing eight stone and regaining a world title, is testament to the natural ability of one of heavyweight boxing's best in-ring technicians.\nUsyk is one of pugilism's finest readers - a composed fighter who can take stock of a situation, adjust his strategy mid-bout and step on the accelerator when it matters; he has done it twice in six months on the grandest stage.\nAll boxers should be applauded for the courage and commitment it takes to step foot in a ring, but only a prestigious few can be celebrated as game-changers.\nFury and Usyk join that short list. Their place in the hall of fame is nailed on, and the two will always share the period where they defined the era.\nMuhammad Ali v Joe Frazier, Riddick Bowe v Evander Holyfield and even Fury's tussle with Deontay Wilder - there is something quite special about a heavyweight trilogy.\nFury feels hard done by and wants a third bout with Usyk. And with the way the first two fights played out, there will be some appetite for it.\nA certain Daniel Dubois, however, is looking at his own shot at redemption after losing to Usyk 18 months ago.\nThe Londoner, who became IBF champion by demolishing Anthony Joshua, stormed into the ring on Saturday to call out Usyk for an undisputed title fight.\nHowever, the Ukrainian says Dubois should concentrate on February's defence against former world champion Joseph Parker.\n\"It's too early to mention Daniel Dubois' name,\" he said.\n\"Now I want to go back home, rest, turn off my phone, sit and look in the sky and how the trees grow.\n\"Not think about Dubois [or] Tyson Fury. Just rest and play with my children.\"\nPromoter Frank Warren said Fury will take some time to assess his options, although there was no suggestion from either the fighter or his team that retirement is likely.\nAfter several years of failed negotiations, now might just be a perfect - and realistic - time for Fury to cash in on an all-British battle with Joshua.\nThere are no obstacles. The lack of world titles is something of a blessing and we are not reliant on results going a particular way or mandatory challengers having to step aside.\nJoshua was easily dismantled by Dubois in September and some boxing enthusiasts will tell you the Fury-AJ ship has already sailed.\nBut the two-time world champion's promoter Eddie Hearn describes it as the \"biggest fight\" in Britain.\nIt depends on how you define biggest.\nFury v Joshua is no longer the best versus the best. But is it better late than never? It is still a rivalry steeped in its own history. So what do we have to lose?\nEven the biggest sceptics will no doubt be reeled in by the inevitable controversy Fury will provide at a news conference. Or when the mask of the usually respectable Joshua slips after he is offended by Fury's antics.\nTheir influence and stardom transcends the sport.\nIf 60 million people are willing to tune in to watch Mike Tyson fight Jake Paul, then even past-their-prime versions of Fury and Joshua - regardless of the losses on their records - will surely pull in the punters.\nThe loser - or maybe even both men - can then happily sail into the sunset with one final payday.", "url": "https://www.bbc.com/sport/boxing/articles/c0kvd4n5pvjo"}