{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:04:58", "date_modify": "2025-05-21 06:04:58", "date_publish": "2025-01-26 00:00:00", "description": "Leicester City post only their second win of the Women’s Super League season after they edged Liverpool 2-1 at King Power Stadium.", "filename": "sport_football_live_cn93jdexpd2t_1747807498.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cn93jdexpd2t_1747807498.html", "title": "Leicester City 2-1 Liverpool: Missy Goodwin scores to give Foxes second win of WSL season", "title_page": "Leicester City 2-1 Liverpool: Missy Goodwin scores to give Foxes second win of WSL season - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Relegation strugglers Leicester City recorded only their second win of the Women's Super League season as they edged Liverpool 2-1 at King Power Stadium.\nMissy Goodwin scored the winner five minutes before the interval to help Amandine Miquel's side move four points clear of bottom side Crystal Palace.\nIt was the Foxes' first win in the women's top flight since beating Everton 1-0 in October.\nLiverpool led inside three minutes after Olivia Smith charged down Leicester goalkeeper Janina Leitzig, who saw her clearance rebound off the Reds attacker and into the goal.\nBut Matt Beard's side only held the advantage for 14 minutes as Sophie Howard knocked down Ruby Mace's set-piece towards Janice Cayman, who volleyed it past Teagan Micah.\nThe Foxes continued to threaten as Julie Thibaud met a Yuka Momiki free-kick with a header that brushed the side-netting before Goodwin netted the all-important goal.\nSam Tierney got inside the box to square the ball to Goodwin, who failed to strike cleanly but made enough connection to see the ball roll into the Liverpool goal.\nThe result moved 11th-placed Leicester on to nine points while Liverpool are seventh with 12 points from as many matches.\nLeicester might have braced themselves for another tough outing when they conceded an early opener for the second game running.\nLeitzig's fourth-minute own goal led to them losing 1-0 despite a fighting display at Tottenham last week and the goalkeeper was at fault again on Sunday as she gifted an opener to the visitors.\nLeicester, who went into Sunday's game having scored just three goals during the 2024-25 WSL season, had an uphill task from then on.\n\"We wanted to make it up for last week because on that occasion, we did everything and were unlucky,\" Leicester boss Miquel said after the game.\n\"Today it started again like last week, and the first five minutes were very hard.\"\nBut rather than letting their shoulders drop, the hosts asserted control after conceding and were by far the better side in the first half - attempting nine shots compared with Liverpool's five.\nWhen Goodwin struck to give them the lead just before the break, it was the first time the Foxes had scored twice in a league game this season.\n\"It's very important from the mental aspect that nobody gave up and we tried to make it back,\" the French manager said.\nLiverpool probed for an equaliser after the restart, but Leicester's well-organised defence were up to the challenge and restricted the visitors to very few opportunities.\nLeitzig redeemed herself whenever the Reds tried their luck from distance, with the German goalkeeper saving from Taylor Hinds, Marie-Therese Hobinger and Smith in the second half.\nThe only occasion Leitzig was troubled in the second period was when her attempted clearance clattered into Smith again, only for it to go behind for a goal-kick, as Leicester held on to move one point behind Everton and Aston Villa.\n\"To come back from 1-0 to get the win, I think it's very important for us for the next games,\" Miquel said.\n\"It was also important due to last week's performance because we felt like we deserved something. Sometimes you play well and don't get anything.\"\nMiquel's side will now have the chance to move up the table when they travel to Everton on Sunday, 2 February, followed by a game against Villa on 16 February.\nFor Liverpool, meanwhile, it was a fifth defeat in six league outings, as they failed to build on the 2-1 win against Brighton last week.\n\"We were just not at it in the first half and then it's tough when you're playing teams, like Leicester, that are fighting for their lives,\" Liverpool manager Beard said.\nThey have back-to-back games against West Ham coming up - an away FA Cup fourth-round tie on Wednesday followed by a home WSL meeting next weekend.", "url": "https://www.bbc.com/sport/football/live/cn93jdexpd2t"}