{"authors": ["Glen Schreuder", "www.facebook.com"], "date_download": "2025-05-21 07:46:16", "date_modify": "2025-05-21 07:46:16", "date_publish": "2025-05-20 11:42:55", "description": "Aberdeen fan voice: 'We have to cling to belief of minor miracle in cup final'", "filename": "sport_articles_c87jjdld08po_1747813576.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/fcbd/live/684396a0-356e-11f0-8947-7d6241f9fce9.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c87jjdld08po_1747813576.html", "title": "'We have to cling to belief of minor miracle in cup final'", "title_page": "Aberdeen fan voice: 'We have to cling to belief of minor miracle in cup final' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Our league season has ended with a whimper. And fans are clearly frustrated as four straight defeats is not exactly the form you want going into a Scottish Cup final.\nSadly the build-up to the final will be overshadowed by the scenes at full-time at Tannadice last Saturday where an object thrown from the away end injured Jack MacKenzie.\nI am sure the individual responsible will be punished for their actions which tarnish the Aberdeen support that has consistently followed their team in numbers.\nOn the pitch a bright first 40 minutes rekindled the Aberdeen of old, with fast passing, line breaks and creating chances. Where has that been in recent weeks?\nSadly, familiar failures reared their ugly head. Once again we conceded goals in quick succession - that's three games now we have shipped two in 10 minutes.\nThere was also a lack of character and confidence, which seriously needs to be addressed over the summer. So does our ability to defend corners.\nLots of work to be done this summer, however for now the focus turns to Hampden. We travel in hope rather than expectation, but we have to cling to the belief we can pull off a minor miracle this Saturday. Maybe it's written in the stars?", "url": "https://www.bbc.com/sport/articles/c87jjdld08po"}