{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:56:25", "date_modify": "2025-05-21 05:56:25", "date_publish": "2025-02-03 14:16:02", "description": "Super-featherweight boxer John Cooney is in intensive care after his defeat by Welshman Nathan Howells in Belfast on Saturday.", "filename": "sport_boxing_articles_c4gp434yz4xo_1747806985.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3bc8/live/5d34d9b0-e215-11ef-8c5f-277f05862546.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_boxing_articles_c4gp434yz4xo_1747806985.html", "title": "John Cooney: Boxer in intensive care after Nathan Howells bout", "title_page": "John Cooney: Boxer in intensive care after Nathan Howells bout - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Super-featherweight boxer John Cooney is in intensive care after his defeat by Welshman Nathan Howells in Belfast on Saturday.\nThe contest was stopped in the ninth round at the Ulster Hall in what was Cooney's first defence of his Celtic super-featherweight title.\nThe 28-year-old was assessed by the onsite medical team in the ring before being taken out on a stretcher and transferred to Royal Victoria Hospital in Belfast for further treatment.\nIn a statement on Monday, Cooney's promoter Mark Dunlop said his fighter suffered \"an intracranial haemorrhage and underwent immediate surgery to relieve the pressure on his brain\".\nHe added: \"John is currently in the intensive care unit and in the hospital's capable hands of the ICU team.\"\nThe Galway boxer won the Celtic title with a first-round win over Liam Gaynor in November 2023 at a sold-out 3Arena in Dublin, on the undercard of Katie Taylor's revenge win over Chantelle Cameron.\nCooney then spent a year out of the ring recovering from a hand injury before returning to beat Tampela Maharusi of Tanzania in October 2024 in London.\nHe had been training with former world title challenger Zelfa Barrett in Manchester before his meeting with Howells.", "url": "https://www.bbc.com/sport/boxing/articles/c4gp434yz4xo"}