{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-05-21 06:45:28", "date_modify": "2025-05-21 06:45:28", "date_publish": "2025-03-30 17:28:00", "description": "Aston Villa loanee Marcus Rashford scored his first goals for Aston Villa in the FA Cup quarter-final win at Preston as he continues to show some of his old swagger.", "filename": "sport_football_articles_czx4lp78vp7o_1747809928.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/89f5/live/ca012e70-0d82-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_czx4lp78vp7o_1747809928.html", "title": "Marcus Rashford: How Aston Villa loanee has got his swagger back", "title_page": "Marcus Rashford: How Aston Villa loanee has got his swagger back - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Marcus Rashford has got his swagger back.\nThe Aston Villa loanee ended his 120-day goal drought with a second-half double at Preston on Sunday to help Unai Emery's side set up an FA Cup semi-final against Crystal Palace - and provide another clear sign he is enjoying his football again.\nFrozen out of the first-team picture at Manchester United by head coach Ruben Amorim just weeks after he replaced Erik ten Hag at the helm, even those closest to Rashford accepted he had a major point to prove when he completed his loan move to Aston Villa on 3 February.\nThose working with him can see the improvement in Rashford, maybe not quite to the levels of old but certainly a far cry from the passive figure he appeared at Old Trafford for most of the previous 18 months.\nEngland boss Thomas Tuchel must have felt so too, judging by the speed with which he restored Rashford to the international fold earlier this month.\nYet there were plenty of doubters. They were out in force on social media during the first half of Villa's 3-0 FA Cup quarter-final victory at Preston, as Rashford wasted a couple of free-kicks as the visitors struggled to turn their dominance into goals.\nThe only measure, though, of a striker's success is the regularity they hit the back of the net - and he hadn't done it for 14 games and counting since his double for United against Everton on 1 December.\nBut when Lucas Digne presented the opportunity 13 minutes into the second half at Deepdale, Rashford's innate ability did the rest as he calmly picked his spot before finding the bottom corner.\nFive minutes later, despite a wait for the video assistant referee (VAR) to confirm Villa should be awarded a penalty, and goalkeeper David Cornell offering some 'advice' as he walked past to take up his position, Rashford's nerve held. He took his time, did an extended stuttering run-up, and found the net.\n\"The swagger is back,\" gushed Guy Mowbray in his Match of the Day commentary. \"The confidence and the pose.\"\n\"It's a great feeling,\" Rashford told BBC Sport afterwards: \"It's always nice for a forward to get a goal, so hopefully it continues.\n\"I feel like I've been getting fitter and playing better football since I've been here. I missed a lot of football before joining up with them. My body feels good and I'm enjoying my football for now.\"\nThe deal United struck with Villa to let Rashford leave is not straightforward.\nThe precise nature of the loan deal is complicated. United have said 75% of Rashford's wages are being covered, although they have not explained exactly how.\nThat could rise to 90% if certain performance-related bonuses are met.\nThat, presumably, will include an extended run in the Champions League - Villa have been paired with French heavyweights Paris St-Germain in the quarter-finals - as well as the FA Cup.\nUnai Emery's side face Crystal Palace at Wembley next month as the next step in their quest to win the trophy for the first time since 1957.\nIn addition, they are ninth in the Premier League, three points behind fifth-placed Manchester City, who occupy what is virtually certain to be the final Champions League spot.\nThat proliferation of targets underscores why Emery did not really want to talk about the likelihood of Villa triggering their £40m option to turn Rashford's move into a permanent deal.\n\"We can't waste time speaking about that,\" he said\n\"If next year we are in the Champions League, in the Europa, or Conference League or not. Or we don't win a trophy - it is completely different.\"\nUnlike Villa, Rashford has won the FA Cup twice in recent memory, including last season. He has also been part of teams who have won the Europa League and EFL Cup. In addition, he has 60 England caps. His past playbook means if he can reach the standards he has previously set, he would be an asset to any side in the world.\nIt is that talent Emery is trying to coax out of the player. It is, in the modern football vocabulary, 'a process'.\nThe Aston Villa boss, said: \"There is still work, still weeks to get it, but today he did one step forward. He is feeling comfortable, getting confident and scoring goals. He was obviously getting better, but today it was more in his adaptation and helping us.\n\"He's playing in the idea, in the plan we did with him. He has played more as a winger on the left side but he's played in some moments as a striker. Today we decided to play him as a striker to his quality, his power and the way he exploits things.\n\"The process we have with him is more or less not changing. There is still work to do because he came here after not training consistently and not feeling in his best fitness. Progressively playing more and with the national team will help him to feel better and today was confirmation of that, which is good.\"\nThe good thing from Rashford's perspective is he is beginning to put together a positive body of work to counter the extended period of drift he experienced at United.\nIt still feels bizarre he has left his boyhood club for a perceived smaller rival, yet finds himself entering the final two months of the campaign with substantially more to play for - both in number and prestige of competitions - than he would have had if he remained at Old Trafford.\nNo professional career is a straight line ascent, which is why insight from those who have been there and done it is so valuable.\n\"You are constantly being asked questions at the top,\" said former England keeper Joe Hart on Match of the Day.\n\"Maybe Rashford found himself in a lull but he has come to Villa with people around him that know what they are doing. He hasn't come here with question marks about how he is going to behave and what he is going to do and how he can change the team.\"\nHart found himself frozen out for a time at Manchester City and Micah Richards did not have the greatest time at Aston Villa.\nBut, like Hart, Rashford can see how a change of scenery has provided the impetus for improvement.\n\"He looks confident and happy,\" said Richards.\n\"It was a big move going to Villa. But when you've got a manager that believes in you, you can do special things.\n\"His whole body language looks a lot better and his all-round game was brilliant. That is the best way to shut people up. People were asking questions about not fulfilling his potential but that is the way to answer.\n\"I really like Rashford in these wide areas because he's always looking to run in behind.\nWhen I talk about body language and his movement - his all round game today was brilliant.\"", "url": "https://www.bbc.com/sport/football/articles/czx4lp78vp7o"}