{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:35:39", "date_modify": "2025-05-21 04:35:39", "date_publish": "2025-04-04 17:36:57", "description": "Bournemouth consider season-ending surgery for Christie", "filename": "sport_articles_c2dexrx398yo_1747802139.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/32a7/live/6e3b67a0-1178-11f0-bef7-27730fea7c1a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c2dexrx398yo_1747802139.html", "title": "Bournemouth consider season-ending surgery for Christie", "title_page": "Bournemouth consider season-ending surgery for Christie - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Bournemouth are considering fast-tracking Ryan Christie's groin surgery in a move that would end the Scotland midfielder's season.\nThe 30-year-old has been a regular for the Cherries this season but has not lasted the full 90 minutes in any of his past nine appearances.\nChristie was forced off 26 minutes into Bournemouth's game against Brighton at the end of February at which point boss Andoni Iraola revealed the 30-year-old would likely need to go under the knife at the end of the campaign.\nBut given the wear and tear Christie has accumulated in recent months, the club are seriously considering sending the midfielder for the surgery before the end of the season to get him fit for the start of the 2025-26 campaign.\nScotland have friendlies with Iceland and Liechtenstein in early June before beginning their World Cup qualifying campaign on 5 September away to Denmark.\n\"We are trying to go with him until the end of the season but, against Brighton, there were moments where he felt he couldn't any more,\" Iraola said.\n\"That's probably something we have to analyse. There is a chance we decide that he should have the surgery now, recover, take his time and be ready for next season.\n\"It's not something that we've decided but it's a situation that we have to analyse well because I think his body is telling him he's pushed it a lot.\n\"He's so honest and he wants to push, even with pain he has been playing, and he's played very well for a lot of time. I think it's a moment where his body is telling him that maybe it's time.\"", "url": "https://www.bbc.com/sport/articles/c2dexrx398yo"}