{"authors": ["Nizaar Kinsella", "www.facebook.com"], "date_download": "2025-05-21 04:57:57", "date_modify": "2025-05-21 04:57:57", "date_publish": "2025-01-14 17:11:44", "description": "Chelsea news: Opinion - How Blues kept to PSR rules", "filename": "sport_football_articles_cdxnv8n8qz2o_1747803477.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e5db/live/bc1a9760-4780-11ef-96a8-e710c6bfc866.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cdxnv8n8qz2o_1747803477.html", "title": "Opinion - How Blues kept to PSR rules - BBC Sport", "title_page": "Chelsea news: Opinion - How Blues kept to PSR rules - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Nine months ago, Todd Boehly was quoted saying Chelsea will remain compliant on PSR for the \"foreseeable future\", with the club maintaining they have never been concerned about receiving any sanctions from either Uefa or the Premier League.\nThe Blues point towards a vastly reduced wage bill and more than £500m worth of player sales, balancing out a world record £1.5bn spend over the first five transfer windows of this ownership.\nHowever, league finishes in 12th and sixth place have been a challenge for compliance - meaning PSR 'swap' deals, involving academy graduates Conor Gallagher and Ian Maatsen, have been necessary to help balance the books.\nChelsea have found another unique way to stay clear of trouble - the controversial sale of the Copthorne and Millennium hotels to themselves for £76.5m. That was cleared by the Premier League and helped sustain aggressive transfer spending.\nChelsea expect their PSR position to improve significantly if they qualify for the Champions League, with a substantial windfall to come from participation in the newly expanded Club World Cup - which is hoped will attract a lucrative front-of-shirt sponsor.", "url": "https://www.bbc.com/sport/football/articles/cdxnv8n8qz2o"}