{"authors": ["Stephan Shemilt", "www.facebook.com"], "date_download": "2025-05-19 14:32:52", "date_modify": "2025-05-19 14:32:52", "date_publish": "2017-07-09 16:41:56", "description": "Moeen Ali takes 10-112 in the match as England beat South Africa by 211 runs in the first Test at Lord's.", "filename": "sport_cricket_40551104_1747665172.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/FA4C/production/_96867046_hi040514550.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_cricket_40551104_1747665172.html", "title": "England v South Africa: Moeen Ali spins hosts to victory at Lord's", "title_page": "England v South Africa: Moeen Ali spins hosts to victory at Lord's - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Moeen Ali ripped through South Africa's batting to give England a 211-run win in the first Test on a wonderfully entertaining fourth day at Lord's.\nOff-spinner Moeen took 6-53 for match figures of 10-112 as the Proteas, set 331 to win, were bowled out for 119.\nEngland had earlier collapsed from their overnight 119-1, dragged to 233 by Jonny Bairstow's 51.\nThe win is England's first in seven Tests and gives Joe Root victory in his first match as captain.\nIt came moments after England's women claimed a crucial three-run win against Australia in the World Cup at Bristol.\nThe second Test begins at Trent Bridge on Friday, with South Africa captain Faf du Plessis set to return after arriving back in England following the birth of his child.\nRoot, the 80th man to lead England in Tests, begins his reign with a success despite his side being reduced to 76-4 on the first morning.\nThe outcome could have been different had Root, who rescued his side with 190, not been dropped twice and stumped off a no-ball.\nSince tea on the first day, England consistently held the upper hand, their decision to play two spinners vindicated by a pitch that has offered huge assistance to the slow bowlers.\nThough South Africa will be boosted by the return of Du Plessis, aspects of their batting looks brittle and they will have to replace pace bowler Kagiso Rabada, who will be suspended for the game in Nottingham.\nThere was the suggestion that Moeen had been replaced as England's number one spinner by left-armer Liam Dawson. He responded with his first 10-wicket haul in a Test to go with the 87 runs he scored in the first innings.\nSouth Africa's target always seemed distant - only once had more runs been chased to win a Test at Lord's - but Moeen showed it to be miles out of reach on of a surface that offered turn and bounce for the slow bowlers.\nAfter wicketkeeper Bairstow athletically held Heino Kuhn down the leg side off James Anderson, Moeen got to work.\nDean Elgar was caught and bowled, Quinton de Kock was bowled playing an ugly pull shot and Temba Bavuma fell in similar fashion.\nTheunis de Bruyn was caught a slip, the slogging Keshav Maharaj bowled and Rabada caught behind.\nDawson completed England's victory, Morne Morkel caught on the leg-side boundary while attempting to hit a third six, the 19th wicket to fall in the day.\nWith Alastair Cook and Gary Ballance unbeaten overnight, England looked set for steady progress towards a declaration. However, they were checked by a South African attack that first stifled and then penetrated.\nMorkel had Cook caught at extra cover for 69 and Balance caught behind for 34, leaving Rabada and left-arm spinner Maharaj to work through the middle order.\nAt one stage, England had lost seven wickets for 43 runs, a collapse that could have been worse had Vernon Philander held a simple catch at long-off from the bowling of spinner Maharaj when Bairstow was on seven.\nReprieved, Bairstow pugnaciously added 45 for the ninth wicket with Mark Wood.\nBy the time he became the last man to fall, stumped off Maharaj, he had extended a remarkable period of run-scoring that includes 13 scores in excess of fifty since December 2015.\nEngland wicketkeeper Jonny Bairstow: \"What a day, what a game, Rooty taking over. I don't think he could have asked for a better way to start.\n\"He has been pretty chilled. In his mind he was happy with the side and the performance shows that.\"\nSouth Africa captain Dean Elgar on Test Match Special: \"It is a bitter one to swallow.\n\"We knew it would be tough to chase anything over 300. It is only one game, we can change it from here.\n\"It will be interesting from a selection point of view before the next Test. We can't lick our wounds for too long in international cricket.\"", "url": "https://www.bbc.com/sport/cricket/40551104"}