{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 08:03:02", "date_modify": "2025-05-21 08:03:02", "date_publish": "2025-01-03 19:58:24", "description": "Liverpool news: Mohamed Salah says it is 'last year in the club' after 'no progress' on contract talks", "filename": "sport_football_articles_c98l67gw99lo_1747814582.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1381/live/1fdd9fc0-ca05-11ef-aab7-c3fffbc6d5f4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c98l67gw99lo_1747814582.html", "title": "Liverpool news: Mohamed Salah says it is 'last year in the club' after 'no progress' on contract talks", "title_page": "Liverpool news: Mohamed Salah says it is 'last year in the club' after 'no progress' on contract talks - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Liverpool forward Mohamed Salah says there is \"no progress\" in talks to extend his contract with the club.\nThe 32-year-old has entered the final six months of his deal and can now hold talks with non-English clubs over a free transfer when it expires this summer.\nSalah has scored 20 goals this season to help the Reds top the Premier League and Champions League tables, but the 32-year-old has been increasingly vocal about his future in recent media interviews.\nAsked whether he thought this was his final season at Anfield, he told Sky Sports, external: \"So far, yes. It's the last six months.\n\"There is no progress there. We are far away from any progress. So, we just need to wait and see.\"\nAsked about the prospect of winning the Premier League this season, he added: \"It's my last year in the club so you want to do something special for the city.\"\nAfter a win over Southampton in November, Salah said he was \"disappointed\" by the lack of a contract offer, reiterating after Monday's win at West Ham that any agreement was \"far away\".\nDespite this, the former Chelsea forward has insisted he is able to block out the speculation and focus on his football.\nHe said: \"The thing in my head is that if this is the last six months, what do you want to see in the future?\n\"Do you want to look back and say I was concerned or stressed about the contract? Or do you just want to say I had an unbelievable season? That's what is in my head.\n\"If I ever feel distraction, I just remind myself I want to look back and say I had an unbelievable season. That's what I want to do.\"", "url": "https://www.bbc.com/sport/football/articles/c98l67gw99lo"}