{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:11:21", "date_modify": "2025-05-21 06:11:21", "date_publish": "2025-01-31 13:29:32", "description": "Coleraine complete the signing of Scottish striker Declan McManus from Welsh side The New Saints [TNS] for an undisclosed fee.", "filename": "sport_articles_cwyeg6776lzo_1747807881.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b3aa/live/326d95e0-dfd7-11ef-8899-07ba6c6a90c6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cwyeg6776lzo_1747807881.html", "title": "Irish Premiership: Coleraine sign striker Declan McManus from Welsh side TNS", "title_page": "Irish Premiership: Coleraine sign striker Declan McManus from Welsh side TNS - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Coleraine have completed the signing of Scottish striker Declan McManus from Welsh side The New Saints [TNS] for an undisclosed fee.\nMcManus spent four years with TNS, winning three Welsh Premier titles, two Welsh Cups and one Welsh League Cup.\nHe twice finished as the league's top goalscorer scoring 24 goals in 2021-22 and 29 in 2022-23.\nThe 30-year-old helped TNS to become the first Welsh side to reach the group or league stage of any European competition this season.\nHe played all six games of TNS' Uefa Conference League campaign, scoring in a 2-0 victory against Astana.\nThe Glasgow born forward becomes Coleraine's fourth arrival in January after the signings of Levi Ives, Ronan Doherty and Paddy Burns.\nBannsiders boss Dean Shiels was pleased to link up once again with McManus, who he played with at Dunfermline.\n\"I know his qualities and what he can offer. He's a good lad off the pitch, has a great attitude and he will fit in well with the group,\" Shiels told the club's website.\n\"Secondly, he's a good player and his goalscoring record in the last few years have been unbelievable.\n\"Declan is a pure goalscorer and they are worth their weight in gold.\"", "url": "https://www.bbc.com/sport/articles/cwyeg6776lzo"}