{"authors": ["Thomas Woods", "www.facebook.com"], "date_download": "2025-05-21 05:05:51", "date_modify": "2025-05-21 05:05:51", "date_publish": "2025-04-04 05:16:36", "description": "It's another FPL week where you can try your luck against captain Mohamed Salah, with Alexander Isak on the road against struggling Leicester an excellent alternative, writes Thomas Woods", "filename": "sport_football_articles_cp8kxvnkznyo_1747803951.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c234/live/398c6680-10ab-11f0-b234-07dc7691c360.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cp8kxvnkznyo_1747803951.html", "title": "FPl gameweek 31 tips: Captain Alexander Isak, double up on Bukayo Saka and Gabriel Martinelli", "title_page": "FPl gameweek 31 tips: Captain Alexander Isak, double up on Bukayo Saka and Gabriel Martinelli - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It's business time in Fantasy Premier League, with double and blank gameweeks ahead.\nThere are only eight weeks left so transfers are precious, every week matters that little bit more and you don't want to leave anything on the table.\nThere's plenty of help at hand though...\nFPL expert Gianni Buttice is a special quest on the BBC Sport website for a live question and answer session on Friday 4 April at 14:30 BST.\nAs a reminder of the upcoming schedule...\nGameweek 31 - normal gameweek\nGameweek 32 - double gameweek for Newcastle and Crystal Palace\nGameweek 33 - double gameweek for Manchester City, Aston Villa, Arsenal and Crystal Palace\nGameweek 34 - blank gameweek for Manchester City, Aston Villa, Arsenal and Crystal Palace\nIn the meantime, here's our week 31 team of the week for some short-term inspiration.\nThe team of the week is selected based on current FPL prices to fit within a £100m budget, as if you were playing a Free Hit.\nEmi Martinez, Aston Villa, keeper, £5m - Nottingham Forest (h)\nThe Argentine kept just his fourth clean sheet of the season in Wednesday's win at Brighton but he is a differential keeper option for this week and the rest of the season.\nVilla face goal-shy Southampton next week before a double in 33.\nForest are not an easy opponent for Villa but they are definitely not as threatening without injured striker Chris Wood.\nVirgil van Dijk, Liverpool, £6.5m - Fulham (a)\nLiverpool's defence is rolling at the moment, with three clean sheets in their past four including keeping Manchester City and Newcastle out.\nAnd Van Dijk has only scored once so far this season. He has not finished a season with just one goal since 2020-21, so the law of averages means he is due.\nDjed Spence, Spurs, £4.4m - Southampton (h)\nWhile Tottenham's form is nose-diving again, they face a Saints side with just 22 goals in 30 games - the league's lowest total.\nSpence seems to be holding down that right-back spot and, if they do keep a clean sheet, has a great chance of bonus.\nIn Tottenham's recent back-to-back clean sheets, against Brentford and Manchester United, Spence earned the maximum three bonus points.\nKieran Trippier, Newcastle, £5.6m - Leicester (a)\nAm I getting suckered in with memories of prime Trippier from the past two seasons, when he had nine and 10 assists? Possibly.\nIs picking a defender against Leicester each week the most obvious call? Yes.\nThat makes Trippier worth a punt in my opinion, even if he is nursing a potential groin issue.\nHe took three set-pieces, made three crosses and two key passes in Wednesday's win over Brentford, so you're getting a defender who is pretty involved in attacking play.\nMohamed Salah (vice-captain), Liverpool, £13.8m - Fulham (a)\nSalah has failed to score in two of his past three games and his expected goal involvement (xGI) of 0.17 against Everton on Wednesday was the Egyptian's lowest all season.\nBut this man has 44 goal involvements in 2024-25 so don't give up on him yet!\nThere could come a time - especially if you are chasing your rivals - where going without Salah makes sense in a few weeks, as Liverpool won't have a double gameweek this season.\nBut not yet.\nJacob Murphy, Newcastle, £5m - Leicester (a)\nFPL players may be looking at Anthony Gordon as the best Newcastle midfield option, with a double gameweek next week for the Magpies.\nBut Murphy, at just £5m, can easily match Gordon.\nHe has nine assists now this season and has started every game since week 14. Bargain.\nBukayo Saka, Arsenal, £10.3m - Everton (a)\nSaka has gone from 'player to watch' to essential in this column in the space of three weeks.\nYour only worry is whether, with a Champions League quarter-final against Real Madrid coming up, the England man is rested for the odd game having just come back from injury.\nBut a start against Everton seems certain and Saka is still second on the assists chart with 11 this season, despite missing just over three months.\nGabriel Martinelli, Arsenal, £6.5m - Everton (a)\nSaka's return is good for team-mate Martinelli, even though a trip to Everton isn't exactly easy on paper.\nThe pair had a combined 52 goals and assists two seasons ago, getting on the end of each other's crosses, and with a double gameweek in 33 of Palace (h) and Ipswich (a), why not double up on the Arsenal attack?\nAlexander Isak (captain), Newcastle, £9.5m - Leicester (a)\nThe 20-goal striker is a slight injury doubt but you have to go with him against this Championship-bound Leicester side.\nCaptaining Manchester City's Marmoush against Leicester paid off last week so we go again!\nLiam Delap, Ipswich, £5.6m - Wolves (h)\nThis is a must-win game for Ipswich and we're at the stage of the season where form goes out of the window a little.\nPortman Road will be pumped up and if Town do pull off a victory, chances are Delap will be involved in some way.\nThe 11-goal striker has been involved in 43% of Ipswich's goals this season, a statistic bettered only by four strikers who have played more than 10 games - Isak, Erling Haaland, Wolves' Matheus Cunha (who is suspended for this one) and Jamie Vardy.\nDominic Solanke, Spurs, £7.3m - Southampton (h)\nThis is a pure gut-feel pick (you need one in every team right?) as Solanke has no form to speak of. He had an expected goals (xG) of zero in Thursday's defeat at Chelsea.\nBut the England striker was just getting motoring before an injury after gameweek 21 put him out for six matches. Solanke had three goals and two assists in the six games before that, and has the potential to go off against a doomed Southampton side.\nAston Villa - Nottingham Forest (h), Southampton (a), DOUBLE GAMEWEEK - Newcastle (h), Manchester City (a)\nIt's just picking the right Villa player for this run of games - everyone apart from Morgan Rogers seems a bit of a punt, with the usually reliable Ollie Watkins having been benched for two consecutive games in all competitions.\nWith a Champions League quarter-final against Paris St-Germain crammed in between these games as well, it might be prudent to wait until the double before choosing your Villa assets.\nBut both Marcus Rashford (£6.6m) and Marco Asensio (£6.1m) could be amazing differential picks.", "url": "https://www.bbc.com/sport/football/articles/cp8kxvnkznyo"}