{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:31:26", "date_modify": "2025-04-26 06:31:26", "date_publish": "2025-02-27 08:50:52", "description": "Brighton news: Fabian Hurzeler on Diego Gomez", "filename": "sport_football_articles_cn89y0280dgo_1745649086.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2201/live/7628e8f0-f4e7-11ef-ae0a-4bca4f518eb0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cn89y0280dgo_1745649086.html", "title": "Brighton news: Fabian Hurzeler on Diego Gomez", "title_page": "Brighton news: Fabian Hurzeler on Diego Gomez - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Brighton boss Fabian Hurzeler says Diego Gomez has \"something special\" to offer his team after impressing on his first Premier League start.\nThe 21-year-old was at the heart of the Seagulls' best moves in the first half of Tuesday's win over Bournemouth, playing Kaoru Mitoma through on goal with a fine pass before another fine ball led to Joao Pedro winning the penalty that opened the scoring.\nGomez arrived from MLS club Inter Miami in January - where he featured alongside former Barcelona stars Lionel Messi, Luis Suarez, Sergio Busquets and Jordi Alba - but had been limited to just four substitute appearances in the Premier League and one in the FA Cup.\n\"I knew what would come because I see him in training every day and every time he went on the pitch as a sub he always had an impact,\" Hurzeler said.\n\"He has a special profile - he's very helpful for our team.\n\"He has this passion inside of him, this intensity. He defends forward - he plays forward and that's something special.\"\nIt was the first time Brighton had won four consecutive Premier League games and moved firmly into contention for European qualification. However, Hurzeler only has his attention on the next game.\n\"I am not a big fan to emphasise one victory too much or to emphasise one loss to much,\" he added.\n\"We have to focus on the present. We have to understand why we are now in this situation, what makes us strong as a team, what makes us strong as individuals and that's what has to get in our mind.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cn89y0280dgo"}