{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:39:35", "date_modify": "2025-05-21 05:39:35", "date_publish": "2025-04-03 03:54:45", "description": "Ryan Longman says the Wrexham squad are openly discussing their aim of clinching promotion as the race for a top two spot in League One heats up.", "filename": "sport_football_articles_czjn77x733yo_1747805975.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0af6/live/dd996970-0fa3-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_czjn77x733yo_1747805975.html", "title": "Ryan Longman: Wrexham squad talking about making history", "title_page": "Ryan Longman: Wrexham squad talking about making history - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ryan Longman admits Wrexham players are openly discussing their aim of gaining what would be an historic third successive promotion this season.\nPhil Parkinson's side sit second in League One with just six matches of the regular season remaining.\nThey are currently three points clear of Wycombe Wanderers, although the Chairboys have a game in hand.\nAnd January signing Longman - who moved to north Wales from Championship side Hull City - admits they are keeping a close eye on Wycombe's progress as the season approaches its climax.\n\"100% we're talking about [promotion],\" said 24-year-old Longman.\n\"We want to do it, that's the goal, we want to make history, that's what we want to do.\n\"We want to take care of our own business but we'll keep an eye on what's going on around us because at the end of the day, they're our competitors at the moment.\n\"Winning games and pushing for promotion, that's why I came here.\"\nWrexham missed the chance to open up a five-point gap over Wycombe - who themselves were held to a goalless draw by bottom side Shrewsbury Town - as they drew 2-2 with Cambridge United on Tuesday night.\nGeorge Dobson fired the visitors in front after just four minutes at the Abbey Stadium, although Liam Bennett levelled just before half time.\nJosh Stokes put Cambridge ahead from the penalty spot shortly after the break after Lewis Brunt's foul on Ryan Loft.\nBut Longman crossed for Sam Smith to head home the equaliser - the wing-back's fourth assist since joining Wrexham - to earn the visitors a point.\nAnd while frustrated not to emerge victorious in Cambridge, Longman believes Wrexham's squad depth gives them a real chance of playing in the Championship next season.\n\"We're disappointed. I think we had some big chances and some big calls that didn't go our way in the game, that's what it's come down to really,\" he added.\n\"The first 30 minutes we were in good control. When they got that equaliser it did shift the momentum and their players got a bit of a boost from that.\"\nWrexham return to action against Burton Albion at the Stok Racecourse on Saturday (12:30 BST), with trips to Wigan, Blackpool and Lincoln as well as home games with Bristol Rovers and Charlton to come.\n\"There's six games left, there's so many points to grab. We've got to keep playing like that and hopefully those opportunities go in,\" said Longman.\n\"The depth in the squad is incredible, some of the players we've got and the impact they can have off the bench, that's what you need to win three back-to-backs.\"", "url": "https://www.bbc.com/sport/football/articles/czjn77x733yo"}