{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:54:52", "date_modify": "2025-05-21 07:54:52", "date_publish": "2025-01-22 09:30:52", "description": "Man Utd news: Matthijs de Ligt says performances 'not good enough'", "filename": "sport_football_articles_c05l7me36v5o_1747814092.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c05l7me36v5o_1747814092.html", "title": "Man Utd news: Matthijs de Ligt says performances 'not good enough'", "title_page": "Man Utd news: Matthijs de Ligt says performances 'not good enough' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Matthijs De Ligt says the pressure at Manchester United is \"the highest\" he has experienced at any club and it is \"a lot more negative than positive.\"\nSpeaking to Dion Dublin for Football Focus, the 25-year-old said: \"At every club I've been, the pressure has been really high - at United, pressure is the highest.\n\"United is still the biggest club in England and we know the way we've performed this year is not good enough.\n\"The pressure becomes bigger, bigger and bigger and you feel it more - it's a lot more negative than positive.\n\"You feel it as a player. The only thing I'm happy about is that I didn't make the step from Ajax to here, because maybe then it would've been too much.\n\"I had some experience in Italy. During the first three months, the pressure was really big because I was signed for £75 million and I couldn't make a mistake.\n\"So, I learned by failure and disappointment to deal with the critics - that helps me a lot in the situation we are in this year.\"\nThe Dutch international has played in all but two of United's Premier League games this season, starting the past five games in all competitions, but he knows the club's form needs to change swiftly.\n\"Football is a really strange sport,\" he said. \"It can change out of nowhere - sometimes it's about finding the right formula.\n\"At the moment we are not there, but I keep my hopes up that we will find it really soon.\"", "url": "https://www.bbc.com/sport/football/articles/c05l7me36v5o"}