{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:04:07", "date_modify": "2025-05-20 13:04:07", "date_publish": "2023-08-01 09:46:23", "description": "Leicester City podcast: Coady injury could be disaster for Maresca", "filename": "sport_articles_c2l9942ww5zo_1747746247.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5f82/live/213b8910-2f90-11ee-ab13-3d5d24e9100c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c2l9942ww5zo_1747746247.html", "title": "Leicester City podcast: Coady injury could be disaster for Maresca", "title_page": "Leicester City podcast: Coady injury could be disaster for Maresca - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Conor Coady limped off with a foot injury in Leicester's behind-closed-doors friendly against OH Leuven over a week ago, but the club is yet to provide an injury update on Enzo Maresca's new defender.\nFormer Foxes winger Matt Piper discussed Coady's pre-season injury on the When You're Smiling podcast: \"He's probably the only leader, the only natural leader, that I see in this squad, at the minute. Dewsbury-Hall could become that but he isn't that yet. So it's a huge blow - there's no getting around it.\n\"Some of the interviews I've seen the manager do in recent days, when he's spoken about Coady and the fact that it looks like a bad one, you can see the disappointment in his face. Coady was his first signing.\n\"There was no leadership off or on the pitch from any of the players that we saw last season. I think that was a huge contributing factor as to why we did drop off the edge of a cliff. So, as a manager, you're thinking, 'right we need to identify a leader, who can we bring in, that also fits the philosophy of how we want to play with the ball'? That's Conor Coady.\n\"You're not just getting a ball-playing centre-back, you're getting a leader, and now he's injured. It could be for a number of weeks or months - that's disastrous for Leicester.\"", "url": "https://www.bbc.com/sport/articles/c2l9942ww5zo"}