{"authors": ["Liam McLeod", "www.facebook.com"], "date_download": "2025-04-26 03:55:16", "date_modify": "2025-04-26 03:55:16", "date_publish": "2025-03-04 16:20:46", "description": "Liam McLeod: 'Dons show spark - but poor starts a recurring problem'", "filename": "sport_articles_ckg8dd9gw4ro_1745639716.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/146e/live/44d72520-f913-11ef-9e61-71ee71f26eb1.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_ckg8dd9gw4ro_1745639716.html", "title": "'Dons show spark - but poor starts a recurring problem'", "title_page": "Liam McLeod: 'Dons show spark - but poor starts a recurring problem' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Aberdeen showed excellent battling qualities to come from two goals down and rescue a point against Dundee Utd on Sunday.\nA month or so ago such an act of escapology may have been beyond them so in that regard there was tangible proof there is something of a spark there.\nHowever, it was yet another poor start to a game. Aberdeen's first-half performances have been a problem all season, even when they were rampaging through that scarcely believable first quarter of the season.\nWith the exception of the win over Rangers at the end of October, when they should have been out of sight by half-time, they have been way too slow out of the traps.\nIt was the same story on Sunday as they found themselves in a hole at the break and once again Jimmy Thelin had to make changes before the second 45 got under way, with Jeppe Okkels and Jack MacKenzie sacrificed.\nWhat we saw in the second half was a determined performance yet the Dons need to find a way of starting games in that manner. A lot of the play in that first half was too ponderous with the forward players taking too many touches when shots at goal were on.\nThe goals conceded were extremely cheap, which has been another constant throughout the winter months. It could prove to be an important point, but equally it could prove to be a costly two dropped although the Dons fans would have taken a draw as the match ticked into stoppage time.\nAnd so attention returns to the Scottish Cup and a visit from Rangers' conquerors Queen's Park.\nAberdeen know all about the Championship side's qualities having faced them in the League Cup group stage and although they won that one, they were reliant on a late debut goal from Topi Keskinen.\nHowever, it is a home tie against lower-league opposition and Thelin has an enormous opportunity to take the club back to Hampden as they look to end three-and-a-half decades of pain and misery in the tournament.", "url": "https://www.bbc.co.uk/sport/articles/ckg8dd9gw4ro"}