{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:49:41", "date_modify": "2025-05-21 03:49:41", "date_publish": "2025-02-01 17:21:00", "description": "Game of the Weekend: Glasgow City v Celtic", "filename": "sport_articles_cz6p8vxyqplo_1747799381.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7e74/live/7fca0d10-dffe-11ef-b1b3-51355c7a67fc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cz6p8vxyqplo_1747799381.html", "title": "Game of the Weekend: Glasgow City v Celtic", "title_page": "Game of the Weekend: Glasgow City v Celtic - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It's Women's Scottish Cup weekend and given the nature of the last-16 draw, one of the SWPL's big hitters will be out of the competition by the end of play on Sunday.\nCeltic had trailed in the SWPL title race, seemingly tired from their European exploits, but after City's slip-up against Hibs last weekend, the pair are tied at the top of the table with Leanne Ross' side leading on goal difference.\nThe Scottish Cup used to be City's bread and butter. They have won the competition nine times, more than any other club, but since the emergence of the other big two in Glasgow they've struggled and haven't lifted the trophy since 2019.\nThis is also the same stage City were knocked out at last season, when they were beaten on penalties by Grant Scott's Hibs.\nThe hosts will hope to be buoyed by the news of Emily Whelan's new long-term contract. The Irish forward scored in the 3-1 win over Partick Thistle that got City to this stage.\nCeltic meanwhile, have enjoyed more success in recent times, lifting the Cup in two of the last three seasons - beating City in the 2022 Cup final after extra-time. Back then, the game was still played at Tynecastle but they won it again the next year at Hampden.\nThe head-to-head stats skew wildly in Elena Sadiku's favour. While the games are usually only decided by a goal, Celtic have won seven of the past 10 games between them - eight if you include the penalty shootout win in the League Cup clash in November.\nSadiku's side are already out of the League Cup, at the hands of bitter rivals Rangers, but got to this stage with a 13-0 victory over Glasgow Women.\nBeating City would put them firmly on the path to Mount Florida where a third Scottish Cup trophy could await.", "url": "https://www.bbc.com/sport/articles/cz6p8vxyqplo"}