{"authors": ["Tyrese King", "www.facebook.com"], "date_download": "2025-04-26 06:56:26", "date_modify": "2025-04-26 06:56:26", "date_publish": "2025-02-28 14:59:13", "description": "Vitor Pereira press conference: Bournemouth vs Wolves preview", "filename": "sport_football_articles_cm2dxnn74kxo_1745650586.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4488/live/8cfca750-be1a-11ef-aff0-072ce821b6ab.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cm2dxnn74kxo_1745650586.html", "title": "Vitor Pereira press conference: Bournemouth vs Wolves preview", "title_page": "Vitor Pereira press conference: Bournemouth vs Wolves preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Wolves want to create their own identity to \"play their own way\", with Pereira adding: \"There is a lot to correct. We want to be better than the last game because each game has to be a lesson.\"\nPereira on what his side need to improve on from the midweek Premier League defeat against Fulham: \"We need to be different because the levels of concentration [were low], and we cannot start the first and second half conceding goals. It is impossible because here [Bournemouth] they punish you with goals. You cannot make these types of mistakes and go there sleeping.\"\nPereira on the fitness of Emmanuel Agbadou, Hwang Hee-chan, Goncalo Guedes and Rodrigo Gomes: \"They are recovering. I think for this match, Hee-chan will recover and be available. The other ones we'll need to wait a bit more.\"\nAsked about facing Bournemouth again: \"I'm not worried about one player. When I look at the game, I try to understand the moments they create problems and how we can cause problems for them. Each game is a lesson.\"\nHe continued: \"It's easy to understand this team. I understand why they are in the position [7th] they are in the table. They are a very, very aggressive team with and without the ball. They are a vertical team, the moment you lose the ball they can score a goal in a second.\"\nOn Wolves winning the FA Cup four times: \"In this moment football has changed a lot but you know, tomorrow is a chance and an opportunity for us to move forward and we cannot think about the draw.\"\nHe continued: \"We need to win. In my mind, in our mind, we need to go through with the intention to win the game and move forward. I cannot speak about dreams, it's like in life, if you have a lot of dreams and do nothing to achieve them, it's only dreams. But if you set the targets, we must take the steps to reach the target, this is one of those steps. It's difficult of course but we can do it.\"\nExplaining further: \"For me, if I tried to do it, it would be very difficult for me, but they are used to doing it. They sleep a lot in their own time, and they eat a lot in the night. Here in our club I think we are very professional, we have the medical department and a nutritionist who would be very on it.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cm2dxnn74kxo"}