{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:44:23", "date_modify": "2025-05-21 07:44:23", "date_publish": "2024-12-23 11:10:22", "description": "Eddie Howe press conference: Newcastle vs Aston Villa preview", "filename": "sport_football_articles_ceql1e2zl1qo_1747813463.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3e34/live/3814b960-4923-11ef-9e1c-3b4a473456a6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ceql1e2zl1qo_1747813463.html", "title": "Eddie Howe press conference: Newcastle vs Aston Villa preview", "title_page": "Eddie Howe press conference: Newcastle vs Aston Villa preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Howe confirmed they will check on Joelinton on Monday after the midfielder picked up \"various facial injuries after the last home game against Brentford\" to decide his availability.\nHe also confirmed Joe Willock \"is fine\" and it is \"really important\" for him to have a run of games to reach his best level, while Nick Pope has had \"a couple of injections in his knee\" but it is \"still difficult to give a definitive date\" for his return.\nOn training over Christmas: \"We will get them in training but won't keep them for any longer than they need to be in and then they can enjoy Christmas like everybody else.\"\nHowe said \"winning changes everything\" and he \"will enjoy the Christmas period if we are successful\" but he does not believe that feeling is \"different to any other time of year\".\nOn how confidence can impact players' performances: \"It changes the players' feel and emotions. The challenge for us is to get every player in the best frame of mind possible. We have seen from the whole squad an improvement from the start of the season.\"\nHe added: \"We are in a much better place. But it is important we don't get distracted and focus on the games. We have some brilliant fixtures to enjoy, but we will only enjoy them if we are at our best.\"\nHaving not lost at home to Aston Villa since 2005, Howe said: \"Previous games don't tell you anything about what is going to happen in the future. We really enjoyed playing at home in the past few games. Our home performances in general have been very good, so more of the same would be very welcome.\"\nOn the challenge of facing Unai Emery's side: \"This will be a really good challenge for us. I think they have good depth in their squad - they have some really good players. Their style is very difficult to play against. They're very well coached, very well drilled.\"", "url": "https://www.bbc.com/sport/football/articles/ceql1e2zl1qo"}