{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:16:05", "date_modify": "2025-04-26 06:16:05", "date_publish": "2025-03-01 20:22:44", "description": "Man City 3-1 Plymouth: What Pep Guardiola said", "filename": "sport_football_articles_cn04wpx0244o_1745648165.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f693/live/546ab140-f6d5-11ef-b441-0f08798b3a21.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cn04wpx0244o_1745648165.html", "title": "Man City 3-1 Plymouth: What Pep Guardiola said", "title_page": "Man City 3-1 Plymouth: What Pep Guardiola said - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Manchester City manager Pep Guardiola has been speaking to BBC Match of the Day after his side progressed to the FA Cup quarter-finals: \"I didn't take anything for granted when I saw how well they defended and the problems they created for Liverpool. They are an incredibly solid team.\n\"We created a lot and conceded little - the basics we have done for many years. We are happy to reach the quarter-finals and we are happy with the way we played.\n\"How many times in the last few years have we reached the semi-finals? When you arrive six times in a row to the semi-finals, it is because the FA Cup is important. When you play in this competition and you behave like the way we behave, I'm so proud – I love it. It shows how honest we are - and I like that.\n\"We are one game away from Wembley and we'll see what happens.\"\nOn Nico O'Reilly's performance: \"He is not a typical academy player. He is a physical presence. He is a number 10, I would say. He can play in a few positions and he is a threat from set-pieces because he is strong. I'm really pleased for him because he helped us a lot.\"\nOn Plymouth's performance: \"Defensively, they were incredibly well organised. They didn't press much and defended a little deeper, but they defended with solidarity. That's why I said I didn't take anything for granted.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cn04wpx0244o"}