{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:49:41", "date_modify": "2025-05-21 05:49:41", "date_publish": "2025-01-31 16:13:11", "description": "Newcastle: Alan Shearer meets Alexander Isak", "filename": "sport_football_articles_c4g344rq34ro_1747806581.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ea75/live/b8b6e500-dfc5-11ef-bd1b-d536627785f2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c4g344rq34ro_1747806581.html", "title": "Newcastle: Alan Shearer meets Alexander Isak", "title_page": "Newcastle: Alan Shearer meets Alexander Isak - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "As I said on last week's Match of the Day, I feel that Alexander Isak has put himself into the 'world class' category now, with his performances for Newcastle over the past two seasons.\nAlong with Mohamed Salah at Liverpool and Manchester City's Erling Haaland, he is one of the three standout forwards we have got in the Premier League.\nSure, the other two have done it for longer in England, but Isak got 25 goals in all competitions last season, and has 19 already this campaign so he is bang on target to smash that total this time.\nHe's like an assassin, the way he puts chances away, but what I really liked from talking to him is that you can tell he is still looking for ways to improve his game at the age of 25.\nI asked him for his favourite, or best, goal that he has scored so far this season, and you will have to watch to find out which one he chose, and why.\nWhat I will tell you is that it was different to my pick, which was his powerful header against Arsenal in November. I saw that as a bit of a throwback goal, the kind that I used to love to score, and it came from what I'd describe as a dream delivery, too.\nThere was no nonsense from the winger, Anthony Gordon, who just whipped the cross in and it is a fantastic ball - a nightmare for the defenders and goalkeeper but for a forward it was perfect - early, with pace and whip on it. Isak did the rest, and we are getting used to seeing that now.", "url": "https://www.bbc.com/sport/football/articles/c4g344rq34ro"}