{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:03:44", "date_modify": "2025-05-20 12:03:44", "date_publish": "2023-08-05 13:45:30", "description": "Chelsea: Sanchez and Kepa - which Spain keeper to go for?", "filename": "sport_articles_cz9q2gq1nmjo_1747742624.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/69ca/live/626e3f00-3395-11ee-bde6-7ffba94c56ae.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cz9q2gq1nmjo_1747742624.html", "title": "Chelsea: Sanchez and Kepa", "title_page": "Chelsea: Sanchez and Kepa - which Spain keeper to go for? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Joe Bradshaw, BBC Sport\nChelsea have a Spanish inquisition on their hands.\nWith the signing of Robert Sanchez from Brighton, Mauricio Pochettino has brought the battle for Spain national keeper to a corner of west London.\nKepa Arrizabalaga is the world's most expensive goalkeeper but now, at 28, he really ought to have established himself as the premium option for Chelsea.\nAnd maybe he has, having seen off Edouard Mendy last season and won the gloves for himself.\nHowever, in Sanchez, Pochettino has acquired a younger keeper who generally acquitted himself with confidence at Brighton and has kept clean sheets in a third of his Premier League matches.\nA dive into their statistics shows the new man also has a slightly better save percentage (68.1 to 66.1) during their respective times in the Premier League.\nIn terms of safe hands, Sanchez has made almost double the number of catches as Kepa, with the latter more inclined to punch away than gather safely.\nPochettino probably has an open mind about who will line up in goal for the opening fixture next weekend, and you would assume the shirt is Kepa's to lose.\nJudging by Sanchez's confidence though, and he has signed a seven-year contract after all, he has not arrived at Stamford Bridge to play second fiddle.\nLet battle commence.", "url": "https://www.bbc.com/sport/articles/cz9q2gq1nmjo"}