{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:37:37", "date_modify": "2025-05-21 06:37:37", "date_publish": "2025-04-01 00:00:00", "description": "League Two top scorer Michael Cheek's header rescued a point for Bromley at Newport County.", "filename": "sport_football_live_ckgzg29e99jt_1747809457.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8945/live/21967140-0f3b-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_ckgzg29e99jt_1747809457.html", "title": "Top scorer Cheek rescues point for Bromley at Newport", "title_page": "Top scorer Cheek rescues point for Bromley at Newport - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "League Two top scorer Michael Cheek's header rescued a point for Bromley at Newport County.\nCameron Evans' first-half looping header from an Anthony Glennon corner gave County the lead at the break.\nCheek headed his side level in the 72nd minute for his 19th goal of the season, getting on the end of an inviting ball from substitute Cameron Congreve.\nCounty move up to 17th with the point – while Bromley remain in 13th position, nine points off the playoffs.\nHaving been four points off the play-offs in March, the Ravens are now five games without a win.\nHopes of ending that run looked to be boosted early at Rodney Parade when they had the ball in the back of the net in the third minute, but Daniel Imray was flagged for offside.\nAnd they also hit the woodwork, midway through the first half when defender Kamarl Grant's powerful strike from an Imray backheel beat keeper Nick Townsend only to clatter off the post.\nBut Newport took the lead 10 minutes later, with the Exiles' Evans nodding them in front with his fourth goal of the season.\nCheek had opportunities to level the scores before the break but Newport looked to extend their lead with Bobby Kamwa forcing Bromley's debutant keeper Samuel Long into a couple of saves early in the second half.\nBromley captain Cheek levelled the match with 20 minutes to go, heading Congreve's whipped cross to the back post past Townsend.\nNewport held on despite late pressure, but it is now a third game without a win for Nelson Jardim's side.\nNewport County head coach Nelson Jardim said:\n\"We knew it was going to be a difficult game, they are a physical team.\n\"From the beginning we could feel that energy from the fans. We have been on a difficult run but they helped us and gave us the energy to stay competing and ready for that battle.\n\"We know we are a small team, we can see that when we lined up at the beginning but I thought our boys did very well. They were organised and competed well.\"", "url": "https://www.bbc.com/sport/football/live/ckgzg29e99jt"}