{"authors": ["Katie Stafford", "www.facebook.com"], "date_download": "2025-05-21 06:53:18", "date_modify": "2025-05-21 06:53:18", "date_publish": "2025-01-22 14:12:49", "description": "Ruben Amorim press conference: Man Utd vs Rangers preview", "filename": "sport_football_articles_cdjd9xknymzo_1747810398.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/eec5/live/993cf210-a90a-11ef-a4fe-a3e9a6c5d640.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cdjd9xknymzo_1747810398.html", "title": "Ruben Amorim press conference: Man Utd vs Rangers preview", "title_page": "Ruben Amorim press conference: Man Utd vs Rangers preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "On calling them \"maybe the worst\" United side ever: \"I was talking more for myself than for my players because it is hard to find a coach who has lost seven games in their first 10. It is more for me.\"\nHe said he is \"frustrated and \"sometimes it is really hard to hide the frustration\", but added: \"The good thing is I said the same things in the dressing room five minutes before.\"\nIn response to how his players reacted: \"The response was normal because I am really blunt with my players. They have trained well and they are ready for this game.\"\nOn whether he tried to use his post-match comments to take away responsibility from the players: \"You have to look really hard to find a Manchester United team that in 10 games lost seven of them, and that is on me. It is the same players doing worse with a new coach. That is my only concern at the moment.\"\nHe said his players \"are too nervous with the ball\" but the responsibility falls to him as manager because \"we are performing really badly and our results are really bad\".\nHe said his players \"are really anxious playing at home and it is getting harder to play at Old Trafford\" because they have lost four out of the past five games.\nOn whether saying the team are \"nervous\" is helpful for the players: \"If you want I can be delusional and say different things. I say it as I see it. I said it to the players and I said it to you - I think it's a good thing to be really honest.\"", "url": "https://www.bbc.com/sport/football/articles/cdjd9xknymzo"}