{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:32:42", "date_modify": "2025-05-21 04:32:42", "date_publish": "2025-01-31 16:45:18", "description": "Cycling's world governing body says it has no plans to move the 2025 Road World Championships away from Rwanda despite ongoing conflict in DR Congo.", "filename": "sport_cycling_articles_cx25d105lvro_1747801962.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e215/live/16b512e0-dff2-11ef-b989-9b0a61de45dd.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cycling_articles_cx25d105lvro_1747801962.html", "title": "No plans to move UCI Road World Championships away from Rwanda", "title_page": "No plans to move UCI Road World Championships away from Rwanda - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cycling's world governing body, the UCI, says it has no plans to move the 2025 Road World Championships away from Rwanda amid the ongoing conflict in neighbouring DR Congo.\nRwanda is set to become the first African nation to host the event from 21-28 September.\nThe M23 rebel group has captured almost all of the eastern Congolese city of Goma and threatened to continue its offensive to the capital, Kinshasa, which is 2,600km (1,600 miles) away.\nThe UCI said it is \"closely monitoring developments\" and their potential impact on organisation of the championships in Kigali.\nIt added that Rwanda \"remains entirely safe for tourism and business\" because fighting is confined to DR Congo.\n\"Following the spread of rumours on this subject, the UCI clarifies that no relocation of the 2025 UCI Road World Championships from Rwanda to Switzerland or any other location is planned at this time,\" a statement on the governing body's website said.\n\"We hope for a swift and peaceful resolution of the situation.\n\"The UCI wishes to emphasise that sport, and cycling in particular, are powerful ambassadors for peace, friendship, and solidarity.\"", "url": "https://www.bbc.com/sport/cycling/articles/cx25d105lvro"}