{"authors": ["Jess Anderson", "www.facebook.com"], "date_download": "2025-05-20 14:05:29", "date_modify": "2025-05-20 14:05:29", "date_publish": "2023-07-30 19:36:20", "description": "Favourites living up to their billing, empty seats and mid-match interviews - what have we learned from the preliminary stage of the Netball World Cup?", "filename": "sport_netball_66354849_1747749929.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/C862/production/_130589215_gettyimages-1562927368.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_netball_66354849_1747749929.html", "title": "Netball World Cup 2023: What have we learned from preliminary stage in South Africa?", "title_page": "Netball World Cup 2023: What have we learned from preliminary stage in South Africa? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The preliminary pool stage of the Netball World Cup has ended - so, what have we learned after three days of action in Cape Town?\nFrom favourites living up to their billing, to empty seats and mid-match interviews, we take a look at what the initial phase of the tournament in South Africa has thrown up.\nAnd we'll also consider how England are shaping up before the more challenging stages of the competition begin.\nThe BBC's TV coverage of the tournament starts on Monday across TV, iPlayer and the BBC Sport website and app.\nFor the world's top four teams, it has been largely plain sailing, with each completing a perfect start - as they would expect in the early stages of the tournament.\nAustralia, New Zealand, England and Jamaica have each won all three of their respective pool matches and, with results being carried over to the next phase, that could prove crucial.\nDefending champions New Zealand overcame a tough challenge against Uganda but concerns were quickly squashed as they eased past Singapore to top their group.\nAiming to reclaim their World Cup title after winning Commonwealth gold last year, 11-time world champions Australia have been as ruthless as ever with their speed in attack leading them to score more than 80 goals in each match.\nEngland have progressed through their group with wins against Barbados, Malawi and Scotland.\nThey overcame a tough challenge against Malawi, where players lamented a slow start, but head coach Jess Thirlby said she was pleased for her side to have had a \"test\" so early on and there was \"no need to panic\".\nEngland have struggled, at times, to provide their formidable shooting options with the service they need but, after a lot of chopping and changing, a more settled starting seven from Thirlby can be expected as the next phase progresses.\n\"Every game we have managed to get all 12 players on court and seen so many different combinations of people playing in different positions,\" co-captain Layla Guscoth said.\n\"That can only hold us in good stead going into the next week. We need that versatility to see us through to the end.\"\nThe Roses face Tonga on Monday and Thirlby said her side are \"well prepared\" for the task as they seek to improve on their third-place finish at the last World Cup in Liverpool four years ago.\nWith stiffer opposition to face, slow starts and high error counts will need to be put to bed but, so far, England have got the job done in Cape Town.\nSouth African fans have made their voices heard at this World Cup, bringing a vibrant and colourful atmosphere to the host nation's matches with singing, dancing and chanting, as Africa hosts the tournament for the first time.\nBut that is in stark contrast to the swathes of empty seats evident at many of the other matches, including those involving the world's top sides.\nSome locals told BBC Sport they felt tickets for the tournament had been too expensive at 500 rand (£22) for children and 700 rand (£31) for adults for the cheapest tickets.\nTickets include two back-to-back matches but even in those sessions that have included South Africa matches, seats have been largely empty for the other match.\nMeanwhile, if you're tuning into the netball for the first time when the BBC coverage begins on Monday, you can expect to see something not very typical of many other sports.\nPlayers, usually the captains, from each team spend a few minutes chatting to television media at half-time to give their assessment of how the match is going and what they need to do in the second half.\nNot only that, coaches also stick a pair of headphones on and chat with the commentary team from the bench while play is ongoing.\nHelpful insight into the match? Or an opportunity to plant some tactical red herrings?\nFollow our coverage and make up your own mind.", "url": "https://www.bbc.com/sport/netball/66354849"}