{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:27:53", "date_modify": "2025-05-21 07:27:53", "date_publish": "2025-05-20 18:40:24", "description": "Man Utd: Maguire on Amorim, Europa League and improvement", "filename": "sport_football_articles_cd0llvdj5llo_1747812473.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ee57/live/c9164370-35a9-11f0-bb51-b172ed46873e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cd0llvdj5llo_1747812473.html", "title": "Man Utd: Maguire on Amorim, Europa League and improvement", "title_page": "Man Utd: Maguire on Amorim, Europa League and improvement - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester United defender Harry Maguire expects an \"awful amount\" of improvement under Ruben Amorim next season.\nSpeaking at a news conference in Bilbao on the eve of United's critical Europa League final against Tottenham, Maguire discussed his return to form and first-team football after setbacks and personal criticism under the club's former manager Erik ten Hag.\n\"It's amazing to be back in the team and playing regularly,\" said Maguire.\n\"This season I have played a lot of football. I don't take too much notice of the plaudits from the media and things like that. When you play for this club you can be an amazing player and the following week you can be the villain. That's part and parcel of playing for this club. I don't read too much into it. I try and stay as level as I can. Every game I go into it and try my best, and that's all you can do.\"\nUnited - 16th in the Premier League - meet 17th placed Tottenham in the showpiece European final. The pre-match narrative has focused on each side standing on the precipice of a glorious end to a season with a win or the completion of a dismal campaign with defeat.\nOn United's inconsistent results, Maguire said: \"Of course it is a frustration. When you play for this club you want to win every football match and this season we have been far too inconsistent.\n\"We haven't won enough, in the Premier League it's not been good enough. Europa League has been different, we have performed at a high level and we have proven that we can beat anybody.\n\"I am sure next season we will improve an awful amount, after a full pre-season [with manager Ruben Amorim]. As players we are all looking forward to that but we have got a big game tomorrow night, and that's first and foremost.\n\"It's a special night, a special occasion - we have prepared well the last few days and it's one that we are looking forward to.\"", "url": "https://www.bbc.com/sport/football/articles/cd0llvdj5llo"}