{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-04-26 03:54:02", "date_modify": "2025-04-26 03:54:02", "date_publish": "2025-03-03 07:25:37", "description": "Fulham news: Analysis - Whites can dream of Wembley return", "filename": "sport_football_articles_c74knvljw7eo_1745639642.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/46a8/live/4d1b7160-f7ff-11ef-8de2-8721900e2019.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c74knvljw7eo_1745639642.html", "title": "Analysis - Whites can dream of Wembley return - BBC Sport", "title_page": "Fulham news: Analysis - Whites can dream of Wembley return - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "It is an amazing statistic that since the Fulham side that contained England World Cup hero Bobby Moore lost to West Ham at Wembley half a century ago, only one final has not contained any of the two Manchester teams, the two from Liverpool, Arsenal, Tottenham or Chelsea.\nWith only Manchester City of that group left in this year's competition, there is a chance the unexpected nature of Portsmouth's victory over Cardiff in 2008 could be repeated.\nFulham will certainly fancy their chances.\nMarco Silva has put together a talented and deep squad capable of giving anyone a game on their day.\nThat has tended not to be against Manchester United, who had already beaten them twice in the Premier League this season and had lost just one of their past 21 previous meetings.\nHowever, they carried the greater threat on his occasion and should have gone in front when Alex Iwobi picked out Sasa Lukic with an excellent cross that should have met with a better ending than being sent over the bar.\nFor a long time, it appeared Calvin Bassey's effort would prove decisive. And after Bruno Fernandes' strike drew United level, Ryan Sessegnon brought an excellent save out of Andre Onana in second-half stoppage time.\nBut, after Raul Jimenez, Sander Berge and Willian had kept Fulham level in the shootout, Bernd Leno twice guessed correctly as Fulham gained redemption for the self-inflicted pain of two years ago, when they were ahead and in command of a quarter-final tie against United at Old Trafford, only to implode after a controversial penalty was awarded against them, which led to three red cards, including one for Silva, and eventual defeat.", "url": "https://www.bbc.co.uk/sport/football/articles/c74knvljw7eo"}