{"authors": ["Will Faulks", "www.facebook.com"], "date_download": "2025-04-26 07:55:47", "date_modify": "2025-04-26 07:55:47", "date_publish": "2025-02-25 12:34:14", "description": "Chelsea news: Opinion - Personality, fitness and game management", "filename": "sport_football_articles_c5y0dx3npllo_1745654147.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2e6b/live/e7ef49b0-b628-11ee-bc2f-cb5579b90709.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c5y0dx3npllo_1745654147.html", "title": "Opinion - Personality, fitness and game management - BBC Sport", "title_page": "Chelsea news: Opinion - Personality, fitness and game management - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Chelsea's defeat at Aston Villa generated an astonishing statistic.\nThe 2-1 loss made it 13 points dropped by the Blues in games they had the lead in - since Boxing Day. That is more points than some teams drop from winning positions in a whole season, and Chelsea have done it in two months.\nAsked about that incredible figure and the potential reasons behind it in his news conference on Monday, Enzo Maresca admitted he had been aware of the stat but said he did not have an answer as to why it was happening.\nThat is a worrying thing to hear about such a critical problem. Even from the outside, it is clear what some of the causes are.\nFirst, there is an obvious personality issue. Building a team of youngsters with little top-level experience was bound to create a group which lacks the composure and leadership to respond to setbacks on the pitch and to work out how to overcome them.\nThere also appears to be a fitness problem. The energetic attacking which produced such good results through the autumn has faded into sluggish possession play. Maresca's team end every game clinging on, whether winning or losing, and that has to be at least in part a physical issue.\nCompounding that is Maresca's own game management. On Saturday, he changed his team and set them up nicely. They took the lead and were well positioned. However, as the match wore on, Unai Emery in the opposing dugout adjusted his side until they had the upper hand. Maresca had no response.\nIn this instance, there is no denying there was a lack of options on the bench for him, but his failings in this area were notable even when he had a full squad to pick from.", "url": "https://www.bbc.co.uk/sport/football/articles/c5y0dx3npllo"}