{"authors": ["Gary Owers", "www.facebook.com"], "date_download": "2025-05-21 05:35:49", "date_modify": "2025-05-21 05:35:49", "date_publish": "2025-04-01 08:50:40", "description": "BBC Radio Bristol summariser and ex-Robins player Gary Owers says City are still in the play-off fight despite defeat by Burnley.", "filename": "sport_football_articles_cn05e90pjx9o_1747805749.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d7c5/live/525e3de0-0edb-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cn05e90pjx9o_1747805749.html", "title": "Gary Owers: Bristol City 'came up against a really good Burnley team'", "title_page": "Gary Owers: Bristol City 'came up against a really good Burnley team' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "City dug in there against Burnley and had one or two outstanding individuals at the back - Rob Dickie in particular. They were brave, they got important blocks in, they got interceptions in.\nThere will be an element of disappointment because when the goal came, it was a set play. But at the top end of the pitch - and there's no shame because Burnley are watertight at the back, we know that - they didn't really cause too many problems.\nThey've just come up against a really good team. If you say, 'is there a gap between where City currently are and the top of the division in Leeds, Sheffield United and Burnley?' there probably is.\nThose three teams are going to fight it out for the top two positions and hopefully City haven't picked up any injuries and can look forward to two home games - against Watford and West Brom - at Ashton Gate.\nIt's a very winnable game next [against Watford] but you can't take anything for granted. Middlesbrough turned that result around against Oxford and they will chase Coventry and West Brom in the positions that we're trying to be in ourselves.\nLots of twists and turns to come. Hopefully we can recover after defeat and get back to winning ways as quickly as possible.", "url": "https://www.bbc.com/sport/football/articles/cn05e90pjx9o"}