{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:13:54", "date_modify": "2025-05-19 15:13:54", "date_publish": "2015-02-23 10:17:34", "description": "Wales' \"boom and bust\" tendencies under Warren Gatland worry legendary tight-head prop Graham Price.", "filename": "sport_rugby-union_31580532_1747667634.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/77557000/jpg/_77557759_450489350.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_rugby-union_31580532_1747667634.html", "title": "Six Nations 2015: Boom and bust Wales worry Graham Price", "title_page": "Six Nations 2015: Boom and bust Wales worry Graham Price - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Legendary prop Graham Price says Wales are in danger of repeating their \"boom and bust\" tendencies in the 2015 Six Nations championship.\nThe former Wales and British and Irish Lions tight-head says the pattern under coach Warren Gatland has been \"very inconsistent\".\nWales lost to England, beat Scotland and face France in Paris on Saturday.\n\"We seem to be going from boom to bust and I think that's been the case this season as well,\" said Price.\nAs member of the famed Pontypool front row during the 1970s and 1980s, Price played 41 times for Wales and 12 consecutive Lions Tests at tight-head on three tours spanning 1977-1983.\nHe told Scrum V that despite the highs of Grand Slams in 2005, 2008 and 2012, winning the 2013 tournament and a huge Welsh influence on the 2013 Lions series win in Australia, Wales have struggled at times.\n\"I've been a bit disappointed really because they've been very inconsistent,\" said Price.\n\"Over the years we've had Grand Slams followed by 10 matches without winning a game.\n\"And then we won the [2013] Six Nations and all our players went off on a Lions tour and beat Australia in the Test series.\n\"And we're talking about the same players who actually played in a Test series against Australia for Wales and basically threw away the series.\"\nPrice has called veteran tight-head Adam Jones' omission from Wales' tournament squad a \"mistake\".\nCardiff Blue Jones subsequently retired from Test rugby.\nNow Price wants to see Wales' attacking play improve as they target victory in Paris.\nHe said: \"It's important that we play to tempo, keep the opposition struggling in defence so we can create our overlaps and create mis-matches in the centres, where we've got wingers and centres running at front-row forwards.\n\"But we haven't been doing it. It's been sort of slow.\n\"The opposition have known what we are doing and they could organise their defences to stop it.\"", "url": "https://www.bbc.com/sport/rugby-union/31580532"}