{"authors": ["Andy Gray", "www.facebook.com"], "date_download": "2025-05-21 05:44:09", "date_modify": "2025-05-21 05:44:09", "date_publish": "2025-01-31 17:05:52", "description": "Ireland are aiming to become the first men's side to win three Six Nations titles in a row, but how have previous attempts fallen short?", "filename": "sport_rugby-union_articles_cpqlvg1pjy4o_1747806249.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9942/live/0cbc07f0-dcb7-11ef-902e-cf9b84dc1357.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cpqlvg1pjy4o_1747806249.html", "title": "Six Nations 2025: Why have teams fallen short in three-peat bid?", "title_page": "Six Nations 2025: Why have teams fallen short in three-peat bid? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ireland head into the 2025 Six Nations looking to go where no team has ever been before.\nA hat-trick of titles has never been achieved in the men's game, and Ireland are five games away from writing their names in the history books.\nIf you think back to England's World Cup winners, France's mid-2000s domination or Warren Gatland's golden era with Wales, it's almost a surprise that it's not been achieved before.\nIt last happened when France's name appeared on the trophy on four consecutive occasions in the Five Nations in the late 1980s.\nBut even then, their 1986 and '88 titles were shared with Scotland and Wales.\nIreland will look to avoid a similar fate to those who have come close before, but where have teams fallen short in the past?\nEngland were the last team to go for three titles in a row after winning the Six Nations in 2017 and 2018, but their bid to make it a hat-trick was something of a disaster.\nEddie Jones' side made a good start with a big win over Italy in Rome, and that was followed by an edgy win at home over Wales.\nSo far, so good. But things would soon start to unravel.\nScotland stunned England to claim the Calcutta Cup for the first time since 2008 with their 25-13 win the largest victory for the Scots over their rivals in the Six Nations.\nNext up, England fell in Paris as the French ran out convincing 22-16 winners.\nTheir chance for the title was over, but could they stop Joe Schmidt's Irish juggernaut from clinching the Grand Slam at Twickenham on St Patrick's Day?\nUltimately, Ireland were too strong and ended their campaign with a perfect record as England finished fifth in the table with two wins for their efforts.\nAfter ending Wales' run of titles in 2014, it was Ireland's turn to win back-to-back Six Nations the following year and eyes soon turned to a potential hat-trick.\nFrance and England won their first matches before, in a Six Nations rarity, Ireland and Wales drew their opener 16-all.\nThe Irish title defence took a further blow as France ran out 10-9 winners in Paris, and England scored 15 unanswered points in the second half to end Ireland's hopes of retaining the title.\nIreland finally collected their first win against Italy, and England's biggest scare of the tournament came as they held off a ferocious Welsh fightback to win 25-21.\nHaving missed out on points difference the previous year, England were so good that their title was secured with a game to spare as France lost in Scotland.\nEddie Jones' side wrapped up a first Grand Slam since 2003 with a win over France. Job done.\nAfter winning the Grand Slam in 2012 and another title the following year, Wales fell just two points short of making three Six Nations titles in a row in 2014.\nWales and Ireland both won their opening matches, while Gael Fickou's last-gasp try saw France defeat England in a thriller.\nIreland blew holders Wales away in Dublin in round two, while England and France collected big wins.\nThe championship took a big twist in the third round as Wales bounced back to defeat France, while England edged past Ireland at Twickenham.\nIt looked like it was anyone's title, but Wales' hopes were ended by England, as Ireland and France both won again.\nGoing into the final day, Ireland, France and England could all still claim the title.\nEngland hammered Italy to pile the pressure on Ireland in Paris. Johnny Sexton's 17 points helped Ireland over the line by two points, despite a late French fightback.\nIt was one of the most competitive years in Six Nations history, and it was Ireland who prevailed.\nEngland were the dominant force in the Six Nations at the start of the millennium with three of the first four titles.\nHowever, Clive Woodward's side fell short of a three-peat at the hands of France in 2002 - who achieved the first Grand Slam of the Six Nations era.\nGoing into the tournament as favourites, England hammered Scotland and put a big score on Ireland to get their campaign off to a perfect start.\nFrance, meanwhile, had defeated Italy and held off a late Wales rally in Cardiff.\nThe decisive turn came in Paris when England were unable to overturn a 17-7 half-time deficit despite a late fightback by the holders.\nWhile England hammered Wales and Italy in their final two matches, a nervy victory over Scotland and a big win over Ireland secured the Grand Slam for Les Bleus.\nHowever, it didn't work out too badly in the long run. England retained the Six Nations with a Grand Slam 12 months later, and their historic 2003 was capped off with their famous World Cup win over Australia.", "url": "https://www.bbc.com/sport/rugby-union/articles/cpqlvg1pjy4o"}