{"authors": ["Timothy Abraham", "www.facebook.com"], "date_download": "2025-05-21 03:40:54", "date_modify": "2025-05-21 03:40:54", "date_publish": "2025-04-06 22:59:42", "description": "Brian Harman warms up for the Masters with a three-shot victory in blustery conditions at the Texas Open in San Antonio.", "filename": "sport_golf_articles_cwynwjw4lgvo_1747798854.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/08d3/live/ba559250-1335-11f0-91af-67adb18a6fad.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_golf_articles_cwynwjw4lgvo_1747798854.html", "title": "Texas Open: Brian Harman warms up for Masters with three-shot win in San Antonio", "title_page": "Texas Open: Brian Harman warms up for Masters with three-shot win in San Antonio - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Texas Open, final leaderboard\n-9 B Harman (US); -6 R Gerard (US); -5 A Novak (US) M McNealy (US)\nSelected: -3 J Spieth (US); -2 Z Johnson (US); -1 H Hall (Eng), M Wallace (Eng); Evens R Fowler (US); +3 J Rose (Eng); +8 T Fleetwood (Eng)\nFinal leaderboard\nBrian Harman warmed up for this week's Masters with a three-shot victory in blustery conditions at the Texas Open in San Antonio.\nThe 38-year-old, who won the 2023 Open Championship, finished with a three-over par 75 in his final round but it was still good enough to finish clear of the pack.\nHarman's title was his fourth career PGA Tour title and his first tournament success since he claimed the Claret Jug at Royal Liverpool a couple of years ago.\nFellow American Ryan Gerard finished in second on six under after a he shot a nine-under round of 69, with compatriots Andrew Novak and Maverick McNealy a further shot back.\n\"The last two days felt like they took an eternity, with the wind it felt like a nightmare out there,\" Harman told Sky Sports.\nJustin Rose carded a final-round 76 to finish three over for the tournament while fellow Englishman Tommy Fleetwood struggled as he shot 81 to finish eight over.", "url": "https://www.bbc.com/sport/golf/articles/cwynwjw4lgvo"}