{"authors": ["Matthew Henry", "www.facebook.com"], "date_download": "2025-05-21 03:53:27", "date_modify": "2025-05-21 03:53:27", "date_publish": "2025-04-07 09:02:36", "description": "England spinner Sophie Ecclestone says she has \"moved on\" and \"learned from\" her refusal to do an interview with Alex Hartley during the Women's Ashes.", "filename": "sport_cricket_articles_c62xq3xx3z4o_1747799607.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/38a5/live/e6e22ab0-122f-11f0-a820-05f89b05038b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c62xq3xx3z4o_1747799607.html", "title": "Sophie Ecclestone: England spinner says she has \"moved on\" from refusal to do interview", "title_page": "Sophie Ecclestone: England spinner says she has \"moved on\" from refusal to do interview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England spinner Sophie Ecclestone says she has \"moved on\" and \"learned from\" her refusal to do an interview with Alex Hartley during the Women's Ashes in January.\nHartley, who was working as a pundit for the BBC and other networks, was refused a TV interview by former England team-mate Ecclestone during England's 16-0 thrashing.\nIt came after Hartley questioned the fitness levels of some of England's players following their early exit from the T20 World Cup last year.\nSpeaking for the first time since the incident, Ecclestone, 25, told BBC Sport: \"It is in the past now.\n\"We have got a really exciting summer this year and I am really excited to get back with England and playing West Indies and India again.\"\nEcclestone's refusal to do an interview was prior to the first T20, at which point England were already 6-0 down in the multi-format points-based series.\nClare Connor, the managing director of England women's cricket, has since described the episode as \"an unfortunate incident that won't happen again\". Ecclestone and Hartley have not spoken since.\nAsked why she refused the interview, Ecclestone reiterated her wish to look forward.\n\"Everyone has moved on now, as I said,\" the left-arm spinner said.\n\"There is not much more to be said about that story.\n\"Me and Alex have moved on and we have both learned from that. I am excited for the summer to start.\"\nFormer spinner Hartley, who is currently working with Multan Sultans in the Pakistan Super League, told BBC Sport: \"Sophie and I respect one another and we absolutely have moved on. We will continue to move forward.\"\nThe fallout from England's defeat in Australia resulted in Jon Lewis and Heather Knight being sacked as coach and captain respectively.\nLewis has been replaced by legendary former captain Charlotte Edwards, who said at her unveiling she will make players \"accountable\" for fitness.\nAfter England were knocked out of the T20 World Cup group stage in October, former spinner Hartley said some players were \"letting the team down\" in terms of fitness.\n\"Everyone has got their own opinion and everyone is entitled to that,\" Ecclestone said.\n\"Not many people see how hard we work behind closed doors as cricketers and people. People can have their own opinion.\n\"It is a new era now and we are all excited to start working hard and hopefully get a few trophies this year.\"\nThe position to be England captain remains vacant but Ecclestone, who has served as vice-captain, said she was unsure if it is the \"right time\" for her to take over.\n\"I feel like I would love to do it in the future but I am not sure now is the right time,\" Ecclestone said. \"I am still working on myself and getting better as a cricketer.\"\nEcclestone was speaking at Wythenshawe Cricket Club in Manchester as part of the ECB's Get Set Weekend, where more than 1,700 clubs across the country - record number for the project - get prepared for the new season with the help of 37,000 volunteers.\nShe made her England debut aged 17 in 2016, after Edwards had retired as a player, but as a highly-rated youngster was involved in the England set-up under the former batter.\n\"When I was 16 and started coming into the England environment Lottie was captain and I was scared to meet her,\" Ecclestone said.\n\"I remember when I went in I was like 'Charlotte Edwards is in that room…'\n\"I am so excited to work with her again.\"", "url": "https://www.bbc.com/sport/cricket/articles/c62xq3xx3z4o"}