{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:43:52", "date_modify": "2025-05-21 03:43:52", "date_publish": "2025-04-06 16:16:16", "description": "Rugby fan views: Praise for 'brave' Glasgow Warriors & 'complete' Edinburgh display", "filename": "sport_articles_c0jzn57nj6xo_1747799032.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e642/live/955f3310-12ff-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c0jzn57nj6xo_1747799032.html", "title": "Rugby fan views: Praise for 'brave' Glasgow Warriors & 'complete' Edinburgh display", "title_page": "Rugby fan views: Praise for 'brave' Glasgow Warriors & 'complete' Edinburgh display - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your views on Glasgow and Edinburgh's weekend action.\nHere's what some of you had to say:\nGLASGOW WARRIORS\nAnthony: Another good performance by Warriors, keeping the penalty count relatively low. Leicester got on the wrong side of the referee early on and gave away far too many penalties. Pleasantly surprised to see Warriors dominate the scrums, against an experienced Leicester pack. Some of the interplay and ball handling between forwards and backs was a joy to watch. Warriors will have to ramp up their performance a few more notches, to lay a glove on Leinster next weekend. They also need to be a bit more pragmatic at times and take the three points from penalties, to keep the scoreboard ticking over.\nKenny: Gregor Brown is getting better each game. Always breaking the gain line. Zander Fagerson had a masterclass in the front row of the scrum. Hastings could have got his deck chair out. Easy ride at 10 just sending players through gaps. TJ class act as always. Next week is a tall order but we have got to beat them sometime.\nStuart: Very brave display from the Warriors. Huge credit to the lads. Du Preez, Vilanu and Venter had outstanding games with Venter deserving player of the match. Need to cut out errors and manage mauling and line outs better against Leinster next week for a result.\nEDINBURGH\nHopey: Felt this was the most complete performance I have seen from Edinburgh recently, built on a solid defence, with Wes Goosen and Darcy Graham excellent in attack at getting in behind the Lions defence. It was a game played with tempo, which seemed to help Edinburgh as they were connected and had a flow to their game. Fingers crossed this continues, looks promising.\nMark: Edinburgh scored some great tries but all too often came away from the opponents 22 with nothing. If they want to compete at the highest level they must consistently turn territory and possession into points.", "url": "https://www.bbc.com/sport/articles/c0jzn57nj6xo"}