{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:56:36", "date_modify": "2025-05-21 03:56:36", "date_publish": "2025-04-07 13:00:29", "description": "Sunderland boss Regis Le Bris says it is \"possible\" that winger Romaine Mundle could miss the rest of the season.", "filename": "sport_football_articles_cvgqelv4mz7o_1747799796.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c215/live/193acc90-13a9-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cvgqelv4mz7o_1747799796.html", "title": "'It's possible' Mundle is out for the season", "title_page": "'It's possible' Mundle is out for the season - Le Bris - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Sunderland boss Regis Le Bris says it is \"possible\" that winger Romaine Mundle could miss the rest of the season following a return of his hamstring injury in Saturday's 1-0 win at West Brom.\nThe head coach told BBC Radio Newcastle's Nick Barnes: \"We don't have a timeline. We are seeking other advice so we will have to wait.\"\nStriker Eliezer Mayenda was selected as Mundle's replacement on the left-wing despite other options available on the bench.\nTommy Watson, who is joining Brighton in the summer, was an unused substitute and Enzo Le Fee previously played there before he was injured.\nLe Fee returned to the side from the bench in his favoured central role against West Brom and Le Bris has previously stated he is keen to keep him as a number 10 going forward.\nDiscussing whether Mundle's injury changes those plans, Le Bris added: \"First of all we have to protect Enzo.\n\"The question mark for him is to gradually improve his shape and his connection to the team without being a rush. We still have six games left in this league. So, many experiences, many opportunities to test different options.\"\nA win at Norwich on Tuesday would finally confirm Sunderland's place in the Championship play-offs, and with a handful of games left to go, it gives Le Bris plenty of time to find the best way to replace Mundle and also gently bring back Le Fee from his injury.\nThe Frenchman added: \"The core of the group is still small but we are in a very good place and we can manage a little bit more now, the rotation, the experiences we can give. Some for some young players and to rotate a bit more of the squad.\"", "url": "https://www.bbc.com/sport/football/articles/cvgqelv4mz7o"}