{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:16:21", "date_modify": "2025-05-19 15:16:21", "date_publish": "2015-02-09 17:15:29", "description": "Relegation-threatened Millwall claim a second win in three games as Alan Dunne's goal sees off Birmingham.", "filename": "sport_football_31105932_1747667781.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/80923000/jpg/_80923436_forde_getty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31105932_1747667781.html", "title": "Birmingham City 0-1 Millwall", "title_page": "Birmingham City 0-1 Millwall - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Relegation-threatened Millwall claimed a second win in three Championship games as Alan Dunne's second-half goal proved enough to beat Birmingham.\nThe captain headed home when Birmingham failed to clear a ball swung into a crowded goalmouth.\nMillwall remain in the relegation zone only because of an inferior goal difference to fourth-bottom Brighton.\nBirmingham, who are 11th in the table, have taken four points from their last five matches.\nThey have not won since beating Wigan on 10 January.\nUnder-pressure Millwall boss Ian Holloway, meanwhile, can be heartened by his side's resilient performance.\nMartyn Woolford went close to giving the Lions a first-half lead when his clever lob hit the bar, before Dunne struck 10 minutes into the second half.\nBirmingham threatened a late equaliser as Jonathan Grounds's header from a corner hit the woodwork.\nBirmingham manager Gary Rowett:\n\"It was a frustrating night and a frustrating performance in many ways. I felt when we went out from the start it felt a little bit flat and felt a little bit as though we were going to turn up and win the game.\n\"It just doesn't happen like that. I thought Millwall blocked the game up well and it was very difficult for us to find space and we just didn't move the ball quick enough.\n\"We didn't cause them enough problems in the final third and that was the most disappointing thing.\n\"Games like that are going to happen and we have to try and find a solution. It was a poor goal to concede and from then on we huffed and puffed.\"\nMillwall manager Ian Holloway:\n\"We had to ride a couple of things, like our record here. We have not won here since 1968 and that is pretty scary. They hit the bar, that was scary, but on the whole I was really pleased with the response of my lads.\n\"We are a new group and we are learning and we came here against a really good side. I don't think Birmingham played poorly. I don't think we allowed them to play and I thought we played well.\n\"That is the Championship. Anyone can beat anyone on a given day and what we need to try and do is win at home. It is pretty heartbreaking for our fans. The ones who come away are quite enjoying it.\"", "url": "https://www.bbc.com/sport/football/31105932"}