{"authors": ["Nick Webb", "www.facebook.com"], "date_download": "2025-05-21 04:16:54", "date_modify": "2025-05-21 04:16:54", "date_publish": "2025-04-05 17:51:21", "description": "Lewis Hill leads the way with 96 as Leicestershire take control against Glamorgan on day two.", "filename": "sport_cricket_articles_c5yg71gnk9do_1747801014.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1c91/live/5b5c9450-1246-11f0-9d46-3377f28968f3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c5yg71gnk9do_1747801014.html", "title": "County Championship: Hill and Wright earn Leicestershire big lead over Glamorgan", "title_page": "County Championship: Hill and Wright earn Leicestershire big lead over Glamorgan - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Lewis Hill led the way for Leicestershire with 96 as they took control against Glamorgan, reaching 426-8 on day two with a lead of 197 runs.\nHill shared a stand of 142 with Peter Handscomb (63), his successor as captain.\nTail-ender Chris Wright (72*) and Ben Cox (51*) put together a century stand to add to Glamorgan's suffering.\nSri Lankan paceman Asitha Fernando took 4-71 on debut, but England spinner Shoaib Bashir went wicketless in 22 overs.\nStarting on 65-1, the positive pair of Sol Budinger and Ben Mike (41) took their stand to 88 before Fernando struck twice in mid-morning.\nFernando, the first player from Sri Lanka to represent the daffodil county, had Mike lbw and induced Budinger to sky a pull.\nHill survived a loud shout for caught behind first ball but took the initiative as Handscomb started watchfully before moving through the gears.\nThe Australian's no-nonsense knock was chanceless until he top-edged Andy Gorvin to mid-wicket, while Hill shrugged off the previous toils of leadership as he struck 15 fours and a six before he called a risky single to Sam Northeast at mid-off and was run out.\nGorvin quickly sent back Rehan Ahmed as Leicestershire lost three wickets in the space of 11 runs, and Fernando returned with the new ball to get rid of the slow-starting Ben Green for 10 and Tom Scriven for 12.\nBut Wright, promoted to 10 in the absence of Rishi Patel with a dislocated thumb, added to Glamorgan's distress as he dominated a stand with Ben Cox and made the home attack look toothless, with Timm van der Gugten having a rare blank day.\nWright cruised to his 15th first class half-century with an array of confident boundaries as he and Cox, coming together with the score on 324, earned Leicestershire a fourth batting point.\nThe ninth-wicket stand left Glamorgan with a mountain to climb to save the match over two days, even assuming the wicket continues to improve in the sunshine.\nWright struck 12 fours and two sixes to move within sight of a career-best.\nLeicestershire's Lewis Hill told BBC Radio Leicester:\n\"The guys up the top, Ben and Sol, did really well to set up the platform for the day, Pete and me had a good partnership, and the guys at the end (Wright and Cox) added to the day nicely.\n\"I felt last year I didn't put enough pressure on the bowlers, but this year I feel under a lot less pressure myself and there's less going on so I can get back to a nice rhythm with my batting.\n\"I'm definitely more relaxed, and Pete is so calm and great to bat with.\"\nGlamorgan assistant coach David Harrison told BBC Sport Wales:\n\"Chris Wright has been around a long time, he played a nice knock but it's frustrating when a last-wicket partnership puts on a score like that even though the boys kept coming all day.\n\"Asitha is a quality performer, I've spoken to him a bit about changing his mindset and tactics in the conditions here in Cardiff, and he showed his skill and pace.\n\"We're behind in the game, so we need to get the last wicket quickly, build a big score and then any sort of chase in the last innings in Cardiff will be a tough one.\"", "url": "https://www.bbc.com/sport/cricket/articles/c5yg71gnk9do"}