{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:31:22", "date_modify": "2025-05-21 06:31:22", "date_publish": "2025-01-22 20:21:55", "description": "Tottenham manager Ange Postecoglou says his players are \"giving everything in every game\" and have a \"fantastic opportunity\" to enjoy a successful season.", "filename": "sport_football_articles_c86315jz7zno_1747809082.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4f49/live/d0003f10-d8fc-11ef-873d-092fd4e0740b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c86315jz7zno_1747809082.html", "title": "Tottenham: Ange Postecoglou says players are 'giving everything'", "title_page": "Tottenham: Ange Postecoglou says players are 'giving everything' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tottenham Hotspur manager Ange Postecoglou says his players are \"giving everything in every game\" and have a \"fantastic opportunity\" to enjoy a successful season.\nSpurs have won just one of their past 10 Premier League games and are without a victory in the past six.\nSunday's 3-2 defeat at Everton was their third in succession and they sit 15th in the table, leading to questions over whether Postecoglou is the right man to take the club forward.\nDespite their league struggles Tottenham remain active in three other competitions - the Carabao Cup, FA Cup and Europa League.\n\"We are still in three cup competitions and there's a fantastic opportunity for us there in the next couple of months,\" Postecoglou said.\n\"The players are giving everything in every game. The players aren't prioritising anything - they are trying their utmost.\"\nTottenham have lost 12 games in the Premier League this season, making it only the sixth campaign in which they have lost as many as 12 from their first 22 league matches, and the first time since 1997-98 (also 12 defeats).\nSpurs' best chance of winning silverware could lie in the EFL Cup after winning the first leg of their semi-final 1-0 when hosting Liverpool.\nThey travel to Aston Villa in the fourth round of the FA Cup and are ninth in the Europa League standings - one place outside automatic qualification for the last 16, but they have two games to play.\nPostecoglou believes injuries have played a major part in Tottenham's struggles and he has only 13 fit senior players available for Thursday's Europa League trip to Hoffenheim (17:45 GMT).\n\"You really need a really strong squad of players to compete in Europe and do well in cup competitions because it's not manageable when you play three games a week,\" Postecoglou added.\n\"The reality is we don't have a lot of choice [because of injuries]. You're always assessing why it's happening.\n\"Early part of the year there were some things that were repeatedly happening with injuries so we've worked hard to better that process. Recently it's accumulation and toll of fixtures.\"", "url": "https://www.bbc.com/sport/football/articles/c86315jz7zno"}