{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:28:58", "date_modify": "2025-04-26 04:28:58", "date_publish": "2025-03-02 08:37:29", "description": "Wales centre Ben Thomas is content with returning to his more familiar position after starting the Six Nations at fly-half.", "filename": "sport_rugby-union_articles_cj3eevl4rr1o_1745641738.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6632/live/e795f320-f6cc-11ef-a811-cd286d96b2f6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_cj3eevl4rr1o_1745641738.html", "title": "Thomas happy to return to centre stage for Wales", "title_page": "Six Nations: Ben Thomas happy to return to centre stage for Wales - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Wales centre Ben Thomas is happy to have returned to the position he feels \"more comfortable\" in, having started this year's Six Nations tournament at fly-half.\nThomas was employed in the number 10 jersey by former head coach Warren Gatland for the opening defeats against France and Italy.\nWhen Matt Sherratt - Thomas' boss at Cardiff - took the coaching reins on an interim basis after Gatland's departure following 14 successive Test match defeats, he immediately handed the 26-year-old the role he plays for their region.\nThomas acknowledges the impact Sherratt has had on him in his day job as well as with Wales, with the Cardiff coach moving him back to inside centre on the Test stage to form a midfield partnership with Max Llewellyn, and specialist fly-half Gareth Anscombe alongside them.\n\"It [12] is probably a position I am more comfortable in, especially given that we played a similar style of gameplan to what we play at Cardiff, so it was pretty simple for me to fall back into,\" said Thomas.\n\"When I first met him [Sherratt], he was pretty clear on the fact he likes playing with a ball-playing 12.\n\"He was able to really help me develop my game in ways I hadn't thought of at that time.\"\nThomas hopes the sense that people can \"fall back in love with Welsh rugby\" will continue when they resume their Six Nations campaign against Scotland in Edinburgh next Saturday.\nSherratt's immediate impact saw him turn Wales around from a team humbled by Italy to one that gave Six Nations title favourites Ireland one of their biggest challenges of this season's tournament.\nAlthough Wales lost 27-18 for a record 15th successive Test match defeat, the performance, and what Thomas calls the \"licence to play\" Sherratt has issued, highlighted a transformation that augers well for remaining Six Nations appointments with Scotland and England.\n\"We wanted to bring some positivity back,\" Thomas said.\n\"Ultimately, there is a lot that is out of your control in terms of getting results, so we had a big focus on playing a game of rugby and a brand of rugby that would get people excited, to almost fall back in love with Welsh rugby.\n\"And I suppose it doesn't change next week. The process has to be the same. We will put our best game out on the field and hopefully the result goes our way.\n\"I wasn't surprised with how he [Sherratt] took to it because he has got a brilliant rugby brain. That is clear for everyone to see by the way he coaches Cardiff.\n\"The challenge would have been trying to get things across in such a small period of time but the way he delivers messages is pretty clear and the boys were able to pick things up quite well.\"\nWales will arrive at Murrayfield on Saturday with an impressive recent record, having won six of the last eight Six Nations games against Scotland in Edinburgh.\n\"The mood has been pretty positive,\" said Thomas.\n\"It is an exciting way to play rugby to go out there and just try and throw as many punches as possible.\n\"We probably came off the pitch after the first two matches [against France and Italy] feeling we hadn't fired any shots at the opposition.\n\"To come off against Ireland, knowing that we had been in the game for the most part - and were able to put our game on the pitch, as opposed to just absorbing what was being thrown at us - was pretty pleasing for us.\"", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/cj3eevl4rr1o"}