{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:05:47", "date_modify": "2025-05-21 07:05:47", "date_publish": "2025-03-29 00:00:00", "description": "Reading extend their unbeaten run in League One to 11 games with a comfortable win over EFL Trophy finalists Peterborough United.", "filename": "sport_football_live_c1jp3p3n9znt_1747811147.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9006/live/6e3b9e90-0afd-11f0-88b7-5556e7b55c5e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c1jp3p3n9znt_1747811147.html", "title": "Reading 3-1 Peterborough United", "title_page": "Reading 3-1 Peterborough United - Royals extend unbeaten run to 11 games - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Reading extended their unbeaten League One run to 11 games as they breezed past Peterborough at the SCL Stadium.\nThe Royals held a 1-0 half-time lead courtesy of an early own goal by Posh skipper Sam Hughes and were soon 3-0 up in the second half after efforts from Harvey Knibbs and Charlie Savage.\nKwame Poku reduced the deficit for Peterborough but the disappointing visitors were rarely in the hunt.\nAfter a cagey opening from both sides, play-off-chasing Reading went ahead in the seventh minute – albeit in fortuitous circumstances.\nIt may have been a slick team move that sliced apart the Posh defence but it needed an inadvertent final touch from Hughes, just ahead of home winger Chem Campbell, to divert Kelvin Ehibhatiomhan's pullback into his own net.\nPosh should have equalised seven minutes later but, on a quick break, Abraham Odoh somehow sliced wide from a fine Malik Mothersille cross.\nNeither goal was seriously threatened again before the break but the Royals seemed to have made the game safe by striking twice in five minutes.\nKnibbs slotted in from close range in the 58th minute, with his 15th goal of the season, and Savage did similarly from a Jayden Wareham cross.\nPoku pulled one back, with his 11th of the campaign after some sloppy home defending, but Posh needed superb saves from keeper Jed Steer to deny Andy Yiadom and Savage towards the end.", "url": "https://www.bbc.com/sport/football/live/c1jp3p3n9znt"}