{"authors": ["Evie Ashton", "www.facebook.com"], "date_download": "2025-05-21 04:31:03", "date_modify": "2025-05-21 04:31:03", "date_publish": "2025-04-05 07:56:53", "description": "Birmingham Panthers player Aliyah Zaranyika tells BBC Sport about netball's role in her autistic burnout.", "filename": "sport_netball_articles_c793nj0y709o_1747801863.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/00f0/live/3220f0e0-0f08-11f0-8db0-89a142ea748b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_netball_articles_c793nj0y709o_1747801863.html", "title": "Netball Super League 2025: Birmingham Panthers' Aliyah Zaranyika on autistic burnout", "title_page": "Netball Super League 2025: Birmingham Panthers' Aliyah Zaranyika on autistic burnout - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Aliyah Zaranyika was used to putting on a persona to fit in. But halfway through last year's Netball Super League season, she reached a breaking point.\nDay-to-day tasks and regulating her emotions became so overwhelming that she found it difficult to articulate how she felt, and a flare-up of painful broken blisters and sores on her leg left her unable to walk.\nThe England Future Roses player was experiencing autistic burnout.\nShe believes this was brought on by masking her autism and ADHD - attention deficit hyperactivity disorder - around people for long periods in the high-pressure environment of her sport.\n\"As much as people are nice - I've made some of my best friends in netball - I struggled with the natural politics and knowing my place in the team,\" the Birmingham Panthers player told BBC Sport.\n\"It was a compounding situation. I get burnt out navigating different situations, relationships and spaces, and trying to fit in while not giving up a part of myself.\"\nShe was aware that she processes new information slower than others, and also worried that it might cost her a place in the team as others might not want to take the time to teach her at her pace \"when you can get somebody else who can learn it quickly\".\nIt reached the point when Zaranyika said she felt \"out of control mentally\" and her team at the time, Saracens Mavericks, gave her a week off netball.\n\"I was completely burnt out. I could not function,\" said the 23-year-old wing-defence, who will face her former team - now known as London Mavericks - on Sunday in a match you can watch on BBC Sport (15:45 BST on Red Button, BBC Sport website and app).\n\"I was struggling so much,\" Zaranyika explained. \"The additional physical pain was difficult to ignore, so my mum took me to hospital.\n\"My mum describes my skin condition as 'my body keeping the score' because I don't recognise that I am stressed. Although it can be debilitating, it does indicate my mental state.\"\nAutistic burnout refers to extreme exhaustion often accompanied by increased meltdowns, sensory sensitivity, and physical shutdown, while masking is the suppression of autistic characteristics to appear 'non-autistic', according to the National Autistic Society.\nIt was not until Zaranyika's first year of university - after two years of unexplained anxiety and suicidal thoughts - that she received an autism and ADHD diagnosis and ADHD medication.\n\"A [diagnosis] validated a lot of the feelings I had at the time. I actually have a reason why I find things really hard that others find so easy. I'm not making it up or pretending,\" she said.\nZaranyika, who moved to the Birmingham Panthers for the team's debut season in 2025, explained how her communication differences affect her on court.\n\"During matches, the order of play is predictable and familiar – not something I have to process,\" she said. \"I know a centre pass comes after a goal. This is harder in training when the consequences of scoring a goal can be different.\n\"It's hard when you're in a team of people who all learn the same way. I feel like I've had to try and learn the same way as other people because in sport, it's who can get results now?\"\nPanthers head coach Jo Trip has discussed accommodations with Zaranyika - who also accepts the need for \"give and take\" - and training has since featured more match-replicated scenarios.\n\"A big thing for me is that I will treat everyone the same, so I expect everyone there on time. My expectation standards do not drop,\" Trip said.\n\"It's something that I try to work with 'Li' on and just make sure that we've got things in place that make her able to perform.\"\nAlthough netball may have contributed to her burnout, its structure and predictability have allowed Zaranyika to thrive socially and find friends who accept her, such as former Mavericks team-mates and England players Sasha and Kadeen Corbin, and Jodie Gibson.\n\"I know training is going to start and end and everybody's expected to leave, whereas I can't do things like go out for coffee or meals because I don't know when it's going to end,\" Zaranyika said.\n\"I could not imagine my life without netball. I've made such strong connections. I have people I know I can rely on, no matter what.\"", "url": "https://www.bbc.com/sport/netball/articles/c793nj0y709o"}