{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:54:45", "date_modify": "2025-05-20 13:54:45", "date_publish": "2023-07-31 11:21:21", "description": "Chelsea: What's Pochettino's plan for Disasi?", "filename": "sport_articles_crgnnkjqpyro_1747749285.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c697/live/6c54c070-2f8a-11ee-a250-c9a4d46a1cc3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_crgnnkjqpyro_1747749285.html", "title": "Chelsea: What's Pochettino's plan for Disasi?", "title_page": "Chelsea: What's Pochettino's plan for Disasi? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Joe Bradshaw, BBC Sport\nA talented French defender signed from Monaco to strengthen an injury-affected backline?\nChelsea have been here before. Merely six months ago in fact.\nWhen Benoit Badiashile said his farewells to the Cote d'Azur, he probably did not expect to be seeing Axel Disasi quite so soon.\nHowever, now reunited with his former team-mate, it is worth contemplating how the two could fare together at Stamford Bridge.\nDisasi, 25, has played more minutes than the younger Badiashile, 22, and ought to be coming into his prime. He started all-but-one league game for Monaco last season and has been a virtual ever-present since his switch from Reims in 2020.\nTall, physically imposing and right-footed, he will be expecting to slot in alongside his left-sided French colleague Badiashile.\nHe has surely not come to London to sit on the bench.\nIn the two seasons they played together, Monaco finished third in Ligue 1, benefiting from the strong platform they provided. Between them, the pair only have six caps for France but they, along with fellow Blues centre-back Wesley Fofana, would seem to be the future for Didier Deschamps' defence.\nPochettino likes a settled backline with defenders who are comfortable together - think Toby Alderweireld and Jan Vertonghen at Spurs.\nDisasi and Badiashile certainly fit that mould, albeit two weeks is not long for the newest arrival to bed in - and the latter remains sidelined with injury.\nEven so, at 39, Thiago Silva cannot remain evergreen. If Disasi is his natural successor, then perhaps Trevoh Chalobah will be sacrificed, despite featuring prominently in pre-season.\nLevi Colwill, who has been expected to finally establish himself at Chelsea this season, will also be watching on with interest.\nPochettino was coy on Disasi links when asked after the Fulham game on Sunday - but he's not daft.\nHis first Premier League teamsheet against Liverpool on Sunday, 13 August will be very interesting indeed.", "url": "https://www.bbc.com/sport/articles/crgnnkjqpyro"}