{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:03:33", "date_modify": "2025-05-21 04:03:33", "date_publish": "2025-01-23 22:00:28", "description": "Olympic 800m gold medallist Keely Hodgkinson is voted the 2024 Sunday Times Sportswoman of the Year.", "filename": "sport_athletics_articles_cvgmnxrdpx7o_1747800213.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8efa/live/84dfb4a0-d9c6-11ef-a28d-bb0bf8084288.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_athletics_articles_cvgmnxrdpx7o_1747800213.html", "title": "Keely Hodgkinson: Olympic 800m gold medallist voted 2024 Sunday Times Sportswoman of the Year", "title_page": "Keely Hodgkinson: Olympic 800m gold medallist voted 2024 Sunday Times Sportswoman of the Year - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Olympic 800m gold medallist Keely Hodgkinson has been voted the 2024 Sunday Times Sportswoman of the Year.\nThe 22-year-old ended her wait for a global title with victory at the Olympic Games in Paris last summer and won BBC Sports Personality of the Year in December 2024.\nHodgkinson also retained her European 800m title and became the sixth-fastest woman of all time when she improved her British record to one minute 54.61 seconds at the London Diamond League.\nHodgkinson follows last year's winner, England goalkeeper Mary Earps, athlete Eilish McColgan, and tennis player Emma Raducanu, who won in 2021.\nThe shortlist for the 2024 award was dominated by Olympic medal winners with Hodgkinson scooping it ahead of 1500m runner Georgia Bell, showjumper Laura Collett, cyclist Emma Finucane, heptathlete Katarina Johnson-Thompson, trampoline gymnast Bryony Page, shooter Amber Rutter and Paralympic cycling great Sarah Storey.\nElsewhere, diver Andrea Spendolini-Sirieix was named the newspaper's Young Sportswoman of the Year after she won bronze in Paris.\nStorey picked up the Disability Sportswoman of the Year after she added two more golds to her medal collection at the Paralympic Games.\nRowers Lauren Henry, Lola Anderson, Georgina Brayshaw and Hannah Scott won the Team of the Year for their dramatic victory in the women's quadruple sculls at Paris 2024.\nUltra runner Jasmin Paris won the Helen Rollason Award for Inspiration, while retired PE teacher and cycling enthusiast Val French won the Grassroots Sportswoman of the Year.\nBBC radio presenter Eleanor Oldroyd's contribution to sports broadcasting was also recognised with a special Editor's Choice Award.", "url": "https://www.bbc.com/sport/athletics/articles/cvgmnxrdpx7o"}