{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:33:05", "date_modify": "2025-04-26 04:33:05", "date_publish": "2025-03-06 00:00:00", "description": "Rangers stun Jose Mourinho's Fenerbahce with a superb first-leg win in Istanbul, which gives the Scottish Premiership side an excellent chance of reaching the Europa League quarter-finals.", "filename": "sport_football_live_c99npdxnynlt_1745641985.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a593/live/90c63310-face-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_c99npdxnynlt_1745641985.html", "title": "Fenerbahçe vs Rangers: UEFA Europa League", "title_page": "Fenerbahçe vs Rangers: UEFA Europa League - reports, reaction & stats - BBC Sport - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Bye for now\nFT: Fenerbahce 1-3 Rangers\nI think we'll leave it there after another wonderful night for Rangers in Europe.\nBarry Ferguson's side were magnificent in Istanbul, and take a two-goal lead back to Glasgow before next Thursday's second leg. It could have been more too had the offside flag not denied Cyriel Dessers twice.\nYou can read my colleague Andy Campbell's report at the top of this very page, or scroll back through to relive the action.\nThanks for your company - go enjoy the rest of your evening.\n'Dessers' mentality is his strongest attribute'\nFT: Fenerbahce 1-3 Rangers\nScott Arfield\nFormer Rangers midfielder on BBC Radio Scotland\nI always tell the younger boys to have a goldfish mentality, and what I mean by that is obviously you're going to misplace passes, miss tackles, miss shots and big chances.\nBut, like a goldfish, you move on and forget about it, I think he's the epitome of that mentality.\nIt may frustrate fans but it's the most amazing attribute to have as a player where you can forget about it and then turn up in the big moment like he has this season, none more so than tonight.\nFormation 'gamble' paid off - Ferguson\nFT: Fenerbahce 1-3 Rangers\nHere's a wee bit more from Rangers interim head coach Barry Ferguson, speaking in his post-match news conference:\n\"It’s easy, when you go and score a couple of goals and they get disallowed, to start feeling sorry for yourself. They kept going, they stuck to the game plan. When we attacked, we looked a real danger. I’m still happy that we scored three goals away from home.\n\"They were really solid defensively and when we broke, we caused them problems.\n\"It was a gamble that I was prepared to take. I just thought I had to change the shape. I thought we could get a result. I’ve got to give my players credit because it’s not easy changing system and it was a big change for them. They’ve never played that before.\n\"We need to go and make sure that we give that level of performance next Thursday night.\n\"The one thing I’ve always said about big Cyriel is he gives you 100%. He led the line superbly tonight and I’m absolutely delighted for him.\n\"There's no way we think we're into the last eight. It's going to be a real difficult tie for us [next week].\"\nMourinho tells 'pragmatic' Rangers to 'calm down'\nFT: Fenerbahce 1-3 Rangers\nMourinho adds: \"I'm not surprised [about Rangers' performance], if you listen to what I said yesterday I couldn't be more respectful.\n\"The previous coach was more about philosophy and I knew Ferguson would be much more pragmatic. He brought five defenders, three midfielders, and two guys in attack on the counter.\n\"He defended as much as they could and basically well; when they defended bad Butland made fantastic saves and on the counter attack they were dangerous.\n\"They were pragmatic, they were defensive, and they played on the counter. Every time Jack Butland had the ball he didn't take the famous six or eight seconds he took thirty seconds every time he had the ball in his hands.\n\"They had 20 injuries, they were pragmatic as I was expecting and they deserved the victory.\n\"The only thing I tell this is don't celebrate too much, because there is a second match to play, that's my only advice.\n\"If they celebrate after the second match I will congratulate them but now calm down because it's not over.\"\n'You may laugh but it's a good result' - Mourinho\nFT: Fenerbahce 1-3 Rangers\nFenerbahce manager Jose Mourinho says his side were lucky to only lose 3-1 to Rangers, but insists the tie is not over yet.\n\"We were very bad everywhere,\" he said.\n\"I don't think it's fair to say we were bad defensively because we were very bad everywhere.\n\"Maybe you laugh, but for me it was a good result because of the way we performed, the result could have been bigger than this one.\n\"There is, I think, a penalty but to speak about referees after this performance I don't think is ethical. Our performance was bad overall.\n\"We lost a lot of duels, our passing was not fast. To speak about Fred [who was suspended tonight] is something that I don't like but he was playing fantastic and the team was playing fantastic with him there.\n\"Defensively we made incredible, incredible mistakes. They defend a lot with a very low block and then dangerous counters and we had no pace to follow that.\n\"So for me, I have to say that we deserved a punishment of this result. If someone wants to ask me if it's over, no, I don't think it's over.\"\nPost\nFT: Fenerbahce 1-3 Rangers\nMore from Barry Ferguson: \"I wouldn't say I outfoxed [Mourinho].\n\"We went a way that I thought would get us a result and we only spent an hour on it. They took the information on and delivered a performance to be proud of.\n\"You can feel sorry for yourselves when you get a couple of goals disallowed but we went on and got the third goal.\n\"Ibrox has been a bit of a problem, but we'll enjoy tonight and then try to fix that problem.\"\n'Only half-time'\nFT: Fenerbahce 1-3 Rangers\nRangers interim head coach Barry Ferguson tells TNT Sports: \"The commitment, the desire, at times some the football we played was very good.\n\"We've got to remember, it's only half-time in the tie becuse Fenerbahce have got one of the best managers that's ever been\n\"I'm proud of the boys because they've come through a lot this season. They deserve a lot of credit.\n\"We need to be ready for next Thursday and, I tell you something, I'll have them ready.\"\n'Rangers in the driving seat'\nFT: Fenerbahce 1-3 Rangers\nScott Arfield\nFormer Rangers midfielder on BBC Radio Scotland\nYou just come to expect it, it's a Thursday night!\nI said it earlier on, just stay in the tie, but they've done more than that. Whatever Barry Ferguson and his team said before this game was there, you could see it was evident.\nA special mention to Connor Barron, his work rate is absolutely phenomenal.\nA phenomenal performance and they are in the driving seat now.", "url": "https://www.bbc.co.uk/sport/football/live/c99npdxnynlt"}