{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:45:44", "date_modify": "2025-05-20 14:45:44", "date_publish": "2023-07-27 17:42:54", "description": "Somerset's James Rew passes 1,000 first-class runs for the season but Surrey win by 10 wickets at Taunton.", "filename": "sport_cricket_66319433_1747752344.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/147D5/production/_130552938_gettyimages-1573951395.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66319433_1747752344.html", "title": "County Championship: Leaders Surrey wrap up victory after Rew passes 1,000", "title_page": "County Championship: Leaders Surrey wrap up victory after Rew passes 1,000 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jordan Clark claimed four wickets as Surrey strengthened their position at the top of the First Division table with a comprehensive County Championship victory over Somerset inside three days at Taunton.\nThe hosts began their second innings at the start of play trailing by 198 runs, and were bowled out for 226 with Clark taking 4-36.\nJames Rew contributed 55, becoming the first player in Division One to pass 1,000 runs for the season, while Craig Overton smacked five sixes in a defiant 70 not out.\nHowever, Surrey were left to make only 29 and reached their target in 8.3 overs to claim a 10-wicket win.\nSomerset took only three points from the match after two brittle batting efforts, while their opponents claimed 22 to maintain a healthy lead over nearest challengers Essex.\nWith only four balls bowled, the morning session was interrupted by rain, but when play resumed at 12.10pm, any hope Somerset had of getting back into the game disappeared with some abject top order batting.\nSean Dickson had already survived a chance to third slip when, in the same Clark over, he edged to first slip where Dom Sibley made no mistake.\nFour overs later Tom Lammonby swished at a wide delivery from Clark and Will Jacks held a low two-handed catch, and it was 23-3 when George Bartlett shouldered arms to one that crashed into his pads on off stump and fell lbw.\nWith only five runs added, Tom Kohler-Cadmore steered Dan Worrall to Jamie Overton at backward point, but Tom Abell fared better with some sound shot selection and by lunch, which was taken at 46-4, the Somerset skipper had struck four boundaries in moving to 27.\nRew, who had taken 32 balls to get off the mark in the first innings, again displayed a patience lacking in more experienced team-mates and had yet to open his account, having faced 10 deliveries.\nThe afternoon session saw Rew and Abell progress their partnership to 64, the former reaching a four-figure run tally for the summer when moving to 21 with a single to cover off Worrall.\nBut Clark returned at the Marcus Trescothick Pavilion End to pin Abell leg before for 46 with a yorker and at 92-5 Somerset still required 106 to make Surrey bat again.\nKasey Aldridge edged a short wide ball from Tom Lawes to third slip where Jacks took an excellent diving catch as the hosts continued to gift wickets with injudicious strokes.\nAn exception was Rew, content to accumulate quietly without resorting to big shots until, with his score on 31, he effortless lifted a ball from Lawes over deep backward square for six.\nBen Green was caught behind looking to drive a full-length delivery from Jamie Overton to make it 130 for seven before Rew went to fifty for the seventh time this season, off 96 balls, with four fours and a six.\nAt tea, Somerset were 139-7 and still trailing by 59. They added just six runs when Rew top-edged a pull shot off Gus Atkinson and skied a catch to fine leg, having faced 106 balls in another mature contribution.\nThe end looked nigh as Atkinson quickly followed up by sending back Matt Henry, lbw to a yorker, but Overton launched a late attack with powerful pulls and drives that saw him take 20 off an Atkinson over and dominate a last-wicket stand of 77 with Shoaib Bashir.\nIt merely delayed the inevitable, though, and Surrey eased to victory with openers Rory Burns and Sibley completing the job.\nReport supplied by ECB Reporters' Network.", "url": "https://www.bbc.com/sport/cricket/66319433"}