{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:44:51", "date_modify": "2025-05-20 11:44:51", "date_publish": "2023-08-06 12:46:30", "description": "Aston Villa: Unai Emery reflects on beating Valencia", "filename": "sport_articles_cp60r7yn997o_1747741491.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ab4f/live/03a41c70-3457-11ee-91cd-293f0d9b15ce.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cp60r7yn997o_1747741491.html", "title": "Aston Villa: Unai Emery reflects on beating Valencia", "title_page": "Aston Villa: Unai Emery reflects on beating Valencia - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Unai Emery's Aston Villa completed their pre-season schedule with a 2-1 win over Valencia at the Mestalla.\nOllie Watkins and Emiliano Buendia scored either side of half-time for Villa, who start their Premier League campaign against Newcastle on Saturday (17:30 BST kick-off).\nThe Spaniard told club media:, external \"Now we're analysing the pre-season, I am happy with the matches we played in the United States, I'm happy with the match we played against Lazio and the match we played [against Valencia] with the atmosphere.\n\"Next week we are starting away against Newcastle and we have to take the good things we are doing, be competitive and try to stay strong this season.\"\nVilla can expect a much busier schedule this season as they will also be playing in the Europa Conference League alongside their domestic commitments.\n\"We are going to play a lot of matches, playing on Thursday and then on Sunday, with FA Cup and Carabao Cup,\" added Emery. \"We did pre-season thinking that we have to work on different things tactically, and we did it.\n\"We were practising some tactical decisions and some we are taking really well but others we have to continue learning, improving and taking more information.\n\"Overall, I’m very happy. We have to be ready and have everyone very excited with our supporters for the first match in Newcastle. It’s our objective now to start our season in the best way possible.\"", "url": "https://www.bbc.com/sport/articles/cp60r7yn997o"}