{"authors": ["Mike Richards", "www.facebook.com"], "date_download": "2025-04-26 04:23:27", "date_modify": "2025-04-26 04:23:27", "date_publish": "2025-03-03 13:17:40", "description": "Everton news: Opinion - Fan on having competition for places", "filename": "sport_football_articles_c234mrjr58jo_1745641407.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b550/live/69581a40-b629-11ee-beb5-e1400df560f2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c234mrjr58jo_1745641407.html", "title": "Opinion - Fan on having competition for places - BBC Sport", "title_page": "Everton news: Opinion - Fan on having competition for places - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Not so long ago, Everton-free weekends were welcome.\nIt was over such a prolonged period where we longed for those mental breaks that actually missing Everton and willing the non-playing weekends to go away came as a somewhat alien concept.\nSuch has been the turn around in performances, Saturdays and Everton cannot come soon enough.\nThis past week, the players have been enjoying a deserved warm-weather training camp over in Abu Dhabi and, if truth be told, the break has come at a good time.\nThe squad has been heavily stretched in recent weeks. With injuries to so many players - and key ones at that - the hope is that the squad is a little bit fresher and fuller when we play Wolves on Saturday.\nGiven the shortage of first-teamers at David Moyes' disposal, the points picked up since his arrival has been nothing short of miraculous.\nAnd it is not the number missing that is the biggest - it is the quality lost.\nTo name just a few, Iliman Ndiaye, Orel Mangala and Dominic Calvert-Lewin are key players in this Everton side. Their loss could and maybe should have been felt a lot more than it has, but credit has to be given to those who have been given an opportunity and grabbed it with both hands.\nAs players slowly start to return to fitness, the onus will be on them to earn their place in the starting XI.\nCompetition for places is exactly what we need and have needed for some time.\nRoll on Saturday.", "url": "https://www.bbc.co.uk/sport/football/articles/c234mrjr58jo"}