{"authors": ["Geoff Doyle", "www.facebook.com"], "date_download": "2025-05-21 07:36:19", "date_modify": "2025-05-21 07:36:19", "date_publish": "2025-05-20 15:32:05", "description": "Good, early first summer signing to lift mood at Watford", "filename": "sport_football_articles_cvgnnped826o_1747812979.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0726/live/f87cec10-358e-11f0-96c3-cf669419a2b0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cvgnnped826o_1747812979.html", "title": "Good, early first summer signing to lift mood at Watford", "title_page": "Good, early first summer signing to lift mood at Watford - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Watford owner Gino Pozzo, chief executive Scott Duxbury and sporting director Gina Luca Nani have bridges to build.\nThere has been seething reaction and resentment to Tom Cleverley's sacking and it's alarmed them.\nIn a poll in the local newspaper, 94% were against the latest head coach removal. The vitriol has been its loudest since Pozzo took over and it seems to have shocked him and the board.\nChanges have been made and operation reconciliation has begun. There already seems a softer, more open, approach.\nThe message has been they are still very ambitious, that they envisage keeping nearly all of their best players, and that they are aiming for a Premier League return.\nWhat Watford fans will want to see is promises kept and then action taken, rather than words. The supporters are going to take some convincing.\nSome hardened Watford fans have had enough. They are fed up with the way the club has been run in the past few years and the sacking of the immensely popular Cleverley was the final straw.\nThe board have made early inroads in an attempt to lift the mood. The signing of Hector Kyprianou seems a shrewd one. A freebie, a good age - 23 - but with plenty of experience, an international and leadership qualities; he ticks a lot of boxes.\nBut some fans may need more time to forgive the sacking of Cleverley. There is an uneasy vibe at the moment - a disconnection.\nThose who have paid for their season tickets will hope for change, but expectations are quite low. Pozzo and the board still have plenty of making up to do.", "url": "https://www.bbc.com/sport/football/articles/cvgnnped826o"}