{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:20:30", "date_modify": "2025-05-20 13:20:30", "date_publish": "2023-07-26 11:05:07", "description": "‘I’ll lead by example’ – Vassell on embracing Killie captaincy", "filename": "sport_articles_cv2prpggy2wo_1747747230.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b150/live/1fd47f20-2b97-11ee-b1d7-8fdc93c2782e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cv2prpggy2wo_1747747230.html", "title": "‘I’ll lead by example’", "title_page": "‘I’ll lead by example’ – Vassell on embracing Killie captaincy  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "New Kilmarnock captain Kyle Vassell says he will “embrace” the opportunity and lead his teammates by example.\nThe 30-year-old striker helped his Killie team to secure another term in the top-flight and says he is “buzzing” that he gained the love of fans.\n“It’s an honour to be club captain because I've loved my time here,\" he said. \"It's a massive club and, personally, it was always something I wanted to do in my career.\n“I never thought it would come quite so soon but I'm going to embrace it and I'm going to enjoy it.\n“I feel like I've got good social intelligence. When the dust is settled and the boys who've just come in and we see what they're like on and off the pitch and if we have a load of vocal players then I'll lead by example.\n“I'll let the boys do the talking and I'll chip in when I need to. My thing is I like standards to be higher, I do it personally, I like to drive myself and I think we shouldn't ever let our standard slip.\n“I have been getting homesick the older I've been getting, but it was an easy decision to sign another two years here. I’ve settled in really well, it's a beautiful place outside of football with the scenery and being close to the sea.\n“I live locally and I always see fans and they've always been brilliant with me, whether it's photos or whether they want to talk about a good game or bad game.\n“If I am a fan favourite, hopefully it’s because of the way I play the game. I try and give my all, I try and be as honest as the days are long and I played through a bit of an injury to try and keep the club in the league.\n“We got there in the end, so it was all worthwhile.\"", "url": "https://www.bbc.com/sport/articles/cv2prpggy2wo"}