{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:51:56", "date_modify": "2025-05-21 05:51:56", "date_publish": "2025-04-02 09:25:43", "description": "Newport County: Courtney Baker-Richardson's injury blow as Kyle Hudlin close to return", "filename": "sport_football_articles_c8rglx4xz7eo_1747806716.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9636/live/75235e70-0f83-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c8rglx4xz7eo_1747806716.html", "title": "Newport County: Courtney Baker-Richardson's injury blow as Kyle Hudlin close to return", "title_page": "Newport County: Courtney Baker-Richardson's injury blow as Kyle Hudlin close to return - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Nelson Jardim hopes Courtney Baker-Richardson's injury is \"nothing serious\" after he was withdrawn during Newport County's 1-1 draw with Bromley.\nThe striker was replaced in the final stages of the League Two contest at Rodney Parade, and Exiles head coach Jardim says the 29-year-old's potential absence would be a blow given his improved performances of late.\n\"Hopefully it's nothing serious. He's been playing every week and was reaching his best level in terms of performance,\" he told BBC Radio Wales.\n\"If it is (serious), it's a chance to have other boys coming in.\"\nForward Kyle Hudlin has been sidelined since mid-February due to a calf injury, but could be in line to return to action at bottom side Carlisle United on Saturday.\n\"Hudlin is edging close to being completely fit. Let's see how it goes this week. But like always, we have to find solutions,\" added Jardim.\nWhen asked if there was a chance Hudlin could feature at the weekend, Jardim responded: \"Yes there is. He hasn't had full sessions with us yet, but he's played a part with us.\n\"He's probably not ready to play the 90 minutes, but we'll see how he can contribute to us.\"", "url": "https://www.bbc.com/sport/football/articles/c8rglx4xz7eo"}