{"authors": ["Joe Rindl", "www.facebook.com"], "date_download": "2025-05-21 08:39:11", "date_modify": "2025-05-21 08:39:11", "date_publish": "2025-01-22 05:54:25", "description": "Iga Swiatek drops just three games as she breezes past Emma Navarro to set up an Australian Open semi-final against Madison Keys.", "filename": "sport_tennis_articles_cew5dx7vdgeo_1747816751.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/dca6/live/0904d5a0-d880-11ef-91e5-376a47b7c162.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_tennis_articles_cew5dx7vdgeo_1747816751.html", "title": "Australian Open 2025 results: Iga Swiatek beats Emma Navarro to set up Madison Keys semi-final", "title_page": "Australian Open 2025 results: Iga Swiatek beats Emma Navarro to set up Madison Keys semi-final - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Iga Swiatek dropped just three games as she breezed past Emma Navarro to reach the Australian Open semi-finals and continue her bid for a maiden Melbourne title.\nFive-time major winner Swiatek was ruthless in a 6-1 6-2 victory over eighth seed Navarro.\nSwiatek has dropped just 14 games at Melbourne Park this year - and seven of those came in her first-round match.\nThe Pole will face Madison Keys in the last four after the American came from a set down to beat Elina Svitolina.\nKeys will need to be at her big-hitting best to beat Swiatek, who was dominant against the highly rated Navarro.\nSwiatek broke to love in the match's first service game and wrapped up the opening set inside 36 minutes.\nHowever, there was controversy at 2-2 in the second set when the umpire did not spot a double bounce at a crucial moment.\nThe ball bounced twice before Swiatek, with the advantage on her serve, flicked over a winner, but umpire Eva Asderaki-Moore missed it.\nNavarro protested but was unable to use the video technology review - which would have shown a replay of the footage - because she had carried on playing the point, instead of stopping it.\nSwiatek subsequently broke in the next game and ran away with the match to match her best result at Melbourne Park.\nSwiatek's dominance on clay is no secret, with the Pole having won four of the past five French Open titles.\nBut she has struggled on the fast Melbourne hard courts, having only gone past the fourth round once before this year.\nUnder new coach Wim Fissette, Swiatek has been ruthless.\nOnly three players in the Open era have dropped fewer games than Swiatek's 14 on their way to the Melbourne last four.\nShe has not dropped a single game on serve in her past four matches, and none of her matches so far have lasted over 90 minutes.\nShould Swiatek reach the final - and top seed Sabalenka lose her semi-final on Thursday - the 23-year-old would regain the world number one ranking.\nIf both players advanced to a mouth-watering championship match then Sabalenka would need to win the title for a third straight year to stay top of the rankings.", "url": "https://www.bbc.com/sport/tennis/articles/cew5dx7vdgeo"}