{"authors": ["Paul Higham", "www.facebook.com"], "date_download": "2025-05-21 07:31:54", "date_modify": "2025-05-21 07:31:54", "date_publish": "2025-01-03 21:55:19", "description": "Luke Littler makes history at Alexandra Palace with victory over Michael van Gerwen in PDC World Darts Championship final.", "filename": "sport_darts_articles_clyx7403y9ko_1747812714.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4ec5/live/a63789b0-ca40-11ef-94cb-5f844ceb9e30.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_darts_articles_clyx7403y9ko_1747812714.html", "title": "Luke Littler beats Michael Van Gerwen in final to win World Darts Championship 2025", "title_page": "Luke Littler beats Michael Van Gerwen in final to win World Darts Championship 2025 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Incredible Luke Littler etched his name into darting history with a crushing 7-3 victory over Michael van Gerwen to become the youngest ever PDC World Championship winner.\nThe 17-year-old was in unstoppable form as he raced into a 4-0 lead, and despite Van Gerwen getting three sets on the board, he never really threatened a comeback and was always in Littler's rear mirror.\nVan Gerwen was the previous youngest champion when he won the first of his three world titles in 2014 aged 24, but darting phenomenon Littler smashed that record just as easily as he dealt with the Dutchman on the Alexandra Palace stage.\nWarrington teenager Littler averaged just over 102 and threw 12 180s in a darting masterclass as he claimed the £500,000 first prize and lifted the Sid Waddell Trophy for the first time.\nWith the way he handled the pressure of being the favourite and the manner of his performances still three weeks short of his 18th birthday, it surely is just the first of many.\nLittler was pipped by Luke Humphries in last year's final and when the world number one went out in the fourth round this year, the trophy looked to be there for the taking.\nVan Gerwen has not been at his best this season but facing a three-time winner appearing in his seventh final still represented a tough test for the youngster.\nLittler is not built like your average darts player though, and he showed no signs of nerves when racing into that 4-0 lead - albeit helped by some dodgy finishing by Van Gerwen.\nThe 35-year-old was scoring well but either missed darts at doubles or failed to even get down to a shot at the outer ring - which resulted in him winning just three legs in those first four sets.\nVan Gerwen finished with a 100 average himself and one more 180 than Littler with 13, but hitting just 14 of 38 on his doubles was never going to cut it against the game's new superstar.\n\"I can't believe it,\" Littler told Sky Sports. \"We both played so well.\n\"I've said in interviews that I needed to get off to a quick start tonight and that's what I did.\n\"Everyone dreams of lifting this trophy. You've got to get through a tough field. I can't believe it.\"\nAfter bursting onto the scene at last year's World Championship, 'The Nuke' went on to win 10 titles and hit four nine-darters in 2024 and took that form to Alexandra Palace.\nLittler averaged more than 100 in five of his six matches and led the tournament with 76 maximums to win the Ballon D'Art trophy for top 180 hitter - although he did fail to match Michael Smith's record of 83 set in 2022.\nNot that Littler will care after a tournament where he was operating at a different level to the rest.\nThe relentless scoring is one thing, that magical double 10 he hardly misses is another, but Littler also has that perfect timing - hitting 180s and nailing big checkouts at crucial moments that just mentally grind his opponents into submission.\nA certain Phil Taylor won his first BDO world title 35 years ago this year, and there's more than a hint of 'The Power' about Littler's game.\nAt Littler's age, Taylor's record of 16 world titles could be in serious danger.\nVan Gerwen was once in Littler's shoes and beating up everyone on the big stage, but his third world title came back in 2019 and he has now lost three finals since then.\nThe Dutchman has won 157 PDC titles worldwide and is regarded as the best player since Taylor, but he has struggled in the last couple of years when he has failed to win a major in back-to-back seasons for the first time since his first in 2012.\nHe battled away against Littler but just did not have that extra gear, while Littler in return did just that, and \"every chance he got and every moment he had to hurt me, he did\".\n\"We all know I've come from a far distance and I've been battling my own game,\" admitted Van Gerwen on Sky Sports, who at twice Littler's age joked about the new star of the oche.\n\"I'm 35, he's 17. Every 17 years, a star gets born.\"\nVan Gerwen is not done yet, and just making the final after the year he had is a victory in itself, but Littler is going nowhere and everyone, Van Gerwen included, now needs to raise their game to keep up.\nIn truth, Littler's star was born at Alexandra Palace 12 months ago, but his continued brilliance has elevated him and his sport to new heights.\nSir Keir Starmer praised Littler on X for his \"mesmerising performance\" and labelled his victory as an \"inspirational performance under such pressure\" to win the title.\n\"You should be really proud of what you've achieved tonight,\" added the prime minister. \"Not just for yourself but for the sport of darts as a whole.\"\nLittler has gone from 164th to second in the PDC Order of Merit and added the world title to the Premier League, World Series and Grand Slam titles already won in 2024.\nOff the oche he has prompted a huge spike in darts interest among youngsters and brought the sport into the mainstream while winning the BBC Young Sports Personality of the Year, and was runner-up in the main award to Olympic gold medal-winning athlete Keely Hodgkinson.\nNow a world champion, the sky's the limit for the natural born dartist who has the world at his finger tips.", "url": "https://www.bbc.com/sport/darts/articles/clyx7403y9ko"}