{"authors": ["Nick Mashiter", "www.facebook.com"], "date_download": "2025-05-21 06:06:34", "date_modify": "2025-05-21 06:06:34", "date_publish": "2025-04-01 14:00:27", "description": "Wolves midfielder Joao Gomes signs a new five-year deal at Molineux.", "filename": "sport_football_articles_cm254r43ym9o_1747807594.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d8f5/live/4e3bc5e0-0ef2-11f0-9471-fd068d782b6b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cm254r43ym9o_1747807594.html", "title": "Wolverhampton Wanderers: Brazil midfielder Joao Gomes signs new five-year deal", "title_page": "Wolverhampton Wanderers: Brazil midfielder Joao Gomes signs new five-year deal - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wolves midfielder Joao Gomes has signed a new five-year deal at Molineux.\nThe Brazil international's new contract also includes the option of a further year.\nGomes joined from boyhood club Flamengo in 2023 and has made 80 appearances for Wolves, including 31 this season.\nThe 24-year-old has scored four goals this term with Wolves 17th in the Premier League, nine points above the relegation zone, before Tuesday's visit of West Ham.\nHead coach Vitor Pereira said: \"I'm very happy because Joao is a team player. He gives every time 100%, in training, in the games, and he has the quality to help this team and this club to make the next step.\n\"At the end of the game he's given everything for the team, defending, attacking, supporting the team-mates, and this is what we need in our team, this is the spirit we need at this club. We must come to Wolverhampton with this hunger, this spirit to help the team, help the club to grow up.\n\"He's very important because he's a midfielder with physicality and the power to run for 90 minutes, and he's young. He has big potential and can be a top player.\"", "url": "https://www.bbc.com/sport/football/articles/cm254r43ym9o"}