{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:16:14", "date_modify": "2025-05-21 04:16:14", "date_publish": "2025-04-05 18:22:59", "description": "Nottinghamshire close day two of their County Championship match against Durham 81 runs behind with five wickets in hand.", "filename": "sport_cricket_articles_cd02e1nnjdmo_1747800974.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3b69/live/276b4ec0-1246-11f0-9d46-3377f28968f3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cd02e1nnjdmo_1747800974.html", "title": "County Championship: Notts batters set good platform against Durham", "title_page": "County Championship: Notts batters set good platform against Durham - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A couple of key scalps for seamer Paul Coughlin in the final session left Nottinghamshire with work to do on day two of their County Championship match against Durham.\nThe Sunderland-born 32-year-old, whose had two injury-plagued years at Trent Bridge, bowled key man Joe Clarke (37) and had 19-year-old prospect Freddie McCann (79) caught behind before Nottinghamshire closed the day on 297-5 in their first innings in reply to Durham's 378, having also lost Jack Haynes just before the close.\nNottinghamshire had looked well placed at 225-2 after opener Ben Slater had provided a platform with a fine 92, before Coughlin's spell set them back.\nEarlier, following a start delayed by 45 minutes after a sprinkler malfunction left pools of water on the outfield, Coughlin had been last Durham man out as Australian fast bowler Fergus O'Neill completed a debut five-wicket haul.\nFor spectators present when the bails failed to drop after Durham's Colin Ackermann was bowled on day one, the delay was another freakish occurrence they could have done without under a near-cloudless sky, even if it initially brought amusement.\nAs the umpires' attention was drawn to a leaking sprinkler nozzle a few feet from the stumps at the Stuart Broad End, comic scenes ensued as the offending sprinkler and several others then suddenly burst into life, sending players and officials scurrying to avoid a soaking.\nThe water was turned off after a matter of seconds. Yet enough was deposited on the playing area to hold things up for a frustratingly long period.\nOnce play did start, the players went off again after just 14 minutes for the change of innings after Durham, 370-9 overnight, lost their final wicket.\nNot that O'Neill was complaining. A leg-before verdict against Coughlin gave the bustling seamer figures of 5-81 on debut.\nDurham could have done with O'Neill's in-form Australia A team-mate Brendan Doggett at their disposal with injuries depleting their pool of seam bowlers here, although in the event, the available quartet served them well.\nDoggett, who took 11 wickets in the match to help South Australia win the Sheffield Shield final a week ago, will join them for next week's home fixture against Warwickshire.\nNottinghamshire openers Slater and Haseeb Hameed negotiated the first 16 overs to be 48 without loss at lunch, Hameed surviving a chance to wicketkeeper Ollie Robinson off England's Matthew Potts on eight. By tea, the home side were probably where they wanted to be at 166-2, although they had suffered a blow moments before when Slater fell.\nPotts had got his man when skipper Hameed was leg before for 27 but the left-handed Slater looked in imperious form, having just pinged away his 19th four, most of which raced away to the short boundary on the Bridgford Road side.\nBut when Will Rhodes dropped one in short on the leg side, Slater was irresistibly tempted by the longer boundary, only to find Emilio Gay lying in wait at long leg. His meaty pull could not have picked out the fielder any more accurately, enabling Rhodes to celebrate a debut wicket and end a 95-run stand with McCann.\nClarke began with a streaky four off an inside edge but settled quickly and was building another potentially valuable partnership with McCann until a belter of a delivery from Coughlin uprooted his middle stump.\nMcCann, a tall, technically elegant left-hander who scored two centuries in five matches after being promoted to the Championship side towards the end of last season, continued where he left off and after 10 boundaries few would have bet against another hundred until he dabbled with a ball he need not have played outside off stump and was well taken by Robinson, before Ben Raine turned the screw by dismissing Haynes leg before for 30 with the second new ball.", "url": "https://www.bbc.com/sport/cricket/articles/cd02e1nnjdmo"}