{"authors": ["Matthew Henry", "www.facebook.com"], "date_download": "2025-05-21 04:09:02", "date_modify": "2025-05-21 04:09:02", "date_publish": "2025-02-09 16:18:17", "description": "India take an unassailable 2-0 lead in the one-day international series against England after Rohit Sharma's superb century in Cuttack.", "filename": "sport_cricket_articles_c78xy20dlrdo_1747800542.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a58b/live/65908fc0-e6fa-11ef-a39a-7b0f4e03d69d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c78xy20dlrdo_1747800542.html", "title": "England in India: Rohit Sharma hits century to power hosts to ODI series win", "title_page": "England in India: Rohit Sharma hits century to power hosts to ODI series win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England were comprehensively beaten again in the second one-day international in Cuttack as India clinched the series with a match to spare.\nAfter setting their hosts 305 to win, England's struggles on tour continued as captain Rohit Sharma hit a majestic 119 from 90 balls to power India towards victory.\nThe opener was caught after miscuing a Liam Livingstone full toss in the 30th over but by that stage only a further 85 runs were needed. India stuttered but still won with four wickets and 33 balls remaining.\nWhile Rohit's century was his first for India for 11 months, England are still searching for form under new coach Brendon McCullum.\nThey wasted a platform set through an opening partnership of 81 by Ben Duckett and Phil Salt, failing to kick on after Duckett was caught for 65.\nDespite all of England's top six making it beyond 25, Joe Root was the highest scorer with 69 and England were dismissed with a ball remaining in their 50 overs.\nThe final match of the series, England's last before their Champions Trophy opener against Australia on 22 February, is in Ahmedabad on Wednesday.\nEngland all-rounder Jacob Bethell was ruled out of playing in Cuttack after sustaining a hamstring injury in the first ODI that will also cause him to miss the Champions Trophy.\nEngland have now lost six of seven matches on this tour - one that was supposed to mark the start of a new era under McCullum and an upturn in results.\nTheir batting was improved on the 4-1 T20 series defeat and 248 all out on Thursday, but as a tendency to collapse was overcome, another issue - a failure to capitalise on starts - reared its head.\nThe fact no batter progressed to three figures cost them. England's total was made to look well below par when batting became easier under the lights.\nIndia's spinners went at less than a run per ball while England's quicks - Gus Atkinson, Jamie Overton, Saqib Mahmood and Mark Wood all selected, with Jofra Archer and Brydon Carse rested - were punished as they hammered the middle of the pitch.\nRohit timed anything full and flogged anything short. A six over mid-wicket off Atkinson hinted at the 37-year-old's return to form. Two more inside the first six overs confirmed it.\nHe was fortunate to survive an lbw shout on 36 - England reviewed but the ball was only clipping the top of leg stump - but put on 136 for the first wicket with Shubman Gill and raced to his first hundred in 28 innings in 76 balls after Gill was bowled by an Overton yorker for 60.\nAfter Rohit fell, Shreyas Iyer was run out for 44, KL Rahul bounced out by Overton and Hardik Pandya caught pulling to deep square leg.\nIt was the second match in a row India made harder work of a chase than expected but through Rohit the damage had been done.\nThe fact he barely celebrated his century suggested a feeling of relief his poor run was over.\nEngland still look a team struggling rhythm in the format.\nSince being dethroned as 50-over world champions in India in 2023, they have lost four ODI series in a row - their troubles deepening rather than improving.\nSalt and Duckett dealt with early uneven bounce to come through the powerplay - a rarity for the openers in England's recent run - but were both caught swiping across the line to spinners Varun Chakravarthy and Jadeja respectively.\nRoot found some flow in the anchor role as he put on 66 with Harry Brook, who struggled early on but flickered when striking boundaries through the off side.\nFrom a position of strength at 168-2 in the 30th over, Brook was brilliantly caught for 31 by Gill running back from mid-off.\nSkipper Jos Buttler hit seamer Hardik to mid-off in the 39th over, having eased to 34 from 35 balls, and Root was furious after placing Jadeja into the hands of long-off just as he attempted to cut loose in the 43rd.\nThose three wickets denied England the big finish they needed.\nLivingstone made 41 from 32 balls but never quite found his six-hitting range and England's lower-order was exposed by the absence of Bethell or Jamie Smith - the latter still nursing a calf injury.\nTwo run-outs in the final over meant England were bowled out for the 22nd time in 45 ODIs since the start of 2022.\nEngland captain Jos Buttler: \"We did a lot of things well. We got in some nice positions with the bat. We just needed a few of us to catch fire and get up towards 350. Rohit played a terrific knock.\n\"The results aren't there at the moment but we've got to keep the guys on task, play the style we want, and stay positive.\"\nIndia batter Shubman Gill: \"I was feeling good when I was batting, batting with Rohit makes it a lot easier.\n\"The way Rohit took on the ball was good. The way he dominated the fast bowlers was great to watch from the non-striker's end.\"\nIndia captain and player of the match Rohit Sharma: \"I really enjoyed being out there, scoring some runs for the team.\n\"The middle overs are where the game can go either way. If you stay in, it gives you a chance not to worry too much about your depth.\"", "url": "https://www.bbc.com/sport/cricket/articles/c78xy20dlrdo"}