{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:55:38", "date_modify": "2025-05-20 11:55:38", "date_publish": "2023-08-05 15:59:58", "description": "DIGIONLY", "filename": "sport_football_66385113_1747742138.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66385113_1747742138.html", "title": "Saturday's League Two reports", "title_page": "Saturday's League Two reports - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Accrington Stanley 3-0 Newport County\nAccrington Stanley eased to an opening-day victory in a controlled performance against visiting Newport County.\nJack Nolan had already stung the hands of Nick Townsend before beating the Exiles goalkeeper from close range after a chip through by Tommy Leigh.\nShaun Whalley doubled the lead from a Seb Quirk cross, before Korede Adedoyin struck a third in time added on.\nThere was still time for Will Evans to hit the post, but it would only have been a small consolation for County.\nColchester United P-P Swindon Town\nSaturday's League Two season opener between Colchester United and Swindon Town has been postponed because of a waterlogged pitch.\nReferee Anthony Backhouse deemed the pitch at the JobServe Community Stadium unplayable following a pitch inspection at 14:30 BST.\nColchester's ground staff were unable to get the game on following heavy rain in north Essex.\nA new date for the match will be confirmed in due course.\nCrawley Town 1-0 Bradford City\nTen-man Bradford suffered a blow in their opening match of the new season as a first-half strike from Will Wright condemned them to defeat at Crawley.\nCity, who were beaten in the League Two play-off semi-finals last season, have now won only one of eight visits to Broadfield Stadium after failing to recover from Wright's early effort and the 41st-minute dismissal of Dan Oyegoke.\nCrawley boss Scott Lindsey went into the curtain raiser scoffing at predictions making his side relegation favourites and insisting his new-look squad gives him what he needs to achieve his goals this season.\nAnd the Reds, unbeaten in their last eight home games under Lindsey, made a great start when debutant defender Wright gave them the lead in the 14th minute.\nThe former Gillingham man struck with a free-kick from 25 yards, the ball beating the outstretched left hand of keeper Harry Lewis into the bottom corner.\nCrawley threatened again midway through the half when Kellan Gordon saw a deflected shot go over after a move involving Danilo Orsi and Dom Telford.\nReds keeper Corey Addai saved shots from Jamie Walker and captain Richie Smallwood before Bradford were reduced to 10 men just before the break when Oyegoke picked up his second booking for a foul on Orsi.\nThe Bantams had a lucky escape on the stroke of half-time when a fierce shot from Orsi rebounded off the crossbar.\nBradford keeper Lewis did well to keep out a goalbound shot from substitute Klaidi Lolos as Crawley looked more threatening after the interval.\nCity rarely looked like rescuing a point, although Addai saved a Liam Ridehalgh header in stoppage time.\nMatch report supplied by PA Media.\nCrewe Alexandra 2-2 Mansfield Town\nCrewe fought back from two goals down to frustrate promotion hopefuls Mansfield who, down to 10 men, had to settle for a draw at Gresty Road.\nStags defender Calum MacDonald's 59th-minute sending off slowed down Mansfield's momentum after two first-half strikes from Davis Keillor-Dunn had put them in charge.\nMickey Demetriou hit back for Crewe before the break, and immediately after MacDonald's dismissal Rio Adebisi levelled the game.\nKeillor-Dunn drove a powerful low shot past Alex keeper Harvey Davies from the edge of the box to open the scoring in the 22ns minute.\nHe then doubled the lead soon after, showing a deft touch to take Stephen Quinn's pass before firing into the corner past Davies.\nDavies kept out efforts from Keillor-Dunn and Lucas Akins as the visitors piled on the pressure.\nBut Crewe halted the advance and cut the deficit in the 32nd minute when veteran debutant Demetriou reacted quickest at a corner to hook a close-range finish past Christy Pym.\nDavies was well positioned to beat away an angled drive from Rhys Oates, but Mansfield were fortunate when Chris Long's effort beat Pym but came back off the bar just before the break.\nKeillor-Dunn, chasing his hat-trick, skewed a shot against the outside of the post soon after the restart as Mansfield looked to restore their two-goal lead.\nHowever, MacDonald was handed a straight red card just before the hour for clattering into Long near to the halfway line, and Crewe were level immediately after.\nThe resulting free-kick went out wide from where it was driven across the box by Jack Powell for Adebisi to glance a header into the far corner.\nCrewe frontman Shilow Tracey wasted a great shooting chance when he blazed over wildly and, despite their numerical disadvantage, Mansfield still posed a threat with Akins and Oates going close.\nReport supplied by PA Media.\nDoncaster Rovers 0-1 Harrogate Town\nJack Muldoon's second-half penalty got Harrogate Town off to the perfect start as they triumphed in the Yorkshire derby at Doncaster Rovers.\nMuldoon confidently fired home in the 66th minute after Joseph Olowu was adjudged to have brought down Abraham Odoh in the box.\nHarrogate had the better chances throughout against a Doncaster side of which plenty is expected this season.\nGoalkeeper Ian Lawlor came to Rovers' rescue on several occasions, starting early with fine saves from Muldoon and Sam Folarin.\nLuke Molyneux went close for Doncaster as he lifted a shot over the on-rushing Mark Oxley only for it to drop narrowly wide.\nLawlor punched an in-swinging corner out from under his bar before batting away a follow-up from Dean Cornelius.\nDoncaster almost went ahead seven minutes into the second half but Matty Foulds produced a brilliant block on the line to keep out a Jon Taylor strike.\nAfter Harrogate took the lead, Doncaster were spurred into life and Oxley saved brilliantly from an Owen Bailey header, although that was the closest they came to an equaliser.\nReport supplied by PA Media.\nForest Green Rovers 0-2 Salford City\nLast season's League Two play-off semi-finalists Salford made a winning start to the campaign as they beat recently relegated Forest Green at The Bolt New Lawn.\nA Conor McAleny strike and late substitute Matt Smith's header were enough for all three points against opponents who had not lost an opening-day game since 2016.\nRovers should have taken the lead through Tyrese Omotoye, but his header from a Charlie McCann cross went over the top on 12 minutes.\nMatty Stevens was next to come close and he connected with a Callum Jones corner, but the forward was denied by the crossbar and City scrambled to safety.\nMcAleny took full advantage of a set-piece not dealt with by Forest Green as he fired home right-footed from six yards out after the break.\nCallum Hendry passed up a huge opportunity to make it two after Dom Bernard's clearance could only find the City number nine but he blazed over.\nExperienced forward Smith doubled Salford's tally late in the day after he nodded home Luke Bolton's cross.\nReport supplied by PA Media.\nGrimsby Town 0-0 AFC Wimbledon\nGrimsby and AFC Wimbledon shared the points in their League Two curtain-raiser at Blundell Park.\nMariners goalkeeper Jake Eastwood was the hero as he saved a second-half penalty from Ali Al-Hamadi on debut to earn his side a point.\nThe Dons' best chances aside from the penalty came in quick succession around the 34th minute as Ryan Johnson won two headers from back-to-back corners.\nDespite Grimsby's bright start to the second half, the visitors were gifted a golden opportunity to go ahead in the 59th minute as Harry Clifton brought down Al-Hamadi in the box.\nHe stepped up to take the penalty, which was saved well by Eastwood down to his left, with a double save made in the end by the Grimsby stopper to deny Al-Hamadi on the follow-up.\nBuoyed by the penalty save, the hosts went down the other end a few minutes later with defender Harvey Rodgers having a shot from outside the area saved by the visiting goalkeeper Alex Bass.\nAbo Eisa went close to scoring the only goal but his long-range effort was tipped onto a post by Bass.\nMatch report provided by PA Media.\nMorecambe 2-1 Walsall\nAn injury-time goal from Farrend Rawson gave Morecambe a 2-1 opening-day win over Walsall at the Mazuma Stadium.\nThe central defender was in the right place to bundle the ball home from close range after a goalmouth scramble to give the Shrimps victory.\nAfter an even start, Adam Mayor gave Morecambe the lead in the 25th minute with a fine finish after a flowing move.\nJJ McKiernan and Eli King combined well in midfield and played the ball into the left-hand side of the area for Mayor to drill the ball past Owen Evans from 12 yards out.\nThe visitors levelled after 38 minutes with a goal that came from nowhere. Ryan Stirk cleared the ball from inside his own half which caught out the Morecambe defence and Daniel Johnson produced a neat finish to beat the onrushing Stuart Moore.\nWalsall had the better of the second half, with Johnson hitting the inside of the post from the right-hand side of the box and substitute Douglas Taylor heading over from a good position before Rawson produced the late winner.\nMatch report supplied by PA Media.\nStockport County 0-1 Gillingham\nSubstitute Robbie McKenzie fired home late on to hand Gillingham a hard-earned 1-0 victory at Stockport in League Two.\nMcKenzie hammered home from close range in the 86th minute - after a cross from Cheye Alexander was not cleared - to settle the opening-day match.\nThe Gills almost struck after 25 minutes when Tom Nichols darted in to meet Dom Jefferies' cross, only to volley inches past the upright.\nThat appeared to spark the hosts into life and new boy Louie Barry saw an effort deflected narrowly wide.\nAs half-time approached Stockport went close when Macauley Southam-Hales' bullet header was superbly beaten back by Gills goalkeeper Jake Turner.\nIn added time, Stockport's Ryan Rydel volleyed just over the crossbar.\nStockport debutant Nick Powell forced Turner into a fine stop soon after the restart and Antoni Sarcevic then fired a 20-yard strike just past a post.\nWith 11 minutes left Stockport's Kyle Knoyle crashed an angled shot against the crossbar.\nAt the other end, Ben Hinchliffe brilliantly saved Scott Malone's side-footed shot, before McKenzie went on to snatch the three points for the Gills with time running out.\nMatch report supplied by PA Media.\nSutton United 5-1 Notts County\nNotts County suffered a chastening return to the EFL with a 5-1 drubbing at Sutton United.\nThe visitors conceded twice and had goalkeeper Aidan Stone sent off inside the first quarter of the game.\nSutton struck the first goal of the League Two season as Joe Kizzi headed in former Magpie Rob Milsom's corner at the far post, and County's afternoon got worse as Scott Kashket pounced on a poor back pass and was brought down by Stone, who was immediately sent off by referee Sam Purkiss.\nMilsom's free-kick went just wide, but substitute goalkeeper Sam Slocombe was soon picking the ball out of his net as Omari Patrick rifled a shot home from Josh Coley's pass.\nU's might have had a third when Kashket's looping header hit the bar.\nHopes of a County comeback in the second half lasted only five minutes as Coley's superb cross was powered home by Patrick's header at the far post, and as Sutton continued to boss the game Craig Eastmond's low shot hit a post.\nJack Rose made one good save from Macaulay Langstaff, but the punishment for County was relentless as Harry Beautyman made it 4-0 from Aiden O'Brien's pass.\nCounty pulled one back when David McGoldrick scored from Langstaff's pass, but any prospect of a nervy end for Sutton fans was ended by Harry Smith's header from Kizzi's cross.\nMatch report supplied by PA Media.\nTranmere Rovers 1-2 Barrow\nBarrow began the new League Two season in style with an impressive 2-1 win over Tranmere at Prenton Park.\nA freak goal from Niall Canavan and a wonder strike from Kian Spence were the difference as Pete Wild's side got off to the ideal start in treacherous conditions on Merseyside.\nTranmere looked more threatening in an end-to-end first half as Josh Hawkes forced Barrow goalkeeper Paul Farman into action with a fierce shot from the edge of the box after just eight minutes.\nBut it was the visitors who took the lead after 19 minutes when Spence's speculative effort was unwittingly deflected home by Canavan in front of a delirious travelling support.\nThe home side should have been level in the 24th minute when the ever-dangerous Hawkes pounced on a poor backpass only to be denied by Farman, who came out to narrow the angle.\nWith half an hour remaining, though, Rovers were handed a lifeline when Harvey Saunders was upended in the box and Hawkes stepped up to calmly convert the penalty.\nHowever, with the home side looking the more likely to go on and take all three points, Spence blasted Barrow back into the lead in the 70th minute with a stunning effort from the edge of the area.\nMatch report supplied by PA Media.\nWrexham 3-5 MK Dons\nWrexham's first game back in the EFL after a 15-year absence ended in disappointment as MK Dons secured an impressive away win.\nEoghan O'Connell's own goal and Mo Eisa gave Dons a two-goal lead early on with Jacob Mendy replying.\nJonathan Leko's second-half brace put MK Dons firmly in control before Jordan Davies grabbed a late Wrexham second.\nDaniel Harvie scored a fifth for MK Dons in stoppage time before Anthony Forde got a third for the hosts.\nIt was a first win for Graham Alexander as MK Dons boss but for a packed Stok Racecourse, including co-owners Ryan Reynolds and Rob McElhenney and guest Hugh Jackman, it was a disappointing afternoon.", "url": "https://www.bbc.com/sport/football/66385113"}