{"authors": ["Sam Drury", "www.facebook.com"], "date_download": "2025-05-20 13:32:45", "date_modify": "2025-05-20 13:32:45", "date_publish": "2023-08-01 20:30:16", "description": "Trent Rockets start their title defence with a thrilling six-run win over Southern Brave in the opening game of The Hundred men's competition.", "filename": "sport_cricket_66374013_1747747965.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1831D/production/_130610199_gettyimages-1585707269.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66374013_1747747965.html", "title": "The Hundred 2023: Trent Rockets begin title defence with thrilling win over Southern Brave in men's opener", "title_page": "The Hundred 2023: Trent Rockets begin title defence with thrilling win over Southern Brave in men's opener - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Trent Rockets started their title defence with a thrilling six-run win over Southern Brave in the opening game of The Hundred men's competition.\nSam Hain scored a brilliant 63 from 39 balls to rescue the Rockets from 54-5 and take them to 133-8 at Trent Bridge.\nAfter taking 3-18 with the ball, England seamer Chris Jordan hit 22 from 11 balls to take the Brave to within sight of victory.\nHowever, he fell in the last set and the Brave were bowled out for 127.\nHaving been put in to bat, the Rockets were in trouble early as England pair Alex Hales and Dawid Malan were dismissed by Craig Overton in the powerplay.\nThe wickets continued to tumble until Hain was joined in the middle by Imad Wasim - the Pakistan all-rounder who was drafted in as a late replacement for the injured Rashid Khan.\nAfter a period of consolidation, the pair began to kick on with Hain playing a number of eye-catching shots - not least an attempted reverse-scoop that became a reverse pull for four - in a partnership of 78.\nThe stand was ended by some smart fielding from Jordan to run out Hain in the final set, and the Brave seamer proceeded to bowl Wasim and Matthew Carter with his next two balls to complete a team hat-trick.\nOn a tricky surface for batting, 2021 champions Brave made a steady start and reached 41-0 before a mid-innings collapse saw them slump to 89-6.\nLeus du Plooy and Jordan kept the Brave in contention and even when the former was dismissed by Luke Wood, Jordan's clean hitting ensured there would be a dramatic finale.\nIt was the Rockets who came out on top, though, as Australia left-armer Daniel Sams bowled Jordan with three balls remaining, Overton was run out next ball and Sams trapped Tymal Mills lbw to seal the win with the game's second team hat-trick.\nFollowing the remarkable finish to the Ashes the day before, The Hundred could hardly have had a tougher act to follow.\nWith the home side soon struggling and boundaries at a premium, the first game of the men's competition threatened to begin with a whimper but by the conclusion, an exciting finish had the crowd on the edge of their seats.\nHain got the fans going in Nottingham with a brilliantly crafted and ultimately match-winning innings, showing power and invention to go with a cool head as he dug the Rockets out of a hole.\nBut his hard work was so nearly undone by Jordan. The England man showed off his fielding prowess with some quick thinking to get rid of Hain and then showcased his death bowling skills with a pair of pin-point yorkers.\nHaving restricted the Rockets' batting fightback, Jordan came close to doing the same with the ball following their rally.\nTwo big sixes took the Brave to the brink but Sams made sure a highly energised crowd would go home happy with an unerring yorker of his own to end Jordan's charge.\nAfter a slow start, this was a game that swung one way and then the other, right until the end. The Hundred is back.\nTrent Rockets captain Lewis Gregory on BBC Two: \"The boys were fantastic and what a game to start The Hundred. The crowd was rocking and that really helped us. Thankfully we got over the line.\n\"Sam Hain played fantastically to get us up to a total that we felt we could defend.\"\nSouthern Brave bowler Tymal Mills to BBC Two: \"It was a frustrating one, it's always tough to lose, especially a tight game. Credit to them, they bowled well in the powerplay. CJ almost bought us home, but a really frustrating one to lose.\"\nFormer England captain Michael Vaughan on BBC Two: \"When you win a game even when you're not at your best, and you get over the line when you're not favourites, that gives you a lot of confidence as a side.\n\"Lewis Gregory has led them brilliantly tonight and his bowlers have backed him up.\"\nYou can watch Hundred matches on BBC Two and BBC iPlayer every Wednesday and Saturday throughout the competition, alongside both finals on Sunday, 27 August.", "url": "https://www.bbc.com/sport/cricket/66374013"}