{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:42:26", "date_modify": "2025-05-21 04:42:26", "date_publish": "2025-04-03 07:56:02", "description": "Mick O'Dwyer, who won 12 All-Ireland titles with Kerry as a player and manager, dies aged 88.", "filename": "sport_articles_ckgx0el470mo_1747802546.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/70e5/live/79ceaa10-105f-11f0-a838-a720bcf3cdb5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_ckgx0el470mo_1747802546.html", "title": "Mick O'Dwyer: Kerry GAA great dies aged 88", "title_page": "Mick O'Dwyer: Kerry GAA great dies aged 88 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Kerry GAA legend Mick O'Dwyer has died at the age of 88.\nThe Waterville native won four All-Irelands with The Kingdom as a player before taking over as manager and establishing the county as the game's dominant force in the 1970s and '80s.\nDuring a period of fierce rivalry with Kevin Heffernan's Dublin, O'Dwyer's Kerry side lifted Sam Maguire eight times in 12 seasons.\nGAA president Jarlath Burns said O'Dwyer would go down as \"one of the greatest of all time.\"\n\"He will be remembered as an outstanding manager, motivator and mentor,\" Burns said.\n\"He was someone who could take a team and make it greater than the sum of its parts.\n\"While it is a sad day, it is also an opportunity to reflect on somebody who really changed the way we think of a manager's role with a team. His achievements are incredible.\"\nO'Dwyer also had a hand in 23 Munster titles and 11 National League titles during his more than three decades involved with his native county.\nHe stepped down from Kerry in 1989 and went on to manage Kildare, Laois, Wicklow and Clare.\nWith Kildare, he won a pair of Leinster championships and took the county to the All-Ireland final of 1998, their first since 1935, where they were beaten by Galway.\nHe would add another Leinster title with Laois in 2003, the county's first in 57 years, and won the Tommy Murphy Cup with Wicklow.\nTaoiseach Micheal Martin called O'Dwyer \"an icon of Gaelic Games\".\nThe Irish Prime Minister said: \"Micko lived and breathed Gaelic football. He embodied everything good about the game - dedication, ambition, positivity and community.\"", "url": "https://www.bbc.com/sport/articles/ckgx0el470mo"}