{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:05:11", "date_modify": "2025-05-21 07:05:11", "date_publish": "2025-01-13 20:00:59", "description": "Wales head coach Warren Gatland says he hopes a summer dispute with recalled Ospreys hooker Sam Parry can be water under the bridge for the 2025 Six Nations.", "filename": "sport_rugby-union_articles_c98ye4008yyo_1747811111.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a86d/live/ab735090-d1e2-11ef-80e5-9f0b215d3fef.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c98ye4008yyo_1747811111.html", "title": "Sam Parry: Wales hope hooker dispute 'is water under bridge' before Six Nations", "title_page": "Sam Parry: Wales hope hooker dispute 'is water under bridge' before Six Nations - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wales head coach Warren Gatland says he hopes a dispute with recalled Ospreys hooker Sam Parry can be \"water under the bridge\" for the 2025 Six Nations.\nFollowing injuries to Dewi Lake and Ryan Elias, Parry is back in favour despite leaving the national training squad in June 2024 in controversial circumstances.\nGatland says he did not mean to \"disrespect\" Parry after the 33-year-old chose to leave the squad before the summer international against South Africa at Twickenham and two-Test tour of Australia.\nParry's decision at the time came after being told by Gatland he was a fringe member of the party when the squad came together and he was only going to be acting as cover for Wales' other three hookers.\nGatland says he was being honest with Parry about where he stood in the Wales pecking order.\nParry maintained he still had international ambitions and has now been rewarded.\n\"I spoke to Sam during the week and we had a chat,\" Gatland told the Scrum V podcast.\n\"One of the things about me is I don't hold a grudge. We were pretty honest with each other in terms of 'let's put what happened behind us' and move forward.\n\"I have always respected him in terms of him as a player, the experience he has and his ability in terms of set-piece.\n\"He has always been good in the squad, so hopefully we can draw a line under that.\"\nDragons hooker Elliot Dee is included after missing the autumn internationals because of an ankle injury but has started only one game this season, while Cardiff's Evan Lloyd is also named.\nOther front-row concerns include the tight-head prop position, with Bath's Archie Griffin unavailable following shoulder surgery and Leon Brown having recently retired.\nWillGriff John has been recalled despite having not played for Wales since 2021.\nHe has made just one start for Sale this season with four further replacement appearances.\nJohn was released by Scarlets at the end of the 2022-23 season and was picked up by Racing 92 before returning to Sale.\nThe 32-year-old has played two internationals and would normally be ineligible for selection because of the Welsh Rugby Union's 25-cap policy.\nThat states those playing outside Wales are required to have 25 caps to represent their country.\nThe WRU say John is exempt because when he left Scarlets, there was no offer from any of the four Welsh domestic professional sides to try to keep him in Wales.\nJohn is named alongside Keiron Assiratti and Henry Thomas, with the trio only having 16 Wales caps between them.\n\"WillGriff John has been on the bench and he has not had a lot of game time,\" said Gatland.\n\"We are limited in the options we have at tight-head. That is one position that has caused us headaches.\"\nThere is no room for Harlequins tight-head Dillon Lewis who has made 57 international appearances.\n\"We spoke about Dillon but he has not been playing, he has had some injury issues with his back and things,\" said Gatland.\n\"It was disappointing to lose Leon Brown and I wish him all the best in terms of his retirement.\n\"He worked so hard to try and get back but unfortunately the neck problems would not go away.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/c98ye4008yyo"}