{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:50:47", "date_modify": "2025-05-20 11:50:47", "date_publish": "2023-07-25 17:25:24", "description": "Adam Lyth hits an unbeaten 75 as Yorkshire reach 142-2 against Durham, but only 38 overs are possible on the opening day.", "filename": "sport_cricket_66300318_1747741847.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7BF3/production/_130513713_shutterstock_editorial_14021303bz.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66300318_1747741847.html", "title": "County Championship: Yorkshire start well on rain-hit day against Durham", "title_page": "County Championship: Yorkshire start well on rain-hit day against Durham - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Division Two leaders Durham are under early pressure after Yorkshire openers Adam Lyth and Finlay Bean shared a century stand to help the hosts make the most of a curtailed day's play at Scarborough.\nLyth and Bean shared 113 inside 31 overs after the visitors had elected to bowl at the start of this County Championship fixture, contributing to a close of play score of 142-2 from 38 overs.\nLyth led the way with 75 not out off 118 balls at the North Marine Road venue where he played his league cricket growing up.\nFellow left-hander Bean made 46 but was the first of two wickets to fall - lbw to England Test quick Matthew Potts almost immediately after a 5.30pm resumption.\nHail at lunch prevented an afternoon restart and when umpires Steve O'Shaughnessy and Surendiran Shanmugam attempted to get going again at 2.30pm heavy rain returned as they and the players walked back onto the outfield.\nPuddles had formed all over the square within 30 minutes and it took until 5.30pm for conditions to improve enough for nine more overs of play before bad light ended the opening day's action.\nPotts trapped Bean lbw with the seventh ball back - his first after the resumption - and later removed George Hill the same way for seven.\nYorkshire have now lost 1,308 overs to the weather this season, including the complete washout against Gloucestershire at Bristol in April when not a ball was bowled.\nJust short of 350 of those have come in the last three games, at Worcestershire and against Sussex at Headingley, prior to their latest contest.\nNew ball seamer Ben Raine will have counted himself unfortunate not to have removed Lyth with either of two confident lbw appeals in the opening over.\nBut, aside from that, the runaway pacesetters were unable to build pressure before lunch as they failed to hit a consistent line or length, allowing Lyth and Bean to continue their excellent recent form.\nThe pair shared 177 for the first wicket in the draw against Worcestershire at New Road earlier this month, a game in which Bean scored a century. Lyth did likewise in last week's draw against Sussex, when the pair added 94.\nYorkshire only batted once in each fixture, something which is not out of the question here unless Durham can continue to bowl with the quality and potency Potts displayed in the evening to oust Bean and then Hill.\nLyth was particular strong on the drive and Bean on the cut, with 17 runs coming from the morning's penultimate over - bowled by Netherlands international Bas de Leede.", "url": "https://www.bbc.com/sport/cricket/66300318"}