{"authors": ["Matthew Henry", "www.facebook.com"], "date_download": "2025-05-21 07:28:04", "date_modify": "2025-05-21 07:28:04", "date_publish": "2025-05-20 17:41:40", "description": "Fourteen-year-old Vaibhav Suryavanshi impresses again with 57 in Rajasthan Royals' six-wicket victory over Chennai Super Kings.", "filename": "sport_cricket_articles_cgmjjjdr49xo_1747812484.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/64ed/live/7cac3c60-359f-11f0-bb51-b172ed46873e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cgmjjjdr49xo_1747812484.html", "title": "IPL 2025: Vaibhav Suryavanshi impresses again with 57 in Rajasthan Royals win", "title_page": "IPL 2025: Vaibhav Suryavanshi impresses again with 57 in Rajasthan Royals win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Fourteen-year-old Vaibhav Suryavanshi impressed again with 57 in Rajasthan Royals' six-wicket victory over Chennai Super Kings in the Indian Premier League.\nSuryavanshi, who became the youngest player to hit a professional men's T20 century earlier in the tournament, showed maturity beyond his years in accelerating after a careful start in pursuit of 188.\nHe scored only 12 from his first 10 balls as opening partner Yashasvi Jaiswal dominated with a 19-ball 36.\nBut Suryavanshi took on the charge after Jaiswal fell, swinging his 11th ball for six off Noor Ahmed and driving the next two deliveries for four through the covers.\nHe powered two huge sixes over long-on in one over from India all-rounder Ravindra Jadeja and reached his fifty in 27 balls by heaving Afghanistan international Noor over square leg for his fourth six as he cleverly targeted the CSK's left-arm bowlers.\n\"I don't have words for him,\" Royals captain Sanju Samson said.\n\"He can hit over leg side, he can wait and hit slower balls over covers for six. That tells you what kind of talent and temperament he has.\"\nIn total, Suryavanshi scored 24 from nine balls from Noor and 14 in the five he faced from Jadeja with all four sixes coming over the leg side.\nThe left-hander was dismissed after 33 deliveries when he played a wild swipe to off-spinner Ravichandran Ashwin and was caught at backward point but by that stage only 50 were needed from 36 balls.\n\"Today when the middle overs were going on he smartly picked his options,\" Samson said.\n\"It shows he is smart as well.\n\"That is a stunning combination with the potential, talent and game awareness. There is something special for Indian cricket.\"\nThe teenager's fifty helped Rajasthan complete a consolation victory to end their tournament with 2.5 overs overs to spare. Dhruv Jurel hit 31 not out after Suryavanshi was dismissed.\nChennai Super Kings, who are bottom of the standings - a place below the Royals - have one match remaining in the tournament.\nAyush Mhatre, 17, hit 43 and Dewald Brevis 42 for CSK but they were held to 187-8 as the Royals conceded only 17 from the final three overs.", "url": "https://www.bbc.com/sport/cricket/articles/cgmjjjdr49xo"}