{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:52:12", "date_modify": "2025-04-26 06:52:12", "date_publish": "2025-02-28 17:15:25", "description": "Tavernier's 500 Rangers games an 'unbelievable achievement' - Ferguson", "filename": "sport_articles_ckgnemx3yn3o_1745650332.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1981/live/14125e10-f5f7-11ef-bd6e-cd71c2e1454a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_ckgnemx3yn3o_1745650332.html", "title": "Tavernier's 500 Rangers games an 'unbelievable achievement'", "title_page": "Tavernier's 500 Rangers games an 'unbelievable achievement' - Ferguson - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Barry Ferguson has praised \"real leader\" James Tavernier as the captain prepares to make his 500th Rangers appearance this weekend.\nThe 33-year-old right, who joined from Wigan 10 years ago, will reach the milestone when Motherwell visit Ibrox in Ferguson's first home game as interim boss.\n\"I think it's an unbelievable achievement,\" Ferguson said. \"Listen, he's been through a lot in his Rangers career, but one thing I will say about James Tavernier is he never hides.\n\"He's always put himself out there to play. And I thought on Wednesday night [at Kilmarnock], when I moved him from his natural right-back position into the centre-half, he was exceptional. I thought he became a real leader.\n\"And that's what I want from my captain. As I said, we've had a few good chats. He's an important player for me. And as I said, tomorrow, 500 games, he deserves a lot of credit for that.\"\nTavernier has come in for criticism at times from the Rangers support, with his Ibrox career coinciding with a period of domestic dominance by Celtic.\n\"That's part of playing at Rangers,\" said Ferguson.\n\"When you suffer defeats or you don't play well, it's generally the captain that gets it in the neck. But listen, he's big enough to handle those situations. I've been through it as well.\n\"It's not nice at times, but I'm afraid that's the nature of the beast when you play at Rangers.\"", "url": "https://www.bbc.co.uk/sport/articles/ckgnemx3yn3o"}