{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:30:12", "date_modify": "2025-04-26 06:30:12", "date_publish": "2025-02-27 10:47:08", "description": "Nottingham Forest 0-0 Arsenal: Fan views", "filename": "sport_football_articles_c7788nx6yxpo_1745649012.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c7788nx6yxpo_1745649012.html", "title": "Nottingham Forest 0-0 Arsenal: Fan views", "title_page": "Nottingham Forest 0-0 Arsenal: Fan views - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "We asked for your views on Arsenal's Premier League draw at Nottingham Forest.\nHere are some of your comments:\nJames: Great performance from Arsenal with loads of energy. Dominated possession, shots, corners etc. If just one forward was available, then they'd have won this game.\nDavid: Pathetic. A must-win game and Arsenal players barely get out of a walk. Turgid. No tempo. No chances created. Does Mikel Arteta think this is good enough? Top four at best now. Something is clearly wrong with recruitment at the club when everyone who follows football knows what is missing.\nGary: Awful. The manager has to go now as he is not good enough to take this team forward. He has no idea how to change things up.\nMike: Our issue isn't the lack of an out-and-out striker. Kai Havertz is not that. It's the threat in the box. Sterling had two opportunities late on to run at the defenders to get into the box where he could have been fouled, or get a shot away. He pulled up on both. We need to be more aggressive running into the box, cause tackles to be made and make defenders slip up. But can someone please give the team credit for one defeat in 17 games, with injuries to big players for the latest lot. Manchester City or Liverpool in this situation would be patted on the head and told not to give up, \"the leaders are just that good right now\", but not Arsenal. Always the media's scapegoat, even with United and Chelsea as they are. Come on, give credit where credit is due.\nMatt: A point away at Forest, where Arsenal have lost before, to remain above Forest, would usually be seen as good.", "url": "https://www.bbc.co.uk/sport/football/articles/c7788nx6yxpo"}