{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:28:38", "date_modify": "2025-05-21 05:28:38", "date_publish": "2025-01-31 20:20:02", "description": "SA20: Jacks and Smeed star but Capitals can't beat MI Cape Town", "filename": "sport_cricket_articles_cj91yd17yr7o_1747805318.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b265/live/e081ad10-e013-11ef-be98-798cbbed3362.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cj91yd17yr7o_1747805318.html", "title": "SA20: Jacks and Smeed star but Capitals can't beat MI Cape Town", "title_page": "SA20: Jacks and Smeed star but Capitals can't beat MI Cape Town - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "English batters Will Jacks and Will Smeed put on a partnership of 72 but Pretoria Capitals were eliminated from the SA20 after losing to MI Cape Town by 27 runs.\nSurrey's Jacks (39 from 22) and Somerset's Smeed (52 from 36) came together midway through the third over with their side 15-1, chasing a formidable 223 in Centurion.\nThe pair were together until just prior to the halfway mark, when Jacks was caught by Azmatullah Omarzai off the bowling of Corbin Bosch.\nSmeed followed his compatriot to the dugout four overs later when he hit Dewald Brevis's delivery to Reeza Hendricks, as the Capitals found themselves on 115-4 in the 14th.\nAshton Turner (22 from eight) and Keagan Lion-Cachet (34* from 18) added quick runs but the target proved too challenging as the home side finished on 195-8.\nHendricks (77* from 44) and Brevis (73* from 32) were the stars of the MI Cape Town innings, from the ninth over they scorched an unbeaten partnership of 142 to take their side to 222-3.\nMI Cape Town go top of the table after nine games, while the Capitals sit fifth. However, with teams on the same points split by number of wins before net run-rate Capitals are unable to reach the knockouts.", "url": "https://www.bbc.com/sport/cricket/articles/cj91yd17yr7o"}