{"authors": ["Phil McNulty", "www.facebook.com"], "date_download": "2025-05-21 04:15:00", "date_modify": "2025-05-21 04:15:00", "date_publish": "2025-04-05 20:21:26", "description": "Aston Villa 2-1 Nottingham Forest: Forest can take heart despite defeat", "filename": "sport_football_articles_cly8k27rdd9o_1747800900.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/32c5/live/59d23e40-125b-11f0-9b05-6b3bc7230ff7.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cly8k27rdd9o_1747800900.html", "title": "Aston Villa 2-1 Nottingham Forest: Forest can take heart despite defeat", "title_page": "Aston Villa 2-1 Nottingham Forest: Forest can take heart despite defeat - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Nottingham Forest manager Nuno Espirito Santo suffered the disappointment of defeat to Aston Villa, but consolation will come from an outstanding second half performance.\nNuno will have hoped to round-off a perfect week, that has seen Forest secure an FA Cup semi-final place against Manchester City at Wembley and keep on course for their dream of reaching next season's Champions League with victory over Manchester United at The City Ground, with a good result at Villa Park.\nIt was not to be though, after a poor start saw Aston Villa go 2-0 up in 15 minutes through goals from Morgan Rogers and Donyell Malen.\nThis was a nightmare opening but Forest's performance afterwards showed exactly why they have been this season's Premier League surprise package.\nInstead of subsiding under Villa's pressure, Forest launched a fierce fightback which could have brought rewards before the interval, with Anthony Elanga and Callum Hudson-Odoi only inches off target.\nAnd Forest continued to pressurise Villa after the break, showing they can take the initiative as well as employ their trademark counter-attacking game.\nJota Silva pulled one back before Murillo almost earned Forest a point when he thundered a 30-yard drive against the bar in the closing moments.\nForest had 19 shots - two more than Villa - but were not clinical enough with only three shots on target.\nNuno's side still remain in prime position to reach the Champions League next season, something almost unthinkable before the start of the season, as they sit five points ahead of Chelsea in fourth having played one game more.\nThis was a setback - but there was more than enough in how they responded to a dreadful start to give Forest and their supporters encouragement for the remainder of the campaign, as proven by the ovation they received after the final whistle.", "url": "https://www.bbc.com/sport/football/articles/cly8k27rdd9o"}