{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:53:32", "date_modify": "2025-05-21 06:53:32", "date_publish": "2025-03-29 18:17:40", "description": "IPL 2025 results: Jos Buttler and Sai Sudharsan help GT to win over MI", "filename": "sport_cricket_articles_c4gdgg2e376o_1747810412.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/90d7/live/a17c5d40-0cc8-11f0-b574-b9ad208c1713.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c4gdgg2e376o_1747810412.html", "title": "IPL 2025 results: Jos Buttler and Sai Sudharsan help GT to win over MI", "title_page": "IPL 2025 results: Jos Buttler and Sai Sudharsan help GT to win over MI - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Gujarat Titans eased to a 36-run victory over Mumbai Indians to notch up their first win in this year's Indian Premier League.\nOpener Sai Sudharsan continued his impressive start to the tournament with a second consecutive half-century as his 63 off 41 balls provided the backbone of Gujarat's total of 196-8.\nTitans captain Shubman Gill and England's Jos Buttler, who made a half-century in his first IPL outing of 2025, also chipped in with 38 off 27 balls and 39 off 24 respectively.\nHardik Pandya led the way with the ball for MI at the Narendra Modi Stadium in Ahmedabad with 2-29.\nFive-time IPL champions Mumbai suffered an early setback in their chase when Mohammed Siraj (2-34) removed openers Rohit Sharma and Ryan Rickelton cheaply.\nSuryakumar Yadav and Tilak Varma rebuilt with a patient third-wicket stand of 62 before the latter was snared for 39 by Prasidh Krishna, who bagged a miserly 2-18 from his four overs.\nMI's hopes effectively rested on whether Suryakumar and Hardik could accelerate at the business end of the match as the run-rate climbed.\nSo when Suryakumar hit Prasidh into the hands of long-off in the 16th over to depart for 48, and Mumbai skipper Hardik perished softly to Kagiso Rabada for 11 six balls later, the game was over as a contest.", "url": "https://www.bbc.com/sport/cricket/articles/c4gdgg2e376o"}