{"authors": ["Matthew Howarth", "www.facebook.com"], "date_download": "2025-05-21 06:11:25", "date_modify": "2025-05-21 06:11:25", "date_publish": "2025-01-04 18:11:42", "description": "There have been a number of contributing factors in Newcastle's recent upturn in fortunes, but the scintillating form of star striker Alexander Isak has certainly played a major role.", "filename": "sport_football_articles_cz9gz9wgz5lo_1747807885.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/19a6/live/83ce74b0-cabd-11ef-8449-159a99d87232.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cz9gz9wgz5lo_1747807885.html", "title": "Tottenham 1-2 Newcastle: Alexander Isak 'the best striker in the league' as hot streak continues", "title_page": "Tottenham 1-2 Newcastle: Alexander Isak 'the best striker in the league' as hot streak continues - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "There have been a number of contributing factors in Newcastle's recent surge up the Premier League table, but the scintillating form of star striker Alexander Isak has certainly played a major role.\nThe Sweden international scored his 13th league goal of the season against Tottenham on Saturday, completing Newcastle's recovery from going 1-0 down after Anthony Gordon had cancelled out Dominic Solanke's early opener.\nTwelve of those 13 goals have come in Isak's past 12 appearances, with his latest effort making him only the third Newcastle player after Alan Shearer and Joe Willock to find the net in seven consecutive Premier League matches.\nOnly Erling Haaland and Mohamed Salah have scored more in the top flight this term than the 25-year-old, while Cole Palmer and Bryan Mbeumo have also found the net 13 times.\n\"I think [Isak] is the best out-and-out forward in the league,\" former Scotland striker Ally McCoist said while covering the game for TNT Sports. \"He will always give you something.\n\"In terms of his all-round game, Isak is unstoppable.\"\nOn current form, it is easy to make a case for Isak being the best striker in the division.\nHaaland is the only out-and-out frontman to find the net more often this season - and before Saturday's double the Norwegian had only managed four goals in his past 15 league appearances.\nThere is much more to Isak's game than just his goals, of course. Blessed with a silky first touch and wonderful close control, his ability to hold up the ball and bring team-mates into play has proved invaluable to Eddie Howe's side since his arrival from Real Sociedad in 2022.\nHis scintillating pace, perfectly timed runs and aerial ability make him a handful for any defender in the league, yet there is still room for improvement in the final third - as impressive as his recent purple patch undoubtedly is.\nAgainst Manchester United on Monday, Isak chipped a tame effort straight at Andre Onana after being sent clear by Bruno Guimaraes.\nIn Saturday's win at Spurs, he steered a low Jacob Murphy cross wide of Brandon Austin's goal from close range - but that missed opportunity did little to blunt his confidence as he converted another Murphy delivery from a similar position just minutes later.\n\"He was disappointed with the one he didn't take, but he's on a hot streak,\" Howe told TNT Sports. \"Long may that continue.\n\"He was in the right place at the right time. That's an art.\"\nIsak himself was quick to praise his Magpies colleagues after Saturday's victory - their sixth in a row in all competitions.\nAside from Isak's goals, Sandro Tonali's deep-lying role alongside midfield team-mates Joelinton and Guimaraes has been pivotal to Newcastle's resurgence, as has the form of Gordon, Murphy and left-back Lewis Hall.\nMartin Dubravka has deputised admirably for injured first-choice goalkeeper Nick Pope, while Sven Botman - who was such an integral part of the Magpies' fourth-placed finish in 2022-23 - delivered an assured performance against Spurs on his first appearance since recovering from a serious knee injury.\n\"It's a team thing,\" Isak told BBC Match of the Day. \"I'm looking at the players that are playing - everyone looks strong and confident.\n\"That's a big reason why we're doing well. When you win, you gain confidence.\"\nA fifth-place Premier League finish may prove enough to secure a Champions League place in 2025-26, but Isak and his team-mates are reluctant to focus on the table at this stage of the campaign.\n\"We shouldn't be talking too much about where we should end up,\" said the striker. \"We're just aiming as high as possible.\n\"We've been on a run now - and we're looking to stay on it.\"", "url": "https://www.bbc.com/sport/football/articles/cz9gz9wgz5lo"}