{"authors": ["Jonathan Bradley", "www.facebook.com"], "date_download": "2025-05-21 07:55:51", "date_modify": "2025-05-21 07:55:51", "date_publish": "2025-03-27 22:34:55", "description": "Centre Stuart McCloskey says the milestone of his 200th Ulster outing this weekend has \"crept up on him\".", "filename": "sport_rugby-union_articles_cq6yem0g25lo_1747814151.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a8d0/live/eaa6b6f0-0a93-11f0-a457-97ed85fc771e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cq6yem0g25lo_1747814151.html", "title": "Ulster v Stormers: Earning 200th provincial cap 'very special' for Stuart McCloskey", "title_page": "Ulster v Stormers: Earning 200th provincial cap 'very special' for Stuart McCloskey - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Centre Stuart McCloskey says the milestone of his 200th Ulster outing this weekend has \"crept up on him\".\nThe 32-year-old, who made his senior debut against Dragons in 2014, will become the 11th player to hit the mark for the province when he takes the field against the Stormers at Kingspan Stadium in the United Rugby Championship (URC) on Friday night.\n\"It's very special,\" said the 19-times capped Irish international.\n\"It's not something I've really thought about an awful lot until my dad reminded me at the start of the week and I thought 'Oh, flip'. It's really crept up on me.\n\"There's some amazing players in there, some guys I've played with for most of my career, so it'll be nice to join them.\"\nMcCloskey did not play representative rugby while at Bangor Grammar and was not offered a place in the Ulster Rugby Academy after leaving school.\nInstead, he caught the eye playing for Dungannon in the All-Ireland League before belatedly joining the professional set-up.\n\"There's been hard work and all that, but a lot of luck,\" he said of the key to his longevity in the side.\n\"A few injuries went my way at the start for me to get in there, then a few coaches liked me and gave me good chances.\n\"Thankfully I took a lot of those and I haven't been injured an awful lot over the years. That's kept me in and about it.\"\nGiven his form, consistency and durability, McCloskey has drawn plenty of interest from elsewhere over the years and was heavily linked with a move to France last season.\nUltimately, he cites his love for both the province and the city of Belfast as his reason for recently extending his stay with the side until 2027.\nWhile he picks the URC quarter-final victory over Munster in 2022 as a highlight of his 199 caps so far, to win silverware with Ulster remains an ambition.\n\"I love all the lads, I've enjoyed my 12 years here,\" he said.\n\"I like what we're trying to build, I like some of the young guys coming through.\n\"Hopefully I'll hold on to their coattails in a couple of years' time when they're coming into the form of their careers and looking to win something.\"\nWhile McCloskey will be adding to his considerable Ulster cap tally in the years to come, Friday's game represents a penultimate home fixture for John Cooney, the star scrum-half who will join French club Brive next season.\n\"He's definitely going to be a miss, he's some character,\" said McCloskey.\n\"He's been amazing for us since he arrived, from when he came from Connacht where he wasn't 100% first choice, to becoming one of the best nines in the league over the last seven or eight years. He's dragged us through some games.\n\"We'll miss his craic in the changing room. He's always got an opinion on something, it's normally wrong, but it's always good to argue.\"\nWhether it be milestones or impending departures, McCloskey added that the \"game is the big thing\" on Friday night with Ulster one point and one place outside the league's play-off spots with five games remaining.\n\"It's not do-or-die but if we're going to make the top eight and give this thing a good go, we've got to win this,\" he said.\n\"It's a home game, I always feel we've a good chance against anyone at home.\n\"The Stormers are in and around us in the table so we'll go with positive vibes.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/cq6yem0g25lo"}