{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:34:45", "date_modify": "2025-04-26 07:34:45", "date_publish": "2025-02-27 15:29:41", "description": "Leeds United opt not to send captain Ethan Ampadu for surgery on a knee injury in the hope he can return in the next four to six weeks.", "filename": "sport_football_articles_cevxx2e8ww4o_1745652885.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1967/live/ac6e3300-f51b-11ef-a276-596f7e6218f8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cevxx2e8ww4o_1745652885.html", "title": "Ethan Ampadu: Leeds United opt against surgery for Wales defender", "title_page": "Ethan Ampadu: Leeds United opt against surgery for Wales defender - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Leeds United have opted not to send captain Ethan Ampadu for surgery on his injured right knee.\nThe Wales international, 24, missed Monday's top-of-the-table Championship win at Sheffield United on Monday, and was expected to require an operation but boss Daniel Farke has revealed he could still return before the end of the season.\n\"The cartilage issue is complicated. Surgery would have meant him being out for the season, so we've decided to go the conservative route,\" Farke told BBC Radio Leeds.\n\"The initial decision is for him not to undergo surgery, so a conservative approach has been adopted. It's hoped he could return in four to six weeks.\"\nAmpadu, who plays both in defence and midfield, has made 21 league appearances for the Championship leaders this season, but missed 12 games earlier in the campaign after injuring his left knee against Coventry City in September.\nThat injury led to him missing four matches of Wales' autumn Nations League campaign, and he is almost certain to sit out the World Cup qualifiers at home to Kazakhstan on 22 March and in North Macedonia three days later.", "url": "https://www.bbc.co.uk/sport/football/articles/cevxx2e8ww4o"}