{"authors": ["Matt Lloyd", "www.facebook.com"], "date_download": "2025-05-20 11:59:45", "date_modify": "2025-05-20 11:59:45", "date_publish": "2023-08-06 07:08:35", "description": "BBC Wales Sport recalls every World Cup through the eyes of those who were there, with 2003 memories from Wales flanker Martyn Williams.", "filename": "sport_rugby-union_66403444_1747742385.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0CC2/production/_130666230_worldcuprewind2003.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-union_66403444_1747742385.html", "title": "World Cup Rewind: 2003 - When Wales unearthed Nuggets of golden future", "title_page": "World Cup Rewind: 2003 - When Wales unearthed Nuggets of golden future - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The World Cup in Australia was to mark a turning point for Welsh rugby.\nGone was a generation of greats such as Scott Quinnell, Scott Gibbs and Rob Howley, as well as coach Graham Henry.\nNow it was another Kiwi who almost changed the course of rugby history but at the same time made the rugby public fall back in love with Wales and set a path for its most successful period.\nIn the latest of a series reflecting on past World Cups, BBC Wales Sport looks back at 2003 with Martyn Williams.\nThe Cardiff flanker, known affectionately as Nugget for the colour of his hair, would be part of that new golden generation whose roots can be traced back to the 2003 World Cup in Australia.\n\"You can easily trace the roots of the success we enjoyed in the years that followed back to that tournament. It was a turning point,\" said Williams, now Wales team manager.\n\"Up until then there were players who had only ever really lost in a Wales jersey but the confidence and belief they gained from that tournament would set them on their way to win a Grand Slam just 15 months later and beyond.\"\nAt the time, as with most previous World Cup years, Welsh rugby was in the doldrums as Hansen's side endured a record 11-game losing streak.\nThe run included a Six Nations whitewash, a record 55-3 humiliation in New Zealand and a 40-point defeat at home to a second-string England that left Hansen's job hanging by a thread just weeks before the World Cup.\n\"You would have thought it was all doom and gloom at the time but it wasn't. We honestly believed in what we were doing,\" said Williams.\n\"Of course we were hurting. We'd been tonked in Hamilton when Jerry Collins almost buried Colin Charvis and we got spanked by England B. Then apparently David Moffett [WRU chief executive] asked Steve to change the team for the warm up game against Scotland because if we lost, he'd be out.\n\"He urged Moffett to stick with him and his plan, and it's a good job he did.\"\nA simplified World Cup format meant more pool matches but also some woefully one-sided contests, that included England's 111 points against Uruguay and Australia's record 142-0 thrashing of Namibia.\nHowever there were still some humdingers. Ireland edged Argentina 16-15 only to lose 17-16 to hosts Australia. Scotland needed a yellow card and late try to beat Fiji and England were given a scare by Samoa in a match in which they briefly fielded 16 players and were later fined £10,000.\nAnd there was a first Test game in Tasmania, where 15,000 neutral fans were told to cheer for Romania or Namibia depending on whether they were born on an odd or even date.\nWales were based in Canberra, far from the delights of Sydney or the Gold Coast, but it would prove the making of the squad.\n\"It was a young group that had a lot of growing up to do both on and off the pitch,\" said Williams.\n\"Steve and Scott Johnson [assistant coach] made us live in self-contained apartments. We had to shop for food and cook for ourselves which was a great concept.\n\"You could tell the boys who had been to university and those who had relied on their mams or wives. I was terrible at cooking but I was rooming with Iestyn Harris who would give anything a go.\n\"Alfie [Gareth Thomas] was easily the fussiest eater while the likes of Adam Jones and Gethin Jenkins literally ate anything.\n\"But it was a masterstroke for team bonding and really made us appreciate any hotels we stayed at - but it's a miracle no-one got food poisoning! I'm not sure I could get away with that these days.\"", "url": "https://www.bbc.com/sport/rugby-union/66403444"}