{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:17:25", "date_modify": "2025-04-26 04:17:25", "date_publish": "2025-03-04 07:45:57", "description": "Tiger Woods' Jupiter Links GC and Rory McIlroy's Boston Common Golf are eliminated from the TGL after failing to reach the play-offs.", "filename": "sport_golf_articles_cz7vlq0ql79o_1745641045.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8561/live/7cb37210-f8c7-11ef-b344-371784530eac.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_golf_articles_cz7vlq0ql79o_1745641045.html", "title": "TGL Golf: Tiger Woods and Rory McIlroy's teams eliminated", "title_page": "TGL Golf: Tiger Woods and Rory McIlroy's teams eliminated  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Tiger Woods' Jupiter Links GC and Rory McIlroy's Boston Common Golf have been eliminated from the TGL after failing to reach the play-offs.\nBoston needed to beat New York on Monday night to secure a play-off spot but lost 10-6, with Cameron Young, Rickie Fowler and Xander Schauffele scoring five points from the last four holes for the victors.\nSchauffele 'threw the hammer' - which increases the point total of the hole from one points to two - at the 12th and made a birdie to beat Adam Scott.\nCameron Young then saw off McIlroy, which meant Boston required two more points in the final hole to force overtime.\nBoston 'threw the hammer' but Schauffele chipped in from seven feet to seal a four-the win.\nThe result also ended Jupiter Links GC's hopes of reaching the play-offs, as New York sealed their place alongside Los Angeles Golf Club, The Bay Golf Club and Atlanta Drive GC.\nLos Angeles Golf Club, who top the SoFi Cup standings, will face fourth-placed New York in the semi-finals with the Bay Golf Club facing Atlanta Drive GC in matches held across 17-18 March.", "url": "https://www.bbc.co.uk/sport/golf/articles/cz7vlq0ql79o"}