{"authors": ["Chris Jones", "www.facebook.com"], "date_download": "2025-05-21 07:58:08", "date_modify": "2025-05-21 07:58:08", "date_publish": "2025-03-27 18:20:34", "description": "Rugby Football Union chief executive Bill Sweeney survives a vote of no confidence at a special general meeting.", "filename": "sport_rugby-union_articles_cp3ye077l0vo_1747814288.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/185d/live/a2debb40-0b3a-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cp3ye077l0vo_1747814288.html", "title": "Bill Sweeney: RFU chief executive survives no-confidence vote at special general meeting", "title_page": "Bill Sweeney: RFU chief executive survives no-confidence vote at special general meeting - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Rugby Football Union chief executive Bill Sweeney has survived a vote of no confidence at a special general meeting.\nThe motion, which called for the RFU board to terminate Sweeney's employment, was voted against by 65%.\nThose supporting the motion, such as the referees' union and Championship clubs, had cited various perceived governance failures on Sweeney's watch.\n\"I am pleased to see such a decisive outcome,\" said interim chairman Sir Bill Beaumont.\n\"I trust that those who supported this motion will honour and accept the result on this tonight and lets work forward to make changes.\n\"Let's stand together, and focus on what we can achieve together, and work to ensure that the Rugby Football Union continues to thrive, evolve, and lead the way in rugby.\n\"The time for division is behind us. The time for collaboration is now.\"\nSweeney, 67, had been widely criticised for taking home £1.1m last year at a time of record RFU losses.\nThe RFU declared £37.9m operating losses last year, only a few weeks after announcing plans to lay off more than 40 staff in the latest round of redundancies.\nA second motion, to expedite governance reform in the English game, was overwhelmingly supported at the meeting.\nThe motion to oust Sweeney was proposed on Thursday by Paddy McAlpine, the co-chair of the Whole Game Union and chair of Chichester Rugby Club.\n\"We bring this motion not for disruption, but because we believe change is necessary and overdue,\" McAlpine said.\n\"The game is being let down by those entrusted to lead it. It is no longer just flawed - it is dangerously inadequate.\n\"This is not just a vote - this is a turning point, the chance to say we want a better future for English rugby.\"\nThrough the course of the 58-minute discussion, various club members, constituent bodies, council and board members spoke up either in support or defence of the motion, before the vote was taken.\nThe motion received 466 votes against and 206 votes for, with 36 abstaining.\nSpeaking against the motion, RFU board member Wayne Barnes strenuously defended Sweeney's record in his six years in the role, and said his departure would leave a significant void at the top of English rugby.\n\"He takes all of those relationships, that experience and that influence with him,\" former referee Barnes said.\n\"The void would be filled by someone who does not know the landscape.\"\nBarnes also insisted the majority of referees did not back the motion, despite the Rugby Football Referees' Union bringing the motion in the first place.\n\"This is a time for rugby to now come together,\" Barnes said. \"I really hope we can start to celebrate the enormous positives there are in the game.\"\nHowever, speaking on behalf of the RFU board, Barnes pledged the powers-that-be will continue to listen to the game in a bid to end months of discord and heal the cracks in English rugby.\n\"There is clearly a lot of work to be done to restore our relationship with the community game,\" he added. \"We need to focus on restoring trust.\"\nA second motion, which was brought forward by the RFU board, called for the expedition of governance reform, devolving more power to the community game.\nThis motion was passed by 554 votes to 127.\n\"These reforms will represent a once-in-a-lifetime opportunity to change the RFU,\" said Paula Carter, RFU board member and council member for Surrey.\nBeaumont added: \"Let us put this period of infighting behind us, and instead, unite behind a common mission to modernise the union and its structures.\n\"Members have now given us an overwhelming mandate to shake up the archaic structures of how the game is run here, which continue to hold us back.\n\"The RFU wants to modernise, and this is an unprecedented opportunity to do exactly that.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/cp3ye077l0vo"}