{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:44:54", "date_modify": "2025-05-21 07:44:54", "date_publish": "2025-03-28 08:59:49", "description": "Arsenal news: Fans have split views on season so far", "filename": "sport_football_articles_cpv49wr329jo_1747813494.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cpv49wr329jo_1747813494.html", "title": "Arsenal news: Fans have split views on season so far", "title_page": "Arsenal news: Fans have split views on season so far - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We took a look at the metrics around Arsenal's campaign (you can find the data lower down this page) and asked for your views on the season generally. Has it been as bad as it has been portrayed on times? Or are the Gunners actually well placed?\nHere are some of your comments:\nChris: In the face of adversity, questionable red cards (not that they weren't red but other teams had different treatment for the same errors) and added to serious injuries to key players - the factors have proved to be too damaging. I for one am proud at how the team, the manager and the back room staff have held their heads high and fought every battle placed in front of them. A Liverpool total collapse is unlikely but I do believe we will be closer than 12 points by the season end. Well played boys, you've done us proud in the Premier League. Now let's get the job done in the Champions League.\nAlan: No question that Arsenal are a force in the Premier League, but a failure in recruitment and solid back up for the inevitable injuries has meant that the club will not get the titles and cups it richly deserves. This must be a lesson for next season and if learned then Arsenal will emerge triumphant.\nRachel: For the past few seasons there's been some reason why Arsenal have missed out, whether it's injuries, losing games we shouldn't have lost, etc. It would be great to face next season with a full and complete squad and no excuses. Then we can truly measure the progress we have made.\nKeith: You can reflect all you like but second best will always be second best. Any Arsenal fan can see the improvement but we also see the FA Cup defeats last season and this to realise what second best is. Please buy a striker/goalscorer/forward or two and convert possession into goals.\nIfeanyi: Missed opportunity in terms of the league. It will be a major miracle if Arsenal win the Champions League.", "url": "https://www.bbc.com/sport/football/articles/cpv49wr329jo"}