{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:11:51", "date_modify": "2025-04-26 04:11:51", "date_publish": "2025-03-04 12:43:07", "description": "Leicester City: Has recruitment prompted Premier League problem?", "filename": "sport_football_articles_c4gmdmd6g9mo_1745640711.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/15a9/live/69a1ecb0-f8ea-11ef-808b-234dabc32b78.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c4gmdmd6g9mo_1745640711.html", "title": "Leicester City: Has recruitment prompted Premier League problem?", "title_page": "Leicester City: Has recruitment prompted Premier League problem? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Failures in recruitment over the past decade is the primary reason behind Leicester's fragile state, says former winger Matt Piper.\nThe Foxes made astute signings such as Jamie Vardy, Riyad Mahrez and N'Golo Kante, who were key to their Premier League title win in 2015-16. Since then however, signings have been far less consistent and the club has struggled to pivot its strategy after finding success.\n\"All of a sudden if you're going into the market as a top Premier League team and try and buy a £400k player to put into the first team the fans aren't having it,\" Piper told BBC Radio Leicester's When You're Smiling podcast.\n\"In a certain way that strategy was the downfall of our own success.\n\"What we did is sell one huge asset each season and that can be frustrating for fans because you're never really building by adding players to the best players you've already got.\n\"For a club like Leicester that was a really smart tactic to move in the transfer market. But, then you have to be really clever and savvy with how you spend that money and we had a number of transfer windows where we weren't.\n\"Steve Walsh had gone by that point and the recruitment was not at the level of a top Premier League club fighting at the top end of the table. Then the problems start to unravel. Then players think let's get established Premier League players in who have done it.\n\"The problem with that is the clubs like Fulham and Crystal Palace who were selling us this type of players. We had ambitions to be higher than them and we're taking players they don't want anymore and putting them in our first XI.\n\"Then, everyone is scratching their heads at why we're down near the bottom of the table with a lack of quality in the group. That is the reason why unfortunately.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c4gmdmd6g9mo"}