{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:36:32", "date_modify": "2025-04-26 07:36:32", "date_publish": "2025-02-27 14:31:19", "description": "Man Utd news: Fan views on Alejandro Garnacho", "filename": "sport_football_articles_c8e771lzj82o_1745652992.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c8e771lzj82o_1745652992.html", "title": "Man Utd news: Fan views on Alejandro Garnacho", "title_page": "Man Utd news: Fan views on Alejandro Garnacho - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Here are some thoughts from those more sympathetic with Alejandro Garnacho.\nMaurice: I completely understand him. He is the best of our current forwards and everyone knows it. You could see the difference he made when coming on against Everton and while he was playing yesterday. The invisible Rasmus Hojlund should have come off. If Ruben Amorim doesn't show Garnacho respect I wouldn't blame him if he wanted to leave.\nPhill: He's a kid - subbed off. I like that it frustrated him as it shows he wants to play. Social media thing was daft, but otherwise no blame at all.\nGary: Yet again a drama because it's Man Utd. The lad was disappointed at being substituted which shows his passion. I don't see this as a big deal but, because it's us, it's back page news. He's 20. People forget this\nPeter: No, he didn't cross any kind of line. He is a young man with big ambitions who was having a really positive game where he felt he would get a goal. It must have been galling to end up having to go off and he probably needed to vent his frustration privately. He shows up every time he plays, so he is entitled to that, I think. A more experienced pro might have been able to process it in public, but I doubt I could have, at his age. Next game will be the one, Alejandro!\nCalvin: It did not annoy me, it kind of shows how annoyed he was at getting taken off and Amorim is messing around with him in and out of the team. I am more annoyed he was subbed off.", "url": "https://www.bbc.co.uk/sport/football/articles/c8e771lzj82o"}