{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:03:00", "date_modify": "2025-05-21 06:03:00", "date_publish": "2025-02-08 17:31:31", "description": "Dundee 4-0 Airdrieonians: What Docherty said", "filename": "sport_articles_crlkw06x68eo_1747807380.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c54f/live/32748580-e63f-11ef-abf5-19b142cf30ba.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_crlkw06x68eo_1747807380.html", "title": "Dundee 4-0 Airdrieonians: What Docherty said", "title_page": "Dundee 4-0 Airdrieonians: What Docherty said - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Dundee manager Tony Docherty: \"I'm delighted. Our objective was to get through and to keep a clean sheet as well. We got the job done in the first half, went 2-0 up after 20 minutes.\n\"I was looking for a reaction from my team. We made six changes to make sure there was energy and intensity in the side, but not diminishing any quality - and you saw that.\n\"I was really pleased with a lot of today. Second half was a little flat but the objective was to keep a clean sheet and we got a few players - Samuels, Lopez, and particularly big Joe [Shaughnessy] - on the pitch. A good day's work.\n\"You don't become a bad team overnight. There were reasons that we lost that game last Saturday, and I apologised to the fans. I took that responsibility in making sure today that the fans could sit back and see their team in the last eight of the Scottish Cup.\"\n\"I know Lyall [Cameron] really well and you could see the ovation he got from the fans when he came off, which tells you everything. I took him off to protect his Achilles. He'll be a really important player for us in the run in and he's 100% committed to Dundee until the end of the season.\n\"A good Cup run was one of our main objectives at the start of the season. If the draw is kind to us, maybe we can go a wee bit further.\"", "url": "https://www.bbc.com/sport/articles/crlkw06x68eo"}