{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:17:11", "date_modify": "2025-05-21 05:17:11", "date_publish": "2025-04-03 16:47:05", "description": "Championship club Cornish Pirates sign Exeter scrum-half Will Becconsall on loan.", "filename": "sport_rugby-union_articles_crm3zyevm0ro_1747804631.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4449/live/8126e520-10aa-11f0-9af0-9909a653fc84.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_crm3zyevm0ro_1747804631.html", "title": "Will Becconsall: Cornish Pirates sign Exeter scrum-half on loan", "title_page": "Will Becconsall: Cornish Pirates sign Exeter scrum-half on loan - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cornish Pirates have signed Exeter scrum-half Will Becconsall on loan.\nThe 22-year-old from Truro has made seven appearances in all competitions for the Premiership club this season, and started their league loss to Harlequins in October.\nHis best season came in 2022-23 when he made seven starts, including being first-choice scrum-half in Exeter's European Champions Cup knockout round wins over Montpellier and Stormers, as well as their semi-final loss at La Rochelle.\nHaving joined up with the Pirates squad earlier this week, he could make his debut for the Championship side in Sunday's game with Cambridge at the Mennaye.\n\"With Cam Jones out with an ankle injury, and with Will Rigelsford not available at this present time, we needed to bolster our squad,” said Pirates joint-head coach Gavin Cattle.\n\"Will Becconsall himself has been injured, but he has worked his way back to fitness with a couple of run outs for Exeter University, plus he that experience of having played for the Chiefs in the Premiership.\n\"We are excited to be working with him and it once again underlines our good relationship with Exeter.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/crm3zyevm0ro"}