{"authors": ["Andrew Benson", "www.facebook.com"], "date_download": "2025-05-20 14:15:57", "date_modify": "2025-05-20 14:15:57", "date_publish": "2023-07-29 14:43:43", "description": "Alain Prost says he hopes the major changes at Alpine will be an \"electroshock\" to a team suffering from too much corporate interference.", "filename": "sport_formula1_66350133_1747750557.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2920/production/_130582501_gettyimages-1247871197.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_formula1_66350133_1747750557.html", "title": "Belgian Grand Prix: Alain Prost says situation at Alpine 'saddens and distresses me'", "title_page": "Belgian Grand Prix: Alain Prost says situation at Alpine 'saddens and distresses me' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Alain Prost says he hopes the major changes at Alpine will be an \"electroshock\" to a team suffering from too much corporate interference.\nThe four-time champion made swingeing criticisms of the Renault-owned team in an interview with L'Equipe newspaper.\nProst said history showed F1 teams needed \"a simple structure detached from an industrial organisation chart\".\nAnd he accused former Alpine CEO Laurent Rossi, who was sidelined last week, of \"incompetence\".\nProst, who left his role as a non-executive director of the team in 2021 after a fall-out with Rossi, said: \"During my years at Renault, how many times have I heard in the corridors of the headquarters in Boulogne-Billancourt, that F1 was a simple sport that could be run from home by men in place.\n\"Big mistake, as proven by the last of the leaders Laurent Rossi, from whom [Renault chief executive officer] Luca de Meo separated a week ago.\n\"Laurent Rossi is the finest example of the Dunning-Kruger Effect,, external that of an incapable leader who thinks he can overcome his incompetence by his arrogance and his lack of humanity towards his troops.\n\"[Rossi] thought he had understood everything from the start, when he was totally mistaken.\"\nProst said Rossi, who Renault said had been moved to \"special projects\" last week, \"broke the momentum\" of the team.\nHe added: \"I love this team and seeing it in this state today saddens and distresses me.\"\nProst was reacting to the decision by Renault to part ways with Alpine team principal Otmar Szafnauer as well as long-serving sporting director Alan Permane.\nBoth men are still in their roles at this weekend's Belgian Grand Prix, but will depart straight afterwards. Permane had been with the team since 1989.\nProst contrasted what he said was the corporate influence on Alpine with the successful eras at Ferrari in the 2000s, Mercedes in the 2010s and Red Bull now.\nProst said: \"Ferrari worked with Jean Todt relying on Ross Brawn and Michael Schumacher; Mercedes enjoyed success with Toto Wolff backed by Niki Lauda and James Allison with Lewis Hamilton spearheading.\n\"Red Bull, even if it is not backed by a major manufacturer, does the same. It is Christian Horner and Adrian Newey who manage for their two drivers, Sebastian Vettel and now Max Verstappen.\n\"And in these three cases, there was a strong president who was completely involved in F1 to support the action taken: Luca di Montezemolo, Dieter Zetsche and Dietrich Mateschitz.\n\"They had the codes of F1, the agility and flexibility to let their men make the decisions.\"\nHe pointed out that Renault had only been successful in F1 when they followed the same model with Flavio Briatore and Fernando Alonso in 2005-6.\nHe added: \"Funny to see that the leaders of F1 are often invited to conferences on management by large groups in order to talk about responsiveness and flexibility. Rarely the reverse…\"\nAlpine's new motorsport director, Bruno Famin, will be acting team principal while he conducts an assessment of the team's operations following his appointment two weeks ago.\nFamin said they had split with Szafnauer and Permane because \"at one stage we realised that we were not on the same line on a couple of topics\".\nHe added: \"The competition is so hard and if we are not 100% aligned I think we all have enough experience to know that it's useless to continue together and everybody has chosen to go his own route.\"\nQuestioned on the wisdom of making so many changes in such a short space of time, Famin said: \"Stability can be also a way of doing always the same result in the same way and not progressing. Here, [if we] would have been much closer to the top teams this season, for sure things would have been different.\n\"But we need to in terms of stability and building things. Now, we need to make some changes to move forward and to go faster and to change this stability, which is quite counterproductive at this stage.\"\nAlpine set themselves the target this year of finishing fourth for the second consecutive season and moving closer to the top three teams.\nInstead, they are sixth at the halfway point and have been leapfrogged by McLaren and Aston Martin, who signed Fernando Alonso, a driver Alpine lost because Rossi would not offer him a two-year contract as he believed there was a risk his performance would tail off.\nFamin said one of the reasons Alpine had fallen behind was that their engine was not as good as those of rivals Ferrari, Honda and Mercedes.\nAsked why Alpine/Renault had not been able to make the same progress as their competitors despite operating under the same rules, he said: \"I don't have anything at all about that. I cannot comment on that.\"", "url": "https://www.bbc.com/sport/formula1/66350133"}