{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:53:33", "date_modify": "2025-05-21 06:53:33", "date_publish": "2025-03-29 18:12:23", "description": "Jersey Bulls go top of Combined Counties Premier South after a 4-0 win over Tooting and Mitcham United.", "filename": "sport_football_articles_c4gegkyyzmvo_1747810413.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0926/live/05b456f0-0cc9-11f0-b574-b9ad208c1713.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c4gegkyyzmvo_1747810413.html", "title": "Jersey Bulls go top of league after beating Tooting and Mitcham United 4-0", "title_page": "Jersey Bulls go top of league after beating Tooting and Mitcham United 4-0 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jersey Bulls went top of Combined Counties Premier South after a 4-0 win over Tooting and Mitcham United.\nThe Bulls are ahead of second-placed Redhill on goal difference with a game in hand following the victory at Springfield.\nJoe Kilshaw gave the islanders the perfect start as he calmly slotted home in the fourth minute after being put through on goal.\nEuan van der Vliet had to be alert to keep out Tooting 13 minutes later as the Bulls went into half time 1-0 up.\nLorne Bickley settled any home nerves six minutes into the second period when Miguel Carvalho nicked the ball off a defender and slipped in the Bulls' record goalscorer.\nBickley struck the post two minutes later while Karl Hinds hit the bar with a 69th-minute free-kick before he made it 3-0 when he slotted home from Carvalho's assist with eight minutes to go.\nJames Carr wrapped up the win in stoppage time as he tapped in Jonny Le Quesne's pass.\nThe win is a boost as Bulls prepare for back-to-back games with Redhill - matches which could well decide if the islanders can win the title and earn promotion to the Isthmian League.", "url": "https://www.bbc.com/sport/football/articles/c4gegkyyzmvo"}