{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:44:04", "date_modify": "2025-05-21 07:44:04", "date_publish": "2025-03-28 09:39:45", "description": "Northampton Town left-back Ali Koiki is facing another spell on the sidelines after suffering a thigh injury.", "filename": "sport_football_articles_cx2g2jkppz4o_1747813444.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/18f0/live/91751180-0bb5-11f0-8e25-91624fd3b00c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cx2g2jkppz4o_1747813444.html", "title": "Ali Koiki: Northampton defender suffers new injury setback", "title_page": "Ali Koiki: Northampton defender suffers new injury setback - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Northampton Town left-back Ali Koiki is facing another spell on the sidelines after suffering a thigh injury.\nThe 25-year-old had only just returned to the squad, making three appearances from the bench this month, having not played since August with a muscle problem.\nCobblers manager Kevin Nolan confirmed that Koiki, who joined the club from Bristol Rovers in the summer of 2021, will not play against Cambridge United on Saturday and will be out \"for a while\".\nHe told the club website, external: \"I don't really want to put a date on it, we thought he might have to have surgery but we are hoping now that isn't the case.\n\"We might get him back right at the end of the season but we will be supporting him and we won't rush him back in any way.\"\nKoiki will be out of contract in the summer, having signed a two-year deal after helping Northampton win promotion from League Two in 2023.\nFellow defender Jordan Willis is also doubtful for the Cambridge game because of what Nolan said is a \"tight hamstring\".\nNorthampton are 19th in League One, six points clear of the relegation places, with eight games left to play.", "url": "https://www.bbc.com/sport/football/articles/cx2g2jkppz4o"}