{"authors": ["Alex Pewter", "www.facebook.com"], "date_download": "2025-04-26 04:11:50", "date_modify": "2025-04-26 04:11:50", "date_publish": "2025-03-04 12:44:30", "description": "Crystal Palace news: Opinion - Fan writer on Eddie Nketiah", "filename": "sport_football_articles_czje48x7dn8o_1745640710.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e6b0/live/3752ed40-b629-11ee-bc2f-cb5579b90709.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_czje48x7dn8o_1745640710.html", "title": "Crystal Palace news: Opinion", "title_page": "Crystal Palace news: Opinion - Fan writer on Eddie Nketiah - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "On a weekend where progressing in the FA Cup should have drawn an unblemished positive response, Saturday's victory over Millwall was marred by the injury inflicted on Jean-Phillipe Mateta.\nThere is a significant risk factor that comes with any head or neck injury, and even the 25 stitches that Mateta received in the hospital could be viewed as a fortunate outcome given the dangers of that particular high boot.\nIt is easy to understand the events that followed - the clearly emotional but justified response by chairman Steve Parish when interviewed at half-time. Also, the muted performance from the home team headed into the second half after getting updates on their talismanic forward.\nUnder those circumstances, it was the Frenchman's replacement that rose to the occasion. Eddie Nketiah, who ended the contest with his headed goal in the second half, earned man-of-the-match honours from the fans.\nThere is no fixed time scale on Mateta's return beyond knowing he will miss the Premier League game on Saturday. This thrusts the ex-Arsenal forward Nketiah into a very unfamiliar situation during his time at Palace by being the attack's focal point.\nIt was evident against Millwall that the team, used to the physical size and presence of Mateta, struggled to adapt without the option of playing direct. In planning for Ipswich at the weekend, they must find a different route to suit the next man up in attack.\nDespite the sizeable financial investment in his recruitment, Nketiah has been in limbo within Oliver Glasner's team, a different profile to Mateta and without the comfort to play in attacking midfield.\nFollowing back-to-back goals, and clearly with the support of his fellow players in the celebrations for both, it is up to Nketiah to kickstart his season in its closing stages.", "url": "https://www.bbc.co.uk/sport/football/articles/czje48x7dn8o"}