{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:31:39", "date_modify": "2025-05-21 06:31:39", "date_publish": "2025-03-31 18:20:23", "description": "Ashwani Kumar: Hardik Pandya celebrates dream IPL debut for MI seamer against KKR", "filename": "sport_cricket_articles_cy5rykl62n1o_1747809099.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/13c0/live/57fbb860-0e5c-11f0-935b-db45f1a7a4cb.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cy5rykl62n1o_1747809099.html", "title": "Ashwani Kumar: Hardik Pandya celebrates dream IPL debut for MI seamer against KKR", "title_page": "Ashwani Kumar: Hardik Pandya celebrates dream IPL debut for MI seamer against KKR - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "In terms of debuts, Ashwani Kumar's could have hardly gone better.\nThe 23-year-old was called into action almost immediately on his Indian Premier League debut, leaping to catch the dangerous Kolkata Knight Riders opener Quinton de Kock.\nBut that was just the start - called to bowl in the fourth over, Ashwani had opposition Ajinkya Rahane caught from his first ball. Rahane has 195 caps for India, Ashwani had played just 10 matches in his senior career.\nThe left-arm seamer went on to take 4-24 from three overs as MI dismissed KKR for 116, a total they chased down with ease.\nHe had Rinku Singh caught by Naman Dhir, then produced superb balls to uproot the stumps of Manish Pandey and Andre Russell.\n\"I am really, really happy for the young kid,\" said Mumbai Indians captain Hardik Pandya.\n\"It is all scouts - they picked him. They have gone to all the places and picked these young kids.\n\"We played a practice game, he had that zip, that late swing, something off the wicket, a different action and he was a leftie.\n\"We just thought because of the options he had and he has good death options - we just backed him and the way he took that wicket of Russell was a very crucial wicket, and how he started with the catch of de Kock, it was terrific to see a fast bowler jumping that high to take a catch!\"", "url": "https://www.bbc.com/sport/cricket/articles/cy5rykl62n1o"}