{"authors": ["Bobbie Jackson", "www.facebook.com"], "date_download": "2025-05-21 04:29:22", "date_modify": "2025-05-21 04:29:22", "date_publish": "2025-04-05 10:09:00", "description": "British heavyweight Fabio Wardley will take on American Jarrell Miller at Ipswich's Portman Road for the WBA 'interim' title on 7 June.", "filename": "sport_boxing_articles_cwyn845y0lno_1747801762.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7439/live/a727fbf0-1204-11f0-b73d-79ac1db8714d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_boxing_articles_cwyn845y0lno_1747801762.html", "title": "Fabio Wardley: British heavyweight to face Jarrell Miller at Portman Road on 7 June", "title_page": "Fabio Wardley: British heavyweight to face Jarrell Miller at Portman Road on 7 June - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "British heavyweight Fabio Wardley will take on American Jarrell Miller at Ipswich Town's Portman Road for the WBA 'interim' title on 7 June.\nWardley is a lifelong fan of the Premier League club and said a fight at the stadium was \"on the cards\" after beating fellow Briton Frazer Clarke in October.\nThe undefeated 30-year-old vacated his British title in March as he pursues a world title.\n\"As a proud Tractor Boy born and bred in Ipswich, this is a dream come true for me,\" Wardley said.\n\"Fighting for a world title at Portman Road means everything to me. I've got a tough opponent in front of me, but that's what I live for.\n\"I'm ready to dig deep, go to battle, and leave it all in the ring. It's going to be a war, and I can't wait to give my hometown crowd a spectacle they'll never forget.\"\nWardley was set to face WBA 'regular' champion Kubrat Pulev but will meet 36-year-old Miller instead.\nMiller has not won since March 2023, with his last two fights ending in a defeat by Daniel Dubois and a draw with Andy Ruiz Jr in August.\nHe was in talks to face Derek Chisora in February but negotiations fell through amid a dispute between the American and his promoter.\nMiller served a two-year doping ban after twice testing positive for a performance enhancing drug, in 2019 and 2020.\nWardley, who contested just a handful of unlicensed white collar bouts before turning professional in 2017, has 18 wins and one draw on his record, with 17 victories via stoppage.\n\"It is a huge pleasure for me to deliver Fabio his dream of fighting at Portman Road,\" Queensberry's Frank Warren, who promotes Wardley, said.\n\"It is what he has spoken about from day one of our alliance and I know how much Ipswich Town means to him.\"", "url": "https://www.bbc.com/sport/boxing/articles/cwyn845y0lno"}