{"authors": ["Brian McLauchlin", "www.facebook.com"], "date_download": "2025-05-19 15:37:21", "date_modify": "2025-05-19 15:37:21", "date_publish": "2017-07-09 13:00:18", "description": "Josh Taylor hopes his stoppage of Ohara Davies on Saturday can help secure a bout against his fellow Scot Ricky Burns.", "filename": "sport_boxing_40548761_1747669041.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ACE/production/_96864232_13696468.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_boxing_40548761_1747669041.html", "title": "Josh Taylor wants 'massive' fight with fellow Scot Ricky Burns", "title_page": "Josh Taylor wants 'massive' fight with fellow Scot Ricky Burns - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Josh Taylor hopes his impressive seventh-round stoppage of Ohara Davies on Saturday can help secure a bout against fellow Scot Ricky Burns.\nThe Commonwealth super-lightweight champion, 26, took his perfect record to 10 wins as he stung Londoner Davies, the WBC Silver champion, at Braehead.\n\"I would want it. It would be a great fight for Scottish boxing and Scottish fans,\" said Taylor of a Burns match.\n\"I think it would sell out any arena. It would be a massive fight.\"\nThe win over Davies, trained by Tony Sims, propels Taylor into the top 15 of the WBC rankings at 140lbs.\nThe rise of the Prestonpans fighter since turning professional, after winning gold for Scotland at the 2014 Commonwealth Games in Glasgow, was summed up by Barry McGuigan, his manager at Cyclone Promotions, who has placed Taylor on the undercard of stablemate Carl Frampton's world title bouts.\nMcGuigan told BBC Scotland: \"He has fought on three world title fight bills, he's fought in America three times, he's won the Commonwealth title in his seventh fight. This kid is a superstar.\n\"He has the ability to win a world title at light-welterweight and welterweight.\n\"Ricky Burns won't beat Josh Taylor. That sounds very pompous of me but he won't beat him.\n\"I have talked about how much I admire him and how much I like his humility. He is a fabulous guy and the only Scottish fighter to win tiles at three weight divisions, but he won't beat Josh Taylor, not now.\n\"The reality is he is just starting to go over the edge and Taylor is on the way up.\n\"You haven't seen the best of Taylor. I thought he was vicious, nasty, clinical, took plenty of shots but most of them on his hands, boxed extremely intelligently, but that is what he is about.\"\nBurns, 34, lost his WBA super-lightweight belt to Namibia's Julius Indongo at the SSE Hydro in Glasgow in April.\n\"Ricky is still at the top of the game and a very tough fighter. He's got all the experience. It would be a very testing fight for me. If I could get through that, I'd be ready to go for world titles.\n\"I'd love to fight at Edinburgh Castle. It's a dream of mine. I think it would be iconic.\"\nGet all the latest boxing news sent straight to your device with notifications in the BBC Sport app. Find out more here.", "url": "https://www.bbc.com/sport/boxing/40548761"}