{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:13:12", "date_modify": "2025-05-21 04:13:12", "date_publish": "2025-04-06 00:00:00", "description": "Follow live BBC Radio commentary plus text and score updates from Sunday's Premier League fixtures.", "filename": "sport_live_cn4yjknz8r2t_1747800792.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cf6e/live/54948740-12eb-11f0-ac9f-c37d6fd89579.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_live_cn4yjknz8r2t_1747800792.html", "title": "Premier League LIVE: Fulham v Liverpool, Brentford v Chelsea & Tottenham v Southampton", "title_page": "Premier League LIVE: Fulham v Liverpool, Brentford v Chelsea & Tottenham v Southampton - radio, text & score - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Goodbye\nSo, Southampton are relegated, runaway leaders Liverpool suffer a rare league defeat and Chelsea and Brentford hit a stalemate.\nThere is more Premier League football taking place right now.\nYou can follow the Manchester derby right here.\nUntil next time...\n'The plan nearly worked'\nFT: Brentford 0-0 Chelsea\nChelsea\nChelsea head coach Enzo Maresca, speaking to BBC's Match of the Day: \"I think we shot more than 20 times, I think the only thing we missed has been the goal but overall, it’s been a good performance.\"\nOn his team selection: \"We played Thursday night, so the idea was to start the game in one way and finish in another way. I think the plan nearly worked. We just the missed the goal.\"\nOn the performance: \"We can always do something better, not only today but in general. When you shoot more than 20 times, you’ve made enough to win the game.\"\nOn balancing the Premier League and Conference League: \"It’s difficult, but at the same time it’s nice because it means we’re near the end.\"\nOn whether still being in the Conference League is a good thing: \"To be honest, when you are Chelsea manager you have to win all the games, not only in the Conference [League]. It is the same pressure.\"\nPost\nFT: Brentford 0-0 Chelsea\nBrentford\nBrentford head coach Thomas Frank, speaking to BBC's Match of the Day: \"I felt that we played a good game, a very good game. I think the performance was good, first half was a very good performance. I think we were clearly on top in the first half. In that spell, we should have taken our chances. Second half more even. In all of the game, we defended very well.\"\nOn keeping a first home clean sheet in the Premier League for 11 months: \"That’s crazy, that’s a positive I guess.\"\nOn the performance: \"The performance overall was very good, we were playing against a top team with a good manager. They are well-coached, they’ve spent billions on players and I think the way we played and performed today, we had the better chances to win the game.\"\nOn being a consistent Premier League club: \"Our culture is fantastic. I think it’s good people working together, working for each other and caring about each other. To be able to take calm, solid, good decisions is an unbelievably important thing, especially from owners and directors.\"\n'We have to build something good around the club'\nFT: Tottenham 3-1 Southampton\nSouthampton\nSouthampton captain Jan Bednarek speaking to Premier League Productions: \"Let's be honest, today is just official but we knew for a few weeks that relegation was coming. It was just a matter of time. Next season we will be in the Championship and it is the beginning of something new. We have to build something good around the club.\n\"We can't change the past, the only thing we can do in the last seven games is to enjoy being in the Premier League. We have to improve as players and as a club. Hopefully we are going to build something great.\n\"The best thing is that we can learn, we can work hard and we can improve. Hopefully we can perform better in the last seven games. We want to get more points, I don't think 10 is enough. Hopefully we will get more points.\"\n'Great performance'\nFT: Fulham 3-2 Liverpool\nFulham\nFulham boss Marco Silva, speaking to BBC MOTD: \"It was a great, great performance from us, a big one [result]. Not just because it’s Liverpool but because we needed to bounce back after the last two games.\n\"Our first half was very, very good played at a very high level. We showed great organisation and commitment. We were clearly the best team on the pitch in the first half.\n\"In the second half there was a good reaction from Liverpool which we expected and our energy went down a little bit which was to be expected because it was so high in the first half. Overall though we deserved the three points.\"\nOn Rodrigo Muniz's goal: \"He's a proper quality striker. He is still very young but he is growing so quick. There are still many things to improve. But he is very high quality for a number nine.\"\nOn Calvin Bassey: \"Calvin has all the skills to be a top central defender. He ticks all the boxes to be a top, top player. Now he has to be more consistent.\"\nOn chasing a place in Europe: \"The aim was to be in the top half of the table at this stage of the season. We got three points. I want everybody really grounded.\"\n'I see how the fans love their players and their team'\nFT: Tottenham 3-1 Southampton\nSouthampton\nSouthampton manager Ivan Juric speaking to BBC Match of the Day: \"I think we did very, very good in the second half. More intensity and technically we played better. Second half was good. First half we were too low, not high pressure and everything was difficult. I want to see that second half performance in the next seven games.\"\nOn relegation being confirmed: \"It's a difficult day, tough day but I see the fans, how they love their players and their team. It's something incredible. This experience has to serve to create something stronger than this.\"\nOn what progress he is looking to see: \"Now it is important to think about the next game and then we will see everything.\"\n'What a way to bounce back'\nFT: Fulham 3-2 Liverpool\nFulham\nFulham boss Marco Silva, speaking to Sky Sports: \"Our first half was really at a high level. To able able to have 10 shorts and score three goals in the first half...we had a good dynamic, good tempo, high energy.\n\"In the second half we started to drop a little bit of the energy. Overall I really believe we deserved it. What way to bounce back [after Crystal Palace and Arsenal defeats].\n\"We had one of the best 30 minutes we have played at home against Palace. In the Arsenal game away from home we were in the game until the last minute. We have always been able to bounce back in the Premier League after some downs. We did it in an amazing way today.\"\n'We have to avoid that record'\nFT: Tottenham 3-1 Southampton\nSouthampton\nSouthampton manager Ivan Juric speaking to Sky Sports: \"We know that we are in a bad situation and today was a certain thing. I cannot say anything bad about the players, it was a really tough year for everyone.\"\nOn what he wants to see between now and the end of the season: \"I want to see the Crystal Palace game like we played the second half here. We have to try and play good games.\"\nOn discussions for his future: \"No, now we will see everything. We are thinking just about the games now. We will see now what everyone thinks, what I think. The fans deserve much more and we have to understand all of the mistakes we have made and then create something really strong.\"\nOn avoiding Derby's 11-point record: \"We have to avoid that record. Do our best. It cannot happen.\"\n'Mo will show up again, I don't worry about that'\nFT: Fulham 3-2 Liverpool\nLiverpool\nLiverpool boss Arne Slot, speaking to BBC MOTD: \"It's not often we concede three goals let alone in one game or 15 minutes. We could have prevented it. We scored a good goal but apart from that the second half performance was much more what we’re like.\n\"Conceding three goals like we did is not of the standards of Liverpool. We were creating chance after chance after chance [towards the end]. In the end we lacked time to make up for the three mistakes we made in the first half.\"\nOn Mohamed Salah not scoring for four club games: \"Maybe he should see it as a compliment [that people are talking about it] because his numbers were not normal [when he was scoring]. The good thing about Mo is he knows what kjnd of player he is. Mo will show up again, I don’t worry about that.\"\n'A sad day that this group of players will learn from'\nFT: Tottenham 3-1 Southampton\nSouthampton\nSouthampton goalkeeper Aaron Ramsdale speaking to Sky Sports: \"We knew it was probably going to be inevitable at some point, we haven't been good enough all season. We were dominated by the better team. We dug in in the second half but it is a sad day and one that this group of players will learn from.\"\n\"We need wins, points, performances. It has to come to a point where the fans are happy and singing. Fair play to those [fans] who came today, have been at Saint Mary's and travelled around the country. We have to build some momentum going in to the Championship season.\nOn trying to go past Derby's 11-point record: \"We want to get as many points as we can until the end of the season. No-one wants that record and we will do what we can but we will do what we can to get more points on the board.\"\nOn his saves: \"Something like that can hopefully spark a period in the game. I'm there to try and save as many as possible and we have fallen short today and during the season.\"\nOn the group: \"Some are experiencing relegation for the first time so there will be a lot of emotions from them over the next few days. The lads who have been here before, we have to try and pick the young boys up. This group did incredible things last season. Nobody will want to jump ship with seven games to go. We are tight and we have just got to pull each other through now.\"\n'Defeat down to our errors'\nFT: Fulham 3-2 Liverpool\nLiverpool\nLiverpool boss Arne Slot, speaking to Sky Sports: \"That was a difficult spell of 14 minutes [three goals conceded]. Apart from [Fulham's] quality and finishing, it was mostly to do with our errors.\n\"In general we are not making many of these errors - let alone three in one game. Our second half performance was so much better but it is hard to win a game at this level if you concede three in the first half.\n\"Unfortunately we lacked time in the end to score a third. People want to make stories which is their job. Many teams find it difficult to play Fulham. The second half performance was outstanding. We had chances but in the end we lacked time.\"\n'We looked threatening every time we went forward'\nFT: Tottenham 3-1 Southampton\nTottenham Hotspur\nSpurs manager Ange Postecoglou speaking to Sky Sports: \"The first half was really good, really pleased. We were a bit sloppy with the ball in the second half. Stuff to improve on but it is a victory with three goals so positive. We looked threatening every time we went forward in the first half.\nOn Brennan Johnson: \"You want as many players in good form. Brennan is always a threat whenever he plays. He was really good today, he is always a goal threat.\"\nOn having a goal disallowed for offside: \"Once again we are waiting around for six or seven minutes at a football game which would have been unheard of a few years ago.\"\n'Southampton go down with woeful record'\nFT: Tottenham 3-1 Southampton\nStephen Kelly\nFormer Tottenham defender on BBC Radio 5 Sports Extra\nIt's a poor afternoon for Southampton. They've gone down in record time, nobody wants that reputation. They've got 10 points, they need to make sure they don't get the record of the least amount of points.\nThey were devoid of confidence in the first half. The goals they gave away were so poor.\nThis is not against a great Tottenham side at the moment, they're not in a good spell of playing electric football, so not a great game to witness but Tottenham get three points and look forward to the Europa League on Thursday.\nSouthampton go down with that woeful record of the earliest team to get relegated from the Premier League.", "url": "https://www.bbc.com/sport/live/cn4yjknz8r2t"}