{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:34:09", "date_modify": "2025-05-20 14:34:09", "date_publish": "2023-07-28 19:03:08", "description": "Steven Alker shoots a second-round 68 to lead at the Senior Open Championship as first-round leader Miguel Angel Jimenez slumps to a 76.", "filename": "sport_golf_66338931_1747751649.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/A33B/production/_130578714_gettyimages-1576327234.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_golf_66338931_1747751649.html", "title": "Senior Open Championship: Steven Alker takes lead as Miguel Angel Jimenez struggles", "title_page": "Senior Open Championship: Steven Alker takes lead as Miguel Angel Jimenez struggles - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Steven Alker shot a second-round 68 to lead at the Senior Open Championship as first-round leader Miguel Angel Jimenez slumped to a 76.\nJimenez dropped to tied-eighth as he struggled in difficult afternoon conditions at Royal Porthcawl.\nAlker, 51, leads by a shot from Germany's Alex Cejka, with Scotland's Greig Hutcheon at two under.\nVijay Singh, Paul Lawrie, Paul Broadhurst and Anders Hansen are all one under.\nFour-time champion Bernhard Langer and Colin Montgomerie lie a shot further back.\nNew Zealander Alker, the 2022 Senior PGA Championship winner, was tied third on his Senior Open debut last year and has excelled on the Champions Tour.\n\"I've had two days just plodding away, trying to take my chances when I could,\" said Alker, one of only seven players who are under par going into the weekend.\n\"It was fun. I love playing links golf and I am relishing it to be honest.\"\nLanger, who has twice won this event in Porthcawl, came back into contention thanks to a 69 on Friday, while Montgomerie shot 70.\nPadraig Harrington is one over par after an undulating round of 68 which featured six birdies, two double bogeys and an eagle on the last.\nBradley Dredge is also one over after a 72 which included six birdies as well as a quadruple bogey and a triple bogey.\nDredge is the best-placed Welshman ahead of Phil Price, who is two over, but Stephen Dodd missed the cut alongside Ian Woosnam.\nDefending champion Darren Clarke only just made it through to the weekend after a 74.", "url": "https://www.bbc.com/sport/golf/66338931"}