{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:24:41", "date_modify": "2025-05-19 15:24:41", "date_publish": "2015-02-09 14:17:13", "description": "Goals from Luke Murphy and Sam Byram give Leeds a third win in four games as they fight to avoid Championship relegation.", "filename": "sport_football_31105988_1747668281.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/80924000/jpg/_80924013_luke_murphy2_empics.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31105988_1747668281.html", "title": "Reading 0-2 Leeds United", "title_page": "Reading 0-2 Leeds United - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Second-half goals from Luke Murphy and Sam Byram gave Leeds a third win in four matches as they fight to avoid relegation from the Championship.\nMurphy's speculative long-range effort deceived Reading goalkeeper Adam Federici to put the visitors in front.\nLeeds keeper Marco Silvestri made an excellent save from Danny Williams' angled drive to prevent an equaliser.\nAnd Byram sealed the win in the last minute when nodding in unmarked at the far post from a Steve Morison cross.\nLeeds remain five points clear of the bottom three, and turned in a solid defensive performance as they bounced back from Saturday's 1-0 defeat at home to Brentford.\nNeil Redfearn's side lost Italian midfielder Tommaso Bianchi to a first-half knee injury, suffered in a collision with Williams.\nBut they came closest to scoring before the break, with Morison striking the post after Lewis Cook had broken clear to set him up.\nReading struggled to create clear chances, although Nick Blackman should have done better than put a weak header easily within Silvestri's reach from a Stephen Kelly right-wing cross.\nMurphy gave Leeds the advantage with a fierce drive from 35 yards that Federici could only help into the net, before Byram made sure of victory.\nReading manager Steve Clarke:\n\"It was a very disappointing night after having had such a good spell recently.\n\"It was not our best performance by a long way. It was not a great game, it was very scrappy, and I always felt that the first goal was going to be crucial.\n\"I'm not sure why we were so lacklustre. It was very strange and is difficult to work out. We just didn't fire tonight. But we'll not get too down. We'll put it to bed and move on.\"\nLeeds United manager Neil Redfearn:\n\"From one to 11, I thought we defended really well. We showed a real willingness and togetherness to not concede a goal.\n\"We're now 17th and it looks a lot healthier. The most important thing is that the win takes us to 35 points, which means you're nearer that 50-mark.\n\"It's also bunched a lot of clubs together. There's a lot of clubs who might have thought they were safe but might yet still get dragged into it.\"", "url": "https://www.bbc.com/sport/football/31105988"}