{"authors": ["Andrew Benson", "www.facebook.com"], "date_download": "2025-04-26 06:53:46", "date_modify": "2025-04-26 06:53:46", "date_publish": "2025-02-28 16:27:44", "description": "Lewis Hamilton says Ferrari still have work to do as his former Mercedes team-mate George Russell sets the pace on the final day of pre-season testing.", "filename": "sport_formula1_articles_cge1ndzjxrxo_1745650426.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/58f1/live/6f44b4d0-f5ee-11ef-bd6e-cd71c2e1454a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_formula1_articles_cge1ndzjxrxo_1745650426.html", "title": "F1 pre-season testing: Lewis Hamilton says Ferrari still have work to do to improve", "title_page": "F1 pre-season testing: Lewis Hamilton says Ferrari still have work to do to improve - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Lewis Hamilton said Ferrari \"definitely have some work to do to improve\" as his former Mercedes team-mate George Russell set the pace on the final day of pre-season testing.\nRussell pipped Red Bull's Max Verstappen by 0.021 seconds with a lap just five minutes before the end of the day's running.\nHamilton ended the day sixth fastest in his Ferrari, 0.8 seconds off Russell.\nWilliams driver Alex Albon was third fastest, ahead of McLaren's Oscar Piastri and Alpine's Pierre Gasly.\nHamilton said: \"It's hard to know what fuel loads everyone is running so you have to take everything with a pinch of salt.\n\"(McLaren) won the constructors' (title) last year. We expect them to be one of the quickest if not the quickest. As with Red Bull, they dominated for many years. We've definitely got some work to do to improve.\"\nHamilton, speaking before he drove in the afternoon session, was optimistic about his first pre-season test with his new team.\n\"I feel like we've built a really good foundation but these guys out there look really competitive, it looks very close,\" he said.\n\"This is the most positive feeling I've had for a long time.\"\nBut his day ended early when Ferrari curtailed his running prematurely, before he was able to complete a planned race distance.\nHamilton was nearly 0.5secs quicker than team-mate Charles Leclerc but was running a tyre compound one step softer. He also drove in the afternoon session while Leclerc went in the morning.\nPre-season testing is a notoriously unreliable indication of true competitiveness as there are so many factors that can distort the picture.\nTeams do not reveal the specification in which they were running their cars, and fuel loads and engine modes have a major impact on performance.\nIn addition, the weather conditions on Friday were very different from the day before - Friday was sunny and considerably warmer, with a stronger wind, meaning the track was slower than it had been on Thursday.\nDespite Verstappen's pace, the Red Bull looked difficult to drive, and the team were trying out different set-ups and configurations on the car, including swapping between two different front wing specifications.\nThe four-time world champion had a spin late in the day at Turn One.", "url": "https://www.bbc.co.uk/sport/formula1/articles/cge1ndzjxrxo"}