{"authors": ["Greg Playfair", "www.facebook.com"], "date_download": "2025-05-21 07:15:07", "date_modify": "2025-05-21 07:15:07", "date_publish": "2025-05-20 10:58:18", "description": "Hearts fan voice: 'Why I'm buying into McInnes vision'", "filename": "sport_articles_cpvkkmz8vk3o_1747811707.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4c48/live/28980380-3567-11f0-8519-3b5a01ebe413.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cpvkkmz8vk3o_1747811707.html", "title": "'Why I'm buying into McInnes vision'", "title_page": "Hearts fan voice: 'Why I'm buying into McInnes vision' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "If there were any Jambos sceptical about the appointment of Derek McInnes as head coach, his first press conference would have changed the opinion of the biggest cynic in Gorgie.\nThe fact McInnes spoke with real excitement when he said the Hearts job was one he always wanted, and described his aim to excite the fans like Jim Jefferies, George Burley and early Craig Levein's teams, certainly got me buying into his vision.\nThe fact he wants to make Tynecastle an uncomfortable place for opposition also earns him backing from everyone of a maroon persuasion as he rightly pointed out the mood in EH11 has been sanitised for a long time.\nMcInnes is at Hearts because he wants to win silverware, have us playing in Europe and pushing up the top of the table. He's not making bold promises publicly about splitting the Old Firm or making jibes about Hibs or former side Aberdeen, but you know that internally he'll be desperate for wins against those four sides the most.\nAlthough his job title is not manager, you feel the players will be left in no doubt who is in charge and that he won't be afraid to make difficult decisions.\nOne of McInnes' first tasks will be to resolve the future of captains Craig Gordon and Lawrence Shankland, who are both out of contract. It might sound mad to some, but I am more confident in Shankland lining up for Hearts after the summer than club legend Gordon.\nThere's reports of interest from China in Shankland but given he has a young family, I'm not sure he'd be keen to go there. I can't see him suiting the physicality of the English Championship and I don't imagine he'll have a better offer from anyone in Scotland than Hearts.\nHe might get a lifestyle move to somewhere like the MLS or Australia, but I think McInnes will convince Shankland and the club to come to a deal that works for both.\nIn terms of Gordon, I love the man. That said, he has regressed massively compared to a couple of years ago. He doesn't take charge of his penalty area like he used to and there have been a number of goals conceded because of his indecision over whether to come for a ball.\nGiven that McInnes already has another Scotland international on his books in Zander Clark and a sound deputy in Ryan Fulton, he may wish to make a decision he feels is necessary in removing any distraction prior to the new season.\nShould there be a mutual parting of the ways? There's already been no sentimentality shown in the decision to move on 'big Jambo' Liam Fox after his latest stint as interim head coach. I have a feeling Gordon may also be set for the exit.\nWhatever happens, I just hope McInnes is backed and trusted to make the right decisions for the greater good of Hearts.", "url": "https://www.bbc.com/sport/articles/cpvkkmz8vk3o"}