{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:41:13", "date_modify": "2025-04-26 06:41:13", "date_publish": "2025-03-02 12:41:57", "description": "'Really important win' puts County 'in a good position' for survival - fan views", "filename": "sport_articles_c72y3w010dlo_1745649673.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/17d3/live/f4c6a950-e325-11ef-bd1b-d536627785f2.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_c72y3w010dlo_1745649673.html", "title": "'Really important win' puts County 'in a good position' for survival", "title_page": "'Really important win' puts County 'in a good position' for survival - fan views - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "We asked for your views on Ross County's 1-0 win against Kilmarnock.\nHere's what some of you said:\nDavid: Definitely a rearguard action but the whole team contributed to success. Kacper Lopata, Jordan Amissah and Jordan White - who was everywhere and got the assist for the goal - as well as tremendous defensive clearances. I have watched the second goal but cannot see why it was disallowed. A great three points.\nShaun: A really important win for the team. We did not play our best, but Kieran Phillips showed great skill to flick the ball to Jordan, and took his chance when it came. The defence had to be strong throughout. They all did well but Lopata and Amissah were both outstanding. We are in a good position, some tough games ahead, so we need to keep grinding out points.\nDavie: An immense defensive performance or poor finishing by Killie? Who cares! After travelling down to Perth midweek I was worried about this game as Killie are so physical. They threw everything at us, and probably deserved at least a draw, but goals count, and we got it, Lopata was my man of the match.\nPaul: Resilient, strong performance, especially Amissah. When creative players like Noah Chilvers are not at their best, a good team performance was required. Great to see Alex Samuel back, he should have made an instant impact in the second goal chalked off for a dubious foul. Top six is a possibility if we can maintain and improve a little.", "url": "https://www.bbc.co.uk/sport/articles/c72y3w010dlo"}