{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:04:34", "date_modify": "2025-05-20 12:04:34", "date_publish": "2023-08-05 11:49:53", "description": "Watford ease to a dominant 4-0 win over QPR in Valerien Ismael's first game in charge of the Hornets.", "filename": "sport_football_66345298_1747742674.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2EBE/production/_130666911_gettyimages-1594178249.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66345298_1747742674.html", "title": "Watford 4-0 QPR: Valerien Ismael begins Hornets reign with big Championship win", "title_page": "Watford 4-0 QPR: Valerien Ismael begins Hornets reign with big Championship win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Watford eased to a dominant win over sorry Queens Park Rangers in Valerien Ismael's first Championship game in charge of the Hornets.\nTom Dele-Bashiru slotted in to put the hosts ahead after just 33 seconds and QPR were unable to contain their rampant opponents, who established a 4-0 half-time lead at Vicarage Road.\nImran Louza was given space 25 yards out to curl in a low shot and double the lead in the 20th minute, with Matheus Martins guiding in a looping header and Vakoun Bayo sliding home for the fourth two minutes before the break.\nIt could have been worse for the visitors, as Bayo almost made it 5-0 with a lob in first-half stoppage time and Louza rattled the crossbar with a dipping effort on the hour mark.\nThe second half was a much quieter affair with the outcome beyond doubt, although Sinclair Armstrong and Lyndon Dykes both went close to pulling a goal back.\nQPR conceded 71 goals last season - the second most in the second tier - and boss Gareth Ainsworth saw his defence continually carved apart on the opening day of the campaign.\nThe west London club finished six points above the relegation zone in 20th place in May and, with just two clean sheets in 14 matches since Ainsworth took charge in February, will need a vast improvement to avoid another struggle against the drop.\nWatford ended last season in mid-table following relegation from the Premier League and, after selling top scorer Joao Pedro to Brighton, appointed Ismael as head coach in May.\nTheir first-half performance would surely have exceeded the expectations of the former Barnsley and West Brom boss, with the first two goals going in following slick passing moves.\nAfter QPR keeper Asmir Begovic made good saves to deny Jeremy Ngakia and Wesley Hoedt, a short corner routine allowed Ken Sema to cross for Martins to make it 3-0 in the 38th minute.\nBayo then converted Francisco Sierralta's ball across the box to give Watford complete control at the break.\nGeorgian midfielder Giorgi Chakvetadze almost netted a debut goal for the Hornets after coming off the bench, while fellow substitute Ryan Andrews fired into the side-netting from a tight angle.\nWatford have only lost once on the opening day of the season over the past 17 campaigns, with that defeat a 3-0 home reverse against Brighton in 2019.\nWatford head coach Valerien Ismael told BBC Three Counties Radio:\n\"Before the game you are always nervous, because you never know what can happen.\n\"We have a lot of expectation but the boys played exactly like we expected - with a big desire and intensity, especially in the first half.\n\"It shows the quality in our squad. It was the perfect start for everyone.\"\nQPR boss Gareth Ainsworth told BBC Radio London:\n\"It is really tough conceding such an early goal and it really put Watford in control of the game.\n\"Watford looked a really good outfit and we don't know if we have just played a promotion favourite or whatever.\n\"We have got to be more solid. First half we weren't good enough but second half I thought the shape changed and made us more competitive.\n\"We are billed as [finishing] bottom of the league and we have got beaten 4-0. Everyone is getting it right so far, but we are going to buck this trend and start winning some games.\"", "url": "https://www.bbc.com/sport/football/66345298"}