{"authors": ["Freddie Pye", "www.facebook.com"], "date_download": "2025-05-21 07:46:21", "date_modify": "2025-05-21 07:46:21", "date_publish": "2025-05-20 11:36:16", "description": "Man City news: What does a successful summer look like without Wirtz?", "filename": "sport_football_articles_cg4v1plx6qno_1747813581.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b73a/live/07616130-b62d-11ee-beb5-e1400df560f2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cg4v1plx6qno_1747813581.html", "title": "What does a successful summer look like without Wirtz?", "title_page": "Man City news: What does a successful summer look like without Wirtz? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "After Kevin d Bruyne's exit was confirmed, Bayer Leverkusen's Florian Wirtz was identified as an ideal successor.\nThe Germany international was flown in for talks with Manchester City officials having spoken with Pep Guardiola according to some reports, only for it all to break down this week.\nThat is according to BBC Sport's Sami Mokbel, who revealed that City bosses have taken the decision to withdraw their interest amid the rising costs of a potential deal soaring towards 300m euros inclusive of transfer fees and wages.\nUnderstandably, that has left many City supporters showing feelings of disappointment, fear, and anger when looking towards the future without their legendary Belgian creator or the ideal replacement for such a figure within the playing squad.\nBut can club officials still get things right in the market?\nOf course they can. Perhaps there has been a change of thinking, a feeling that funds are required in more areas than they originally thought when committing a top-level investment to Wirtz, or has Pep Guardiola himself had a change of heart when it comes to the creative centre of his operation ahead of the new season.\nThey're all talking points that will likely be answered over the coming weeks as transfer plans continue to take shape.\nBut come the end of the market and before the new season, if City were to bring in further defensive reinforcements in the way of two new full-backs, as well as two versatile 'number eight' operators with the much-needed legs to fuel an energetic midfield so often missed this season, surely the future still looks bright?", "url": "https://www.bbc.com/sport/football/articles/cg4v1plx6qno"}