{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:39:53", "date_modify": "2025-05-21 06:39:53", "date_publish": "2025-03-31 07:23:57", "description": "Aston Villa news: Nigel Reo-Coker on Marcus Rashford's FA Cup double", "filename": "sport_football_articles_cy5r46e7glxo_1747809593.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/26e5/live/079071d0-0df9-11f0-adb0-953662d344b5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy5r46e7glxo_1747809593.html", "title": "Aston Villa news: Nigel Reo-Coker on Marcus Rashford's FA Cup double", "title_page": "Aston Villa news: Nigel Reo-Coker on Marcus Rashford's FA Cup double - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "\"If you had to pick a player to be the story of the FA Cup weekend, then it has to be Marcus Rashford,\" former Aston Villa midfielder Nigel Reo-Coker told BBC Radio 5 Live's Football Daily podcast.\nThe on-loan forward broke his four-month drought by scoring twice for Villa at Preston on Sunday and left the field to a standing ovation from supporters who are fully on board with what he is bringing to their team.\n\"Rashford has received a lot of criticism since leaving Manchester United and going to Aston Villa, but he is now back in the England fold, and the two goals on Sunday will have done him a world of good,\" Reo-Coker said.\n\"I like the fact he is talking about getting into games and rhythm because that does not happen overnight. It can sometimes take a run of five or six games to get that strength and belief in yourself and he seems to be getting there.\n\"It is nice to hear him saying he is enjoying his football and see him playing with a smile on his face.\n\"He has come into a team that has good leadership and solid foundation and he has come to be part of the team. All the pressure and emphasis isn't just on Rashford.\n\"We know the ability he has but he has to find that fire now to go and do that week in, week out. He has got that in him but it just needs to come to the forefront.\"", "url": "https://www.bbc.com/sport/football/articles/cy5r46e7glxo"}