{"authors": ["Adam Lanigan", "www.facebook.com"], "date_download": "2025-05-21 03:59:06", "date_modify": "2025-05-21 03:59:06", "date_publish": "2025-04-07 07:57:01", "description": "Josh Ward-Hibbert was a Grand Slam tennis winner as a junior and is now chasing European basketball glory with Newcastle Eagles.", "filename": "sport_articles_c62x962xd0po_1747799946.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3e14/live/4a509c10-139f-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c62x962xd0po_1747799946.html", "title": "Josh Ward-Hibbert: From junior Grand Slam champion to basketball trophy-gatherer", "title_page": "Josh Ward-Hibbert: From junior Grand Slam champion to basketball trophy-gatherer - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Few of us sports enthusiasts can claim to have mastered one sport. Josh Ward-Hibbert has conquered two.\nThe man himself refutes that idea, preferring to describe himself as \"blessed\", but the evidence is clear.\nA Grand Slam tennis champion as a junior, Ward-Hibbert has gone on to become a Great Britain international at basketball.\nNow 31, Ward-Hibbert is a key part of the Newcastle Eagles basketball team aiming to conquer new ground in Europe, thrilled at what life has given him.\n\"I feel blessed,\" he told BBC Sport.\n\"There are lots of super-talented people who play some sports and you hear commentators say, 'That kind of athleticism, they could be good at this or this.'\n\"My parents and coaches made it possible for me to do both.\"\nOn Tuesday, Ward-Hibbert's sporting journey has him to Bratislava in Slovakia as the Eagles compete in the European North Basketball League Final Four.\nNewcastle play Polish side Dziki Warsaw in the semi-final, with the chance to face either Inter Bratislava or Romanian side CSO Voluntari in the final.\nBoth the Eagles and Ward-Hibbert have a raft of domestic winners' medals, but winning a European trophy is a new frontier, and they are determined to add to their legacy.\nIt is further proof of how the Mansfield-born athlete has been excelling since he was young.\nGrowing up, Josh's life was packed with sport. Parents Michael and Shelley would be ferrying him from tennis practice to the basketball court most nights a week.\nThey did not pressure him to pick one over the other, while coaches worked to accommodate each sport.\nHe had been part of the England Under-16 basketball team, but when the time came to choose, he opted for tennis.\nClose friendships were formed as Ward-Hibbert travelled the world playing tennis, and in 2012 he reached the pinnacle as he teamed up with Liam Broady to win the Australian Open junior doubles title.\nWard-Hibbert turned professional and won one singles title and 13 doubles titles on the ITF Futures circuit, including five with Broady and four with Lloyd Glasspool, another who is now a regular on the main ATP doubles circuit.\nBut he struggled to progress beyond that, and at 22 he decided to step away from tour life to go to Loughborough University to further his education.\n\"There were a few things that happened in my personal life, and I had a little injury that kept recurring and was not going away how I wanted it to,\" he said.\n\"Everything just combined to put me to a tipping point.\n\"Tennis is a super-tough sport, physically and mentally. You are always travelling, you are constantly living out of a suitcase.\n\"No matter where it is, you have got to live it. It's difficult, it's very much a lifestyle, 45, 50 weeks of the year.\"\nBut Ward-Hibbert would not be without his tennis career.\n\"It is an amazing sport. There were so many highs, it taught me so much as a person, and the kind of person I am today is from the journey I had.\n\"I'm definitely glad I had that journey. It would be remiss not to say I wish I had got to world number one, but that wasn't in my path.\n\"I got to win a Grand Slam with one of my closest friends still to this day. That is a memory I am never going to forget.\"\nWard-Hibbert had not played any basketball for a few years, but while at university, his love was rekindled.\nFrom playing a few games for Derby Trailblazers to getting his eye back in with a friend who had come over from America, he was recruited by the Leicester Riders in the British Basketball League.\n\"I just wanted to figure out my next move and the basketball thing just fell,\" he said.\n\"I picked up the ball and just ran with it, and I've been running ever since. I kept having opportunities and big decisions to make and a lot of positive things have happened from that.\n\"I love basketball the same as I love tennis, so it was going from one love to another love.\"\nFrom that point, success and Ward-Hibbert, who measures 6ft 5in (1.96m) in height, have gone hand in hand.\nHe picked up seven trophies with the Riders and then three more from a stint with London Lions before heading north to join the Eagles in 2023.\n\"I always believed in myself as a basketball player,\" he said.\n\"I believed I had good ability, kept working hard and doing the best thing I could whilst also studying, and a lot of great things happened.\n\"I've represented my country, I've got a lot of accolades and trophies in the British game, and hopefully there are plenty more to add, too.\"\nWard-Hibbert's love for both sports is clear. And when basketball takes a break in the summer, he will still be tempted to pick up a tennis racket and send down a few serves.\nBut which is better? Winning as an individual or being part of a winning team?\n\"Winning something amazing and celebrating in the locker room with all the guys in basketball is an unbelievable feeling,\" he said.\n\"That is special, but then you have a long, gruelling tennis match and the second after winning that last point to win the match, that feeling is pretty unrivalled.\n\"Tennis is an individual sport but there is so much camaraderie in it with your coach, physio, strength and conditioning coach, other players you are travelling with.\n\"Regardless of what was happening, if I wasn't playing, I always wanted to see my friends do well and I am pretty sure it was vice versa.\n\"There was so much camaraderie and a real team aspect to it. It's the same with basketball, but on the flip side, a lot of players have probably been on teams where there is not a lot of camaraderie and felt solo and isolated.\n\"It's an interesting debate, but for me it's completely situational.\"", "url": "https://www.bbc.com/sport/articles/c62x962xd0po"}