{"authors": ["Ethan Hampton", "www.facebook.com"], "date_download": "2025-04-26 03:55:48", "date_modify": "2025-04-26 03:55:48", "date_publish": "2025-03-04 15:47:01", "description": "Dundee fan voice: Will Dark Blues pay for 'massive missed opportunity'?", "filename": "sport_articles_c70wxn2q487o_1745639748.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/707b/live/dffe2a20-f90a-11ef-896e-d7e7fb1719a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_c70wxn2q487o_1745639748.html", "title": "Dundee fan voice: Will Dark Blues pay for 'massive missed opportunity'?", "title_page": "Dundee fan voice: Will Dark Blues pay for 'massive missed opportunity'? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "After a frustrating loss at Motherwell in which Dundee were second best in every department, we stopped the rot of defeats with a draw against St Johnstone - but it was a massive missed opportunity.\nSt Johnstone will be relieved to keep Dundee within reach, but for us, the bigger concern is that if we can't beat the team at the bottom of the league at home, who can we beat?\nMuch like the Motherwell game I am annoyed at how little we gave Andy Fisher in the St Johnstone goal to do. After Simon Murray's equaliser, Fisher was tested just once more, with a volley down the middle in injury time.\nAs stressed many times this season, playing teams out of form is never an advantage for us and it's difficult to see where things will turn around for Dundee.\nI am more than familiar with the patterns that emerge with relegated sides, and at the moment I feel very uneasy with what I am watching.\nTo make things worse St Johnstone will carry unbeaten momentum. With a favourable tie in the Scottish Cup quarter-finals I expect them to have a massive morale boost of a cup run to coincide with their league form.\nCesar Garza and Joe Shaughnessy are among the few players who can hold their head high with their displays on Saturday. Garza fought for everything and Shaughnessy's leadership has been dearly missed.\nMeanwhile our next game is at Tynecastle in the Scottish Cup on Friday night.\nI'd like to think form goes out the window when it comes to knockout football but I'm not convinced this team have what it takes to rise to the occasion.\nThere is talk from the players that they're eager to get one back on Hearts for the massacre at Dens last month. Yet I've spent all season listening to them declare they're ready to react to disappointing results and time and again those promises have amounted to nothing.\nLawrence Shankland loves scoring against Dundee - he has netted 10 in just 15 matches against us. While Shankland has scored just four goals in the league this season, three of them were against Dundee.\nCoupled with our shambolic defensive record, I sense the outcome on Friday is very predictable.", "url": "https://www.bbc.co.uk/sport/articles/c70wxn2q487o"}