{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:23:05", "date_modify": "2025-05-20 12:23:05", "date_publish": "2023-08-04 14:24:33", "description": "Leeds forwards Patrick Bamford, Georginio Rutter and Mateo Joseph are out of their season opener against Cardiff.", "filename": "sport_football_66407920_1747743785.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/AA55/production/_130650634_gettyimages-1252784239.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66407920_1747743785.html", "title": "Patrick Bamford, Georginio Rutter and Mateo Joseph out of Leeds opener", "title_page": "Patrick Bamford, Georginio Rutter and Mateo Joseph out of Leeds opener - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Leeds have been hit with the loss of three forwards as they prepare for their Championship opener against Cardiff.\nPatrick Bamford, Georginio Rutter and Mateo Joseph are all unavailable, manager Daniel Farke revealed, as his team seeks to bounce back from relegation last season.\nWith Tyler Adams, Jack Harrison and Stuart Dallas also sidelined by injury, Farke's squad is depleted for the Elland Road match.\nBamford and Rutter were both injured in a friendly win over Hearts at the weekend, and Joseph was expected to be promoted as cover.\nThe England under-20 international has also been ruled out after picking up an injury in training this week.\nFarke told BBC Radio Leeds: \"Patrick Bamford has got a hamstring injury and won't return before the first international break so he will definitely miss the next games.\n\"Georginio Rutter looks slightly better. He has a core injury but will definitely miss the game on Sunday and also the next cup game.\n\"We hope he will then return as quickly as possible and will be able to play a few games before the international break.\n\"Also bad news is Mateo Joseph because he rolled his ankle on Wednesday in training. We feared a lot and he was on crutches yesterday, but it looks better right now than it was two to three days ago.\n\"He will definitely miss the next four weeks. It's ligament damage but no surgery is needed.\"", "url": "https://www.bbc.com/sport/football/66407920"}