{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 08:06:36", "date_modify": "2025-04-26 08:06:36", "date_publish": "2025-02-26 14:34:09", "description": "Arsenal news: David Seaman backs Mikel Arteta but says side need striker to progress", "filename": "sport_football_articles_cevxelzg797o_1745654796.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0d19/live/8f1579f0-f438-11ef-8b93-e929161a3c61.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cevxelzg797o_1745654796.html", "title": "Arsenal news: David Seaman backs Mikel Arteta but says side need striker to progress", "title_page": "Arsenal news: David Seaman backs Mikel Arteta but says side need striker to progress - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Former Arsenal goalkeeper David Seaman is refusing to give up hope on the Gunners' chance this season but accepts that getting a striker would be the \"final piece of the jigsaw\".\n\"We always needed a striker. We tried in the transfer window and now hopefully there is one lined up in the summer, but that will be a bit too late,\" Seaman told BBC Radio 5 Live Breakfast.\n\"We have been playing this type of football for a long time and [getting a striker] will be the final piece of the jigsaw. That will hopefully be what makes it [winning the Premier League title] happen next season.\n\"I am privileged that I go into Arsenal once a week and I see the players training. The way Mikel works, he is getting the best out of his players. The whole training ground is all together.\n\"I would definitely not go down that route [of changing manager] because we are getting better and better. We are now serious contenders for the league, we have a good chance in the Champions League and it is a progression.\n\"The next step to that is getting a striker.\"\nArsenal fan and YouTuber Charlene Smith believes the club's owners need to take responsibility for the title challenge fading.\n\"I feel like injuries are out of our control, but I do feel like we needed to do business in the January transfer window,\" she said. \"We have needed a striker for so long and we have released a lot of players but have not replaced those we let go.\n\"They need to take ownership of that and accept we should have got more players in. If we had, the season could have been looking a lot different.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cevxelzg797o"}