{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:57:50", "date_modify": "2025-05-20 14:57:50", "date_publish": "2023-07-27 06:35:05", "description": "Newcastle: Players 'battled fatigue' in Chelsea draw - Howe", "filename": "sport_articles_clwz92dge8eo_1747753070.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d00e/live/616bff50-2c44-11ee-b1d7-8fdc93c2782e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_clwz92dge8eo_1747753070.html", "title": "Newcastle: Players 'battled fatigue' in Chelsea draw", "title_page": "Newcastle: Players 'battled fatigue' in Chelsea draw - Howe - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Newcastle boss Eddie Howe praised his side for a \"gritty performance\" in Wednesday night's 1-1 pre-season draw with Chelsea in Atlanta.\nA strong XI featuring new signing Sandro Tonali started the game, with 17-year-old Lewis Miley playing 90 minutes alongside the Italian in midfield.\n\"That was the first thing I said after the game,\" Howe said.\n\"We worked the players really hard this week so they battled fatigue.\n\"It was a battled, gritty performance.\"\nMiguel Almiron equalised late in the first-half for the Magpies after Nicolas Jackson has opened the scoring for the Blues and Howe was happy with the Paraguayan's impact.\n\"Amazing moment for Miggy,\" he added.\n\"The goal itself was a good one. He showed his pace and took it really well.\n\"He doesn't communicate loads with us but he communicates through smile and body language.\"\nHowe also singled out Miley for praise, stating his belief the academy graduate is ready for first-team football.\n\"We've felt that way for a while with Lewis but the thing is his age, we’ve tried to protect him a bit.\n\"He’s shown he can play with a crowd which is not always a given.\n\"The plan has been a consistent one. He will stay with us. He’s too young for that (a loan) at the minute, he needs to stay with his family.\n\"Physically it's always the test for someone so young. He’s a very good athlete - strong, good size and shown he can cope with it.\"", "url": "https://www.bbc.com/sport/articles/clwz92dge8eo"}