{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:34:48", "date_modify": "2025-04-26 07:34:48", "date_publish": "2025-02-27 15:22:28", "description": "Arsenal news: Who could play upfront?", "filename": "sport_football_articles_c14jjk2y327o_1745652888.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5d3b/live/1f6debb0-f4ff-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c14jjk2y327o_1745652888.html", "title": "Arsenal news: Who could play upfront?", "title_page": "Arsenal news: Who could play upfront? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Injuries have decimated Arsenal's front line and all the talk is about who should be on Mikel Arteta's shopping list in the summer.\nBut there are still 11 Premier League games and a Champions League campaign to navigate first.\nArteta has tried Leandro Trossard up front, experimented with Mikel Merino and seen Raheem Sterling struggle in his cameo roles. So who else is left?\nProbably the most likely is Nathan Butler-Oyedeji, the 22-year-old who made his debut in the dying ebbs of January's Champions League win over Dinamo Zagreb.\nDeployed mainly on the left but also at centre-forward, Butler-Oyedeji has 20 goals in 60 games for Arsenal Under-21s and has been on the bench for seven of the past eight Premier League games.\nArteta has yet to turn to him however, despite the Gunners' desperate need for goals in recent matches - but he may have to.\nAccompanying Butler-Oyedeji in the dugout at the City Ground on Wednesday night was 19-year-old Ismeal Kabia, a Dutch winger who only has eight starts in Premier League 2.\nHe made his first-team bow against Bolton in the Carabao Cup earlier this season and did score at Leyton Orient in the EFL Trophy too. However, he certainly would not fit the profile of a central striker.\nPerhaps Jamaica striker Khayon Edwards is worth a go. Top scorer in Premier League 2, he has nine goals in 12 games this season including six in his past seven.\nAt least the 21-year-old knows where the back of the net is, although his loan spell at Leyton Orient last season where he only started four games yielded no goals and no assists.\nFans could be forgiven for wistfully looking at Chido Obi-Martin who swapped Arsenal Under-18s for Manchester United earlier this season after smashing 32 goals in 21 games for the academy side and has already made two senior appearances for the Red Devils.\nNo solution is perfect but successive blanks against West Ham and Nottingham Forest prove something has to be done.\nAnd, after all, the success of Myles Lewis-Skelly and Ethan Nwaneri this season has showcased the talent in Arsenal's academy. Can Arteta find another one?", "url": "https://www.bbc.co.uk/sport/football/articles/c14jjk2y327o"}