{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:26:46", "date_modify": "2025-05-21 07:26:46", "date_publish": "2025-01-22 12:56:32", "description": "Josh Brookes is to join Paul Jordan in making up the Jackson Racing Honda team to compete at the 2025 North West 200 and Isle of Man TT.", "filename": "sport_motorsport_articles_cdxevlyz6lno_1747812406.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c743/live/b6278090-d8bf-11ef-a303-a344a2a81285.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_motorsport_articles_cdxevlyz6lno_1747812406.html", "title": "Josh Brookes: Australian double British Superbike champion to ride for Jackson Racing Honda at NW200 & IOM TT", "title_page": "Josh Brookes: Australian double British Superbike champion to ride for Jackson Racing Honda at NW200 & IOM TT - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Josh Brookes is to join Northern Ireland's Paul Jordan in making up the Jackson Racing team at the North West 200 and Isle of Man TT international road races in 2025.\nThe team-mates will have Honda machinery at their disposal for the Superbike, Superstock and Supersport races.\nBrookes, 41, is a double British Superbike champion who previously held the lap record for the Triangle circuit at the North West and last year finished second in the Senior TT after setting his fastest ever lap of the Mountain Course at 134.056mph.\nThe Australian, who will race for DAO Racing Honda in this year's BSB series, did not race at the North West in 2023 and 2024 so will be making his return to that event.\n\"With racing a Honda in BSB this season, I wanted to keep that continuity at the roads,\" said Brookes.\n\"The team [Jackson Racing] have got good bikes and equipment and are very eager to make the right steps to not only give me the best but also the whole team.\n\"I think that's quite important, and it gives me confidence that they're motivated to keep pushing forward, so it seemed like the right move.\"\nJordan finished four of his five races inside the top 12 at the TT in 2024, setting personal best times on his three Jackson Racing machines.\nHe also achieved a series of top-six finishes at the NW200 last May.\n\"After a good first season together, it feels great to be continuing with Jackson Racing for 2025; there's nothing I would change with the team set-up - the atmosphere is brilliant,\" said Jordan.\nI know there's room for improvement and I want to keep moving forward and edge ever closer to the front runners.", "url": "https://www.bbc.com/sport/motorsport/articles/cdxevlyz6lno"}