{"authors": ["Clive Lindsay", "www.facebook.com"], "date_download": "2025-04-26 07:52:01", "date_modify": "2025-04-26 07:52:01", "date_publish": "2025-02-25 14:39:46", "description": "Barry Ferguson is confident fans will see a Rangers team with greater \"energy\" and \"a bit of desire\" when he makes his debut as head coach against Kilmarnock on Wednesday.", "filename": "sport_football_articles_cpwdxd0q9yjo_1745653921.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e555/live/ec0cf2d0-f38b-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cpwdxd0q9yjo_1745653921.html", "title": "Rangers: Barry Ferguson promises energy and desire from Ibrox side", "title_page": "Rangers: Barry Ferguson promises energy and desire from Ibrox side - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Barry Ferguson is confident fans will see a Rangers team with greater \"energy\" and \"a bit of desire\" when he makes his debut as interim manager against Kilmarnock on Wednesday.\nSpeaking at his first media conference since being appointed until the end of the season after Sunday's sacking of Philippe Clement, the former Rangers captain insisted he is not looking to the future beyond the visit to Rugby Park.\nThe Belgian exited after successive home defeats by second-tier Queen's Park in the Scottish Cup and St Mirren in the Premiership.\nFerguson says some players may \"need an arm around them\", while others may need \"a clip around the ear\" to improve performances and results.\n\"I was straightforward with the players,\" he said. \"This is a brilliant place to be. You're lucky to be here. Look at the facilities, look at the stadium.\n\"I feel like it's going to be a good place to be. I felt a difference today and it's important for me to carry that on.\n\"I need to get a kick out of these guys and they certainly gave me a reaction this morning. I couldn't have asked more of them.\"\nFerguson has been out of coaching for three years since leaving part-timers Alloa Athletic, and admitted he was \"surprised I got the call\".\nHe had most recently being working as a Rangers club ambassador and had no thoughts about returning to front-line football, but said: \"It only took five mins to agree to become interim manager.\n\"Everyone is entitled to their opinion. I have no issue with that. I would rather be judged come the end of the season, but I know I will be judged game by game.\n\"This is the nature of the beast here at Glasgow Rangers.\"\nFerguson \"can't wait to be on the touchline\" at Rugby Park on Wednesday but admits he has not had much time with his players to prepare for a visit to a venue where they lost in October.\n\"I've only had one training session but I'm not going to use that as an excuse,\" he added.\n\"We've not filled them with too much info because it's too short notice, but they understand the way we're going to go.\n\"I expect them to win games of football and give me everything they've got. They fully understand my expectations of them.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cpwdxd0q9yjo"}