{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:38:33", "date_modify": "2025-04-26 04:38:33", "date_publish": "2025-02-28 10:27:50", "description": "West Ham midfielder Tomas Soucek says he did not do his trademark helicopter celebration after scoring against Leicester on Thursday out of respect for their late owner.", "filename": "sport_football_articles_c05mm470jy8o_1745642313.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e84f/live/8e8afbd0-f5ba-11ef-8c2a-43d22b661d81.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c05mm470jy8o_1745642313.html", "title": "Tomas Soucek: West Ham midfielder refrained from traditional celebration out of respect for Leicester", "title_page": "Tomas Soucek: West Ham midfielder refrained from traditional celebration out of respect for Leicester - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "West Ham midfielder Tomas Soucek says he did not do his trademark helicopter celebration against Leicester on Thursday out of respect for the opponents.\nFormer Leicester owner Vichai Srivaddhanaprabha and four others died in a helicopter crash after a match against West Ham at the King Power Stadium in 2018.\nSoucek scored the opener on Thursday at the London Stadium as the Hammers went on to record a 2-0 victory.\nThe Czech usually puts his arms out at his side and spins around - similar to the motion of a helicopter rotor.\nBut Soucek, who also turned 30 on the day of the game, said: \"I didn't think my normal helicopter celebration was the right thing to do, because of what happened to the Leicester owner.\n\"I wanted to celebrate my goal with my team, but I also wanted to show respect to our opponents.\"\nSrivaddhanaprabha bought Leicester in 2010 for £39m and the club gained promotion to the Premier League four years later.\nUnder his leadership, the Foxes then defied odds of 5,000-1 to win the top-flight title in 2015-16 for one of the greatest sporting stories.", "url": "https://www.bbc.co.uk/sport/football/articles/c05mm470jy8o"}