{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:31:12", "date_modify": "2025-05-21 07:31:12", "date_publish": "2025-03-29 00:00:00", "description": "Watch live coverage of Snowboard, Freestyle and Freeski World Championships from St Moritz, Switzerland.", "filename": "sport_live_c3w1626exw9t_1747812672.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5575/live/1ac65bb0-0cb0-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_live_c3w1626exw9t_1747812672.html", "title": "Snowboard, Freestyle and Freeski World Championships LIVE: Watch coverage from St Moritz, Switzerland", "title_page": "Snowboard, Freestyle and Freeski World Championships LIVE: Watch coverage from St Moritz, Switzerland - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Who's in action today?\nBBC Sport\nUSA's double Olympic champion in the snowboard halfpipe Chloe Kim returned from a break from the sport in 2022-23 and looks rejuvenated. With an array of new moves and a happier outlook on life, the 2025 X Games champion will be a star of the show.\nMeanwhile in the Men's Snowboard half pipe, Japan's Olympic champion Hirano Ayumu will not compete against his compatriot Hirano Ruka. Ayumu won gold at the Beijing 2022 Winter Olympics while Ruka's only Olympic accolade comes in the form of an appearance at the 2020 Winter Youth Olympics, where he won the gold medal in the halfpipe event.\nAustralian Scotty James looks to regain his place after claiming silver in 2021, having previously won gold in 2019, 2017 and 2015.\nHow to get into winter sports\nGet Inspired\n#GetInspired\nSkiing\nYou fix on a pair of skis to your feet, whilst wearing special boots, and glide down a slope. Many people in the United Kingdom learn the basics of alpine skiing on dry ski slopes or at indoor snow centres, which offer lessons and equipment rental.\nFind your local centre in England,, external Wales, external or Scotland, external to get yourself on the slopes. The Ski Club of Northern Ireland has a useful Facebook page, external too. There's also loads of information at Disability Snowsport, external for anyone looking for inclusive skiing.\nSnowboarding\nSnowboarding will give you an adrenaline rush of speed and you can learn how to do tricks. If you like the cold and being outdoors - although there are indoor slopes all over the country - then give it a go.\nFind your nearest club in England,, externalScotland,, externalWales, external or Northern Ireland., external", "url": "https://www.bbc.com/sport/live/c3w1626exw9t"}