{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:25:13", "date_modify": "2025-05-21 06:25:13", "date_publish": "2025-02-09 00:00:00", "description": "Watch Bradford Bulls v Castleford Tigers in the third round of the Challenge Cup, plus listen to local BBC radio commentaries as North Wales Crusaders play Widnes Vikings and Oldham take on Barrow Raiders.", "filename": "sport_rugby-league_live_c5y78ydkvr6t_1747808713.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-league_live_c5y78ydkvr6t_1747808713.html", "title": "Challenge Cup LIVE: Bradford Bulls v Castleford Tigers, North Wales Crusaders v Widnes Vikings & Oldham v Barrow Raiders", "title_page": "Challenge Cup LIVE: Bradford Bulls v Castleford Tigers, North Wales Crusaders v Widnes Vikings & Oldham v Barrow Raiders - watch, score & radio commentary - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Noble plots big-time return for ambitious Bradford\nThird Round: Bradford Bulls v Castleford Tigers (13:00 GMT)\nThere was a time where Brian Noble would not even set foot in Odsal Stadium.\nHe had played just short of 400 first-grade games for Bradford, won championships, captained the club, and notably coached the club to a period of unprecedented success.\nAfter departing during the 2006 season, there was nothing. On the advice of a mentor he severed contact.\nUntil his epiphany.\n\"I went back and I looked at the ground where I'd played all those games from colts upwards and I thought 'this is where you live, this is your home, this is your turf',\" Noble told BBC Sport.\nIt persuaded the 63-year-old to invest his time and years of expertise into his hometown club, first, in an advisory role.\nEamon O'Carroll's decision to step down and move to St Helens as part of Paul Wellens' staff prompted a decision to be made this past autumn, and led to Noble's startling return as head coach for the first time in 20 years.\n\"It was about time I put something back into it,\" Noble said.\n\"I was kind of pushing behind the scenes to go for it and let's establish ourselves a good team, we've made progress with lots done and there's lots to do, and with Eamon wanting to jump back into full-time at St Helens there was a chance the progress could have been de-stabilised.\"Read this in full on the BBC Sport website and app.\nWho's in action?\nBBC Sport\nIt’s time for the Super League teams to enter the Challenge Cup this weekend as the 2025 competition reaches the third round, and BBC Sport will be bringing you coverage Castleford Tigers as they make the short trip to former Super League side Bradford Bulls this Sunday, with coverage live from 12:50pm.\nBoth clubs have a rich history in the competition, with the last of Bradford’s five Challenge Cup triumphs coming in 2003 at the Millennium Stadium in Cardiff. Castleford last won the cup at Wembley in 1986, but reached the final as recently as 2021.\nBrian Noble, who was in charge of that last cup triumph for Bradford in 2003 against Leeds Rhinos, has returned to the Bulls as head coach as they plot a return to the Super League. Meanwhile the Tigers have appointed Danny McGuire, a member of the Leeds team beaten by Bradford in 2003, and a serial trophy winner himself.\nThe two sides haven’t faced each other since 2014 when the Bradford were last in the top flight, can the Bulls cause one of their renowned Challenge Cup upsets on Sunday?\nHow to get into rugby league\nBBC Sport\nRugby league is a fast and dynamic game, which involves great strength, stamina and skill, and is played through the summer, so no muddy pitches, or cold, wet training nights!\nWith so many variations, you don't have to play the full version of the game to be part of it. Whatever your age, gender, fitness level or technical ability there is a version of rugby league that will suit you.\nPlaying rugby league has many benefits, including keeping fit, meeting new people and maybe even progressing to a higher level.\nAlthough rugby league shares similarities with rugby union, it is important to see them as different games, and as such, each has its own unique set of skills. Look at the rules to get a feel for the game., externalInteresting in taking part? Find your local club by using the RFL's club finder, external.", "url": "https://www.bbc.com/sport/rugby-league/live/c5y78ydkvr6t"}