{"authors": ["Emma Sanders", "www.facebook.com"], "date_download": "2025-05-20 12:16:57", "date_modify": "2025-05-20 12:16:57", "date_publish": "2023-07-24 12:42:46", "description": "Alexandra Popp scored twice in Germany's Women's World Cup win over Morocco - but it was her goal celebration which caught the eye.", "filename": "sport_football_66290078_1747743417.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/EFD7/production/_130499316_gettyimages-1550638967.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66290078_1747743417.html", "title": "Women's World Cup 2023: Alexandra Popp and the ET goal celebration", "title_page": "Women's World Cup 2023: Alexandra Popp and the ET goal celebration - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Germany captain Alexandra Popp burst into this summer's Women's World Cup with two goals in their opening victory over Morocco - but it was one of her goal celebrations which caught the eye.\n\"ET phone home\" is the famous quote from the popular science fiction film released in the 1980s, and Popp brought out her inner alien in Melbourne when her brace helped Germany to a 6-0 thrashing.\nAfter acrobatically heading in her second goal from a corner before half-time, Popp pointed to the sky, smiled and pretended to be on the phone - just like the alien in the film ET.\n\"The gesture I used to celebrate my goal comes from ET when he wants to phone home,\" said Popp. \"I phone home because we're a long way from home.\n\"It's not just for those who sit in front of the TV, but also for the people who can't be with us any more and are very important to me. It shows that I think of them.\"\nPopp may be a long way from friends and family in Germany, but she looked at home in their opening match of Group H, putting down an early marker in the quest to win the Golden Boot.\nThe captain, who was a standout performer at Euro 2022 before injury in the warm-up ruled her out of the final defeat by England, has had a strong season with Wolfsburg, impressing en route to the Champions League final.\nAnd she hopes her injury worries are behind her as she attempts to lead Germany to a third world title in Australia and New Zealand.\n\"I'm happy that I've been healthy all year. It is incredibly important and has given me a lot of strength,\" said Popp.\n\"This match was really important of us to start this way.\n\"Of course not everything went perfectly - that would have been too much to ask in the first match - but how we played and created opportunities gives us a lot of confidence for the rest of the tournament.\"\nPopp scored six goals in last year's Euros and was only beaten to the Golden Boot by England's Beth Mead, who had four additional assists. So what tally is Popp targeting this time around?\n\"I haven't set myself a goal on how many I will score. I want to reach the final and win. Apart from that I'm just happy,\" said Popp.\n\"These two goals are obviously a great boost and support my confidence. I hope I can continue this way and will be able to support my team. But I don't really care who scores as long as we do.\n\"I always hope we will have at least one more goal than our opponents.\"\nGermany manager Martina Voss-Tecklenburg was pleased with what she saw in their opening match, but said there were still \"details\" to improve on and praised Popp's contribution.\n\"That our goalscorer is also our captain is great. She knows she can score from the crosses and we know how our team plays,\" said Voss-Tecklenburg.\n\"Wherever she plays, she is a great leader, a great captain and one of the very best. She is also a team player.\n\"We don't just have Alex but a lot of other players who take on responsibility. It's a really important aspect of our team. But I'm so happy that Alex is with us because she is great.\"", "url": "https://www.bbc.com/sport/football/66290078"}