{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:39:50", "date_modify": "2025-05-19 14:39:50", "date_publish": "2017-07-04 09:22:30", "description": "Athletics chiefs hoping to reinstate testosterone limits for female athletes produce new research to support their case.", "filename": "sport_athletics_40491036_1747665590.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/10657/production/_96795176_chand_getty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_athletics_40491036_1747665590.html", "title": "Athletics: Gender tests study 'shows female testosterone advantage'", "title_page": "Athletics: Gender tests study 'shows female testosterone advantage' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Gender tests for female athletes with high levels of testosterone could be reinstated after a new study found it gave them a \"competitive advantage\".\nAthletics' governing body the IAAF commissioned the research because it wants to prove it was right to test women with hyperandrogenism.\nIt wants to reinstate rules limiting how much testosterone female athletes can have in their bodies.\nThe Court of Arbitration for Sport (Cas) suspended the rules in July 2015.\nThe Cas suspension was for two years, giving the IAAF until July 2017 to prove its case.\nThe new research by doctors Stephane Bermon and Pierre-Yves Garnier has been published in the British Journal of Sports Medicine.\nIt is based on analysis of samples taken from 2,127 elite male and female athletes from the 2011 and 2013 World Championships.\nIt concludes high testosterone levels give a \"significant competitive advantage\" in the 400m, 400m hurdles, 800m, hammer throw, and pole vault events in particular.\nCas had made the ruling after clearing Indian sprinter Dutee Chand to race, in a decision which questioned the validity of so-called gender tests around naturally high testosterone levels in female athletes.\nChand took the case to Cas after being banned following a failed a hormone test, with her legal team arguing the ruling was discriminatory and flawed.\nIn challenging the decision, the IAAF will use the evidence from Bermon and Garnier's study.\n\"Our starting position is to defend, protect and promote fair female competition,\" said Bermon.\n\"If, as the study shows, in certain events female athletes with higher testosterone levels can have a competitive advantage of between 1.8%-4.5% over female athletes with lower testosterone levels, imagine the magnitude of the advantage for female athletes with testosterone levels in the normal male range.\n\"This study is one part of the evidence the IAAF will be submitting to Cas regarding the degree of performance advantage that hyperandrogenic female athletes enjoy over female athletes with normal testosterone levels.\n\"We continue to gather more data and research on our journey to providing a fair and level playing field for females in our sport.\"\nIn a statement, the IAAF added that the rules would remain suspended until the issue is resolved with Cas, meaning \"that this process will have no impact on the IAAF World Championships in London this August\".", "url": "https://www.bbc.com/sport/athletics/40491036"}