{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:58:04", "date_modify": "2025-05-21 03:58:04", "date_publish": "2025-04-07 08:48:01", "description": "Man Utd 0-0 Man City: United fan views after derby draw at Old Trafford", "filename": "sport_football_articles_crldkpnkr2wo_1747799884.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_crldkpnkr2wo_1747799884.html", "title": "Man Utd 0-0 Man City: United fan views after derby draw at Old Trafford", "title_page": "Man Utd 0-0 Man City: United fan views after derby draw at Old Trafford - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your thoughts after Sunday's Premier League game between Manchester United and Manchester City.\nHere are some of your comments:\nPeter: Pretty much as I expected - United playing on the counter and City trying to break down a low block. Neither team showed much passion, urgency or quality, so a draw was pretty much a fair result. Going into games for United I'm not thinking whether we can win it. I just wonder if we can score, which at the moment doesn't seem that likely no matter who the opponents are.\nGary: No drive, no inspiration, no clue what to do when they get to within 20 yards of the goal area. A very frustrating watch and to be honest a waste of my afternoon. Time to take a break for a couple of game while my temper calms down.\nMark: Not a derby game in the traditional sense, with a lack of intensity seriously missing from both teams. On a plus note, a great defensive display from us and we caused the most problems without really threatening to score. We need to try and get a creative midfielder to help Bruno Fernandes out and the goals will start to flow.\nYusuf: A very dull and dry performance from both Manchester teams. Our killer instinct to go out there and win games is not there and despite our chances we just couldn't finish them. One of the most dull derbies shows the struggle between the two Manchester sides. Ruben Amorim still needs time, but it seems nothing is changing for United as we start to close up this season.\nRussell: It's getting better but we never look like scoring and that is the big, big problem. Hopefully the board will give Ruben the players he wants in the summer and is given carte blanche to offload the overwhelming mediocrity that exists in the current squad.", "url": "https://www.bbc.com/sport/football/articles/crldkpnkr2wo"}