{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:56:32", "date_modify": "2025-05-21 07:56:32", "date_publish": "2025-03-27 21:06:28", "description": "World number one Aryna Sabalenka reaches the Miami Open final with a comprehensive straight-set victory over Jasmine Paolini.", "filename": "sport_tennis_articles_c17q4kz90xwo_1747814192.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a25a/live/12151670-0b4b-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_tennis_articles_c17q4kz90xwo_1747814192.html", "title": "Miami Open 2025: Aryna Sabalenka beats Jasmine Paolini to reach final", "title_page": "Miami Open 2025: Aryna Sabalenka beats Jasmine Paolini to reach final - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "World number one Aryna Sabalenka will face Jessica Pegula in the Miami Open final on Saturday after teenage sensation Alexandra Eala was beaten in the semi-finals.\nBelarusian Sabalenka, 26, is yet to drop a set at the tournament and was in fine form as she stormed to a 6-2 6-2 win over sixth seed Jasmine Paolini.\nSabalenka, a three-time Grand Slam champion, has now reached two finals in succession, having lost to Mirra Andreeva at Indian Wells earlier this month.\nTop seed Sabalenka - who has never previously reached the Miami showpiece - delivered a clinical performance on Thursday, dominating Italian Paolini with powerful serves and punishing groundstrokes.\nMeanwhile, American Pegula ended 19-year-old Eala's remarkable run in Miami with a 7-6 (7-3) 5-7 6-3 victory.\nAside from two mistimed overheads and an ambitious 'tweener' shot which did not have enough power to trouble her opponent, Sabalenka barely put a foot wrong as she surged to victory in just one hour and 13 minutes.\n\"Super happy that I was able to give myself another chance, another final, another opportunity to hold a trophy,\" Sabalenka said.\n\"She's an incredible player so I knew I would have to work for every point.\"\nSabalenka has reached her fourth final in 2025, winning in Brisbane in January before defeats by American Madison Keys at the Australian Open then by Andreeva at Indian Wells two weeks ago.\nFilipino Eala, ranked 140th in the world, had only two WTA main draw victories before arriving in Miami, yet she beat three Grand Slam winners in Jelena Ostapenko, Keys and world number two Iga Swiatek on her way to the last four.\nThe lowest-ranked semi-finalist in Miami Open history pushed Pegula to the brink in a contest lasting two hours and 24 minutes, breaking three times to win the second set.\n\"To have a week like this, the stars need to align and they did this week, and hopefully I can keep that up - that is my goal now, to keep this up,\" she said.\nEala, a graduate of the Rafael Nadal Academy, will break into the world's top 100 for the first time next week.", "url": "https://www.bbc.com/sport/tennis/articles/c17q4kz90xwo"}