{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 08:03:06", "date_modify": "2025-05-21 08:03:06", "date_publish": "2025-05-19 15:38:44", "description": "Winger Jordan Stewart is returning to Glentoran on a two-year deal after 10 seasons away from the Oval.", "filename": "sport_articles_cgmj8p8xz9zo_1747814586.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3d90/live/9c58eac0-34c5-11f0-aa60-d5869f4a84da.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cgmj8p8xz9zo_1747814586.html", "title": "Stewart agrees to second spell at Glentoran", "title_page": "Irish Premiership: Jordan Stewart agrees to second spell at Glentoran  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Winger Jordan Stewart has returned to Glentoran on a two-year deal after 10 seasons away from the Oval.\nThe 30-year-old came through the ranks at the east Belfast club and made his debut for the Glens in 2013.\nAfter winning the Irish Cup in 2015, he made the move to Swindon Town that summer and spent two years with the Robins before returning to the Irish Premiership with Glentoran's fierce rivals Linfield.\nHe spent seven seasons at Windsor Park, winning the league on four occasions, with his final campaign including a loan spell at Glenavon.\nAfter representing Crusaders last season, Stewart said he will be back at Glentoran with \"a real drive to make an impact\".\n\"I'm absolutely buzzing to be back,\" he told Glentoran's official website.\n\"This is where my football journey began - the club that gave me my first opportunity in senior football and played a huge part in shaping my career.\n\"I had a great first spell here, but I've returned with even more hunger and a real drive to make an impact.\n\"I know I've got to earn the trust of the Glentoran fans again and the best way to do that is by working hard and letting my football do the talking.\"\nGlentoran have already confirmed that Scottish midfielder Liam Burt will join the club ahead of next season, with Fuad Sule, Kodi Lyons-Foster, Niall McGinn and Jay Donnelly among those to depart.", "url": "https://www.bbc.com/sport/articles/cgmj8p8xz9zo"}