{"authors": ["Piers Newbery", "www.facebook.com"], "date_download": "2025-05-19 14:32:22", "date_modify": "2025-05-19 14:32:22", "date_publish": "2017-07-16 14:53:27", "description": "Roger Federer becomes the first man to win Wimbledon eight times and extends his record to 19 Grand Slam titles with victory over Croatia's Marin Cilic.", "filename": "sport_tennis_40625069_1747665142.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2D24/production/_96965511_fed3_getty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_tennis_40625069_1747665142.html", "title": "Wimbledon 2017: Roger Federer beats Marin Cilic to win record eighth title", "title_page": "Wimbledon 2017: Roger Federer beats Marin Cilic to win record eighth title - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Roger Federer became the first man to win Wimbledon eight times and extended his record to 19 Grand Slam titles with victory over Croatia's Marin Cilic.\nThe Swiss third seed won 6-3 6-1 6-4 as seventh seed Cilic struggled with a blister on his left foot and broke down in tears during the second set.\nFederer, 35, finished the contest in one hour and 41 minutes to claim his first Wimbledon title since 2012.\nHe becomes the oldest man in the Open era to win at the All England Club.\n\"It is cruel sometimes,\" Federer said of Cilic's physical difficulties.\n\"But Marin fought well and is a hero, so congratulations on a wonderful tournament.\"\nFederer surpasses Pete Sampras and William Renshaw, who won their seventh titles in 2000 and 1889 respectively, with only Martina Navratilova still ahead in terms of Wimbledon singles titles on nine.\nHe has won two of the three Grand Slam titles so far this year, having returned from a six-month break to win the Australian Open in January.\nWith 19 major titles he extends his lead over Rafael Nadal in the men's game to four, and now stands joint-fourth on the all-time list with Helen Wills Moody, five behind Margaret Court on 24.\nAmong his long list of achievements, Federer became the first man since Bjorn Borg in 1976 to win the Wimbledon title without dropping a set.\nThe tournament favourite from the outset, he was rarely troubled over the course of seven matches, and Cilic was not in the condition to provide a serious test.\n\"I never give up in a match. I gave it my best - it's all I can do,\" Cilic said afterwards.\nFederer was playing in his 11th Wimbledon final and Cilic his first, and the gap in experience showed from the early stages.\nCilic, 28, hit a forehand which bounced before the net on the opening point as the nerves appeared hard to shake off.\nFederer offered up a couple of early double faults but there was a sense of inevitability about the first break, which came in game five after Cilic fell heavily chasing down a drop shot, and then sent a backhand into the net.\nA beautiful cross-court forehand helped Federer towards set point in game nine and Cilic duly double-faulted, ending the set with a 49% first-serve percentage that hardly troubled the Swiss.\nAfter Federer made it 3-0 in the second set, a tearful Cilic sat in his chair as the doctor, tournament referee and supervisor attended to him.\nBoris Becker, three-time Wimbledon champion: \"We can't emphasise enough all the records Federer has broken, and with tough competition.\n\"Everybody is younger than him and he finds the way to win easily, and do it consistently on every surface, apart from clay. It's just impossible to fathom. You think, where is he going to go now? Will it be 20 Grand Slams at the US Open?\"\nTim Henman, four-time Wimbledon semi-finalist: \"Because Federer makes it look so easy and the technique is effortless, people take for granted the training that he does. He's meticulous and at the age of 35 he knows what works for him.\n\"I've seen him in the locker room doing all the exercises for his lower back, which he can struggle with. He can struggle with his shoulder as well. I think fundamentally he loves what he does. This is his hobby, not his job. If it stays that way, there's no reason why he can't keep playing.\"", "url": "https://www.bbc.com/sport/tennis/40625069"}