{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:51:08", "date_modify": "2025-05-21 03:51:08", "date_publish": "2025-02-01 09:05:10", "description": "Scottish gossip: Yilmaz, Cerny, Dessers, Palma, Strelec, Cameron, Kvistgaarden", "filename": "sport_football_articles_cwywvzw8kw9o_1747799468.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ec46/live/94732cb0-e07b-11ef-a319-fb4e7360c4ec.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cwywvzw8kw9o_1747799468.html", "title": "Scottish gossip: Yilmaz, Cerny, Dessers, Palma, Strelec, Cameron, Kvistgaarden", "title_page": "Scottish gossip: Yilmaz, Cerny, Dessers, Palma, Strelec, Cameron, Kvistgaarden - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Rangers rejected Besiktas' bid to re-sign Ridvan Yilmaz on loan with an option to buy and the clubs are now negotiating over a transfer fee, with the 23-year-old left-back's parent club demanding £4.2m and the Turkish outfit offering £2.5m for the 23-year-old who switched between them for £3.3m in 2022. (Sabah), external\nWolfsburg have no interest in recalling winger Vaclav Cerny from his loan to Rangers but have slapped a £6.75m price tag on the 27-year-old. (The National), external\nRangers striker Cyriel Dessers would be Cagliari's preferred replacement should Gianluca Lapadula complete his loan move to Spezia. (Rainews), external\nRangers and Aberdeen have both held talks with 22-year-old Dundee midfielder Lyall Cameron over a pre-contract agreement to move from Dens Park this summer. (Football Insider), external\nThe £1m option to buy included in 23-year-old Rangers winger Rabbi Matondo's loan move to Hannover 96 depends on the Bundesliga 2 club winning promotion to Germany's top flight. (BILD via The Herald), external\nRangers manager Philippe Clement says that further squad additions are necessary before the end of the transfer window on Monday and does not expect many more departures. (Glasgow Times), external\nCeltic winger Luis Palma has completed a medical pending of a loan move to Olympiakos, with the 25-year-old Honduras international on his way to Greece to finalise the transfer that includes an option to buy for £3.3m. (Sky Sports), external\nLuis Palma arrived in Piraeus on Saturday morning to join Olympiakos on loan from Celtic in a deal that includes an option to make the transfer permanent for more than £2.5m. (Jobaaj), external", "url": "https://www.bbc.com/sport/football/articles/cwywvzw8kw9o"}