{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:16:57", "date_modify": "2025-05-21 04:16:57", "date_publish": "2025-04-05 17:45:29", "description": "Watford boss Tom Cleverley says Kwadwo Baah's injury and a poor refereeing call were key to the defeat at Bristol City.", "filename": "sport_football_articles_c4g8p1542ypo_1747801017.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ccce/live/051373e0-122b-11f0-a820-05f89b05038b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c4g8p1542ypo_1747801017.html", "title": "Cleverley rues Baah injury", "title_page": "Watford boss Tom Cleverley rues Baah injury - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Watford boss Tom Cleverley said the injury to Kwadwo Baah and a poor refereeing decision were key factors in the 2-1 defeat away against play-off rivals Bristol City.\nThe influential winger suffered another hamstring injury in the first half and had to come off, but Cleverley hoped it would not see him sidelined for long.\nCleverly told BBC Three Counties Radio: \"The start of the game was excellent. We had a gameplan to get our wide players in dangerous positions and we looked a real threat in the first 15 minutes. We really started on the front foot.\nIt was disappointing when KB [Kwadwo Baah] had to come off. We lost some attacking output. They smelt a change in the game then.\n\"James Abankwah hasn't put a foot wrong since he's been at the club but he made a mistake and that will happen with young players. We'll have to rally around him. We can teach him that it can go to row Z at times.\n\"The second goal was hugely disappointing; you don't like poor refereeing decisions to decide big games. It's definitely out of play - there's not much more I can say about that.\n\"They are a good side. Liam [Manning] has done a terrific job with them. It was a stalemate of a game, but I was pleased about how we continued to try to test them and knock down the door. But it was too much of a mountain to climb at 2-0 down.\"", "url": "https://www.bbc.com/sport/football/articles/c4g8p1542ypo"}