{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:33:02", "date_modify": "2025-05-19 15:33:02", "date_publish": "2015-02-06 07:49:26", "description": "Ipswich manager Mick McCarthy says the Championship is \"bonkers\" ahead of his side's trip to face Rotherham on Saturday.", "filename": "sport_football_31154956_1747668782.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/80811000/jpg/_80811576_mick_mccarthy_1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31154956_1747668782.html", "title": "Mick McCarthy: Championship is 'bonkers', says Ipswich manager", "title_page": "Mick McCarthy: Championship is 'bonkers', says Ipswich manager - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ipswich boss Mick McCarthy has called the Championship \"bonkers\" ahead of his side's trip to Rotherham on Saturday.\nThe fourth-placed Tractor Boys were held to a 0-0 draw by relegation-threatened Wigan in the last round of fixtures, while the other two teams in the relegation zone were victorious.\n\"The league is bonkers, isn't it?\" McCarthy told BBC Radio Suffolk.\n\"We aren't going to win them all. It's how you cope with that and whether you get so up or down with the results.\"\nDespite his team winning just one of their last six games, the former Republic of Ireland manager says there is no need to panic.\n\"There are times in a season when that happens. It's happened to everybody else - it's just how you recover,\" added the former Sunderland and Wolves boss.\nMeanwhile, McCarthy thinks Rotherham have no need to worry about the drop.\nThe Millers are currently 20th and only three points above the relegation zone, but the 55-year-old believes they have enough quality to move up the table.\nMcCarthy added: \"No doubt at all in my mind that they'll be in any danger. In fact, they'll be mid-table to the top end. They're a handy outfit, I have to be honest.\"", "url": "https://www.bbc.com/sport/football/31154956"}