{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:06:37", "date_modify": "2025-05-20 14:06:37", "date_publish": "2023-07-30 21:35:34", "description": "Sarah Lavin and Thomas Barr who were among the top performers on the final day of competition at the Irish National Track and Field Championships in Santry.", "filename": "sport_athletics_66356464_1747749997.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/86C2/production/_130589443_tnb.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_athletics_66356464_1747749997.html", "title": "Irish Championships: Sarah Lavin and Thomas Barr among winners at Santry", "title_page": "Irish Championships: Sarah Lavin and Thomas Barr among winners at Santry - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Sarah Lavin and Thomas Barr were among the top performers on the final day of competition at the Irish National Track and Field Championships in Santry.\nLavin set three personal best performances on her way to adding the 100m gold to the 100m hurdles title she won on Saturday.\nBarr picked up his 11th Irish title with an impressive 49.85 in the men's 400m hurdles final.\nIsrael Olatunde won the men's 100m final for a third year in a row.\nStar names Ciara Mageean and Rhasidat Adeleke missed the event because of injury\nIn tough weather conditions, Lavin clocked a lifetime best of 11.53 in the 100m final while Olatunde, who recently reached the European U23 final, took the sprint victory in 10.50.\nThe men's 1500m race turned into a dual between County Tyrone's Nick Griggs and Cathal Doyle from Clonliffe Harriers. In a tight finish Doyle got the better of Griggs to retain his crown in a time of 3:40.11. Griggs, who led for much of the race, followed Doyle over the line in 3:40.11 and will now turn his attention to the upcoming European U20 Championships, where he won double gold back in 2021.\nThe intriguing rematch between European U23 medallists Sophie O'Sullivan and Sarah Healy was billed as potentially the race of the day, and it didn't disappoint with the two women going toe-to-toe from the gun.\nIt was Healy who reversed the result from the recent Continental final as she claimed her third outdoor 1500m title in a time of 4:11.39. O'Sullivan, daughter of Olympic medallist Sonia, crossed in 4:12.00 to all but secure her place at the upcoming World Championships.\nSharlene Mawdsley's impressive season continued as she once again went under 52 seconds in winning the women's 400m comfortably in a field that included the class of Sophie Becker, Roisin Harrison, and Phil Healy. Mawdsley led throughout and clocked 51.94 for her second outdoor 400m title.\nNorth Sligo's Christopher O'Donnell put in a strong performance to win the men's 400m while with Mageean missing, Louise Shanahan made it three national titles in a row in the women's 800m in a time of 2:03.13. John Fitzsimons followed up his recent win at the Morton Games to reclaim gold in the men's 800m (1:47.13).\nA stacked men's 5,000m race saw Brian Fay making his move with four laps to go and the Irish record holder would eventually storm clear to claim the title in 13:39.21. The women's 5,000m went the way of Ide Ni Dhomhnaill, who continued her rapid rise over the last 12 months by adding gold to last year's national 10k title.\nAmong the winners in the field events was pole vaulter Ellie McCartney. The City of Lisburn athlete was the last standing in the women's competition, bettering her seasons best of 4.25m with a winning 4.31m. In the women's high jump on Saturday. Northern Ireland's Sommer Lecky (Finn Valley) claimed the gold medal with a best clearance of 1.80m.\nThe qualification period for next month's World Championships in Budapest also ended on Sunday.\nAdeleke, Mageean, Lavin, Fay, Sarah Healy, Shanahan and Andrew Coscoran have all achieved the 'A' standard as have the mixed 4x400m relay team and David Kenny in the men's 20km walk, who looks set to join the already selected Brendan Boyce in the 35km walk.\nAmong those athletes who have the Athletics Ireland 'B' standard and are within the World Athletics quota places are Barr, Mawdsley, O'Sullivan, Fitzsimons and Mark English.", "url": "https://www.bbc.com/sport/athletics/66356464"}