{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:26:29", "date_modify": "2025-05-21 05:26:29", "date_publish": "2025-04-03 11:32:35", "description": "Derby goalkeeper Jacob Widell Zetterstrom says the 2-0 win over Preston was an \"amazing night\" but the team are now fully focused on the next game.", "filename": "sport_football_articles_c0kx823207go_1747805189.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a7e7/live/fa6fd520-1070-11f0-a161-1f18bc46c434.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c0kx823207go_1747805189.html", "title": "We're all working so hard to stay up - Zetterstrom", "title_page": "Derby County: We're all working so hard to stay up - Zetterstrom - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Derby County goalkeeper Jacob Widell Zetterstrom says the 2-0 win over Preston was an \"amazing night\" but the team are now fully focused on the next game.\nThe Rams are one point above the relegation zone and travel to Swansea City on Saturday for another important match in the fight to stay in the Championship.\n\"It's very important, obviously,\" the 26-year-old told BBC Radio Derby's Rams Daily podcast.\n\"We've still got seven more games and we have to take every single game as it comes.\n\"We're very happy now but tomorrow, work starts for the upcoming game and we look forward to it.\n\"I know it's a bit dull to think like that, but the work we put in every single day is to make sure we stay up in this league.\n\"We've done great so far in the last few weeks and we just have to continue to build on that.\"\nZetterstrom said Derby have put \"a lot\" of hard work into winning four games in a row and keeping two clean sheets in that time.\n\"I'm just so happy for every single lad out there who put in the effort to make sure we scored those two goals and make sure they scored none,\" he added.", "url": "https://www.bbc.com/sport/football/articles/c0kx823207go"}