{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:18:19", "date_modify": "2025-05-21 04:18:19", "date_publish": "2025-02-01 11:08:22", "description": "Glentoran manager Declan Devine says his players deserve all the credit for emerging as victors from Friday's pulsating Irish Cup sixth round tie against Belfast rivals Linfield.", "filename": "sport_articles_cly93vv973no_1747801099.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/38b0/live/912e0410-e08c-11ef-b5a3-1f3f58db284c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cly93vv973no_1747801099.html", "title": "'Players deserve all the credit' - Glens boss Devine", "title_page": "Irish Cup: 'Players deserve all the credit' - Glens boss Devine - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Glentoran manager Declan Devine said \"the players deserve all the credit\" after his side edged out Linfield 2-1 after extra-time in a dramatic Irish Cup sixth round tie at the Oval which saw three players sent-off.\nJordan Jenkins opened the scoring for the Glens on 53 minutes before Chris McKee equalised for the Blues on 72.\nMomentum swung in Glentoran's favour when Joel Cooper was sent off in extra-time for kicking out at Jonny Russell on the ground.\nSubstitute Finley Thorndike marked his introduction with a sweet strike from outside the area to seal the hard-fought victory for the Glens.\nLinfield's Chris Shields and Glentoran's Joe Thomson were then dismissed late in extra-time after both received second yellow cards.\n\"This was a very important game for us against our biggest rivals who are in incredible form themselves,\" said Devine.\n\"To be as disciplined as were were, we weren't pretty by any stretch but we worked our hearts out.\n\"The players deserve all the credit. They've bought in to what it takes to play for the club.\"\nDevine expressed relief at securing passage into Saturday's quarter-final draw.\nThe east Belfast side are undefeated in cup competitions this season, having already clinched the County Antrim Shield and in the final of the BetMcLean Cup.\n\"We're in the next round, that's all that matters.\n\"We've got great character in our team, even when we conceded the goal. There were a lot of players running on empty and what a goal to win it.\n\"But testimony to Linfield too. They're a brilliant team, it was a rip-roaring cup tie and we're delighted to be in the hat.\"", "url": "https://www.bbc.com/sport/articles/cly93vv973no"}