{"authors": ["Emma Sanders", "www.facebook.com"], "date_download": "2025-05-21 04:42:32", "date_modify": "2025-05-21 04:42:32", "date_publish": "2025-01-23 14:46:16", "description": "Leicester City manager Amandine Miquel believes there is no pressure on the club's young players to perform despite a difficult season so far.", "filename": "sport_football_articles_c0lznl0jgylo_1747802552.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0b84/live/a90bb710-d990-11ef-a7d7-813810cd836f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c0lznl0jgylo_1747802552.html", "title": "'No pressure' on Leicester's young players, says Amandine Miquel", "title_page": "'No pressure' on Leicester's young players, says Amandine Miquel - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Leicester City manager Amandine Miquel believes there is no pressure on the club's young players to perform despite a difficult season so far.\nThe Foxes, who face Liverpool on Sunday, sit just a point above the relegation spot with one win from their first 11 matches in the Women's Super League.\nA number of injuries to senior players means Miquel has turned to youth to get them through the season.\n\"I don't see pressure when I see them play. I see a lot of will to do well and to do their best,\" said Miquel.\n\"We are halfway through the WSL and maybe if there are two games left and we are in the same position then there will be more pressure.\n\"But right now, we try to make sure pressure is not on any player.\"\nMiquel says the club know they can \"count on them\" and they have learned a lot from the challenges of this season.\n\"No matter the age, we can count on them. Maybe if we have less injured players, they have less minutes, but they are making the most out of it,\" she added.\n\"They have done very well. I think the mentality and the quality is there. We have to rely on them and not hesitate when we need them.\"", "url": "https://www.bbc.com/sport/football/articles/c0lznl0jgylo"}