{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:16:15", "date_modify": "2025-05-21 04:16:15", "date_publish": "2025-04-05 18:17:30", "description": "MS Dhoni: CSK coach Stephen Fleming unsure if former India captain will retire", "filename": "sport_cricket_articles_cwy01llw40xo_1747800975.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/aee9/live/3a30d500-1239-11f0-afc6-d1fc00c8c982.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cwy01llw40xo_1747800975.html", "title": "MS Dhoni: CSK coach Stephen Fleming unsure if former India captain will retire", "title_page": "MS Dhoni: CSK coach Stephen Fleming unsure if former India captain will retire - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Chennai Super Kings coach Stephen Fleming says he has \"no idea\" if veteran captain MS Dhoni is set to retire but says the 43-year-old is \"still going strong\".\nIconic former India and CSK skipper Dhoni, who famously led his country to the World Cup title in 2011, is playing his 18th Indian Premier League season but in a bit-part role.\nHis parents were attendance as he played in Saturday's 25-run defeat by Delhi Capitals, leading to online speculation the wicketkeeper could retire.\n\"I'm just enjoying working with him still,\" New Zealander Fleming said.\n\"He's still going strong. I don't even ask these days.\"\nDhoni retired from India duty in 2020, having played 90 Tests, 350 one-day internationals and 98 T20s.\nHe hit the winning runs in India's 2011 victory at home and also led his side to wins in the 2007 T20 world title and the 2013 Champions Trophy.\nSince then he has continued to play for CSK in the IPL and led them to the title for a fifth time in 2023.\nChennai's home defeat by Delhi was their third in four matches this season, however Dhoni ended 30 not out from 26 balls in their chase of 184 as his side ended well short on 158-5.\nOnce one of the game's great finishers, Dhoni came in at number seven - two places higher than he batted earlier in the tournament in defeat by Royal Challengers Bengaluru.\nAfter that match, Fleming said he \"can't bat 10 overs\" because \"his knees aren't what they used to be\".", "url": "https://www.bbc.com/sport/cricket/articles/cwy01llw40xo"}