{"authors": ["Nizaar Kinsella", "www.facebook.com"], "date_download": "2025-05-21 05:19:21", "date_modify": "2025-05-21 05:19:21", "date_publish": "2025-04-03 23:02:22", "description": "Ange Postecoglou had a torrid night as Tottenham lost at Chelsea, facing the fury of his own fans. He cupped his ear towards them when he thought they had equalised - so has that made things worse?", "filename": "sport_football_articles_c4grm79pwn0o_1747804761.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1e99/live/889c6400-1128-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c4grm79pwn0o_1747804761.html", "title": "Is Tottenham head coach feeling the friction? - BBC Sport", "title_page": "Ange Postecoglou - fan jeers and a cupped ear: Is Tottenham head coach feeling the friction? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tottenham head coach Ange Postecoglou is looking more isolated than ever.\nThe Australian directed a brief clap towards the furious travelling away fans from near the halfway line following his side's 1-0 loss at Chelsea but, by then, it could be argued the damage had already been done.\nEnzo Fernandez's second-half header was enough to inflict a 16th defeat of the season on Tottenham and leave them 14th in the Premier League - 10 points away from the top 10 - and the signs are growing some fans have had enough.\nChants of \"you don't know what you're doing\" came from the away end after midfielder Lucas Bergvall was replaced by Pape Sarr in the 65th minute.\nRemarkably, Sarr found the net with an excellent long-range strike just four minutes later, leading Postecoglou to cup his ear and turn to the away end, only for VAR to then rule out the goal for a foul on Moises Caicedo.\nWhen asked about the incident after the match, Postecoglou said: \"Jeez mate, it's incredible how things get interpreted. We'd just scored, I just wanted to hear them cheer. Because we'd been through a tough time, and I thought it was a cracking goal.\n\"I wanted them to get really excited. I felt at that point we could potentially go on and win the game. I just felt momentum was on our [side]. It doesn't bother me. It's not the first time they've booed my substitutions or my decisions. That's fine, they're allowed to do that.\n\"But we'd just scored a goal, just scored an equaliser, I was just hoping we could get some excitement. If people want to read into that that somehow I'm trying to make a point about something, like I said, we'd been through a tough time, but I just felt there was a bit of a momentum shift there.\n\"If they get really behind the lads, I thought we had the momentum to finish on top of them.\"\nIt's just the latest in a season of incidents between Postecoglou and sections of the fanbase.\nThere was the recent exchange with an angry supporter after defeat by Fulham just before the international break, another similar back and forth happened after defeat at home to Leicester and he confronted the away end after they criticised players after losing at Bournemouth in December.\nHe added when asked if he was alienating the fans: \"You know what, I am at such a disconnect with the world these days, that who knows? Maybe you're right. I don't know. But that's not what my intention was.\"\nThis just compounds the lack of progress on the pitch, especially with almost a full squad of players available, as Spurs look to avoid their worst season in the Premier League era.\nFormer Spurs midfielder Jamie Redknapp put it plainly when he said on Sky Sports: \"Tottenham were awful. It could have been so much more. Not good enough in any department from Tottenham. Chelsea were so much better.\n\"When Sarr scored, it looked like Ange cupped his ears to say: I know better. There's a disconnect between the two [Tottenham fans and Ange Postecoglou] at the moment.\n\"It's not ideal for the manager. He's got some big games ahead. He's got to keep his head up, got to keep going, working hard and believing in what they do.\"\nReports suggest Postecoglou is under severe pressure. Bournemouth's Andoni Iraola, Fulham's Marco Silva and Brentford's Thomas Frank have all been linked with his job.\nThe 56-year-old, who became Spurs boss in June 2023 and is contracted to the club until 2027, even suggested in midweek there were plenty of outstanding candidates, external to replace him.\nHowever, Spurs are expected to at least wait until the culmination of the Europa League campaign - a chance not only to win a first trophy in 17 years, but also to qualify for next season's Champions League. They host Eintracht Frankfurt in the first leg of their quarter-final next Thursday.\nA club source indicated before the match that they weren't expecting any managerial changes before the end of the season.\nRedknapp, again speaking to Sky Sports, said after the match: \"I think for Ange Postecoglou, it feels like he's going to make history or be history.\n\"When you lose 16 games in a season as Tottenham manager, still having great players at your disposal, it's not going to wash with the fans. The performances haven't been good enough.\n\"If they can win some silverware, it'll be unbelievable for them.\"\nVice-captain James Maddison, reacting to the fan frustration, said: \"They have every right to be an angry bunch at the moment.\n\"I don't really want to be here talking and I'm sure the fans don't want to listen to me. It can still be a very special season if we lift silverware. We need them as much as they need us, so the message is to stick together.\"\nLike Postecoglou, chairman and co-owner Daniel Levy has faced criticism from the fans.\nBut Levy has given the head coach resources to shape a squad. Postecoglou has spent £214.8m, with the most recent arrivals signed in January - forward Mathys Tel, defender Kevin Danso and goalkeeper Antonin Kinsky.\nThat extra spend was an attempt to salvage the season while alive in three cup competitions, but after elimination from the domestic cups, it is Europa League or bust.\nIt will be Spurs' last chance to live up to Postecoglou's comment early in the campaign that he \"always wins a trophy in his second season\" - having done so in Scotland, Japan and Australia.\nWith little to play for in the Premier League, a end to the Spurs trophy drought would end the season on a high.\nOn another night, Postecoglou's post-match rant about VAR would have taken the headlines. On Thursday, it was a footnote.\nTottenham thought they had equalised when Sarr struck home from distance.\nThe celebrations followed but were cut short as VAR checked for a possible foul. After a lengthy delay, the goal was ruled out.\nPostecoglou told BBC Radio 5 Live he \"hated VAR to his core\", that there was no point in having referees - and that there would soon be AI officials.\nPostecoglou, who has often criticised VAR, become embroiled in a lively post-match interview with Sky Sports.\nHere is what he said in full:\n\"It's killing the game, mate. It's not the same game it used to be.\n\"We all sat on our couches last night and watched TV [when Everton's James Tarkowski was not sent off for a high challenge on Liverpool's Alexis Mac Allister] and I guarantee you if Jarred Gillett was VAR last night, it would've been a different outcome, so you just don't know what we're going to get.\n\"You are standing around for 12 minutes. It's just killing the game, but no-one cares about that. They just love the drama and controversy and I'm sure there will be 24 hours of discussion about it and that's what everyone wants - they're not really interested that it's killing the spectacle of the game.\n\"If a referee sees that and he needs to see it for six minutes, what's clear and obvious about it?\n\"Last night we were all sat on our couches and saw one replay and thought: 'Oh my God.'\n\"Tonight we sat there and were waiting for six minutes for something that VAR official Jarred Gillett thought was clear and obvious - it's crazy, it's madness.\n\"We accept it and have to take the fall out from it. Clear and obvious? What does that suggest? That it's on the first replay. That's why the game is going the way it is.\"", "url": "https://www.bbc.com/sport/football/articles/c4grm79pwn0o"}