{"authors": ["Matt Gault", "www.facebook.com"], "date_download": "2025-04-26 06:29:28", "date_modify": "2025-04-26 06:29:28", "date_publish": "2025-02-27 11:04:59", "description": "Ireland's Peter O'Mahony, Cian Healy and Conor Murray will retire from Test rugby at the end of this year's Six Nations.", "filename": "sport_rugby-union_articles_c5y44x0ky70o_1745648968.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/faa2/live/d99c89c0-f4fe-11ef-8c03-7dfdbeeb2526.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_c5y44x0ky70o_1745648968.html", "title": "Ireland's Peter O'Mahony, Cian Healy and Conor Murray to retire after Six Nations", "title_page": "Ireland's Peter O'Mahony, Cian Healy and Conor Murray to retire after Six Nations - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Ireland's Peter O'Mahony, Cian Healy and Conor Murray will retire from international rugby at the end of this year's Six Nations.\nThe Irish Rugby Football Union (IRFU) confirmed that Ireland's former captain O'Mahony and most-capped player Healy will retire from rugby at the end of the season, while Murray will \"pursue a playing opportunity abroad\" when his Munster deal concludes this summer.\nAll three players are five-time Six Nations champions, two-time Grand Slam winners and have earned over 100 caps for Ireland.\nO'Mahony, Healy and Murray will hope to secure a sixth Six Nations title and third Grand Slam by helping Ireland win their final two matches against France and Italy.\n\"Hi everyone, we've got some news to share: this will be our last Six Nations in green,\" the trio said in a video posted on Ireland's X account.\n\"It's been an unbelievable journey... but the job isn't done and we've a big couple of weeks ahead.\n\"The three of us have done some very special things together but we're not done yet.\n\"Your support over the years has been incredible and has never gone unnoticed, so thank you and we hope to see you in the Aviva [Stadium] one last time next weekend [against France].\"\nIreland interim head coach Simon Easterby said it has been a \"privilege\" to work with O'Mahony, Healy and Murray since 2014, when he joined the coaching set-up.\n\"They have each played a huge role in the success of Irish rugby over the course of their careers and they continue to inspire their team-mates around them,\" said Easterby.\n\"Watching how openly they engage with players in their own position and continue to add value around the set-up is testament to their collective character and they are also adding real value on the pitch.\n\"Knowing each of the guys, they will be focused on achieving even more success this season and we are determined as a group to end their careers with Ireland on a high over these last two rounds.\"\nO'Mahony, 35, has won 112 Ireland caps since making his international debut against Italy in 2012. Last year, he took over as captain following Johnny Sexton's retirement and led the side to the Six Nations title.\nHe was replaced as captain by Caelan Doris before the November internationals, and while he was not in the squad for the opening Six Nations win over England, he started the victories over Scotland and Wales.\nThe flanker also won two league titles for Munster having made his debut in 2010 and was the province's captain for 10 years before stepping down in late 2023.\nO'Mahony featured in three World Cups for Ireland and toured with the British and Irish Lions in 2017, captaining the side in the first Test against New Zealand.\nO'Mahony's Munster team-mate Murray has won 124 Ireland caps since making his debut against France in 2011.\nHealy will retire with the distinction of being Ireland's most-capped player, having surpassed former captain Brian O'Driscoll's mark when he came off the bench for his 134th appearance against Australia in November.\nThe 37-year-old prop has since added two more caps to his haul in this year's Six Nations. With 66, he has more Six Nations caps than any other Irish player.\nA 2013 Lions tourist, Healy also tops Leinster's appearance list. In a club career spanning 18 years, he has won seven league titles and four European Cups.\n\"It is always a sad time when a player decides to move on, but I would like to pay tribute to all three players and thank them for their outstanding contribution to Irish rugby over many years,\" said IRFU performance director David Humphreys.\n\"It goes without saying that Peter, Cian and Conor are legends of not just Irish rugby, but Irish sport, and have each made a significant contribution to the success of Irish rugby for more than 15 years.\n\"There is still so much to play for with Ireland and their provinces and we will mark their careers at an appropriate time in the near future.\n\"Knowing each of them, their focus will be on finishing the season on a high, but their influence will endure for many years to come.\"", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/c5y44x0ky70o"}