{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:45:36", "date_modify": "2025-05-20 14:45:36", "date_publish": "2023-07-28 00:00:00", "description": "How day two of the fifth Ashes Test between England and Australia at The Kia Oval unfolded.", "filename": "sport_live_cricket_64959413_1747752336.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8E23/production/_130578363_murphycummins.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_cricket_64959413_1747752336.html", "title": "The Ashes LIVE: England vs Australia, fifth Test day two, Kia Oval", "title_page": "The Ashes LIVE: England vs Australia, fifth Test day two, Kia Oval - score, commentary, video highlights & updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "'I love batting at The Oval'\nMore from Steve Smith, speaking to Sky Sports: \"There was no set plan, it was just the batters going out and playing what was in front of them. I thought England bowled really well this morning, they didn't give us a lot of freebies. Credit where it's due.\n\"If we take it a little bit deeper, make them bowl more overs, it allows us to score runs at the end of the day like we did. But if the batters are in doing that it would make a huge difference for us.\n\"It swung a lot and they're obviously very good swing bowlers. The new ball probably didn't do quite as much and there wasn't a lot of seam either. As I said, it was a pretty good wicket. It felt good all day.\"\nOn slow scoring rate creating pressure after lunch: \"Potentially. You want to try and keep the scoreboard ticking as much as possible but guys are also allowed to bowl well.\n\"It's Test cricket and you've got to respect those periods at times. We could've got rewards back end of the day if we had more wickets in the shed and they're a bit more tired.\"\nOn his innings: \"I thought I was in good positions today. There are a couple of things I've been working on this week and I really love batting at The Oval. You get value for your shots and the bounce is pretty consistent. Unfortunately I couldn't capitalise.\"\nOn the surface: \"As the game goes on it'll be about bowling that straighter line potentially, in case there is any up and down. As much as we can, we need to challenge their defence and make them play big shots off good balls. Pretty standard stuff.\"\nOn the run out: \"Initially I saw it and I saw the bail go up. It was close - I got given not out in the end so I can't do much else!\n\"You go back in, get back in the moment and maybe have a bit of freedom thinking, 'I could've been out.'\"\n'I thought England bowled well'\nAustralia batter Steve Smith to BBC's Test Match Special: \"It's ebbed and flowed the whole way, we're pretty disappointed, the wicket itself was good, played pretty nice. A few of us got good starts but couldn't go and get a big score. 12 runs in front, it's a one innings game from here pretty much.\"\nWhat was the plan for today?: \"Just bat normally, nothing in particular. I thought they bowled well. They didn't give us too many boundary scoring opportunities. Marnus was finding it tough to score.\"\nHow did you think you batted today?: \"I thought I batted well, if I stayed in, Murph may not have come in and did what he did. \"\nWhat did you make of the run out?: \"I only saw what I saw, it looked a close one but it got given not out, didn't it.\"\n'I was going to open the batting'\nEngland bowler Jimmy Anderson speaking to BBC's Test Match Special: \"It's a very level game. It feels like it's come down to a one innings match. Getting into the position we did, we're a little disappointed they got past us. Pat and Murphy batted really well in the end. All in all, a really good day for the bowlers. It felt like a slow pitch and we had to slam it to get anything out of it.\"\nHow did you think the team bowled?: \"They didn't really try and do anything out of the ordinary in that first session, but we didn't really allow them to get anything from it. From our point of view, we didn't focus on what they were doing, focused on what we do best, hit the areas with our skills.\"\nThe Steve Smith run out?: \"It's hard to tell when you're 150 yards away from the screen. It's one of those that Australia would feel is not out and we would. It feels like another close decision.\"\nDo you think you have enough as a team to win this match?: \"We want to get a challenging total to make it hard for them to chase down. I can't see us going and batting differently, we've got very positive players who want to go and show their skills.\"\nDo you feel you have bowled well in this series, just without getting the wickets?: \"I think so, I think today in particularly I bowled well and could've got a couple more wickets. You hope not to have one of those lean patches.\"\nWhat score do you need as a batting line-up?: \"I think realistically, I can't see it deteriorating much, we're without Mo which is a big blow. I would love to see us put on 300+, I want to see.\"\nWho is batting at No.3?: \"I was going to open the batting which I was excited about if there was one over left.\"\nGenuinely?: \"Yes, it would've been me and one of the openers.\"\n'Disappointed we couldn't get a bigger lead'\nAustralia batter Steve Smith, speaking to Sky Sports: \"You look at the two scorecards and they're pretty similar. It would have been nice to have got a bigger lead.\n\"The wicket was pretty good, there was a bit of swing around throughout the day with the overheads but the wicket itself was quite nice.\n\"A lot of us got in, had good starts and weren't able to go on with it.\n\"A couple of partnerships at the end helped. I thought at that point it was time for a bit of a counter-punch. Obviously it didn't come off and it might have been a little bit early that I pulled the trigger, particularly the way Pat Cummins was batting.\n\"But if I hadn't got out then maybe Todd Murphy wouldn't have come out and got 30-odd. It wasn't a bad end to the day but overall we're a bit disappointed we couldn't get a bigger lead.\"", "url": "https://www.bbc.com/sport/live/cricket/64959413"}