{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:04:32", "date_modify": "2025-04-26 07:04:32", "date_publish": "2025-02-28 00:00:00", "description": "Follow live text commentary from day three of 2025 pre-season testing at the Bahrain International Circuit.", "filename": "sport_live_czed5n253x2t_1745651072.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/aeb5/live/9a859f30-f5ec-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_live_czed5n253x2t_1745651072.html", "title": "F1 testing 2025 LIVE: Times, results & updates from the final day in Bahrain as George Russell quickest, Lewis Hamilton sixth", "title_page": "F1 testing 2025 LIVE: Times, results & updates from the final day in Bahrain as George Russell quickest, Lewis Hamilton sixth - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Ferrari 'have work to do', says Hamilton\nAndrew Benson\nBBC F1 correspondent\nLewis Hamilton said Ferrari \"definitely have some work to do to improve\" as his former Mercedes team-mate George Russell set the pace on the final day of pre-season testing.\nThe seven-time world champion ended the day sixth fastest in his Ferrari, 0.8 seconds off former Mercedes team-mate George Russell, who ended day three quickest overall.\nHamilton said: \"It's hard to know what fuel loads everyone is running so you have to take everything with a pinch of salt.\n\"(McLaren) won the constructors' (title) last year. We expect them to be one of the quickest if not the quickest. As with Red Bull, they dominated for many years. We've definitely got some work to do to improve.\"\nRead the full day three report here\nEnd of the test for Ferrari\nChris Medland\nF1 journalist in Bahrain\nNot quite the uplifting ending to the test Ferrari would have wanted, with the car back in the garage and in pieces behind this screen. The team are packing up with one member sporting a high-vis top as they take down the pit gantry.\nHamilton managed 47 laps this afternoon but had said he was set to do a race simulation, which hasn’t been completed. Not a disaster, but given how hard he is working to try and get up to speed at Ferrari it’s a costly loss of running.", "url": "https://www.bbc.co.uk/sport/live/czed5n253x2t"}