{"authors": ["Andy Bayes", "www.facebook.com"], "date_download": "2025-05-21 07:15:38", "date_modify": "2025-05-21 07:15:38", "date_publish": "2025-01-22 12:39:18", "description": "If ever a night were to sum up where Blackburn Rovers find themselves at that the moment, the home defeat by Coventry was it.", "filename": "sport_football_articles_cy9l00pz0vdo_1747811738.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/58e4/live/a11be770-d8b7-11ef-87df-d575b9a434a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy9l00pz0vdo_1747811738.html", "title": "Opinion - a worrying trend - BBC Sport", "title_page": "Blackburn Rovers: Opinion - a worrying trend - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "If ever a night were to sum up where Blackburn Rovers find themselves at the moment, the home defeat by Coventry was it.\nA side decimated by injuries before kick-off and ending the match with the medical team - just as much as the playing staff - needing reinforcements!\nIn almost all of the metrics provided by the BBC, Rovers were the team in control.\nMore shots, more possession, the opposition goalkeeper worked more... and so on.\nAs we all know, the only important statistic is the final score and Coventry managed the game well after Brandon Thomas-Asante (a Rovers target) scored early in the second half.\nAfter six straight wins in the league before Christmas, Rovers have come undone of late, losing five of the next eight.\nIn all of the games lost, the team haven't scored a goal.\nIt's a worrying trend and one that head coach John Eustace is desperate to address during the transfer window.\nOver the last decade, they've lost prolific goalscorers in Jordan Rhodes, Rudy Gestede, Adam Armstrong and Ben Brereton Diaz but there has always seemed to be the next cab off the rank to lighten the load. This year feels different.\nLosing Sam Szmodics a week into the Championship season removed a potential 33 goals on its own. Without him last season, I firmly believe they'd be playing League One football this year.\nFinding the formula to replace that output was always going to be a challenge.\nThe overseas markets have been used to bring in Yuki Ohashi and Makhtar Gueye but expecting them to hit the ground running and deliver goals on a regular basis is asking an awful lot.\nIt has done nothing but heighten the urgency for a proven championship, course and distance striker. A seasoned pro.\nThis league asks a lot from players with the current absentee list being a very good example of that.\nI did feel at the start of the month that if Rovers lumped their entire budget on a striker (who, let's not forget, cost the most), then I'd be quite satisfied.\nI now look at a depleted squad and think maybe that's not the way forward.\nAs many as 11 players could miss Saturday's visit to Bristol City - and I stress, could.\nA team of Pears, Brittain, Carter, Wharton, Batth, Pickering, Travis, Tronstad, Rankin-Costello, Sigurdsson and Ohashi would be a pretty strong outfit. They either missed the Coventry defeat or picked up a knock during the match.\nOne league win since captain Lewis Travis went out of the team injured in December shows his great importance and now a six-week lay off for his midfield partner Sondre Tronstad is an enormous blow to go alongside it.\nThe club have allowed veteran defender Kyle McFadzean to terminate his contract with youngsters Connor O'Riordan and Leo Duru going out on loan and midfielder Jake Garrett likely to follow suit.\nIt means that more academy players will be needed to bulk up a nine-man bench.\nSixteen-year-old Isaac Dunn (son of Rovers favourite David Dunn) is likely to be involved with the seniors until reinforcements arrive either from the treatment table or the transfer market.\nRovers fans will say they've been in this position before in January. In the top six, dreaming of a return to the Premier League and in need of quality additions to help them have a realistic chance of getting over the line.\nThe focus switches to the ownership in India and the boardroom in Blackburn.\nWill they be able to provide the tools that John Eustace needs at his disposal to keep alive this unlikely play-off push?\nMy view is that Eustace, as head coach, needs to be in control of who is recruited.\nHe's doing an incredible job. I'm not sure that even the most optimistic Blackburn Rovers supporter would have expected a place in the top six after 28 games.\nEustace knows players are needed and he's also sure that everyone in recruitment or executive roles are on the same page.\nIt's only fair to say that the market has been slow for Championship clubs spending cash, especially those without parachute money.\nWill that change before February 3? I suppose only time will tell.\nI'd be surprised if any of the teams in the top four drop below fourth between now and May 3.\nThey seem in a mini-league of their own, with potentially more than a dozen other clubs eyeing places five and six.\nThe championship might be producing the highest quality football but it never fails to deliver in terms of its unpredictability.", "url": "https://www.bbc.com/sport/football/articles/cy9l00pz0vdo"}