{"authors": ["Andy Bayes", "www.facebook.com"], "date_download": "2025-04-26 06:56:37", "date_modify": "2025-04-26 06:56:37", "date_publish": "2025-02-28 14:41:11", "description": "BBC Radio Lancashire Sports Editor Andy Bayes on his first impressions of new Blackburn Rovers coach Valerien Ismael.", "filename": "sport_football_articles_crknnk8lxdzo_1745650597.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3241/live/e883d9a0-f5dc-11ef-a452-97c9e2e951dd.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_crknnk8lxdzo_1745650597.html", "title": "Blackburn Rovers: Valerien Ismael makes strong first impression", "title_page": "Blackburn Rovers: Valerien Ismael makes strong first impression - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Rightly or wrongly, first impressions are really important to me.\nIn 26 years in the industry, I've lost count of how many new managers or head coaches I've been privileged to speak to.\nThe first meeting is generally a pooled interview or press conference, and it's only when things get to a week or so in, that faces become familiar and a level of trust can hopefully be established.\nAs the BBC local reporter, it's about treading that fine line of being respectful always but getting as much information as you can that the supporters are chatting about at the match, in the pubs, and online.\nThe role has certainly evolved over my time at BBC Radio Lancashire. Valerien Ismael is the 17th different man that I've stuck a microphone in front of at Blackburn Rovers alone.\nIn the main, a new man has been brought in because something has gone wrong. This certainly isn't the case with this one.\nIsmael inherits a team that is in the top six ahead of his first match. He told me that the majority of clubs across Europe that he's spoken to over the last year have been battling at the wrong end of the table, and only this opportunity felt right.\nIsmael is an imposing figure, a tall man with a presence. He seemed completely at ease with every question coming his way. He immaculately answered them all in fluent English.\nThe main takeaway from our conversation was that the interview process worked both ways. He answered the questions the powers that be had for him, and then it was his turn to ask the questions to make sure that this opportunity would work for him.\nHe felt there were 'no grey areas' in terms of the job description and was happy to take it.\nHe views the role as both short and long-term. His deal is for three-and-a-half years, and he told me, \"The idea is simple. To create an identity, a way to play, and to create a pathway for young players.\"\nThat identity will wait for now - 12 games left of a season with half of the squad either out of contract in the summer or returning to their parent clubs isn't the time to put a big stamp on things.\n\"With 12 games remaining, it's just to support the players and not to touch too much,\" he said. \"The players have done well so far. I'm just here to support and to observe.\"\nThose observations will be key with how the club moves forward next season, regardless of the division they find themselves in.\n\"The other hand is the vision for the summer,\" Ismael added. \"Prepare for the windows and be prepared to assess which players will be able to continue with us from the academy.\n\"I see this as a chance to pick the right players we need for the team. For sure it's a lot of work to do, but I see this as a great opportunity.\"\nI was left with no doubt that Ismael's key principles are not optional for his players to adhere to. He'll be as clear with them as he was with me.\n\"I have my principles on the pitch, and I have my rules: respect, discipline, commitment and hard work. My rules as a player, as a human being and as a head coach. I try to stick to my rules because it's brought me success.\"\nSo my first impressions leave me with nothing but positive thoughts. A straight-talking man who knows what he wants. Someone who will concentrate on fine-tuning over the final 12 games but have an eye on the future too and what he wants it to look like.\nAs always, results are the only important thing in a managerial appointment. But relating to the fanbase is crucial too.", "url": "https://www.bbc.co.uk/sport/football/articles/crknnk8lxdzo"}