{"authors": ["Tasnim Chowdhury", "www.facebook.com"], "date_download": "2025-05-21 06:07:01", "date_modify": "2025-05-21 06:07:01", "date_publish": "2025-01-31 15:02:47", "description": "Unai Emery press conference: Wolves vs Aston Villa", "filename": "sport_football_articles_cly5drlldndo_1747807621.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6296/live/dbade4a0-4907-11ef-b74c-bb483a802c97.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cly5drlldndo_1747807621.html", "title": "Unai Emery press conference: Wolves vs Aston Villa", "title_page": "Unai Emery press conference: Wolves vs Aston Villa - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ollie Watkins has told Emery that he is \"happy to stay\" after Villa rejected Arsenal's approach for the 29-year-old: \"We asked him how he is feeling being with Villa and he is happy here.\"\nEmery said that Watkins' commitment to the club has been \"huge\": \"He appreciates Aston Villa have always supported him, helped him and tried to get the best of him. Now we need him - like he needed Aston Villa.\"\nMore on Watkins: \"I speak with him a lot. He is always adapting to every circumstance we have in the squad and with him individually. When teams are interested in our players, of course it is very good for us and very good for the players. Some prefer to leave and some players accept to stay here, to be here and commit with us here and to be with our challenge. One of those is Ollie Watkins.\"\nOn the impact of the transfer window on Villa: \"Of course we are changing the squad because we need to improve at everything – individually and collectively. We will miss some players in the squad because we did not change Diego Carlos or [Emi] Buendia. We have the last player leaving - it's not official - but it's Jhon Duran. The players we have are trying and showing their commitment.\"\nMatty Cash will not be available to play at Wolves, with Emery confirming he will be out for \"three to four weeks\". Tyrone Mings has also a \"small injury\" and \"will need some days more to be ready to play\".\nOn whether his side are at a disadvantage on Saturday given their Champions League exploits: \"For a long time I have played in Europe and I know how to prepare each match as best as possible - resting, [eating] good food and preparing with work on the field and in meetings. The idea is to accept, adapt, be intelligent and have strong players consistently playing. And to have our subs ready to play at the level we have.\"\nOn the challenge posed by Wolves: \"The challenge is to compete - we have to dominate. They are the values we are trying to set with the players we have.\"", "url": "https://www.bbc.com/sport/football/articles/cly5drlldndo"}