{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:22:29", "date_modify": "2025-05-20 12:22:29", "date_publish": "2023-08-05 00:00:00", "description": "Reaction as Japan beat Norway to reach the quarter-finals at the 2023 Women's World Cup.", "filename": "sport_live_football_66183771_1747743749.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/B6FE/production/_130664864_gettyimages-1593751392.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_football_66183771_1747743749.html", "title": "Japan vs Norway LIVE: Fifa Women's World Cup score, commentary & updates from last-16 game", "title_page": "Japan vs Norway LIVE: Fifa Women's World Cup score, commentary & updates from last-16 game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Post\nThat's all from us then. Not bad is it? A morning of football and then you can go about your day. Saying that it's miserable where I am in Manchester so I won't be going anywhere.\nRegardless, enjoy the rest of your Saturday and we will be back tomorrow for more last 16 action. Here's what's on the menu:\nNetherlands v South Africa (03:00 BST)\nSweden v USA (10:00 BST)\nSee you later!\n'Japan look unbeatable, unstoppable'\nFT: Japan 3-1 Norway\nEniola Aluko\nFormer England forward on ITV1\nThese players are at the height of their confidence - the chemistry, the flow, the timing.\nThey are really looking like an unbeatable team - how do you stop Japan now? We've seen them come up against a different style and still dominated and won.\nThey look unstoppable.\n'Japan had too much quality'\nFT: Japan 3-1 Norway\nRachel Corsie\nScotland and Aston Villa defender on ITV1\nI would put Japan in that bracket [as one of the best teams in the tournament].\nThe coordination across the whole team, it's difficult to say anyone fell short of having a good game today.\nWhen all of their top players are on form, you are going to struggle against them.\nNorway sat back but, in the end, Japan had too much quality.\n'Unbelievable save'\nJapan 3-1 Norway\nSiobhan Chamberlain\nEx-England and Man Utd goalkeeper on ITV1\nThat was an unbelievable save from Yamashita, virtually clawing the ball out of the net.\nBig saves in key moments will win you tournaments. Fantastic, the agility, the power, the strength.\nIf that went in, it would have made the final five minutes very nervy for Japan.\n'Suitors will be calling Miyazawa'\nJapan 3-1 Norway\nSanny Rudravajhala\nReporting for 5 Live Sport\nCool, calm and clinical. A perfectly timed run and great finish from Hinata Miyazawa.\nBefore this tournament she’d only got four goals - and now she’s top scoring with one more than that.\nI wonder if a move from MyNavi Sendai Ladies could be on the cards for the 23-year-old, after this tournament?\nThe suitors will come calling but they may have to wait a while, Japan look like they’ll be going deep into this tournament.", "url": "https://www.bbc.com/sport/live/football/66183771"}