{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 08:00:32", "date_modify": "2025-05-21 08:00:32", "date_publish": "2025-03-27 17:01:19", "description": "West Brom boss Tony Mowbray has said they have to start winning away games to strengthen their Championship promotion hopes.", "filename": "sport_football_articles_c204qexv9rdo_1747814432.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4d8e/live/1cbe50b0-0b27-11f0-b1de-e342f84c59e9.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c204qexv9rdo_1747814432.html", "title": "Tony Mowbray: 'West Brom have to start winning on the road'", "title_page": "Tony Mowbray: 'West Brom have to start winning on the road' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "West Bromwich Albion will need to start winning consistently away from home to secure their Championship play-off spot, according to head coach Tony Mowbray.\nThe Baggies are sixth in the Championship, ahead of seventh-placed Bristol City only on goal difference.\nWest Brom's last victory away from The Hawthorns was on 10 November - when Carlos Corberan was in charge - a run of 12 winless matches, in all competitions.\n\"We're going to have win a game or so on the road,\" Mowbray told BBC WM, ahead of Saturday's trip to Carrow Road to play Norwich City (15:00 GMT).\n\"We can't keep drawing games and thinking it's okay, we have to find a way to win so we are going to Norwich this weekend and be really positive and aggressive.\"\nNo team in the top-six tiers of English football have drawn more than West Brom's 10 games on the road this season.\n\"We've been throwing punches - we could have scored two or three goals at Leeds, we could have won at Burnley when hitting the bar late on,\" added Mowbray.\n\"I'm trying not to be submissive or passive to the opposition but you have to respect they're decent football teams.\n\"Generally we're going to try to win every game and that's the mindset I try to put in the team not 'let's take a point here today lads and be happy with it'.\"", "url": "https://www.bbc.com/sport/football/articles/c204qexv9rdo"}