{"authors": ["George O'Neill", "www.facebook.com"], "date_download": "2025-04-26 03:50:29", "date_modify": "2025-04-26 03:50:29", "date_publish": "2025-03-05 12:43:17", "description": "Scotland out to 'right wrongs' against Wales - Fagerson", "filename": "sport_articles_c1w0pxlv954o_1745639429.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/916c/live/602d87b0-f9b8-11ef-9509-b3ecaa172155.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_c1w0pxlv954o_1745639429.html", "title": "Scotland out to 'right wrongs' against Wales - Fagerson", "title_page": "Scotland out to 'right wrongs' against Wales - Fagerson - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Zander Fagerson says Scotland must \"right our wrongs\" when they host Wales in the Six Nations on Saturday.\nGregor Townsend's side are fourth in the standings after successive defeats by Ireland and England, while Wales are yet to win and prop up the table.\nFagerson says the narrow loss at Twickenham last time out was hard to take, but his sole focus is now on ending the tournament on a high with a trip to Paris following the Wales match.\n\"We were all pretty gutted after the game,\" Fagerson said. \"But we had that week to regroup and get those training sessions under our belt.\n\"This competition comes so thick and fast that you can't rest on your last performance. So it's all about making sure we just right our wrongs and go out there and win these last two games. That's the goal going forward.\"\nFagerson says time with his family help him process defeats quickly and it is small tweaks that will help Scotland turn narrow defeats into wins.\n\"Gutted at that time but I got home to my family and the kids don't care if I won or lost,\" he added.\n\"It's all about making sure I go back to being dad for a couple of days and we get back into that review and make sure we can learn from our lessons.\n\"We were close. The boys put in a good shift but it's just that 1%, that 5% in international rugby, it's all about the small margins. We came up short and we've got to do all we can to make sure this weekend we come away with a win.\"", "url": "https://www.bbc.co.uk/sport/articles/c1w0pxlv954o"}