{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:44:30", "date_modify": "2025-04-26 03:44:30", "date_publish": "2025-03-05 07:19:16", "description": "LeBron James becomes the first player in NBA history to score 50,000 combined points as the Los Angeles Lakers beat the New Orleans Pelicans 136-115.", "filename": "sport_basketball_articles_c5yx09e4ld2o_1745639070.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ba55/live/deac2a40-f9b0-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_basketball_articles_c5yx09e4ld2o_1745639070.html", "title": "NBA: LeBron James is first player to surpass 50,000 points in Los Angeles Lakers win over New Orleans Pelicans", "title_page": "NBA: LeBron James is first player to surpass 50,000 points in Los Angeles Lakers win over New Orleans Pelicans - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "LeBron James became the first player in NBA history to score 50,000 combined points as he helped the Los Angeles Lakers to victory over the New Orleans Pelicans.\nThe 40-year-old American surpassed the mark early in the first quarter of his side's 136-115 win, gathering a pass from Luka Doncic and sinking a sublime 25-foot three-pointer.\nJames - the leading scorer in the competition's history - finished the match on 34 points to take his career total to 50,033 which is 6,000 clear of second-placed Kareem Abdul-Jabbar.\nJames' total is made up of a record 41,871 regular season points, adding to his 8,162 postseason haul, where he is also the NBA's leading scorer.\n\"I'm not going to sugar-coat it - it's a hell of a lot of points,\" said James.\n\"I'm super blessed to be able to put up that many points in my career in the best league in the world and against the best players in the world - it's pretty special.\"\nJames reached the milestone deep into his 22nd season, which ties him with Vince Carter for the most played in NBA history.\nHe was helped by Doncic's 30 points, 15 assists and eight rebounds, as the Lakers won their seventh game in a row to climb to second in the Western Conference standings.\nLakers legend Earvin Magic Johnson led the tributes to James on social media following the achievement.\n\"Congratulations to the King LeBron James for becoming the only player in NBA history to score 50,000 regular season and playoff points!\" Johnson wrote on X.\nEarlier on Tuesday, James was also named the NBA's Western Conference Player of the Month after he averaged 29.3 points, 10.5 rebounds and 6.9 assists last month, becoming the oldest player to earn the award.", "url": "https://www.bbc.co.uk/sport/basketball/articles/c5yx09e4ld2o"}