{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:32:08", "date_modify": "2025-05-20 12:32:08", "date_publish": "2023-08-04 09:54:26", "description": "Derry City boss Ruaidhri Higgins says it was \"amazing\" to beat KuPS 5-4 on aggregate and progress to the third qualifying round of the Europa Conference League.", "filename": "sport_football_66404525_1747744328.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/17C5E/production/_130647379_diallocele.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66404525_1747744328.html", "title": "Europa Conference League: Qualifier win a 'special night' for Derry - Higgins", "title_page": "Europa Conference League: Qualifier win a 'special night' for Derry - Higgins - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Derry City boss Ruaidhri Higgins says it was \"amazing\" to overcome KuPS and progress to the third qualifying round of the Europa Conference League.\nThe Candystripes drew 3-3 in the second leg in Finland to clinch a 5-4 aggregate victory.\n\"It's amazing - it makes all the tough times worthwhile and there's been a few this season,\" said Higgins.\n\"People have had cheap shots at us at times but the resilience of the players is unquestionable.\"\nDerry will now face Tobol of Kazakhstan - who defeated Basel - after making it to the third round of a European competition for the first time since 2006.\nThe first leg will take place in Kazakhstan next Thursday at 1500 BST with the 'home' leg at Tallaght Stadium seven days later with a 1945 kick-off.\nDerry are boosted by having Sunday's scheduled game against UCD moved to 6 September to aid in their preparation for the first leg.\nPaul McMullan put City in front but fell 2-1 behind before Sadou Diallo fired home the equaliser.\nThe hosts scored a third goal to level the tie on aggregate but Michael Duffy headed in to book Derry's place in the next and with it a prize fund of 850,000 euro.\n\"If you look at it over the 180 minutes we definitely had the more clearcut chances and looked threatening any time we went forward,\" added Higgins.\n\"The tie was level at half time but I knew there were chances in us, the players knew it and they produced. It's amazing to win two European ties in one season for the first time in 17 years.\n\"The game ebbed and flowed but we're the ones in the next round. It's brilliant for our supporters, chairman, board of directors, players and staff. That's what it's all about - unity within our football club and it's a special night.\n\"We've had a lot of adversity this season but we're now in a good place and our players showed enormous character to stick at it. This is right up there because as a manager you are the figurehead, you are the leader of the club.\n\"It's a lot of responsibility managing Derry City - it's one of the biggest jobs in the country. It's a pressure job but it's also a real privilege. You can make so many people happy.\"\nDerry City director Peter Wallace said that progressing to the third round of qualifying \"means everything\" but admits that it is \"disappointing\" that the club will not play their next European tie at the Brandywell.\n\"It means everything [to progress in Europe], apart from the finance which is the obvious one, it means a lot but it means much more than that. It's a great night for the city and a great night for the fans,\" he added.\n\"Come the night [against Tobol] we'll fill Tallaght and maybe with a bit of planning and a bit of work, we'll not have to do that next year.\n\"I think Philip [O'Doherty] deserves a special mention. Philip, Sean [Barrett] and I joined the club at the same time 20 years ago and he's been supporting it ever since.\n\"He doesn't have to do it, he does it because of his passion for the city and for the club, so last night was maybe a bit of payback for Philip.\"", "url": "https://www.bbc.com/sport/football/66404525"}