{"authors": ["David Michael", "www.facebook.com"], "date_download": "2025-05-21 06:06:46", "date_modify": "2025-05-21 06:06:46", "date_publish": "2024-12-24 15:35:56", "description": "Aston Villa news: Opinion - My moment of the year", "filename": "sport_football_articles_clyx5jr59x5o_1747807606.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d1a5/live/03885470-b627-11ee-8f07-bbfdfa890097.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_clyx5jr59x5o_1747807606.html", "title": "My moment of the year", "title_page": "Aston Villa news: Opinion - My moment of the year - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "When it comes to Aston Villa's moment of the year, there's really only one choice: Jhon Duran's cracking winner in the 1-0 home victory over Bayern Munich in the Champions League.\nIn their 150th anniversary season, it was something of a statement - a triumphant return to Europe's top tier competition after a 42-year absence.\nThe goal was so iconic that the club sold pieces of the net the ball hit as memorabilia - 500 pieces each fetching £60 from eager fans, who seemingly had change from the controversial £94-£97 general admission ticket prices some were required to pay to witness the historic moment.\nThe goal symbolised so much of what is positive about Villa, both in the present and in the broader context of their resurgence.\nFor Duran, just 20 years old at the time, it encapsulated his audacious talent and legitimised his burgeoning reputation which earned him a new contract shortly after. For Unai Emery's team, it marked a rite of passage - a powerful demonstration of what his team are capable of achieving.\nThe goal also served as a poignant reminder of what Aston Villa could and should represent.\nAfter years of tarnished reputation and unfulfilled potential, it was a moment of pride for a new generation of supporters who have had precious few memories of their club at its best. For older fans, it provided a through line from their favourite memories of the past to the present.\nSince that ball flew past Manuel Neuer into the net, it feels like anything is now possible for Aston Villa.", "url": "https://www.bbc.com/sport/football/articles/clyx5jr59x5o"}