{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:14:39", "date_modify": "2025-05-20 12:14:39", "date_publish": "2023-08-04 15:57:35", "description": "Stand-in captain Iain Henderson says Ireland's players must stick to Andy Farrell's \"team-first\" mentality in Saturday's World Cup warm-up game against Italy.", "filename": "sport_rugby-union_66410390_1747743279.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/14F92/production/_130660958_inpho_02303816.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-union_66410390_1747743279.html", "title": "Ireland v Italy: Stand-in Ireland captain Iain Henderson says players can't go 'off-script'", "title_page": "Ireland v Italy: Stand-in Ireland captain Iain Henderson says players can't go 'off-script' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Stand-in captain Iain Henderson has said Ireland's players must stick to head coach Andy Farrell's \"team-first\" mentality in Saturday's World Cup warm-up game against Italy in Dublin.\nHenderson will lead the side for the second time in the first of three preparation matches for France.\nFarrell will cut his current 42-man squad down to 33 for the tournament but Henderson has insisted Irish players cannot focus on staking their own claims for inclusion.\n\"Faz [head coach Andy Farrell] has always had quite a big 'team first, family first' mentality and nothing will stray from that on Saturday,\" Henderson said.\n\"We want to make sure that as we play our game nobody is trying to put their hand up.\n\"They will probably understand that if they go off script and do that themselves, that will more than likely be the type of thing that is not going to get them selected for the World Cup, rather than having someone who is going to work his hardest for the team and do the best that he can to make sure the team succeeds.\"\nLast season was a frustrating one for Ulster lock Henderson, with injuries meaning he was unavailable for a lot of games for club and country.\nHowever, he signed a new two-year Ulster contract in June and has been able to take part in Ireland's training camp ahead of the World Cup, and is looking forward to captaining his country against Italy.\n\"It is probably more experience as I have had a handful of rough seasons over the course of my career,\" Henderson said when asked how he overcomes his injury frustrations.\n\"I have very much got a 'get-on-with-it' mentality which helps me provide the guys that I'm playing with with the best support that I can give them while at the same time ensuring the best outcome for the team.\n\"When you have those things at the forefront of your mind your other worries tend to disappear quickly.\"\nSaturday evening's meeting with Italy in Dublin's Aviva Stadium will see Henderson's Ulster team-mate Jacob Stockdale make his first Ireland appearance in two years.\nThe 27-year-old wing has himself endured injury problems since his last cap and was unable to force his way into the team with Mack Hansen and James Lowe in such good form.\nHowever, Henderson has backed Stockdale to recapture the form that made him such a standout performer in Ireland's 2018 Grand Slam triumph, and push for a place in Farrell's squad for the upcoming World Cup.\n\"Jacob is still an incredible athlete and you still see him in training doing phenomenal things,\" Henderson continued.\n\"At that time [in 2018] our team was on a hot run of form and Jacob finished off a lot of very well created tries from the whole team. He still has all of his athletic attributes, he still has the mindset, the desire and he still has age on his side.\n\"For anyone who knows Jacob personally, he is not one to give up on any sort of argument or fight that you get into with him. Knowing his personality and knowing what he has, I don't think there is any reason why we shouldn't see another 2018 Jacob Stockdale coming out again.\n\"That is exciting for him and is exciting for everyone else. It can be equally frustrating for him at times when he knows what he is capable of doing but he knows himself he has to be patient and continue to work away. He will not throw the head up, I know Jacob will plug away at it.\"\nWith Henderson's previous experience of captaining Ireland coming in a behind-closed-doors Six Nations defeat by France, he said leading the side out against the Italians will be extra special.\n\"Don't get me wrong the first time I captained the side was incredibly special. That was against France, it was a tough game and one of the one that got away from us in that campaign.\n\"However, this is going to be incredibly special for me to have my family at this and to be able to play with the three guys getting their first caps.\"", "url": "https://www.bbc.com/sport/rugby-union/66410390"}