{"authors": ["Chris Wathan", "www.facebook.com"], "date_download": "2025-05-21 05:38:26", "date_modify": "2025-05-21 05:38:26", "date_publish": "2025-01-23 05:09:02", "description": "With the English FA set to rule on plans which could give Welsh EFL clubs a new route into Europe, BBC Sport explains why - and answers many more questions about 'Prosiect Cymru'.", "filename": "sport_football_articles_cevedp3dzj0o_1747805906.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1c89/live/eb738620-d7f9-11ef-94cb-5f844ceb9e30.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cevedp3dzj0o_1747805906.html", "title": "Prosiect Cymru: Why is English FA voting on plans to change Welsh football?", "title_page": "Prosiect Cymru: Why is English FA voting on plans to change Welsh football? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "English football's governing body will meet on Thursday – with a Welsh football matter high on its agenda.\nThe Football Association (FA) board has been tasked with having the final say on plans to allow Wales' EFL clubs enter a new Welsh cup competition.\nThe proposals – dubbed \"game-changing\" by the Football Association of Wales (FAW) – could see Cardiff City, Swansea City, Wrexham and Newport County given the chance to qualify for Europe.\nBut why is a Welsh football proposal being ruled on by the English FA? And what exactly are the consequences?\nThe FAW is the name at the top of the proposals.\nHowever, it was also driven by Swansea and – more latterly – Wrexham. Cardiff and Newport have also signed up, though Newport have stressed they would consult with supporters. The FAW has also claimed it has the backing of European football's governing body Uefa and the Cymru Premier clubs.\nBeing blunt, it is about money. The FAW says the new cup – which would replace the existing Welsh League Cup – would generate £3m a season, with the aim to invest that into grassroots infrastructure projects, women's football and the domestic game in general.\nBut there is also the longer-term hope that the EFL clubs would perform better in Europe than Cymru Premier clubs have managed in recent years – with the notable exception of The New Saints this season.\nBetter results improves the coefficient – the country's ranking – which helps earn more money from Uefa for the association to hand out.\nFor the EFL clubs, there is the chance to play in Europe – and the financial and commercial benefits that come from it.\nEuropean prize money is well documented, with TNS receiving around £5m for reaching the group stage of the Europa Conference League this season.\nBigger attendances and new sponsorships will also attract clubs, not least Wrexham who may be eyeing a new European market in which to tell their Hollywood story.\nAs for the £3m for the new competition, details have not been made public but the FAW says a report by financial experts Deloitte generated the figure.\nBecause it involves clubs who have long been playing in the English system having been essentially invited more than a century ago.\nAssurances had already been given that the four Welsh clubs would continue playing in the EFL but – for that to happen – the FA needs to rule and England's governing associaition has decided that it needs a full board meeting to have the final say.\nRead More: Why do some Welsh clubs play football in England?\nFixture congestion has been mentioned given Championship games, for example, often take place in midweek at the same time as European games.\nBut it is again down to money. With tight regulations over profit and sustainability rules (PSR), it is being argued Wales' clubs – with their greater chance of reaching Europe – would have an unfair advantage.\nThe FAW has said clubs would not include the revenues in their PSR accounting, but they would still benefit from extra ticket sales and possible bigger commercial and sponsorship deals – or even being more attractive to potential signings.\nYes, but the majority of times that was when they entered into the Welsh Cup and qualified for the Cup Winners' Cup. Uefa put a stop to that in 1995.\nWhen Swansea reached the Europa League in 2013 for winning the League Cup, they were technically representing England.\nWhile the majority of Cymru Premier clubs have backed the plans – which could cost a domestic side a chance to play in Europe - two have said they want to see more details before giving their full support.\nAnd Wales' only side in the English non-league system, Merthyr, were not included in plans, although they have been the subject of a separate attempt to persuade them to join the Cymru Premier.", "url": "https://www.bbc.com/sport/football/articles/cevedp3dzj0o"}