{"authors": ["Sophie Hurcom", "www.facebook.com"], "date_download": "2025-05-21 07:09:38", "date_modify": "2025-05-21 07:09:38", "date_publish": "2025-03-30 11:35:36", "description": "High-scoring, entertaining rugby is what the Premiership \"needs\", say Bristol and Gloucester bosses after 13-try spectacle at Kingsholm.", "filename": "sport_rugby-union_articles_cvgp3nxxmk7o_1747811378.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/09fc/live/308b1b20-0d46-11f0-ba60-d940d37fa5dc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cvgp3nxxmk7o_1747811378.html", "title": "High-scoring games bringing new fans to Premiership, say club bosses", "title_page": "High-scoring games bringing new fans to Premiership, say club bosses - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "High-scoring, high-entertainment running rugby is just what the Premiership \"needs\", according to Gloucester and Bristol after they shared 81 points and 13 tries at Kingsholm on Saturday.\nGloucester ran rampant in the West Country derby, scoring nine tries in a 53-28 win over the Bears.\nSome have questioned if the quest for attacking flair is coming at a detriment to defence, but Bristol director of rugby of rugby Pat Lam said the style is bringing more fans to the game.\n\"I think you've just got to look at the Bristol crowd [against Exeter Chiefs] last week, the Gloucester crowd [on Saturday],\" he told BBC Sport.\n\"They enjoyed the rugby, we're enjoying rugby. I'm pretty sure everyone's talking about these caterpillars [rucks], these box[-kicking] fests.\n\"The purists might not like it but it's not about the purists. It's about the young people, it's about people enjoying coming to games.\"\nThe match was played in front of a capacity crowd at Gloucester, and Lam added that attracting new fans is important for the future of the game.\n\"We sold out here, we had our second biggest crowd last week, our game against Bath [at the Principality Stadium in May], the crowd's building there,\" he said.\n\"People want to be entertained. Our game needs people coming to rugby. I'm pretty confident that Gloucester are going to continue selling out because they're playing great rugby.\n\"You're always going to get people complaining, but I would look more at the positives where people are loving and enjoying it – particularly the kids, that's what I like because that's our future.\"\nLam said in the week before the match that the contest had the potential to be \"one of the best\" with two of the Premiership's most potent attacking sides meeting.\nBristol under Lam have long been known as a team based around slick backline runners - they have surpassed 50 points themselves in six games so far this campaign.\nBut under attack coach James Lightfoot Brown, Gloucester have this season followed a similar style, and to great effect.\nBoth sides occupy many of the top places in the league's stats for metres made, line breaks per game, and offloads.\nWith points totals of 470 (Bristol) and 397 (Gloucester), only league leaders Bath have scored more (487) this season. However, only bottom side Newcastle Falcons have conceded more than their 415 (Bristol) and 358 (Gloucester) totals.\nGloucester director of rugby George Skivington said it is not a case of defensive play being ignored, simply that attacks are getting better.\n\"There's no doubt it's entertaining, and in a game like [Saturday,] which was physical and no-one threw the towel in in defence – people are trying to defend,\" he said.\n\"I think attacks have just gone to another level and people are investing time in it. It's not a case of defence is disappearing, it's a case of attacks are really challenging defences.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/cvgp3nxxmk7o"}