{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-05-21 06:30:57", "date_modify": "2025-05-21 06:30:57", "date_publish": "2025-03-31 21:32:40", "description": "Manchester United head coach Ruben Amorim says he has told Bruno Fernandes he will not allow him to leave this summer.", "filename": "sport_football_articles_c985ydx5g4po_1747809057.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3c90/live/83a68680-0eba-11f0-bca8-c744c2d900f1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c985ydx5g4po_1747809057.html", "title": "Bruno Fernandes: Man Utd captain will not leave this summer says head coach Ruben Amorim", "title_page": "Bruno Fernandes: Man Utd captain will not leave this summer says head coach Ruben Amorim - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester United head coach Ruben Amorim says he has told Bruno Fernandes he will not allow him to leave this summer.\nClub captain Fernandes - who signed a contract extension until 2027 last August - has been United's star player this season.\nOver the weekend reports emerged linking the 30-year-old with a move to Real Madrid.\n\"No, it's not going to happen,\" said Amorim, when asked about the rumours in his news conference before Tuesday's Premier League trip to Nottingham Forest.\nWhen asked how he could be so certain, the former Sporting coach added: \"He's not going anywhere because I've already told him.\"\nThere was the familiar spark in Amorim's eyes as he delivered the message, suggesting he was having a bit of fun.\nFernandes has scored 16 times in all competitions this season while no other United player has reached double figures.\nIn the final week before the most recent international break, Fernandes scored five goals, including a hat-trick in the Europa League last-16 victory over Real Sociedad.\nOnly Mohammed Salah (54) and Erling Haaland (33) have more than Fernandes' combination of 31 goals and assists in the Premier League this term.\nUnited have struggled in the league and are in 13th position before they face third-placed Nottingham Forest at the City ground.", "url": "https://www.bbc.com/sport/football/articles/c985ydx5g4po"}