{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:31:55", "date_modify": "2025-05-21 04:31:55", "date_publish": "2025-04-05 07:34:53", "description": "Rangers defender linked with Dutch move, Fin Robertson makes case at Dundee and ex-Celtic star tipped to return.", "filename": "sport_football_articles_c4g7dvlgxlro_1747801915.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0b0d/live/9a4e7c60-11f5-11f0-b234-07dc7691c360.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c4g7dvlgxlro_1747801915.html", "title": "Propper linked with Dutch return - Scottish gossip", "title_page": "Rangers' Robin Propper linked with Dutch return - Scottish gossip - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Rangers defender Robin Propper, 31, is linked with a return to his native Netherlands this summer. (Sun), external\nFin Robertson, 22, is eager to take over from Lyall Cameron, 22, at Dundee when the midfielder moves to Rangers at the end of the season. (Record), external\nCeltic winger Jota, 26, expects to improve for next season and be formidable as \"Jota 2.0\". (Herald - subscription required), external\nFormer Celtic player Peter Grant believes Brighton and Hove Albion midfielder Matt O'Riley, 24, could return to Celtic Park this summer. (Record), external\nHibernian midfielder Joe Newell, 32, may not play again this season. (Scotsman - subscription required), external\nDundee United wide man Will Ferry, 24, is walking a suspension tightrope as the season-defining run-in approaches. (Courier - subscription required), external\nQualifying for Europe will not define Hearts' summer transfer business, says head coach Neil Critchley. (Edinburgh Evening News - subscription required), external\nBarry Douglas, 35, says St Johnstone are adopting a \"nothing to lose\" attitude in their fight against relegation. (Courier - subscription required), external", "url": "https://www.bbc.com/sport/football/articles/c4g7dvlgxlro"}