{"authors": ["George O'Neill", "www.facebook.com"], "date_download": "2025-04-26 06:52:54", "date_modify": "2025-04-26 06:52:54", "date_publish": "2025-02-28 16:55:20", "description": "'Togetherness' in Hibs squad crucial in unbeaten run - Gray", "filename": "sport_articles_cdxqn641rxdo_1745650374.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cbaa/live/aced4170-f5f4-11ef-bd6e-cd71c2e1454a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cdxqn641rxdo_1745650374.html", "title": "'Togetherness' in Hibs squad crucial in unbeaten run - Gray", "title_page": "'Togetherness' in Hibs squad crucial in unbeaten run - Gray - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Hibs head coach David Gray says his side's impressive form provides a \"brilliant opportunity\" to finish the Scottish Premiership season on a high and secure European football.\nThe Easter Road club have put their torrid start behind them with a 14-match unbeaten run and are just one point behind Aberdeen in third.\nThey take on Edinburgh rivals Hearts on Sunday, who themselves have shot up the table into the top six with a strong run of results.\nHibs won the last meeting of the sides 2-1 at Tynecastle on Boxing Day, and Gray says his team are riding the crest of a wave heading into the much-anticipated derby, having beaten Celtic and Dundee United in their past two matches.\nSunshine on Leith was sung proudly by the Easter Road crowd after the Celtic victory, while the entire squad celebrated with the sizeable away following at Tannadice on Wednesday.\n\"We're talking about it a lot, that togetherness,\" Gray said. \"A lot of that was built on the poor start, constantly being questioned.\n\"When you see the scenes - Sunshine on Leith, winning at Tynecastle for the first time in five years was huge, even just the scenes at Dundee United at the full-time whistle. Everybody running directly to the fans, you really feel it.\n\"We're seeing that in the performances as well - subs coming on and affecting the game. That helps with winning games.\n\"We can't go into the derby in a better place than we are, but nothing changes in terms of what we need to achieve moving forwards.\"\nGray won't let his players rest of their laurels though with just five games to go until the split.\n\"[The run of form has] been brilliant,\" he said. \"We've given ourselves a brilliant opportunity because we've had to go on that run. You look at how tight the table still is, it just shows you how difficult that run is.\n\"We need to keep moving forward, keep progressing because we've still got a lot to do and there's still a lot of huge games before the split. Once we see where we are, we can start looking up the way from there.\"", "url": "https://www.bbc.co.uk/sport/articles/cdxqn641rxdo"}