{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:05:39", "date_modify": "2025-05-21 07:05:39", "date_publish": "2025-03-29 00:00:00", "description": "Play-off chasing Stockport County have Ethan Pye sent off in added time but hold out for a home win over Burton Albion.", "filename": "sport_football_live_c9dezez06d3t_1747811139.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c9dezez06d3t_1747811139.html", "title": "Stockport County 2-1 Burton Albion", "title_page": "Stockport County 2-1 Burton Albion - 10-man Hatters hang on for win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Stockport strengthened their hold on a League One play-off place with a tense victory over relegation-threatened Burton.\nThere was a slight delay to kick-off at Edgeley Park with fans taking longer than usual to get into the stands, but the hosts were soon up and running.\nMax Crocombe kept out Will Collar's effort, but Kyle Wootton was on hand to head the rebound home in the eighth minute.\nThe Brewers keeper did well to stop Tanto Olaofe from doubling the lead five minutes later, while Stockport's Corey Addai produced a good low save to keep out Owen Dodgson at the other end.\nEthan Pye then denied Charlie Webster what looked a certain equaliser with a block just before the break.\nAnthony Forde came close to drawing the visitors level as Addai palmed his free-kick away.\nBut the Hatters doubled their lead 13 minutes from time as Jack Diamond raced clear and teed up Olaofe.\nThere was a late scare as Albion pulled one back through Julian Larsson, from Jack Stretton's flick, in stoppage time.\nPye was sent off when he picked up a second yellow late on for a desperate challenge on Kyran Lofthouse, but County held on.", "url": "https://www.bbc.com/sport/football/live/c9dezez06d3t"}