{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:42:41", "date_modify": "2025-05-21 07:42:41", "date_publish": "2025-05-20 13:40:11", "description": "Man City news: Fan on FA Cup final defeat", "filename": "sport_football_articles_cx2jjk35750o_1747813361.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f5e6/live/ece36130-356c-11f0-8b28-6f0e47ba60fe.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cx2jjk35750o_1747813361.html", "title": "Man City news: Fan on FA Cup final defeat", "title_page": "Man City news: Fan on FA Cup final defeat - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester City fan Rachel Herdson spoke to BBC Radio 5 Live and suggests that boss Pep Guardiola might have to learn something from Liverpool's Arne Slot after their FA Cup final defeat.\n\"I'm pleased for Crystal Palace and I think every City fan there was pleased for Palace but it was all pretty predictable in terms of how we were going to set up and how we were going to be hurt and I fully expect Bournemouth to do the same tonight - putting 10 men behind the ball, low block, fast transitions and hitting us on the counter.\n\"There's a way to play against us that, ultimately, in a results business, people aren't bothered about whether it's pretty or not, but that's how they get the job done against City and the frustration, I think, is that Pep hasn't found a way to combat that.\n\"In an interview with Mohamed Salah on Monday night, Salah was suggesting that one of the reasons Slot has been so successful this season is his ability to change tactics mid-game to suit the opposition and it really did pour salt in the wound because that is one thing that Pep will not do. He won't deviate from his style of play and that's cost us a little bit this season.\n\"Obviously, there are lot of other issues in terms of injuries and quality of signings etc, but that's one thing that has hurt us.\"", "url": "https://www.bbc.com/sport/football/articles/cx2jjk35750o"}