{"authors": ["Andrew Benson", "www.facebook.com"], "date_download": "2025-05-21 07:43:44", "date_modify": "2025-05-21 07:43:44", "date_publish": "2025-03-28 10:03:12", "description": "Red Bull motorsport adviser Helmut Marko admits the team \"made a mistake\" with their decision-making over Liam Lawson.", "filename": "sport_formula1_articles_ckgzg0mjkero_1747813424.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8b91/live/300c0460-0bb7-11f0-8e25-91624fd3b00c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_formula1_articles_ckgzg0mjkero_1747813424.html", "title": "Liam Lawson: Red Bull chief Helmut Marko says team 'made mistake' with their decision-making", "title_page": "Liam Lawson: Red Bull chief Helmut Marko says team 'made mistake' with their decision-making - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Red Bull \"made a mistake\" with their decision-making over Liam Lawson, says motorsport adviser Helmut Marko.\nThe New Zealander has been demoted from his position as Max Verstappen's team-mate after poor performances in the first two races of the season.\nLawson has returned to Red Bull's second team in a swap with Japan's Yuki Tsunoda.\nMarko told BBC Radio 5 Live Breakfast: \"His performance was unfortunately not good enough and that comes from self-confidence.\"\nThe 81-year-old Austrian, a key player in Red Bull driver decisions, said Lawson had \"lost confidence and he couldn't show his real potential\".\nLawson qualified 18th at the season-opening Australian Grand Prix and crashed out of the race. In China last weekend, he qualified last for both the sprint and the grand prix, and finished 14th and 12th.\nWorld champion Verstappen was second in Melbourne and fourth in Shanghai. The next race is the Japanese Grand Prix, from 4-6 April.\nLawson, 23, admitted he found his demotion \"tough\" but said he is excited to work with his former team Racing Bulls.\n\"Being a Red Bull Racing driver has been my dream since I was a kid, it's what I've worked towards my whole life,\" he wrote on Instagram.\n\"I'm grateful for everything that's brought me to this point. To every one of you who's stood by me, thank you for all the support. It means the world.\"\nMarko said that Tsunoda, 24, would be given \"to the end of the season\" at Red Bull to prove himself \"because we believe he can do the job\".\nAsked why the Japanese was the right driver now, when they had decided at the end of last season that Lawson was a better bet, Marko said: \"Tsunoda made a big step. It's strange after four years, now in his fifth year, he is a much stronger personality, he has more confidence and he did two very good races, it's just his strategy didn't work at Racing Bulls.\n\"In this case, a very difficult car experience is something that will help. That was our thoughts.\"\nMarko said that Red Bull decided not to give Lawson another chance at the Japanese Grand Prix, which is the first race this season to be held on a circuit Lawson has experienced before, because \"we were worried that his self-confidence is so damaged that he couldn't bring his normal performance\".\nHe added: \"And on the other hand we have two drivers for the constructors' championship but also to support Max strategy-wise, if you have two drivers top five or eight it is easier to max a strategy that favours the number-one driver.\"\nMarko insisted that the swap with Tsunoda was \"not a demotion\" for Lawson.\n\"He's not kicked out of F1 and Racing Bulls will give him the chance to recover and his career will start again,\" Marko said.\nHe pointed to the experience of drivers Red Bull had previously dropped as evidence that Lawson could rebuild his career.\nMarko said: \"For the benefit for him, he goes back to Racing Bulls, which has a car capable to be top 10 in qualifying and the race.\n\"Just look in the past, it was [Pierre] Gasly, it happened the same, also to [Alex] Albon and they recovered and they are now competitive F1 drivers.\n\"On top of it, the RB21 is a car which is not the fastest car but nevertheless very difficult to drive and Max can handle but not at this stage Liam.\"\nMarko said he believed Red Bull could fix the problems with their car and deliver a fifth title for Verstappen.\nBut he admitted the Dutchman could consider leaving if the car's pace did not improve.\n\"We have this huge motivation to achieve this fifth title,\" Marko said. \"We also know that if we don't deliver for Max, all the top drivers have performance clauses in their contract.\n\"So we have to make sure he gets a car where he can win and there was a very constructive meeting last Thursday, Max with the engineers, and they discussed how to go forward to improve the car and make it more drivable and to have a wider range of drivability, and all that went very positive.\n\"So it's just two races, we are eight points behind. And the whole team is focused to achieve this fifth title which we didn't make with [Sebastian] Vettel but this time there is a possibility.\n\"And if you look at the lap times from Max on the hard tyre [in the Chinese Grand Prix], we were competitive but not everywhere like on the McLaren but we are not so much off as it looks sometimes.\"\nMeanwhile, Verstappen appeared to offer his opinion on Lawson's demotion by 'liking' an Instagram, external post from former F1 driver Giedo van der Garde that described it as a \"panic move\".", "url": "https://www.bbc.com/sport/formula1/articles/ckgzg0mjkero"}