{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:15:21", "date_modify": "2025-05-21 07:15:21", "date_publish": "2025-03-29 07:08:40", "description": "Ireland scrum-half Aoibheann Reilly says recovering from two ACL injuries in the space of nine months will help build her character.", "filename": "sport_rugby-union_articles_cd0n18kznjro_1747811721.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9ceb/live/0c307f10-0b41-11f0-80cd-45d386f77565.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cd0n18kznjro_1747811721.html", "title": "Women's Six Nations: Aoibheann Reilly says injury setbacks have 'built my resilience'", "title_page": "Women's Six Nations: Aoibheann Reilly says injury setbacks have 'built my resilience' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Having to overcome two anterior cruciate ligament (ACL) injuries in the space of nine months would be enough to break the spirit of many sportspeople.\nBut in the case of Ireland scrum-half Aoibheann Reilly, she is determined to use her experience of those setbacks to help her navigate her future rugby career and give her further incentive.\nAfter initially battling her way back from her first serious knee injury in the autumn of 2023, the 24-year-old suffered a second ACL tear in last summer's SVNS Grand Final in Madrid.\nThat injury dashed her hopes of playing for Ireland Sevens in the Paris Olympic Games and the Roscommon woman only returned to competitive action when she played a part in the Clovers' Celtic Challenge matches in early March.\nLast week Reilly was introduced off the bench as a replacement for Emily Lane to participate in the closing 25 minutes of Ireland's 27-15 defeat by France in their opening Six Nations encounter in Belfast.\nThis week she has been named in the starting line-up for Sunday's away encounter with Italy in Parma.\n\"I did my right ACL the first time and my left the second time. I had nine months of playing in between both. It was mentally very tough but I knew hopefully once I got it right that would be the end of me in terms of long-term injuries,\" explained Reilly.\n\"Coming back from the first one, I wanted to go to the Olympics and I also wanted that nine jersey for Ireland in the 15s game. I was really focused on putting my hand up for both teams.\n\"It was very tough but I had so many team-mates around me to support me and my family were amazing. Although it was a really tough moment, it really builds me as a player and builds my resilience.\n\"It was an experience that I wouldn't wish on anyone but I think it will really stand to me in the future.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/cd0n18kznjro"}