{"authors": ["Tom Brown", "www.facebook.com"], "date_download": "2025-05-21 06:27:44", "date_modify": "2025-05-21 06:27:44", "date_publish": "2025-04-01 04:19:48", "description": "After becoming an indoor 60m European and world champion, Welsh sprinter Jeremiah Azu turns his attention to the outdoor season.", "filename": "sport_athletics_articles_cpwz52n8lwpo_1747808864.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/adbf/live/2c3d1210-0ed8-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_athletics_articles_cpwz52n8lwpo_1747808864.html", "title": "Four golds and a baby boy", "title_page": "Four golds and a baby boy - but what's next for Jeremiah Azu? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jeremiah Azu said he wanted 2025 to be the best year of his life.\nIt has certainly got off to a good start.\nOn the indoor 60m track, he became Welsh champion, British champion, European champion and world champion.\nHe also welcomed his son into the world to become a father for the first time.\nAfter his statement win at the World Indoor Championships in China, he had some much-needed time off with his family.\nBut a week later he is back training in the Cardiff sunshine - and dreaming of more success as the outdoor season begins.\n\"Even sometimes now it doesn't feel real,\" he tells BBC Sport Wales. \"It's the moment when you say it out loud, that's when you really realise what you've done.\"\nAzu is revelling in the moment.\n\"I've loved every moment since being home. My family were there cheering me on when I walked into the house, just picking me up, throwing me around. It was just a big celebration.\n\"I want to go to the top. I want to win global titles. It just adds to that motivation.\n\"Before it was for my family. But now it's really for my own son and my wife and I think you can't really beat those motivations.\"\nThe 23-year-old has never lacked confidence. He puts it down to his family's support and unshakeable belief in God.\nBut there is a humility to him that perhaps does not show in his customary startline dances for the cameras.\nTwo days after becoming European indoor champion over 60m last month, he was part of an event in Wales to mark Commonwealth Day. Long after the guests had gone, he remained behind to help tidy away the chairs.\nOn the track, the results are starting to justify that confidence in himself.\nHe won Olympic bronze in the men's 4x100m relay in Paris last summer and his world indoor title last month has further elevated his rising status in the sport.\n\"It's easy to be confident,\" he continues. \"You can fake it.\n\"I've never been a fake confident person. I'm just Jeremiah. Some people think I am confident, over-confident, under-confident, whatever it is. But for me it's knowing that I'm able to do what I've always believed I can do.\n\"I've learnt how to win and I think that's important in athletics. Because in the final everyone's fast, everyone's talented, but it's who actually believes it.\n\"Who's got that ability to not panic? Who's got that ability to time their dip right? It's all these little things that just allow you to have that confidence to walk in with the trust in the training you've done and in the team around you and your coach.\"\nHis new coach is now his old coach. He first worked with Helen James as a 17-year-old and, after a two-year spell under Marco Airale in Italy, Azu is back with James in Cardiff.\n\"The world's his oyster,\" she tells us. \"He's going to go a long way further than this.\"\nHis focus shifts to the upcoming outdoor season and a return to China for the start of the Diamond League and World Athletics Relays event in May.\nWhen he returns to the UK again, he will add more 200m events to his 100m programme in the hope of broadening his future medal prospects and helping increase his top-end speed.\nBut he has more than one eye already on September's World Championships in Tokyo.\n\"Coming in as world indoor champion, now there's a bit more expectation,\" Azu says.\n\"But for me I'm not really doing this for anyone. I don't want to prove myself to anyone. I do this because I know I can do this. Because my ability shows me that I was born to do this.\n\"There is not a thing that I'm not going to do, there's not an exercise that I'm going to leave.\n\"I go into everything wanting to be the best. So I just continue with that mindset towards everything.\"", "url": "https://www.bbc.com/sport/athletics/articles/cpwz52n8lwpo"}