{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:53:04", "date_modify": "2025-05-21 06:53:04", "date_publish": "2025-01-22 14:02:35", "description": "Wilfried Zaha joins Major League Soccer side Charlotte FC on loan until January 2026, with an option to extend until June 2026.", "filename": "sport_football_articles_c99y10rr1jlo_1747810384.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a812/live/28278f10-d84c-11ef-82aa-e57c2d6a6d4b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c99y10rr1jlo_1747810384.html", "title": "Wilfried Zaha joins Charlotte FC on loan from Galatasaray", "title_page": "Wilfried Zaha joins Charlotte FC on loan from Galatasaray - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wilfried Zaha has joined Major League Soccer club Charlotte FC on loan until January 2026, with an option to extend until June 2026.\nThe former Crystal Palace forward had been on loan with Lyon having joined from Galatasaray last summer.\nHe has made just six appearances for the French side this season, five of them as a substitute.\nZaha, 32, will fill a Designated Player spot at Charlotte - a rule which allows an MLS franchise to sign up to three players that would be considered outside a club's salary cap.\nZoran Krneta, general manager of the North Carolina-based franchise, described Zaha as a \"world class talent\" and an \"elite goalscorer\".\nHe added: \"Wilfried's performances in the Premier League and on the international level speak for themselves and we are confident he can make an immediate impact in Major League Soccer.\"\nZaha made 458 appearances for Palace, the third-most in the club's history, and scored 90 goals.\nHe joined Manchester United in 2013 but returned to Selhurst Park a year later, initially on loan.\nThe Ivory Coast international moved to Galatasaray on a three-year deal after his contract with the Eagles expired in the summer of 2023.\nIn his one season with the Turkish side, Zaha scored 10 goals and claimed five assists in 42 games as Galatasaray were crowned Super Lig champions.", "url": "https://www.bbc.com/sport/football/articles/c99y10rr1jlo"}