{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 08:00:23", "date_modify": "2025-05-21 08:00:23", "date_publish": "2025-05-19 16:54:40", "description": "Hampshire and Lancashire remain at the top of the One-Day Cup table after wins over Warwickshire and Durham, while Essex are beaten by Surrey.", "filename": "sport_cricket_articles_c2d5e1rnrxno_1747814423.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/30d2/live/8fa5d260-34cb-11f0-8ca3-49a2defac508.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c2d5e1rnrxno_1747814423.html", "title": "One-Day Cup: Hampshire and Lancashire win again, Surrey beat Essex", "title_page": "One-Day Cup: Hampshire and Lancashire win again, Surrey beat Essex - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Charli Knott and Georgia Adams shared a stand of 114 as One-Day Cup group leaders Hampshire edged home by three wickets against Warwickshire at Arundel.\nKnott made 82 off 88 balls and Adams 68, but they had to rely on the lower order to see them home on 246-7 with four balls remaining.\nEmma Lamb took her run total in the competition to 577 by making 82 for second-placed Lancashire as they beat Durham by 35 runs, with Sophie Morris claiming 5-33.\nBottom of the table Essex came up just short against Surrey at Chelmsford, losing by 14 runs despite a brilliant 73 not out from just 46 balls by Jo Gardner as they chased a target of 260.\nThe games were the final ones for all six teams until the tier one competition resumes on 24 July.\nOnce again, Lamb was the star performer with the bat for Lancashire as she passed 50 for the fourth game in a row before being bowled by spinner Katie Levick in the 30th over at Blackpool.\nPhoebe Turner and Mady Villiers took three wickets each as the Red Rose were bowled out for 239 and despite losing Emma Marlow to the fourth ball of their reply, Suzi Bates and captain Hollie Armitage laid a solid base for their chase.\nThey put on 74 before Armitage was caught off Grace Potts for 47, but Bess Heath (45) helped Bates add 65 before the innings went into decline.\nHeath was caught off Mahika Gaur and Morris bowled Bates for 63 with one that kept a little low to leave Durham on 170-6 and she and Kate Cross worked their way through the tail as the visitors were all out for 204 at the start of the 45th over.\nIt briefly looked like the win might take them to the top as Hampshire's chase against Warwickshire lost momentum following the loss of Knott and Adams.\nWarwickshire's score of 243-7 was built on a stand of 97 between Abi Freeborn and Charis Pavely, who came together with the score on 93-6.\nPavely scored 55 before being stumped off Adams' off-spin, but Freeborn stayed to the end, hitting 12 fours in her 94 not out.\nHampshire lost both openers with 43 on the board but Australian Knott struck 12 boundaries, supported by the patient Adams, before she was caught off Georgia Davis, top edging a sweep.\nAdams followed, bowled by Hannah Baker, and they needed 41 from the final seven overs.\nTwo more wickets fell but Mary Taylor's unbeaten 21 off 18 balls got them over the line - and both Hampshire and Lancashire now have six wins from eight games.\n\"There was some pressure towards the end but we stuck with it and went all the way until the end,\" said Taylor.\n\"Over the course of this block (of games) the girls have been brilliant and a pleasure to watch. We are such a young side so it is cool we have stepped up and got to the top of the table.\"", "url": "https://www.bbc.com/sport/cricket/articles/c2d5e1rnrxno"}