{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:27:18", "date_modify": "2025-04-26 07:27:18", "date_publish": "2025-02-27 20:11:00", "description": "Glentoran manager Declan Devine says his side must be at their best to see off the challenge of Championship leaders Bangor in Friday night's Irish Cup quarter-final, which will be streamed live on BBC iPlayer.", "filename": "sport_articles_cm2jj0lyg08o_1745652438.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4697/live/b13dc9f0-f5bf-11ef-9aa5-8f9f2163b0a2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cm2jj0lyg08o_1745652438.html", "title": "'We have to be at our best to progress' - Devine", "title_page": "Irish Cup: 'We have to be at our best to progress' - Devine  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Glentoran manager Declan Devine says his side will have to be at their best to overcome Championship leaders Bangor in their Irish Cup quarter-final tie at Clandeboye Park on Friday, a match which will be broadcast live on BBC iPlayer and the BBC Sport website and app.\nThe Glens' 16-game unbeaten run in all competitions came to an end with a 2-0 Premiership defeat by Cliftonville last week.\nHaving already collected the County Antrim Shield in January however, Declan Devine's charges remain on course for further knockout trophy success ahead of their meeting with the second tier pacesetters in the Irish Cup, before a BetMcLean Cup final date with Cliftonville on 9 March.\n\"Tough game, a tough venue, a team that's really on form,\" summed up Devine of the task awaiting his side against the Seasiders.\n\"I went to see them [Bangor] on Saturday [a 3-0 Championship win away to Armagh City] and they were 3-0 up at half-time and could have been five or six up.\n\"They have a real high level goal threat in the final third.\"\nLee Feeney's team have built up an eight-point lead at the summit of the Championship as they seek a long-awaited return to the top division.\n\"It's good to see Bangor back really growing as a club again and with the potential to go back into the top flight as they have had some tough years,\" added Devine.\n\"The players are fully informed of their strengths and we know that on Friday night we have to be really at it in terms of our willingness to defend and attack and play with the qualities we've played with for a long period of time to get through this tie.\"\nThe Glens have defeated near neighbours Harland & Wolff Welders and cross-city rivals Linfield to reach the last eight of the competition while Bangor have beaten Newington and Annagh United to book their berth.", "url": "https://www.bbc.co.uk/sport/articles/cm2jj0lyg08o"}