{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:40:37", "date_modify": "2025-05-21 04:40:37", "date_publish": "2025-04-03 09:19:28", "description": "Former Derby County striker Malcolm Christie says it's a \"collective effort\" between the players, head coach and fans which has helped them to four wins in a row.", "filename": "sport_football_articles_c4g2xdg6jxeo_1747802437.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/16a6/live/4c12d3a0-106c-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c4g2xdg6jxeo_1747802437.html", "title": "Derby County: How much better does this feel?", "title_page": "Derby County: How much better does this feel? - Malcolm Christie - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Derby County striker Malcolm Christie says it's a \"collective effort\" between the players, head coach John Eustace and fans which has helped them to a fourth win on the bounce.\nThe 2-0 victory over Preston at Pride Park on Friday evening was the first time the Rams have won four consecutive games since March last year in League One - and the first in the Championship since July 2020.\n\"A job well done, isn't it?\" Christie told the Rams Daily podcast after the win moved Derby out of the relegation zone and one point clear of danger with seven matches remaining.\n\"The performance in that first half was a forgettable performance in many respects.\n\"But they came out with a renewed vigour in that second half. I've said it all the time, just get the ball in the right areas and this Rams team have got players there that can attack the ball.\n\"Credit to Callum Elder again putting the ball into the right areas, Nat Phillips attacking the ball. Fantastic.\n\"And obviously the finishing… Craig Forsyth, really good finish on his left foot and Jerry Yates, Johnny-on-the-spot in the six-yard box for 2-0.\n\"Derby players warmly applauded the fans who were terrific again. To hear the crowd and just to see that league table. How much better does this feel?\"\nChristie said \"this is what we've wanted\" and that Eustace was \"as animated as we've seen him\" at full-time.\n\"He's loving it, as the players should and as the fans should as well,\" Christie added.\n\"It's been a long, hard slog of a season in many respects and finally things are looking up and not down at the moment.\n\"Credit to the support base that stuck by this team and finally we've got something to put smiles on our faces, which is brilliant.\"", "url": "https://www.bbc.com/sport/football/articles/c4g2xdg6jxeo"}