{"authors": ["Phil McNulty", "www.facebook.com"], "date_download": "2025-05-19 15:15:37", "date_modify": "2025-05-19 15:15:37", "date_publish": "2015-03-02 12:32:57", "description": "Christian Benteke's late penalty hands Tim Sherwood his first points as Aston Villa manager with a win over West Brom.", "filename": "sport_football_31598202_1747667737.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81382000/jpg/_81382000_bentekeceleb_g.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31598202_1747667737.html", "title": "Aston Villa 2-1 West Bromwich Albion", "title_page": "Aston Villa 2-1 West Bromwich Albion - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Christian Benteke scored from the penalty spot deep into injury time to give Tim Sherwood his first win as Aston Villa manager and lift them out of the Premier League relegation zone.\nSaido Berahino's 18th goal of the season looked to have extended Villa's run without victory to 13 league games after he equalised Gabriel Agbonlahor's first-half goal.\nBut with only seconds remaining, West Brom keeper Ben Foster capped a performance riddled with uncertainty by fumbling a clearance then rushing out to bring down Matthew Lowton.\nBenteke kept his cool to slide in the spot-kick in front an ecstatic Holte End to give Villa three points for the first time since 7 December.\nSherwood celebrated wildly with his backroom staff as the first of the six wins he says Villa need to stay up was secured - thanks in large part to Foster's poor handling and a rush of blood with the game almost over.\nThe former England midfielder will have been delighted by a vibrant first-half performance that was an example of the \"front foot football\" he is demanding, but Villa went off the boil after the break and needed that dramatic conclusion to get the win.\nIt was safe to assume manager Tony Pulis would have had harsh words with his players after a dreadful first-half performance and they were almost on terms early in the second half when Craig Dawson should have done better than miss the target from seven yards after meeting Chris Brunt's perfect free-kick.\nVilla did not heed the warning signs and another super delivery from Brunt yielded the equaliser in the 66th minute, his dangerous corner being met at the far post by Lescott and Berahino reacting instinctively in a packed six-yard box to head past Guzan.\nThe Baggies' equaliser shook Villa and tensions almost boiled over when Berahino and Alan Hutton squared up following a nasty challenge from the latter, who escaped with just a booking.\nAmid the nerves and frustration at Villa Park it looked like Pulis's side had earned a draw until those final few seconds and Benteke's decisive penalty.", "url": "https://www.bbc.com/sport/football/31598202"}