{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:28:31", "date_modify": "2025-05-19 15:28:31", "date_publish": "2017-08-09 15:09:50", "description": "Botswana's Isaac Makwala joins South African favourite Wayde van Niekerk in qualifying for the World Championships 200m final.", "filename": "sport_athletics_40880484_1747668511.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/D06D/production/_97275335_041011971.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_athletics_40880484_1747668511.html", "title": "World Championships: Isaac Makwala and Wayde van Niekerk in 200m final", "title_page": "World Championships: Isaac Makwala and Wayde van Niekerk in 200m final - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Botswana's Isaac Makwala joined South African favourite Wayde van Niekerk in the World Championships 200m final - having earlier qualified for the semis with a solo run at London Stadium.\nMakwala missed Monday's heats while barred from competing as officials dealt with a norovirus outbreak.\nHe came out of quarantine at 14:00 BST on Wednesday and ran a time of 20.20 seconds in an individual time trial.\nMakwala, 30, then qualified in second place from the first semi-final.\n\"I wish to thank the IAAF [International Association of Athletics Federations] for giving me another chance, and the crowd is so amazing,\" Makwala told BBC Sport.\nAmerican Isiah Young won the first semi-final in 20.19secs, with Britain's Nethaneel Mitchell-Blake finishing third and qualifying in 20.19secs.\nVan Niekerk, 25, was running his fifth race in as many days as he looks to add the 200m title to his 400m gold, and he only made it through as a fastest loser.\nHe finished third in his heat in a time of 20.28secs, but Britons Danny Talbot and Zharnel Hughes failed to qualify.\nFour-time Olympic gold medallist Michael Johnson on BBC Two\nIt is a little bit difficult because you don't have that guide in the next lane to go off. I'm so pleased he was allowed to get himself back into this 200m. It's tough to go out there and run alone.\nIt's a strange situation, I'm sure he's never done it before. He's a veteran, so he knows what to do. He's very quick and you just have to treat it like a time trial in practice. It's all speed and technique, there's no strategy or competition.", "url": "https://www.bbc.com/sport/athletics/40880484"}