{"authors": ["Jess Anderson", "www.facebook.com"], "date_download": "2025-05-20 11:54:11", "date_modify": "2025-05-20 11:54:11", "date_publish": "2023-08-05 17:59:55", "description": "England will be in \"new territory\" when they face Australia in their maiden World Cup final, says former captain Serena Kersten.", "filename": "sport_netball_66416324_1747742051.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/F538/production/_130667726_housbybruce_getty.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_netball_66416324_1747742051.html", "title": "Netball World Cup 2023 final: England chasing history against Australia", "title_page": "Netball World Cup 2023 final: England chasing history against Australia - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England must embrace \"new territory\" when they face 11-time winners Australia in their first World Cup final, says former captain Serena Kersten.\nThe Roses beat defending champions New Zealand in the semi-finals and will look to write a new chapter in their history as they go for gold on Sunday.\nEngland have won bronze six times, including at the last three World Cups.\nBy contrast, there has never been a World Cup final without Australia.\nAfter finishing fourth at the Commonwealth Games last year, the Roses have faced questions over their inconsistent form but have responded with a perfect record at the World Cup, as well as going further than any England team before them.\nThe final in Cape Town takes place at 17:00 BST on Sunday and will be live on BBC Two, BBC iPlayer and the BBC Sport website and app.\n\"Now there is expectation [on England],\" Kersten said on BBC TV.\n\"Everyone will expect them to get that gold medal, but that is still new territory.\"\nWhen England pipped Australia to Commonwealth Games gold on the Gold Coast five years ago, expectations on the Roses increased.\nThey have undergone a period of transition since then under head coach Jess Thirlby, who replaced Tracey Neville after the 2019 World Cup, and it has taken time for them to settle.\nThirlby turned her attention to developing the next generation of players, with Kersten, defender Eboni Usoro-Brown and prolific shooter Jo Harten all calling time on their England careers.\nBut, while it may have taken time for the strategy to reap rewards, Thirlby has always believed in the team and hopes people are now \"super proud\" of them.\n\"We've already gone where no Roses team has gone before,\" Thirlby said.\n\"In August 2019 I had a call with most of these girls, congratulated them on 2018 but said that we wanted to do different, and the World Cup still eluded us.\n\"We've ticked the box [getting to the final], and I hope that now will let us go out there and play with freedom.\"\nEngland won silver at the 1975 World Cup, but that tournament was played as a round robin, meaning they did not play in a final.\nThey will now challenge for a first world title, five years after they captured the nation's attention at the Commonwealth Games.\n\"People said once certain players retire then England will fall away,\" said former England captain Ama Agbeze.\n\"But for Thirlby to manage an injection of new young talent and to make a World Cup final for the first time is just phenomenal.\"", "url": "https://www.bbc.com/sport/netball/66416324"}