{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 08:16:46", "date_modify": "2025-04-26 08:16:46", "date_publish": "2025-02-26 10:31:16", "description": "Leicester podcast: When You're Smiling discusses Ruud van Nistelrooy's comments", "filename": "sport_football_articles_cz7ve9jlvd3o_1745655406.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/90cc/live/17f83c10-f38c-11ef-b176-3b0103bf5e53.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cz7ve9jlvd3o_1745655406.html", "title": "Leicester podcast: When You're Smiling discusses Ruud van Nistelrooy's comments", "title_page": "Leicester podcast: When You're Smiling discusses Ruud van Nistelrooy's comments - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The latest episode of When You're Smiling is centred around Ruud van Nistelrooy's comments after Friday's defeat by Brentford, when he admitted the level of some of Leicester's opponents is \"too big\" for his team to compete against.\nFormer Foxes winger Matt Piper told the BBC Radio Leicester podcast that it is possible for the club to stay in the Premier League despite the quality not being high enough in the squad.\n\"There are ways to bridge the gap. Sean Dyche did this for six or seven years at Burnley,\" he said.\n\"If you haven't got those players that are able to bridge the gap, you have got to find them. You can look at the under-21s, the under-18s, the periphery players who aren't getting a chance.\n\"He [Van Nistelrooy] used a word that I really don't like in this situation: hope. Hope does not keep you in the Premier League. You can't keep picking the same team and crossing your fingers before you go out. It's just going to be the same as what we've seen.\n\"There are so many untested players, or ones he has tested in the cups and then not given another opportunity.\n\"There are youngsters who are doing incredible things. I would at least be putting some of them on the bench and bringing them on for 15 minutes. One of them could surprise you.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cz7ve9jlvd3o"}