{"authors": ["Matt Lloyd", "www.facebook.com"], "date_download": "2025-05-20 14:07:25", "date_modify": "2025-05-20 14:07:25", "date_publish": "2023-07-30 15:46:48", "description": "BBC Wales Sport recalls every World Cup through the eyes of those who were there, with 1999 memories from Wales star Scott Quinnell.", "filename": "sport_rugby-union_66226137_1747750045.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/34F5/production/_130575531_worldcuprewind1999graphic.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-union_66226137_1747750045.html", "title": "World Cup Rewind: 1999 - When Cool Cymru hosted world rugby", "title_page": "World Cup Rewind: 1999 - When Cool Cymru hosted world rugby - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "As the end of the millennium ticked closer, the 1999 World Cup would symbolise a new beginning.\nIn the first World Cup of the professional era, the expanded tournament would demonstrate the full commercial potential of the game.\nThe Millennium Stadium was built to host the event and would symbolise a revival in Welsh national confidence.\nIn the latest in a series reflecting on past World Cups, BBC Wales Sport looks back at 1999 with Scott Quinnell.\nIt was a time of renewed confidence in Wales and being Welsh... this was Cool Cymru.\nManic Street Preachers, Super Furry Animals and Catatonia were topping the charts and Stereophonics played before 50,000 fans in Swansea.\nTom Jones was making a successful comeback and Rhys Ifans took Hollywood by storm - in his pants - in the hit film Notting Hill.\nThe face of the Welsh capital was also changing. The National Assembly was established to house the country's first parliament in 600 years, just across the new-look Cardiff Bay from the nation's first five-star hotel, while in the city centre, a shrine to the national sport was under construction.\nDespite very real concerns, the £121m Millennium Stadium, now called the Principality Stadium, was fully operational just in time - just - to stage an opening ceremony unprecedented in scale and ambition, external for a Rugby World Cup.\n\"Everyone asks what I made of the opening ceremony, but we didn't see a thing. Steve Black [Wales fitness coach] had us warming up in the bowels of the stadium,\" recalled the former number eight.\n\"But walking out for the anthems and thinking the world was watching was an incredible feeling. There was a fantastic atmosphere which was just magnified under the roof.\n\"The squad always had belief they would get the stadium finished. It was too big an event not to be ready for.\n\"But that first warm-up match against South Africa [in front of 27,500 fans in a half-built stadium in the World Cup build-up] did feel like playing on a building site with blokes in high-viz jackets holding socket wrenches watching us.\"\nThat national excitement was shared on the pitch, embodied by Quinnell's bleached blond haircut, and for the first time, Wales headed into a World Cup full of optimism.\nGraham Henry's side were riding the crest of a wave after eight wins in a row, including victories in Paris, at Wembley over England, twice in Argentina and first win over the Springboks.\n\"Graham came in and changed everything,\" said Quinnell.\n\"He was a workaholic and the attention to detail was unlike anything I'd seen. He'd have notes put under your hotel room door at 7am outlining the day ahead.\n\"He also brought new ideas like a senior player group to use as a sounding board which I'd never seen before.\n\"There was just a great feeling about the place at the time. We'd had a great year and ahead of the World Cup, we did training sessions and visits all over the country, and got an amazing reception wherever we went.\"\nThe WRU had struck a deal with the rest of the Five Nations Championship and England, Ireland, Scotland and France all hosted pool games.\nIreland hooker Keith Earls scored four tries against the United States though there was only one result of note in the pool stage and - once again - involved Wales and Samoa in Cardiff. Lightning, Wales discovered to their pain, could strike twice.\nHaving ground out a bad-tempered win in the tournament opener over Argentina and brushed past Japan, Wales lost to Samoa in a result that utterly overshadowed Neil Jenkins breaking the world record, external for Test points.\n\"Unfortunately Wales against Samoa in World Cups in Cardiff doesn't seem to go very well,\" winced Quinnell.\n\"They were the most physical side you could ever play. When a Samoan hits you, you stay hit and after the game, I'd never felt so beaten up.\n\"One of their centres put my teeth through my lip and I got hit so hard by someone else that I popped the ball up for Stephen Bachop to score a try. I think that might count as an assist.\"", "url": "https://www.bbc.com/sport/rugby-union/66226137"}