{"authors": ["Tom Gayle", "www.facebook.com"], "date_download": "2025-04-26 07:03:02", "date_modify": "2025-04-26 07:03:02", "date_publish": "2025-02-28 08:10:29", "description": "Everton news: Jake O'Brien continues comeback under David Moyes", "filename": "sport_football_articles_c5y99lp85k1o_1745650982.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/fa57/live/a6ab7500-f902-11ef-b5c1-27f306935cb2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c5y99lp85k1o_1745650982.html", "title": "Everton news: Jake O'Brien continues comeback under David Moyes", "title_page": "Everton news: Jake O'Brien continues comeback under David Moyes - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "When Everton completed the signing of Jake O'Brien last summer the club described him as one of Europe's most talented young defenders. A fee of £16.4m was paid following a standout season at Lyon where the Irishman made 27 starts in the French top flight, as well as scoring in their cup final defeat to Paris St Germain.\nUpon his arrival manager Sean Dyche made his feelings clear. He viewed the 23-year-old as a squad player saying: \"Jake further strengthens our talented core of centre-backs and adds competition.\"\nThis opinion didn't appear to waver, with Dyche using him just twice as a substitute over the 20 Premier League matches he was in charge of this season.\nThe day after scoring his first goal for the club at Brentford, O'Brien has now featured in every single game since David Moyes' return, earning seven consecutive Premier League starts, and playing every single minute of their last six fixtures.\nThis isn't a dig at Dyche. It's understandable he deemed James Tarkowski and Jarrad Branthwaite as his first choice centre-half pairing. One can add in the fact O'Brien didn't make a senior appearance for Crystal Palace during a two-and a half year spell in South London before his move to Lyon.\nWhere Dyche and Moyes differ is the current manager has seen more than enough from O'Brien to know he can help the team, even if it means playing him out of position at right back.\nHow long the Republic of Ireland international's run in the side continues could be determined by Nathan Patterson's recovery from injury - a natural in the full-back position.\nSpeaking to me afterwards Moyes said Patterson \"wasn't ready\" despite being part of the squad who travelled to Brentford, and his place on the bench was in the case of an \"emergency\".\nWith a long-term view in mind, it might not be a formality a fully fit Patterson does replace O'Brien. Moyes has previously spoken of how \"young centre-backs have to find their way out as full-backs.\"\nTransfer noise surrounding Branthwaite is only likely to increase during the summer, with the latest gossip linking him with a move to Real Madrid.\nO'Brien getting as much Premier League experience as he can between now and the end of the season seems logical, not only for his development, but also for when it comes to succession planning.", "url": "https://www.bbc.co.uk/sport/football/articles/c5y99lp85k1o"}