{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:07:25", "date_modify": "2025-05-21 05:07:25", "date_publish": "2025-01-05 12:16:09", "description": "Fulham vs Ipswich predictions: Chris Sutton on Premier League game", "filename": "sport_football_articles_cjdn4vjjpy7o_1747804045.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3243/live/7f7f29c0-c9f7-11ef-87df-d575b9a434a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cjdn4vjjpy7o_1747804045.html", "title": "Fulham vs Ipswich predictions: Chris Sutton on Premier League game", "title_page": "Fulham vs Ipswich predictions: Chris Sutton on Premier League game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Chris Sutton is making predictions for all 380 Premier League games this season, against a variety of guests.\nFor week 20, he takes on The Zutons frontman Dave McCabe, who supports Liverpool.\nSutton's prediction: 1-0\nWell done to Ipswich. I have got to give one of my daughter's teachers, Mr Fields, another mention here after the Tractor Boys beat Chelsea on Monday for their first home win of the season.\nHe will have had the bunting out, and the champagne too - and deservedly so.\nAs I've said before, I like this Ipswich team. They have got a lot about them and they are giving it a real go to try to stay in the Premier League.\nYou cannot overestimate the importance of them getting off the mark at Portman Road, but I don't see them following it up with another success on Sunday.\nFulham let me down badly by letting their lead slip late on at home to Bournemouth on Sunday, but they are usually pretty reliable at Craven Cottage.\nAntonee Robinson and Alex Iwobi form such a wonderful combination down the left for Marco Silva's side, and I think they will help them secure a narrow home win.\nMcCabe's prediction: 2-0\nFulham are a pain in the backside. You feel like you should beat them, but they never seem to go away in games.", "url": "https://www.bbc.com/sport/football/articles/cjdn4vjjpy7o"}