{"authors": ["Millie Sian", "www.facebook.com"], "date_download": "2025-05-21 04:56:28", "date_modify": "2025-05-21 04:56:28", "date_publish": "2025-04-04 13:53:39", "description": "Mikel Arteta press conference: Everton vs Arsenal", "filename": "sport_football_articles_cd9lx7j2059o_1747803388.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/adba/live/e81c39a0-4842-11ef-96a8-e710c6bfc866.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cd9lx7j2059o_1747803388.html", "title": "Mikel Arteta press conference: Everton vs Arsenal", "title_page": "Mikel Arteta press conference: Everton vs Arsenal - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Gabriel's injury was \"a tough one to digest\" but Arteta is focused on being able to \"find solutions to keep on competing\" in his absence.\nOn the challenge of working out who can play in central defence: \"We are in the most important and beautiful part of the season. We have to react to these things. Other players are going to have the opportunity to play and the team has to find other ways. We have the resources to cope with it.\"\nOn why four Arsenal players have picked up hamstring injuries this season: \"I don't think it's specific to Arsenal. It's difficult to put a finger on one reason that's causing all those injuries because all four have been completely different.\"\nHe added that one of the injuries was picked up after two days off and another was after three consecutive matches\nIn terms of defensive options, Arteta ruled out Riccardo Calafiori but said there is \"a chance\" Ben White and Jurrien Timber will be involved: \"The problem is that we have a few players returning, so we are going to have to decide this evening or early tomorrow morning which players we can play and for how long.\"\nHe did not confirm whether Bukayo Saka, who recently returned from a hamstring injury, will be rested or awarded more minutes ahead of their Champions League quarter-final first leg against Real Madrid but said: \"He needs exposure. He wants more minutes. It's clear, and in the last two days he has been demanding more - so that's a good sign.\"\nArteta said Martin Odegaard and Bukayo Saka's attacking partnership is \"something very special\": \"They have played so many minutes together that it flows naturally and in the right way now. Their qualities complement each other really well.\"\nArsenal's final game at Goodison Park will be \"very special\" because there is \"a lot of history between the clubs\". He also praised his former manager David Moyes for returning to Everton, adding that \"it is never easy to come back for a second time\".\nOn the atmosphere and culture he has created at Arsenal: \"The feeling that I have when I wake up in the morning is that I'm desperate to come through those doors and share my day with everybody - the staff, the players and everybody around the club. That is a privilege that has been built between all of us.\"\nHe added he hopes this will be \"sustained for many years\".", "url": "https://www.bbc.com/sport/football/articles/cd9lx7j2059o"}