{"authors": ["Jonathan Bradley at the Stade Chaban Delmas", "www.facebook.com"], "date_download": "2025-05-21 03:45:48", "date_modify": "2025-05-21 03:45:48", "date_publish": "2025-04-06 14:48:02", "description": "Ulster head coach Richie Murphy feels his side's 43-31 defeat by Bordeaux-Begles in the last 16 of the Investec Champions Cup provides another example of the \"good resilience\" in his squad.", "filename": "sport_articles_cly1nwlv3n5o_1747799148.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ee0d/live/4d572df0-12f2-11f0-8bc5-d317b6dd5c85.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cly1nwlv3n5o_1747799148.html", "title": "Champions Cup: Richie Murphy 'extremely proud' of Ulster despite cup exit at hands of Bordeaux-Begles", "title_page": "Champions Cup: Richie Murphy 'extremely proud' of Ulster despite cup exit at hands of Bordeaux-Begles - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ulster head coach Richie Murphy felt his side's 43-31 defeat by Bordeaux-Begles in the last 16 of the Investec Champions Cup provided another example of the \"good resilience\" in his squad.\nThe province have had to come from behind to beat Scarlets, Dragons and Stormers in the United Rugby Championship (URC) over recent weeks and, while they could not complete another fightback at the Stade Chaban Delmas, Murphy was pleased by how his side \"stayed in the fight.\"\nThe visitors were 21-0 down after 21 minutes but cut the deficit to seven points before the end of the first half.\nBordeaux later threatened to pull away but a second-half double from Zac Ward, along with a score from Nick Timoney, ensured the game remained competitive.\n\"Extremely proud of the lads, the way they stuck at it and stayed in the fight,\" Murphy said.\n\"The last few weeks we've been 14-0 down and this week we were 21 points down after the first period and that's tough.\n\"What we've shown over the last few weeks is good resilience within the squad, you can see the team starting to build. Some young players are getting really good experience at the very top level and finding ways.\"\nWhile Ulster struggled early in possession, they looked sharper in attack as the game progressed but were caught by Bordeaux's ability to break on the counter.\n\"We played some really good rugby at times [but] the transitionary moments which we knew were going to come really cost us in that first half,\" added Murphy.\n\"A couple of loose kicks and they punish you really badly.\n\"You know once you turn the ball over, within two or three phases it's going to be a try.\"", "url": "https://www.bbc.com/sport/articles/cly1nwlv3n5o"}