{"authors": ["Sandy Smith", "www.facebook.com"], "date_download": "2025-05-21 06:15:35", "date_modify": "2025-05-21 06:15:35", "date_publish": "2024-12-24 14:48:04", "description": "'Embarrassed & angry at Edinburgh capitulation'", "filename": "sport_articles_crl3e5l0281o_1747808135.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/688e/live/03637750-c205-11ef-aff0-072ce821b6ab.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_crl3e5l0281o_1747808135.html", "title": "'Embarrassed & angry at Edinburgh capitulation'", "title_page": "'Embarrassed & angry at Edinburgh capitulation' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Do you recall the song Coward of the County by Kenny Rogers? In the lyrics the protagonist Tommy gets told, \"Walk away from trouble when you can\" and as a result he takes the odd beating.\nEdinburgh could be Tommy. They were attacked from every angle by Glasgow on Sunday and turned the other cheek until they had almost been ground into the dirt. Only then did they find the courage to fight back.\nThere weren't even any scuffles which at least would have indicated that someone was angry about being made to look quite so third rate.\nI've said all season long, when are we going to see an Edinburgh captain read the riot act in a team huddle? Surely they are capable of hearing a few harsh words and then reacting in some way other than sulking?\nWas it the worst ever from Edinburgh? Probably not. The memory of our defeat to Lions is pretty fresh. Is it our worst defeat in an 1872 cup match? Mathematically? No, we lost 34-10 in 2019.\nCharacter wise? That's harder to quantify and frankly trying to check back and see if there was a game against Glasgow where we looked more dispirited and disinterested than we did in this one would just be too depressing.\nAny positives? There are but they seem trivial in the face of the result and it is results that matter. Winning the second half, not returning a 100% lineout rate, winning all your scrums? Those things count for less than zero when for the most part Edinburgh looked as if they'd prefer to be at home watching Antiques Roadshow.\nI am embarrassed and I am angry. I don't want to hear platitudes about yellow cards and 'learnings'. I've heard it all before too many times. Go media silent and spend the time instead on finding some pride.\nTommy proved later in the song that he wasn't without fight. Edinburgh can have that fight in them but it seems it turns up on the throw of a dice.\nI wouldn't put it past them to throw a six and provide Sean Everitt with a lifeline next week.\nEven if that happens though, it won't last and another wince-inducing capitulation will await somewhere down the line.\nI need to find some fight myself to continue with the pain that comes with being an Edinburgh supporter.", "url": "https://www.bbc.com/sport/articles/crl3e5l0281o"}