{"authors": ["Jess Anderson", "www.facebook.com"], "date_download": "2025-05-20 13:01:52", "date_modify": "2025-05-20 13:01:52", "date_publish": "2023-08-01 11:28:19", "description": "England produce their best performance of the Netball World Cup so far to beat Fiji and confirm their place in the semi-finals.", "filename": "sport_netball_66370156_1747746112.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9859/production/_130610093_housby_getty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_netball_66370156_1747746112.html", "title": "Netball World Cup 2023 results: England 89-28 Fiji - Red Roses dominate to seal semi-final spot", "title_page": "Netball World Cup 2023 results: England 89-28 Fiji - Red Roses dominate to seal semi-final spot - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England produced their best performance of the Netball World Cup so far to beat Fiji and confirm their place in the semi-finals.\nThe Roses were dominant in attack and cohesive through the court in an 89-28 win in South Africa.\nEleanor Cardwell scored 40 from 41 attempts and Helen Housby 26 from 28 as England outpaced their opponents.\nThey will face world number one side Australia on Thursday in their final Pool F match.\nEngland are second in their group behind the Diamonds, who also confirmed their place in the last four with victory over Malawi on Tuesday.\nThe Roses have struggled so far with slow starts and high error counts.\nHowever they made a drastic improvement against Fiji, ranked 19th in the world, with shooters Housby and Cardwell, a much-anticipated partnership in the build-up to the tournament, registering 50 goals between them by half-time.\nImogen Allison was again effective in mid-court while Chelsea Pitman - making her 50th appearance in the Roses dress - provided the shooters with 29 goal assists.\nHead coach Jess Thirlby rotated her side in the second half and there was a drop in intensity as their scoring rate decreased but young shooter Olivia Tchine proved a solid option from the bench, while veteran Jade Clarke remains influential at her sixth World Cup.\n\"This England team have gone pretty much under the radar,\" former England defender Eboni Usoro-Brown said on BBC TV.\n\"Everyone is talking about Jamaica, New Zealand and Australia and what form they are in, but I think England have just quietly gone about their business.\"\nEngland were expected to reach the semi-finals of the World Cup and have done so in a comfortable manner, registering five routine wins.\nBut their biggest test of the tournament so far will come against Australia, with England needing to tighten up errors to play four quarters of high-quality netball in order to challenge the 11-time world champions.\n\"There is a nice, quiet confidence in the group and I think tonight is a good step in the right direction,\" Thirlby said after the win over Fiji.\n\"I think we are in a good place. We are not getting carried away.\"\nConsistency levels are bound to fluctuate as Thirlby continues to make changes and solidify her favoured starting seven but the England boss says it is a sign of her faith in the group.\n\"The fact we are playing all 12 shows you how confident I am in everyone's ability to come on and impact,\" she said.\n\"I thought you saw again the impact Tchine had when she came on. There lies the value in trusting in your whole team.\"\nEngland will have a rest day on Wednesday having played five pool matches in five days.\n\"We'll have a full recovery session in the morning then a lot of the girls have got friends and family here and I know that will really give them the energy they need for the following challenge,\" Thirlby added.\n\"A little bit of time out in the daylight and pretty much just being a normal human for a few hours.\"", "url": "https://www.bbc.com/sport/netball/66370156"}