{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:59:42", "date_modify": "2025-05-19 14:59:42", "date_publish": "2017-07-04 10:42:04", "description": "Former Hearts defender Craig Thomson, who was convicted of a sex offence in 2011, signs for Edinburgh City.", "filename": "sport_football_40491084_1747666782.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/17097/production/_96795349_5050666.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_40491084_1747666782.html", "title": "Sex offender Craig Thomson signs for Edinburgh City", "title_page": "Sex offender Craig Thomson signs for Edinburgh City - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Hearts full-back Craig Thomson has returned to Scottish senior football for the first time since he was convicted of a sex offence.\nThe 26-year-old, who was with juniors Kelty Hearts, has signed for Edinburgh City in League Two.\nThomson pleaded guilty in June 2011 to inappropriate conduct towards two underage girls over the internet.\nCity noted his court conviction but said on Twitter they believed he deserved a second chance.\n\"The club acknowledges Craig's previous conviction in 2011 for offences he committed in 2010 and does not condone his behaviour in any way,\" they said in a statement.\n\"However, the club's board, management, playing staff and main sponsor collectively believe that Craig has completed his rehabilitation and we look forward to giving him the opportunity to return to playing in the SPFL.\"\nThomson was loaned to Lithuanian clubs Kaunas and Suduva after being fined and placed on the sex offenders' register for five years but never played for Hearts again.\nAfter leaving Tynecastle officially in 2013, the former Scotland Under-21's potential move to Cyprus was swiftly cut short when prospective club Paphos discovered his conviction.\nBut he has since played for East of Scotland junior sides Arniston Rangers, Newtongrange Star and Kelty, who won the Super League last season.\nFormer Hearts manager Jim Jefferies, who is sporting director with Edinburgh City, stated the club would be making no further comment.", "url": "https://www.bbc.com/sport/football/40491084"}