{"authors": ["Luke Young", "www.facebook.com"], "date_download": "2025-05-20 13:02:08", "date_modify": "2025-05-20 13:02:08", "date_publish": "2023-08-01 10:30:18", "description": "Hooker Rob Herring insists Ireland are not feeling any added pressure with their world number one status as the squad prepare for the Rugby World Cup.", "filename": "sport_rugby-union_66297330_1747746128.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/30B7/production/_130517421_gettyimages-1244722658.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-union_66297330_1747746128.html", "title": "Rugby World Cup 2023: Ireland not feeling 'added pressure' with number one ranking - Rob Herring", "title_page": "Rugby World Cup 2023: Ireland not feeling 'added pressure' with number one ranking - Rob Herring - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ulster hooker Rob Herring says Ireland will \"embrace\" their world number one ranking as the squad ramp up preparations for the Rugby World Cup in France.\nIreland topped the rankings with a stunning 2-1 Test series win over the All Blacks in New Zealand last summer.\nAndy Farrell's side backed up their new status with an impressive Grand Slam win in this year's Six Nations.\n\"There's always pressure when you play for Ireland,\" Herring told BBC Sport.\n\"I think something we've been speaking about is that we've got to embrace it.\"\nIreland will play three World Cup warm-up matches this month before their tournament opener against Romania on 9 September in Bordeaux.\nThey will host Italy and England at the Aviva Stadium in Dublin on 5 and 19 August before facing Samoa on 26 August at the Stade Jean-Dauger in Bayonne, France.\nIreland's impressive results in recent Tests and tournaments set them in good stead for the World Cup and Herring insists his team's impressive form does not put any additional pressure or expectations on them for results.\n\"Pressure's pressure, but the way we go about our business and put our game plan onto teams, that's all we're really focused on,\" said the 33-year-old.\n\"We just want to embrace it, going in as the number one team, you know, why not?\n\"It's not really added pressure. You wouldn't really want to be anything else, would you?\"\nSouth African-born Herring, who represents Ireland after qualifying on ancestry grounds, is part of coach Farrell's 42-man training squad, which will be reduced to 33 players for the start of the World Cup.\nHerring, who was part of the Irish squad at the 2019 World Cup in Japan, is hoping to make the travelling squad to France, with Farrell having other hooker options in Leinster duo Dan Sheehan and Ronan Kelleher.\nSince his international debut against Argentina in June 2014, Herring has earned 34 caps for Ireland, the most recent of which included a late try in the Grand Slam-clinching win over England in March.\nThis year's tournament in France will see the implementation of further measures to support player welfare with squad numbers being raised from 31 to 33 players - allowing for more squad depth and increased options in response to injuries.\nIn addition, there will be a minimum of five days in the build-up to a team's next fixture, allowing sufficient time for rest and recovery.\n\"We've seen in World Cups over the years how important it is to have that depth in the squad,\" added Herring.\n\"I think that's something that we've had an opportunity to do over the last few years. Lots of different guys have got different game time in different games.\n\"The Six Nations was a great example of that, using so many players in different positions, guys coming in, late injuries and just going with the flow and dealing with things.\n\"I think that's all part of the building blocks that will put us in good stead in the World Cup.\"", "url": "https://www.bbc.com/sport/rugby-union/66297330"}