{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:33:51", "date_modify": "2025-05-21 04:33:51", "date_publish": "2025-04-04 20:20:15", "description": "Manchester United's Jadon Sancho a target for Wolves, Sporting lower Viktor Gyokeres asking price and Arsenal cool interest in Newcastle striker Alexander Isak.", "filename": "sport_football_articles_czx15pgdpx6o_1747802031.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4506/live/e2fd9330-118f-11f0-b234-07dc7691c360.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_czx15pgdpx6o_1747802031.html", "title": "Football gossip: Sancho, Garnacho, Cherki, Lookman, Gyokeres, Isak, Fernandez", "title_page": "Football gossip: Sancho, Garnacho, Cherki, Lookman, Gyokeres, Isak, Fernandez - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester United's Jadon Sancho a target for Wolves, Sporting lower Viktor Gyokeres asking price and Arsenal cool interest in Newcastle striker Alexander Isak.\nWolves have emerged as surprise contenders to sign 25-year-old Manchester United and England winger Jadon Sancho, who is currently on loan with Chelsea, in the summer. (Football Transfers), external\nManchester United and Argentina winger Alejandro Garnacho, 20, has hinted at a summer move by putting his £3.85m mansion up for sale just 12 months after he bought it. (Sun), external\nLyon and France attacker Rayan Cherki, 21, has a £25m release clause in his contract, with Manchester United and Tottenham Hotspur among clubs interested. (GiveMeSport), external\nManchester United are also eyeing Atalanta's Nigeria international forward Ademola Lookman, 27, to address their lack of firepower. (Caught Offside), external\nSporting would be willing to lower their asking price for Sweden forward Viktor Gyokeres from £85m (100m euros) to around £59m (70m euros), with Arsenal and Manchester United still interested. (Athletic - subscription required), external\nJuventus are pushing hard to sign Nigeria international Victor Osimhen, 26, this summer but Manchester United are primed to rival the Italian club for the signature of the Napoli striker, who is currently on loan at Galatasaray. (Teamtalk), external\nArsenal are no longer interested in signing Newcastle and Sweden striker Alexander Isak, 25, who is set to be offered a new contract by the Magpies. (Chronicle), external\nBayer Leverkusen are keen on Espanyol goalkeeper Joan Garcia, with the 23-year-old Spaniard also tracked by Arsenal. (Bild via Get German Football News), external\nInter Milan are not interested in signing Belgium midfielder Kevin de Bruyne, 33, when he leaves Manchester City on a free in the summer due to the player's age. (Calciomercato - in Italian), external\nReal Madrid are open to extending 32-year-old Germany defender Antonio Rudiger's contract beyond 2026, despite interest from the Saudi Pro League. (Florian Plettenberg), external\nChelsea are not planning to sell Argentina midfielder Enzo Fernandez in the summer, with the 24-year-old an important part of their plans. (Fabrizio Romano), external", "url": "https://www.bbc.com/sport/football/articles/czx15pgdpx6o"}