{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:07:50", "date_modify": "2025-05-21 04:07:50", "date_publish": "2025-04-06 14:46:43", "description": "Hibs fan views: 'Has Bushiri been possessed by spirit of Maldini?'", "filename": "sport_articles_c62j7njwj39o_1747800470.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0c08/live/6292e120-12e1-11f0-ac9f-c37d6fd89579.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c62j7njwj39o_1747800470.html", "title": "'Has Bushiri been possessed by spirit of Maldini?'", "title_page": "Hibs fan views: 'Has Bushiri been possessed by spirit of Maldini?' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your views on Hibs' 2-0 win against Rangers.\nHere's what some of you said:\nMaureen: What has happened to Rocky Bushiri? Has he been possessed by the spirit of Paolo Maldini? He's an absolute titan in the Hibs defence now. He neutralised Cyriel Dessers and imposed himself on the game, as he has so often this season. It gives us the base to attack teams with confidence. Loving it.\nDarren: If you told me at the start of the season that in David Gray's first season as permanent manager, he would finish third, beat both Old Firm and win two Edinburgh derbies I would say you were mad. I would have been delighted for any of those but to have nearly all three? It's uncanny. If Hibs stay third Gray would be up for manager of the season for me. I believe a well accomplished manager like Brendan Rogers wouldn't mind losing it to Gray after the complete turnaround.\nAlan: Great result for Gray and the team and the remarkable turnaround continues. This confident Hibs side is a world away from the team at the start of the season - secure at the back and scoring goals. Race for third spot is going to be tight but this Hibs team should challenge confidently for this spot.\nChris: It's a strange feeling going to Ibrox confident of winning, long may it continue! It starts with extending Gray and Martin Boyle, and probably letting Joe Newell go - don't need an injured captain coming back into the team to disrupt a working system.\nDavid: Hibs controlled most of the game. It was a professional and complete performance. The back three dealt with all that was thrown at them, great composure in midfield and the attack made a nuisance of themselves. A simply incredible turnaround since the end of November and we just need to keep this run going for another month or so. Gray must be up there for manager of the year.", "url": "https://www.bbc.com/sport/articles/c62j7njwj39o"}