{"authors": ["Neil Johnston", "www.facebook.com"], "date_download": "2025-05-20 12:02:57", "date_modify": "2025-05-20 12:02:57", "date_publish": "2023-08-05 13:04:04", "description": "Netherlands beat South Africa 2-0 to set up a Women's World Cup quarter-final against Spain on Friday.", "filename": "sport_football_66414642_1747742577.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1316/production/_130668840_celeb.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66414642_1747742577.html", "title": "Netherlands 2-0 South Africa: Jill Roord and Lineth Beerensteyn score in World Cup win", "title_page": "Netherlands 2-0 South Africa: Jill Roord and Lineth Beerensteyn score in World Cup win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Netherlands manager Andries Jonker says his team have come to the Women's World Cup \"with the conviction that we can beat everybody\" after securing a quarter-final spot against Spain.\nThe Netherlands were forced to endure several anxious moments before defeating South Africa and booking a place in the last eight.\nThey will have to face Spain without experienced midfielder Danielle van de Donk, who picked up a second yellow card of the tournament and is suspended.\nFormer Arsenal player Van de Donk, a Champions League winner with current club Lyon, broke down in tears at full-time knowing she will miss the quarter-final after starting all 15 World Cup games in Netherlands' history.\n\"We have this conviction, it's not the last game for Danielle. It's very disappointing she got a yellow card but we can't change it,\" said Jonker.\n\"Danielle has very specific qualities that we really need and we will miss those qualities.\n\"But we've got a lot of other good midfielders and that's what we'll need to work out over the next few days.\"\nJill Roord, Manchester City's new club record signing, nodded the Netherlands ahead but South Africa went close to equalising several times against the 2019 runners-up.\nBanyana Banyana captain Thembi Kgatlana was once again a real handful and forced four fine saves from Daphne van Domselaar, Aston Villa's new goalkeeper, in front of a crowd of 40,233 at Sydney Football Stadium.\nLineth Beerensteyn doubled the lead after a mistake by South Africa keeper Kaylin Swart in the second half.\nThe Netherlands will return to New Zealand to face Spain in Wellington on Friday at 02:00 BST for a place in the semi-finals.\nThe Netherlands are two wins from reaching back-to-back finals after another lightning start to a game at this tournament.\nRoord's early header, after Lieke Martens had been denied by a clearance off the line, was the sixth time they have scored inside 20 minutes.\nTheir second goal was a gift, Swart allowing a seemingly routine shot by the recalled Beerensteyn to slip through her grasp and into the net.\nIt was a horrible moment for the keeper but it secured the Netherlands their third win of the tournament after an outstanding goalkeeping display by Van Domselaar.\n\"Daphne saved us a few times and I was happy to lead 1-0 at half-time,\" added Jonker.\n\"But the part of me that wants great football is disgruntled with the first half, where we gave the ball away too much.\"\nThe Netherlands have had a near-perfect World Cup so far and were only denied victory over four-time world champions the United States by Lindsey Horan's equaliser.\nJonker, the former assistant to Louis van Gaal at Bayern Munich and Barcelona, has been tasked with going one step further than previous World Cup, when Sarina Wiegman's side were defeated 2-0 by the USA in France.\nThe Netherlands head into the quarter-finals in fine form and with Spain in their sights.", "url": "https://www.bbc.com/sport/football/66414642"}