{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:06:21", "date_modify": "2025-04-26 04:06:21", "date_publish": "2025-03-03 16:44:03", "description": "Paul Heckingbottom doesn't want FA Cup draw against Aston Villa to distract his side from their Championship targets.", "filename": "sport_football_articles_c8d41ng9432o_1745640381.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ba4a/live/d4db75d0-f84c-11ef-b5bf-275f2ed479cc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c8d41ng9432o_1745640381.html", "title": "Preston North End: Paul Heckingbottom has full focus on Swansea", "title_page": "Preston North End: Paul Heckingbottom has full focus on Swansea - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Paul Heckingbottom wants to ban talk of the FA Cup quarter-final against Aston Villa as his full focus is on Preston North End's Championship game against Swansea City.\nNorth End are 15th but could close within seven points of the play-off places with a victory on Tuesday (19:45 GMT).\nHeckingbottom says it's not an \"insurmountable\" gap to close in the final 12 games, despite taking just five points from their five matches before Saturday's 3-0 win over Burnley, which teed-up the date with Villa in the last eight.\n\"It's not insurmountable, but something's got to change,\" Heckingbottom told BBC Radio Lancashire. \"I have been happy with our form in terms of performances but our points haul needs to change totally.\n\"It's not out of the realms of possibility, but something needs to change in a big way because of the amount of traffic between us and sixth place.\n\"That's why these games, for me, are bigger than when we play Villa. That will take care of itself, but all these league games are really important.\n\"Everyone's excited about Villa, I'm not, I'm thinking about Swansea and everyone should be. People walking around talking about Villa tickets - let's beat Swansea, that's it.\"\nThe Lilywhites swept aside their Lancashire rivals in the fifth round, scoring more goals in one game than the Clarets had conceded in their previous 15 in all competitions.\n\"If we perform like we did at the weekend we'll give Swansea a hard time,\" Heckingbottom added.\n\"The challenge for all of us is to go and deliver the same type of performance and almost forget who we're up against, focus on ourselves to deliver our best game.\"\nMads Frokjaer, Jordan Storey and Ben Whiteman remain out while Heckingbottom has not given up hope of Duane Holmes or Jack Whatmough returning to action this season.", "url": "https://www.bbc.co.uk/sport/football/articles/c8d41ng9432o"}