{"authors": ["Emma Sanders", "www.facebook.com"], "date_download": "2025-04-26 04:14:27", "date_modify": "2025-04-26 04:14:27", "date_publish": "2025-03-04 11:07:41", "description": "The WSL needs to develop - what changes could we see, how do clubs feel about them and what impact could they have?", "filename": "sport_football_articles_c5y4xkv6lr2o_1745640867.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b023/live/80317240-f8e8-11ef-9628-add78e51db09.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c5y4xkv6lr2o_1745640867.html", "title": "WSL: Could relegation be scrapped to expand the league?", "title_page": "WSL: Could relegation be scrapped to expand the league? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Could relegation be scrapped in the Women's Super League and could both the top tier and Women's Championship be expanded?\nThe answer is yes, with nothing off the table as the company overseeing the top two leagues of women's football proposes a bold restructuring of the pyramid.\nA vote will take place at the end of the season, in May. So what changes could we see, how do clubs feel about them and what impact could they have?\nRepresentatives from all 23 clubs across the WSL and Women's Championship attended a quarterly meeting last Friday.\nAmong the topics discussed was the suggestion to temporarily scrap relegation in the WSL, but still allow one club a season to earn promotion from the second tier.\nThe idea is that expanding the league would improve competitiveness, while clubs would be given stability - which in turn would encourage long-term investment.\nA two-thirds majority vote, to be taken by all clubs in both tiers, will be needed in May for the change to be made.\nThe proposals are still being refined but one, according to the Guardian,, external would lead to relegation being scrapped for four seasons, from the 2026-27 campaign, as part of a gradual plan to expand both the top flight and Championship to 16 teams.\nSources have told BBC Sport that several clubs in the bottom half of the WSL are in support of the idea, as they believe it would give them a better chance to compete in the future.\nIn recent seasons, the promoted Championship club has needed to immediately spend at least £2m just to provide the necessary infrastructure, staffing requirements and player wages to meet the WSL's 'participation agreement'.\nCrystal Palace are currently four points adrift at the bottom of the WSL table, meaning the club promoted from the Championship could be relegated at the first time of asking for a second year in a row - after Bristol City last season.\nMeanwhile, sources at clubs higher up in the table - that are yet to break into the top four - believe that if their future in the WSL was secure, it could encourage owners to invest more in elite facilities and girls' academies.\nClubs could potentially offer more long-term player contracts and salaries as a result of that stability.\nHowever, those opposed to the idea feel it is against the fundamental values of English football, and there could be a risk that clubs neglect their women's teams because there is no jeopardy of relegation.\nManchester City manager Gareth Taylor said he wants to \"keep it simple\".\n\"Promotion and relegation are always going to be what supporters and teams play for. I think that really is going to be difficult to move away from,\" he added.\nWest Ham manager Rehanne Skinner says the existence of promotion and relegation provides an \"incentive\".\nHowever, she says there are \"loads of different factors\" and clubs need to weigh up the \"pros and cons\" before any vote is passed.\nIf the majority threshold is reached, the WPLL (Women's Professional League Limited) and shareholders can then move on to the next stage, which would be to confirm details on how the restructure would work and a time frame.\nAs well as scrapping relegation, other proposals could include a closed league - where promotion would not occur, although this looks less likely.\nThere could also be play-offs introduced in the Championship.\nAnd they would also decide if relegation were to be scrapped temporarily, when it would be reinstated.\n\"There is potentially a growth stage we are going through where we would need to make sure all clubs are investing to be competitive,\" said Skinner.\n\"If the league were to be closed, given the number of teams in it at the moment, I don't think that is appropriate. The league has got to be bigger.\n\"There would have to be mandatory investment and maintenance of that, otherwise it could discredit the quality of the league - 'to be in it for being in its sake'.\n\"I don't see it as a bad thing. The game is evolving, things need to be reviewed as to what happens next, but it comes with criteria.\"\nAs part of the proposal, sources say there could be a minimum investment criteria, while there are discussions over introducing higher minimum wages.\nAnother debate would be regarding which clubs remain in the WSL.\nFor example, would clubs apply to join the WSL by proving their investment - as they did in 2018 - or would it be determined by sporting performance?\nWhat else could be introduced?\nLike in the men's game, there have been questions about whether Scottish clubs Rangers and Celtic could join England's top league, however, there is no suggestion that will happen any time soon.\nFollowing Chelsea's spending in the January transfer window - when they broke the world transfer record to sign USA defender Naomi Girma for £900,000, as well as a big-money move for England international Keira Walsh from Barcelona - the introduction of a financial fair play regulation could be an option.\nIn January, Women's Championship clubs Bristol City, Southampton, Birmingham and Newcastle agreed to take part in a trial allowing fans to drink alcohol in the stands. That could become commonplace in England if successful.\nThe WPLL could also look to the National Women's Soccer League in the US and propose a draft system for signing players, or bring in salary caps.\nThe WSL currently has a \"soft\" salary cap, allowing clubs to spend up to 40% of their revenue on player salaries.\nAll-in-all, there is plenty for WSL board members to consider, and scrapping relegation is just one of many proposals that could come their way.", "url": "https://www.bbc.co.uk/sport/football/articles/c5y4xkv6lr2o"}