{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:48:36", "date_modify": "2025-05-20 11:48:36", "date_publish": "2023-08-07 10:15:41", "description": "Boss Tony Mowbray reassures fans that Sunderland are scouring the market to add striker depth to the squad.", "filename": "sport_football_66427813_1747741716.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/B7DB/production/_130676074_gettyimages-1582680558.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66427813_1747741716.html", "title": "Tony Mowbray: Sunderland are chasing striker additions to boost goal threat", "title_page": "Tony Mowbray: Sunderland are chasing striker additions to boost goal threat - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Boss Tony Mowbray has reassured fans that Sunderland are scouring the market to add striker depth to the squad following Sunday's 2-1 Championship loss to newly-promoted Ipswich Town.\nThe Wearsiders enjoyed ample possession and territory throughout, but failed to create enough clear-cut chances.\nMidfielder Dan Neil's late goal was their only reward, as Ipswich struck twice to take the points.\n\"The club are trying really hard,\" Mowbray told BBC Radio Newcastle.\n\"We're putting bids in for players, but to find strikers worldwide is really difficult at the moment as some of the huge Premier League clubs are finding.\n\"We don't have ridiculous amounts of money so instead of the first-choice player you're looking at you might end up taking the third or fourth choice, and we have to get on with it.\"\nAn injury to 2022-23's top scorer Ross Stewart has been a dent to Sunderland's ambitions stretching back to last season, with the Scot twice ruled out for lengthy periods as they worked their way into the play-offs.\nManchester United loanee Amad Diallo helped pick up the slack with 13 goals but is unlikely to return for another spell, while Jack Clarke added nine from his wide position - but his role is more to create than contribute goals.\nThere was promise shown against Ipswich by teenage forward Luis Hemir, signed from Benfica, but the responsibility of carrying Sunderland's attacking threat is a big ask.\nBradley Dack was signed to add to the creative options moving forward and one fit, will provide a useful foil to the clutch of forwards at the Stadium of Light.\n\"Hopefully there will be some more attacking options in the building in the next week or two, they'll have to settle into the environment and get used to everybody,\" added Mowbray.\n\"I think we'll get stronger, in six or seven weeks we might have Ross through the middle and Bradley in behind and that with Jack Clarke and Patrick Roberts out wide looks a formidable attacking line up.\n\"There's enough there. We'll be fine.\"", "url": "https://www.bbc.com/sport/football/66427813"}