{"authors": ["Alex Brotherton", "www.facebook.com"], "date_download": "2025-05-21 07:23:20", "date_modify": "2025-05-21 07:23:20", "date_publish": "2025-05-20 07:00:39", "description": "In 2007, Arsenal became the first English team to win the Uefa Women's Champions League. BBC Sport take a look at where their European heroes are now.", "filename": "sport_football_articles_c2kvwdexnvwo_1747812200.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7674/live/b58054a0-269e-11f0-b505-55b7c1f611de.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c2kvwdexnvwo_1747812200.html", "title": "Arsenal's 2007 European champions - where are they now?", "title_page": "Arsenal's 2007 European champions - where are they now? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "After pulling off a remarkable victory against Lyon in the Women's Champions League semi-finals last month, Arsenal are 90 minutes away from European glory.\nBarcelona stand between Renee Slegers' side and a second European crown, 18 years since the Gunners last appeared in the final.\nIn April 2007, Arsenal became the first - and so far only - English side to win the competition, then called the Uefa Women's Cup.\nVic Akers' quadruple-winning team overcame Sweden's Umea 1-0 on aggregate in a two-legged final, with Alex Scott's long-range stunner in first leg injury-time proving the difference.\nThat Arsenal team was packed with legendary players who went on to achieve remarkable feats both on and off the pitch.\nLining up against the Gunners was a 21-year-old Brazilian forward named Marta - we all know where she ended up, but what happened to Arsenal's history-makers?\nGoalkeeper Emma Byrne played a key role in Arsenal's dominance of the 2000s and early 2010s, winning 11 top-flight league titles, nine Women's FA Cups and three League Cups.\nOver 16 years she made 459 appearances for Arsenal, the most in the club's history.\nThe former Republic of Ireland international was capped a record 134 times for her country, and in 2018 became the first female player to be inducted into the Irish Football Association's Hall of Fame.\nByrne left Arsenal in December 2016 at the end of her contract, and after playing for second tier Brighton in the 2017 Spring Series, announced her retirement at the age of 38.\nIn 2019, she came out of retirement to join Terrassa FC in Spain, but an Achilles injury forced her to retire again.\nByrne has since coached in Arsenal's academy, worked as a goalkeeper coach with Ireland and provided punditry and commentary.\nAlex Scott had three separate spells at Arsenal after graduating from the club's academy, making 313 appearances and winning 18 major trophies.\nThe right-back represented Great Britain at the 2012 Olympic Games and earned 140 caps for England, a total bettered only by former Gunners team-mate Karen Carney, Jill Scott and Fara Williams.\nSince retiring in 2018, Scott has become one of the faces of BBC Sport, covering both women's and men's football.\nShe's also branched out into non-sports broadcasting as an occasional host of The One Show.\nVersatile defender Mary Phillip only spent four seasons at Arsenal between 2004 and 2008, but in each one she helped the Gunners to league and FA Cup doubles.\nPhillip earned 65 caps for England and became the first black captain of the Lionesses.\nAfter retiring in 2008 aged 31, following a brief stint with Chelsea, Phillip turned to coaching.\nIn 2019, she became manager of men's non-league side Peckham Town - a position she still holds today - two years after she was diagnosed with multiple sclerosis (MS).\nA year later they became the first senior men's team to win a trophy with a female manager.\nKaren Carney is perhaps better known for her time at Chelsea and Birmingham City, but she was a key part of the quadruple-winning side of 2007.\nThe midfielder made appearances for England and represented Great Britain at the 2012 London Olympics.\nSince retiring in 2019, Carney has been a prominent pundit on both men's and women's football for various broadcasters, covering international tournaments, Champions League and domestic competitions.\nIn 2022, she was appointed chair of the Future of Women's Football Review for the Department for Digital, Culture, Media and Sport, looking into ways the government can develop women's football.\nJayne Ludlow played 356 games over 13 years at Arsenal, putting her third on the club's all-time appearance list.\nThe midfielder scored 221 goals - the most in club history - and captained the side in both legs of the European final. She also won nine league titles and six FA Cups.\nThe former Wales international moved straight into coaching upon retiring in 2013, holding youth coaching roles with Arsenal and Wales.\nLudlow took charge of the Wales women's team in 2014 after a season managing Reading, before spending three years as technical director of Manchester City Girls' Academy until early last year.\nJulie Fleeting is considered one of the pioneers of women's football, largely because she helped forge a pathway for British players to play in the United States.\nIn 2002, the striker joined San Diego Spirit, becoming the first Scot to play as a full-time professional in the Women's United Soccer Association.\nShe joined Arsenal in 2004, where she made 141 appearances and won eight league titles in eight years.\nFleeting remains Scotland's most prolific goalscorer, with 116 in 121 games.\nFor much of her time at Arsenal, the Scotland international continued to work as a PE teacher, flying down to London for matches.\nSince retiring in 2016, Fleeting has continued to work as a PE teacher alongside broadcast work with BBC Scotland.", "url": "https://www.bbc.com/sport/football/articles/c2kvwdexnvwo"}