{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:06:04", "date_modify": "2025-04-26 04:06:04", "date_publish": "2025-03-03 17:07:43", "description": "'I don't think I'm back down to earth!' - Iredale", "filename": "sport_articles_ckgz7dj4kr5o_1745640364.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1882/live/8d8b1830-f850-11ef-83da-2fe2e32e5a75.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_ckgz7dj4kr5o_1745640364.html", "title": "'I don't think I'm back down to earth!' - Iredale", "title_page": "'I don't think I'm back down to earth!' - Iredale - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Jack Iredale is still \"enjoying the moment\" of netting the winner for Hibernian in the Edinburgh derby, admitting \"I don't think I'm quite back down to earth\".\nThe defender secured the win for David Gray's side in quite superb fashion, the latest moment in an \"incredible\" few months for the club.\nThe Hibees are now unbeaten in 15 games in all competitions and the latest is a game that will \"live with me forever,\" says Iredale.\n\"I've probably replayed it more times than I care to admit, either on my phone or in my head,\" the 28-year-old told BBC Scotland of reliving his super strike.\n\"I don't think I'm quite back down to earth, but I'm enjoying the moment.\n\"It's right up there, honestly. The goal was good enough, but I think the occasion, obviously, with the derby win adds to it.\n\"It's something that will definitely live with me forever.\"\nWhen asked how his ever level-headed head coach reacted to his goal, Iredale joked it even brought a smile out of David Gray.\n\"He was actually smiling after the game, which was nice,\" he added.\n\"He's not got too high with the highs and not got too low with the lows, but it was definitely an occasion that he knew that we had to enjoy, and I think he enjoyed himself as well.\"", "url": "https://www.bbc.co.uk/sport/articles/ckgz7dj4kr5o"}