{"authors": ["Cameron Ponsonby", "www.facebook.com"], "date_download": "2025-05-20 14:23:19", "date_modify": "2025-05-20 14:23:19", "date_publish": "2023-07-29 06:08:47", "description": "Formula 1 drivers talk about the \"improvisation\" and \"instinct\" needed in wet conditions during race weekends.", "filename": "sport_formula1_63611035_1747750999.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6ED3/production/_127617382_gettyimages-1234942224.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_formula1_63611035_1747750999.html", "title": "Formula 1 drivers reflect on driving in wet conditions", "title_page": "Formula 1 drivers reflect on driving in wet conditions - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Valtteri Bottas is travelling down the start-finish line at Interlagos, Brazil, at almost 200mph.\nIt is pouring with rain and he can't see a thing. Ahead of him and stranded on the left of the track is Kimi Raikkonen, who has lost control and crashed.\nBottas gets closer and closer until he flies past the stationary Ferrari before diving into the first corner.\nThe footage of the incident appears undramatic. Until you discover that Bottas never even saw Raikkonen and only learned of his presence after the race, when he was shown the footage.\nThat he had passed so close to the Ferrari had been all luck and no judgement.\n\"Moments like that,\" reflects Bottas, \"you think like, 'this doesn't make any sense'. Do you actually enjoy it? Probably not.\"\nTo race in the wet, drivers must balance courage, skill, science and a bit of magic - operating in the realm of the impossible, and somehow managing to pull it off.\nThere are two things you need to know about racing in the wet. The first, as Bottas will attest, is that visibility is poor. The second is when the rain falls, the track changes shape.\nThat sticky racing line that has had cars hammering it over and over again ceases to be friend and becomes foe.\nThe thin layer of rubber that builds over a weekend is, in dry conditions, sticky enough that your shoes will stick to it if you walk the track after a race. But when the rain falls, it turns into black ice. Rubber on rubber is sticky. Water on rubber is not.\nThus, when the rain falls, drivers are forced to leave the beaten track and head off into the unknown, blind.\n\"In the wet, you have to improvise continuously,\" explains two-time world champion Fernando Alonso. \"In the dry, you can have a very stable circuit for an hour and a half. But in wet conditions, you will never have the same standing water on track [from one lap to the next].\"\nRacing dry versus wet is the difference between downhill skiing and going off-piste. Downhill, you follow a set path as quickly as physically possible. Off-piste, the mountain is your canvas.\n\"There's way more lines that you can take in the wet,\" says Haas driver Kevin Magnussen. \"You can really use the whole track. There's this potential for extra grip everywhere, so you have to go with your instinct.\"\nEverything has to happen in straight lines. There simply isn't enough grip for sweeping side-to-side movements.\nThere are two main techniques: the \"karting line\", where drivers will use the outside of the track where there is additional grip, and \"squaring off\"; approaching a corner, rather than following the traditional flowing racing line, drivers will, counterintuitively, make the corner sharper.\nThey will brake earlier, turn more slowly and more sharply, and then once the car is straight again, hit the accelerator.\nRain's impact also varies depending on location. At a circuit like Silverstone, a vast open space, the spray is able to clear. But somewhere like Spa, where the track is carved through the Ardennes forest, it sits there, unable to escape and causing a mist to hang across the entire circuit.\nThis poor visibility is OK when the cars are spread out. But when jammed in a pack or when the rain is particularly heavy, visibility can reduce to almost zero.\nPeripheral vision becomes a driver's main line of sight, such as looking out for braking boards or marshal posts on the side of the road as a reminder of what's coming next.\nAllan McNish, who drove for Toyota in 2002 and has won multiple Le Mans 24 Hour races, explains that such is your level of concentration you can even pick out people in the crowd.\nRomain Grosjean, who drove in 181 races between 2009 and 2020, says when visibility becomes poor he uses his ears in order to try to hear the engines of other cars around him to create a mental picture.\nHowever, this strategy is clearly not used by others...\n\"I'm not saying that [he's lying to you],\" says one driver. \"But I don't use my ears.\"\n\"I've never done that,\" says another. \"And I'm not sure I'm going to try it.\"\nEven in the kingdom of mavericks that is F1 drivers, there's always one who takes it too far.\nDespite the individual nature of driving out on track, drivers do rely on one another to keep each other safe.\nA pact of safety through speed exists, which is that when driving in a group, with visibility at its worst, you keep your foot down.\n\"When you can't see anything,\" explains Magnussen, \"you know you can't lift off because then somebody behind who [also] can't see anything is going to hit you… so you can sort of count on people being flat [out].\"\nAnd drivers have to go fast in order to have any hope of keeping the car on the road.\n\"It can be a strange loop,\" explains Alonso, \"where in wet conditions, if you go slow, you get less and less grip.\"\nYou need your tyres to be hot enough, and for them to be hot, you need to go fast. Which will then allow you to go even faster. It is like hitting topspin in tennis. You must strike the ball with more power in order to get enough spin for it to drop in. Hit it softer, and the ball will sail out.\nIt is not all feel, touch and instinct, however. Ahead of a wet race, drivers will go through onboard footage of previous wet races to see which lines worked and which didn't, digging into the memory bank of a rainy practice session from years earlier for inspiration for the best line to take.\nSometimes, behind a safety car, drivers will purposely take the car beyond its grip limit so the rear of the car will flick out. Only by taking the car to 110% will you know exactly where 100% is.\nThis commitment to operating on the edge is why legends such as Ayrton Senna, Michael Schumacher and Lewis Hamilton are made in the wet.\nAlonso explains how his level of respect goes up for those who excel in the rain, while Bottas talks of the best performances in the rain being that bit more special.\nUnanimously, drivers said that \"fear\" was the wrong word to describe driving in the wet, but that when control goes down, it can be impossible for common sense not to kick in.\n\"Sometimes you're behind the wheel,\" explains one, \"and your logical brain is saying that this is, you know, not good.\"\n\"But at the same time,\" Alonso concludes, \"you're running against a clock setting a timed lap. So it's never fast enough.\"", "url": "https://www.bbc.com/sport/formula1/63611035"}