{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:42:39", "date_modify": "2025-04-26 06:42:39", "date_publish": "2025-03-02 11:14:11", "description": "'I've never seen Warriors miss so many tackles'", "filename": "sport_articles_cq6y9433ey3o_1745649759.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a7fd/live/88801170-f755-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cq6y9433ey3o_1745649759.html", "title": "'I've never seen Warriors miss so many tackles'", "title_page": "'I've never seen Warriors miss so many tackles' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Glasgow fans, we asked you for your opinions on the gut-wrenching 31-32 loss to Ospreys at Scotstoun on Saturday night.\nHere's a taste of what you had to say:\nAbigail: Tough way to lose a game. Ospreys deserved winners - frightened Glasgow and forced them to defend as well as some stunning tries. Inexperience and lack of game time showed. Not having Jamie Dobie or George Horne released is frustrating. Hopefully lessons learned and we go on.\nAlan: The Warriors threw that game away after all the effort they'd put in to battle back at the end. By the time we'd woken up, Ospreys were three tries to the good. Then, every time we fought back, we lost concentration and allowed them back in. How we didn't manage to see the game out at the end is a mystery to me. The last 30 seconds were daft!\nChris: Injuries really biting now. Players playing out of position starting to show. I heard Ryan Wilson say Henco Venter is away at end of season. If true and Jack Mann follows, Gregor Brown and Euan Ferrie will be getting more game time which is good. Wonder who the crop behind them will be?\nAlastair: I've never seen Warriors miss so many tackles which, on top of penalties conceded, was their downfall. As good as the second choice players are, they are not a cohesive team.\nThere was an improvement in physicality when the bench forwards came on but Warriors had to work hard for their tries unlike Ospreys who, in the end, deserved the win.\nGeorge: Inexperience, lack of game time, failing to watch the clock properly, and maybe a player or two who are over the hill in terms of their careers. Hopefully this loss refocuses Glasgow and we can push on and do something this year.", "url": "https://www.bbc.co.uk/sport/articles/cq6y9433ey3o"}