{"authors": ["Lauren McCann", "www.facebook.com"], "date_download": "2025-05-21 04:33:55", "date_modify": "2025-05-21 04:33:55", "date_publish": "2025-04-04 20:09:20", "description": "Republic of Ireland manager Carla Ward says that her side were \"superb\" in the second half of their 4-0 Nations League win against Greece in Crete.", "filename": "sport_football_articles_c1dr3z9r5pro_1747802035.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5572/live/2eb9d9a0-1190-11f0-9c0d-3d00dc5c90d6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c1dr3z9r5pro_1747802035.html", "title": "Ward praises subs in 'superb' Republic of Ireland second half", "title_page": "Greece 0-4 Republic of Ireland: Ward praises subs in 'superb' Republic of Ireland second half - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Republic of Ireland manager Carla Ward said that her side were \"superb\" in the second half of their 4-0 Nations League win in Greece.\nAfter a sluggish first half, goals from substitutes Marissa Sheva and Amber Barrett, as well as Kyra Carusa and Jessie Stapleton, helped the visitors to victory.\nWard was pleased with their clinical display and the contributions of substitutes like Sheva and Barrett, as well as captain Katie McCabe, who was involved in two goals.\n\"The players deserve credit, we haven't had a lot of time on the grass but the amount of things we have implemented, particularly second half was great to see,\" she told RTE.\n\"They [the substitutes] have come on and made a huge difference in just being able to stretch Greece and play with a little bit more intensity that allowed us to dominate the game. I thought second half was superb.\"\nDespite a lacklustre first half in Crete, in which the Republic of Ireland lacked cohesion, Ward said the half-time team talk was an encouraging one.\n\"I think at half-time it was a really calm message of just remembering what we're going after,\" she added.\n\"We probably weren't looking at the spaces we wanted to and looking to stretch them, we needed to do that more and when we increased the tempo it was much better.\nThe English manager acknowledged that the introduction of McCabe was key to the turnaround, but that she has had to manage the Arsenal midfielder's minutes as she has been carrying a calf strain.\n\"We knew she had 45 minutes in her so we had a choice do we start her and have to bring her off, but I wanted to go the other way she has made a massive impact as has Marissa, I think it was a squad effort.\"\nWard also praised Barrett, who marked her 50th cap with a well-take fourth goal after coming on.\n\"What an individual and player she is to work with. She said 'thank you for giving me the opportunity' but actually I thank her for getting that final goal.\n\"That is what she is capable of she comes on and gets the goal, she is a big moment player.\"", "url": "https://www.bbc.com/sport/football/articles/c1dr3z9r5pro"}