{"authors": ["Greg Playfair", "www.facebook.com"], "date_download": "2025-05-21 06:27:24", "date_modify": "2025-05-21 06:27:24", "date_publish": "2024-12-24 11:31:01", "description": "Hearts fan voice: 'Why the support is split over Budge'", "filename": "sport_articles_cvg65w239ppo_1747808844.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/feaf/live/8d5b8980-c1e6-11ef-a2ca-e99d0c9a24e3.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cvg65w239ppo_1747808844.html", "title": "'Why the support is split over Budge'", "title_page": "Hearts fan voice: 'Why the support is split over Budge' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The one Christmas present some fans want is the news that Ann Budge is stepping down as Hearts chair.\nIt may seem odd to be bringing up this topic on the back of a victory over St Johnstone and with an Edinburgh derby fast approaching, but the truth is it needs to be discussed given how abjectly poor the season has been.\nLast Thursday's defeat by Petrocub is up there with our worst-ever results given the magnitude of what was at stake. We simply had to win at home against the worst side in the competition, who had nothing to play for.\nWe know all about the players and the fact they need to take responsibility. I said last week Neil Critchley needs to start taking flak, but we have to look up from the pitch to really evaluate what has been going wrong.\nDon't get me wrong, there's been an incredible transformation off the pitch in the last 10 years with the new main stand being built, along with a hotel and integration of the women's and girls teams to the club. Revenue has increased from £6m to over £20m in that time too.\nHowever, when you boil down to it, what can Hearts supporters say the team has achieved in that time? Three Scottish Cup final defeats, two spells in European group-stage football – which were both guaranteed from finishing third in the league - and two relegation battling spells, with one ending in the Championship and the other currently ongoing.\nI'd say there are three camps of opinion on Budge among the Hearts support.\nOne vehemently want her out yesterday. You don't have to go far to find opinions on social media, including those who say one of her main flaws is that she doesn't like confrontation and surrounds herself with 'yes people'.\nThere's then those who are supporters of Budge and call her the 'saviour of Hearts'. They point to the fact it's Budge who has financed Hearts over the last decade, including bringing wealthy people like James Anderson and now Tony Bloom to the table.\nThe rest of the support, where I'd place myself, is the 'apathetic' group, and arguably the largest. The type of supporters who are turning up to games finding it a chore and going out of habit, rather than expectation. People in this group wouldn't make a compelling case for Budge to go, but wouldn't be grovelling for her to stay.\nRegardless of the Edinburgh derby result, Budge's future at the helm of the club is a discussion that needs to be kept open and not forgotten about.", "url": "https://www.bbc.com/sport/articles/cvg65w239ppo"}