{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:23:16", "date_modify": "2025-05-21 05:23:16", "date_publish": "2025-01-31 19:32:46", "description": "Great Britain win mixed team relay gold by two seconds on the opening day of action at the UCI Cyclo-Cross World Championships in Lievin, France.", "filename": "sport_cycling_articles_clynx78pnn5o_1747804996.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a145/live/b36007b0-e008-11ef-8992-59cb2eb4d7c4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cycling_articles_clynx78pnn5o_1747804996.html", "title": "UCI Cyclo-Cross World Championships 2025: Great Britain win mixed team relay gold", "title_page": "UCI Cyclo-Cross World Championships 2025: Great Britain win mixed team relay gold - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Great Britain won mixed team relay gold on the opening day at the UCI Cyclo-Cross World Championships.\nZoe Backstedt, Milo Wills, Zoe Roche, Oscar Amey, Cat Ferguson and Thomas Mein edged out Italy by two seconds as Britain won the title for the first time.\nGB had finished second in the previous two championships but final rider Mein overturned an 11-second deficit to the USA as he lifted the British team from third.\nThe British team clocked 50 minutes three seconds to pip Italy to gold, with France crossing the line five seconds behind to beat the USA to bronze in a close race.\nMixed relay teams are composed of elite, under-23 and junior riders, with teams allowed to decide their own racing order.\nMein, the only elite rider in the British team, said: \"I was feeling a bit nervous as there were quite a lot of elite riders on the last lap, so it wasn't going to be an easy ride home.\n\"Heading over the finish line first was an incredible feeling, knowing how hard we worked and how well as a team and to see my dad at the finish line – amazing.\"\nThe UCI Cyclo-Cross World Championships 2025 take place in Lievin, northern France, from 31 January to 2 February.", "url": "https://www.bbc.com/sport/cycling/articles/clynx78pnn5o"}