{"authors": ["Chris Bevan", "www.facebook.com"], "date_download": "2025-05-20 12:14:36", "date_modify": "2025-05-20 12:14:36", "date_publish": "2023-08-04 16:06:08", "description": "BBC Sport's football expert Rachel Brown-Finnis gives her predictions for the last-16 matches at the Women's World Cup.", "filename": "sport_football_66381618_1747743276.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1A05/production/_130416660_rachelbrown-finnis'spredictions.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66381618_1747743276.html", "title": "Women's World Cup 2023 score predictions: Rachel Brown-Finnis predicts the last-16 matches", "title_page": "Women's World Cup 2023 score predictions: Rachel Brown-Finnis predicts the last-16 matches - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Half of the 32 teams are heading home, but which of the sides left standing will survive all the way to the Women's World Cup final at Stadium Australia in Sydney on 20 August?\nEight more nations will have their dreams dashed after the first knockout round, which includes England against Nigeria and holders USA against Sweden.\nBBC Sport football expert Rachel Brown-Finnis is predicting the outcome of all 64 matches at the tournament and correctly guessed the outcome of 27 of the 48 group games.\nBefore the tournament, she chose eight of the 16 teams that are through to the first knockout stage, including the Lionesses, who she believes will win the tournament\nAlong with Japan and Jamaica, Switzerland are one of only three teams not to concede a goal so far at this World Cup.\nThe Swiss have focused on being difficult to break down, but that approach was justified by them finishing top of Group A.\nIn contrast, Spain have scored lots of goals and created plenty of chances - they had 78 shots in their first three games, compared to 24 by Switzerland.\nSpain will be smarting from their defeat by Japan in their final group game, but what happened then might help them here.\nThey should be a bit more careful about being caught on the counter-attack this time, and although the Swiss will make it hard for them, Spain's firepower should see them through.\nBrown-Finnis' prediction: 0-2\nI thought Norway were down and out after they lost their first game to New Zealand. They have turned it around, but still are a bit fortunate to be in the last 16.\nJapan, in contrast, have been sensational. They have appeared unbeatable so far and look like one of the best teams in the tournament.\nThe way this World Cup has been going, with the number of shocks we have already seen, that probably means Japan are going out - but based on the way they have been playing, they will surely win this tie.\nBrown-Finnis' prediction: 2-0\nSouth Africa have done brilliantly to reach the knockout stage for the first time at a World Cup and their group was another one that was so exciting - it was in the balance until the very end.\nBanyana Banyana have scored at least once in every game so far, including against Sweden, and I am backing them to do the same here.\nBut I have to go with Netherlands to go through. The Dutch seem to have found some form at exactly the right time.\nBrown-Finnis' prediction: 2-1\nSweden 0-0 USA AET (5-4 on penalties)\nWhat a game this is. These two teams were probably expecting to be meeting each other a lot further down the line, and how strange it is for the USA to be seen as underdogs.\nSweden deserve to be the favourites in this tie, though. They have been very good at both ends of the pitch so far, especially on set-pieces, and I can see them winning it - although it could go the distance and require extra time.\nThe USA still have a lot of quality, but they haven't clicked yet. They don't appear to have much confidence or consistency when they come forward.\nThat lack of cutting edge could cost them here, and see them fail to make the World Cup semi-finals for the first time in their history.\nBrown-Finnis' prediction: 2-1 after extra time\nThe way this World Cup has gone appears to have opened up an easier path to the semi-finals than England probably expected. Germany and Brazil are out, so the winner of this tie will play Colombia or Jamaica next.\nIt would be foolish to think that far ahead, though, because we have to get past Nigeria first and they are going to be very hard to score against. We can't take anything for granted.\nNigeria will concede possession, so England will see a lot of the ball like we did against China, but they are stronger at the back and we will have to be careful of their threat on the break.\nEngland have played against plenty of teams like this before, though, and Sarina Wiegman's side will be ready.\nThe Lionesses have got so many attacking options now, and I feel like they will have the tools and the tactics to break Nigeria down.\nBrown-Finnis' prediction: 2-0\nMorocco have learned very quickly what it takes to play at a World Cup, and how they obviously could not continue to be as open as they were when they lost 6-0 to Germany in their opening game.\nEveryone thought they might go on to suffer some more heavy defeats in Group H but, instead, they did not concede another goal.\nFrance, meanwhile, have stumbled through a bit. They ended up top of Group F, but they have not looked especially convincing so far.\nI started this tournament backing many of the European teams to do well in these predictions because of their experience, and also because I know more about more of their players.\nBut a lot of results have not gone as expected because standards are rising everywhere, Morocco - who are ranked 72nd in the world - are a great example of a team that has shaken the established order up.\nThey have confidence and momentum and, while I don't think they will have quite enough to beat France and cause another upset, they will push them very close.\nBrown-Finnis' prediction: 1-0", "url": "https://www.bbc.com/sport/football/66381618"}