{"authors": ["Matthew Henry", "www.facebook.com"], "date_download": "2025-05-20 13:02:45", "date_modify": "2025-05-20 13:02:45", "date_publish": "2023-08-01 10:32:30", "description": "Stuart Broad's farewell, Zak Crawley's first ball and Alex Carey's stumping. Look back on the 10 moments that defined a memorable men's Ashes series.", "filename": "sport_cricket_66351534_1747746165.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/170DE/production/_130603449_gettyimages-1528189228.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66351534_1747746165.html", "title": "Men's Ashes 2023: The moments that defined series between England and Australia", "title_page": "Men's Ashes 2023: The moments that defined series between England and Australia - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Published\n1 August 2023\nMissing it yet?\nEngland and Australia have given us some incredible drama over the last six weeks, culminating with a dramatic final day of the series on Monday.\nIt's time to reminisce about the moments that defined the men's Ashes summer...\n'Stuart Broad gives us the feels one last time'\n'Pure joy and happiness' - Broad on fairytale finale\nBroad bowls England to series-levelling win\nMcCullum praises England's 'refined' style\nCrawley hits first ball of series for four\nHow long ago does this feel?\nZak Crawley, after all of the build-up - a series hyped more than any in a generation, crashing the very first ball of the series through the covers.\nBen Stokes looked stunned in the dressing room. The Edgbaston crowd roared.\nIt set us on the way for an epic series and was a huge symbol of how England would go on to play.\nStokes' early declaration\nBen Stokes surprised everyone with the earliest declaration in Ashes history at 393-8 after 78 overs, all while Joe Root was unbeaten on 118.\nUltimately it did not pay off. David Warner and Usman Khawaja survived four overs to the close, with the tourists winning the first Test on the final day.\nIt will still be one of the most memorable moments from this series.\nAustralia win Edgbaston thriller\nIt's easy to forget now that this series started with an all-time classic, Australia chasing 281 late into the fifth day.\nWhen Alex Carey was caught and bowled by Joe Root, Australia were 227-8 and England were huge favourites.\nWith 37 needed, Stokes almost pulled off an incredible flying catch to dismiss Nathan Lyon, only for the ball to spill agonisingly out of his grasp.\nThe nerve-shredding finale continued but Lyon and Pat Cummins, who shared an unbroken stand of 55, defied England and the raucous Birmingham crowd.\nBairstow carries off protestor\nThis was another moment that makes you look back and think \"did that really happen?\".\nOn the first morning of the second Test at Lord's, two Just Stop Oil protestors interrupted play by invading the field.\nThey ran towards the middle but were stopped by the players - one of the protestors carried off the field by England wicketkeeper Jonny Bairstow.\nThe Home of Cricket had never seen the like before.\nCarey stumps Bairstow on incredible Lord's fifth day\nA day that will go down in Ashes history and ignited a series that did not need any further rocket fuel.\nIt was all sparked by Alex Carey's controversial stumping of Jonny Bairstow.\nWas it against the spirit of cricket or smart work from the Australia wicketkeeper? You've probably made your own mind up by now.\nThat incident created the most hostile atmosphere seen at Lord's in recent memory, the Australians booed and jeered at every turn with scenes turning ugly in the pavilion.\nOn the field, Stokes threatened to play the greatest innings in Test history. He belted 155 while Stuart Broad channelled his fury to support him in a stand of 108 for the seventh wicket.\nStokes was caught off Josh Hazlewood, however, and England fell to a 43-run defeat as Australia took a 2-0 lead.\nWood & Woakes enter the series\nAs the Carey debate raged, the series moved on to Headingley. There Mark Wood entered the series to thrilling effect.\nOn the first day, he took 5-34 - at one stage reaching 96.5mph in a gripping spell of fast bowling that captivated the Leeds crowd.\nChris Woakes also made his first appearance of the series, and it was Woakes and Wood there at the end as England completed a tense three-wicket win.\nCrawley's hundred for the ages\nThe highest score of the series was Zak Crawley's sublime 189 in the drawn fourth Test at Old Trafford.\nHe dominated the Australian attack on day two, striking 21 fours and three sixes on England's best day of Bazballing in the series.\nThey racked up 384-4 in 72 overs with Crawley and Root combining for a double-century stand at better than a run a ball.\nRain washes away England's hopes\nThe Wizard's wickets on final day\nThe rain in Manchester left England needing to win the final Test to level the series at 2-2.\nThey played well over the first three days but nerves were jangling on the final day when Usman Khawaja and David Warner reached 140-0 - giving Australia a perfect start in their chase of 384.\nUp stepped Woakes, removing both openers.\nAustralia looked on course again later in the day at 264-3 but, in a rip-roaring period at The Oval, Woakes and spinner Moeen Ali took four wickets for 11 runs to set England on their way.\nWoakes claimed the key wicket of Steve Smith and, despite only playing three matches, finished with 19 wickets and the player of series award.\nBroad's fairytale finale\nWhere else could we finish?\nThere were whispers something could be brewing on Saturday afternoon but it still came as a surprise when England bowler Stuart Broad announced he would retire after the final Test.\nThat left the script perfectly written and the crowd cheering him everywhere he went.\nBroad is not one to miss out on a big moment.\nThe Ashes legend took the final two wickets - even repeating his trick of swapping the bails to bring about good fortune - before walking off the field for the final time, the series squared at 2-2.\nWhat a series!", "url": "https://www.bbc.com/sport/cricket/66351534"}