{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:16:30", "date_modify": "2025-05-21 06:16:30", "date_publish": "2025-03-31 09:07:38", "description": "MS Dhoni: CSK batter cannot bat for 10 overs in IPL, says head coach Stephen Fleming", "filename": "sport_cricket_articles_ckgx1mmvkr4o_1747808190.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/aeff/live/6b89b2d0-0e0f-11f0-90cb-6de76cd8d1c0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_ckgx1mmvkr4o_1747808190.html", "title": "MS Dhoni: CSK batter cannot bat for 10 overs in IPL, says head coach Stephen Fleming", "title_page": "MS Dhoni: CSK batter cannot bat for 10 overs in IPL, says head coach Stephen Fleming - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Legendary India wicketkeeper MS Dhoni \"can't bat for 10 overs\" during the Indian Premier League, says Chennai Super Kings head coach Stephen Fleming.\nDhoni, 43, is continuing to play in the tournament despite not playing any other cricket and has come in at eight, nine and seven in CSK's first three games.\nHe only faced two balls in the first game which Chennai won, before he made 30 from 16 in vain in their defeat by Royal Challengers Bengaluru.\nThe right-hander then came in in the 16th over and made 16 from 11 before being dismissed as CSK slipped to a six-run defeat by Rajasthan Royals on Sunday.\nOver his stellar career Dhoni has earned a reputation as one of the game's great finishers with the bat but his strike-rate has declined over recent years.\n\"It's a time thing - MS judges it,\" said Fleming. \"His knees aren't what they used to be. He's moving OK, but there's still an attrition aspect to it.\n\"He can't bat 10 overs running full stick, so he will gauge on the day what he can give us.\n\"If the game's in the balance, he will go a little bit earlier, and he backs other players when other opportunities are up. It's about balancing that.\n\"I said last year he's too valuable and leadership wise to throw him in after nine or 10 overs - he's never done that. From around 13/14 he's looking to go depending on who is in.\"", "url": "https://www.bbc.com/sport/cricket/articles/ckgx1mmvkr4o"}