{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:10:21", "date_modify": "2025-05-19 15:10:21", "date_publish": "2015-02-20 14:42:15", "description": "League One Bradford want another \"special atmosphere\" at Valley Parade for their FA Cup quarter-final tie against Reading.", "filename": "sport_football_31555136_1747667421.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81135000/jpg/_81135341_clarke_getty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31555136_1747667421.html", "title": "Bradford and Reading freeze FA Cup quarter-final ticket prices", "title_page": "Bradford and Reading freeze FA Cup quarter-final ticket prices - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Bradford and Reading have agreed to keep ticket prices at £15 for their FA Cup quarter-final on Saturday, 7 March.\nA record capacity crowd of 24,021 saw City's fifth-round win over Sunderland at Valley Parade and they are keen to repeat that \"special atmosphere\".\nThe League One Bantams, who also knocked out Premier League leaders Chelsea in round four, are in the last eight for the first time since 1976.\nUnder-16 tickets will cost £5, with seniors and students paying £10.\nAston Villa, who play West Midlands rivals West Brom in the first of the BBC's televised games on Saturday, 7 March at 17:30 GMT, are charging between £20-30 for adults and £10 for under-18s.\nManchester United face Arsenal on Monday, 9 March at 19:45 GMT on BBC One. A junior Red Devil will pay £13 to be at Old Trafford, with adult prices ranging from £31 to £53.\nLiverpool, who take on Blackburn, also have junior tickets available for £5 with adults paying between £27 and £35 for the tie, which like Bradford's, will be shown by BT Sport.\nBoth home and away clubs have to agree ticket prices for FA Cup matches.", "url": "https://www.bbc.com/sport/football/31555136"}