{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:54:48", "date_modify": "2025-05-21 03:54:48", "date_publish": "2025-02-09 17:01:59", "description": "Exeter Chiefs and Newcastle Falcons seal quarter-final places in the Premiership Rugby Cup with wins over Cornish Pirates and Caldy.", "filename": "sport_rugby-union_articles_cgmydr9jyp2o_1747799688.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a270/live/033d1b40-e6ff-11ef-a39a-7b0f4e03d69d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cgmydr9jyp2o_1747799688.html", "title": "Premiership Rugby Cup: Exeter Chiefs & Newcastle Falcons reach quarter-finals", "title_page": "Premiership Rugby Cup: Exeter Chiefs & Newcastle Falcons reach quarter-finals - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Exeter Chiefs and Newcastle Falcons sealed quarter-final places in the Premiership Rugby Cup as they both made it five wins out of five in the group stage.\nExeter beat Cornish Pirates 43-7 to ensure they finish top of Pool E, while Newcastle dominated Caldy 73-12 to go through as Pool A winners.\nThey join fellow Premiership sides Bath and Harlequins in the last eight with the final four places to be determined next weekend.\nWirral-based Caldy and fellow Championship side Cornish Pirates will both finish bottom of their groups having lost all five games.\nDespite Exeter and Newcastle struggling in the Premiership, their cup form has been excellent.\nAt Sandy Park Paul Brown-Bampoe starred for the hosts, scoring four tries, including a hat-trick after the break as Exeter pulled clear from their 10-7 half-time advantage.\nRichard Capstick, Tommy Wyatt and Ethan Roots also went over for Rob Baxter's side, with Tom Georgiou scoring Pirates' only try in the first half.\nNewcastle completely outclassed their lower league opponents, running in 11 tries at Kingston Park.\nCaldy took a surprise lead through Will Robinson, but from then on Falcons took complete control with Jamie Blamire, Nathan Greenwood, Freddie Lockwood and Joe Davis all crossing twice.\nTries from Adam Brocklebank, Connor Doherty and Reuben Parsons completed the rout.", "url": "https://www.bbc.com/sport/rugby-union/articles/cgmydr9jyp2o"}