{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:16:48", "date_modify": "2025-05-20 13:16:48", "date_publish": "2023-08-03 00:00:00", "description": "Follow text and radio commentary as Northern Superchargers host Birmingham Phoenix in the 2023 Men's Hundred.", "filename": "sport_live_cricket_66306326_1747747008.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/10896/production/_130643776_344e3e3530e7f794eb442be85a22b5438428aaf0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_cricket_66306326_1747747008.html", "title": "The Hundred 2023 LIVE: Northern Superchargers vs Birmingham Phoenix in men's competition plus score, commentary, video highlights & updates", "title_page": "The Hundred 2023 LIVE: Northern Superchargers vs Birmingham Phoenix in men's competition plus score, commentary, video highlights & updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Match abandoned\nSadly, on this occasion, I am not wrong. The match has officially been abandoned.\nGiven the state of the outfield, I can't say it is a surprise.\nOne point apiece for the Superchargers and the Phoenix.\nHere are some of the best moments from the game for you to enjoy again.\nPost\nThere is movement at Headingley. The umbrellas are down certainly but it looks like it is still raining as the umpires wander out for a look.\nIf it is indeed still raining, I fear we may not be too far away from an abandonment.\nI hope I'm wrong. I often am.\nDavidson-Richards powers Superchargers to win\nThe rain may be holding things up now a Headingley but we have managed to get one game in already and it was dominant by Alice Davidson-Richards.\nThe all-rounder took three wickets, two catches, a run out with a direct hit and hit the winning runs with a six as Northern Superchargers comprehensively beat Birmingham Phoenix.\nRead Mike Peter's report from that one here.\nPost\nIf I tell you that the ground staff are handing around a packet of biscuits, that should let you know that any clear up isn't exactly imminent.\nGiven the size of the puddles on the outfield, I'd be surprised if it takes any less than an hour to make it playable which would mean time is running out...\nPost\nThat rain caught just about everyone by surprise. It went from nothing to some of the heaviest rain we've seen all summer (and we've seen plenty of rain) in a matter of moments.\nThe hope is that it'll disappear just as quickly and the players can get back out there ASAP.\nPost\nOK, now it really is raining quite hard. How disappointing.\nNo, seriously, this is a real deluge.\nThe ground staff are busy pushing groundsheets under the covers to prevent any water getting onto the pitch itself.\nPhoenix 83-5\nMatthew Short is the third Superchargers bowler to bowl 10 balls on the trot and does so very well.\nJust two runs from his second set of five as Ben Duckett - playing something of a lone hand for the Phoenix - and Chris Benjamin try to regroup.\nWICKET\nShadab c & b Short 0 (Phoenix 81-5)\nTwo in three balls for Matthew Short! Phoenix are wobbling here.\nShadab Khan gave himself plenty of room, tried to launch the ball back down the gorund but hit it straight up.\nShort took a couple of paces backwards and steadied himself to take the catch. No mistake and the Superchargers will be delighted with how this is going.", "url": "https://www.bbc.com/sport/live/cricket/66306326"}