{"authors": ["Sean Kearns", "www.facebook.com"], "date_download": "2025-05-21 06:09:43", "date_modify": "2025-05-21 06:09:43", "date_publish": "2025-01-14 10:24:05", "description": "All Premier League clubs are deemed financially compliant for the 2023-24 season, including Leicester, Newcastle, Aston Villa & Newcastle.", "filename": "sport_football_articles_cx2y7l0dk02o_1747807783.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a000/live/5b4d4d50-d264-11ef-9dbb-9559c8b74d9b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cx2y7l0dk02o_1747807783.html", "title": "Premier League clubs avoid PSR charges for 2023-24 season", "title_page": "Premier League clubs avoid PSR charges for 2023-24 season - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The Premier League has not charged any clubs for breaches of its financial rules after all were deemed financially compliant for the 2023-24 season.\nMost top-flight clubs had to submit their accounts for the 2023-24 season by 31 December and the Premier League is satisfied all 20 members have remained within its profit and sustainability rules (PSR).\nUnder PSR, clubs cannot post losses of more than £105m over a three-year period.\nIt had been reported Leicester City were one of a number of clubs close to breaching the Premier League's margins for allowed losses.\nThe Foxes avoided a points deduction after they won an appeal against a charge in September, which covered the three years up until the end of the 2022-23 season.\nAn independent panel found the Premier League did not have the jurisdiction to punish the Foxes as the club had been relegated to the EFL Championship when their accounting period ended on 30 June 2023.\nIn a joint statement on Tuesday, Leicester and the Premier League said the matter remains \"the subject of confidential arbitration proceedings\".\nEverton became the first club to be charged by the Premier League for breaches of its financial rules in 2023.\nAn independent commission found the Toffees posted losses amounting to £124.5m to 2021-22 and docked the club 10 points, which was later reduced to six on appeal.\nEverton were then sanctioned for a second time in January 2024, alongside Nottingham Forest.\nThe Toffees received an additional two-point deduction for being £16.6m over the loss limit for the three-year period to 2022-23.\nForest were deducted four points after an independent commission found the club's losses to 2022-23 breached the threshold of £61m by £34.5m.\nFor clubs that were not in the Premier League for the duration of the previous three-year cycle - such as Forest, who were promoted to the top flight in 2022 - there are separate thresholds.\nBased on a busy early summer of player trading between a small group of clubs before the 30 June cut-off - as well as football finance experts' analysis of recent accounts - the clubs closest to PSR limits were understood to be Leicester City, Aston Villa, Newcastle United and Everton.\nMany of the deals before the 30 June deadline involved home-grown academy product players, as they represent 'pure profit' in PSR terms.\nFor example, a player signed for £80m on a four-year contract is essentially worth £20m for every year they play at the club due to amortisation of the transfer fee.\nBut selling an academy product - who typically cost little or, in most cases, nothing - can be included in one year's reporting and is considered 'pure profit'.\nVilla were particularly active before the accountancy deadline, selling Brazil midfielder Douglas Luiz to Juventus and Omari Kellyman to Chelsea, with Blues defender Ian Maatsen moving in the opposite direction for a fee of about £35m.\nThey needed to sell players to comply with the rules, having reported a loss of £119.6m in their accounts to 31 May 2023.\nNewcastle boss Eddie Howe said the club reluctantly let youngsters Elliot Anderson and Yankuba Minteh join Nottingham Forest and Brighton respectively in order to remain compliant.\nHowe referenced the club's summer transfer dealings in his news conference on Tuesday morning, when asked if the club was in danger of breaching PSR.\n\"No, I don't believe we are [on that list],\" he said.\n\"The breaching of financial fair play for us was something that we fought really hard against in the summer to not be in that position - and that's why the departures of the ones we didn't want to happen had to happen.\"\nChelsea, who spent £747m in the 2022-23 season alone, sold their women's team to the club's parent company on June 28 2024 - two days before the end of their financial year - in order to boost their finances.\nThe Blues' sale of two hotels next to Stamford Bridge to a sister company for a fee of £76.5m was cleared by the Premier League in September.\nMany Leicester supporters were fearing the Foxes would be charged by the Premier League.\nManager Ruud van Nistelrooy said the club were confident they were compliant with the rules when he was appointed in December.\n\"I am focused on getting the right players in and winning,\" the Dutchman said earlier this week.\n\"I think it's for the club to comment, but the conversations I had were clear and open. We're on that page and in that process.\"\nLeicester sold Kiernan Dewsbury-Hall to Chelsea for a fee of about £30m, following manager Enzo Maresca's appointment at Stamford Bridge.\nThe Foxes earned about £10m in compensation for Maresca's move, with the Italian's backroom staff also joining him in west London.\nWhile Leicester have been deemed compliant for the previous three-year cycle, they remain at risk with proceedings still ongoing from their successful appeal against a charge in 2024.", "url": "https://www.bbc.com/sport/football/articles/cx2y7l0dk02o"}