{"authors": ["Bobbie Jackson", "www.facebook.com"], "date_download": "2025-05-21 04:46:25", "date_modify": "2025-05-21 04:46:25", "date_publish": "2025-04-05 05:58:50", "description": "Olympic champion Gabby Thomas wins the first race at the inaugural Grand Slam Track event in Kingston, Jamaica.", "filename": "sport_athletics_articles_cvg7r84zv1no_1747802785.html", "image_url": "https://ichef.bbci.co.uk/ace/standard/1024/cpsprodpb/d090/live/598b4aa0-11e1-11f0-9117-af4f1f10e706.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_athletics_articles_cvg7r84zv1no_1747802785.html", "title": "Grand Slam Track: Olympian Thomas kicks off inaugural event with 200m win", "title_page": "Grand Slam Track: Olympian Thomas kicks off inaugural event with 200m win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Olympic champion Gabby Thomas won the first race at the inaugural Grand Slam Track event in Kingston, Jamaica.\nAmerican Thomas, who picked up three gold medals at the Paris Olympics last summer, set the pace in the 200m, crossing the line in 22.62 seconds.\nMarileidy Paulino, the Dominican Republic's Paris Olympics 400m gold medallist, was second with Britain's Dina Asher-Smith third.\n\"Normally, these early season meets we're just practising and feeling it out,\" Thomas said.\n\"Here... the stakes are high, the prize pot is huge and the level of competition is also really high.\n\"That's not something that we're really used to in our sport and I think it's really good.\"\nThe Grand Slam Track is a concept conceived by four-time Olympic champion Michael Johnson in a bid to maintain the attention and excitement the sport generates every four years at the Games.\nFollowing Friday's opening event in Jamaica, there are a further three 'Slams' scheduled to take place in the United States between May and June.\nAthletes each feature in two events with Thomas also due to run in the 400m on Saturday.\nFellow American Sydney McLaughlin-Levrone also recorded a comfortable victory in the 400m hurdles - an event where she holds the world record.\nMcLaughlin-Levrone, who crossed the line in 52.76secs, is in pole position to claim the $100,000 (£77,600) being offered to the athlete with the best combined result from the 400m hurdles and 400m.\n\"Just shaking the cobwebs off,\" McLaughlin-Levrone said on the Peacock broadcast.\n\"Obviously that first one always hurts but I'm happy to be here. Great experience.\"\nElsewhere, American Kenny Bednarerk ran a time of 10.07secs to beat Jamaica's Oblique Seville in the men's 100m with Briton Zharnel Hughes coming third.\nNewly crowned world indoor 400m champion Chris Bailey maintained his impressive start to the year by edging Britain's Matt Hudson-Smith.", "url": "https://www.bbc.com/sport/athletics/articles/cvg7r84zv1no"}