{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:56:47", "date_modify": "2025-05-21 06:56:47", "date_publish": "2025-03-29 13:44:47", "description": "Eoin Morgan says England could make a \"left-field call\" with their new white-ball captaincy with Test skipper Ben Stokes parachuted in for major tournaments.", "filename": "sport_cricket_articles_cj0q0lj3n49o_1747810607.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/97c7/live/27123250-0ca0-11f0-ab49-f3f2440ca034.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cj0q0lj3n49o_1747810607.html", "title": "Eoin Morgan: Former England cricket captain says Ben Stokes should lead in white-ball ICC events", "title_page": "Eoin Morgan: Former England cricket captain says Ben Stokes should lead in white-ball ICC events - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Eoin Morgan says England could make a \"left-field call\" with their new white-ball captaincy and create an arrangement where Test skipper Ben Stokes is parachuted in to do the job for major tournaments.\nEngland are looking for a new captain for the men's one-day and T20 sides after Jos Buttler resigned following their early exit in the Champions Trophy.\nMorgan, who skippered England to 50-over World Cup glory in 2019, has suggested a scenario where a \"lieutenant\" of Stokes' holds the reins for the vast majority of bilateral series with the red-ball skipper brought back for World Cups.\nEngland director of men's cricket Rob Key said earlier this month it would be \"stupid\" not to consider Stokes as a white-ball captain.\nStokes, 33, has been Test captain since 2022 but the all-rounder has not played white-ball cricket for England since the 2023 50-over World Cup.\n\"I think a bit of a left-field call would be to ask Ben Stokes to consider the role, not necessarily on a full-time basis,\" Morgan told Sky Sports, external.\n\"You would have to create an environment where Ben would slip in and out seamlessly in preparation for big tournaments and then sit on the backburner and focus on Test match cricket until those big tournaments came up.\n\"Everyone would have to be on the same page about how it might work.\"", "url": "https://www.bbc.com/sport/cricket/articles/cj0q0lj3n49o"}