{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:31:05", "date_modify": "2025-05-21 07:31:05", "date_publish": "2025-03-28 17:23:58", "description": "QPR attacking midfielder Ilias Chair is ruled out for four weeks with a hamstring injury he picked up against Middlesbrough.", "filename": "sport_football_articles_c70w074eyvqo_1747812665.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0422/live/f6306600-0bf7-11f0-a31d-7bdcf6d7d2f6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c70w074eyvqo_1747812665.html", "title": "Ilias Chair: QPR attacker out four weeks with hamstring injury", "title_page": "Ilias Chair: QPR attacker out four weeks with hamstring injury - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "QPR attacking midfielder Ilias Chair has been ruled out for four weeks with a hamstring injury sustained against Middlesbrough.\nThe Morocco international was substituted in the 55th minute of his side's 2-1 defeat at Riverside Stadium on 11 March, with Hoops manager Marti Cifuentes \"very concerned\" at the time.\nSpeaking before his side's match at Stoke City on Saturday (15:00 GMT), Cifuentes said he was hopeful the 27-year-old would return before the end of the season.\n\"It seems like a hamstring injury that will take some time for him to recover,\" he told BBC Radio London.\n\"I think we need to take it week-by-week but there is a possibility that he might be back before the end of the season, yes.\"\nCifuentes said he hoped to have Jonathan Varane and Alfie Lloyd back for the Stoke trip, but captain Steve Cook would miss the game, external with a foot injury.\nQPR sit 15th in the Championship with 45 points, seven points clear of Derby County in the relegation zone.\nThe Hoops ended a run of four consecutive defeats in a 2-2 draw with league leaders Leeds United before the international break.\n\"I think the main target as a club is to try to avoid relegation, and then it's true that internally the way I am as a coach and together with the players, the aim was to try to push a bit more than this,\" Cifuentes said.\n\"My philosophy is 'whatever you did yesterday, try to do it better today'. That's the aim of high performance, to always have your best version.\n\"The target is still there for me. I won't be happy if we don't reach at least 56 points. I'm competitive and we're aligned - the players want to push.\"\nSpeaking of the match against Stoke, he added: \"In the last six games they only lost one at home. In the last six games they got four clean sheets at home, so when you check those stats you can expect a difficult game.\"", "url": "https://www.bbc.com/sport/football/articles/c70w074eyvqo"}