{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:11:52", "date_modify": "2025-05-20 13:11:52", "date_publish": "2023-08-01 07:55:49", "description": "Players from Argentine side Velez Sarsfield said they were ambushed by the club's ultra fans who threatened to shoot them.", "filename": "sport_football_66369347_1747746712.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/11116/production/_130601996_gettyimages-1566019412.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66369347_1747746712.html", "title": "Velez Sarsfield players claim fans threatened to shoot them after defeat", "title_page": "Velez Sarsfield players claim fans threatened to shoot them after defeat - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Players from Argentine side Velez Sarsfield said they were ambushed by the club's ultra fans who threatened to shoot them.\nThe incident happened after Velez players returned to their training camp following a 1-0 defeat by Huracan.\nSunday's game was Uruguay defender Diego Godin's last before retirement.\n\"Atletico Velez regrets and strongly repudiates the intimidating situation experienced by some of our first-team players,\" said the club in a statement., external\nVelez players Gianluca Prestianni, Leonardo Jara, Santiago Castro and Francisco Ortega are reported to have been involved as victims in the incident involving the 'Barra Brava' fans.\n\"We arrived (at the stadium) to get our cars and go home,\" Prestianni told ESPN., external\n\"We came out and it was all dark when the cars of the 'Barra Brava' came across us. There were probably five or six of them.\n\"They hit me twice in the face while grabbing me by the jacket. I was too scared and my team-mates didn't want to go home in case they were followed.\n\"They even told one of them, 'Get out of the car or I'll shoot you twice in the legs'.\"\nSpeaking to a local radio station, Jara said: \"They crossed a car in front of me, they wanted me to get out of mine and said they were going to shoot me in the legs.\"\nVelez have endured a difficult season which has included just five wins in 27 games.", "url": "https://www.bbc.com/sport/football/66369347"}