{"authors": ["Joe Rindl", "www.facebook.com"], "date_download": "2025-05-21 08:01:22", "date_modify": "2025-05-21 08:01:22", "date_publish": "2025-05-19 16:18:16", "description": "Dean Henderson produced an FA Cup-final performance for the ages to help Crystal Palace win their first major trophy - BBC Sport looks at the making of the Eagles' Wembley hero goalkeeper.", "filename": "sport_football_articles_c4gr30yyyyro_1747814482.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1b58/live/80a73470-34b2-11f0-8519-3b5a01ebe413.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c4gr30yyyyro_1747814482.html", "title": "Dean Henderson: The making of Crystal Palace's FA Cup-final hero goalkeeper", "title_page": "Dean Henderson: The making of Crystal Palace's FA Cup-final hero goalkeeper - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Dean Henderson said he knew which way Omar Marmoush was going to put his penalty in the FA Cup final.\nMaybe it was down to his preparation.\nMaybe it was down to his years as an outfielder in Carlisle's academy.\nMaybe it was down to his time at Shrewsbury for whom he saved a spot-kick in a Wembley play-off final.\nWhatever it was, Henderson produced an FA Cup-final performance for the ages - surviving a video assistant referee (VAR) red-card check, stopping a penalty, and pulling off a hatful of top saves to help Crystal Palace win their first ever major trophy.\nIt is the peak of the 28-year-old's career.\nBut how he got here is story of a rapid rise and plenty of setbacks.\nHenderson was born in Whitehaven, a town of about 25,000 people on the north-west coast 40 miles from Carlisle.\nGrowing up his two brothers, one of them six years older and the other a year his senior, would take shots at him in the garden., external\nBut it was as an outfielder he was initially scouted by Carlisle United at eight years old.\n\"At around under-11s the goalkeeper didn't show up for one of the games,\" said former Carlisle Under-15s assistant coach David Hughes.\n\"He just jumped in goal and took the spot. From there it just rolled. He was clearly a natural.\"\nEventually settling between the sticks, Henderson and his dad would make the two-and-a-half-hour round trip to Carlisle's academy up to five times a week.\nAt 14 he was playing with the age group above. In the summer he would train alongside Carlisle's first-team goalkeepers.\n\"He was technically the best player at the club and everybody was aware of who he was. Newcastle were after him at that point,\" added Hughes.\n\"He was small, he was undersized. We were just waiting for him to hit that growth spurt to go to the next level.\n\"He was extremely dedicated. It's not always guaranteed that it's going to work out. The kid obviously had a lot of talent, but it takes a lot more than talent to get to the level he's got to.\"\nA childhood Manchester United fan, Henderson secured his dream move to the Old Trafford club's academy aged 14, though it meant he had to move away from his family and live in accommodation organised by the club.\nHe had two short loan spells at Stockport County and Grimsby Town, but it was at League One Shrewsbury in 2017, aged 20, when he first made his name.\n\"He was quite a flamboyant character, loved by the home fans and had a knack of winding up the away supporters,\" said BBC Radio Shropshire sports presenter Nick Southall.\n\"He was self-confident, yes, but he didn't have any sort of ego. He took to life at Shrewsbury. Moving from Manchester maybe with his own upbringing he felt more at home with a slower, more rural life.\n\"He was somebody that everybody warmed to. He was very prolific on social media at the time and did a lot of work with the Shrewsbury foundation.\n\"He was as good as Joe Hart and he seemed to thrive off fans' energy - especially at Wembley.\"\nDespite Shrewsbury's small budget, the club reached both the EFL Trophy and League One play-off finals in 2017-18.\nIn Shrewsbury's 1-0 cup final defeat by Lincoln, Henderson was at the centre of a controversial moment when he was struck by the elbow of striker Matt Rhead, who narrowly escaped a red card.\nIn the play-off final at Wembley - which Shrewsbury lost 2-1 to Rotherham - Henderson saved David Ball's first-half penalty.\nIt was at the same end and struck towards the same side as Marmoush's spot-kick on Saturday.\n\"It was written in the stars,\" added Southall.\n\"Henderson said he'd love to one day return to Shrewsbury. This was the move that put him in the shop window.\"\nAfter Shrewsbury, Henderson spent two seasons on loan at Sheffield United, helping them to promotion from the Championship and a ninth-place Premier League finish.\nImpressed with his success at Bramall Lane, Manchester United manager Ole Gunnar Solskjaer made him part of the 2020-21 first-team squad.\nAt the time Henderson appeared set to become the next number one at Old Trafford. He made his senior England debut against the Republic of Ireland in November 2020, and started 10 of United's final 12 Premier League games that season.\n\"There was a growing feeling De Gea would be moved on that summer,\" said BBC Sport's chief football news reporter Simon Stone.\n\"Henderson thought he had been promised he would become United's number one in 2021-22.\n\"Solskjaer never said so publicly so no-one knew what the situation was, and then Henderson caught Covid-19 a week or so before the next season started.\n\"The virus lingered for a while, by which time De Gea had started the season, had done well in a winning team and kept his place.\n\"It all unravelled in the space of five Premier League games in a month. De Gea played in them all but Solskjaer got sacked and first Michael Carrick, then Ralf Rangnick, chose the Spaniard over Henderson.\"\nDesperate for more first-team action Henderson went on loan to Nottingham Forest in July 2022. Just over a year later he was allowed to join Crystal Palace permanently, on a five-year deal worth up to £20m.\n\"New United manager Erik ten Hag made it pretty clear that ultimately he wanted Andre Onana as his first-choice keeper so there was never any chance Henderson would stay as he felt he should be number one,\" added Stone.\n\"He actually made quite a few mistakes at Forest, so I never got the impression United felt they had made a mistake by letting him go.\"\nAnd what about his time at Selhurst Park?\n\"When Palace brought in Dean Henderson, there was some surprise amongst fans,\" said BBC Sport football news reporter Alex Howell.\n\"The transfer fee in the region of £20m seemed to be high, especially when the Eagles had Sam Johnstone on the books who at the time was playing his way into the England set-up as Jordan Pickford's number two.\"\nLast season a thigh injury kept Henderson out for two months, and he was briefly dropped after a 3-1 defeat by Chelsea halfway through the campaign.\nHe won back his place though, and last summer Johnstone was transferred to Wolves, with Henderson given the vacant number one jersey.\n\"His passion and character has endeared him to Palace fans and they now sing that he's England's number one,\" added Howell.\n\"He started the Nations League game against Finland for England under Lee Carsley in October.\n\"That could be a big indication that Henderson could be able to force his way into Thomas Tuchel's plans.\"", "url": "https://www.bbc.com/sport/football/articles/c4gr30yyyyro"}