{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:09:29", "date_modify": "2025-05-21 04:09:29", "date_publish": "2024-12-29 00:00:00", "description": "Cardiff City win their first Championship game in 10 attempts as they beat Watford 2-1 at Vicarage Road.", "filename": "sport_football_live_cvgmjz5e384t_1747800569.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cvgmjz5e384t_1747800569.html", "title": "Robinson double helps Cardiff stun Watford", "title_page": "Watford 1-2 Cardiff City: Callum Robinson double helps Cardiff stun Watford - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cardiff City won their first Championship game in 10 attempts as they beat Watford 2-1 at Vicarage Road.\nThe Bluebirds were ahead after just 55 seconds, as Callum Robinson found space inside the Watford box before finding the bottom corner.\nThe Hornets had 75% possession in the first half, and were level when Giorgi Chakvetadze was left unmarked at the back post and beat Jak Alnwick.\nBut against the run of play the Bluebirds restored their lead before half-time, Cian Ashford squaring the ball for Robinson to tap home his second.\nWatford continued to see vastly more of the ball in the second half, but they failed to cause Alnwick any problems.\nA first away win of the season for the Bluebirds sees them climb to 22nd, while Watford - who lose at home for the first time in the Championship - stay sixth.\nTom Cleverley made four changes to the team which beat Portsmouth 2-1 on 26 December.\nRocco Vata, who scored the winner for the Hornets, was handed a start in place of the suspended Kwadwo Baah - who was sent off for taunting the Portsmouth fans at full time.\nCardiff, meanwhile, made three changes from their 3-2 defeat at Oxford United, including a start for youngster Ashford.\nAnd it was the Bluebirds who were ahead within 60 seconds.\nCallum O'Dowda picked out compatriot Robinson inside the Watford box, and the Republic of Ireland striker did excellently to turn and find the bottom corner.\nWatford appeared stunned having conceded so early, and took 18 minutes before carving out their first chance, but Vata's shot from the edge of the area went over.\nThe Hornets grew into the game as the first half ticked by, but the visitors remained a threat on the counter-attack.\nCardiff had to wait until the 34th minute for their second shot of the game, Robinson almost turning provider as he picked out Ashford near the penalty spot, but the 20-year-old made a hash of the attempt.\nThe visitors were immediately made to pay for their missed opportunity, as Vata's cross ran all the way through to Chakvetadze, who took one touch before beating Alnwick.\nJust as all the momentum seemed to be with Watford, Cardiff struck straight back.\nChris Willock won the ball back for the Bluebirds before playing a through ball to Ashford, and the youngster showed brilliant composure to square the ball to Robinson for a tap in.\nWatford continued the see the vast majority of possession without causing Cardiff keeper Alnwick much concern.\nAt the other end, Cardiff almost had a third when Manolis Siopis had a shot from the edge of the Watford box, but the Greece international's strike was deflected just past the post.\nCardiff had another chance to extend their lead as a loose pass allowed Ollie Tanner to race in behind the Watford defence, but Daniel Bachmann turned his shot over.\nWatford's best chance to equalise came on 79 minutes as substitute Daniel Jebbison could not make proper contact with a header after a flick-on at the front post.\nSeven minutes of stoppage time led to a nervy finish at Vicarage Road.\nWatford sent countless crosses into the Cardiff box, but the visitors held on for a crucial three points in their fight to avoid relegation.\nCardiff City manager Omer Riza:\n\"It was an important win, it doesn't matter where it comes from.\n\"It's good to get a result against Watford who haven't lost at home in 17. It's a tough place to come, a top six team.\n\"The boys had to put in a performance. They knew how important it was and I think they've done that today.\"", "url": "https://www.bbc.com/sport/football/live/cvgmjz5e384t"}