{"authors": ["Ben Dirs", "www.facebook.com"], "date_download": "2025-05-19 15:12:13", "date_modify": "2025-05-19 15:12:13", "date_publish": "2015-01-30 11:01:31", "description": "England reach the final of the one-day tri-series courtesy of a three-wicket victory over India in Perth.", "filename": "sport_cricket_31054385_1747667533.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/80671000/jpg/_80671224_taylor1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_cricket_31054385_1747667533.html", "title": "England beat India to set up tri-series final against Australia", "title_page": "England beat India to set up tri-series final against Australia - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England reached the final of the one-day tri-series courtesy of a three-wicket victory over India in Perth.\nIndia batted first and collapsed from 83-0 to 200 all out, with Steven Finn taking 3-36 and Ajinkya Rahane top-scoring with a patient 73.\nEngland were in deep trouble at 66-5 but were rescued by a sixth-wicket partnership of 125 between James Taylor (82) and Jos Buttler (67).\nEngland will play Australia in the final at the same venue on Sunday.\nEoin Morgan's side have lost both of their games against the hosts in the tournament.\nThe final will be England's last one-day international before the World Cup starts on 14 February, although they also have warm-ups against West Indies and Pakistan.\nReigning world champions India, who failed to register a win in the tri-series, have warm-up games against Australia and Afghanistan.\nHaving lost the toss at the Waca and been asked to bat, India openers Rahane and Shikhar Dhawan overcame a nervous start on an uneven pitch to put on 83 for the first wicket.\nBut the dismissal of Dhawan, who was caught behind by Buttler off the bowling of Chris Woakes, triggered the collapse.\nVirat Kohli and Suresh Raina both perished cheaply trying to take on the off-spin of Moeen Ali.\nRahane lost another partner when Ambati Rayudu edged behind, handing Stuart Broad his first wicket of the series.\nThe powerplay saw India lose further ground, with only 23 runs scored for the loss of Rahane and Stuart Binny.\nFinn accounted for both, dismissing Rahane caught behind and Binny courtesy of an outstanding slip catch by Ian Bell.\nWhen captain MS Dhoni fell - undone by a ball that kept low from James Anderson, five balls after being hit on the helmet by the seamer - India looked unlikely to make it to 200.\nHowever, some lusty hitting from Mohammed Shami saw 35 runs added for the last wicket.\nWoakes eventually ended the innings with 11 balls remaining, but not before Shami had made the second-highest score by an India number 11 against England.\nFinn was the pick of England's bowlers, while Anderson returned miserly figures of 1-24 from nine overs.\nIn reply, Bell was trapped in front by Sharma before Moeen threw his wicket away, chipping Axar Patel to Rayudu at long-off.\nAnd when Joe Root fell for a duck in the following over, having driven a return catch to Binny, India were suddenly back in the match.\nMorgan was undone as much by the unpredictability of the pitch as the medium pace of Binny, squirting a catch to mid-on.\nIn contrast, Ravi Bopara had no such excuses, steering a long-hop from Binny straight into the hands of Ravindra Jadeja at point.\nRahane should have run Buttler out when the Lancashire man had only three runs to his name and the missed chance proved to be the crucial turning point.\nTaylor and Buttler slowly rebuilt the England innings, the former making his fourth fifty in eight matches since being recalled to the one-day team.\nWith Taylor playing the anchor role, Buttler was able to play some shots and his sixth fifty in ODIs came from 58 balls and included a couple of sweetly-timed off-drives.\nEngland had a late wobble - Taylor top-edging a pull shot to long-leg and Buttler holing out in the covers - but Woakes and Broad saw them home with 19 balls to spare.", "url": "https://www.bbc.com/sport/cricket/31054385"}