{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:21:02", "date_modify": "2025-04-26 04:21:02", "date_publish": "2025-03-03 15:10:53", "description": "Wrexham: James McClean and Elliot Lee boosts before Huddersfield Town trip", "filename": "sport_football_articles_c5yrkz28xlyo_1745641262.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/174b/live/677ceb10-f840-11ef-9967-9d96c0c1bbff.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c5yrkz28xlyo_1745641262.html", "title": "Wrexham: James McClean and Elliot Lee boosts before Huddersfield Town trip", "title_page": "Wrexham: James McClean and Elliot Lee boosts before Huddersfield Town trip - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "James McClean and Elliot Lee could be in contention for returns to Phil Parkinson's starting side when Wrexham go to Huddersfield Town on Tuesday (19:45 GMT).\nMcClean (pictured above), 35, has not played since 18 February because of a hip issue but was back on the bench for Saturday's goalless draw with Bolton Wanderers.\nLee, 30, came off the bench against Wanderers – as he did in the EFL Trophy last week – but could make Parkinson's 11 for the first time since being involved in a road traffic collision last month.\nOn McClean's fitness, Wrexham assistant boss Steve Parkin said: \"He is a lot better.\n\"He has had two or three really tough days where his groin and his hip have been sore, but then he has really settled and had a couple of good training sessions.\n\"I am sure he will be in the frame for selection for Tuesday night.\"\nLike McClean, Lee offers experience and quality to a Wrexham side looking to secure a third successive promotion this spring.\nThe Dragons are third in League One, two points behind second-placed Wycombe Wanderers with 13 third-tier games apiece remaining.\n\"We have got Elliot Lee coming back which is important after his terrible road accident, which is another bonus,\" Parkin added.\n\"So we are strong and we will make sure we are ready and raring to go.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c5yrkz28xlyo"}