{"authors": ["Katie Stafford", "www.facebook.com"], "date_download": "2025-05-21 07:46:10", "date_modify": "2025-05-21 07:46:10", "date_publish": "2025-01-13 14:18:50", "description": "Graham Potter press conference: West Ham vs Fulham", "filename": "sport_football_articles_c4gxvv8n5pzo_1747813570.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/414f/live/cdf05660-d19f-11ef-9fd6-0be88a764111.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c4gxvv8n5pzo_1747813570.html", "title": "Graham Potter press conference: West Ham vs Fulham", "title_page": "Graham Potter press conference: West Ham vs Fulham - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Niclas Fullkrug's hamstring injury \"is a significant one\" and he will be sidelined for \"a number of weeks.\"\nCrysencio Summerville \"has a minor injury\" and it is \"touch and go\" whether he will be available for Tuesday's game.\nMeanwhile, Emerson Palmieri \"has made good progress and trained\" and Konstantinos Mavropanos is available, but Jean-Clair Todibo is still undergoing physiotherapy.\nOn his attacking options as the injury list grows: \"Sometimes in these situations you have to be creative and look at your players' attributes. We've got options up front, in terms of Mohammed Kudus, Lucas Paqueta and Danny Ings, so let's see.\"\nPotter added \"there's certainly a logical rational\" to looking at the transfer market but he \"wouldn't want to do something for the sake of it in this window, which is always very complicated.\"\nThe players are \"on board\" with his plans and \"want to build together as a team\" after \"a tough period.\"\nOn his first home game as manager: \"I can't wait. I think our supporters know where we are with our journey. The result is the most important thing, ultimately. We want to play the right way, but points are helpful. If we could have both, that'd be great.\"\nOn opponents Fulham: \"They cross the ball and get down the wings well, and the centre-forward in the box is dangerous. They've got good options, but we're looking forward to the game, and hopefully we can be positive.\"", "url": "https://www.bbc.com/sport/football/articles/c4gxvv8n5pzo"}