{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:34:41", "date_modify": "2025-05-20 11:34:41", "date_publish": "2023-08-07 07:32:15", "description": "Australia captain Pat Cummins faces six-week layoff with wrist injury but should be fit for 50-over World Cup.", "filename": "sport_cricket_66425959_1747740881.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/BDA3/production/_130674584_gettyimages-1578546191.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66425959_1747740881.html", "title": "Pat Cummins: Australia captain expected to be fit for World Cup", "title_page": "Pat Cummins: Australia captain expected to be fit for World Cup - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Pat Cummins will be sidelined for six weeks because of a wrist injury sustained in the Ashes but should return for Australia's 50-over World Cup campaign in October and November.\nCummins, 30, fractured his wrist in the final Test at The Oval when England won by 49 runs.\nAustralia retained the urn after drawing the series 2-2.\n\"Cummins has an undisplaced fracture of his left radius,\" said chairman of selectors George Bailey.\n\"We expect him to join the squad during the South African ODI series. We view a period of enforced rest for Pat as a positive ahead of this important World Cup campaign.\n\"There are still a number of games he could play before the World Cup which is more than enough for him to have a strong preparation.\"\nCummins was named Australia's one-day international captain in 2022 and has skippered the national side in two 50-over games so far.\nHe sustained the wrist injury while diving in the field on day one of the fifth Test but played through the following four days.\nAustralia play three T20Is and five ODIs against South Africa between 30 August and 17 September, and they have three ODIs lined up against India between 22-27 September.\nThe 2023 Cricket World Cup begins on 5 October in India, with Australia kicking off their campaign against the hosts in Chennai on 8 October.\nMitchell Marsh has been named as Australia's T20 captain for the series in South Africa in Cummins' absence.\nMarnus Labuschagne is the most notable omission from the extended 18-player ODI squad, having featured in each of Australia's last nine ODIs and 30 of the last 38 since making his debut in 2020.\nThe 29-year-old was part of the squad that won a three-match series in India in March.\nThe uncapped duo of leg-spinner Tanveer Sangha and all-rounder Aaron Hardie have been named in the squad, which will be trimmed down to 15 nearer to the start of the World Cup.\nMarsh, Cameron Green, Marcus Stoinis and Sean Abbott are the leading seam-bowling all-rounders, while Ashton Agar, Sangha and Adam Zampa offer spin options.\nAll-rounder Glenn Maxwell will miss the South Africa leg as he expects the arrival of his first child.", "url": "https://www.bbc.com/sport/cricket/66425959"}