{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:36:54", "date_modify": "2025-05-21 06:36:54", "date_publish": "2025-01-31 00:00:00", "description": "Live video and text commentary coverage of Glentoran versus Linfield in the sixth round of the Irish Cup at The Oval, Belfast.", "filename": "sport_football_live_czj3779x301t_1747809414.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_czj3779x301t_1747809414.html", "title": "Glentoran beat nine-man Linfield at the Oval - as it happened", "title_page": "Glentoran beat nine-man Linfield at the Oval - as it happened - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Final whistle\nFT: Glentoran 2-1 Linfield\nThat is all from us as a fine strike from Finley Thorndike late in extra-time helps Glentoran past nine-man Linfield at the Oval.\nYou can read the report from the game here with highlights and reaction to follow on the BBC Sport website.\nWe will be back tomorrow with live text commentary and radio coverage of the seven other Irish Cup ties.\nSee you then, but for now goodnight.\nGOAL - Glentoran 2-1 Linfield\nFinley Thorndike - 112 mins\nWhat a strike from substitute Finley Thorndike to give Glentoran the lead with just eight minutes remaining.\nThorndike moves the ball onto his left foot and shoots from distance, with the ball whistling into the back of the net at the near post.\nDavid Walsh was grounded in the Linfield goal and was firmly rooted to the spot.\n'Red card has swung the game in Glentoran's favour'\nET: Glentoran 1-1 Linfield\nColin Coates\nGlenavon first team coach on BBC iPlayer\nThe first half of extra time has been eventful the red card has swung the game in Glentoran's favour. They look the most likely and probably the only side capable of winning this game. They are creating the opportunities and should already be ahead. If you're David Healy and you offer him penalties I think he would happily take it.\nKICK-OFF\nET: Glentoran 1-1 Linfield\nThe second half of extra-time is underway at the Oval.\nDeclan Devine makes a change as Finley Thorndike comes on in place of goal scorer Jordan Jenkins.\nWho will edge this one and book their place in the quarter-finals of the Irish Cup?\n'It is difficult to make a call'\nET: Glentoran 1-1 Linfield\nColin Coates\nGlenavon first team coach on BBC iPlayer\nAs soon as it happened the fourth official was straight over to tell the referee. It is difficult to make a call, I didn't see it in normal time, but Shane Andrews went straight over to tell Tim Marshall. It makes it more difficult for Linfield now, they will set up to nullify Glentoran as much as they can and will be looking for penalty kicks.", "url": "https://www.bbc.com/sport/football/live/czj3779x301t"}