{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:35:58", "date_modify": "2025-05-21 05:35:58", "date_publish": "2025-01-05 08:02:05", "description": "Lamar Jackson stars as the Baltimore Ravens clinch the AFC North title by beating the Cleveland Browns.", "filename": "sport_american-football_articles_cvgxrpr1vdzo_1747805758.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1c64/live/c430d470-cb63-11ef-94cb-5f844ceb9e30.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_american-football_articles_cvgxrpr1vdzo_1747805758.html", "title": "Lamar Jackson stars as Baltimore Ravens clinch AFC North crown", "title_page": "Lamar Jackson stars as Baltimore Ravens clinch AFC North crown - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Lamar Jackson shone again as the Baltimore Ravens clinched the AFC North title and the third seed spot in the conference with a 35-10 win over the Cleveland Browns on Saturday.\nThe victory means the Ravens will begin the NFL play-offs next week at home to either the Los Angeles Chargers or the Pittsburgh Steelers.\nThe Cincinnati Bengals kept their AFC play-off hopes alive with a 19-17 win at the Steelers.\nThe Bengals need the Denver Broncos to lose and Miami Dolphins to lose or tie their games on Sunday to claim a play-off spot.\nIn Baltimore, Jackson, who is in the running for a third Most Valuable Player award, threw two touchdown passes while Derrick Henry added two fourth-quarter scoring runs as the Browns suffered a sixth straight loss.\nJackson completed 16 of 32 passes for 217 yards while adding 63 yards on nine rushes, finishing the regular season with 41 touchdown passes and just four interceptions.\nHe ends the campaign with 4,172 yards passing and 915 yards rushing making him the first quarterback in NFL history to finish with 4,000+ passing yards and 800+ rushing yards.\nHenry compiled 138 yards on 20 carries, giving him 1,921 yards and 16 rushing scores.\nBut there was a concern for Baltimore head coach John Harbaugh with his leading wide receiver, Zay Flowers, suffering a right knee injury in the second quarter.", "url": "https://www.bbc.com/sport/american-football/articles/cvgxrpr1vdzo"}