{"authors": ["Phil Dawkes", "www.facebook.com"], "date_download": "2025-05-20 14:19:31", "date_modify": "2025-05-20 14:19:31", "date_publish": "2023-07-30 05:14:12", "description": "Former world champions Norway rediscover their form and ferocity in the nick of time as they hammer the Philippines to reach the last 16 of the 2023 Fifa Women's World Cup.", "filename": "sport_football_66352241_1747750771.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0C60/production/_130586130_gettyimages-1580094609.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66352241_1747750771.html", "title": "Norway 6-0 Philippines: Norwegians hit form with big win to qualify for last 16", "title_page": "Norway 6-0 Philippines: Norwegians hit form with big win to qualify for last 16 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former world champions Norway rediscovered their form and ferocity in the nick of time as Sophie Haug's hat-trick helped them hammer the Philippines to reach the last 16 of the 2023 Fifa Women's World Cup.\nHaving failed to win in their opening two games and with star Caroline Graham Hansen criticising the decision to leave her out of the side, Hege Riise's faltering team were in serious danger of finishing bottom of a group they were expected to breeze through.\nBut with Hansen restored to the side and the bit between her teeth in Auckland's Eden Park, the Grasshoppers tore into their poor opponents to get the win that sees them finish second in Group A and sends the Philippines home.\nHaug got the ball rolling in just the sixth minute courtesy of a neatly taken back-post volley before then doubling her and her side's tally 11 minutes later via a looping header.\nHansen underlined her importance with the third, scoring with a superb low shot from range - a key goal that gave Norway complete control of their fate, regardless of the scoreline in the other final group game between Switzerland and co-hosts New Zealand.\nNorway then put the outcome completely to bed with two goals early in the second half - a bundled own goal from the unfortunate Alicia Barker and a Guro Reiten penalty.\nThe Philippines' woes were compounded when substitute Sofia Harrison was sent off less than 10 minutes after coming on following a VAR review on a late challenge on Thea Bjelde.\nIn the middle of 11 added minutes, Haug completed her treble with another header and could have had a fourth but steered a sliding effort against the post.\nNorway will now face the winner of Group C - which will be either Spain or Japan - in the last 16 in Wellington on 5 August.\nSwitzerland topped Group A after drawing with New Zealand in the other game played on Sunday.\nWhat a difference a well-timed goal can make.\nNorway came into this match having failed to get the ball in the net in their two previous games, with an opening-game defeat and second-game draw leaving them under serious threat of going out before the knockout rounds of a World Cup for only the second time.\nAll of this had been played out to the noise of disharmony in their camp, with rumours of discontent coming to a head when Hansen went public with her criticism following the decision to bench her for the draw with Switzerland.\nOn top of all that, their other elite player, inaugural Ballon d'Or winner Ada Hegerberg, has spent more time on the sidelines than she has on the pitch as a result of a groin injury, which also kept her out of Sunday's contest.\nFor five minutes, in an Eden Park audibly largely backing their opponents, the Norwegians were visibly nervous as the Philippines came out swinging.\nAnd then Haug hooked in her back-post volley from Bjelde's cross and everything changed. The switch was flicked and the brittle and almost broken Grasshoppers became the confident and clinical side that have graced so many a successful major tournament in the past.\nHaug headed home her second with 17 minutes on the clock and as soon as Hansen's low drive found the net just after the half hour the result was beyond doubt.\nWary of the danger a single Philippines goal in Auckland or either of the sides netting in Dunedin posed to their qualification chances, Norway came out after the break with fresh vigour.\nClumsy Philippines defending gave them the cushion and comfort they craved as Barker bundled into her own net, Jaclyn Sawicki clattered Reiten in the box for the penalty and then Harrison flung a late boot into Bjelde's shin to make it 11 v 10.\nThe icing on the cake came courtesy of Haug, who completed her hat-trick in a lengthy period of injury time, becoming the second player to net a treble at this World Cup after Ary Borges for Brazil against Panama.\nThey can now look towards the last 16 with renewed belief and the hope that Haug, Hansen and Rieter can replicate their displays here and Hegerberg can return to further boost their chances.\n\"We felt it was us against the world today and we performed from the very start, delivering when we really had to,\" said Norway coach Riise.\n\"This was the best response we could have given the Norwegian people and ourselves.\"", "url": "https://www.bbc.com/sport/football/66352241"}