{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:26:12", "date_modify": "2025-05-20 13:26:12", "date_publish": "2023-08-02 00:00:00", "description": "Follow today's football news as it happened - Manchester City agree deal for Josko Gvardiol, Gianluigi Buffon retires and Liverpool lose to Bayern Munich.", "filename": "sport_live_football_66380472_1747747572.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4A7F/production/_130617091_gvardiol_gettyimages-1582904582.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_football_66380472_1747747572.html", "title": "Gianluigi Buffon retires & Liverpool v Bayern Munich reaction", "title_page": "Gianluigi Buffon retires & Liverpool v Bayern Munich reaction - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Man City agree 90m euro fee for Gvardiol\nTalk about leaving it late.\nHere is another last-minute piece of news for you after Manchester City agree a deal to sign Croatia defender Josko Gvardiol, 21, from RB Leipzig for 90m euros (£77.5m).\nBBC Sport's Simon Stone said: \"The deal does not include any add-ons, which means it is not a British record for a defender as had been anticipated.\n\"It is hoped Gvardiol will fly in for a medical later this week, although it could end up being early next.\n\"City are privately delighted with the deal - less than Manchester United paid for Harry Maguire - given as recently as last week Leipzig were insisting they wouldn’t sell for less than 100m euros.\n\"Manager Pep Guardiola believes Gvardiol will strengthen the left side of his central defence and his arrival is likely to trigger the exit of Aymeric Laporte.\"\nYou can read more on that developing story here.\nNow that really is all folks!\nBye for now\nIf I can steal a line from Gianluigi Buffon, that's all for today folks.\nThe legendary Italy goalkeeper just sneaked in to the end of today's live page with the announcement that he is to call time on his 28-year career.\nNot a bad innings for the 45-year-old, who has won pretty much everything there is to win in the game, barring the Champions League, during his time with Parma, Juventus, Paris St-Germain and his national team.\nRead more about this story here.\nAlso, keep your eyes peeled on the football index for the match report after Liverpool's 4-3 defeat to Bayern Munich in Singapore - that will be with you shortly.\nIn the meantime, here are some more stories to keep you entertained:\nJamaica earn last-16 World Cup debut\nGrieving Kgatlana sends South Africa through\nWhat records can Haaland break this season?\n'It hurts' - Dembele to leave Barca for PSG\nWe have to learn from certain situations - Van Dijk\nLiverpool 3-4 Bayern Munich\nMore from Liverpool captain Virgil van Dijk, talking to LFCTV: \"We have the quality to punish them if they make a mistake and that's what we did.\n\"It doesn't matter that much luckily, it's about the process and we have to learn from certain situations.\n\"The games that we played and the training sessions have been intense.\n\"We work on set-pieces every game. I should be more clinical at times and I am working on that.\n\"We want to play at the highest level and compete with these teams and players. They punished us at times and that's how it is. We're still in pre-season and we've had big changes.\"\n'Still work to do'\nFT: Liverpool 3-4 Bayern Munich\nNew Liverpool captain Virgil van Dijk admitted that the team have things to improve but was feeling positive after a narrow defeat to the Bundesliga champions: \"So many good things and things we have to improve. They are a very good opponent and they punish you if you are not on it for a split second - that is what happened today.\n\"Still work to do and that is what we are going to do.\"\n'That's all folks!'\nFormer Italy goalkeeper Gianluigi Buffon announced his retirement from football after 28 years in which he reached exceptional milestones for club and country.\nBuffon, 45, won the World Cup in 2006, as well as 10 Serie A titles with Juventus and a Ligue 1 title with Paris St-Germain.\n\"That's all folks! You gave me everything. I gave you everything. We did it together,\" Buffon said in a statement.\nWidely regarded as one of the greatest keepers of all time, he ended his career where he started, at Parma, who are in the Italian second tier, having struggled with injuries in his final season.\nBuffon joined Juve from Parma in 2001 and spent most of his career with the club, except for a season at PSG in 2018-19, before returning to Turin and then to Parma in June 2021.", "url": "https://www.bbc.com/sport/live/football/66380472"}