{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:43:02", "date_modify": "2025-05-21 06:43:02", "date_publish": "2024-12-24 09:16:40", "description": "Carlos Corberan leaving West Bromwich Albion to join Valencia would be a big blow for the club, says former midfielder Darren Carter.", "filename": "sport_football_articles_c5yd42x61dlo_1747809782.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2dc2/live/2c43dd40-c1d3-11ef-9e92-076070f32991.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c5yd42x61dlo_1747809782.html", "title": "Carlos Corberan exit to Valencia would be 'big' blow for West Brom", "title_page": "Carlos Corberan exit to Valencia would be 'big' blow for West Brom - Carter - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Carlos Corberan's rumoured impending exit from West Bromwich Albion would be a massive blow to the Championship club, according to ex-midfielder Darren Carter.\nReports in Spain, external suggest the La Liga club have activated Corberan's £2.8m release clause with the announcement of his appointment apparently imminent.\nThe former Champions League finalists are second bottom of the Spanish top flight, four points from safety, and Corberan, 41, hails from the Valencia region.\n\"I've been a big fan of Carlos Corberan and he's done fantastically well with that [Albion] squad last year,\" Carter told BBC Radio WM.\n\"He's done fantastic this year to be in and around the play-offs with not the biggest squad or the best resources.\n\"You just want the club to give some indication that they're going to back him at some point and give him the resources to kick the club on because he's clearly got the skills to do that.\n\"The problem is for West Brom fans, while he's doing this job there's always going to be other clubs with eyes on him.\n\"With it [Valencia] being his hometown club and his ties back there, you'd want it to just be speculation but unfortunately it does look like it's going that way and it would be a big, big miss.\"", "url": "https://www.bbc.com/sport/football/articles/c5yd42x61dlo"}