{"authors": ["Andy Gray", "www.facebook.com"], "date_download": "2025-05-19 15:39:16", "date_modify": "2025-05-19 15:39:16", "date_publish": "2017-07-30 18:44:37", "description": "Colin Turkington earns two podium finishes in the British Touring Car round at Snetterton to move into second spot in the series.", "filename": "sport_motorsport_40771452_1747669156.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/128DB/production/_90959957_turkington.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_motorsport_40771452_1747669156.html", "title": "British Touring Cars: Colin Turkington up to second in series after two podiums", "title_page": "British Touring Cars: Colin Turkington up to second in series after two podiums - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Colin Turkington earned two podium finishes in the British Touring Car round at Snetterton to move into second place in the championship standings.\nPortadown driver Turkington is now two points behind Gordon Shedden in the points after coming home second in race two and third in race three.\nCarrickfergus driver Chris Smiley also made it into the points in race one.\nSubaru's Ash Sutton took a double victory, with Honda driver Shedden winning race three.\nTurkington, 35, qualified second on the grid, getting the jump on pole-sitter Jack Goff to lead away.\nHowever, debris pitched the BMW driver into spin at the Bomb Hole mid-distance, which dropped Turkington to seventh place.\nHowever, the Northern Irishman made good progress in race two, pulling off a clever move into Nelson on team-mate Rob Collard to clinch second place.\nIn the reverse grid race three, twice former champion Turkington moved up to fourth from seventh, sneaking onto the podium on the final lap when leader Andrew Jordan retired with a mechanical fault.\nSmiley, starting from 22nd in race one, stayed out of trouble with an excellent drive to come home in the points in 14th place.\nOn the soft tyre in race two, Smiley was running within touching distance of a second points finish before tyre degradation consigned the 25-year-old to 17th place", "url": "https://www.bbc.com/sport/motorsport/40771452"}