{"authors": ["Kieran Lynch", "www.facebook.com"], "date_download": "2025-04-26 06:15:33", "date_modify": "2025-04-26 06:15:33", "date_publish": "2025-03-01 21:52:17", "description": "Armagh hold off a second-half fightback by Dublin to earn to a 1-20 to 1-12 win at the Athletic Grounds.", "filename": "sport_articles_c89yg3kxqq3o_1745648133.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1170/live/5aeb41e0-f6dc-11ef-964d-6ddbc94ea841.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_c89yg3kxqq3o_1745648133.html", "title": "Armagh secure Division One victory over Dublin", "title_page": "Football League: Armagh secure Division One victory over Dublin - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Armagh claimed a crucial two points at the Athletic Grounds on Saturday night with a 1-20 to 1-12 victory over Dublin.\nConor Turbitt top-scored for the victors with 0-6 whilst Andrew Murnin impressed in a deeper role and Greg McCabe stormed forward from defence, contributing three points.\nArmagh's start could hardly have been any better, as they had 1-9 on the scoreboard before Dublin raised their first white flag of the evening.\nTurbitt led the way with three of those points while his Clann Eireann clubmate Barry McCambridge found the net on 16 minutes – drilling his shot into the bottom corner after a pinpoint pass from Ethan Rafferty.\nTurbitt could have had two goals himself, but he had one effort blocked by full back Theo Clancy, and another shot saved by Evan Comerford at point-blank range.\nThe Dubs struggled to make much headway in attack in the first half, with just three points scored via Con O'Callaghan, Brian Howard and Luke Breathnach.\nArmagh pushed themselves 15 points ahead early in the second half, but Dublin rattled off 1-7 without reply to pull themselves back into the contest. O'Callaghan hit five points during this period and set up Lorcan O'Dell's goal.\nHowever, Armagh steadied the tide with a score from McCabe and grabbed four of the last six points of the day to see out the win.\nThe result moves them three points above the relegation zone with Tyrone and Derry still to play on Sunday.", "url": "https://www.bbc.co.uk/sport/articles/c89yg3kxqq3o"}