{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:08:00", "date_modify": "2025-05-20 13:08:00", "date_publish": "2023-08-02 14:08:43", "description": "Dundee sign Trevor Carson after agreeing an undisclosed fee with St Mirren for the 35-year-old goalkeeper.", "filename": "sport_football_66377954_1747746480.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/08DF/production/_130617220_carson.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66377954_1747746480.html", "title": "Trevor Carson: Dundee sign goalkeeper from St Mirren for undisclosed fee", "title_page": "Trevor Carson: Dundee sign goalkeeper from St Mirren for undisclosed fee - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Dundee have signed Trevor Carson after agreeing an undisclosed fee with St Mirren for the 35-year-old goalkeeper.\nCarson, who has agreed a three-year contract, leaves the Paisley club midway through a two-year deal.\nThe Northern Ireland cap played 41 times as St Mirren finished sixth in the Scottish Premiership last season.\nBut Zach Hemming was installed as first choice by manager Stephen Robinson after the 23-year-old's arrival from Middlesbrough on loan this summer.\nHemming spent last season on loan to Kilmarnock, where current Dundee manager Tony Docherty was assistant.\nDocherty, though, believes it is Dundee who now have \"one of the best goalkeepers in the league\" and praised his \"personality, work ethic, mentality\".\n\"Last season, when playing against him, he had some outstanding performances and saves,\" he told Dundee's website.\n\"We have acquired a fantastic goalkeeper and professional. He has got so much experience, he knows the league and I think he will bring a lot to the club.\"\nIt is Carson's second spell in Tayside, having spent a season with Dundee United after leaving Motherwell.\nHowever, he finished that campaign on loan to Morecambe after making only five appearances for the Tannadice side before leaving for St Mirren for an undisclosed fee.\nCarson, capped eight times for his country, follows Joe Shaughnessy in making the switch from Paisley to Tayside this summer and the goalkeeper said \"it helps\" that the Irish centre-half is also part of the Dens Park defence.\n\"Joe spoke very highly of the place and these things count massively in football,\" he added.\n\"I had a great conversation with the manager and, as soon as I came off the phone, I said I want to play for that man.\"\nMeanwhile, Docherty plans to send one of his other goalkeepers out on loan and, although Carson is his 12th signing of the summer, says \"there could be\" more as there are areas of the squad he wants to strengthen.", "url": "https://www.bbc.com/sport/football/66377954"}