{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:06:26", "date_modify": "2025-05-20 14:06:26", "date_publish": "2023-07-30 16:40:35", "description": "Warrington Wolves secure a comeback win and Featherstone Rovers dominate in Women's Super League matches.", "filename": "sport_rugby-league_66354616_1747749986.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/10412/production/_130587566_castlefordtigers2takenbyjoshharper.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-league_66354616_1747749986.html", "title": "Women's Super League: Warrington seal comeback win and Featherstone dominate", "title_page": "Women's Super League: Warrington seal comeback win and Featherstone dominate - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Warrington Wolves fought back to beat Huddersfield Giants to secure their second win of the season in Women's Super League Group 1.\nThe visiting Giants scored a pair of tries as they took an early 12-0 lead before Michelle Davis got one back for the Wolves before half-time at Victoria Park.\nWarrington dominated the second half and outscored their opponents four tries to one to earn a 26-20 victory, leaving bottom-of-the-table Huddersfield to continue their search for their first points of the campaign.\nIn Group 2, Featherstone Rovers thrashed Castleford Tigers 54-0 to move up to joint second.\nWarrington beat Huddersfield by eight points in their previous meeting in June, their first and only win of the season prior to Sunday's game.\nThis time, in front of a home crowd, they got off to a slow start before outside back Davis got them up and running with her try before the interval.\nAfter the break, Wolves came out firing and scored three unanswered tries through Charlize Magraw, Abi Johnstone and Shannon Stephens to move 22-12 in front.\nHuddersfield replied with a try but with time winding down Johnstone extinguished any hope of a Giants comeback when she crossed for her second score of the day in the closing minutes.\nA last-minute try from the visitors was not enough to match Wolves, who dominated the second half, and earned a hard-fought win to keep them mid-table in Group 1.\nIn Group 2, Featherstone got back to winning ways with a dominant victory over winless Castleford in the West Yorkshire derby at Millennium Stadium.\nBoth sides had their moments early on before Brooke Price got on the end of an overlapping play and ran the ball into the corner untouched for the opening try after 15 minutes.\nRovers' extended their lead when Zoe Teece bulldozed her way down the middle of the field before offloading the ball to Tally Bryer, who touched down under the sticks from 10 yards out.\nThe Cas defence, who were under pressure all game, made a couple of crucial goal-line stops before enjoying a spell in possession after forward Maisie Lumb blocked a kick, but Rovers turned the screw approaching half-time.\nFran Copley sliced her way past three Tigers defenders and ran almost half of the pitch to score an incredible try and Olivia Grave followed it up a few minutes later by dummying her way over to make it 22-0 at the break.\nIt did not take Featherstone long to pick up where they left off as Chloe Billington caught the Tigresses napping in the middle of the field and steamed past defenders on a long run to score.\nCastleford, who have been outscored 28 to 150 through six games this season, responded with a period of positive play but saw a scoring opportunity slip through their hands on a final pass which could have put their first points on the board.\nLumb gave the visitors superb field position after a surging 20m run into Rovers territory but the Tigresses failed to convert her effort into points.\nFeatherstone went on to score another five tries through Dani Waters, Zoe Teece, Shanelle Mannion and a brace from Hannah Watt to claim their fourth win from six games.\nThey are now tied with Barrow for second in Group 2, while the Tigers remain bottom of the division and still in search of their first points of the campaign.", "url": "https://www.bbc.com/sport/rugby-league/66354616"}