{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:14:37", "date_modify": "2025-04-26 04:14:37", "date_publish": "2025-03-04 10:50:49", "description": "BBC CWR's Sky Blues Fancast team discuss how to mark the return of former boss Mark Robins to the CBS Arena with Stoke City this Saturday.", "filename": "sport_football_articles_c7vzrze6r7po_1745640877.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7c2b/live/c5077de0-f8e0-11ef-9628-add78e51db09.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c7vzrze6r7po_1745640877.html", "title": "Coventry City podcast: Ignoring Mark Robins' return would not be right", "title_page": "Coventry City podcast: Ignoring Mark Robins' return would not be right - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The Sky Blues Fancast team have been discussing how to mark the return of former boss Mark Robins when Stoke City visit the CBS Arena on Saturday (12:30 GMT).\nRobins was sacked on 7 November after just four wins in 14 Championship games left the Sky Blues 17th and level on points with Plymouth in the relegation zone.\nHis departure came just over 17 months since he guided the Sky Blues within one game of a Premier League return, with Coventry beaten by Luton Town on penalties in the Championship play-off final in May 2023, before an FA Cup semi-final defeat on penalties by Manchester United at Wembley last April.\nRobins has since taken over at struggling Stoke, while his replacement Frank Lampard has overseen Coventry's rise to fifth in the Championship, with eight wins in their past nine games.\n\"I'm looking forward to seeing him again, if I get the chance,\" BBC CWR's Clive Eakin told the Sky Blues Fancast.\n\"I'll be interested to see how he responds. I think it's going to be difficult both for him and, to some extent, for Sky Blues fans.\n\"He's the manager of Stoke City and he will really wind up his own team's fans if he makes too much of waving to the Sky Blues fans.\"\nSports editor Rob Gurney added: \"Just ignoring him is not the right way to treat him.\n\"A small acknowledgement when he comes out the tunnel [would be best]. He'll shake Frank Lampard's hand, obviously. A small acknowledgement from the fans, a small acknowledgement from him and that's it, then. On with the game.\n\"That's not going to detract from anything, from our players, from Frank Lampard, any of that.\n\"Robins was there for seven and a half years - particularly in modern football that is two lifetimes, never mind one.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c7vzrze6r7po"}