{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:34:55", "date_modify": "2025-05-21 04:34:55", "date_publish": "2025-04-04 18:20:31", "description": "Colin Ackermann posts the first century of the County Championship season as Durham recover to 370-9 against Nottinghamshire.", "filename": "sport_cricket_articles_ce8vr0z6595o_1747802095.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6f36/live/ac7d2e60-117b-11f0-bef7-27730fea7c1a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_ce8vr0z6595o_1747802095.html", "title": "Ackermann ton drives Durham at Notts", "title_page": "County Championship: Colin Ackermann ton drives Durham at Notts - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Colin Ackermann posted the first century of the Rothesay County Championship season as Durham recovered to 370-9 on the opening day against Nottinghamshire at Trent Bridge.\nAustralian pace bowler Fergus O'Neill took 4-74 on his debut for the home side but it was Ackermann - celebrating his 34th birthday - who delivered the outstanding performance in the Nottingham sunshine as the visitors battled back from 171-5 after being asked to bat first.\nOn what looked a good pitch, the South African-born all-rounder enjoyed a moment of good fortune on 80 when a ball from Lyndon James clipped his off stump only for the disturbed bail to drop back into its groove, but otherwise did not offer a chance until he was dismissed on 116, having hit 17 fours and a six.\nAlex Lees marked his first match as Durham's club captain with a half-century, while Josh Tongue took two wickets on his much-delayed Nottinghamshire debut, although he looked nowhere near the form that catapulted him into England's Test side in 2023. Graham Clark and George Drissell each made 45.\nO'Neill arrived at Trent Bridge in outstanding form after taking 38 wickets at 21.07 for Victoria in the Sheffield Shield and struck here in just his third over as Durham's 20-year-old England prospect Ben McKinney nicked behind.\nThe 24-year-old, 6ft 4ins but with a slingy action, backed up his maiden success in his next over, dismissing Emilio Gay in similar fashion, leaving the former Northamptonshire batter to reflect on an eight-ball duck on his Durham debut.\nIf O'Neill was the standout bowler in the opening session, the dismissal of Lees by Farhan Ahmed for 52 felt like an important breakthrough.\nLees was dropped on 17 at first slip off Dillon Pennington and looked in the mood to make Nottinghamshire pay heavily, reaching 51 from 60 balls.\nBut when Ahmed, the 17-year-old off-spinner, sat one up to tempt the left-hander to clear the short Bridgford Road boundary, his mistimed shot merely found the fielder at mid-on.\nAfter taking 25 wickets in five first-class matches on his debut season last year, Ahmed has quickly overtaken Calvin Harrison and Liam Patterson-White as Nottinghamshire's first-choice slow bowler.\nAs the bowler who also dismissed Ackermann, caught at slip pushing at a ball that drifted away to find the outside edge, and maintaining impressive economy to boot, he justified his selection.\nWith Ollie Robinson and Will Rhodes falling cheaply in the first hour of the middle session, Ackermann's innings proved vital to keeping Durham's innings from falling away at 171-5.\nHis moment of good luck apart, he rarely looked in any difficulty and after stands of 78 with Lees and 93 with Graham Clark was furious with himself for not sticking around to cash in even more against an ageing ball.\nRobinson gave Tongue his maiden wicket as a Nottinghamshire bowler, edging to first slip, while Rhodes, making his debut for Durham after his winter move from Warwickshire, fell to an outstanding catch by Joe Clarke, one-handed low to his left, as O'Neill claimed a third.\nClarke is covering behind the stumps for new signing Kyle Verreynne, who like Durham's leading runscorer David Bedingham remains in South Africa as Western Province bid for domestic glory.\nTongue, who joined Nottinghamshire from Worcestershire 20 months ago only to be out of action for the whole of that time with pectoral and then hamstring injuries, picked up a second wicket as a fine catch by second slip Freddie McCann accounted for Clark, before O'Neill removed Drissell to raise his tally to four.\nThe 27-year-old Tongue is centrally contracted with England, whose plan was for he and Olly Stone essentially to alternate appearances in Nottinghamshire's early championship rounds, although Stone is now himself sidelined following a knee operation and is not expected to return before August.", "url": "https://www.bbc.com/sport/cricket/articles/ce8vr0z6595o"}