{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:40:15", "date_modify": "2025-05-20 12:40:15", "date_publish": "2023-08-03 09:08:47", "description": "Ireland number eight Caelan Doris believes that his best is yet to come as the Leinster back row targets his World Cup debut in France.", "filename": "sport_rugby-union_66373487_1747744815.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/129EE/production/_130607267_gettyimages-1473184311.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-union_66373487_1747744815.html", "title": "Rugby World Cup 2023: Ireland's Caelan Doris 'happy' with form but can still get 'a lot better'", "title_page": "Rugby World Cup 2023: Ireland's Caelan Doris 'happy' with form but can still get 'a lot better' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ireland number eight Caelan Doris has backed himself to get \"a lot better\" as he targets a World Cup debut in France.\nThe Leinster back row started all five games in Ireland's Grand Slam-winning Six Nations campaign and was shortlisted for player of the championship.\nThat was after playing a key role in Ireland's Test series triumph over the All Blacks in New Zealand last summer.\n\"I want to keep improving as a player,\" Doris told BBC Sport NI.\n\"I've been relatively happy with how I've gone over the last couple of years but I think I can still get a lot better.\"\nIn the past year, Doris has established himself as one of Ireland's key players after making his debut at the 2020 Six Nations.\nThe 25-year old has since earned 28 caps for the national team and now has his sights set on helping Ireland's bid for a first World Cup later this year.\n\"It would be incredible,\" Doris said when asked what it would mean to line out for Ireland on rugby's biggest stage.\n\"It's been great. [It's] my first World Cup pre-season, so there's been quite a bit of excitement around it.\n\"I love playing with this team. I love taking to the pitch with them, hanging out off the pitch, so it would mean a hell of a lot.\"\nHaving nailed down his place in Andy Farrell's starting team, Doris is expected to be one of a number of Irish World Cup debutants in France.\nThe squad is likely to feature a blend of youth and experience, with several players having featured in Ireland's previous World Cup efforts, including the 2019 quarter-final exit at the hands of New Zealand.\nAnd Doris says tapping into the \"lessons\" the most experienced players have learned from earlier tournaments has already formed a part of his own preparations.\n\"The older lads have had multiple World Cup pre-seasons and experiences at the actual World Cup themselves.\n\"There are definitely lessons that can be learnt off them in terms of how they prepare in pre-season, a lot of that.\n\"We've taken those lessons on board and a lot of our training and fitness work has been done with rugby at the core of it as opposed to just mindless running, so that's been nice. The whole experience has been exciting.\"\nDoris is expected to feature against Italy in Ireland's first World Cup warm-up fixture in Dublin on Saturday, and while Johnny Sexton is suspended for that match, Doris is looking forward to the captain playing a pivotal role in France.\nSexton will miss the three warm-up games after he admitted misconduct towards match officials following Leinster's Heineken Champions Cup final defeat by La Rochelle in May.\n\"Obviously he's a key cog, so it will be great to have him back,\" Doris said of the fly-half.\n\"He's been training well and he's obviously such a quality player and a massive leader for us, so he's crucial and we're looking forward to having him back.\"", "url": "https://www.bbc.com/sport/rugby-union/66373487"}