{"authors": ["Andrew Benson", "www.facebook.com"], "date_download": "2025-05-20 14:38:44", "date_modify": "2025-05-20 14:38:44", "date_publish": "2023-07-28 12:51:58", "description": "The grid for the Belgian Grand Prix will be set in championship order if wet weather makes it impossible to run qualifying on Friday.", "filename": "sport_formula1_66339868_1747751924.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/BAE7/production/_130574874_gettyimages-1559689843.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_formula1_66339868_1747751924.html", "title": "Belgian Grand Prix: Championship order to set grid if rain washes out qualifying", "title_page": "Belgian Grand Prix: Championship order to set grid if rain washes out qualifying - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The grid for the Belgian Grand Prix will be set in championship order if wet weather makes it impossible to run qualifying on Friday.\nOnly 15 drivers set a lap time in a wet first practice. Ferrari's Carlos Sainz was fastest ahead of McLaren's Oscar Piastri and Lando Norris.\nGoverning body the FIA agreed with teams before the session not to set the grid from the practice results.\nThis is the default arrangement in the rules for a 'sprint' race weekend.\nBut it was considered a safety risk to have teams effectively turning first practice into a de facto qualifying session when teams had not previously run their cars on the track.\nSafety at the historic Spa-Francorchamps track, especially in wet conditions, has been a focus in F1 in the run up to this weekend's race in the wake of the death of 18-year-old Dutch driver Dilano Van 't Hoff in a junior category race earlier this month.\nDrivers have emphasised the dangers of racing in the rain at Spa because of the topography of the circuit, especially the run through the high-speed Eau Rouge swerves on to the Kemmel straight.\nVan t' Hoff was killed in a wet race, when he lost control on the straight, hit the barriers and bounced back on to the track, where he was hit by another car.\nThe accident was a few hundred meters further on from the site of the death of Frenchman Anthoine Hubert in a Formula 2 race at the Belgian Grand Prix meeting in 2019.\nHubert's accident happened in dry conditions but also involved him coming to rest in the middle of the track just after the crest of the hill at Raidillon, the final left-hander at Eau Rouge.\nHe was involved in a multi-car pile-up and was T-boned by another car.\nTwo years ago, the Belgian GP was called off without any racing laps taking place because conditions were considered too dangerous for racing.\nThere was controversy when drivers were awarded half points for their grid order for a race that effectively didn't happen. Since then, the rules have been changed to dictate that a race has to have involved at least two laps not under a safety car or virtual safety car to be declared official.\nThe forecast is for rain to continue throughout Friday at varying levels of intensity.\nThe main concern regarding racing in the wet is that visibility has worsened in recent years because of F1 adopting wider tyres and cars with ground-effect aerodynamics, both of which suck up more water from the track and create more spray.\nMercedes driver George Russell likened racing in the wet with a bunch of cars to driving down the motorway in heavy rain without windscreen wipers.\nFerrari's Charles Leclerc added: \"We are not exaggerating when we say we don't see anything. We really don't see anything.\"", "url": "https://www.bbc.com/sport/formula1/66339868"}