{"authors": ["Kal Sajad", "www.facebook.com"], "date_download": "2025-05-21 03:43:46", "date_modify": "2025-05-21 03:43:46", "date_publish": "2025-01-08 13:38:25", "description": "World champion Jai Opetaia defends his IBF cruiserweight title with a brutal fourth-round knockout win over David Nyika in Australia.", "filename": "sport_boxing_articles_clyjyz9p65po_1747799026.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3e16/live/023286f0-cdc2-11ef-8651-f9189da675cd.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_boxing_articles_clyjyz9p65po_1747799026.html", "title": "Jai Opetaia: Cruiserweight world champion knocks out David Nyika in fourth round", "title_page": "Jai Opetaia: Cruiserweight world champion knocks out David Nyika in fourth round - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "World champion Jai Opetaia defended his IBF cruiserweight title with a brutal fourth-round knockout win over David Nyika in Australia.\nIn arguably the biggest fight in trans-Tasman history, home favourite Opetaia, 29, floored New Zealander Nyika with an uppercut at the Gold Coast Convention and Exhibition Centre in Queensland.\nAn unsteady Nyika, 29, rose to his feet with just over a minute to go in round four. Opetaia unleashed another onslaught before a thunderous, highlight-reel left hook ended the fight.\nThe challenger required medical treatment on the canvas before walking out of the arena to applause from a 6,000 sellout crowd.\n\"He took the fight on two weeks notice. He came here to fight. He gave me a dogfight. I respect that,\" Opetaia, who has now won all 27 pro fights, said.\nThe Sydney-born fighter called for a unification bout against Mexico's WBA and WBO champion Gilberto Ramirez, while promoter Eddie Hearn suggested Opetaia could move up to heavyweight to face world champion Oleksandr Usyk within 18 months.\n\"We have to chase for greatness,\" Hearn said. \"I believe he is the only person who can genuinely give Oleksandr a fight.\"", "url": "https://www.bbc.com/sport/boxing/articles/clyjyz9p65po"}