{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:17:25", "date_modify": "2025-05-20 12:17:25", "date_publish": "2023-08-05 09:05:47", "description": "Hearts striker Lawrence Shankland attracts interest from Israel, while former Rangers loan star Malik Tillman is set for PSV move.", "filename": "sport_football_66415157_1747743445.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/F452/production/_130664526_-b17661ca-3dfd-4f27-804f-3e26a1f4298a.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66415157_1747743445.html", "title": "Scottish Gossip: Lawrence Shankland, Malik Tillman, James Tavernier, Kyogo Furuhashi, Scott McTominay", "title_page": "Scottish Gossip: Lawrence Shankland, Malik Tillman, James Tavernier, Kyogo Furuhashi, Scott McTominay - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Hearts striker Lawrence Shankland is a target for Israeli side New Maccabi Tel Aviv, who are managed by former Republic of Ireland striker Robbie Keane. (TEAMtalk), external\nManager Lee Johnson says Hibs were 90 seconds away from having to put striker Christian Doidge in goals for the Europa Conference qualifying win over Inter Club d'Escaldes amid a frantic paperwork dash to register third-choice goalkeeper Max Boruc. (Daily Record), external\nBayern Munich midfielder Malik Tillman, who spent last season with Rangers before the German club reportedly cancelled the option to buy agreement, has agreed to join PSV Eindhoven on loan. (Goal), external\nPortuguese winger Jota could be sent out on loan - just weeks after his £25m move from Celtic - because Saudi Arabian club Al-Ittihad want to free up squad space for a world-class striker. (Scottish Sun), external\nTurkish giants Galatasaray have enquired about Rangers skipper James Tavernier and are also among the clubs chasing Ibrox midfielder Glen Kamara. (TEAMtalk), external\nJapan striker Kyogo Furuhashi has vowed to repay the love he has received from Celtic fans by firing the club to a third successive Scottish title after signing a new deal this summer. (Glasgow Times), external\nRangers legend Barry Ferguson believes the club will look to sell Borna Barisic and John Lundstram this summer if the pair - both into the final year of their contracts - don't sign extensions. (Football Scotland), external\nScotland midfielder Scott McTominay is set for a medical with West Ham as he nears a move to David Moyes' side from Manchester United. (Daily Express), external\nSt Johnstone are poised to sign Wales midfielder Matt Smith, who is out of favour at MK Dons. (Herald), external", "url": "https://www.bbc.com/sport/football/66415157"}