{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:43:24", "date_modify": "2025-04-26 06:43:24", "date_publish": "2025-03-01 18:06:45", "description": "Norwich City head coach Johannes Hoff Thorup says his side's failure to see out a win against Blackburn Rovers \"frustrated\" him.", "filename": "sport_football_articles_cp3y12ywk4ko_1745649804.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d703/live/caa0c7b0-f6b6-11ef-9c6a-9b6bc9defc65.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cp3y12ywk4ko_1745649804.html", "title": "Johannes Hoff Thorup: Norwich boss laments approach at end of Blackburn draw", "title_page": "Johannes Hoff Thorup: Norwich boss laments approach at end of Blackburn draw - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Norwich City head coach Johannes Hoff Thorup said his side's failure to take maximum points from their trip to fellow play-off contenders Blackburn Rovers was his main frustration - not any controversy over refereeing decisions.\nThe Canaries scored in the 90th-minute against a side who had just been reduced to 10 men, but conceded a 96th-minute equaliser.\n\"It's the approach in the last two, three minutes of the game which I'm frustrated about,\" the 36-year-old Dane said. \"I let the players know it's not acceptable because, up until the goal, we played such a professional game away from home.\n\"It's a top-six team and we go here, we take the ball and we dominate and we try to open them, create the flow of the game, try to create the chances.\n\"We get ourselves in front at the end and then last two, three minutes, we dribble around and we lose the ball a couple of times instead of just passing the ball to the final whistle.\n\"There are so many decisions in the last two, three minutes that simply need to be better.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cp3y12ywk4ko"}