{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:12:53", "date_modify": "2025-05-19 15:12:53", "date_publish": "2015-02-20 18:23:59", "description": "Martyn Irvine's hopes of an omnium medal at the World Track Championships look remote as he lies in 16th place.", "filename": "sport_cycling_31559865_1747667573.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81041000/gif/_81041600_162267959.gif", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_cycling_31559865_1747667573.html", "title": "Track World Championships: Irvine lies 16th in Paris omnium", "title_page": "Track World Championships: Irvine lies 16th in Paris omnium - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Martyn Irvine's hopes of challenging for an omnium medal at the World Track Championships in Paris look remote as he lies 16th overall after day one.\nThe Northern Ireland man was 20th out of 21 riders in the opening scratch race and his ninth in the individual pursuit left him in 15th position.\nThe Newtownards man followed that up with a 15th place in the final event of the day, the elimination race.\nDay two will consist of the 1km time trial, flying lap and points race.\nYoung Colombian sprint sensation Fernando Gaviria leads the men's omnium following the first three disciplines.\nGaviria secured top three finishes in the scratch race, individual pursuit and elimination race to end the day top of the six-discipline event with 110 points.\nItalian professional sprinter Elia Viviani is second on 102 after winning the scratch and elimination races but coming only 10th in the pursuit.\nReigning world champion Thomas Boudat of France is third on 94 with Australian Glenn O'Shea, the 2012 world champion, sixth and 2013 champion Aaron Gate of New Zealand seventh.\nGaviria exploded onto the cycling scene last month by twice beating 2012 world road race champion Mark Cavendish in sprint finishes at the Tour of San Juan.\nIrvine suffered a chastening experience in the opening scratch element as he was passed by all but one of the other 20 competitors with three laps to go after he and Hong Kong rider Chun Wing Leung had broken clear with nine laps to go.\nThe Newtownards man then produced a personal best time of 4:26.814 to take ninth in the individual pursuit but that only moved him up to 15th overall.\nIrvine finished 10th in the individual scratch race on Thursday.\nThe world championship offers an opportunity to earn vital qualifying points for the Rio Olympics.\nIrvine has made it to the championships despite breaking his collarbone at the first World Cup of the season in Mexico in November.\nThe omnium incorporates the individual pursuit, points and scratch races, a flying lap, 1km time trial and elimination race to find the best all-round cyclist.\nIrvine won a bronze medal in the event at last year's European Championships in the Netherlands.\nTwo years ago in Minsk, he became world champion in the scratch race and 12 months ago he took silver in the event.", "url": "https://www.bbc.com/sport/cycling/31559865"}