{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:37:46", "date_modify": "2025-05-21 03:37:46", "date_publish": "2025-02-06 11:26:23", "description": "Savannah Marshall says she is no longer fighting on the undercard of Natasha Jonas v Lauren Price on 7 March in London.", "filename": "sport_boxing_articles_ce3np13nzl4o_1747798666.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4490/live/112bb850-e471-11ef-8cf7-7d25ac677559.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_boxing_articles_ce3np13nzl4o_1747798666.html", "title": "Jonas v Price: Savannah Marshall says she is 'not fighting' on 7 March event", "title_page": "Jonas v Price: Savannah Marshall says she is 'not fighting' on 7 March event  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Savannah Marshall says she is no longer fighting on the undercard of Natasha Jonas v Lauren Price on 7 March in London.\nThe super-middleweight world champion was expected to appear on the all-women card at the Royal Albert Hall and appeared at the launch news conference last month.\nMarshall, 33, says she was \"told\" an opponent had been agreed and she had been in camp since December 14 as a result.\n\"I was also asked to travel to London for the press conference where I was told my fight would be announced,\" she said on Instagram.\n\"Instead I was sidelined and left feeling humiliated and confused.\n\"I honestly thought I would have been treated with a bit more respect.\n\"Due to disputes with Boxxer, I will not be fighting on March 7th.\"\nBoxxer responded to Marshall's comments saying they made her an offer to fight on the Jonas-Price undercard, but were \"unable to reach an agreement with her management\".\n\"We've always had a great working relationship with Savannah, we've shared some incredible experiences and we hope to work together again in the future,\" the boxing promotion said.\nMarshall headlined Boxxer's last all-women card in October 2022 when she fought long-time rival Claressa Shields.\nThat event, which included Welshwoman Price on the undercard, was a sell-out at London's O2 Arena.\nMarshall lost that fight but became the undisputed super-middleweight champion in her next fight against Franchon Crews-Dezurn in July 2023.", "url": "https://www.bbc.com/sport/boxing/articles/ce3np13nzl4o"}