{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:03:02", "date_modify": "2025-05-21 07:03:02", "date_publish": "2025-03-29 00:00:00", "description": "Charlie Whitaker scored in either half to earn Notts County victory in their League Two contest with Newport County at Rodney Parade.", "filename": "sport_football_live_c984z4zlmedt_1747810982.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c984z4zlmedt_1747810982.html", "title": "Whitaker brace earns Notts County victory at Newport", "title_page": "Charlie Whitaker brace earns Notts County victory at Newport County - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Notts County boosted their League Two promotion hopes with victory over Newport County at Rodney Parade.\nThe Magpies needed just six minutes to take the lead as Nick Tsaroulla cut in from the right before finding Charlie Whitaker whose left-footed strike flew beyond Nick Townsend - his third goal since joining from Everton in January.\nDavid McGoldrick and Josh Martin were then both off target with efforts, with Notts County forward McGoldrick curling narrowly wide shortly after the restart as Stuart Maynard's side carried the greater threat.\nAnd the away side sealed victory as Whitaker scored his second of the afternoon from the edge of the box after the hour mark as Notts County cemented their grip on sixth place with seven regular season matches remaining.\nThe Magpies now have a seven-point gap to Colchester United who are currently eighth.\nNewport sit 18th after losing for just a second time in eight home league games.\nNewport County head coach Nelson Jardim said:\n\"We knew that this was going to be a tough game. We know the quality and the team that they are.\n\"They took their moments well and the little things we were building and creating, we didn't score.\n\"We had two or three chances where we could have scored but they took their two goals very well.\"", "url": "https://www.bbc.com/sport/football/live/c984z4zlmedt"}