{"authors": ["Chris Wathan", "www.facebook.com"], "date_download": "2025-05-21 05:28:55", "date_modify": "2025-05-21 05:28:55", "date_publish": "2025-01-23 08:30:14", "description": "He's the Wrexham cult striker who needs no introduction to Ryan Reynolds.\nAnd, no, it's not Paul Mullin.", "filename": "sport_football_articles_c0lzn82x9r5o_1747805335.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d46e/live/acf70d70-d850-11ef-839b-574c57824f61.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c0lzn82x9r5o_1747805335.html", "title": "Gary Bennett: Wrexham's hero long before Ryan Reynolds", "title_page": "Gary Bennett: Wrexham's hero long before Ryan Reynolds - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "He is the Wrexham cult striker who needs no introduction to Ryan Reynolds.\nAnd, no, it is not Paul Mullin.\nThanks to his promotion-winning goals and documentary star-billing, Mullin's name may well be on the back of a fair few shirts at the US watch-parties for the so-called Hollywood Derby with Birmingham City.\nQuite how many would know the name of Gary Bennett is up for debate.\nBut long before Deadpool rocked up at the Racecourse, Bennett was the only hero that mattered.\nAnd – just like his astonishing 114 goals in 176 appearances - it has not been forgotten.\n\"I was at the crazy play-off game against Grimsby and I was asked to go over to do a bit in hospitality,\" Bennett regales.\n\"Ryan was walking across the pitch at the same time and the guy I was with stopped him and asked for him to have a picture with me, explaining I used to play for the club.\n\"And Reynolds said 'I know exactly who Gary Bennett is'. I tell people now he's a mate of mine!\"\nThe moment says plenty about Reynolds; a bit of history homework showing his buy-in to the League One club is about more than money.\nBut it probably says more about Bennett, the reject from the rivals who went from factory worker to one of the north Wales club's greatest goalscorers during the 1990s.\n\"I used to say I made shirts, but I was too embarrassed to admit I worked on women's blouses,\" says Bennett, sat at home resting up after belated surgery on the knee injury that 26 years ago ended a career which started in unlikely fashion.\nThe Merseysider was a cutter but was more suited to putting the ball in the back of the net, something he did at an alarming rate in amateur football before turning pro following a trial with Wigan at the age of 22.\nHe found himself at Wrexham's cross-border rivals Chester when Joey Jones, the former Liverpool defender and number two to Brian Flynn at the Racecourse, enquired if he would consider joining.\nOut of contract, he was asked to tour the Isle of Man in pre-season to see if he would fit in. Not quite the Stateside tours of the current era.\n\"But they would only pay me £500 to go,\" the 61-year-old recalls. \"I couldn't risk getting injured and possibly losing a chance of a move somewhere for that, so I said no.\"\nWrexham struggled, a second phone call came, and a love affair was born.\nEventually.\n\"I didn't score and got booed for something like the first eight weeks,\" he laughs.\n\"I knew it was sink or swim, but slowly I won them over. Maybe it was the way I'd come into football, that I wasn't refined, but I just clicked with the fans and there was just something about me and the club. It got to the point I'd go to the ground not hoping I'd score, but knowing I would.\"\nSome 47 goals in one season in 1994-95 is testament to that, but the affinity was just as much about his all-out attitude that aligned with the working-class community now being beamed into the homes of US documentary watchers.\nHe remembers promotions and Welsh Cup wins, passing the cars of fans drunk on success after so long without a drop. Now he rarely has to buy his own beer when he gets to a game and pops into the famous Racecourse-adjacent Turf pub.\n\"I go into the Turf and it's strange because you see all these American fans there, bus loads, and it's hard to get your head around,\" he says,\n\"But you also see those same diehards and you see what it means now just as it did then.\"\nHe says there is no envy of the money and the spotlight present now but missing then.\nHe argues \"my memories are as good as theirs will be\", adding that he is happy for the likes of Mullin - a player with the same Scouse accent and the new darling of the Kop - who is five goals behind sixth placed Bennett in the club's list of all-time scorers.\nHe does insist he was a better diver, with fans who remember winks to the crowd after winning penalties perhaps agreeing.\nAnd while Mullin got a cameo in the latest Deadpool movie, Bennett reminds that he ended up with an appearance on Come Dine With Me alongside wife Linda.\n\"They filmed the final day in our house, the part where you walk in with the tray with the money on and they had to throw it in the air in one take,\" he teases. \"We didn't win, but the next day we found a few notes so we got something out of it!\"\nMoney is not in short supply for Wrexham these days, with Bennett convinced the celebrity ownership is set for success beyond the back-to-back promotions already achieved.\n\"I said when they came in to sit back and enjoy the ride, and it's still happening,\" he says, also praising Reynolds' co-chairman Rob McElhenney who he has also met.\n\"If more investment comes in, develop the ground, who's to say they couldn't get to the Premier League; Bournemouth and Luton did it and they wouldn't get the crowds we would get.\n\"The fans are what makes a club and I see the same faces from when I played, who really went through the dark ages when we were just existing, and I see them now with smiles on their faces.\"\nIncluding Ryan Reynolds.\n\"I was at one game, and the crowd was chanting 'There's only one Gary Bennett' and I looked up to the box and he was sort of joining in,\" he laughs. \"I'm not sure he knew what he was singing.\"\nOr maybe he did.", "url": "https://www.bbc.com/sport/football/articles/c0lzn82x9r5o"}