{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:35:10", "date_modify": "2025-05-21 04:35:10", "date_publish": "2025-01-23 17:08:27", "description": "When asked if you agreed with Mark Robins' \"dark arts\" claims about Portsmouth, here's what you had to say.", "filename": "sport_football_articles_cg5yz8276veo_1747802110.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/51c5/live/6bd42b00-d9a6-11ef-902e-cf9b84dc1357.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cg5yz8276veo_1747802110.html", "title": "Stoke City: 'No Pompey dark arts, they wanted it more'", "title_page": "Stoke City: 'No Pompey dark arts, they wanted it more' - your views - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Stoke City boss Mark Robins was critical of his team for allowing Portsmouth to \"bully\" them in their 3-1 defeat at Fratton Park on Wednesday, but also accused Pompey of using the \"dark arts\".\nWe asked you for your views on Robins' post-match comments and here is a selection of your responses:\nPeter: Rubbish, I was at the game. It was a good physical game of football from both sides. No dark arts, just one team wanting it much more than the other.\nRonan: He's not wrong and it has been a weak point of Stoke's game all season, but it was a total failure by the referee to control the game in my opinion.\nThe standard of refereeing in this season's Championship has been diabolical - I dread to count the number of points we have lost to objectively incorrect refereeing decisions.\nI confess I watch the Prem with envy every time the referee runs over to that monitor…\nDarren: Robins need to worry about his own team being pretty poor, and how he is going to stop their slide down the table, rather than making excuses for the defeat. Pompey had 9 fouls against them, Stoke 12... Hmmm.\nAdrian: Sounds like sour grapes to me. I never saw anything other than a normal game of modern football from both sides.\nExpect better from Robins. Maybe the pressure of the position he finds himself in now is dawning on him.", "url": "https://www.bbc.com/sport/football/articles/cg5yz8276veo"}