{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:15:57", "date_modify": "2025-04-26 06:15:57", "date_publish": "2025-03-01 20:42:21", "description": "Stoke City boss Mark Robins says he appreciates the fans' support and understanding of what the team are trying to do in their bid to improve results.", "filename": "sport_football_articles_cj3nxpv3rr6o_1745648157.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/59a2/live/3ae55960-f6d9-11ef-bf42-e37b69994092.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cj3nxpv3rr6o_1745648157.html", "title": "Mark Robins: Stoke boss says support of fans is 'huge' as they try to improve results", "title_page": "Mark Robins: Stoke boss says support of fans is 'huge' as they try to improve results - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Stoke City boss Mark Robins says he is grateful to have the Potters fans on his team's side as they continue to grind out performances - if not wins.\nRobins has only enjoyed two league victories in the 12 games since he took charge, plus the extra-time FA Cup win at Sunderland.\nBut they have drawn five times in the Championship, three of them 0-0 at home, the latest of them against play-off chasing Watford.\nAnd he is relieved that the Stoke fans can see the effort the players are putting in to try to turn it round.\n\"I have to thank the fans for their support,\" Robins told BBC Radio Stoke. \"I'd asked for that and they gave us it. That was huge for us.\n\"After the week we have had, it was important we did something that was more like what the supporters expect and what the players can do.\n\"The performance was all right on the back of a three-game week. Watford have only played two games this week - and it makes a difference.\n\"I am going to take the clean sheet and run with it because there were some good performances in there. Some of the things levelled against the players previously were answered in a more positive way and the supporters responded in kind.\n\"It wasn't a classic by any stretch of the imagination. But there were a lot of positives. It was niggly at times but I was pleased with some of the tackles we put in.\n\"There is a performance standard and minimum level we have to do. But the work rate they put in shouldn't be underestimated.\"\nRobins now has a clear week ahead of next Saturday's reunion at Coventry - his first return to the CBS Arena since being sacked by the Sky Blues four months ago.", "url": "https://www.bbc.co.uk/sport/football/articles/cj3nxpv3rr6o"}