{"authors": ["Ethan Hampton", "www.facebook.com"], "date_download": "2025-05-21 05:37:21", "date_modify": "2025-05-21 05:37:21", "date_publish": "2025-01-14 12:30:26", "description": "Dundee fan column: Can teenage talents keep confidence flowing for Celtic's visit?", "filename": "sport_articles_c4g3pxr8j55o_1747805841.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7bd1/live/1a541f00-d272-11ef-87df-d575b9a434a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c4g3pxr8j55o_1747805841.html", "title": "Can teenage talents keep confidence flowing for Celtic's visit?", "title_page": "Dundee fan column: Can teenage talents keep confidence flowing for Celtic's visit? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Last week, I said that taking points off Rangers would require great grit, tenacity, and spirit. Dundee delivered all of that on Thursday.\nIt was a point gained for us, even though we were the better team overall.\nWhile Rangers dominated possession in the second half, they never truly controlled the game. Aaron Donnelly's return to the club gave everyone a lift ahead of the showdown with the Glasgow giants, stepping in for an in-form Luke Graham, Donnelly played as if he'd never left, slotting seamlessly into the team.\nTwo 19-year-olds stole the show in front of the Sky Sports cameras. Oluwaseun Adewumi and Cesar Garza, the latter making his home debut, were outstanding. Garza, was fearless. Breaking up play, covering every blade of grass and ensuring Dundee kept a positive flow in transitions. Adewumi, meanwhile, ran riot, leaving Rangers scrambling to handle him. Week after week, I find myself saying, \"that was his best game for us\".\nDefensively, we kept Rangers relatively quiet, with Philippe Clement's side creating few clear chances. Though we were unlucky not to secure a clean sheet, with new signings arriving and injured players nearing full fitness, it is only a matter of time until we go a full game without conceding any goals.\nThis result should give us confidence as we prepare to host Celtic. While it's another daunting task, their busy schedule and 15-point lead at the top might see them take their foot off the gas. Still, I'm realistic, I don't expect a result, but I do hope for a performance that reflects well on the team.\nWhere expectation really lies is in the Dundee derby in the Scottish Cup next week. Losing to United in the league was a bitter pill to swallow, and beating them in the cup is the only way to atone for that disappointment.", "url": "https://www.bbc.com/sport/articles/c4g3pxr8j55o"}