{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:13:46", "date_modify": "2025-05-21 07:13:46", "date_publish": "2025-01-22 15:34:50", "description": "Crusaders boss Declan Caddell admits Kieran Offord \"probably excelled quicker\" than thought he would after his season-long loan at Seaview was cut short.", "filename": "sport_articles_crr072jkgwdo_1747811626.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1650/live/5ef187f0-d8cc-11ef-bf89-cf1be2bb19ea.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_crr072jkgwdo_1747811626.html", "title": "Kieran Offord: Crusaders boss Declan Caddell on in-demand forward after loan spell cut short", "title_page": "Kieran Offord: Crusaders boss Declan Caddell on in-demand forward after loan spell cut short - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Crusaders boss Declan Caddell admits Kieran Offord \"probably excelled quicker\" than he thought he would after his season-long loan at Seaview was cut short by Scottish Premiership side St Mirren.\nThe Scottish forward scored 14 goals, including 10 in the league, during his loan spell at the club, including three against north Belfast rivals Cliftonville as he quickly established himself as a fans' favourite.\n\"He's had four loan spells before this one and none have really worked out,\" said Caddell.\n\"I brought in a player that I knew had a lot of potential and maybe needed that wee bit of confidence and that little bit of belief put back into him which we spent a lot of time doing and he has reaped the rewards for it.\n\"I'm delighted for him that once he's called back there's interest from a couple of clubs in him and that's probably testament to ourselves and to him in terms of the project we are trying to do.\"\nHaving reportedly attracted interest from Irish League clubs, Caddell admits there is a \"possibility\" that Offord will be lining up against the Crues in the coming months.\n\"I know Kieran quite well and we've been quite open and honest about everything,\" he added.\n\"It was never Kieran's ambition to spend one, two or three seasons here in the Irish League and I made that clear from day one that I wanted him to come over and use it as that stepping stone or pathway to bigger and better things.\n\"For me that hasn't changed, he's always had ambitions to play at the highest level he can and from the few months he's been involved he's proved he can at a higher level.\n\"He bound to get the interest with how he started the season and how it has gone for him.\"", "url": "https://www.bbc.com/sport/articles/crr072jkgwdo"}