{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:00:03", "date_modify": "2025-05-20 14:00:03", "date_publish": "2023-07-31 07:22:39", "description": "Warrington Wolves head coach Daryl Powell leaves the club by mutual consent after a run of eight defeats in nine games.", "filename": "sport_rugby-league_66335349_1747749603.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/E19D/production/_130575775_cab83dba9f007aa11cca9145019c77bedee21802.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-league_66335349_1747749603.html", "title": "Daryl Powell: Warrington Wolves coach leaves by mutual consent", "title_page": "Daryl Powell: Warrington Wolves coach leaves by mutual consent - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Warrington Wolves head coach Daryl Powell has left the Super League club by mutual consent after a run of eight defeats in nine games.\nThe Wire announced that Powell, 58, had departed just hours after their thumping 42-6 defeat at bottom side Wakefield on Sunday.\nPowell took over at the Halliwell Jones for the 2022 season after eight years with Castleford.\nGary Chambers has been placed in caretaker charge.\nChairman Stuart Middleton said in a statement:, external \"We'd like to thank Daryl for his commitment and endeavours since joining the club last season but we feel the team now needs a different approach.\n\"Results and performances over the past 18 months have fallen short of the standard we expect and feel the club now needs to move in a new direction.\"\nPowell endured a tough first season in charge in 2022, as the Wolves finished second from bottom and won just nine of their 27 league games.\nHopes were much higher this year after some strong recruitment and they duly raced off the line with eight straight wins to start the campaign.\nHowever, they have tailed off completely and Sunday's damaging defeat in West Yorkshire was a sixth straight in all competitions and left them in the final of the six play-off spots and just two points clear of seventh-placed Salford.\nPowell admitted after the game that his side were \"lacking in a lot of confidence at the moment and I just thought we were outplayed\".\nThey host league leaders Catalans in their next game, looking to secure a first win since 10 June.", "url": "https://www.bbc.com/sport/rugby-league/66335349"}