{"authors": ["Mike Henson", "www.facebook.com"], "date_download": "2025-04-26 06:50:46", "date_modify": "2025-04-26 06:50:46", "date_publish": "2025-02-28 18:08:53", "description": "Grassroots clubs have been promised more control over community rugby as the Rugby Football Union attempts to see off a coup against chief executive Bill Sweeney.", "filename": "sport_rugby-union_articles_cx2e54wgpv4o_1745650246.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/92dc/live/af4de990-f5fb-11ef-a576-211c964a64b2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_cx2e54wgpv4o_1745650246.html", "title": "Bill Sweeney: Rugby Football Union (RFU) offer to devolve power before key vote", "title_page": "Bill Sweeney: Rugby Football Union (RFU) offer to devolve power before key vote - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Grassroots clubs have been promised more control over community rugby as the Rugby Football Union (RFU) attempts to see off a coup against chief executive Bill Sweeney.\nSweeney, who is under pressure after his £1.1m compensation package was revealed in the RFU's latest accounts, will face a crunch vote on 27 March.\nA majority vote against him by the 1,200 clubs and other stakeholders would rubberstamp a request that the RFU's board sack him \"as soon as practicably possible\".\nHowever, the governing body has added a second motion to the Special General Meeting, calling for a review into how the community game is run.\nThe RFU says it expects the review will start a shift to \"a regional structure where more decisions can be made locally, with greater flexibility achieved in competition management and devolved funding to help local decisions to be made to drive participation growth, aid player retention and support club sustainability.\"\nInterim RFU chair Bill Beaumont, who, along with Sweeney, has been on a roadshow meeting club representatives, believes the chief executive's critics \"do not represent the wider views of our game\".\n\"A vote of no confidence risks sending the Union into paralysis and creating a costly leadership vacuum,\" he added in an open letter urging clubs to vote for a review and against Sweeney's removal.\nThe Whole Game Union, the collective which co-ordinated the move against Sweeney, said it had considerable backing, pointing out the vote was triggered by a letter signed by 152 clubs and members, with a significant number of other clubs also believe to be supportive.\n\"It is only because of the Whole Game Union's ability to corral the dissatisfaction of English Rugby with its leadership that Sir Bill and his Board belatedly discovered the need to go out and meet clubs,\" it added.\n\"None of the proposals in his letter would have been forthcoming if our Union was just a few malcontents stirring a pot. The pot was already boiling.\n\"If we are now in the business of urging people how to vote rather than letting them make up their own minds, we would say, 'Vote for change before it's too late. These people are not on your team'.\"\nFormer England captain Beaumont reiterated that the board, with whom the chief executive's fate ultimately rests, support Sweeney staying in his post.\n\"Any decision relating to the employment of the CEO is the responsibility of the RFU Board and the Board unanimously supports Bill Sweeney remaining as CEO,\" he wrote.\n\"This support is based on his achievements to date, as well as his ability to deliver the RFU's strategy while being highly motivated to respond and react to what we have heard from you, our members.\"", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/cx2e54wgpv4o"}