{"authors": ["Chris Bevan", "www.facebook.com"], "date_download": "2025-05-21 03:46:28", "date_modify": "2025-05-21 03:46:28", "date_publish": "2025-04-07 16:23:28", "description": "Man City analysis: Who should City keep or sell?", "filename": "sport_football_articles_cgkgmj10k7no_1747799188.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e970/live/f3e735b0-13c0-11f0-94c0-094e7adca435.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cgkgmj10k7no_1747799188.html", "title": "Man City analysis: Who should City keep or sell?", "title_page": "Man City analysis: Who should City keep or sell? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We know Kevin de Bruyne is leaving Manchester City in the summer, but who else might be going - and who should stay?\n\"It feels like there are going to be big changes right through the squad,\" former City goalkeeper Shay Given told BBC Sport.\n\"City fans must have watched Sunday's Manchester derby and been thinking they have no idea what the future will look like - right now, no-one does.\"\nCity's lack of physicality in midfield has been a key factor in their decline and it is the area of the team that could see the biggest overhaul.\nA fit-again Rodri will surely return as the fulcrum of their side when he recovers from his long-term injury, but who will be alongside him is much less certain.\nIf there is an overhaul at Etihad Stadium, then it will be with new faces, rather than tactics.\nGuardiola is never going to move away from a possession-based playing style and Given feels the old guard can no longer implement an important part of his gameplan.\n\"A big part of their success down the years under Pep was when they won the ball back quickly, high up the pitch, within a few seconds of losing it,\" Given said.\n\"They would peg teams back and not let them out but now teams are getting through them.\n\"That needs to be rectified. It's something that will come with fresh legs from the people coming in, but that won't solve all the problems City have, because any new signings have to be the highest quality too.\"\nWhatever City's next step is, they will have a new voice shaping their transfer strategy. Txiki Begiristain is leaving in the summer with Hugo Viana replacing him as director of football.\n\"I am excited to see how he gets on at City but Txiki has left big boots to fill. For a long time City's transfers were brilliant, they hardly put a foot wrong,\" added Given.\n\"We are about to find out what Pep's masterplan is too and it will be fascinating to see how he does next season.\"", "url": "https://www.bbc.com/sport/football/articles/cgkgmj10k7no"}