{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:36:59", "date_modify": "2025-05-19 15:36:59", "date_publish": "2017-08-25 13:43:49", "description": "Welshman Geraint Thomas anticipates \"massive\" excitement of racing in his home city of Cardiff during the Tour of Britain.", "filename": "sport_cycling_41049590_1747669019.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/A3FE/production/_97528914_gettyimages-810786506.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_cycling_41049590_1747669019.html", "title": "Geraint Thomas: Racing in Cardiff will be 'massive' says cyclist", "title_page": "Geraint Thomas: Racing in Cardiff will be 'massive' says cyclist - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Geraint Thomas is looking forward to racing in his home city when he returns to action in the Tour of Britain.\nThe Team Sky rider has been sidelined since breaking a collarbone while in second place on stage nine of last month's Tour de France.\nThe Tour of Britian starts on 3 September in Edinburgh and ends in Thomas' native Cardiff a week later.\n\"It will be massive. I don't think I've done a race in Cardiff, or not since I was 14 or so,\" said the 31-year-old.\n\"Finishing where it does, and going past Cardiff Castle, I'll be really looking forward to that and hopefully we can get a bit of success.\"\nFellow Welshman Owain Doull - also from Cardiff - will line up alongside Thomas for Team Sky.\nThomas also suffered a crash in the Giro D'Italia in May, forcing him to pull out of that race when he was Team Sky's lead rider.\nThe double Olympic gold medallist admitted he is not sure if he is 100% fit, but is looking forward to returning to action.\n\"It'll be good enough for the race and for me to do my bit for the team,\" he told BBC Wales Sport.\n\"Obviously I'd love to have a go myself but we'll just have to see how I am once we get racing. It might take me a couple of days to get back into it.\n\"It's had some time to heal, I don't know if it's 100%.\"\nInjury aside, Thomas says he is happy to be riding in the Tour of Britain for the first time in more than half a decade.\n\"I haven't ridden the Tour of Britain since 2011 so I'm looking forward to that again. Racing on home roads is always a massive buzz,\" he added.\n\"The finish in Cardiff is the highlight, so I'm really looking forward to getting there.\"", "url": "https://www.bbc.com/sport/cycling/41049590"}