{"authors": ["Brian McLauchlin", "www.facebook.com"], "date_download": "2025-05-21 03:48:34", "date_modify": "2025-05-21 03:48:34", "date_publish": "2025-01-15 11:36:37", "description": "Hearts: 'Better signs... but fear of Brora repeat lurks'", "filename": "sport_articles_cz7eqvnezyvo_1747799314.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b125/live/9f469d60-d334-11ef-87df-d575b9a434a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cz7eqvnezyvo_1747799314.html", "title": "'Better signs... but fear of Brora repeat lurks'", "title_page": "Hearts: 'Better signs... but fear of Brora repeat lurks' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "There is no doubt things at Tynecastle are looking up yet despite a gallant performance on Sunday at Pittodrie and a valuable point gained, the team remain in an unhealthy 11th place.\nThe welcome addition of Jamie McCart (below) and Elton Kabunga will bring competition at the back and forward areas on the pitch, and both these players should have major parts to play between now and the end of the campaign.\nWith only seven points separating Hearts and Motherwell in fifth place there remains a chink of light in terms of trying to obtain a European spot for next season.\nOf course all that would be achieved in Hearts could lift the Scottish Cup this year, and that campaign begins on Friday night away to Highland League club Brechin City.\nThe two teams last met in the cup in February 1985, when a John Robertson goal was enough to take Hearts through in a replay at Tynecastle after they were held 1-1 at Glebe Park.\nThe result of this game should not be in doubt but as Hearts well know they can't underestimate the Angus minnows.\nThe defeat at Brora Rangers back in March 2021 still haunts Hearts supporters and after what has been a disappointing Premiership so far, a lengthy cup run would go a long way to show all what the team are capable off.", "url": "https://www.bbc.com/sport/articles/cz7eqvnezyvo"}