{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:06:09", "date_modify": "2025-05-19 15:06:09", "date_publish": "2015-02-26 17:50:43", "description": "Full Welsh Premier League round-up and details of games involving Colwyn Bay and Merthyr Tydfil in the English non-League pyramid.", "filename": "sport_football_31651692_1747667169.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/58442000/jpg/_58442685_corbett_logo_2011_12_464.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31651692_1747667169.html", "title": "Welsh Premier League & non-League round-up", "title_page": "Welsh Premier League & non-League round-up - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Friday, 27 February\nCefn Druids 1-2 Rhyl: Ashley Ruane's late goal secured victory for Rhyl, who had taken the lead at The Rock through Mark Cadwallader before Tom Donegan levelled for Druids, who are two points clear of the relegation zone.\nBala Town 3-3 Aberystwyth Town: In the race for second place, Bala Town and Aberystwyth shared the points at Maes Tegis. Lee Hunt gave the Lakesiders a ninth minute lead before Geoff Kellaway equalised on 27 minutes. Mark Jones restored Bala's lead before Kellaway completed his hat-trick in the second half. But Will Bell rescued a point for Bala with a minute remaining.\nBangor City 4-0 Prestatyn Town: Bangor are within two points of safety after a crucial win over bottom of the table Prestatyn Town at Nantporth. Second half goals from Lee Healey, Callum Morris, Sion Edwards and Liam Caddick secured three vital points for Neville Powell's side.\nSaturday, 28 February\nCarmarthen Town 2-3 Gap Connah's Quay: Paul Fowler gave Carmarthen an early lead before Sacha Walters doubled their advantage on 23 minutes. Russell Courtney replied for Connah's Quay before the break before equalising in the second half. The visitors secured the win after Craig Hanford put the ball in his own net.\nPort Talbot Town 4-0 Newtown AFC: Port Talbot raced into a 3-0 lead within the opening 30 minutes through a disputed Lee Surman header, Liam McCreesh and Martin Rose. Rose added a second in the second half before Newtown's Jason Oswell saw his late penalty saved by Steve Cann.\nSunday, 1 March", "url": "https://www.bbc.com/sport/football/31651692"}