{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:49:12", "date_modify": "2025-05-21 04:49:12", "date_publish": "2025-04-06 00:00:00", "description": "St Johnstone give themselves a \"fighting chance\" of avoiding relegation after they beat Celtic to deny the reigning champions the chance to clinch the title next Saturday.", "filename": "sport_football_live_cy8q06qj91pt_1747802952.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cy8q06qj91pt_1747802952.html", "title": "St Johnstone vs Celtic: Scottish Premiership LIVE", "title_page": "St Johnstone vs Celtic: Scottish Premiership LIVE - updates, radio, stats & head-to-head - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "St Johnstone have given themselves a \"fighting chance\" of avoiding relegation, says manager Simo Valakari, after they defeated Celtic to deny the reigning champions the chance to clinch another Scottish Premiership title next Saturday.\nCeltic knew a win at McDiarmid Park would allow them to secure a fourth successive league championship in front of their own fans against Kilmarnock next weekend.\nBut Daniels Balodis' thumping early header from Graham Carey's teasing free-kick - combined with a brilliant defensive display - brought the basement side back to within five points of Dundee.\nCeltic may yet finish next weekend confirmed as champions if they beat Kilmarnock and Rangers lose at Aberdeen the following day.\nBut Latvian Balodis' first goal for St Johnstone has thwarted their hopes - for now - of doing it under their own steam and in front of their own fans.\n\"My players wanted to show that they are good players and we are a good team,\" said Valakari. \"There's no better place to show that than against Celtic at your home stadium. Very proud of the performance.\n\"We give ourselves the fighting chance. Where does it take us? We don't know but we need to stay there until the end. We keep going.\"\nThe early goal certainly gave the Perth side a spring in their step. And Celtic's response was predictable. But their failure to get back into this this one was anything but.\nIn-form Daizen Maeda was the first to have a go, his strike being tipped by goalkeeper Andy Fisher towards the back post when Stephen Duke-McKenna nipped in front of Nicolas Kuhn to make a vital intervention.\nNot content with his goal-saving heroics, Duke-McKenna proved a threat up the other end, with his swerving shot pushed past by Celtic goalkeeper Viljami Sinisalo.\nThe visitors continued to search for the equaliser - Reo Hatate hit a post with a early in the second period and should have done better later on when he blazed over.\nAt the other end, Benji Kimpioka used his physicality to good effect, as St Johnstone created one or two chances. And Victor Griffith came close to adding a second, his deflected strike looping over.\nJames Forrest had Celtic's best chance, but his close-range effort was saved by the excellent Fisher, who also kept out an effort by Luke McCowan.\nThe Perth side held on and their survival bid will continue against Dundee United at Tannadice on Saturday before the post-split fixtures ensue.\nSt Johnstone will meet Celtic again in their Scottish Cup semi-final on 20 April.\nMaybe Celtic were shocked by St Johnstone taking an early lead and frustrated by some brilliant defending, but they were just off it in Perth.\nThey just could not find an end product, with Maeda, Hatate and Jota not their usual sparky selves or at their clinical best.\nIt won't derail Celtic as they close in on another title, of course, but the fact the loss has delayed any party will not please Brendan Rodgers in the slightest.\nHe demands intensity and pace in his side's play and, while he got that in patches, Celtic didn't use it well.\nSt Johnstone's set-up was bold and their bravery was rewarded.\nNot only did they take the lead against a team who had previously put them to the sword this season with an aggregate of 10-0, but they also defended the predictable Celtic response brilliantly.\nCeltic piled on pressure in the second half, but St Johnstone held firm, while Fisher made some vital saves.\nThe points could be vital too as they try to stave off the threat of relegation after 16 years in the top flight. It was a brilliant display and one that psychologically could be huge for the league run-in.\nAlthough, it must be a tad frustrating for manager Simo Valakari that performances like this have been so rare this term. Still, he will be focusing on the positives and hoping the result will spark something.\nSt Johnstone manager Simo Valakari: \"There were a lot of good performances, starting from the striker all the way, of course, to our goalkeeper. You need in these matches to make saves and Andy Fisher made those saves.\n\"Our players, mentally, they were switched on all the time. Early goal helps because then you have even more to hang on to. Our players, they can defend.\"\nCeltic manager Brendan Rodgers: \"Bitterly disappointed in the start of the game. It's happened too many times. I've seen a trend now with us, and it will be interesting between now and the end of the season in terms of mentality.\n\"We talked about being a top team and having talent but also having drive, desire and ambition to win and having spirt, and too many of our players have been too comfortable.\n\"There's no excuse, we also have to give a big, big credit to St Johnstone. We were disappointed in the game in terms of our attitude..\"", "url": "https://www.bbc.com/sport/football/live/cy8q06qj91pt"}