{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:32:39", "date_modify": "2025-05-21 04:32:39", "date_publish": "2025-01-05 22:39:12", "description": "Manchester City manager Pep Guardiola says Jack Grealish must show he 'deserves' to regain his spot in the starting line-up.", "filename": "sport_football_articles_c2ld4x89zq7o_1747801959.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4f04/live/ff4feb40-cc12-11ef-94cb-5f844ceb9e30.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c2ld4x89zq7o_1747801959.html", "title": "Manchester City: Jack Grealish must show he 'deserves' starting spot, says Pep Guardiola", "title_page": "Manchester City: Jack Grealish must show he 'deserves' starting spot, says Pep Guardiola - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester City manager Pep Guardiola says Jack Grealish must prove he deserves to regain his spot in the side's starting line-up by showing the quality he displayed when the club won the Treble in 2023.\nThe England international, 29, has appeared in 14 of City's 20 Premier League matches this season, but started just six times.\nGrealish managed just six minutes in City's 4-1 win against West Ham United at the Etihad on Sunday, replacing Erling Haaland in the 84th minute.\nBrazilian Savinho, a £30.8m signing from Girona last summer, started ahead of the former Aston Villa captain against the Hammers and provided both assists for Haaland's double in the victory.\nGuardiola says he will work with Grealish to help him regain the form that made him a key player two seasons ago when City lifted the Premier League, FA Cup and Champions League.\nAsked whether Savinho could be an 'example' for the forward to win back his place, the City boss said: \"Savinho is in better shape and everything than Jack, and that's why I played Savinho [against West Ham].\n\"Do I want the Jack that won the Treble? Yeah I want it, but I try to be honest with myself for that.\n\"They have to fight. You can say it's unfair. OK, if you think that, then it's fine, but you have to prove [to me], 'OK, I'm going to fight with Savinho, to deserve to play in that position', every single day, every single week and every single month.\"", "url": "https://www.bbc.com/sport/football/articles/c2ld4x89zq7o"}