{"authors": ["Dan George", "www.facebook.com"], "date_download": "2025-05-21 04:38:30", "date_modify": "2025-05-21 04:38:30", "date_publish": "2025-04-04 15:50:07", "description": "Oxford United boss Gary Rowett has called for his players to \"step up\" as they approach the final Championship games of the season.", "filename": "sport_football_articles_cvg9mv7xmr5o_1747802310.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5528/live/a2e716d0-1168-11f0-a3a8-cd0c869b6aeb.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cvg9mv7xmr5o_1747802310.html", "title": "Gary Rowett: Oxford United boss calls for players to step up in relegation battle", "title_page": "Gary Rowett: Oxford United boss calls for players to step up in relegation battle - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Oxford United boss Gary Rowett has called for his players to \"step up\" as they approach the final Championship games of the season.\nWith relegation rivals Luton Town unbeaten in their past three matches, and Derby County winning each of their past four, the U's have slipped to within two points of the bottom three after just one win in eleven.\nIn their remaining seven games they face three of the league's top four at the Kassam Stadium.\n\"We know we have some really tough games at home and it's important we step up.\" Rowett told BBC Radio Oxford.\n\"The crowd have been brilliant recently and that is something we have to utilise through these last matches.\n\"If we maintain the form we have shown so far then the home games will be enough to get us through.\"\nOn Saturday, Oxford will take on league leaders Sheffield United, who have the best away record in the division.\nThe Blades have won 12 and lost three matches on the road this campaign.\nOxford were beaten 3-0 at Bramall Lane in the reverse fixture in November, as Chris Wilder's side made it seven wins in a row at home without conceding a single goal.\nComing into this game, Sheffield United have won each of their past six away league games – they have never previously won seven in a row on the road.\n\"The players know that when you come up against these sort of teams you have to do a little bit more,\" Rowett added.\n\"You can do more and still get punished though because these teams have such quality.\n\"But you can pick a few times in the season when these top teams don't have the level of performance needed on the day and that's when you have to capitalise.\"", "url": "https://www.bbc.com/sport/football/articles/cvg9mv7xmr5o"}