{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:25:00", "date_modify": "2025-05-21 06:25:00", "date_publish": "2025-03-31 12:24:15", "description": "We asked for your thoughts on Preston's display against Aston Villa in the FA Cup quarter-final on Sunday and here's what you had to say.", "filename": "sport_football_articles_c5yg05x25y3o_1747808700.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/441e/live/0bc867a0-0e24-11f0-ba12-8d27eb561761.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c5yg05x25y3o_1747808700.html", "title": "Preston North End: Your views on FA Cup exit to Aston Villa", "title_page": "Preston North End: Your views on FA Cup exit to Aston Villa - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "While Preston North End may have succumbed to a 3-0 loss to Premier League side Aston Villa in Sunday's FA Cup quarter-final, it hasn't left the fans of the Lancashire club feeling too down.\nWe asked for your thoughts on Preston's display and here's what you had to say:\nIain: A tough game, but I'm not upset to be coming away defeated; the clearly better team won. Great to see Theo Carroll (first-team debut) and Noah Mawene get game time, hope to see them again before the season's out.\nPaul: Well done Aston Villa and good luck for the rest of the competition. Villa deserved the victory. I did think the penalty was a ridiculous 'modern' decision... Our defender stepped on his foot, Villa man took another step, then went down! Didn't matter, in reality... Villa the better team. Good run by North End though, and a full house!\nJohn: Preston held out well for 58 minutes with a much depleted team against a class outfit, helped by a very Premier League friendly referee.\nDavid: Too many injuries which eventually impacted the scoreline. Villa's class won the game although the score is harsh on us.", "url": "https://www.bbc.com/sport/football/articles/c5yg05x25y3o"}