{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:02:15", "date_modify": "2025-05-20 12:02:15", "date_publish": "2023-08-05 00:00:00", "description": "Follow the action as it unfolded as five-try Ireland overcome Italy 31-17 in their opening World Cup warm-up game at the Aviva Stadium.", "filename": "sport_live_rugby-union_66373203_1747742535.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/12EAE/production/_130668477_inpho_02304974.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_rugby-union_66373203_1747742535.html", "title": "Ireland beat Italy in Dublin warm-up - as it happened", "title_page": "Ireland beat Italy in Dublin warm-up - as it happened - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Final whistle\nFT Ireland 33-17 Italy\nThat's the first World Cup warm-up game done and dusted and on the whole a decent performance from the hosts.\nMan-of-the-match Caelan Doris went over twice while Dave Kilcoyne, Stuart McCloskey and Cian Healy also bagging tries for Andy Farrell's team.\nThat's all from us for now - thanks for your company,\nFull-time\nIreland 33-17 Italy\nIreland chalk up a comfortable victory in their opening World Cup warm-up match.\nIreland come away with five tries and some impressive individual performances but some rustiness was evident from both sides, not helped by slippery conditions.\nItaly threatened to fight their way back into the game in the second half with some promising attacking play particularly in the third quarter.\nIreland's combination of youth and experience proved too much for the Italians, however, and the performance will give Andy Farrell plenty to think about as he prepares his side for the next two games against England and Samoa on the 19th August and 26th August respectively in preparation for the World Cup.\nPost\nIreland 33-17 Italy\nItaly continue to fight back as Ireland concede successive penalties on their own line.\nJust as they look in danger of conceding a third try, Tom Stewart secures an important turnover.\nIreland will now look to close out the game as full-time approaches.\nTry Ireland 33-17 Italy\nCaelan Doris\nIreland hit back immediately as they work their way up the pitch, stretching the Italian defence with a slick move down the left wing.\nPrendergast and Nash combined well and then a bounce pass from Healy finds Doris who crashes over for his second try of the game.\nFrawley takes on the kicking duties and converts.\nConverted try Ireland 26-17 Italy\nTommaso Menoncello\nMenoncello shows his power, spinning out of a tackle to crash over and put his side back in the game.\nTommaso Allan is accurate with the boot to keep his side within touching distance.\nPost\nIreland 21-10 Italy\nItaly work their way up the field but Tadhg Beirne forces a turnover at the breakdown.\nIreland surge forward once again and Italy concede a penalty.\nThey kick to the corner and Ireland set up a driving maul, with Tom Stewart peeling off the back and powers his way towards the line...\nTry Ireland 21-10 Italy\nLorenzo Pani\nPani scores a deserved Italian try following a spell of possession in Ireland's 22.\nItaly use the lineout maul as a platform and get it wide to Pani, who demonstrates his pace to score in the corner.\nAllan kicks a difficult conversion to bring Italy back into the game.", "url": "https://www.bbc.com/sport/live/rugby-union/66373203"}