{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:43:39", "date_modify": "2025-05-20 14:43:39", "date_publish": "2023-07-28 11:31:53", "description": "Algeria winger Riyad Mahrez completes his move from Manchester City to Saudi Pro League side Al-Ahli.", "filename": "sport_football_66339153_1747752219.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/34FB/production/_130436531_a10e18ed34ef1bf960bbf8358e306e0497622619.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66339153_1747752219.html", "title": "Manchester City: Algeria winger Riyad Mahrez joins Al-Ahli in £30m deal", "title_page": "Manchester City: Algeria winger Riyad Mahrez joins Al-Ahli in £30m deal - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Riyad Mahrez has completed his transfer from Manchester City to Saudi Pro League side Al-Ahli.\nThe 32-year-old, who had two years left on his contract, is the latest big-name recruit by the SPL in a deal worth up to £30m.\nCity paid £60m for Algeria winger Mahrez in 2018, and he scored 15 goals in 47 games in the Blues' Treble-winning campaign last season.\n\"To play for Manchester City has been an honour and privilege,\" said Mahrez.\n\"I came to City to win trophies and enjoy my football. I achieved all that and so much more.\n\"I've made a lifetime of wonderful memories. Manchester City will forever be a huge and happy part of my life.\"\nMahrez helped City win 10 major honours during five seasons with the club but was an unused substitute for both the FA Cup and Champions League finals.\nCity's director of football, Txiki Begiristain, said: \"Riyad has been a major factor in our amazing successes over the past five years and his contribution will not be forgotten.\n\"He is a wonderful footballer to watch and leaves us with so many great memories.\n\"There are few wingers that possess his levels of skill and technique in world football, and he will be missed, but everyone will wish him all the best as he begins a new chapter in his career.\"\nThe likes of Karim Benzema, N'Golo Kante and Ruben Neves have already followed Cristiano Ronaldo to Saudi Arabia this summer, while Steven Gerrard has been named Al-Ettifaq manager and Michael Emenalo has been appointed the SPL's director of football.\nFormer Liverpool captain Jordan Henderson completed a transfer to Gerrard's Al-Ettifaq on Thursday.\nThe country's Public Investment Fund (PIF) has also taken over four of the SPL's leading clubs, including Al-Ahli, as the league aims to become one of the top five in the world.", "url": "https://www.bbc.com/sport/football/66339153"}