{"authors": ["Charlotte Robson", "www.facebook.com"], "date_download": "2025-05-21 06:12:14", "date_modify": "2025-05-21 06:12:14", "date_publish": "2025-04-01 12:47:07", "description": "Newcastle news: Opinion - 'The fun's over - back to business'", "filename": "sport_football_articles_ckgem1w12geo_1747807934.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e2e4/live/2c881250-b62e-11ee-bc2f-cb5579b90709.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ckgem1w12geo_1747807934.html", "title": "Opinion - 'The fun's over - back to business' - BBC Sport", "title_page": "Newcastle news: Opinion - 'The fun's over - back to business' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "OK! The fun's over and it's back to business!\nEven though it definitely feels like the season should be finished because we have won a cup and all got horrible coughs and colds from celebrating for two weeks straight (or, at least, I very much have) the season is in fact still rumbling on. Ten games to go! Ten games to battle for a Champions League place.\nI was recently told that (apparently) in the 1980s, when Liverpool kept winning things, someone would come round with a bag and have the players put their medals into the bag. I do not know how true that is, but I understand the mentality. Celebrate later - we have a job to do right now.\nWe have not quite followed that ethos (see: 300,000 fans lining the streets to honour our team) but it is time to get back to regular scheduled programming.\nI can imagine that is Eddie Howe's mentality going into the final 10 games. He knows, we know, the players know, that Champions League football is the goal. It is an interesting balance; let the players celebrate - first in Dubai in the international break, second in Newcastle - but then get their heads back in the game.\nElite players like Alexander Isak and Sandro Tonali have already expressed how important it is for us to secure Champions League football next season, and the challenge is not beyond us.\nWe have Brentford at home, our first game since winning the Carabao Cup, on Wednesday. You have to assume that the goodwill and the noise of the crowd will boost the team through that fixture.\nAfter that, as always, it is time to set our minds on the next one. There are no additional fixtures to worry about, only the Premier League. I know that it is time to refocus and finish the season strong. The feeling in the city is amazing right now. Let's keep that going.", "url": "https://www.bbc.com/sport/football/articles/ckgem1w12geo"}