{"authors": ["Gary Rose", "www.facebook.com"], "date_download": "2025-05-21 07:47:58", "date_modify": "2025-05-21 07:47:58", "date_publish": "2025-02-08 00:20:40", "description": "Ruud van Nistelrooy says his Leicester side were beaten not in \"Fergie time, but offside time\" as Harry Maguire's controversial late winner sends Manchester United into the FA Cup fifth round.", "filename": "sport_football_articles_czrl25k748vo_1747813678.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1f0a/live/66775de0-e5a8-11ef-a819-277e390a7a08.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_czrl25k748vo_1747813678.html", "title": "Man Utd 2-1 Leicester: Foxes manager Van Nistelrooy rues lack of VAR in FA Cup defeat", "title_page": "Man Utd 2-1 Leicester: Foxes manager Van Nistelrooy rues lack of VAR in FA Cup defeat - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ruud van Nistelrooy knows all about 'Fergie time' - the term used by some football fans to describe late goals scored by Manchester United when Sir Alex Ferguson was manager.\nBut, after his Leicester side were knocked out of the FA Cup by a controversial stoppage-time Harry Maguire header on his Old Trafford return on Friday, the Dutchman had a new way to describe such drama.\n\"We are not defeated in Fergie time, we are defeated in offside time,\" the former Manchester United striker told ITV after his side were beaten in round four.\nHis frustration was that, with the scores level at 1-1 and the game in the third and final minute of injury-time and heading for 30 minutes of extra time, Maguire headed the winner, despite appearing to be offside when Bruno Fernandes sent a free-kick towards the back post.\nBut with no video assistant referee (VAR) at this stage of the FA Cup, it was down to the decision of the officials, who felt there was nothing wrong with the goal.\nHaving had a bit more time to digest the outcome when he faced the media around an hour after full-time, Van Nistelrooy was no calmer about the situation.\n\"We are gutted,\" he said.\n\"When you prepare for the whole week for this game and reacting after the Everton loss and put in a performance like that but it is decided on a clear and obvious mistake, that is unacceptable and unthinkable at this level.\n\"We have nothing else to do but pick ourselves up. It is not what the team deserved.\"\nHaving had time to analyse replays of the goal, VAR would most likely have overturned the on-pitch decision.\nHowever, the Football Association announced in mid-December, external that the technology would not be used in the FA Cup until the fifth round.\n\"VAR has only been used in the FA Cup previously for matches at Wembley Stadium and at Premier League grounds because of the infrastructure, workforce and costs that are required for its operation,\" the FA said in a statement on 16 December.\n\"This decision ensures that there is a consistent refereeing approach for all clubs taking part in the same stage of the competition.\"\nManchester United manager Ruben Amorim admitted his side were fortunate with the decision, and feels it vindicates the use of VAR, even if his side benefited on this occassion from its absence.\n\"With VAR it's not a goal,\" he said.\n\"I think it's important to have VAR because it's fair for the game. It's hard to lose like that with an offside play. But we deserve a little bit of luck.\"\nFormer Manchester United midfielder Roy Keane felt the debate is not over whether VAR is needed, but that it was a clear enough error that should have been picked up by the officials.\nHe said on ITV: \"That's a poor decision, the linesman [assistant referee] has got to see that.\n\"You have got to get those big decisions right.\"\nFormer Arsenal striker Ian Wright added: \"Look where the linesman is. That impacts him [Van Nistelrooy] that impacts his managerial career because it's another loss.\n\"That would have been a really big confidence booster for them. But they have to lift themselves, because of the officials.\"\nVan Nistelrooy added: \"It is a hard one to take because the game was decided on a mistake.\n\"It is not a matter of VAR where you look at millimetres, it was half a metre, it was clear.\"\nDespite accepting the winner was cruel on his opponents, Amorim felt his side were in need of a bit of luck.\nManchester United have struggled for consistency since the Portuguese coach was appointed in November and while he and the club's fans will have welcomed this win, there were still some causes for concern.\nThey were again poor in the first half, failing to manage a single shot on target as they fell behind to Bobby De Cordova-Reid's opener.\nAmorim gave January signing Patrick Dorgu his debut but played him at right-wing back, despite the 20-year-old being more often played at left-back.\nAmorim was seen giving the former Lecce player a lot of instructions, before taking him off at half-time.\n\"I was trying to help Dorgu to manage the game,\" he said. \"He's had three training sessions so it was hard for him.\n\"If you see the history of Dorgu he played a lot of games on the right side. Sometimes you need a left foot on the right side to come inside and connect in a different way.\"\nDorgu was replaced by Alejandro Garnacho and his introduction changed the game in United's favour. His pace down the left caused problems and he had a deflected shot superbly cleared off the line before sending in the cross that led to Joshua Zirkzee's equaliser.\nGarnacho had been linked with a move away from Old Trafford in the winter window, but Amorim had appeared keen to keep hold of him and his impact in this game showed why.\n\"He made a big impact,\" Maguire said.\n\"He always does that when he comes off the bench, so credit to him, he's ready, he's focused.\"", "url": "https://www.bbc.com/sport/football/articles/czrl25k748vo"}