{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:32:13", "date_modify": "2025-05-20 12:32:13", "date_publish": "2023-08-04 00:00:00", "description": "Live coverage of the opening game of the new Irish Premiership season as Coleraine host derby rivals Ballymena United.", "filename": "sport_live_football_66365146_1747744333.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_football_66365146_1747744333.html", "title": "Watch: Coleraine v Ballymena United", "title_page": "Watch: Coleraine v Ballymena United - Irish League Live - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We're up and running\nFT: Coleraine 2-1 Ballymena United\nSo, the 2023-24 Irish Premiership season is up and running, with Coleraine getting off to a winning start by beating Ballymena United 2-1.\nThere are two more games tomorrow, with Glenavon hosting Glentoran and newly-promoted Loughgall travelling to Newry City.\nWe'll be back with live radio and text commentary of both.\nCatch up then.\nColeraine were the better side - Leeman\nFT: Coleraine 2-1 Ballymena United\nPaul Leeman\nBBC Sport NI co-commentator\nColeraine were the better side. They were more dominant through Colin McKendry and Jamie Glackin, and obviously Matthew Shevlin got the two goals. They deserved their victory and manager Oran Kearney will be pleased. Ballymena fought the whole way, it was a difficult start for new boss Jim Ervin but his players gave him everything. There are positives there for him to take but Coleraine just had more strength in depth.\nFULL-TIME\nColeraine 2-1 Ballymena United\nTwo goals from Matthew Shevlin mean that Coleraine gain the first three points of the season.\nIt was a feisty and energetic derby with the home side dominating proceedings.\nCLOSE!\nColeraine 2-1 Ballymena United\nConor McKendry again looks dangerous down the wing but his strike is inches over the crossbar.\nCan either side find a goal in the final five minutes?\nPost\nColeraine 2-1 Ballymena United\nAndrew Scott plays a pass across the face of goal which Matthew Shevlin can't steer home at the back post.\nShevlin was the top goalscorer in the league last campaign and he certainly looks keen to defend that title this season!\n'Interesting to see what Ervin does'\nColeraine 2-1 Ballymena United\nPaul Leeman\nBBC Sport NI co-commentator\nColeraine have dominated since they equalised. Their three or four key players have got on top and been impressive. It will be interesting now to see what Ballymena boss Jim Ervin does in terms of making changes from his bench. They look like they are starting to throw a few more bodies forward.\nHITS THE WOODWORK\nColeraine 2-1 Ballymena United\nConor McKendry paces down the wing before passing to Lee Lynch who plays the ball to Jamie Glackin at the edge of the box with his resulting strike rattling the post.\nWhat a chance for the Bannsiders to make their lead more comfortable.\nWhat a move that was\nColeraine 2-1 Ballymena United\nIt's worth noting just how good the passing move for that second Coleraine goal was.\nFrom back to front and from left to right, it was really was dripping in quality.\nGOAL - Coleraine 2-1 Ballymena United\nMatthew Shevlin (61mins)\nMatthew Shevlin with his second of the evening!\nThe home side took the lead when Conor McKendry played an inch-perfect pass to Shevlin, who was left with a simple tap in which he made no mistake slotting home.\n'Excellent' McKendry looking sharp - Leeman\nColeraine 1-1 Ballymena United\nPaul Leeman\nBBC Sport NI co-commentator\nConor McKendry had a bit of a stop-start season last year but he has been excellent tonight for Coleraine. He has looked sharp and lively every time he has got on the ball, is comfortable off either side and Ballymena really can't afford to give him too much time on the ball.", "url": "https://www.bbc.com/sport/live/football/66365146"}