{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:29:19", "date_modify": "2025-05-20 14:29:19", "date_publish": "2023-07-29 00:00:00", "description": "Follow reaction as France beat Brazil at the Women's World Cup.", "filename": "sport_live_football_66176931_1747751359.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/164C0/production/_130582319_france4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_football_66176931_1747751359.html", "title": "Fifa Women's World Cup LIVE: Watch France vs Brazil score, commentary & updates from Group F game", "title_page": "Fifa Women's World Cup LIVE: Watch France vs Brazil score, commentary & updates from Group F game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Thanks and goodbye\nFT: France 2-1 Brazil\nThat's the end of this match, with Panama v Jamaica starting in 10 minutes.\nYou can follow updates from that one here.\nThanks for joining us and bye for now.\nRenard heads late winner as France beat Brazil - read the report\nFT: France 2-1 Brazil\nEmma Smith\nBBC Sport at Brisbane Stadium\nCaptain Wendie Renard headed a late winner as France beat Brazil in a thrilling game in Brisbane at the 2023 Fifa Women's World Cup.\nEugenie le Sommer put the French ahead after 17 minutes, before Debinha pulled Brazil level in the second half.\nBut Renard - who had been an injury doubt - headed in the decisive goal with seven minutes to go.\nThere was end to end action as two of the pre-tournament favourites delivered a game which lived up to expectations.\nBrazil would have qualified for the last 16 with victory but instead must wait until the final matchday to try to book a spot.\nPia Sundhage's side meet Jamaica in their final group match, while France take on Panama. Both games will be played on 2 August, kicking off at 11.00 BST.\nClick here to read the full report.\nPost\nFT: France 2-1 Brazil\nEmma Smith\nBBC Sport at Brisbane Stadium\nHerve Renard was absolutely livid at the award of that late free-kick and had to be restrained by his coaching staff.\nHe was screaming at everyone in the vicinity, including Pia Sundhage who looked like she gave a bit back.\nAt the end, he refused initially to shake hands with the Brazil staff, before eventually going to briefly do the courtesies.\nContrasting emotions\nFT: France 2-1 Brazil\nAndy Gray\nBBC Sport at Brisbane Stadium\nFrench players fall to their knees as the bench runs onto the pitch. That was a monumental effort.\nIn contrast, the Brazilians look dejected as the full-time whistle blows.\nYou wouldn't think it's only the second round of matches with those reactions, but that feels like a big, big win for this French side.", "url": "https://www.bbc.com/sport/live/football/66176931"}