{"authors": ["Richard Petrie", "www.facebook.com"], "date_download": "2025-05-20 13:03:53", "date_modify": "2025-05-20 13:03:53", "date_publish": "2023-08-01 09:12:36", "description": "BBC Sport NI assesses the prospects for the new Irish Premiership season, with the focus on the clubs who finished in the bottom half last time out, plus newly promoted Loughgall.", "filename": "sport_football_66348612_1747746233.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8D86/production/_130603263_splitbottomsix.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66348612_1747746233.html", "title": "Irish Premiership: Club-by-club guide to the new campaign - bottom half", "title_page": "Irish Premiership: Club-by-club guide to the new campaign - bottom half - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "With the introduction of full-time and hybrid professional set-ups at some Irish Premiership clubs in recent seasons, the gap between the top and bottom six of the league appears to be widening.\nInvestment by wealthy backers and the financial boost accrued from regular participation in European football have played a significant part in establishing a clearer division between the 'haves' and 'have nots' in the Northern Ireland domestic game.\nAs a result, the clubs who occupied positions in the bottom half of the table, plus promoted Loughgall, will be fancied to battle it out in the lower half once again.\nThe prize for seventh spot remains a ticket for the end-of-season European play-offs, and while that will be a realistic target for some, for others top flight survival and the avoidance of the promotion-relegation play-offs will be the priority.\nBBC Sport assesses the prospects for each of the five teams that came in seventh to 11th last term, plus Championship winners Loughgall, who are back in the top flight after a 16-year gap.\nGlenavon, seventh in the last campaign, will be searching for the consistency across the course of an entire season which could improve their top flight placing.\nManager Gary Hamilton looked to be under pressure at one stage of the last campaign after a very poor sequence of results but a dramatic upturn in fortunes saw the Lurgan Blues win seven and draw three of their last 10 league outings.\nThe loss of top scorer Matthew Fitzpatrick is a major blow to the Mourneview men but Hamilton has been busy in the transfer market with a number of new recruits to his panel.\nThe versatile Niall Quinn joins from Linfield, with Stephen Teggart, Bobby Deane, Tiernan Mulvenna, Andy Mooney, Jonny McCullough and Jackson Nesbitt also being drafted in.\nThe mid-Ulster team will hope to improve on some fairly dismal results in the knockout competitions in recent years, including an Irish Cup sixth round exit to H&W Welders and a League Cup round of 16 defeat by Loughgall in the season just passed.\nCarrick Rangers' strong start to the season ensured that they held on to secure eighth position despite a major dip in form in the latter stages of their campaign.\nThat placing represented further progress for the east Antrim club, who have firmly established themselves as a Premiership club under manager Stuart King.\nKing's new signings appear to be shrewd ones with veteran defender Albert Watson joining from neighbours and derby rivals Larne to add experience to the back four following the departure of Jim Ervin to become Ballymena manager.\nExperienced duo Joe Crowe and Danny Purkis both make the move from Glentoran.\nGoalkeeper Ben McCauley is another to join the Carrick squad, along with ex-Linfield and Crusaders midfielder Andrew Mitchell, who joins on a permanent basis after turning out for the club on loan last season.\nA second consecutive Irish Cup final appearance was the highlight for Ballymena United last season, albeit the end-of-season showpiece again ended in disappointment with a comprehensive defeat at the hands of Crusaders.\nTwo days after that loss, the Sky Blues parted company with manager David Jeffrey with former captain Jim Ervin subsequently being selected as his replacement.\nAs in recent seasons, the Braidmen's league form failed to scale any heights in 2022-23, as occasional victories over teams in the top six were interspersed with regular struggles against teams in the bottom half of the division.\nThe challenge for Ervin will be to try to arrest that mediocre form after a summer of flux on Warden Street.\nA number of players have left the club in recent months but striker Johnny McMurray returns for a second spell at the club and ex-Crusaders captain Colin Coates brings with him a wealth of experience after his move from Cliftonville.\nOther signings include another returnee, goalkeeper Sam Johnston, Alex Gawne, Donal Rocks, Caleb Crawford, Fiontan O'Boyle, TJ Murray and Marc Walsh.\nNewry City belied most pre-season predictions by taking 10th spot in the standings to avoid the drop and the end-of-season promotion-relegation play-off, retaining their Premiership status following their promotion from the Championship.\nThe county Down side avoided the delayed play-off which would have threatened their survival by edging out Dungannon Swifts on goal difference.\nGary Boyle takes his first steps into senior management after being named as the successor to long-serving former boss Darren Mullen, who announced his departure just before the season end after 10 years in charge.\nBoyle has expressed a desire to put his own stamp on the club, but also ensure a degree of continuity following the progress made during Mullen's tenure.\nThe new boss has been busy 'wheeling and dealing' in the transfer market, striker Adam Salley perhaps the headline of a number of additions which also include Ciaran O'Connor, Liam Bagnall, Adam Carroll, Barney McKeown, Lee Newell and Tom Murphy.\nLoughgall return to the Premiership for the first time since 2007 and will seek to emulate the achievement of Newry City by staying up for a second season in the top flight.\nWith a population of 283, the settlement is famously the smallest in Europe to have a team in a top division.\nThe Championship winners, who secured their elevation with two games to spare, have added to their ranks in the summer, including the arrival of striker and Dominican Republic international Alberto Balde from relegated Portadown.\nAmong manager Dean Smith's other acquisitions are former Warrenpoint Town defender James Carroll, Caolan McAleer from Ballinamallard United and ex-Institute player Oran Brogan from Dergview.\nThe club received a boost at the start of June with the news that Smith had agreed a new two-year deal to remain at the helm at Lakeview Park until 2026.\nSince taking the reins in 2016, Smith has guided the Villagers to an Irish Cup semi-final in 2018 and won the Mid Ulster Cup in 2020.", "url": "https://www.bbc.com/sport/football/66348612"}