{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-04-26 06:15:03", "date_modify": "2025-04-26 06:15:03", "date_publish": "2025-03-01 22:31:05", "description": "Manchester United manager Ruben Amorim says he and the club's board have a \"vision\" showing a \"clear path\" to a better future, on and off the pitch.", "filename": "sport_football_articles_cpq274xr283o_1745648103.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c0a9/live/c5101320-f6a0-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cpq274xr283o_1745648103.html", "title": "Manchester United boss Ruben Amorim says club on clear path to better future", "title_page": "Manchester United boss Ruben Amorim says club on clear path to better future - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Manchester United manager Ruben Amorim is convinced the club are on a clear path to a better future, on and off the pitch.\nIt has been another testing week at Old Trafford. After escaping with a draw despite a woeful first 70 minutes at Everton last Saturday, 48 hours later chief executive Omar Berrada was telling staff up to 200 jobs could go in a second round of redundancies.\nIt took a backs-to-the-wall second-half display against relegation-threatened Ipswich on Wednesday to claim a vital Premier League win after more defensive mistakes and Patrick Dorgu's red card threatened a sixth home defeat of Amorim's short reign.\nThe Portuguese says life is \"hard\" just now - but remains convinced better times lie ahead.\n\"I see a clear path, and I see that from the board also,\" he said in the build-up to Sunday's home FA Cup fifth-round tie against Fulham. \"They are also doing difficult changes.\n\"They are not popular but they are doing it because they have a vision. In the future we need to show some results. You can do a lot of changes but if you don't have results, people don't feel confident and happy.\n\"The good thing is we have a clear path. Now [it] is hard but we are doing things to achieve success in the future.\"\nUnited's inconsistency puts even more focus on the two cup competitions they remain in - they face Real Sociedad in the first leg of their Europa League last-16 tie on Thursday - as it appears increasingly likely winning one of them is the only way they will qualify for European football next season.\nThe issues he is facing are so extensive, Amorim could be forgiven for wishing he had stuck to his initial demand not to leave Sporting until the end of the season.\nHowever, he does think dealing with so many problems has made him a more rounded coach.\n\"Better [coach] is hard to say, because I am not winning games,\" he said. \"But in three months here, I live certain things that I think make me a more complete manager.\n\"Sometimes you need to lose and be in a poor situation to grow. I am not going to die if I lose three games in a row. I learned that here. I can cope and maintain my energy. I am learning a lot about myself and the players - but I prefer to win games.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cpq274xr283o"}