{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:48:56", "date_modify": "2025-05-21 04:48:56", "date_publish": "2025-04-06 00:00:00", "description": "Dundee United take a significant step towards a top-five Scottish Premiership finish and reignite their hopes of finishing third with victory over 10-man Hearts.", "filename": "sport_football_live_c2kvdlvz095t_1747802936.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c2kvdlvz095t_1747802936.html", "title": "Hearts vs Dundee United: Scottish Premiership", "title_page": "Hearts vs Dundee United: Scottish Premiership - report, reaction, stats & head-to-head - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ta-ta\nFT: Hearts 0-1 Dundee United\nA massive result for Jim Goodwin's Dundee United, who extend their lead over Hearts to eight points with six matches of the season remaining.\nHearts will be left to rue first-half wastefulness and James Wilson's red card, as they failed to secure a top-six spot.\nThey now go to Motherwell next weekend needing to win in order to avoid the possibility of dropping into the bottom half.\nPost\nFT: Hearts 0-1 Dundee United\nAllan Preston\nFormer Hearts and Dundee United defender on BBC Radio Scotland\nHe's got to remain positive because it's still in their hands. They were the better team before the red card.\nIt is a red card having seen it back. You don't get away with that nowadays.\nThey have to dust themselves down and go again against Motherwell.\nWilson will learn from 'naive' tackle - Critchley\nFT: Hearts 0-1 Dundee United\nHearts head coach Neil Critchley tells Premier Sports: \"That's the positive [top six is still in our hands].\n\"It’s a difficult one to take, but I thought we were the better team with 11 and arguably 10 players.\n\"I thought we created more opportunities and should have been leading the game. We gave Dalby one opportunity, and he scored from it\n\"The players showed great spirit.\n\"We were by far the better team until the [red card], but we weren’t good enough in front of goal, and when you have to defend with one less player, it becomes even more difficult.\n\"In the second half I don’t think you could tell they had 11 and we had 10. I thought it was an even game. Until they scored, I don’t think we were in any danger.\"\nOn James Wilson's red card, he adds: \"[He] mistimes it, but of a naive challenge. James is slightly late and a bit high, so he’ll learn from that.\"\n'All about getting results' - Goodwin\nFT: Hearts 0-1 Dundee United\nDundee United manager Jim Goodwin tells Premier Sports: \"I thought the game was very much in the balance as it had been in the previous two fixtures.\n\"I knew it was going to be a game decided on who defended the best and thankfully we did with another clean sheet. That’s back-to-back clean sheets for us.\n\"Disappointed with how we managed the game, especially in the second half.\n\"I don’t think we managed it well enough, but at the same time, I can’t be too critical of the players. At this stage of the season, it’s about getting results.\n\"It’s such a tough place to come with everything Hearts are still playing for. I’ve managed to do my old club St Mirren a slight turn as well today.\"\n'Dalby different class' - Docherty\nFT: Hearts 0-1 Dundee United\nDundee United midfielder Ross Docherty has also been talking to Premier Sports: \"To come away from home and get points at any stage is great in this league.\n\"[Sam Dalby has] been brilliant for us. Some of his finishes and headers are different class.\n\"They probably had the better of us until they went down to 10 men. It was about managing the game and we can be proud of the team as a whole.\"\nPost\nFT: Hearts 0-1 Dundee United\nDundee United match-winner and player of the match Sam Dalby tells Premier Sports: \"It's a matter of coming here and playing to our best and thankfully we got the win today.\n\"Seeing Trapanovski and Glenn [Middleton] coming on, you know there are going to be balls into the box and it's only a matter of time until I get on the end of one.\n\"[Luca Stephenson] came in with blood all over his socks so it must have been a bad one.\"\n'Jim Goodwin played it perfectly'\nFT: Hearts 0-1 Dundee United\nAllan Preston\nFormer Hearts and Dundee United defender on BBC Radio Scotland\nI think Jim Goodwin played it perfectly, I really do.\nHe changed the shape, Ross Graham dropped out in the warm-up, and he had to play a young boy.\nIn the second half, he got some wingers on, and you could see them grow in stature. Dalby's header was brilliant, and Craig Gordon was rooted to the spot.\n'Critchley yet to win a big game'\nFT: Hearts 0-1 Dundee United\nAllan Preston\nFormer Hearts and Dundee United defender on BBC Radio Scotland\nAgain, this just adds to the theory that Neil Critchley is still yet to win a big game.\nThis is a big game today to try and cement a top-six spot, and again they're not going to do it.\nWilson has been sent off, but that's part of football.\n'Absolute disgrace if Hearts miss top-six spot'\nHearts 0-1 Dundee United\nAllan Preston\nFormer Hearts and Dundee United defender on BBC Radio Scotland\nListen, if Hearts don't make the top six, it's an absolute disgrace with the money and everything that they've got, and the players they've got too.\nIt's simply not good enough for Hearts and there are simply no guarantees they will make it.\nIt sets it up brilliantly for the fans next weekend.", "url": "https://www.bbc.com/sport/football/live/c2kvdlvz095t"}