{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:31:20", "date_modify": "2025-05-21 07:31:20", "date_publish": "2025-03-28 17:01:13", "description": "Saracens boss Mark McCall says his team are \"hurting\" after the Harlequins loss but are looking to respond against Leicester Tigers on Sunday.", "filename": "sport_rugby-union_articles_c9dedg5zj7wo_1747812680.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1842/live/b716fd90-0bec-11f0-a325-a3a96822a2be.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c9dedg5zj7wo_1747812680.html", "title": "Leicester Tigers v Saracens: Maro Itoje starts again for Sarries", "title_page": "Leicester Tigers v Saracens: Maro Itoje starts again for Sarries - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Saracens director of rugby Mark McCall said the team are hurting after last week's defeat by Harlequins but are looking to bounce back against Leicester Tigers.\nHe described his side's performance in the second half against Quins as \"strangely subdued\" and \"disappointing\", as they gave up a 12-0 lead at the break to lose 23-12 at Tottenham Hotspur Stadium.\nSaracens lost the match despite starting England internationals Maro Itoje, Jamie George, Tom Willis and Elliot Daly, with the quartet all named to begin the match against Leicester.\nThe north London club are seventh in the Premiership table with six matches to play, but a victory on Sunday could move them up to fourth if other results go their way.\n\"A really disappointing, strangely subdued performance, when I watched it back,\" McCall told BBC Radio London.\n\"Everyone's hurting a little bit, of course, but the task this week is to try and turn that on its head.\n\"For some reason, and you're never quite sure [why], the team lacked their normal energy and that affected everything that we did in a negative way.\n\"We were a bit slower round the park in everything we did, and we have to face up to that and be better this weekend.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/c9dedg5zj7wo"}