{"authors": ["Phil Cartwright", "www.facebook.com"], "date_download": "2025-05-21 06:17:46", "date_modify": "2025-05-21 06:17:46", "date_publish": "2025-01-31 11:44:39", "description": "Enzo Maresca press conference: Chelsea vs West Ham", "filename": "sport_football_articles_cd7d44wnz8ro_1747808266.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8254/live/3cea8160-6de3-11ef-8c32-f3c2bc7494c6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cd7d44wnz8ro_1747808266.html", "title": "Enzo Maresca press conference: Chelsea vs West Ham", "title_page": "Enzo Maresca press conference: Chelsea vs West Ham - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The squad available to Maresca is the same as the one that took on Manchester City last weekend.\nOn if he has decided whether Robert Sanchez will start in goal: \"Not yet. We have two or three days and any decision I take, I feel good because every time Filip [Jorgensen] has played, he has done well.\"\nHowever, Maresca ruled out recalling Kepa Arrizabalaga from his loan spell at Bournemouth.\nOn potential incomings and outgoings before Monday's transfer deadline: \"I don't have any idea about the ones that can leave or arrive. Anything can happen. The main focus in the next 48 hours is the game. It is the most important thing.\"\nMaresca was asked if playing on the same day as the transfer deadline would affect his team selection: \"At the moment, we have many noises around players, but it's not just for us. I think if you ask Graham [Potter, West Ham boss] he's exactly the same. I don't know if they have some noises about players, but overall it's the same situation for all the clubs and the managers. The good thing is that Monday is the last day.\"\nOn if transfer rumours about his players during the transfer window have had an effect on the squad: \"100%. But not only us, other teams, because they are human beings. Even if they say they are professional and focused, if they are talking about you and different clubs, probably the focus is not 100%.\"\nOn bouncing back from defeat at Manchester City: \"We need a response. We need a good performance to try to win the game, but not because it's after the City game - it's because we try to always do the same. It would be a good moment to get three points, especially at home.\"\nOn Chelsea's poor run of results: \"In all the games, we've had chances to score. We've struggled with results but the performances have been there. In some games, the performance has not been there for 95-100 minutes, which you need. The big difference in the past games has been inside the box. We've conceded goals we can avoid and not scored goals that in different moments we will score.\"", "url": "https://www.bbc.com/sport/football/articles/cd7d44wnz8ro"}