{"authors": ["Tom English", "www.facebook.com"], "date_download": "2025-05-21 03:53:44", "date_modify": "2025-05-21 03:53:44", "date_publish": "2025-02-09 17:12:17", "description": "Ireland keep their Six Nations Grand Slam hopes firmly on track with an 11th victory in a row over a disappointing Scotland at Murrayfield.", "filename": "sport_rugby-union_articles_c30dy55d06go_1747799624.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f307/live/fae57c80-e6fe-11ef-a819-277e390a7a08.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c30dy55d06go_1747799624.html", "title": "Six Nations 2025: Scotland 18-32 Ireland", "title_page": "Six Nations 2025: Scotland 18-32 Ireland - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ireland kept their Six Nations Grand Slam hopes firmly on track with an 11th victory in a row over a disappointing Scotland at Murrayfield.\nThe visitors blew away their hosts when speeding into a 17-0 lead with tries from Calvin Nash and captain Caelan Doris, both converted by Sam Prendergast, who also added a penalty.\nScotland's nightmare was made worse when Finn Russell and Darcy Graham collided early in the second quarter and both were removed from the contest, the wing being stretchered off after lengthy treatment on the pitch.\nDuhan van der Merwe's spectacular finish at the end of the opening half gave Scotland some respite, and hopes grew when Blair Kinghorn added two penalties early in the second half.\nIreland were ruthless from there, though. They were utterly dominant. James Lowe and Jack Conan scored within seven minutes of each other approaching the hour.\nThe excellent, and stress-free, Prendergast added another three-pointer before Ben White scored a consolation, which was no consolation at all to the overwhelmed Scots.\nHaving lost 10 in a row against Ireland, the hosts needed the start of their dreams. What they got was the beginning of their nightmare.\nThe aerial battle was always going to be important and Ireland dominated it. The collisions were always going to be key and Ireland won most of those, too.\nScotland needed to build a lead and plant doubt in Irish heads, but they conceded first and only their defence and some good fortune stopped them from conceding again in quick order.\nFrom the get-go, it was all Ireland. Waves and waves of green feeding off Scottish inaccuracy. Before Nash scored the visitors had been banging on the door for minutes. Scotland hung on until they could hang on no longer.\nPlaying another penalty advantage, Prendergast whipped a long pass out to Nash, who had kept his width. In his splendid isolation, the Munster wing scored easily. Prendergast made it 7-0. So much for Scottish fire and brimstone.\nIreland's lineout was a bit of a mess but it didn't matter. They were streets ahead for much of the day. Their breakdown was routing Scotland, who were pedestrian at best.\nEarly in the second quarter, Ireland kicked on again with purpose.\nIt followed Kinghorn, having a deeply unpleasant time, getting charged down and, when Robbie Henshaw hacked it downfield, there was a chase for the loose ball between Nash and Van der Merwe.\nThe men collided and the ball went dead, but had the Scot deliberately played his opposite number? Was this a penalty try? No, said the officials. Nash wouldn't have touched down had there been no collision, but it was mightily close.\nVan der Merwe still got binned for taking Nash out of the action. Cue more Irish heat.\nThey got held up over the Scottish line once and then twice. Some defensive resistance was all the Scots had, but even then they didn't have it for long.\nA difficult day became a nightmarish one early in the second quarter when Russell and Graham ran into each other in their desperation to halt Jamison Gibson Park and took themselves out of the game.\nRussell did not reappear after an HIA and Graham was taken away on a stretcher. Two critical operators, gone. And then three more points for Prendergast to boot.\nOne way traffic. And it carried on beyond the half hour when Ireland got just reward for all their pressure, Gibson-Park putting Doris over in the corner. Prendergast added the conversion - 17-0 Ireland.\nThe visitors were winning with more ease than anybody had imagined.\nHope arrived at the end of the half for Scotland when, having coughed up a lineout close to the Irish line, they went again, ran direct through Jack Dempsey and then found the holy grail of fast ruck ball and accurate hands.\nHuw Jones fed McDowall, who slipped it out the side door to Van der Merwe. His finish was sensational.\nThere was a further sliver of optimism early in the new half. A solid start brought a Scotland penalty. Kinghorn banged it over. A nine-point game now.\nStill a mountain to climb, but there was an edge to the Scots now that wasn't there before.\nKinghorn launched an attack from deep and Ireland scrambled. Henshaw came within a whisker of being done for a deliberate knock-on, a yellow card and possibly a penalty try, but like Van der Merwe, he escaped.\nBack we came for penalty advantage and Kinghorn narrowed the gap to six from in front of the posts. Eleven unanswered points and expectations rising at Murrayfield.\nIreland were having none of Scotland's revival, though. In seven minutes leading up to the hour they struck out and settled the contest once and for all.\nIt was Lowe who finished it after Scotland were dragged right and left. The wing stepped around Kinghorn who had come barrelling out of the line and went over.\nPrendergast's conversion made it 24-11 and soon after Gibson-Park took advantage of a woefully flat Scotland defence when dinking a kick over the top.\nWith nobody in the backfield, Ireland didn't have a massively difficult job in putting Conan over for the bonus point try.\nThere was that Prendergast penalty and the White try to come, but they were academic.\nIreland march on with serious intent while Scotland are shunted back into wearily familiar territory.\nScotland head coach Gregor Townsend: \"When they had the ball, they scored. The yellow card made it tough for us to get back in the game. Then the injuries disrupted things.\n\"I felt the players were building back into the game, but once Ireland got back into our 22 they showed how clinical they are. When you are behind on the scoreboard against a quality side, you need to make sure they don't get more opportunities.\n\"We'll get learnings. Accuracy would be the number one thing.\"\nIreland interim head coach Simon Easterby: \"We did what we set out to do in the game. We started strongly and limited Scotland to a few opportunities in the first half.\n\"We were good at not giving their individuals opportunities. They were hamstrung by injuries to Finn Russell and Darcy Graham, but we delivered an intent to attack in the right way.\n\"I thought Sam Prendergast put us in the right areas more often than not and that is what you need. We managed the game well throughout.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/c30dy55d06go"}