{"authors": ["Shamoon Hafez", "www.facebook.com"], "date_download": "2025-05-21 07:26:02", "date_modify": "2025-05-21 07:26:02", "date_publish": "2025-05-20 22:42:56", "description": "Kevin de Bruyne bid an emotional send-off from Etihad Stadium for the final time on Tuesday night - and the moment even brought Pep Guardiola to tears.", "filename": "sport_football_articles_c2011dze78xo_1747812362.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/093d/live/0d641e60-35c5-11f0-96c3-cf669419a2b0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c2011dze78xo_1747812362.html", "title": "Kevin de Bruyne: Man City 'genius' bids farewell at Etihad Stadium", "title_page": "Kevin de Bruyne: Man City 'genius' bids farewell at Etihad Stadium - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Kevin de Bruyne received an emotional farewell at Etihad Stadium for the final time on Tuesday night - and the moment even brought manager Pep Guardiola to tears, who called it a \"sad day\".\nThe 33-year-old will go down as a Manchester City legend and proclaimed he will \"always be here\" after the announcement that a statue will be built, external in his honour outside the stadium.\nCaptain De Bruyne is set to depart this summer and started his last home game in City's 3-1 victory over Bournemouth, but the Premier League great bowed out in a somewhat abject manner.\nHe had the chance to go out in style but missed a first-half sitter and was then sacrificed in the second half after Mateo Kovacic's sending off - a sad ending for such an illustrious career.\nDe Bruyne said in his post-match speech: \"I wanted to play with creativity, I wanted to play with passion. I wanted to enjoy football and I hope everyone enjoyed it.\n\"Everybody has pushed me so hard inside and outside the club to be the best version of myself and these guys in front of me have made me better than I was before.\n\"It's an honour to play with these guys. I've made so many friends for life.\"\nThe decade-long association has produced unprecedented success for City, while the player has etched himself into the club's history books by taking home an incredible 16 winners' medals during that period.\nOnce the full-time whistle was blown, nothing was going to spoil his grand send-off as City players, staff and supporters paid tribute to their midfield maestro.\nGuardiola said: \"Everybody saw how much the people from Manchester City are connected with him and his family and how much love [they have].\n\"Titles are nice and everything that he has achieved, but when you leave after 10 years with this much respect and gratitude, there is nothing else better than that.\n\"I am part of that, the club will take the decision, but it is a sad day and he will be missed, there is no doubt about that.\"\nGuardiola added: \"When Kevin arrived here, I am pretty sure he was not a Man City fan, I don't know who he supports, but I am pretty sure he is a fan now and will be forever.\n\"That is because of the connection between all the people and him.\"\nOn a night when 'The Boss' rolled into town, 'The King' waved goodbye for the final time.\nDe Bruyne's face was plastered everywhere you looked on arrival at the stadium and although legendary US singer Bruce Springsteen may have been playing a few yards away at the Co-Op Live arena, this was the hottest ticket of the day.\nMerchandise stalls had scarves emblazoned with De Bruyne's name, as did the shirts of supporters, while the matchday programme has a mock-up of the player with the crown from the Premier League trophy atop his head.\nCity had announced in the lead-up to kick-off that they had dedicated a mosaic and named a road after De Bruyne at the club's academy.\nIt was also fitting that a playmaker that has created such artistry on the grass canvass has had a huge mural painted of him in Manchester's Northern Quarter.\nOnce chants of \"ohh Kevin De Bruyne\" to Seven Nations Army died down, there was a buzz of anticipation each time he had his foot on the ball, willing him to showcase a goal or assist for one last time on their turf.\nThe big moment could not have been planned any better - the ball laid to him on a plate, in front of an open goal, a couple of yards out, but De Bruyne in slow motion scooped the ball onto the bar.\nThe 33-year-old had his head in his hands, so did the returning Rodri on the bench and City fans all around as the dream finale went awry.\n\"It's terrible,\" De Bruyne said of the miss. \"There's no excuses. My son is going to be very tough on me today.\"\nAt full-time, a montage of his best moments over the past decade flashed up on the screen with messages from the likes of Sergio Aguero, Vincent Kompany, Raheem Sterling and Pablo Zabaleta.\nDe Bruyne was given a guard of honour as he returned to the pitch with his wife and kids by his side.\nThen came the outpouring of emotion.\nThe former Chelsea man struggled to hold it together during his speech in the middle of the park, as did a tearful Guardiola watching on from the sidelines.\n\"We want you to stay, Kevin de Bruyne, we want you to stay,\" was the chant that rung out from supporters but there appears to be no turning back, as he led his team-mates on a lap of appreciation before making an exit for one last time.\nFormer City defender Micah Richards said: \"He lets his football do the talking. He's such a shy character but I have been meeting him over the years and seeing how humble he is and how great a player he is, it is just great to see.\n\"He has deserved his send-off. Everyone who's played with him speaks highly of him, and to do what he's one in the Premier League is just sensational.\"\nDe Bruyne has made it clear he is not abdicating his throne by his own choice, saying he was surprised not to be offered a new contract by the club.\nWhile his next move could be to Chicago Fire in the US, attention will soon turn to the difficult task of finding a replacement.\nBBC Sport understands City are withdrawing their initial interest in Bayer Leverkusen's Florian Wirtz, owing to the soaring costs of any deal, but Nottingham Forest's Morgan Gibbs-White is among the options.\nCity, though, have two players at the club in Phil Foden and Jack Grealish that have played a bit-part role this term and could provide the answer if they can rediscover their form.\n\"He [De Bruyne] is irreplaceable,\" said Richards. \"I have been disappointed with Phil Foden, but he needs to step up now.\n\"There is a vacancy available and this is Foden's time.\"\nDe Bruyne added: \"To do what we've done as a club, supporters, teammates we've won everything.\n\"We made the city, the club bigger and now they're going to take over.\"", "url": "https://www.bbc.com/sport/football/articles/c2011dze78xo"}