{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:52:53", "date_modify": "2025-05-21 05:52:53", "date_publish": "2025-04-02 08:36:46", "description": "Man City vs Leicester: Pep Guardiola on fan protests", "filename": "sport_football_articles_c1k4nnn2d1ro_1747806773.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6332/live/feb75a00-0f98-11f0-b696-d3bfdfb825fc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c1k4nnn2d1ro_1747806773.html", "title": "Man City vs Leicester: Pep Guardiola on fan protests", "title_page": "Man City vs Leicester: Pep Guardiola on fan protests - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "\"Of course\" Manchester City supporters can \"legitimately express their concerns and feelings with the club\", says Pep Guardiola.\nThree supporters groups - 1894, Trade Union Blues and MCFC Fans Foodbank - have urged fellow fans to boycott the first nine minutes of Wednesday's home game with Leicester to protest the club's new agreement with resale platform Viagogo over hospitality tickets.\nThe partnership with Viagogo partnership is the ninth City have entered into in relation to ticket reselling with fans concerned about the possibility of over-inflated pricing.\n\"Of course I have sympathy,\" said Guardiola. \"When the fans can express good moments or bad moments or feelings, it's because the team and the club is alive. The worst is when you cannot express that.\n\"I don't know specifically [this issue], but football clubs belong to the people and if the people don't agree with something they can legitimately express concerns with the club. And the club is open, listening to them, arriving in agreement so everybody can be satisfied.\n\"The club has to be active in many departments in the decisions being made and has to take them for the benefit of the club, but the club doesn't take it [the support] for granted.\"\nAfter an uncharacteristically inconsistent season, City are locked in a race for Champions League qualification and Guardiola says the team must rely on supporters more than ever despite the protests.\n\"All I can say is that we need them,\" he added. \"Since minute one, we need them. We need them desperately to achieve our success to be in the Champions League again.\n\"Imagine going to the stadium with no fans, it would make no sense. Our job would make no sense. They applauded when we won and they boo when they are dissatisfied with our performance.\n\"Of course they can legitimately express their concerns and feelings with the club. The club will listen to them and try to arrive in an agreement.\"", "url": "https://www.bbc.com/sport/football/articles/c1k4nnn2d1ro"}