{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-05-21 05:43:50", "date_modify": "2025-05-21 05:43:50", "date_publish": "2025-04-02 22:57:07", "description": "An emotional Jack Grealish dedicates his first Premier League goal in almost 16 months to his younger brother Keelan on the 25th anniversary of his death.", "filename": "sport_football_articles_ckg2zqleqe0o_1747806230.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c554/live/a129adb0-101b-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ckg2zqleqe0o_1747806230.html", "title": "Jack Grealish: Man City midfielder dedicates goal to brother Keelan, who died 25 years ago", "title_page": "Jack Grealish: Man City midfielder dedicates goal to brother Keelan, who died 25 years ago - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "An emotional Jack Grealish dedicated his first Premier League goal in almost 16 months to his younger brother Keelan on the 25th anniversary of his death.\nOn his first league start since December, the Manchester City midfielder scored a second-minute opener in the 2-0 win against Leicester at Etihad Stadium.\nAs he celebrated, it seemed Grealish was simply happy at marking a rare start with an even rarer league goal, ending a long wait since the 2-2 draw with Crystal Palace on 16 December 2023.\nIt was only after the final whistle he revealed the poignant family anniversary he was marking.\nGrealish was four years of age when brother Keelan died in April 2000, aged just nine months due to Sudden Infant Death Syndrome (SIDS).\nThe England midfielder spoke about the anniversary of Keelan's death when talking to BBC Sport after the game.\n\"My little brother passed away 25 years ago today,\" he said. \"This day is hard on the family.\n\"My mum and dad were here, so to score and to win was brilliant.\"\nGrealish later paid a tribute on Instagram, external, writing: \"With me always especially this day ... that was for you Keelan.\"\nCity manager Pep Guardiola said he was unaware of the anniversary but paid tribute to Grealish's compassionate nature. The 29-year-old has a sister, Holly, 21, who has cerebral palsy.\n\"Jack is an incredible human being,\" said Guardiola. \"He is incredibly generous.\n\"I didn't know that and I can't imagine how tough it can be with mum and dad and sister. It is good they remember him, this day. I am sure they remember him every single day. But it is good to score.\"\nIt remains to be seen whether Grealish's selection in the number 10 role was because Guardiola was resting key players - such as Phil Foden and Kevin de Bruyne - for Sunday's Manchester derby at Old Trafford when City will look to avenge United's victory at the Etihad in December.\nHowever, this was a useful opportunity for Grealish to push his claims for a regular starting spot in a team that has misfired badly this season and is now facing at least five weeks without its main goal threat in Erling Haaland, who is injured.\nThe belief is that Grealish, who has two years left on his contract, will decide his future in the summer as Guardiola prepares for another extensive recruitment campaign, potentially either side of the Club World Cup in June and July.\nGuardiola did not feel Grealish played at the same level against Leicester in the number 10 position as he did in his usual left-side role against Championship strugglers Plymouth in the FA Cup fifth round last month.\n\"He is comfortable playing on the side but he likes to play in the middle because he used to play free,\" said the City boss. \"He has ability to control the ball and pass between the lines.\n\"I know it is not easy when you don't play regularly. He was really good against Plymouth, much better than today, but I am happy for him. It is not easy for the people in the middle when they defend low.\"", "url": "https://www.bbc.com/sport/football/articles/ckg2zqleqe0o"}