{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:08:23", "date_modify": "2025-05-19 15:08:23", "date_publish": "2015-03-04 09:24:55", "description": "Sunderland boss Gus Poyet describes the day on which his player Adam Johnson was arrested as one of his toughest.", "filename": "sport_football_31725252_1747667303.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81398000/jpg/_81398051_adamjohnson.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31725252_1747667303.html", "title": "Adam Johnson: Sunderland boss Gus Poyet tells of 'difficult day'", "title_page": "Adam Johnson: Sunderland boss Gus Poyet tells of 'difficult day' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Sunderland manager Gus Poyet has described the day on which his player Adam Johnson was arrested as one of the most difficult in his career.\nJohnson, 27, was arrested on Monday on suspicion of having sexual activity with a 15-year-old girl and later bailed after questioning by police.\nPoyet said: \"It was a very difficult day yesterday. I never had one like that, very difficult.\"\nJohnson has been suspended by his club pending the investigation's outcome.\nJohnson, who has also represented Middlesbrough, Manchester City and England during his career, was arrested before he was scheduled to travel with Sunderland to Hull for Tuesday's Premier League fixture, which ended in a 1-1 draw.\nPoyet subsequently had a bust-up with Hull City boss Steve Bruce during the game.\nThe Sunderland boss was sent off during the match for kicking a drinks holder in reaction to midfielder Jack Rodwell's yellow card and also exchanged words with Bruce.\nBruce later described the confrontation with Poyet as \"grown men acting like children\".\nA spokesman said the Football Association was awaiting the referee's report before deciding if any action would be taken against either manager.", "url": "https://www.bbc.com/sport/football/31725252"}