{"authors": ["Gareth Vincent", "www.facebook.com"], "date_download": "2025-05-20 13:25:59", "date_modify": "2025-05-20 13:25:59", "date_publish": "2023-08-02 05:07:50", "description": "Following Russell Martin's summer exit, Michael Duff has the chance to prove himself as a Championship boss at Swansea City.", "filename": "sport_football_66338925_1747747559.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3F77/production/_130574261_gettyimages-1562582441.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66338925_1747747559.html", "title": "Swansea City 2023-24 Championship season preview: Michael Duff looks to make his mark", "title_page": "Swansea City 2023-24 Championship season preview: Michael Duff looks to make his mark - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Five years since Swansea City's stint as a Premier League club came to an end, Michael Duff has become the fourth boss to take on the challenge of leading the Welsh club back to the highest level.\nHis three predecessors have all won praise for their work at Swansea, yet none has achieved the ultimate goal of promotion from the Championship.\nGraham Potter was only around for the first season after Swansea's relegation.\nA 10th-placed finish in the second tier - and a return to the sort of attractive style of play which the Swans went away from in their latter top-flight days - was enough to convince Brighton to hand Potter a Premier League chance.\nSteve Cooper then reached the play-offs in each of his two seasons at the helm, a return which earned him the Nottingham Forest job and ultimately, a crack at the top division.\nRussell Martin's tenure was less successful in terms of league position, with the former Scotland defender leading Swansea to 15th in 2021-22 and 10th last season.\nBut Martin's style caught the eye of others, particularly given Swansea's increasingly limited budget.\nAs a result he was named Southampton manager over the summer, and Swansea have turned to former Cheltenham and Barnsley boss Duff.\nThe last campaign was a strange one for Swansea, who finished only three points outside the play-off places thanks to a springtime surge up the table.\nA year earlier, they had finished 14 points adrift of the top six.\nYet despite that progress, there was a feeling of what might have been for Swansea given the boom-bust nature of their season, with a fine start and sparkling finish sandwiching a post-World Cup slump which ultimately cost them a play-off chance.\nThat long dip in form coincided, in part, with a desperate mid-season transfer window in which Swansea did not sign a player.\nThe January failings had an impact on Martin, whose relationship with the club's American owners was never the same again.\nThough there was talk of Martin being offered a new contract right up until the end of the campaign, it looks with hindsight as if his exit was a distinct possibility from the moment he brought his entire backroom team into a press conference and criticised the club's approach in the transfer market.\nMartin's Swansea were easy on the eye and a consistent attacking threat - only three teams scored more Championship goals last season - but were too often held back by defensive frailties.\nAt this stage, it is a difficult question to answer.\nDuff says he wants to play attractive football, but it seems unlikely he will follow Martin in being totally committed to a possession game.\nHow long it takes Matt Grimes and company to adapt to Duff's approach will go a long way to deciding how they fare this season.\nSo too, as ever, will the club's work in the transfer market.\nUncertainty continues to surround the future of Joel Piroe, Swansea's leading scorer in the last two seasons, who has only a year to run on his contract and has been linked with - among others - Everton, Leeds United and Leicester City.\n\"I don't think you ever feel ready - from my point of view I'd like another seven or eight weeks of getting more information and more work.\n\"We are still learning, still trying to adapt, still trying to implement new things. It is what it is. The players are ready physically.\n\"There are 24 teams in the league who will all think they have a chance of getting promoted. We are one of them.\"", "url": "https://www.bbc.com/sport/football/66338925"}