{"authors": ["Ged Scott", "www.facebook.com"], "date_download": "2025-04-26 03:49:03", "date_modify": "2025-04-26 03:49:03", "date_publish": "2025-03-05 14:00:05", "description": "Birmingham City boss Chris Davies is hopeful that keeper Ryan Allsop and wing-back Ethan Laird are not sidelined for long.", "filename": "sport_football_articles_cvg547wnng1o_1745639343.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/30b9/live/ff93c9c0-f9bf-11ef-896e-d7e7fb1719a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cvg547wnng1o_1745639343.html", "title": "Birmingham City: Blues boss hopeful on Allsop and Laird injuries", "title_page": "Birmingham City: Blues boss hopeful on Allsop and Laird injuries - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Birmingham City boss Chris Davies is hopeful that first-choice goalkeeper Ryan Allsop and influential wing-back Ethan Laird will not be sidelined for long by injury.\nBoth missed Blues' 3-1 defeat at Bolton - only the leaders' third loss in 33 League One games this season - after limping out of Saturday's key 1-0 win over second-placed Wycombe Wanderers.\n\"It will be a few games,\" said Davies. \"But they are not six-weekers.\n\"A week or two with both of them is what we're looking at.\"\nBlues are helped by the fact that the next international break is only three games away on 22 March, when they have a scheduled trip to Stevenage - and both players should be back well before the EFL Trophy final with Peterborough United on 13 April.\nDavies labelled Tuesday's low-par performance at the Toughsheet Community Stadium as \"uncharacteristic\", after losing in the league for the first time since the 3- 2 reverse at Gareth Ainsworth's bottom club Shrewsbury Town on 23 November.\nBut he absolved stand-in keeper Bailey Peacock-Farrell for the game-turning Bolton equaliser just before the break.\n\"We were disappointed to concede just before half-time,\" Davies told BBC Radio WM. \"The first goal has gone hard and low. Sometimes it can creep in there.\n\"There were no major issues with Bailey. It's not easy coming in out of the cold and into the team. His kicking was generally good and he has already proved he can be a good goalkeeper for us and an important part of our squad.\n\"The goal gave them a real lift and belief they didn't have before. They started the second half better than us. We were soft with the second goal and it was an uncharacteristically poor third goal from our point of view.\n\"That gave us a mountain to climb and we didn't look like climbing that mountain. You could see there were a few not quite themselves. Up until this point they've coped well but some looked jaded.\n\"Aside from the pain of defeat there is an acknowledgement from me what the guys have done for the last 18 games to go unbeaten. And they are hurting.\"\nBlues, still unbeaten in the league at St Andrew's since April last year, still have a healthy nine-point advantage and a game in hand over second-placed Wycombe - and they now have successive home matches, starting with Lincoln City on Saturday, then Steve Evans' Stevenage next Tuesday.", "url": "https://www.bbc.co.uk/sport/football/articles/cvg547wnng1o"}