{"authors": ["Andy Burke", "www.facebook.com"], "date_download": "2025-05-21 06:27:08", "date_modify": "2025-05-21 06:27:08", "date_publish": "2025-01-22 21:04:10", "description": "Scotlnd's Fergus Burke keen to learn from 'world's best' Finn Russell", "filename": "sport_articles_c805kg919glo_1747808828.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/de68/live/fbe82790-d8e9-11ef-96e3-7ddb8edc83e8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c805kg919glo_1747808828.html", "title": "Scotlnd's Fergus Burke keen to learn from 'world's best' Finn Russell", "title_page": "Scotlnd's Fergus Burke keen to learn from 'world's best' Finn Russell - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Fergus Burke says he wants to use his Scotland call-up to learn from Finn Russell, whom he considers to be one of the world's top fly-halves.\nThe Saracens playmaker was called into Gregor Townsend's squad for the first time for the upcoming Six Nations.\nNew Zealand-born Burke also qualifies for England but opted for Scotland and says the opportunity to work alongside Russell was a factor in his decision.\n\"Finn's probably one of the best 10s, if not the best 10 in the world at the moment,\" Burke told the BBC's Scotland Rugby Podcast.\n\"To be in the same environment as him is invaluable for my development and being able to pick his brain.\n\"He obviously plays a little bit different to anyone that I've been in an environment with before, so it's going to be invaluable learning the way he does it and different pictures he's looking for, so it's cool.\"\nBurke says conversations with established Scotland internationals at Saracens helped convince him his Test ambitions are best served with Townsend's side.\n\"Having conversations with the likes of Andy Christie and Sean Maitland at Saracens around the culture, everyone's just encouraged to be themselves,\" the 25-year-old added.\n\"There's no egos and you're backed. Combined with the style of footie, the shapes that we've run on attack, the way we attack, I just feel like it was suited to my style and I'm excited about it.\"", "url": "https://www.bbc.com/sport/articles/c805kg919glo"}