{"authors": ["Andrew Aloia", "www.facebook.com"], "date_download": "2025-05-21 06:38:46", "date_modify": "2025-05-21 06:38:46", "date_publish": "2025-01-31 10:10:29", "description": "BBC Sport looks at the dire run of form that has Derby County in the Championship relegation spots and in a battle to avoid the drop.", "filename": "sport_football_articles_czep8g9n30yo_1747809526.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6fcd/live/32ad46f0-df27-11ef-a819-277e390a7a08.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_czep8g9n30yo_1747809526.html", "title": "Paul Warne: Derby County boss defiant but concern builds amid dire Rams run", "title_page": "Paul Warne: Derby County boss defiant but concern builds amid dire Rams run - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "When head coach Paul Warne sat with Derby County's board this week he did not seek assurances about his future.\nWith the Rams on one of the worst losing runs in their 141-year history, in the Championship relegation zone, dealing with mounting injury problems and embroiled in a tug-of-war to try to keep defensive lynchpin Eiran Cashin, Warne knows what pressure there is on his job.\n\"I don't need their reassurance, in the nicest possible sense, because I'm a big boy,\" Warne told BBC Radio Derby.\n\"I understand the position we are in and I understand the league form we are in - I understand everything.\n\"I don't expect someone to say to me, 'it doesn't matter about results you will be here for the next two years' because I'm well aware of how football is and my job is just to pick my staff up and to pick my team up and send them out willing for Saturday.\"\nOn Saturday, the Rams face second-placed Sheffield United, a team 20 places and 31 points above them in the table.\nIf beaten by the Blades, it will be a seventh-straight league loss and worst run for 17 years.\nThey have twice lost seven consecutive league matches across one campaign in the past 23 years, and both contributed to their top-flight relegation - first in 2002 and again in 2008 when they went down with the smallest points tally ever amassed in Premier League history (11).\nThey have twice lost a club-record eight successive league matches in a single season and survived both times - first by being re-elected to the Football League after finishing bottom of the table in the inaugural season in 1888-89 and by managing to recover to finish 15th in the top flight in 1988.\nWhen Derby returned to the Championship this season - a division they dropped out of in 2022 when in administration - the aim was simply to survive.\nFor Warne, it is a feat he has failed to achieve in management, with his three previous promotions from League One as Rotherham United boss coupled with three Championship relegations with the South Yorkshire club.\nEric Steele, a former Rams goalkeeper, who has worked as a coach at Derby as well as Manchester United, says he fears for Derby's ability to avoid an immediate return to League One.\n\"That league table does not lie,\" Steele told BBC East Midlands Today.\n\"Derby fans, and every one associated with the club, will be concerned because at the moment we are on a bit of a spiral and, with the two fixtures coming up [against Sheffield United and Norwich], they have to turn it around really quickly.\"\nSteele says what happens over the weekend and in the final days of the transfer window - one in which Brighton are pushing hard to sign centre-back Cashin when defensive partner Curtis Nelson has just been ruled out for the season - will be critical.\nCentre-back Matt Clarke - a player with previous experiences of surviving a relegation battle at Derby - has been recruited for a third spell with the Rams, while Norwegian striker Lars-Jorgen Salvesen has been quick to make an impression with one goal in two games so far.\n\"In the next two or three days there is going to be patience and impatience,\" Steele said.\n\"Patience on behalf of owner David Clowes with the manager and what he wants to do, and certainly there is a massive impatience among the fans to Paul Warne's record in the Championship - which you can understand.\n\"If in the next two or three days there are more signings made, that means Paul Warne has been entrusted and says, 'right, we have backed you and you have now got the next four months to keep us in this division'. And that really must be the aim.\"\nWith 17 games remaining, Steele insists \"there is still time\" for the Rams to escape danger.\nThey are third from bottom and one place adrift of safety, although the three teams above them in the table - Hull, Stoke and Portsmouth - are just two points better off.\nDerby's slide down the standings, coupled with their FA Cup exit against League One Leyton Orient, has stoked frustration among supporters, with the boos, directed at Warne and his players, particularly loud after their 2-0 home defeat by Watford - a game in which the Rams hit the woodwork three times.\n\"We do need to pick up points and pick up wins and I don't want - and I don't think this will be the case - the fans to turn on the players because the players need them more than ever,\" Warne said.\n\"But I do understand the disappointment, I know I have to answer questions, I do get it.\n\"I have looked at the league table, I do get on the team bus, I do go into the dressing room after games when players are disappointed, I do see how hard they train, I do see how academic they are in team meetings, I do see everything.\n\"Everyone is doing everything they can to try turn around this poor form.\"\nDerby's restoration as a Championship side was an almost romantic achievement for a club that had been a week from financial ruin when they were last there.\nRams owner Clowes has spent nowhere near the club record-breaking outlays made by previous stakeholders - those who led the Rams to the near ruin - trying to get Derby to the Premier League.\nWarne has previously describe his side as a \"League One team with a bit of sugar on top\" - a comment that was met with widespread annoyance among supporters.\nHis side, Warne insists, is better than the relegation places they find themselves in.\n\"I think at our very best, with our best 11, we are mid-table. That is what I think at our best and it will probably go viral me saying it,\" he said.\n\"At our best we are not not a bottom three team - it's fair to say that and no-one can argue with me on that. We have only been in the bottom three for a week, so it's not like we have been in there all year and we are struggling to get out.\"\nThe run of defeats that have plunged Derby into the drop zone for the first time this season has also been somewhat of a luckless one.\nSeason-ending injuries to Nelson and forward Dajaune Brown have come alongside setbacks for Corey Blackett-Taylor and Kane Wilson in recent recent weeks, while influential pairing David Ozoh and Ryan Nyambe have been out for months and only now returning to action.\n\"It's difficult for me to talk about luck,\" Warne said. \"I do think that we have been in virtually every game, but you don't get three points for a win, two for a draw and one for a pretty good effort.\n\"I don't want the dressing room feeling they are unlucky - you have to earn your luck. You take you chances because you are brave enough to shoot or brave enough to tackle last minute, so we are in control of our destiny.\n\"You have 46 games to collet 50-plus points and if you don't, then that is on you and you have to own that.\n\"I can't walk around with a t-shirt saying 'Derby manager but we were very unlucky' in brackets.\n\"You have to own it and try to improve on what you are not as good at - then you give yourself the best chance.\"", "url": "https://www.bbc.com/sport/football/articles/czep8g9n30yo"}