{"authors": ["Mandeep Sanghera", "www.facebook.com"], "date_download": "2025-05-20 13:42:06", "date_modify": "2025-05-20 13:42:06", "date_publish": "2023-08-01 13:28:45", "description": "Liverpool manager Jurgen Klopp says it is \"not helpful\" that the transfer window in Saudi Arabia is open for significantly longer than in Europe.", "filename": "sport_football_66370013_1747748526.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/EE20/production/_130606906_jklopp.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66370013_1747748526.html", "title": "Liverpool boss Jurgen Klopp concerned by transfer window closing so late in Saudi Arabia", "title_page": "Liverpool boss Jurgen Klopp concerned by transfer window closing so late in Saudi Arabia - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Liverpool manager Jurgen Klopp says it is \"not helpful\" that the transfer window is open nearly three weeks longer in Saudi Arabia than in Europe.\nThe transfer deadline in Europe's top leagues is on 1 September, while - according to Fifa, external - Saudi Arabia's runs until 20 September.\nIt means the Middle East country's clubs can still sign players this summer when European clubs cannot.\n\"It is massive, in the moment,\" said Klopp on Saudi Arabia's influence.\n\"Pretty much the worst thing I think is that the transfer window in Saudi Arabia is open three weeks longer.\n\"If I am right, I heard something like that, then at least in Europe that's not helpful.\n\"Uefa or Fifa must find solutions for that. But in the end, at this moment, I don't know exactly what will happen.\"\nAccording to Transfermarkt,, external Saudi Pro League clubs have spent 409m euros (£352m) so far this summer - the fifth-highest total in world football and more than Spain's La Liga - 254m euros (£218m).\nThe Premier League leads the way with 1.37bn euros (£1.17bn) spent, followed by Italy's Serie A (548m euros/£472m), France's Ligue 1 (458m euros/£394m) and Germany's Bundesliga (451m euros/£387m).\nBBC Sport understands leading Premier League clubs have been told the Saudi Pro League has set aside funds to turn the country into a football force over the next 10 years.\nFour of the leading Saudi Arabian clubs were taken over by the country's Public Investment Fund in June.\nLiverpool have already been affected by players moving to Saudi Arabia, with midfielders Jordan Henderson and Fabinho joining Al-Ettifaq and Al-Ittihad respectively.\nThey are part of a growing group of players to make the switch to the country, with Brazil forward Roberto Firmino having signed for Al-Ahli after his Reds contract expired in the summer.\nAl-Ahli have also signed Senegal keeper Edouard Mendy from Chelsea and winger Riyad Mahrez from Manchester City.\nAl-Ittihad, meanwhile, have brought in former Real Madrid striker Karim Benzema, ex-Chelsea midfielder N'Golo Kante and Portuguese forward Jota from Celtic.\nAl-Hilal, who made a world-record £259m bid for Paris St-Germain forward Kylian Mbappe, have signed Portugal midfielder Ruben Neves from Wolves and Senegal defender Kalidou Koulibaly from Chelsea.\nManchester City boss Pep Guardiola has said the Saudi Pro League's financial power has \"changed the market\" for transfers and elite clubs \"need to be aware of what is happening\".\nLiverpool were not planning to sell Henderson and Fabinho and, having already seen James Milner, Alex Oxlade-Chamberlain and Naby Keita leave the club at the end of their contracts, have lost five midfielders on a permanent basis this summer.\n\"It is already influential, for us, for sure. We will have to learn to deal with it, and that's what we do,\" added Klopp.\n\"That's pretty much all I can say about it, time will show.\"", "url": "https://www.bbc.com/sport/football/66370013"}