{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:01:57", "date_modify": "2025-04-26 07:01:57", "date_publish": "2025-03-02 00:00:00", "description": "Jack Iredale's thumping finish gives Hibernian a 2-1 victory over Heart of Midlothian to move up to third in the Scottish Premiership.", "filename": "sport_football_live_c9q4j1nwjprt_1745650917.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_c9q4j1nwjprt_1745650917.html", "title": "Hibs beat Hearts in Scottish Premiership to jump to third after derby thriller", "title_page": "Hibs beat Hearts in Scottish Premiership to jump to third after derby thriller - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "\"A goal well worthy of winning a derby\" from Jack Iredale earned Hibernian back-to-back triumphs over Heart of Midlothian and lifted them up to third in the Scottish Premiership.\nOn 74 minutes, the defender beat Hearts captain Lawrence Shankland to a loose ball before arrowing a left-footed shot from range beyond the helpless Craig Gordon to the delight of a packed Easter Road.\n\"I was right behind it,\" said Hibs head coach David Gray. \"It's a fantastic hit and a goal well worthy of winning a derby.\n\"It's something that will live with him for the rest of his life. It needed to be a really good strike because Craig Gordon's a top goalkeeper. A special moment for a special game.\"\nIt was a fitting way to decide a fiercely contested match, one that started in stunning fashion.\nMartin Boyle raced on to an Iredale pass over the top inside six minutes and breezed past right-back Gerald Taylor before slotting a calm finish into the far corner.\nThe hosts were pegged back just three minutes later by a scorching strike from Jorge Grant, who moved on to a scuffed clearance by Rocky Bushiri.\nGray's side seized control in the second half, though, and eventually found a way through thanks to Iredale's moment of magic.\nHibs last won successive top flight meetings with Hearts in 2009 and are now 15 matches unbeaten in all competitions.\nThey are one point above Aberdeen in fourth, who drew 2-2 with Dundee United in Sunday's other Premiership game.\nThe full-time scenes at Easter Road reflected the high everyone associated with Hibs are on just now.\nSunshine on Leith was belted out again with most home fans staying to celebrate with the players, who stood arm-in-arm, soaking it all in.\nGray's name was also chanted in unison - and little wonder given the scale of the turnaround he has orchestrated.\nFrom the foot of the Premiership to third - the form team in the country, who seem capable of positive results from any position.\nThey plan to take 7,000 fans to Celtic Park for next weekend's Scottish Cup quarter-final. The fanbase sense something special happening under Gray - and who can blame them?\nAgainst their city rivals, they were below-par in the opening 45 minutes. There were some shaky moments at the back and several passes failed to find their mark against well-organised visitors.\nHowever, this team are not used to being second best and they went up a gear after the break.\nNicky Cadden's delivery from the left has been a feature of this long unbeaten run and he drove standards down that flank, creating three opportunities from nothing.\nHibs penned Hearts in their own half and, with just over 15 minutes remaining, they got their just rewards.\nIredale will likely never score a better goal. It was a moment that will live long in the memory for both him and all Hibs fans.\nHearts will understandably be down after losing their second derby match of the season, but when head coach Neil Critchley reflects on the performance, he will find positives.\nThe way they responded to going a goal behind showed excellent character and Grant's technique for the equaliser was superb.\nElton Kabangu again looked a threat with his pace and movement up front and was denied an eighth Hearts goal by the offside flag.\nHowever, the way their levels dropped in the second half was alarming.\nHearts had just three shots, none of them on target, and never truly threatened Jordan Smith in the Hibs goal. The calm build-up play and intricate passing that was on show at times in the opening 45 was nowhere to be seen.\nShankland was beaten to the ball for Iredale's winner and there will also be questions asked about Boyle's opening goal.\nOne long pass unpicked the entire defence. Taylor was eased off the ball far too easily and Gordon was rooted to his line. The ball was inside the Scotland goalkeeper's six-yard box by the time Boyle came to shoot - and yet he stayed put.\nYes, Taylor must be stronger, but Gordon must also be more decisive.\nStill, Hearts have lost only two of their past 12 matches in all competitions and remain in the mix for a top-six spot.\nAttentions now turn to the cup and Dundee's visit to Tynecastle on Friday.\nHibs head coach David Gray: \"On our second-half performance, we thoroughly deserve to win the game.\n\"We managed to show more composure, got the play into wide areas and it really gave us a foothold.\n\"The players need to enjoy these moments and the scenes after the game, the connection that's building all the time. It's certainly one for the fans.\n\"We need to cement a place in the top six. The quicker we can and the more points we can pick up, gives us a real chance to then start moving forwards.\"\nHearts head coach Neil Critchley: \"I thought, first half, we played with good control and were slightly the better team.\n\"Second half, we were unrecognisable. Stopped doing things we were doing first half, didn't pass the ball well enough, were too passive, disjointed in our defending and we allowed too many balls into our box. In the end that's led to a great goal.\n\"That wasn't like us, it's not been like us and it's something we need to do better at.\n\"It's bitterly disappointing to lose a derby so we have to take the criticism. We're at home against Dundee in the cup and we have to show a response.\"", "url": "https://www.bbc.co.uk/sport/football/live/c9q4j1nwjprt"}