{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:31:42", "date_modify": "2025-04-26 07:31:42", "date_publish": "2025-02-27 17:03:18", "description": "Port Vale forward Ronan Curtis will be available immediately for the League Two promotion challengers after his red card and three-game ban for violent conduct was overturned.", "filename": "sport_football_articles_c2411rnl5qmo_1745652702.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/23d8/live/311e1a70-f52b-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c2411rnl5qmo_1745652702.html", "title": "Ronan Curtis: Port Vale forward gets red card and three-game ban rescinded", "title_page": "Ronan Curtis: Port Vale forward gets red card and three-game ban rescinded    - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Port Vale's Ronan Curtis has had his three-game ban rescinded following his straight red card against Salford City.\nThe 29-year-old Irishman was sent off on the final whistle by referee Thomas Kirk for 'violent conduct' in Saturday's 2-1 home win.\nBut, following a successful appeal by the League Two club for wrongful dismissal, the forward is now free to play in this Saturday's lunchtime trip to managerless Tranmere Rovers.\nIn a club statement, , externalVale said: \"Our number 11 was sent off following the culmination of Saturday's fixture and was facing a three-game ban for what, at the time, was deemed violent conduct.\n\"Upon reviewing the evidence available to the club, we lodged an appeal to the FA which we have learnt, has been successful.\n\"Ronan will now be available for selection for our trip to Tranmere Rovers.\"\nFollowing a pre-Christmas slump, in which Vale lost the League Two leadership to Walsall, Darren Moore's side have won five times in an eight-game unbeaten league run since the turn of the year to sit three points shy of an automatic promotion place.\nMeanwhile, Vale have also announced that the local derby at promotion rivals Crewe on Saturday, 29 March has been brought forward to an earlier 12:30 BST kick-off time after being selected as a live TV game.", "url": "https://www.bbc.co.uk/sport/football/articles/c2411rnl5qmo"}