{"authors": ["Amy MacBeath", "www.facebook.com"], "date_download": "2025-05-20 13:47:38", "date_modify": "2025-05-20 13:47:38", "date_publish": "2023-07-31 12:56:39", "description": "Scotland coach Tamsin Greenway says her young squad's disappointment at the Netball World Cup defeat to Australia shows the progress they are making.", "filename": "sport_netball_66360448_1747748858.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ECCB/production/_130591606_love.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_netball_66360448_1747748858.html", "title": "Netball World Cup: Australia v Scotland - Tamsin Greenway on progress of side", "title_page": "Netball World Cup: Australia v Scotland - Tamsin Greenway on progress of side - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Scotland coach Tamsin Greenway says the disappointment her inexperienced squad felt after the brave performance against Australia at the Netball World Cup shows the progress they are making.\nThe Thistles held the world's number one-ranked side to their lowest score of the tournament as they lost 76-37.\nThey now face Tonga and Fiji in Group F seeking a first top-10 spot since 1994.\n\"It's an exciting, talented group. But they are learning on the job and we have to accept that,\" Greenway said.\n\"What was most interesting is that some of the players are kind of disappointed with some of the things they put out there against Australia, where I'm looking at it thinking some of the netball was the best we've played in this competition.\n\"I just feel our progress is that we are constantly moving forward. Our scorelines say we absolutely are, the way we are hanging in games is suggesting we absolutely are.\"\nGreenway has challenged her young squad to secure the top-10 finish in South Africa that would represent Scotland's best performance for two decades.\nThe Thistles - who were highly competitive against the Diamonds for the final two quarters - have one of the tournament's youngest squads, with five players aged 23 or under.\n\"When you go back to 1994, games were so different so I talk about how in the modern era this Scotland group has never broken into the top 10, so that would be huge for us,\" Greenway told BBC Scotland.\n\"The rankings are pretty skew whiff in terms of who gets to play who, who has funding, and players playing for different countries, so we have to be realistic.\n\"But we've come here to challenge teams like Tonga and go, 'OK, you've had all this investment and got some big names but what can we do'. Wins against Tonga and Fiji are what we are aiming for.\n\"We are a young group and have to accept that inexperience can be costly, but that's our challenge for the rest of the week. Can we do something that Scottish Thistles haven't in the modern era?\"\nResults from the first group stage carry through to the second and the defeat against the Diamonds means Scotland - who lost their final two games of the opening stage - sit second-bottom of the Group F table.\nThe top two teams from each of the second-stage pools advance to the semi-finals with England and Australia strong favourites to make it to the last four ahead of Malawi from the six-strong group.", "url": "https://www.bbc.com/sport/netball/66360448"}