{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:57:40", "date_modify": "2025-05-20 12:57:40", "date_publish": "2023-08-02 21:52:06", "description": "Rangers face first meeting with Servette", "filename": "sport_articles_cn02z8w751lo_1747745860.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1c09/live/78602030-317e-11ee-8f52-fbf70e4bf742.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cn02z8w751lo_1747745860.html", "title": "Rangers face first meeting with Servette", "title_page": "Rangers face first meeting with Servette - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We now know that Rangers will have to roll over Swiss side Servette if they are to reach the Champions League play-off round.\nThe Swiss Super League runners-up showed their battling qualities on Wednesday as they won through on penalties after extra-time in Belgium, following a 2-2 draw on the night and 3-3 on aggregate, against Genk.\nThat came despite having striker Enzo Crivelli sent off after only three minutes and falling behind twice.\nWhile it will be Rangers' first meeting with the side from Geneva, they have played a total of eight competitive games against Swiss opponents - Young Boys, FC Zurich and Grasshopper Zurich - winning two ties and losing three.\nThe most recent of those came in the 2019-20 Europa League group stage, when they drew 1-1 with Young Boys at Ibrox and lost 2-1 in Switzerland.\nYoung Boys were again crowned champions last season, with Servette a distant second, 16 points behind and one ahead of Lugano.\nServette are looking to progress to the group stage of any European competition for the first time and last reached a third qualifying round three years ago, when they lost to Rosenborg in the Europa League.\nArguably their greatest European exploits came in reaching the quarter-finals of the European Cup Winners' Cup, losing to Slavia Sofia in 1966-67 and Fortuna Dusseldorf in 1978-79.\nServette have only played a Scottish side once previously, losing to Aberdeen 1-0 on aggregate in the second round of the European Cup in 1985.\nFormer Servette defender Rene Weiler returned to the club this summer to take over as head coach. The 49-year-old lists Anderlecht, Al Alhy and, most recently, Japan's Kashima Antlers among the sides he previously managed.\nHe will bring his side to Ibrox for the third qualifying round first leg on Wednesday, with the return at Stade de Geneve the following Tuesday.", "url": "https://www.bbc.com/sport/articles/cn02z8w751lo"}