{"authors": ["Craig Nelson", "www.facebook.com"], "date_download": "2025-05-21 07:10:26", "date_modify": "2025-05-21 07:10:26", "date_publish": "2025-03-30 10:23:16", "description": "Great Britain's Zoe Atkin claims gold in the women's freeski halfpipe at the Freestyle Ski and Snowboard World Championships in Switzerland.", "filename": "sport_articles_ckge2j21r74o_1747811426.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8798/live/76a04560-0d5d-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_ckge2j21r74o_1747811426.html", "title": "GB's Zoe Atkin wins world freeski halfpipe gold in Switzerland", "title_page": "GB's Zoe Atkin wins world freeski halfpipe gold in Switzerland - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Great Britain's Zoe Atkin pulled off a stunning second run to take freeski halfpipe gold at the Freestyle Ski and Snowboard World Championships in Switzerland.\nThe 22-year-old American-born skier fell at the end of her opening attempt in Engadin but wowed the judges when the pressure was on to score 93.50.\nShe completed the set of medals at the worlds, following up on her silver and bronze at the two previous championships.\n\"Oh my god, this means everything to me,\" said Atkin, who beat China's Li Fanghui by just 0.5, while Canada's Cassie Sharpe claimed bronze with 88.00.\n\"After getting a third and a second, this season I was like 'you know what, I want to go for the gold'.\n\"So I have put a lot of work in this season. I tried to put my new trick in there. I had a lot of mental blocks, so really proud of myself for working through that.\n\"Then to be able to land it on my second run, with all the pressure on, and become world champion. Oh my god, this means so much to me, I'm so excited.\"\nThe win capped off a successful season for Atkin, who shared the overall World Cup title with China's Li in the women's halfpipe.\n\"I feel amazing - I'm world champion,\" Atkin added. \"I'm going to go celebrate, I'm going to eat all the Swiss chocolate I have in my bedroom, I'm going to have a drink out on the patio.\"", "url": "https://www.bbc.com/sport/articles/ckge2j21r74o"}