{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:59:07", "date_modify": "2025-05-21 03:59:07", "date_publish": "2025-04-07 07:48:28", "description": "Fulham 3-2 Liverpool: Clinton Morrison on Virgil van Dijk", "filename": "sport_football_articles_cg72z70y4gzo_1747799947.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cd0e/live/8127aa00-137f-11f0-a9df-914426228455.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cg72z70y4gzo_1747799947.html", "title": "Fulham 3-2 Liverpool: Clinton Morrison on Virgil van Dijk", "title_page": "Fulham 3-2 Liverpool: Clinton Morrison on Virgil van Dijk - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Premier League striker Clinton Morrison says Fulham forward Rodrigo Muinz \"was a nuisance\" and caused Liverpool centre-back's Virgil van Dijk and Ibrahima Konate \"all kinds of problems.\"\nOut of possession, Fulham hassled the Reds, pressing from the front with Muniz and cutting off the passing line and preventing the visitors from playing through them.\nHaving worked so hard to get the ball, they had no desire to give it away cheaply.\n\"Fulham were outstanding and the atmosphere was incredible,\" said Morrison on BBC Radio 5 Live's Football Daily podcast. \"They needed to bounce back after the defeat by Crystal Place the week before [in the FA Cup quarter-final] and to a man, they were fantastic.\n\"Calvin Bassey and Antonee Robinson did not give Mohamed Salah a kick. Bassey was aggressive, he got forward and the midfield were strong.\n\"Rodrigo Muniz caused Virgil van Dijk and Ibrahima Konate all kinds of problems and his goal was fantastic. He was a nuisance and it was the most frustrated I'd seen Van Dijk.\n\"Usually he is cool, calm and collected but he was kicking the ball out and shouting at the team-mates. Muniz got right under their skin.\n\"Full credit to Fulham because they gave Liverpool no time on the ball and were really in their faces. Liverpool made the mistakes and Fulham punished them. \"", "url": "https://www.bbc.com/sport/football/articles/cg72z70y4gzo"}