{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 08:15:12", "date_modify": "2025-04-26 08:15:12", "date_publish": "2025-02-26 10:56:44", "description": "England manager Thomas Tuchel appoints Brentford coach Justin Cochrane to Three Lions' backroom staff.", "filename": "sport_football_articles_c17qe2yjxgxo_1745655312.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e4ee/live/27bb9d40-f42c-11ef-9822-d3d66c578726.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c17qe2yjxgxo_1745655312.html", "title": "Thomas Tuchel appoints Brentford coach Justin Cochrane to England backroom staff", "title_page": "Thomas Tuchel appoints Brentford coach Justin Cochrane to England backroom staff - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Brentford first-team coach Justin Cochrane has joined Thomas Tuchel's England backroom staff.\nThe 43-year-old will continue in his role at the Bees alongside working with the Three Lions.\nThe likes of Noni Madueke, 22, and 20-year-olds Lewis Hall and Rico Lewis - who are now all full England internationals - have been coached by Cochrane, having played under him during his time as manager of England Under-15s, Under-16s and Under-17s.\n\"This is a really exciting opportunity for me and I'm extremely grateful to Brentford for allowing me to take on this role,\" said Cochrane.\n\"Most of all, I'm looking forward to helping this very talented group achieve its\nFormer Antigua and Barbuda international Cochrane's 13-year playing career in club football peaked in the Championship with Crewe Alexandra, for whom he made 72 appearances between 2003 and 2006.\nCochrane started his coaching career with Tottenham before joining Manchester United as the head of player development and coaching of the club's academy.\nHe joined Brentford in 2022, a year after the Bees' promotion to the Premier League.\nCochrane is the latest appointment to Tuchel's backroom staff, with assistant Anthony Barry, goalkeeping coach Henrique Hilario and performance coach Nicolas Mayer already in place.\nTuchel's first game in charge of England will be on 21 March, when the Three Lions host Albania at Wembley.", "url": "https://www.bbc.co.uk/sport/football/articles/c17qe2yjxgxo"}