{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:58:24", "date_modify": "2025-05-21 04:58:24", "date_publish": "2025-04-04 12:40:47", "description": "West Bromwich Albion boss Tony Mowbray says it's unfair to focus on Adam Armstrong's minimal goalscoring return as the whole side needs to score more.", "filename": "sport_football_articles_cvgp7nwy7kko_1747803504.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9383/live/1db49a40-114b-11f0-bf77-53586c0d950e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cvgp7nwy7kko_1747803504.html", "title": "West Brom: Unfair to focus on Adam Armstrong goal return, says Tony Mowbray", "title_page": "West Brom: Unfair to focus on Adam Armstrong goal return, says Tony Mowbray - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tony Mowbray says it's unfair to highlight Adam Armstrong's goal return as West Bromwich Albion prepare for a crucial period in their play-off push.\nArmstrong arrived on loan from Southampton at the end of the January transfer window, having scored 24 Championship goals for the Saints last season, and 80 in the second tier in his career.\nHowever he has managed just two goals, one of them a penalty, in his first nine appearances at Albion, who sit sixth on goal difference after winning just one of their past five games.\nAhead of the visit of former club Sunderland to The Hawthorns on Saturday (15:00 BST) with games against play-off rivals Bristol City and Watford to follow next week, Mowbray told BBC Radio WM: \"I'm more concerned with the lack of goals from everywhere else.\n\"I think it's a bit unfair to burden one lad with scoring all the goals. Josh Maja is considerably the top scorer at the club (12, double the number of closest challengers Alex Mowatt and Karlan Grant) but I haven't worked with him - he's been out for a good few months.\n\"I've worked with Adam for years, at Coventry and Blackburn. Strikers need chances created for them, generally they are finishers. Collectively the whole team need to stand up, create more chances, have more end product.\n\"Centre-halves should be scoring from set-plays, full-backs should be getting in at the back stick sometimes and scoring, midfielders and wide players undoubtedly need to score more goals.\n\"It's a little but unfair to point to Adam, the whole team need to score more goals.\"\nThe Baggies have netted 48 times in their 39 matches so far, 30 less than second-placed Leeds and 11 fewer than Middlesbrough, who are level on points in seventh.\n\"I believe you need to score over 70 goals a season to get promotion,\" Mowbray added. \"You need to share them around. One season when I was here previously we had six or seven players who all scored double figures in one season.\n\"We need more goals, more end product, better quality in the final third to create chances, and we've got to make the net bulge.\"\nMowbray has tended pick line-ups with one striker, not helped by Maja's lower leg injury sustained in January, but admitted it \"crosses my mind all the time\" whether to pair Armstrong with another forward.\nGrant is without a goal in 13 appearances since the turn of the year and has started only four games since Armstrong's arrival, often operating wide on the left.\nWill Lankshear has featured in just seven games, starting once, since his mid-season arrival on loan from Tottenham, playing just 151 minutes in total while American forward Daryl Dike has played just 47 minutes across four sub appearances following his return from Achilles surgery in February.\n\"It depends how you want to do it and how much control of the game you want,\" he added.\n\"The good thing is that I am the head coach and I get to decide how we play. Everyone else can have an opinion but they'll never find out if it would work until I line my thought patterns up with theirs.\"", "url": "https://www.bbc.com/sport/football/articles/cvgp7nwy7kko"}