{"authors": ["Kheredine Idessane", "www.facebook.com"], "date_download": "2025-05-21 06:01:46", "date_modify": "2025-05-21 06:01:46", "date_publish": "2025-04-01 16:49:45", "description": "Sophie Howard believes Scotland's \"superpower\" will be required if Germany are to be beaten in Friday's meeting at Tannadice.", "filename": "sport_football_articles_cr4nxpr0z9do_1747807306.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4105/live/6e984920-0f11-11f0-aaaa-c522a5fb13c3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cr4nxpr0z9do_1747807306.html", "title": "Scotland vs Germany: Hosts can call on 'superpower', says Sophie Howard", "title_page": "Scotland vs Germany: Hosts can call on 'superpower', says Sophie Howard - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Sophie Howard believes Scotland's \"superpower\" will be required if Germany are to be beaten in Friday's Women's Nations League meeting at Tannadice.\nThe Leicester City defender, born and raised in Germany to a Scottish mother and an English father, is not just fluent in German but fully versed in the development of the German game at club and international level.\nThat familiarity, as well as the fact the Germans may not know so much about the Scots, could help interim head coach Michael McArdle's side get the better of the team ranked third in the world.\n\"I've got an advantage in that I know a lot of the players,\" Howard explained.\n\"I've seen them for many, many years and I believe they don't know as much about us as we do about them - and that can be our superpower on Friday.\n\"You always go in wanting to win, why do we play football otherwise? We're fully aware a lot has to go right for us to come out on top.\n\"I'm convinced we can perform and compete with Germany, a top nation. We just need to be at our best.\"\nScotland have lost their past three matches to Finland, Austria and the Netherlands, and could do with a morale-boosting win.\nThe significant scalp of Germany would certainly fit into that category, although Howard is not getting too preoccupied with results at all cost.\n\"What we need is to build internally,\" she said. \"What happens externally with results is sometimes secondary, because we need to build on performances to make this sustainable.\n\"A one-off result won't solve problems and won't bring back belief. A result can help you but we see every day what we put in and that is more valuable than anything else.\"", "url": "https://www.bbc.com/sport/football/articles/cr4nxpr0z9do"}