{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:51:14", "date_modify": "2025-05-21 05:51:14", "date_publish": "2025-04-02 09:44:57", "description": "Aston Villa news: Fan views on what nobody is talking about Villa", "filename": "sport_football_articles_c30qpl4n2yno_1747806674.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c30qpl4n2yno_1747806674.html", "title": "Aston Villa news: Fan views on what nobody is talking about Villa", "title_page": "Aston Villa news: Fan views on what nobody is talking about Villa - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your views on the thing no-one is talking about Aston Villa, but really should be.\nHere are some of your comments:\nTheo: Nobody is talking about the fact Ezri Konsa is one of the best all-round centre-backs in the league and at this moment, he is the best for his country. Despite our horrid defensive record this season, he has been top quality almost every week, rarely puts a foot wrong, and if he had a consistent partner on his left (bearing in mind he's had, Tyrone Mings, Pau Torres, Diego Carlos, Lamare Bogarde and even Lucas Digne at one point) maybe our record wouldn't be as bad as it is. He's definitely already cemented his ticket to the 2026 World Cup - I think only an injury would cost him that.\nPrit: Ezri Konsa. Konsa has been the rock of our defence for the past two years and his versatility means he is an England regular. I would like to postulate that not only is he Villa's best defender, that he must be England's first choice in defence and could even be a future England captain. Secondly, Boubacar Kamara. While the spotlight is on our wonderful strikers and Marco Asensio in midfield, I feel Kamara has been the glue that has held this Villa team together this season. In my opinion, he is our player season and we play much better when he is in the side.\nTariq: Can Marcus Rashford push Ollie Watkins out of the team? He has shown he can play up front on his own as per Unai Emery's preference. Watkins, who can offer more than goals, isn't as prolific at the moment and Rashford offers more from set-pieces.\nJason: No-one is talking about how frustrating Watkins can be. If only he had that split-second ruthless streak. Over thinking everything is his downfall and we'd be far better off with him instantly pulling the trigger more often or a forward who has Alexander Isak-like qualities. Arsenal are welcome to Watkins for £70-80m in my opinion.\nDavid: How will Villa comply with PSR? After aggregate losses of over £200m in the past two financial years that implies we will need to make a profit of around £100m this year to comply with the £105m 3 year rolling allowed losses rule. The dramatic increase in revenue will help as will the sale of Jhon Duran but I fear we may have to sell a key player again (after Douglas Luiz last year and Duran this year), which will weaken the team.", "url": "https://www.bbc.com/sport/football/articles/c30qpl4n2yno"}