{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:47:40", "date_modify": "2025-04-26 07:47:40", "date_publish": "2025-02-26 23:48:34", "description": "Arsenal, Manchester United and Chelsea are among the sides looking for a new striker in the summer. BBC Sport takes a look at who could head to the Premier League.", "filename": "sport_football_articles_ceqjldng12jo_1745653660.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/434a/live/10125190-f4a2-11ef-896e-d7e7fb1719a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_ceqjldng12jo_1745653660.html", "title": "Which strikers could Arsenal buy in the summer to lead them to the title?", "title_page": "Which strikers could Arsenal buy in the summer to lead them to the title? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Arsenal's Premier League title challenge looks all but over this season, even if manager Mikel Arteta will not publicly admit it.\nThe second-placed Gunners are 13 points adrift of leaders Liverpool after a goalless draw at Nottingham Forest again saw the conversation centred around their lack of striking options.\nIn their past two Premier League matches, Arsenal have had 33 shots, but just three on target and no goals.\nIt is the first time since May 2023 they have failed to score in back-to-back league games, with midfielder Mikel Merino forced to play up front due to having no available strikers.\nArteta said: \"We dominated the game. We tried in many different ways. We insisted but lacked that spark, that final pass to unlock a well-organised team. We have to generate more shots on target.\"\nWhile Arsenal undoubtedly have not been helped by injuries to forwards Gabriel Jesus, Bukayo Saka, Gabriel Martinelli and Kai Havertz, there seems little doubt they will be stepping up their search for a goalscorer in the summer.\nFormer Gunners goalkeeper David Seaman, speaking on BBC Radio 5 Live admitted: \"We have always needed a striker. We tried in the transfer window and now hopefully there is one lined up in the summer, but that will be a bit too late.\n\"It will be the final piece of the jigsaw. That will hopefully be what makes it (winning the title) happen next season.\"\nBut with Premier League rivals Manchester United, Chelsea, Tottenham and Aston Villa also likely to be in the market for a striker this summer, finding that missing piece is not going to be easy for Arsenal.\nHere are some options of forwards likely to dominate the transfer market this summer...", "url": "https://www.bbc.co.uk/sport/football/articles/ceqjldng12jo"}