{"authors": ["Callum Matthews", "www.facebook.com"], "date_download": "2025-05-21 04:55:07", "date_modify": "2025-05-21 04:55:07", "date_publish": "2025-04-04 14:51:54", "description": "Odds-on favourite Jonbon wins the Melling Chase on day two of the Grand National meeting at Aintree, after his disappointment at the Cheltenham Festival.", "filename": "sport_horse-racing_articles_c62x7g0ej6no_1747803307.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/fd13/live/d9cce110-1164-11f0-ba60-99b08c2860b3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_horse-racing_articles_c62x7g0ej6no_1747803307.html", "title": "Aintree 2025: Jonbon wins Melling Chase for Nico de Boinville and Nicky Henderson", "title_page": "Aintree 2025: Jonbon wins Melling Chase for Nico de Boinville and Nicky Henderson - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Odds-on favourite Jonbon won the Melling Chase on day two of the Grand National meeting at Aintree.\nThe nine-year-old, who was 4-6 favourite, was part of a front three initially before jockey Nico de Boinville settled him in behind.\nHe took over on the second circuit and went clear before being pushed out by De Boinville to win by three and a quarter lengths from Protektorat.\nIt is some compensation for Jonbon, who finished second after a shuddering mistake when odds-on favourite for the Champion Chase at Cheltenham Festival last month.\n\"There was really [an awful lot riding on that],\" De Boinville told ITV. \"Jonbon gets us out of trouble again.\n\"You would have said it's been a tough week but all the credit to the staff and particularly the governor [trainer Nicky Henderson], [owner] JP McManus and his team.\n\"They've kept the faith in us - we had to pick ourselves up after yesterday [with Constitution Hill] and thankfully I've got really nice horses to ride like Jonbon here. He is an absolute superstar.\n\"He was a very different horse to the one I rode at Cheltenham - he really enjoyed it out there today. You can see when he's right and on song he loves his jumping.\n\"Racing and all sport is a tough place to be in. You've just got to roll with the punches - and when you're on the floor, you've just got to pick yourself up again. It's like that famous Rocky saying 'you've got to get up and keep moving forward' and that's what we try and do.\"\nIt is Jonbon's second win in the Melling Chase, which is a step up in trip to 2m 3f 200y, and his 10th top-level Grade One win, continuing his 100% success rate in races away from Cheltenham.\nHenderson, who has won the Melling Chase five times, told ITV: \"That Champion Chase doesn't seem to work for him. It is a pity because that just went all wrong for him. He proved today that he just loves doing that - they went some gallop but that is what he loves best.\n\"He was brilliant and he jumped so well. Nico and him know each other so well - they just trust each other.\n\"Yesterday [with Constitution Hill] wasn't an easy day for any of us. We all feel that, and I know Nico does as well. We have issues we have to sort out and to come back and give a horse a ride like that, that is a great man.\"\nMatata finished third, while the Willie Mullins-trained El Fabiolo fell on the second circuit.", "url": "https://www.bbc.com/sport/horse-racing/articles/c62x7g0ej6no"}