{"authors": ["Ciaran Varley", "www.facebook.com"], "date_download": "2025-04-26 06:53:05", "date_modify": "2025-04-26 06:53:05", "date_publish": "2025-02-28 16:49:09", "description": "Liverpool news: Doubters to Believers Liverpool FC on Divock Origi", "filename": "sport_football_articles_cr422w6601qo_1745650385.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1864/live/b4842c50-f504-11ef-9808-4d9b058d1a40.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cr422w6601qo_1745650385.html", "title": "Liverpool news: Doubters to Believers Liverpool FC on Divock Origi", "title_page": "Liverpool news: Doubters to Believers Liverpool FC on Divock Origi - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Liverpool's Champions League semi-final second-leg comeback win over Barcelona in 2019 will go down as one of the greatest Anfield night in the club's history.\nWith the Reds needing to overcome a 3-0 deficit from the first leg and missing key players like Mohamed Salah and Roberto Firmino, it looked like a fait accompli before kick-off that Lionel Messi's Barca side would stride into the final.\nHowever, an aggressive press, a raucous crowd and goals from Divock Origi and substitute Georginio Wijnaldum left the Catalan side bewildered.\nIn a new Amazon Prime documentary, Klopp reveals what he told his team before the game.\n\"We asked the players to close their eyes for 10 seconds and imagine the best game you've ever played in your life,\" he says. \"It can be a youth game, it can be when you were 10 years old. Then they opened their eyes again and I said: 'And that's exactly the performance we need again today'.\"\nThe win was sealed when Alexander-Arnold caught Barcelona napping and delivered a quick corner for Origi to guide home. Klopp reveals the whole thing happened so quickly that it passed him by.\n\"That moment I had no clue who took the corner,\" he says. \"That's the truth. I look around, Divock hits the ball and it goes into the net.\"\nThe Belgium striker became a cult Kop figure under Klopp, with a reputation for scoring important goals in big games, often as a substitute.\nIn December 2018, he capitalised on an error by Everton keeper Jordan Pickford to nod in a winner in the 96th-minute of the Merseyside derby, sending the Kop into pandemonium and earning his manager a fine after the German sprinted onto the pitch to celebrate.\nHowever, former midfielder Adam Lallana claims in the documentary that the Origi had no idea at the time how significant his goal was.\n\"I remember looking at Divock and thinking: 'I'm not sure you know the score'.,I think he thought he equalised,\" says the Southampton midfielder.\nFootage of the moment does show Origi running to retrieve the ball, as if to accelerate the restart.\n\"Divock was a little bit like that,\" says Lallana. \"At times, he was away with the fairies.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cr422w6601qo"}