{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:25:51", "date_modify": "2025-05-20 14:25:51", "date_publish": "2023-07-29 14:26:31", "description": "Ben Proud earns one of two bronze medals won by Great Britain at the World Aquatics Championships as Katie Ledecky enjoys a record-breaking day.", "filename": "sport_swimming_66349280_1747751151.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/10A20/production/_130582186_gettyimages-1578371471.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_swimming_66349280_1747751151.html", "title": "World Aquatics Championships 2023: GB's Ben Proud wins bronze as Katie Ledecky sets records", "title_page": "World Aquatics Championships 2023: GB's Ben Proud wins bronze as Katie Ledecky sets records - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ben Proud earned one of two bronze medals won by Great Britain at the World Aquatics Championships as Katie Ledecky enjoyed a record-breaking day.\nLedecky, 26, won the women's 800m freestyle in Fukuoka for a record 16th individual world gold and a record sixth in a single event.\nBoth records had been held by fellow American Michael Phelps.\nMeanwhile, Sweden's Sarah Sjostrom won the 50m butterfly title to tie Phelps' record of 20 individual world medals.\nA time of 24.77 seconds gave the 29-year-old victory over China's Yufei Zhang (25.05) and American Gretchen Walsh (25.46), plus her fifth straight gold in the event and her 11th world title overall.\nThen less than half an hour later Sjostrom broke her own world record in the 50m freestyle semi-finals.\nThe Olympic silver medallist won in 23.61 secs, beating the previous mark of 23.67 she set en route to winning gold at the 2017 World Championships.\nLedecky won 1500m freestyle gold by 17 seconds on Tuesday and was again a comfortable winner in 8 minutes 8.87 seconds, ahead of China's Bingjie Li (8:13.31) and Australian Ariarne Titmus (8:13.59).\nDespite winning the men's 50m freestyle title in Budapest last year, Ben Proud said Cameron McEvoy was favourite going into Saturday's final.\nAnd the Australian won in 21.06, with USA's Jack Alexy edging the silver medal in 21.57, just one hundredth of a second ahead of 28-year-old Proud.", "url": "https://www.bbc.com/sport/swimming/66349280"}