{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:13:42", "date_modify": "2025-05-21 07:13:42", "date_publish": "2025-01-22 15:31:11", "description": "Aldershot Town manager Tommy Widdrington returnes to the sidelines after suffering two strokes in November.", "filename": "sport_football_articles_c0rq177qr51o_1747811622.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f0c9/live/e0c29360-d8d0-11ef-86b5-b74cbf3823dc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c0rq177qr51o_1747811622.html", "title": "Tommy Widdrington: Aldershot boss back in dugout after two strokes", "title_page": "Tommy Widdrington: Aldershot boss back in dugout after two strokes - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Aldershot Town manager Tommy Widdrington has returned to the sidelines less than two months after suffering two strokes but admits he's never been too far removed from the team.\nThe 53-year-old was in the dugout for the Shots' 2-1 win over Fulham U21 in the National League Cup on Tuesday.\n\"I've certainly had my hands back on since the Chertsey game (on 4 January) in terms of being back around the training ground. I've had an influence on that and team selection,\" he told BBC Surrey.\n\"I had a Zoom call on a Friday when I wasn't particularly well so the players could see my face and see me in my house and I'd talk to them and give them hints about the opposition as I could watch a lot of video.\"\nThe former Bristol Rovers and Eastbourne Borough coach joined Aldershot from King's Lynn in April 2023 and led them to the FA Cup third round last season with wins over league sides Swindon and Stockport.\n\"I've never not been in touch, I've just not been here in person,\" he added.\n\"I'm really pleased to be back on the sidelines but it's not about me, it's about where we are and what we want to do and our intention hasn't changed since the start of the season.\"", "url": "https://www.bbc.com/sport/football/articles/c0rq177qr51o"}