{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:09:27", "date_modify": "2025-05-21 07:09:27", "date_publish": "2025-03-30 11:53:10", "description": "'It's been a while since I've hated watching Kilmarnock as much as I do right now'", "filename": "sport_articles_cqj4le0zrk9o_1747811367.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e10a/live/4bd4eb10-0d5d-11f0-ac9f-c37d6fd89579.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cqj4le0zrk9o_1747811367.html", "title": "'It's been a while since I've hated watching Kilmarnock as much as I do right now'", "title_page": "'It's been a while since I've hated watching Kilmarnock as much as I do right now' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Kilmarnock fans, we asked for your views on the humiliating 5-1 loss to St Mirren in Paisley. Here's a taste of what you had to say...\nJames: I'm sorry, but this is the same team as last year and the manager still doesn't know his best XI. Tactically all over the place and outfought, not just today but the vast majority of the season. Time for Derek McInnes to go.\nNeil: Disappointed with the performance and the result obviously, but even more so with the manager's comments afterwards. If he thinks we were \"alright\" then we've got major problems and we'll find even the elusive 11th place out of our reach.\nAlan: I said before the game that five of the players in the starting XI were untrustworthy. Sorry to be critical of players but Robby McCrorie, Lewis Mayo, Liam Polworth, Liam Donnelly and Marley Watkins are not good enough. The midfield two continually get dropped then tried again, dropped again. The one criticism I have with the manager is he has never sorted the midfield since he came in and it is hitting us now.\nJay: What more can we say at this point? Today was embarrassing. McInnes is clueless. No idea what he's doing on the training pitch. Somehow week on week he dodges criticism from the media and gets away with abysmal performances and decisions. It's his team, his signings, his game management, his fault. The teams rotten - because of McInnes. Time's up. Off you go, Del.\nColin: It's been a while since I've hated watching Kilmarnock as much as I do right now. Sick and tired. Also, the manager blaming the weather conditions? What a joke. I forgot St Mirren had magic powers that meant the condition's wouldn't affect them in the game as well. Clueless. You know where the door is. At least with a new gaffer we could maybe relegated with some dignity.", "url": "https://www.bbc.com/sport/articles/cqj4le0zrk9o"}