{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:45:16", "date_modify": "2025-05-20 11:45:16", "date_publish": "2023-08-07 00:00:00", "description": "Text commentary as champions Larne start their defence of the title against Rodney McAree's Dungannon at Inver Park.", "filename": "sport_live_football_66373888_1747741516.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_football_66373888_1747741516.html", "title": "Irish Premiership: Larne v Dungannon Swifts", "title_page": "Irish Premiership: Larne v Dungannon Swifts - text updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Post\nLarne 4-4 Dungannon Swifts\nHow was that for a bit of Monday night entertainment?\nA truly incredible game at Inver Park sees the points shared in the most unlikely of circumstances.\nWe hope you've enjoyed following the action with us - we'll be back on Friday evening with three more Premiership games.\nUntil then, bye for now.\nFULL-TIME\nLarne 4-4 Dungannon Swifts\nTruly remarkable fayre at Inver Park as Dungannon come back from 4-1 down with 13 minutes left to earn a draw!\nNot the start to their title defence that Larne - or indeed anyone else - could have predicted with a quarter of an hour left.\nGOAL - Larne 4, Dungannon Swifts 3\nTomas Galvin (89 mins)\nHold on a minute!\nLarne keeper Rohan Ferguson comes to the edge of his penalty area to attempt to head clear and makes a fairly unconvincing job of it.\nThe ball drops to substitute Tomas Galvin who is coolness personified as he lifts the ball back over a covering defender and into the net.\nWhat a finish we have here!\nPost\nLarne 2-1 Dungannon Swifts\nTomas Cosgrove once again cuts in from the right and attempts to bend a shot with the outside of his right foot into the far corner.\nHe comes within a whisker of pulling it off, too - his effort is fractionally wide of the upright.\nPost\nLarne 2-1 Dungannon Swifts\nThat second Larne goal hasn't had the stabilising effect you might have expected.\nTheir performance so far has lacked the sort of composure we have come to expect from the champions.\nCrucially, however, the scoreline reads in the home side's favour.\nGOAL - Larne 2, Dungannon Swifts 1\nDylan Sloan (51 mins)\nTomas Cosgrove gets a yard of space on the right hand side of the Dungannon penalty area and cuts the ball back into the path of Dylan Sloan who takes a touch before rifling a shot into the bottom corner.\nSwifts keeper Declan Dunne gets a hand on the effort but can't keep it out.", "url": "https://www.bbc.com/sport/live/football/66373888"}