{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:40:22", "date_modify": "2025-05-21 03:40:22", "date_publish": "2025-01-15 00:00:00", "description": "Reaction from Wednesday's four games in the Premier League including Arsenal 2-1 Spurs, Everton 0-1 Aston Villa, Newcastle 3-0 Wolves.", "filename": "sport_football_live_c75wwq01l6xt_1747798822.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c75wwq01l6xt_1747798822.html", "title": "Premier League LIVE: Arsenal 2-1 Spurs, Everton 0-1 Aston Villa, Newcastle 3-0 Wolves & Crystal Palace win", "title_page": "Premier League LIVE: Arsenal 2-1 Spurs, Everton 0-1 Aston Villa, Newcastle 3-0 Wolves & Crystal Palace win - reaction - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Goodnight\nThat's the end of this live text now, thanks for joining us tonight.\nCatch the rest of Match of the Day on the iPlayer.\nWe'll be back tomorrow for Ipswich v Brighton and Manchester United v Southampton in the final two matches of this game week.\n'Arsenal did all the jobs brilliantly well'\nFT: Arsenal 2-1 Tottenham\nMicah Richards\nFormer England defender on Match of the Day\nSpurs were passive, but you have to give credit to Arsenal - you were looking for a reaction. They had higher energy.\nAt times Arsenal have been a bit passive. Everyone knows where they need to be. With Arsenal when they pressed at times they have gone by themselves and today it was as a team.\nThey did all the jobs brilliantly well.\nLemina wants to leave Wolves\nFT: Newcastle 3-0 Wolves\nMidfielder Mario Lemina wants to leave Wolves, says head coach Vitor Pereira.\nLemina, 31, was club captain at the start of the season, but was stripped of the role by former manager Gary O'Neil after he had an altercation with West Ham's Jarrod Bowen after a game.\n\"I can't bring a player who tells me he is not in the mental condition to help the team. He wants to leave,\" said Pereira.\n\"I don't know what happened before me, but with this energy and this mentality, I don't need him. I prefer to play with another player.\n\"I don't have anything against Lemina or any issues with him.\n\"He said to me that he wants to leave and he communicated this decision one month ago to the club.\"\n'We are actively looking'\nFT: Arsenal 2-1 Tottenham\nArsenal\nMore from Arsenal manager Mikel Arteta speaking to TNT Sports: \"We cannot feel sorry for ourselves. What we can control is the performances and we have been doing that consistently. The results are unfortunate sometimes and you don't always get what you deserve. However long to medium term I am sure we will do.\n\"[Looking to recruit?] Yes for sure because we lost two big players, Bukayo who could be out for up to three months and then Gabby who will be out for a long, long, long time. We are going to try [in this window] for sure. We are actively looking. We will try. Let's see what we can get.\n\"[Myles Lewis-Skelly] was phenomenal today. He is a real personality. He has so much trust in himself. He has that attitude about him. He had to play against Johnson and Kulusevski here, and manage the occasion, it is not easy. He was top.\"\n'The way we performed and played today was exceptional'\nFT: Arsenal 2-1 Tottenham\nArsenal\nArsenal manager Mikel Arteta speaking to TNT Sports: \"The boys were outstanding today. Less than 72 hours ago we played 120 minutes in another competition that we went out of - that is not easy psychologically. So the way we performed and played today was exceptional.\n\"We made it harder for ourselves. I think we deserved to score at least one or two more but we had to suffer. We showed that have the capacity to do that too. The attitude, the purpose and intensity that the players played with was really good.\n\"We were incredibly good in the last game against United and we ended up losing somehow. It is all about the next game. It is great that we won today. We can now enjoy that for a few hours then Villa.\n\"My confidence comes from seeing the players and how they perform every day. If my confidence comes and goes with each result then we should not be doing this.\"\n'To close the gap is important'\nFT: Arsenal 2-1 Tottenham\nArsenal\nArsenal midfielder Declan Rice, speaking to BBC Radio 5 Live: \"We could have probably had 10 tonight.\n\"So many clear-cut chances which is a real positive, but to not score more is disappointing - to win 2-1 in a north London derby is a big thing.\n\"To close the gap is important - a big night for us.\"\nOn going down 1-0: \"A weird feeling when you're on the pitch and you feel that domination - we were so on top of them.\n\"We believed in ourselves and we didn't drop our heads.\"\nOn his own performance: \"As I've got older I don't get the recognition I deserve.\n\"I was bought for a big fee and I play for Arsenal. Not a lot of people like Arsenal - I keep my head down and I know my qualities.\"\nOn the title race: \"Every time Liverpool have drawn we have not capitalised on it and that's been a kick in the teeth.\"\n'We have to show an awful lot more quality on the ball'\nFT: Everton 0-1 Aston Villa\nEverton\nEverton manager David Moyes, speaking to TNT Sports, said: \"I don't think there was an awful lot in the game. I'm under no illusions of the job I've got to do. We could not score a goal again.\n\"We did have a decent control of the game, we were right in it, a little bit of a mistake and being out of position cost us the game.\n\"The position we're in is as not as good as we would like to be, that's obvious. Sean [Dyche] got some great results earlier in the season but we have to show an awful lot more quality on the ball, that's the most disappointing thing about it and I've told the players that.\n\"The character was never in question, it has always shone through and they tried to do everything they could to get a result but just could not get one.\"\n'The young boy Miles [Lewis-Skelly] was unbelievable'\nFT: Arsenal 2-1 Tottenham\nArsenal\nMore from Arsenal midfielder Declan Rice speaking to TNT Sports: \"We play so many games now that we don't get much time to practice [set pieces] I just know now the area that I need to put the ball into and it is just about repetition.\n\"Spurs are a transition team. They play the ball short and continue passing. We win the ball high and they are wide open, and then Leo [Trossard] on his left or right foot is deadly.\n\"Tonight I was probably more of a box to box role. I just get excited and get that extra energy to run and run. With our centre halves you can be sure that I am allowed to attack because those two clean up everything.\n\"The young boy Myles [Lewis-Skelly] was unbelievable. For 18 years of age to be playing how he is... It is just ridiculous. The young players now have no fear, none whatsoever. Four or five times in the second half he used his body to get away from someone. He has that Moussa Dembele type strength. It is risky but to show that personality and character at 18 is unbelievable.\"\n'We were probably unlucky that we didn't score 10'\nFT: Arsenal 2-1 Tottenham\nArsenal\nArsenal midfielder Declan Rice speaking to TNT Sports: \"You can tell that tonight meant more than anything. From the first minute, the first half was pure domination. We showed the intent, the pressure, the desire, you could tell it was a derby. I think we were probably unlucky that we didn't score 10 tonight. That is the feeling.\"\n\"You don't need a message. When you play Spurs you know what it means to the fans. As a player if you can't get up for Spurs then you shouldn't be playing football. You need to have that fire in your belly.\n\"In the second half the game got stretched. They maybe could have scored a couple but we could have got another five or six - that is the disappointing thing.\n\"The three points is the most important thing. Hopefully now we can go on a run because this is the most important part of the season.\"\n'From the first minute we were really at it, really intense'\nArsenal 2-1 Tottenham\nArsenal\nArsenal boss Mikel Arteta told BBC Sport: \"Outstanding today. From the first minute we were really at it, really intense. We played with a real purpose to hurt them. We created an unbelivable atmosphere.\n\"We know how important the game is. It's a gift we can make the supporters very happy.\n\"The attitude we played with, not feeling sorry for ourselves, was phenomenal. We played 120 minutes three days ago.\n\"We had some big chances and big situations. At the end we had to suffer more than we wanted.\n\"When you have opportunities [to close the gap] you have to take them. We are on a really consistent run in the Premier League. It's about recovery tomorrow and Aston Villa on Saturday, going and going.\"\n'We hung in there the whole game really'\nFT: Arsenal 2-1 Tottenham\nTottenham Hotspur\nTottenham manager Ange Postecoglou speaking to BBC Match of the Day: \"Yeah we could have got something but that is kind of irrelevant to the point that we were nowhere near the levels we needed to be at today.\n\"In the first half we were way too passive and let Arsenal get into a rhythm. We hung in there, we hung in there the whole game really. Second half was a bit better but nowhere near the level it needed to be.\"\nOn changes at half-time: \"We needed something. The fact we went out in the first half in such a big game and were so passive, it was unacceptable. And we paid a price for it.\"\nOn the opening goal: \"When we play well and take the game to teams then we are at our best and we didn't do that today.\"\nOn Richarlison's return: \"Good to get him back. He has pretty much missed the whole season. But injuries are irrelevant if we are not going out there with the right sort of mindset in the team, and we didn't today.\"", "url": "https://www.bbc.com/sport/football/live/c75wwq01l6xt"}