{"authors": ["Ceri Coleman-Phillips", "www.facebook.com"], "date_download": "2025-05-21 07:57:05", "date_modify": "2025-05-21 07:57:05", "date_publish": "2025-03-27 19:35:32", "description": "It was one of the biggest upsets in Women's Six Nations history - BBC Sport takes a look back at when Wales last beat England.", "filename": "sport_rugby-union_articles_c1jp6p90lgpo_1747814225.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ccc/live/fb8ac410-0a67-11f0-8aaa-d93dcf13a0e5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c1jp6p90lgpo_1747814225.html", "title": "Women's Six Nations: 10 years since Wales stunned world cup winners England", "title_page": "Women's Six Nations: 10 years since Wales stunned world cup winners England - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It was one of the biggest upsets in Women's Six Nations history.\nEngland were world champions, they boasted some of the best players on the planet, yet 10 years ago they were stunned in Swansea.\nWales had only ever beaten the Red Roses once prior to their round one meeting of the 2015 championship, that was on their way to the Triple Crown in 2009.\nBut with some of England's World Cup winning stars retiring after their 2014 triumph and a dozen away on GB Sevens duty, the hosts took full advantage.\nWales led at half-time thanks to the boot of Laurie Harries before player-of-the match Catrin Edwards powered over for the opening try.\nEngland saw several attempts at posts sail wide before Elinor Snowsill's perfectly weighted cross-field kick picked out Harries, who raced over.\nRachel Taylor led Wales that day, while another Taylor, Tamara, had the honour of captaining England.\nBBC Sport brought the two rugby icons together to reminisce, with some memories fonder than others.\nRachel Taylor said their group of players, while young, had been together for a while and when they saw England's much-changed side, they sensed an opportunity.\n\"England and Wales' rivalry is massive at the best of times and there's always a little bit of added edge if you feel like a team changes its side to face you, and with that we were a bit more determined,\" she said.\n\"We wanted to prove a point, like don't underestimate us and I think we managed to get that across.\"\nTamara Taylor recalls the England upheaval both on and off the pitch after the World Cup.\n\"I think seven players retired and then everyone bar two of our backline went to sevens because it was qualification for the Olympics in 2016,\" she said.\n\"We were left with a very inexperienced backline to say the least and some new players that came into the pack.\n\"I think at that point we had lost our head coach, the assistant coach was only hanging on for the Six Nations, our medics had all gone, basically the whole backroom staff, so it was a massive change coming into that Six Nations and I got the pleasure of captaining that exciting mess.\"\nThe rival captains remember a beautiful sunny day and having to make the long walk through the cricket ground at St Helen's before taking to the pitch.\n\"It just felt like it was a real opportunity for us to put a marker in the sand,\" said former Wales captain Taylor.\n\"I just remember defending, our defence was probably the best it's been.\n\"Catrin Edwards was on fire that year and I just remember her barrelling people, Treacs [Jenny 'Treacle' Davies] was in the front row causing havoc and we just wouldn't go away, we just frustrated them.\n\"When it got to half-time we realised we were really getting under their skin, and that sort of lifts you.\"\nFormer England captain Taylor remembers very little going right that day.\n\"I remember being stressed, very stressed most of the way through,\" she said.\n\"I think we missed a couple of penalty kicks, we had chosen to go for posts to settle things.\n\"I remember feeling like our attack wasn't able to complete any sets. Wales defended really hard. I remember us getting into the 22 and then either losing the ball, making a mistake or something going wrong.\n\"I was thinking 'gosh, I'm not sure how we're actually going to score in this game, but it's ok'. You kind of think that right up until the end, but it never actually came.\"\nWhile most would expect Wales' changing room to be bouncing after such a famous win, it was not the case.\n\"We were so tired because we had put such a massive defensive effort in, we were exhausted and sort of in a little bit of disbelief that we'd pulled it off,\" said Wales' Taylor.\n\"I think I said afterwards that it doesn't mean anything if we don't back this up. We beat Scotland and then we lost every game after that.\n\"But it's a really nice memory to have, the photos to look back on are really cool, because that squad was a really good bunch. You can see the passion and pure happiness on people's faces.\n\"We knew we had done something big in that moment.\"\nFor England's new caps, Tamara Taylor said it was a chastening introduction to Test rugby.\n\"They were excited but disappointed, it's their first cap – there were a whole load of emotions going around,\" she said.\n\"Being able to see the elation from the Welsh group, knowing it's only the second time that they had beaten us and thinking could we have done any more?\n\"But as a rugby supporter and a coach I just think it must have been amazing to be in the Welsh changing room.\"\nRivalries will be renewed again this Saturday as Wales prepare to host England having not tasted victory since that fateful day in 2015.\nLast Six Nations, the Red Roses ran in eight tries in a 46-10 demolition of their neighbours, but Wales are hoping with new head coach Sean Lynn at the helm, this year will be more competitive as they seek to bounce back from an opening defeat by Scotland.\n\"I think there were some real improvements [against Scotland] on the weekend, especially like energy, want and desire,\" said Rachel Taylor.\n\"The big part to move forward will be defence. The worry is that we let Scotland have quite a lot of carry metres and England are renowned for that. Unless we can nullify that we could be in for a long afternoon.\n\"If we start really well, like we did against Scotland, and get on the board nice and early, use the Principality Stadium and that energy to get under their skin a little bit, that will have to be the narrative that we try and take.\"\nTamara Taylor said she hopes Wales and the other nations will eventually catch up with England after turning professional.\n\"I hope for women's rugby that the playing field will get levelled out,\" she said.\n\"There's a new coaching set up now with Wales. Sean Lynn has had very successful club campaigns so you hope he can take some of that magic into the Welsh group because there's a great group of players there.\n\"It's just probably about time together.\"\nAnd talking of time, Wales will be hoping they do not have to wait another 10 years to taste victory over the old enemy.", "url": "https://www.bbc.com/sport/rugby-union/articles/c1jp6p90lgpo"}