{"authors": ["Tyrone Smith", "www.facebook.com"], "date_download": "2025-05-21 07:32:30", "date_modify": "2025-05-21 07:32:30", "date_publish": "2025-03-28 16:36:55", "description": "Aberdeen 'need to be really sharp now' - Jimmy Thelin", "filename": "sport_articles_cn7v7dkdpg1o_1747812750.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6613/live/92ab33d0-0bf2-11f0-a31d-7bdcf6d7d2f6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cn7v7dkdpg1o_1747812750.html", "title": "Aberdeen 'need to be really sharp now'", "title_page": "Aberdeen 'need to be really sharp now' - Jimmy Thelin - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Aberdeen manager Jimmy Thelin says his side need to be \"really sharp\" and clinical as they look to achieve their pre-season objective of European football.\nThe Dons are fourth in the table - one point behind Hibs and two above fifth-place Dundee United - and can guarantee a top-six finish with victory at home to Motherwell on Saturday.\n\"Every game in the season is important but now there are not so many more points to play for, we don't have another chance to catch up, we need to be really sharp now and take our chances,\" said Thelin.\n\"We have to always take it step by step and we have the aim before the season to arrive to the European spots but right now it is really tight, even to the top six, but our aim and direction hasn't changed.\n\"So we know it is going to be difficult but we have to be focused and believe in what we are doing and be optimistic.\"\nWith Motherwell just five points behind in seventh, Thelin is well aware of the challenge his side face.\n\"They are on a good run right now, they score goals, two goals every game [in each of their last three matches] and some good results,\" he said of Michael Wimmer's side.\n\"They have changed some parts in their way of playing with the intensity, build-up and the attacking so it is a different team from the one we played against last time.\"", "url": "https://www.bbc.com/sport/articles/cn7v7dkdpg1o"}