{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:56:14", "date_modify": "2025-04-26 06:56:14", "date_publish": "2025-02-28 15:07:35", "description": "Shrewsbury boss Gareth Ainsworth says his team need no building up for any of their six-pointers, starting with Peterborough.", "filename": "sport_football_articles_clyrr32dv0xo_1745650574.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5618/live/81beacc0-f5d9-11ef-896e-d7e7fb1719a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_clyrr32dv0xo_1745650574.html", "title": "Gareth Ainsworth: Peterborough-Shrewsbury game needs no extra hyping up", "title_page": "Gareth Ainsworth: Peterborough-Shrewsbury game needs no extra hyping up  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Shrewsbury Town boss Gareth Ainsworth does not like the term 'six-pointer' - but he admits his relegation-threatened side are now facing four of them in a row as they prepare for Saturday afternoon's date with fellow League One strugglers Peterborough United.\nTown lie 23rd in League One, seven points adrift of safety - but knowing that, aside from meeting 20th-placed Posh, they then play the next three sides currently around them in the table - home games against Bristol Rovers (19th) and Burton Albion (21st), either side of a trip to Exeter City (18th).\nDarren Ferguson's lowly Posh turned the League One table on its head on Wednesday night when they stunned much-fancied automatic promotion candidates Wrexham to win a dramatic EFL Trophy semi-final at the Racecourse Ground.\n\"Nobody would have expected us to beat Birmingham City or Wrexham. But what an opportunity it is to go and get points off some of the teams around us,\" Ainsworth told BBC Radio Shropshire.\n\"The cliche is that they are six-pointers, which I don't like as you never do get six points.\n\"But I do understand what they're saying as it could be three points and would stop one of our rivals getting three points.\n\"With the modern world of social media being like it is, just how great this game is. You can't go anywhere now without seeing a league table, or seeing it mentioned on TV.\n\"There is no way you need to build this game up any more than it is. I don't know to go in that dressing room to tell my lads how massive these games are.\n\"You always have to be one game at a time. If you start looking too far ahead, you get tripped up. But all I know is we're probably going to have to win seven games out of our last 13 - and all we can do is just carry on giving it a right go.\"\nAfter losing this season's first two games, Posh actually recorded their first win against Shrewsbury back in mid-August when Kwame Poku and Joel Randall bagged a brace each in the 4-1 win at Oteley Road.\nFrom still being in the top half in late November, Ferguson's side then won just three times in 16 League One games, instigated by the loss of Poku after hamstring surgery, while Randall left for Bolton in January - and had drifted to within three points of danger.\nWednesday's win to book a Wembley clash with another big-spending trans-Atlantic owned side Birmingham, could now prove a real springboard.\nBut, while Poku is shortly due to be fit to return, securing their third-tier status remains a priority above that Wembley date on 13 April.\n\"Wembley is a massive bonus and it's wonderful to be there again,\" said Posh's match-winning keeper Jed Steer. \"But we have to put that to one side and focus on Saturday. It's a big game for both teams. But we simply have to start winning more league matches.\"\nSince bringing Steer back in for the 3-2 Trophy quarter-final win over Cheltenham on 5 February, Posh have had four games - all on the road.\nThey lost in the last minute at Charlton, drew at Stevenage then won last Saturday at Huddersfield before the midweek penalties drama.\n\"Saturday was a big win,\" said Steer. \"We got a good point at Stevenage and were unlucky to conceded in the last minute at Charlton.\n\"But we're moving in the right direction. We have to see the semi-final win as a building block to go and get us another result.\"", "url": "https://www.bbc.co.uk/sport/football/articles/clyrr32dv0xo"}