{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:12:14", "date_modify": "2025-04-26 04:12:14", "date_publish": "2025-03-04 12:30:22", "description": "The incident in which Gervonta Davis was allowed to take a time out in round nine of his controversial draw with Lamont Roach Jr is to be reviewed by the New York Athletic Commission.", "filename": "sport_boxing_articles_cedlgy1v355o_1745640734.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3768/live/32767170-f8ef-11ef-aa9e-0529c5c73157.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_boxing_articles_cedlgy1v355o_1745640734.html", "title": "Gervonta Davis: Controversial knee decision in Lamont Roach Jr draw under review by New York State Athletic Commission", "title_page": "Gervonta Davis: Controversial knee decision in Lamont Roach Jr draw under review by New York State Athletic Commission - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The incident in which Gervonta Davis was allowed to take a time out in round nine of his controversial draw with Lamont Roach Jr is to be reviewed by the New York Athletic Commission.\nDavis, 30, took a knee in the fight, but the referee did not rule it as a knockdown and the American was allowed to wipe his eyes with a towel.\nThe fight was scored a majority draw, two scorecards marking it 114-114, with a third giving it to Davis 115-113, but a knockdown for Roach would have given him the win had the rest of the fight remained unchanged.\nThe commission said a \"technical issue\" prevented the use of a replay within the \"usual allotted time for review\", so they relied on the referee's in-ring decision.\nDavis said grease from his hair was dripping into his eyes and that is why he took a voluntary knee.\nThe commission made no mention that the result could be overturned.\nIt did say in a statement that it wanted to \"ensure technical issues do not occur in the future that prevent the delivery of ringside instant replay feeds to the commission's officials when needed\".\nDavis retained his WBA lightweight with the draw but faced immediate calls for a rematch against WBA super-featherweight champion Roach, who had started the contest as the underdog.\nAfter initially ruling out a rematch with 29-year-old Roach, Davis then said on social media: \"Say no more. I'm pushing for the rematch. The rematch can be soon too, like end of May.\"", "url": "https://www.bbc.co.uk/sport/boxing/articles/cedlgy1v355o"}