{"authors": ["Ceri Coleman-Phillips", "www.facebook.com"], "date_download": "2025-05-20 14:55:54", "date_modify": "2025-05-20 14:55:54", "date_publish": "2023-07-28 02:51:27", "description": "Gym owner Moritz Neumann from Tenby heads to the CrossFit Games in Wisconsin aiming to be part of the \"world's fittest team\".", "filename": "sport_wales_66258353_1747752954.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7455/production/_130518792_indireels.00_24_08_25.still008.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_wales_66258353_1747752954.html", "title": "2023 CrossFit Games: Wales' Moritz Neumann aims to be part of 'world's fittest team'", "title_page": "2023 CrossFit Games: Wales' Moritz Neumann aims to be part of 'world's fittest team' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The opportunity to fly the Welsh flag at the CrossFit Games fills Moritz Neumann with immense pride.\nThe 28-year-old Pembrokeshire gym owner is one fourth of the only British team to qualify for the global Games which feature the most elite of athletes.\nHeld in Wisconsin, USA, on 1-6 August, they are designed to be the ultimate test of strength, endurance and mental toughness.\nNeumann is the only Welsh athlete this year and competes for Team Rotherham.\nHe along with Dan Tai, Georgia Davenport and Alex Demetriou qualified at the European semi-finals in Berlin in June, an achievement in itself given the late withdrawal of original member Sapphire Goddard who ruptured her anterior cruciate ligament (ACL) in training.\nThey head to the United States as one of 40 teams vying for the title \"the world's fittest\".\nThe trip reflects Neumann's rapid progress in the sport. He only started in 2019 having previously played semi-professional rugby and completed two Ironman triathlons.\n\"I watched a Netflix documentary one weekend, then on the Monday I went to my first CrossFit class and here I am now,\" he said.\nNeumann opened his own CrossFit gym just outside Tenby after the Covid pandemic.\n\"I have loved it, especially the community aspect and helping people, it's incredible,\" the former lifeguard told BBC Sport Wales.\n\"It is addictive. You're always chasing that next level, but everyone's fitness journey is different, everyone is doing it for a different reason.\n\"That's the important thing to understand. When you're in a room full of people, you're in your own lane and see your own progress, not the person next to you.\"\nNeumann, who counts Wales rugby union international Lisa as one of four siblings, started to get the bug for competition and has competed all over England, France and even in Miami at the start of 2022.\nIt was flying home from that US trip when he got the text from Tai asking him to be part of Team Rotherham.\n\"They are five hours away in the car, so initially I was like 'I can't commit'... and then after a few days I thought, 'why not?' It's a great opportunity and you never know what might come of it,\" he recalled.\nThe team have already travelled to the US to acclimatise to the weather, and Neumann says while they \"can't wait to get stuck in\", they are realistic about their chances this year.\n\"It's not really one of our goals this year to be on that podium, especially with what's happened with our team along the way, but I do think that in the future we can be a really competitive team,\" he said.\n\"It's all about taking in that experience and trying not to let it get the better of you.\"\nThe 40 teams from all over the world will gather in Madison along with 40 men and 40 women in the individual events.\nThey will not know the format until the opening day of the competition, but they are designed to push athletes to their absolute limits.\n\"They want to test the best athletes and the best teams and for that they need to give those athletes a broad range of tests,\" Neumann explained.\n\"Yes they need to test strength, but they also need to test endurance and gymnastic ability.\"\nMental strength also comes into play as they athletes push through the pain barrier.\n\"You're trying to go faster, you're trying to go heavier, you're trying to endure it for a little bit longer every single time, that's the whole part of training for competition, you're always trying to out-train your competitors,\" Neumann added.\nNeumann, who grew up in Britain's smallest city of St Davids, will be the only Welsh representative at the Games this year.\nBut at 6ft 2in and 16 stone, Neumann is anything but small - he can deadlift an impressive 260kg, more than 40 stone.\nHe says he has been blown away by all the support as he takes the Welsh dragon across the pond.\n\"It's really nice to see all the members in my gym getting behind me, wishing me luck,\" he added.\n\"When I came back from Berlin, they all said they had watched on TV.\"\nNo doubt all eyes will again be on Madison next week, as the \"fittest on Earth\" prepare to do battle on the gym floor.", "url": "https://www.bbc.com/sport/wales/66258353"}