{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:26:48", "date_modify": "2025-04-26 04:26:48", "date_publish": "2025-03-03 11:25:00", "description": "Comments on social media body-shaming Britain's Commonwealth 10,000m champion Eilish McColgan are \"ridiculous and stupid\", says her mother and coach Liz.", "filename": "sport_athletics_articles_c70e6nej14zo_1745641608.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e2c5/live/bc435d90-f823-11ef-a033-b58d3bfaf1a1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_athletics_articles_c70e6nej14zo_1745641608.html", "title": "Eilish McColgan: Mother Liz says body-shaming 'demeaning and abusive'", "title_page": "Eilish McColgan: Mother Liz says body-shaming 'demeaning and abusive' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Comments on social media body-shaming Britain's Commonwealth 10,000m champion Eilish McColgan are \"demeaning and abusive\", says her mother and coach Liz.\nScot Eilish, who is training for her first London Marathon next month, posted a video on Saturday showing her running on a treadmill, but some viewers questioned if she had an eating disorder.\nHighlighting some messages in a subsequent social media post, Eilish wrote: \"Some people have no comprehension of how much you have to fuel your body to do this type of training. Bunch of clowns.\"\nLiz, an Olympic 10,000m silver medallist and former world champion, replied to that post, saying: \"Stop the jealousy and abuse of women athletes online by posting ridiculous and stupid comments.\n\"My concern as a parent is not for Eilish as she is of a strong enough character to deal with these people.\n\"My concern is for other kids, athletes that are not so strong of character, to deal with demeaning and abusive comments on their appearance.\"\nIn 2019 Eilish responded to social media comments about her weight by saying: \"Go body-shame elsewhere.\"\nBritish 1500m champion Neil Gourley also condemned the \"horrible behaviour\" directed towards Eilish, and added that she was a \"role model\" for calling it out.\n\"I've been fortunate enough in my career to not receive a whole lot of that side of things. There is a misogynistic element to it and it really is an embarrassing thing to have to look at,\" Gourley told BBC Scotland.", "url": "https://www.bbc.co.uk/sport/athletics/articles/c70e6nej14zo"}