{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:58:23", "date_modify": "2025-05-21 06:58:23", "date_publish": "2025-01-04 10:43:36", "description": "Elena Rybakina says she was never mistreated by her former coach Stefano Vukov, who has been suspended by the WTA.", "filename": "sport_tennis_articles_c4gldyw0wr9o_1747810703.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/68a2/live/9445a320-ca79-11ef-a14f-a75f9fed2d4b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_tennis_articles_c4gldyw0wr9o_1747810703.html", "title": "Elena Rybakina defends former coach Stefano Vukov after WTA suspension", "title_page": "Elena Rybakina defends former coach Stefano Vukov after WTA suspension - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "World number six Elena Rybakina says her former coach Stefano Vukov \"never mistreated me\" after he was provisionally suspended by the WTA while an investigation into his behaviour towards the player continues.\nEarlier this week, the 25-year-old 2022 Wimbledon champion from Kazakhstan said Vukov, who was part of her team when she won the title, was re-joining her team.\nBut the WTA has told BBC Sport the 37-year-old Croat is currently banned after allegedly breaching the WTA's Code of Conduct.\nVukov, who began coaching Rybakina when she was a teenager, denies any wrongdoing.\n\"I can only say, and I said it already before, that he never mistreated me, it was never anything like that,\" said Rybakina after Kazakhstan's defeat by Poland in the semi-finals of the United Cup in Sydney on Saturday.\n\"Stefano is re-joining the team because I know the person for six years and there's a lot of things we can do outside of the court too.\"\nShe added: \"Of course I'm not really happy with the situation. I'm not happy with the comments which I see, especially from the people who are on the tour. It's active coaches, commentators. I don't think that it's fair.\"\nIt is not clear whether Rybakina herself, or someone else, raised the complaint against Vukov which began the current investigation.\nThe provisional suspension means Vukov will not receive accreditation for WTA events, stopping him from going into player-only areas which include the practice courts, other training facilities and restaurants.\nConcerns have regularly been raised over the past few seasons about Vukov's behaviour towards Rybakina.\nThe manner in which he talks to her - on and off court at tournaments - has come under scrutiny, although it is not known exactly which part of the WTA's Code of Conduct he is alleged to have broken.\nOn Thursday, he told The Athletic - which first reported the story about his provisional ban - that he \"never abused anyone\".\nThe partnership ended before last year's US Open and she appointed Goran Ivanisevic as her new coach.", "url": "https://www.bbc.com/sport/tennis/articles/c4gldyw0wr9o"}