{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:51:29", "date_modify": "2025-05-20 13:51:29", "date_publish": "2023-07-31 17:56:12", "description": "Newcastle United: Eddie Howe on Harvey Barnes and Sandro Tonali", "filename": "sport_articles_cp4nnppzkpvo_1747749089.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0ada/live/8676a070-2fc8-11ee-8442-1dafcc0b9fce.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cp4nnppzkpvo_1747749089.html", "title": "Newcastle United: Eddie Howe on Harvey Barnes and Sandro Tonali", "title_page": "Newcastle United: Eddie Howe on Harvey Barnes and Sandro Tonali - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Newcastle boss Eddie Howe has called the final pre-season games a \"rehearsal for the Champions League\" and believes supporters will \"fall in love\" with new signings Sandro Tonali and Harvey Barnes.\nHowe's side are unbeaten in pre-season so far and take on Fiorentina and Villarreal before the Premier League begins with the visit of Aston Villa on 12 August.\nHowe feels the \"high-class opposition\" will offer insight into the standards of Champions League football and on his two eye-catching recruits added: \"The supporters will hopefully fall in love with both players I think. Sandro comes with an incredible reputation and, from what I've seen in the very short time that we've been together, that reputation is there on merit. He's an unbelievable footballer, a lovely lad as well, really good mentality. I think they'll love watching him play in the black and white shirt.\n\"The same for Harvey. He's an outstanding goalscorer. He's scored goals in the Premier League now for the last four years and he's been a high-class performer for a very strong Leicester team.\n\"So I think they are great additions. They are both great people and we look forward to their first experience at St. James' Park.\"", "url": "https://www.bbc.com/sport/articles/cp4nnppzkpvo"}