{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:37:13", "date_modify": "2025-04-26 03:37:13", "date_publish": "2025-03-08 00:00:00", "description": "Follow live text commentary, score updates and match report from Falkirk vs Dunfermline Athletic in the Scottish Championship.", "filename": "sport_football_live_cr52855p7pnt_1745638633.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4f80/live/33e39b50-fc37-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_cr52855p7pnt_1745638633.html", "title": "Falkirk vs Dunfermline Athletic: Scottish Championship stats & head-to-head", "title_page": "Falkirk vs Dunfermline Athletic: Scottish Championship stats & head-to-head - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A first-half Brad Spencer goal was enough for Scottish Championship leaders Falkirk to secure all three points against Dunfermline Athletic and increase their advantage to six points.\nThe home side wasted no time in putting the Pars defence under pressure and duly took the lead after six minutes.\nScott Arfield worked the ball in from the right and played in striker Barney Stewart, who laid it off into the path of Spencer. The midfielder slotted home into the bottom corner with ease.\nThe visitors thought they had equalised soon after when Chris Kane knocked the ball home, only for referee Calum Scott to blow for a handball, much to the disgust of the Pars players and bench.\nSpencer came close to adding a second in the second half but his right-foot drive was just inches the wrong side of the post.\nDunfermline were being watched live for the first time by new owner James Bord but there was little for the Las Vegas-based entrepreneur to enjoy.\nAnd it was the home fans who were jubilant at the full-time whistle as their side went five games unbeaten.\nSecond-bottom Dunfermline remain a point off Hamilton Academical and are seven points above Airdrieonians.\nFalkirk manager John McGlynn: \"I think we deserved it. We just needed a second goal. Even in the first half we had opportunities, getting into good positions but we just couldn't get anyone on the end of it.\n\"I thought we played well and at this stage it's all about winning. That is our third clean sheet in a row, which I am really pleased about because we were in a period where we were losing two goals a game - I'm glad we have stopped that.\n\"We are not getting carried away. It's a nice cushion but that's all it is. We take one game at a time, that will be our focus and that's how we are going to continue to do it.\"\nDunfermline Athletic manager Michael Tidser: \"We huffed and puffed. You could see in the second half we were more on the front foot. We were trying to get the ball forward quicker.\n\"We looked a bit inexperienced and didn't do some of the things we worked on during the week in terms of trying to get the wide men coming inside. It's so frustrating.\n\"I think there are eight games to go and it will chop and change until the end of the season. You can't feel sorry for yourself. Of course I'm hurting, I can feel it in the pit of my stomach but you need to move on and get on with it and analyse what you could have done better.\"", "url": "https://www.bbc.co.uk/sport/football/live/cr52855p7pnt"}