{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:38:03", "date_modify": "2025-05-21 04:38:03", "date_publish": "2025-01-18 00:00:00", "description": "Hibernian make their way through to the Scottish Cup last 16 after a confident and comfortable victory against sixth tier Clydebank.", "filename": "sport_football_live_c0lzp61g4lxt_1747802283.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c0lzp61g4lxt_1747802283.html", "title": "Hibernian vs Clydebank: Scottish Cup stats & head-to-head", "title_page": "Hibernian vs Clydebank: Scottish Cup stats & head-to-head - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Hibernian made their way through to the Scottish Cup last 16 after a confident and comfortable victory against sixth tier Clydebank.\nDavid Gray had made five changes to the side that swept away Motherwell last weekend in the Premiership but it was clear from the opening whistle that there was to be no let up in their performance.\nIndeed it took only 90 seconds for the 2016 winners to take the lead.\nJunior Hoilett dispossessed full-back Adam Hodge before firing a cross into the box, where Martin Boyle had a simple task to knock home from close range.\nRudi Molotnikov came close to adding a second soon after but the Scotland under-18 international did find the net a minute into the second half.\nChris Cadden played in Boyle down the right and his deep cross to the back post was nodded home by the teenager to ease any thoughts of a Clydebank comeback.\nAnd the tie was over just before the hour when Boyle fired home his second, and Hibs third, when he converted a Molotnikov cross after the visitors failed to clear.\nThe 2,500 Clydebank fans who made their way to Easter Road had little to shout about as their team had few sights of goal.\nAnd only two terrific stops by Andy Leishman from Hoilett and Lewis Miller late on denied Hibs a fourth goal.\nBut Clydebank head back west in the knowledge their players gave their all and can leave the capital with their heads held high.\nHibernian head coach David Gray: \"Some massive credit to Clydebank. We scored within the first minute, so for them to keep going the way they did, was fantastic.\n\"I thought at times we were a wee bit sloppy in the first half, but in the second half, miles better. To have the clean sheet, and be in the next round, is really positive.\n\"We will see who we get and then move on from there.\"\nClydebank manager Gordon Moffat: \"It wasn't like they cut us open, it was a wee misjudgment by one of our lads, and you lose a goal.\n\"You're a wee bit worried at that point, but we settled ourselves and found our feet and we managed to do okay in the first half.\n\"I thought in the final third, we could have maybe done a wee bit better, but second half we looked like a team that hadn't played for five weeks against a full-time team that's playing every few days.\"", "url": "https://www.bbc.com/sport/football/live/c0lzp61g4lxt"}