{"authors": ["Holly Bacon", "www.facebook.com"], "date_download": "2025-05-21 05:25:15", "date_modify": "2025-05-21 05:25:15", "date_publish": "2025-04-03 13:50:44", "description": "Graham Potter press conference: West Ham vs Bournemouth preview", "filename": "sport_football_articles_c87pxngjyd8o_1747805115.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/414f/live/cdf05660-d19f-11ef-9fd6-0be88a764111.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c87pxngjyd8o_1747805115.html", "title": "Graham Potter press conference: West Ham vs Bournemouth preview", "title_page": "Graham Potter press conference: West Ham vs Bournemouth preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Potter said Jean-Clair Todibo trained on Thursday and \"felt a lot better\". Mohammed Kudus was in light training and both have a chance of being involved at the weekend. Emerson \"felt something\" towards the end of Tuesday's defeat at Wolves but it is \"nothing too serious\" and he should be available.\nOn Todibo, he added: \"He just felt worse and worse as the day went on [Tuesday]. We thought he could help us off the bench but he started to feel worse so, in the end, he couldn't come on. We'd have liked him to have started but he couldn't. It's just off the back of Ramandan as well so we have to take all those things into consideration. He was just too poorly to play.\"\nPotter was also asked about the remainder of the season: \"You want to finish as high as you can but, at the same time, finish the season off in a good way so you've got positivity, progress and also information in terms of what we need to do in the summer and how we can improve things.\"\nHe added: \"I don't think you can dismiss the league table. At the same time, we know - from an ambition perspective - where we are now is not where we want to be. We have to acknowledge that, but in the meantime we have to do our best in every single game.\"\nOn Evan Ferguson, he said: \"I think a goal helps - he had a goal for his international team. You have to remember where Evan has come from - his situation and context. He has been out for a long time with injuries. He's a young player building up minutes and time. I felt it was the right thing to give Fullkrug some time at half-time to affect us in a different way.\"\nThe West Ham boss said they have to keep working: \"We went from maybe not being competitive in games to being pretty much competitive in all the games. Nearly is not enough - so we have to carry on working with every aspect we can.\"\nPotter was also asked whether he is thinking ahead to next season. He said all he is thinking about is the weekend and if you think too far ahead in football it is a mistake.", "url": "https://www.bbc.com/sport/football/articles/c87pxngjyd8o"}