{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 08:07:42", "date_modify": "2025-04-26 08:07:42", "date_publish": "2025-02-26 14:06:31", "description": "Former Republic of Ireland international Andy Reid believes Stoke City must give boss Mark Robins time and space to build the team.", "filename": "sport_football_articles_cq5zg1pv3zqo_1745654862.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3959/live/69d049b0-f44a-11ef-837a-fdc1fd381948.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cq5zg1pv3zqo_1745654862.html", "title": "Andy Reid: Stoke City must give boss Mark Robins time to build", "title_page": "Andy Reid: Stoke City must give boss Mark Robins time to build  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Stoke City and their supporters must be patient with boss Mark Robins and give him time to build, according to former Republic of Ireland international Andy Reid.\nThe Potters have won only two of Robins' 10 Championship games in charge and are just five points clear of the relegation zone after losing 3-1 at home to Middlesbrough on Tuesday night.\n\"They need to give Mark Robins the time and backing to bring in players. He knows players and how to develop them,\" ex-Nottingham Forest and Tottenham Hotspur midfielder Reid told the BBC's Football Daily podcast.\n\"I do wonder what the strategy will be at Stoke because it's been so bitty.\n\"Different managers bring in a few players and the next manager comes in and they don't like those players and then the cycle begins again and they haven't been able to get it right.\"\nRobins became Stoke's fifth permanent boss in under three years when he was appointed on New Year's Day following the brief and ill-fated reign of Narcis Pelach.\nThe Potters were 18th when Robins took over, with the 55-year-old signing a three-and-a-half-year contract.\n\"What I'd be saying if I was the owner or (sporting director) Jon Walters is let's commit to Mark Robins for the rest of this season and the season after and then review it,\" Reid added.\n\"Just give him some time to build something because Stoke need that stability - I don't think he needs loads of money as he's shown he can spot a player and can make them better.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cq5zg1pv3zqo"}