{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:54:02", "date_modify": "2025-05-20 11:54:02", "date_publish": "2023-08-05 20:37:54", "description": "England's disappointing defeat by Wales will be a \"positive\" for the team in the long term, says head coach Steve Borthwick.", "filename": "sport_rugby-union_66419097_1747742042.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1442/production/_130668150_gettyimages-1594389709.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-union_66419097_1747742042.html", "title": "Steve Borthwick: England's 20-9 defeat by Wales will be a 'positive' in long term", "title_page": "Steve Borthwick: England's 20-9 defeat by Wales will be a 'positive' in long term - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England's 20-9 defeat by Wales will be a \"positive\" for the team in the long term, says head coach Steve Borthwick.\nEngland led 9-6 at half-time in Cardiff but struggled to impose themselves in a poor second-half performance.\nBorthwick, who names his World Cup squad on Monday, has three more warm-up matches before the tournament starts.\n\"Every one of these experiences will be positive for us as we build over the next few weeks to the World Cup,\" Borthwick said.\nEngland started the game brightly with fly-half Marcus Smith linking effectively with Harlequins team-mate Alex Dombrandt and former club-mate Joe Marchant.\nBut Borthwick's side failed to score a try from any of the early territory and offered little threat in a flat second-half display.\nSpeaking to Amazon Prime, Borthwick added: \"The positive is how many entries we got into the opposition 22 and into their scoring zone.\n\"I thought in the first half we created a lot of opportunities but turned over too much ball in the opposition 22.\n\"You can't do that in Test rugby, so immediately there are some areas for improvement.\"\nEngland failed to convert from two five-metre line-outs in the opening period and lost a further five line-outs in the second half.\nThere were also 20 handling errors across the 80 minutes.\nThe margin of defeat to a vibrant Wales side would have been worse had home winger Louis Rees-Zammit not had a late try ruled out after television replays showed he had knocked the ball on before grounding it.\nBorthwick chose to rest key personnel to give chances to some new faces, with flanker Tom Pearson making his debut from the start and fellow forwards Theo Dan and Tom Willis winning their first caps from the bench.\n\"There was a spell of two or three line-outs in a row where we made some interchanges that made things go into a standard that we wouldn't require,\" said Borthwick.\n\"In the first half I saw the foundations of a real strong set-piece and then in the second half both we and Wales changed personnel and that ascendency in the set-piece changed.\n\"Over the coming weeks the team will sharpen up. We're still in quite a big training phase and we will sharpen up over the next three games together.\"", "url": "https://www.bbc.com/sport/rugby-union/66419097"}