{"authors": ["Sarah Holt", "www.facebook.com"], "date_download": "2025-04-26 04:29:07", "date_modify": "2025-04-26 04:29:07", "date_publish": "2025-03-02 08:02:09", "description": "Adrian Newey says he's \"not making any predictions\" about his new role at Aston Martin, which begins on Monday.", "filename": "sport_formula1_articles_c4g000nnlxyo_1745641747.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6e88/live/be479210-f4ee-11ef-ae0a-4bca4f518eb0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_formula1_articles_c4g000nnlxyo_1745641747.html", "title": "Adrian Newey 'not making any predictions' as he starts work at Aston Martin", "title_page": "Adrian Newey 'not making any predictions' as he starts work at Aston Martin - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Adrian Newey says he's \"not making any predictions\" about his new role at Aston Martin, which officially begins on Monday.\nThe most famous designer in Formula 1 will join as the team's managing technical partner after nearly 20 years at Red Bull.\nNewey's start date means he is too late to influence the initial design of the team's 2025 car - but is in time to turn his attention to the major new technical rules coming to F1 in 2026.\n\"I'm just looking forward to it and what will be, will be,\" Newey told the BBC F1: Back at Base podcast.\n\"The first target really is to get to know everybody here, understand how everybody works, and try to integrate myself with everybody.\n\"It's talking to the drivers, it's talking to my fellow engineers, trying to bounce ideas off them. Getting that sort of creative flow going.\"\nNewey's arrival at Aston Martin will follow a surprise restructure before the 2025 season in which Andy Cowell took on the role of team principal, in addition to his position as chief executive officer.\nCowell takes over the team boss position from Mike Krack, who moves into a new role focused on performance at the race track.\nNewey, Krack and Cowell all feature in the BBC podcast F1: Back at Base - How To Go Racing, alongside drivers Fernando Alonso and Lance Stroll.\nThey will offer some continuity as Aston Martin aims to turn its multi-million pound factory regeneration into improved performance on the track.\nThe team started strongly in 2023 and 2024 but faded as both seasons progressed, eventually finishing fifth in the constructors' championship last year.\nAlonso clocked up 400 F1 race starts last season and the 43-year-old will start his 22nd season at the Australian Grand Prix, from 14-16 March.\nThe double world champion told the podcast: \"I've always been ready to commit to Formula 1. F1 is a very demanding sport. You have to sacrifice many things in life to be part of this sport and this environment that will need all your dedication.\n\"But, you know, when you love what you do, you can dedicate yourself for that.\n\"It's going to be another challenge with the 2026 cars. Formula 1 is always running behind the clock and we are facing the same problems. For us it's important to do a good 2025 season.\n\"Formula 1, you can never stop. If you stop two weeks, some of your competitors will try something different or will find a new philosophy; you know that the car will go immediately faster. So there is a never-ending search for perfection.\"", "url": "https://www.bbc.co.uk/sport/formula1/articles/c4g000nnlxyo"}