{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:17:03", "date_modify": "2025-04-26 06:17:03", "date_publish": "2025-03-01 18:44:02", "description": "After holders Cliftonville held on to beat Crusaders 2-1 at Seaview and book their place in the Irish Cup semi-finals, BBC Sport NI gets the views of Cliftonville boss Jim Magilton and Crues manager Declan Caddell.", "filename": "sport_articles_ckgd2r4eypno_1745648223.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4f28/live/8db75ba0-f6cc-11ef-a811-cd286d96b2f6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_ckgd2r4eypno_1745648223.html", "title": "Reds going 'all out' to retain Irish Cup - reaction", "title_page": "Irish Cup: Reds going 'all out' to retain Irish Cup - reaction - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "After holders Cliftonville held on to beat Crusaders 2-1 at Seaview and book their place in the Irish Cup semi-finals, BBC Sport NI got the views of Cliftonville boss Jim Magilton and Crues manager Declan Caddell.\nJim Magilton on the win:\n\"Massive result, we showed some character. Crusaders threw everything at us which we expected, we had to defend for our lives, but we scored two really two goals. We could have managed the game better but to win the game is huge for us.\"\nOn the goals scored by Ryan Curran and Alex Parsons:\n\"Two moments of real quality, it's a wonderful header from Ryan Curran, his performance was outstanding, and I'm really pleased for him and then Alex has a wonderful left foot and it was a magnificent finish. We had to hold on, our goalkeeper made an unbelievable save and we managed to get over the line.\"\nOn retaining the Irish Cup:\n\"We're going all out to retain the trophy, god knows what is going to happen in the semi-final, but it is an opportunity to bring our fans back to Windsor and that is what we are going to try and do.\"\nDeclan Caddell on the defeat:\n\"It was a game of fine margins, we started well and Cliftonville grew into the game and got their goal. It was a sloppy goal from us, a free header into the box which was very preventable. We had a lot of momentum at the start of the second half and Cliftonville's first attack of the half, they score.\n\"The players rallied and had a good go, we managed to pull one back and, on another day, you score from those two or three chances you create, we haven't, so congratulations have to go to Cliftonville.\"", "url": "https://www.bbc.co.uk/sport/articles/ckgd2r4eypno"}