{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:54:07", "date_modify": "2025-05-20 11:54:07", "date_publish": "2023-08-06 00:00:00", "description": "Relive Sunday's Championship action as Ipswich beat Sunderland, Leeds draw with Cardiff and Leicester beat Coventry.", "filename": "sport_live_football_66023086_1747742047.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0917/production/_130672320_gettyimages-1581054514.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_football_66023086_1747742047.html", "title": "Relive Sunday's Championship action as it happened", "title_page": "Relive Sunday's Championship action as it happened - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Up and running\nFT: Sunderland 1-2 Ipswich\nThere we go then.\nThat's the first weekend of the English Football League's grand return all over and done with, and it's like it's never been away.\nAcross the 72 clubs we've seen storylines written already and we're a game in.\nOf course, there's much more of the tapestry to be weaved, but for Leicester and Ipswich, differing fortunes last year have seen both make winning starts.\nSunderland and Coventry will have better days this year, while for Leeds and Cardiff, a point will feel different given the flow of the match.\nWe've a long way to go, and we'll be there for it all. Welcome back. Let's do it all again next weekend.\nUntil then, goodbye.\n'Town got off hook late on'\nSunderland 1-2 Ipswich\nAlex Mathie\nEx-Ipswich Town striker on BBC Radio Suffolk\nWe were sitting comfortably with 25 minutes to go and then we sat back and gave Sunderland a lifeline.\nAll credit to Sunderland when they went down to 10 men. They caused us problems.\nLooking at the balance of play, a draw would probably have been a fair result. We got off the hook late on.\n'Same old problems for Sunderland'\nSunderland 1-2 Ipswich\nGary Bennett\nEx-Sunderland defender on BBC Radio Newcastle\nSunderland battled on and battled on, but it's the same old problems.\nIpswich will be over the moon with the result, but we are desperate, and I mean desperate, for a striker.\nWe do not score any scruffy goals. We have to work hard to create our chances. We have to be nice and neat and play threaded balls.\nLook at George Hirst, who got the second goal, who worked hard and worked the channels and he got his reward.\nFULL-TIME\nSunderland 1-2 Ipswich\nThe Tractor Boys are up and running on their return to the Championship, as goals from Nathan Broadhead and George Hirst see Ipswich past Sunderland for a first win of the campaign.\nSunderland went down to 10 men on an evening where they had plenty of possession but no reward, Trai Hume sent off, and then a late goal from Dan Neil which set up a furious finale.\nBig test for the visitors, with Kieran McKenna's side just passing. There was a terrific show of character to get themselves into the game.\nSunderland won't define their season by this result, but they will want improvement moving forward.", "url": "https://www.bbc.com/sport/live/football/66023086"}