{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:51:52", "date_modify": "2025-05-21 03:51:52", "date_publish": "2025-01-05 19:46:38", "description": "Liverpool 2-2 Man Utd: What Arne Slot said", "filename": "sport_football_articles_cy893yd34npo_1747799512.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/28f6/live/468bd6f0-cb95-11ef-b5cd-c347d92cca11.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy893yd34npo_1747799512.html", "title": "Liverpool 2-2 Man Utd: What Arne Slot said", "title_page": "Liverpool 2-2 Man Utd: What Arne Slot said - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Liverpool manager Arne Slot has been speaking to BBC Radio 5 Live following the game: \"We started really well. We had three open chances in the game and then there was a period of time which was more difficult for us.\n\"It is difficult if you play against quality players that are playing in a low block, with only [Rasmus] Hojlund and [Amad] Diallo as the attackers.\n\"It's not always easy to find the gaps and that's what happened.\n\"Then being 1-0 down makes it even more difficult, but I was very happy with the mentality we showed afterwards going 2-1 up.\"\nSlot has also been speaking to Match of the Day about whether his side underestimated Manchester United: \"No, I don't think that has anything to do with it. It's just them going into a low block playing here.\n\"They have quality with the ball and without the ball. They are difficult to play through. It was so open when they started to play. You can see more how good they are if they are trying to play.\n\"For the first 75 minutes, [Andre] Onana played the ball long and every free-kick they got, they just hit it forward. In the last 15 minutes, you could see if they play over the ground, how good they are.\"", "url": "https://www.bbc.com/sport/football/articles/cy893yd34npo"}