{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:32:53", "date_modify": "2025-05-19 15:32:53", "date_publish": "2015-02-01 10:25:45", "description": "Ahead of the Six Nations opener against England, Wales fly-half Dan Biggar says a prolonged run in the team has helped him improve.", "filename": "sport_rugby-union_31066059_1747668773.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/80689000/jpg/_80689319_cdf_291114_dg_wales_v_south_africa_44.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_rugby-union_31066059_1747668773.html", "title": "Dan Biggar: Run in team led to Wales improvement", "title_page": "Dan Biggar: Run in team led to Wales improvement - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wales fly-half Dan Biggar says a prolonged run in the team has been the key to his improvement as a player.\nOspreys player Biggar, 25, has started Wales' last six matches, having previously been rotated with Scarlets' Rhys Priestland.\nBiggar believes that security has helped him develop his game.\n\"Having a run in the Welsh shirt has [given me] a little bit of confidence. I think I've relaxed a little bit due to that run in the shirt,\" said Biggar.\n\"The big thing has been not trying to force things. Maybe when I was given the shirt before I was trying to force things if it was a 50-50 offload, or trying to do everything perfectly.\n\"Whereas now international rugby people are going to make mistakes, there's no two ways about it. It's how you react to that.\"\nBiggar was named man of the match in Wales' last game, a 12-6 win over South Africa in November 2014.\nHe was praised for a performance which allied excellent tactical kicking with gutsy defending.\n\"I've tried to do the basics as well as I can - I think I've done that reasonably well over the last 12 months,\" added Biggar.\n\"Hopefully I can add a little bit more. But that's the big thing, really focusing on basics. Anything else is a bonus.\n\"You look at the artillery we've got in the side here and it's not my job to be making too many line-breaks, it's about putting people away who've got that x-factor.\n\"So if I can do my basics well, hopefully it provides the platform for others to do some special things.\"\nAs well as Biggar has played recently, however, he still does not take his starting place for granted, although he is almost certain to start in Friday's Six Nations opener against England in Cardiff.\n\"I feel at home around the environment, I'm familiar with calls, how the days work and everything like that,\" he said.\n\"I never feel comfortable in my position as we have Rhys [Priestland], who has come back into some really good form and Gareth [Anscombe] who's been playing well.\n\"I never feel comfortable in my position but it has been easier to fit in in terms of being confident in the surroundings and comfortable with the calls.\n\"It's been enjoyable and hopefully we can build up to a big game on Friday.\"", "url": "https://www.bbc.com/sport/rugby-union/31066059"}