{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:48:44", "date_modify": "2025-05-21 03:48:44", "date_publish": "2025-04-07 12:03:56", "description": "Hearts fan views: 'We are so far off the required level'", "filename": "sport_articles_clyqj30j9gdo_1747799324.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6d3e/live/c05b5690-139d-11f0-ba12-8d27eb561761.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_clyqj30j9gdo_1747799324.html", "title": "'We are so far off the required level'", "title_page": "Hearts fan views: 'We are so far off the required level' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Hearts fans, we asked for your views on the 1-0 defeat to Dundee United at the weekend.\nHere's what some of you said:\nDavid: Yet again when it really matters we can't get a result. Lack of concentration for the goal. The next two games are crucial for Neil Critchley, our form doesn't deserve top six as it stands.\nSteven: Eat, sleep, repeat. You know what's going to happen with Hearts every time they play - create chances, play some neat stuff, don't score, concede, get beat. The style of play doesn't work in the Premiership. Everyone in the stands can see it so why can't Critchley?\nGary: The doom and gloom merchants are out in force. We dominated the match but just couldn't score. As per usual Nick Walsh was way too quick to issue a red card, could he not have looked at the monitor? Hardly a James Tarkowski-esque challenge was it? This decision changed the game, the Tangerines once again steal the points at Tynecastle.\nDavid: Where do you start with Hearts? Another crunch match, thinking Petrocub here, and no change or improvement. Data, statistics, quotients, ratios, analytics, or whatever you want to call them do not score goals, players do. Perhaps concentrating on them, their abilities and some kind of tactical plan and game management plan might be worth a try.\nDonald: United came to play for a draw as a minimum, playing for time from the kick-off. Hearts were again tactically inept, sideways or backwards passing, Beni Baningime was the only one who tried in midfield. He had chances to shoot but never did it, kept offloading to static players. Team setup has zero pace and no movement up front to give options. As it stands, it's a bottom six finish, a relegation battle and a loss in the semi-final. Been a season ticket holder 40-plus years and a walk up decades before that, scunnered by the recent/current season performance.", "url": "https://www.bbc.com/sport/articles/clyqj30j9gdo"}