{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:47:47", "date_modify": "2025-04-26 07:47:47", "date_publish": "2025-02-26 23:28:24", "description": "Liverpool 2-0 Newcastle: What Howe said", "filename": "sport_football_articles_cm2dd8nnvkgo_1745653667.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e45d/live/28234b30-f499-11ef-839b-6909acee4532.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cm2dd8nnvkgo_1745653667.html", "title": "Liverpool 2-0 Newcastle: What Howe said", "title_page": "Liverpool 2-0 Newcastle: What Howe said - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Newcastle boss Eddie Howe, speaking to TNT Sports: \"We played OK tonight, decent performance. Disappointed with goals we conceded.\n\"The first goal we don't track him into the box. We're fighting in the game after that to try and get the next goal. But then we do exactly the same thing. Two soft goals.\n\"Callum [Wilson] will always back himself and we back him to take the chances, they're not easy opportunities. He played well tonight, led the line and played well.\"\nOn having no shots on target: \"Not good, can't sit there and say we planned that. We had opportunities, obviously you're not going to get an abundance of chances here so when you do you have to take them and we didn't do that tonight.\"\nOn lessons for facing Liverpool again in the Carabao Cup final: \"You always learn, sometimes you learn more in defeat than victory an two games against them this season we've been competitive but we have to perform better than today if we want to win the trophy.\n\"We need to find our best rhythm again, we have a few players out missing hopefully we can get them back. Big games, big moments in our season. We're still in both cups and we want to stay that way.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cm2dd8nnvkgo"}