{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:52:08", "date_modify": "2025-05-21 03:52:08", "date_publish": "2025-04-07 10:15:26", "description": "Cardiff City: Omer Riza aims to stretch unbeaten run at Preston", "filename": "sport_football_articles_cr78255k88go_1747799528.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/75d8/live/94a13e30-1397-11f0-b054-11b99aeb4b3e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cr78255k88go_1747799528.html", "title": "Cardiff City: Omer Riza aims to stretch unbeaten run at Preston", "title_page": "Cardiff City: Omer Riza aims to stretch unbeaten run at Preston - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "As the Championship season nears its conclusion, the battle for survival is intensifying as teams fighting to avoid relegation begin to find some much-needed form.\nSecond-from-bottom Luton Town are on a four-match unbeaten run, 21st-place Derby County had won four games successively before losing at Swansea City on Saturday, while Hull City in 19th have suffered only one defeat in their past six fixtures.\nThose performances have plunged Cardiff City into the drop zone, but they are starting to build some momentum too.\nThe Bluebirds' goalless draw at Queens Park Rangers on Saturday means they only trail Derby - who occupy the first safety spot - on goal difference, albeit a significant 10-goal difference.\nCardiff are now unbeaten in three games and hope to extend that run at Preston North End on Tuesday.\n\"We've picked up five points from 10, we're unbeaten in three and we'll look to take that into Preston,\" manager Omer Riza told BBC Sport Wales.\n\"It's a quick turnaround. We'll see how we turn the boys around, what they look like and we'll prepare accordingly.\"\nPreston are 14th in the table, seven points clear of the relegation zone and 12 points adrift of the play-off places.\nBut Riza dismissed the notion that Paul Heckingbottom's side have nothing to play for.\n\"No, not at all,\" he added. \"They've got a manager in Heckingbottom who expects his teams to play a certain way no matter what.\n\"It will be a tough game there and we'll be prepared for that game.\"\nMeanwhile, Cardiff hope to have the versatile defender-turned-midfielder Calum Chambers back for the trip to Deepdale after he missed the QPR draw.\n\"Chambo had a family issue so he got taken out of the squad late [before the game],\" said Riza.\n\"But everything's fine and hopefully Chambo will be back available for Tuesday.\"", "url": "https://www.bbc.com/sport/football/articles/cr78255k88go"}