{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:13:15", "date_modify": "2025-05-21 04:13:15", "date_publish": "2025-04-06 09:30:38", "description": "Swansea City: Alan Sheehan savours 'the love' from fans after Derby win", "filename": "sport_football_articles_cy5rk01kp3yo_1747800795.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8793/live/a5101860-12c8-11f0-b016-9502dca93ab5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy5rk01kp3yo_1747800795.html", "title": "Swansea City: Alan Sheehan savours 'the love' from fans after Derby win", "title_page": "Swansea City: Alan Sheehan savours 'the love' from fans after Derby win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Alan Sheehan savoured \"the love\" from Swansea City's fans after victory over Derby County put his side seven points clear of the Championship relegation zone.\nEom Ji-Sung's goal settled a low-quality match, the South Korean steering home at the far post to give Swansea a first win in four games.\nSwansea are up to15th in the table and host bottom club Plymouth Argyle on Wednesday. They know victory would take them beyond the Championship's traditional 50-point survival mark with five fixtures still to come in 2024-25.\nSheehan, Swansea's caretaker head coach for the remainder of the season, acknowledged that parts of his team's performance against Derby were not pretty.\nBut he saluted the supporters who gave him a rousing reception at full time.\n\"I thought the fans were really good,\" Sheehan said.\n\"I would have loved to score earlier, create more, but it's the way it is. At the end of the day, we sent them home happy.\n\"Would they be happy with some aspects of the play? Definitely not. But they saw a team fighting for each other and finding a way to win.\n\"The atmosphere at the end was great and I really appreciate the love they show me.\"\nThe Derby victory was a third in four home games since Sheehan took charge following the departure of Luke Williams in February.\nSheehan now has 11 points from seven fixtures at the helm – exactly the same record as the Irishman achieved during his spell as caretaker boss last season.", "url": "https://www.bbc.com/sport/football/articles/cy5rk01kp3yo"}