{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:43:43", "date_modify": "2025-04-26 03:43:43", "date_publish": "2025-03-05 08:21:25", "description": "Japanese World Cup-winner Yuki Nagasato, who made history by playing for a senior men's team in 2020, brings her trailblazing 24-year career to an end.", "filename": "sport_football_articles_cn48ldyv0vdo_1745639023.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/372a/live/348c57e0-f999-11ef-ae5c-2f8723cb2041.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cn48ldyv0vdo_1745639023.html", "title": "Yuki Nagasato: Japanese World Cup-winner and trailblazer announces retirement", "title_page": "Yuki Nagasato: Japanese World Cup-winner and trailblazer announces retirement - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Japanese World Cup-winner and trailblazer Yuki Nagasato, who made history by playing for a senior men's team in 2020, has announced her retirement from football.\nThe 37-year-old former Chelsea striker played 132 times for her country during a 24-year professional career which saw her lift the World Cup with Japan in 2011.\nIn 2020, she joined Hayabusa Eleven on loan, becoming the first female professional to play in a second division side in the Kanto Soccer League - five tiers below the top flight.\n\"For 30 years, ever since I first kicked a ball, football has been my life. I've chased the game, challenged myself and grown through every victory and defeat,\" Nagasato said on Instagram.\n\"The journey wasn't always easy but every moment had meaning. Retiring wasn't an easy decision but I'm excited for what's next.\"\nNagasato said her decision to join a men's side in 2020 was inspired by former USA player Megan Rapinoe's fight for equality.\n\"I thought I could show that women can also play in a men's team,\" she said.\n\"I want to help create a community where there is no boundary regarding gender or race.\"\nIn 2011, Nagasato came on as a substitute in the World Cup final as Japan beat the United States on penalties following a 2-2 draw after extra time.\nNagasato's club career saw her win the Champions League with German side Turbine Potsdam in 2010 before joining Chelsea in 2013.\nShe played 18 times for the Blues, scoring five goals, before further spells in Germany, the USA and Australia.\nNagasato, who also won an Olympic silver medal at the 2012 London Games, scored 58 goals for Japan and retires as her country's second-highest goalscorer of all time, behind Homare Sawa's 83.", "url": "https://www.bbc.co.uk/sport/football/articles/cn48ldyv0vdo"}