{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:05:34", "date_modify": "2025-05-19 15:05:34", "date_publish": "2015-02-13 14:07:11", "description": "Darren Clarke says he would \"love\" to be Europe's 2016 Ryder Cup captain at Hazeltine National in Minnesota.", "filename": "sport_golf_31455019_1747667134.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/80988000/jpg/_80988980_456269588.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_golf_31455019_1747667134.html", "title": "Ryder Cup 2016: Darren Clarke would 'love' to be Europe's captain", "title_page": "Ryder Cup 2016: Darren Clarke would 'love' to be Europe's captain - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Darren Clarke says he wants to be Europe's 2016 Ryder Cup captain at Hazeltine National in Minnesota, USA.\nThe Northern Irishman, who has won the cup four times as a player, expects an announcement on the new captain to be made next Wednesday, 18 February.\nClarke, 46, is favourite for the coveted role, ahead of Spain's Miguel Angel Jimenez.\n\"If it's Miguel, I would be delighted for him, but I would love to do the job,\" Clarke told BBC Northern Ireland.\n\"To be the captain is huge, but he is only there to steer the players. It's not about the captain, it's about the team.\"\nA five-man European Tour selection panel, including 2014-winning captain Paul McGinley, will make the decision.\nEurope retained the trophy at the 40th Ryder Cup 16½-11½ against the United States at Gleneagles in September.\nIt was the eighth win in 10 meetings for Europe.\nClarke added: \"I've got very, very special memories of the event and I'm fortunate to have played in many winning teams. Those memories I will cherish for ever.\"\nThe United States will host the 2016 Ryder Cup at Hazeltine between 30 September and 2 October.", "url": "https://www.bbc.com/sport/golf/31455019"}