{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:08:10", "date_modify": "2025-05-21 06:08:10", "date_publish": "2025-04-01 18:34:39", "description": "Schoeman fully focussed on Edinburgh despite potential Lions call-up", "filename": "sport_articles_cp8kmpylg70o_1747807690.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/58f1/live/ceae73a0-0f13-11f0-aaaa-c522a5fb13c3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cp8kmpylg70o_1747807690.html", "title": "Schoeman fully focussed on Edinburgh despite potential Lions call-up", "title_page": "Schoeman fully focussed on Edinburgh despite potential Lions call-up - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Edinburgh's Pierre Schoeman has vowed not to let a potential British and Irish Lions call-up distract from his Edinburgh form.\nThe Scotland loosehead has been mooted as a possible pick for Andy Farrell when he names his squad in early May, but 30-year-old is keen to stress he is fully focused on club matters.\nEdinburgh face South African side Lions in the Challenge Cup this Friday and are in the hunt for a URC play-off spot.\n\"It's always in the back of your mind,\" the prop said on the possibility of joining up with the Lions squad this summer. \"However, when we do our prep for the match on the weekend, it's not near what you focus on.\n\"You just focus on what's important now, and that is the Lions game this week. Everything else, you switch off. Once we come in here, we focus, we prep, and you make sure you're on it.\n\"There's no personal distractions, no future distractions. It's just about the present, delivering.\n\"It [the Lions] is obviously something I've written down as a goal, and hopefully it will be. But the only controllables you can have is play well for Edinburgh, do everything you can, leave no stone unturned.\"", "url": "https://www.bbc.com/sport/articles/cp8kmpylg70o"}