{"authors": ["Amy Canavan", "www.facebook.com"], "date_download": "2025-05-20 13:06:06", "date_modify": "2025-05-20 13:06:06", "date_publish": "2023-08-02 15:28:03", "description": "Hibernian overwhelmed Andorra's Inter Club d'Escaldes to progress to the third-round of Europa Conference League qualifying.", "filename": "sport_football_66383942_1747746366.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/11584/production/_130644017_20808894.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66383942_1747746366.html", "title": "Hibernian 6-1 Inter Club D'Escaldes (agg 7-3): Scottish side through in Europa Conference League", "title_page": "Hibernian 6-1 Inter Club D'Escaldes (agg 7-3): Scottish side through in Europa Conference League - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Hibernian responded emphatically to their first-leg Andorran embarrassment by thrashing Inter Club d'Escaldes to reach the third qualifying round of the Europa Conference League.\nThe Scottish Premiership side were 2-1 down heading into the game at Easter Road, but Martin Boyle's early double turned the tie.\nChristian Doidge scored an overhead kick, with Josh Campbell adding a brace and Elie Youan netting after the interval before a late consolation for the visitors.\nLee Johnson's side will welcome Luzern to the capital on 10 August, before the away leg the following Thursday in Switzerland.\nBoyle was the name that stood out on the team sheet and he was central to the comeback with two goals, the first after dashing on to a long ball, the second a clinical header.\nThe Australia international produced the goods when Hibs needed it most. How he has been missed.\nThat settled things after a nervy start. Goalkeeper David Marshall picked up a hamstring injury pre-match, meaning an abrupt debut for Jojo Wallacot.\nBut he hirpled off after 18 minutes, and Max Boruc - cousin of former Celtic player Artur - came on for his first senior showing just 24 hours after appearing for the development side against Formartine United. Quite the turnaround.\nAnother making his presence known around Leith again was Doidge. The striker, who spent last season on loan at Kilmarnock, acrobatically found the net following Will Fish's header from a corner to all but end the tie.\nIt was absolutely done just after the break. Campbell was gifted the opportunity to nod the ball home after another calamity at the back, before Youan's blistering burst and cross allowed him to roll in his second.\nSandwiched between that brace, Doidge was denied by the offside flag after burying a lovely little reverse pass from Dylan Levitt.\nNothing could stop Youan's effort from rippling the roof of the net, however. A deserved goal for the forward's efforts over the two legs.\nAngel de la Torre spanked in a late effort for the Andorrans but it was little consolation as their European adventure ended.\nHibernian manager Lee Johnson: \"I was delighted the crowd got to see new players play well, but also the old guard. We've been itching to get [Martin Boyle] back in. He's so dangerous in behind.\"\nOn the goalkeeping situation going forward to Sunday's game with St Mirren, Johnson added: \"That one's going to be tricky, we need to assess David and we've got Max Boruc.\n\"We've got the option of an emergency loan as well.\"", "url": "https://www.bbc.com/sport/football/66383942"}