{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:23:57", "date_modify": "2025-05-21 07:23:57", "date_publish": "2025-01-13 17:58:47", "description": "BBC Sport football expert Chris Sutton takes on Bank of Dave 2 stars Rory Kinnear and Dave Fishwick with his predictions for this week's midweek Premier League fixtures.", "filename": "sport_football_articles_czenzpj2eyyo_1747812237.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3003/live/94581ab0-d1c1-11ef-87df-d575b9a434a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_czenzpj2eyyo_1747812237.html", "title": "Premier League predictions: Chris Sutton v Bank of Dave 2 stars Rory Kinnear and Dave Fishwick", "title_page": "Premier League predictions: Chris Sutton v Bank of Dave 2 stars Rory Kinnear and Dave Fishwick - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Nottingham Forest are already this season's Premier League surprise package but could they upset leaders Liverpool again in Tuesday's top of the table clash?\n\"I love the fact that they could do the double over Liverpool after beating them at Anfield in September,\" said BBC Sport's football expert Chris Sutton.\n\"Forest - who I may have mentioned before were my boyhood team - are absolutely flying with seven straight wins in all competitions. Of course they will think they can get something out of this game too.\"\nSutton is making predictions for all 380 Premier League games this season, against a variety of guests.\nFor the midweek matches in week 21, he takes on actor Rory Kinnear, star of new film Bank of Dave 2, and the real-life person his character is based on, Burnley businessman Dave Fishwick.\nBank of Dave 2: The Loan Ranger is out on Netflix now. It is the sequel to the story - told with some artistic licence but based on true events - of how Fishwick, a self-made millionaire, opened his own bank to help out people in his hometown. Part two focuses on the payday loan industry.\nDo you agree with their scores? You can make your own below.\nThe most popular scoreline selected for each game is used in the scoreboards and tables at the bottom of this page.\nKinnear is a lifelong Celtic fan, but they only became his team by mistake.\nHe explained: \"I stayed in my cousin's old childhood bedroom in Edinburgh when we went to visit them, and there were pictures of players in green and white on the walls.\n\"I came back home to London and looked up who the team in green and white in Scotland were, and saw it was Celtic. I thought, right, if Johnny supports them then I will support them. That was me, from about the age of four.\n\"It was only many years later that I realised that they were Hibs players on the wall, and I had got the wrong team.\n\"He still supports Hibs, and we have been to a few Hibs-Celtic games together, so it now provides a nice little rivalry within the family.\"\nKinnear narrated Gareth Southgate's essay to England fans, external for Radio 4 when the Three Lions reached the final of Euro 2020 and Euro 2024, but he admits his international allegiances are \"complicated\".\n\"My mum is Irish and my dad was Scottish, while I have lived nowhere but England,\" he added.\n\"I support Scotland over England, Ireland over England and, if Ireland and Scotland play each other, I want it to be a draw.\n\"That's the same for the Six Nations as well as football - my granddad played rugby union for Scotland and the British Lions in the 1920s and then was one of the first ever dual code internationals when he moved to play rugby league for Wigan, and scored in the first Challenge Cup final at Wembley in 1929.\n\"So, Scottish rugby certainly takes a place in my heart, probably over any other, but what discounts me from being a true Scottish or Irish football supporter is that I don't mind England doing well as well.\"\nFishwick has strong connections to Burnley FC - he is a lifelong fan and for many years sponsored one of the stands at Turf Moor, which was named after him.\nHe is now an investor in the Championship club and is friends with the Clarets' American owner, Alan Pace.\n\"I was with Alan the other day and he has got some wonderful ideas,\" Fishwick told BBC Sport. \"He is a real ambassador for Burnley.\n\"It's not going to be as easy as last time but hopefully we can get promoted this season - it would mean such a lot for the community for us to be back in the Premier League, and it is so important for local pubs and businesses as well as the fans.\"\nFormer Clarets boss Sean Dyche had a cameo in the first Bank of Dave film, and Turf Moor played host to a charity fundraiser by Def Leppard - both appear in the sequel, too.\n\"I got on well with all of Burnley's managers but my favourite was Sean,\" Fishwick added.\n\"I used to see Sean in the pub and he would pull a chair over if I was having tea with my wife, and sit between us to have a chat.\n\"He was just one of the lads, the sort of people who are the proper part of football.\n\"Sean was still at Burnley when we were making the first Bank of Dave film in 2022. I thought it would be brilliant to get him involved, so I rang him up and told him I was outside with Netflix, doing some filming, and asked him if he would be in it.\n\"He said he had his shorts on and I said, well you will look good in them then. I told him to bring a football, and there he is. He's in it, how cool is that?\"\nChris Sutton, Rory Kinnear and Dave Fishwick were speaking to BBC Sport's Chris Bevan.\nBrentford 2-2 Manchester City\nI was hoping Brentford would have a real go at the FA Cup this season, but they made a load of changes for their tie with Plymouth, and they ended up on the wrong end of the biggest shock of round three.\nI can understand Bees' manager Thomas Frank's point of view, because he can argue his side have a busy schedule with some tough fixtures coming up - after this game, they host Liverpool on Saturday and I am there for Radio 5 Live.\nHe decided to give some fringe players an opportunity to get a game and impress him, against a struggling Championship team who had not won an away game all season, but it did not work out.\nThe Bees started the season with such a strong home record but Saturday's defeat means they have lost their past three matches there.\nManchester City, meanwhile, are starting to build some better form again, and their big win over Salford City at the weekend was their third in a row.\nI was a bit surprised about the news Kyle Walker could be leaving City. He has not had the best of seasons, but he has probably been the best right-back the Premier League has seen.\nWalker has been a huge part of what City have achieved under Pep Guardiola and I would be sad to see him leave the Premier League if he does go abroad.\nIn terms of this game, I feel like City are on a bit of a roll. I've already done something which I promised I wouldn't do in Fantasy Football, which is put Erling Haaland back in my team, and captained him.\nIt was a masterstroke from myself, and my assistant, because he scored twice in their last Premier League game against West Ham.\nI am expecting Haaland to carry on his goalscoring form here, and I feel like City are going to edge it. I don't think it will be easy, though, and I cannot see them keeping a clean sheet.\nSutton's prediction: 1-2\nRory's prediction: I am hedging my bets here a little bit because City are slightly resurgent, and I don't think they are done. 1-1\nDave's prediction: I had a chat with my right-hand man David Henshaw about these predictions earlier, so this is a joint effort. I was going to say 0-0 but I think there will be goals. 1-1\nChelsea 2-2 Bournemouth\nThis is going to be another close game. Chelsea really need to win it, after going four league games without a win.\nIt feels like the busy festive period has taken its toll on their young squad but they are not just going to give up on their title hopes, no matter how slim they are.\nBournemouth, who have gone eight league games unbeaten, are in much better form and I feel like I have doubted them too often when I have made my predictions this season.\nThe Cherries always create chances and score goals. I don't think that will change much even with Evanilson and Enes Unal both out injured, but will they be quite as ruthless? I am not sure - but that could just be me being too cautious about backing them, again.\nThe other part of my thinking here is that Chelsea are going to return to winning ways at some point. They are at home, and they should have beaten Crystal Palace in their last league game, so they could click again here.\nI just know that whichever way I go with this game, I am going to get it wrong. I suppose the safe bet is a draw, but I am not very confident about it.\nSutton's prediction: 1-1\nRory's prediction: A few weeks ago you would have said this is an easy home win. Now? I am not so sure. Bournemouth might just nick a late equaliser. 1-1\nDave's prediction: 2-1\nWest Ham 3-2 Fulham\nGraham Potter's aim will be to win his first home game as West Ham boss, but I am not sure where his side's goals are going to come from.\nThe Hammers were already short up front and now Nicklas Fullkrug has been sidelined by a hamstring injury. He was one of the players I said people should watch out for this season, but that has turned out the way most of my predictions do.\nFulham are a good team, but some of their recent results have been a bit strange.\nThey are eight league games unbeaten and safely into round four of the FA Cup but that run includes a couple of home draws, against Southampton and Ipswich, where I expected them to win.\nI am still erring more towards a Fulham win than towards West Ham but, because Marco Silva's side have turned into draw specialists, I am going to go for another draw here too.\nSutton's prediction: 1-1\nRory's prediction: This is not straightforward either because West Ham are absolutely unpredictable. 1-1\nDave's prediction: Fulham to win, definitely. 0-1\nNottingham Forest 1-1 Liverpool\nIs it fair to say Liverpool have gone a little bit flat recently?\nThat is probably a bit harsh, because they only lost narrowly to Tottenham in the first leg of their Carabao Cup semi-final, and they still should have beaten Manchester United in their last league game despite an underwhelming performance - they just weren't ruthless enough.\nArne Slot's side are still six points ahead of Arsenal and Forest, with a game in hand, but I think they could drop more points here too.\nThe Forest defence has been formidable and 'The Wood Chopper' [Chris Wood] up front has been superb. The likes of Morgan Gibbs-White have really impressed me as well.\nBasically, this is going to be a very tight game with not many goals in it, and I am not going to back against Forest even if there are many ways where I think Liverpool might sneak a victory.\nYou have got to earn the right to win the Premier League, and Liverpool have done brilliantly so far.\nWhen you are in a title race, there are always moments in the season where things can go against you a little bit, like they did against United, but they did not lose.\nThis might be a period where they do stumble a bit but the teams below them are going to have to really sustain their push.\nThat's not really happened so far because Arsenal and Chelsea are both having a bit of a wobble. If Liverpool do drop more points here, those two sides really need to make the most of it.\nSutton's prediction: 1-1\nRory's prediction: This is the game of the week. I heard on the radio that Forest have done the 'Merseyside Double' by beating Liverpool and Everton away in the same season for the first time since 1898-99, but I can't see any chinks in Liverpool's armour at the moment. 1-2\nDave's prediction: David and I chatted about this for around 10 minutes, because we disagreed. I thought Liverpool were going to win and he wanted to go for a draw. I'll go with what he said, because he did push for it. 1-1\nEverton 0-1 Aston Villa\nDavid Moyes is back in charge of Everton and has a really tough job on his hands. In terms of firepower, he is armed with a water pistol.\nHe has taken over a team which did not score enough goals under Sean Dyche. That was their biggest issue, and it is hard to see how Moyes can solve it with the same players that Dyche had.\nWith Jordan Pickford, James Tarkowski and Jarrad Branthwaite, Everton have got players who can hold them together at the back, but Moyes' conundrum is to increase their attacking threat, and that is going to be a struggle, especially in these early days.\nArmando Broja is injured again so maybe Moyes can get a tune out of Dominic Calvert-Lewin, but that is something none of the the past few Everton managers have managed to do, and I have even seen him being linked with a move away.\nI have got Aston Villa's Emi Martinez in my Fantasy team, and I see him as the best goalkeeper in the Premier League, but they always seem to concede silly goals.\nSo it is possible to get at Villa, I just don't see Everton managing it.\nI don't like talking about myself much but my last goal as a professional footballer was a clever header in a Villa win over a Moyes' Everton team at Goodison Park, and I am going for the same outcome here.\nSutton's prediction: 0-2\nRory's prediction: This was the only Bank of Dave link, until Dyche got sacked. 1-2\nDave's prediction: If Dyche was still in charge I'd want to say Everton will win, but Villa are going to take it. 1-2\nNewcastle 3-0 Wolves\nThis is pretty straightforward as far as predictions go.\nNewcastle are on for a domestic Treble this season - well, on current form anyway - and I don't see their eight-game winning streak stopping here.\nWolves had made a good start under new boss Vitor Pereira but they had their bubble burst by Nottingham Forest in their last league game, and I don't see them dealing with the Magpies' firepower.\nAlexander Isak and Anthony Gordon have been great and Jacob Murphy is absolutely flying. I am really pleased for Murphy because a lot of people forget about him - but I haven't, I have got him in my Fantasy team.\nSutton's prediction: 3-0\nRory's prediction: I have just gone for an easy home win. 2-0\nDave's prediction: Eddie Howe is another of our old managers, and a friend of mine. He is a lovely family man. I am not sure how much by, but Newcastle are going to win this. 2-1\nArsenal 2-1 Tottenham Hotspur\nArsenal have had a bad week and right now it looks like Tottenham have a better chance of winning a trophy this season than they do.\nPeople are quite rightly pointing out that the Gunners are missing chances and, with Bukayo Saka out injured, they are just lacking that spark in attack.\nHaving said all that, maybe they will find it again here, because I think the way Spurs play will suit Arsenal.\nBy that, I mean Mikel Arteta's side can soak up pressure and counter-attack, and even without Saka or a recognised centre-forward, I think they will get chances in this game. It is whether they take them this time. I am backing them to stick a couple away.\nOf course this derby is really important to Ange Postecoglou and Tottenham in their situation, but the expansive way they play means it is tall order to expect an unfamiliar defence and new goalkeeper to step up again.\nI do see Spurs scoring, but they give up a lot of chances. Arsenal have to win this game to hang on in the title race, and I think they will.\nSutton's prediction: 2-1\nRory's prediction: It's been hard seeing Ange struggling because there are not many Celtic fans who begrudge him leaving us. He set Celtic up so beautifully and we were an absolute joy to watch under him. The injury situation has not helped him at Spurs, and while he might hopefully have some people back, I think Arsenal will be too strong. 3-2\nDave's prediction: David wasn't sure about this, but this one is his prediction, not mine. 1-1\nIpswich 0-2 Brighton\nI really don't want to say I am loving what Ipswich are doing - but I am!\nI mean, I would not move there or anything, but I am definitely becoming something of a fan of Kieran McKenna's side.\nI love watching The Traitors on BBC iPlayer and I don't feel like I am being a traitor myself here, but my old club Norwich's past two attempts to stay in the Premier League have been pitiful. We were not quite as bad as Southampton this season, but we were not far off it.\nIn contrast, Ipswich are really giving it a go at staying up. They scrap for everything, but they have organisation and quality too and I am really enjoying Liam Delap's displays up front.\nIt goes without saying their home form has not been great but after beating Bristol Rovers on Sunday they have now won their past two match at Portman Road, which will give them a bit more confidence for this game too.\nI am still going with Brighton to win this, though, and do the double in East Anglia this week.\nThe Seagulls put four goals past the Canaries at Carrow Road in the FA Cup at the weekend - I was right about that prediction even if it pained me to say it - and I have a feeling their eight-game winless run in the league ends here.\nBrighton are going to find it harder against Ipswich - they drew with them at the Amex Stadium in September - but they showed how good they can be against Arsenal last week, and their form is going to turn again soon.\nSutton's prediction: 1-2\nRory's prediction: Ipswich will be bouncing after some home wins at last but I am not sure they will manage a repeat. Brighton are a fun team to watch, and have another Celtic old-boy in Matt O'Riley so I am going for them to win and a brace from Matt. 1-3\nDave's prediction: 1-2\nManchester United 3-1 Southampton\nI have a lot of admiration for Manchester United's performance in their FA Cup win against Arsenal, especially to grind it out with 10 men for an hour after Diogo Dalot was sent off.\nBut these next three games, at home against Southampton, Brighton and then Rangers, are a very different test for them compared to their trips to the Emirates Stadium and Anfield in the past week.\nI don't want to devalue what United did against Arsenal or Liverpool but they were games where the expectation was not on them to get results.\nWe know United are good on the counter-attack away from home, but against Saints at Old Trafford the onus is on them to take the game to the opposition.\nThat is exactly where they have been struggling recently and, like I said on 606 on Sunday night, it would be just like Manchester United to be flat, find things difficult, and drop more points.\nSouthampton under Ivan Jurica are very different to the way they played under previous boss Russell Martin because most of the time they just lump it forward now, and they are far more direct.\nSaints may come into this game with a bit of confidence after beating Championship side Swansea in the FA Cup, ending a run of 12 games without a victory that went back to the start of November.\nI still think United will find a way to win, but I am not so sure it will be a completely routine one.\nI loved the way they defended against Arsenal and I thought it was quite pointed from Ruben Amorim when he came out afterwards and talked about that desire aspect.\nHe was speaking about traits which you would hope were pretty basic traits for any team to have - that ability to fight and scrap for a result.\nUnited have shown they can do that part, now they have to show their quality too.\nSutton's prediction: 2-0\nRory's prediction: I watched United's last home game, against Newcastle, and they were absolutely awful. I still can't see them not beating Southampton though. 2-0\nDave's prediction: United have had such a lot of stick that I think they are going to have a decent win. 3-1", "url": "https://www.bbc.com/sport/football/articles/czenzpj2eyyo"}