{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:45:41", "date_modify": "2025-05-21 06:45:41", "date_publish": "2025-03-30 16:39:41", "description": "'We need to manage the game' admits Docherty", "filename": "sport_articles_cn0wl9790reo_1747809941.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0226/live/7e9d87f0-0d85-11f0-90c7-5b6be6271dbf.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cn0wl9790reo_1747809941.html", "title": "'We need to manage the game' admits Docherty", "title_page": "'We need to manage the game' admits Docherty - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tony Docherty acknowledged Dundee need to get better at managing games, as they gave away another lead in their dramatic 4-3 loss to Rangers.\nDocherty's side have lost 23 points from winning positions in the Premiership this season, more than any other team.\n\"It does show you that [we have the quality],\" Docherty said after the match. \"That's the thing, when the dust settles, we need to focus on that we've got enough in the team to make sure that we win games, we see games out.\n\"We're getting towards the end of the season, we've got seven games now, it's important that – and it was a learning curve on Saturday – when we get in that position again, we need to see games out.\n\"We do need to manage the game.\"\nDundee were 3-1 up against Rangers after Scott Tiffoney's goal but they were soon pegged back before Cyriel Dessers' added-time winner.\n\"I've said that all season, we've had experience on the pitch and the personalities on the pitch need to make sure we see that out and we didn't do that.\n\"And that's the reason why we are having this aftermath at the moment. That feeling won't go away until we go into training and until we get set and get ready for St Mirren coming here. We need to make sure we put that right that.\"\nEqually as impressive as Dundee's capacity for capitulation is their goalscoring feats. The Dark Blues have scored 28 first-half goals in 31 games, only Celtic (42) and Rangers (29) have scored more in the Premiership this season.\n\"The goal scoring, we keep that going, keep that positive, but the concession of goals, we need address and make that better,\" Docherty said.", "url": "https://www.bbc.com/sport/articles/cn0wl9790reo"}