{"authors": ["Alex Hoad", "Ben Ashton", "www.facebook.com"], "date_download": "2025-05-21 07:38:34", "date_modify": "2025-05-21 07:38:34", "date_publish": "2025-03-28 12:04:49", "description": "Sheffield United welcome Coventry City and Burnley face Bristol City in just two of this weekend's vital EFL encounters.", "filename": "sport_football_articles_c17q4e080z9o_1747813114.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/331d/live/049ecb30-0afb-11f0-94d4-6f954f5dcfa3.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c17q4e080z9o_1747813114.html", "title": "EFL preview: 'Titanic promotion tussle' and a six-pointer", "title_page": "EFL preview: 'Titanic promotion tussle' and a six-pointer - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We officially enter British Summer Time this weekend but which EFL teams will spring forward and who will be losing sleep?\nA handful of sides might already be on the proverbial beach but for many, the stakes are still extremely high.\nThere will be more vital encounters at both ends of the Championship, League One and League Two as we edge closer to the finishing line.\nHere are the key talking points going into this weekend's fixtures.\nChampionship action returns after the international break with a bang on Friday (20:00 GMT) with a bumper clash between Sheffield United and Coventry.\nChris Wilder's Blades are second, behind leaders Leeds on goal difference, and the boss told BBC Radio Sheffield he expects a \"titanic tussle\" for the finishing line over the final eight games.\nBurnley, who the Blades visit on Easter Monday, are two points behind in third and Wilder said: \"There's still work to be done, there's a promotion on the horizon.\"\nFrank Lampard's Coventry have won 10 of their past 12 games to climb to fifth, with a two-point cushion in the race for the play-offs.\nAfter taking just five points from their past four games, Leeds will aim to respond when they welcome Swansea to Elland Road on Saturday (15:00 GMT).\nBurnley are just two points back in third and will entertain Bristol City at Turf Moor in a game which could well be a prelude to a play-off semi-final.\nThe Clarets have a nine-point advantage over fourth-placed Sunderland while the Robins are seventh, outside the play-off spots only on goal difference.\nScott Parker's side are unbeaten in 25 games dating back to their trip to Millwall on 3 November and have conceded just five goals in that spell.\nCity have claimed 15 points from their past seven games and have lost just one of their previous seven on their travels.\nAt the other end of the Championship, all eyes are on a potentially huge relegation scrap between Hull City and Luton Town at lunchtime on Saturday.\nThe Hatters have been showing signs of life with seven points from their past four games and go into the weekend second-bottom, two points ahead of Plymouth and four behind fourth-bottom Cardiff, who have a better goal difference.\nThe Tigers are another two points and two places into the distance after a run of eight points from their past four games.\nThe average points achieved by teams staying up over the past five seasons in 21st place is 46.8 - Plymouth managed 51 points last season, Cardiff City 49 in 2023, but Reading only needed 41 to beat the drop in 2022.\nLuton currently have 35 with eight games left to play and Hatters boss Matt Bloomfield told BBC Three Counties Radio: \"We just have to make sure we attack every game individually but with an understanding of what the season may look like.\n\"If we keep doing what we can do, we believe we can get to the figure that we're going to need.\"\nHull's clash with Luton is one of at least nine remaining fixtures between sides near the bottom which may fall under the \"relegation six-pointer\" category.\nLuton will face Stoke and Derby before the end of the season, while the Rams also visit Portsmouth and Hull in April before hosting the Potters on the final day.\nCardiff will welcome both Stoke and Oxford next month and Pompey take on Hull in the last game of the season.\nLeague One is throwing up some big encounters this weekend and perhaps none more so than Saturday lunchtime's curtain-raisers.\nFourth-placed Charlton welcome Huddersfield, who are sixth, for a crucial clash in the play-off battle.\nThe Addicks could strengthen their grip in the play-off places with victory and potentially move within five points of the automatic promotion spots depending on how Wrexham get on at Exeter.\nThe Terriers' play-off position is hanging by a thread with just a one-point gap to Bolton in seventh and they could slip out of the top six again if they fail to win.\nLater in the day, fellow play-off hopefuls Stockport, who have won just one of their past four (D2 L1), host relegation battlers Burton Albion and will be looking to put daylight between themselves and the chasing pack.\nThe Brewers are six points from safety but their attempted great escape - having been 11 points adrift in January - is still on with a game in hand on Bristol Rovers in 20th.\nThe Gas have lost two on the bounce and welcome 17th-placed Mansfield, who ended their 13-game winless run last time out but could also still yet be dragged into the survival scrap.\nDoes anyone want to win promotion from League Two?\nWalsall's once 12-point lead at the summit has been cut to just one by Bradford City and most of the teams in contention to either go up or secure a play-off berth are struggling for consistency.\nThe top 10 sides in League Two have only won eight of their past 30 games combined and Port Vale were the most recent club to miss an opportunity to move into the automatic promotion spots with defeat at home to Barrow on Tuesday night.\nIn the past six games, AFC Wimbledon have taken seven points, Vale eight, Doncaster nine, Notts County five and Grimsby eight - those at the top are stuttering.\nMore points are guaranteed to be spurned in the promotion race this weekend as leaders Walsall host third-placed Wimbledon, while Colchester - who are eighth and were unbeaten in 13 until their 4-1 loss to the Bantams - welcome Grimsby, looking to climb above the Mariners into the top seven.\nRead all about the topsy-turvy League Two promotion race in more detail here.", "url": "https://www.bbc.com/sport/football/articles/c17q4e080z9o"}