{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:20:50", "date_modify": "2025-05-20 14:20:50", "date_publish": "2023-07-29 08:20:07", "description": "Before Errol Spence Jr and Terence Crawford fight for the undisputed welterweight crown, BBC Sport rounds up predictions from the boxing world.", "filename": "sport_boxing_66307264_1747750850.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/13751/production/_130579697_003_spence_crawford_press_conference-1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_boxing_66307264_1747750850.html", "title": "Errol Spence Jr v Terence Crawford: predictions from pros and pundits for undisputed welterweight bout", "title_page": "Errol Spence Jr v Terence Crawford: predictions from pros and pundits for undisputed welterweight bout - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Errol Spence Jr and Terence Crawford go toe-to-toe in a highly anticipated welterweight fight for the division's undisputed crown on Saturday in Las Vegas.\nWBO champion Crawford takes on undefeated fellow American Spence for his WBC, IBF and WBA (Super) titles.\nThe contest has been years in the making and finally features two of the world's best in the ring.\nNeither has lost since turning pro and are long-reigning world champions, with Crawford aiming to become the first male boxer to hold undisputed titles in two different weight classes in the four-belt era.\nThe BBC Sport website will have live text commentary from 04:00 BST on Sunday, 30 July, featuring all the build-up and undercard action.\nWe have asked big names from the world of boxing for their opinions on the big fight.\nMiddleweight Liam Smith: \"I'm going to edge towards Crawford but I wouldn't be surprised with any result. They are two elite fighters at the top of their game.\"\nTwo-weight world champion Natasha Jonas: \"I change my mind with Spence-Crawford all the time. But right now, it's Spence.\"\nRetired heavyweight Mike Tyson: \"It's close. I think Crawford will win, if he wins easy I will be totally surprised.\"\nFormer featherweight world champion Kid Galahad: \"I'm going with Spence - look at the face of opponents after they've fought Spence versus the other welterweight champs.\"\n5 Live boxing analyst Steve Bunce: \"I think it might come down to who's the smartest. Some people are convinced that's Spence but I think Crawford might be smarter. The main unknown about this fight is who's got the most left in the tank. I've just got a feeling it might be Crawford. But even though I'm favouring Crawford, I would be stunned if one of them walks away with this fight. I'd be absolutely amazed if there's one master.\"\nFormer light-middleweight world champion Hannah Rankin: \"I'm going for Crawford with a late stoppage. Both fighters are brilliant and they are made for each other but I think Crawford just has the edge in boxing IQ.\"\n5 Live boxing analyst Barry Jones: \"I'm going with Crawford. I just think he has more ways to win. I think the first rounds will be tentative and we could have a war in the final rounds.\"\nFormer lightweight world champion Anthony Crolla: \"Crawford-Spence, I honestly can't pick a winner. It's probably the best fight that can be made in boxing today. But I'm going Crawford. I just think he'll be a step ahead of Spence in the speed department for most of it. Crawford, for me his biggest strength is his versatility and how he can adapt in there. So I think Crawford on points.\"", "url": "https://www.bbc.com/sport/boxing/66307264"}