{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:25:20", "date_modify": "2025-05-21 07:25:20", "date_publish": "2025-03-28 15:04:22", "description": "Oliver Glasner press conference: Fulham v Crystal Palace preview", "filename": "sport_football_articles_czjej4jdrklo_1747812320.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8249/live/031e5ce0-6de3-11ef-b970-9f202720b57a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_czjej4jdrklo_1747812320.html", "title": "Oliver Glasner press conference: Fulham v Crystal Palace preview", "title_page": "Oliver Glasner press conference: Fulham v Crystal Palace preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "On Jean-Phillipe Mateta's fitness: \"He trains now for two weeks with us. Of course, always with his protection and it's also important for him to train a little bit. We had an internal game during the international break where he could play for 60 minutes without any problems. He's ready.\"\nOn Mateta's protective mask that he is now required to wear to over his ear when playing: \"I said to him to maybe try water polo because he is tall enough. It looks a little bit strange, but he says he is comfortable. Let's see, when he scores a header tomorrow then it was the right mask and the right protection.\"\nOn the rest of the squad's fitness: \"The positive thing is all players are fit and available – just Will Hughes is questionable. He's a bit sick, so let's see how the afternoon and the night will be. But all others arrived back from the national teams in very good shape, and all the players who are here are fit. It's just Chadi Riad and Cheick Doucoure who are out for the rest of the season, all others are ready.\"\nOn sporting director Dougie Freedman's decision to leave: \"I'm always very close with a lot of talks almost every day. I was involved, he didn't ask me about the decision but I was always involved in the process. It didn't come as a surprise to me, he was looking for a different challenge not here in the Premier League. He took the decision for himself and his family, so we had to agree. There's no disappointment, he was always quite open so it's all good.\"\nOn how Freedman's exit could effect summer transfer business: \"The good thing is we already started weeks ago with our recruitment that we want to do in the summer. Everything is on the pathway, I'm pretty sure we will do the right things. Of course, it's a new situation when a very important guy leaves after eight years. But we have very good communications in the club, all the players we are looking at we know. I'm pretty sure we will get the things done that we want done.\"", "url": "https://www.bbc.com/sport/football/articles/czjej4jdrklo"}