{"authors": ["Pat Nevin", "www.facebook.com"], "date_download": "2025-05-21 03:57:09", "date_modify": "2025-05-21 03:57:09", "date_publish": "2025-01-15 10:47:01", "description": "Newcastle news: Lewis Miley 'the next young English superstar' - Pat Nevin", "filename": "sport_football_articles_cp9xzvxvd7eo_1747799829.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cd0f/live/73f3c7c0-d32d-11ef-9bab-e1537b3d246b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cp9xzvxvd7eo_1747799829.html", "title": "Newcastle news: Lewis Miley 'the next young English superstar'", "title_page": "Newcastle news: Lewis Miley 'the next young English superstar' - Pat Nevin - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "I was at St James's Park on Sunday and just for a few minutes the possibility of an extraordinary upset was on the cards after Cameron Congreve scored to give Bromley the lead.\nInstead, I came away thinking the Magpies could now have one of their finest seasons in living memory.\nThey are 2-0 up in the Carabao Cup semi-final after the first leg against Arsenal and are sitting fifth in the Premier League after winning eight matches in a row. They are on serious a roll and that could continue with four of their next five league games at home - and that solitary away encounter against struggling Southampton.\nCrucially, they have a depth of squad that is the equal of anyone else.\nAlexander Isak is the country's in-form striker, but Will Osula, after scoring his first goal for the club, looks like he could become an able deputy.\nAll nine stand-ins are well capable of doing a decent job when others are injured, tired, suspended or just dipping in form.\nOn top of this, midfielder Lewis Miley looks like the next young English superstar to make a breakthrough.\nAfter a long lay-off with injury, he was man of the match, controlled the midfield and scored a cracker as well. He was also the most composed player on view.\nHe has looked this good every time I have watched him and he is still only 18.\nEddie Howe is trying to keep his profile fairly low key, but, trust me, Miley is special.", "url": "https://www.bbc.com/sport/football/articles/cp9xzvxvd7eo"}