{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 08:07:46", "date_modify": "2025-04-26 08:07:46", "date_publish": "2025-02-26 14:03:18", "description": "Man Utd news: More a team thing than a Rasmus Hojlund thing - Ruben Amorim", "filename": "sport_football_articles_c3e41x7878vo_1745654866.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c494/live/2411fb60-f41a-11ef-b21d-b7e43192c885.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c3e41x7878vo_1745654866.html", "title": "Man Utd news: More a team thing than a Rasmus Hojlund thing", "title_page": "Man Utd news: More a team thing than a Rasmus Hojlund thing - Ruben Amorim - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "In a troubled season for Manchester United, their lack of goals has been one of the biggest concerns.\nUnited have scored 30 goals in their 26 Premier League games so far this season, with striker Rasmus Hojlund only netting twice.\nThe 22-year-old has faced criticism for his numbers in recent weeks, but manager Ruben Amorim blames a lack of service from the rest of the team rather than it being \"a Rasmus thing\".\n\"It's clear, as a team, we are not helping Rasmus,\" said Amorim. \"We don't create a lot of chances.\n\"Rasmus has a lot of potential. If we improve the way we play the game, he will have more opportunities to score. He came here very young and, when you are very young, to be the number nine and play all the time sometimes is hard.\n\"We have to look as Rasmus as a player: he has the pace, he has the technique, he scores some goals that are really hard to score. Sometimes he doesn't choose the better runs, sometimes he's so anxious to touch the ball because there are long minutes without the ball and he moves away from the goal.\n\"We address that in training. He has the ability - he already showed that here - but I think it's more a team thing than a Rasmus thing.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c3e41x7878vo"}