{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:37:25", "date_modify": "2025-05-21 06:37:25", "date_publish": "2025-04-01 00:00:00", "description": "Kabongo Tshimanga converts two late penalties as Swindon snatch a 2-1 win at home to 10-man AFC Wimbledon.", "filename": "sport_football_live_cdx2xl9dv14t_1747809445.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/145c/live/305eb600-0edd-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cdx2xl9dv14t_1747809445.html", "title": "Swindon Town 2-1 AFC Wimbledon", "title_page": "Swindon Town 2-1 AFC Wimbledon - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Kabongo Tshimanga converted two late penalties as Swindon snatched a 2-1 win at home to 10-man AFC Wimbledon.\nThe Dons looked to be cruising after Marcus Browne slotted home after the break, only to drop points late on from a winning position for the third game running.\nA brilliant save by Connor Ripley kept out a dinked effort from Callum Maycock after a fine build-up by the visitors.\nAt the other end Paul Glatzel forced a point-blank save from Owen Goodman, who then kept out the rebound from Joe Westley before defenders stopped Glatzel pouncing.\nThe Dons went ahead 11 minutes after the break when Browne hammered home after Ripley had kept out his first effort and Josh Neufville hit a post.\nRipley then pulled off another superb save to stop Browne's fierce near-post header from James Tilley's pinpoint cross.\nBut the game turned on its head at the death.\nFirst Joe Lewis tugged down Harry Smith in the 90th minute and Tshimanga blasted home from the spot.\nGoodman kept out two near-post efforts as Town pressed before John-Joe O'Toole was dismissed for a second yellow for handball and Tshimanga fired home his second penalty five minutes into added time.", "url": "https://www.bbc.com/sport/football/live/cdx2xl9dv14t"}