{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:31:25", "date_modify": "2025-04-26 07:31:25", "date_publish": "2025-02-27 17:19:52", "description": "Garry Ringrose is suspended for Ireland's Six Nations match with France following his red card in last weekend's win over Wales in Cardiff.", "filename": "sport_rugby-union_articles_c3w11xv47vgo_1745652685.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d863/live/d070aa40-f52e-11ef-9621-af4ff1a2bf4c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_c3w11xv47vgo_1745652685.html", "title": "Garry Ringrose: Suspended Ireland centre to miss Six Nations game against France", "title_page": "Garry Ringrose: Suspended Ireland centre to miss Six Nations game against France - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Ireland's Ringrose banned for France Six Nations game\nPublished\n27 February 2025\nGarry Ringrose will miss Ireland's Six Nations match with France following his red card in last weekend's win over Wales in Cardiff.\nLeinster centre Ringrose has been handed a three-match suspension after being charged with an act of foul play contrary to Law 9.13, which states that a player must not tackle an opponent early, late or dangerously.\nSignificantly, the three-game ban includes Leinster's United Rugby Championship fixture against Cardiff this weekend, while he will return for Ireland's final Six Nations encounter against Italy if he completes World Rugby's Coaching Intervention Programme.\nThe 30-year-old was initially shown a yellow card after making head contact with Wales' Ben Thomas during Saturday's game at Principality Stadium.\nIt was upgraded to a 20-minute red card following an off-field review, which meant Ireland were able to later replace Ringrose with Bundee Aki.\nRingrose appeared before an independent disciplinary committee on Thursday morning. The committee determined that the mid-range entry point of a six week/match suspension was appropriate for Ringrose's foul play.\nHowever, after taking into account his guilty plea and previous disciplinary record, that punishment was reduced by 50%.\nIreland, who are also chasing a third straight Six Nations title, host France on 8 March and travel to Italy on 15 March in their final two matches.", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/c3w11xv47vgo"}