{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:52:31", "date_modify": "2025-05-20 11:52:31", "date_publish": "2023-08-06 00:00:00", "description": "England miss out on a historic first Netball World Cup title with a 61-45 loss to Australia.", "filename": "sport_live_netball_66415497_1747741951.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/955D/production/_130673283_netball_getty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_netball_66415497_1747741951.html", "title": "Netball World Cup 2023 final LIVE: England v Australia", "title_page": "Netball World Cup 2023 final LIVE: England v Australia - live score & follow text commentary - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Goodbye\nFT: England 45-61 Australia\nNot quite the end to the weekend England fans wanted, but the Roses still made history by reaching a first World Cup final.\nFor the full story of England's loss to Australia, have a read of the report.\nOf course, this isn't the end of England-in-World-Cups season. The Lionesses are in action in the last 16 of the football against Nigeria at 08:30 BST on Monday and you can watch that on BBC One and follow live text commentary on the BBC Sport website and app.\n'This time it's a first final, next time we're getting gold'\nFT: England 45-61 Australia\nBBC Sport\nEngland mid-court Imogen Allison speaking to BBC TV:\"We spoke a lot about how this is the first time it has been done [a Roses team in the final], I am super proud of all of us to be honest. We have to take this and run with it. If this is the first time in a final, the next time we are getting the gold.\n\"[Are you going to celebrate?] I hope so! Just having fun with friends and that is it.\"\n'They just had the better of us today'\nFT: England 45-61 Australia\nBBC Sport\nEngland shooter Eleanor Cardwell speaking to BBC TV: \"We had the better of them the other day and they had the better of us today. They were more clinical with ball. They were hungry and turning over ball a lot more.\n\"[Having experience against opponents] does help you. You know the ins and outs of every player. But it is how you connect as a team and at times they broke our connections, especially in attack. It helps but it does work both ways.\n\"There's so many positives. This is the first World Cup final for every name on the team sheet and a lot of those Diamonds players have a whole lot of experience.\n\"This is a first for us and I am super proud of us making history. Last year at the Commonwealth Games we came fourth and were gutted, this year we've got a silver medal.\"\nWe're grateful but disappointed - Thirlby\nFT: England 45-61 Australia\nBBC Sport\nEngland head coach Jess Thirlby speaking to BBC TV: \"We are really grateful for that silver medal and over time I'm sure that it will sink in. But right now it is a measure of the belief we had in ourselves, the route we took to the final...[that we are disappointed].\n\"We are obviously gutted with a losing margin like that in our first final but such is the difference between seasoned finalists and a team in their first final.\n\"The win on Thursday, we hit some of our biggest stats ever against Australia, and still only won by one, so we weren't complacent about things.\n\"Today was always going to be a tough ask, you just can't throw ball like that against Australia in a final. If we do that we need to find a way to win it back. Unfortunately both of those things eluded us for long periods during the match.\"\n'Couldn't have asked for a better ending to my career'\nFT: England 45-61 Australia\nBBC Sport\nAustralia mid-court Ashleigh Brazill speaking to BBC TV: \"For that last ten minutes I couldn't wipe the smile off my face. Jo [Weston] was crying for the last five minutes...\n\"To beat England like that, they beat us in the round and everyone loved what Helen [Housby] said, that they were fitter and more energetic than us, that just fired things up.\n\"The fact we have done it the way we wanted to, playing some of the best netball we have played in a long time. I'm just so proud of the girls.\n\"It has taken all of us to get here, the entire 22, all of us, and the fact we are stood here world champions, I couldn't have asked for a better ending.\"\n'A turbulent four years'\nFT: England 45-61 Australia\nBeth Cobden\nFormer England player on BBC Radio 5 Sports Extra\nEngland have had a real turbulent four years. So much learning has happened.\nThey've got to be pleased with what they've achieved overall. I'm not sure many people would have pegged England as second at the start of the tournament.\nThey will be disappointed with that. That was a very big loss.\n'Errors are a snowball effect'\nFT: England 45-61 Australia\nKaren Greig\nManchester Thunder Head Coach on BBC Two\nIt ends up being a snowball effect.\nOnce you make one error, you try so hard not to make another that the pressure tells. Then one turns into two, which turns into three...\nThe girls will be disappointed of course, but they did some phenomenal stuff out there as well, and we can't take that away from them.\nThey've still created history and this is a lesson for a lot of the girls who will hopefully still be here in the next cycle.\n'Australia are just relentless'\nFT: England 45-61 Australia\nSerena Kersten\nCommonwealth gold medallist with England on BBC Two\nThere are a few areas where it went wrong for England.\nFar too wasteful with the ball, Australia are the best side in the world at punishing you.\nYou may score quickly, but the Ausssies punish you again and again and again.\nThey are relentless, and it told today, particularly in the second half.\nPost\nFT: England 45-61 Australia\nTears of joy from the Australian Diamonds. This has been five years in the making.\nSince they lost the Commonwealth Games to England in 2018 then the World Cup in 2019 to New Zealand they have talked of 'unfinished business'.\nThey wanted to win back both titles. After securing gold in Birmingham last year now they've secured the World Cup title in Cape Town.\nThere's a reason they are the dominant force in netball.", "url": "https://www.bbc.com/sport/live/netball/66415497"}