{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:02:16", "date_modify": "2025-05-20 14:02:16", "date_publish": "2023-06-20 19:57:22", "description": "All the drama, excitement and moments missed from a dramatic final day of the first Test in BBC Sport's Ashes digest.", "filename": "sport_cricket_65968384_1747749736.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/F1C7/production/_130159816_gettyimages-1258864946.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_65968384_1747749736.html", "title": "Ashes 2023: England and Australia play out classic as Ben Stokes defiant", "title_page": "Ashes 2023: England and Australia play out classic as Ben Stokes defiant - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The fifth day of the Edgbaston Test produced an absolute classic as Australia edged to victory by two wickets to take a 1-0 lead in the series.\nNinth-wicket pair Pat Cummins and Nathan Lyon finally steered the tourists home following an afternoon of unrelenting tension.\nIt was the culmination of five thrilling days of Test cricket as these two old foes went head to head - with the promise of more to come in the next four Test matches.\nEven the weather played its part, with a lengthy rain delay during the morning only adding to the sense of theatre.\nHere is your Ashes digest from day four.\nBen Stokes on his much talked about first-innings declaration: \"I thought that was a time to pounce. I am not going to change the way I have gone about my cricket because it is the Ashes. Who knows, we could have got an extra 40 runs or lost two wickets in two balls. I am not a captain who gets by on what ifs.\n\"We were in control of most of the game and managed to produce a result. Obviously we wanted to be on top. We are devastated but that's sport. It is great and an emotional rollercoaster.\"", "url": "https://www.bbc.com/sport/cricket/65968384"}