{"authors": ["Sophie Hurcom", "www.facebook.com"], "date_download": "2025-05-21 04:33:27", "date_modify": "2025-05-21 04:33:27", "date_publish": "2025-04-04 21:10:30", "description": "Bath progress to the quarter-finals of the European Challenge Cup with a seven-try win against Pau despite having Sam Underhill sent off.", "filename": "sport_rugby-union_articles_clywd0wej7lo_1747802007.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ecf6/live/d42f4de0-1193-11f0-9c0d-3d00dc5c90d6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_clywd0wej7lo_1747802007.html", "title": "European Challenge Cup: Pau 24-49 Bath", "title_page": "European Challenge Cup: Pau 24-49 Bath - Seven-try Bath reach quarter-finals - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Bath progressed to the quarter-finals of the European Challenge Cup with a convincing seven-try win against Pau despite having Sam Underhill sent off.\nWill Muir, Joe Cokanasiga, Beno Obano and Josh Bayliss all scored in a dominant first 40 from the Premiership leaders, to one try from Pau's Carwyn Tuipulotu.\nTom Dunn and Ruaridh McConnochie extended Bath's advantage with Underhill shown red for a head-on-head tackle in between.\nAnd while Fabien Brau-Boirie pulled two tries back for the French hosts it was too late to mount a comeback, and Miles Reid's score capped Bath's night inside the final 10 minutes.\nThis was Bath's first match in the competition after being knocked out of the Investec Champions Cup in January and they will now face Montpellier or Gloucester - who play on Saturday - in the last eight, as their hunt for three trophies this season continues.\nMuir opened the scoring against the Top 14 side at the Stade du Hameau, collecting a kick through from Ben Spencer to touch down after only two minutes.\nAxel Desperes put Pau on the board with a penalty, but Bath had their second try almost immediately after, as Muir again charged forward and Cokanasiga cut back inside and around a defender to run over.\nThe back-and-forth scoring continued as Pau's Tuipulotu, whose cousin Kepu sat watching on the Bath bench, split from a driving maul to power over and make it 10-14. But that was as close as the French side would ever get to Bath.\nFledgling Bath fly-half Ciaran Donoghue, one of seven changes to their starting XV, impressed on his European debut, not only from the kicking tee, as he sprinted from within his own 22 to within five metres before Obano crossed to stretch the lead to 21-10.", "url": "https://www.bbc.com/sport/rugby-union/articles/clywd0wej7lo"}