{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:25:11", "date_modify": "2025-05-20 12:25:11", "date_publish": "2023-08-04 12:26:16", "description": "Luton Town: Is Thomas Kaminski good enough for the Premier League?", "filename": "sport_articles_crg21q570nno_1747743911.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c13c/live/fae72900-31e1-11ee-a851-b19cb129e45b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_crg21q570nno_1747743911.html", "title": "Luton Town: Is Thomas Kaminski good enough for the Premier League?", "title_page": "Luton Town: Is Thomas Kaminski good enough for the Premier League? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Joe Bradshaw, BBC Sport\nLuton have been chasing a new number one all summer with Blackburn's Thomas Kaminski seemingly set to win the role.\nBut is the 30-year-old Belgian ready to step up to the Premier League?\nKaminski arrived in 2020 from Genk and was an instant hit, winning the Player of the Year award despite the presence of 30-goal top scorer Adam Armstrong and the prodigious Harvey Elliott.\nThe undisputed number one at Ewood Park for two-and-a-half years, some outrageous shot-stopping in the first half of last season helped Blackburn to an unlikely early challenge at the top of the table.\nHowever, after a knee injury sidelined him at the start of 2023, his deputy Aynsley Pears stepped in and performed well, leaving Kaminski twiddling his thumbs when he returned to fitness.\nA truly modern goalkeeper, he is adept with his feet and likes to play outside his area, regularly standing halfway between the penalty box and the halfway line.\nHe is a popular figure in the dressing room too and will bring professionalism, drive and leadership qualities to a Luton side that is already stacked with top characters.\nEvery keeper is prone to the odd mistake - and Kaminski has thrown in his share of wobblers - but generally he has been among the cluster of goalkeepers at the top of the Championship.\nGiven the price Luton have seemingly agreed with Blackburn, it appears they are getting a decent deal for an ambitious and experienced keeper.\nIf he is not up to the job, the Premier League is an unforgiving place to find that out.\nOn the fringes of the Belgium national team since arriving in England, he has regularly received call-ups but unsurprisingly failed to dislodge Real Madrid's Thibault Courtois from between the posts.\nNo doubt he will see this top-flight move as his opportunity to finally receive his first cap.", "url": "https://www.bbc.com/sport/articles/crg21q570nno"}