{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:36:27", "date_modify": "2025-05-21 07:36:27", "date_publish": "2025-05-20 15:18:25", "description": "Rangers fan views: Did 'players fail Ferguson' or was he 'not manager material'?", "filename": "sport_articles_c5ykkrjg0reo_1747812987.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d2da/live/9fa99b20-fa7e-11ee-97f7-e98b193ef1b8.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c5ykkrjg0reo_1747812987.html", "title": "Did 'players fail Ferguson' or was he 'not manager material'?", "title_page": "Rangers fan views: Did 'players fail Ferguson' or was he 'not manager material'? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Following the confirmation that Barry Ferguson is leaving Rangers, we asked for your views on his brief tenure.\nHere's what some of you said:\nJohn: Ferguson was put in a difficult position and did well with what he had to play with. Unfortunately we all know this squad just isn't good enough. Although he's leaving the manager's role, I hope they make some space for him in a coaching capacity as he has a lot to offer and is a potential Gers manager in the making.\nAllan: Lots of people are saying Ferguson did well with the tools he had, which I agree with, but so did Philippe Clement. They had the same set of players and got the same inconsistent play and results. The team is good at counter-attacking but not good at trying to break down a low block. That is the conundrum for the new manager, to be able to do both.\nMurray: Ferguson plugged the holes in a sinking ship, but that's all. His press conferences were both refreshing and alarming when he kept saying \"my team\" and seemed to be a \"me\" instead of \"we\". He also refused to give fringe players a try and was more interested in looking good himself with mediocre wins than trying out players for next season. I'm glad he didn't get the job full-time.\nNeil: I thought Barry, Neil McCann, Billy Dodds and Allan McGregor did a decent job given the tools he had to work with. These players in a number of cases have been responsible for a number of managers losing their jobs. The highlights were Fenerbahce away and the penalties at Ibrox and the win at Parkhead. I felt Barry and the boys answered the call from Rangers in difficult circumstances and showed what the club means to each of them.\nAlan: Not manager material at such a big club but room for improvement, could be a good assistant.\nBobby: The right decision in the end. Ferguson's chances of getting the job permanently were already slim. He didn't get a reaction out of the players who served up the same dross under Clement. His time as manager will be forgotten about quickly.", "url": "https://www.bbc.com/sport/articles/c5ykkrjg0reo"}