{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 08:01:49", "date_modify": "2025-04-26 08:01:49", "date_publish": "2025-02-26 17:11:27", "description": "Southampton news: Are Saints on course for worst Premier League season? - the stats", "filename": "sport_football_articles_cy5nk6lee6vo_1745654509.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/fa6d/live/7e7a4790-f462-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cy5nk6lee6vo_1745654509.html", "title": "Are Saints on course for worst Premier League season?", "title_page": "Southampton news: Are Saints on course for worst Premier League season? - the stats - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "It is the record no team wants, but Southampton are currently contemplating the worst Premier League season.\nDerby County's lowly 11 points from 38 games is the current benchmark, but with just nine from 27 so far, the Saints have the exact record as the Rams did at this stage during the 2007-08 season.\nAfter a 4-0 defeat away at Chelsea on Tuesday night, Ivan Juric's side now have 11 games remaining to try and avoid equalling or beating Derby's record.\nAt least the two wins they have accrued avoids matching the East Midlands side's record for fewest victories (one) - but what other records are on the line?\nWith 19 goals scored and a record of 0.7 goals per game, they should avoid scoring the fewest goals as that stands at 20 by Derby in that same season and by Sheffield United in 2020-21.\nIf Saints maintain their average of 2.41 goals conceded per game, they should also avoid conceding the most goals in a season (104 by Sheffield United again at an average of 2.73 in 2023-24).\nHowever, Southampton could still end the campaign with the most losses suffered. This record is shared by four teams at 29 and the Saints have tasted defeat on 22 occasions as it stands.\nAs the above graphic shows, Southampton do have a poorer goal difference than Derby had in 2007-08 at this stage so they are in contention to finish with the worst goal difference in a Premier League campaign - a record currently shared by the Rams and Sheffield United with -69.\nWith relegation looking more and more likely, avoiding witnessing a record-breaking season for the wrong reasons remains a hope for Southampton.", "url": "https://www.bbc.co.uk/sport/football/articles/cy5nk6lee6vo"}