{"authors": ["Elizabeth Hudson", "www.facebook.com"], "date_download": "2025-05-20 12:57:57", "date_modify": "2025-05-20 12:57:57", "date_publish": "2023-08-02 20:55:30", "description": "Briton Maisie Summers-Newton wins her third consecutive individual medley title at the Para Swimming World Championships in Manchester.", "filename": "sport_disability-sport_66390285_1747745877.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/25E6/production/_130620790_4366e64e77247c404ad072d8e543f135a74344f7.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_disability-sport_66390285_1747745877.html", "title": "Para Swimming World Championships: Maisie Summers-Newton beats nerves to retain medley title", "title_page": "Para Swimming World Championships: Maisie Summers-Newton beats nerves to retain medley title - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Britain's Maisie Summers-Newton admitted to feeling the pressure before retaining her SM6 200m individual medley title at the Para Swimming World Championships in Manchester.\nIt is a third world title in a row in the event for the dominant 21-year-old.\nThe Paralympic champion was third at halfway but stormed through on the breaststroke leg to win comfortably.\n\"You'd think I would be less nervous the more I raced, but I keep getting more nervous,\" she told BBC Sport.\n\"But when I am on the blocks it just clicks and something happens in the pool and I am so used to doing it now.\n\"I think it shows I want to stay at the top and I want to keep winning medals.\"\nIt was Britain's eighth gold of the competition and there was also a second bronze of the week for debutant Faye Rogers in the S10 400m freestyle.\nSummers-Newton, who is also Paralympic champion in the SB6 100m breaststroke event and will defend that world title on Saturday, trailed German Verena Schott and American Ellie Marks.\nBut her second half of the race is her strength and she went ahead on the breaststroke and consolidated her advantage in the freestyle leg to win in two minutes 57.53 seconds with Schott 3.84secs back and Marks third.\n\"In the first part of the race I always know the other girls are going to be faster than me because my butterfly and backstroke are my weaker strokes,\" said the Briton, who won her first world title in London in 2019.\n\"But on the breaststroke leg I know I just need to hammer it down and touch the wall first.\n\"Breaststroke has always been my best stroke and I love it but I couldn't be happier with a third medley title in a row. I am so proud.\"\nRogers, who was aiming for Olympic selection before an accident in 2021 left her with a fused elbow, had also finished third in Tuesday's SM10 200m individual medley and was thrilled with a second medal.\n\"I just went in to try to and swim a personal best,\" said the 20-year-old. \"I didn't expect to win a medal at all so it is a real bonus and it is also a huge PB.\n\"I have been nervous this week, but in a good way. I am happy with the times I am swimming. The nerves have definitely settled and I am getting in a rhythm which is great.\"\nThere was also a 34th world championship title for American Jessica Long, one of the greats of the sport, who took gold in the S8 100m butterfly.\nThe 31-year-old was born in Russia with fibular hemimelia, but she was adopted as a baby and had both legs amputated below the knee when she was 18 months old.\nShe is competing at her seventh world championships having made her debut in Durban in 2006.", "url": "https://www.bbc.com/sport/disability-sport/66390285"}