{"authors": ["Tyrone Smith", "www.facebook.com"], "date_download": "2025-05-20 12:57:21", "date_modify": "2025-05-20 12:57:21", "date_publish": "2023-08-02 22:00:41", "description": "Aberdeen can take lessons from Hearts' campaign last season as the Dons prepare to juggle domestic and European fixtures.", "filename": "sport_football_66079435_1747745841.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/594A/production/_130285822_20784364.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66079435_1747745841.html", "title": "How are Aberdeen shaping up for busy campaign as Europe beckons?", "title_page": "How are Aberdeen shaping up for busy campaign as Europe beckons? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Aberdeen's returning captain, Graeme Shinnie, earlier this summer said \"squad rotation will probably be big this season as well\".\nA simple sounding statement that could well be key for the Pittodrie side as they face a battle on up to four fronts this coming season.\nLast season's third-place finish in the Scottish Premiership guaranteed European group stage participation until Christmas in either the Europa or Europa Conference League. The Dons will also aim to fare better in the Scottish Cup after an early exit last term.\nSo how is Barry Robson's side shaping up?\nHeart of Midlothian faced exactly the same scenario last term. But what impact, if any, did their continental commitments have on their bread and butter Scottish games?\nBy far the strongest team outside the Old Firm in season 2021-22, games against Fiorentina, Istanbul Basaksehir and RFS of Latvia followed defeat in the Europa League play-off to Zurich.\nAs a result, Robbie Neilson's team faltered before their manager left and their grip on third slipped during a marathon campaign as the Dons knocked them into fourth by season's end.\nHearts ultimately finished third in their Conference League group and, between the first leg of their play-off on 18 August and their final group game on 3 November, had 10 domestic fixtures, nine in the league and one in the Viaplay Cup.\nThey lost the latter, going down 1-0 at home to Kilmarnock, with then Tynecastle boss Neilson admitting \"the culmination of so many games showed today\". In terms of those Premiership fixtures, they mustered just the three wins, losing five and drawing one.\nTheir form picked up after early November, for a few months anyway, as they went on a run of just two defeats in their next 15 games before a post New Year slump kicked in.\nFormer Aberdeen player and manager Willie Miller thinks \"the European adventure will throw up its own challenges\".\n\"Hearts found that out last season where it put a lot of pressure on their squad, a lot of pressure on the size of the squad, picking up injuries as well, which is a huge part of whether you get through that period,\" he told BBC Scotland.\n\"You need a little bit of luck to get through it without too many injuries, but as Hearts proved last season, they picked up a number of injuries that set them back a bit in the early part of the season.\"\nThe question is - how can Robson mitigate against the same thing happening to Aberdeen? Having a big squad looks to be the main solution.\nThere are certain to be further new arrivals, with Robson expecting one before Saturday's opening league game against Livingston.\nSo it will be fascinating to see how many more check into Pittodrie - and whether they will be able to hold on to Ylber Ramadani after a bid was rejected for the Albania midfielder this week.\n\"Numbers are important,\" Miller added. \"Nowadays, players tend to pick up injuries on a regular basis and, when they are put under pressure, that tends to happen.\n\"You have got to try to cover for that, but it is not just a simple case of having enough numbers.\n\"The quality has got to be there as well. So it is a balancing act. It is bringing in the funds but not overspending or not being taken advantage of by players or selling clubs.\n\"You might have to look at the loan situation as well and make sure, for the first half of the season at least, that you have got loan players in that you can rely on.\"", "url": "https://www.bbc.com/sport/football/66079435"}