{"authors": ["Alex Howell", "www.facebook.com"], "date_download": "2025-04-26 03:50:44", "date_modify": "2025-04-26 03:50:44", "date_publish": "2025-03-05 12:31:15", "description": "Arsenal news: Alex Howell on Ethan Nwaneri's long-term future", "filename": "sport_football_articles_ceqj7ejgwx8o_1745639444.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9b98/live/95d42c20-f9bd-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_ceqj7ejgwx8o_1745639444.html", "title": "Arsenal news: Alex Howell on Ethan Nwaneri's long-term future", "title_page": "Arsenal news: Alex Howell on Ethan Nwaneri's long-term future - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Once again, Ethan Nwaneri showed why he is going to be such a crucial part of Arsenal's team for a long time.\nThe 17-year-old scored his eighth goal in 28 games in all competitions in the thrashing of PSV. Not only is it impressive that this is his first proper season of senior football but he has been tasked with filling the void left by Bukayo Saka.\nThe biggest compliment Nwaneri is paid by his team-mates is that they constantly look to give him the ball. Such is their faith that the youngster will create something for the team.\nThe next question, once Arsenal get over their injury crisis will be how he fits in once Kai Havertz, Saka and Gabriel Martinelli are back fit and available.\nBukayo Saka will take the right side of attack Nwaneri is currently holding once he is fit but that does not mean the teenage will be out of the picture.\nOne huge positive is that Nwaneri is able to play in a number of positions both in attack and in midfield.\nArteta has also spoken about how he has been considered as a central striker - but that may be a position he takes on once he matures. Given his lethal finishing, it is not hard to see why Nwaneri taking up that role could be such an attractive option.\nCaptain Martin Odegaard occupies the right side of Arsenal's midfield but the Gunners have had a problem with their 'left number-eight' spot and have deployed Declan Rice and Mikel Merino in that position.\nNwaneri is going to grow and develop and write his own future but the fact that there are a few places in the team he could make his own is exciting for supporters and those around the club.", "url": "https://www.bbc.co.uk/sport/football/articles/ceqj7ejgwx8o"}