{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:39:54", "date_modify": "2025-04-26 06:39:54", "date_publish": "2025-03-02 15:19:55", "description": "MK Dons sack head coach Scott Lindsey after Saturday's defeat by Colchester United added to their miserable start to 2025.", "filename": "sport_football_articles_cdx2kn99rxko_1745649594.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d153/live/da0910c0-f77b-11ef-b744-2fe4be9f666c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cdx2kn99rxko_1745649594.html", "title": "Scott Lindsey: MK Dons sack head coach after miserable run", "title_page": "Scott Lindsey: MK Dons sack head coach after miserable run - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Milton Keynes Dons have sacked head coach Scott Lindsey after Saturday's defeat by Colchester United added to their miserable start to 2025.\nThe loss was MK's 11th in 16 League Two matches dating back to mid-December.\nWhile they managed two wins in January, MK have picked up just nine points from a possible 48 during that dire sequence, which has seen them slip to 17th in the table.\nLindsey, 52, was in charge for just over five months, having left League One side Crawley Town and dropped a division to take the helm in September.\nIt was only last season that Lindsey guided Crawley to promotion from the fourth tier, with his side crushing MK Dons 8-1 on aggregate in the play-off semi-finals before a 2-0 win over Crewe Alexandra at Wembley.\nAnd while he led the Buckinghamshire side to third in the table in early December after overseeing six successive wins, their poor form since then has seen MK drop well out of the promotion race.\nLindsey's departure was confirmed in a 56-word statement on the club website,, external which said they \"will be making no further comment at this time\".\n\"Everyone at MK Dons would like to sincerely thank Scott for his efforts during his time in Milton Keynes and wish him every success in the future,\" it added.\nLindsey spoke defiantly after Saturday's 1-0 home defeat by Colchester, a loss which left them 16 points adrift of the play-off spots and 13 points above the relegation places.\n\"It's really clear to me the players are really fighting and don't deserve that today,\" Lindsey told BBC Three Counties Radio in his final broadcast interview before his sacking.\n\"We are really hurting in there at the moment because of the run of form, in terms of results.\n\"I don't want them to get down about it. Of course we are, it's natural, but we have a big game on Tuesday and we have to dust ourselves down.\n\"We can't feel sorry for ourselves. We have to stick together, work hard and stay focused. I'm pleased there is a game on Tuesday where we can put it right.\"\nMK now travel to League Two strugglers Accrington Stanley without Lindsey in charge, and no indication who will take control on an interim basis.", "url": "https://www.bbc.co.uk/sport/football/articles/cdx2kn99rxko"}