{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:13:47", "date_modify": "2025-05-19 15:13:47", "date_publish": "2015-02-23 09:33:21", "description": "Guernsey FC cut the gap to the Isthmian League Division One South play-off places to eight points by beating Carshalton.", "filename": "sport_football_31584891_1747667627.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81174000/jpg/_81174562_81174561.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31584891_1747667627.html", "title": "Guernsey FC beat Carshalton Athletic 2-0 to close play-off gap", "title_page": "Guernsey FC beat Carshalton Athletic 2-0 to close play-off gap - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Guernsey FC cut the gap to the Isthmian League Division One South play-off places to eight points win a 2-0 win over Carshalton Athletic.\nRoss Allen got his first goal since 13 September, and also missed a penalty, before Jamie Dodd got the second.\n\"Ross is a goalscorer, you don't have to be an authority in football to realise that's what likes doing,\" said assistant manager Colin Fallaize.\n\"That's going to be another spoonful of medicine for Ross Allen.\"\nAllen, who scored 54 goals last season, has missed a large chunk of this campaign with a knee injury, but has featured in every game since Christmas and has started the last three matches.\n\"Where I was really excited for him was that he was getting the chances,\" added Fallaize to BBC Radio Guernsey.\n\"He missed two or three, he could have come off with a hat-trick, which is nothing unusual for Ross Allen, but he was hungry for those chances.\n\"Every striker is going to miss chances, but the key thing is we were making them and he was getting them.\"\nAnd Fallaize backed the striker to bounce back from his penalty miss in the first half.\n\"That's the first one Ross has taken for a while, and when there's a penalty you don't want anyone else but Ross picking it up.\n\"There are people around the squad who would take a penalty, but if you're a top striker like Ross, and it's 12 yards out, if you don't want to take the penalty you don't deserve the shirt, and Ross will always want to take the penalty and he'll continue as far as I'm concerned.\"", "url": "https://www.bbc.com/sport/football/31584891"}