{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:35:09", "date_modify": "2025-05-21 07:35:09", "date_publish": "2025-01-26 00:00:00", "description": "Listen to Sportsound and follow live text commentary, score updates and match report from Dundee United vs Rangers in the Scottish Premiership.", "filename": "sport_football_live_c70qnzk4djjt_1747812909.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c70qnzk4djjt_1747812909.html", "title": "Dundee United vs Rangers: Scottish Premiership stats & head-to-head", "title_page": "Dundee United vs Rangers: Scottish Premiership stats & head-to-head - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Rangers recovered from an early scare at Tannadice to defeat Dundee United in a pulsating, end-to-end match and pick up their first away win in seven attempts.\nPhilippe Clement's side trail Celtic in the Scottish Premiership by 10 points and their poor form on the road - drawing their past three in the league before Sunday - has put pressure on the manager.\nBut after Sam Dalby had given United the lead, Rangers hit back through Mohamed Diomande's curling strike.\nThat gave the visitors the boost they needed and they took the lead after four second-half minutes when an unmarked Robin Propper was able to fire past Jack Walton, via a big deflection.\nRangers came close to extending their lead on a few occasions but struggled to truly shake off a United side who hit the post three times.\nHowever, Cyriel Dessers wrapped up all three points in the 86th minute when he got on the end of Zak Lovelace's pass and fired high across the goalkeeper and into the top corner.\nIt was not all good news for Rangers, though, as Diomande was sent off in added time following an exchange of shoves with Kevin Holt.\nReferee Nick Walsh was asked to review the incident on the pitchside monitor but stuck with his initial decision, apparently of the view that the Ibrox midfielder had deliberately swung his arm towards the face of his opponent.\nFor the first half an hour, it looked like it might be another long away day for the travelling Rangers support.\nClement's side have dropped points in eight of their league excursions and had not won since early December at Ross County.\nAfter an energy and morale-sapping loss to Manchester United on Thursday, they started slowly. Passes were wayward, there was little threat, and the hosts had them under real pressure from set-pieces.\nDiomande's fine goal breathed new life into them. Hamza Igamane looked more confident, nutmegging defenders at will, and his team-mates started to address the physical challenge of United.\nThere was an element of fortune in Propper's goal but Dessers' late finish was sublime, coming after a brilliant goal at Old Trafford and a Scottish Cup hat-trick.\nClement will be content with the way his team overcame a sticky start to dominate, although he was left fuming at Diomande's dismissal, which looked incredibly harsh.\nJim Goodwin's starting line-up gave us a big hint as to how United were going to play against Rangers - attack, attack, attack.\nRauri Paton came in for a first start next to the league's top scorer Dalby in a 4-4-2 formation.\nThey matched Rangers' shape and enjoyed plenty of first-half pressure. Dalby hit the post with a header and Luca Stephenson had a shot tipped wide by Jack Butland.\nWhen the goal came, it was well-deserved and unsurprising that it came from a long Will Ferry throw. However, the hosts were rocked by Rangers' equaliser and looked for shelter in the dressing room after a opening 45 minutes where they gave everything.\nTheir hard work was undone by Propper's strike, with the visiting defender left completely unmarked in the penalty area.\nKai Fotheringham hit the post, although the play was called back for an offside, and Nico Raskin almost put into his own net as he tried to stop a cross from the left and ended up hitting the woodwork.\nAll the effort and endeavour for a goal left them open at the back in the last 10 minutes and Rangers took advantage of that to see United off.", "url": "https://www.bbc.com/sport/football/live/c70qnzk4djjt"}