{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:10:15", "date_modify": "2025-05-19 15:10:15", "date_publish": "2015-02-27 14:51:36", "description": "Woking enhance their Conference play-off hopes, as two first-half goals earn them a comfortable victory at Lincoln.", "filename": "sport_football_31563086_1747667415.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/58250000/jpg/_58250270_football-464x261.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31563086_1747667415.html", "title": "Lincoln City 0-2 Woking", "title_page": "Lincoln City 0-2 Woking - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Woking enhanced their Conference play-off hopes, as two first-half goals earned them victory at Lincoln.\nScott Rendell headed the visitors into the lead when a long ball into the area was flicked on.\nJosh Payne doubled Woking's lead with a well struck free-kick into the corner just before the break.\nLincoln struggled to create much throughout the afternoon and goalkeeper Paul Farman made saves to deny Payne and then Yemi Odubade.\nEighth-placed Woking are nine points off Forest Green in fifth, while Lincoln sit in 12th.\nLincoln City manager Chris Moyses told BBC Radio Lincolnshire:\n\"That was not good at all. Farms [Paul Farman] has been brilliant but I questioned the honesty of some of them at half-time.\n\"The second-half performance wasn't great but there was a little more endeavour, but we're just not playing enough football and we don't look like we want to.\n\"It was very disjointed and I'll carry the can for that but I've asked the players to look at themselves because there's only so much we can do as the coaching staff and you have to ask, do they want to put the work in to get to where we want to be? Do they want to put the red and white stripes on?\n\"It means a lot to me and to a lot of people here and if people can't match my commitment and what I want for this club then it upsets me deeply. I've got to get this house in order quickly.\"", "url": "https://www.bbc.com/sport/football/31563086"}