{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:42:38", "date_modify": "2025-05-20 13:42:38", "date_publish": "2023-08-01 13:06:33", "description": "Is Lennon Miller the next David Turnbull?", "filename": "sport_articles_cxepgk5pp82o_1747748558.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d1de/live/a4495500-306a-11ee-8f52-fbf70e4bf742.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cxepgk5pp82o_1747748558.html", "title": "Is Lennon Miller the next David Turnbull?", "title_page": "Is Lennon Miller the next David Turnbull? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jenna Thomson, Motherwell fan\nAfter a successful start in our cup campaign, I am feeling good going into our first game of the season against Dundee at the weekend.\nHowever, I am cautious that our lack of options in defence and our lack of a consistent striker may hold us back in the long term. We have made some signings to try and rectify this, including the recent capture of Theo Bair, but I can’t see Jon Obika being a 15+ goalscorer this season.\nAs it stands currently, we don’t know when Callum Butcher or Joe Efford will be fit to play again, so if we sign a couple of players on-loan or on temporary deals it should cover ourselves until they are fit again.\nI knew we would sorely miss Butcher and Kevin van Veen but I did not think our quality would have declined as much as it has since their departures, albeit Butcher’s being through injury. Our defence had improved massively once Kettlewell took over and brought in the likes of Dan Casey and Butcher, but with his absence and Casey being left without his partner, our standards have dropped. Silly schoolboy style errors cause Queen of the South to tear us open and caused far too many close calls against Queen’s Park.\nOne of the highlights so far has been watching Lennon Miller. For only being 16-years-old he is showing an ability that is far beyond expectations for his age. Having Lee Miller as a father has probably helped, but make no mistake, he is a player that has earned his place in the first team regardless of his father.\nScoring twice during our group stage games and featuring regularly last season, he has injected a new energy into the team we badly needed. When he made his debut last season against Inverness Caledonian Thistle, he became our youngest player in history to play in the first team and he has more than justified his inclusion. One of the best things Steven Hammell did for the club was bringing him into the fold. If we can get his deal extended by another year or two, I can see him following in the steps of David Turnbull and Allan Campbell and making a name for himself.\nEurope is always the goal in the league, however, given we have lost a lot of our main stars from last season, I think we may fall short of it this year. I still have faith in Kettlewell and I am looking forward to his first full season in charge, but he is facing a difficult rebuild.\nThe optimist in me says we will finish in 4th or 5th but the realist in me would expect us to be around the 6th-8th mark. I may have been more hopeful if key players stayed. I will also be happily proven wrong if we go on to claim 3rd.\nA fixture I am eagerly anticipating this season is Livingston at the Tony Macaroni as it is one of the few away days that only requires one train to travel to!\nOverall, I have faith in Motherwell and can’t wait to be back full time cheering them on again for another season of Kettleball!", "url": "https://www.bbc.com/sport/articles/cxepgk5pp82o"}