{"authors": ["Andy Burke", "www.facebook.com"], "date_download": "2025-05-21 07:51:29", "date_modify": "2025-05-21 07:51:29", "date_publish": "2025-01-30 16:54:57", "description": "Scotland: Townsend on shock Cherry inclusion, 'big player' Graham & Italy challenge", "filename": "sport_articles_c334mejn68eo_1747813889.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ab80/live/71ecf5b0-df2a-11ef-bd1b-d536627785f2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c334mejn68eo_1747813889.html", "title": "Townsend on shock Cherry inclusion, 'big player' Graham & Italy challenge", "title_page": "Scotland: Townsend on shock Cherry inclusion, 'big player' Graham & Italy challenge - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Townsend says he selected Dave Cherry over Ewan Ashman based on good form for Edinburgh and his stronger set-piece game.\nHe adds: \"We see a lot of positives in his game and how a lot of that work around contact allows others to play.\"\nStafford McDowall has earned the 12 jersey in Sione Tuipulotu's absence. Townsend cites his impressive performance in Dublin last season when Tuipulotu was out injured and says: \"Whenever he's been given the opportunity, whether on summer tour or November Test, he's really stepped. He's a very good player, Stafford, he'll bring his own strengths to the game.\"\nOn Jonny Gray being ready for a first cap in two years despite not playing for six weeks: \"What impressed us last week is that he trained fully and got up to speed really quickly.\"\nDarcy Graham - selected for his first Six Nations game since March 2022 - is \"a big player for us\" and has become a more rounded performer in the last year.\nGraham has as many assists as tries now and Townsend adds: \"He wasn't very happy with his performances in November whereas we were and I'm sure the public were. He knows there's more in him and he's improved physically a lot.\"\nOn the challenge Italy will pose: \"They're a confident team in terms of the wins they've delivered together. They're a fit team, they play a brand of rugby which is very structured but also they have the individual talent and the ambition to move the ball wide and they'll be physical.\"", "url": "https://www.bbc.com/sport/articles/c334mejn68eo"}