{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:50:24", "date_modify": "2025-05-21 04:50:24", "date_publish": "2025-01-23 13:07:45", "description": "Celtic fan views on dramatic Champions League win over Young Boys", "filename": "sport_articles_c05l74d441ro_1747803024.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/41c8/live/f3162640-d979-11ef-902e-cf9b84dc1357.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c05l74d441ro_1747803024.html", "title": "Celtic fan views on dramatic Champions League win over Young Boys", "title_page": "Celtic fan views on dramatic Champions League win over Young Boys - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your views on Celtic's 1-0 win against Young Boys which secured a place in the Champions League play-off phase.\nHere's what some of you said:\nClem: First half we were positive and looking to get in behind, could and should have been out of sight. Second half we didn't adapt to their tactical changes. Our wingers just couldn't get on the ball and never looked like getting in behind. The midfield again ran out of legs and basic passing disappeared. However, we dug out the result and qualified.\nJohn: Well-deserved win. We seemed to have blown ourselves out after that brilliant first half. Second half, once again, quite predictable moves. We are going to need a Plan B against Aston Villa as we will be without Daizen Maeda.\nGordy: In the end we made it hard for ourselves, we started brilliantly but were too keen and it all seemed a bit rushed, hence the three offside goals. Penalty misses happen but that would have really settled us and set us up for the second half. Young Boys were always going to have a go and Kasper Schmeichel was brilliant, got the result in the end and onward to the play-offs.\nEdward: Good team performance, we never gave up and kept going right up to the end. Just a pity we didn't win by more, the only blemish was a stupid sending off of Maeda, otherwise a very good performance.\nPaul: Epic European night at Parkhead saw Celtic grind out a steely, resolute performance, especially from Schmeichel, to advance to the knockout out stages. You definitely need a bit of luck in the running, Loris Benito's fortuitous stunning late own goal proved to be the decisive turning point in the match, no more than what Celtic deserved in the end.", "url": "https://www.bbc.com/sport/articles/c05l74d441ro"}