{"authors": ["Seb Brown", "www.facebook.com"], "date_download": "2025-05-21 07:46:19", "date_modify": "2025-05-21 07:46:19", "date_publish": "2025-05-20 11:37:19", "description": "Ipswich news: Can Tractor Boys start fast in Championship?", "filename": "sport_football_articles_crmk3d1jz1do_1747813579.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ed4c/live/b5390d40-54ba-11ef-b2d2-cdb23d5d7c5b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_crmk3d1jz1do_1747813579.html", "title": "Ipswich news: Can Tractor Boys start fast in Championship?", "title_page": "Ipswich news: Can Tractor Boys start fast in Championship? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It will be a busy summer of change at Ipswich as Town look to bounce back to the Premier League at the first time of asking.\nShould Sheffield United win the play-off final then the three relegated sides will be the only ones in receipt of parachute payments in the Championship next season.\nThe debate around the financial disparity in English football is a worthwhile one, but for once Ipswich find themselves on the right side of the line and they must take full advantage of it.\nWith the previously magical two points per game number now not seemingly being enough to guarantee automatic promotion there can be no slow start to the 2025-26 campaign. Ipswich must find a way to flip the switch and change a losing mentality into a winning one quickly.\nNew player arrivals will be the obvious biggest influence on this. Stalwarts of the double promotion seasons will move on with Massimo Luongo, Marcus Harness, Axel Tuanzebe and Cameron Burgess all looking likely to be playing elsewhere next year. Fan favourites such as Nathan Broadhead could also depart as the squad undergoes a refresh. Two central midfielders, two defenders and at least one striker are all needed this summer.\nThe jewel in the crown, for me, will be Kieran McKenna. Some 12 months ago, he was being linked with some of the biggest clubs in the country, and while he has been exposed tactically at times this season, his record in the EFL is extraordinary.\nHaving him at the helm with new player arrivals and the financial advantage of parachute payments should see Ipswich as favourites to win automatic promotion next season. It's fair to say 2023-24 was an incredible season with so many memories. The pressure was never on Ipswich in that promotion race; however, next season, the expectations will be present from day one, and the club will need to deliver.", "url": "https://www.bbc.com/sport/football/articles/crmk3d1jz1do"}