{"authors": ["Alex Brotherton", "www.facebook.com"], "date_download": "2025-04-26 04:09:16", "date_modify": "2025-04-26 04:09:16", "date_publish": "2025-03-02 19:14:34", "description": "Chelsea drop points as Manchester United win to keep the WSL title race alive.", "filename": "sport_football_articles_cgl0e0x3xk4o_1745640556.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c335/live/dd359690-f791-11ef-ba30-7dc3acc49c5d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cgl0e0x3xk4o_1745640556.html", "title": "Chelsea and Man Utd in WSL title race after champions draw and United win", "title_page": "Chelsea and Man Utd in WSL title race after champions draw and United win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "It's fair to say that few expected Manchester United to be involved in a title race this season, having finished fifth last term and with several players then moving on.\nMany expected a drop-off from Chelsea in the wake of manager Emma Hayes' departure, with Manchester City and Arsenal looking best-placed to challenge the Blues' dynasty.\nBut while Bompastor's Chelsea have continued to dominate, dropping points in just two games this season, United have quietly enjoyed a superb campaign.\nThe WSL's form team are currently on a seven-game winning streak, have been beaten once this term and have conceded just six goals in 15 games - fewer than any other side in the division.\nMarc Skinner's side have already beaten last season's points tally of 35 with seven matches still to play.\n\"I'm surprised because of the core group of players they let go,\" former England midfielder Fara Williams told BBC Sport.\n\"I probably didn't give them the chance that maybe I should have. The pressure is back on Chelsea. All Manchester United can do is win the games they have.\"\nGoalkeeper Mary Earps, captain Katie Zelem and top scorer Nikita Parris were among the regular starters to leave the club last summer, yet United look stronger for it.\n\"Having seen how they played this year, the way they have adapted in games and played with different styles is what I am most impressed with,\" Williams said.\n\"We are so used to watching them play out from the back and play through the thirds. At times this season we have seen a different side to them. They haven't been shy of going long and in behind and playing in the opposition half. I have really enjoyed that about Manchester United.\"\nUnited's defensive improvement, inspired by the performances of goalkeeper Phallon Tullis-Joyce and captain Maya Le Tissier, has returned 10 clean sheets in 15 games and has formed the backbone of their bid to secure a place in next season's Champions League.\n\"They have got back to what they are good at and that's defending,\" Williams said.\n\"They have conceded the least amount of goals in the WSL and that is a baseline for them. That is what got them second in the league two seasons ago.\"\nOf course, United continuing their winning run means little in the title race unless Chelsea drop more points.\nThe defending champions won their first nine games of the season, but have drawn two of their past six.\nTaking 14 points from a possible 18 hardly represents a major slip, but Bompastor's side have a tough run coming up.\nAfter facing Manchester City four times in three different competitions in the space of 12 days, Chelsea will face United at the end of April in a potential title decider.\n\"Chelsea have a real difficult run of games,\" Williams said.\n\"That will be difficult and I'm sure United will want Chelsea to drop points.\"\nUnited looked to have little chance of winning the title when a 1-0 defeat by Chelsea in November left them nine points adrift.\n\"Marc Skinner will keep convincing his team that they have got to keep their foot to the floor,\" said Rachel Brown-Finnis.\n\"They have got to try and capitalise on any slip that Chelsea might make.\n\"Chelsea are still battling for Champions League. There is going to be congestion in their calendar and not in Manchester United's. If that chance arises, they have to be in the best position to be able to jump at it.\"\nSkinner certainly isn't getting carried away, though he is confident his side can keep up their current form.\n\"Chelsea will look after Chelsea, we will look after Manchester United,\" he told BBC Sport.\n\"We go game by game, we always have. I know it sounds boring and cliched but we cannot drop our idea onto anyone else apart from Sunderland next week, and then it will be Liverpool and then it will be Villa. It will be single games at a time, full focus, and if you drop it you see that teams can hurt you.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cgl0e0x3xk4o"}