{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:06:03", "date_modify": "2025-05-21 06:06:03", "date_publish": "2025-02-08 17:18:32", "description": "England's Cara Gainer beats Diksha Dagar in a play-off to secure her maiden Ladies European Tour event title at the Lalla Meryem Cup.", "filename": "sport_golf_articles_c0rqyv1vy1eo_1747807563.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b2c9/live/8517dd00-e63a-11ef-be8a-f58c2532b074.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_golf_articles_c0rqyv1vy1eo_1747807563.html", "title": "Cara Gainer seals first Ladies European Tour title at Lalla Meryem Cup", "title_page": "Cara Gainer seals first Ladies European Tour title at Lalla Meryem Cup - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England's Cara Gainer claimed the first Ladies European Tour win of her career in a play-off at the Lalla Meryem Cup on Saturday.\nThe 29-year-old defeated India's Diksha Dagar to lift the title in Morocco in what was the 76th tournament she has played on the Tour.\nGainer posted a final round of four-under 69, while 24-year-old Dagar finished on six-under 67, leaving the pair tied on nine under overall.\nA bogey for Dagar opened the door for Gainer to take victory by birdieing the play-off hole.\nIreland's Lauren Walsh finished joint-fourth with Nuria Iturrioz on seven under, while England's Annabell Fuller ended level on six under with France's Nastasia Nadaud.\nGainer was one of nine players chasing down overnight leader Shannon Tan after Friday's third round.\nSingapore's Tan was overtaken by the first nine holes, however, as she failed to make any birdies, eventually ending the tournament in third.\nIturrioz started brightly with four consecutive birdies to take the lead, but the Spaniard dropped out of the running after four bogeys on the back nine.", "url": "https://www.bbc.com/sport/golf/articles/c0rqyv1vy1eo"}