{"authors": ["Clive Lindsay", "www.facebook.com"], "date_download": "2025-05-21 06:18:26", "date_modify": "2025-05-21 06:18:26", "date_publish": "2025-01-04 15:13:14", "description": "Hibernian v Rangers - Game of the day", "filename": "sport_articles_c140d6641m7o_1747808306.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/748d/live/593c9ec0-caae-11ef-8fb8-75874e244aea.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c140d6641m7o_1747808306.html", "title": "Hibernian v Rangers - Game of the day", "title_page": "Hibernian v Rangers - Game of the day - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Hibernian head coach David Gray and Rangers counterpart Philippe Clement go into Sunday's early kick-off looking to continue the momentum that has eased some of the pressure that was mounting over their respective futures.\nThursday's 1-1 draw away to bottom side St Johnstone was not particularly impressive, but it came on the back of four straight wins that have lifted Hibs off the foot of the table, into seventh place and back in the hunt for European qualification.\nSecond-top Rangers, meanwhile, arrive at Easter Road buoyed by a stunning 3-0 derby win over leaders Celtic.\nConsidering the reigning champions are still 11 points clear of their city rivals, it has not exactly reignited a title race, but at least it gave a signal that Clement's side have more potential than the previous one win in five had suggested.\nHibs have suffered only one defeat in their latest six at home - and are unbeaten in their latest three - while Rangers have shed points on their past two games away from Ibrox.\nHowever, the Glasgow side are unbeaten in 13 visits to Easter Road, winning eight of those - their joint-longest run against the Leith outfit.\nIndeed, overall, Hibs have lost eight games in a row against Rangers since a 2-2 draw at Easter Road in August 2022 - one short of their worst ever losing streak against the Ibrox side.\nThat is the only time Hibs have avoided defeat in 11 meetings since their 3-1 Scottish League Cup semi-final win at Hampden in November 2021.\nRangers have conceded just one goal - and scored 13 - in the latest five meetings between the sides and their fans will be expecting their team to build on their Old Firm excellence despite Hibs' recent revival.\nOf course, with some fans and pundits blaming Clement's rotation policy for his side's inconsistency, much of the spotlight will be on whether the Belgian this time sticks with what appears to be a winning formula.", "url": "https://www.bbc.com/sport/articles/c140d6641m7o"}