{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:22:22", "date_modify": "2025-04-26 06:22:22", "date_publish": "2025-03-04 00:00:00", "description": "Follow live text commentary, score updates and match stats from PSV vs Arsenal in the UEFA Champions League", "filename": "sport_football_live_c8j00ke2r23t_1745648542.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ce58/live/a7fe0050-f93c-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_c8j00ke2r23t_1745648542.html", "title": "UEFA Champions League", "title_page": "PSV vs Arsenal: UEFA Champions League stats & head-to-head - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Arsenal demolished PSV Eindhoven in the Netherlands to take a commanding lead into the second leg of their Champions League last-16 tie.\nThe Gunners scored three goals in the first half and four goals in the second to all but confirm their place in the quarter-finals of the competition, with a trip to Madrid on the horizon.\nIsmael Saibari hit the crossbar early on for the home side but Arsenal took control after Jurrien Timber scored Arsenal's opener in the 18th minute.\nEthan Nwaneri doubled Arsenal's lead just three minutes later when Myles Lewis-Skelly cleverly cut the ball back for the 17-year-old to powerfully score past Walter Benitez.\nLewis-Skelly, who had already been booked, was fortunate to stay on the pitch shortly after when he fouled Ledezma, and Mikel Arteta replaced him with Riccardo Calafiori with 10 minutes of the first half left.\nMikel Merino added a third following a defensive mix-up before Noa Lang pulled one back from the penalty spot for PSV after Thomas Partey fouled Luuk De Jong.\nArsenal continued to attack with ease as soon as the second half started and Martin Odegaard made sure there was not going to be a PSV comeback when he scored from close range after Benitez pushed a cross out into the area.\nSubstitute Calafiori then combined well with Leandro Trossard who chipped the ball over Benitez from close range to score Arsenal's fifth just one minute later.\nOdegaard scored his second with an excellent individual effort before Calafiori grabbed a goal late on as Arsenal registered their record away win in the Champions League.\nIn the new format, Arsenal can plot their route through the competition, and despite having next week's second leg to come, they look set to take on either 15-time champions Real Madrid, or their city rivals Atletico.\nReal won the first leg of their last-16 tie 2-1 on Tuesday with the second leg to follow at Atletico.\nThe talk before this match was about how Arsenal manager Mikel Arteta needed to find a solution for his side's attacking issues, but the free-scoring Gunners did not play like a team who had failed to find the net in three of their previous four matches.\nFrom the beginning Arsenal were on top, applying pressure and passing the ball with an intensity that they have lacked in recent weeks.\nDeclan Rice had a goal ruled out for offside before Odegaard thought he should have been given a penalty as Arsenal showed warning signs to PSV that they had found a way to play with so many of their key attackers out injured.\nIn contrast to the Gunners, PSV's defensive frailties had been under scrutiny.\nSince the beginning of the year the Dutch side have kept just one clean sheet in 14 matches and head coach Peter Bosz had his tactics questioned in the pre-match news conference.\nThose questions seemed justified as PSV were time and again cut open by a ruthless Arsenal side.\nNwaneri again showed why he has been trusted with such a key role in Bukayo Saka's absence and his strike was his eighth goal in 28 games in all competitions this season.\nHe became just the third English player to start in a knockout stage game in the competition while under the age of 18, after Jude Bellingham and Phil Foden.\nTimber had said before the match how this tie was an opportunity for Arsenal to \"change the narrative of their season\" and there won't be many speaking about the Gunners lack of a striker after this resounding win.", "url": "https://www.bbc.co.uk/sport/football/live/c8j00ke2r23t"}