{"authors": ["Timothy Abraham", "www.facebook.com"], "date_download": "2025-05-20 12:17:43", "date_modify": "2025-05-20 12:17:43", "date_publish": "2023-08-05 06:01:23", "description": "BBC Sport gets to know Hampshire seamer John Turner, who has has been named in England's T20 squad to face New Zealand.", "filename": "sport_cricket_66409242_1747743463.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/F54B/production/_130659726_johnturnergraphic.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66409242_1747743463.html", "title": "John Turner: Why England's new T20 bowler could be the new Glenn McGrath", "title_page": "John Turner: Why England's new T20 bowler could be the new Glenn McGrath - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A version of this article was published on 5 August 2023.\nTongues have been wagging in county cricket about an intelligent quick bowler with a sensible haircut and impeccable manners.\nDuring an impressive campaign in the T20 Blast for Hampshire Hawks, John Turner bagged 21 wickets at an average of 11.76 and an economy of 6.67 - the best of anyone who had bowled more than 10 overs in the competition.\nThe 22-year-old was born in Johannesburg but officially qualified for England this month and has been picked as a wildcard for The Hundred with Trent Rockets.\nTurner's rise has continued as he has been named in England's squad for four T20s against New Zealand from 30 August.\nBBC Sport spoke to four people who have seen him at close quarters to gain an insight into his impressive development, understand the type of bowler he is and why an international career beckons.\nMichael Booth, South Africa Under-17 player of the year in 2019 and now on the books of Warwickshire, opened the bowling with Turner for Hilton College in South Africa.\n\"If you see the way he celebrates a wicket in the T20 Blast it's exactly how he did at school throughout all the age groups. No matter what it was, he was always up for the game. John is someone who has always had that burning determination.\n\"He was the head boy at school and he got six or seven As, but was a very calm and humble person. He is an only child and maybe, initially at least, his parents sheltered him a little bit and were not particularly [keen] on him playing cricket in England as a career.\n\"His dad is a lawyer and his mum runs a shoe company and both of them said his academic studies came first, which is fair enough. It took a lot of persuasion to let John fulfil his dream to be a cricketer alongside studying for a degree at Exeter University.\n\"Some parents are quite pushy when it comes to sport but that was never the case with John. The passion to play cricket came from within himself.\n\"You could always see he had a determination to make it. He enjoyed watching Stuart Broad bowl and aspired to be like him the most out of England's bowlers.\"\nGloucestershire coach Dale Benkenstein first cast eyes on Turner when he was working as head of cricket at Hilton College in South Africa, and helped him earn a contract at Hampshire.\n\"John had a beautiful action, even when he was very small at school. When he grew into his mid-teens he was able to keep that repeatable action. It was very high, and a wrist which helped him push the ball in a little bit. There were a lot of fundamentals there which any coach would have liked.\n\"He was also a hockey goalkeeper, which helped him develop a great all-round physical strength along with the mental pressure of being the last line of defence. He does have that red mist which comes down every now and then, which you do need as a bowler, but he is really intelligent too.\n\"He reminds me of Glenn McGrath. He is not as tall but he has that repeatable action. I didn't see him as an out-an-out quick bowler but he bowls at a good pace.\n\"From what I have seen, and the reports back from our own batters at Gloucestershire, he is up there. He has the ability to bowl quick, high 80s, but not miss the right lines and lengths. He's done well in white-ball cricket but he looks a Test bowler to me.\n\"A lot of credit has to go Hampshire and bowling coach Graeme Welch, who is working with him. He has fine-tuned him. Hampshire got a racehorse and Graeme is turning him into a thoroughbred. He's really got a chance to make it to the highest level.\"\nBBC Radio Solent commentator Kevan James, who played for Hampshire from 1985 to 1999, witnessed Turner's county debut when he removed England's all-time leading Test run-scorer Alastair Cook in the Royal London One-Day Cup in July 2021.\n\"Cook was trying to work it into the leg side and spooned it up. It doesn't matter where it is - to get a guy with over 12,000 Test runs as your first wicket isn't bad at all.\n\"Turner bowls a very tight line, tight narrow channels, in and around that off stump. He doesn't tend to deviate much from that. He hits the deck hard and is quite strong in the shoulders. He bowls with a decent pace and was beating batters for genuine pace in the T20 Blast this year.\n\"Some quicker bowlers let them slip down the leg side but he's much tighter than that. He doesn't bowl a lot of rubbish.\n\"He's only played two Championship games but the fact he's already done well in four-day cricket as well as T20 suggests that the guy has got what it takes. With the pace he bowls, and he doesn't waver from a good line and length, that's what will stand him in good stead. \"\nHampshire all-rounder Keith Barker, who has taken 499 first-class wickets.\n\"Is John a potential England player of the future? 100%. The sky is the limit for JT. I remember being shown a video of him a few years back before Hants signed him and he looked quite the burner.\n\"When he came over you could see the attributes he had. He probably had to adjust his lengths slightly over here and bowl a little bit fuller.\n\"It's the bounce he gets which I haven't really seen before from many other bowlers. He gets a lot when he gets it right. He's only going to get quicker.\n\"The next level now is him looking at his variations, his slower balls. That's something he has already identified with Graeme Welch.\n\"People are trying to take him on by ramping him, but they have found themselves quite rushed. Without giving too much away, he's already looked at how he can counter that ramp shot.\n\"Playing in The Hundred will expose him to better players and keep learning his craft. Coming up against international players who have been there and done it and might not see his pace as so much of a threat. He might have to look at using different skills and ideas to get the better of them.\"", "url": "https://www.bbc.com/sport/cricket/66409242"}