{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:29:56", "date_modify": "2025-05-19 14:29:56", "date_publish": "2017-07-23 19:58:27", "description": "Jordan Spieth says he will enjoy his Open victory more than any other win after playing the best five-hole stretch of his life.", "filename": "sport_golf_40700703_1747664996.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/10C11/production/_97052686_spieth_reuters.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_golf_40700703_1747664996.html", "title": "The Open 2017: Jordan Spieth will enjoy Birkdale win more than any other", "title_page": "The Open 2017: Jordan Spieth will enjoy Birkdale win more than any other - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jordan Spieth says he will enjoy his Open victory more than anything he has achieved in golf after playing the \"best five-hole stretch of his life\".\nSpieth lost his three-shot overnight lead by the turn on Sunday and trailed Matt Kuchar after bogeying the 13th.\nBut he then went on a run of birdie, eagle, birdie, birdie before making par at the last to finish on 12 under and win by three shots at Royal Birkdale.\n\"I feel fortunate the way everything happened,\" said the 23-year-old.\n\"I'll thoroughly enjoy this. It's as much of a high as I've ever experienced. I'll enjoy it more than anything I've achieved.\"\nSpieth sent a wayward drive 120 yards right of the fairway and into the deep rough on the 13th hole.\nAfter discussing with the R&A rules officials, he took a penalty drop and played what became his third shot, more than 20 minutes after he struck his drive and went on to make bogey.\nHe said memories of Augusta in 2016, when he squandered a five-shot lead at the Masters, crept into his head but praised caddie Michael Greller for some wise words.\nAnd the American then picked up five shots on the next four holes to retake the lead, before finishing with a par to claim his third major.\n\"That five-hole stretch is by far the best stretch of golf I have ever played,\" he told BBC Sport.\n\"To have it be at a major championship in the final round on Sunday, I'll have to sit back and think about it later on.\"\nThe victory sees Spieth become just the 12th player in history to win three of golf's four majors and the second, after Jack Nicklaus to do so before turning 24.\nHaving won his first two majors, the Masters and US Open, in 2015, Spieth, who turns 24 on Thursday will head to the US PGA Championship at Quail Hollow next month looking to become just the sixth player to complete the career Grand Slam since the Masters was added to the roster in 1934.\nNicklaus, Tiger Woods, Ben Hogan, Gene Sarazen and Gary Player are the five to have achieved the feat, while Bobby Jones completed the original Grand Slam of US Amateur, US Open, The Open and The Amateur Championship in 1930.\n\"That's now the tournament that's really holding me back from everything I wanted to achieve in my career,\" said Spieth, who would become the youngest to win all four should he succeed this time.\n\"The career Grand Slam is a life goal of mine. Growing up I just wanted to compete, but things have progressed quickly.\"\nKuchar turned professional in 2000 after a brief spell working in financial services and said contending in a major was part of a \"lifelong quest\".\nThe 39-year-old did little wrong in picking up two shots of his own between holes 13 and 17, but trailing by two on the 18th tee he had to force the issue and ended up dropping a shot.\n\"It's hard to explain, it's crushing and it hurts,\" said the seven-time PGA Tour winner who recorded his best finish in a major. \"It's an excitement and thrill to have played well, put up a battle, a fight.\n\"You work so hard to get to this position and have a chance to make history and win a championship. You don't get many opportunities. To be this close and taste it with five holes to go, it's a hard one to sit back and take.\"\nKuchar's mark of nine under means he has now finished in the top 10 of the sport's four biggest events on 10 occasions.\n\"As tough as it is to finish second, I'm sure it will lead to me continuing to work hard and push me harder to finish one place better,\" he added.", "url": "https://www.bbc.com/sport/golf/40700703"}