{"authors": ["Pat Riddell", "www.facebook.com"], "date_download": "2025-05-21 07:43:34", "date_modify": "2025-05-21 07:43:34", "date_publish": "2025-05-20 12:53:04", "description": "Nottingham Forest news: Marinakis and the Champions League showdown", "filename": "sport_football_articles_cy90v1z9ve4o_1747813414.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2992/live/78122530-b62e-11ee-8f07-bbfdfa890097.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy90v1z9ve4o_1747813414.html", "title": "Nottingham Forest news: Marinakis and the Champions League showdown", "title_page": "Nottingham Forest news: Marinakis and the Champions League showdown - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "And so Sunday has shaped up to be the showdown we were almost always expecting. For all Nottingham Forest's trials and tribulations this season, the last day of the season was never going to be a walk in the park.\nIt is, of course, a time for celebration. To go from the brink of relegation to the brink of the Champions League is an incredible achievement. European football is already guaranteed, yet three competitions remain within our grasp.\nWe are now dependent on other results going our way for the Champions League, but back in August everybody would have bitten your hand off for the choice of the Uefa Conference League or, if we win our final game against Chelsea, the Europa League.\nThis group of players have given everything to the cause, the manager has expertly guided and strategised along the way, and the club has backed and supported as best they can. Sometimes, and in Nottingham Forest's case very rarely, everything comes together just at the right time - a happy accident of recruitment or pure genius? Probably somewhere in between.\nA team of often overlooked, occasionally forgotten about, even rejected players - and the manager himself fits that category - have come together to prove themselves, to prove that this great club still stands for something. For all the money that the Reds have spent since promotion three years ago, the core of our first XI cost little more than the £100m transfer fee Manchester City spent on Jack Grealish.\nThis season has been physically and mentally draining - for the fans as much as the players - and while FA Cup glory was a step too far, nobody should overlook the progress made in the past year. As the tattoo on owner Evangelos Marinakis's arm reads: Dream, Love, Create, Fight, Survive, Win. A battle call for Sunday if there ever was one.", "url": "https://www.bbc.com/sport/football/articles/cy90v1z9ve4o"}