{"authors": ["Geoff Doyle", "www.facebook.com"], "date_download": "2025-05-21 05:20:38", "date_modify": "2025-05-21 05:20:38", "date_publish": "2025-04-03 13:02:57", "description": "BBC Three Counties Radio's Geoff Doyle on why Giorgi Chakvetadze is Watford's only realistic contender to make the Championship Team of the Season.", "filename": "sport_football_articles_c985dr54n65o_1747804838.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/219f/live/d69314e0-108a-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c985dr54n65o_1747804838.html", "title": "Giorgi Chakvetadze: 'Watford playmaker among Championship's best'", "title_page": "Giorgi Chakvetadze: 'Watford playmaker among Championship's best' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It's that time of the year when divisional teams of the season are named and from Watford, Giorgi Chakvetadze is likely to be the only player in contention for a place in that XI.\nThere have been other solid performers in the Hornets squad, and a few more may have had a chance if they had been playing all season.\nBut Chakvetadze has consistently delivered across the season. He's been a constant threat and the amount of poor games he's had you could probably count on one hand.\nHe leads the Championship in terms of distance carried by a huge stretch (10,276m with Leeds' Joe Rodon second on 8,427m) and the same goes for distance progression (5,839m against 5,148m by Rodon), both of which he's led from start to finish.\nMany of these runs have ended with chances (he's second in this particular metric with 73; Middlesbrough's Finn Azaz leads on 77).\nThe stats are very impressive and tell us that with the ball at his feet Chakvetadze is the best in the division at breaking lines and getting into the final third.\nTom Cleverley has compared him to Manchester City's Jack Grealish. I actually think he's a better ball-carrier than Grealish who offers superior technique in many other skill-sets. Grealish's team-mate Savinho is maybe a better comparison.\nTo take himself to the next level, though, Chakvetadze has to add the final piece of the jigsaw - goals and assists.\nHe does create a lot of chances and you wonder if he was in a better side with superior forwards would his assists total be higher? That could be argued, but what can't and what he needs to work on, which he and his coaches will know, is the goals column.\nTwo in 38 isn't enough for someone of his undoubted talent. Technique in striking a ball under pressure can be questioned but Cleverley feels it's more about mindset - and that is something they are working on.\nChakvetadze, I'm sure, will become a Premier League player but those clubs that are likely to be watching him now will have reservations about these goal stats and they could decide which level of team he plays for at the next level.\nThat said, in an odd season where there haven't been many outstanding attacking players (defenders Maxime Esteve and CJ Egan-Riley plus midfielders Vinicius Souza, Ao Tanaka and Josh Brownhill will be bang in contention for player of the season), Chakvetadze could still make that Championship best XI.", "url": "https://www.bbc.com/sport/football/articles/c985dr54n65o"}