{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-05-21 03:59:51", "date_modify": "2025-05-21 03:59:51", "date_publish": "2025-04-07 07:23:15", "description": "Man Utd news: Simon Stone on Manchester derby", "filename": "sport_football_articles_c4g8xg49rk2o_1747799991.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d950/live/9a5883d0-137c-11f0-a9df-914426228455.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c4g8xg49rk2o_1747799991.html", "title": "Man Utd news: Simon Stone on Manchester derby", "title_page": "Man Utd news: Simon Stone on Manchester derby - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester United's problems are huge.\nIt is difficult to imagine Ruben Amorim choosing many of the players available to him in an ideal squad.\nBut the fundamental point is a lack of goal threat.\nUnited have failed to score in 11 of their 31 Premier League games this season. Aside from matches against the three teams destined to go down, they have scored two goals or more on six occasions, including when they lost at home to Nottingham Forest on 7 December.\n\"We had the same lack of goal [threat],\" said Amorim, when asked about comparisons to last Tuesday's defeat by Forest at the City Ground.\nUnited need to be significantly better at recruitment in the summer than they have been on the pitch this term.\nWing-backs, central defenders and central midfield are all areas of weakness, let alone up front, where Rasmus Hojlund and Joshua Zirkzee continue to toil for little reward. It is now a combined four goals in 48 appearances for the pair since the Europa League win over Viktoria Plzen on 12 December, when Hojlund scored twice.\nOn Sunday, Amorim talked about how he thinks things are going on the good days. That implied there have been other days when he has wondered if United are heading in the right direction.\n\"In the moment it's still really hard every day, but of course you can imagine that the next season is going to be so much different,\" he said. \"That's why I'm always saying I'm in a rush. Everybody here is suffering a lot with all these changes. We have to show something in the next year, right away.\n\"In the good days you think like that, that it was important to come [here] in the middle of the season, to work with the players, to improve the players as soon as possible, to start the next season with the better idea of what we want.\"", "url": "https://www.bbc.com/sport/football/articles/c4g8xg49rk2o"}