{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:42:52", "date_modify": "2025-05-21 07:42:52", "date_publish": "2025-03-28 10:31:53", "description": "Back row Jake Heenan will leave Bristol Bears at the end of the campaign after seven seasons with the club.", "filename": "sport_rugby-union_articles_c77820eg7zgo_1747813372.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e9bc/live/22660520-0b3c-11f0-80cd-45d386f77565.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c77820eg7zgo_1747813372.html", "title": "Jake Heenan: Bristol back row to leave club after seven seasons", "title_page": "Jake Heenan: Bristol back row to leave club after seven seasons - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Long-serving forward Jake Heenan will leave Bristol Bears at the end of the campaign after seven seasons with the club.\nThe New Zealand-born back-row has made more than 100 appearances for the club since arriving from Connacht in 2018.\nThe 33-year-old has played in nine matches so far this campaign, starting five and said he wants to take the \"opportunity to return home to finish my career\".\nThe former New Zealand under-20 captain is one of the Bears' current longest-serving players.\n\"Joining the club at the start of its journey back into the Premiership was a special moment and Bristol has become much more than just a place to play rugby,\" Heenan told the club website.\n\"It's where I married my beautiful wife, Adele, raised our son, Max, and built a foundation for the future.\n\"Making 100 appearances for the club and lifting European silverware are among my proudest achievements in the game.\n\"A special thanks to Pat [Lam, Bristol director of rugby], who took a chance on me back in 2010. Your guidance and belief gave me the confidence to achieve incredible things on and off the field. I will always be grateful for your challenge, leadership and unwavering support.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/c77820eg7zgo"}