{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:28:03", "date_modify": "2025-05-21 06:28:03", "date_publish": "2025-01-22 21:06:07", "description": "Wrexham: Max Cleworth says players are ignoring 'outside noise' before Birmingham City", "filename": "sport_football_articles_cp3wnn94374o_1747808883.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/fb4d/live/c30e5750-d8b2-11ef-89b6-372b2b3acad8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cp3wnn94374o_1747808883.html", "title": "Wrexham: Max Cleworth says players are ignoring 'outside noise' before Birmingham City", "title_page": "Wrexham: Max Cleworth says players are ignoring 'outside noise' before Birmingham City   - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Max Cleworth says Wrexham are trying to block out the \"outside noise\" as they prepare to face Birmingham City in perhaps their biggest game of the season.\nWrexham welcome the League One leaders to the Stok Racecourse on Thursday (20:00 GMT) in a fixture being dubbed the 'Hollywood Derby' because of Blues' US backing and Wrexham's showbiz ownership.\nBut defender Cleworth insists Phil Parkinson's players are trying to ignore the hype as Wrexham look to avenge their 3-1 defeat at St Andrew's in September.\n\"The media are obviously hyping it up a bit more because of the American influence on both sides, but it's just another game for us, another chance to get three points and that's what we're looking to do,\" he said.\n\"Don't get me wrong, it's good to test yourself against teams like Birmingham, especially when you look at where Wrexham have come from and the teams we were facing. Birmingham coming to the Racecourse shows the progression.\n\"Ever since the owners (Ryan Reynolds and Rob McElhenney) came in, there's been an added pressure. We've dealt with that when going for titles and promotions.\n\"We've got to try to ignore all the outside noise and focus on the job in hand.\"\nCleworth and his defensive colleagues will come up against two of League One's most potent strikers as they look to bounce back from last week's 2-1 defeat at Shrewsbury and cut the five-point gap to Birmingham.\nBlues pair Alfie May and Jay Stansfield have 22 league goals between them this season, while Chris Davies' team have the best defensive record in the division with just 17 conceded.\n\"They're obviously two really good players and they've got other strong players in their attack, whether they're starting or coming off the bench,\" said Cleworth.\n\"We're going to look to be at our best against them. We'll have to be right at it.\n\"Our home form is special, but it's not something we take for granted. We have to make sure we put the performance in.\"", "url": "https://www.bbc.com/sport/football/articles/cp3wnn94374o"}