{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:08:53", "date_modify": "2025-05-21 06:08:53", "date_publish": "2025-01-26 00:00:00", "description": "Chelsea pull further away from their Women's Super League rivals, extending their lead at the top of the table to nine points with a late victory over Arsenal.", "filename": "sport_football_live_cd0jlz3grryt_1747807733.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cd0jlz3grryt_1747807733.html", "title": "Chelsea 1-0 Arsenal: Guro Reiten penalty sends Blues nine points clear in WSL", "title_page": "Chelsea 1-0 Arsenal: Guro Reiten penalty sends Blues nine points clear in WSL - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Chelsea strengthened their grip on the Women's Super League title with a late victory over in-form rivals Arsenal at Stamford Bridge.\nSubstitute Guro Reiten scored from the penalty spot after England international Lauren James was brought down in the box by Arsenal captain Kim Little.\nA frantic few minutes followed as Arsenal defender Katie McCabe was shown two yellow cards and was sent off for dissent by referee Emily Heaslip.\nBut among the chaos was the usual composure of Reiten, who stepped up and placed the ball calmly past goalkeeper Daphne van Domselaar to seal victory.\nIt was the perfect start to the afternoon for Chelsea fans as USA defender Naomi Girma was unveiled as a world-record women's signing minutes before kick-off.\nChelsea responded to the buzz of the home crowd and put Arsenal under pressure early on.\nCatarina Macario came close twice before Arsenal finally began to settle.\nEngland international Beth Mead was busy but not clinical, while Arsenal substitute Frida Maanum came closest when she whipped the ball inches over the crossbar.\nBoth managers turned to the bench for inspiration after the break, with James making a WSL return from injury for the first time since October, and it was her weaving run which earned Chelsea the decisive penalty.\nThe result - which temporarily extended Chelsea's lead at the top to nine points before Manchester United's victory on Sunday evening cut it to seven - means the Blues are now firm favourites to win the WSL for a sixth successive season, while it is a first defeat for Arsenal manager Renee Slegers.\nGirma's unveiling set the tone for what would become a brilliant afternoon for Chelsea.\nShe came out on a red carpet laid in front of the tunnel's entrance and her face appeared on the big screen.\nShe waved and smiled to all four stands while Arsenal fans watched on begrudgingly in the corner, momentarily silenced, as they knew this was a signing that could extend Chelsea's dominance.\nThe defending champions responded to the extra buzz created by Girma's arrival and did not waiver despite momentum swinging towards Arsenal at the end of the first half.\nChances came and went for England duo Alessia Russo and Beth Mead, while Catarina Macario should have scored at least once for Chelsea.\nWith the rain pouring heavily throughout the second half, the game became more open and the substitutes played their part.\nJames' individual brilliance was the spark Chelsea had missed and Reiten did the rest, while Arsenal were still coming to terms with McCabe's sudden sending-off.\n\"When you have a squad that has a lot of talent and quality, you know you can bring players in and they can have a big impact,\" said Chelsea manager Bompastor.\n\"It's never easy for them not to start the game, especially in a London derby. Obviously they have the right mentality and that is good.\n\"They just thought about the team first. When they came in they had a big impact and that's important for me to have in the squad.\"\nThe Arsenal defender was furious as she left the pitch, arguing with the fourth official and kicking hoardings as she went prematurely down the tunnel.\nIt was a bitter way to end a disappointing trip across London as Arsenal suffered a second defeat by their rivals this season. The 2-1 loss at Emirates Stadium led to the resignation of manager Jonas Eidevall in October.\n\"It's those small details. You know what Chelsea's strengths are. Every little chance they get, they will take,\" said Arsenal manager Slegers afterwards.\n\"That is their biggest strength as a team so you have to be on your toes the whole game and be concentrated.\n\"If I could play the game again today, I would want to, as I think we are good enough to do more against Chelsea. We could have been more clinical.\"\nBut for Chelsea it was everything they could have hoped for - three points, a clean sheet and a return for James which will no doubt give them a boost on their quest to win four trophies this season.", "url": "https://www.bbc.com/sport/football/live/cd0jlz3grryt"}