{"authors": ["Andy Cryer", "www.facebook.com"], "date_download": "2025-05-21 07:24:13", "date_modify": "2025-05-21 07:24:13", "date_publish": "2025-05-19 21:47:14", "description": "Mohamed Salah's wait goes on in his bid to beat the Premier League's goal involvement and assist records - but he has one more chance this season.", "filename": "sport_football_articles_c628xvxep82o_1747812253.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/48f3/live/ad6b2f00-34f5-11f0-ac14-eb0f4e30713f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c628xvxep82o_1747812253.html", "title": "Brighton 3-2 Liverpool: Mohamed Salah waits for Premier League record", "title_page": "Brighton 3-2 Liverpool: Mohamed Salah waits for Premier League record - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The wait to break the Premier League's goal involvement record goes on for Mohamed Salah.\nBut on his 400th Liverpool appearance, he really should have been celebrating equalling the tally.\nQuite how the Egyptian side-footed Cody Gakpo's low cross wide of an empty net from just yards out in Monday's defeat at Brighton, no-one really knows. His own wry smile suggested his own disbelief.\nTwo months ago, he looked set to destroy Premier League records and produce the greatest attacking individual season in the competition's history.\nSalah's double against Southampton on 8 March took him to 27 goals and 17 assists in 29 matches, just three goal involvements short of the Premier League record of 47, held jointly by Alan Shearer and Andrew Cole.\nHe also looked certain to beat the record of 20 Premier League assists in a season, jointly held by Arsenal's Thierry Henry and Manchester City's Kevin de Bruyne.\nSince then, Salah has recorded just one goal and one assist in eight matches, leaving him still one short of the goal involvement record and two short of the assist record.\nAfter Monday's missed sitter, Liverpool boss Arne Slot said: \"The first thought that goes through my head when I see the ball moving towards Mo, I'm like, 'It's quite a big chance, this could lead to a goal', because that's what Mo normally does.\n\"He's been throughout this season almost inhuman. But there were moments in the season where he was human, so it's not the first time that he's not scoring for one or two games in a row.\n\"But the good thing for us is this hardly ever happens and, if it happens, you can be sure that he will score in the third game or the fourth game.\"\nAfter helping Liverpool secure the Premier League title on 27 April, Salah said: \"Hopefully I'm going to break [the goal involvements record] soon. It's something pushing me forward to just keep going and keep working hard.\"\nWith one game to go - the visit of Crystal Palace to Anfield - you still would not bet against him.\nSalah, who captained Liverpool for the first time in the loss at Brighton, looks certain to match one record by the end of the season - with the Golden Boot heading his way once more.\nThe 32-year-old leads the goal rankings with 28 this season, five ahead of Newcastle's Alexander Isak with just one match to play.\nSo barring anything ridiculous in the final game of the campaign, Salah will win the Premier League Golden Boot for a fourth time, equalling Henry's record.\nHe will also have an eye on winning the European Golden Shoe, an award given to the leading league scorer in Europe.\nSporting's Swedish striker Viktor Gyokeres currently tops those standings with 39 goals but, with the Portuguese league season now over, all he can do is watch and wait.\nSalah needs two goals in the final game of the campaign against Palace to overtake him, while Real Madrid's Kylian Mbappe is just one goal away from Gyokeres, also with one match remaining.\nWhile Salah (28 goals) and Mbappe (29 goals) are way short of the former Coventry striker's tally, they can go past his points total thanks to the Golden Shoe's scoring system.\nIt's not decided simply by which player scores the most goals; the award uses a points-based system that considers the strength of the league in which a player competes.\nCreated in the 1967-68 season, the Golden Shoe was previously awarded to the top scorer in any European league.\nHowever, in 1997 the rules were changed to use a ranking format that favours players in the higher profile leagues.", "url": "https://www.bbc.com/sport/football/articles/c628xvxep82o"}