{"authors": ["Timothy Abraham", "www.facebook.com"], "date_download": "2025-05-21 06:05:44", "date_modify": "2025-05-21 06:05:44", "date_publish": "2025-04-01 14:40:39", "description": "Sam Billings says there has been no contact from England over the vacant men's white-ball captaincy.", "filename": "sport_cricket_articles_c5yg8j41r0go_1747807544.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8a29/live/0363fbf0-0f06-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c5yg8j41r0go_1747807544.html", "title": "Sam Billings has had no contact over England white-ball captaincy", "title_page": "Sam Billings has had no contact over England white-ball captaincy - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Sam Billings says there has been no contact from England over the vacant men's white-ball captaincy.\nEngland director of men's cricket Rob Key and coach Brendon McCullum have not ruled out the possibility of the next captain coming from outside the current squad, with the former saying \"nothing is off the table\".\nBillings, 33, has not played for England since 2022 but he has developed a reputation as a smart skipper with Kent and has significant franchise experience.\nA BBC Sport poll on who should be England's new white-ball captain had Billings as the preferred man to take the job over Ben Stokes and Harry Brook.\nBillings acknowledged last month he would \"jump at the opportunity\" to captain England's limited-overs side but when asked if either Key or McCullum had been in touch since, he said \"no\".\n\"I haven't spent too much time thinking about it. I haven't played for England for more than two years,\" said Billings, who was speaking at an England and Wales Cricket Board event to launch the domestic season.\n\"I have been playing well, playing some good cricket and I'm at a really enjoyable stage of my career.\"\nBillings has played three Tests, 28 one-day internationals and 37 T20s for England, but none since November 2022.\nHe was touted by some as a potential replacement for Joe Root as Test captain earlier the same year, prior to Stokes being given the job.\nStokes and white-ball vice-captain Brook would appear the most likely candidates to succeed Jos Buttler, who stepped down after England lost every game at the Champions Trophy.\nBillings suggested 26-year-old Yorkshire batter Brook has strong credentials to take on the job.\n\"People get so caught up with recency bias and Harry Brook is still a very young player, and will be a superstar of the game for the next 10 years,\" Billings added.\n\"But I was very impressed with his captaincy last year [against Australia]. He managed the game really well and is tactically quite astute.\n\"From a development point of view I think he will grow into a really good captain. It probably just comes down to workload for England.\"", "url": "https://www.bbc.com/sport/cricket/articles/c5yg8j41r0go"}