{"authors": ["Timothy Abraham", "www.facebook.com"], "date_download": "2025-05-20 12:58:22", "date_modify": "2025-05-20 12:58:22", "date_publish": "2023-08-02 21:04:24", "description": "Sunil Narine whacked 13 off five balls at the death to give Oval Invincibles a three-wicket victory over London Spirit at Lord's.", "filename": "sport_cricket_66388263_1747745902.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/AC50/production/_130621144_gettyimages-1588269809.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66388263_1747745902.html", "title": "The Hundred 2023: Sunil Narine's heroics inspire Oval Invincibles to victory over London Spirit", "title_page": "The Hundred 2023: Sunil Narine's heroics inspire Oval Invincibles to victory over London Spirit - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Published\n2 August 2023\nThe Hundred, men's competition; London Spirit v Oval Invincibles\nLondon Spirit 131 all out (100 balls): Rossington 39; Sowter 3-34\nOval Invincibles 132-7 (99 balls): S Curran (34); Worrall 2-23; Thompson 2-23\nOval Invincibles won by three wickets\nScorecard,Table\nSunil Narine took a miserly 2-14 and then plundered 13 off five balls at the death to give Oval Invincibles a three-wicket victory over London Spirit in their opening match of The Hundred.\nAdam Rossington (39) and Matthew Wade (37) helped Spirit post 131 at Lord's as Nathan Sowter finished with 3-34.\nThe Invincibles slipped to 24-3 in response but Sam Curran (34) and Sam Billings (25) rebuilt the innings.\nNarine hit a six and four off Nathan Ellis to help seal the win.\nWhat else do you need to know?\nWade produced an incredible parry on the boundary to prevent a six from Gus Atkinson with six balls left\nDaryl Mitchell was unable to repeat the trick with four balls remaining as he fumbled Narine's shot over the boundary\nEngland all-rounder Sam Curran took 1-31 while Atkinson collected 1-22 on his debut in The Hundred as he regularly bowled at 90mph\nWill Jacks was dismissed for the third time in the space of 11 balls by Jordan Thompson in The Hundred at the cost of just 14 runs\n'I tried to stay calm' - what they said\nMatch Hero Narine talking to BBC Two: \"It is tough coming in at the end. It is cricket and when you come out on the winning side it gives you courage and momentum. I just tried to keep calm and make contact.\n\"If you make contact you never know what is going to happen. If you miss the ball you put yourself under pressure. I've watched Nathan Ellis for so many years. He backs his slower ball. You never know what he is thinking at the top of his mark.\n\"I just keep it simple with the ball. The wickets will come. That's something I've tried to do in my career and it just continues. Once it is on the stumps the batter has to make contact with the ball. I'm just bowling stump to stump and that is the most you can ask.\"\nThe Hundred 2023: London Spirit v Oval Invincibles washed out in women's competition\nThe Hundred 2023: Shaheen Afridi shines as Welsh Fire beat Manchester Originals\nYou can watch Hundred matches on BBC Two and BBC iPlayer every Wednesday and Saturday throughout the competition, alongside both finals on Sunday, 27 August.\nGoodness Gracious Me: A '90s comedy classic that made TV history\nThe face you know, the story you don't: The life and legacy of Marilyn Monroe from a modern perspective\nRelated topics", "url": "https://www.bbc.com/sport/cricket/66388263"}