{"authors": ["Gary Rose", "www.facebook.com"], "date_download": "2025-05-21 06:44:08", "date_modify": "2025-05-21 06:44:08", "date_publish": "2025-03-30 19:08:53", "description": "Harry Kane hit his 22nd league goal on Saturday to reach a new milestone and move a step closer to ending his long wait for a trophy.", "filename": "sport_football_articles_c89gw8738k8o_1747809848.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4bbb/live/57318110-0d8c-11f0-80e2-6f5e46851467.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c89gw8738k8o_1747809848.html", "title": "Harry Kane: Bayern Munich striker reaches new milestone", "title_page": "Harry Kane: Bayern Munich striker reaches new milestone - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "If you've played against Harry Kane in the Bundesliga, then he's scored against you.\nThe England captain's goal against St Pauli on Saturday means he has now scored against all 19 clubs he has faced in the league in Germany.\nOnly Miroslav Klose - Germany's all-time top scorer - has faced more clubs in the Bundesliga and scored against them all (28).\nIt comes after Kane achieved the same feat in England, with the former Tottenham striker scoring against all 32 clubs he faced in the Premier League.\nHis latest Bundesliga strike ended his mini-drought of five games and means he remains the league's top scorer, increasing his tally to 22 goals.\nIt helped Bayern to a 3-2 victory and moved Kane a step closer to winning his first major trophy, with Bayern six points clear at the top of the Bundesliga.\nKane moved to Bayern from Tottenham in August 2023 and has now scored 58 goals in 57 Bundesliga games.\nThat is more than any other player in that time, with the nearest challenger being Real Madrid's Kylian Mbappe, who has scored 49 goals in 56 league appearances since the start of the 2023-24 season.\nManchester City's Erling Haaland, meanwhile, has 48 league goals in 59 appearances.\nExpanding it to all competitions, no player has scored more goals than Kane in Europe's top five leagues, with his 77 level with Mbappe.\nKane's scoring prowess means he also has the best minutes-per-goal ratio of any player in Europe's top five leagues to have hit 20 or more goals since the start of last season.\nKane is 31 years old, so time is against him in his pursuit of ending his long wait for a trophy.\nThirteen years at Tottenham did not yield silverware, and even his first full season at Bayern ended with them uncharacteristically failing to win anything.\nBut finally, he is on course to lift at least one trophy this term, with Bayern closing in on the Bundesliga title.\nBayern are six points clear of Bayer Leverkusen at the top of the table with seven games remaining.\nIf Vincent Kompany's side win while their rivals lose then the earliest point they would have an unassailable advantage would be 19 April, if they beat Heidenheim on that date.\nThat scenario is, however, unlikely meaning in its simplest terms Bayern will win the title if they collect five wins from their remaining seven games, regardless of what anyone else does.\nKane could in fact end the season with two trophies, because Bayern are in the quarter-finals of the Champions League, where they will face Inter Milan.\nShould Bayern win a trophy this season it will mean Kane happily departs a club no-one wants to be in - a trophyless career.\nThere are many famous players with that unfortunate record.\nDuring the 1990s, Matt le Tissier was widely regarded as one of the most gifted attackers of his generation but never won a trophy.\nHe spent his entire career at Southampton and was capped eight times by England.\nAntonio di Natale was capped 42 times for Italy and played in the final of Euro 2012.\nAt club level he mainly played for Udinese and was twice top scorer in Serie A but finished his career without a major trophy.\nMeanwhile, Yildiray Basturk won 49 caps for Turkey and played the majority of his career in the Bundesliga but never won significant silverware, coming closest when Bayer Leverkusen finished runners-up in 2001-02.", "url": "https://www.bbc.com/sport/football/articles/c89gw8738k8o"}