{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:08:51", "date_modify": "2025-05-21 06:08:51", "date_publish": "2025-01-04 22:09:06", "description": "Ballymena United assistant manager Stefan Seaton says individual errors led to the shock 2-1 defeat by Ards in the Irish Cup.", "filename": "sport_articles_cx2vd5yzp2go_1747807731.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7719/live/8357b6e0-cae5-11ef-a732-2563c0a5ce3d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cx2vd5yzp2go_1747807731.html", "title": "Irish Cup: Ballymena undone by 'individual errors' in Ards defeat", "title_page": "Irish Cup: Ballymena undone by 'individual errors' in Ards defeat - Seaton  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ballymena United assistant manager Stefan Seaton says individual errors led to the shock 2-1 defeat by Ards in the Irish Cup.\nThe Championship visitors led 2-0 at the break thanks to goals from Lee Newell and Aidan Steele.\nEthan Devine pulled one back for the Premiership side at the Showgrounds but Ards held on to make the sixth round.\n\"Full credit to Ards, they've taken their chances, they were much better in the moments that mattered in the game, especially in the first half,\" said Seaton.\n\"We started the game like we wanted to, took the game to them but it's individual errors that cost you - you don't take chances in your own half on that type of pitch.\n\"You've got to cut down on individual errors and then when the ball's at the other end you need to show that calmness, coolness - show that bit of quality when you can aim, get it where it needs to be and get back in the game. We didn't do that enough.\"\nSeaton added that it will be a time for reflection after going out of the Irish Cup at the first hurdle.\n\"Today was not about decisions or the pitch - it was about something different and we need to look at ourselves because again it's individual errors.\n\"Football games are by and large won in both boxes. We didn't defend our box well enough and we didn't attack their box in quality moments when we should have done.\"", "url": "https://www.bbc.com/sport/articles/cx2vd5yzp2go"}