{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:54:03", "date_modify": "2025-05-20 11:54:03", "date_publish": "2023-08-06 00:00:00", "description": "Watch coverage from the fourth day of the 2023 Cycling World Championships in Glasgow.", "filename": "sport_live_cycling_65738762_1747742043.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9DF5/production/_130673404_sophieunwinandjennyholl.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_cycling_65738762_1747742043.html", "title": "2023 Cycling World Championships: Great Britain's Kadeena Cox, Katie Toft and Jaco van Gass feature", "title_page": "2023 Cycling World Championships: Great Britain's Kadeena Cox, Katie Toft and Jaco van Gass feature - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Goodnight\nAnd that's all from me at the end of another golden night for Great Britain inside the Sir Chris Hoy Velodrome.\nYou can read reports on all of today's action and watch the highlights on our dedicated cycling page.\nWe'll be back again tomorrow to bring you more action from the Cycling World Championships.\nCatch you then!\nRoad race drama\nElsewhere, there was drama out on the roads in Glasgow.\nMathieu van der Poel recovered from a nasty crash to claim victory in a thrilling men's road race, which was earlier halted by a protest.\nThe Dutchman held on despite breaking a shoe as he fell on rain-soaked roads.\nHere's how he did it.\nRead the report over here.\nLeitao wins men's omnium gold\nBenjamin Thomas denies Shunsuke Imamura silver in the final sprint, but there's no doubt about who is the new world champion!\nPortugal's Luri Leitao led from the first event right until the very end and takes a deserved victory.\nPost\nThe way the points are being added to each rider's score before they are highlighted accordingly and lifted up the rankings is giving me Eurovision vibes, but that may just be me.\nLuri Leitao has led throughout this men's omnium and still leads overall with 20 laps of the points race to go.\nHe has a 16-point advantage over Benjamin Thomas.\nThe final sprint is worth 10 points, so he won't want to let that gap come down any further...\nPost\nFrenchman Benjamin Thomas takes a lap to move in to second spot, but Luri Leitao takes maximum points in the sprint to open up a 20-point advantage.\nOliver Wood is in seventh, with work to do if he's going to clinch a medal.\nLess than 30 laps remaining.\nPost\nElia Viviani has torn this race to pieces and the Italian takes another lap on the field to leap into second, three points behind Luri Leitao.\nOliver Wood has been pushed down to eighth but it's so tight in the fight for medals.\nPost\nWith 60 laps remaining, Portugal's Luri Leitao remains on course for gold but his lead has been cut to just 10 points.\nJapan's Shunsuke Imamura is in second, ahead of Britain's Oliver Wood.\nThere are riders all over the place and continuing to take laps on the peloton.\n'I did not expect to win three jerseys this weekend'\nMinutes ago, Sophie Unwin and Jenny Holl came from behind to claim gold in the women's B sprint.\nHere's what they had to say:\n\"Going into the decider it was a quick turn around. As endurance athletes we recover quicker and we wanted to make it hard from the get go. I cannot believe we did it,\" Unwin told BBC Sport.\nHoll added: \"I really wanted this and it means so much to win here in Scotland.\n\"I did not expect to win three jerseys this weekend!\"\nPost\nIt's been a lively start to the points race, with a group breaking away in pursuit of the 20 points they can gain if they can take a lap on the field.\nThe bell rings and that lap is confirmed, with Oliver Wood among those to benefit.\nThe British rider moves into third place overall.\nPost\nThe final race of the night brings up the conclusion of the men's omnium.\nAnd it's a big one. The 100-lap points race will determine the medals at the end of an exhausting day for these riders.\nPortugal's Luri Leitao begins with a 24-point lead over Dylan Bibic of Canada.\nGB's Oliver Woods, in fifth, is eight points behind third-placed Dutchman Vincent Hoppezak.\nUnwin & Holl race for gold\nUSA pair Hannah Chadwick and Skyler Espinoza celebrate winning the bronze medal in the women's B sprint, having lost the first race.\nThe Glasgow crowd will hope Sophie Unwin and Jenny Holl can match that now.\nThe British pair forced a decider against Australians Jessica Gallagher and Caitlin Ward and will now race for gold.", "url": "https://www.bbc.com/sport/live/cycling/65738762"}