{"authors": ["Nick Mashiter", "www.facebook.com"], "date_download": "2025-05-21 08:01:00", "date_modify": "2025-05-21 08:01:00", "date_publish": "2025-01-30 16:15:50", "description": "Leicester news: Ruud van Nistelrooy will work \"till the last second\" for transfer deals", "filename": "sport_football_articles_c4gxe57jrjxo_1747814460.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d526/live/aede37b0-df19-11ef-ab2e-d5bb9715ff2c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c4gxe57jrjxo_1747814460.html", "title": "Leicester news: Ruud van Nistelrooy will work \"till the last second\" for transfer deals", "title_page": "Leicester news: Ruud van Nistelrooy will work \"till the last second\" for transfer deals - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Leicester will work \"until the last second\" of the transfer window to find reinforcements, boss Ruud Van Nistelrooy has vowed.\nThe Foxes are looking for new recruits to help them in their fight for Premier League survival.\nDefender Woyo Coulibaly is Van Nistelrooy's only signing of the January window, having joined from Parma for about 3m euros.\nThe transfer deadline is at 23:00 GMT on Monday and the manager insists Leicester, 17th in the Premier League after beating Tottenham on Sunday, will push hard for new signings.\n\"We are still working on a couple of things - we know it's the deadline and what ywe're working towards,\" he said. \"It's something we're going to address until the last second of the window.\n\"In the conversations we had before I signed, we were very clear on what possibilities would be handled this window.\n\"It's about knowing what you're doing with the club and trying to do the maximum possible to get people in who can strengthen the team. It's what we're trying to do and if we can get something, great. If not, we will carry on with this group.\"", "url": "https://www.bbc.com/sport/football/articles/c4gxe57jrjxo"}