{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:38:47", "date_modify": "2025-05-21 07:38:47", "date_publish": "2025-02-11 00:00:00", "description": "Follow live text commentary, score updates and match stats from Walsall v Gillingham in League Two.", "filename": "sport_football_live_c4g37zzrp3et_1747813127.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c4g37zzrp3et_1747813127.html", "title": "Walsall 1-1 Gillingham", "title_page": "Walsall 1-1 Gillingham: League Two stats & head-to-head - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Robbie McKenzie's thunderbolt grabbed Gillingham a 1-1 draw at League Two leaders Walsall as both teams' winless runs continued.\nIt was intense throughout but with few moments of quality, as Jamille Matt's close-range finish four minutes into the second half was wiped out by McKenzie's 20-yard lash in off the underside of the bar in the 68th minute.\nGillingham had the better chances from then on but there was almost a sting in the tail as Saddlers substitute Danny Johnson lobbed over the bar a minute from time.\nThe Saddlers got limited to wild shots and pressure from set-pieces in the first half, with the best opening going the way of the Gills, although Joseph Gbode tamely headed straight at Tommy Simkin.\nA raking ball from deep unpicked the lock for Walsall, Evan Weir driving high into the right channel for Connor Barrett to take down, bustle inside his man and defy being pulled back to get off a cross-shot that was helped in by Matt.\nWalsall kept forcing the issue but McKenzie's bolt from the blue stunned the home fans, with Remeao Hutton curling a fraction high and wide and Armani Little seeing a shot cleared off the line by David Okagbue as Gillingham had the better of the late chances.\nGillingham have now gone 10 games without a win, while Walsall are without a victory in five.", "url": "https://www.bbc.com/sport/football/live/c4g37zzrp3et"}