{"authors": ["Millie Sian", "www.facebook.com"], "date_download": "2025-05-21 05:55:57", "date_modify": "2025-05-21 05:55:57", "date_publish": "2025-01-31 15:13:23", "description": "Andoni Iraola press conference: Bournemouth vs Liverpool preview", "filename": "sport_football_articles_c20kgl465pro_1747806957.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5908/live/85292f40-6de2-11ef-b970-9f202720b57a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c20kgl465pro_1747806957.html", "title": "Andoni Iraola press conference: Bournemouth vs Liverpool preview", "title_page": "Andoni Iraola press conference: Bournemouth vs Liverpool preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "There are no new injury concerns in the squad. Luis Sinisterra could be back in contention, after recovering from a hamstring injury, but he needs to be \"assessed again\" and therefore it isn't certain he will be involved this weekend.\nThe Cherries are looking to extend their 11-game unbeaten run in the Premier League but he anticipates the fixture will be \"the biggest challenge of the season\" as Liverpool are also looking to continue their 18-game unbeaten run in the Premier League.\nHe added: \"I think they have been the best team, not only in England but also in Europe this season. It is going to be very difficult for us, but it is a good challenge. I think we are in a good moment as we are also playing well. I don't know if we will have enough, but we will try.\"\nThere were some learnings to take from the 3-0 loss at Anfield earlier this season, with Iraola reflecting: \"Their offensive power is very big. We lost our heads for a few minutes and conceded three goals. It shows that you cannot lose any concentration or focus against Liverpool. They are scoring and creating so many chances, so at the other end of the pitch we have to be very good.\"\nEven though Bournemouth have only conceded seven goals at home this season, Iraola \"really doesn't expect\" to keep a clean sheet against Arne Slot's side. He added: \"If we want to take a point, we will need goals and we will need to be clinical.\"\nThe Cherries are still on the hunt for another striker, with Iraola stating: \"We are trying, but we continue in the same place. We are really thin. We want to sign a player that will improve and help us. We trust the players we already have long-term, but it's true that we need help in the meantime.\"\nThe club are happy with current strikers Evanilson and Enes Unal, so they are looking to bring in a striker on loan.\nHe replied \"I don't know\" when asked if supporters can expect to see a new face coming in before the transfer deadline but added: \"If the situation appears, we are all for it. If it doesn't appear, we will continue fighting and being competitive.\"\nAfter the loan departures of Philip Billing, Max Aarons and Mark Travers, the club aren't expecting any other players to leave on loan. Iraola joked: \"Who knows, maybe we will have a crazy money offer for someone, like we have seen with other teams!\"", "url": "https://www.bbc.com/sport/football/articles/c20kgl465pro"}