{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:19:19", "date_modify": "2025-05-21 07:19:19", "date_publish": "2025-03-30 00:00:00", "description": "Rangers maintain pressure on Hibs at the top of the table with a 4-0 victory over Hearts at Ibrox.", "filename": "sport_football_live_c4g0172371vt_1747811959.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c4g0172371vt_1747811959.html", "title": "Rangers maintain pressure on Hibs with big win over Hearts", "title_page": "Rangers maintain pressure on Hibs with big win over Hearts - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Post\nI'll leave you to get on with your evening but fear not, all the reaction will be over on our dedicated Scottish women's football page.\nWe'll have coverage of SWNT's double header against Germany before getting back to league action.\nUntil next time!\nFULL-TIME Motherwell 0-3 Hibernian\nHibs head back to the top of the SWPL table with a convincing victory over Motherwell, a nice way to bounce back from that disappointing afternoon last weekend.\nA tough result for Motherwell who looked bright in flashes but just struggle to compete with the full-time teams.\nGOAL Motherwell 0-2 HIBERNIAN\nMichaela McAlonie\nAnd there's the second!\nIt's far too easy for Hibs, they work into the Motherwell box as Abbie Ferguson and Michaela McAlonie are allowed to get a one-two off before McAlonie's shot into the bottom corner.\nOuch!\nMotherwell 0-1 Hibernian\nA break in play for Bailley Collins and Linzi Taylor to get some treatment after a nasty clash of heads.\nThey both look ok but they're going through the usual precautions.\nPost\nMotherwell 0-1 Hibernian\nHibs are almost caught playing out from the back but the backline shows good composure to keep hold of the ball.\nIt eventually goes out for a throw in just inside their own half.\nPost\nMotherwell 0-0 Hibernian\nDespite that hefty defeat to Rangers in the SWPL Cup last weekend, Hibs do not look a side devoid of confidence.\nThey're getting forward, and getting shots away, as Rosie Livingstone sends the latest effort into the arms of Emily Mutch.", "url": "https://www.bbc.com/sport/football/live/c4g0172371vt"}