{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:26:57", "date_modify": "2025-05-21 05:26:57", "date_publish": "2025-04-03 11:28:47", "description": "Former world champion Nina Hughes confirms she wants to carry on fighting despite failing in her bid to regain the WBA bantamweight title.", "filename": "sport_boxing_articles_cn8vlppzwdzo_1747805217.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/afce/live/c6e9fec0-1074-11f0-ab54-518aaf61f940.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_boxing_articles_cn8vlppzwdzo_1747805217.html", "title": "Hughes wants another 'big fight' after world title loss", "title_page": "Nina Hughes wants another 'big fight' after world title loss - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former world champion Nina Hughes has confirmed she wants to carry on fighting despite failing in her bid to regain the WBA bantamweight title.\nThe 42-year-old's corner threw in the towel in the seventh round of her fight against Cherneka Johnson in Sydney last month.\nShe had suffered a broken nose earlier in the fight and promoter Eddie Hearn afterwards said it \"could be the end of the road for her\".\n\"I still believe I've got one or two fights left in me. I'm going to keep training and if the opportunity comes for a big fight this year, I'll take it,\" she told BBC Essex.\n\"The question goes round in your head all the time, should I (retire), shouldn't I, and I'm in that position where if a big fight comes, I'll take it, if it doesn't, that's the end, it obviously wasn't meant to be - but I'm still open this year to a big fight.\"\nHughes, from Billericay in Essex, won the title in 2022 in only her fifth professional bout, having first taken up the sport at the age of 25.\nBut she lost it in controversial fashion in Perth in May last year when she was initially announced as the winner on points, only for the ring announcer to correct himself and name Johnson as champion by a majority points verdict.\nShe again had to travel to Australia for the re-match, having been named as mandatory challenger by the governing body, but her hopes of victory were undermined by the nose injury, suffered in the second round.\n\"I took a big headbutt in the second round and a massive one in the third. It definitely didn't help in the fight because I couldn't breathe properly for a couple of rounds,\" said Hughes.\n\"It's just one of those things. It's a fight - you're not allowed to headbutt but the referee wasn't jumping in and doing anything, he didn't seem to want to intervene, so you just have to get on with it.\"\nIt was the first time Hughes had suffered such a serious injury, which meant surgery was needed.\n\"It's always been my worst fear, breaking my nose, and I've always got away it (before). At the time, I knew I'd taken a big headbutt and it hurt a lot, but you're so focused on someone throwing punches and doing what you've got to do that your mind goes elsewhere.\n\"I had it realigned and re-set on Tuesday - if you get it done in the first two weeks before the bone sets, it's a much more minor operation.\"", "url": "https://www.bbc.com/sport/boxing/articles/cn8vlppzwdzo"}