{"authors": ["Seb Brown", "www.facebook.com"], "date_download": "2025-05-21 06:13:37", "date_modify": "2025-05-21 06:13:37", "date_publish": "2025-04-01 11:48:53", "description": "Ipswich news: Opinion - Nine games to survive or build momentum", "filename": "sport_football_articles_c2kvjl83jjeo_1747808017.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ed4c/live/b5390d40-54ba-11ef-b2d2-cdb23d5d7c5b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c2kvjl83jjeo_1747808017.html", "title": "Nine games to survive or build momentum", "title_page": "Ipswich news: Opinion - Nine games to survive or build momentum - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Nine games for Ipswich Town to try to survive in the Premier League. Nine games to show some character, passion and fight to either achieve the required points to avoid relegation or build some momentum for a Championship promotion campaign.\nEven the most optimistic of Ipswich fans will appreciate that a second season of Premier League football is unlikely. Ipswich play Wolves at Portman Road on Saturday and if the gap between the two stretches to more than the current nine points - effectively 10 accounting for the goal difference - then realistically Ipswich will be preparing for a return to English football's second tier.\nIpswich remain the only side in the 92 clubs without a league win in 2025. There will be opportunities for points in the run-in. April looks difficult with games against Bournemouth, Chelsea, Arsenal and Newcastle. May looks more favourable with Leicester, West Ham and Brentford to come, some of whom may well have nothing left to play for.\nDespite the disappointment of this season, however, the future is still incredibly bright. Ipswich are two to three years ahead of schedule in their \"project\" and the parachute payments will give the club a huge financial advantage over most Championship sides.\nThe transfer planning has been clear in its strategy of developing young British talent and, aside from Liam Delap, it is not out of the question that the majority of the squad will remain next season. This year of Premier League football will have been a valuable learning experience.\nIn Jack Clarke, Sammie Szmodics, Omari Hutchinson and Jaden Philogene, Ipswich have signed the best attacking talent from the 2023-24 Championship campaign. This is before players such as Conor Chaplin and Nathan Broadhead are factored in, the joint-top scorers in Town's 96-point promotion-winning season.\nIpswich may well fall short in their battle to beat the drop but these nine games will be crucial come August, regardless of what league Town are in.", "url": "https://www.bbc.com/sport/football/articles/c2kvjl83jjeo"}