{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:15:26", "date_modify": "2025-05-21 06:15:26", "date_publish": "2024-12-27 23:12:06", "description": "After every round of Premier League matches this season, Troy Deeney gives us his team of the week. Do you agree with his choices?", "filename": "sport_football_articles_c5y890v1d5po_1747808126.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b4a2/live/deb2d530-c4a3-11ef-a0f2-fd81ae5962f4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c5y890v1d5po_1747808126.html", "title": "Troy Deeney's Team of the Week: Isak, Gordon, Gakpo, Cunha, Joelinton", "title_page": "Troy Deeney's Team of the Week: Isak, Gordon, Gakpo, Cunha, Joelinton - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "After every round of Premier League matches this season, BBC football pundit Troy Deeney will give you his team and manager of the Week.\nHere are this week's choices. Do you agree? Give us your thoughts using the comments form at the bottom of this page.\nAaron Wan-Bissaka (West Ham) and Pervis Estupinan (Brighton): Both full-backs were solid and kept clean sheets. The pair were also probably one of the best attacking threats for their team.\nMurillo (Nottingham Forest) and Calvin Bassey (Fulham): Solid again. Murillo kept a clean sheet and Bassey would have had one if not for a wonderful goal from Cole Palmer. Both were wonderful and instrumental to their teams getting victories.\nCurtis Jones (Liverpool): One hundred league appearances is excellent for such a young man. I was at this game and he was brilliant in terms of running the games, tackles and getting his goal.\nJoelinton (Newcastle): He is a beast of a man. If you remember he was actually bought as a number nine. How silly were they? He is a centre-midfielder and has been excellent in Newcastle's rise for the past four weeks. He's in the team for the first time this season.\nMatheus Cunha (Wolves): Back-to-back weeks he's my number 10. Wolves' best player by a country mile, he scored past a very poor Manchester United team - but we all know that anyway. If you score from a corner you're getting in the team of the week.\nCody Gakpo (Liverpool) and Anthony Gordon (Newcastle): Both these players were excellent and dynamic. They drove their teams forward and both scored. They were both thorns in the opposition's side and looking like the players we know they can be.\nAlexander Isak (Newcastle): Back again, the man, the myth, Mr Isak. He's the best striker in the Premier League currently. Arsenal, just sign him and you'll win the league, it's really not that difficult.", "url": "https://www.bbc.com/sport/football/articles/c5y890v1d5po"}