{"authors": ["Brian McLauchlin", "www.facebook.com"], "date_download": "2025-05-21 04:04:08", "date_modify": "2025-05-21 04:04:08", "date_publish": "2025-04-04 06:05:14", "description": "Doubt has been cast over where Hamilton Academical and Clyde will play their home games next season amid a wrangle over their tenancies at New Douglas Park.", "filename": "sport_football_articles_c4g723qve18o_1747800248.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a008/live/a9bec2c0-115c-11f0-9318-23e3170630e8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c4g723qve18o_1747800248.html", "title": "Hamilton & Clyde face doubt over home ground next term", "title_page": "Hamilton & Clyde face doubt over home ground next term - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Doubt has been cast over where both Hamilton Academical and Clyde will play their home games next season amid a wrangle over their tenancies at New Douglas Park.\nThe stadium is still owned by Championship side Hamilton's former owners, with the club currently paying rent to use it.\nLeague 2 outfit Clyde are in a similar position but have admitted they may be forced to find another temporary home stadium.\nThey moved to Hamilton in 2022 after North Lanarkshire Council refused to extend their lease at Broadwood Stadium in Cumbernauld.\nClyde say they signed \"a legally-binding agreement\" in 2022 for a five-year stay but that only they had the right to terminate the deal early this summer.\nThey added that they submitted \"written confirmation\" to Hamilton of their plans to stay in February but have \"been unable to get clarity that the agreement will prevail beyond the current season.\"\nThey added: \"In fact, we have an informal indication of the contrary.\"\nThe SPFL have confirmed to BBC Scotland that under league rules \"all clubs have to confirm by 31 March what their registered ground will be for the following season\".\nClyde have met that deadline - despite the doubt over their home for next term - but it remains unclear whether Hamilton have.\nHamilton director Gerry Strain told BBC Scotland they have been in talks with the SPFL over the issue and are taking legal advice over Clyde's position.\nHe says Clyde met current owner Serif Zengin, who \"was of the view the rent they were paying wasn't efficient\" and asked \"if they were prepared to pay an adequate rent\".\nStrain added: \"This would only be on the basis Serif would acquire the stadium. Clyde subsequently walked out the meeting and then presented us with this letter.\"\nIn March, Hamilton had their club licence reduced from bronze to entry level by the Scottish FA for a variety of failings, which could lead to the possibility of a points deduction this season.\nThe club - who are ninth in the second tier, five points off the automatic relegation spot - have appealed against that ruling.\nThe SPFL have confirmed that \"it remains a fundamental aspect of the SPFL rules that our members clubs have a Scottish FA bronze level licence\".\nEarlier this season, League 2 Bonnyrigg Rose were deducted six points after they also had their licence reduced to entry level amid issues with their pitch.", "url": "https://www.bbc.com/sport/football/articles/c4g723qve18o"}