{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:07:18", "date_modify": "2025-05-21 06:07:18", "date_publish": "2025-04-01 20:49:24", "description": "Liverpool's Mohamed Salah is open to joining the Saudi Pro League this summer, Manchester United step up their pursuit of Ipswich forward Liam Delap, plus more.", "filename": "sport_football_articles_c62zgddpg4qo_1747807638.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9f69/live/33c7cdd0-0f2e-11f0-ac9f-c37d6fd89579.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c62zgddpg4qo_1747807638.html", "title": "Football gossip: Salah, Delap, Trafford, Pedro, Baleba, Silva", "title_page": "Football gossip: Salah, Delap, Trafford, Pedro, Baleba, Silva - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Mohamed Salah is open to joining the Saudi Pro League this summer, Manchester United step up their pursuit of Liam Delap, Newcastle remain interested in signing James Trafford.\nThere is confidence in Saudi Arabia that Liverpool and Egypt forward Mohamed Salah, 32, is open to joining the Saudi Pro League once his deal expires with the Reds this summer. (Telegraph - subscription required), external\nManchester United have stepped up their interest in Ipswich's 22-year-old English striker Liam Delap, who is rated at £40m. (Mail - subscription required), external\nNewcastle remain interested in a summer deal for Burnley's 22-year-old English goalkeeper James Trafford. (Sky Sports), external\nBrighton have put £100m price tags on 23-year-old Brazil forward Joao Pedro and 21-year-old Cameroon midfielder Carlos Baleba to fend off interest from Liverpool, Newcastle and Chelsea. (Talksport), external\nPortugal midfielder Bernardo Silva, 30, wants to leave Manchester City this summer in search of a challenge away from the Premier League. (Football Insider), external\nArsenal, Newcastle, Chelsea and Manchester United are keen on Serbia striker Dusan Vlahovic, with the 25-year-old set to leave Juventus this summer. (Gazzetta dello Sport- in Italian), external\nNewcastle are plotting a surprise move for Liverpool's 21-year-old English midfielder Harvey Elliott. (Teamtalk), external\nChelsea are considering a move worth 40m euros (£33.4m) for Villarreal's 22-year-old French striker Thierno Barry. (Fichajes - in Spanish), external\nArsenal, Newcastle and Nottingham Forest are among the clubs interested in Roma's 25-year-old Ivory Coast defender Evan Ndicka, who is rated at 40m euros (£33.4m). (Caught Offside), external\nCrystal Palace boss Oliver Glasner remains a candidate to take charge of RB Leipzig next season after the German side held talks with the 50-year-old Austrian's representatives. (Sky Germany), external", "url": "https://www.bbc.com/sport/football/articles/c62zgddpg4qo"}