{"authors": ["Tom English", "www.facebook.com"], "date_download": "2025-05-20 12:34:34", "date_modify": "2025-05-20 12:34:34", "date_publish": "2023-08-04 09:01:22", "description": "Scottish football's ability to evoke embarrassment and rage, pride and joy endures - and we're glad it's back, writes Tom English.", "filename": "sport_football_66401264_1747744474.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/16887/production/_130659229_20750027.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66401264_1747744474.html", "title": "Scottish Premiership preview: New season brings dreams and dread", "title_page": "Scottish Premiership preview: New season brings dreams and dread - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "With all due respect to the monied clubs of world football, a manager in the Premier League in England helping to fix the height of a crossbar an hour before kick-off, as Livingston's David Martindale did last season, is not something you are ever likely to see.\nYou're also unlikely to witness Bundesliga players doing rock, paper, scissors to determine who takes a free-kick, as St Johnstone's men did against Celtic.\nAnd it's improbable that the hospitality division of a La Liga 2 outfit would get the Spanish equivalent of Arbroath's Bobby Linn to sign a Fray Bentos steak and kidney pie and hand it over as a raffle prize, as the winger did last season.\nScottish football's ability to evoke embarrassment and rage, pride and joy endures. It gets under the skin.\nAnd the wit? In November, Brora tweeted a picture of their severely flooded pitch and said an inspection was about to take place. \"Who's inspecting it?\" came the reply from social media. \"Aquaman?\"\nThere appears to be a protective force field around the game in this country. For all the challenges, the attendances are rising.\nIn late June, the SPFL got the trumpet out to blast the news of record crowds in its competitions in the season just gone.\nThe top line was that for the first time since these statistics began, five million people attended SPFL games in Scotland in 2022-23 - or 5,087,400 to be exact. Eleven of the 12 Premiership clubs saw increased crowds, St Mirren's numbers rising by 29.7%, Kilmarnock's by 30.1%.\nThe overall stats are heavily influenced by the biggest clubs, but in straitened times any increase is an achievement.\nMost clubs in Scotland live on the breadline, most supporters travel to watch their team more in hope than expectation of goals and victories.\nThere is constant disquiet about the governance at the top level, the quality of the product, the state of the refereeing and the fan experience. And yet.\nIn the big picture, according to the league's research, Scottish club football was, per capita, the most watched in Europe last season by a margin of 65%, with the Netherlands a distant second.\nThe glamour and money and hype lie elsewhere across the continent, but in times of economic hardship for some and fiscal challenges for many, there are an awful lot of people in this country who still see going to football as the most important of the least important things in life.\nAnd now it's back. The league season is upon us again. The chameleon has returned. By our estimation, players from 28 different countries, and all continents, have already been recruited in the Premiership alone.\nAmid all the incomings, monitoring the opportunities - or lack of - given to homegrown players will be an interesting and, perhaps, maddening pursuit.\nMaking bold predictions about winners and losers - beyond the hardly daredevil forecast of Celtic winning the lot again - is normally unwise. Things can change rapidly around here.\nDundee United looked strong at the start of last season and we know how that turned out. Hearts looked certainties for third and we know what happened there, too.\nDave Cormack, the Aberdeen chairman, broke down on television at the desperate plight of his beloved Dons and then, lo, they rose from the ashes and shocked everybody - including themselves, you could argue.\nPartick Thistle were going up and then they weren't. Ross County were going down and then they weren't.\nDundee tweeted that their manager, Gary Bowyer, had been named Championship boss of the season and five minutes later, give or take, they announced he was leaving the club. The glorious uncertainty, the unending chaos is terrific.\nIf you'd bet on Celtic to win the league in the last 11 seasons, you'd have been in profit in 10 of them. Had you plunged on trebles, you'd have been a winner in five of the last seven campaigns. Nothing has happened in the summer to shift the favourites tag away from Celtic Park.\nAnge Postecoglou has left but Brendan Rodgers has returned with energy and ambition. Celtic have lost Jota, a stellar performer, but their financials are excellent, they're adding to their arsenal and, you sense, will continue to add. They're a settled winning machine and it'll take something special to stop them.\nIn their pursuit, Rangers are going all-in. They're recruiting forward players like there's no tomorrow but, at this remove, there's no telling how effective they will be. Will they adapt and thrive or struggle and fade away? Nobody knows.\nMichael Beale had to rebuild his team and give it more teeth but, until we see how these new players cope with the demanding reality of life in Glasgow and the relentless nature of the team they're trying to catch, then we're all guessing.\nThe first derby of the season is at Ibrox on the first weekend of September. That promises to be a howitzer.\nThree points separated Aberdeen and Hearts last season, two points separated Hearts and Hibernian, and two points separated Hibs and Motherwell. It's tight among the best of the rest. They've all recruited but they've all seen the departure of big performers.\nAberdeen have lost three players - Matty Pollock, Liam Scales and Ross McCrorie - who helped massively in making them hard to score against in their dramatic revival, but a cavalry of sorts has arrived.\nHearts have lost Josh Ginnelly, who scored 12 goals in 30 league games, but they have big players returning from injury. Hibs have lost Kevin Nisbet - who scored 12 in 19 - but Martin Boyle is back with a bang after missing much of last season.\nSt Mirren performed strongly last season with a top-six finish but they've lost Trevor Carson at one end and Curtis Main, scorer of nine league goals, at the other. Finding effective replacements is the perennial battle for clubs with big hopes but tiny budgets.\nPound-for-pound, the biggest loss of all is Kevin van Veen at Motherwell. The striker contributed an astonishing 25 goals in 39 league games. How on earth do they replace him? That's the job of two men, if not three.\nFans of every club will be examining their squad with a microscopic intensity, some dreaming, some dreading, all of them different but the same. Conversations are being had. Plans are being made. Football is in their blood. Always.", "url": "https://www.bbc.com/sport/football/66401264"}