{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:47:56", "date_modify": "2025-05-21 06:47:56", "date_publish": "2025-03-28 21:57:02", "description": "Manchester Thunder beat Nottingham Forest to go second in the Netball Super League table, while London Pulse remain unbeaten at the top.", "filename": "sport_netball_articles_c234375dp5go_1747810076.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a8df/live/588e9e30-0c1a-11f0-a835-230e14196e59.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_netball_articles_c234375dp5go_1747810076.html", "title": "Netball Super League: Manchester Thunder beat Nottingham Forest as London Pulse remain unbeaten", "title_page": "Netball Super League: Manchester Thunder beat Nottingham Forest as London Pulse remain unbeaten - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester Thunder beat Nottingham Forest 81-65 in the Netball Super League for their second successive victory.\nThunder dominated the opening quarter and led 39-29 at half-time despite a Forest fightback.\nThe hosts eased to their win, with goal attack Elmere van der Berg scoring 52 goals and captain Amy Carter named player of the match.\nEight-time Olympic champion Usain Bolt was in attendance at Manchester's Belle Vue Arena.\nElsewhere, London Pulse sealed a comfortable 78-42 win against London Mavericks to remain unbeaten at the top of the table.\nBoth sides had two wins from two going into the match, but Pulse raced to a 40-19 lead at half-time and the Mavericks were unable to fight back.\nPulse wing-defence Zara Everitt was named player of the match.\nThe match between Cardiff Dragons and Birmingham Panthers, who were both searching for their first win, had to be abandoned because of an injury to Cardiff's Leah Middleton.\nCardiff confirmed on social media the fixture would be rearranged, and later added Middleton will have surgery on the unspecified injury.\nOn Sunday, defending Super League champions Loughborough Lightning got back to winning ways following their defeat by London Pulse last time out.\nThe Lightning led Leeds Rhinos 38-30 at half-time and extended that advantage to secure a 72-58 victory.\nPlayer of the match, Manchester Thunder captain Amy Carter: \"We met them [Forest] pre-season and they blew us out of the water so it was really nice to put the work in and grind it out.\n\"Our strength is bringing through our younger players, it's really exciting that we can blend that in with our squad.\"\nManchester Thunder head coach Karen Greig: \"I don't think it was a very pretty game! We were quite stagnant at times and played too wide so I'd like to see us taking the attack a little more.\n\"But we're still building, we're learning a lot from each game. We let them back in towards the end of the second quarter so we'll be honest about that and go back to the drawing board.\n\"But a 16-goal win at this point of the season, we'll definitely take it.\"\nNottingham Forest head coach Chelsea Pitman: \"We can't rely on chasing down a lead, we need to start better.\n\"Thunder played really well and they were quite comfortable. But I am really proud of the team, we will go back and review it and go again in round four.\"", "url": "https://www.bbc.com/sport/netball/articles/c234375dp5go"}