{"authors": ["Ged Scott", "www.facebook.com"], "date_download": "2025-05-21 07:30:11", "date_modify": "2025-05-21 07:30:11", "date_publish": "2025-03-28 17:54:48", "description": "New Shrewsbury Town boss Michael Appleton starts his new job with the same task as his predecessor - a meeting with Birmingham City.", "filename": "sport_football_articles_c9wpwg2rqg9o_1747812611.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2758/live/6dd38ae0-0be2-11f0-8ae9-2975efdc7f47.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c9wpwg2rqg9o_1747812611.html", "title": "Birmingham City v Shrewsbury Town: Can Michael Appleton find same new manager bounce?", "title_page": "Birmingham City v Shrewsbury Town: Can Michael Appleton find same new manager bounce? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It was League One's shock result of the season... 23 November... Bottom club Shrewsbury Town 3 Top of the table Birmingham City 2.\n'The new manager bounce' of Gareth Ainsworth right royally did the trick as the Shrews stunned the Blues.\nChris Davies's expensively assembled side have only lost three times in 36 league games this season - and that one, that bad day at Oteley Road, stands out by far of the three.\nBut, four months on, in the very week when the ambitious Ainsworth abuptly exited Shropshire for Kent as colourfully as he had arrived, comes the chance of the only possible result this season that would be an even bigger shock. Another Shrewsbury victory. Top against bottom again.\nAnd this time the double-seeking leaders and EFL Trophy finalists have the home advantage of a 29,000 packed house.\nEven a man as experienced as new Shrewsbury boss Michael Appleton knows that his team will be travelling to St Andrew's on Saturday with little more than hope that the same 'new manager bounce' can somehow conjure up even more magic.\n\"They're 19 games unbeaten at home in the league,\" he told BBC Radio Shropshire. \"They've won all their last eight there.\n\"The players know it's going to be difficult but, at the same time, they're quite excited about it.\"\n\"Everyone feels a bit sore and let down and I get that,\" Appleton added. \"But the past is the past and I've always been very much one who likes to look forward.\n\"We've had a good couple of days. And one of the things I have said to the players is that I want them to feel comfortable with being uncomfortable.\"\nShrewsbury are 14 points adrift of safety, with only 27 more points to play for. In the worst-case scenario, they could be relegated as soon as 5 April - eight days before Blues go to Wembley.\n\"There are moments over the coming weeks that are going to be difficult,\" said Appleton at Friday's first public press conference since taking on the job for the last nine games of this season.\n\"But I want them to embrace it and almost enjoy it. That's going to be the case over the next nine games.\"\nHe added: \"It's ridiculous of me to expect the players to immediately perform at once the way my three or four previous clubs have performed.\n\"Without boring everyone and coming out with cliches, it has to be taken game by game, just try to pick up as many points as we can and perform better with every game.\n\"Birmingham are going to have a lot of the ball. And we're going to have be strong and resolute. But we will have our moments. And we just have to go there and try to put a smile on one or two faces.\"", "url": "https://www.bbc.com/sport/football/articles/c9wpwg2rqg9o"}