{"authors": ["Tyrone Smith", "www.facebook.com"], "date_download": "2025-04-26 06:47:12", "date_modify": "2025-04-26 06:47:12", "date_publish": "2025-03-01 12:36:42", "description": "Dundee United defender Emmanuel Adegboyega says he \"couldn't sleep properly\" after their VAR controversy in Wednesday's 3-1 defeat by Hibernian at Tannadice.", "filename": "sport_articles_c93ng5d3gngo_1745650032.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/93bf/live/3696b3d0-f699-11ef-a895-fbbe0f4341f5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_c93ng5d3gngo_1745650032.html", "title": "Adegboyega 'couldn't sleep' after Hibs VAR controversy", "title_page": "Adegboyega 'couldn't sleep' after Hibs VAR controversy  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Dundee United defender Emmanuel Adegboyega says he \"couldn't sleep properly\" after their VAR controversy in Wednesday's 3-1 defeat by Hibernian at Tannadice.\nUnited thought Sam Dalby had put them 2-1 up in the second half, but following a lengthy VAR intervention, the goal was chalked off as the striker was judged to have headed the ball onto his own arm before it flew in to the net.\n\"I still am (seething) because I don't think I could sleep properly after a decision like that,\" said the Irishman.\n\"I felt it was honestly a robbery in my opinion so there is a bit of frustration through the camp.\n\"I just don't agree with it (VAR) at all. What happened on Wednesday was the nail in the coffin for myself.\n\"As of right now, it might not be fit for purpose, I think it demonstrated on Wednesday that aspect of VAR in my opinion.\n\"I don't know if it needs to get changed or if it needs to get binned, I am kind of in the middle of both, but I think a change will have to come in first before a decision to bin it.\"\nThe result meant United – who are now fifth – missed the chance to go above Sunday's opponents Aberdeen into third.\nAdegboyega was asked if they can channel their frustration from midweek for this weekend's visit to Pittodrie.\n\"I think we have to let it go because Sunday is a whole different game, whole different opposition,\" he answered.\n\"The frustration we felt on the Wednesday, we felt on the Thursday, and currently some of us are still feeling it today, but once Sunday hits it's a new ball game, new team, so we have to change focus and focus on Aberdeen.'\n\"We have obviously been playing quite well so I think it's just to improve on some aspects in terms of our mistakes and also just to hopefully get the result in the end.\"", "url": "https://www.bbc.co.uk/sport/articles/c93ng5d3gngo"}