{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:43:02", "date_modify": "2025-04-26 07:43:02", "date_publish": "2025-02-26 18:39:33", "description": "Jos Buttler says \"all possibilities should be considered\" when asked about his future as England white-ball captain following Champions Trophy exit.", "filename": "sport_cricket_articles_clyde7g7wqzo_1745653382.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f996/live/bdd70520-f46e-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_cricket_articles_clyde7g7wqzo_1745653382.html", "title": "Champions Trophy 2025: Jos Buttler says he will 'take some time' to consider future as England white-ball captain", "title_page": "Champions Trophy 2025: Jos Buttler says he will 'take some time' to consider future as England white-ball captain - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Jos Buttler says he will consider his future as England white-ball captain in the next few weeks as he attempts to work out if he is \"part of the problem or the solution\" following his side's group-stage exit from the Champions Trophy.\nEngland suffered an eight-run defeat by Afghanistan in Lahore to be eliminated from the tournament at the earliest opportunity.\nIt was England's third successive disappointment in white-ball tournaments under Buttler's captaincy, after the 50-over World Cup in 2023 and the T20 version last year.\n\"We need to consider all possibilities and get English cricket back to where we should be in white-ball cricket,\" said Buttler, 34.\n\"Personally I need to work out, am I part of the problem or the solution?\n\"I'm not going to make any emotional decisions right here, right now. I'll take some time to work that out personally and the guys in charge will have their own views, too.\"\nEngland came into the Champions Trophy off the back of a one-sided series defeat by India, and have now lost 12 of their last 16 one-day internationals.\nButtler said before the match against Afghanistan he was aware his future might be on the line but despite the result, insisted he still enjoyed the role.\n\"It's had its moments,\" he said.\n\"I know lots of people think it doesn't sit well with me being captain but I enjoy leading. It weighs heavy at times and we want to be a winning team.\"\nEngland's final group game of the Champions Trophy is against South Africa on Saturday. After that, their next white-ball assignment is a three-match home series against West Indies which begins on 29 May.\nSince winning the World Cup in 2019, they have lost more ODIs (34) than they have won (29). Under Buttler, who replaced World Cup-winning skipper Eoin Morgan in 2021 and won the T20 World Cup in 2022, they have won 14 of 38 ODIs.\nBrendon McCullum replaced Matthew Mott as head coach at the turn of the year and backed Buttler as captain, suggesting the skipper could have his \"best years ahead of him\" for England.\nBut, after losing to Australia in their opening game, England allowed Afghanistan to score 325-7 and then failed to chase the target despite Joe Root's 120.\nAfter Root, the next highest score was 38, made by both Buttler and Ben Duckett, yet England still needed only 17 from 14 balls with three wickets left late on.\n\"A more firing and confident team would have got over the line here,\" added Buttler.\n\"We had our chances and it's up to us as individuals and a team to find ways to get ourselves back where we need to be.\n\"Joe Root played a typical Joe Root innings, full of class, character, composure and skill, it needed one of us to go with him for longer.\"\nAsked about his form with the bat - Buttler only has two ODI half-centuries since September 2023 - the captain said: \"If I knew, I wouldn't be playing the way I am. I don't feel far way, it's disappointing when you're not reaching the level of the best in the world.\"", "url": "https://www.bbc.co.uk/sport/cricket/articles/clyde7g7wqzo"}