{"authors": ["Ceri Coleman-Phillips", "www.facebook.com"], "date_download": "2025-05-21 05:58:48", "date_modify": "2025-05-21 05:58:48", "date_publish": "2025-01-31 13:40:06", "description": "Gwalia Lightning complete back-to-back Celtic Challenge wins over Edinburgh to keep their title hopes alive.", "filename": "sport_rugby-union_articles_cn01kyxjjjwo_1747807128.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f6f0/live/928c25f0-e0b7-11ef-a56b-833ca503b60b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cn01kyxjjjwo_1747807128.html", "title": "Celtic Challenge: Lightning complete Edinburgh double with bonus-point win", "title_page": "Celtic Challenge: Lightning complete Edinburgh double with bonus-point win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Gwalia Lightning completed back-to-back Celtic Challenge wins over Edinburgh to keep alive their title hopes.\nHannah Walker and Sian Jones exchanged tries in a close first half at Ystrad Mynach, before Lightning went up a gear.\nWales duo Bryonie King and Caitlin Lewis took their chances after the break, with Courtney Greenway wrapping up the bonus-point five minutes from time.\nLightning, now unbeaten in their last three outings, are second in the table behind Wolfhounds, who they play at Media Park, Cork on Sunday, 9 February.\nEdinburgh travelled to south Wales looking for revenge after being pipped 29-27 in last weekend's fixture.\nThey started brightly and were rewarded with a try on five minutes. The forwards went through the phases before some slick passing allowed Walker to run in her eighth try of the competition.\nLightning hit back two minutes later, as Maisie Davies was held up inches short of the line after a powerful carry, but returning scrum-half Jones sniped under the posts before converting her own effort.\nThey then enjoyed a sustained period of possession, but unforced errors and resolute Edinburgh defending meant pressure was not converted into points.\nIt was a similar story for the visitors who finished the half strong. Hannah McMahon should have scored, but this time it was Davies doing the holding up.\nA chance went begging again on the stroke of the half-time, but Lightning managed to hold up the maul and their slender lead.\nLightning found their clinical edge after the break and such was their confidence, they turned down kickable points and backed their attacking scrum.\nIt proved the right decision with the skipper King going over from close range after a couple of good forward carries, notably Alaw Pyrs, who had an outstanding afternoon.\nThe lead was extended on 55 minutes, this time Jenny Hesketh fed player-of-the-match Lewis, who showed her international pace by running in a try from her own half.\nEdinburgh kept plugging away, but Lightning had the final say. King made a line break with a show and go before passing out to Greenway to run in under the posts.\nEdinburgh will be back in Wales on Saturday, 8 February to take on Brython Thunder at Parc y Scarlets.\nThunder are still looking for their first win of the campaign after Saturday's 58-0 hammering by Clovers.", "url": "https://www.bbc.com/sport/rugby-union/articles/cn01kyxjjjwo"}