{"authors": ["Shamoon Hafez", "www.facebook.com"], "date_download": "2025-05-21 05:30:26", "date_modify": "2025-05-21 05:30:26", "date_publish": "2025-01-31 18:11:07", "description": "Everton have \"reached an agreement\" to sign midfielder Carlos Alcaraz on a loan deal from Flamengo, according to the Brazilian club.", "filename": "sport_football_articles_c3vp12qx5l3o_1747805426.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5e3c/live/1922b680-dffd-11ef-b1b3-51355c7a67fc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c3vp12qx5l3o_1747805426.html", "title": "Carlos Alcaraz: Everton 'reach agreement' with Flamengo for loan deal for Argentine midfielder", "title_page": "Carlos Alcaraz: Everton 'reach agreement' with Flamengo for loan deal for Argentine midfielder - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Everton have \"reached an agreement\" to sign midfielder Carlos Alcaraz on a loan deal from Flamengo, according to the Brazilian club.\nAlcaraz, 22, previously played in the Premier League for Southampton before joining Juventus on loan for the second half of the 2023-24 campaign.\nThe Argentine started this season with the Saints, coming off the bench in the opening day defeat at Newcastle, but joined Flamengo, external later in August for a club-record £16m fee.\nHe now looks set to make a quick return to England and, though Everton sources confirmed interest in signing Alcaraz, BBC Sport have been told it is not yet a \"done deal\".\nHowever, the Brazilian club announced on their official website on Friday that they had reached an agreement to loan Alcaraz to Everton.\nThe club said the loan includes a \"mandatory purchase clause\" subject to the parties meeting certain unspecified conditions.\nFlamengo football director Jose Boto said: \"The decision to negotiate Alcaraz was made after a detailed analysis, considering both the vision of the technical committee and the interests of the club.\"\nAlcaraz would be Everton's first signing since the Friedkin Group took over the club in December.", "url": "https://www.bbc.com/sport/football/articles/c3vp12qx5l3o"}