{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:29:25", "date_modify": "2025-05-21 04:29:25", "date_publish": "2025-04-05 10:03:52", "description": "Aston Villa vs Nottingham Forest predictions: Chris Sutton on Premier League game", "filename": "sport_football_articles_cm24e422w8mo_1747801765.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/561d/live/fbee38e0-d1d4-11ef-87df-d575b9a434a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cm24e422w8mo_1747801765.html", "title": "Aston Villa vs Nottingham Forest predictions: Chris Sutton on Premier League game", "title_page": "Aston Villa vs Nottingham Forest predictions: Chris Sutton on Premier League game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Nottingham Forest are flying, but so are Aston Villa - they have now won six on the spin.\nForest nicked the points late on at the City Ground when Villa went there in December, coming from 1-0 down after 87 minutes to win it in stoppage time.\nThis will be just as close, and I cannot really call a winner.\nEven if they do drop points here, I am still confident Forest will finish in the Champions League places.\nWe saw again when they beat Manchester United on Tuesday that they are not bothered about possession because of their threat on the break and Anthony Elanga's winner in that game was one of my favourite goals of the season.\nThe way he took it was really intelligent, because he had the option to pop the ball out to the left but the United backline kept backing off, and he just kept on going. His finish was devastating too and, overall, it reminded me of me in my pomp with the way I used to drive up the pitch.\nIt's going to be harder for Aston Villa to make the top five, because they still have the Champions League and FA Cup to think about, but they are on a great run and, at the moment, they have the depth in the squad they need even if they make changes here before they face Paris St-Germain next week.\nI don't think Villa boss Unai Emery will prioritise any of the three competitions. They are in them all, so he will go for it in all three - and so he should.\nSutton's prediction: 1-1", "url": "https://www.bbc.com/sport/football/articles/cm24e422w8mo"}