{"authors": ["Andrew Aloia", "Adam Whitty", "www.facebook.com"], "date_download": "2025-05-21 05:25:57", "date_modify": "2025-05-21 05:25:57", "date_publish": "2025-04-03 11:52:04", "description": "Leicester's Handre Pollard says the inclusion of South African teams in European competitions helped convince the two-time World Cup winner to rejoin Bulls.", "filename": "sport_rugby-union_articles_crrz98j5rqdo_1747805157.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5616/live/ed89cc40-107e-11f0-8c6c-d990c1c0e96b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_crrz98j5rqdo_1747805157.html", "title": "Handre Pollard: Leicester Tigers fly-half explains reason for rejoining Bulls", "title_page": "Handre Pollard: Leicester Tigers fly-half explains reason for rejoining Bulls - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Leicester Tigers' Handre Pollard says the inclusion of South African teams in European competitions helped convince the two-time World Cup winner to rejoin Bulls next season.\nThe 31-year-old fly-half will leave the Premiership club after three years at the end of the season to return to home with the side where he started his career in 2013.\nHe made his professional debut with the Pretoria-based side when they were part of the Southern Hemisphere's Super Rugby competition.\nPollard moved to Montpellier in France in 2019 before Bulls and other South African sides joined the United Rugby Championship (URC) - made up of Welsh, Scottish, Irish and Italian sides – and were subsequently added to the European Champions and Challenge Cup competitions.\nThat shift, the lure of once again playing for Bulls and desire to be closer to family are among the reasons behind him impending Tigers exit.\n\"Just being able to go back home is something I actually didn't think was possible,\" Pollard told BBC Radio Leicester.\n\"But how things have changed in the last few years with South African teams playing in the URC and being able to play in the Champions Cup whilst being in South Africa was something I'd never seen in my [early] career, but the opportunity is there now.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/crrz98j5rqdo"}