{"authors": ["Emma Sanders", "www.facebook.com"], "date_download": "2025-05-20 13:26:07", "date_modify": "2025-05-20 13:26:07", "date_publish": "2023-08-02 04:58:37", "description": "England's performance against China makes a statement to their rivals and dispels doubts around their Women's World Cup campaign.", "filename": "sport_football_66375630_1747747567.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1E15/production/_130610770_eng.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66375630_1747747567.html", "title": "Women's World Cup 2023: England announce arrival with 6-1 win over China", "title_page": "Women's World Cup 2023: England announce arrival with 6-1 win over China - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The 'ole' chants had kicked in before 40 minutes had been played and the same fans were rocking out to Van Halen at half-time. England had arrived at the Women's World Cup.\nThe party atmosphere evolved throughout England's scintillating 6-1 victory over China, confirming their place in the last 16 as group winners.\nThe Lionesses swept aside China with slick, unpredictable and entertaining football in one of the best performances in the tournament so far.\nIt was a display that sent a statement to England's rivals in Australia. The European champions mean business and have finally shown their quality.\nWhen half-time arrived, England were in cruise control at 3-0 up - a goal and two assists already in the bag for Chelsea sensation Lauren James.\nEngland were one of the pre-tournament favourites but injuries to key players Leah Williamson, Beth Mead and Fran Kirby had dominated the build-up to the World Cup.\nSarina Wiegman's side then opened Group D with an unconvincing 1-0 win against Haiti, ranked 49 places lower than them, before they had to rely on a James stunner to help them over the line in a 1-0 victory against Denmark.\nEngland had six points in the bag and sat top of the group, but the performances had created more questions than provided answers. Struggling for fluidity, their goalscoring touch also seemed to have deserted them, with just one goal from open play in their past four matches - while none of England's strikers had got off the mark.\nTo add to the concern, instrumental midfielder Keira Walsh picked up a knee injury - so by the time the Lionesses were lining up to face China in their final group match, English pessimism had started to creep in.\nTension was hardly reduced when Wiegman named her starting XI for Tuesday's match in Adelaide and few could state confidently what the formation was.\nIt was rogue, unpredictable and risky by a manager who had named the same team throughout Euro 2022 and has rarely switched from a favoured 4-2-1-3 formation. This was an uncharacteristic experiment in the middle of the game's biggest tournament.\nInstead of her favoured flat back four, England set up with a back three - and it worked almost instantly.\nChina, perhaps as unprepared as everyone else, could not work out how to track England's runners and they attacked relentlessly, creating chances in abundance.\nAlessia Russo, who looked incredibly sharp, opened the scoring within four minutes.\nJames then sprang into life, linking up well with Lauren Hemp, while defender Millie Bright - who had looked rusty in the first two games on her return from injury - won the ball back on numerous occasions in the midfield area as England added to their tally.\nRachel Daly and Lucy Bronze barely left the China half from their wing-back positions and the attacking verve did not relent after the break when substitutes Chloe Kelly, Bethany England and Laura Coombs entered the stage.\n\"It is like we've finally arrived,\" former England midfielder Karen Carney told ITV. \"This is why Sarina Wiegman is paid the big bucks.\"\nWhile it was undoubtedly a victory built on a flowing team performance, 21-year-old James' display stole the show once again.\nHer talent left even the opposition in awe, as she departed the field to a standing ovation by some members of the Chinese media as well as the majority of the 13,000 supporters in Adelaide.\nWith two goals and three assists to her name, she became only the third player on record - they began in 2011 - to be directly involved in five goals in a Women's World Cup game.\nHer display alone will have struck fear into England's opponents, while it will surely not have gone unnoticed that the Lionesses are starting to click by building the connections Wiegman vowed they would.\nEngland may be without several star players - and only six of the Euro 2022 winning side are available - but this performance was reminiscent of what they produced last summer.\nEven the celebrations were familiar, as England fans belted out 'Sweet Caroline' at full time, while Wiegman gave a debrief in a huddle on the pitch.\nEngland face Nigeria next in the last 16, live on BBC One on Monday, and, just as they did at Euro 2022, they will hope they are starting to build momentum to take them deep into the tournament.", "url": "https://www.bbc.com/sport/football/66375630"}