{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:25:12", "date_modify": "2025-05-21 04:25:12", "date_publish": "2025-01-18 00:00:00", "description": "La Liga leaders Atletico Madrid's club-record 15-game winning run comes to an end with a surprise defeat at neighbours Leganes.", "filename": "sport_football_live_cj48vwn9w17t_1747801512.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cj48vwn9w17t_1747801512.html", "title": "Leganes 1-0 Atletico Madrid: Antoine Griezmann misses penalty as winning run ends", "title_page": "Leganes 1-0 Atletico Madrid: Antoine Griezmann misses penalty as winning run ends - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "La Liga leaders Atletico Madrid's club-record 15-game winning run has come to an end with a surprise defeat at neighbours Leganes.\nAtletico had a chance to at least keep their unbeaten record going when they were awarded a last-minute penalty, but their all-time record scorer Antoine Griezmann put the spot-kick wide.\nDiego Simeone's side had won every game since a loss at Real Betis on 27 October.\nBut the crucial goal on Saturday came when Leganes centre-back Matija Nastasic headed in from Dan Raba's cross.\nJulian Alvarez and Griezmann had both hit the woodwork in the first half with the game goalless.\nReal Madrid, who are just one point behind Atletico, can go top if they win or draw at home against Las Palmas on Sunday (15:15 GMT).\nAtletico captain Jan Oblak told DAZN: \"We didn't come in well. There was a lack of energy, not enough.\n\"It was our own issue. It shouldn't have to happen. With a bit more energy we could have turned it around.\n\"We didn't play well but we should have our head up. After 15 games, we've lost.\"\nLeganes are 15th, three points above the relegation zone, after the surprise win.", "url": "https://www.bbc.com/sport/football/live/cj48vwn9w17t"}