{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:27:32", "date_modify": "2025-05-19 15:27:32", "date_publish": "2017-07-14 12:11:15", "description": "Three tries in the final 10 minutes help St Helens boost their top four hopes with a battling win over Catalans Dragons.", "filename": "sport_rugby-league_40574624_1747668452.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/133A4/production/_96965787_sw32_castleford_v_saints.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_rugby-league_40574624_1747668452.html", "title": "Super League: St Helens 46-28 Catalans Dragons", "title_page": "Super League: St Helens 46-28 Catalans Dragons - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "St Helens boosted their hopes of a top-four finish with a battling Super League win over Catalans.\nThe visitors took the lead three times in the first half thanks to tries from Justin Horo, Luke Walsh and Tony Gigot.\nHowever, scores from Theo Fages, Alex Walmsley and Louie McCarthy-Scarbrook gave Saints the lead at the interval.\nHoro's second try put the Dragons back in front but tries from Jonny Lomax, Mark Percival, Luke Thompson and Ryan Morgan guided the hosts to victory.\nLuke Walsh's goal after Richie Myler's try moved the French side to back within two points before the Saints crossed three times in the final 10 minutes.\nA third win in four matches moves Justin Holbrook's men to within three points of fourth-placed Wakefield.\nCatalans, who had already been consigned to the Qualifiers, have now lost five of their last six games.\nSt Helens coach Justin Holbrook:\n\"It was a danger game for us especially after our win (against Hull FC) last week. We had to earn the two points and they pushed us.\n\"They started well and we were not up to our high standards in the first half.\n\"We have to give them credit. I'm really happy with the way we finished the game off.\n\"We swapped the lead a few times and the boys did well to close it out.\n\"We have got some wins together and it's a big game next Sunday (against Wakefield) and if we can continue to improve then I would certainly back ourselves (in the play-offs).\"\nCatalans Dragons coach Steve McNamara:\n\"It was disappointing to lose the way we did. With eight-and-a-half minutes left we were two points down on the scoreboard.\n\"It was a real tit-for-tat game. We found ourselves in a position to win it and we have conceded a lot of points at the end which makes the scoreline look ridiculous.\n\"We are going in the right direction and we know where we are for the rest of the season.\"\nSt Helens: Lomax, Makinson, Morgan, Percival, Grace, Fages, Richardson, Douglas, Roby, Thompson, Taia, Peyroux, Wilkin.\nReplacements: Walmsley, McCarthy-Scarsbrook, Lee, Knowles.\nCatalans Dragons: Gigot, Tierney, Inu, Duport, Yaha, Walsh, Myler, Moa, Aiton, Bousquet, Anderson, Horo, Baitieri.\nReplacements: Casty, Bird, Da Costa, Navarrete.", "url": "https://www.bbc.com/sport/rugby-league/40574624"}