{"authors": ["Ali Speechly", "www.facebook.com"], "date_download": "2025-05-21 06:04:51", "date_modify": "2025-05-21 06:04:51", "date_publish": "2024-12-24 15:39:24", "description": "Tottenham news: Opinion - fan's moment of the year", "filename": "sport_football_articles_cdxzw7edkvko_1747807491.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a33b/live/307e0f30-b62f-11ee-bc2f-cb5579b90709.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cdxzw7edkvko_1747807491.html", "title": "Opinion - fan's moment of the year - BBC Sport", "title_page": "Tottenham news: Opinion - fan's moment of the year - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It has been another rollercoaster year watching Ange Postecoglou's Spurs.\nThe football has been entertaining and frustrating in equal measure but, for me, there is one moment that stands out for all the right reasons.\nIt started with me leaning forward on my sofa in response to Micky van de Ven intercepting a lose touch from Marcus Rashford well within the Spurs half at Old Trafford.\nBefore I knew it, I was on my feet screaming at the television as Micky was gliding past multiple United players with ease. It felt like watching a 100 metre race and cheering on your favourite athlete, willing them to the gold medal.\nMicky running at speed is a familiar sight, but he is usually sprinting without the ball towards his own goal. This was something else entirely.\nBrennan Johnson was already smiling before he tapped the ball into the goal from Micky's cross – a smile that encapsulated the joy among everyone associated with Spurs in that moment.\nIndeed, it is a goal that captures everything good about Angeball: quick and daring, positive and purposeful, expansive and entertaining football to enjoy and be proud of.\nIf our defenders have the confidence, ability and permission to play this way, it is little wonder we have so many different goal scorers.\nMany were keen to write off Spurs as an attacking team once Harry Kane left, and it is testament to what Ange is building at Spurs that goals can and do come from any one of our players, anywhere on the pitch.\nYes, there is still work to do defensively, but watching our centre-back run riot at Old Trafford and be the catalyst for such a comprehensive dismantling of the opposition really was a wonderful moment.\nHopefully we will experience more like it in 2025 and beyond.", "url": "https://www.bbc.com/sport/football/articles/cdxzw7edkvko"}