{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:09:40", "date_modify": "2025-05-21 04:09:40", "date_publish": "2025-04-06 00:00:00", "description": "Reaction as Ospreys score six tries on the way to a convincing win over Scarlets to reach the quarter-finals of the European Challenge Cup.", "filename": "sport_rugby-union_live_cn5xrl41vx2t_1747800580.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_live_cn5xrl41vx2t_1747800580.html", "title": "European Challenge Cup LIVE: Ospreys 36-14 Scarlets", "title_page": "European Challenge Cup LIVE: Ospreys 36-14 Scarlets - Ospreys through to quarter-finals - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Goodbye from Swansea\nFT: Ospreys 36-14 Scarlets\nWe expected a reaction from Ospreys after last week's league defeat at Llanelli and we got it.\nAdam Beard got the scoring going after just two minutes before Jac Morgan, Rhys Davies, Dewi Lake, Jack Walsh and Dan Kasende completed an emphatic win for the hosts.\nBlair Murray's early response hinted at more of a contest but Scarlets were made to pay for failing to capitalise on their chances.\nOspreys march into the quarter-finals as the last region flying the flag for Wales in Europe.\nThey now face French outfit Lyon here at the Swansea.com Stadium next Saturday, 12 April at 17:30 BST.\nBut you can follow all the build up on the BBC Sport website this week.\n'We need a full 80 minutes' - Jones\nFT: Ospreys 36-14 Scarlets\nOspreys head coach Mark Jones told S4C: \"I was very pleased with how we put the learnings from last week into action this week in that first half. We were very good.\n\"But I'm disappointed with the second half. There was a lack of execution and intent and if we want to progress in this tournament and reach a semi-final, then we need to play for the full 80 minutes.\n\"But the exciting thing is that we have won and there is still plenty to work on.\"\n'It wasn't to be' for Scarlets - Peel\nFT: Ospreys 36-14 Scarlets\nScarlets head coach Dwayne Peel told S4C: \"We're disappointed on our side, we thought we could put them under a bit of pressure but they started on fire scoring two early tries.\n\"The second-half I thought we needed to start early, but it wasn't to be.\n\"The positives for us is the way we kept battling.\n\"We've got the Dragons in two weeks, a lot of the players wouldn't have had a rest from the Six Nations so it'll be nice to have a week to resettle before playing again.\"\nPost\nFT: Ospreys 36-14 Scarlets\nOspreys captain Jac Morgan told S4C: \"All credit to the boys they came out that first-half, we started well last week but our discipline let us down, we talked a lot about that this week and we were much better.\n\"We made a couple of changes from last week, but we're always ready as a squad and as a group of boys and we make sure whoever steps onto the pitch they put in a performance.\n\"We enjoyed playing in the quarter-finals last year and we can't wait to do it again at home.\"", "url": "https://www.bbc.com/sport/rugby-union/live/cn5xrl41vx2t"}