{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:25:20", "date_modify": "2025-04-26 06:25:20", "date_publish": "2025-02-28 22:26:15", "description": "Philadelphia 76ers star Joel Embiid is ruled out for the rest of the season because of an ongoing issue with his left knee.", "filename": "sport_basketball_articles_c62zg74zg26o_1745648720.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/509b/live/102aee10-f620-11ef-b331-b70b782ee609.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_basketball_articles_c62zg74zg26o_1745648720.html", "title": "Joel Embiid injury: Philadelphia 76ers star ruled out for rest of season with knee issue", "title_page": "Joel Embiid injury: Philadelphia 76ers star ruled out for rest of season with knee issue - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Philadelphia 76ers star Joel Embiid has been ruled out for the rest of the season because of an ongoing issue with his left knee.\nEmbiid, 30, has featured in just 19 of the 76ers' 58 games so far this season.\nThe seven-time All-Star played just 31 minutes in a 105-103 loss to the Brooklyn Nets last week after sustaining a fall which left him with a swollen knee.\nThe Cameroon-born 2022-23 MVP underwent surgery for a meniscus tear in the knee in February 2024 and was limited to 39 games last season.\nIt is the second high-profile injury in the NBA in the space of two weeks after San Antonio Spurs star Victor Wembanyama, the number one draft pick in 2023, was diagnosed with deep vein thrombosis in his right shoulder which will likely see him miss the rest of the season.\nThe 76ers said in a statement on Friday: \"After further evaluation, it has been determined that [Embiid] is medically unable to play and will miss the remainder of the season to focus on treatment and rehabilitation.\n\"We are working with medical experts to determine the exact treatment plan.\n\"The team and specialists will continue working with Joel to ensure the best path forward for his long-term health and performance.\"\nThe 76ers have lost each of their past nine games, and 11 of their past 12 - recording 20 wins and 38 losses this season to sit 12th in the Eastern Conference.", "url": "https://www.bbc.co.uk/sport/basketball/articles/c62zg74zg26o"}