{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:10:27", "date_modify": "2025-05-21 06:10:27", "date_publish": "2025-02-08 14:29:20", "description": "Match preview, team news and match facts as Scotland host reigning champions Ireland in the Six Nations on Sunday.", "filename": "sport_rugby-union_articles_c1we2qgqr7jo_1747807827.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/945e/live/a6349db0-e582-11ef-a819-277e390a7a08.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c1we2qgqr7jo_1747807827.html", "title": "Six Nations 2025: Scotland vs Ireland preview, kick-off time, team news, BBC coverage & match facts", "title_page": "Six Nations 2025: Scotland vs Ireland preview, kick-off time, team news, BBC coverage & match facts - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Scotland will seek to lay down a marker in their search for a first Six Nations title by attempting to end a 10-match losing streak against defending champions Ireland.\nThe Scot's last win in this fixture was at Murrayfield under Vern Cotter in 2017 and all of their defeats since have been during Gregor Townsend's reign.\nIreland kicked off their title defence with a bonus-point victory over England in Dublin and were seemingly unaffected by the absence of their head coach Andy Farrell, who is on British and Irish Lions duty.\nThe Irish are buoyed by their impressive recent record with 13 wins from their last 14 Six Nations fixtures, although that solitary defeat was their most recent away match in the championship, a 23-22 loss to England at Twickenham in 2024.\nAndrew Cotter: Two sides which bristle with attacking talents but the platform to attack only comes from powerful ball-carrying, where Ireland seem to have the edge and Scotland will simply have to match the visitors to have a chance.\nThe starting midfield partnerships are fascinating - Henshaw alongside Aki in a muscular Irish combination, while Scotland have gone for the skilful Jordan to start at inside centre beside Huw Jones. That's a pairing which looks promising, but is untried for either club or country.\nIreland certainly go into the game as favourites and 10 successive wins over the Scots will give them no end of confidence, but don't be surprised if this one is close.", "url": "https://www.bbc.com/sport/rugby-union/articles/c1we2qgqr7jo"}