{"authors": ["Nat Hayward", "www.facebook.com"], "date_download": "2025-04-26 06:55:01", "date_modify": "2025-04-26 06:55:01", "date_publish": "2025-02-28 15:54:11", "description": "Kieran McKenna press conference: Nottingham Forest vs Ipswich", "filename": "sport_football_articles_ce8yy8wr2g8o_1745650501.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8a85/live/ac9e2280-490a-11ef-9e1c-3b4a473456a6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_ce8yy8wr2g8o_1745650501.html", "title": "Kieran McKenna press conference: Nottingham Forest vs Ipswich", "title_page": "Kieran McKenna press conference: Nottingham Forest vs Ipswich - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "McKenna confirmed Omari Hutchinson suffered a knee injury in Wednesday's defeat at Manchester United: \"It's not very, very serious but he will definitely miss the next game and possibly more. Very disappointing.\"\nKalvin Phillips is \"progressing well\" but McKenna is \"not sure when he will be back\", saying the midfielder is a \"day-by-day case\".\nOn his team selection, McKenna added: \"We try and keep two players for each position physically, technically and tactically ready. Part of that is utilising the squad in cup competitions. That is what we have done to this point and the players have done really well. We haven't made any decisions for Monday yet but there's a chance for some of those who have done well in the first two rounds get an opportunity again.\"\nOne player who could return is goalkeeper Arijanet Muric: \"It's a possibility. He's carrying a bit of an issue in his shoulder but he's managing. I'll have to get some sort of judgments on that and see where he is from a medical point of view but it's certainly a possibility he will play.\"\nOn recovering from defeat against 10 men at Old Trafford: \"We had conversations this morning. Players had yesterday off after a late return on Wednesday night. We've been through all of it and looked at the areas that were most important and the players are looking forward to Monday now.\"\nMcKenna could lead an Ipswich team into the FA Cup quarter-finals for the first time in more than 30 years: \"We're looking forward to the game. A couple of earlier rounds have been a nice break from the league action. It's a nice change of focus and narrative and a nice progression for the group. It's a real challenge but a really good cup tie in a historic ground against a good Premier League side. A welcome distraction to be honest.\"", "url": "https://www.bbc.co.uk/sport/football/articles/ce8yy8wr2g8o"}