{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:22:04", "date_modify": "2025-05-21 07:22:04", "date_publish": "2025-05-20 07:53:05", "description": "Stockport County release right-back Kyle Knoyle following the conclusion of their 2024-25 season.", "filename": "sport_football_articles_c24995983qro_1747812124.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2eea/live/4dc4c360-354d-11f0-b7a7-db7402bc2830.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c24995983qro_1747812124.html", "title": "Kyle Knoyle: Stockport County release defender after the 2025-26 season", "title_page": "Kyle Knoyle: Stockport County release defender after the 2025-26 season - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Stockport County have released right-back Kyle Knoyle after the conclusion of their 2024-25 season.\nThe 28-year-old arrived from Doncaster Rovers for an undisclosed fee in January 2023 and helped the club to the League Two play-off final in his first season.\nHe then helped them win the League Two title the following season and to a third-placed finish in the third tier this term, playing in last week's play-off semi-final second leg penalty shootout defeat by Leyton Orient.\nHe is joined by Cody Johnson, 20, in exiting the club, the young midfielder making a total of 12 senior appearances for the Hatters.\nMeanwhile, out-of-contract trio Ibou Touray, Fraser Horsfall and Callum Camps have been offered new deals ahead of the 2025-26 season while Will Collar and Macauley Southam-Hales remain in discussion with the club over a new contract.\nSoutham-Hales suffered a serious knee injury in February 2024 and was offered a new contract last summer as he continued his recovery before finally returning to action in November.\n\"You couldn't wish to meet a more dedicated and professional pair of players in Cody and Kyle, and whilst both players could easily be retained, we feel they may be able to secure better terms and playing opportunities elsewhere,\" CEO Simon Wilson said, external.\n\"We are in dialogue with several others regarding next steps and as soon as we have conclusive decisions we will update further. I appreciate fans (as we are) will be keen to see players commit, however deals must suit all parties and we all must respect the players' positions as they consider options.\"", "url": "https://www.bbc.com/sport/football/articles/c24995983qro"}