{"authors": ["Andrew Petrie", "www.facebook.com"], "date_download": "2025-04-26 07:30:01", "date_modify": "2025-04-26 07:30:01", "date_publish": "2025-02-27 18:04:09", "description": "BBC Podcast Romanov: Czar of Hearts continues with the rebellious tale of the 'Ricarton Three'.", "filename": "sport_football_articles_c0eg40py17qo_1745652601.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f50e/live/d513c630-f462-11ef-9d52-1b1b29dc5f7f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c0eg40py17qo_1745652601.html", "title": "When Hearts' Riccarton Three took on owner Romanov", "title_page": "When Hearts' Riccarton Three took on owner Romanov - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Ask any Hearts fan when the wheels started to truly fall off the Vladimir Romanov wagon, and they'd most likely point to a cold October morning in 2006.\nThis was nothing to do with the revolving door of managers, a door which kept turning despite league positions.\nThis was a dressing room revolution, exposed and laid bare by the most powerful among the squad, against the man at the top.\n\"Chaps, just to make you aware that I'm going to make a statement and we'll answer no questions,\" captain Steven Pressley told the assembled journalists as he walked in beside midfielder Paul Hartley and goalkeeper Craig Gordon.\nAs they took their seats behind a little table, busy with microphones and cables, and cameras flashing just inches from their noses, the Riccarton Three had their moment.\nThis was not going to be your run of the mill news conference. It took almost all gathered there, including those working for the club, by complete surprise.\nWell, everyone except BBC Scotland's Brian McLauchlin...\n\"That morning, I received a text from a player asking me if I was attending the media conference,\" McLauchlin remembers. \"I said 'yes'. He said 'get there early, get a front seat, this'll be fun.'\n\"It was dynamite.\"\nThe usual press corps trooped out to Hearts' training base at Riccarton unaware they were about to witness one of the defining incidents of the Romanov era.\nFootball is a soap opera, and this was Hearts' \"Happy Christmas, Ange!\" Eastenders moment. The divorce papers served up by captain to chairman.\n\"In walked the three of them,\" recalls Mark Donaldson, then head of sport for Radio Forth. \"Normally you'd get a 'hey, how are you?' or whatever. But it was a pre-conceived idea that this what they were going to do.\"\nPressley would read out a prepared statement that eviscerated any notion of a happy playing squad at Hearts - a squad that had won the Scottish Cup just a few months prior.\n\"I have tried along with the coaching staff and certain colleagues to implement the correct values and disciplines but it has become an impossible task,\" the captain, affectionately dubbed 'Elvis' by fans and colleagues, continued.\n\"There is only so much a coaching staff, a captain, and certain colleagues can do without the full backing, direction, and coherence of the manager and those running the football club.\"\nThis was not an attack on fellow players, on a particular manager - they were onto their fifth in just over a year - or backroom staff. The delicately-selected lexicon that Pressley used was squarely aimed at one man - Romanov.\n\"I was probably seen as the figurehead of the club at the time,\" Pressley later said. \"Everybody leaned on me to try and get things done, or get answers within the club.\n\"The treatment of some individuals was horrendous. The honesty, the transparency, all the things that I think are really important in the foundations of a club - they were being disregarded.\"\nPressley and Romanov would never meet face to face after that, but the Lithuanian owner found a way of communicating with the club captain.\n'Elvis' was dropped from starting XI, then the entire squad, and stripped of the captaincy. He left the building a little over a month later.\nHe would sign for Celtic, but not before a bizarre twist in the tale.\n\"The amazing thing was, the day I was told I no longer had a future at Hearts, I was also offered the assistant manager's job,\" Pressley adds.\nHartley, a fan favourite and perhaps the best player in the squad at the time, soon followed him, signing for Celtic on New Year's Day in 2007.\nOnly Gordon remained after the winter window.\nThe first seven episodes of Romanov: Czar of Hearts are available on BBC Sounds, with two more to be released weekly on Saturdays.", "url": "https://www.bbc.co.uk/sport/football/articles/c0eg40py17qo"}