{"authors": ["Phil McNulty", "www.facebook.com"], "date_download": "2025-05-21 03:46:48", "date_modify": "2025-05-21 03:46:48", "date_publish": "2025-01-05 20:48:43", "description": "Having shown what they can do in the 2-2 draw at league leaders Liverpool, there can be no more excuses for Ruben Amorim's Manchester United, writes Phil McNulty.", "filename": "sport_football_articles_c4gj10jmmx4o_1747799208.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/edad/live/b507b590-cbc2-11ef-94cb-5f844ceb9e30.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c4gj10jmmx4o_1747799208.html", "title": "Manchester United: Ruben Amorim's side have no more excuses after showing potential at Anfield", "title_page": "Manchester United: Ruben Amorim's side have no more excuses after showing potential at Anfield - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ruben Amorim may have only been half-joking when he claimed the strains of managing Manchester United were already showing on his youthful features.\nBefore his first visit to Anfield, the 39-year-old had not so much had a new head-coach bounce as a flatline of failure, with five defeats in eight Premier League games since he succeeded Erik ten Hag at Old Trafford in November.\nAnd Amorim's message before Sunday's visit to rampant Liverpool was hardly a rallying cry to fire up the troops as he claimed United's players were \"anxious - sometimes afraid\".\nNot exactly fighting talk for what is, arguably, currently the European game's toughest assignment, a meeting with a Liverpool side racing clear at the top of the Premier League and carrying all before them in the Champions League.\nAnd yet, against all odds and in the teeth of a Merseyside blizzard, United showed all the qualities Amorim claimed they had been missing to deliver the finest performance of his short reign to earn a 2-2 draw.\nYes, the derby win at Manchester City may be United's best result under the Portuguese, but this was the most complete display.\nThere was a freakish element to that win at Etihad Stadium, two late goals pinching the points at the end of a dreadful game.\nHere, with the Kop expecting Liverpool to over-run this United side in reduced circumstances, Amorim's men stood up to be counted.\nNo fear. No anxiety.\nLisandro Martinez gave them the lead but, even after Cody Gakpo's angled strike and Mohamed Salah's penalty left them chasing, United never gave up hope or took a backward step as Amad Diallo's late equaliser shared the points.\nAnd it could have been more. Much more.\nIf Harry Maguire had not shot over the top of an open goal with seconds of seven added minutes left, Amorim and United could have been celebrating a landmark first win at Anfield since Wayne Rooney struck in 2016.\nFor all that, this was the biggest indication yet that Amorim is having an impact, that his messages are finally getting across.\nHis Manchester United, at last, showed signs of life. The 'Ruben Interim' jibes can be silenced for now, along with the alarmist relegation talk, because this was a performance where Amorim's side played for their manager and themselves.\nNow the trick, for Amorim and Manchester United, is to perform like this again... and again.\nUnited captain Bruno Fernandes, outstanding in midfield on his return from suspension following a red card in the dispiriting 2-0 loss by Wolves, delivered a brutally honest verdict when asking the question everyone inside Old Trafford must now pose themselves.\n\"If we show this level at Liverpool, first in the Premier League, then why can't we do this everywhere,\" said Fernandes.\n\"We have been criticised and fairly. Our position in the table says it all. We have lost too many points.\n\"I'm pretty upset. It frustrates me and finally I did a proper performance. We know how tough it is to play Liverpool, but we put in a real effort and played with some passion and heart.\n\"We can't stop here. We have to bring this heart, passion and frustration to the next game.\n\"If we can do it at Anfield, we have to do it everywhere.\"\nAmorim deserves credit for stiffening United's midfield, with Kobbie Mainoo and Manuel Ugarte a much more competitive proposition for their Liverpool counterparts than the aged, laboured duo of Casemiro and Christian Eriksen, whose legs and lack of energy was cruelly exposed in the 2-0 home defeat by Newcastle United.\nAmorim knows this cannot be a one-off, another false dawn, as he added: \"It's really clear. When we are focused, when we fight for every ball, when we suffer, when we are tired when the game is finished, we are a good team.\n\"If we don't do that every time we are going to lose games. This is now clear to everybody.\"\nUnited have proved themselves in the Premier League's toughest environment. There should now be no more excuses.", "url": "https://www.bbc.com/sport/football/articles/c4gj10jmmx4o"}