{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:54:03", "date_modify": "2025-05-21 07:54:03", "date_publish": "2025-01-13 15:40:28", "description": "Portsmouth manager John Mousinho says Isaac Hayden could make his debut at Blackburn on Wednesday night.", "filename": "sport_football_articles_cz0lmrp9xm8o_1747814043.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3152/live/06b5ef40-d1bf-11ef-8a2a-b1f18b093115.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cz0lmrp9xm8o_1747814043.html", "title": "Hayden set for debut as Pompey work on more deals", "title_page": "Portsmouth FC: Hayden set for debut as Pompey work on more deals - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Midfielder Isaac Hayden could make his debut after signing on loan from Newcastle. \"It's really good to have him with us,\" said Mousinho. \"We wanted to bring in somebody who could impact the starting XI and we think Isaac could do that.\"\nOn signing more players in the January transfer window, Mousinho said: \"Nothing this week, nothing is imminent before the game tomorrow. Plenty of irons in the fire but nothing that's ready to go.\"\nWhen asked if there could be any more incomings before the weekend, Mousinho said: \"Perhaps.\"\nMousinho said Blackburn have had a \"fantastic\" first half of the season. \"I think they pose a real threat, they've got a really good system,\" he said. \"I think John [Eustace] is a really good coach and it's going to be a really tough game.\"\nOn the latest team news, Mousinho confirmed goalkeeper Jordan Archer is having a scan on a quad injury he picked up in the 2-0 defeat at Wycombe in the FA Cup on Friday night and his availability will depend on the outcome of those checks.\nDefender Conor Shaughnessy returned to training today for the first time since tearing his calf in November, but is still two to three weeks away from being available for selection.\nCentre-back Regan Poole is expected back in training next week following a hamstring issue which has kept him out since going off at half-time in the 0-0 draw with Norwich on 10 December.", "url": "https://www.bbc.com/sport/football/articles/cz0lmrp9xm8o"}