{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:42:08", "date_modify": "2025-05-20 13:42:08", "date_publish": "2023-08-01 13:09:57", "description": "England's last-16 match against Nigeria at the Fifa Women's World Cup will be live on BBC TV on 7 August at 0830 BST.", "filename": "sport_football_66374087_1747748528.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/E51A/production/_130605685_russo_index.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66374087_1747748528.html", "title": "When are England playing next and who are they playing? Details of last 16 matches on the BBC", "title_page": "When are England playing next and who are they playing? Details of last 16 matches on the BBC - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England's last-16 match against Nigeria at the Women's World Cup will be broadcast live on BBC One on Monday, 7 August at 08:30 BST.\nThere will be commentary on BBC Radio 5 Live and the game will also be shown on BBC iPlayer and the BBC Sport website.\nCo-hosts Australia also play on Monday, facing Denmark at 11:30 BST, and that match will also be broadcast live on BBC One, iPlayer and online.\nThree other last-16 games will also be broadcast live on the BBC.\nThey are: Spain v Switzerland [06:00 BST on Saturday, 5 August], Netherlands v South Africa [03:00 BST on Sunday, 6 August] and France's game against Morocco [12:00 BST on Tuesday, 8 August].\nHighlights of all the last-16 matches are available to watch on Women's World Cup Highlights at 7pm on BBC Three daily, as well as on BBC iPlayer, the BBC Sport website and app throughout the day.\nThe BBC is also the only place you can watch both semi-finals, and the World Cup final on Sunday, 20 August will be live on BBC One and BBC iPlayer.\nBBC Radio 5 Live, 5 Sports Extra and BBC Sounds will provide live commentary of every England game and other key matches throughout the tournament, including both semi-finals and the final.", "url": "https://www.bbc.com/sport/football/66374087"}