{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:23:10", "date_modify": "2025-05-21 05:23:10", "date_publish": "2025-04-03 15:27:42", "description": "West Bromwich Albion midfielder Jed Wallace tells the BBC's 72+ EFL podcast the Baggies season has been a frustrating one, but is not over yet.", "filename": "sport_football_articles_cj9endzn82mo_1747804990.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/332d/live/b61cba80-108b-11f0-92f2-9df11cadb01a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cj9endzn82mo_1747804990.html", "title": "West Bromwich Albion: Jed Wallace on frustrating Baggies campaign", "title_page": "West Bromwich Albion: Jed Wallace on frustrating Baggies campaign - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jed Wallace has opened up on the frustration of West Bromwich Albion's campaign but hopes the Baggies can finish the season on a high.\nThe 31-year-old midfielder has missed the past six games with a calf injury but hopes to return to help Albion cement their place in the play-offs.\nWest Brom are sixth on goal difference in a tight race with just seven points separating Coventry, in fifth, from 12th-placed Sheffield Wednesday, with seven games left.\nThe Baggies are the country's draw specialists with 18 - Championship rivals Preston North End and League Two Colchester United have 17 - and have won just one of their past five matches.\nThey were stunned by a late winner at Norwich on Saturday, and Wallace told the BBC's EFL podcast 72+: \"It's so frustrating.\n\"When you look at the table and we're on the same points as Middlesbrough and they have lost six more games than us. To have 18 draws and only 13 wins is, for us, a huge frustration.\n\"Saturday was almost the story of our season, certainly away from home, where we have all the ball, look in control of the game and then Norwich go down the other end, one ball straight through us, and score.\"\nThe Baggies have not won away from The Hawthorns since 10 November, picking up just seven points from a possible 36 on the road since overcoming Hull City.\n\"It's been so frustrating for us, especially away from home,\" Wallace added. \"It's still in our hands though – we are still sixth, we play teams in and around us and we know if we can get four or five wins in the next seven games I think we'll be where we want to be.\n\"Going into the season you think 74 points will give you a chance of Premier League football. I don't think you're going to need that this year. If you get 70 then you're going to be there or thereabouts.\"\nWest Brom have 57 points going into what Wallace called \"the biggest week of the season\" as they host Sunderland followed by Tuesday's trip to Bristol City and the visit of Watford to The Hawthorns next Saturday.\n\"We're unbeaten home and away against teams in the top six and I think sometimes those more pure games of football technically can suit us more,\" he said.\n\"It's so frustrating because in (this away) run we have gone to Leeds and Burnley, two of the toughest away games all season, and in my opinion have been the better team in both games and come away not winning.\"\nWest Brom have Bristol City and Coventry in their run-in and Wallace said: \"They are huge for us. We know how unpredictable the Championship is, especially at this time of the season.\n\"Our last three games are Derby, Cardiff and Luton who are obviously going to be fighting for their lives.\n\"I don't think being four or five points behind is dead and buried, there are probably seven or eight teams who probably feel like they can get in the play-offs, we want to be one of them.\"", "url": "https://www.bbc.com/sport/football/articles/cj9endzn82mo"}