{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:56:20", "date_modify": "2025-05-20 13:56:20", "date_publish": "2023-07-31 09:55:27", "description": "Jersey Bulls boss Gary Freeman says his side are aiming for promotion as they prepare for the start of their new season.", "filename": "sport_football_66359788_1747749380.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/16336/production/_126343909_lornebickley2_creditbulls-abitopley.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66359788_1747749380.html", "title": "Jersey Bulls are aiming for promotion says boss Gary Freeman", "title_page": "Jersey Bulls are aiming for promotion says boss Gary Freeman - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jersey Bulls boss Gary Freeman says his side are aiming for promotion.\nThe islanders have come close to getting out of the Combined Counties League Premier Division South in the past two seasons - finishing third last season and fourth in 2021-22.\n\"We want to be as competitive as possible,\" Freeman told BBC Jersey.\n\"I think there's no doubt we're capable of getting promotion, but there's probably five or six teams all saying the same thing.\"\nThe bulk of the Bulls' side have had a good summer helping Jersey's representative team win gold at the Island Games earlier this month as they prepare for their fifth season in the English football pyramid.\nTheir first two campaigns were cut short by the Covid-19 pandemic and the islanders eventually gained promotion after a league restructuring having won all 31 matches they had played in that time.\nIn their two seasons in the ninth tier of English football the islanders have been competitive, but have fallen short - they were 10 points off second place in 2021-22 and 15 points behind the promotion places last season.\nHaving faced Scottish League Two Stenhousemuir in a pre-season friendly at the weekend, Bulls face a tough-looking FA Cup tie at Sittingbourne on Saturday before beginning their league campaign at home to Tooting and Mitcham United a week later.\n\"That's what we're in it for, to get up to the next level, which would be great for everyone involved in the club who's worked so hard over the last couple of years,\" Freeman added.\n\"We're really looking forward to it. We keep saying it, we're learning as we go and we've had a couple of tough seasons where we've not quite got there, we got fourth and then third last year, we've just got to get that extra little bit this year.\n\"Everyone's really keen to push on, the players are certainly looking forward to the challenge ahead, there's a couple of clubs in our league with some quite big budgets, so we know there's going to be certain challenges.\n\"But I think we'll enjoy that a little bit. Rather than being the big day out for other teams we'd like to see that there's a few others in there that'll take points off each other and hopefully that'll make for a really competitive top end of the league.\"", "url": "https://www.bbc.com/sport/football/66359788"}