{"authors": ["Jess Anderson", "www.facebook.com"], "date_download": "2025-05-20 14:26:30", "date_modify": "2025-05-20 14:26:30", "date_publish": "2023-07-29 11:25:34", "description": "England overcome a nervy start to maintain a perfect record at this Netball World Cup with a 62-39 win over Malawi in Pool B.", "filename": "sport_netball_66348861_1747751190.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7F10/production/_130582523_nwc_1112.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_netball_66348861_1747751190.html", "title": "Netball World Cup 2023 results: England beat Malawi 62-39 in Pool B", "title_page": "Netball World Cup 2023 results: England beat Malawi 62-39 in Pool B - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England overcame a nervy start to keep up a perfect record at this Netball World Cup with a 62-39 win over Malawi.\nThe Roses, who were dominant in a 90-29 victory over Barbados in Friday's Pool B opener, took time to adjust to the step up in quality of opposition.\nAfter struggling to keep possession in a tight first quarter, they improved to pull ahead in Cape Town, South Africa.\nEngland face Scotland in their final Pool B match on Sunday already assured of their place in the next group phase.\nScotland, who earlier beat Barbados 53-44, will advance even if they lose to England should Barbados fail to beat Malawi.\nHowever, Wales suffered a second loss at the tournament, falling to a 75-40 defeat by Commonwealth Games silver medallists Jamaica in Pool C.\nIt was a 100th World Cup victory for England, who - as they did in their first match - used all 12 of their players as they seek to settle into the tournament before the bigger challenges ahead.\nHelen Housby enjoyed 100% shooting accuracy with 17 goals from 17 attempts but there were some flaws exposed in possession that coach Jess Thirlby will be keen to fix as soon as possible.\nAn injury to rising star Funmi Fadoju in the second quarter - the goal defence limping off with what looked like an ankle problem - had given England some worrying moments but she shook that off and later returned in the third quarter.\nEarlier on Saturday, defending champions New Zealand survived a scare, eventually edging a tight contest 54-44 over Uganda, whose unique style of play could cause upsets further into the tournament.\nMeanwhile, world number ones Australia cruised to another comfortable victory, showcasing their dominance by sweeping to a 85-38 win over Tonga, who have shot up the rankings in recent years.\nThe results put both sides on track to top their respective Pools in the tournament's preliminary group stage.\nAnother of the top teams, hosts South Africa, also recorded their second win of the tournament, beating Sri Lanka 87-32 in front of a packed arena of home fans and will face Jamaica on Sunday in an eye-catching fixture that will determine the winner of Pool C.", "url": "https://www.bbc.com/sport/netball/66348861"}