{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 08:15:19", "date_modify": "2025-04-26 08:15:19", "date_publish": "2025-02-26 10:54:07", "description": "Kate O'Connor and middle distance runner James Gormley are among four Northern Ireland athletes named on the Irish team for the European Indoor Championships.", "filename": "sport_athletics_articles_cly35p1356eo_1745655319.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/dc4a/live/d3dd8dc0-f42e-11ef-9822-d3d66c578726.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_athletics_articles_cly35p1356eo_1745655319.html", "title": "European Indoors: O'Connor and Gormley among four NI athletes in Ireland team", "title_page": "European Indoors: O'Connor and Gormley among four NI athletes in Ireland team - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Heptathlete Kate O'Connor and middle distance runner James Gormley are among four Northern Ireland athletes named on the Irish team for next month's European Indoor Championships in the Netherlands.\nCommonwealth Games silver medallist O'Connor will compete in the pentathlon after recently improving her Irish record to 4683 points which indicates that she could challenge for a podium spot in Apeldoorn from 6-9 March.\nGormley, 26, will be making his Ireland debut when he competes in the 3000m after switching allegiance from Great Britain in November.\nThe Sheffield native, who is attached to the Tyrone-based Carmen Runners club and will also be eligible to represent Northern Ireland, improved his 3000m indoor best to 7:40.72 in the US earlier this month which bettered Nick Griggs' previous Northern Ireland indoor record.\nGormley's 3:55.66 mile also in the US during the current indoor season also was a new Northern Ireland record while he clocked 3:53.69 for the mile outdoors last summer.\nDerry Track Club's Conor Kelly and North Down's Rachel McCann have been been named in Ireland's mixed 4x400m relay squad.\nKelly narrowly missed out on qualification for the individual 400m under the quota system after twice breaking the Irish under-20 record when clinching the national indoor title in Dublin over the weekend.\nIn addition to O'Connor, Ireland will have a number of other medal contenders.\nSarah Healy is currently second in the European 3000m rankings after producing a hugely impressive indoor season while Sarah Lavin will also have ambitions on securing a podium spot in the women's 60m hurdles.\nAfter breaking his own Irish indoors 800m record earlier this month, Letterkenny man Mark English will chase a fifth medal at European Championship level while fit-again Longford talent Cian McPhillips could also contend after clocking a big personal best of 1:45.33 in recent weeks.\nSharlene Mawdsley will be another Irish medal in the women's 400m while Andrew Coscoran has opted for the 3000m alongside Gormley despite breaking the long-standing Irish mile records held by Eamonn Coghlan and Ray Flynn earlier this month.\nBori Akinola earns selection in the 60m under the quota system after beating Israel Olatunde to win the Irish title on Sunday.\nIreland team\nSarah Lavin (60H), Sharlene Mawdsley (400m, 4x400m relay, 4x400m mixed relay), Lauren Cadden (400m, 4x400m relay), Phil Healy (4x400m relay, M 4x400m), Rachel McCann (4x400m relay, M 4x400m), Cliodhna Manning (4x400m relay), Arlene Crossan (4x400m relay), Sarah Healy (3000m), Jodie McCann (3000m), Kate O'Connor (Pentathlon), Bori Akinola (60m), Mark English (800m), Cian McPhillips (800m), Cathal Doyle (1500m), Andrew Coscoran (3000m), James Gormley (3000m), Conor Kelly (M 4x400m mixed relay), David Bosch (M 4x400m), Marcus Lawler (M 4x400m).", "url": "https://www.bbc.co.uk/sport/athletics/articles/cly35p1356eo"}