{"authors": ["Opta's Harvey Downes", "www.facebook.com"], "date_download": "2025-05-20 12:35:11", "date_modify": "2025-05-20 12:35:11", "date_publish": "2023-08-04 08:04:19", "description": "A statistical look into whether anybody can stop Manchester City winning yet another Premier League title this season.", "filename": "sport_football_66360425_1747744511.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/F65D/production/_130596036_gettyimages-1497975516-1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66360425_1747744511.html", "title": "Manchester City: Can Arsenal, Liverpool, Man Utd or anybody stop the champions?", "title_page": "Manchester City: Can Arsenal, Liverpool, Man Utd or anybody stop the champions? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester United's treble winners (1998-99), Arsenal's Invincibles (2003-04), Leicester's miracle makers (2015-16) and now Manchester City's treble winners (2022-23). Feats that will endure the test of time.\nSeasons like this don't come around often but, when they do, the 'best team of the Premier League era' debate resurfaces.\nSeason on season, City continue to break records and rewrite the history books under Pep Guardiola. Their Champions League triumph was the final piece of their Treble-winning jigsaw, laying to rest their European hoodoo by winning a trophy that had eluded them for so long.\nDespite clinching the league title with three games to spare, City trailed Arsenal for much of the season, spending just 42 days at the summit, with only two teams spending fewer days on top in a Premier League title-winning campaign.\nFollowing defeat by Tottenham in February, City turned on the afterburners, winning 12 successive games and eventually overtaking the Gunners, which saw manager Guardiola clinch his 11th title in his 14th season as a top-flight coach.\nGuardiola's class of 2022-23 had the perfect blend of physicality, technical security and of course, Erling Haaland, whose introduction saw City switch from a false nine style centre forward to a low-touch goalscoring machine.\nStriker Haaland set new records for most goals by a Premier League player in all competitions in a single season (52) and most goals in a single Premier League campaign (36).\nHe needed just 23 touches on average for every league goal last term, scoring as many hat-tricks in all competitions (six) as all other Premier League players combined. His physical presence offered a new dimension to City's build-up, giving them the option to go more direct, used in great effect in both games against title rivals Arsenal.\nEleven of Haaland's 52 goals were assisted by midfielder Kevin de Bruyne, with the two forming a formidable partnership from the offset, the latter racking up a seasonal-high 28 assists in all competitions.\nHaving won five of the past six top-flight titles on offer, including each of the past three, unsurprisingly City are favourites in 2023-24, with Opta's predictor model having them at 90.3% to lift the trophy. So, the question remains, with all their fire power, can City be stopped from winning a record fourth consecutive top-flight title?\nArsenal will look back on 2022-23 as both a missed opportunity and a sign of significant progress under manager Mikel Arteta. Despite occupying top spot for a record number of days in a top-flight season without actually winning the title, the Gunners exceeded expectations, posting their highest points tally since the Invincibles in 2003-04.\nA combination of different factors led to the unravelling of Arsenal's title challenge last season, with William Saliba's untimely injury and a lack of quality depth outside of the favoured starting XI proving costly. As a result, Arteta and Arsenal sporting director Edu have attacked this summer's transfer window with real intent, getting the bulk of their business done early, addressing key positions with the impressive signings of Kai Havertz, Jurrien Timber and Declan Rice.\nThe importance of getting off to a fast start cannot be underestimated. The Gunners won nine of their first 10 games last season, laying the foundations for their title charge.\nUsing Opta's power rankings, we're able to assess the difficulty of each side's start to the campaign. The Gunners open the season with games against Nottingham Forest, Crystal Palace, Fulham, Manchester United and Everton, the fifth-easiest start with an average opponent ranking of 57.4 over the first five games, giving cause to be optimistic that they will start as well as last season.\nCan anyone stop City? A question only Liverpool have been able to find the answer to in recent years. To reach 92-plus points in three of the past five campaigns, as they have, and only have one title to show for it emphasizes how high City continue to set the bar.\nGuardiola and Liverpool boss Jurgen Klopp have produced some of the most exciting, high quality title races in recent times and Liverpool's experiences in pushing City all the way see them as second favourites heading in to 2023-24 with Opta's predictor, giving them a 5.2% probability of pipping City to the title.\nIt could be a season of transition for Liverpool, however. Following the departure of captain Jordan Henderson and with Fabinho expected to leave, their new-look midfield consisting of Alexis Mac Allister and Dominik Szoboszlai will need to hit the ground running if they are to keep pace from the outset.\nUnited followed up their Treble-winning season by retaining the Premier League in 1999-2000. How will Manchester City follow up their Treble? There's no telling what effect a 61-game season last time out may have had on City's players coming into 2023-24. Rivals can only hope for a Jack Grealish-style hangover to carry into next season.\nCity's spine (Ederson, Rodri and Haaland) played more than 80% of Premier League minutes last season, contributing significantly to their success. In all competitions, only three outfielders managed more minutes for a big five European league side than Rodri (4,478) who was central to Guardiola's plans.\nEvery team has its own life cycle, and a number of City's influential players are either approaching the end or have passed their 'peak years'. Following the departures of Ilkay Gundogan and Riyad Mahrez, there are a number of other potential outgoings on the cards that could result in Guardiola overseeing his biggest rebuild at City to date.", "url": "https://www.bbc.com/sport/football/66360425"}