{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:04:49", "date_modify": "2025-05-19 15:04:49", "date_publish": "2015-02-16 17:42:49", "description": "Darren Bent scores his sixth goal in as many matches as Derby County fight back from 3-1 down to draw at Rotherham United.", "filename": "sport_football_31423287_1747667089.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81074000/jpg/_81074695_darren_bent_getty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31423287_1747667089.html", "title": "Rotherham United 3-3 Derby County", "title_page": "Rotherham United 3-3 Derby County - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Derby missed the chance to go top of the Championship as they battled from two goals down to draw at struggling Rotherham.\nMidfielder Paul Green scored against his former club to put the Millers ahead from close range before Tom Ince curled in a fine equaliser.\nGoals from Richie Smallwood and Matt Derbyshire put the hosts 3-1 up.\nBut Ince added his second before Darren Bent tucked the ball home after good work from winger Jesse Lingard.\nIt was Bent's sixth goal in as many matches since joining the Rams on loan from Aston Villa.\nSteve McClaren's side would have moved above Championship leaders Bournemouth with victory, while the 20th-placed Millers are battling to avoid an instant return to League One.\nWhen Smallwood whipped in a free-kick and Derbyshire sent a low shot under Lee Grant within five second-half minutes, Derby looked to be heading for defeat.\nBut Ince dragged the Rams back into the match when he capped a counter-attack by converting from Craig Forsyth's cross for his fourth goal in three matches.\nBent made sure McClaren's team did not leave empty-handed when he scored from close range with seven minutes left. They remain second, behind Bournemouth on goal difference.\nDerby boss Steve McClaren:\n\"That could turn out to be one of the most valuable points we get.\n\"Not just the point, not losing, but the manner in which we came back in the last half hour.\"\nRotherham boss Steve Evans:\n\"What an advert for Rotherham United being (in) the Championship.\n\"There's tinges of great disappointment being 3-1 up. We got a point but we have come across the best team and manager in the division.\"", "url": "https://www.bbc.com/sport/football/31423287"}