{"authors": ["Tom Brown", "www.facebook.com"], "date_download": "2025-05-19 14:42:05", "date_modify": "2025-05-19 14:42:05", "date_publish": "2017-08-24 20:30:22", "description": "BBC Wales charts the route Tahnee Seagrave is on as she targets winning the World Mountain Bike crown.", "filename": "sport_wales_41043413_1747665725.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/F5D4/production/_97523926_tahnee_seagrave_getty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_wales_41043413_1747665725.html", "title": "From Croydon to a world downhill mountain bike title via Wales?", "title_page": "From Croydon to a world downhill mountain bike title via Wales? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "She was born in Croydon, spent a decade in the French Alps and now lives in rural Wales.\nJust like the reigning downhill mountain bike world champion Rachel Atherton, Tahnee Seagrave has found the Welsh hills offer the perfect training.\nThe 22-year-old, who won the junior World Championships in 2013, is having a breakthrough season on the elite downhill circuit.\nShe won her first World Cup in Austria in June, before following it up with a second in Canada in early August.\n\"I moved to Wales about three years ago. Obviously you can't do much riding in the Alps in the winter!,\" she tells BBC Wales Sport.\n\"Mountain biking is a bit bigger here than in other places. There's such a good group of UK riders [in Wales] and we all thrive off of it.\"\nParked next to the Seagrave family home is a camper van. The initials 'F.M.D.' plastered on the side stand for 'Follow My Dream', the team set up by her father, Tony, in 2009 to support her in her goal of becoming world champion.\nTony drives the camper to the European World Cups and worked tirelessly to get his daughter her first mountain bike and sponsors.\n\"Dad's always said that there's not much support for females in the downhill [mountain bike] industry,\" says Tahnee.\n\"There aren't loads of riders at this level and he just thought it'd be the best way to come through as a rider - and he wasn't wrong.\"\nThere's also another Seagrave on the team - Tahnee's younger brother Kaos races on the junior downhill circuit.\nBack in 2004, a nine-year-old Tahnee Seagrave watched Vanessa Quin win the downhill mountain bike World Championships just minutes from their home in France.\nSince then she's wanted to do the same. But she describes her rise in the sport as a 'slow progression'.\n\"I never won anything when I was younger. I always quite far behind,\" she admits. \"But I could see my time getting closer and closer to the person who was always beating me.\n\"So that was a nice feeling and I just kept going from there.\"\nThat offers an insight into the determination behind Seagrave's eyes. Which, off the bike, she has no problem surrounding in mascara.\n\"I do like the fact we are women doing this gnarly bike stuff,\" she says.\n\"I love doing girly girl stuff. I love going shopping, I love going to the spa and getting my nails done.\n\"But at the same time I love doing a jump that boys can't do.\"\nThe third elite female rider in the British World Championships team was Manon Carpenter.\nBut the 24-year-old from Caerphilly recently announced her retirement, citing concerns over the consequences of crashing.\nSpeaking before Carpenter's decision, Seagrave admitted she finds it an unnerving sport at times.\n\"I still get so scared,\" she admits. \"I go down these horrible paths in my mind and you start thinking badly. What if I end up in hospital? What if I break my neck?\n\"But the feeling when you actually do it makes yourself proud. You have that fear and then conquer it. There's no better feeling.\"\nThe 2017 UCI Mountain Bike World Championships take place in Cairns, Australia from 5-10 September.", "url": "https://www.bbc.com/sport/wales/41043413"}