{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 08:00:03", "date_modify": "2025-05-21 08:00:03", "date_publish": "2024-12-23 10:29:53", "description": "Ireland and Leinster centre Robbie Henshaw signs a two-year contract extension with the IRFU until the 2027/28 season.", "filename": "sport_articles_ce8xnkvyjvzo_1747814403.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d748/live/456fb7a0-c118-11ef-b76e-9de78285d5f5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_ce8xnkvyjvzo_1747814403.html", "title": "Robbie Henshaw: Ireland and Leinster centre signs new IRFU deal", "title_page": "Robbie Henshaw: Ireland and Leinster centre signs new IRFU deal - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ireland and Leinster centre Robbie Henshaw has signed a two-year contract extension with the IRFU until the 2027-28 season.\nThe 31-year-old is one of five players alongside Conor Murray, Cian Healy, Iain Henderson and Peter O'Mahony to have won five Six Nations titles with Ireland.\nHenshaw has won 77 Test caps in green since making his debut against USA in 2013, scoring 10 tries in that time.\nHe started all three Tests for the British and Irish Lions on their 2021 tour to South Africa and has played 95 times for Leinster, scoring 100 points.\n\"It is a great boost to secure my long-term future with the IRFU and I am delighted to get this deal concluded ahead of a busy period - it is a huge privilege to play rugby in Ireland because we are so well looked after, from coaching, facilities, sports science and player management perspectives,\" said Henshaw.\n\"It's also an incredibly competitive place to play rugby, and, even though we have enjoyed some success in recent years, there is great hunger within Irish Rugby to continue driving forward. I believe that my best days are to come and I am excited to continue my journey here in Ireland.\"\nIRFU performance director David Humphreys praised Henshaw's contribution to Ireland stretching over a decade.\n\"Since breaking into the senior international squad 11 years ago, Robbie has been a consistent presence in one of the most competition areas of the Irish backline. Robbie is a consummate professional and a popular figure who continues to set the bar high.\n\"His performances during the recent Autumn Nations Series suggest that there is even more to come and I am delighted that he will continue his playing career here in Ireland and with Leinster.\"", "url": "https://www.bbc.com/sport/articles/ce8xnkvyjvzo"}