{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:46:08", "date_modify": "2025-05-21 04:46:08", "date_publish": "2025-01-14 23:51:35", "description": "Nottingham Forest 1-1 Liverpool: 'Second half was like a ping pong match' - Nuno reacts to draw", "filename": "sport_football_articles_cd0jg05ev2xo_1747802768.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e4d6/live/567fdcc0-d2d2-11ef-86e4-31e50b6c5341.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cd0jg05ev2xo_1747802768.html", "title": "'Second half was like a ping pong match'", "title_page": "Nottingham Forest 1-1 Liverpool: 'Second half was like a ping pong match' - Nuno reacts to draw - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Nottingham Forest manager Nuno Espirito Santo, talking to TNT Sports: \"It was a good game. It was entertaining.\n\"First half I think we were organised and didn't allow too many situations. The second half was like ping pong and that is when Liverpool become stronger, when they have space and with the speed and talent they have it is very dangerous.\n\"I am very proud of the team for the way they worked and ran, especially up and down and the sprints to recover and the desire to attack.\"\nOn Chris Wood's goal: \"It was a beautiful finish. It was clinical. It was good.\"\nOn the equaliser: \"When Liverpool made the changes, we were also about to make a change. Credit to Liverpool, they had a lot of chances.\"\nOn Matz Sels: \"He is in a good moment. He is full of confidence and he is keeping us in games. We are very thankful.\"\nOn the support: \"It is amazing. Today they helped us defend. We didn't have the ball for so much time and they kept supporting us realising how tough the opponent is. The support in the last seven minutes felt like they were giving extra runs to our players.\"", "url": "https://www.bbc.com/sport/football/articles/cd0jg05ev2xo"}