{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:44:31", "date_modify": "2025-05-21 06:44:31", "date_publish": "2025-01-04 12:03:08", "description": "Hull City forward Abu Kamara apologises to fans after posting a congratulatory message on Championship rivals' Portsmouth's social media.", "filename": "sport_football_articles_cz6lz42j066o_1747809871.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1b45/live/c7654630-ca8c-11ef-9bc2-7be38881685f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cz6lz42j066o_1747809871.html", "title": "Abu Kamara: Hull City forward apologies for social media post", "title_page": "Abu Kamara: Hull City forward apologies for social media post - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Hull City forward Abu Kamara has apologised for the timing of a social media post on Championship rivals' Portsmouth's Instagram account.\nThe 21-year-old, who spent last season on loan with Pompey, posted emojis on the Fratton Park club's social media following their New Year's Day win over Swansea.\nThat came after he had been criticised by some fans for his part in the lead-up to Middlesbrough's winning goal in injury time against the Tigers on the same day.\n\"It was just to congratulate my friend who scored his first goal in the Championship, there was no malicious intent with it,\" Kamara told BBC Radio Humberside.\n\"I do realise it was wrong timing and I made a mistake so I apologise if I've made anyone feel annoyed.\"\nKamara has made 17 league appearances for Hull City this season after making the move from Norwich City in the summer, and head coach Ruben Selles says there will be consequences for the player.\n\"Abu knows it was bad timing and we've talked to him and the group about it but the main thing for me is we can all make mistakes and understand the situation from both sides,\" said Selles.\n\"We will analyse it and do our thing internally.\"", "url": "https://www.bbc.com/sport/football/articles/cz6lz42j066o"}