{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:25:28", "date_modify": "2025-05-21 07:25:28", "date_publish": "2025-03-28 14:51:11", "description": "Osasuna launch an appeal to the Royal Spanish Football Federation, claiming Barcelona defender Inigo Martinez was ineligible to play against them.", "filename": "sport_football_articles_cgq9q3je9nwo_1747812328.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6183/live/8d3b5b70-0be1-11f0-8ae9-2975efdc7f47.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cgq9q3je9nwo_1747812328.html", "title": "Osasuna claim Barcelona player was ineligible", "title_page": "Inigo Martinez: Osasuna claim Barcelona player was ineligible - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Osasuna have launched an appeal to the Royal Spanish Football Federation, claiming Barcelona defender Inigo Martinez was ineligible to play against them on Thursday.\nMartinez did not join up with the Spain squad for the recent international break because of a knee injury.\nFifa rules prohibit a player from playing for his club within five days - unless he has the national FA's permission - if he has not joined up with his country when called up.\nBarca's 3-0 win over Osasuna in La Liga, rearranged from 8 March after the death of club doctor Carles Minarro Garcia, came the day after the international window ended - and four days after Spain's Nations League match with the Netherlands.\nMartinez played the full 90 minutes against Osasuna.\nA club statement read: \"Club Atletico Osasuna believes that Inigo Martinez, whose absence from the Spanish national team was due to a medical leave, was not eligible to play in yesterday's match in accordance with Fifa regulations.\n\"In light of this, the Navarrese club has decided to file an appeal for improper fielding in defence of his rights, the fairness of the competition, and the equality of all participants.\"\nMeanwhile, Barcelona will be without midfielder Dani Olmo for three weeks with a right adductor injury sustained against Osasuna.\nThe 26-year-old, who played both games for Spain against the Dutch, scored a penalty in the 3-0 win but was replaced in the first half.\nBarcelona manager Hansi Flick had criticised the timing of the rescheduled match, with 27-goal Raphinha missing out after travelling back from Brazil duty.", "url": "https://www.bbc.com/sport/football/articles/cgq9q3je9nwo"}