{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:23:24", "date_modify": "2025-04-26 06:23:24", "date_publish": "2025-03-04 00:00:00", "description": "Leaders Walsall drop two more points as they are held to a draw by bottom side Carlisle United.", "filename": "sport_football_live_ce8mm4gj60et_1745648604.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_ce8mm4gj60et_1745648604.html", "title": "Carlisle United 1-1 Walsall: League Two leaders draw with bottom side", "title_page": "Carlisle United 1-1 Walsall: League Two leaders draw with bottom side - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The points were shared between bottom-of-the-table Carlisle United and League Two leaders Walsall as the Saddlers gave up more ground at the top.\nWith Bradford City winning, Walsall's advantage is down to two points, having been 12 points in January, although the gap to the play-off spots is back up to 10 points.\nThey took an early lead through centre-half Taylor Allen, but Carlisle's Aaron Hayden equalised with a header.\nThe visitors had the better chances to take all three points but a combination of Gabe Breeze and the woodwork denied them.\nThe point makes it four games unbeaten for Mark Hughes' Blues, who remain three points adrift of safety.\nThe Saddlers have endured a very sticky run over the past two months, with only two wins from nine, but they had an ideal start.\nA corner was not properly cleared by the home side, Ryan Stirk worked it to the back post where Allen steered it confidently past keeper Breeze.\nCarlisle had struggled in that early period, operating with a back three, but as soon as Hughes switched to a four, they levelled when Hayden climbed highest from Elliot Embleton's corner.\nEmbleton could have put the Cumbrians ahead early in the second period after Tommy Simkin pushed a low cross back into his path, but the young goalkeeper recovered well to make a fine save.\nFrom there, Walsall took over and had a series of chances which all fell to Charlie Lakin.\nHe shot wide after bursting from midfield and breaking the offside trap, was unlucky to see another effort crash off the post, and dragged a third shot just wide of the far post.\nJamie Jellis, meanwhile, brought a fine save out of Breeze with a free-kick that was destined for the near post.\nSaddlers defender Oisin McEntee failed to beat Breeze with a header in injury time and Carlisle almost snatched it at the other end.\nThis result at least keeps Carlisle's mini momentum going under Hughes as they try to claw their way out of relegation trouble.\nCarlisle United head coach Mark Hughes told BBC Radio Cumbria:\n\"After conceding so early, you worry that it's going to be a difficult evening.\n\"But we showed great character to come back with a great goal from Aaron and, from that, it was pretty even.\n\"We could have won it, they could have won it, but we were very much in the game.\n\"But overall the momentum is building - four games unbeaten and not too many teams at the bottom of the league can do that.\"\nWalsall head coach Mat Sadler told BBC WM:\n\"We should have won it. We started unbelievably well, first 15, 20 minutes, until they changed their shape.\n\"Their goal was disappointing to concede from a set-piece, and from then it became a battle.\n\"But an important point I feel. The second half I thought we were brilliant. I thought we played very well, we got our legs into the game and started to run all over them. You felt like a goal was coming.\n\"But a point away is never a bad thing. It moves us forward on our points total and onto the next one, but most importantly I thought we played well.\"", "url": "https://www.bbc.co.uk/sport/football/live/ce8mm4gj60et"}