{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:15:35", "date_modify": "2025-05-21 04:15:35", "date_publish": "2025-04-05 19:06:34", "description": "Reaction from Jim Magilton and Jim Ervin after Cliftonville beat Ballymena United 5-0 at Solitude.", "filename": "sport_articles_cx27jln84kzo_1747800935.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4e09/live/ff5639d0-1250-11f0-a75c-b716eb718e3b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cx27jln84kzo_1747800935.html", "title": "Magilton praises 'clinical' Reds in home win - reaction", "title_page": "Irish Premiership: Jim Magilton praises 'clinical' Reds in home win - reaction - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "After Cliftonville recorded a thumping 5-0 victory over Ballymena United at Solitude BBC Sport NI got the opinions of Reds boss Jim Magilton and Sky Blues manager Jim Ervin.\nMagilton on the ruthless nature of the win: \"Our record against Ballymena this year was played four, lost four so today was important to build momentum and it was an indication of the appetite the players have to win. First half I was slightly disappointed we weren't more clinical. Second half was different we were really clinical.\"\nOn finishing the season strongly ahead of the Irish Cup final: \"The Irish Cup is secondary at the minute it is about winning league games and building consistency. We are on a run now which is important and there is competition for places. We have to finish with a real flourish and go galloping into an Irish Cup final.\"\nErvin on the defeat: \"It was extremely poor. Second half, we absolutely fell to pieces. The last 15 minutes, for whatever reason, we gave up. At 2-0 you're still in the game but the goals we conceded in the last 15 minutes were so soft. It's a game we'll want to forget but we need to look at.\"", "url": "https://www.bbc.com/sport/articles/cx27jln84kzo"}