{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:49:42", "date_modify": "2025-05-21 06:49:42", "date_publish": "2025-01-31 06:16:04", "description": "France or Ireland to win the Six Nations? What about England, Scotland and Wales' chances? Our BBC Radio 5 Live pundits make their predictions.", "filename": "sport_rugby-union_articles_c0k5nyk4p44o_1747810182.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2b4a/live/b698d350-df3e-11ef-a819-277e390a7a08.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c0k5nyk4p44o_1747810182.html", "title": "Six Nations 2025: Pundit predictions on potential winners, star players and Lions bolters", "title_page": "Six Nations 2025: Pundit predictions on potential winners, star players and Lions bolters - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Trying to predict a Six Nations champion used to be a flip of a coin.\nHowever, Ireland have dominated over the past two years and are seeking to become the first men's side to win three successive Six Nations titles.\nBut will Ireland head coach Andy Farrell's departure to lead the British and Irish Lions derail that run?\nDoes the return of Antoine Dupont make France favourites? Can England stake a claim after tight losses in November? Or will Scotland finally win their first Six Nations title?\nEnding a 12-match losing streak will be Wales' number-one goal, but will it be a positive campaign? Will Italy continue to cause upsets?\nOur BBC Radio 5 Live pundits had a punt at trying to predict this year's champions, and also gave predications on all things Six Nations, including potential Lions bolters and top try-scorers.\nIn a major boost for France, captain Dupont, who missed last year's championship to focus on winning Olympic sevens gold, and influential fly-half Romain Ntamack are both back to lead their team's title challenge.\nFormer Wales international Philippa Tuttiett believes the return of the 2022 Grand Slam-winning half-backs makes France favourites.\n\"Out of 19 Six Nations games Dupont and Ntamack have started together, the pair have won 16 matches,\" she told BBC Sport. \"That stat alone puts France as leading contenders for me.\"\nSimon Easterby steps up to replace Farrell after a mixed Autumn Nations Series campaign in which Ireland were defeated by New Zealand.\nFormer Ireland wing Shane Horgan told BBC Sport: \"Losing Farrell will have an impact, but how much we are not sure. Simon Easterby has been around the team for a very long time and is very capable, but there are going to be difficult selection headaches that Ireland haven't had in a while.\n\"Although Ireland are going for three in a row, I think France will win the Six Nations. Dupont proved he is not just the talisman but the glue that combines that France team together.\n\"Their challenges are big games away to Ireland and England. Will they achieve the Grand Slam? I think that may be a bridge too far.\"\nIn November, England suffered narrow defeats by Australia and New Zealand, having led those matches heading into the closing stages.\nThey last won the Six Nations in 2020 and head to Dublin to face champions Ireland on Saturday before hosting France at home.\nFormer England wing Ugo Monye told BBC Sport: \"England are at a stage now that they need to deliver a title. With the player pool, domestic game and finances, they have to do it.\n\"It is time that the team get a lot closer to their potential.\"\nThe loss of captain Sione Tuipulotu for the championship because of injury was a major blow for Scotland, who host Italy on Saturday.\nFormer Scotland international Johnnie Beattie told BBC Sport: \"This is the best Scottish side I've seen. It is the best-coached side and in terms of talent the best since they won the last Five Nations in 1999. However, other sides have a greater depth of talent.\n\"Tuipulotu has been our brightest spark over the last three years with the way he challenges the gainline physically and brings Huw Jones on to the ball with short passes.\n\"It will be a huge opportunity for Stafford McDowall, who operated at a high level in the autumn. He knows his role as it is similar to how Glasgow play.\n\"Success for Scotland would be a top-three finish.\"\nWales come into the tournament off the back of 12 successive defeats and only two wins from their past three Six Nations campaigns.\nWarren Gatland's side travel to Italy in round two which could offer the best opportunity to end their miserable run.\n\"Wales are going into this with a 'nothing to lose, just give it everything' approach. The worst happened last year,\" Tuttiett added.\n\"There are positives with the domestic game - Scarlets, Cardiff and Ospreys have all shown improvements. I do feel we will see improved performances for Wales but I'm not sure they will be enough to get wins.\n\"Italy are evolving every year and we are no longer surprised at the big scalps they are taking, with most of their squad coming from Benetton, a team that has beaten top sides such as La Rochelle and Bath.\"\nMax Llewellyn\nGloucester centre Llewellyn, 26, was left out of Wales' Six Nations squad, but with seven Premiership tries this season and three starts in the autumn Tests, Tuttiett believes he could still be a potential Lions bolter.\n\"His omission left many fans baffled in Wales,\" she said. \"As much as the Six Nations is a shop window for Farrell, he will be well aware of Max's potential.\"\nRyan Baird\nThe 25-year-old starts for Ireland on Saturday at blind-side flanker and will look to show off his impressive athletic ability.\n\"Ryan Baird has extraordinary talent that will serve the Lions well,\" Horgan said. \"He must deliver this Six Nations to be in the conversation.\"\nSam Prendergast\nMonye reckons a big tournament for Ireland fly-half Prendergast would put him in the mix as a Lions bolter. The 21-year-old starts against England in Dublin.\nJonny Gray\nGray, 30, missed the 2023-24 season through injury but is playing well for Top 14 league leaders Bordeaux-Begles and starts against Italy in what will be his first Scotland cap since 2023.\n\"After pretty much two years out of the game he has come back this year for Bordeaux and been just incessant in the way he plays the game,\" Beattie said. \"He doesn't miss tackles and is always in the game.\"\nSam Prendergast\n\"I can't wait to see how Sam Prendergast goes. He has been earmarked from a very early age,\" Horgan said.\n\"An exceptional talent who takes the ball to the line and runs the team very well.\"\nTom Rogers\nWales wing Rogers, 26, impressed against Australia in November and has looked sharp for Scarlets in the United Rugby Championship (URC).\n\"He's a player who can cover the back three, is so exciting and has really matured his play with Scarlets,\" Tuttiett said.\nCadan Murley\nMonye played his club rugby - like Murley - on the wing for Harlequins and thinks the 25-year-old will impress on his England debut against Ireland.\n\"I made my Six Nations debut in 2009 and what a privilege that was. I am really excited to see how he gets on,\" said Monye.\nDarcy Graham\nBeattie's choice is Scotland flyer Graham, who with 29 tries is one behind Van der Merwe in Scotland's all-time try-scoring list.\n\"Graham is absolutely electric on the wing and has the ability to beat a player. A tremendous runner to watch,\" Beattie said.", "url": "https://www.bbc.com/sport/rugby-union/articles/c0k5nyk4p44o"}