{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:49:57", "date_modify": "2025-05-21 05:49:57", "date_publish": "2025-01-31 15:55:13", "description": "Plymouth Argyle sign Bosnia international defender Nikola Katic on loan from Zurich until the end of the season.", "filename": "sport_football_articles_cvg4klnj4kro_1747806597.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9166/live/3e1e6c90-dfe9-11ef-be6c-9f3ec92972af.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cvg4klnj4kro_1747806597.html", "title": "Nikola Katic: Plymouth Argyle sign Bosnia defender on loan", "title_page": "Nikola Katic: Plymouth Argyle sign Bosnia defender on loan - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Plymouth Argyle have signed Bosnia international defender Nikola Katic on loan from Zurich until the end of the season.\nThe 28-year-old follows Maksym Talovierov after the Ukraine centre-back joined the Pilgrims for a club-record fee earlier on Friday.\nKatic has won six caps for his country and previously played for Rangers as well as Hajduk Split and Slaven Belupo.\nHe adds further help to a defence which has conceded the most goals in the Championship this season, and has been hit by losing Brendan Galloway for the season and Lewis Gibson to Preston North End earlier this month.\n\"Nikola joins us with excellent pedigree having represented his country and played European football,\" head coach Miron Muslic told the club website, external.\n\"He will add further height and defensive strength to our options but most of all showed a real desire to be a part of Argyle for the rest of the season.\n\"I have said before that I want players in the squad who want to be here, and Nikola showed exactly that.\"\nArgyle head of recruitment Jimmy Dickinson added: \"We have assessed options that fit the way Miron wants to play, and we are really pleased to bring Nikola in.\n\"Having added Maksym and Nikola today, we have added two defenders with international pedigree, and both will bolster the squad significantly as we head into the rest of the season.\"\nKatic could make his Argyle debut against West Bromwich Albion on Saturday should his international clearance come through in time.", "url": "https://www.bbc.com/sport/football/articles/cvg4klnj4kro"}