{"authors": ["Katie Stafford", "www.facebook.com"], "date_download": "2025-05-21 06:17:21", "date_modify": "2025-05-21 06:17:21", "date_publish": "2025-03-31 08:20:08", "description": "Graham Potter press conference: Wolves vs West Ham", "filename": "sport_football_articles_c8rgx7l6n4eo_1747808241.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/414f/live/cdf05660-d19f-11ef-9fd6-0be88a764111.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c8rgx7l6n4eo_1747808241.html", "title": "Graham Potter press conference: Wolves vs West Ham", "title_page": "Graham Potter press conference: Wolves vs West Ham - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "He said he has a \"relatively full squad\" but Crysencio Summerville remains sidelined through injury.\nForward Niclas Fullkrug is likely to travel after returning to training. Potter added: \"He hasn't played competitive football in a while and has had a fairly significant injury, so we will have to build his minutes up.\"\nHe said \"it is always good for our players to represent their country\" and captain Jarrod Bowen \"has come back in a good place\" after his first camp under England boss Thomas Tuchel.\nOn the two-week break: \"There's nothing you can do about the schedule. You just have to hope the players who are away have a positive camp and you work hard with the ones who are here. It's a strange time, but the boys that have been here have worked well and we've used it well in having time to recover a bit and getting to spend time with the family while at the same time working, pushing hard and being ready for when the international boys returned.\"\nHe said he would like to improve West Ham's home record in the run-in as it helps \"to build that connection with the fans.\"\nOn Evan Ferguson scoring for Republic of Ireland: \"He's been doing a lot well. It was always going to be a bit of patience with him but going away, getting some minutes and scoring is great for a forward.\"\nIn response to some comments that his loan move has been 'a failure so far': \"From our perspective, that's unfair. You have to see the context of where he was and the minutes he's played previously. We got him at the early stages of that return to playing stage. To think you can just walk into a Premier League team and hit the ground running is difficult. We are happy with him. He is enjoying his time here and he is ready to help.\"", "url": "https://www.bbc.com/sport/football/articles/c8rgx7l6n4eo"}