{"authors": ["Emma Smith", "www.facebook.com"], "date_download": "2025-05-20 14:36:44", "date_modify": "2025-05-20 14:36:44", "date_publish": "2023-07-28 14:08:07", "description": "The group stages of the 2023 Fifa Women's World Cup have now concluded - and what an incredible opening it was... Here's what happened in each group.", "filename": "sport_football_66334546_1747751804.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2F1C/production/_130606021_whatsubject.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66334546_1747751804.html", "title": "Women's World Cup 2023: How the group stages in Australia & New Zealand panned out", "title_page": "Women's World Cup 2023: How the group stages in Australia & New Zealand panned out - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The group stages of the 2023 Fifa Women's World Cup have now concluded - and what an incredible opening to the tournament it was.\nAs ever at World Cups, the permutations as to who needed what were extensive and convoluted, in many cases going into the final round of games, with the fates of many teams also dependent on other results in their group.\nBBC Sport looks at how it all panned out...\nSwitzerland topped Group A as the only unbeaten side in the pool, with a goalless draw against co-hosts New Zealand securing their progress.\nFormer world champions Norway recovered from defeat at the hands of New Zealand in their opening game to advance in second place, beating debutants Philippines 6-0 in their final match.\nNew Zealand become the first Women's World Cup hosts to be eliminated at the group stage, while Philippines, who finished bottom, did pick up a win on their global tournament debut against the co-hosts.\nAustralia needed to beat Canada in their final group game to avoid following co-hosts New Zealand out at the earliest point and a first group-stage exit since 2003.\nNot only did they manage that but their 4-0 thrashing of the Olympic champions was enough for them to top the group.\nNigeria reached the knockouts for just the third time in nine attempts, although their goalless draw with the Republic of Ireland meant they had to settle for second place.\nCanada go out at the group stage for the first time since 2011, while a first Women's World Cup for the Republic ended with a solitary point.\nJapan topped Group C after thrashing Spain 4-0 in their final group match. Both sides had already qualified for the round of 16 by winning their opening two games.\nCosta Rica and Zambia were both eliminated heading into their meeting, which Zambia won 3-1 to seal a first World Cup victory in their tournament debut.\nNetherlands secured top spot in the group with a 7-0 thrashing of Vietnam, condemning reigning champions the USA to second place.\nThe USA were held to draws by both the Dutch and Portugal - and were lucky not to be beaten by the latter, who saw Ana Capeta hit the post in injury time in their final game.\nDebutants Portugal and Vietnam both exit their maiden tournaments at the group stage.\nFrance topped Group F with a 6-3 win over Panama, who had already been eliminated before their last group-stage match.\nWorld Cup greats Brazil started the round in third place and needed a win over Jamaica to progress, but the Reggae Girlz - ranked 35 places below the South Americans - held firm to earn a goalless draw and take themselves through to the last 16.\nIt's the first time in 28 years since Brazil, who have qualified for every tournament, have failed to get out of the group stages.\nGermany's failure to beat South Korea ensured Colombia topped Group H, despite losing to Morocco in their final first-round match.\nMorocco, having lost to the Germans 6-0 in their opening game, recovered with back-to-back 1-0 victories and become the only one of the eight debutants at the 2023 Fifa World Cup to qualify from their group.\nTwo-time world champions Germany failed to get out of their group for the first time in nine Women's World Cups, while South Korea finished bottom with a solitary point.", "url": "https://www.bbc.com/sport/football/66334546"}