{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:01:30", "date_modify": "2025-05-20 12:01:30", "date_publish": "2023-08-05 16:00:17", "description": "DIGIONLY", "filename": "sport_football_66385232_1747742490.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66385232_1747742490.html", "title": "Saturday's National League reports", "title_page": "Saturday's National League reports - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Aldershot Town 5-2 Oxford City\nLorent Tolaj scored a brace as Aldershot Town comprehensive beat National League newcomers Oxford City.\nJack Barham broke the deadlock in the 13th minute from close range before Josh Parker equalised midway through the first half.\nThe Shots regained the lead through Haji Mnoga following a corner just after the half-hour mark before Tolaj made it 3-1 - thanks to a Barham assist - in the eighth minute of first-half injury time.\nAldershot continued to dominate in the second half and debutant Josh Stokes put away a low cross from Barham to extend their score just two minutes after the restart.\nTolaj completed his double at the death as he put the score beyond doubt, while the visitors still had time to reduce the deficit as Parker added his second of the day in the seventh minute of added time.\nMatch report provided by PA Media.\nAltrincham 1-1 Dagenham & Redbridge\nHarry Phipps scored with a last-gasp injury-time header to salvage Dagenham & Redbridge a point from at Altrincham in the National League.\nMyles Weston hit the goal frame for the Daggers in the 24th minute and Altrincham came close to opening the scoring deep into first-half stoppage time as Chris Conn-Clarke's shot was deflected out for a corner.\nConn-Clarke came knocking again in the last 20 minutes but his attempt was kept out and Regan Linney skied the rebound.\nAltrincham finally got off the mark in the 79th minute after a touch from Dior Angus was pounced on by Conn-Clarke.\nBut Phipps met Josh Hare's corner to level the scores in the eighth minute of stoppage time.\nMatch report supplied by PA Media.\nBarnet 3-2 Hartlepool United\nBarnet held off a late fightback to edge a National League victory over Hartlepool in their season opener.\nThe home side took the lead midway through the first half as debutant Adebola Oluwo bundled the ball home after Harry Pritchard got a touch on a free-kick at the far post.\nHartlepool pressed for an equaliser as Chris Wreh and Josh Umerah tested Bees goalkeeper Laurie Walker before Tom Crawford fired over the crossbar, while Nicke Kabamba headed an effort wide at the other end.\nKabamba almost doubled Barnet's lead just before the break and he made his presence count at the start of the second half as the former Pools striker headed home at the far post.\nDanny Collinge netted another header as the hosts made it three, while Hartlepool struck twice in the closing minutes as Jake Hastie pulled one back before Umerah fired in the rebound after the visitors had a penalty saved in stoppage time.\nMatch report supplied by PA Media.\nChesterfield 4-3 Dorking Wanderers\nSubstitute Joe Quigley scored a dramatic late winner to spare Chesterfield's blushes as the National League promotion hopefuls came from behind to beat Dorking 4-3.\nPaul Cook's Spireites - who finished third last season - got their new campaign up and running as Ryan Colclough hammered home the opener in the 23rd minute.\nYet semi-professional Dorking were soon level as Jason Prior poked in a Josh Taylor cross.\nPrior then turned the tables on the hosts by firing the away side ahead from the penalty spot in the 52nd minute.\nParity was restored, however, when Colclough got down the left after the hour mark to pick out Liam Mandeville for a point-blank strike.\nSeven minutes from full-time, Mandeville sent the home fans into raptures with a fine free-kick.\nBut three minutes into 14 added on, Sebastian Bowerman turned home a cross for a dramatic late leveller.\nThere was of course plenty of time left for someone to win it and Quigley delivered a fantastic headed winner to seal all three points for Chesterfield.\nMatch report supplied by PA Media.\nFC Halifax Town 2-0 Bromley\nJack Evans scored on his debut as FC Halifax Town beat Bromley 2-0 in the National League.\nEvans' strike early in the second half was added to by Millenic Alli as last season's FA Trophy winners started their campaign in style.\nBromley, who reached the play-offs last term, were denied a first-half opener when home goalkeeper Sam Johnson parried Adam Marriott's shot and then brilliantly tipped over Jude Arthurs' follow-up.\nBut Halifax improved after half-time and almost took the lead when Ryan Galvin's left-wing cross was headed over by Robert Harker.\nAnd the opener came in the 53rd minute when Evans was played in by Galvin and confidently finished past Chelsea loanee Teddy Sharman-Lowe.\nAlli wrapped up victory with 16 minutes remaining by tapping in after being teed-up by Max Wright.\nMatch report provided by PA Media.\nGateshead 2-2 Boreham Wood\nA late leveller from Cameron Coxe earned 10-man Boreham Wood a 2-2 draw at Gateshead on the opening day of the new National League season.\nThe hosts broke the deadlock in the ninth minute through Marcus Dinanga before Jordan Hunter made it 2-0 six minutes later after Dinanga had seen his shot saved by visiting goalkeeper Nathan Ashmore.\nAshmore then produced a smart save in first-half stoppage time to prevent Dinanga from making it 3-0 from range.\nBoreham Wood flew out of the blocks in the second half and got a goal back through Kwesi Appiah in the 60th minute.\nTimmy Abraham was sent off for the visitors in the 84th minute but Coxe's volley in the third minute of added time saw the Wood leave with a point.\nMatch report supplied by PA Media.\nKidderminster Harriers 0-0 Woking\nKidderminster earned a point at home to Woking in their first National League match since 2016.\nHarriers won promotion last season in remarkable fashion following a run of nine successive wins and they marked their return to the higher level with a creditable goalless draw against a Woking side that finished fourth last time out.\nThe best chances of the first half at Aggborough came towards the end of the period, with Rhys Browne firing just wide for the visitors before Woking goalkeeper Will Jaaskelainen denied Christian Oxlade-Chamberlain with a fine save.\nJaaskelainen also did well on the hour mark as Harriers threatened again and, after the away side had gone close through Robbie Willmott and Scott Cuthbert, the promoted side almost snatched victory when Ashley Hemmings saw his stoppage-time effort hit the bar.\nMatch report supplied by PA Media.\nMaidenhead United 2-2 AFC Fylde\nAlex Whitmore headed a late equaliser as 10-man AFC Fylde salvaged a 2-2 draw at Maidenhead on their return to the National League.\nLast season's National League North champions went behind in the 12th minute when Reece Smith nicked the ball off a defender and slotted home.\nMaidenhead doubled their advantage seven minutes later as Emeka Obi diverted a cross into his own net.\nObi was denied at the other end with Craig Ross saving his close-range header before Fylde started their comeback in the 33rd minute courtesy of Nick Haughton.\nAshley Nathaniel-George hit the crossbar for Maidenhead, while Ross produced a brilliant close-range save to deny Jonathan Ustabasi.\nAfter Connor Barrett was sent off for Fylde late on for a reckless tackle on Smith, the visitors levelled thanks to Whitmore's header from a corner in added time and almost stole the points as Haughton's effort came back off the crossbar.\nMatch report supplied by PA Media.\nSolihull Moors 1-1 Eastleigh\nKyle Morrison's stoppage-time equaliser earned Solihull Moors a point at home against Eastleigh in their National League opener.\nAfter a pre-match tribute to late Moors chairman Trevor Stevens, it was the visitors who made the quickest start as Paul McCallum went close and Enzio Boldewijn struck a post.\nThe pair were then both denied by home keeper Tommy Simkin before Jamey Osborne and Josh Kelly tested Eastleigh's Joe McDonnell in a first half that finished goalless.\nBoldewijn headed Eastleigh in front 10 minutes after half-time from Charlie Carter's cross.\nKyle Morrison and Osborne went close to an equaliser and, although Moors had Nico Gordon sent off with a minute of the 90 remaining, Morrison struck in the four minutes into added time to salvage a point.\nMatch report supplied by PA Media.\nSouthend United 4-0 Oldham Athletic\nSouthend put their off-field issues aside as they battled to a surprising 4-0 victory over 10-man Oldham.\nShrimpers boss Kevin Maher was only able to register 15 players for their National League opener due to a transfer embargo that has been in place since September due to money owed to His Majesty's Revenue and Customs.\nBut they got off to a flying start when Callum Powell managed to squirm an effort in after Oldham struggled to clear their lines from a corner in the eighth minute.\nThe visitors were reduced to the 10 men in the 57th minute following Will Sutton's lunge at Nathan Ralph.\nOliver Coker scored just seconds after coming on as a substitute with an 83rd-minute strike from 25 yards before Dan Mooney added to their lead with a calm finish four minutes later.\nSouthend fans were in dreamland when Coker turned provider as Harry Cardwell nodded home in the sixth of 10 minutes added time for an ultimately convincing opening win.\nMatch report supplied by PA Media.\nWealdstone 2-1 York City\nWealdstone left it late to kick off their National League campaign with a 2-1 comeback win over 10-man York City.\nThe Minstermen started brightly as Maziar Kouhyar saw a shot blocked by Wealdstone defender Jack Cook before Dipo Akinyemi and Adam Crookes were denied from the subsequent corner.\nYork went ahead six minutes before the break when Levi Andoh's cross picked out Lenell John-Lewis, who teed up Akinyemi for a debut goal.\nMax Kretzschmar levelled from the penalty spot on the hour mark after Kouhyar was adjudged to have used his hand to block a shot.\nThe match took a decisive turn seven minutes from time when York defender Callum Howe saw red for bringing down Corie Andrews while he was clean through.\nIn the 88th minute, Kretzschmar set up Jaydn Mundle-Smith for the winner.\nMatch report supplied by PA Media.\nRochdale 0-1 Ebbsfleet United\nRochdale's first league match outside the English Football League for 102 years ended in an unceremonious home defeat by Ebbsfleet.\nLuke O'Neill's brilliant strike in the first half was enough for Fleet to take the points in the National League opener at Spotland.\nThe full-back met Toby Edser's corner with an audacious near-post flick that sailed into the far corner.\nRochdale almost got back into it as Kairo Mitchell thundered an effort against the crossbar, but Ebbsfleet also hit the woodwork at the death through Billy Clifford.\nReport supplied by PA Media.", "url": "https://www.bbc.com/sport/football/66385232"}