{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:17:38", "date_modify": "2025-05-21 06:17:38", "date_publish": "2024-12-26 00:00:00", "description": "Watch or listen to Open All Mics, follow commentary from Celtic Park plus live text updates as eight Scottish Premiership teams are in action.", "filename": "sport_football_live_c20wgv7lpjgt_1747808258.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c20wgv7lpjgt_1747808258.html", "title": "Scottish Premiership live coverage, stats & head-to-head", "title_page": "Scottish Premiership live coverage, stats & head-to-head - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Highlights - and one more game - to come\nScottish Premiership\nRemember, you'll be able to watch all of today's Boxing Day action on Sportscene later.\nThe BBC Scotland channel is where you need to be at 19:15 GMT. It will also be repeated just after midnight on BBC One Scotland.\nSeventeen goals across the five games so far, with one more on the way.\nThat final game takes place in Paisley, where St Mirren host Rangers. You can follow the action here.\nYou'll get more reaction, analysis and be able to give your views on all of today's action on our dedicated club pages throughout the evening.\n'Dons in freefall'\nFT: Kilmarnock 4-0 Aberdeen\nWillie Miller\nFormer Aberdeen captain on BBC Sportsound\nAberdeen have fallen off a cliff. They went from a side always managing to win games, or at least not lose games, to freefall.\nJimmy Thelin deserves a little bit of time to bring in his own players and turn things around again.\nIt is not a great situation to be in. It was an embarrassing result.\nCeltic juggernaut gathers more momentum\nFT: Celtic 4-0 Motherwell\nKheredine Idessane\nBBC Scotland at Celtic Park\nManager Brendan Rodgers wanted his team to show their clinical side and he wasn't disappointed.\nDespite a largely uninspiring first 45, the champions showed why they're so far clear at the top with a ruthless second-half display to blow their opponents away.\nTo have two wide players on 13 goals for the season shows just how dangerous this Celtic team can be. Daizen Maeda and substitute Nicolas Kuhn were both on the scoresheet again.\nThe daunting task facing Motherwell - and anyone else for that matter - was best exemplified when, at 3-0 up, Celtic went to the bench and brought on Kuhn, Kyogo and Reo Hatate, whose late goal was a thing of beauty in the build-up and excellence in the execution.\nCeltic are in a huge position of strength and, linked with a move to bring former star full-back Kieran Tierney back to Glasgow, appear to be approaching the impending transfer window with yet more ambition.\nCounty end long wait for away win\nFT: Dundee 0-3 Ross County.\nTyrone Smith\nBBC Sport Scotland at Dens Park\nRoss County's 15-month wait for an away league win is over. And in some style too.\nNot many people would have seen this result coming, but it has the feel of a huge one for the Staggies.\nOne swallow doesn't make a summer, but if they can continue to produce performances like this then manager Don Cowie will be confident his side can start to climb the table.\nDundee, meanwhile, must make sure they don't get sucked into things at the wrong end of the table after a day to forget.\nUnited flying and climbing table\nFT: St Johnstone 1-2 Dundee United\nMartin Dowden\nBBC Sport Scotland at McDiarmid Park\n'The table doesn't lie' is a term you often hear and for Dundee United it makes fabulous reading for them.\nJust short of halfway through their campaign, they are now up to fourth place and only six points adrift of an Aberdeen side who were out of sight early this season.\nMost assumed the Dons would comfortably have third place secured given where they were, but with the sides facing each other at Tannadice in their next fixture.\nEverything seems up for grabs and United are very much on the ascendency. They've shown a number of qualities since their Premiership return and required many of them here after falling behind.\nTheir response was emphatic and the travelling support absolutely loved it.\nFULL-TIME St Johnstone 1-2 Dundee United\nUnited's excellent campaign keeps on going. After trailing to Makenzie Kirk's goal at the end of the first half, the Tangerines turned it around brilliantly after the break.\nGlenn Middleton slammed in the equaliser from distance and then the league's top scorer Sam Dalby headed them in front.\nEven with Declan Gallagher's sending off on 87 minutes, they were able to see it out comfortably.\nIt sets up a brilliant game against Aberdeen at Tannadice in three days' time. They've got the struggling Dons in their sights.\nSt Johnstone offered nothing after the break and stay two points adrift at the bottom.\nGOAL! Kilmarnock 4-0 Aberdeen\nBruce Anderson\nThe ex-Dons striker makes it four at Rugby Park. Incredible.\nA whipped Liam Donnelly cross finds Innes Cameron at the back post, allowing the substitute to excellently guide his header back across the face of goal.\nBruce Anderson is ready to pounce, acrobatically thumping the ball into the back of the net to make it 4-0 to the home team.\nThere are also big celebrations from Anderson against his former club. Ruthless.", "url": "https://www.bbc.com/sport/football/live/c20wgv7lpjgt"}