{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:41:44", "date_modify": "2025-05-20 11:41:44", "date_publish": "2023-08-06 17:13:00", "description": "British number one Alfie Hewett drops just two games in a one-sided final to win the British Open wheelchair title for a second time.", "filename": "sport_disability-sport_66423682_1747741304.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/136A7/production/_130672597_gettyimages-1596476580.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_disability-sport_66423682_1747741304.html", "title": "Alfie Hewett: World number two beats Joachim Gerard to win second British Open wheelchair title", "title_page": "Alfie Hewett: World number two beats Joachim Gerard to win second British Open wheelchair title - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "British number one Alfie Hewett dropped just two games in a one-sided final to win the men's British Open Wheelchair Tennis Championships for a second time.\nHewett took just 51 minutes to beat Belgium's Joachim Gerard 6-0 6-2 in Nottingham on Sunday.\n\"The last three singles finals I've been in ended up on the wrong side, so it was nice to turn it around,\" said Wimbledon runner-up Hewett.\nHewett also claimed the men's doubles crown alongside partner Gordon Reid.\nThe duo, seeking a calendar doubles Grand Slam at the US Open later this year after triumphing at the Australian Open, French Open and Wimbledon, came from a set down to extend their winning streak to 27 matches.\nThe British pair beat Spain's Martin de la Puente and Argentina's Gustavo Fernandez 4-6 6-2 11-9 after two hours to win their 43rd title as a tandem.\n\"It's been an incredible summer,\" added Hewett, ranked second in the world in singles and first in doubles.\n\"Gordon and I have had quite a memorable one. I think it's going to be up there as one of the ones we look back on as one of those special years.\"\nIn the women's doubles final, Britain's Lucy Shuker and American partner Dana Mathewson lost 6-3 6-2 to Dutch top seeds Jiske Griffioen and Diede de Groot.\nDe Groot beat China's Zhenzhen Zhu 6-1 6-0 to win a fourth British Open women's singles title and a 79th career crown.", "url": "https://www.bbc.com/sport/disability-sport/66423682"}