{"authors": ["Emma Smith", "www.facebook.com"], "date_download": "2025-05-20 12:43:11", "date_modify": "2025-05-20 12:43:11", "date_publish": "2023-08-03 14:53:14", "description": "Morocco have reached the last 16 on their debut at the Fifa Women's World Cup, and their success in Australia and New Zealand is no accident, but the result of serious investment.", "filename": "sport_football_66398182_1747744991.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/15F75/production/_130637998_gettyimages-1589741653.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66398182_1747744991.html", "title": "2023 Women's World Cup: Morocco's 'explosion of joy' comes after years of work and investment", "title_page": "2023 Women's World Cup: Morocco's 'explosion of joy' comes after years of work and investment - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "After beating Colombia 1-0 thanks to Anissa Lahmari tucking home the rebound from Ghizlane Chebbak's missed penalty, the Morocco squad gathered around a phone in the centre circle at Perth Rectangular Stadium.\nThe players were watching the final seconds of Germany versus South Korea, knowing that if the two-time world champions failed to find a winner, Morocco themselves would progress at the Germans' expense.\nWhen the final whistle blew in Brisbane, confirming Germany had been held to a 1-1 draw and were out of the tournament, the Morocco celebrations began 2,680 miles away in Perth.\n\"We all came together, we had the phone and we were all praying,\" said Lahmari. \"Afterwards it was just an explosion of joy.\"\nMorocco are through to the last 16 at their first ever Women's World Cup. Of the eight debutants in Australia and New Zealand, they are the last women standing.\nIt follows the falsest of starts for the North Africans, who were thrashed 6-0 by Germany in their opening match.\nBut under the guidance of manager Reynald Pedros, they picked themselves up, tightened up and secured a pair of deserved one-goal victories over South Korea and Colombia to earn a knock-out meeting with France on 8 August in Adelaide.\nFor Morocco, this success is the result of years of investment in women's football which puts several of the other nations at this tournament to shame.\nSince 2009, when Morocco's new football academy was opened with the aim of producing international quality footballers of all genders, the country - led by football-mad King Mohammed VI - has placed heavy focus on the women's game.\nIn 2019 the $65m King Mohammed VI Training Complex opened near the capital city, Rabat, which is home to both the men's and women's international teams at senior and junior level. It includes eight full-size pitches, futsal and beach pitches, gym and medical facilities, an Olympic-sized swimming pool, classrooms and a 5-star hotel.\nIn August 2020, the National Women's League became professional. To achieve these aims, the annual budget for women's football rose to $65m - a tenfold increase.\n\"We are so proud of what we managed to do,\" Lahmari said after the win over Colombia. \"Emotions are running high. We are delighted, and dedicating this win to the people of Morocco and the King.\"\nThis is Morocco's latest step in becoming a global football force, following the extraordinary achievements of the men's team in Qatar last year.\nHaving reached the semi-finals of the 2022 World Cup with their men's team, Morocco are the second African nation to reach the knockout stages of successive men's and women's World Cups, after Nigeria in 1998 (men's) and 1999 (women's).\nJust as the men took historic steps in Qatar - they were the first African side to reach a World Cup semi-final - so have Morocco in setting up their meeting with France.\nBut Pedros, while proud of what this achievement means for the country, is not satisfied yet.\n\"The women's team is being showcased for Moroccans back home. It is beautiful\", he said.\n\"All these players are proud to put on that jersey. They are doubling their efforts because they love their country and their efforts are being paid off.\n\"We are not going to stop here - we need to see progression. Everything is there for the taking.\"\nThe game against France also produces a remarkable dynamic among the two managers. Pedros is French, while France manager Herve Renard coached the Morocco men's team at the 2018 World Cup.\n\"It is very special because it is France next,\" said Pedros. \"I know the French team very well, maybe this will help but it is a strong team with high level players.\n\"It will be a very difficult game to play, but if we keep the same mindset we are hopeful we can go further.\n\"We will do everything to go to the next stage - our goal is not to stop now, we need to go further. We will celebrate a little bit then go to Adelaide tomorrow and work again.\"\nNo matter what Morocco do next, they have played a huge part in the most upset-packed Women's World Cup ever.\nThree of the top 10 sides in Fifa's rankings - Germany, Canada and Brazil - have gone out in the group stage, while six sides outside the top 20 - including Morocco - have progressed to the second round.\n\"This World Cup is incredible! So many great games - this is what sport is about. Nothing is written and now we are part of that chapter,\" said Pedros.\n\"Our first game [the 6-0 defeat to Germany], for 95% of people we were over, but we knew we could do something. In soccer, it is not an exact science, nothing is decided.\n\"[We have qualified for the next round] because we deserve it.\"", "url": "https://www.bbc.com/sport/football/66398182"}