{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:56:22", "date_modify": "2025-05-21 05:56:22", "date_publish": "2025-01-20 19:03:09", "description": "Former England footballer Wayne Bridge pulls out of his fight with KSI after the YouTuber \"crossed the line\" with remarks about his ex-girlfriend's alleged affair with former team-mate John Terry.", "filename": "sport_boxing_articles_cy5kreqrpvwo_1747806982.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cec5/live/50fe3ed0-d75b-11ef-abd1-e54c98d14775.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_boxing_articles_cy5kreqrpvwo_1747806982.html", "title": "Wayne Bridge v KSI: Former England footballer pulls out of fight after YouTuber 'crossed the line' with personal taunts", "title_page": "Wayne Bridge v KSI: Former England footballer pulls out of fight after YouTuber 'crossed the line' with personal taunts - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former England footballer Wayne Bridge has pulled out of his fight with KSI after the YouTuber \"crossed the line\" with remarks about his ex-girlfriend's alleged affair with former team-mate John Terry.\nThe bout, which had been scheduled to take place on 29 March, was only announced two days ago.\nIn a statement posted on Instagram, external, Bridge said: \"These are deeply personal comments that affect mine and other families involved in the situation.\n\"I'm a family man first and my priority is protecting them. Of course, I expected to face some criticism, but I feel like what was said on Saturday crossed a line.\"\nIn 2010, Bridge gave up his place in the England squad and Terry was stripped of his captaincy following the allegations of infidelity, which also resulted in the breakdown of Bridge's relationship with French model Vanessa Perroncel, with whom he has a son.\nBridge, 44, is now married and has two children with his wife Frankie, who was a singer with girl group The Saturdays.\nHe added: \"My opponent is someone that many children look up to around the world, including my kids.\n\"I hope one day he will look back on this differently. I personally don't want to be involved in these exchanges. Deep down I know this is the right thing to do.\"", "url": "https://www.bbc.com/sport/boxing/articles/cy5kreqrpvwo"}