{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:17:52", "date_modify": "2025-05-20 14:17:52", "date_publish": "2023-07-30 00:00:00", "description": "Watch as Switzerland face New Zealand and follow updates from both games in Group A at the 2023 Women's World Cup.", "filename": "sport_live_football_66183115_1747750672.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/183C4/production/_130586299_gettyimages-1580194074.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_football_66183115_1747750672.html", "title": "Fifa Women's World Cup LIVE: Watch Switzerland vs New Zealand score, commentary & updates from Group A game", "title_page": "Fifa Women's World Cup LIVE: Watch Switzerland vs New Zealand score, commentary & updates from Group A game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Goodbye\nThanks for joining us this morning as Switzerland held New Zealand to go through and Norway bashed the Philippines to join them.\nWatch highlights of those games on the BBC Sport index.\nFor now the focus turns to Germany v Colombia - which you can follow here.\nThis live page has ended now.\n'People counted Norway out, but they will want to prove them wrong'\nFT: Norway 6-0 Philippines\nJonas Eidevall\nArsenal manager on BBC Two\nSo many people have counted Norway out [because of their issues], but now they are in the knockout rounds.\nThey have everything they need to win now, and they can prove everyone wrong.\nThat is a great mentality to have and a great situation for them to be in going into the next round. It's very exciting.\n'You need to storm before you can perform'\nFT: Norway 6-0 Philippines\nJonas Eidevall\nArsenal manager on BBC Two\nThey say sometimes that when you are trying to bring a group together, you need to storm before you perform, and that is what has happened with Norway.\nThere was storm before this game, they probably clarified a lot of things in the group, and together with the coach as well.\nThey probably decided to put the issues to one side and focus on what they need to do to be successful.\n'Switzerland must be efficient on the counter attack against their next opponents'\nFT: Switzerland 0-0 New Zealand\nLaura Georges\nFormer France international on BBC Two\nSwitzerland have much more to show.\nTo play Spain or Japan, they will have to be ready to be really pateint against teams that know how to keep the ball.\nThey will have to be strong defensively and be really efficient in the counter attack.\n'New Zealand will have regrets'\nFT: Switzerland 0-0 New Zealand\nLaura Georges\nFormer France international on BBC Two\nThe regrets will really come from the Philippines game. When you play a team ranked lower than you, you have to kill them. One opportunity, you have to take it.\nThey beat Norway and they were too enthusiastic. They had to continue. Philippines should have been the game to think about for them going through.\nIt's hard to see that because they will have regrets.\nIt's sad because they won the first game for the national team at a World Cup.\n'New Zealand will look back in disappointment on this group stage'\nFT: Switzerland 0-0 New Zealand\nJonas Eidevall\nArsenal manager on BBC Two\nSwitzerland played with fear of losing this game.\nNew Zealand will be really disappointed looking back on this group stage. They beat Norway, they played a pretty good game today against Switzerland.\nWhy don't they qualify? Because they are the only team who lost to the Philippines. It's that game that will stick with them. If they had got one point from that game, they would have qualified.\nPost\nSwitzerland 0-0 New Zealand\nAnita Asante\nFormer England defender on BBC Two\nEven my hands came up there over my head thinking this might be the moment.\nIt was a lovely delivery into the box.\nThat's when you want Hannah Wilkinson right there in that area.", "url": "https://www.bbc.com/sport/live/football/66183115"}