{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:03:13", "date_modify": "2025-05-20 14:03:13", "date_publish": "2023-07-25 15:36:18", "description": "'I have faith in MacLean's approach'", "filename": "sport_articles_cd1z257dj47o_1747749793.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b83c/live/e84ba510-2b00-11ee-b1d7-8fdc93c2782e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cd1z257dj47o_1747749793.html", "title": "'I have faith in MacLean's approach'", "title_page": "'I have faith in MacLean's approach'  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Are you worried by the lack of 'scarf above the head' pictures this summer transfer window?\nWell, while Jamie Beatson would certainly like to see more of those, he does offer a little bit of optimism on the latest BBC Scottish Football Podcast.\nThe Saints fan was quick to highlight the small squad size Steven MacLean currently has at his disposal, but did suggest the approach by the new Saints boss should be welcomed.\n\"We're into competitive fixtures now, and we still are a bare bone squad,\" he said.\n\"We saw that against Stenhousemuir, a game that we lost, but when I looked at the line-up that afternoon and particularly the substitutes bench, the only recognisable name was Ali Crawford, unless you're an avid follower of the youth setup. There was a bit of an issue there.\n\"The positive though for Steven MacLean's recruitment is it seems he wants to bring in quality, not guys who are just going to fill the jerseys - that's been the issue the last two seasons.\"\nSo far, St Johnstone have recruited goalkeeper Dimitar Mitov and forward Luke Jephcott.\n\"A good start has been made, but we need it to keep going. We have positions that desperately need filled across the team so I expect more movement,\" Beatson added.\n\"I have faith in the way MacLean has started his business and the way he talks about building his squad going forward.\"", "url": "https://www.bbc.com/sport/articles/cd1z257dj47o"}