{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:03:52", "date_modify": "2025-04-26 04:03:52", "date_publish": "2025-03-04 00:00:00", "description": "Follow 5 Live Final Score plus live text and score updates as Club Brugge take on Aston Villa, PSV host Arsenal plus two more fixtures in the Champions League Round of 16.", "filename": "sport_football_live_cr42xw2140rt_1745640232.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6346/live/3db88cb0-f941-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_cr42xw2140rt_1745640232.html", "title": "Champions League last-16 LIVE: PSV vs Arsenal, Real Madrid vs Atletico Madrid, Dortmund vs Lille", "title_page": "Champions League last-16 LIVE: PSV vs Arsenal, Real Madrid vs Atletico Madrid, Dortmund vs Lille - score, radio & updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Lewis-Skelly for England?\nFT: PSV 1-7 Arsenal\nChris Sutton\nFormer Premier League striker on BBC Radio 5 Live\nWhy would Thomas Tuchel not put Myles Lewis-Skelly in?\nWho's more in form than Lewis-Skelly? He can keep out Riccardo Calafiori, Oleksandr Zinchenko and Kieran Tierney.\nWhy wouldn't Tuchel put him in? He's in form.\nOn merit, does Lewis-Skelly deserve to be called up to the England squad? I think he does.\nThomas Tuchel will name his first England squad on 13 March for the World Cup qualifiers.\n'A really special night for us'\nFT: PSV 1-7 Arsenal\nArsenal\nMore from Arsenal boss Mikel Arteta to Prime Video: \"It's a massive result away from home in a competition that we love, that we miss for so many years. Today is a really special night for us.\"\nOn Ethan Nwaneri and Myles Lewis-Skelly: \"To be doing what they are doing at 17 and 18 years old, shows incredible maturity. They are doing that because of how the other players support them and make them better. They have a lot of courage. Myles makes an assist, that's the team that I want to see, they take initiative and they want to make things happen.\"\n'So happy for the boys'\nFT: PSV 1-7 Arsenal\nArsenal\nArsenal boss Mikel Arteta speaking on Prime Video: \"So happy for the boys because in the last two games, we haven't scored a goal and we know the noise around that.\"\nOn taking off Myles Lewis-Skelly when he was on a yellow card and could have been sent off: \"I haven't seen the second action but you are 2-0 up away from home and I didn't want to risk it. He is very young so we have to protect him.\"\nOn PSV's penalty: \"Momentum can shift and this is a team that is very used to winning. They have the capacity to generate chances in a lot of moments. You don't want to put yourself in the position where they score a second one and it is game on.\"\nOn whether this performance was coming: \"No, but this is the beauty of football. Focus on what you are doing and do your best. Anything can happen.\"\n'We had no chance'\nFT: PSV 1-7 Arsenal\nPSV Eindhoven\nPSV manager Peter Bosz speaking to Amazon:\n\"Terrible night for us.\n\"No chance. Maybe two moments in the game - our first chance after 15 minutes when we hit the bar and the second yellow were moments to come back in the game. Football wise we had no chance. We were not in our best form. Arsenal played fantastic, we had no chance tonight.\"\nManager or players? \"Probably both. Poor from or side, absolutely. Not at all our football we play normally and Arsenal did really well.\n\"We had a plan we analysed them we thought that we could hurt them somewhere but if you look at how we defended, really poor. You can not be successful if you play this way.\n\"I can not imagine that I would ever lose this big so the players were disappointed. For us it's important in a couple of days to return to championship [Eredevisie]. We will analysis this game and help the players, if you lose this big you need to help them.\n\"We have to accept it but it's hard.\n\"We have to do it quick because only 10 games to play so we need men now.\"\n'It's all to play for in the next leg'\nFT: Real Madrid 2-1 Atletico Madrid\nAtletico Madrid\nAtletico Madrid midfielder Conor Gallagher, speaking to TNT Sports: \"Real Madrid are a top team and I think we competed well. I think it was a decent performance, we would've liked to get a better result but it's all to play for in the next leg.\nOn Alvarez: \"It was an unreal goal. It doesn't surprise me. He's playing with so much confidence, he's a top player and a top guy.\n\"We feel we can beat any team and with our fans behind us, it helps and we'll be looking forward to it.\"\n'Today you saw what we are capable of'\nFT: PSV 1-7 Arsenal\nArsenal\nArsenal's Martin Odegaard, speaking to Uefa: \"I enjoyed that one. When you play at this stage it is always tough and especially away from home so I think we've done incredibly well to get a result like that.\n\"It is hard to explain but I think we worked hard to improve after the last two games. I think today you saw what we are capable of and hopefully we will continue now.\n\"We know how important every goal is and today we are happy with the result.\"\n'Tonight it all clicked'\nFT: PSV 1-7 Arsenal\nArsenal\nArsenal midfielder Martin Odegaard speaking to Amazon:\n\"Yes especially after last few games we needed this performance. Brilliant start to end. Really good going forward, creating chances, scoring goals. Unfortunately conceded one goal but top performance.\nWorked on in last six days after Forest: \"Not too much. We work hard every day and especially after performances like West Ham and Forest. We've been working on a lot of finishing but the same as always. We always work hard. Tonight it all clicked.\n\"We've had a bit extra focus on it [finishing] after last few games. We know we have quality. You see today at this level it's fun we created so much so it was good to get everything out.\"\nOn scoring more goals: \"Every player in my position want to influence the game with goals and assists and it's something I haven't been good enough at this season but two goals and one assist tonight is a good step.\"\nOn youngsters: \"They play like they have been here for many years. So much quality and confidence, they're ready for it. I'm not worried about them we enjoy having them in the team and they have a great attitude.\"\nOn Myles Lewis-Skelly being taken off after booking: \"He took that really well. He knew it was a tricky position to be in. He was on a yellow and had a tough challenge too. He took it well and we're all there to support and I'm sure he will learn from that too.\"\nOn potentially facing Real Madrid in quarter-final: \"Would be special to go back there. Whoever we get we will be ready. We have to finish our job at home first and then see who we get.\"", "url": "https://www.bbc.co.uk/sport/football/live/cr42xw2140rt"}