{"authors": ["Jonty Colman", "www.facebook.com"], "date_download": "2025-05-21 06:33:13", "date_modify": "2025-05-21 06:33:13", "date_publish": "2025-01-04 13:57:58", "description": "Ryan Rickelton moves joint-seventh in South Africa's all-time top scorers in a Test innings after hitting 259 in the second Test against Pakistan.", "filename": "sport_cricket_articles_c0j133l8027o_1747809193.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b9ba/live/57716ac0-caa5-11ef-a078-37769e6d4b12.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c0j133l8027o_1747809193.html", "title": "South Africa v Pakistan: Ryan Rickelton scores 259 as hosts post 615 in second Test", "title_page": "South Africa v Pakistan: Ryan Rickelton scores 259 as hosts post 615 in second Test - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ryan Rickelton scored 259 as South Africa seized control on day two of the second Test against Pakistan at Newlands.\nBatting first, South Africa were bowled out for 615 in the evening session, their second-highest Test total against Pakistan and their highest against any team since the Boxing Day Test against Sri Lanka in 2020.\nRickelton, who started the day 176 not out with the hosts 316-4, posted another 83 runs before being caught off the bowling of Mir Hamza before tea.\nIt was the 28-year-old's first time opening in Test cricket and his 259 moves him joint-seventh for the highest Test score by a South African alongside Graeme Smith against England in 2003.\nCaptain Temba Bavuma (106) and wicketkeeper Kyle Verreynne (100) recorded their fourth Test centuries, while bowlers Marco Jansen (62) and Keshav Maharaj (40) scored quickly lower down the order.\nBowlers Mohammad Abbas and Salman Ali Agha took three wickets each, while Hamza and Khuram Shahzad claimed a pair apiece.\nResponding to 615 after tea, Pakistan were quickly reduced to 20-3 by the bowling of Kagiso Rabada and Jansen.\nRabada removed Pakistan captain Shan Masood and Saud Shakeel for two and nought respectively, with Kamran Ghulam only managing 12 before being bowled by Jansen.\nPakistan ended the second day 64-3, with former captain Babar Azam unbeaten on 31.\nSouth Africa currently lead 1-0 in the two-match Test series.", "url": "https://www.bbc.com/sport/cricket/articles/c0j133l8027o"}