{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:06:39", "date_modify": "2025-05-20 14:06:39", "date_publish": "2023-07-30 20:08:31", "description": "Aston Villa 3-3 Brentford: Premier League Summer Series", "filename": "sport_articles_ce5rry2nn5lo_1747749999.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/62dd/live/bb9b90d0-2f14-11ee-999b-b74dedc428d3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_ce5rry2nn5lo_1747749999.html", "title": "Aston Villa 3-3 Brentford: Premier League Summer Series", "title_page": "Aston Villa 3-3 Brentford: Premier League Summer Series - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Stunning goals in a back-and-forth game - what happened?\nBrentford raced into a two-goal lead thanks to a finish from Bryan Mbeumo and a stunning Josh Dasilva strike from range. But Aston Villa's Ezri Konsa found the net in remarkable fashion when he dribbled from the edge of his own box into the Bees' penalty area to curl home and get Villa back into the game.\nUnai Emery's side turned the game with two goals in 10 minutes from Moussa Diaby and Matty Cash, enough to grab a 3-2 half-time lead. Shandon Baptiste restored parity halfway through the second period as Villa - who drew 3-3 with Newcastle earlier in the Summer Series - ended the competition with two draws and a 2-0 win over Fulham.\nWant more on that Konsa goal?\nKonsa, who has six Villa goals to his name, will likely never score a better one than he did at FedEx Field. The 25-year-old intercepted a ball 30 yards out from his own goal and just took off. Two Brentford players fell to the turf as he brushed them off on the halfway line and the Bees' back three continued to back away, allowing the towering defender to get just inside the box before coolly curling into the top corner. Fans on social media called the goal \"outrageous\" and \"phenomenal\".\nWhat did Unai Emery say?\n\"A good match. We played very well in the first half. We were playing in the idea we planned. We came back and really control of the game is good. We were holding the line high and keeping ball possession like we worked on.\n\"In the second half we did some changes and lost a bit of power we had in the first half. But I am happy as the practice we wanted before coming here I think we are doing.\n\"Tactically we are trying to do some issues differently. Today I am happy as Cash was playing higher than before. He did very good work and threatened the opponent in his side. In the second half, Lucas Digne did the same.\n\"We are here trying to build and create a strong structure with the squad. We are trying to get some young players a performance as well so they can help us in the season. We are going to play the Premier League as our first target but with three other competitions, I want to be competitive and we will need a lot of players.\"\nVilla face Lazio next on 3 August.", "url": "https://www.bbc.com/sport/articles/ce5rry2nn5lo"}