{"authors": ["Charlotte Coates", "www.facebook.com"], "date_download": "2025-05-21 04:57:44", "date_modify": "2025-05-21 04:57:44", "date_publish": "2025-04-04 13:06:34", "description": "PSG are on the brink of the Ligue 1 title and could be the first in French football history to go unbeaten all season.", "filename": "sport_football_articles_cz6dxy22887o_1747803464.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7e5e/live/f3cf9fc0-1133-11f0-8874-0979deb646d0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cz6dxy22887o_1747803464.html", "title": "PSG on the brink and chasing invincible season", "title_page": "PSG on the brink and chasing invincible season - how do Europe's title races look? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Paris St-Germain are on the brink of something special.\nLuis Enrique's side are 21 points clear of nearest challengers Monaco in Ligue 1 and avoiding defeat at home to Angers on Saturday will see them crowned champions with six matches remaining.\nIt will only be the third time a team has won Ligue 1 with so many matches left, PSG themselves having lifted the title with eight games to go in 2016 and Lyon winning it with six games remaining in 2007.\nOnly PSG have lifted the title earlier in the year, having won it by mid March in that 2016 campaign.\nOf course, a league title is nothing new to the defending champions - this will be their fourth successive Ligue 1 crown and 11th in the past 13 seasons.\nBut the manner of this season's efforts, despite the departures of Lionel Messi, Kylian Mbappe and Neymar in recent years, has been particularly eye-catching.\nThey are unbeaten in the league after 27 games and closing in on Nantes' record of the most games without defeat from the start of a season - that was 32 in 1994-95, suffering their only loss in the 33rd of what was then a 38-game campaign.\n\"That Nantes side were one of the greatest teams we have had in French football history,\" said Julien Laurens on the EuroLeagues podcast. \"[They went close to going unbeaten], but nobody has ever gone the whole way.\"\nIf PSG complete an unbeaten league season, they would become one of a small band of teams from Europe's top five leagues to do so, joining Bayer Leverkusen from 2024, Juventus in 2012, Arsenal in 2004, Milan in 1992, Perugia in 1979 and Preston North End in 1889.\n\"They would be the first French team ever to do it,\" added Laurens. \"One defeat has been done twice, but zero defeats never.\n\"I think this is the main motivation for this PSG team and for Luis Enrique. He tells the players enough they could write even more history by staying the whole season unbeaten.\n\"There is a reason why it is so rare, because I think subconsciously when you have validated the title and have other competitions to focus on, even if you want to keep winning, maybe there is something in you that you switched off a little bit.\n\"They have been playing so well the last few months that it is definitely not out of the question.\"\nPSG also still have their eyes on a quadruple, with a Champions League quarter-final and a Coupe de France final to look forward to, having already won the French Super Cup.\nWith the Ligue 1 crown almost wrapped up, here is how the title races look across the rest of the top five European leagues.\nThe La Liga title race is one of the tightest in Europe, with Barcelona and Real Madrid battling for top spot.\nHansi Flick's side sit at the summit in Spain with a three-point cushion over the reigning champions Real, with nine matches remaining.\nBarcelona and Real Madrid still have to meet in the final La Liga Clasico of the season - due to take place on the second weekend in May.\nAtletico Madrid are lingering in third but the nine points needed to catch up with their rivals may well be too much at this stage in the campaign.\nThey don't, however, have to play either of the top in the run-in.\nLiverpool can wrap the Premier League title up before the end of April with second-place Arsenal 12 points adrift.\nLiverpool's first title in 30 years came in 2020 during the Coronavirus pandemic under the guidance of Jurgen Klopp.\nArne Slot, however, is hoping to win the title in his first season at the club since replacing Klopp last summer.\nOut of all other competitions, the biggest tests of his side's remaining eight league games would appear to be away at Champions League-chasing Chelsea on 4 May before they host second-placed Arsenal the following week.", "url": "https://www.bbc.com/sport/football/articles/cz6dxy22887o"}