{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:02:38", "date_modify": "2025-05-21 05:02:38", "date_publish": "2025-01-23 12:40:10", "description": "Swansea City: Darling dismissal 'never a red' and 'unlucky'", "filename": "sport_football_articles_c4g73n0eqdzo_1747803758.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8ca4/live/13264e50-d985-11ef-ba6a-b744abd00a0a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c4g73n0eqdzo_1747803758.html", "title": "Swansea City: Darling dismissal 'never a red' and 'unlucky'", "title_page": "Swansea City: Darling dismissal 'never a red' and 'unlucky' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Harry Darling's red card in Swansea's defeat at home to Sheffield United in the Championship on Tuesday has been appealed by the Welsh club.\nAnd the appeal gets the backing of former Wales strikers Iwan Roberts and Sam Vokes, who both disagree with referee Dean Whitestone's decision to dismiss Darling for a tackle on former Swansea loanee Rhian Brewster.\n\"I think the reaction of the Sheffield United players has a bearing on the referee's decision,\" Roberts said on the latest edition of the Feast of Football podcast on BBC Sounds.\n\"I know it is a little bit reckless and I know he's late but I don't think he's caught him [Brewster] that badly if I'm being totally honest, I think he was a little bit unlucky.\"\nWycombe Wanderers striker Vokes feels Darling's tackle warranted nothing more than a booking.\n\"The lad [Brewster] has made the most of it and the reaction of the players... Tyrese Campbell runs straight over to the referee and it almost starts a melee and all of a sudden he [referee Whitestone] is thinking this is worse than he thought originally,\" said Vokes.\n\"Harry Darling has gone to just clear the ball and just mistimed it and the striker is a bit sharper and got in front of him, never a red in my eyes.\n\"It's on the half-way line, there is nothing going on. It's a yellow and a slap on the wrists.\"", "url": "https://www.bbc.com/sport/football/articles/c4g73n0eqdzo"}