{"authors": ["Marissa Thomas", "www.facebook.com"], "date_download": "2025-05-20 14:18:05", "date_modify": "2025-05-20 14:18:05", "date_publish": "2023-07-29 12:15:26", "description": "Jamaica win their first-ever Fifa Women's World Cup match as Allyson Swaby's goal gives them victory over Panama in Perth.", "filename": "sport_football_66348832_1747750685.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1778A/production/_130583169_gettyimages-1562526167.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66348832_1747750685.html", "title": "Panama 0-1 Jamaica: Allyson Swaby scores the only goal as Jamaica seal their first ever World cup win", "title_page": "Panama 0-1 Jamaica: Allyson Swaby scores the only goal as Jamaica seal their first ever World cup win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jamaica won their first-ever Fifa Women's World Cup match as Allyson Swaby's goal gave them victory over Panama in Perth.\nSwaby rose highest to head home from a Trudi Carter cross in the 56th minute as the Reggae Girlz recorded a historic win - and in the process knocked Panama out of the tournament.\nFrance and Jamaica are joint top of Group F and now face final decisive group matches against Panama and Brazil respectively on Wednesday, 2 August.\nLorne Donaldson's side, who were without captain Khadija 'Bunny' Shaw after she was sent off in the dying seconds of their goalless draw against France, have shown significant progress since 2019, when they lost all three matches on their only previous tournament appearance.\nAtlanta Primus was particularly lively in the first half as Jamaica looked to dominant proceedings, having two shots blocked and firing high over the bar from distance.\nJamaica went even closer when Vyan Sampson struck from the edge of the area looking to curl into the top corner before Panama goalkeeper Yenith Bailey sprung to her right and palmed it behind.\nDrew Spence's curling free-kick just before half-time was also pushed onto the bar by Bailey as Jamaica looked to break the deadlock.", "url": "https://www.bbc.com/sport/football/66348832"}