{"authors": ["Timothy Abraham", "www.facebook.com"], "date_download": "2025-05-21 06:14:52", "date_modify": "2025-05-21 06:14:52", "date_publish": "2025-01-06 20:13:37", "description": "The England and Wales Cricket Board calls for a unified response to action against Afghanistan amid calls for the England men's team to boycott next month's Champions Trophy match against the country.", "filename": "sport_cricket_articles_c9wl9lep7w5o_1747808092.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/37a4/live/245e0780-cc65-11ef-a3be-5925fe8e76ce.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c9wl9lep7w5o_1747808092.html", "title": "England-Afghanistan boycott calls: ECB want ICC-wide approach to Champions Trophy issue", "title_page": "England-Afghanistan boycott calls: ECB want ICC-wide approach to Champions Trophy issue - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The England and Wales Cricket Board has called for a unified response to action against Afghanistan amid calls for the England men's team to boycott next month's Champions Trophy match between the sides.\nEngland are due to face Afghanistan in Lahore on 26 February, but UK politicians want the team to refuse to play the 50-over match and take a stand against the Taliban regime's assault on women's rights.\nA letter to the ECB, external, written by Labour MP Tonia Antoniazzi, and signed by the likes of Reform UK leader Nigel Farage, and former Labour leaders Jeremy Corbyn and Lord Kinnock, urged England to boycott the match to \"send a clear signal\" that \"such grotesque abuses will not be tolerated\".\nWomen's participation in sport has effectively been outlawed since the Taliban's return to power in 2021 and many of Afghanistan's female players left the country for their own safety.\nInternational Cricket Council (ICC) regulations state full membership is conditional upon having women's cricket teams and pathway structures in place.\nHowever, Afghanistan's men's team have been allowed to participate in ICC tournaments seemingly without any sanctions.\nIn response to the letter signed by group of more than 160 politicians calling for a boycott, ECB chief executive Richard Gould said the governing body \"is committed to finding a solution\" which \"upholds the rights of women and girls in Afghanistan\".\n\"While there has not been a consensus on further international action within the ICC, the ECB will continue to actively advocate for such measures,\" he said.\n\"A coordinated, ICC-wide approach would be significantly more impactful than unilateral actions by individual members.\"\nGould said the ECB will continue its policy of not scheduling bilateral matches against Afghanistan but did not commit either way to a boycott.\nBilateral matches are organised by individual cricket boards but tournaments such as the Champions Trophy are run by the ICC and, given Afghanistan are being allowed to participate by the governing body, England are set to face them as scheduled.\nAustralia have withdrawn from playing several men's series against Afghanistan in recent years because of the Taliban regime's restrictions on women, but they played each other at the 2023 50-over World Cup and the 2024 T20 World Cup.\nGould added that the ECB will engage with the UK government, other international boards and the ICC to \"explore all possible avenues for meaningful change\" but acknowledged there were \"diverse perspectives\" on the issue.\n\"We understand the concerns raised by those who believe that a boycott of men's cricket could inadvertently support the Taliban's efforts to suppress freedoms and isolate Afghan society,\" Gould added.\n\"It's crucial to recognise the importance of cricket as a source of hope and positivity for many Afghans, including those displaced from the country.\"\nThe Department for Culture, Media and Sport (DCMS) is in contact with the ECB over the wider issue of the Afghanistan women's cricket team.\n\"We are deeply concerned by the appalling erosion of women's and girls' rights in Afghanistan,\" a DCMS spokesperson said.\n\"We welcome the fact that the ECB are making representations to the ICC on this wider issue and what support can be given.\"\nThe Afghanistan women's team was created in 2010, nine years after the Taliban regime fell at the hands of a US-led military coalition.\nThe Afghanistan Cricket Board (ACB) initially barred the women's team from playing at several international tournaments, saying it received \"Taliban threats\".\nTwenty-five female cricketers were handed contracts by the ACB in 2020. Less than a year later the Taliban returned to power, ending any progress towards Afghanistan playing an official women's international.\nMore than 20 Afghan women's cricketers managed to leave the country and are currently living in Australia.\nEngland have played Afghanistan three times in one-day internationals and T20 internationals - all at ICC events - and lost their most recent meeting at the 2023 50-over World Cup.\nPakistan and neutral venue Dubai will host the eight-team Champions Trophy from 19 February to 9 March. Australia and South Africa join England and Afghanistan in Group B, while Pakistan, India, New Zealand and Bangladesh meet in Group A.", "url": "https://www.bbc.com/sport/cricket/articles/c9wl9lep7w5o"}