{"authors": ["Simon Stone", "Nizaar Kinsella", "www.facebook.com"], "date_download": "2025-05-21 05:32:14", "date_modify": "2025-05-21 05:32:14", "date_publish": "2025-01-14 13:11:14", "description": "Manchester City move closer to the signature of Brazilian teenage defender Vitor Reis from Palmeiras in a deal reported to be worth £29.4 million.", "filename": "sport_football_articles_crlkn16xzw1o_1747805534.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e63b/live/d0c99360-d276-11ef-9377-192b32874917.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_crlkn16xzw1o_1747805534.html", "title": "Manchester City close in on deal for Brazilian teenager Vitor Reis", "title_page": "Manchester City close in on deal for Brazilian teenager Vitor Reis - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester City are closing in on the signing of Palmeiras' teenage defender Vitor Reis.\nCity have been in negotiations with the Brazilian club for a number of weeks and, after some resistance, have finally made a breakthrough in talks which the Premier League club believe will lead to 19-year-old Reis eventually joining them.\nPalmeiras had hoped to keep Reis for next summer's Club World Cup.\nHowever, City sources believe if the deal, which is reported to be for £29.4m, is eventually concluded, Reis will join them immediately.\nA Brazil under-17 international, Reis has made 18 league appearances for Palmeiras.\nA right-footed central defender, it is intended Reis will form part of a reshaping of Pep Guardiola's squad that is also planned to include Lens defender Abdukodir Khusanov, while talks are continuing with Eintracht Frankfurt over a deal for striker Omar Marmoush.\nSpeaking on Tuesday Palmeiras president Leila Pereira said she hoped that even if a transfer is agreed Reis would be able to stay until the end of the season.\n\"That would be my wish,\" she said. \"If we agreed on the price, we would sell him now and he would go after the [Club] World Cup. All of this is being discussed. It may not be possible.\"", "url": "https://www.bbc.com/sport/football/articles/crlkn16xzw1o"}