{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:23:53", "date_modify": "2025-05-21 05:23:53", "date_publish": "2025-01-14 15:33:47", "description": "BBC chief sportswriter Tom English answers your Scottish rugby questions", "filename": "sport_articles_cvgplzm2z8po_1747805033.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5355/live/f831b290-d283-11ef-87df-d575b9a434a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cvgplzm2z8po_1747805033.html", "title": "BBC chief sportswriter Tom English answers your Scottish rugby questions", "title_page": "BBC chief sportswriter Tom English answers your Scottish rugby questions - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "BBC Scotland's chief sportswriter Tom English has been answering your Scottish rugby questions before Gregor Townsend announces his Six Nations squad on Wednesday.\nMark asked: Where do Scotland sit in regards to the Six Nations, are we ready to kick on? And is there a wildcard player who could come in and make a difference or shake the squad up?\nTom answered: The Six Nations squad is getting announced on Wednesday, so we'll know the full picture as regards to wildcards, if any, pretty soon.\nI'd certainly like to see Fergus Burke in there. Finn Russell and Tom Jordan are the only fit and viable 10s in my opinion and Russell is 32 now. Burke is an excellent footballer and he's doing well at Saracens. England haven't named him in their squad so Scotland need to grab this opportunity to secure a young-ish 10 for the future.\nI've been getting mixed messages on whether Jonny Gray is making himself available for the Six Nations. I'd love to see him back on the basis that you can't have too many warriors. Max Williamson, if he was fit, would be playing a big part in the championship, I think. Hopefully we'll see him at some point.\nGregor Townsend might throw in one or two bolters, but the squad is so settled at this stage it's hard to see how they'll make an impact. You could almost name the 23 for Italy right now, injuries permitting.\nAlan asked: How do you think professionalisation of rugby has impacted the success, or lack of success, of the Scotland rugby team? Is success more than winning Championships?\nTom answered: The game going professional was bad news for Scotland. Under the individual and collective reigns of Jim Telfer and Ian McGeechan, Scotland were among the fittest, best-drilled and hardest teams in the world because the two legends made it so.\nFew countries had a brains-trust like those two and few countries had players who were prepared to do the things that Telfer insisted the Scottish boys do. They were savagely effective.\nProfessionalism took away Scotland's advantage. Suddenly, everybody had time to be fitter, faster, stronger and they had the desire to work harder than ever before because it was now their livelihood.\nIs success more than winning championships? Yes and no.\nScotland could win four of five in the Six Nations this season and finish second. That's success to me. Not ultimate success, but success nonetheless. I think Scotland have reached a point now, though, where they are entitled to look on a championship win as the only thing that really represents success. It's been a long road.\nThe squad is very, very good. In certain positions, it's totally world class. The backline as a whole is among the best in the world. So, second would be really impressive, but first is not out of the question. That's the goal.", "url": "https://www.bbc.com/sport/articles/cvgplzm2z8po"}