{"authors": ["Gareth Vincent", "www.facebook.com"], "date_download": "2025-05-21 07:58:12", "date_modify": "2025-05-21 07:58:12", "date_publish": "2025-03-27 18:07:56", "description": "Alan Sheehan insists he is happy with a short-term Swansea City deal after agreeing to remain in charge at the Championship club for the final eight games of the season.", "filename": "sport_football_articles_cwyn0kl95y5o_1747814292.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/462a/live/91245220-0af4-11f0-bf59-3b6bbdd820ea.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cwyn0kl95y5o_1747814292.html", "title": "Alan Sheehan: Swansea City caretaker head coach happy with short-term deal", "title_page": "Alan Sheehan: Swansea City caretaker head coach happy with short-term deal - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Alan Sheehan insists he is happy with a short-term Swansea City deal after agreeing to remain in charge at the Championship club for the final eight games of the season.\nSheehan stressed the need for \"permanent roles for permanent people with a permanent plan\" when discussing Swansea's uncertain managerial situation earlier this month.\nInstead, he will remain caretaker head coach until May as Swansea continue to weigh up their long-term options.\nDespite continuing uncertainty over who will be in charge next season, Sheehan accepts the club's stance after talks with director of football Richard Montague.\n\"I'm OK,\" he said. \"I suppose yes, you want clarity all the time, but I understand the conversations we had.\n\"We have eight games left of the season and they felt I am the best man to do the job for this duration. That's what we'll do.\"\nSheehan has been allowed to strengthen his backroom team with the additions of Mark Fotheringham and Richard Steadman, who are also understood to be on deals running until the summer.\nHowever, there is little scope for Sheehan and his staff to look ahead to next season, with the only focus for now on ensuring Swansea avoid relegation from the Championship.\n\"I'm happy with the situation as it is,\" Sheehan added.\n\"It's an opportunity to manage this football club for another eight games.\n\"Like I said when I first came in, the challenge we have is to keep the club in the league and then reassess at the end of the season.\"\nSheehan, who also had a spell as caretaker boss last season, was placed in charge after the departure of Luke Williams last month.\nHe made a flying start, taking seven points from three games – and keeping a hat-trick of clean sheets – to ease relegation concerns.\nHowever, a 12-point gap to the bottom three has been cut to six following successive defeats against Watford and Burnley before the international break, and 16th-placed Swansea face a daunting trip to leaders Leeds United on Saturday.\nSwansea's hope is that Sheehan will lead his side away from relegation danger with another positive run in what some are viewing as an audition for the permanent head coach role.\n\"I'm sure there are a lot of people who want this job,\" Sheehan said.\n\"Right now I am the man who has been put in charge until the end of the season and I'm incredibly privileged to do that.\n\"Now I think it's really important that we at the football club, the fans, we realty bring it together to make it a really good finish to the season.\"\nSheehan says the arrivals of former Huddersfield boss Fotheringham, who has also coached in Germany with the likes of Hertha Berlin and Kalsruher, and ex-Wolves and Leicester defender Stearman will help Swansea's cause.\n\"I need people around me who are incredibly hungry and share my work ethic and desire to improve this football club,\" he said.\n\"Mark has so much experience. He was renowned as one of the best coaches in Germany and worked with some German legends – [Michael] Henke, [Tomas] Oral, [Felix] Magath, Jurgen Klinsmann .\n\"He has that pedigree and had an opportunity in management as well, so he knows a lot about these leagues.\n\"Richard is somebody that I have done my A and B licence with. He is somebody I trust who has been promoted out of this league twice. He had a massive desire to come here.\"", "url": "https://www.bbc.com/sport/football/articles/cwyn0kl95y5o"}