{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:15:37", "date_modify": "2025-04-26 04:15:37", "date_publish": "2025-03-04 09:56:23", "description": "Could a front-two combination of Wilson Isidor and Eliezer Mayenda work wonders at Sunderland? Ex-Black Cats defender Danny Collins thinks so.", "filename": "sport_football_articles_c7vzrdyvjzro_1745640937.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/948b/live/dc4f68e0-f8dc-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c7vzrdyvjzro_1745640937.html", "title": "Sunderland podcast: Wilson Isidor & Eliezer Mayenda", "title_page": "Sunderland podcast: Wilson Isidor & Eliezer Mayenda - dream duo? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Could a front-two combination of Wilson Isidor and Eliezer Mayenda work wonders at Sunderland?\nMayenda impressed with his double against Sheffield Wednesday last time out but faces a tough task to break into the starting line-up given boss Regis Le Bris' favoured 4-3-3 formation.\n\"They are both quick, they play on the shoulder - they are a nightmare for centre-backs,\" former Black Cats defender Danny Collins told BBC Radio Sunderland.\nThe Wearsiders next host relegation-threatened Cardiff City on Saturday, before welcoming Preston North End three days later.\nBut with the Bluebirds facing Sunderland's promotion rivals Burnley on Tuesday while the Black Cats enjoy a midweek free of competitive football, Collins thinks the weekend might be the perfect time to try out a 4-4-2 line-up.\n\"Why not go with it?\" he said. \"Go with a two-man midfield, maybe Jobe Bellingham and Dan Neil. Romaine Mundle on the wing, maybe Patrick Roberts on the right.\n\"What don't you like as a centre-back or a full-back? It's the ball constantly getting dropped in behind you, running back towards your own goal with a flier on your shoulder - so we will have to wait and see.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c7vzrdyvjzro"}