{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:00:10", "date_modify": "2025-04-26 04:00:10", "date_publish": "2025-03-04 05:21:32", "description": "Wrexham: Steve Parkin seeks repeat of 'best away performance' at Huddersfield Town", "filename": "sport_football_articles_ckgz78g9vedo_1745640010.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/38dd/live/58c14260-f84f-11ef-83da-2fe2e32e5a75.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_ckgz78g9vedo_1745640010.html", "title": "Wrexham: Steve Parkin seeks repeat of 'best away performance' at Huddersfield Town", "title_page": "Wrexham: Steve Parkin seeks repeat of 'best away performance' at Huddersfield Town  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Wrexham will go in search of a repeat of their away-day performance at Mansfield Town as they bid to strike a blow in the League One promotion race at Huddersfield Town on Tuesday.\nWrexham, who are third, take on fifth-placed Huddersfield (19:45 GMT) knowing victory would lift them to second should Wycombe Wanderers slip up against Burton Albion.\nPhil Parkinson's side have stumbled at home in recent weeks, with Saturday's goalless draw against Bolton leaving the Dragons with only two points from their past four Stok Racecourse fixtures.\nBut Wrexham have been in fine form on the road, claiming three successive victories.\nTheir most recent triumph was a 2-1 success against Mansfield which Steve Parkin (pictured below) has described as their best away performance since promotion from League Two.\n\"Huddersfield will be well organised, strong physically and decent at set-plays. They have a strong squad - they made some key singings in January,\" Wrexham's assistant boss said.\n\"They are probably not in the form they'd like to be in, but it will be another tough test.\n\"But if we apply ourselves like we did at Mansfield, which was probably our best away performance of the season, then I'm sure we'll be fine.\"", "url": "https://www.bbc.co.uk/sport/football/articles/ckgz78g9vedo"}