{"authors": ["Kheredine Idessane", "www.facebook.com"], "date_download": "2025-05-21 07:39:43", "date_modify": "2025-05-21 07:39:43", "date_publish": "2025-03-28 11:57:45", "description": "Butland opens up on 'hairdryer' that's helped revitalise Rangers form", "filename": "sport_articles_cly2ejn97xjo_1747813183.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cb13/live/8dae9840-0b34-11f0-b1de-e342f84c59e9.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cly2ejn97xjo_1747813183.html", "title": "Butland opens up on 'hairdryer' that's helped revitalise Rangers form", "title_page": "Butland opens up on 'hairdryer' that's helped revitalise Rangers form - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Interim boss Barry Ferguson won't be drawn on the \"secret\" of Rangers' transformation since he took charge, but goalkeeper Jack Butland may have given the game away.\nThe 'hairdryer' treatment when necessary has got the team back playing with a passion and energy that had gone missing, with everyone at the club now clear about standards and \"what's expected\" of a Rangers player.\nRecent wins over Jose Mourinho's Fenerbahce and Brendan Rodgers' Celtic have put smiles on faces at Ibrox and Butland gives great credit to the new interim management team of Ferguson and fellow former players Billy Dodds, Neil McCann and Allan McGregor.\n\"From the minute the guys came in, they were very conscious about getting results,\" the 32-year-old said.\n\"Very conscious about trying to make the environment and the energy right, which they have done.\n\"They've come in with big voices, big energy, big characters. When you've got that, it's very easy to follow that standard, to understand who they were, who they are as people, what they were as players.\n\"They've set a real standard for everybody, with no grey area. What's expected is what's expected and that's what's demanded all the time.\n\"It didn't take long, a few of the other lads might have been taken a little bit aback by some of the 'hairdryers' at times, but I guess it was what was needed and I think the boys have responded really well to it.\"\nSuch a good response that Rangers find themselves in a European quarter-final and licking their lips at the prospect of a third successive derby win over Celtic next month.\nIt all sent the players away into the international break, as Butland admits, with a real spring in their steps. And now they are determined to end the campaign with a flourish, starting with victory at Dundee on Saturday night.\n\"These games between now and the end of the season are an opportunity to give the fans something back and to give the group a way to finish the season on a high,\" added Butland.\n\"We need to go into the summer with some real momentum and positivity looking forward to next season.\n\"We've had lots of reasons and excuses and there are a lot of things to look back on at the end of the year as individuals, a group and a club to put right ahead of next year.\n\"But the best thing you can do with that is do it now, start trying to build something, start trying to nail down a culture and an expectation.\"", "url": "https://www.bbc.com/sport/articles/cly2ejn97xjo"}