{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:48:25", "date_modify": "2025-05-21 04:48:25", "date_publish": "2025-02-09 00:00:00", "description": "India face England in the second ODI – follow score & text updates.", "filename": "sport_cricket_live_c623p4ll33jt_1747802905.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_live_c623p4ll33jt_1747802905.html", "title": "Relive India sealing an ODI series win over England after Rohit Sharma's superb century", "title_page": "Relive India sealing an ODI series win over England after Rohit Sharma's superb century - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Goodbye\nThat's us done for today, as India took this ODI series 2-0 with a win by four wickets in Cuttack.\nTake a read of Matthew Henry's report to see how it played out.\nWe'll be back for the final game in the series in Ahmedabad on Wednesday, that's at 08:00 GMT.\nWill England be able to find any positives before flying to the Champions Trophy?\nJoin us then to find out...\n'We want to keep getting better as a team'\nPlayer of the match Rohit Sharma speaking to TNT Sports: \"It was good, I really enjoyed being out there, scoring some runs for the team. Obviously it was an important game, the series on the line. I really broke it down into pieces, how I wanted to bat - an ODI is longer than a T20, it's a lot shorter than Test cricket but you still need to work out what you need to do at regular intervals. That was my focus.\"\nOn the conditions: \"Looking at the pitch, when you play on black soil, the ball tends to skid. It's important to show the full face of the bat initially. Once I started to hit it, I worked out what they were trying to do, that's where I prepared my plan, what I wanted to do to their deliveries. It’s all about finding what you want to do as a batter and I had support from Shubman and Shreyas as well.\"\nOn Shubman Gill: \"We enjoy looking at how each other bat, Gill is a very classy player. I’ve seen him at close quarters over the years, he doesn't get overwhelmed by the situation. He goes out there and reads the situation. It's classy to watch from the other side.\n\"The middle overs are where the game can go either way. If you stay in, it gives you a chance not to worry too much about your depth. We want to keep getting better as a team. Everyone has a job to do and needs to do it perfectly, that's what we want to do.\"\n'We just needed a few of us to catch fire'\nEngland captain Jos Buttler on TNT Sports: \"I thought we did a lot of things well. We got in some nice positions with the bat. We just needed a few of us to catch fire and get up towards 350. Rohit played a terrific knock.\"\nOn why England chose to bat: \"We thought it looked a good wicket. We wanted to get runs on the board. Maybe it skidded on a bit but the opposition played well. Our guys at the start played well, played the powerplay brilliantly, but we needed another gear to kick on. Maybe 350 would have been defendable.\"\nOn what England will work on before the third ODI: \"We've just got to keep making steps in the right direction. The results aren't there at the moment but we've got to keep the guys on task, play the style we want, and stay positive.\"", "url": "https://www.bbc.com/sport/cricket/live/c623p4ll33jt"}