{"authors": ["Andy Gray", "www.facebook.com"], "date_download": "2025-05-21 07:35:37", "date_modify": "2025-05-21 07:35:37", "date_publish": "2025-03-26 06:42:34", "description": "Michael O'Neill's warning about bumps in the road proves accurate as his young side are dismantled by Sweden in Stockholm.", "filename": "sport_football_articles_c7vzpy85g06o_1747812937.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/df5f/live/3a869b60-0a10-11f0-a457-1fbea9af81fd.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c7vzpy85g06o_1747812937.html", "title": "Northern Ireland: Michael O'Neill's side exposed to 'level above' in Sweden loss", "title_page": "Northern Ireland: Michael O'Neill's side exposed to 'level above' in Sweden loss - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "After Friday's draw with Switzerland, Michael O'Neill warned there would be bumps on the road on the journey of his young Northern Ireland team.\nHowever, few would have expected one to come so soon, or it be one of the size faced in Tuesday's 5-1 defeat in Sweden.\nSweden are a better team than their Nations League C status indicates, and in Newcastle United's Alexander Isak they have a world-class star at the helm.\nBut, fuelled by their defeat by Luxembourg, Sweden and Isak put on a clinical display in Stockholm.\n\"We obviously didn't come here to have a score-line like we had tonight, but we knew it would be a tough game,\" said O'Neill.\n\"I think 5-1 is maybe a bit harsh on us, but at the end of the day we did give them opportunities and at this level they will punish you.\"\nNorthern Ireland's journey of progression has been a story of fearless youngsters and, largely, there's been plenty for the Green and White Army to cheer about.\nWith a starting team with an average age of 22.6 - the joint-second youngest fielded by Northern Ireland since 1946 - it was another bright start before things quickly came unstuck on seven minutes.\nWary of Isak, possibly the most in-form striker in world football, the NI defence got caught ball watching and that allowed the unmarked Emil Holm to fire home the opener.\nMissing first-choice defenders Conor Bradley, Daniel Ballard and Trai Hume, Sweden cut through the pair of Terry Devlin, making his first start, and Ruairi McConville, on his third cap, and that led to Pierce Charles, himself with only six caps, to push the ball into the path of Benjamin Nygren.\nKen Sema added a third, while Isak powered home a superb fourth and Nottingham Forest's Anthony Elanga added a fifth.\nIn contrast, NI failed to take numerous chances and the damage was done, at both ends of the pitch, before Isaac Price scored his eighth international goal with a deflection as the clock ticked into injury time.\n\"I thought probably 2-0 was a little bit harsh on us at half-time, and then the third goal is a poor goal for us to lose off a set-piece,\" said O'Neill, while stressing \"you always learn in international football\".\n\"In all honesty the attitude of the team was great. They never stopped trying to play. It was a tough night but that's why we took a game like this.\n\"We're asking a lot of young players who aren't playing every week for their clubs. They are not exposed to this level and this quality of player.\n\"Sweden have some top, top players – particularly at the top end of the pitch. It’s a benchmark, for our players all of these games are a step up.\"\nO'Neill wants his team to learn. That's the whole point of facing teams like Switzerland, Sweden and Denmark ahead of a World Cup qualifying campaign that has paired them with Germany, Slovakia and Luxembourg.\nWhile the result is what it is, and the downbeat demeanor of the players post-match said it all, optimism about this group of players will not disappear because of a difficult 90 minutes.\nHowever, any impact of the defeat will only become clear in the next two fixtures and beyond.\nNext up, there's more Scandinavian flavour as NI travel to Copenhagen and welcome Iceland to Windsor Park.\nIt will be another chance to learn, another chance to grow.\n\"There's another level above this - we have to go and play Germany - so we know what's in store for us but we can only get better as a team if we expose ourselves to this level of opposition,\" O'Neill said.\n\"We've a tough game, a pot one team in Denmark and then Iceland, who are a similar nation to ourselves.\n\"We played a Spanish team who were the best in Europe by a distance. We have to recognise we have a generation of young players who hopefully will continue to improve.\"\nAs the players return to their clubs, O'Neill added his oft-repeated warning about minutes on the pitch.\n\"I can't say for certain to what level we get to, that will be determined by what level they get to with their clubs.\n\"But I still think we had some good individual performance tonight. It's part of the learning curve for them.\"", "url": "https://www.bbc.com/sport/football/articles/c7vzpy85g06o"}