{"authors": ["Jonathan Sutherland", "www.facebook.com"], "date_download": "2025-04-26 07:04:16", "date_modify": "2025-04-26 07:04:16", "date_publish": "2025-02-28 07:23:27", "description": "Brian Graham says he will only make a decision on his playing career if he is offered the job of Partick Thistle manager on a full-time basis.", "filename": "sport_football_articles_c9dee6xnq8qo_1745651056.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/718f/live/f40b0a80-f539-11ef-a372-9f83dba237c1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c9dee6xnq8qo_1745651056.html", "title": "Graham to keep playing as interim boss waits for Partick Thistle choice", "title_page": "Graham to keep playing as interim boss waits for Partick Thistle choice - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Brian Graham says he will only make a decision on his playing career if he is offered the job of Partick Thistle manager on a full-time basis.\nThe 37-year-old club captain has been in interim charge since the sacking of Kris Doolan.\n\"I would need to cross that bridge when I got to it,\" he said when asked about the possibility of hanging up his boots to focus on coaching.\n\"If I was given the job, then that would be a decision I would make then. But when you still don't know and you're in the dark you just need to continue to play.\"\nThe veteran striker, who is being assisted by under-18s coach Mark Wilson, is not new to coaching, having been in charge of Thistle's women for more than four years, a job he is juggling with his new responsibilities.\nAnd his first experience with the men did not put him off his game as he notched his 16th goal of the season in a draw with Airdrieonians last weekend.\nOn Friday, the Jags host title-chasing Livingston in front of the Sportscene cameras on BBC Scotland.\n\"I'm in transition, building up my CV,\" added Graham. \"It's well out there that I want to be a manager full-time so I've been working towards a goal.\n\"If that's at Partick Thistle, great. If it's not, then I have to go somewhere else and then potentially come back to Partick Thistle further down the line. I'm fine with that.\n\"I know there's been loads of applications come in, so the club will be working through all those. They will make the right decision.\"\nThistle are aiming for revenge after losing away at Livingston 2-0, also in front of the Sportscene cameras, back in December but Graham anticipates a tough match against the side sitting second in the Championship.\n\"A lot of people have them as this big, strong, physical side but they are a side that can also play,\" he explained. \"They have great balance in their team.\n\"But us as the home team, we are going out to get three points. We want to finish in those play-off places.\"\nThe hosts will be bolstered by the signing of free agent - and former Livingston player - Sean Kelly.\nLivingston have a full squad to choose from as manager David Martindale targets the victory required to take his team to the summit.\n\"It gives the boys a chance to jump to the top, albeit Ayr and Falkirk have got games in hand,\" he said.\n\"I think we have got one of the best squads in terms of numbers and the quality within those numbers. I just feel we have a really strong 18.\n\"I've been pretty vocal about that all season so I really need to use the squad as much as possible and pick players who I think are going to have an impact.\"\nOctober's visit to Firhill ended goalless and Martindale is stressing the need for a top performance to extend Livi's unbeaten run to 10 games.\n\"I'm not really expecting anything different,\" he said. \"Whether it was Kris Doolan or Brian Graham in charge I know the challenge in front of us is going to be difficult and we need to be at our best if we want to take anything from the game.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c9dee6xnq8qo"}