{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:27:23", "date_modify": "2025-05-19 15:27:23", "date_publish": "2017-07-29 08:17:56", "description": "Britain's Jordanne Whiley reveals she was pregnant when she won her fourth successive Wimbledon women's wheelchair doubles title.", "filename": "sport_disability-sport_40762837_1747668443.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1D58/production/_97121570_gettyimagef.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_disability-sport_40762837_1747668443.html", "title": "Jordanne Whiley: Briton won Wimbledon wheelchair doubles while pregnant", "title_page": "Jordanne Whiley: Briton won Wimbledon wheelchair doubles while pregnant - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Britain's Jordanne Whiley has revealed she won her fourth straight Wimbledon women's wheelchair doubles title while 11 weeks pregnant.\nThe 25-year-old tweeted, external that she is expecting her first child with coach and boyfriend Marc McCarroll.\nShe and Japanese partner Yui Kamiji beat Marjolein Buis and Diede de Groot in the final at Wimbledon on 16 July.\n\"I thought: 'If we start trying in May I could still play Wimbledon - and it worked,\" she told The Mixed Zone., external\n\"But I had no idea how incredibly sick I'd be. For three days I couldn't leave the house.\n\"At the French Open, I was really, really ill - so sick I thought it was a stomach bug. Even the doctors thought it was a stomach bug.\n\"But by Wimbledon I was a little more prepared. I knew how to manage it.\nWhiley says she plans to be back on court \"in a year or 18 months\" and has not ruled out competing at the Tokyo Paralympics in 2020.\nIn January, Serena Williams won the Australian Open singles title eight weeks into her pregnancy.\nIt was the 35-year-old American's record-breaking 23rd Grand Slam singles title.", "url": "https://www.bbc.com/sport/disability-sport/40762837"}