{"authors": ["Nizaar Kinsella", "Sami Mokbel", "www.facebook.com"], "date_download": "2025-05-21 04:33:19", "date_modify": "2025-05-21 04:33:19", "date_publish": "2025-04-04 21:30:50", "description": "Ange Postecoglou gives an impassioned, detailed defence of his record while adding he is struggling with unique challenges at Tottenham.", "filename": "sport_football_articles_cy0x9w56x45o_1747801999.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b5ee/live/8e2367e0-117b-11f0-bef7-27730fea7c1a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy0x9w56x45o_1747801999.html", "title": "Ange Postecoglou says Tottenham receive less backing in media than other clubs", "title_page": "Ange Postecoglou says Tottenham receive less backing in media than other clubs - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ange Postecoglou says he is the \"only voice\" defending Tottenham - and that other clubs receive much more backing from pundits.\nThe 59-year-old head coach is under substantial pressure after his side's 16th Premier League defeat of the season at Chelsea on Thursday.\nSpurs host Eintracht Frankfurt in a Europa League quarter-final first leg next Thursday, with their progress in the competition likely a key factor in determining Postecoglou's future.\nIn a candid 40-minute conversation with the media on Friday, the Australian spoke about Tottenham needing more vocal internal and external support, why he will keep standing up to \"bully\" fans and how long he will last at the club.\nAgainst Chelsea, Postecoglou cupped his ear in the direction of the travelling Spurs fans after substitute Pape Sarr, whose introduction was booed four minutes earlier, scored an equaliser that was later disallowed after a lengthy VAR check.\nSky Sports pundit Jamie Redknapp criticised Postecoglou for the gesture. In response, the Australian highlighted the difference in the coverage of the two clubs.\n\"In the time I've been here, we've had two decisions that have gone for us against Liverpool and there has been a national campaign,\" he said.\nHe said it was telling the \"big story\" from the Chelsea defeat was his interaction with Spurs fans and how he has \"made things more difficult\" rather than about a match being \"materially changed by technology\".\nPostecoglou claimed this is part of a pattern of other major clubs having much more prominent pundit and ex-player voices in the media than Spurs.\n\"I never switch on the TV and hear any sort of strong voice,\" he said. \"The only voice you hear is me. When we're talking about the bigger clubs, there seem to be a lot more voices.\n\"There's never any sort of defending of the club or the club defending itself, which makes it even more difficult because every club goes through tough moments and it's how you react to them.\n\"That's a unique challenge, but I accepted that challenge so I've got to try to find a way to overcome it.\"\nWhen asked what Spurs could be doing better, Postecoglou said: \"By being more vocal. You probably hear too much from me, to be honest.\n\"It doesn't have to be just from people at the club. I hear plenty of people talking and defending other clubs. But it seems with Tottenham, wherever there's a sore, there's a real pile-on to sort of stick a finger in that sore and then we kind of accept our fate.\"\nPostecoglou has also confronted individual supporters away at Fulham and at home against Leicester this season.\nHe defended those actions and said he will continue to stand up for what he believes is \"right\" by challenging those trying to goad him into a reaction on camera.\n\"For young people, a phone is more dangerous than any weapon in the world,\" he said.\n\"Why are you holding up a phone? What are you trying to do? So you can put it on social media and say: 'Look, I got Ange Postecoglou to react, isn't that great?' I can take it. I don't care.\n\"What if they take that in the school yard? As soon as I see a phone, I'm going to react. I'm not going to accept it. I'm always going to do that.\n\"I'm just not at that stage in my life where I'm going to accept people trying to bully you or antagonise me or try to do things that show total disrespect.\"\nSpurs, who host bottom club Southampton on Sunday, are 14th in the Premier League table after 30 matches, 18 points behind fourth-placed Chelsea.\nMultiple sources have told BBC Sport that Postecolgou's position is under threat heading into the final weeks of the season as a consequence of a disappointing campaign.\nWinning the Europa League - which would be the club's first trophy since 2008 - would be a consideration in whether he remains in the job next season but well-placed sources have indicated it may not be the overriding factor.\nTension between sections of the Spurs fanbase and Postecoglou is expected to be among the issues discussed when the time comes to decide his future.\nAnd Postecoglou's tense relationship with fans is expected be among the factors discussed when time comes to decide the manager's future.\nAlso to be considered are the benefits of adopting a fresh approach under a new head coach to ensure the deficiencies that have contributed to such a poor campaign are not repeated.\nPostecoglou's future - and appointing a successor if a change is made - will be the most prominent issue for the Spurs hierarchy to resolve in the coming weeks.\nAsked if winning the Europa League is the only way to save his job, Postecoglou said: \"If people don't really see what I'm trying to do, then I don't think they're ever going to see it, so if a trophy is the only way - it seems to be the only way - OK, let's see if we can deliver that.\n\"I've almost lasted two years, which is pretty good for Tottenham. At some point, the club needs to stick to something.\"\nHe added: \"There's life after this for everybody, including Tottenham and including me.\"\nPostecoglou said he had been \"worn down\" by injuries, issues around VAR and mounting criticism this season.\n\"I'm a fighter so the bigger the fight, the more I enjoy that challenge,\" he said. \"But I can't fight against an invisible opponent, so that's the bit that's worn me down.\n\"I don't know how to tackle that. I can't tackle that.\"", "url": "https://www.bbc.com/sport/football/articles/cy0x9w56x45o"}