{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:37:58", "date_modify": "2025-05-21 05:37:58", "date_publish": "2025-04-01 06:44:54", "description": "The Investec Champions Cup returns with the last-16 on Friday and BBC Sport explores five things to look out for across the weekend.", "filename": "sport_rugby-union_articles_cg72977y3z2o_1747805878.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/47c9/live/929d94b0-0e62-11f0-ba12-8d27eb561761.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cg72977y3z2o_1747805878.html", "title": "Investec Champions Cup: Five things to look out for in last-16", "title_page": "Investec Champions Cup: Five things to look out for in last-16 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "After an 11-week hiatus, the Investec Champions Cup returns on Friday with a thrilling last-16 line-up.\nThe knockout stages get under way with English champions Northampton Saints taking on Clermont Auvergne under the lights at Franklin's Gardens.\nBBC Sport highlights five things to look out for across the weekend.\nSaracens have opted to pursue domestic success over their continental ambitions this season.\nThe three-time Champions Cup winners have decided to rest several of their England internationals, including Maro Itoje and Tom Willis, for their trip to Toulon.\nDirector of rugby Mark McCall says he is prioritising making the Premiership play-offs over the chance at a fourth European crown.\nNorthampton Saints, meanwhile, are the only English side with a home tie after finishing top of Pool 3.\nSaints are eighth in the Premiership table after enduring a dismal defence of their title, but Phil Dowson's side will host Clermont in a welcome reprieve from their domestic campaign.\nThe visitors are sixth in France's Top 14 table after their recent victory over La Rochelle ended a run of five consecutive league defeats.\nClermont booked their place in the knockout stages by snatching a dramatic 33-26 victory in the sixth minute of overtime to qualify at Bath and Bristol's expense.\nElsewhere, Sale Sharks face a daunting trip to six-time winners and defending champions Toulouse, who will be without injured talisman Antoine Dupont after he ruptured cruciate ligaments in his knee during France's Six Nations win over Ireland last month.\nHarlequins face an equally difficult task at four-time winners Leinster, while Leicester Tigers travel north to take on Glasgow Warriors.\nAll three Irish provinces which started in this season's competition have reached the knockout stages.\nLeinster lead the United Rugby Championship (URC) and will be targeting a fifth star on the jersey after finishing top of Pool 2 with a clean sweep of four comfortable wins.\nFly-half Sam Prendergast has stepped into retired colossus Johnny Sexton's shoes for club and country seamlessly, while the bulk of Ireland's first-choice pack, including Josh van der Flier and Caelan Doris, ply their trade in Dublin.\nMunster finished third in Pool 3 to qualify for the last 16 and they will reunited with their former fly-half Ronan O'Gara in the next round.\nThey will travel to the Stade Marcel-Deflandre to face the 2022 and 2023 champions La Rochelle, who are coached by O'Gara.\nIreland legends Peter O'Mahony and Conor Murray have retired from the international stage and will want to end their long-standing Munster careers this summer with silverware.\nUlster, meanwhile, won just one of their four Pool 1 games and scraped through to the knockout stages on points difference.\nThey will face an away trip to title contenders Bordeaux-Begles, who finished top of Pool 1 after four bonus-point wins, including a 40-19 victory when the two sides last met in December.\nDefending URC champions Glasgow are flying the Scottish flag in the last 16 after finishing second in Pool 4.\nWarriors, who are also currently second in the URC, will welcome Tigers to Scotstoun in fine form after pummelling Johannesburg Lions 42-0 in their most recent outing.\nGeorge Horne became the club's record try-scorer in their victory over the South African side, while Leicester were narrowly beaten by Saracens in their last Premiership match.\nTigers are third in the English top-flight and outgoing head coach Michael Chieka says he will work harder to achieve success domestically and in Europe before leaving the club this summer.\nBenetton, meanwhile, will make their last-16 debut after a surprise 32-25 victory over two-time champions La Rochelle in their final Pool 2 game.\nThe Italian side boast a large contingent of the Italy national team, including their fearsome centre partnership of Juan Ignacio Brex and Tommaso Menoncello.\nLike Italy, Benetton play a free-flowing brand of rugby and will pose a threat in their trip to French side Castres.\nIt could be another final between the tournament's two most successful sides on 24 May at Principality Stadium as Toulouse and Leinster both ended up on opposite sides of the draw.\nNorthampton will play a home quarter-final if they can navigate their way past Clermont, while a potential semi-final rematch from last year's competition could await against Leinster.\nHowever, a victory for Quins over Leinster and a Leicester win in Glasgow would also set-up an all-Premiership tie in the next round.\nQuarter-final draw (ties to be played on the weekend 11/12/13 April):\nBordeaux-Begles/Ulster v La Rochelle/Munster\nToulon/Saracens v Toulouse/Sale Sharks\nLeinster/Harlequins v Glasgow Warriors/Leicester Tigers\nNorthampton Saints/Clermont Auvergne v Castres or Benetton\nSemi-final draw (ties to be played on the weekend 2/3/4 May):\nBordeaux/Ulster/La Rochelle/Munster v Toulon/Saracens/Toulouse/Sale\nLeinster/Harlequins/Glasgow/Leicester Tigers v Northampton/Clermont/Castres/Benetton", "url": "https://www.bbc.com/sport/rugby-union/articles/cg72977y3z2o"}