{"authors": ["James Jones", "www.facebook.com"], "date_download": "2025-05-21 05:36:29", "date_modify": "2025-05-21 05:36:29", "date_publish": "2025-04-01 08:07:21", "description": "West Ham news: Opinion - Fan writer on Niclas Fullkrug's return", "filename": "sport_football_articles_cd6jqq8n6pdo_1747805789.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b0c2/live/79c50fe0-b62f-11ee-beb5-e1400df560f2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cd6jqq8n6pdo_1747805789.html", "title": "West Ham news: Opinion", "title_page": "West Ham news: Opinion - Fan writer on Niclas Fullkrug's return - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Niclas Fullkrug's return to the West Ham squad after three months out might just be a bigger boost that many are currently anticipating.\nThe German has endured a nightmare season in east London. Two long-term injuries, just two goals and an unconvincing presence up front under Julen Lopetegui have left a lot to be desired.\nThere is subsequently little expectation that his return will kick-start a run of positive results, or even an improvement in the 9.3 shots West Ham have averaged per game since Graham Potter joined the club.\nBut there is cause for optimism.\nBefore Fullkrug limped off with a hamstring injury just 15 minutes into Potter's first game, he played a vital role in Lucas Paqueta's opener and was proving to be an effective link-up with West Ham's midfield in possession.\nThe moment he was forced off, West Ham's attacking impetus changed and we just did not look as effective going forward. It was very clear that Fullkrug's style was well suited to the way Potter intended to play and his absence ever since has led to an ongoing struggle for attacking returns.\nHe is not expected to walk straight back into Potter's starting XI against Wolves on Tuesday, but he no doubt provides West Ham with something uniquely different that we know can work under the new manager.\nIf he can remain fit then his return is undoubtedly the boost we did not realise we needed at this stage of the season.\nWhile there is not much left to play for other than league position, ending the season strongly could be the catalyst for a positive summer of recruitment and the right mindset going into 2025-26.\nFullkrug might just be the guy to make that happen.", "url": "https://www.bbc.com/sport/football/articles/cd6jqq8n6pdo"}