{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:51:42", "date_modify": "2025-05-21 05:51:42", "date_publish": "2025-02-08 19:12:34", "description": "Blackburn vs Wolves predictions: Chris Sutton on FA Cup tie", "filename": "sport_football_articles_cgkjp8vpyj1o_1747806702.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/561d/live/fbee38e0-d1d4-11ef-87df-d575b9a434a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cgkjp8vpyj1o_1747806702.html", "title": "Blackburn vs Wolves predictions: Chris Sutton on FA Cup tie", "title_page": "Blackburn vs Wolves predictions: Chris Sutton on FA Cup tie - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "I am co-commentating at this game for the iPlayer, and I am really looking forward to going back to Ewood Park.\nPeople there always tell me the great Alan Shearer was lucky to play alongside me when we won the Premier League together, and I know Al says the same himself regularly too.\nThis is one of the ties where you think there is a chance of an upset, because of what Wolves boss Vitor Pereira might do - does he go full pelt, or rest a few?\nPereira will make some changes, I am sure of that, because staying in the Premier League will be his priority.\nRovers manager John Eustace has a different dilemma because I bet he would love to shuffle his squad to help their play-off bid, but he does not have the players to do it.\nEustace has done a phenomenal job to have them in and around the top six, despite not being given any help in terms of signings.\nScoring goals is Rovers' problem - Yuki Ohashi is out injured and Makhtar Gueye is not very prolific - and Andreas Weimann is their top scorer this season with eight.\nThey are solid enough, though, with the likes of Callum Brittain, who has probably been Blackburn's best player this season, alongside Dom Hyam and Danny Batth at the back. They have all been colossal.\nGetting Lewis Travis back from injury has been important too. He is their real driving force in the middle of the park.\nAs I say, I am not sure what the Wolves team selection will be like, but Pereira might want to build on last weekend's win over Aston Villa.\nBased on that, and the fact Blackburn play some good stuff but are not ruthless enough, this is another tie which could go the distance.\nSutton's prediction: 2-1 after extra time", "url": "https://www.bbc.com/sport/football/articles/cgkjp8vpyj1o"}