{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:33:01", "date_modify": "2025-05-21 07:33:01", "date_publish": "2025-05-20 14:51:37", "description": "Captain Ross Docherty one of 15 players leaving Dundee United", "filename": "sport_articles_c93ll4yvp4ko_1747812781.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c524/live/862a6db0-3587-11f0-9b2c-138cad92aeb3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c93ll4yvp4ko_1747812781.html", "title": "Captain Ross Docherty one of 15 players leaving Dundee United", "title_page": "Captain Ross Docherty one of 15 players leaving Dundee United - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Captain Ross Docherty is one of 16 players departing Dundee United.\nThe 32-year-old midfielder skippered the team to the Championship title last term but has struggled with injuries this season, making 15 starts, as United secured a fourth-place finish and European football.\nDocherty will exit with fellow first-team regulars Louis Moult and Declan Gallagher - whose exits were confirmed last month - with the Tannadice club hailing the trio as \"pivotal members\" who made \"priceless contributions\" in the second tier and top flight.\nNorth Macedonia midfielder David Babunski is on the way out too - after United opted not to trigger the option of a further year on his deal - along with winter signing Allan Campbell and loanees Lewis Fiorini and Ruari Paton.\nOn-loan Wrexham striker Sam Dalby, who was United's top scorer this term with 15 goals, and Luton goalkeeper Jack Walton will also leave.\nLuca Stephenson and Emmanuel Adegboyega will depart after impressing on loan from Liverpool and Norwich respectively.\nAnd Tony Watt, who spent the 2024-25 season on loan at Motherwell, will also leave this summer, as will academy graduates Ollie Simpson, Zeke Cameron, Adam Carnwath and Bryan Mwangi.\nIn a statement, United say they \"remain in contractual discussions with several players\" and will provide a further update.\nUnited fans, have the club made the right decision in cutting captain Docherty loose? Are there any other released players who should have been kept?", "url": "https://www.bbc.com/sport/articles/c93ll4yvp4ko"}