{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:21:03", "date_modify": "2025-05-21 07:21:03", "date_publish": "2025-03-30 00:00:00", "description": "Napoli beat AC Milan to remain within three points of Serie A leaders Inter Milan.", "filename": "sport_football_live_c3vwq45r4det_1747812063.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2f99/live/5afac9d0-0da7-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c3vwq45r4det_1747812063.html", "title": "Napoli beat AC Milan to keep pressure on Inter", "title_page": "Napoli 2-1 AC Milan: Serie A title race: Napoli beat AC Milan to keep pressure on Inter Milan - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Napoli beat AC Milan to remain within three points of Serie A leaders Inter Milan.\nAntonio Conte's side scored twice in the opening 19 minutes to look comfortable, but ended up hanging on.\nMatteo Politano scored with a sweet strike from towards the edge of the box and Billy Gilmour picked out Romelu Lukaku to scuff in their second.\nNinth-placed Milan pulled one back when Luka Jovic scored from close range, after Santiago Gimenez earlier had a penalty saved by Alex Meret.\nThey had several chances to equalise, with Jovic flashing a shot wide in injury time.\nThe visitors were without English midfielder Ruben Loftus-Cheek, who underwent surgery to have his appendix removed earlier in the day.\nDefending champions Inter remain three points clear after a 2-1 win over Udinese.\nMarko Arnautovic and Davide Frattesi scored their goals, with Oumar Solet pulling one back.\nAtalanta lost 1-0 at Fiorentina, with Moise Kean scoring the only goal, but boss Gianpiero Gasperini said his side were already out of the title race before that.\nThey sit third, nine points behind Inter.\n\"It was an impossible dream that I think disappeared in the game against Inter [on 16 March],\" Gasperini told reporters.\n\"Now we have teams that have made streaks of important results [below them]. We have a bit of an advantage and we will play five home games out of eight.\"", "url": "https://www.bbc.com/sport/football/live/c3vwq45r4det"}