{"authors": ["Tyrone Smith", "www.facebook.com"], "date_download": "2025-05-21 07:38:36", "date_modify": "2025-05-21 07:38:36", "date_publish": "2025-03-28 12:04:10", "description": "Scotland skip Bruce Mouat believes the pain he still feels from missing out on a medal at last year's World Championship is a good thing to take into this year's competition.", "filename": "sport_articles_cy4l58xe5j2o_1747813116.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9c22/live/9eb109a0-9084-11ef-bac8-a32b12f57a35.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cy4l58xe5j2o_1747813116.html", "title": "Mouat goes for fourth curling Worlds medal - watch on BBC", "title_page": "Bruce Mouat goes for fourth curling Worlds medal - watch on BBC - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Scotland skip Bruce Mouat believes the pain he still feels from missing out on a medal at last year's World Championship is a good thing to take into this year's competition.\nHis rink top the global rankings and will start as favourites when the event gets under way in Moose Jaw, Canada on Saturday.\nSpeaking to BBC Scotland last October, he admitting to taking himself away from curling and being \"embarrassed\" by how he played after his rink lost to Italy in the bronze medal match a few months earlier.\nBut now the 30-year-old thinks the experience could help as the team look to win a fourth medal at world level.\n\"That pain is not necessarily a bad thing to still feel,\" said Mouat. \"It is almost a good thing to remember how that situation felt at the time. To be able to grow from it is the more important part.\n\"Not wanting to feel that again is quite important for us and we know that we are good enough to get to those latter stages and at the latter stages we just want to perform a little better than we did last year.\"\nMouat's rink already has a remarkable haul of medals, among them Winter Olympic silver and world gold from 2023, the last time the competition was held in Canada.\nDespite their impressive list of achievements, the skip admits having the chance to play in Canada at a worlds again \"fills every single curler with excitement regardless of where you are from.\"\nHe explains: \"The only thing that would be better for us would be winning a World Championship in Scotland. Unfortunately, we have not had that opportunity yet, but fingers crossed at some point.\n\"Canada is definitely the next step down I suppose. The crowd understand the sport, they love all the curlers. It's maybe (like) Wimbledon for tennis. It's pretty cool.\"", "url": "https://www.bbc.com/sport/articles/cy4l58xe5j2o"}