{"authors": ["Clive Lindsay", "www.facebook.com"], "date_download": "2025-05-20 12:12:03", "date_modify": "2025-05-20 12:12:03", "date_publish": "2023-08-04 19:25:48", "description": "Louis Moult scores one and set up the other goals as Dundee United start their bid for a quick return to the top flight by beating hosts Arbroath 4-0.", "filename": "sport_football_66194452_1747743123.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/641A/production/_130662652_moult2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66194452_1747743123.html", "title": "Arbroath 0-4 Dundee United: Relegated visitors blow away derby rivals in opener", "title_page": "Arbroath 0-4 Dundee United: Relegated visitors blow away derby rivals in opener - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Louis Moult scored one and set up the other goals as Dundee United started their bid for a quick return to the Premiership by blowing away hosts Arbroath after a four-goal first half.\nWinger Glenn Middleton fired the opener as United pounced on Joao Balde's error on the counter-attack after 11 minutes.\nMatthew Cudjoe's clever chip was followed by clinical finishes from Craig Sibbald and striker Moult.\nArbroath rarely threatened as United eased to an opening-fixture victory.\nUnited have now recorded three straight wins after two early defeats in the Viaplay Cup group stage following last season's relegation - and have now come out on top in all 10 visits to nearby Gayfield since 1969.\nHaving narrowly avoided relegation last season, Dick Campbell's hosts look like they could be in for another struggle in this one.\nArbroath manager Dick Campbell: \"It's not like Arbroath to lose four goals so easily. They got their goals very easily. We did not lay a glove on them so I'm very, very angry about that.\n\"Dundee United were made to look good, albeit they were good. You've got to give credit to Dundee United - they looked very, very much the favourites tonight - but it'll be a different ball game the next time we play them.\"\nDundee United manager Jim Goodwin: \"We had brilliant travelling support and we really wanted to reward them for their efforts, not just for this season but towards the end of last season as well.\n\"It was a really disciplined performance. Some of the goals and the build-up play was excellent. I think Louis Moult is in there now trying to get his contract up to see if he's got an assist bonus - he's certainly got a goal bonus.\"", "url": "https://www.bbc.com/sport/football/66194452"}