{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:05:27", "date_modify": "2025-05-21 07:05:27", "date_publish": "2025-03-29 00:00:00", "description": "Dom Dwyer scores a second half winner as Mansfield Town heap more relegation pressure on Bristol Rovers.", "filename": "sport_football_live_czdn6n60g3pt_1747811127.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/887a/live/98184890-0afc-11f0-97d3-37df2b293ed1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_czdn6n60g3pt_1747811127.html", "title": "Bristol Rovers 1-2 Mansfield Town", "title_page": "Bristol Rovers 1-2 Mansfield Town - Stags win keeps Pirates in trouble - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Mansfield Town's spirited second-half performance was the foundation for their victory against Bristol Rovers in a error-strewn encounter at the Memorial Stadium.\nRovers gifted their Nottinghamshire visitors the lead within mere seconds of kick-off as a poor pass from goalkeeper Jed Ward was intercepted by forward Will Evans, with his low cross enabling Caylan Vickers to prod into the open goal, even after fumbling his first shot.\nThe lead lasted 25 minutes as Pirates midfielder Romaine Sawyers swept a low shot into the far corner from the edge of the area – set up by Shaq Forde – for his first goal for the Gas.\nBut another error, a short back pass from Rovers defender Connor Taylor, was pounced on by midfielder Keanu Baccus, who poked the ball on to substitute Dom Dwyer to put into the open net, with Ward drawn from goal after 59 minutes.\nWard also pulled off two good stops to deny Evans scoring on the spin and a Dwyer close-range header, as the visitors carved out good chances after the break.\nAnd Christy Pym saved a well-hit Isaac Hutchinson volley after 77 minutes as Rovers pushed for a late equaliser that failed to arrive.", "url": "https://www.bbc.com/sport/football/live/czdn6n60g3pt"}