{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:23:35", "date_modify": "2025-05-20 12:23:35", "date_publish": "2023-08-04 14:31:19", "description": "Defender Shaquanda Greene-Noel announces she will leave Celtic Dragons and step aside from Trinidad and Tobago duties to pursue a masters degree.", "filename": "sport_netball_66408950_1747743815.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/25DF/production/_130659690_gettyimages-1553384452.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_netball_66408950_1747743815.html", "title": "Shaquanda Greene-Noel to leave Celtic Dragons and take Trinidad and Tobago break", "title_page": "Shaquanda Greene-Noel to leave Celtic Dragons and take Trinidad and Tobago break - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Defender Shaquanda Greene-Noel has announced she will leave Celtic Dragons to pursue a masters degree.\nThe Trinidad and Tobago co-captain is currently at the Netball World Cup in South Africa and played in the Calypso Girls' 70-55 loss to Wales.\nGreene-Noel, 27, joined Dragons for the 2022 season and topped the statistics for most turnovers (119) that campaign.\n\"I've made a tough but easy decision to prioritise completing my masters,\" she said on social media.\nGreene-Noel added that she would also be standing down from international duties to allow more time for her studies, family, her business and travelling.\n\"Thank you so much to the Celtic Dragons management and staff, and my netball sisters for accepting me as part of the family for the past two years,\" Greene-Noel said.\n\"My teammates are my forever sisters. I always speak highly about our culture and what we were able to achieve on and off the court. You took a risk on an unknown Caribbean girl, and I'm forever grateful.\n\"It's been an honour and privilege to wear the Trinidad and Tobago (uniform) for the past five years, let alone captain the girls to three major tournaments.\n\"I pray that everything I stand for has impacted the girls positively, facilitates change, and creates opportunities for future Calypso Girls.\"", "url": "https://www.bbc.com/sport/netball/66408950"}