{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:44:50", "date_modify": "2025-05-20 14:44:50", "date_publish": "2023-07-27 21:02:42", "description": "Derry City beat KuPS in the Europa Conference League second qualifying round while Crusaders draw with Rosenborg and Linfield lose to Pogon Szczecin.", "filename": "sport_football_66332560_1747752290.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/BA8B/production/_130555774_ciancele.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66332560_1747752290.html", "title": "Europa Conference League: Candystripes win as Crues draw but Blues defeated", "title_page": "Europa Conference League: Candystripes win as Crues draw but Blues defeated - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Derry City came from behind to beat KuPS 2-1 in the first leg of the Europa Conference League second qualifying round.\nCian Kavanagh scored the first-leg winner at the Brandywell after Will Patching's leveller.\nBJ Burns struck the equaliser to secure a 2-2 home draw for Crusaders against Rosenborg.\nBut it was night to forget for Linfield as they lost 5-2 to Pogon Szczecin at Windsor Park.\nThe Blues fell behind to a penalty in the 14th minute - Matthew Clarke's attempted clearance ricocheted off Luka Zahovic and as he bore down on goal the Linfield skipper could only bring the Slovenian international down.\nFormer Hull City winger Kamil Grosicki sent Chris Johns the wrong way from the resultant spot kick.\nThe visitors doubled their lead on 40 minutes and once again, it was an avoidable goal from Linfield's perspective. Grosicki sent in an outswinging corner which Portuguese midfielder Joao Gamboa met on the volley at the near post with the ball going through a crowd of players and past Chris Johns.\nLinfield got back into the tie on 55 minutes when Kirk Millar's inswinging free-kick was fumbled under no real pressure by Pogon keeper Dante Stipica and defender Daniel Finlayson found the top corner with a clever curling finish from 12 yards.\nMatthew Fitzpatrick had an effort ruled out for offside before the Poles almost immediately scored a third goal on 63 minutes. Kamil Grosicki's corner was flicked goalwards and Chris Johns made an alert save but the ball dropped to Mariusz Malec, who had time to take a touch before blasting home from six yards.\nAnd within three minutes it was 4-1 as Pogon broke quickly and full-back Linus Wahlqvist's cut-back was converted at the near post by Greek striker Efthymis Koulouris.\nLinfield pulled a second goal back with 10 minutes left when Kirk Millar's cross was only half-cleared and the ball dropped for defender Ben Hall to steer home a shot from 15 yards.\nKirk Millar had a goal chalked out for offside in the closing stages before Pogon added a fifth deep in stoppage time when Mariusz Fornalczyk converted from close range.\nCrusaders go to Norway still with a chance of qualifying for the third round after drawing with Rosenborg at Seaview.\nThe Crues got off to a dream start when last season's top goalscorer Philip Lowry fired home on 10 minutes after a clever flick-on by Adam Lecky.\nThe lead would last 18 minutes before Carlo Holse produced the goal of the game, turning Lowry in midfield before driving towards the Crusaders goal and unleashing an unstoppable finish into Jonny Tuffey's goal.\nSvein Maalen's men would go into the interval in the lead after Daniel Larmour was adjudged to have handled the ball inside the area on the 41st minute by referee Evangelos Manouchos - Ole Saeter made no mistake from the spot.\nBJ Burns' equaliser came 17 minutes from time after the full-back's strike from distance took a huge deflection off Erlend Reitan that wrong footed Andre Hansen in the Rosenborg goal.\nStephen Baxter's men had further chances to find the net against the Norwegians after Paul Heatley's nearpost effort hit the woodwork on the 15th minute and in the second half the winger would go close again when his volley flew narrowly wide of Hansen's far post.\nOte Sauter wasted a big chance for the visitors to put the game to bed midway through the second half when the forward found himself one-on-one with Jonny Tuffey but could only drag his shot wide.\nFinnish side KuPS took the lead after they were awarded a penalty seconds before the break when Mark Connolly was judged to have handled Urho Nissila's strike inside the box. Axel Vidjeskog took the resulting spot-kick, sending Brian Maher the wrong way.\nPatching levelled the tie on the 69th minute when the midfielder connected with substitute Paul McMullan's looping pass and produced a powerful header which found the back of the net.\nTen minutes later the Candystripes took the lead - Michael Duffy played a superb ball to Kavanagh at the backpost and he fired home from close range.\nThe hosts had a flurry of chances to score earlier and hit the woodwork twice in the first half.\nPatrick McEleney also had a good chance to make Derry's advantage greater but his attempt was denied by busy keeper Johannes Kreidl.", "url": "https://www.bbc.com/sport/football/66332560"}