{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:15:36", "date_modify": "2025-04-26 06:15:36", "date_publish": "2025-03-01 21:48:40", "description": "Ospreys secure a dramatic victory away to reigning champions Glasgow Warriors in the United Rugby Championship thanks to Jack Walsh's late penalty.", "filename": "sport_rugby-union_articles_c78ejqgy96wo_1745648136.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/00ac/live/e554ddf0-f6e6-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_c78ejqgy96wo_1745648136.html", "title": "URC: Ospreys stun champions Glasgow Warriors with last-gasp penalty", "title_page": "URC: Ospreys stun champions Glasgow Warriors with last-gasp penalty - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Ospreys secured a dramatic victory away to reigning champions Glasgow Warriors in the United Rugby Championship thanks to Jack Walsh's stoppage-time penalty.\nIt leaves Warriors 13 points adrift of leaders Leinster, while Ospreys move up to 11th thanks to a first away win in Glasgow for nine years.\nWarriors had ground their way back into the game after tries from Morgan Morse, Kieran Hardy and Sam Parry gave the Welsh visitors an early commanding lead.\nThe three missed conversions from Dan Edwards failed to press home the advantage and Glasgow ate into the lead thanks to tries from Jack Mann, Patrick Schickerling, who grabbed a double, and Facundo Cordero despite a Keelan Giles reply.\nWhen Cordero put Glasgow in front for the first time after the break, Hardy touched down to restore Ospreys' advantage, but Nathan McBeth's try and Duncan Weir's conversion looked to have snatched victory for the hosts until Walsh kicked the deciding kick after a turnover.\nAn away win looked very much on the cards after Morse, Hardy and Parry scored unanswered tries in the first 17 minutes, with the visitors twice making the most of rolling mauls to cross.\nMann and Schickerling both broke through the Welsh ranks to get the home side back in the game, but Ospreys ensured the bonus point before the interval when Giles touched down in the corner after an impressive burst of pace.\nEdwards converted, but Schickerling ran under the posts to cross again in the final minute of the half and Weir added his second conversion to reduce the deficit to three points.\nThere was a major lull in scoring in the second half before the drama of the closing stages.\nIt took until the 73rd minute for Glasgow to make their pressure count as Cordero got the ball down to put Warriors in front.\nOspreys were back in front two minutes later when Hardy put the ball down between the posts after a break through the middle. Walsh added the extras to put the Welsh side five points ahead.\nThe game swung again when McBeth went over and Weir kicked his third conversion.\nHowever, Sean Kennedy failed to get the ball into touch after the restart and Warriors were penalised at the turnover to allow Walsh the kick for glory with the final moment of the game.\nGlasgow Warriors head coach Franco Smith: \"We are always going to be disappinted with the defeat, but they showed character with the way they came from behind and stuck to the process.\n\"They did themselves proud with the number of players we were without tonight. The victory would have been good, but they will learn from this.\"\nOspreys head coach Mark Jones: \"The whole game was a rollercoaster ride. It was a stressful evening.\n\"There was some naivity from us and switching off, but we got there in the end. They are the champions and we knew we would have to be at our best and we were not far off it in that first half.\"", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/c78ejqgy96wo"}