{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:14:03", "date_modify": "2025-05-20 13:14:03", "date_publish": "2023-08-01 00:00:00", "description": "Follow the latest transfer rumours as Bayern Munich continue Harry Kane pursuit, Chelsea are linked with Kylian Mbappe and Al-Hilal bid for Victor Osimhen.", "filename": "sport_live_football_66369204_1747746843.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/D03E/production/_130601335_split2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_football_66369204_1747746843.html", "title": "Transfer news latest: Harry Kane, Kylian Mbappe & Victor Osimhen", "title_page": "Transfer news latest: Harry Kane, Kylian Mbappe & Victor Osimhen - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "See you all again tomorrow\nWe're finished for another day, but we'll be back bright and early in the morning with more news from the footballing world.\nBefore we go, we'll leave you with some of our top stories from today.\nSaudi window closing after Europe not helpful - Klopp\nFive youngsters eyeing Premier League big break\nVelez players claim fans threatened to shoot them\n'We opened doors for equality' - Tearful Marta on her legacy\nEngland sweep past China\nChina 1-6 England\nLauren James added two more goals to her Women's World Cup tally as England put in a superb display in a 6-1 win over China.\nWatch the highlights from the thumping victory as the Lionesses secured top spot in Group D to set up a last-16 clash with Nigeria.\nRead Emma Sanders' full match report here.\nChelsea begin Sanchez talks\nToday's gossip column\nChelsea continue to fuel the transfer rumour mill. Here is a selection of the stories coming out of Stamford Bridge featured in today's gossip column:\nChelsea have begun formal talks with Brighton over signing 25-year-old Spain goalkeeper Robert Sanchez. (Talksport), external\nBrighton have not responded to Chelsea's opening offer for Sanchez. (Athletic - subscription), external\nChelsea want £45m for English defender Trevoh Chalobah, who is set to leave after they agreed a deal for 25-year-old France defender Axel Disasi. Inter Milan are interested in Chalobah. (Evening Standard), external\nWest Ham to walk away from Ward-Prowse deal\nToday's gossip column\nWest Ham's rebuild following the departure of Declan Rice to Arsenal continues at a slow pace.\nThe Guardian, external reports that the Hammers are ready to walk away from a deal to sign Southampton's £40m-rated England midfielder James Ward-Prowse after having a second bid rejected for the 28-year-old.\nMeanwhile, Talksport, external say that West Ham have rejected a £17m offer from Inter Milan for 24-year-old Italy striker Gianluca Scamacca.\nBreakthrough prospect - James McAtee\nManchester City midfielder\nMantej Mann\nBBC Sport\nBreaking into a side that became only the second in English history to win the Treble last season will be no easy task, but that will be the target for James McAtee, 20.\nThe Salford-born midfielder is a creative force with a goal threat. A product of the Manchester City youth set-up, McAtee scored in last month's win over Bayern Munich during an impressive pre-season.\nHe played an influential role and scored nine goals in 37 loan appearances, including 21 starts, as Sheffield United secured automatic promotion back to the Premier League in 2022-23.\nCity are not short of world-class midfielders such as Kevin De Bruyne, Bernardo Silva and Phil Foden, but McAtee will be eager to emulate fellow academy graduate Rico Lewis, who stepped up to the first team with aplomb last season after being promoted by Pep Guardiola.\nWatch: USA & Netherlands progress\nWomen's World Cup\nEarlier, defending champions USA scraped a 0-0 draw against Portugal to progress to the last 16.\nUSA finished second in Group E, but were almost dumped out as Portugal hit the post in stoppage time.\nThe Netherlands secured top spot in Group E with a thumping 7-0 victory over Vietnam.\nTheir last 16 opponents are still to be decided.\nEngland into last 16 of Women's World Cup\nChina 1-6 England\nEngland are through to the last 16 of the Women's World Cup after beating China 6-1 to finish top of Group D.\nGoals from Alessia Russo, Lauren Hemp, Chloe Kelly, Rachel Daly and a Lauren James double secured the three points.\nThe Three Lions will now take on Group B runners-up Nigeria on Monday for a place in the quarter-finals.\nGroup D runners-up Denmark beat Haiti 2-0 to secure their progress and will play co-hosts Australia next, also on Monday.\n'Kane rules out Spurs exit once season starts'\nHarry Kane has reportedly made a decision to stay at Tottenham if talks with Bayern Munich are not concluded before the start of the season.\nThe England captain, according to the Standard, external, will remain at Spurs and see out the final year of his contract if he lines up in their opening Premier League game against Brentford on 13 August.\nThe report states that Spurs are refusing to set a deadline on transfer talks with Bayern, with the window not closing until 23:00 BST on Friday, September 1, meaning Kane's stance may be part of an effort to persuade the club to make a quick decision over his future.\nBreakthrough prospect - Simon Adingra\nBrighton & Hove Albion winger\nMantej Mann\nBBC Sport\nBrighton have a successful record of unearthing young talent as academy graduate Evan Ferguson, 18, and summer signing Julio Enciso, 19, both broke into the first team last season.\nIvorian winger Simon Adingra, 21, could be the latest to emerge, having demonstrated he is a composed marksman with the pace to stretch defences.\nHe scored 10 league goals in 30 appearances on loan at Belgian side Union SG last season, following his move to Brighton from Danish club Nordsjaelland for around £6m in June 2022.\nThe 21-year-old has yet to make his competitive debut for the Seagulls, but he demonstrated prowess with both goals in Brighton's recent pre-season win over Brentford.\nBreakthrough prospect - Kobbie Mainoo\nManchester United midfielder\nMantej Mann\nBBC Sport\nKobbie Mainoo is the teenager causing a stir among Manchester United fans after a promising pre-season, in which he started four games.\nThe technically gifted academy graduate is a holding midfielder, who can be utilised in other roles, with a calmness and poise in possession which belies his years.\nThe 18-year-old came off the bench in last season's win over Leicester to make his Premier League debut in February, and manager Erik ten Hag looks set to keep the teenager at Old Trafford this season rather than send him out on loan.\nMainoo will miss the start of the campaign after suffering an ankle injury against Real Madrid in pre-season, but expect him to challenge for a spot in the United side when he returns to fitness.\nBreakthrough prospect - James Trafford\nBurnley goalkeeper\nMantej Mann\nBBC Sport\nBurnley's James Trafford could well be a future England number one.\nThe 20-year-old goalkeeper starred for the Young Lions as they won the European Under-21 Championship this summer and the Clarets have brought him to Turf Moor from Manchester City in what could prove to be a club record deal worth £19m.\nAn incredible shot stopper, Trafford kept a record six clean sheets in the Euros triumph and brilliantly saved a late penalty before keeping out the rebound in the final win over Spain.\nTrafford is expected to compete for a regular slot with Arijanet Muric, who was a mainstay in goal for the Clarets as they won the Championship title at a canter last season.\nBreakthrough prospect - Cameron Archer\nAston Villa forward\nMantej Mann\nBBC Sport\nAston Villa forward Cameron Archer, 19, has what it takes to trouble top-tier defenders.\nBlistering speed, close ball control and an eye for goal - Archer was influential on loan in Middlesbrough's run to the Championship play-offs last season, scoring 11 goals in 20 games.\nOllie Watkins is likely to lead the line again after excelling for Unai Emery's side last term, but Archer could be deployed alongside the more experienced 27-year-old or as a deputy from the bench if it is decided he will remain at Villa Park.\nHe scored the opening goal of England's winning campaign at the Under-21 Euros this summer and will be looking to add to his previous eight appearances in the top flight, which all came as a substitute after the 80-minute mark.\nPremier League 2023/24 breakthrough prospects\nThe start of the month brings into focus the return of the Premier League, which begins on 11 August.\nBut who will be looking to make their mark in the English top flight? Which new faces could be the next Evan Ferguson or Rico Lewis?\nBBC Sport's Mantej Mann profiles five youngsters looking to break through in the 2023-24 season.\nThe players selected will be aged 21 or under when the first ball of the new campaign is kicked.\nSpurs offer tickets to displaced Ukrainian families\nTottenham v Shakhtar Donetsk (Sun, 14:00 BST)\nSimon Stone\nBBC Sport\nTottenham are to give tickets for Sunday’s pre-season match with Shakhtar Donetsk to families in north London who have been displaced by the war in Ukraine.\nThe game has been arranged to help raise funds for Shakhtar’s charitable arm.\nTottenham have said they will make a \"financial contribution’\" in addition to net proceeds from ticket sales.\nChildren from displaced Ukrainian families will be mascots at the game.\nUkrainian pop star Olya Polyakova will sing her country’s national anthem before kick-off.", "url": "https://www.bbc.com/sport/live/football/66369204"}