{"authors": ["Laura Kirk-Francis", "www.facebook.com"], "date_download": "2025-05-21 06:04:19", "date_modify": "2025-05-21 06:04:19", "date_publish": "2025-04-01 15:42:04", "description": "Arsenal news: Opinion - Fan writer on return of Bukayo Saka", "filename": "sport_football_articles_cm2e9zj25rgo_1747807459.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/fbf6/live/712e8270-b626-11ee-beb5-e1400df560f2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cm2e9zj25rgo_1747807459.html", "title": "Opinion - Fan writer on return of Bukayo Saka - BBC Sport", "title_page": "Arsenal news: Opinion - Fan writer on return of Bukayo Saka - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "With Premier League football returning for Arsenal, Mikel Arteta has a tricky job on his hands balancing the run-in with Champions League ambitions.\nOn Monday, Arteta confirmed Bukayo Saka, who has not played for Arsenal since before Christmas, is fit to return to face Fulham. The immediate reaction from fans has been first excitement and relief. Saka has been an enormous miss for the Gunners for the past few months. He will surely receive a rapturous welcome back should he play.\nHowever, the majority of fans will still have one eye on the upcoming Champions League quarter-final against Real Madrid. This is one of the biggest games in Arsenal's recent history, and the type of match-up fans have been craving.\nThere are two games before that: Fulham and then the trip to Goodison Park on Saturday. Sure, seeing Saka back will be great, but there is a sense the more important fixture is still a week away.\nThis is a delicate situation. While chasing down Liverpool is unlikely, the last thing Arsenal need is to be dragged into a scrap for the top four. Arsenal are currently nine points above fourth-placed Chelsea, but will need their attention on the Champions League if they are to win any silverware this season.\nThe Premier League title might be all but lost, but Arsenal cannot afford to take their eye off these next few games entirely.\nSaka is the player Arsenal need the most to overcome the Spanish champions. As such, fans will be urging Arteta to manage his return carefully and proceed with caution.", "url": "https://www.bbc.com/sport/football/articles/cm2e9zj25rgo"}