{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:01:39", "date_modify": "2025-05-21 06:01:39", "date_publish": "2025-04-01 22:16:20", "description": "Arsenal 2-1 Fulham: Mikel Arteta reacts to win", "filename": "sport_football_articles_c0el13wyp2wo_1747807299.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8c69/live/d867bd10-0f46-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c0el13wyp2wo_1747807299.html", "title": "Arsenal 2-1 Fulham: Mikel Arteta reacts to win", "title_page": "Arsenal 2-1 Fulham: Mikel Arteta reacts to win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Arsenal boss Mikel Arteta, speaking to Sky Sports about goalscorer Bukayo Saka: \"Good opportunity to see how much people love him and missed him.\n\"When you are away it's good to understand who you are as a person and the reception was magnificent. He lifted the stadium, he deserved it and he deserved it because he does things every day. Good example.\n\"It was for the team who helped him during the rehab. It was a good moment. It's about energy and when the stadium is behind the team and showing support and encouragement it lifts the whole place. Exactly what we need.\n\"We deserved to win the game. We were dominant but it's true we conceded the goal because we didn't defend the box well enough. When you concede a goal two minutes to go in the Premier League you hang in there for the rest.\n\"We expected this [from Fulham], well coached, difficult to get through. Have to be patient and aggressive, our front line was and [Gabriel] Martinelli had a good game.\n\"We are strong as a team, the culture is strong, the willingness to adapt and go for it is also there.\"\nOn Gabriel: \"We are worried because he never wants to come off. He's not sure about how big it is and what it is exactly.\nOn if it was a hamstring injury: \"He felt something there yes.\"\nOn whether he is a doubt for Real Madrid: \"It depends, the way he is normally, difficult but lets see.\"", "url": "https://www.bbc.com/sport/football/articles/c0el13wyp2wo"}