{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:40:56", "date_modify": "2025-04-26 06:40:56", "date_publish": "2025-03-02 13:13:45", "description": "'St Mirren ran Celtic close for long periods of the game'", "filename": "sport_articles_cly7zpvdd8lo_1745649656.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d55f/live/f58c8f20-f762-11ef-9e61-71ee71f26eb1.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cly7zpvdd8lo_1745649656.html", "title": "'St Mirren ran Celtic close for long periods of the game'", "title_page": "'St Mirren ran Celtic close for long periods of the game' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "We asked for your views on St Mirren's 5-2 defeat against Celtic.\nHere's what some of you said:\nDouglas S: Once again, Saints denied a stonewall penalty when 3-2 down. VAR never intervened - but that's the reason we have it. Had it been at the other end Celtic would have got a penalty. Saints were brilliant but must take their chances.\nDouglas M: Easy to look at this result and think that Saints were routed by a good Celtic team, but the reality was that Saints certainly didn't deserve a 5-2 defeat. The teams were much closer than the finishing margin. Yes, Celtic improved after the substitutions, but Saints ran them close for long periods of the game.\nJohn: Yet again done out of a clear penalty when we were 3-2 down. What's the actual point of having VAR?\nStephen: We were marvellous in our press, just a little bit wasteful in front of goal. Denied another stone wall penalty by VAR. We need VAR to actually work to have a chance in a game like this!\nAlistair: Our boys put in so much effort and if Toyosi Olusanya finishes any of those three chances, we would have got what we deserved. On the other side, the decision not to give a penalty is ridiculous, the officials seemed to have taken no time at all to dismiss it.", "url": "https://www.bbc.co.uk/sport/articles/cly7zpvdd8lo"}