{"authors": ["Amy Lofthouse", "www.facebook.com"], "date_download": "2025-05-21 06:34:28", "date_modify": "2025-05-21 06:34:28", "date_publish": "2025-03-31 05:22:42", "description": "Czech teenager Jakub Mensik beats childhood idol Novak Djokovic to win the Miami Open, having come close to withdrawing hours before his first-round match with a knee injury.", "filename": "sport_tennis_articles_cwyn3lj1qxdo_1747809268.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9574/live/d3b49260-0ddf-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_tennis_articles_cwyn3lj1qxdo_1747809268.html", "title": "Miami Open 2025 results: Jakub Mensik stuns Novak Djokovic to win title and deny Serb a 100th singles title", "title_page": "Miami Open 2025 results: Jakub Mensik stuns Novak Djokovic to win title and deny Serb a 100th singles title - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Czech teenager Jakub Mensik beat childhood idol Novak Djokovic to win the Miami Open, having come close to withdrawing with a knee injury hours before his first-round match.\nMensik, 19, went to the referee's room to announce his withdrawal before his opener against Roberto Bautista Agut on 20 March, but the official was out for lunch.\nHe then went to the physiotherapist to ask them to fill in paperwork confirming his withdrawal, but was persuaded to stay on.\n\"I couldn't walk, I couldn't run,\" he said. \"I started to treat it, started to take painkillers. Nothing was helping.\n\"I was visiting the referee's office to say 'guys, I'm pulling out', but he was having lunch.\"\nMensik went to a physiotherapist, who deemed the injury not to be serious and began treatment to enable him to compete.\n\"After a few minutes I started to feel a little relief,\" said Mensik, who has risen to a career-high 24th in the world rankings.\n\"I took different painkillers, which helped a little bit. I was like, 'OK, let's try it. It's like 30 minutes before the match. I can walk. I can run. Let's see'.\n\"Somehow I won the first round and then I had one day off, which of course, for my knee was much better. Day by day the knee was getting better and with that also my game.\"\nMensik dropped just two sets on his run to the final, which included victories over British number one Jack Draper and fourth seed Taylor Fritz.\nHe clinched a first ATP Tour title with a 7-6 (7-4) 7-6 (7-4) win over Serbia's Djokovic on a sticky, humid night in Florida.\nDjokovic, a 24-time Grand Slam champion, had been bidding to become just the third man in the Open era to win 100 singles titles.\nHowever, the 37-year-old's wait will go on after his loss to Mensik, who was just 10 months old when Djokovic won his first title in 2006.\nMensik is the ninth-youngest Masters 1000 champion and the second-youngest in Miami after Carlos Alcaraz.\nHe is another rising star in the men's game, possessing a huge serve and a thumping backhand that has taken him inside the world's top 50.\nDjokovic invited Mensik to practice with him after the 2022 Australian Open when he was still a junior, and Mensik said in his winner's speech that Djokovic was \"the reason I am here\".\nHe said: \"It's just crazy and unbelievable what he's achieving in this sport during long period of the time.\n\"Imagine me in 20 years from now, when I will be 39, playing the finals? I hope so, but it's crazy to think about it like this.\"\nFourth seed Djokovic warmly congratulated Mensik at the end of the match and said afterwards: \"It hurts me to admit it but you were better.\n\"I wish you the best of luck. Maybe you'll let me win one of the next times we play.\"\nIt has been some rise for Mensik, who broke into the top 100 in February 2024 by reaching the Qatar Open final.\nIn Miami he beat three top-10 players in Djokovic, Britain's Draper and American Fritz to lift the biggest title of his career, and handled the pressure of the occasion well.\nAfter a five-and-a-half hour rain delay before the final, settling into a rhythm was not easy, but Mensik adjusted quicker than Djokovic.\nHe broke Djokovic at the first opportunity and his first serve popped as he rushed out to a 4-1 lead.\nDjokovic, by contrast, had a rough start. He fell twice, had to apply eye drops after being bothered by swelling under his right eye and resorted to using sawdust to help him grip his racquet in the humidity.\nHowever, his serve improved as the set progressed and his backhand slice in particular trouble Mensik, who eventually handed the break back.\nA tie-break felt inevitable and Djokovic paid for a poor start to it, although he saved two set points before Mensik smashed his way to the opener.\nThe match was following a similar pattern to their previous meeting in Shanghai last year, when Mensik took the first set on a breaker before fading in the next two.\nHowever, this time he kept up the intensity. Mensik did not face a break point in the second set and the heat and humidity began to take a toll on Djokovic.\nBreathing heavily and wiping his face on a towel between every point, Djokovic could only watch as Mensik sent three excellent serves past him to force a tie-break, before the Serb whacked his thigh with his racquet after dropping the opening point in it.\nIf the point was short, then it was Djokovic who came out on top. But Mensik dug in to the long rallies, sending Djokovic darting around at the back of court and ultimately setting up three match points.\nThe first one went by as Djokovic sent a superb return right onto the baseline, but Mensik ensured a fitting end with a serve out wide to clinch the second.\nHe will now rise to a career-high of 24th in the world rankings.\nFor Djokovic, the wait for a first ATP title since 2023 goes on, but there were signs that his serve in particular has improved under coach Andy Murray.", "url": "https://www.bbc.com/sport/tennis/articles/cwyn3lj1qxdo"}