{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:14:53", "date_modify": "2025-05-21 05:14:53", "date_publish": "2025-04-03 19:59:09", "description": "Former Manchester United defender Brandon Williams says it \"hurts watching football\" after being without an employer since last summer.", "filename": "sport_football_articles_c8rgl751k0ko_1747804493.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c53c/live/55c42040-10bf-11f0-8636-fb1329c86f58.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c8rgl751k0ko_1747804493.html", "title": "Brandon Williams: Ex-Manchester United defender ready to return to the game", "title_page": "Brandon Williams: Ex-Manchester United defender ready to return to the game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Manchester United defender Brandon Williams says it \"hurts watching football\" after being without a club since last summer.\nWilliams was released by boyhood team Manchester United at the end of the 2023-24 season after his contract expired and has spent this campaign watching the game from the outside.\nThe 24-year-old's last appearance came in December 2023 during a loan spell with Ipswich.\nIn March, Williams admitted to a charge of dangerous driving - he had been caught in August 2023 doing almost 100mph before crashing his car in Cheshire.\n\"I go into this mode where I just don't care,\" Williams said on Ben Foster's Fozcast podcast, external.\n\"I have this switch where I don't care what happens. They [family and friends] wanted me to get back to football but they could see I'd fallen out of love with.\n\"It hurts me watching football now because I just want to be there, I just want to play. I miss being in a team, on the coach, travelling to games, having meals together and just doing things.\"\nWilliams came through Manchester United's academy to make his senior debut under Ole Gunnar Solskjaer in 2019.\nThe left-back made 51 appearances, including two in the Champions League, but struggled to tie down a regular spot and spent time on loan at Norwich and Ipswich.\nHe featured under Kieran McKenna at Ipswich but the former Manchester United coach sent Williams back to his parent club after seeing that \"something wasn't right\".\n\"I had a few problems going on off the pitch at the end of the year,\" Williams said.\n\"He [McKenna] said 'get yourself sorted and come back as Brandon'.\n\"When I did come back to Manchester, things increased off the pitch with family problems and friend problems.\"\nWilliams will be sentenced for his dangerous driving charge on 9 May at Chester Crown Court.\nHe was caught driving in an erratic manner and at up to 99mph in a 70mph zone. In March, the court heard he was seen with a balloon at his mouth.\nThe CPS said a female passenger was seen filming them at one point on her phone, adding that it was clear to witnesses that Williams' Audi was out of control before colliding with another car.\nWilliams was breathalysed but the test was negative.", "url": "https://www.bbc.com/sport/football/articles/c8rgl751k0ko"}