{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:45:33", "date_modify": "2025-05-20 12:45:33", "date_publish": "2023-07-25 19:09:48", "description": "West Bromwich Albion bring in Brighton's Ecuador international winger Jeremy Sarmiento on a season's loan.", "filename": "sport_football_66308113_1747745133.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/103E3/production/_130513566_sarmi.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66308113_1747745133.html", "title": "Jeremy Sarmiento: Brighton winger becomes West Brom's first summer signing", "title_page": "Jeremy Sarmiento: Brighton winger becomes West Brom's first summer signing - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "West Bromwich Albion have made Brighton & Hove Albion winger Jeremy Sarmiento their first summer signing.\nThe 21-year-old Ecuador international has joined the Baggies on a season's loan - just 11 days before the start of the new Championship campaign.\nAlbion's close season market moves had so far only involved Dara O'Shea and Karlan Grant leaving the club.\nThey released Jake Livermore and Tom Rogic at the end of last season, after coming ninth in the Championship.\nHaving said they would only be looking at signing players on loan because of a cash-flow shortage, boss Carlos Corberan now has his first summer capture.\n\"I am very pleased to have signed a talented player from a Premier League club,\" he said. \"He is an exciting player, who has great maturity for someone so young.\n\"The fact he has already played in the Premier League and at a World Cup gives me the confidence that he has the personality and desire required to keep developing his skills.\n\"He is a versatile attacker who can play on either wing, as well as through the middle as a 10. His flexibility to play to a high standard in three different positions will be important.\"\nMadrid-born Sarmiento, who was in the Charlton Athletic academy, made 12 appearances in the Premier League for the Seagulls last season, as well playing in all group fixtures at the 2022 World Cup in Qatar.", "url": "https://www.bbc.com/sport/football/66308113"}