{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:40:36", "date_modify": "2025-04-26 03:40:36", "date_publish": "2025-03-05 09:50:45", "description": "Wrexham: Phil Parkinson's side 'did what they normally do' at Huddersfield - Waynne Phillips", "filename": "sport_football_articles_c4ged88y30eo_1745638836.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ca47/live/e5074670-f994-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c4ged88y30eo_1745638836.html", "title": "Wrexham: Phil Parkinson's side 'did what they normally do' at Huddersfield", "title_page": "Wrexham: Phil Parkinson's side 'did what they normally do' at Huddersfield - Waynne Phillips - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Waynne Phillips hailed Wrexham's ability to capitalise on big moments after they kept the pressure on League One's top two with victory over Huddersfield Town.\nSteven Fletcher scored the decisive goal - his seventh of the campaign - shortly after coming off the bench against the Terriers at the John Smith's Stadium on Tuesday night.\nThe win keeps Phil Parkinson's side two points adrift of the automatic promotion places with 12 third-tier matches remaining this season.\n\"We've ticked another game off and we're down to the last 12,\" Phillips told BBC Radio Wales Breakfast.\n\"I think it was an important win because Huddersfield being close to Wrexham in the table, should they have won last night they'd have been a point behind Wrexham.\n\"Wrexham did what they normally do, they hang on in games and they wait for that moment.\n\"Yet again, Steven Fletcher coming off the bench. How often have we seen that this season? It was his first touch of the ball.\n\"To see the joy of the 1,000 Wrexham fans that made the journey, it was a joy to be around them.\"\nWrexham are in the midst of a hectic schedule, with Parkinson's men hosting Rotherham United on Saturday before travelling to Reading three days later.\nThen comes the mouthwatering fixture with Wycombe Wanderers - currently second in the table - at Adams Park on 15 March in a contest that seems likely to have a big bearing on the race for promotion to the Championship.\n\"All Wrexham need to do is take each game at a time,\" added Phillips.\n\"They've got to back last night's excellent win at Huddersfield with a home victory at the Racecourse on Saturday, somewhere where games haven't been going particularly well over the last month.\n\"The games just keep coming and before we know it we'll be at Wycombe a week on Saturday in what could be a massive game in League One.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c4ged88y30eo"}