{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:35:06", "date_modify": "2025-04-26 04:35:06", "date_publish": "2025-02-28 12:28:36", "description": "Lincoln are doing all they can to keep captain and \"warrior\" Paudie O'Connor, but Imps director or football Jez George admits that may not be enough.", "filename": "sport_football_articles_cnvzz4q4gjqo_1745642106.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/641b/live/4cf90bc0-f5cf-11ef-85ee-0589f92b739a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cnvzz4q4gjqo_1745642106.html", "title": "Paudie O'Connor: Lincoln City 'doing everything' to keep captain, says Jez George", "title_page": "Paudie O'Connor: Lincoln City 'doing everything' to keep captain, says Jez George - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Lincoln City are doing all they can to keep captain and \"warrior\" Paudie O'Connor, but Imps director or football Jez George admits that may not be enough.\nThe 27-year-old Irish defender is into the final four months of his contract and is in talks about his future with the mid-table League One side.\nDespite constantly being linked with a potential move to numerous League One rivals and Championship clubs, which reportedly included a £250,000 bid from Plymouth, external in January, O'Connor has remained an instrumental figure for the Imps.\nHe has made135 appearances for the club since arriving in 2022 as a free agent after leaving Bradford City - where he turned down the offer of a new contract.\n\"Paudie is the big focus at the moment,\" George said in a wide-ranging interview with BBC Radio Lincolnshire.\n\"I understand the the frustration that supporters may have - we are not daft, we know how good he is, we know how important he is.\n\"He is an unbelievable leader, what he has done for us over three years - but especially over the past 12 months - how he has grown, he is fearless, he is a warrior, he makes first contact, and there are games where the way he defends his box is incredible.\n\"Are we talking to Paudie, of course you wold expect us to do that and of course we are doing that, but the challenge is that he is 27-years-old and the next contract is going to be a really big one; a pivotal one in his career.\"\nGeorge says Lincoln, a club that generated just under £7m in revenue and reported a financial loss of £2.9m for last season, lack the money to compete with what O'Connor could potentially be offered elsewhere.\n\"If I tell you that the top six, eight or 10 clubs in this league have got double our budgets, therefore they can pay players double what we can, and that is the truth,\" George added.\n\"It's a really difficult one for us. We are trying to and are doing everything in our power to keep Paudie at our club, but we have to respect his situation and the fact it's his career as well.\"\nThe constant attention on O'Connor meant the Imps \"kept plates spinning\" in the winter transfer window.\n\"January always creates problems and when transfers start getting to the levels they did, then someone could put something on the table that was impossible for us to turn down,\" George sad.\n\"That didn't happen, but it could have done.\n\"I don't want to play this out in public, I just want the supporters know that we are doing what they want us to do and doing that really respectfully with Paudie because we couldn't have more respect for him as a player and as a man.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cnvzz4q4gjqo"}