{"authors": ["Constantin Eckner", "www.facebook.com"], "date_download": "2025-05-21 04:49:34", "date_modify": "2025-05-21 04:49:34", "date_publish": "2025-01-23 13:22:10", "description": "Omar Marmoush: German football writer Constantin Eckner analyses new Man City forward", "filename": "sport_football_articles_cn93jrzyv28o_1747802974.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/257c/live/72c3c430-d978-11ef-a37f-eba91255dc3d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cn93jrzyv28o_1747802974.html", "title": "Omar Marmoush: German football writer Constantin Eckner analyses new Man City forward", "title_page": "Omar Marmoush: German football writer Constantin Eckner analyses new Man City forward - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The most important question for fans is how new £59m forward Omar Marmoush may be used at Manchester City, especially after another Champions League collapse at Paris St-Germain on Wednesday.\nFollowing the sale of Julian Alvarez last summer, City have had only one genuine striker this season following the sale of Julian Alvarez to Atletico Madrid during the summer. Erling Haaland has only been substituted twice in the Premier League. Otherwise, he has played every single minute thus far this season.\nThe excessive use of the Norwegian, as important as he is to City, does not seem sustainable.\nHence, Marmoush might be the one to carry some of the load up front. But paying this kind of sum for a glorified back-up would be unreasonable. Instead, Marmoush could also work well in a two-striker set-up with Haaland.\nAt Eintracht Frankfurt, he occasionally featured on the wings, While he is nowhere near the dribbler Jeremy Doku or Savinho is, he brings a certain degree of cleverness on the flank.\nStriker might be Marmoush's prime position, but his versatility is a big plus.\nIt is easy to understand why Guardiola fancies a tactically flexible and smart forward like him.", "url": "https://www.bbc.com/sport/football/articles/cn93jrzyv28o"}