{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:57:51", "date_modify": "2025-05-21 06:57:51", "date_publish": "2025-01-31 07:31:47", "description": "Wrexham sign two strikers, Sam Smith from League One rivals Reading and Jay Rodriguez from Burnley.", "filename": "sport_football_articles_cly9dn91zrjo_1747810671.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/14b7/live/87ece460-dff7-11ef-bd1b-d536627785f2.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cly9dn91zrjo_1747810671.html", "title": "Wrexham sign strikers Sam Smith and Jay Rodriguez", "title_page": "Wrexham sign strikers Sam Smith and Jay Rodriguez - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wrexham have completed the signings of strikers Sam Smith and Jay Rodriguez.\nSmith, 26, has arrived from League One rivals Reading for an undisclosed fee, understood to be a club record and breaking the £1m barrier for the first time in the club's history.\nRodriguez, 35, also joins for an undisclosed fee, in his case from Championship side Burnley, until the end of the 2025-26 season.\nSmith, who has signed a three-and-a-half-year deal with the option of an additional year, said: \"I'm excited to be a part of the journey now and I want to try to help the club achieve its ambitions.\n\"I hope I can use my experience to help every single player in the squad and gain something from the group as well.\"\nRodriguez drops from the Championship to join Wrexham having also played more than 150 games in the Premier League.\nThe once-capped England striker said: \"To join the story that has evolved at Wrexham with clear targets is exciting for me.\"\nWrexham boss Phil Parkinson said of Rodriguez: \"He's an experienced striker with real quality and we're looking forward to working with him.\"\nParkinson has been keen to strengthen his frontline as Wrexham, who are owned by Hollywood stars Ryan Reynolds and Rob McElhenney, bid for promotion to the Championship.\nHe described Smith, who has 11 goals this season, as \"a fantastic addition to the squad\".\n\"Sam is a player we've been pursuing for a while,\" Parkinson added. \"He's a striker who's done really well over the last few seasons and he's at a great age.\"\nSmith came through the Reading academy after he was released by Manchester United and made his senior debut for the Royals in August 2017.\nHe subsequently had loans spells with Bishop's Stortford, Oxford United, Shrewsbury Town, Cambridge United, Tranmere Rovers and Cheltenham Town.\nSmith left Reading at the end of his contract in the summer of 2021 and joined Cambridge on a permanent deal.\nAfter two seasons at Cambridge he rejoined Reading in July 2023.\nSmith scored 27 goals in 63 games during his second spell with Reading, including 11 this season.", "url": "https://www.bbc.com/sport/football/articles/cly9dn91zrjo"}