{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:45:33", "date_modify": "2025-05-21 05:45:33", "date_publish": "2025-04-02 13:48:45", "description": "BBC's Brian McLauchlin answers your Hearts questions", "filename": "sport_articles_c3v9lwr97n3o_1747806333.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6dd9/live/be76e6d0-0fc6-11f0-b234-07dc7691c360.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c3v9lwr97n3o_1747806333.html", "title": "BBC's Brian McLauchlin answers your Hearts questions", "title_page": "BBC's Brian McLauchlin answers your Hearts questions - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "BBC Scotland football reporter Brian McLauchlin has been answering some of your questions on Hearts.\nAnoni asked: Any inkling about how Hearts would vote in any league reconstruction proposals? And as a fan-run club, would they lean toward listening to the general fan support for some sort of league expansion?\nBrian answered: It's only a few years ago, during the dark days of Covid, that Ann Budge and the Hearts board submitted suggestions for a change in the current league set-up. Of course this came about after the league was halted and led to Hearts - and Partick Thistle and Stranraer - being relegated when arguably other options were available.\nOne of the main reasons for this current discussion is the new format for European football and the extra fixtures that come with this. And given the fact Hearts will be hopeful in the coming years of participating at this level I would suggest a small reduction in the number of league fixtures would be welcome.\nI also feel that given that Hearts are now a fan-owned club, although not fan run, the Foundation of Hearts would be canvassed for their opinion.\nAlistair asked: Given that the January window was arguably Hearts' best in a long time - and with big earners out of contract in the summer - how big can the partnership with Jamestown Analytics be for Hearts' prospects next season?\nWilliam asked: Where do you think Hearts need to strengthen next season?\nBrian answered: The partnership with Jamestown Analytics may have come as a surprise and been questioned about its merits by many fans, but within the 'football industry', it is looked upon as a game changer for Hearts long term.\nEveryone will have their own views on recruitment being either good, bad or indifferent, but put plainly, its success will only be determined by results on the pitch and whether the level of investment in players can be looked on as good value.\nJamestown Analytics is deemed to be one of the world leaders on data and recruitment. The examples of Brighton down south and Union St-Gilloise in Belgium are the two most high-profile examples of success.\nBut these successes didn't happen overnight and I think it will take possibly another three or four transfer windows before we see the full benefits of this at Tynecastle.\nWork is already underway with regards new recruits in the summer. The right-back area has been a troublesome one over the past few seasons and I would fully expect some movement in that position.\nI would also not rule out at least one new striker coming in and the midfield to be bolstered. However, decisions will have to be made about who is offered the opportunity to stay on and, like all good recruitment models, a budget has to be adhered to and ensure there is no overspend.\nGreig asked: If you had a magic wand and there was one thing you could bring into this Hearts team from the past, what would it be and why?\nBrian answered: Great question. When I look back at the 1998 team, that was special. Jim Jefferies cultivated a squad over a four or five-year period with a mixture of youth and experience that was able to create their own piece of history by winning the Scottish Cup.\nThere were many excellent individuals in the squad, the likes of Colin Cameron and David Weir plus young talent such as Gary Naismith and Paul Ritchie; they were truly a team of terrific players.\nOn cup final day, 10 of the 14 Hearts players used were Scots while Gilles Rousset, Stephane Adam, Thomas Flogel, with the now sadly departed Stefano Salvatori giving the squad the foreign twist. One of the best Hearts teams I have ever seen.", "url": "https://www.bbc.com/sport/articles/c3v9lwr97n3o"}