{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:02:11", "date_modify": "2025-05-21 05:02:11", "date_publish": "2025-04-04 09:37:07", "description": "Scotland to face Maori All Blacks, Fiji and Samoa on summer tour", "filename": "sport_articles_c0qn0n44zypo_1747803731.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/11ef/live/0349b140-1137-11f0-8874-0979deb646d0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c0qn0n44zypo_1747803731.html", "title": "Scotland to face Maori All Blacks, Fiji and Samoa on summer tour", "title_page": "Scotland to face Maori All Blacks, Fiji and Samoa on summer tour - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Head coach Gregor Townsend is ready for a \"unique and special experience\" this summer after Scotland confirmed tour matches against Maori All Blacks, Fiji and Samoa.\nThe South Pacific tour marks Scotland's first matches in New Zealand for 25 years and kicks off against the Maori All Blacks - who edged the sides' previous meeting 18-15 in 2000 - on 5 July in Whangarei.\nThen comes a game against Fiji in Suva on 12 July, followed by a return to New Zealand to take on Samoa in Auckland six days later.\nAs the trip coincides with the British and Irish Lions' tour of Australia, Townsend will be deprived of some key players, but he still expects to have an \"experienced group\".\n\"It's the first time since 2000 that we've been to New Zealand and spending time in a country with such a deep rugby culture is a unique and special experience,\" Townsend said.\n\"Playing against the Maori All Blacks will be a proper introduction to New Zealand rugby and they will provide a strong test, especially in the contact area.\n\"Fiji have shown over the past few seasons that they are a rising force in world rugby and will relish the chance of playing a Six Nations country at home.\n\"Samoa are one of the most physical teams in world rugby with how hard they hit in the tackle. They were very competitive at the World Cup in 2023 and secured an impressive win over Italy last summer.\"\nScotland announced in February they will host USA, New Zealand, Argentina and Tonga in their autumn series.", "url": "https://www.bbc.com/sport/articles/c0qn0n44zypo"}