{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:55:22", "date_modify": "2025-05-21 05:55:22", "date_publish": "2025-01-14 11:18:58", "description": "Wales and Luton defender Tom Lockyer wants to get to the same stage as Christian Eriksen's return to football where \"people don't talk about what happened to him\".", "filename": "sport_football_articles_ce8n82w286xo_1747806922.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/45c1/live/3cca95e0-cde1-11ef-9014-67394afce866.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ce8n82w286xo_1747806922.html", "title": "Tom Lockyer: Luton and Wales defender targets football return", "title_page": "Tom Lockyer: Luton and Wales defender targets football return - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wales and Luton defender Tom Lockyer wants to get to the same stage as Christian Eriksen's return to football, where \"people don't talk about what happened to him\".\nLockyer has twice collapsed on the pitch with heart problems, including a cardiac arrest, and was days away from a return to action before suffering an ankle injury in December.\nManchester United midfielder Eriksen suffered a cardiac arrest playing for Denmark at Euro 2020 but resumed his career in February 2022.\n\"Christian Eriksen is like a hero of mine for obvious reasons,\" said Lockyer who is campaigning for more supporters to learn CPR.\n\"When people talk of Christian Eriksen now they don't talk about what happened to him which was live on TV at the Euros and was massive news for the next couple of years.\n\"They just see him now as an incredible footballer who's plying his trade at the top level so that's where I want to get to.\"\nThe 30-year-old Welshman accepts there are no guarantees.\n\"Obviously you need to get back on the pitch for that to happen and that'll have to be done safely but I'm working with the same cardiologist that Eriksen used and everything was looking good until the ankle gave way,\" he added.\nLockyer remains hopeful he can make a return to football.\n\"Time's not on my side, when you start pushing 30 you start thinking the clock is counting down, can this be achieved?\" he said.\n\"But I'm a positive person, I wouldn't be wasting everyone's time if I didn't think that was possible.\n\"I'm going to give it my best shot, but what will be will be.\"\nCardiff-born Lockyer first collapsed with atrial fibrillation during Luton's Championship play-off final win against Coventry in May 2023.\nHe then made a full comeback but suffered his cardiac arrested during a Premier League game against Bournemouth in December 2023.\nLockyer's comeback plans have been derailed by ankle surgery but his experiences mean he is remaining positive.\n\"I was three days away from playing my first game back and sadly had a little incident in training and needed an operation on my ankle,\" he told BBC Wales Sport.\n\"When it rains, it pours but I'm a positive guy so the glass is always half-full.\n\"What have I got to moan about, I'm lucky enough to be here today and sadly that's not the case for so many.\"", "url": "https://www.bbc.com/sport/football/articles/ce8n82w286xo"}