{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:34:07", "date_modify": "2025-04-26 03:34:07", "date_publish": "2025-03-08 00:00:00", "description": "Follow live text commentary, score updates and match stats from Liverpool vs Southampton in the Premier League", "filename": "sport_football_live_c984988rzelt_1745638447.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cba2/live/b4e35030-fc3f-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_c984988rzelt_1745638447.html", "title": "Liverpool vs Southampton: Premier League preview, team news, stats & head-to-head", "title_page": "Liverpool vs Southampton: Premier League preview, team news, stats & head-to-head - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Mohamed Salah scored two penalties as Liverpool came from behind to beat rock-bottom Southampton for the second time this season and move 16 points clear at the top of the Premier League.\nThe Reds were miles below their best after their energy-draining late win at Paris St-Germain on Wednesday - but all that matters at this stage of the season is results.\nThis takes them one step closer to the title and leaves Saints still in danger of the lowest Premier League points total ever.\nThe visitors allowed themselves to dream when Will Smallbone took advantage of a huge mix-up between Virgil van Dijk and Alisson to slot in from a tight angle.\nBut Reds boss Arne Slot made a triple substitution at half-time and Liverpool were much improved.\nDarwin Nunez, perhaps fortunate not to be one of the ones replaced at the break, slotted in from Luis Diaz's cutback.\nAnd then the Uruguayan striker was fouled by Smallbone for a penalty, which Mohamed Salah predictably dispatched with style.\nLiverpool fans started singing \"now you're going to believe us, we're going to win the league\" after that.\nSalah also netted another spot-kick late on, for his 27th goal of the season, after the video assistant referee spotted a Yukinari Sugawara handball.\nSecond-placed Arsenal have two games in hand - including Sunday's match with Manchester United - but it is impossible to see anyone overhauling Liverpool.\nBoth sides made six substitutes as Southampton lost captain Jan Bednarek to an early head injury - with football laws allowed the opposing team to also make an extra substitution during the game.\nOn paper this looked like the most obvious home win ever.\nThere were 58 points between the sides coming into this game, the biggest gap between teams since Liverpool beat Aston Villa in July 2020.\nAnd Liverpool - with Slot in the stands because of a touchline ban - started brightly with Curtis Jones having an early shot blocked and then shooting wide.\nThat matched their total shot count in the 1-0 smash-and-grab win in Paris in midweek.\nBut perhaps the energy expended in that game was taking its toll here.\nSouthampton created several chances before grabbing the lead following a hugely uncharacteristic mix-up between two of their stars.\nVan Dijk tried to hold off Smallbone to let the ball run to Alisson, but the keeper did not come out quickly enough and moments later the Saints midfielder was scoring.\nBut Liverpool improved in the second half after making their substitutions - with Slot allowed in the dressing room at the break - including the introduction of Harvey Elliott.\nThe midfielder scored with his first touch at PSG and almost did so again but was denied by Aaron Ramsdale.\nBut the Reds had a good grip on the game by then with Uruguay striker Nunez - who could have been sent off in the first half for a bad foul on Kyle Walker-Peters - scoring after good play by Diaz and then winning the penalty for Salah's winner.\nSalah had a shot saved and Elliott fired wide as they tried to add a game-clinching third, which eventually came in the form of another penalty by Liverpool's Egyptian icon.\nThis is the champions elect's only Premier League game in March.\nNow they focus on the second leg of their Champions League tie against PSG on Tuesday and Sunday's Carabao Cup final with Newcastle as they bid for three trophies.\nSouthampton still remain two points behind the lowest tally ever recorded in Premier League history - Derby's infamous 2007-08 campaign in which they ended on 11 points.\nThe Saints have led Liverpool twice this season - they were 2-1 up at St Mary's before losing 3-2 earlier in the campaign.\nThey have had other near misses too, including at Old Trafford when Manchester United's Amad Diallo scored three goals after the 80th minute.\nIvan Juric's side, at half-time here, looked in with a chance of becoming only the fifth team bottom of the table to ever beat the team top at the time in the Premier League.\nBut sadly for their fans, they conceded twice in three minutes early in the second half and, while they did keep having a go, they rarely looked like equalising before Salah made the win safe.", "url": "https://www.bbc.co.uk/sport/football/live/c984988rzelt"}