{"authors": ["Brian McLauchlin", "www.facebook.com"], "date_download": "2025-05-21 04:14:41", "date_modify": "2025-05-21 04:14:41", "date_publish": "2025-04-05 20:40:39", "description": "Halkett desperate to return for 'exciting' Hearts run-in", "filename": "sport_articles_cvg7r0l7k19o_1747800881.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/421f/live/b4664d80-1173-11f0-bef7-27730fea7c1a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cvg7r0l7k19o_1747800881.html", "title": "Halkett desperate to return for 'exciting' Hearts run-in", "title_page": "Halkett desperate to return for 'exciting' Hearts run-in - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "An \"exciting\" season finale is driving Hearts' centre-back Craig Halkett back to fitness after a couple of injury-hit campaigns.\nThe 29-year-old has managed just 27 league appearances across three seasons, with 12 of those coming this year.\nHalkett returned to action towards the end of 2024 before suffering a hamstring injury in their game against Kilmarnock at the end of January.\n\"I think it goes under the radar a little bit how tough it is to get back from such a big injury,\" Halkett said. \"I've fallen on the wrong side of that and picked up a few things since I've been back.\n\"The last six or seven weeks have been frustrating but I've worked hard. The rehab has been intense and tough. So I'm feeling fit and feeling good and ready to go.\n\"It was hard, this season especially. I came back in pre-season feeling great. I managed to get in the team and then found myself out for a few months which was frustrating.\n\"I worked hard every day, got back in and just around Christmas I felt the best I'd felt in a long time. Playing well, doing well. The last thing I thought would happen was pick up another injury but unfortunately it happened.\n\"I've worked so hard these last five or six weeks to get on with myself and as best shape as possible. I'm feeling fit and ready to go.\"\nNow, the former Livingston man is racing to be back fit for the closing stages of the season - including Hearts' Scottish Cup semi-final against Aberdeen later this month.\n\"I think that's something that's drove myself and the other injured players to work hard and get back fit as soon as we can,\" he added. \"We haven't rushed things by all means but we've worked hard.\n\"The thought of a semi-final and potentially a final to play for and top six in European places, it could be a really exciting end of the season. There's a lot to play for and it's an exciting time.\"", "url": "https://www.bbc.com/sport/articles/cvg7r0l7k19o"}