{"authors": ["Steve Sutcliffe", "www.facebook.com"], "date_download": "2025-05-21 03:40:55", "date_modify": "2025-05-21 03:40:55", "date_publish": "2025-04-06 22:58:42", "description": "John Higgins comes from 8-5 behind to beat Mark Selby 10-8 in a gripping Tour Championship final in Manchester.", "filename": "sport_snooker_articles_cp8jkr20re8o_1747798855.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4c41/live/91a24d20-1336-11f0-8233-8d235cb8e207.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_snooker_articles_cp8jkr20re8o_1747798855.html", "title": "Vintage Higgins beats Selby in Tour Championship final", "title_page": "Vintage Higgins beats Selby in Tour Championship final - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "An emotional John Higgins produced a vintage display to defeat fellow four-time world champion Mark Selby 10-8 in a compelling Tour Championship final in Manchester.\nThe Scot dominated the early stages on Sunday to lead 5-1 but appeared on the ropes when Selby reeled off seven consecutive frames to hold an 8-5 advantage in a high-quality encounter.\nHowever, from there, Higgins who turns 50 next month, exhibited his fighting qualities, crafting breaks of 110, 67 and 84 as he edged back in front at 9-8.\nVictory was sealed with a sublime 132 clearance as Higgins collected the top prize of £150,000 and his second ranking title in as many months after a four-year drought.\n\"You are playing a monster of a player,\" said Higgins. \"To be 5-1 up and to be frozen out to be 8-5 behind, you don't come back and win five in a row against Mark Selby normally.\n\"I managed to do it, so it was incredible.\n\"It is incredibly difficult. You are just hitting a brick wall and I've done it so many times against him over the years.\n\"He just plays incredible stuff. It was my best ever win.\"\nIt was a stunning performance from Higgins, who appeared shorn of confidence in a mid-match wobble when a rampant Selby scored 767 points to his 66 during a seven-frame burst.\nAt that stage it looked as though his only consolation would be to keep hold of the £10,000 high break prize alongside a runner-up cheque of £60,000.\nInstead, Higgins concluded the match with its eighth century to equal the record for a best-of-19 contest.\nIn doing so, he delivered an ominous warning that he simply cannot be discounted when the World Championship begins on 19 April.\nWhile no player has won the Tour Championship and gone on to triumph at the Crucible in the same season, Higgins will take some stopping if he can replicate this form.", "url": "https://www.bbc.com/sport/snooker/articles/cp8jkr20re8o"}