{"authors": ["Kal Sajad", "www.facebook.com"], "date_download": "2025-05-21 07:13:29", "date_modify": "2025-05-21 07:13:29", "date_publish": "2025-03-30 05:32:53", "description": "World champion Mikaela Mayer outpoints Briton Sandy Ryan for the second time to defend her WBO welterweight title in Las Vegas.", "filename": "sport_boxing_articles_c7vn5dm1g6do_1747811609.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1d11/live/a6483530-0d20-11f0-9d67-b3f7d88b24b4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_boxing_articles_c7vn5dm1g6do_1747811609.html", "title": "Mayer vs Ryan 2: American defends title with Las Vegas points win", "title_page": "Mayer vs Ryan 2: American defends title with Las Vegas points win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "World champion Mikaela Mayer outpointed Briton Sandy Ryan for the second time to defend her WBO welterweight title in Las Vegas.\nAmerican Mayer, 34, was the deserved winner in an entertaining rematch between the two bitter rivals.\nAfter some close early rounds, she dominated the middle of the fight with her higher punch output, shot selection and body work.\nRyan, 31, came back strong towards the end, landing some hurtful punches as blood streamed down Mayer's face following a clash of heads at the Fontainebleau.\nBut with scores of 97-93, 97-93 and 98-92, the Californian won by a unanimous decision over 10 rounds.\n\"I thought it was close. I thought I was doing well into the start and then I got into a fight,\" she said.\nMayer dethroned Ryan on points in September, a result which was marred by the Englishwoman being hit by a can of red paint before leaving for the venue in New York.\n\"The women are getting better and better - me and Sandy just set the new bar on what competitive fights should look like,\" said Mayer, who extends her record to 21 wins from 23 bouts.\nShe called for an undisputed fight against Welshwoman Lauren Price, who holds the three other welterweight world titles, next.\nDerby fighter Ryan - who said she fought with too much emotion and anger following the \"hit and run\" paint attack in the first encounter – cut a relaxed figure for the rematch as she casually strutted to the ring to One Love by Bob Marley and the Wailers.\nThe defending champion was equally composed as both boxers made a quick start. Mayer doubled up on her jab and controlled the distance but was countered by Ryan's efficient timing and hooks.\nMayer connected with a right and left in the fourth, before landed flashy combinations and hurtful uppercuts to dominate the fifth and sixth as world champions Claressa Shields and Katie Taylor, as well as Terence Crawford and Shakur Stevenson, watched from ringside.\nHer former trainer Kay Koroma was in Ryan's corner. \"Come on, wake up,\" he told his fighter.\nA dispute over the training team, with Mayer claiming her opponent \"stole\" her coach, is what first sparked a feud between the two boxers.\nWith Mayer in complete control, it appeared Ryan - who had just three stoppage wins to her name - needed a knockout heading towards the end of the bout.\nRyan landed a thudding right and uppercut on Mayer's injured eye, but she replied with some clean power punches, in a terrific, all-action ninth.\nAs expected, there was no easing of animosity or embrace at the final bell. Ryan shrugged at the result as an exuberant Mayer celebrated the victory.", "url": "https://www.bbc.com/sport/boxing/articles/c7vn5dm1g6do"}