{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 15:03:05", "date_modify": "2025-05-20 15:03:05", "date_publish": "2023-07-27 00:00:00", "description": "Watch live coverage and follow text updates as Scotland face Denmark in the Men's T20 World Cup Europe Qualifier in Edinburgh.", "filename": "sport_live_cricket_66150333_1747753385.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_cricket_66150333_1747753385.html", "title": "Watch: T20 World Cup Europe Qualifier: Scotland qualify for finals", "title_page": "Watch: T20 World Cup Europe Qualifier: Scotland qualify for finals - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Goodbye!\nScotland beat Denmark by 33 runs\nAnd now, for an afternoon of small celebrations before the final match of the tournament against Ireland tomorrow.\nBoth sides have already qualified for the World Cup finals next summer, but they'll tell you it's anything but a dead rubber.\nCan Scotland crown their success off with a win here at The Grange, or will Ireland spoil the party?\nJoin us tomorrow to find out. See you then.\nBerrington extremely proud of players\nScotland beat Denmark by 33 runs\nScotland skipper Richie Berrington tells the media: \"I'm feeling pretty good right now. That was the goal at the start of the tournament, so delighted for this group of players. It's really well deserved for the work and performances we've put in consistently.\n\"I'm extremely proud and one we'll enjoy. It would be nice to finish tomorrow with a big win against Ireland.\n\"It wasn't an easy wicket. Credit to Denmark, they bowled well and it was effective. I gave myself a chance to get in, those first few balls. Brando keeps you on your toes, running between the wicket.\n\"It's one we're looking forward to. Scotland v Ireland is always a good battle and we've had some close games in recent times.\"\nSCOTLAND QUALIFY FOR THE WORLD CUP!\nScotland beat Denmark by 33 runs\nScotland skittle Denmark in the final few overs to confirm their top two finish in the Regional Finals of the European Qualifiers!\nThey have performed fantastically over the last six days, dancing around any banana skins that they easily could have slipped on.\nThere's been some huge knocks and some terrific bowling spells - and they've made this qualification tournament look pretty easy.\nThey will be in the Caribbean and the United States next summer!\nWICKET Mahmood c Currie b Sharif 2\nDenmark 119-6 (target 160)\nInto the final over, and there's suddenly a celebratory feel around the Grange Club. Scotland have all but confirmed their place.\nA reverse paddle goes for a single. The next ball goes high into the air and Brad Currie is under it again. Denmark have tried to go big and Scotland have punished them.\nWhat an over!\nDenmark 118-6 (target 160)\nIt's not a hat-trick ball.. Abdul Hashmi clips away to Brandon McMullen and runs a quick single...\nRun out chance! McMullen with the direct hit! It's a very loud appeal but it's not out! Musa Mahmood managed to get in.\nOne over left and it is... mathematically possible, sort of.\nWICKET Thanikaithasan c Greaves b Currie 22\nDenmark 115-5 (target 160)\nScotland are on the brink of clinching their passage to the T20I World Cup next year.\nCurrie delivers a slower ball and Thanikaithasan tries to sweep out to the leg side. It's high. Greaves and Sharif circle underneath... and it's the former who buries it to his chest. Denmark are capitulating.\nPost\nDenmark 102-3 (target 160)\nBrad Currie comes back on... just two runs conceded from it and that means 58 runs are needed from the last four overs. That's encouraged the Scotland fans in attendance - they know that's a big ask.\nThe fielders are quick to take their place for the next over. They want this done as quickly as possible.\nfor Hamid Shah\nDenmark 100-3 (target 160)\nGavin Main's first ball is dispatched onto the top of the media tent by Shangeev Thanikaithasan. A superb shot, right out of the middle of the bat, that had a few of us journalists - myself included - cowering.\nHamid Shah joins the party, slicing one over point for a big six. And it takes him to the 50! The Danish fans cheer - they've missed their skipper.\nIt's been a resilient effort from Denmark so far - they've brought up the 100.\nSolid but slow from Danes\nDenmark 84-3 (target 160)\nIt's not outwith the realms of possibility, but a run rate of more than 8 is always hard for a side like Denmark to chase. It's currently more than 12 an over.\nHamid Shah lofts one just to the right of mid-off. A poor shot that he gets away with.\nThe final ball of the over is much better. He hooks Leask away for six, over the head of Chris Greaves.\nShah shows his worth\nDenmark 64-2 (target 160)\nHamid Shah gets another four as Oli Hairs watches the ball go through his hands and trickle to the over. A bit casual, and Sayfaan Sharif shoots him a glare.\nThe next goes for four, too. A beautiful shot over the top of point that runs all the way.\nAnd another! Three successive fours. Denmark have missed their captain all tournament. He's making his presence felt today.\nDropped catches\nDenmark 36-2 (target 160)\nSaif Ahmad goes big again, trying to slap away Safyaan Sharif's first ball.\nIt goes into the air but he hasn't quite got hold of it. It's over George Munsey and he's chasing it desperately... dropped! It's a great attempt as he dives, tracking the ball over his shoulder.\nAnd there's another chance! Ahmad pokes at one past his off-stump, Brandon McMullen leaps like a salmon but he can't hold. That would've been the catch of the tournament.\nWICKET Bharaj c Currie b Watt 8\nDenmark 24-2 (target 160)\nMark Watt is back on from the pavilion end here at The Grange. His first is chipped by Shah, just over the head of Brandon McMullen at mid-on.\nTaranjit Bharaj doesn't get as lucky. He tries to sweep and didn't time it well, top-edging into the air. Brad Currie races underneath it and cups the ball in his palms, gently.", "url": "https://www.bbc.com/sport/live/cricket/66150333"}