{"authors": ["Tyrone Smith", "www.facebook.com"], "date_download": "2025-05-21 07:42:39", "date_modify": "2025-05-21 07:42:39", "date_publish": "2025-05-20 13:45:10", "description": "Ross County press conference", "filename": "sport_articles_cd90020lx2jo_1747813359.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c40c/live/c3b548e0-357c-11f0-9f00-498a49351714.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cd90020lx2jo_1747813359.html", "title": "Ross County press conference", "title_page": "Ross County press conference - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cowie admits the play-off is a \"huge moment\" for County and as the Premiership club the onus is on them to get the job done - \"there is no hiding place\".\nCowie says he hasn't thought about the consequences for himself if County are relegated. He adds: \"I have been at this club over two spells for over 16 years, I am from the area, it means a lot to me in terms of the job that I have got, I am very proud to be the manager of this football club and I will be doing everything I can to make sure I am here long term.\"\nDespite their poor recent form the County boss has been stressing to his players the next two games are an opportunity to turn things round, but they \"have to earn the right to win\" and will need to perform \"at a really high level\".\nCowie believes their experience of winning the play-off in the past two seasons shows \"there are different ways you can get through the scenario we are in\".\nHe is expecting a tough challenge against good Livingston side who will be \"very confident about themselves\".\nCowie says everyone at the club is well aware of the importance of bringing Premiership football to the Highlands: \"It is something the area craves and it is our job to go and give them that again next year.\"", "url": "https://www.bbc.com/sport/articles/cd90020lx2jo"}