{"authors": ["Nick Mashiter", "www.facebook.com"], "date_download": "2025-05-21 07:24:43", "date_modify": "2025-05-21 07:24:43", "date_publish": "2025-01-13 17:57:48", "description": "Before they face leaders Liverpool on Tuesday, BBC Sport looks at whether Nottingham Forest can really win the Premier League.", "filename": "sport_football_articles_cy9q712vgjro_1747812283.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/fe43/live/e927a660-d1cf-11ef-94cb-5f844ceb9e30.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy9q712vgjro_1747812283.html", "title": "Nottingham Forest news: Can Reds emulate Leicester by winning Premier League?", "title_page": "Nottingham Forest news: Can Reds emulate Leicester by winning Premier League? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Leicester stunned the world in 2016 when they won the Premier League - but could Nottingham Forest be about to do the same?\nThird in the Premier League with the joint second-best defence in the division and the most clean sheets, this rejuvenated club are no longer the surprise package.\nVictory against Liverpool on Tuesday would equal their club record of seven straight top-flight wins, set in 1922 - and, if they are able to complete the double over the Premier League leaders, they will be just three points behind them.\nThis all comes after last season's battles. They survived on the final day, finishing 17th, having incurred a four-point deduction for breaching profit and sustainability rules.\nA controversial social media post, refereeing rows, VAR complaints and a managerial change all contributed to a turbulent season.\nArguably - and in August some at the City Ground agreed - Forest needed a season of anonymity. A fuss-free campaign would have represented progress on and off the pitch.\nHowever, under December's manager of the month Nuno Espirito Santo they have outstripped expectation in spectacular style.\nOn the 70 occasions that teams have earned 40 points or more from their first 20 games in a Premier League campaign, only four sides have failed to finish inside the top four at the end of the season.\nSince 2000, the average points needed to win the Premier League has been 89.2, with 81.6 for second, 74.5 for third, 69.5 for fourth and 65.6 for fifth.\nDespite that, Opta's predictions model still gives Forest 0% chance of winning the title and only 0.7% of finishing second, which contrasts with the confidence within the squad.\n\"We are in this fight for the title because we deserve to be,\" says Forest defender Morato.\nLiverpool boss Arne Slot agrees, saying on Monday that Forest \"definitely are a team that is in competition with us and with the other teams\" at the top.\nThe comparisons to East Midlands rivals Leicester are unavoidable.\nThe Foxes' 5,000-1 title win in 2016 was one of sport's greatest achievements, with Leicester having initially been one of the favourites for relegation after pulling off a great escape in the season before.\nClaudio Ranieri's side won the league by 10 points and lost just three games. They were on 40 points after 20 games in 2015-16, the same total as Forest have now.\nLeicester's success was built on Jamie Vardy's pace, the threat of Riyad Mahrez and Marc Albrighton on the flanks and the energy of N'Golo Kante in midfield.\nWes Morgan skippered them to the title having joined from Forest in 2012 after a 10-year career at the City Ground.\n\"The last few games, when it's in touching distance, things get a bit twitchy, and you start thinking, 'Right, we cannot slip up',\" said Morgan.\n\"Whereas before it was 'there's nothing to lose, we're doing great. Let's just keep going.'\"\nDefender Morgan made 323 appearances for the Foxes and also won the FA Cup in 2021.\nExplaining the process of chasing the title, Morgan said: \"When you're so close to that goal, to achieving something no-one thought would be possible, you start off taking things a bit more... I don't want to say seriously because we always take it seriously, but there's a lot more emphasis in making sure we do things right.\"\nForest have the Vardy-like focal point of 12-goal Chris Wood, with Callum Hudson-Odoi and Anthony Elanga out wide and Morgan Gibbs-White joined by Elliot Anderson in midfield.\nForest have been described as the Premier League's best counter-attackers, but the statistics say otherwise.\nTheir 33 fast breaks have culminated in 29 shots but just four goals. It is a surprisingly low number considering how dangerous Forest have been.\nTottenham have scored the most breakaway goals - 10 - while Chelsea, Liverpool and Wolves have all scored more than Forest.\nElanga has three goals in his past five games - but they were his first since last February. He has four assists, too, while Hudson-Odoi has two goals and two assists. There is little doubt there needs to be more end product from both.\nForest have a conversion rate of 31.9% for their big chances, scoring 15 of their 47. Elanga and Hudson-Odoi have created six such chances between them, the same number as Morgan Gibbs-White.\nTheir possession is also the lowest in the Premier League at 39.4% and only the bottom five of Everton, Ipswich, Leicester, Wolves and Southampton have a worse xG - their expected goals tally - than Forest's 25.9.\nNuno's side have made just 929 passes into the final third, with only Southampton [887] and Ipswich [925] managing fewer. Arsenal top that chart with 3,192.\nThe numbers suggest Forest are defying data trends, but they are ruthless and effective, while Nuno has also praised their spirit.\nAfter beating Burnley to seal survival on the final day last season, Nuno told the squad one of the reasons they had stayed up was because of their characters, calling them good guys.\nHe likes to work with a small squad, allowing everyone to feel they have a chance of making the team, which also fosters a togetherness.\n\"It's not yet good enough,\" he said, joking about the spirit last week. \"It means a lot to the squad; when they have special moments everyone sees how happy they are.\"\nOn 1 February last year Forest announced the signing of Matz Sels from Ligue 1 side Strasbourg for a fee of about £5m.\nMatt Turner had joined from Arsenal for £10m in the summer before, while Forest also bought Benfica's Odysseas Vlachodimos.\nTurner made 21 appearances in all competitions and Vlachodimos seven, before Nuno - who replaced Steve Cooper in December 2023 - turned to Sels.\nThe Belgian new arrival managed just one clean sheet - against West Ham - and conceded 27 times as Forest survived.\nHowever, with the addition of Milenkovic and Morato in defence over the summer, joining the impressive Brazilian Murillo at the City Ground, they now boast one of the tightest backlines.\n\"Forest will do well to keep hold of Murillo long term. He's an unbelievable young player,\" said Morgan, who is now a national scout at Forest, having played over 400 games for the Reds before switching to Leicester.\n\"Milenkovic has come along and just complemented him. Positioning between both players is good and I think that's key to a successful defence.\"\nMorgan related it to the partnership he and Robert Huth had at Leicester, adding: \"That understanding between me and Huthy, we could play with our eyes closed and I knew exactly where he was going to be. That's the same for Murillo and Milenkovic.\"\nThe defensive unit, including Sels, Ola Aina, Milenkovic, Murillo, Morato and Neco Williams has cost Forest just over £50m.\nAlong with Liverpool, Forest have conceded just 19 goals in 20 games - only Arsenal have shipped less.\n\"The championship is not over yet and we want to make sure that the number of clean sheets only continues to go up,\" says Morato, underlining the determination within the squad, who have made the most clearances in the league - 563 - this season.\nSels has faced 259 shots, level with Crystal Palace's Dean Henderson, and only behind Brentford's Mark Flekken with 342 and Mads Hermansen of Leicester who has faced 287.\nNot all of those shots went on target, but Sels has been kept busy enough and has excelled. He has a save percentage of 75.3%, which is the highest of any goalkeeper who has played more than 500 minutes in the Premier League.\nThe expected goals against Forest this season - 21.7 - is also only beaten by Liverpool and Arsenal.\nSels' impact has been instant. Since 1 February, Forest have conceded 46 goals in the Premier League, with only Arsenal, Manchester City and Liverpool bettering them.\nWhile the defence has impressed, Wood has grabbed the majority of the headlines.\nThe New Zealand international has 12 goals in all competition, including the second in last Monday's 3-0 win at Wolves.\nThe victory at Molineux could have been scripted beforehand. A breakaway goal from Gibbs-White and a tap-in by Wood from Hudson-Odoi's cross had them 2-0 ahead at half-time.\nWhether the headline writers will be able to predict the outcome of Tuesday's match is debatable.\nForest's win at Anfield in September, thanks to Hudson-Odoi's goal, came with just 30% possession and they made less than half the amount of passes [273 to Liverpool's 604] of their hosts.\nForest made three defensive blocks from goal-bound shots and 30 clearances, while Sels made five saves.\nNuno used five central midfielders to stifle the Reds and he is likely to combat Slot's side in a similar way again. Forest use a mid-block, which allows them to win the ball back and produce space for their wingers which otherwise would not be there if possession came higher up.\nIn a congested midfield, which could happen on Tuesday, there would be little space for Liverpool to exploit.\nPer game this season, Forest rank last in possession and 19th for final-third pressures and sequences of more than 10 passes.\nYet they are the kings of the clearances and have an average of 4.1 defenders behind the ball for every shot faced, another league best.\nLiverpool's xG of 44.5 is close to double Forest's and they have scored 35 of their 85 big chances. Their expected goals against of 17.9 is also the best this season in the division.\nThe team Slot inherited from Jurgen Klopp are used to games against potential title rivals. This Forest side are in new territory.\nThe club have not featured in European competition since 1995-96 during Frank Clark's reign, while earlier this month marked the 50th anniversary of Brian Clough's appointment - their springboard to fondly remembered glory days at home and on the continent.\nAre the new generation in this particular title race?\n\"I think you cannot say no, just because of the position they're in, the points they have and their form,\" said Morgan.\n\"It's a tall order but anything could happen in football.\"", "url": "https://www.bbc.com/sport/football/articles/cy9q712vgjro"}