{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:40:19", "date_modify": "2025-05-20 14:40:19", "date_publish": "2023-07-28 10:53:40", "description": "Wales are hopeful number eight Taulupe Faletau will be fit for the World Cup in France as he looks to recover from a calf injury.", "filename": "sport_rugby-union_66332433_1747752019.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/E251/production/_130573975_cdf_180323_france_v_wales145.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-union_66332433_1747752019.html", "title": "Taulupe Faletau: Wales hopeful number eight will be fit for 2023 World Cup", "title_page": "Taulupe Faletau: Wales hopeful number eight will be fit for 2023 World Cup - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wales say number eight Taulupe Faletau remains in contention for the World Cup as he battles a calf injury.\nFaletau has not travelled to Turkey for a training camp but remains in the 48-man squad.\nThe 32-year-old will miss the opening warm-up game against England on 5 August, yet Wales are optimistic.\n\"His rehab is going well so we are very hopeful he will be available for selection for the World Cup,\" said forwards coach Jonathan Humphreys.\nFaletau was absent for the opening week of the two-week trip to Switzerland earlier in July before joining up at the altitude camp.\nHe will continue his recovery in Wales over the next few weeks, while backs Johnny Williams, Joe Roberts, Owen Williams and Alex Cuthbert have also not travelled to Turkey.\n\"He's coming back so it was just a question of do you drag him out here to do some stuff or can he do it back home, and spend a lot more time with his family?\" said Humphreys.\n\"So, the decision was made he can do the same rehab process back home. It's looking positive for him.\"\nWales have three warm-up games, with a trip to Twickenham on 12 August to complete an England double-header before they complete tournament preparation against world champions South Africa in Cardiff seven days later.\nHead coach Warren Gatland is scheduled to name his final 33-man squad the following week.\nWales open their pool campaign against Fiji in Bordeaux on 10 September before further group games against Portugal, Australia and Georgia.\nHumphreys is unsure whether Faletau will be available for the second and third warm-up games but indicated that should not affect his chance of selection.\n\"Hopefully he will play, but I don't think it's something we'll massively push if he's not 100%,\" said Humphreys.\n\"If he doesn't feature it's not going to necessarily rule him out.\"\nFaletau is the only specialist number eight in the the squad, although Aaron Wainwright, Jac Morgan and Taine Basham have played in that position for Wales, while Humphreys says new recruit Taine Plumtree could also slot in there.\n\"We have got a few options who can play there so hopefully we will still have massive competition for that spot,\" said Humphreys.\n\"We are covered off there at the moment.\"\nAfter signing for Scarlets, Plumtree arrived in Wales from New Zealand and went straight into the training camp in Switzerland.\nHumphreys says Plumtree, who was born in Wales and is the son of former Swansea coach John, is in contention to make the World Cup squad.\nHis versatility could be a factor with his ability to play second row and back row.\n\"He's a genuine contender and hopefully we'll see him in these next three games,\" said Humphreys.\n\"We haven't brought him in just to gain experience. We've brought him in because we feel he can add something to us.\n\"He's a six, he's a big man, and he's very athletic as you'd expect from someone coming from New Zealand and got a very good rugby sense.\n\"We are not blessed with people of that stature in that position. We looked at him, we liked what we saw, and he was keen to come over.\n\"He's impressed us. It was a tough introduction for him. He came off the plane jet-lagged from New Zealand, came to Switzerland, and the training was brutal over there. His first couple of sessions was an eye-opener.\n\"He stuck in, dug in and he's been great. He's been impressive. It's unbelievable with jet lag and the altitude and heat and doing the tougher sessions, he's suffered that. It was quite the welcoming for him.\"\nFaletau has played 100 internationals for Wales and is a three-times British and Irish Lions tourist. Wales have already lost experienced forwards Alun Wyn Jones and Justin Tipuric to international retirement.\nHooker Ken Owens will miss at least the group stages with a back injury and will definitely not be named in the initial 33-man squad.\nHumphreys says the inexperienced players have impressed.\n\"They have been outstanding,\" said Humphreys.\n\"There are people that are stepping up in that leadership role. To lose the people we have is tough but it allows other people to shine.\"", "url": "https://www.bbc.com/sport/rugby-union/66332433"}