{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:04:55", "date_modify": "2025-05-20 12:04:55", "date_publish": "2023-08-05 00:00:00", "description": "Scotland play their second World Cup warm-up against France at Murrayfield.", "filename": "sport_live_rugby-union_66200293_1747742695.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/D404/production/_130667245_20811756.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_rugby-union_66200293_1747742695.html", "title": "Reaction as 14-man Scotland rally to beat France", "title_page": "Reaction as 14-man Scotland rally to beat France - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Goodbye\nFT: Scotland 25-21 France\nThat's all from me on live text duties today, as Scotland come from 18 points behind to beat World Cup hosts France at Murrayfield.\nWe'll be back next week for Scotland's trip to St Etienne, but for now, go enjoy your weekend!\n'Next week will be close to our strongest team'\nFT: Scotland 25-21 France\nMore from Townsend:\n\"We'll wait and see what happens [with Zander Fagerson]. He has to do better at making sure he gets under the chest of the French player.\n\"Ben White did have an ankle injury coming into camp. We hope that it won't keep him out too long, but we'll wait and see.\n\"I thought George Horne did really well coming on and adding tempo to our attack. Fingers crossed that Ben's injury doesn't mean he misses the World Cup.\n\"Next week will probably be closer to our strongest team, in particular if Jamie [Ritchie] comes back. We know we have to get our strongest team out at least two occasions before we play South Africa, because the more they play together, the better they become.\"\nPost\nFT: Scotland 25-21 France\nScotland head coach Gregor Townsend on Amazon Prime Video:\n\"We believed that we could still win the game [at half-time]. We had to stop them scoring more points, and how we had to do that was to be more aggressive in our assist tackles, and also being better with our kick-chase defence.\n\"Our attack play was leading to overlaps, we just didn't execute. We knew we needed more ball and probably needed more speed in our attack and we got that second half.\n\"I did fear that one man less would make it tough for us, but it didn't. We still looked very dangerous. Credit to our maul defence - I thought it was outstanding. We looked much calmer in defence in the second half.\"\n'We came out a different team second half'\nFT: Scotland 25-21 France\nFinn Russell has also been talking to Amazon Prime Video:\n\"It was a tough first half - we didn't perform as well as we wanted, and we gave away too many soft penalties and turnovers.\n\"Second half we came out a different team. It was a game of two halves, and it shows that we can come back when we're down and turn over some of the best teams in the world. I was really proud of the boys for that second half, but we know we need to be better than the first half.\n\"We had nothing to lose second half, and just played our game, our style.\n\"I loved [captaincy]. I leaned on some of the boys here and there, but it was great fun, and great to get a win. At half-time I though 'here we go. First time as captain and we're going to lose by 30 points'.\n\"We took another step forward today, but next week will be a different team that we face and it'll be a tough challenge. It will show us where we are leading up to the World Cup.\"\n'Brilliant stuff from Scotland'\nFT: Scotland 25-21 France\nTom English\nBBC Scotland's chief sports writer at Murrayfield\nThe score was 22-0 to Scotland in the second half despite playing most of it with 14 men.\nIf you saw that coming then declare yourself a genius immediately. Some brilliant stuff from Scotland to turn around what looked like a hopeless cause.\nWould love to know what words were exchanged at half-time. Really taken by Dave Cherry's contribution when he came on. The three hooker spots are absolutely wide open now.\nPlayer of the Match\nScotland 25-21 France\nBlair Kinghorn has been named player of the match and has been giving his thoughts after that rousing comeback.\n\"We didn't up to the standards we knew we could in the first half, and we had a stern word at half-time,\" he said on Amazon Prime Video.\n\"We came out at the start of the second half and did our thing. We just need to stay focused for 80 minutes.\n\"I was excited to start at 15, and it's good when you've got a bunch of boys around you that let you play your game.\"\nPost\nScotland 25-21 France\nTom English\nBBC Scotland's chief sports writer at Murrayfield\nThis really is an exceptional second half performance by Scotland. You have to remember that they're down to 14.\nThere's not much evidence of a numerical disadvantage with the way they are playing though. Darcy Graham has been sensational. Blair Kinghorn looks a major threat every time he touches it.\nAgain, though, why did they have to put themselves in the position of chasing the game? I'm not sure they get away with that at the World Cup.\nPost\nScotland 17-21 France\nTom English\nBBC Scotland's chief sports writer at Murrayfield\nHell of a comeback by Scotland.\nShades of Paris in the Six Nations. Why do they have to give away such a lead before starting to play?\nThe big one is the yellow then red for Zander Fagerson. Utterly needless. If that turns into a three-game ban then he will miss the South Africa game in Marseille, which would be nightmarish.\nThat would leave WP Nel and Murphy Walker and/or Javan Sebastian as the tightheads. Against the Boks. That's not a good landscape.", "url": "https://www.bbc.com/sport/live/rugby-union/66200293"}