{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:37:25", "date_modify": "2025-05-21 07:37:25", "date_publish": "2025-03-28 12:56:44", "description": "Connacht and Munster welcome back Irish internationals for the United Rugby Championship interprovincial showdown at MacHale Park on Saturday.", "filename": "sport_rugby-union_articles_c4g0g20wk24o_1747813045.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0b24/live/ccaa47a0-0bd0-11f0-af58-ad3b17745e6c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c4g0g20wk24o_1747813045.html", "title": "Ireland stars back as Connacht face Munster in derby", "title_page": "United Rugby Championship: Ireland stars back as Connacht face Munster in derby - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Connacht and Munster welcome back Irish internationals for the United Rugby Championship interprovincial showdown at MacHale Park on Saturday (14:30 GMT).\nThe hosts bring in Mack Hansen, Bundee Aki, Finlay Bealham and captain Cian Prendergast for what will be the first time a professional Connacht game is held in County Mayo, and the first time rugby is played at the Castlebar venue in its 95-year history.\nThe Ireland quartet are among seven Connacht changes from the 43-40 defeat by Ospreys in Wales.\nChay Mullins, Jordan Duggan and Sean Jansen also come into the starting XV.\nMunster have three Irish internationals back in their side as Tadhg Beirne, Jack Crowley and Calvin Nash return.\nThe visitors are also boosted by the return of Oli Jager and Craig Casey from injury as they make five changes from the 28-25 defeat by Glasgow Warriors last weekend.\nMunster sit sixth in the standings and three points above 12th-placed Connacht.\nConnacht: Hansen; Mullins, Gavin, Aki, Treacy; Ioane, Blade; Duggan, Heffernan, Bealham; Joyce, Murray, Prendergast (capt), Hurley-Langton, Jansen.\nReplacements: Tierney-Martin, Buckley, Aungier, Murphy, Boyle, Devine, Hanrahan, Cordero.\nMunster: O'Connor; Nash, Farrell, Nankivell, O'Brien; Crowley, Casey; Loughman, Barron, Jager; Wycherley, Beirne (capt); Ahern, Hodnett, Coombes.", "url": "https://www.bbc.com/sport/rugby-union/articles/c4g0g20wk24o"}