{"authors": ["Emma Sanders", "www.facebook.com"], "date_download": "2025-05-20 13:28:50", "date_modify": "2025-05-20 13:28:50", "date_publish": "2023-07-26 11:47:06", "description": "Friendship bracelet making, colouring in and coffee art - just some of the activities which are keeping the Lionesses busy in their home from home in New South Wales.", "filename": "sport_football_66309281_1747747730.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7668/production/_130521303_screenshot2023-07-26052802.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66309281_1747747730.html", "title": "Lionesses: Inside England's Australian base camp at World Cup", "title_page": "Lionesses: Inside England's Australian base camp at World Cup - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Friendship bracelet making, colouring in and coffee art - just some of the activities which are keeping the Lionesses busy in their home from home in New South Wales.\nThe Euro 2022 champions moved into their hotel on Terrigal Beach, 90 minutes up the coast from Sydney, on 23 July following their 1-0 victory over Haiti and it will be their base camp for the remainder of the Women's World Cup.\n\"It feels like Lionesses, it feels like us,\" said the Football Association's women's general manager Anja van Ginhoven.\nIt took just three days to decorate the camp but the FA first flew out to Australia in December 2021. On Friday they moved in and got to work, just 72 hours before the players arrived.\n\"My jaw was literally on the floor looking round. They've branded it up - all Lionesses everything,\" defender Esme Morgan told BBC Sport.\n\"Some of the stuff they've got for us to relax is so cool. We've got a darts board, table tennis and there are little arts and crafts tables. It's amazing what they've done.\"\nA total of 53 people are catered for including 30 staff members and 23 players, and they have a games room, a dining area, a diary room, a relaxation room and an area for analysis - all rooms named after Lionesses legends such as Jill Scott, Ellen White, Rachel Yankey, Mary Phillip and Fara Williams.\nThe 'Lionesses Down Under' studio is also in the camp and is draped in photographs, a giant player word search (which striker Alessia Russo has filled in) and cuddly toys of Australia's famous wildlife.\nBut one of the most popular additions is the personalised coffee machine which uses edible icing to print instant pictures on the drinks. Best friends Alessia Russo and Ella Toone were among those to try it, external.\n\"Me and [Lauren Hemp] got our faces on a coffee earlier,\" added Morgan. \"I said to [Ellie] Roebuck 'surely every coffee shop should have that?'\n\"The coffee traditionalist is Roebuck and she didn't want any fancy selfies on hers but I thought that was really cool.\"\nForward Hemp is known for her Lego building, which she said helped her switch off during Euro 2022, and she was on the hunt for some in Australia.\n\"I managed to get the Lego from Australia, which is handy,\" said Hemp. \"I am just trying to work out how I am actually going to transport it home at the moment.\n\"I am working on a globe and then I've got a few other bits, so hopefully you'll see them soon. I feel like it's really therapeutic.\"\nIn the entrance to their hotel is a giant England flag made of balloons and the steps are branded in red and white, containing phrases such as \"born to be bold\" and \"thrive in the moment\".\nQuotes fill the walls of the hotel and a giant painting by artist Harry Ward shows the players from their grassroots football days and meets you at the top of the stairs. It's titled 'All the way from'.\n\"They've got all our values on the wall, pictures of each other and pictures of when we were little kids, so it's really special,\" said Morgan.\nThroughout the hotel are games such as Jenga, table football, cornhole boards and darts.\nThe craft making area is another popular feature and there is a World Cup wall chart, which has been filled in by defender Lucy Bronze, next to the 'Scott room' where there are arcade games and computer gaming systems.\n\"I've rediscovered my love for friendship bracelet making,\" said Morgan. \"I used to do them at school and they had some string so I was making them and everyone was like 'teach me, teach me' so I'm taking commission now.\"\nThe players often gather to watch the other World Cup matches in the relaxation room or use the virtual reality headsets.\n\"I didn't even know we had them,\" said defender Alex Greenwood. \"I don't think I've got round to that bit yet it's that big.\n\"As we left earlier it was Hempo and Niamh Charles playing [table tennis]. I think Hempo's really good actually but I'm not playing table tennis, it's not for me.\"\nThere is also a library which includes the Harry Potter series books and tennis stars Ash Barty and Serena Williams' autobiographies.\nThe 'White room' is where manager Sarina Wiegman and her staff hold team meetings and analysis.\nEven when they are eating, the players are surrounded by motivational quotes such as \"play for the shirt on the pitch not the seat on the plane\". And among the nutritional options are over 1,040 Yorkshire tea bags.\nAnd Greenwood has found her \"inner-child Alex\", spending her time colouring.\n\"I'm actually loving colouring in at the moment. I'm colouring all kinds, whatever I can get my hands on. I'm running out of spaces now,\" she added.\nBased along the beach front, the squad have a short 15-minute drive to Central Coast Stadium where they train and use a gym which has been specifically built for the Lionesses' arrival.\nNew South Wales will be home to a new women's team in September, the Central Coast Mariners, and all of the Lionesses' gym equipment - which is half-owned by the club - will be left for their use after the World Cup.\nThe FA hopes this will leave \"an ever-lasting legacy\" in the area. They also aim to connect with local people in Sydney and held a virtual meeting with Karen Menzies, the first female Indigenous Australian footballer.\n\"We are here to do a job but it's also an enriching life experience,\" said the FA's technical director Kay Cossington. \"We have felt very connected to that.\"\nCossington, who has been at the FA for 18 years, said the base camp is \"night and day\" from the first one she experienced at the home Euros back in 2005, and it's clear the players are enjoying it.", "url": "https://www.bbc.com/sport/football/66309281"}