{"authors": ["Kal Sajad", "www.facebook.com"], "date_download": "2025-05-21 03:43:34", "date_modify": "2025-05-21 03:43:34", "date_publish": "2025-01-10 08:40:34", "description": "World champion Caroline Dubois plots her journey to superstardom within six years and addresses the publicised family feud with her father and brother.", "filename": "sport_boxing_articles_cx272jgg0gjo_1747799014.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c3ed/live/a97c9640-ce98-11ef-a30d-93fd67dd3d91.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_boxing_articles_cx272jgg0gjo_1747799014.html", "title": "Caroline Dubois wants to be three-weight undisputed champion and retire by 30", "title_page": "Caroline Dubois wants to be three-weight undisputed champion and retire by 30 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Caroline Dubois is in boxing for a good time, not necessarily a long time.\n\"I want to be undisputed in three weight divisions and then retire, call it a day - all before 30. That would be sick,\" Britain's world lightweight champion says.\nDubois will mark her 24th birthday by making a first defence of her WBC title against Canada's Jessica Camara in Sheffield on Saturday.\nShe was upgraded to world champion in December after Katie Taylor opted to vacate the belt.\nDubois joined estranged sibling, heavyweight champion Daniel, in becoming the United Kingdom's first brother and sister to simultaneously hold world titles, and only the second in boxing worldwide.\nDespite the absence of an in-ring crowning moment and those infamous \"and the new\" words from a ring announcer, Dubois is relishing her world champion tag - and promises to knock out Camara at the Canon Medical Arena.\n\"I want to make a statement and let the world know that Caroline Dubois is a world champion and she will reign for a very long time,\" she adds.\n\"There's going to be bigger nights, bigger fights. Definitely harder nights and hard fights, and undisputed is the goal for me now.\"\nDubois has long been tipped for greatness, ever since shining in the Youth Olympics. She was calling out the sport's biggest names more than 18 months ago, but her professional career has been carefully managed.\nAlthough a fight with Taylor may have provided the passing-of-the-torch moment and catapulted her profile to new heights, Dubois is no longer chasing the Irish superstar.\n\"I don't feel like I need Katie Taylor, and to be honest she doesn't need me right now, so it is what it is,\" she says.\n\"That's not me trying to be disrespectful or anything, it's just I would still be happy if our careers never crossed. It doesn't really matter to me because I feel like I'm going to make my own legacy.\"\nDubois is expected to beat underdog Camara. From then on, it is \"big fights\" and marquee names. Dubois mentions the likes of Mikaela Mayer and Alycia Baumgardner as future opponents.\nThe more immediate task, however, is to unify the division in 2025 by claiming the vacant WBA title and beating IBF champion Beatriz Ferreira and WBO belt-holder Terri Harper.\nDubois is particularly dismissive of compatriot Harper, and was unimpressed by the Doncaster fighter's win over Rhiannon Dixon in September.\n\"I thought she fought the fight really afraid, really scared, really on the back foot. It didn't show me the desire and the heart required to be a world champion,\" Dubois says.", "url": "https://www.bbc.com/sport/boxing/articles/cx272jgg0gjo"}