{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:55:00", "date_modify": "2025-04-26 06:55:00", "date_publish": "2025-02-28 15:54:50", "description": "Exeter Chiefs head coach Susie Appleby is to leave the club after not being offered a new contract for next season.", "filename": "sport_rugby-union_articles_ce982zd5xzlo_1745650500.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d154/live/ea94afe0-f5ea-11ef-86a6-15c2bb2c0119.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_ce982zd5xzlo_1745650500.html", "title": "Susie Appleby: Exeter Chiefs women's head coach to leave club", "title_page": "Susie Appleby: Exeter Chiefs women's head coach to leave club - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Exeter Chiefs head coach Susie Appleby is to leave the club after not being offered a new contract for next season.\nThe Chiefs finished fifth in Premiership Women's Rugby this season and missed out on a place in the top four play-offs for the first time in three campaigns.\nAppleby has been an integral part of the Devon side, taking the top role in 2019 when the club was launched ahead of being granted a place in the top tier for 2020-21.\nA club statement said Exeter had begun \"implementing changes ahead of next season\".\n\"I feel the time is right to ring the changes and to rearrange the coaching team, including new personnel. Susie's contract was up at the end of the season and I have made the decision to make that change now,\" said Exeter's chief executive officer Tony Rowe.\n\"I would like to thank Susie for her dedication and hard work in setting up a women's rugby programme for the club.\"\nRowe continued: \"It has been an exciting five years with the team passing the 100-game mark in the league last season, making two league finals and two cup wins. We wish Susie all the best for the future.\"\nAssistant coach Steve Salvin has been tasked with leading the team in the interim before a replacement is appointed.\nAppleby's departure means there is no female head coach in the PWR, with former Wales captain Rachel Taylor having stepped down from her role with Sale at the end of their campaign.\nAppleby led Exeter to the PWR (previously Premier 15s) final twice during her tenure, where they were beaten by Saracens and Gloucester-Hartpury, while they also reached the semi-finals last season.\nThe side are also two-time winners of the Allianz Cup, in 2022 and 2023.", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/ce982zd5xzlo"}