{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:51:19", "date_modify": "2025-05-21 06:51:19", "date_publish": "2025-03-29 23:05:04", "description": "Celtic manager Brendan Rodgers says Greg Taylor is \"more likely now\" to move this summer after the left-back again missed out on game time in a 3-0 win over Heart of Midlothian.", "filename": "sport_football_articles_ce3v81x1ppwo_1747810279.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8610/live/0ebfdfc0-0cf2-11f0-845a-edf2fe2acac7.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ce3v81x1ppwo_1747810279.html", "title": "Celtic: Greg Taylor 'more likely' to exit in summer", "title_page": "Celtic: Greg Taylor 'more likely' to exit in summer - Rodgers - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Celtic manager Brendan Rodgers says Greg Taylor is \"more likely now\" to move this summer after the Scotland left-back again missed out on game time in a 3-0 win over Heart of Midlothian.\nJanuary signing Jeffrey Schlupp has been preferred to the 27-year-old in recent weeks and Taylor has not featured since being taken off at half-time in a defeat by Hibernian on 22 February.\nTaylor has played more than 200 times for Celtic, but with fellow Scotland cap Kieran Tierney secured on a pre-contract from Arsenal, he looks set to end a near six-year stay with the Scottish champions when his contract expires.\n\"I've been in this position so many times and I can read situations,\" Rodgers said. \"It's probably more likely now that Greg will move on than stay, which is a big shame for me because I love him as a person - and I love his game because it's suited to how we work.\n\"It's not financial, but I respect his position because he wants to feel he'll play every week. Whoever is in next year with Kieran will still play a lot of games, but my feeling is that Greg may well move on.\n\"I know between now and the end of the season he'll give his all. Greg has had a few years in the position and has been superb. He'll also get more games this season.\"\nSchlupp had a hand in the opening goal against Hearts with a first-time forward pass that allowed Callum McGregor to drive on and play in Daizen Maeda.\nThe versatile on-loan Crystal Palace 32-year-old appears open to an extended stay, but neither he nor Rodgers is making any firm commitments with Taylor's future still not confirmed.\n\"That's something between now and the end of the season we'll look at,\" Rodgers added. \"But I don't want to commit too early.\n\"He's a great boy. I knew what I was getting, he's a good type. More than a good guy, he can perform and there's more to come from him.\n\"Obviously we know we've got Kieran coming in the summer who is high level. We know we'll need to have someone else if Greg moves on.\"", "url": "https://www.bbc.com/sport/football/articles/ce3v81x1ppwo"}