{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:03:28", "date_modify": "2025-05-20 14:03:28", "date_publish": "2023-07-26 10:11:49", "description": "Peterborough United are braced for highly-rated defender Ronnie Edwards to leave the club before the end of the transfer window.", "filename": "sport_football_66312070_1747749808.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1324C/production/_130021487_shutterstock_editorial_13782760au.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66312070_1747749808.html", "title": "Ronnie Edwards: Peterborough expect highly-rated defender to leave", "title_page": "Ronnie Edwards: Peterborough expect highly-rated defender to leave - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Peterborough United expect highly-rated defender Ronnie Edwards to leave the club before the end of the summer transfer window.\nThe 20-year-old made 44 appearances last season, starting both legs of their League One play-off semi-final against Sheffield Wednesday.\nHe also played for England at the Under-20 World Cup in Argentina.\n\"We fully expect Ronnie Edwards to go, so we'll have to replace him,\" said boss Darren Ferguson.\nPosh lost fellow centre-back Frankie Kent to Scottish club Hearts on Sunday, but Ferguson does not plan to sign anyone else for that position unless there is another departure.\n\"At the moment, I've got four centre-halves still in the building. We know there'll be bids for Ronnie, you would have thought, and Josh Knight is on the transfer list and until one of them goes no-one (else) will be coming in,\" he told BBC Radio Cambridgeshire.\n\"We've got enough bodies in that position but if one more senior centre-half went out, which would be Ronnie or Knighty, we would look to bring one in.\"\nPeterborough have signed six players since losing to Wednesday on penalties, having held a 4-0 lead following the first leg.\n\"We put a lot (of players) on the list at the end of the season, we are changing things, we want to go a lot younger, which we will be,\" said Ferguson.\n\"A lot of players have gone who were here for quite a while, who were great servants for the club.\n\"In terms of some of our better players possibly leaving, then we'll replace them. If Jono [top scorer Jonson Clarke-Harris] goes, we'll have to replace him. We're not going to wait till they go out the door. We'll have targets in place and then you just have to hope that you can get them.\"\nPosh had their entire squad involved in two pre-season friendlies on Monday, winning 4-1 against Bedford Town and losing 1-0 to Peterborough Sports of National League North.\n\"I think it's important that the two teams in the city have some sort of relationship, I think we could make it an annual thing when we play each other. We got a good crowd and it was a good game,\" said Ferguson.\nPeterborough begin the new League One campaign with a trip to Reading on 5 August.", "url": "https://www.bbc.com/sport/football/66312070"}