{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:54:16", "date_modify": "2025-05-21 06:54:16", "date_publish": "2025-03-29 17:38:58", "description": "Atletico Madrid's La Liga title hopes suffer a blow as they are held to a draw by Espanyol.", "filename": "sport_football_articles_cp9y99k5rnpo_1747810456.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b278/live/89017180-0cc1-11f0-bffd-fb98b4c4f9e8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cp9y99k5rnpo_1747810456.html", "title": "Espanyol 1-1 Atletico Madrid: Atleti's title hopes hit after third game without a win", "title_page": "Espanyol 1-1 Atletico Madrid: Atleti's title hopes hit after third game without a win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Atletico Madrid's La Liga title hopes suffered a blow as they were held to a draw by Espanyol.\nCesar Azpilicueta, 35, opened the scoring with his first Atletico goal since joining from Chelsea in 2023, hitting a stunning volley into the top corner from 25 yards.\nBut, in a game of few chances, Atletico gifted the hosts a route back into the match with 20 minutes left when Clement Lenglet upended Leandro Cabrera in the box.\nWinger Javi Puado duly converted past Jan Oblak from the penalty spot with what was Espanyol's first shot on target.\nThe visitors pushed in search of a late winner and came closest through former Manchester City forward Julian Alvarez, whose effort went narrowly wide from just inside the area.\nAtletico are now without a win in their past three league matches, leaving them six points behind leaders Barcelona and three behind second-placed Real Madrid - having played a game more than both sides.\nEspanyol remain 15th, two points clear of the relegation zone.\nBarcelona host Girona on Sunday (15:15 BST), while Real are in action later on Saturday against Leganes (20:00 GMT).", "url": "https://www.bbc.com/sport/football/articles/cp9y99k5rnpo"}