{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:14:50", "date_modify": "2025-05-19 15:14:50", "date_publish": "2015-03-04 23:33:48", "description": "Falcao made to wait on future, Simeone wants Man City job, Danilo to reject Man Utd, plus more.", "filename": "sport_31740924_1747667690.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/80715000/jpg/_80715661_gossip_promo_464_main.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_31740924_1747667690.html", "title": "Gossip column: Falcao, Simeone, Danilo, Umititi, Bacca", "title_page": "Gossip column: Falcao, Simeone, Danilo, Umititi, Bacca - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Colombian striker Radamel Falcao, 29, will have to wait until May to discover whether Manchester United are to make his loan move from Monaco permanent. (Guardian), external\nBarcelona defender Dani Alves, 31, is close to joining a new club on a free transfer in the summer, with Manchester United one of the teams interested in the Brazil international. (Sun - subscription required), external\nPorto's Brazilian full-back Danilo, 23, is expected to reject interest from Liverpool, Arsenal and Man United in favour of a £27m switch to Real Madrid. (Daily Mirror), external\nLiverpool are considering making a move for Sporting Lisbon midfielder William Carvalho, 22, after a setback in their attempts to sign £37m-rated Miralem Pjanic, 24, from Roma. (Daily Mirror), external\nSerbia defender Matija Nastasic, 21, is likely to make his loan move from Manchester City to Schalke permanent in the summer, according to the German club's general manager Horst Heldt. (Manchester Evening News), external\nArsenal, Manchester City, Tottenham, Southampton and Everton are considering a move for Lyon's 21-year-old defender Samuel Umtiti. (FootMercato.net in French), external\nTottenham manager Mauricio Pochettino has ruled out a move for Sevilla's Colombian striker Carlos Bacca, 28. (Turnstyle), external\nLille want to keep Manchester City attacking midfielder Marcos Lopes, 19, on loan for another season. (Daily Mail), external\nArsenal midfielder Abou Diaby, 28, looks set to be released this summer with boss Arsene Wenger planning to sell either Mikel Arteta or Mathieu Flamini to clear the way for a major midfield signing.(Sun - subscription required), external\nChelsea are watching Anderlecht midfielders Youri Tielemans, 17, and Leander Dendoncker, 19. (Daily Mail), external\nVillarreal striker Luciano Vietto, 21, is a £12m target for Liverpool - his agent, Jorge Cysterpiller, says Real Madrid also want the player. (Sun - subscription required), external\nDiego Simeone is stalling on a new contract as Atletico Madrid manager - in the hope of getting the Manchester City job. (Daily Mirror), external\nBradford City manager Phil Parkinson is set for a new contract to stop him moving to a Premier League side, despite having 12 months remaining on his current deal. (Daily Star), external\nManchester United boss Louis van Gaal says he will not bow to fans urging the team to \"attack, attack, attack\". (London Evening Standard), external\nBayern Munich defender Jerome Boateng, 26, turned down an offer to join Barcelona during the summer. (Bild in German), external\nFormer Arsenal midfielder Gilberto Silva says Germany international Mesut Ozil, 26, must improve if the Gunners are going to challenge for the Premier League title again. (London Evening Standard), external", "url": "https://www.bbc.com/sport/31740924"}