{"authors": ["David Michael", "www.facebook.com"], "date_download": "2025-05-21 07:46:22", "date_modify": "2025-05-21 07:46:22", "date_publish": "2025-05-20 11:36:09", "description": "Aston Villa news: Opinion - 'Trajectory looks very promising' but will Martinez be gone?", "filename": "sport_football_articles_c1e6gqv2wj3o_1747813582.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6747/live/de989c40-f02e-11ef-a319-fb4e7360c4ec.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c1e6gqv2wj3o_1747813582.html", "title": "'Trajectory looks very promising' but will Martinez be gone?", "title_page": "Aston Villa news: Opinion - 'Trajectory looks very promising' but will Martinez be gone? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "If Aston Villa win at Old Trafford on the final day and Liverpool fail to beat Crystal Palace, Unai Emery's record across the final 19 games in 2025 will surpass that of the eventual Premier League champions.\nSince the beginning of March, no Premier League team can match Villa's form.\nVilla started the season strongly, comfortably perched in fourth by the end of October - effectively the first quarter of the campaign.\nThen came a dip. But even when they sat ninth at the halfway point, they were only three points off fifth. Taking that into account, it is strange that despite a formidable second-half finish, Villa still do not have their Champions League destiny entirely in their own hands. It is as if the maths does not add up.\nThe lazy narrative that Villa could not cope with the demands of both the Premier League and Champions League has been exposed as nonsense. As I have highlighted before, the real - and more frustrating - reasons Villa have not already secured a Champions League spot lie in costly injury-time goals conceded and big chances missed.\nEmery seems to have addressed the defensive side of that equation, with three consecutive clean sheets.\nSo, the trajectory looks very promising for next season. That was, until Emi Martinez's seemingly tearful goodbye to Villa Park last week.\nWe'll get to that later. But hopefully, if a win at Old Trafford leads to back-to-back Champions League qualifications, it will either soften the blow or hopefully complicate whatever move for the World Cup winner may be in motion.", "url": "https://www.bbc.com/sport/football/articles/c1e6gqv2wj3o"}