{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:20:53", "date_modify": "2025-05-19 15:20:53", "date_publish": "2017-07-04 00:00:00", "description": "Watch up to three matches after Roger Federer, Novak Djokovic, Angelique Kerber and Kyle Edmund all win on day two.", "filename": "sport_live_tennis_40071349_1747668053.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_live_tennis_40071349_1747668053.html", "title": "Wimbledon 2017: Roger Federer, Novak Djokovic and Angelique Kerber win on day two", "title_page": "Wimbledon 2017: Roger Federer, Novak Djokovic and Angelique Kerber win on day two - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Post\nWe're done typing for the day, but there are still seven matches in play at SW19 - you can follow them all here.\nWe'll be back at 10:00 BST tomorrow for more tennis goodness.\nKids boosted by Wimbledon charity\nJonathan Jurejko\nBBC Sport at Wimbledon\nWimbledon is an internationally-recognised name but the people on its doorstep remain the most important.\nThe Wimbledon Foundation, the charitable arm of the All England Club, aims to change the lives of local people.\nTwo hard-working volunteers behind one scheme funded by the Foundation, an animation project for young people aged 7-11 and disabled people aged up to 21 across south London, were rewarded with a day out at the Club today.\nAnd artistic pair Bunny Martin and Roy Loveday, rustled around in their props department to make these tennis-tastic hats.\n\"Young people in south London don't always have the chances to create and build animation projects and the Foundation helps them do that,\" says Roy. \"It gives them a new-found confidence which they can utilise in all walks of life.\"\n\"They build the plastic figures, storyboard, film and edit these three minutes animations,\" adds Bunny. \"They have the biggest grins of their lives from the pride of being on stage and being recognised for their work.\"\n'I'm in good shape'\nBabos 4-6 6-4 1-6 Wozniacki\nCaroline Wozniacki speaking to BBC Two: \"I'm not sure how I kept fighting. I was down a break early in both sets and she had 40-0 on her serve and somewhow I managed to come back. I moved on to the easier side of the court with the shade and I started hitting the ball better.\n\"I feel like I'm in good shape but the first round is always tricky. Timea is a great player and serves big.\n\"I love playing on Centre. It's a special court and it's what we train for. I feel good about playing on grass and I love Wimbledon. I'm happy to be through.\"\nPost\nLiz Smylie\nFormer Wimbledon doubles and mixed doubles champion\nYou look back on matches and sometimes you may not agree on the turning point but in this one it certainly was the second game in the third set. Babos had broken, she was 40 love, then a double fault, a bad volley, an awkward forehand shot. From then on she was unable to recover.\nHaving said that, Wozniacki is a tough lady to beat, she was given an opportunity and she grabbed it with both hands and she ran.\nGame, set and match - Dimitrov\nDimitrov 7-6 (7-4) 6-2 6-2 Schwartzman\nNo messing from Grigor Dimitrov as he racks up three match points in quick succession.\nBang! Huge forehand winner to seal it. Straight sets for the 13th seed, who moves on to face Marcos Baghdatis in round two.\nDiego Schwartzman is the world number 37 and proved a tricky customer in the first set, but has never won a grass court match and the disparity in quality on this surface told in the second and third set.\nGood news for Dimitrov is that he had a good runaround but was out there less than two hours. His serve looked pretty mean by the end there too.\nCan he make a deep run this year?\nPost\nDimitrov 7-6 (7-4) 6-2 5-1 Schwartzman*\nThe ball flies into the crowd and is caught - Dimitrov asks for it back so the spectator raises his hand like a ball boy and obliges.\nBack on court, Dimitrov is cruising in second gear as he rattles off an ace, taking the service game to love and is now just one game away.\nSchwartzman to serve to stay in this.\nDimitrov breaks again\n*Dimitrov 7-6 (7-4) 6-2 4-1 Schwartzman\nSchwartzman looking ragged on his serve now as Dimitrov takes it to deuce.\nLooking very ragged on the volley too as he completely mishits one when well-placed in the rally.\nThat gives Dimitrov a break point - and Schwartzman fires out to hand it to him.\nThe Bulgarian could be done within two hours here. They've played one hour 42 minutes so far. Handy for a first round tie.", "url": "https://www.bbc.com/sport/live/tennis/40071349"}