{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:43:57", "date_modify": "2025-05-21 05:43:57", "date_publish": "2025-04-02 22:50:18", "description": "Liverpool 1-0 Everton: David Moyes reacts to defeat", "filename": "sport_football_articles_cdrgd5ndx1jo_1747806237.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c3a9/live/ca8d8cf0-1014-11f0-992e-13a2fb1a4046.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cdrgd5ndx1jo_1747806237.html", "title": "Liverpool 1-0 Everton: David Moyes reacts to defeat", "title_page": "Liverpool 1-0 Everton: David Moyes reacts to defeat - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Everton boss David Moyes, speaking to Sky Sports: \"I think we are a lot closer to them tonight than possibly when I came to the club than what I expected.\n\"Over the two games we have given them a good game. Tonight was really tight. An offside goal which they get and that's the difference in the game tonight.\"\nOn thinking Diogo Jota's goal should not stand: \"The players behind Jarrad [Branthwaite] interfere with him clearing it. It is an easy decision to give. I cannot understand any reason why that wasn't given offside.\"\nOn James Tarkowski VAR decision: \"First thought, it was a brilliant tackle for a derby game. A tackle we would have seen a few years ago.\n\"I understand nowadays things are slightly different with follow-throughs. We might have got a bit lucky, don't put that with the goal because the goal was a different incident that won Liverpool the game.\"\nOn the game overall: \"Liverpool were the better team and that's why they're top of the league, but we showed great resilience and we stuck at it.\n\"A bit gut-wrenching when you feel the end result has come from something which wasn't deserved.\n\"We have been on a great run, the players have been doing brilliantly well. First defeat in 10 games.\n\"I thought we tried to close that gap from their levels to our levels tonight. At the moment they're the best team in the league.\n\"Tonight, we have done a lot of things not as well as we should have done.\"", "url": "https://www.bbc.com/sport/football/articles/cdrgd5ndx1jo"}