{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:38:13", "date_modify": "2025-05-21 06:38:13", "date_publish": "2025-04-01 00:00:00", "description": "Third-tier Arminia Bielefeld stun defending champions Bayer Leverkusen to reach the final of the German Cup.", "filename": "sport_football_live_c5ymy34r1mzt_1747809493.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e22d/live/cc957350-0f42-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c5ymy34r1mzt_1747809493.html", "title": "Arminia Bielefeld 2-1 Bayer Leverkusen: Third-tier side stun defending champions", "title_page": "Arminia Bielefeld 2-1 Bayer Leverkusen: Third-tier side stun defending champions - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Third-tier Arminia Bielefeld stunned defending champions Bayer Leverkusen to reach the final of the German Cup.\nBielefeld fought back from a goal down to triumph 2-1 and become the first team outside the top two divisions to knock four Bundesliga sides out of the German Cup in one season.\nThe club, who are fourth in Germany's third division, had already beaten Union Berlin, Freiburg and Werder Bremen before their victory over the reigning Bundesliga champions.\nLeverkusen opened the scoring in the 17th minute through Jonathan Tah, but their lead lasted for just three minutes as Marius Worl beat keeper Lukas Hradecky with a low strike.\nA close-range volley from Maximilian Grosser before the break completed Bielefeld's comeback and condemned Leverkusen to their first German Cup defeat under manager Xabi Alonso.\n\"We didn't need luck at all because we were on the front foot the whole time,\" Bielefeld boss Michel Kniat said.\nKniat said he \"normally wouldn't have a drink with the players, but tonight I'll make an exception\", adding that \"nobody will go to sleep in this city tonight\".\nBielefeld returned to the Bundesliga in 2020 after an 11-year absence, but they were relegated two seasons later and, in 2023, they dropped down to the third tier after losing a relegation play-off.\nThey are the fourth team from the third division to reach the German Cup final, following Union Berlin in 2001, Energie Cottbus in 1997 and Hertha Berlin's reserve team in 1993.\nBielefeld will take on another Bundesliga side in the final, with Stuttgart or RB Leipzig facing each other in Wednesday's semi-final.", "url": "https://www.bbc.com/sport/football/live/c5ymy34r1mzt"}