{"authors": ["Jonty Colman", "www.facebook.com"], "date_download": "2025-05-21 04:20:45", "date_modify": "2025-05-21 04:20:45", "date_publish": "2025-04-05 13:49:00", "description": "IPL 2025 results: Delhi Capitals cruise to win over Chennai Super Kings to continue perfect start", "filename": "sport_cricket_articles_c7vne223d7go_1747801245.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ae4f/live/65d53e20-1221-11f0-a820-05f89b05038b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c7vne223d7go_1747801245.html", "title": "IPL 2025 results: Delhi Capitals cruise to win over Chennai Super Kings to continue perfect start", "title_page": "IPL 2025 results: Delhi Capitals cruise to win over Chennai Super Kings to continue perfect start - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "India's KL Rahul (77) inspired Delhi Capitals as they continued their winning start to their Indian Premier League campaign with a 25-run victory over Chennai Super Kings in Chennai.\nWicketkeeper-batter Rahul, scored 77 runs off 51 balls that included six fours and three sixes to give the Capitals their third win in as many matches.\nBatting first, the visitors got off to a poor start when opener Jake Fraser-McGurk was dismissed after five balls without scoring.\nFrom there, Rahul took charge and built quick-scoring partnerships with Abishek Porel (33), captain Axar Patel (21), Sameer Rizvi (20) and Tristan Stubbs (24 not out) to post a total of 183-6 after 20 overs.\nKhaleel Ahmed was the pick of the bowlers for the Super Kings, returning figures of 2-25 from his four overs.\nIn response, the Super Kings lost their New Zealand opening duo of Rachin Ravindra and Devon Conway cheaply.\nAustralia international Mitchell Starc removed Super Kings captain Ruturaj Gaikwad for five before impact substitute Shivam Dube holed out on 18.\nVijay Shanakar was the Super Kings' shining light with the bat, making an unbeaten 69 off 54 balls and putting on a 84-run partnership with MS Dhoni (30 not out) as Chennai finished 158-5 from their 20 overs.\nThe Capitals' first win over the Super Kings since 2010 moves them two points clear at the top of the IPL table, while the Super Kings remain eighth.", "url": "https://www.bbc.com/sport/cricket/articles/c7vne223d7go"}