{"authors": ["Elizabeth Botcherby", "www.facebook.com"], "date_download": "2025-05-21 05:24:04", "date_modify": "2025-05-21 05:24:04", "date_publish": "2025-01-14 16:55:14", "description": "Katrina Gorry discusses her four-year battle with an eating disorder and how she hopes to create a more open environment for discussing body image.", "filename": "sport_football_articles_cx2p544ygyqo_1747805044.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6d5e/live/5196c090-d050-11ef-b581-5b11425257bb.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cx2p544ygyqo_1747805044.html", "title": "Katrina Gorry: West Ham captain on overcoming eating disorder", "title_page": "Katrina Gorry: West Ham captain on overcoming eating disorder - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "For four years, West Ham captain Katrina Gorry had an eating disorder which left her in a \"really dark place\".\nNow the 32-year-old hopes to turn her experience into a positive one and create a more open environment for discussing body image.\nSpeaking on BBC Radio 5 Live's Women's Football Weekly podcast, the Australia international, who had no prior history of disordered eating, said: \"It just crept into my life. At the time, I was living in Japan, I had a lot of family things going on off the field, and I felt like the one thing I could control was my food.\n\"I've always been a pretty strong athlete and didn't really think anything about my weight, but different things started to creep in, whether it was weighing myself before training or before we had breakfast. I found myself trying to have this control over food and it just spiralled.\n\"I thought, 'this is just temporary, I'll be able to get through it', but four years went past, and I found myself in a really dark place to the point where I didn't want to see anyone, I didn't want to go to training, I didn't want to get out of bed.\"\nDuring this period, Gorry \"needed someone to sit there and listen\", but instead found people reluctant to discuss body image and eating disorders, something she believes comes down to a fear of not knowing how to respond.\nOpening up on her own experience has helped Gorry to break down some of these barriers with both athletes and her family and friends, and she believes she now has the tools to initiate conversations with her fellow players and provide support before they enter the same spiral she encountered.\n\"It was really tough,\" she said. \"[People] could see I was going through things, but no-one wanted to ask the question, and I think maybe [that's] because no-one knows how to respond.\n\"If someone says, 'no, I'm actually not doing OK, and this is what I'm going through' – how do I respond to this?\n\"I'm grateful for what I went through because I can share my experience with younger players and people around me to make sure they don't go through something like that.\n\"Now that I went through that experience, I can see players going through it which is a good tool for me because I'm able to open up those conversations before I can see it spiralling into a bad place.\"\nEngland and Brighton midfielder Fran Kirby has previously raised issues on the \"stigma\",, external around nutrition in women's football and the pressure on players to deal with abuse about her body shape.\n\"It's such an important thing to talk about – body image and the way that we respect our bodies,\" added Gorry.\n\"As footballers, you think you can overcome anything and it's something we don't really talk about that much.\n\"[But] we still go through things off the field, and we need a space that we can be able to talk to each other, help each other, [and] be better footballers at the end of it.\"\nGorry had always wanted to start a family but believed she'd have to \"hang up the boots\" before realising that dream.\nHaving fallen out of love with football as she recovered from her eating disorder, in August 2021 she gave birth to her daughter, Harper, via IVF.\nIt was during her pregnancy that Gorry not only gained a newfound \"respect\" and \"love\" for her body but also rediscovered her passion for football.\nShe joined Brisbane Roar only a couple of months after giving birth, going on to play \"some of my best football\" at her home team, before returning to European football, first with Swedish side Vittko GIK and later West Ham, where she was appointed club captain before the 2024-25 season.\nShe credits motherhood with giving her a new perspective on her career and said: \"Kids make you become present. They make you appreciate the time you get not only on the field but chatting in the locker room and the relationships you make off the field. That really helped me on the field, off the field, and made me a different person.\n\"I probably wasn't a person people would come to when I was young but definitely after I had kids, I was much more nurturing. I really cared about the players around me because I feel like if they feel cared for and appreciated then you get the best out of them.\n\"It's definitely something I've learned over the last couple of years. I never really looked at myself as a captain but now I feel like it almost comes naturally.\"\nIf you've been affected by the issues in this article, you can visit BBC Action Line for help and support.", "url": "https://www.bbc.com/sport/football/articles/cx2p544ygyqo"}