{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:40:11", "date_modify": "2025-05-21 05:40:11", "date_publish": "2025-01-31 18:42:44", "description": "Morecambe owner Jason Whittingham says he cannot wait to get out of the club, amid a protracted takeover of the Shrimps.", "filename": "sport_football_articles_c203828zpgno_1747806011.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3913/live/5ad39e40-dffe-11ef-b1b3-51355c7a67fc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c203828zpgno_1747806011.html", "title": "Jason Whittingham: Morecambe owner 'cannot wait to get out of the club'", "title_page": "Jason Whittingham: Morecambe owner 'cannot wait to get out of the club' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Morecambe owner Jason Whittingham says that he cannot wait to get out of the club, amid a protracted takeover of the Shrimps.\nWhittingham, through Bond Group Investments, took over in May 2018 with the club at risk of relegation to the National League.\nThe same potential fate awaits them this term, with the Shrimps bottom of League Two and six points adrift of safety, with a takeover by Punjab Warriors still to go through.\nAsked by BBC Radio Lancashire how much he hoped that by the end of February he would no longer own the club, Whittingham said: \"With every fibre in my body.\n\"I can't wait to get out of Morecambe. In a positive way, I no longer want to be the owner of the club.\n\"But I will support the club until such a time as someone else is the owner.\"\nWhittingham's interview comes at the tail end of a transfer window which had initially seen the club unable to sign players until they offered sufficient proof of funds to the EFL that they could operate until the end of the season.\nCo-chairman Rod Taylor previously said the club were \"not in immediate jeopardy\" despite the financial challenge.\nThey secured the funding earlier this week which has allowed them to sign players and mount a challenge to preserve their EFL status with 19 games of the season remaining.\n\"Financially, the club is fine for the rest of the season, and anyone on the board could confirm that. So despite supporters' misgivings, there's no problem for the rest of the season,\" Whittingham added.\n\"The transfer embargo has been lifted, so [manager] Derek Adams is frantically scurrying away in the market to see what he can pick up for the team.\"\nWhittingham was part owner of rugby union club Worcester Warriors, who eventually lost their place in the Premiership in 2022 having gone into administration.\nIn the aftermath of Worcester's demise, Whittingham later put Morecambe up for sale, however over two years on a takeover is still to take place.\nWhittingham added that Morecambe would not meet the same fate as the Warriors.\n\"[It was] a very different beast, Worcester Warriors,\" he added.\n\"Off the back of Covid, the truth is that Covid financially damaged that club to a point where it couldn't survive post-Covid, as with London Irish, as with Wasps. This club is not going down the same route.\n\"Morecambe was fortunate through Covid that it had an insurance payout to support it, but the insurers didn't pay out for any of the rugby clubs just because of wording.\"\nCORRECTION 4 FEBRUARY 2025: An earlier version of this story said that Whittingham was disqualified as a company director for 12 months in October 2022. That sanction was lifted at a subsequent court hearing the following month.", "url": "https://www.bbc.com/sport/football/articles/c203828zpgno"}