{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:37:18", "date_modify": "2025-05-21 07:37:18", "date_publish": "2025-05-20 15:02:15", "description": "Crystal Palace news: Was Joel Ward destined for FA Cup win?", "filename": "sport_football_articles_clyrrvv219do_1747813038.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/45cf/live/7f507010-354c-11f0-b7a7-db7402bc2830.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_clyrrvv219do_1747813038.html", "title": "Crystal Palace news: Was Joel Ward destined for FA Cup win?", "title_page": "Crystal Palace news: Was Joel Ward destined for FA Cup win? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "If you could dream of a perfect ending to a 13-year stint at a club, it would probably involve ending ending a 164-year wait for major silverware.\nAnd that dream became reality for Crystal Palace captain Joel Ward when the Eagles beat Manchester City to lift the FA Cup on Saturday.\n\"There was a quiet belief from my side but there was definitely belief from the team and club that we could do it,\" he told BBC Radio 5 Live's Monday Night Club. \"Some of my close friends had said that the writing was on the wall, but I didn't want to get too carried away.\n\"It was there for the taking and I am so proud of the group as they have created history for this club.\n\"I had a really calm experience [watching from the bench] and more so in the second-half. Towards the end I had a real sense of peace which is probably quite strange because at the beginning of the game I was full of adrenaline and my knees were going and I was shaking.\n\"But it seemed everything was going in the right way and on our side. There was a bigger hand in play for sure.\n\"Every single player put their body on the line. They blocked, they tackled, they worked effortlessly from start to finish.\n\"When you roll the game back, I think we fully deserved to walk away with that FA Cup.\"", "url": "https://www.bbc.com/sport/football/articles/clyrrvv219do"}