{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:30:27", "date_modify": "2025-04-26 07:30:27", "date_publish": "2025-02-27 17:31:12", "description": "Manchester United news: Roy Keane slams Bruno Fernandes captaincy", "filename": "sport_football_articles_ckgyy63l446o_1745652627.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e103/live/49bbdf30-f52c-11ef-9621-af4ff1a2bf4c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_ckgyy63l446o_1745652627.html", "title": "Manchester United news: Roy Keane slams Bruno Fernandes captaincy", "title_page": "Manchester United news: Roy Keane slams Bruno Fernandes captaincy - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Former Manchester United midfielder Roy Keane has claimed \"talent is not enough\" for club captain Bruno Fernandes, who he also believes is \"not a fighter\".\nFernandes, 30, has arguably been the most successful signing of the post-Sir Alex Ferguson era and was handed the armband in July 2023 by ex-manager Erik ten Hag.\nCurrent head coach Ruben Amorim praised \"special player\" Fernandes for his role in Wednesday's hard-fought 3-2 win at home to Ipswich. The Portugal international also played a key part in United's 2-2 comeback draw at Everton.\nHowever, former United captain Keane slammed Fernandes and got into a heated argument with Ian Wright about the playmaker on The Overlap podcast.\n\"Save us? They're 15th in the league and he's saving them? Praise the lord,\" the ex-Republic of Ireland international said.\n\"You have to have a starting point. I go back to it all - talent is not enough. Bruno's a talented player, but talent's not enough.\"\nFormer Arsenal forward Wright's attempts to defend Fernandes further angered Keane, who added: \"You talk to me [about] who you were in a dressing room with. 'Tony Adams was this', 'Tony Adams was that'. Yeah, because he was a fighter. Bruno's not a fighter.\n\"You've got young players. You have to look at somebody and go 'I like what he does'.\n\"They all can't put the ball in the top of the net from 25 yards, I get that. But you want someone who is going 'lads, are you with me?\"'\nWright claimed that \"if Bruno's not there, United are in the relegation places\" and temperatures rose as Keane returned to former Arsenal captain Adams.\nWhen Wright said that was the skipper he was used to, Keane shouted: \"Yeah, yeah, of course. That's the captain we expect!\n\"Was Tony Adams the most talented player in that Arsenal dressing room? So, why do you look up to Tony Adams and go 'listen, I've got a lot of time for him'?\n\"And what did he do with his leadership? Leadership is action. Leadership to me is about action.\"", "url": "https://www.bbc.co.uk/sport/football/articles/ckgyy63l446o"}