{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:53:58", "date_modify": "2025-05-20 11:53:58", "date_publish": "2023-08-05 18:45:22", "description": "Everton 1-0 Sporting Lisbon: Dominic Calvert-Lewin reaction", "filename": "sport_articles_c1wv2qjlynjo_1747742038.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/541e/live/1e973ef0-33c0-11ee-a5b1-25db812f6efa.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c1wv2qjlynjo_1747742038.html", "title": "Everton 1-0 Sporting Lisbon: Dominic Calvert-Lewin reaction", "title_page": "Everton 1-0 Sporting Lisbon: Dominic Calvert-Lewin reaction - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Dominic Calvert-Lewin hailed “another step in the right direction” as his penalty edged a tight pre-season friendly against Sporting Lisbon at Goodison Park on Saturday.\nThe striker played 45 minutes as he continues to build his fitness before the Premier League season starts on Saturday.\n\"I felt good, I felt sharp,\" he told Everton’s website, external. “I feel more confident now. My aim is to be ready for Fulham.\n\"A game of football is there to be won, regardless of whether it's a friendly. I think we can take confidence from today. It was a solid performance personally and collectively and it's important to finish on a win in pre-season going into the competitive season.\"\nCalvert-Lewin has only made 17 Premier League appearances in each of the past two seasons and his fitness is integral to Everton’s success this year.\nHe said he was excited to get back into competitive action at home next weekend after performing in front of more than 28,000 supporters against Sporting.\n“Personally, I'm looking forward to it being packed again against Fulham,” he said. “I've missed that atmosphere here.\n“There are Toffees everywhere, aren't there. We always appreciate the support. It spurs us on.”", "url": "https://www.bbc.com/sport/articles/c1wv2qjlynjo"}