{"authors": ["Oluwashina Okeleji", "www.facebook.com"], "date_download": "2025-05-19 15:05:58", "date_modify": "2025-05-19 15:05:58", "date_publish": "2015-02-18 11:20:57", "description": "Former Nigeria boss Stephen Keshi is one of three candidates under consideration to become the new coach of Burkina Faso.", "filename": "sport_football_31519155_1747667158.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81082000/jpg/_81082059_keshi_.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31519155_1747667158.html", "title": "Nigerian Stephen Keshi on shortlist for Burkina Faso job", "title_page": "Nigerian Stephen Keshi on shortlist for Burkina Faso job - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Nigeria coach Stephen Keshi is in the running to become Burkina Faso's coach after being named in a three-man shortlist for the post.\nThe Burkina Faso Football Federation (FBF) is also considering ex-Ghana coach Milovan Rajevac and ex-Gabon and Niger coach Gernot Rohr.\n\"German Rohr, Serbian Rajevac and Nigerian Keshi have been selected by the Commission,\" read an FBF statement.\n\"The FBF plans to name the successful candidate within three weeks.\"\nBurkina Faso are looking for a successor to the Belgian Paul Put, who left the post after a disappointing Africa Cup of Nations campaign in Equatorial Guinea.\nRunners-up in the 2013 finals in South Africa, the Stallions crashed out in the group stage of this year's tournament, which was won by Ivory Coast.\nKeshi is currently without a role, having been unable to agree a new deal with Nigeria following the failure to qualify for this year's Nations Cup.\nThe 53-year-old is hoping his previous successes with Nigeria, winning the 2013 Nations Cup title and reaching the second round of the 2014 World Cup in Brazil, will help him clinch the post.\nRajevac steered Ghana to the final of the 2010 African Cup of Nations and the last eight of the 2010 World Cup in South Africa.\nRohr took Gabon to the quarter-finals of the 2012 Nations Cup on home soil and also managed Niger at the 2013 edition but failed to get them out of the group stage.", "url": "https://www.bbc.com/sport/football/31519155"}