{"authors": ["Marc Higginson", "www.facebook.com"], "date_download": "2025-05-19 15:24:23", "date_modify": "2025-05-19 15:24:23", "date_publish": "2017-07-05 16:31:53", "description": "Tammy Beaumont and Sarah Taylor share a record second-wicket stand to lead England to a 68-run World Cup win over South Africa.", "filename": "sport_cricket_40510066_1747668263.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/249B/production/_96817390_taylorbeaumont.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_cricket_40510066_1747668263.html", "title": "Women's World Cup: Sarah Taylor & Tammy Beaumont star as England beat South Africa", "title_page": "Women's World Cup: Sarah Taylor & Tammy Beaumont star as England beat South Africa - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tammy Beaumont and Sarah Taylor shared a record second-wicket stand to lead England to a 68-run World Cup victory over South Africa in Bristol.\nOpener Beaumont (148) and wicketkeeper Taylor (147) put on 275 together as England piled up 373-5.\nSouth Africa were always behind the rate but still managed 305-9 in reply.\nVictory means England leapfrog the Proteas into third place in the group stage table, ahead of Sunday's game with defending champions Australia.\nThe Beaumont-Taylor stand was also the highest England partnership for any wicket, and the highest at a World Cup - but fell short of the world record 320 made by India's Deepti Sharma and Poonam Raut against Ireland in May.\nBeaumont - busy and compact at the crease - was nimble on her feet early in her innings before playing some innovative ramps back over the keeper's head when the bowlers had adjusted their lengths.\nTaylor was masterful as she compiled her 147 from 104 balls without having to resort to even the slightest hint of a slog.\nPlaying all of the shots which have become synonymous with the leading players in the men's game, she swept, flicked and ramped her way to her first one-day international century since 2013.\nSome of her shots were delightful, including a Kevin Pietersen-like whip through the leg side which began an over where she took five consecutive fours off pace bowler Shabnim Ismail who conceded 89 runs from her 10 overs - a World Cup record.\nBoth centurions were dismissed late in England's innings - two of the four wickets to fall for 13 runs - before skipper Heather Knight clubbed a rapid unbeaten 22 to boost the score.\nIf England's batters are in fine form, their catching might have cost them on another day.\nThey dropped opener Lizelle Lee three times - Danielle Wyatt, substitute fielder Jenny Gunn and Lauren Winfield the culprits - before finally dismissing her for 72 to end a first-wicket stand of 128.\nThat opening partnership was alongside 18-year-old Laura Wolvaardt who hit some flowing boundaries through the off side before becoming bogged down.\nChloe Tryon smashed a 26-ball 54 to give South Africa late hope, but they had left themselves too much to do and a succession of wickets followed her dismissal.\nDanielle Hazell justified her continued inclusion in place of fellow off-spinner Laura Marsh - who took 4-45 in their last game against Sri Lanka but was left out here in favour of slow left-armer Alex Hartley - by taking three wickets late in the innings.\nSouth Africa's late power hitting, though, did ensure England conceded their highest ever total and contributed to the match becoming the highest scoring women's ODI of all time.\nEx-England captain Charlotte Edwards on BBC Test Match Special\nSarah Taylor and Tammy Beamount were outstanding. They played all around the wicket and South Africa can learn from those innings.\nIt was a frustrating bowling performance by South Africa - 100 runs were scored behind the wicket as opposed to 50 in an average game. They didn't react well to where England were scoring their runs.\nEngland will be far more worried about their bowling and fielding.\nThey dropped catches and conceded a lot of runs. Those are areas they'll need to look at before taking on Australia.\nAustralia rested captain Meg Lanning, who is nursing a shoulder problem,, external for their game with Pakistan, but still managed to cruise to a 159-run win at Leicester.\nEllyse Perry (66), Alyssa Healy (63 not out) and Elyse Villani (59) helped Australia to 290-8 after a brief wobble at 7-2.\nOnce Pakistan fell to 62-5, they were never in the hunt and they eventually succumbed to 131 all out - Jess Jonassen returning eye-catching figures of 10-6-12-1.\nIt was a much narrower scoreline at Derby, where India beat Sri Lanka by 16 runs.\nDeepti Sharma top-scored with 78 for India, whose 232-8 proved too many for Sri Lanka.\nIt means Australia and India sit atop the table with four wins from four - while Sri Lanka and Pakistan slipped to their fourth successive defeat.", "url": "https://www.bbc.com/sport/cricket/40510066"}