{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:11:11", "date_modify": "2025-05-21 04:11:11", "date_publish": "2024-12-29 00:00:00", "description": "Liverpool stretch their lead at the top of the Premier League to eight points as they thrash an abject West Ham United at the London Stadium.", "filename": "sport_football_live_cqx8yp191g1t_1747800671.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cqx8yp191g1t_1747800671.html", "title": "West Ham 0-5 Liverpool: Mohamed Salah stars as Reds go eight points clear at top", "title_page": "West Ham 0-5 Liverpool: Mohamed Salah stars as Reds go eight points clear at top - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Liverpool stretched their lead at the top of the Premier League to eight points as they thrashed an abject West Ham United at the London Stadium.\nIt was another capital goal-fest for Arne Slot's irresistible side after the 6-3 win at Tottenham seven days previously, the outcome never in doubt as a first-half masterclass left a desperately passive Hammers well beaten.\nLiverpool had already missed several chances before Luis Diaz gave them the lead with a powerful finish on the half-hour mark. Cody Gakpo was then the beneficiary of Mohamed Salah's brilliant footwork to add a second after 40 minutes, before the Egyptian inevitably got in on the act himself with a low drive on the stroke of half-time for his 20th goal of a superb season.\nJulen Lopetegui's side could not even manage damage limitation as Trent Alexander-Arnold added the fourth after 54 minutes when his long-range effort took a deflection off Max Kilman's head past Alphonse Areola.\nOnly Mohammed Kudus offered anything resembling hope for the hosts, hitting the woodwork in each half while Luis Guilherme did the same just before the end, but this was no consolation as they were utterly outclassed by this rampant Liverpool outfit.\nThe gap in quality was emphasised six minutes from time when Salah bamboozled several West Ham defenders with a brilliant run from inside his own half before setting up substitute Diogo Jota for a typically clinical finish.\nWest Ham's desire for change at the end of last season led to the departure of David Moyes, who oversaw their Europa Conference League success in 2023, and the arrival of Lopetegui.\nIn an atmosphere so subdued you could almost hear a pin drop inside the vast bowl of the London Stadium, the Spaniard's struggle to make any sort of serious statement continued against Liverpool.\nThe closing stages were played out in an eerie silence apart from the sound made by thousands of celebrating visiting fans who had enjoyed a game where the Hammers barely gave them a moment of serious anxiety, those two Kudus efforts apart, although the second came when it was 4-0.\nLiverpool are, arguably, Europe's form side at present, but West Ham's passive body language and defeatist approach betrayed a team that looked beaten from the first whistle.\nThe hosts did at least come into this game on the back of four games unbeaten in the league, but this was a defeat that brought them back to grim reality.\nAnd after spending £120m in the summer, there still seems no discernible improvement under Lopetegui since he succeeded Moyes, with West Ham down in 13th place and nine points clear of relegation.\nSummer signings Crysencio Summerville and Niclas Fullkrug, brought in to add creativity and threat, were on the bench at the start and only Kudus – and of course the tireless Jarrod Bowen who went off injured on the hour – looked capable of producing a spark.\nThousands of West Ham fans left well before the final whistle, leaving swathes of empty white seats behind them as Liverpool closed out the victory in such comfort it was almost embarrassing.", "url": "https://www.bbc.com/sport/football/live/cqx8yp191g1t"}