{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:30:46", "date_modify": "2025-05-19 14:30:46", "date_publish": "2017-08-26 00:00:00", "description": "Follow live text commentary, social media analysis and images as Watford host Brighton at Vicarage Road.", "filename": "sport_live_football_40759369_1747665046.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_live_football_40759369_1747665046.html", "title": "Watford v Brighton", "title_page": "Premier League: Watford v Brighton - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "FULL-TIME\nWatford 0-0 Brighton\nBrighton are off the mark in the Premier League, despite failing to score for a third consecutive match.\nWatford can be happy with a point having played most the match with 10 men.\nPost\nWatford 0-0 Brighton\nAttacking quality has been at a premium at Vicarage Road, this afternoon.\nA point illustrated perfectly as Andre Gray makes a rare foray into the Brighton box before lashing well wide of Ryan's goal.\nPost\nWatford 0-0 Brighton\nTwo more chances come and go for Brighton.\nGomes has to be at full stretch, to tip Knockaert's low drive wide of his left post, while Duffy heads wide from the resulting corner.\nPost\nWatford 0-0 Brighton\nThis touch map tells you all you need to know about Watford's afternoon.\nThey've had just eight touches of the ball in Brighton's box, but it's a different story at the other end for their defensive rearguard.\nHeurelho Gomes hasn't had that much to do in goal, though.\nPost\nWatford 0-0 Brighton\nThe answer is no, but Brighton have an even better chance now from an in-direct free-kick inside the Watford 18 yard box...\nIt's an unusual one, as Abdoulaye Doucoure goes in with a high foot competing for the ball with Knockaert.\nBut Lewis Dunk's effort deflects wide for a corner, which comes to nothing.\nPost\nWatford 0-0 Brighton\nAnother chance goes begging for Brighton.\nThis time it's Tomer Hemed, who hit the post in the first-half, who volleys just wide after a corner is headed back across goal.\nWill the Seagulls be left to regret these missed chances?\nSUBSTITUTION\nWatford 0-0 Brighton\nMore problems for Watford, as substitute Craig Cathcart, brought on in place of Nordin Amrabat, is taken off because of an injury.\nAndre Carrillo - on loan from Benfica - is on for his Hornets debut.\nPost\nWatford 0-0 Brighton\nNo question that the talking point of that first-half is the red card to Watford's Miguel Britos midway through the half.\nThe home side had looked the more likely to score in the early exchanges, but the Uruguayan's dismissal, coupled with a tactical decision from Marco Silva to take off Nordin Amrabat has stifled their attacking opportunities, save for a Nathaniel Chalobah shot which flashed wide.\nBut what of Brighton? They've certainly had the better chances, hitting the post twice through Knockaert and Hemed, but their wait for a Premier League goal is now up to 225 minutes.", "url": "https://www.bbc.com/sport/live/football/40759369"}