{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:06:02", "date_modify": "2025-05-19 15:06:02", "date_publish": "2015-02-08 22:49:58", "description": "Mark Selby wins his first ranking title since last year's World Championship by beating Shaun Murphy in the German Masters.", "filename": "sport_snooker_31263089_1747667162.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/80872000/jpg/_80872849_mark_selby1_getty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_snooker_31263089_1747667162.html", "title": "Mark Selby beats Shaun Murphy to win German Masters title", "title_page": "Mark Selby beats Shaun Murphy to win German Masters title - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Mark Selby won his first ranking title since lifting the World Championship last May by beating Shaun Murphy 9-7 in the German Masters final.\nSelby, whose victory lifted him to the top of the world rankings, came back from 5-2 down to defeat his fellow Englishman in Berlin.\nThe 31-year-old, from Leicester, won five frames in a row, then pulled away after Murphy came back to make it 7-7.\n\"It's fantastic to get a win under my belt,\" Selby told Eurosport.\n\"Winning the World Championship did put a lot of weight on my shoulders. I did feel a lot more pressure to win tournaments. It's nice to get one out of the way.\"\nSelby - who beat Ronnie O'Sullivan to earn his first world title in Sheffield - had arrived at the German Masters straight from the Chinese 8-Ball Pool World Championship, where he had lost to England's Darren Appleton in the final.\nHaving not played snooker for two weeks, and suffering jet lag, the 2012 UK champion acknowledged that he struggled in the early rounds in Berlin.\n\"For the first few matches here, I was battling through,\" he said. \"For two or three frames tonight, I don't think anyone could touch Shaun. But I played well at the start of the evening session, and that helped me going into the last few frames.\"\nMurphy, 32, had looked on course for his fifth title in 12 months, but lost the final frame of the afternoon and then the first four of the evening.\n\"Losing the first four frames tonight wasn't in my script, but the guy's a world champion and he's a credit to our sport,\" Murphy said. \"We're lucky to have him.\"", "url": "https://www.bbc.com/sport/snooker/31263089"}