{"authors": ["Dan George & Andrew Moon", "www.facebook.com"], "date_download": "2025-04-26 03:41:00", "date_modify": "2025-04-26 03:41:00", "date_publish": "2025-03-05 09:10:43", "description": "Portsmouth captain Marlon Pack says that his side are in a \"fantastic position\" to stay up this season but it is up to the players to ensure they make it happen.", "filename": "sport_football_articles_c93nk2xzj9qo_1745638860.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4fd6/live/2bf94f10-f99f-11ef-a629-ef88fbd35a13.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c93nk2xzj9qo_1745638860.html", "title": "Marlon Pack: Portsmouth captain on survival and new position", "title_page": "Marlon Pack: Portsmouth captain on survival and new position  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Portsmouth captain Marlon Pack says they are in a \"fantastic position\" to stay up this season but it is up to the players to ensure they make it happen.\nFollowing three consecutive wins, the Blues were defeated on Saturday when they travelled to third from bottom Luton Town.\nJohn Mousinho's side are 17th in the Championship table, eight points clear of the drop zone.\n\"Realistically we're in a fantastic position.\" Pack told BBC Radio Solent.\n\"We now need to win as many games as we can before the end of the season to stay in the division.\n\"Results, bar the odd poor game in the November period, have been really consistent and our performances have been too.\n\"We are starting to show that we belong at this level, it's now down to us to make sure we get over the line.\"\nDefensive Injuries have stretched the squad of late with Rob Atkinson set to miss six to eight weeks and Hayden Matthews sidelined for the rest of the season, requiring ankle surgery.\nConor Shaughnessy is also still not due back for a number of weeks.\nOne of that trio could have partnered the returning-from-injury Regan Poole at centre-half but with a lack of available options, midfielder Pack has been filling in alongside the Welshman.\n\"It's a job that I'm unfamiliar with,\" Pack added.\n\"But when I'm called upon, it's a job that I'll step up to and play to the best of my ability.\n\"It's really disappointing with the injuries, just two weeks ago we were in a really strong position at centre-back and it's no coincidence that results were going well.\n\"It's a massive blow for us but as you may have seen with this group, and this club, the mentality is to roll our sleeves up and go again.\"\nComing next for Pack and Portsmouth, they welcome league leaders Leeds United to Fratton Park on Sunday.", "url": "https://www.bbc.co.uk/sport/football/articles/c93nk2xzj9qo"}