{"authors": ["Michael Pearlman", "www.facebook.com"], "date_download": "2025-05-21 03:38:07", "date_modify": "2025-05-21 03:38:07", "date_publish": "2025-02-11 11:36:22", "description": "Welsh boxer Jay Harris has retired from the sport because of a lack of opportunities.", "filename": "sport_boxing_articles_c87dn73gp8lo_1747798687.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7061/live/763f3710-e865-11ef-a792-f3854a1e2cbd.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_boxing_articles_c87dn73gp8lo_1747798687.html", "title": "Boxing: Jay Harris, British and European boxing champion, retires", "title_page": "Boxing: Jay Harris, British and European boxing champion, retires - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Welsh boxer Jay Harris has retired from the sport because of a lack of opportunities.\nDespite being the current European and British flyweight champion, having relinquished his Commonwealth title, Harris has been inactive for 12 months and has never had a promotional deal with any of the top UK promoters.\nThe 35-year old – who like his father Peter won a British title – says the risks associated with the sport can no longer be justified for the limited purses he is offered, despite the fact he is a former world title challenger who headlined a major show in Texas.\n\"The fights I've been offered in the past year, the money wasn't very good. It wasn't the right time in my career for those sort of fights. It wasn't right to risk my health and go at it for that sort of money,\" Harris told BBC Sport Wales.\n\"I won the Commonwealth title and then got sidelined. That's what boxing can be like.\"\nHarris has pondered retirement before, but having won three titles in his previous two fights, his career seemed on an upward trajectory again and a possible second world title shot.\nHarris became the first Welshman in 103 years to win the European title twice, having beaten Connor Butler in a barnstormer in February last year.\nIn 2020 he fought WBC world flyweight champion Julio Cesar Martinez in Texas, losing on points in a gallant effort that proved he belonged at the world level, having previously been a European and Commonwealth champion.\nHarris performed so well that Martinez's promoter Eddie Hearn tipped him as a future world champion, but the reality was more painful, with Harris losing two of his next three fights.\nHarris' defeats came at the worst possible time for a boxer to be on the slide as the Covid pandemic caused most small hall shows to be cancelled. With Harris only able to box once in 2022, he began working towards a career as a personal trainer.\nHarris decided to carry on and his renaissance began in May 2023 when he captured the British title by beating Sheffield fighter Tommy Frank in Rotherham.\nThat led to the 2024 fight against unbeaten Liverpool prospect Butler in his home city, with Butler's European and Commonwealth titles on the line against Harris' British title, with Harris taking the unanimous verdict in an all-action fight and becoming the first Welshman to reclaim the European title since Johnny Basham in 1921.\nHarris seemed destined for one big final shot at infamy, a shot he had earned, but the politics of boxing mean what is deserved is not necessarily what is presented.\n\"I spent pretty much my whole childhood and most of my adult life boxing,\" Harris said, \"so it is hard to give it up in that sense.\n\"If I was a heavyweight, my chance would have come, 100%.\n\"But if you're a flyweight, the other promoters just don't take notice really.\n\"For the flyweights and everybody else below us, you go into the shadows pretty much.\n\"Which is sad, because it's a good weight, an exciting weight. We go hell for leather for 12 rounds pretty much and that fact kind of gets lost.\"\nFor Harris there is a sense of gratitude that he is able to leave the sport by his own volition and with his health intact, something no fighter can take for granted, but frustration that another big opportunity never came his way after his impressive world title display in Texas.\nHarris believed 2024 would present him with another chance at world honours, but ultimately the husband and father of two is grateful to be leaving the sport with his faculties intact and having forged a stellar reputation among fight fans, especially in his native Wales.\n\"I honestly thought if I was going to fight for it (a world title), it would have ended up on the back end of last year maybe,\" he said.\n\"And because we had such a big momentum going in last year, I thought the chance would come again. And for some reason, it just never, never happened.\"\nDoes the way it ended make Harris regretful of his time in the sport, or liable to look back with dissatisfaction? He doesn't think so.\n\"I'm not so much bitter,\" he said. \"I am gutted the way it ended because I thought I deserved more. But I have no regrets, I fought for everything. I fought for every single title. I fought everyone put in front of me and I was always in good fights. I don't resent the sport.\n\"But I don't really like the politics of the boxing behind the scenes.\n\"You can have a top fighter, and he's just not getting opportunities because he hasn't got the right promotion. That stinks and that needs to change.\n\"The lower weight classes deserve more recognition. If I had been a few weights up, six to nine more pounds in weight, that's all it would be, I would have a frigging lot more money, let me tell you that!\"\nHarris, who made his debut at the Newport Centre in 2013 for a purse of £120, retires with a record of 21-3 and having challenged for a world title, sits with a group of top class Welsh boxers such as Liam Williams, who were high class fighters who did not quite manage to win the ultimate prize.\nHowever, with the support of his family and friends, Harris says he's ready for the next stage of his life, having grown up in a boxing family where the sport has been a part of his life since childhood.\nHarris says his world title shot was his biggest night in the sport, but gleans most satisfaction from following in his father's footsteps by becoming a British champion.\n\"The world title fight in Texas was up there, the whole aura around it, the build-up, the fighters I met, it was just another level, massive,\" he added.\n\"But, if I was going to say one of my most memorable things, winning the British title was probably up there for me, only because of the fact that everybody thought I was finished. And it was a just mind over matter sort of thing, I knew where I was and what I could achieve and that winning the British title is like the one that got away.\n\"When the British title come up and I was like 'I need to do that' and it was good because I won it and my old man has won it as well so it's good to keep it in the family legacy.\"\nHarris' father Peter was in his corner throughout his career and supports his decision to retire.\nSo how ultimately, will Harris look back on his decade as a professional and lifetime of boxing?\n\"Exciting, I fought everyone ever put in front of me, did everything the hard way, won most of my titles away from home and I can look back at my career and think that I've done everything,\" he said.\n\"I've reached the top and done most things that fighters would dream about, to be honest, and I've done it with my dad, which is amazing.\n\"I always said that I was going to retire from boxing and boxing was never going to retire me and I would go out on my own terms as a champion.\n\"Now, I'm happy to be to be retired. It's nice to say sometimes as well. It's like a little weight lifted off your shoulders, it needed to happen and I'm happy with my decision and I think that's all that matters.\n\"I am happy with what I got out of boxing. I got my house, I can provide for my family and that's all that matters.\"", "url": "https://www.bbc.com/sport/boxing/articles/c87dn73gp8lo"}