{"authors": ["Sean Kearns", "www.facebook.com"], "date_download": "2025-05-21 08:03:04", "date_modify": "2025-05-21 08:03:04", "date_publish": "2025-01-13 13:39:31", "description": "The arguments for and against the scrapping of FA Cup replays.", "filename": "sport_football_articles_c86396e9jqdo_1747814584.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/02f9/live/a15f29d0-d197-11ef-a14b-8f7223b7d1ef.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c86396e9jqdo_1747814584.html", "title": "FA Cup replays: The arguments for and against", "title_page": "FA Cup replays: The arguments for and against  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tamworth's third-round tie against Tottenham was the essence of the FA Cup. It had everything.\nWell, almost everything.\nThe non-league side kept the Premier League big boys at bay for 90 minutes at the Lamb Ground and nearly hit a giant-killing winner in the seventh minute of injury time.\nIn the previous 154 years of the FA Cup, they would have earned a money-spinning replay at Tottenham's stadium to earn the club a once-in-a-generation financial windfall.\nBut not this year. Instead, the game continued and Spurs' quality told in extra-time as Ange Postecoglou's side sealed a 3-0 win. Tamworth became the first major victims of the FA's decision to scrap replays in the FA Cup.\nA previous change saw replays from the fifth round and beyond removed for the 2018-19 campaign then in 2024 the FA announced that replays were to be scrapped from the first round onwards.\nThe decision was part of a new six-year agreement between the FA and the Premier League which also included the FA saying more matches from the earlier rounds would be broadcast to create \"additional guaranteed broadcast revenue\" for EFL and National League teams.\nA further change was to move the final to the penultimate weekend of the Premier League season and keep that day free of Premier League fixtures.\nMark Bullingham, CEO of the FA, said at the time that \"the new schedule ensures the magic of the cup is protected and enhanced, while working for the whole of the English game\".\nThe main factor put as an explanation was fixture congestion.\nThe FA said the move to eliminate replays from the first round onwards was made \"in light of changes to the calendar driven by the expanded Uefa competitions\". It was added that \"all parties accepted [replays] could not continue\".\nThe FA said discussions were held to determine how competitions could be made stronger, yet with fewer dates available and all the while keeping player welfare to the fore.\nCertainly, players at the top level face a busier fixture list - the Champions League and Europa League formats have been expanded meaning two extra group-round matches and a revamped Club World Cup will now feature 32 sides, including Manchester City and Chelsea this summer.\nIn September, Manchester City midfielder Rodri said players were close to going on strike in protest at the increase in games. Later that month, the Spaniard tore his Anterior Cruciate Ligament (ACL), ruling him out for a minimum of six months.\nA separate argument put by some is that the removal of replays gives clubs lower down the football pyramid a greater chance of progressing as they might reach penalties or win in extra-time, rather than starting a game anew in a replay.\nTamworth, for example, beat League One side Burton Albion in the second round on penalties to set-up their tie against Tottenham.\nThose in favour of the changes might argue that Tamworth's chances of reaching the third round were improved by scrapping replays.\nAt the end of the season there is going to be a review of the changes that have been made for this season's FA Cup.\nBBC Sport has been told that replays will not be reintroduced.\nHowever, one possibility is that extra-time could also be ditched and matches could go straight to penalties if they are level after 90 minutes.\nSpeaking on Sunday on the BBC's FA Cup coverage, Gary Lineker said: \"I think if they're going to take away replays they should take away extra-time because it really favours the strong teams.\"\nThe EFL, representing sides in the Championship and Leagues One and Two argued the new format was \"agreed solely between the Premier League and the FA\" and they were being \"marginalised in favour of others further up the pyramid\".\nCriticising the change, CEO Trevor Birch said: \"This is another traditional revenue stream lost for EFL clubs at a time when the financial gap between the biggest clubs and those further down the pyramid is widening.\"\nNational League CEO Mark Ives said: \"We have at no stage voiced our support for the scrapping of FA Cup replays or otherwise. It was a decision made by the Professional Game Board (PGB) which is made up of the FA, Premier League and EFL.\"\nThe FA refute these claims, saying \"all parties\" were in agreement that replays \"could not continue\".\nPerhaps the biggest ramification of removing replays is the chance for clubs in lower leagues to receive an extra financial windfall.\nTake Tamworth, for example.\nAccording to football finance expert Kieran Maguire, external, a replay at Spurs' stadium would have earned them about £800,000 through ticket sales and TV money. In the FA Cup, ticket sales are split equally between clubs, regardless of whether you play at home or away.\nTo put that into context, Maguire suggests Tamworth's annual wage bill is £1.1m and that their revenue in 2024 was £1.6m.\nIt is worth noting that even with the change, issues of fixture congestion remain. Spurs may have avoided one match they would have faced in previous seasons, but they still face a busy schedule when the next round is played.\nTheir fourth-round tie against Aston Villa should be held on either Sunday 9 or Monday 10 February, but they face Liverpool in the EFL Cup semi-final second leg on 6 February. Opponents Villa could have a Champions League play-off fixture on 11 January if they finish outside the top eight in the Champions League group.\nSpeaking after his side's win, Tottenham boss Ange Postecoglou was sympathetic to Tamworth's situation but said it was \"impossible\" for his side to play a replay.\n\"I get the sentiment, but at the same time I've been banging on about less games so it is a balancing act,\" he said.\n\"The way the calendar is at the moment, it would be almost impossible for us to fit another game in. We are already struggling to fit it all in. I certainly believe in the competition and what it does offer every part of the football pyramid, and I think it should be protected.\"\nTamworth manager Andy Peaks said: \"To take a team to extra-time, it is unbelievable. I am immensely proud. I just said 'don't be disappointed, because we almost created history there'.\"\nFormer Premier League winner Chris Sutton said on 606 that he believed the decision to scrap replays had risked damaging the \"fairy tale\" of the FA Cup.\nMacclesfield boss Robbie Savage said: \"With the lucrative nature of a replay - who does it benefit [there being] no replays? It benefits the bigger clubs, doesn't it? The magic of the FA Cup has been all about replays and giant-killing. It's ridiculous. Bring back replays.\"\nFormer Tottenham and England goalkeeper Paul Robinson told Football Daily: \"For Tamworth to go back to Tottenham [in a replay] the revenue it brings, the experience it brings. If you don't want an extra game Tottenham, make sure you win in 90 minutes!\n\"I don't mind having the replays, I think there's something special about getting to 90 minutes, get a draw and get yourselves away to a big club. Finance wise it could keep that club afloat for five or six years.\"", "url": "https://www.bbc.com/sport/football/articles/c86396e9jqdo"}