{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:34:56", "date_modify": "2025-05-20 13:34:56", "date_publish": "2023-08-01 18:23:18", "description": "Chelsea press conference: Pochettino before Dortmund friendly", "filename": "sport_articles_c1wv960wp7no_1747748096.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c1wv960wp7no_1747748096.html", "title": "Chelsea press conference: Pochettino before Dortmund friendly", "title_page": "Chelsea press conference: Pochettino before Dortmund friendly - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "On new signing Lesley Ugochukwu: \"Today is going to be his first training session with us. He’s a young, talented player. We don’t know if he will have the possibility to play tomorrow but we will assess him from now until the end of the transfer window to see if he is going to be with us or maybe there’s a possibility for him to go on loan.\"\nPochettino says he is not disappointed he hasn't been able to sign more new players to bring to the USA, stating: \"I’m happy in the way the club is working. I think we all understand and we know that during the last few weeks of the transfer window that maybe things are going to happen. It is better to maybe have everything closed before but I think we know for us, but different clubs also continue to work to try to finish and to finish and close the squad.\"\nHe feels the club are not \"ahead or behind\" in preparing for the season, adding: \"This is the reality and we need to be positive. I've told that to the staff and the players.\"\nOn Levi Colwill's chance of starting after the defender posted a goodbye message to Brighton: \"At the moment I need to see him and get to know him better. Of course he's a fantastic talent. We were talking about the way we can help and improve his game in other areas. He's so relaxed and calm. When I talk with him he's a great character. I was clear with him that there is the possibility to compete with other team-mates. If he deserves to play he will play. He needs to deserve. He needs to show he can play.\"\nPochettino did not commit to a stance on the future of Trevoh Chalobah given Chelsea are in the market for defensive additions: \"We suffered a big loss with Fofana. I think it is normal that the club is trying to find and reinforce that area. It is similar to when we were talking with Levi, if he deserves to play he will play. Chelsea need to have good players.\"", "url": "https://www.bbc.com/sport/articles/c1wv960wp7no"}