{"authors": ["Amy Canavan", "www.facebook.com"], "date_download": "2025-05-20 14:45:01", "date_modify": "2025-05-20 14:45:01", "date_publish": "2023-07-27 18:51:19", "description": "BBC Sport Scotland to show live coverage of the final two days of the Bowls Scotland National Championships", "filename": "sport_bowls_66332242_1747752301.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/14537/production/_130555238_19938770.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_bowls_66332242_1747752301.html", "title": "Bowls Scotland National Championships live on BBC Scotland", "title_page": "Bowls Scotland National Championships live on BBC Scotland - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The biggest week in the Scottish lawn bowls calendar is underway at Northfield in Ayr and BBC Sport website will be showing live coverage from the final two days of the Bowls Scotland National Championships.\nOne of the Gents Pairs quarter-final and a Ladies Singles semi-final will be live on Friday, 28 July, with the Gents Singles final on Saturday as the curtain closes on another action-packed seven days.\nGames will be streamed on the BBC Sport Scotland website from 09:00-16:00 BST on Friday, and 14:00-16:00 on Saturday.\nFinals have been staged throughout the week, with those braving the challenging conditions at times rewarded with a feast of talent.\nDaniel Martin of Dunfermline North won the Gents Junior Singles and Rachel Pirie from Broughty picked up the Ladies Junior Singles.\nJohn Boyd of Titwood won the Gents Over-55 Singles and Isobel Bulloch of Raploch scooped up the Ladies Over-55 Singles.\nMarchmount sealed the Gents Over-55 Fours, while Glenmavis secured the Ladies Over-55 Fours title.\nAfter defeating five-time Commonwealth Games gold medallist Paul Foster MBE and his partner Margo Barr in the semi-final, the Eaglesham pair of Christine Barradell and Alan Gray lifted the Mixed Pairs trophy.\nRobert Barr and Melanie Inness, who had success in Birmingham at the Commonwealth Games in the Para-Sport B2/B3 Mixed Pairs, followed up with victories in the Gents and Ladies B2/B3 Singles, respectively.\nKelty's Billy Allan triumphed in the Gents B6 Singles, while Strathmiglo's Michael Simpson did so in the Gents B7/8 Singles, for a second time.\nRosemary Lenton of Crighton Royal rounded off an incredible 12 months by defeating international teammate Pauline Wilson in the Ladies B6/7/8 Singles, following her gold at the Birmingham Games.", "url": "https://www.bbc.com/sport/bowls/66332242"}