{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:27:08", "date_modify": "2025-05-21 07:27:08", "date_publish": "2025-03-28 14:03:26", "description": "Swansea City: Alan Sheehan wishes Leeds United well - after this weekend", "filename": "sport_football_articles_c3d8dkl5kplo_1747812428.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6d86/live/36e0add0-0bd1-11f0-af58-ad3b17745e6c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c3d8dkl5kplo_1747812428.html", "title": "Swansea City: Alan Sheehan wishes Leeds United well", "title_page": "Swansea City: Alan Sheehan wishes Leeds United well - after this weekend - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Alan Sheehan returns to Leeds United this weekend hoping his old club will enjoy \"all the success\" after Swansea City's visit to Elland Road.\nFormer left-back Sheehan played 24 games for Leeds, scoring twice, after joining the Yorkshire club – initially on loan and then permanently – from Leicester City in 2008.\nHe was part of a squad who lost to Doncaster Rovers in the League One play-off final in 2007-08, the same season in which Roberto Martinez's Swansea team won the division in style.\nSheehan has fond memories of playing for Leeds under Gary McAllister, but the arrival of Simon Grayson as manager saw the Irishman fall out of favour.\nHe had loan spells with Crewe Alexandra, Oldham Athletic and Swindon Town before making a permanent move to the County Ground in 2010.\nAsked about his spell at Leeds, Sheehan joked: \"I was there for half an hour.\n\"I had a good time there on loan under Gary McAllister. We lost in the play-off final in the year Swansea got promoted from League One.\n\"Then I signed permanently. I had some good times under Gary McAllister, then there was a change of manager and I ended up going out on loan.", "url": "https://www.bbc.com/sport/football/articles/c3d8dkl5kplo"}