{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:59:17", "date_modify": "2025-05-20 11:59:17", "date_publish": "2023-08-06 09:27:22", "description": "Glentoran manager Warren Feeney praises his players for \"keeping going to the end\" in their last-gasp 1-0 win over Glenavon.", "filename": "sport_football_66415625_1747742357.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/15168/production/_130667368_feeneyonline.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66415625_1747742357.html", "title": "Warren Feeney: Glentoran manager praises his side for 'keeping going until the end'", "title_page": "Warren Feeney: Glentoran manager praises his side for 'keeping going until the end' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Glentoran manager Warren Feeney has praised his players for \"keeping going to the end\" as they secured a last-gasp 1-0 win over Glenavon on Saturday.\nJay Donnelly poked home the winner eight minutes into stoppage time to give the Glens victory in Feeney's first league match in charge.\n\"People will see this and might say, 'you're lucky scoring in the last minute',\" said the new Glens boss.\n\"But football is right up to the last minute, until that final whistle goes.\"\n\"The one thing I want to instil in this club is 'don't give up, you keep going to the end'.\n\"I thought our fitness levels were exceptional. We had to jiggle some players round but I thought every one of them was outstanding and did the fans and the club proud.\"\nDonnelly pounced to strike inside the area after substitute Shay McCartan delivered the inviting low cross from the right in the dying moments at Mourneview Park.\n\"It's a great bit of play by Shay, a fabulous little bit of trickery. He's been on the treatment table, but he's a very very good player.\n\"I tried to sign him before when I was in England. I know the quality he's got.\n\"You look at the balls he put in, a striker's dream. That wee bit of quality, and I was so pleased for Jay. He did what he does best, get in there where it hurts.\n\"He just needs an arm around him. For me, he was, and can be again the best striker in this league.\n\"It was a fantastic finish. He hit that with conviction but I thought we deserved that today.\n\"We had one cleared off the line, we hit the post but it's 90 plus minutes and whether you score in the first minute, whether you score in the last minute, as long as you keep a clean sheet you always give yourself a chance.\"\nThe east Belfast side's next Premiership game is a mouth-watering looking fixture against champions Larne at the Oval on Friday night.", "url": "https://www.bbc.com/sport/football/66415625"}