{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:37:34", "date_modify": "2025-05-21 03:37:34", "date_publish": "2025-04-08 00:00:00", "description": "Hannah Cain rounded off a sublime team move as Wales earned a point in their Nations League contest with Sweden.", "filename": "sport_football_live_c3dkxeejk71t_1747798654.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c3dkxeejk71t_1747798654.html", "title": "Women's Nations League: Hannah Cain goal helps Wales to achieve shock draw in Sweden", "title_page": "Women's Nations League: Hannah Cain goal helps Wales to achieve shock draw in Sweden - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Still very much an emerging nation when it comes to women's football, Wales' daunting task in Sweden was made that much harder by a series of injuries.\nAlready without cap centurion Sophie Ingle, who is recovering from ACL surgery, Wales were also without their most-capped player and top goalscorer Jess Fishlock as well as forward Kayleigh Barton.\nVice-captain Ceri Holland suffered a shin injury in Friday's defeat by Denmark that is thankfully liable only to keep her out for a number of weeks rather than months, meaning four potential starters were absent.\nThat meant a start for defender Esther Morgan, 639 days after she last pulled on a Wales shirt due to injury issues, while striker Elise Hughes made her first start for club or country in more than a year following ACL surgery.\nGoalkeeper Middleton-Patel was also included, with the 20-year-old starting for the third time for her country in by far the biggest game of her career to date.\nIt was Hughes who had the first sniff of a chance of the contest, heading wide from Rhiannon Roberts' swinging cross.\nHowever, it was not long until the home side began to create chances and Middleton-Patel was in the thick of the action, saving routinely from Kosovare Asllani's effort before producing an excellent diving stop to deny Fridolina Rolfo's fierce shot.\nWales might have already trailed by that point, but Johanna Rytting Kaneryd's effort drifted inches wide of the post after Rolfo led a lightning fast counter-attack.\nHowever, Sweden were not able to build on their early chances and Wales produced a couple of decent counter-attacks before the interval, but Carrie Jones and Ella Powell's dangerous crosses evaded everyone.\nThe hosts should have led just before the break, but they again missed a golden opportunity as Asllani fired just wide of the post with only Middleton-Patel to beat, with the Manchester United goalkeeper appearing to get the faintest of touches.\nWales' rearguard resistance lasted for an hour and the visitors will be furious about the way they fell behind as ex-Chelsea defender Eriksson had the simplest task of glancing home a header from Filippa Angeldahl's pinpoint corner.\nAfter such an impressive rearguard action it was a frustrating way to go behind, but Wales levelled on 68 minutes as they punished a rare lapse from Sweden, with Cain scoring within four minutes of her introduction as a substitute with a brilliant breakaway goal.\nThe goal owed a lot to Rachel Rowe's beautifully weighted pass that sent Cain clear, with the Leicester City forward rounding goalkeeper Jennifer Falk and finishing from a narrow angle via the inside of the post.\nSuddenly Wales were the side asking the questions and they might have snatched a shock lead on 76 minutes, but Ffion Morgan's shot was well saved by Falk.\nSweden took impetus from that let-off, but were finding Middleton-Patel to be a goalkeeper in inspired form as she made two more fine saves to deny Stina Blackstenius and Rytting Kaneryd, before turning Julia Zigiotti Olme's effort around the post.\nMadelen Janogy also headed wide as Sweden pushed and pushed, with Middleton-Patel denying Matilda Vinberg deep into added time.\nWales continued to be a threat on the counter, with Cain firing straight at Falk, but in the end Wilkinson's side will unquestionably be happy with another morale-boosting result before Euro 2025, their first major tournament appearance.", "url": "https://www.bbc.com/sport/football/live/c3dkxeejk71t"}