{"authors": ["Nick Mashiter", "www.facebook.com"], "date_download": "2025-05-21 04:12:59", "date_modify": "2025-05-21 04:12:59", "date_publish": "2025-01-15 08:08:19", "description": "Aston Villa news: Opinion - How Villans kept to PSR rules", "filename": "sport_football_articles_c20g7vdz483o_1747800779.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7569/live/57a66290-4781-11ef-96a8-e710c6bfc866.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c20g7vdz483o_1747800779.html", "title": "Aston Villa news: Opinion", "title_page": "Aston Villa news: Opinion - How Villans kept to PSR rules - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Aston Villa needed to sell players last summer to comply, having reported a loss of £119m in their accounts up to 31 May 2023.\nAt the time, Villa said the figures were \"in line with the strategic business plan\" and within PSR, set by the Premier League.\nIn the early summer scramble to be compliant before 30 June, they sold midfielder Douglas Luiz to Juventus for £42m and Moussa Diaby joined Saudi side Al-Ittihad for £50m, while they also allowed Tim Iroegbunam to leave for Everton for £9m and Omari Kellyman to Chelsea for £19m.\nYet Diaby's signing from Bayer Leverkusen for a reported £51m and Spain centre-back Pau Torres from Villarreal for £31.5m, in July 2023, are included in these accounts.\nVilla made a profit of £300,000 in their 2021-22 accounts, helped by the sale of England midfielder Jack Grealish to Manchester City for £100m.\nHowever, Maguire said profit from that sale will be lost on the next three-year cycle of 2022-2025.\nVilla voted against the introduction of PSR rules - which came into force in 2015-16 - while in June, co-owner Nassef Sawiris said he was considering legal action.\nSawiris told the Financial Times in the summer: \"Some of the rules have actually resulted in cementing the status quo more than creating upward mobility and fluidity.\n\"The rules do not make sense and are not good for football.\"", "url": "https://www.bbc.com/sport/football/articles/c20g7vdz483o"}