{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:02:25", "date_modify": "2025-05-20 14:02:25", "date_publish": "2023-07-30 14:37:46", "description": "Fulham: Marco Silva on signings, Mitrovic and preparations", "filename": "sport_articles_cjrlqz14kgwo_1747749745.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cjrlqz14kgwo_1747749745.html", "title": "Marco Silva on signings, Mitrovic and preparations", "title_page": "Fulham: Marco Silva on signings, Mitrovic and preparations  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "On wanting more signings, he said: \"Unfortunately, we need many still. We have some important players injured. I hope they can come sooner. We have just two full-backs, we need a midfielder too and we have just two wingers so we need another two wingers. We have completed our central defenders. I needed these players 15 days or 20 days ago, not now. All the players who come now are already coming late unfortunately for us. It is the reality and we tried to do something in a different way this season and unfortunately we weren’t able to do it. The sooner they can come the better.\"\nOn new signing Calvin Bassey: \"We are happy with him. We have four. We believe he is ready, can improve and get stronger. He can play as a left-back too and has the quality to play from the back.\"\nOn new signing Raul Jimenez: \"Yes, he can play some minutes (against Chelsea in friendly). We want to see him get some minutes with his team-mates. He is an important signing for us. We are looking for a player with his profile. We are planning to have three strikers in our squad. \"\nSilva says the situation with Aleksandar Mitrovic is not \"easy\" given the striker is expected to leave Craven Cottage, adding: \"For me, Mitrovic never was hard to manage. Never, never, never. A lot of people say he has an aura around him but people who know him know he was never a problem or difficult to manage. We have to be honest with him. He was so easy to manage in the beginning of the pre-season and he will be if he stays.\"\nMidfielder Joao Palhinha damaged his shoulder in Fulham's last friendly and Silva said: \"It will be difficult for him to be available for the first Premier League match. We have to see week by week how he is going. He is getting better every day. He is not working on the pitch. He is doing some gym and we will see if we can get him on the pitch next week and then we can update you better.\"", "url": "https://www.bbc.com/sport/articles/cjrlqz14kgwo"}