{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:55:28", "date_modify": "2025-04-26 03:55:28", "date_publish": "2025-03-04 16:07:13", "description": "Liverpool news: Arne Slot touchline ban - written reasons from FA", "filename": "sport_football_articles_c04zdekzlx5o_1745639728.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f6f0/live/bfc2d590-f90e-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c04zdekzlx5o_1745639728.html", "title": "Liverpool news: Arne Slot touchline ban", "title_page": "Liverpool news: Arne Slot touchline ban - written reasons from FA - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The Football Association has published its written reasons for the two-match touchline ban and £70,000 fine that Liverpool boss Arne Slot received following his red card at the end of Everton's 2-2 draw with Liverpool on 12 February.\nReds assistant Sipke Hulshoff was banned from the touchline for two games and fined £7,000, while Liverpool and Everton were fined £65,000 and £50,000 respectively for failing to control their players.\nWhat is Slot alleged to have said?\nWhile shaking the hand of referee Michael Oliver, the report alleges that Slot used abusive words towards Oliver.\nSlot is alleged to have said to Oliver that he \"[expletive] gave them everything\" in relation to Everton. It also alleged that Slot said to Oliver that he hoped he was \"proud of that performance\".\nSlot is also stated to have said \"if we don't win the league, I'll [expletive] blame you\" before shouting \"a [expletive] disgrace\" twice at Oliver.\nWhat does Slot claim he said?\nSlot has disputed the FA's reasons for the punishment.\nIn response to his alleged comments towards Oliver, Slot states that he actually said \"if we don't win the league, I will have you to thank for that\".\nWhat did Hulshoff say?\nHulshoff has also been alleged to have entered the field of play at full-time in an \"extremely aggressive manner\".\nHe was also alleged to have made comments to Oliver, including that the referee was \"[expletive] [expletive]\" and \"gave them everything\" in relation to Everton and that was a \"[expletive] disgrace\".\nHulshoff was later alleged to have followed Oliver, continuing to shout \"[expletive] [expletive]\" at Oliver before the referee sent him off.\nWhat has Slot said in the aftermath?\nAt a news conference last month, Slot said: \"Emotions got the better of me. If I could do that differently, if I look back I would love to do that differently and I hope to do that differently next time.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c04zdekzlx5o"}