{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:22:17", "date_modify": "2025-04-26 04:22:17", "date_publish": "2025-03-03 14:16:40", "description": "Aberdeen 1-0 Spartans: What they said", "filename": "sport_articles_cn894p8vgvvo_1745641337.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a1d2/live/0a688bb0-f83a-11ef-a8b4-b37546a32a57.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cn894p8vgvvo_1745641337.html", "title": "Aberdeen 1-0 Spartans: What they said", "title_page": "Aberdeen 1-0 Spartans: What they said - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Aberdeen manager Scott Booth: \"I thought we started the game fairly well and, passed the ball about well, tried to move the opposition.\n\"They're really well organised, they've got bags of energy from mid to front, so they can really put you under a lot of pressure, but then we took our goal really well, [Emily] Kraft's finish was great, it was a nice move and I think after that, we just stopped playing as much as we had been in the early part of the game and then the game descended into a bit of a battle, to be honest.\nThis result was really important for us, it gives us a little bit of space and that was key. The performance today was probably not the priority, the three points were the priority but as we go on in the bottom half of the table, we need to make sure that after the split, we are playing better football, then it will become more about the performance.\"\nSpartans manager Jack Beesley: \"A sore one to take, it was the game we knew it was going to be, both of us had spells we were on top and we were under the cosh, it wasn't anything other than what we expected.\n\"They had the better first half, and they got a lead, we had the better second half, and we didn't do anything about it.\n\"The main disappointment is we came up here, got the game we're expecting, which is a really tight, tough game, but it feels like points dropped as opposed to coming up and getting thoroughly beaten undeservedly.\n\"I thought we deserved to get something for the game, but we've only got ourselves to blame that we didn't.\"\n\"Aberdeen scored their chances, we didn't, so we don't deserve anything.\"", "url": "https://www.bbc.co.uk/sport/articles/cn894p8vgvvo"}