{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:38:28", "date_modify": "2025-05-21 03:38:28", "date_publish": "2025-04-08 00:00:00", "description": "Declan Rice scores two excellent second-half free-kicks as Arsenal stunned Real Madrid in the Champions League quarter-finals at Emirates Stadium to take a three-goal advantage into the second leg.ue.", "filename": "sport_football_live_cx256773e2yt_1747798708.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e828/live/73686a90-14be-11f0-8a1e-3ff815141b98.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cx256773e2yt_1747798708.html", "title": "Arsenal 3-0 Real Madrid: Declan Rice scores two free-kicks as Gunners win Champions League quarter-final first leg", "title_page": "Arsenal 3-0 Real Madrid: Declan Rice scores two free-kicks as Gunners win Champions League quarter-final first leg - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Declan Rice stunned Real Madrid with two brilliant free kicks - the first scored in his career - as Arsenal took a commanding 3-0 first leg lead in their Champions League quarter-final.\nMikel Arteta had asked the Arsenal fans to arrive early to create an impressive atmosphere inside the stadium, and the team responded by starting the game quickly with a number of dangerous crosses into the Madrid penalty area.\nIt took until the 20th minute for Madrid to have their first real chance, when Vinicius Jr curled an effort wide.\nBut Rice took control of the tie for Arsenal in the second half.\nThe Gunners were the better side all evening and took the lead in the 58th minute, when Rice curled the first of two excellent free-kicks round the Real Madrid wall into the corner of the net past Thibaut Courtois.\nRice scored his second of the night with a free-kick of equal quality 12 minutes later, bending another long-range effort into the top right-hand corner to leave Madrid stunned.\nMikel Merino then made sure it was a memorable night for Arsenal when he curled a shot into the bottom corner from inside the area just five minutes later.\nThings only got worse for Madrid when Eduardo Camavinga was sent off in stoppage time for picking up a second yellow card.\nArsenal have not reached the semi-finals stage of the Champions League since the 2008-09 season, but they have given themselves a huge chance of progressing to the last four with this result.\nArsenal came into this match as the less-experienced side in European competition, compared with serial winners Madrid, but showed a ruthlessness and quality which Carlo Ancelotti's side could not match.\nArteta has been dealt a series of blows this season with injuries to key players and the focus before the game was on who would partner William Saliba at centre-back, with Jakub Kiwior ultimately getting the nod.\nBut those issues seemed trivial once the game got under way as Arsenal started the match so impressively. Bukayo Saka caused David Alaba all sorts of problems and one of his crosses should have been turned in during the first half.\nRice's two free-kicks nearly lifted the roof off of the Emirates before Merino added a third to seal the win, taking on the mantle of striker in the absence of Kai Havertz.\nMerino has now scored five goals in his past nine appearances for Arsenal.\nIt could have been even better for Arsenal as Jude Bellingham and Alaba had to clear balls off the Madrid goal line.\nIn a season where injuries have robbed Arteta of many key players, he has managed to lead his team to a place where they can start dreaming about a Champions League semi-final.\nReal Madrid were not in their best form coming into this match, with just two wins in their previous five matches.\nGoalkeeper Courtois had said he was aware of the threat Arsenal possessed from set-pieces, but the 15-time winners of the competition looked uncomfortable throughout.\nThe flair and sharpness in play expected of Ancelotti's team was missing and their best effort from Kylian Mbappe was saved by David Raya.\nMadrid have kept just two clean sheets in their past 11 games in all competitions and will need to keep Arsenal out and score four at the Bernabeu next week to secure what will be an unlikely win.\nHowever, Madrid have produced some moments of magic in this competition and Arsenal will know another solid performance is needed to ensure their progression.", "url": "https://www.bbc.com/sport/football/live/cx256773e2yt"}