{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:13:27", "date_modify": "2025-05-21 04:13:27", "date_publish": "2025-04-06 00:00:00", "description": "Watch BBC TV coverage from the Netball Super League as London Mavericks take on Birmingham Panthers.", "filename": "sport_netball_live_crkejgv72vrt_1747800807.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/18d6/live/c1b1a460-12c4-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_netball_live_crkejgv72vrt_1747800807.html", "title": "Netball Super League LIVE: London Mavericks vs Birmingham Panthers", "title_page": "Netball Super League LIVE: London Mavericks vs Birmingham Panthers - watch stream - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "'I was completely burnt out, I could not function'\nby Evie Ashton\nBBC Sport\nAliyah Zaranyika was used to putting on a persona to fit in. But halfway through last year's Netball Super League season, she reached a breaking point.\nDay-to-day tasks and regulating her emotions became so overwhelming that she found it difficult to articulate how she felt, and a flare-up of painful broken blisters and sores on her leg left her unable to walk.\nThe England Future Roses player was experiencing autistic burnout.\nShe believes this was brought on by masking her autism and ADHD - attention deficit hyperactivity disorder - around people for long periods in the high-pressure environment of her sport.\n\"As much as people are nice - I've made some of my best friends in netball - I struggled with the natural politics and knowing my place in the team,\" the Birmingham Panthers player told BBC Sport.\n\"It was a compounding situation. I get burnt out navigating different situations, relationships and spaces, and trying to fit in while not giving up a part of myself.\"\nShe was aware that she processes new information slower than others, and also worried that it might cost her a place in the team as others might not want to take the time to teach her at her pace \"when you can get somebody else who can learn it quickly\".\nIt reached the point when Zaranyika said she felt \"out of control mentally\" and her team at the time, Saracens Mavericks, gave her a week off netball.\n\"I was completely burnt out. I could not function,\" said the 23-year-old wing-defence, who will face her former team - now known as London Mavericks - on Sunday in a match you can watch on BBC Sport (15:45 BST on Red Button, BBC Sport website and app).\nTo continue reading, click here.\nHow to get into netball\nGet Inspired\n#GetInspired\nHow do I start?\nFind a club in England,, externalWales,, externalScotland, external or Northern Ireland , external to get going.\nWhat is netball?\nNetball is a seven-a-side game where the aim is to score goals by passing the ball down the court and throwing it in your opponents net. Unlike basketball, players are not allowed to move/run/dribble with the ball. It is all about the passing.\nThe 2023 World Cup is taking place next summer in South Africa, with teams from England, Scotland, and Wales competing against the likes of Australia and Jamaica. So there's no better time to get inspired by the top teams and have a go at netball yourself!\nIs it for me?\nNo matter what your fitness level is, there is a position on court for everyone. Netball is a semi-contact sport, so men and women and boys and girls can all play on the same side. There's also a strong sense of friendship and team-bonding within netball teams.\nFind your netball position from how you use your phone\nTake a listen to the Netballers podcast for more insights about all levels of netball.\nWhat to expect when I start?\nNetball is an all over body workout so is great for general fitness and improving muscle tone.\nYou don't need any special kit, just clothes that you feel comfortable exercising in and trainers.\nYou move through the court by running and jumping so it helps with balance and co-ordination.\nWalking Netball, external is growing in popularity and is a low-impact way to play the game with no age limits - younger or older!\nDisability Netball is similar to the traditional game but with a few adaptations such as using a ball with a bell inside for people with visual impairments or installing an induction loop for those who are hearing-impaired. Find your nearest club on Parasport UK, external.", "url": "https://www.bbc.com/sport/netball/live/crkejgv72vrt"}