{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:49:57", "date_modify": "2025-05-21 07:49:57", "date_publish": "2025-05-18 17:02:58", "description": "Worcestershire wrap up victory inside three days against Essex after the visitors are bowled out for 110 at New Road.", "filename": "sport_cricket_articles_c20n4lxnnl0o_1747813797.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/26f9/live/733346b0-3400-11f0-9fcc-0f444dbba5ff.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c20n4lxnnl0o_1747813797.html", "title": "County Championship: Worcestershire earn big win over Essex", "title_page": "County Championship: Worcestershire earn big win over Essex - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Matthew Waite's career best figures propelled Worcestershire to a rampant three-day victory over Essex in the County Championship\nThe home side rallied to 134 all out at New Road, with Ethan Brookes' valuable 38, the standout knock, setting Essex 336 to win the game.\nThe visiting side were blown away as figures of 6-19 from Waite, did the bulk of the damage as the away side fell away to a 225-run defeat.\nWorcestershire's crucial victory keeps them in touch with the sides around them as the scrap in the bottom-half of Division One continues.\nAfter resuming day three on 58-5, the hosts began the morning session looking to add to their overnight lead of 259.\nEssex capitalised on a slow Worcestershire start however, with Simon Harmer and Shane Snater sharing three wickets inside the first hour to reduce the hosts to 80-8.\nThis brought Brookes to the crease, who, with a canny supporting role from Waite, eased their way into proceedings.\nBrookes expressed himself, as those in Worcestershire colours cheered every run added, as together they stretched the lead past 300.\nEvergreen pro Harmer (4-37) returned the best figures for Essex, alongside Porter who collected two for himself, as the home side closed out their innings on 134.\nSet an unlikely 336 to win, Essex's chase fell apart, as they lost five top order wickets for the loss of just 47 runs.\nCharlie Allison and Noah Thain shared the highest score with 23, but on a dismal Essex card, only two other batters could muster double-figures as they were bundled out for a measly 110.\nDean Elgar was the first to go for just nine, as he feathered an edge through to keeper Gareth Roderick off a rising Ben Allison ball.\nJust one run separated the wicket of Elgar and his opening partner Allison, when the impressive Waite accounted for his wicket in the same fashion.\nTom Westley's struggles continued when he was pinned in front by a nip-backer from Yadvinder Singh, and the Worcestershire bowlers tightened their grip further on the contest when Waite extended his fine form to remove Robin Das, who had failed to trouble the scorers for a 10-ball duck.\nWhen Waite bagged his sixth wicket of the match, the away side were left spiralling towards a heavy defeat, with Michael Pepper accounted for at 47-5.\nOnly two-overs into his spell, a loose Matt Critchley drive opened the door for Brookes to sneak through and grab a faint edge on the way through to the gloves of Roderick, with a delivery that jagged back enough to ensure his keeper collected his eighth catch of the match.\nWaite, the stand-out performer across the match, grabbed the headlines as he collected the wickets of Snater, Harmer and Porter on his way to returning career best match figures of 9-53.\nThe crucial victory for Worcestershire closes the gap on the rest of the pack around them at the basement of the Division One table, while Essex will make the journey home knowing a trip to The Oval awaits them on Friday.", "url": "https://www.bbc.com/sport/cricket/articles/c20n4lxnnl0o"}