{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:05:29", "date_modify": "2025-04-26 04:05:29", "date_publish": "2025-03-03 17:25:10", "description": "Ciara Mageean's return to running is currently confined to three days a week as she recovers from the injury which ruled her out of Paris 2024.", "filename": "sport_athletics_articles_cvg5qle555go_1745640329.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/dc1f/live/4faae020-f852-11ef-83da-2fe2e32e5a75.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_athletics_articles_cvg5qle555go_1745640329.html", "title": "Ciara Mageean: Irish athlete still targeting Worlds despite ongoing recovery after surgery", "title_page": "Ciara Mageean: Irish athlete still targeting Worlds despite ongoing recovery after surgery  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Ciara Mageean says she is still targeting this year's World Championships in September even though her return to running is currently confined to three days a week as she recovers from ankle surgery last autumn.\nMageean, who will turn 33 next week, was forced out of last summer's Paris Olympics on the eve of her scheduled 1500m first-round heat.\nThe Portaferry woman underwent an operation in September and says she's \"on the tentative steps back to running\".\n\"I'm running three days a week. It doesn't seem like much especially for an athlete like myself but I'm learning to be patient,\" said the county Down woman after being one of the speakers at the launch of Sport NI's 'Be Seen, Be Heard, Belong' campaign aimed at about supporting women and girls to find their place in sport.\n\"My aim this year is to try to get to the World Championships at the end of the summer.\n\"It's something that's keeping me going through those tough cross-training sessions. We'll see how the rehab goes but for now I'm working my ass off in the gym.\"\nMageean acknowledged that being unable to get in a full winter's training is not ideal in terms of plotting a summer campaign but she is remaining positive.\n\"I'm doing every form of cross-training that I can to keep myself physically fit while slowly getting back running,\" added the Portaferry woman, who memorably clinched the European 1500m title in Rome last June before injury wrecked her Olympic ambitions.\n\"My big goal is the next Olympics in LA so I have plenty of time to get ready for that. I'm probably not in the place I would want to be running wise but this is all part of the journey and success isn't linear.\"\nThe comparatively late scheduling of this year's World Championships in Tokyo which take place from 13-21 September does give Mageean additional time to regain fitness.\nThe County Down woman was giving the fitness update after speaking in typically passionate fashion about the importance of getting more Northern Ireland females involved in sport.\n\"In my opinion, today's conference is vital,\" said the Ireland and Northern Ireland athletics heroine of the Sport NI initiative.\n\"No matter what you look like, where you are from... no matter how you feel, you can find your place in sport.\"\nMageean joined other local sporting role models including Lady Mary Peters and Tanya Oxtoby at the event while those attending included Tyrone gaelic footballer Conor Meyler who spoke of the importance of male support for the wider initiative.\nMeyler is currently undertaking PHD research in the area of sport leadership and gender with a particularly emphasis on the GAA.\n\"We need more women on the sidelines coaching. We need more women in the boards making decisions,\" added Mageean, who played camogie for her native Portaferry before switching to athletics.\n\"It's about encouraging women to have that confidence to step forward because there are so many more-than-qualified women out there who maybe haven't believed in themselves or taken that step because they look at the board and it's all men.\n\"Whenever you look at women in major leadership roles across business, many of those women are participating in sport or have participated in sport. I see sport as an opportunity for me to evolve. It gave me a place to belong.\"", "url": "https://www.bbc.co.uk/sport/athletics/articles/cvg5qle555go"}