{"authors": ["Ffion Wynne", "www.facebook.com"], "date_download": "2025-05-21 07:50:54", "date_modify": "2025-05-21 07:50:54", "date_publish": "2025-05-18 16:41:37", "description": "Wout van Aert of Belgium wins stage nine of the Giro d'Italia as Mexico's Isaac del Toro takes the overall lead.", "filename": "sport_cycling_articles_c9vgepzkyrvo_1747813854.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ef10/live/093dcc00-33fe-11f0-9fcc-0f444dbba5ff.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cycling_articles_c9vgepzkyrvo_1747813854.html", "title": "Giro d'Italia 2025: Wout van Aert wins stage nine after Primoz Roglic and Tom Pidcock crash", "title_page": "Giro d'Italia 2025: Wout van Aert wins stage nine after Primoz Roglic and Tom Pidcock crash - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Belgian Wout van Aert produced a magnificent sprint finish to win stage nine of the Giro d'Italia.\nVan Aert, riding for Visma-Lease a Bike, held off Mexican Isaac del Toro - who narrowly finished second but took the lead in the general classification.\nDel Toro launched his attack along the gravel with just under 50km to go, forming a breakaway which also included Van Aert and Ineos Grenadiers' Egan Bernal.\nBernal slipped back with around 20km left, but Van Aert overtook Del Toro on the steep finish at Piazza del Campo with 400m remaining.\nThe stage winner was visibly emotional, having endured a difficult period out with a knee injury.\n\"This victory means a lot to me. I almost cannot explain it,\" said 30-year-old Van Aert.\n\"To win this stage after a long period without delivering, it feels so good.\n\"I had to fight all the way to the top, to the streets of Siena. I know the final stretch pretty well, I needed to do the move in the last three corners.\"\nBritish rider Simon Yates finished fifth on the stage and sits sixth in the overall standings.\nBut there was disappointment for 2023 Giro champion Primoz Roglic and Great Britain's Tom Pidcock, as they were involved in a minor crash with around 51km to go and suffered punctures.\nOlympic mountain bike champion Pidcock, 25, was a contender to win the stage with its tricky gravel sections along the 181km route from Gubbio and through the Tuscan countryside to Siena.\nBoth finished the stage, with Pidcock 15th and Roglic in 19th place, but the latter - one of the pre-race favourites - lost significant time in the general classification.\nThe Slovenian fell to 10th, some two minutes and 25 seconds behind Del Toro, having begun the day just 17 seconds off the lead.\nThe riders rest on Monday, with the race resuming from Lucca to Pisa on Tuesday.", "url": "https://www.bbc.com/sport/cycling/articles/c9vgepzkyrvo"}