{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 08:02:47", "date_modify": "2025-05-21 08:02:47", "date_publish": "2025-01-03 20:13:13", "description": "Plymouth Argyle sign Ghana midfielder Michael Baidoo for an undisclosed club-record fee from Swedish side Elfsborg.", "filename": "sport_football_articles_cpw290vn7r4o_1747814567.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/66ea/live/3e2f85f0-ca24-11ef-87df-d575b9a434a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cpw290vn7r4o_1747814567.html", "title": "Michael Baidoo: Plymouth Argyle sign Ghana midfielder from Elfsborg for record fee", "title_page": "Michael Baidoo: Plymouth Argyle sign Ghana midfielder from Elfsborg for record fee - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Plymouth Argyle have signed Ghana midfielder Michael Baidoo for a club-record undisclosed fee from Swedish side Elfsborg.\nThe 25-year-old, who was in the crowd to watch Argyle draw 2-2 with Bristol City on New Year's Day, has agreed a three-and-a-half-year contract at Home Park.\nArgyle had tried to bring in Baidoo in the summer, but Elfsborg resisted the move because of their Europa League campaign.\nThe fee is in excess of the £1m fees they paid for Bali Mumba and Morgan Whittaker in the summer of 2023 and comes after the club sold defender Lewis Gibson for a more than £1m earlier on Friday.\nBaidoo scored 10 goals in 27 league appearances in 2024 for Elfsborg as they finished seventh in the Swedish top flight.\nHe has scored five goals in the Europa League this season, including the winning penalty kick when Elfsborg beat Italian giants Roma 1-0 in October.\nBaidoo has three senior international appearances for Ghana.\n\"Michael is someone we have been aware of for a long time, and I am delighted that we have finally been able to bring him to Argyle,” head of recruitment Jim Dickinson told the club website.\n\"He comes to the club with excellent pedigree having been the star of Elfsborg's Europa League campaign this season and recently made his international debut for Ghana.\n\"He can play a variety of positions so will add real versatility to the squad, but most of all chose to come to Argyle ahead of other top clubs throughout Europe.\n\"He is excited to play in England and show what he can do, and we believe he will make a real impact on English football.“", "url": "https://www.bbc.com/sport/football/articles/cpw290vn7r4o"}