{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:31:45", "date_modify": "2025-05-20 12:31:45", "date_publish": "2023-08-04 10:58:17", "description": "Summer signing David McGoldrick's impact at Notts County has been \"impossible\" to ignore, says boss Luke Williams.", "filename": "sport_football_66405644_1747744305.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/17C04/production/_130648279_gettyimages-1564740905.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66405644_1747744305.html", "title": "David McGoldrick: Luke Williams says Notts County stellar signing a ‘joy to work with’", "title_page": "David McGoldrick: Luke Williams says Notts County stellar signing a ‘joy to work with’ - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "David McGoldrick's impact at Notts County has already been \"impossible\" to ignore, says boss Luke Williams.\nThe 35-year-old has been the Magpies' stellar summer signing as they prepare for their first season back in the Football League after four years away.\n\"He's been a pleasure,\" Williams said prior to Saturday's season opener away to Sutton United.\n\"It's been a joy because of his commitment, how hard he works and his focus. He is so present every day.\"\nWilliams continued: \"The rest of the group have to take notice of that; it's impossible not to.\"\nMcGoldrick scored a career-best 25 goals last season for League One side Derby County and had offers to play at the same level or higher during the summer.\nHe was also a Premier League player as recently as 2020-21 with Sheffield United, scoring eight goals.\n\"This is a guy that is still capable of playing in the Championship for sure,\" Williams added.\n\"You look at what he did last season at Derby and for sure for that guy to be applying himself the way he does day in day out it leaves nowhere for the rest of the squad to hide.\"", "url": "https://www.bbc.com/sport/football/66405644"}