{"authors": ["Michael Emons", "www.facebook.com"], "date_download": "2025-05-21 04:50:32", "date_modify": "2025-05-21 04:50:32", "date_publish": "2025-01-14 23:04:58", "description": "Leading 2-0 at the 82-minute mark, Manchester City will be heading north wondering how they left London without the three points.", "filename": "sport_football_articles_c1kmn9pnxyeo_1747803032.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9070/live/b30f2ea0-d2cd-11ef-a95c-5b151e1edf12.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c1kmn9pnxyeo_1747803032.html", "title": "Brentford 2-2 Man City: Foden return to form a welcome boost despite dropped points", "title_page": "Brentford 2-2 Man City: Foden return to form a welcome boost despite dropped points - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Leading 2-0 at the 82nd-minute mark, Manchester City will be heading north wondering how they left London without the three points.\nPhil Foden's double had City on course for their third successive league win and their fourth in all competitions, before Brentford produced a superb fightback.\nYoane Wissa pulled one back, but City should have then restored their two-goal advantage only for Savinho, Erling Haaland and James McAtee to all miss chances before Bees skipper Christian Norgaard headed in an equaliser in the 92nd minute.\nCity have won the title in each of the past four seasons and this was a missed chance to close the gap on leaders Liverpool, who drew 1-1 at Nottingham Forest and remain 12 points ahead of Pep Guardiola's side.\nOne positive for City would have been Foden's two goals. He did superbly to control a side-footed volley from Kevin de Bruyne's excellent cross and then reacted quickest to prod him a second after Savinho's effort had been parried by Mark Flekken.\nThat is now four goals in Foden's past five Premier League matches after he had not scored in the opening four months of City's league campaign.\nFoden won the Players' Player of the Year award last season and his form could be crucial if City are to push on and secure Champions League football for 2025-26.", "url": "https://www.bbc.com/sport/football/articles/c1kmn9pnxyeo"}