{"authors": ["Ian Westbrook", "www.facebook.com"], "date_download": "2025-04-26 04:12:17", "date_modify": "2025-04-26 04:12:17", "date_publish": "2025-03-04 12:28:57", "description": "Brentford news: Opinion - Fan on why Bees will not qualify for Europe", "filename": "sport_football_articles_c5yrk310kpro_1745640737.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3eee/live/caf4a690-f0d7-11ee-b0e1-b9dd5ac46984.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c5yrk310kpro_1745640737.html", "title": "Opinion - Fan on why Bees will not qualify for Europe - BBC Sport", "title_page": "Brentford news: Opinion - Fan on why Bees will not qualify for Europe - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "After back-to-back away wins at West Ham and Leicester last month, there was talk of Brentford mounting a late push to get into Europe, although the home draw with Everton was a bit of a reality check.\nAlthough I have already seen the Bees play in Europe, having twice travelled to Italy to see us in the Anglo-Italian Cup in 1992, I think a repeat next season is not going to happen - and here's why.\nAs I have said in previous pieces, this season Brentford have largely been very good against teams below us and pretty poor against those above us.\nOf our 11 Premier League wins so far, nine have come when we faced teams in the bottom half, with the only exceptions the home defeats of Bournemouth and Newcastle.\nGiven that our next seven games are all against top-half teams, including trips to Bournemouth, Newcastle, Arsenal and Nottingham Forest, the chances of such a dramatic switch in form at this stage of the season seem remote.\nBut that's fine!\nI will take a nice comfortable mid-table Premier League finish any time after years of watching us in the lower divisions. While that might not sound ambitious, it is still only four years into our Premier League life.\nI would have preferred safety in the league to go hand-in-hand with a nice cup run, but in the FA Cup that would have been unlikely this season, given that our conquerors Plymouth were then drawn against Liverpool and Manchester City.\nThe remaining games might be the perfect opportunity to give more time to one or two of our youngsters in preparation for any possible big-name departures in the summer.", "url": "https://www.bbc.co.uk/sport/football/articles/c5yrk310kpro"}