{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:00:32", "date_modify": "2025-05-21 05:00:32", "date_publish": "2025-04-04 11:06:17", "description": "Liverpool news: Phil McNulty on player contracts", "filename": "sport_football_articles_c74nlg1gz43o_1747803632.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4aba/live/46c2dda0-3aa7-11ef-bdc5-41d7421c2adf.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c74nlg1gz43o_1747803632.html", "title": "Liverpool news: Phil McNulty on player contracts", "title_page": "Liverpool news: Phil McNulty on player contracts - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "BBC Sport chief football writer Phil McNulty has been asnwering your questions on all things Premier League.\nWayne asked: Phil, Do you think that Jurgen Klopp announcing his retirement so early had a major factor on the delay in the \"big three\" signing new contracts? I certainly wouldn't be signing a new contract knowing my manager was leaving and not knowing if the new manager had me in their plans.\nPhil said: They – and of course we mean Mohamed Salah, Virgil van Dijk and Trent Alexander-Arnold – may have waited to see who the new manager was, and how his methods work, but that timeframe was very small. It was effectively known before Klopp left, and they clearly all bought into Arne Slot very quickly.\nI have a feeling Alexander-Arnold may have been looking at possibly leaving anyway, but I do not think it would have had any impact on the other two whatsoever once it became clear it was all working well under Slot.\nI am very surprised it has been as drawnout as it has been, but of course we do not know what is going on backstage at Anfield or even what those players might want in their new contracts to stay.\nI think the fact Salah and Van Dijk are coming up 33 and 34 respectively may have been factors with owners FSG, but do not believe Klopp's decision has played any part.", "url": "https://www.bbc.com/sport/football/articles/c74nlg1gz43o"}