{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-05-21 07:48:51", "date_modify": "2025-05-21 07:48:51", "date_publish": "2025-05-18 18:06:50", "description": "The absence of Manchester United minority owner Sir Jim Ratcliffe from the Women's FA Cup final defeat by Chelsea obscures the biggest issues at the club.", "filename": "sport_football_articles_cgkdgx47vzjo_1747813731.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7028/live/337d91b0-340a-11f0-8519-3b5a01ebe413.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cgkdgx47vzjo_1747813731.html", "title": "Ratcliffe absence obscures the big issues at Man Utd", "title_page": "Women's FA Cup final: Sir Jim Ratcliffe absence obscures the big issues at Man Utd - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It was after question number three that Manchester United's media officer stepped into Marc Skinner's post-match press conference in the bowels of Wembley Stadium after his side's 3-0 Women's FA Cup final defeat by Chelsea.\n\"I don't think we need any more Jim questions. We are focusing on the match,\" they said.\nThe issue was the absence of United's minority owner Sir Jim Ratcliffe, who had been at Stamford Bridge to watch his men's side lose to Chelsea in the Premier League on Friday.\nCo-chairman Avie Glazer was at Wembley, sat alongside chief executive Omar Berrada, technical director Jason Wilcox and former chief executive David Gill.\nYet Ratcliffe's absence felt important. He pulls the strings of those running the football operation. In terms of the women's team, it was more noticeable Ratcliffe was not there given 15 minutes after Millie Bright had lifted the trophy, Serena Williams was striding through the mixed zone towards the victors' dressing room.\nWilliams did not look overly engaged when the TV cameras picked her out during the game. But her husband, Alexis Ohanian, was - given he has just made a £20m investment in the Chelsea women's team, a sum that secures him a stake in the club of between 8-10%.\nQuite naturally, Skinner was being asked why Ratcliffe was not there. As he kept saying, he did not know.\nIn a sense, it is none of his business. It is quite likely Ruben Amorim would not be able to offer any clarity on the reasons for Ratcliffe not being at Old Trafford on any given matchday for the men's team.\n\"In all honesty, I don't know why he wasn't here but we were well represented, with Omar [Berrada], the Glazer family and Jason was there as well,\" said Skinner.\n\"They are the people I deal with every day. They need to look at what we have to do.\"\nThere is irritation among significant figures at Old Trafford why the focus remains around Ratcliffe and United, when the same does not apply to other big Premier League clubs and their owners when it comes to their presence at women's games.\nSkinner even managed a slight dig at the visible nature of the Chelsea hierarchy at Wembley.\n\"Let's see how many times they fly over in the season for Chelsea,\" he said, before trying to steer the conversation back towards his own club, who he is contracted with until 2027.\n\"The reality is that it is the investment in the team that needs to happen, not whether you are visible. Investment is a way of showing support, and we need to close that gap.\"\nYet the situation is far from straightforward.\nWhile doubts persist over Ratcliffe's engagement, questions will remain over investment.\nIn actuality, the path is already set as far as the women's side is concerned - and it is not focused on matching the growing resources Chelsea ploughed into making Sonia Bompastor's debut campaign at the club a domestic treble-winning one.\nUnited remain bruised at the criticism they received at the start of the season in the wake of the high-profile departures of England goalkeeper Mary Earps and forward Nikita Parris, and so-called substandard training facilities.\nThe club are spending hundreds of millions on a massive training ground upgrade - for both the men's and women's sides - they hope will be completed by August.\nThat, they argue, will help get the most from the players they do have.\nTheir aim is to recruit well - any mention of the word recruitment and Manchester United gets a raised eyebrow because of the issues on the men's side.\nYet it is true whoever made the decision to let Earps go got it spot on, given her one-time deputy Phallon Tullis-Joyce has been excellent all season and was outstanding at Wembley, producing two brilliant first-half saves as United battled to keep their opponents at bay.\n\"I have to find diamonds that can make us better,\" said Skinner.\nYet is it realistic to fight with Chelsea?\nThere was a lot of talk about the Champions League but United's path to the lucrative main draw is fraught with hazards for Skinner's side. Firstly, they must come through a semi-final and final just to make it through the second qualifying round. Inter Milan and Roma are big-name potential opponents - but Swedish side BK Hacken are also in the draw and reached the quarter-finals in 2023-24.\nIf United make it through that, they would need to get past a heavyweight final-qualifying-round opponent that could include Paris FC, Real Madrid or Sporting Lisbon.\nUnited officials feel their club is growing. It is, after all, only seven years old.\nThey were playing in their third FA Cup final in a row. There were huge numbers of genuine United fans in the 74,412 crowd.\nAttendances, those officials argue, at Leigh Sports Village are comparable to any top-flight club playing away from their main stadium. They hover about 4,500 on average.\nBut they need more. At a club where the men's team will embark on a two-game post-season trip to Asia to generate more revenue, it is no surprise United's women will play in the controversial World Sevens tournament in Portugal this month.\nAll avenues will be explored to maximise available finance.\nSkinner is right. Ratcliffe's presence in itself will not push United's women's team forward, it is investment he needs.\nBut 'the optics' are not great.\nAnd, as Bompastor explained some time after Skinner had spoken, it is not a negative having the ownership watching on.\n\"It's a big lift,\" she said. \"When we talk about having the right support from everyone in the club, it shows everyone is involved in the women's team.\n\"It shows as a woman that you are in the right club. You really want to give that back on the pitch for all these people.\"\nUnited battled hard at Wembley. If they had taken chances at the start of each half there might have been a different outcome, even if they could hardly claim to deserve victory.\nBut, as with so many big issues around the club at the moment, it all comes back to Ratcliffe in the end.", "url": "https://www.bbc.com/sport/football/articles/cgkdgx47vzjo"}