{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:15:05", "date_modify": "2025-05-21 06:15:05", "date_publish": "2025-04-01 10:46:10", "description": "Arsenal news: Mikel Arteta expects 'big summer' of transfers", "filename": "sport_football_articles_c1dr50znwp0o_1747808105.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4994/live/8d216960-0ed7-11f0-a3a0-a5d2188117fa.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c1dr50znwp0o_1747808105.html", "title": "Arsenal news: Mikel Arteta expects 'big summer' of transfers", "title_page": "Arsenal news: Mikel Arteta expects 'big summer' of transfers - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Arsenal boss Mikel Arteta anticipates a \"big\" summer of spending to take \"the next step\" in their hunt for silverware.\nThe Gunners' transfer business has been a topic of conversation for the past few campaigns, with particular emphasis on the absence of a number nine.\nAs things stand, the Gunners will finish as runners-up for the third consecutive Premier League season, though they are in the quarter-finals of the Champions League.\nFollowing the departure of sporting director Edu, Arteta will be working with his successor Andrea Berta to strengthen his squad in areas that have particularly suffered in the past few months as they try to \"evolve the team\".\n\"It's going to be a big one [summer] and we are very excited about it,\" said Arteta. \"When you are going to go again, we want to increase the depth of the squad and the quality and the skills that we need to go to the next step.\n\"Every summer is big because it is an opportunity - and especially because of the number of players we have in the squad right now, that is necessary.\n\"But it's a big summer for many things because first of all we have to maintain the good foundations that we have and then obviously how can we improve and evolve the team.\"", "url": "https://www.bbc.com/sport/football/articles/c1dr50znwp0o"}