{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:52:38", "date_modify": "2025-05-20 11:52:38", "date_publish": "2023-08-05 21:36:24", "description": "Nick Griggs and Kate O'Connor have been drafted into Ireland's team for the World Athletics Championships in Budapest.", "filename": "sport_athletics_66418654_1747741958.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/EE56/production/_123241016_mediaitem123241015.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_athletics_66418654_1747741958.html", "title": "World Athletics Championships: Nick Griggs and Kate O'Connor added to Ireland team", "title_page": "World Athletics Championships: Nick Griggs and Kate O'Connor added to Ireland team - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Nick Griggs and Kate O'Connor have been drafted into Ireland's team for the World Athletics Championships in Budapest later this month.\nTyrone teenager Griggs will compete in the men's 1500m while Dundalk's O'Connor goes in the women's heptathlon.\nIt will be a first senior World Championships appearance for the pair.\nTheir call-ups come after 400m hurdler Thomas Barr was forced to withdraw from the event because of injury.\nGriggs, who will join Andrew Coscoran and Luke McCann in the men's 1500m, has been in excellent form this year with Irish U20 records over 1500m, Mile, 3000m and 5000m.\nThe 18-year-old will be in action at next week's European U20 Championships in Jerusalem over 3000m as he bids to retain the title he won in 2021.\nIrish record holder and Commonwealth Games silver medallist O'Connor has also shone this season and chalked up a best of 6125 points in Germany in June.\nChristopher O'Donnell will now also compete in the men's 400m along with the 4x400m mixed relay after his qualification was confirmed on Sunday.\nThe 25-year-old Sligo man won his fifth national 400m title in six years at the Irish Championship last weekend and has a season's best of 45.73.", "url": "https://www.bbc.com/sport/athletics/66418654"}