{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-05-20 12:26:59", "date_modify": "2025-05-20 12:26:59", "date_publish": "2023-07-24 10:53:13", "description": "Saudi Arabian side Al-Hilal are given permission to speak to Kylian Mbappe after making a world record £259m bid for the Paris St-Germain forward.", "filename": "sport_football_66291108_1747744019.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/13178/production/_130500287_mbappeinde.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66291108_1747744019.html", "title": "Kylian Mbappe: Al-Hilal make £259m offer for PSG and France forward", "title_page": "Kylian Mbappe: Al-Hilal make £259m offer for PSG and France forward - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Saudi Arabian side Al-Hilal have permission to speak to Kylian Mbappe after making a world record £259m bid for the Paris St-Germain forward.\nThe 24-year-old France captain, who has a year left on his contract, has refused to sign an extension at the French champions and was not selected for their pre-season tour to Japan.\nPSG want to sell Mbappe now rather than see him leave for free next summer.\nNeymar's £200m move from Barcelona to PSG in 2017 is the current record.\nPSG activated Brazil forward Neymar's release clause to make him the most expensive player in the world.\nShould he move, Mbappe will have commanded two of the three highest fees paid for a player after joining PSG from Monaco for £166m in 2017.\nChelsea, Manchester United, Tottenham, Inter Milan and Barcelona have all expressed an interest in Mbappe, who has previously said he intends to leave PSG for free at the end of next season and is believed to prefer a move to Real Madrid.\nPSG are open to the idea of Mbappe leaving on loan this summer to see out the final year of his contract elsewhere.\nThis would allow him to join Real Madrid for nothing in 12 months' time, keep playing this season and generate a loan fee for PSG.\nChairman Nasser Al-Khelaifi has made clear his determination to take a tough stance and there have been suggestions Mbappe would not be selected for an entire year if he refused to break the present impasse. That eventuality would clearly have a negative impact on his hopes of playing for France at Euro 2024.\nAl-Hilal are one of the clubs owned by Saudi Arabia's Public Investment Fund. They have already signed Ruben Neves from Wolves and Kalidou Koulibaly from Chelsea this summer.\nMbappe has not commented on the bid but responded to a tweet from NBA star Giannis Antetokounmpo, who joked: \"Al Hilal you can take me. I look like Kylian Mbappe\"\nThe Frenchman replied with a series of crying with laughter emojis.", "url": "https://www.bbc.com/sport/football/66291108"}