{"authors": ["Chris Wathan", "www.facebook.com"], "date_download": "2025-05-21 05:59:50", "date_modify": "2025-05-21 05:59:50", "date_publish": "2025-01-31 13:55:19", "description": "Newport County boss Nelson Jardim says he has not sought assurances over his future and has launched an impassioned defence of the club's strategy to focus on young talent.", "filename": "sport_football_articles_c8j8w3ek4j4o_1747807190.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0bfd/live/6a778b40-dfc7-11ef-b19c-01e477466c43.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c8j8w3ek4j4o_1747807190.html", "title": "Nelson Jardim: Manager remains calm and defends Newport County over strategy", "title_page": "Nelson Jardim: Manager remains calm and defends Newport County over strategy  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Newport County boss Nelson Jardim says he has not sought assurances over his future – and has launched an impassioned defence of the club's strategy.\nCounty are 21st in League Two, six points off the relegation places, after picking up just one point from their last six games.\nIt has prompted fears of a relegation battle for an inexperienced squad, with chairman and owner Huw Jenkins overseeing a recruitment policy based on young talent.\nPortuguese head coach Jardim says he accepts their upcoming home game with Barrow on Saturday – quickly followed by the visit of bottom club Morecambe on Tuesday – are key games for the side to end concerns over their standing, adding he is \"desperate\" to turn around their form.\nBut asked if he had spoken to Jenkins for reassurance on his own position, the 46-year-old former Swansea City coach said: \"He doesn't need to because I am not worried about that, and never have been.\n\"I just control what I can and that's my work with the boys every day.\"\nAnd Jardim who was appointed by Jenkins in the summer, added: \"I work very hard with the chairman in terms of recruitment; a lot of work has been done on and off the pitch.\n\"The chairman has been clear on the financial side of the club and how important it is.\n\"You cannot address that if you are not balanced in the way that you run the team.\"\nAsked about whether he will be able to strengthen the squad in the remaining days of the transfer window, Jardim said: \"We have to be sensible to know what we are doing, to make sure we bring the right people, because you can see the club is not rushing anything - it's preparing the future.\n\"When you sign a player like Tom Davies at 21 you are preparing the future, when you have Kai Whitmore at 23 becoming a very important player coming from [Cymru Premier side] Haverfordwest, you are preparing the future. Cameron Evans and Matt Baker playing like they are playing at their age, you are preparing the future.\n\"We have experience…like with James Clarke now back in the team and leading, so how can you not be positive when you also have this youth developing and growing.\n\"You know they are young and they are going to commit some mistakes, they need time, but we work hard every day. We can only be positive and I am not going to change on that.\"Despite impressing in parts during recent games – and ending a five match losing streak with a midweek draw at Salford – Jardim has started to face criticism from supporters.\nAnd saying he does not feel under extra pressure going into the next games, he added: \"We are all desperate to succeed: the fans, the club, the players and myself.\n\"Some things have not gone our way on the pitch but we will focus on controlling what we can and improve ourselves.\"", "url": "https://www.bbc.com/sport/football/articles/c8j8w3ek4j4o"}