{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:37:11", "date_modify": "2025-05-21 07:37:11", "date_publish": "2025-05-20 15:06:33", "description": "IPL 2025: Ahmedabad to host final as RCB match moved amid Bengaluru rain", "filename": "sport_cricket_articles_cp3qq4ddxk7o_1747813031.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/269b/live/de405650-358b-11f0-9b2c-138cad92aeb3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cp3qq4ddxk7o_1747813031.html", "title": "IPL 2025: Ahmedabad to host final as RCB match moved amid Bengaluru rain", "title_page": "IPL 2025: Ahmedabad to host final as RCB match moved amid Bengaluru rain - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The Narendra Modi Stadium in Ahmedabad, the world's largest cricket stadium, will host the final of this year's Indian Premier League.\nIt will also host the second qualifier during the play-offs with New Chandigarh hosting the first qualifier and the eliminator.\nThe play-off phase was originally due to be split between Hyderabad and Kolkata prior to the IPL's suspension amid the rising tensions between India and Pakistan.\n\"The new venues for the play-offs were decided by the IPL governing council keeping in mind the weather conditions and other parameters,\" organisers said.\nNew Chandigarh, in the state of Punjab, which borders Pakistan, has not held any of the league phase matches since the IPL resumed.\nIn another change, Royal Challengers Bengaluru's match against Sunrisers Hyderabad on Friday has been moved to Lucknow because of heavy rain and floods in Bengaluru.\nRCB had their match against Kolkata Knight Riders washed out on Saturday and more rain is forecast for the remainder of the week.\nThey have already qualified for the play-offs while Sunrisers are out. Two wins would guarantee a top-two finish, thus giving them two chances to reach the final on 3 June.", "url": "https://www.bbc.com/sport/cricket/articles/cp3qq4ddxk7o"}