{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:21:26", "date_modify": "2025-04-26 04:21:26", "date_publish": "2025-03-03 14:46:00", "description": "Hibernian 1-0 Celtic: What they said", "filename": "sport_articles_cp9y2lx9927o_1745641286.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d97e/live/1111e160-f83e-11ef-9241-f1bc6b2390b0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cp9y2lx9927o_1745641286.html", "title": "Hibernian 1-0 Celtic: What they said", "title_page": "Hibernian 1-0 Celtic: What they said - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Hibs manager Grant Scott: \"A fortuitous victory, we put a lot of hard work into it, rode our luck a little bit in the second half in particular, but the first half we took the game to Celtic really well and I wouldn't say dominated the half, but we did a lot of good things in there.\n\"Those are the grinding out result ones that are important and keep you in the challenge.\n\"I thought Celtic looked lively and dangerous, put some balls in the box that were tricky for us to deal with, but I can't think of too many clear-cut shots from them. I think we could do better in the first half with the couple of chances we did have, so fine margin game that one. We're delighted to take the victory at the end.\"\nCeltic manager Elena Sadiku: \"We had a really poor first half in terms of being the team that we can be, being intense on the pressure and being brave enough on the ball.\n\"Hibs had two or three chances in the game, they scored one, which is how it's been lately for us. We create chances and we don't score, there's a big frustration in the camp and I'm very disappointed.\n\"It's important we find consistency in training and find a hunger of making sure we win games because we've been in this situation before.\n\"Last time, I came here we were seven points behind and we still managed to win the league, now we're in that situation again that we're three points behind and we just need to be at it.\n\"We need to be hungry, we need to chase and the mindset now is we've done it before, we can do it again and we need to strongly believe in it and be confident.\"", "url": "https://www.bbc.co.uk/sport/articles/cp9y2lx9927o"}