{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:49:14", "date_modify": "2025-05-21 06:49:14", "date_publish": "2025-01-22 14:28:47", "description": "Big Bash League: Thunder beat Stars to reach challenger match", "filename": "sport_cricket_articles_c5y78prm12lo_1747810154.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/274d/live/decdec20-d8cc-11ef-bf89-cf1be2bb19ea.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c5y78prm12lo_1747810154.html", "title": "Big Bash League: Thunder beat Stars to reach challenger match", "title_page": "Big Bash League: Thunder beat Stars to reach challenger match - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Sydney Thunder beat Melbourne Stars by 21 runs on the Duckworth-Lewis-Stern method in Sydney to progress to the Big Bash League's challenger match.\nAfter setting the Stars 136 to win, the Thunder superbly defended the low target, with seamer Nathan McAndrew taking 5-16.\nThe 31-year-old removed openers Sam Harper and Tom Rogers to leave the visitors 15-2, before the Thunder's spinners took over, with Tanveer Sangha and Tom Andrews taking two wickets apiece and Chris Green removing Marcus Stoinis.\nGlenn Maxwell had scored three consecutive half-centuries prior to this match, but Sangha dismissed the Stars' key man for 28 with a caught and bowled, then had Tom Curran caught by Andrews from the following delivery.\nWhen Andrews trapped Usama Mir lbw the Stars were 73-7 in the 13th over, and McAndrew returned to take the final three wickets as the Thunder bowled their opponents out for 114.\nThey will now face rivals the Sydney Sixers in Friday's challenger match, with the winners to play the Hobart Hurricanes in Monday's final.\nVeteran David Warner led the Thunder to a third-place finish in the group stage, one place ahead of their opponents, finishing as the phase's second-highest run-scorer.\nHowever, he was dismissed for a two-ball duck opening the Thunder innings, caught by Stoinis off the bowling of Curran.\nWith each innings shortened by an over because of lightning, Ollie Davies top-scored for the home side with 36, while English wicketkeeper Sam Billings struck 24, as the Thunder reached 135-7\nThe Stars, who made the knock-out stage off the back of five consecutive victories, would have been confident of chasing down their target, but McAndrew and the spinners ensured it was the Sydney side who progress.", "url": "https://www.bbc.com/sport/cricket/articles/c5y78prm12lo"}