{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:20:03", "date_modify": "2025-05-21 07:20:03", "date_publish": "2025-03-30 00:00:00", "description": "Manchester United move closer to qualifying for next season's Champions League with a routine win against Everton.", "filename": "sport_football_live_crrdy47wg5yt_1747812003.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/dd15/live/f05f7830-0d62-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_crrdy47wg5yt_1747812003.html", "title": "Man Utd beat Everton to close in on Champions League", "title_page": "Man Utd beat Everton to close in on Champions League - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester United moved closer to qualifying for next season's Champions League with a routine win against Everton.\nDominique Janssen took advantage of a major mistake from Everton goalkeeper Courtney Brosnan to put United ahead midway through the first half, before Grace Clinton produced a brilliant finish shortly after the break.\nEverton came into the game having never beaten United in the Women's Super League, but it was Brian Sorensen's side that started on the front foot.\nKatja Snoeijs thought she had given the visitors the lead inside two minutes, but referee Phoebe Cross spotted a handball during a scramble in the box.\nA lengthy injury stoppage for United's Jayde Riviere slowed the rhythm of the game, though Toffees striker Kelly Gago did force Phallon Tullis-Joyce into a smart stop from a tight angle.\nEverton's strong start was undone in the 22nd minute when Brosnan spilled what looked to be a routine catch from a free-kick, with Janssen on hand to convert into the empty goal.\nUnited grew in stature thereafter and twice went close in first-half injury-time, Celin Bizet forcing Brosnan into a superb low save before Maya le Tissier crashed a long-range strike off the crossbar.\nClinton doubled United's lead less than 90 seconds into the second half when she met Leah Galton's low cross with a clever flick into the bottom corner, the second time this season she has scored against her former club.\nUnited largely coasted through the remainder of the afternoon with Melvine Malard denied a third by a terrific Brosnan save, though injuries suffered by Bizet and Galton could be cause for concern.\nUnited briefly moved up to second in the table before Arsenal defeated Crystal Palace, but still only need two wins from their final four games to secure a top-three finish and a return to the Champions League next season.\nThrough no fault of their own, United's achievements this season have gone slightly under the radar.\nWith four games left to play Marc Skinner's side are already 14 points better off than the whole of last season, and it would now take a stunning collapse to prevent them qualifying for next season's Champions League.\n\"We're two wins away from that, so it's in our hands. We've got to make sure we focus on the next performance,\" Skinner told BBC Radio 5 Live.\nWith an FA Cup semi-final against an injury-hit Manchester City coming up next month, United have a great opportunity to defend the title they won last season.\nAnd there's still a glimmer of hope when it comes to the WSL title, with United and Arsenal's wins on Sunday, combined with Chelsea's draw, cutting the gap at the top to five points.\n\"We don't talk about it because it's in their [Chelsea's] hands,\" Skinner said.\nThe United boss explained that he didn't need to discuss the title race with his players, adding: \"They're clever enough to know. They know if we don't win games then we get nowhere near.\"\nAnd Galton proved his point. \"It's never done, anyone can beat anyone in this league, but I think we've got to keep focusing on us and winning our games. That's all we can control,\" she said.\nEven if United finish the year without silverware, the improvement of Skinner's side has been clear for all to see.\nThe United boss singled out Ella Toone and Elisabeth Terland for praise pre-match, but it was Galton, Clinton, Janssen and Bizet who impressed most on Sunday afternoon.\nThat kind of strength in depth is something Skinner hasn't always had at his disposal, while a surprise 3-1 defeat by Liverpool earlier this month does not have appeared to have knocked his side off their stride.\nEverton manager Sorensen said before kick-off that his side are now in a better position to challenge teams above them in the table, and you could see his point.\nThe Toffees were full of energy in the opening stages and forced Tullis-Joyce into action early on, but as the game wore on their attacking forays became less frequent and more disjointed after Brosnan's costly error.\n\"She [Brosnan] has been excellent for us all season, these things can happen,\" Sorensen said.\n\"These things, unfortunately, happen sometimes. We can't be 100% perfect in everything, but I think she bounced back really well.\"\nGago was looking to continue her excellent start to life at the club, but three wayward backheels in the space of five minutes summed up her side's frustrations.\nWhile Everton have improved massively since the winter break, the fact that they have failed to win any of their last 26 WSL matches when conceding first will remain a point of concern for Sorensen.", "url": "https://www.bbc.com/sport/football/live/crrdy47wg5yt"}