{"authors": ["Jess Anderson", "www.facebook.com"], "date_download": "2025-05-20 12:40:09", "date_modify": "2025-05-20 12:40:09", "date_publish": "2023-08-03 08:53:13", "description": "England hold their nerve to beat Australia for the first time at a Netball World Cup and finish top of Group F in South Africa.", "filename": "sport_netball_66393291_1747744809.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/16D66/production/_130624539_gettyimages-1573990440.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_netball_66393291_1747744809.html", "title": "Netball World Cup 2023: England 56-55 Australia - Roses beat Diamonds in thriller", "title_page": "Netball World Cup 2023: England 56-55 Australia - Roses beat Diamonds in thriller - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England held their nerve to earn a stunning win over Australia for the first time at a Netball World Cup and finish top of Group F in South Africa.\nEngland overturned an eight-goal third-quarter deficit to win 56-55 in front of a thrilled crowd.\nIt is only the second time the Roses have beaten Australia since their Commonwealth Games triumph in 2018.\nEngland will face New Zealand in the semi-finals while Australia will play Jamaica.\nEngland will contest their semi-final at 10:00 BST on Saturday, with the second at 15:00. Both matches will be live on BBC iPlayer and the BBC Sport website and app.\nDefending champions New Zealand suffered their biggest ever loss at a World Cup with a 59-48 defeat by Jamaica but South Africa's 52-50 win over Uganda was not enough to overtake the Silver Ferns.\nEngland were already assured of their last four place going into the match on Thursday, but the result means they maintain their unbeaten record with six wins from six.\nThey have never won a Netball World Cup, having taken the bronze medal at the past three editions.\nHowever, they will gain huge confidence from the way they fought back against world number ones Australia and kept their composure in the final seconds to seal an important win.\n\"The fact we were eight goals down, to be pushed in the last 15 minutes and still come out on top - you can't underestimate what that tells me about where the group are at mentally,\" head coach Jess Thirlby said.\n\"We know that we've got two games to come and it means nothing if we can't follow it up. But for today, it is important to allow the players to celebrate.\"\nAfter England cruised through the rest of their preliminary matches, their clash against 11-time world champions Australia marked their first real test of the tournament.\nThirlby has tinkered with her starting line-up in Cape Town, figuring out the best combination for starting the match and who will have the biggest impact from the bench.\nEngland fired out of the blocks to lead by two after the opening quarter, with favoured shooting partnership Helen Housby and Eleanor Cardwell in scintillating form, missing just one goal between them all match.\nBut, seeking to reclaim the world title they lost to New Zealand four years ago, Australia adapted quickly, with defender Sarah Klau the key.\nChanges were needed in the second half for England to overturn the deficit and they arrived in the form of inexperienced defensive duo Funmi Fadoju and Fran Williams as well as wing-attack Chelsea Pitman.\nThe substitutions had the desired effect as former Diamond Pitman injected some creativity into the attack while Fadoju and Williams added crucial interceptions along with Imogen Allison, who has had a stellar tournament so far.\nWith the score poised at 45-44 in favour of Australia going into the final 15 minutes, the Roses struggled to break down the Diamonds' defence.\nBut a crucial tip from Williams in the final seconds meant England could maintain possession and play down the clock to take an historic win.\n\"Every win is a confidence boost for us,\" said mid-courter Allison.\n\"It is something that keeps us going day after day - getting one over Australia is a good one.\n\"We've had some games where we've been able to throw out different combinations and that is why we were able to go and do it out there. All the girls that came on had a huge impact.\"\nEngland will be keen to not get carried away - Australia lost their final pool match against Jamaica at last year's Commonwealth Games and went on to win the title - but a win against the Diamonds before the semi-final is a huge marker to lay down.\nWith two matches in two days against two top teams, it was perhaps no surprise that New Zealand started slowly against the Sunshine Girls, who raced into a four-point lead after the first quarter.\nThe Silver Ferns managed to engineer a way to grow back into the game and, led by captain Ameliaranne Ekenasio and Maia Wilson in attack, they cut the deficit to three points at the interval.\nNew Zealand kept within touching distance but Jamaica maintained their narrow lead with slick play around the circle and clinical finishing from Jhaniele Fowler, who scored 49 from 49.\nIn the final quarter, they pulled away from New Zealand to secure victory, with Silver Ferns captain Ekenasio telling BBC TV her side had some \"soul searching\" to do.\nDespite the loss, New Zealand had still done enough to reach the last four with South Africa needing a 60-goal margin victory against Uganda to keep their hopes alive.\nDespite a dominant first half, the Proteas ultimately scraped over the line by two goals.", "url": "https://www.bbc.com/sport/netball/66393291"}