{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 15:04:23", "date_modify": "2025-05-20 15:04:23", "date_publish": "2023-07-27 09:43:14", "description": "A year away from the Paris Games, Tokyo BMX gold medallist Beth Shriever says she is hoping for a 'whole new Olympic experience' next year.", "filename": "sport_cycling_66323930_1747753463.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/733F/production/_130530592_gettyimages-1337092495.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cycling_66323930_1747753463.html", "title": "Beth Shriever: Crowds will enhance Olympic experience in Paris", "title_page": "Beth Shriever: Crowds will enhance Olympic experience in Paris - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tokyo gold medallist Beth Shriever is hoping for a \"whole new Olympic experience\" when she defends her BMX title in Paris next year.\nShriever beat Colombia's Mariana Pajon by 0.090 seconds in the women's final in 2021, but crowd sizes were strictly limited in Japan because of Covid.\nShe also won gold at a BMX World Cup event in the Netherlands last month.\n\"Having a crowd there is going to change the whole atmosphere and experience for me,\" she told BBC Essex.\nThe Games starts on 26 July next year and Shriever - who was awarded an MBE in 2022 - still has to earn her place in the GB team.\n\"We are racing all round the world this year and next year to get points to qualify, but we're in a lot better place than we were leading into Tokyo.\n\"Confidence is high, motivation is high.\n\"Paris is going to be completely different to Tokyo, there's going to be crowds there, we can actually mingle with other athletes, so I'm looking forward to a whole new Olympic experience really.\n\"I'm going to go with an open mind and just enjoy every second, like I did in Tokyo.\"", "url": "https://www.bbc.com/sport/cycling/66323930"}