{"authors": ["Andy Zaltzman", "www.facebook.com"], "date_download": "2025-05-20 13:09:03", "date_modify": "2025-05-20 13:09:03", "date_publish": "2023-08-02 13:44:21", "description": "Test Match Special statistician Andy Zaltzman reveals how a £1 accumulator could have earned you £18 quadrillion. Maybe.", "filename": "sport_cricket_66384548_1747746543.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/E007/production/_130615375_gettyimages-1583168082.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66384548_1747746543.html", "title": "The Ashes 2023: The unexpected and quirky stats from a brilliant series", "title_page": "The Ashes 2023: The unexpected and quirky stats from a brilliant series - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "If we knew on 16 June, as Pat Cummins prepared to bowl the first ball of the summer's Ashes feast to Zak Crawley, what we know now, we could have solved all the problems in the world with one simple £1 accumulator bet, a humble punt that could have paved the way for a new era of global peace, prosperity, harmony and well-scheduled, equitably financed Test cricket around the world.\nIt might even have gone down in history as a £1 investment in the future of humanity, the first and only instance of 'gambling responsibly'.\nThe betting slip in question would merely need to have predicted that the following things would happen in order to earn, if you will allow me to pick a number out of thin air, an estimated £18.1 quadrillion (assuming that the bookmaker in question was prepared and able to pay):\nWoakes to win the Compton-Miller medal for player of the series\nThe Brummie Bradman/Barnes/Botham had not played a Test since the pre-Bazballic era and had taken only 27 wickets - average 46 - in his previous 12 Ashes Tests. In his last season of Test cricket, in Australia and the West Indies in 2021-22, he had taken 11 wickets in six Tests at an average of over 50.\nWoakes to take more wickets (19) in the series than Ollie Robinson (10), James Anderson (5) and Scott Boland (2) combined\nRobinson had taken 66 wickets at 21 in a superb start to his Test career, Anderson had 45 at 17 in his previous 10 Tests, a sumptuous cherry on top of the 640-wicket cake he had already baked, and Boland, with 33 wickets at the positively 19th-Century average of 14, seemed the perfect bowler for English conditions.\nWoakes to finish the series with a bowling average less than half that of Pat Cummins\nThe Warwickshire Wizard took 19 wickets at 18.1 apiece. Australia's captain finished with 18 at 37.7.\nWoakes to take second place in the all-time list of best series average by an England seam bowler with at least 18 wickets in a home Ashes in an English summer in which ball-tracking data shows that seamers collectively extracted less lateral movement than in any other season since at least 2005, when such technological witchcraft first became available.\n(At this point, the bookmaker may have started to become suspicious about the precision of your bet.)\nThe only England seamer with 18-plus wickets in a home Ashes series at a better average than Woakes is post-war medium-paced magician Alec Bedser (39 at 17.4 in 1953).\nWoakes became the first England bowler to take more than 12 wickets in an Ashes series at an average below 20 since 1985, when Richard Ellison, the Kent swingster, hooped his way to a total of 17 for 185 in his two matches at the end of the series.\nZak Crawley and David Warner to be the two players with most innings of 20-plus.\nBoth reached 20 seven times. Many had claimed, with strong statistical evidence, that Crawley would \"never be consistent, but would play the occasional match-changing innings\".\nThis summer he was strikingly consistent, as well as playing the occasional match-changing innings. Prior to this summer Crawley had failed to reach 20 in 62% of his innings in England's top three, then the highest such figure of the 157 men who had batted 50 or more times as an opener or number three.\nWarner had made it past single figures in two of his 10 innings in England in 2019, and in one of those he was out for 11. Before this summer, since the start of 2021 more than half of his Test innings had resulted in him failing to reach 20.\nAustralia to obliterate the all-time record for fewest maidens in a Test series of five or more matches\nEven with England's unprecedented fast-scoring approach over the previous year, few would have predicted that Australia would managed only 34 maidens in the entire series without the assistance of a world-ending asteroid strike.\nAs well as the ageless craft-filled tweakery of Nathan Lyon, Australia, in Cummins and Josh Hazlewood, possessed two of the modern game's more parsimonious pace probers, each of whom had bowled, on average, one maiden every four overs during their careers.\nThe previous record for fewest maidens bowled in a series of five or more Tests was 66 (India, against Australia, in 1947-48, when the overs were eight balls long and maidens commensurately rarer), and the previous record by a team in a six-balls-per-over five-Test series was 74 (South Africa, in England, in a rain-affected 1924).\nOnly 5.3% of the complete overs bowled by Australia were maidens. Never had a bowling team in a series of four or more Tests had a maiden percentage below 9%. The previous lowest figure in a six-balls-per-over Ashes series was 13.6% (Australia in 2005).\nAustralia to use 11 bowlers in the series, for nine of them to concede at least four runs per over, and for the only two exceptions to be ropey occasional leg-spinners Steve Smith and Marnus Labuschagne\n(At this point, your bookmaker may have begun to become a little agitated and suspect you were a time traveller suffering from extreme time-machine-lag.)\nSmith and Labuschagne bowled one over each in the series, conceding one and three runs respectively. Australia's next most economical bowler was the much-missed Lyon, who conceded exactly four runs per over and had a decisive impact in the Edgbaston Test before his injury.\nPat Cummins to have an economy rate of more than 4.5 an over in five consecutive innings\nBefore Leeds, Cummins had conceded 4.5 runs per over in one of his 96 Test innings. He went for more than 4.9 an over in each of his last five innings this summer.\nIgnoring the fact that cricket, and particularly Bazballic cricket, does not obey statistical rules, the chances of a one-in-96 shot happening five times in a row is about one in 8 billion. This stat has basically cured world poverty on its own.\nThe final run-rate disparity between the teams was 1.39, the fourth highest in any Test series of three or more Tests and comfortably the highest in an Ashes series.\n(Your bookmaker is now looking distinctly agitated.)\nEngland's run-rate of 4.74 was the second fastest by a team in a Test series of three or more Tests, behind the 5.50 England themselves clattered in last December's series in Pakistan. Australia's 3.35 was their third slowest in the 13 Ashes series played this millennium\nThe flip side of this StokesioMcCullumesque statistic is that, despite being pummelled to all parts for much of the series, Australia's bowlers collectively returned their second-best strike-rate in a series in England since the start of the 20th Century - a wicket every 45.8 balls, fractionally behind their figure of 45.7 in 2001, when they secured a 4-1 victory.\nMitchell Starc's strike-rate of 33.4 was the second best since 1904 by a bowler who bowled at least 100 overs in an Ashes series, just ahead of Simon Jones' 34.0 in the 2005 spellbinder and behind only Mitchell Johnson's 30.5 in his 2013-14 pace masterpiece.\nStarc's economy rate (4.86) is the highest in any Test series by a bowler with 15 or more wickets, ahead of two other victims/beneficiaries of the high-risk-high-reward batting of Stokes' England - Pakistan spinner Abrar Ahmed, who took 17 wickets but went at 4.73 per over last December, and Hazlewood in this series (15 wickets, 4.56 per over).\nNeither team to be dismissed for less than 220\nThis was a series in which the bat, albeit without dominating other than in England's volcanic innings in Manchester, held sway over the ball.\nThe lowest total in a completed innings was Australia's 224 in the second innings at Headingley, making this the first Ashes series without a total of less 220 and putting the bowling achievements of Woakes, Mark Wood, Starc and Stuart Broad in particular into impressive context.\nThe highest-averaging batter on each side to be (a) Crawley (see above), and (b) Mitchell Marsh, with (a) Woakes and (b) Todd Murphy as the lowest-averaging bowlers\nWe live in a completely ridiculous universe.\nMarsh scored 250 runs at 50, almost exactly twice his previous career average after not playing a Test for nearly four years.\nMurphy, a rookie off-spinner with minimal red-ball experience who was almost certain not to play any part in the series, took seven wickets at 25.8.\nSix England players to post a series aggregate of 300 runs or more\nThis had never happened in any previous Ashes series.\nThe Oval Test to feature neither a century nor a five-wicket haul\nIt was only the 10th Ashes Test to fail to trouble to honours board, and only the second in England since 1930 (excluding a handful of significantly rain-shortened drawn matches).\nIt was only the fourth Test in England in the past 25 years not to result in at least one player scoring a hundred or taking five wickets in an innings.\nFour matches to be decided by margins of fewer than 50 runs or by three or fewer wickets\nAshes history had, on average, featured approximately one such match out of every 14 played. We have just seen four in a five-Test series.\nThe series to finish with no batter having been run out\nThis was only the second Test series of five or more matches which did not feature a run-out. The other was the 1998-99 Ashes in Australia.\nA Test to be played in which a three was not scored\nThe Headingley Test was a dreadful game for fans of threes. In more than 2,000 Tests for which CricViz has ball-by-ball data, it was the first instance (excluding a handful of games in which fewer than 45 overs were bowled because of rain or abandonment) of a match containing no threes, as a combination of the rapid outfield and deep-set fielders conspired to restrict the batters to singles, twos and boundaries.\nStuart Broad to swap the bails around on the stumps twice in the series, and each bail-swappage to be followed by a wicket next ball\nYou should now have cranked to accumulator odds high enough to save not merely earth - still one of the top five planets in the solar system despite its current problems - but also at least three as yet undiscovered inhabitable planets in outer space. Here endeth the bet. Congratulations.\nThere were many more statistical fascinations and achievements worthy of note: Broad taking 20 wickets in an Ashes series for the fifth time, two more than any other England bowler; Bairstow becoming the first England wicketkeeper to make three scores of 75-plus in a single Test series; Usman Khawaja batting for more balls (1,263) than any player in a series in England since Rahul Dravid for India in 2002, and more than any Australian in England since David Boon in 1993. I could go on - and I will go on, but only to my wife and children over the rest of the summer holidays.\nI hope these numbers show quite how remarkable the cricket has been this summer, and the extraordinary nature of the challenge that the current England team pose to their opponents.\nBoth sides, in different ways, had significant good and bad luck. Both could have ended the series as convincing winners if a few key moments and phases had gone their way.\nIt has been a sumptuous summer of Ashes cricket, both men's and women's series providing the kind of sport that, if there is any sense in the world, should be on the national curriculum as a case study of how to construct a ceaselessly compelling, soul-enveloping narrative drama.\nThank you, Test cricket. You are truly unique.", "url": "https://www.bbc.com/sport/cricket/66384548"}