{"authors": ["Alastair Telfer", "www.facebook.com"], "date_download": "2025-05-21 06:51:34", "date_modify": "2025-05-21 06:51:34", "date_publish": "2025-03-29 21:05:44", "description": "\"World class\" Ellie Kildunne stars with a hat-trick of tries in Cardiff as the world player of the year aims to keep getting better before a home Rugby World Cup in August.", "filename": "sport_rugby-union_articles_cdx2x5zx7e0o_1747810294.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5bbc/live/abd0c650-0cdc-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cdx2x5zx7e0o_1747810294.html", "title": "Women's Six Nations 2025: Ellie Kildunne stars with hat-trick in Cardiff", "title_page": "Women's Six Nations 2025: Ellie Kildunne stars with hat-trick in Cardiff - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "\"I haven't even scratched the surface of my potential.\"\nThose were the words of England full-back Ellie Kildunne in November when she was named World Rugby's women's player of the year.\nThe 25-year-old scored 14 tries in nine tests for the Red Roses last term, and it looked, on the outside, as though maintaining form before a home Rugby World Cup - which starts in August - was all she needed to do.\nBut Kildunne strived to become even better.\nAfter featuring late off the bench against Italy in York, a first start in this year's Women's Six Nations came in the 67-12 hammering of Wales at Principality Stadium in front of a record crowd of 21,186 for a Wales women's team event on home soil.\nThe Harlequin marked her 50th cap with a second-half hat-trick and a player-of-the-match performance to properly kick-start the biggest year of her rugby career to date.\n\"Pressure is definitely a privilege,\" Kildunne told BBC Two.\n\"Our potential is the unimaginable. We are going to keep getting better. I really think we are going to take it to levels that we've not been to before.\n\"We are just going to keep pushing until we get to a point that we just can't imagine what is next.\"\nTwo of Kildunne's tries were relatively straightforward dot downs, with the third an instinctive finish from a kick-through.\nWhen the whistle sounded for the start of the second half, Kildunne had no tries. By the 56th minute, her hand was above her head for yet another signature lasso celebration after a third score.\nKildunne made the most carries (16) and metres (145m) in the game, but it was her kicking game which stood out.\nFrom tidy deft chip-kicks to cause havoc in the backfield to grubber-kicks to turn the Wales defence, Kildunne has widened her game to be more than just a lethal counter-attack runner.\n\"She is starting to serve the team in different ways and there are going to be times that teams take away the counter-attack from her,\" England head coach John Mitchell told BBC Two.\n\"She is world-class with that plan A [running it back], but she is going to have to adapt in 2025 as certain teams will not allow her to get ball.\n\"We have to use her in the right way.\"\nKildunne was one of 13 changes Mitchell made to his starting XV from England's opening round victory over Italy, with the majority of his front-line starters returning.\nLike last weekend, the Red Roses ran away with the contest, scoring their bonus-point try inside 27 minutes.\nNumber eight Maddie Feaunati was named player of the match in York and further pressed her case to continue in the back row with two powerful finishes.\nWales-born Meg Jones scored the pick of England's 11 tries when she slalomed her way through her native country, showing incredible balance and footwork.\nJones, who was playing her first Red Roses match since both her parents passed away, pointed to the sky and tapped her chest before diving over the line.\n\"I haven't played here since I was 12 years old,\" Jones, 28, told BBC Two.\n\"When I heard both the anthems it took me a little bit. I have just tried to enjoy it as much as I can, I know they will both be so proud of me.\n\"I said in the week that they will still be in the crowd. Well, my dad may have gone home [after full-time] as he hates the crowd chaos.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/cdx2x5zx7e0o"}