{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:05:10", "date_modify": "2025-05-20 14:05:10", "date_publish": "2023-07-31 00:00:00", "description": "Watch live coverage as Jamaica v Uganda and Sri Lanka v Singapore in the second stage of the Netball World Cup in Cape Town.", "filename": "sport_live_netball_65814833_1747749910.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/FB2A/production/_130589246_jamaica-v-uganda_nwc-2023_badges.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_netball_65814833_1747749910.html", "title": "Netball World Cup 2023 LIVE: Watch Jamaica vs Uganda & Sri Lanka vs Singapore score, commentary & updates", "title_page": "Netball World Cup 2023 LIVE: Watch Jamaica vs Uganda & Sri Lanka vs Singapore score, commentary & updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "What is the format?\nBBC Sport\nThere were 16 teams in four pools in the first group stage, which took place from 28 to 30 July, and the top three sides from each went through to Pools F and G.\nTeams carry forward the results against the two other teams they faced in the first stage.\nThey will then contest three further matches against teams they have yet to play.\nThe top two teams from each pool advance to the semi-finals, while there will be classification matches for other nations.\nThe final take place at 17:00 BST on Sunday, 6 August at the Cape Town International Convention Centre.\nWorld Cup fixtures\nHow to watch the Netball World Cup 2023\nBBC Sport\nFollow the Netball World Cup in South Africa across BBC TV, iPlayer, radio and online from 28 July to 6 August.\nCape Town hosts 16 teams including England, Scotland and Wales, plus Australia and champions New Zealand.\nThe BBC will show every match across TV, iPlayer and the BBC Sport website from the second group stage on 31 July.\nBBC Radio 5 Live and Sports Extra have selected live commentaries and there will also be live text commentary of every England game on the BBC Sport website and app as the Roses seek to win the World Cup for the first time.\nThey finished third at the last World Cup in Liverpool in 2019.\nEverything you need to know about the World Cup\nMetcalf and Guscoth to co-captain England\nCaptain Maxwell set to become Scotland's most-capped player\nJones to captain Welsh Feathers at World Cup", "url": "https://www.bbc.com/sport/live/netball/65814833"}