{"authors": ["Matthew Henry", "www.facebook.com"], "date_download": "2025-05-21 03:50:43", "date_modify": "2025-05-21 03:50:43", "date_publish": "2025-04-07 10:59:35", "description": "Batter Harry Brook is named England's white-ball captain in both 50-over and T20 cricket.", "filename": "sport_cricket_articles_c4g3794x3rlo_1747799443.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a20d/live/2595ba30-13a0-11f0-8c3e-ab5924cb0c94.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c4g3794x3rlo_1747799443.html", "title": "Harry Brook: Batter named England's white-ball captain in both 50-over and T20s", "title_page": "Harry Brook: Batter named England's white-ball captain in both 50-over and T20s  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Batter Harry Brook has been named England's white-ball captain.\nThe 26-year-old replaces Jos Buttler, who stepped down after England were knocked out of the Champions Trophy in February.\nBrook will take charge in both one-day internationals and T20s - ending speculation England could split the captaincy for the two formats.\nThe Yorkshireman, Butter's vice-captain over the past 12 months, was seen as the leading candidate for the job along with Test skipper Ben Stokes.\n\"He's been part of our succession planning for some time, albeit this opportunity has come slightly earlier than expected,\" Rob Key, the managing director of England men's cricket said.\n\"Harry is not only an outstanding cricketer, but also has an excellent cricketing brain and a clear vision for both teams that will help drive us towards winning more series, World Cups and major global tournaments.\"\nThis is Brook's first full-time captaincy role with England, though he led the ODI side in a five-match series against Australia in September when Buttler was injured.\nHe is a former England Under-19 captain and led Northern Superchargers in The Hundred last year.\nIn appointing Brook, Key has overlooked concerns about the batter's workload.\nBrook was due to play in this year's Indian Premier League but pulled out to manage his workload. He has not played since a disappointing run in England's dismal Champions Trophy campaign.\nAs a key player across Tests, 50-overs and T20 he will have a packed schedule if, as England plan, he is to play all matches.\nEngland's priorities this year are two huge Test series - against India at home this summer and the Ashes in Australia this winter.\nKey said he would consider \"every option\" last month and in selecting Brook he has allowed Stokes, who has struggled with injuries in recent years and is currently out with a hamstring issue, to concentrate on the Test side.\nBrook's first series as skipper will be three ODIs and three T20s against West Indies, which begin on 29 May - four days after a Test against Zimbabwe. The series ends on 10 June which is 10 days before the start of the India series.\nAfter that, England do not play again in white-ball cricket until series against South Africa and Ireland in September. There is also a white-ball tour to New Zealand in early November before the Ashes begins on 21 November.\nBrook's first International Cricket Council event will be the T20 World Cup in India and Sri Lanka, which follows the Ashes in February and March next year.\nEngland's white-ball sides have largely struggled since winning the 2022 T20 World Cup to become the first men's team to hold both global limited-overs titles.\nDisappointing defences of their titles at the 2023 World Cup in India and 2024 T20 edition in the Caribbean led to Matthew Mott being sacked as coach and heaped pressure on Buttler, who stood down after an underwhelming Champions Trophy.\n\"It's a real honour to be named England's white-ball captain,\" Brook said.\n\"Ever since I was a kid playing cricket at Burley in Wharfedale, I dreamed of representing Yorkshire, playing for England, and maybe one day leading the team. To now be given that chance means a great deal to me.\n\"There's so much talent in this country, and I'm looking forward to getting started, moving us forward, and working towards winning series, World Cups and major events.\"", "url": "https://www.bbc.com/sport/cricket/articles/c4g3794x3rlo"}