{"authors": ["Ben Stevenson", "www.facebook.com"], "date_download": "2025-05-21 06:28:59", "date_modify": "2025-05-21 06:28:59", "date_publish": "2025-01-31 09:51:19", "description": "Man City news: Loan watch on Mahamadou Susoho and Jadel Katongo at Peterbrough", "filename": "sport_football_articles_cm291nedmr1o_1747808939.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b6ff/live/b6706bb0-dfaa-11ef-bd1b-d536627785f2.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cm291nedmr1o_1747808939.html", "title": "Man City news: Loan watch on Mahamadou Susoho and Jadel Katongo at Peterbrough", "title_page": "Man City news: Loan watch on Mahamadou Susoho and Jadel Katongo at Peterbrough - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "When the signing of Jadel Katongo was announced on transfer deadline day back in September, it was met with universal praise by Peterborough United fans.\nThe 20-year-old made 43 appearance for Darren Ferguson's side last season and had impressed with his versatility and technical ability.\nHe was also in demand because Posh had lost the other three members of their back four. Harrison Burrows was sold to Sheffield United, Ronnie Edwards to Southampton and Josh Knight left for Germany on a free transfer.\nBut Katongo's second spell has been far from ideal. He played just four games before picking up an injury against Birmingham City, ruling him out for a month. He then returned into a troubled Posh back line, who had conceded the most goals in League 1, and the Manchester City youngster was unable to stem the tide as he worked himself back to fitness and form.\nDarren Ferguson has opted to add another three defenders in the winter transfer window, dropping Katongo down the pecking order at London Road. The loanee is now going to miss another couple weeks with a further injury.\nThings are looking brighter though for Posh's other City loan player Mahamadou Susoho.\nHe too suffered injury misery early in his stay, completing just one game before being ruled out until the new year. However, he returned as a half-time substitute against Lincoln City before scoring his first goal for the club against Wigan Athletic in a 1-0 win.\nIt's fair to say that Susoho is quickly endearing himself to the Posh faithful in a similar way that Katongo did last year.", "url": "https://www.bbc.com/sport/football/articles/cm291nedmr1o"}