{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:17:32", "date_modify": "2025-05-21 04:17:32", "date_publish": "2025-04-06 00:00:00", "description": "Watch Warrington Wolves v St Helens in the Challenge Cup or listen to BBC Radio Merseyside commentary and also listen to local BBC radio commentary as York Knights take on Widnes Vikings in the 1895 Cup.", "filename": "sport_rugby-league_live_cx2eznp74kyt_1747801052.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-league_live_cx2eznp74kyt_1747801052.html", "title": "Challenge Cup & 1895 Cup LIVE: Warrington Wolves v St Helens plus York Knights v Widnes Vikings", "title_page": "Challenge Cup & 1895 Cup LIVE: Warrington Wolves v St Helens plus York Knights v Widnes Vikings - watch & listen - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Bye bye for now\nFT: Warrington 20-12 St Helens\nThat's just about where we leave you this afternoon.\nWe've been treated to some stellar ties in the Challenge Cup between Friday and today, ending with a stunning 80 minutes at the Halliwell Jones Stadium.\nWe turn our attention back to Super League from next weekend before the Challenge Cup returns next month.\nA reminder that we'll bring you all the action in Super League across the BBC, with reports and highlights on the BBC Sport website in addition to radio commentary on BBC Radio 5 Live and BBC Local Radio.\nFor now though, thank you for joining us.\nA reminder of the semi-final draw\nFT: Warrington 20-12 St Helens\nA reminder that in addition to this stunning game of rugby league, we also had the draw for the men's Challenge Cup semi-final at half-time in this game.\nHere's what we've got to look forward to, with the two ties taking place during the weekend of 10 and 11 May:\nHull KR v Catalans Dragons\nWarrington Wolves v Leigh Leopards\n'Good in patches and showed spirit'\nFT: Warrington 20-12 St Helens\nWarrington Wolves head coach Sam Burgess on BBC Two:\n\"We knew it was going to be tough. We were good in patches but we showed a lot of spirit, St Helens are a really tough side, it was a great contest.\n\"The game opened up as some fatigue set in, we have a bit to look at but we should be proud of the effort and commitment to the result.\n\"We feel we have a long way to go with our defence but we were good today and I’m happy with the spirit.\"\n'A lot of pressure was self-inflicted'\nFT: Warrington 20-12 St Helens\nSt Helens head coach Paul Wellens on BBC Two:\n\"I can never fault the efforts of the team.\n\"I’m proud of them but there are some lessons to be learned in terms of big games, we were under a lot of pressure but a lot of the pressure was self-inflicted.\n\"When we were attacking them we were creating some space but there is lots to be learned.\"\n'We're proud of our efforts'\nFT: Warrington 20-12 St Helens\nWarrington Wolves captain George Williams on BBC Two:\n\"It was tough, we played some good rugby but we have loads more to work on.\n\"We’re in tight games and we’re finding a way to win, you need that in the big games and we’re proud of our efforts.\n\"I was already tired when I caught the ball for the try so when I got going I was in all sorts but glad to get over the line.\"\nFull time\nWarrington 20-12 St Helens\nWarrington head through to the semi-finals to meet Leigh Leopards next month.\nIt's been a hard-hitting 80 minutes and Wire boss Sam Burgess maintains his 100% record against St Helens, beats them in the Challenge Cup for the second successive season and registers their second win against Paul Wellens' side in as many weeks.\nSt Helens made a game of it but were depleted by the HIA losses of Jake Wingfield and Mark Percival.\nFor the Wire, their quality made the difference when it counted. It was a captain's performance from George Williams alright, as he inspired a late run in to progress to the final four.\nPost\nWarrington 20-12 St Helens\nRobbie Hunter-Paul\nFormer New Zealand international on BBC Two\nSt Helens need to create some space here.\nTheir players need to be on red alert and really go for it, they need to make measured offloads and passes.\nThey will get an opportunity, they just need to take it when it comes.\nPost\nWarrington 20-12 St Helens\nRobbie Hunter-Paul\nFormer New Zealand international on BBC Two\nThat is an end to end play where no one had anything left in the tank.\nWhen you look to these games you want your big men to come up with the big moments.\nGeorge Williams shows great game IQ there with his run and comes up with the big play.", "url": "https://www.bbc.com/sport/rugby-league/live/cx2eznp74kyt"}