{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:30:23", "date_modify": "2025-05-21 07:30:23", "date_publish": "2025-01-03 22:30:36", "description": "Tottenham manager Ange Postecoglou says he has \"got no problem\" with James Maddison going to watch darts despite being unable to start a match because of illness.", "filename": "sport_football_articles_c2ld8e5ey1qo_1747812623.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a8e0/live/a5f72820-c9fa-11ef-9292-2fb973c2de10.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c2ld8e5ey1qo_1747812623.html", "title": "James Maddison: Tottenham boss Ange Postecoglou has 'no problem' with darts visit", "title_page": "James Maddison: Tottenham boss Ange Postecoglou has 'no problem' with darts visit - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tottenham manager Ange Postecoglou says he has \"got no problem\" with James Maddison going to watch darts despite being unable to start a match because of illness.\nThe England midfielder was meant to start last Sunday's home game against Wolves at 15:00 GMT but was only deemed well enough to be on the bench.\nHe came on in the 64th minute of their 2-2 draw.\nHours later he was pictured at the World Darts Championship tie between Luke Humphries and Peter Wright at London's Alexandra Palace - along with team-mate Brennan Johnson.\n\"I've got no problem with the players having lives,\" said Postecoglou. \"It's a lot different trying to play a game of football and living a life. I don't see any problem with that and I don't think it hurt him.\n\"He wasn't 100% and it was a game where we needed someone to be 100%. He was still well enough to play.\n\"If he was bed-ridden, didn't turn up to the game and then still went to the darts, there may be an issue there. But I had no issue with that.\"\nMaddison, who celebrates goals by pretending to throw a dart, has scored eight and created five assists in 26 appearances this season.\n\"I still think the key with Madders is to keep him fit, keep him healthy, keep him sharp and that's by not playing every game, especially with the programme we've got,\" said Postecoglou.\n\"When he's played this year his goal tally is strong, he's always impacted the game and that's what we need him to keep doing.\"", "url": "https://www.bbc.com/sport/football/articles/c2ld8e5ey1qo"}