{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:02:32", "date_modify": "2025-05-20 14:02:32", "date_publish": "2023-07-30 15:00:07", "description": "France's Celine Boutier wins her first major title with a six-shot victory in the Evian Championship.", "filename": "sport_golf_66355473_1747749752.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/16D94/production/_130588539_gettyimages-1580847214-1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_golf_66355473_1747749752.html", "title": "Evian Championship: Celine Boutier wins first major by six shots", "title_page": "Evian Championship: Celine Boutier wins first major by six shots - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Home favourite Celine Boutier won the first major title of her career with a resounding victory in the Evian Championship in France.\nThe 29-year-old extended her overnight three-shot lead to finish six clear on 14 under after carding 68 in Sunday's final round.\nBoutier is the first French winner at the Evian Resort Golf Club.\nCanada's defending champion Brooke Henderson finished second on eight under.\n\"It was definitely not easy and the conditions were tough so I just tried to stay focused on each hole at a time,\" said Boutier, who claimed three birdies in her opening five holes.\n\"I feel like I handled the first few holes very well. I had a good opportunity on hole one and the putt on two was a bonus. It has been my biggest dream ever since I started watching golf. This tournament has been very special to me and to hold this trophy is unbelievable.\n\"You can always play better but I feel like I was very steady on all four rounds in tough conditions and I'm happy with my game and my level this week. Nothing else matters now I have this trophy so I'm really good for the rest of the year.\"\nBoutier looked assured through the front nine but a bogey on the 13th cut her lead to four shots and gave the chasing pack a glimmer of hope.\nHowever, an impressive birdie at the long 15th all-but ended the contest as Japan's Nasa Hataoka, who was second overnight, fell to joint third on seven under.\nBoutier becomes the third French woman to win a major after Catherine Lacoste claimed the 1967 US Women's Open as an amateur and Patricia Meunier Lebouc claimed victory at the Kraft Nabisco Championship in California 20 years ago.\nTwo-time Solheim Cup player Boutier is already the most decorated French woman on the LPGA Tour with victories in the Drive On Championship in March, and on home soil at the 2021 French Open.\nScotland's Gemma Dryburgh hit a 69 to finish eighth on the leaderboard on six under.", "url": "https://www.bbc.com/sport/golf/66355473"}