{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:06:26", "date_modify": "2025-05-21 07:06:26", "date_publish": "2025-03-29 00:00:00", "description": "A freak own goal from Hull City defender Alfie Jones sees Luton Town grab a vital win in their bid to avoid relegation from the Championship.", "filename": "sport_football_live_cj92k2kw73zt_1747811186.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cj92k2kw73zt_1747811186.html", "title": "Hull City 0-1 Luton Town: Freak Jones own goal gifts Hatters win", "title_page": "Hull City 0-1 Luton Town: Freak Jones own goal gifts Hatters win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Luton Town's Championship survival hopes were given a huge boost as a freak own goal gifted them three points at relegation rivals Hull City.\nJust 11 seconds into the second half, a clearance from Tigers captain Lewie Coyle struck team-mate Alfie Jones in the face and flew past goalkeeper Ivor Pandur.\nIt was enough for the Hatters to take all three points as they stay in 23rd but it moves them level with Derby County, and they are now two points from safety.\nMatt Bloomfield's side have collected 10 points from their past five games as they gather momentum in their battle to avoid successive relegations.\nBut it was a real setback for Hull in their bid to move further clear of trouble as this defeat leaves them only three points clear of the drop zone as they slipped to 20th.\nIt was another bad day at MKM Stadium for the side with the worst home record in the league, this coming against a team who had previously taken just eight points out of a possible 57 on the road.\nLuton are the lowest scorers in the Championship and having missed plenty of chances in their goalless draw at home to Middlesbrough in their last game, they could not take advantage of two big opportunities in the opening quarter of an hour.\nFirst, Elijah Adebayo struck the base of the post after a neat turn inside the area before captain and strike partner Carlton Morris got his angles wrong as he steered one wide from a floated free-kick having broken the offside trap.\nRuben Selles' team enjoyed more possession but found the visitors hard to prise open, as typified by Mark McGuinness' fine full-length block from a goalbound Kasey Palmer effort.\nHowever, the game's decisive moment arrived 11 seconds into the second half as Luton's luck – and possibly the shape of their whole season - changed in a big way.\nMorris headed on Thomas Kaminski's long kick, Adebayo flicked it into the box and before they knew it the ball had flown into the net courtesy of Jones' unfortunate contribution.\nIt went down as the quickest second half goal scored by any team across the top four divisions this season.\nHull huffed and puffed but they struggled to make any headway in search of an equaliser and it was not until the fourth minute of added time that Kaminski was needed to make a serious save as he was full stretch to tip over a 25-yard piledriver from centre-half Charlie Hughes as the visitors hung on.\nWith promotion-chasing Leeds United coming to Kenilworth Road next Saturday and huge away games coming up at more relegation rivals in Stoke City and Derby by the middle of April, Luton knew the significance of this result.\nHull, meanwhile, head to Sheffield Wednesday in their next outing, knowing that they are far from safe with seven games to go.\nHull City head coach Ruben Selles told BBC Radio Humberside:\n\"You can lose matches, that can happen. I'm more disappointed in our reaction after going 1-0 down.\n\"The goal was an action we can avoid, but it took us more than 30 minutes to react and start to build up the pitch and put them under pressure.\n\"We lost a little bit of our identity in these moments. I'm disappointed because I expect my team to come back quicker and put the opposition on the back foot and under pressure a bit more.\"\nLuton Town manager Matt Bloomfield told BBC Three Counties Radio:\n\"We've got to be incredibly proud of the performance today. We started well, hit the post and had a couple of good chances.\n\"Being the away side, there's a time when you're going to have to defend and we did that.\n\"The goal was obviously extremely fortunate but in terms of our performance, the endeavour, the way the boys are playing, the shape, there's a lot to be pleased and proud about.\n\"The fans want to see our boys' grit and determination. That's what our club stands for and they saw that today.\"", "url": "https://www.bbc.com/sport/football/live/cj92k2kw73zt"}