{"authors": ["Nizaar Kinsella", "www.facebook.com"], "date_download": "2025-05-21 03:52:20", "date_modify": "2025-05-21 03:52:20", "date_publish": "2025-04-07 10:04:23", "description": "Brentford 0-0 Chelsea: Analysis - Champions League spot 'in the balance' after 'drab draw'", "filename": "sport_football_articles_c2lzjnzre5wo_1747799540.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/aff5/live/ec93a800-1395-11f0-b054-11b99aeb4b3e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c2lzjnzre5wo_1747799540.html", "title": "Champions League spot 'in the balance' after 'drab draw'", "title_page": "Brentford 0-0 Chelsea: Analysis - Champions League spot 'in the balance' after 'drab draw' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "When Enzo Maresca's starting line-up was announced before Chelsea's trip to Brentford on Sunday, there was a sense of surprise among many Blues fans across social media.\nAnd after a drab goalless draw stretched their winless away run to eight matches, to leave their Champions League hopes in the balance, questions about his team selection grew even louder.\nMaresca rested Nicolas Jackson, Cole Palmer, Marc Cucurella and in-form Pedro Neto. In came Malo Gusto, Kiernan Dewsbury-Hall, Christopher Nkunku and Noni Madueke, who all struggled to make an impact.\nAll four of Chelsea's rested stars came on in the second half, which saw the Blues go from having just six shots and one on target before the interval to 17 shots and four on target after the break.\nThe Chelsea boss also faced criticism from sections of the away end, who have shown increasing frustration at his style of play, amid chants of \"attack, attack, attack\" and \"we've had a shot\" during a poor first half.\nThe bigger concern is that, although Chelsea remain fourth, the fight for Champions League places is looking increasingly competitive, with Manchester City, Aston Villa and Newcastle all within three points of the Blues.\nWith a Conference League quarter-final against Legia Warsaw to come on Thursday, and the likes of Palmer and Jackson just returning from injuries, Maresca was quick to defend his squad rotation.\nThe Italian also blamed the quick turnaround for his selection gamble, claiming it was unfair his side had 24 hours less than Brentford to prepare for the match, having played Tottenham at home on Thursday.\nWhen pressed by BBC Sport on whether he could have rotated in other games, he said: \"This is a different opinion. I'm here to try to do the best for the club and players. I work every day with the players so I can see how they are.\n\"I'm not sure if Spurs at home is harder than Brentford away. For me, they are all complicated.\"", "url": "https://www.bbc.com/sport/football/articles/c2lzjnzre5wo"}