{"authors": ["Sam Drury", "www.facebook.com"], "date_download": "2025-04-26 04:19:35", "date_modify": "2025-04-26 04:19:35", "date_publish": "2025-03-03 16:20:06", "description": "Rohit Sharma refutes suggestions that India playing all their matches in Dubai gives them an advantage over their Champions Trophy opponents.", "filename": "sport_cricket_articles_cj3njg7178po_1745641175.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/82f4/live/abf55310-f848-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_cricket_articles_cj3njg7178po_1745641175.html", "title": "India cricket: Rohit Sharma says Champions Trophy venue not an advantage", "title_page": "India cricket: Rohit Sharma says Champions Trophy venue not an advantage - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Captain Rohit Sharma has rejected suggestions that India playing all of their matches in Dubai gives them an advantage in the Champions Trophy.\nIndia, who face Australia in Tuesday's semi-final, refused to play in Pakistan because of political tensions between the two countries and came into the tournament knowing all of their games would be played in the United Arab Emirates.\nBy contrast other teams have had to deal with the differing conditions in Lahore, Karachi, Rawalpindi as well as Dubai.\nWhile India won all three of their group games to reach the semi-finals, Rohit does not think his team have benefited from playing each game at the same venue.\n\"The three matches we played, the nature of the surface was the same. But in all three games, the pitch has behaved differently,\" he said.\n\"There are four or five surfaces that are being used. So, every surface has a different nature. We don't know which wicket will be played. The pitches look the same, but when you play on it, it's played in a different way.\n\"So, you can't go thinking that we played like this yesterday, and today we'll play like this. Every time, because of the different pitches, the pitch is giving you different challenges as a batsman.\n\"We don't know which pitch is going to be played in the semi-final. But whatever happens, we have to adapt and see what is happening. We will play on that.\n\"This is not our home, this is Dubai. So, we don't play so many matches here. This is new for us too.\"\nIndia, who have won eight of the nine ODIs they have played in Dubai, take on Australia in the last four on Tuesday with the winners facing either New Zealand or South Africa in Sunday's final.\nAustralia's last ODI in Dubai was a 20-run win over Pakistan in 2019 and New Zealand played there against India on Sunday, but South Africa have not competed in an ODI in Dubai since losing to Pakistan in 2013.\nShould India win, the final will be held in Dubai but an Australia victory would see the showpiece match take place in Lahore.", "url": "https://www.bbc.co.uk/sport/cricket/articles/cj3njg7178po"}