{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:29:46", "date_modify": "2025-05-21 04:29:46", "date_publish": "2025-01-23 15:11:31", "description": "Mikaela Shiffrin will return from a two-month injury lay-off next week when she races at a World Cup event in France.", "filename": "sport_articles_c0m1rmxm8x1o_1747801786.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/730e/live/7e6e89f0-d996-11ef-941c-57ca5bda0a5e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c0m1rmxm8x1o_1747801786.html", "title": "Mikaela Shiffrin: American skier will return from injury at World Cup event in France", "title_page": "Mikaela Shiffrin: American skier will return from injury at World Cup event in France - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Mikaela Shiffrin will return from a two-month injury lay-off next week when she races at a World Cup event in France.\nThe two-time Olympic champion sustained a puncture wound to the right side of her abdomen and severe muscle trauma during a race on 30 November 2024.\nShiffrin had been seeking a record-extending 100th World Cup win at the event in Killington, Vermont before she fell and crashed into safety netting during the giant slalom.\nThe American told NBC's Today programme, external she suffered a \"seven-centimetre-deep puncture wound\" which required surgery, and rehabilitation had been a \"gruelling process\".\nHowever, the 29-year-old was now in a \"really good place physically\" and will return to competitive racing at the 2024–25 FIS Alpine Ski World Cup event in Courchevel on 30 January.\n\"I think it's been a little bit uncertain whether I could even return this season, but I've been able to get on snow,\" Shiffrin said.\n\"I think the next step is racing. That's the next step of this recovery. So the recovery is not really over, but I'm strong enough to get back in the start gate and that's the next phase of this progression.\"", "url": "https://www.bbc.com/sport/articles/c0m1rmxm8x1o"}