{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:36:20", "date_modify": "2025-05-21 05:36:20", "date_publish": "2025-04-01 08:28:31", "description": "Leicester news: Rob Tanner on it being 'now or never' in the Foxes' survival bid", "filename": "sport_football_articles_cr5d4qg14p2o_1747805780.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ce6a/live/e82c6630-0ec7-11f0-8f09-13e8c6b5fbba.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cr5d4qg14p2o_1747805780.html", "title": "Leicester news: Rob Tanner on it being 'now or never' in the Foxes' survival bid", "title_page": "Leicester news: Rob Tanner on it being 'now or never' in the Foxes' survival bid - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Leicester City will be hoping to kick-start their bid for Premier League survival against Manchester City on Wednesday and The Athletic's Rob Tanner believes it is a case of \"now or never\" for Ruud van Nistelrooy's side, following the two-week international break.\nManchester City have won nine of their past 10 Premier League games against the Foxes, including the past six by an aggregate score of 15-4.\nSpeaking on BBC Radio Leicester's When You're Smiling podcast, Tanner said: \"It is now or never - but we have been saying that for weeks!\n\"They did have a run of games up to this point which were much more positive for them to be able to get some points from, but they didn't get any points.\n\"Now they are going into a run of games against Manchester City, Newcastle United, Brighton and Liverpool - and that's all before they get to the final five games.\n\"We've been saying for quite a while now that Leicester City will only have a chance of surviving if they are still in touch when they get to those final five games, but they are nine points adrift now.\n\"If they lose at Manchester City, which you would expect them to do, and Wolves pick up a positive result against West Ham United, then suddenly it will become mission impossible.\n\"We have talked a lot about 'The Great Escape' 10 years ago and the factors behind that. The team were in a particularly bad position back then, but I can remember them never really being out of those games and they weren't taking a beating every week.\n\"A lot of that was because they were naive about the Premier League because it was all new to them, but a lot of these current lads have experienced the Premier League before and shouldn't be making the same mistakes.\n\"So it is now or never - and it might even be mission impossible for them.\"", "url": "https://www.bbc.com/sport/football/articles/cr5d4qg14p2o"}