{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:46:10", "date_modify": "2025-05-21 07:46:10", "date_publish": "2025-01-13 14:07:19", "description": "Wales name Ospreys fly-half Dan Edwards and Scarlets wing Ellis Mee as two uncapped players in a 34-man squad for the 2025 Six Nations.", "filename": "sport_rugby-union_articles_cx2y79rw949o_1747813570.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/81da/live/bf25b9c0-d1d3-11ef-94cb-5f844ceb9e30.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cx2y79rw949o_1747813570.html", "title": "Six Nations 2025: Wales name uncapped players Ellis Mee and Dan Edwards in squad", "title_page": "Six Nations 2025: Wales name uncapped players Ellis Mee and Dan Edwards in squad - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wales have named Ospreys fly-half Dan Edwards and Scarlets wing Ellis Mee as two uncapped players in a 34-man squad for the 2025 Six Nations.\nEdwards is one of only two fly-half options alongside Cardiff's Ben Thomas, who plays primarily at centre, with Gloucester's Gareth Anscombe dropped and Sam Costelow missing through injury.\nOther notable absentees include Max Llewellyn, Rio Dyer, Cameron Winnett and Taine Plumtree.\nDewi Lake, Ryan Elias, Costelow, Adam Beard, Ben Carter, Archie Griffin and Mason Grady are unavailable because of injury. Ospreys flanker Jac Morgan will captain the side after Lake's injury.\nHead coach Warren Gatland has given recalls to Ospreys hooker Sam Parry, Sale prop WillGriff John, Exeter lock Dafydd Jenkins, Cardiff pair Taulupe Faletau and Josh Adams, Saracens back Liam Williams and Scarlets centre Joe Roberts.\nThere are 11 non-Wales based players included in the squad.\nWales begin their Six Nations campaign against France in Paris on Friday, 31 January.\nScarlets signed Welsh-qualified Mee for the 2024-25 season from Nottingham.\nMee, who qualifies for Wales through his mother who is from Newport, has impressed Welsh selectors with two tries in nine appearances.\nEdwards, 21, has been in fine form for Ospreys while Scarlets fly-half Costelow has been ruled out of the tournament because of a broken collarbone.\nGloucester fly-half Anscombe has been carrying a knee injury but Gatland confirmed he was fit for selection and his omission was down to selection.\nHis Gloucester team-mate Llewellyn has been in fine form for his club, where he is the joint-top try-scorer in England's Gallagher Premiership. He started all three internationals in the autumn campaign at outside centre.\nCardiff full-back Winnett had established himself as Wales' first choice full-back in the first half of 2024 before falling out of favour in the starting side towards the end of the year.\nBritish and Irish Lions duo Liam Williams and Josh Adams return after missing the autumn internationals series.\nNumber eight Faletau has not featured at Test level since the World Cup pool victory against Georgia in October 2023, missing Wales' current run of 12 straight Test defeats because of injury.\nWales have front-row injury concerns, with hookers Lake and Elias injured and the same applying for Cardiff's Efan Daniel and Liam Belcher.\nElliot Dee is included after missing the autumn internationals because of an ankle injury. He has started only one game this season.\nParry is back in favour after leaving the national training squad last June in controversial circumstances.\nGatland says he did not mean to \"disrespect\" Parry after the 33-year-old chose to leave the squad before the summer international against South Africa at Twickenham and two-Test tour of Australia.\nParry's decision at the time came after being told by Gatland he was a fringe member of the party when the squad came together and he was only going to be acting as cover for Wales' other three hookers.\nGatland says he was being honest with Parry about where he stood in the Wales pecking order. Parry maintained he still had international ambitions and has now been rewarded.\nTight-head prop is also a problem position, with Bath's Archie Griffin unavailable following shoulder surgery and Leon Brown having recently retired.\nJohn has not played for Wales since 2021 and has made just one start for Sale this season with four further replacement appearances.\nWales took the Six Nations wooden spoon for the first time in 21 years in the 2024 tournament having lost every game to finish at the foot of the table.\nIt was announced in December 2024 that Gatland would continue as Wales coach for this year's tournament despite Welsh Rugby Union (WRU) chief executive Abi Tierney admitting his position had been \"on the line\" following an independent review.\nGatland, 61, has presided over statistically the worst side in Wales' 143-year international rugby history, slumping to a record 12 successive Test match defeats.\nWRU executive director of rugby Nigel Walker has resigned but Gatland, whose contract runs until the 2027 World Cup, will remain in his role for now.\n\"We've selected a squad that we feel has a good blend of exciting young talent and experience,\" Gatland said.\n\"This group of players has a huge amount of potential and we will be working incredibly hard together this campaign.\n\"Every single training session is incredibly important in terms of our preparation for that first game and I'll be looking to see a lot of hard work and everyone working together.\n\"As ever there are going to be some very disappointed players who have missed out on selection. The message to them is keep working hard because you never know what may happen.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/cx2y79rw949o"}