{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:17:45", "date_modify": "2025-04-26 06:17:45", "date_publish": "2025-03-01 18:18:09", "description": "Portsmouth head coach John Mousinho says his side were \"far from good enough\" in their 1-0 defeat by Luton.", "filename": "sport_football_articles_cly8w91k0k5o_1745648265.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0ceb/live/44eb1090-f6c9-11ef-a811-cd286d96b2f6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cly8w91k0k5o_1745648265.html", "title": "John Mousinho: Portsmouth manager says side were not 'good enough' in Luton loss", "title_page": "John Mousinho: Portsmouth manager says side were not 'good enough' in Luton loss - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Portsmouth head coach John Mousinho said his side were \"far from good enough\" in their 1-0 defeat by Luton.\nThe loss means his side stay 17th in the Championship and managed only one shot on target throughout the game.\n\"It is difficult to sum up really. There was very little in the game. We killed ourselves in the first-half, I thought we were dreadful,\" Mousinho told BBC Radio Solent.\n\"I didn't think we did the basics right. The thing that sums up the first half is after about five minutes one of our central midfielders is on a booking for a ridiculous challenge and we are giving away free-kick after free-kick, it is a 180 [degree turn] of the gameplan.\n\"The attitude wasn't right. We were much better in the second half but it was too late. It was far from good enough.\n\"I don't think we were getting torn apart by a side that did anything extraordinary, we just made horrendous decisions. The goal came from our free-kick.\n\"Today was a massive opportunity to put a bit of daylight between us and the bottom three and we decided not to take it.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cly8w91k0k5o"}