{"authors": ["Rebecca Keegan", "www.facebook.com"], "date_download": "2025-05-20 12:42:36", "date_modify": "2025-05-20 12:42:36", "date_publish": "2023-08-03 14:05:09", "description": "Padraig McCrory says he \"owes it to the people of Belfast\" to put on a \"big performance\" in his headline Feile an Phobail bout at Falls Park on Friday.", "filename": "sport_boxing_66386653_1747744956.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3A7C/production/_130627941_gettyimages-1245556764.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_boxing_66386653_1747744956.html", "title": "Padraig McCrory: Belfast fighter excited to put on 'big performance' in Falls Park headline bout", "title_page": "Padraig McCrory: Belfast fighter excited to put on 'big performance' in Falls Park headline bout - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Padraig McCrory says he \"owes it to the people of Belfast\" to put on a \"big performance\" in his headline Feile an Phobail bout at Falls Park on Friday.\nMcCrory faces England's Steed Woodall as he chases a world title fight.\nThe Belfast man is undefeated in 17 professional fights, most recently defeating Diego Ramirez on Michael Conlan's undercard in May.\n\"I'm expecting a big performance, I think I owe it to the people of Belfast\", the 35-year-old told the BBC.\n\"They keep coming and they keep backing me. My last couple of performances haven't been great, I owe them a special night.\"\nMcCrory, who made his pro debut in 2017, has fought in Belfast on several occasions but Friday marks the first time he has topped a major bill in his home city.\nHowever, having fought in front of big crowds at the SSE Arena and in Frankfurt, where he won the vacant IBO light-heavyweight belt last year, McCrory does not feel any added pressure.\n\"No, as I say it's my third event in Falls Park,\" said McCrory.\n\"I've been involved in big shows in the SSE, so everything has led to here and I think this is the right step in my path, in my career.\n\"There's a small bit of pressure there but I'm going to thrive on it.\"", "url": "https://www.bbc.com/sport/boxing/66386653"}