{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:34:47", "date_modify": "2025-05-20 13:34:47", "date_publish": "2023-07-24 11:28:26", "description": "Your views on Manchester United win over Arsenal", "filename": "sport_articles_c84q0dz10nwo_1747748087.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f9c0/live/b1786ec0-2a0f-11ee-b1d7-8fdc93c2782e.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c84q0dz10nwo_1747748087.html", "title": "Your views on Manchester United win over Arsenal", "title_page": "Your views on Manchester United win over Arsenal - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked you for your thoughts on Manchester United's pre-season win over Arsenal.\nHere are a selection of your comments:\nEwan: It's always good to beat Arsenal, whatever the occasion, but United can generally look impressive in pre-season friendlies then drop their levels when the season starts and the stakes are higher. The problem is how our players handle pressure in games, their ability is not really the issue. In my view, United still have players that lack will and tenacity.\nPete: Excellent performance by all. Kobbie Mainoo was superb, Jadon Sancho and Bruno Fernandes both good. Lisandro Martinez superb too. A brilliant team effort both halves. Made Arsenal look very ordinary.\nShane: I thinks it's important to not get carried away with pre-season. Last year we beat Liverpool 4-0 in pre season then lost to Brighton and Brentford. That being said, some good performances and some good up-and-coming stars played well.\nRichard: The performance of Mainoo is no surprise to me. I saw him play in one game last season and could tell he was going to be something special. Sancho has been surprisingly good, but we desperately need a quality striker and cover for centre of defence", "url": "https://www.bbc.com/sport/articles/c84q0dz10nwo"}