{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:50:22", "date_modify": "2025-05-20 11:50:22", "date_publish": "2023-08-07 09:09:25", "description": "Huddersfield Giants hand Challenge Cup finalists Leeds Rhinos a shock third Women's Super League defeat of the season.", "filename": "sport_rugby-league_66426663_1747741822.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/01C9/production/_130675400_oh5_5973.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-league_66426663_1747741822.html", "title": "Women's Super League: Challenge Cup finalists Leeds Rhinos stunned by Huddersfield Giants", "title_page": "Women's Super League: Challenge Cup finalists Leeds Rhinos stunned by Huddersfield Giants - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Huddersfield Giants shocked Challenge Cup finalists Leeds Rhinos, handing them a third Women's Super League defeat of the season on Sunday.\nLois Forsell's Rhinos play St Helens in the final on Saturday, and made changes accordingly - with three academy debutants in the matchday 17.\nHowever credit must go to the Giants, who saw Amelia Brown score a hat-trick in their first league win of the year.\nRhinos' final opponents St Helens overcame Wigan in Sunday's derby.\nFaye Gaskin and Phoebe Hook did the damage with two first-half tries and, although Anna Davies replied for Wigan, they could not narrow the gap.\nYork Valkyrie all but secured the League Leaders' Shield for a second season in a row with a dominant win over Warrington.\nWith history ready to be made on Saturday in the first final to take place at Wembley, there was a calculation behind Forsell's decision to name a less experienced line-up.\nBella Sykes was included for a debut against her old club, Sam Hulme returned in the halves, while Methley Warriors' Tilly-Jae Brown, Oulton Raidettes' Alice Costello and Illingworth's Angel Bentley stepped up from the academy.\nThe Rhinos made a slow start as Brown scored twice to build an 8-0 lead for the Giants, which was eventually wiped out when Sykes and then Tasha Gaines scored.\nTries were traded for the rest of the second half, as tries for Emma Wilkinson and Brown - for her hat-trick - were counter-balanced by Bentley and Jasmine Earnshaw-Cudjoe scores, but goal-kicks proved the difference as the Giants took the spoils.\nHaving seen just how competitive Wigan could be in their Challenge Cup semi-final with Leeds, St Helens paid plenty of respect for their derby with the Cherry and Whites with a strong squad, and it was a justified call from Matty Smith as the Saints were pushed hard, scoring the first-half tries they needed and doing enough to keep the Warriors at bay in the second.\nWithout captain Jodie Cunningham and England team-mate Emily Rudge, the onus was on half-back leader Gaskin and other senior players such as Shona Hoyle, Zoe Harris and Tara Jones to steady the ship.\nWigan showed they are becoming a competitive outfit with their display, notably to keep Saints out in the second period, with Vicky Molyneux making big tackles and Laureane Biville showing an attacking threat.", "url": "https://www.bbc.com/sport/rugby-league/66426663"}