{"authors": ["Matt Gault", "www.facebook.com"], "date_download": "2025-05-21 07:08:25", "date_modify": "2025-05-21 07:08:25", "date_publish": "2025-01-31 06:44:14", "description": "BBC Sport NI profiles Simon Easterby as he prepares to lead Ireland into the 2025 Six Nations as interim head coach.", "filename": "sport_rugby-union_articles_cx2k5n5kgxlo_1747811305.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ad1a/live/94d7e8d0-df45-11ef-b6f9-ad737e9c8645.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cx2k5n5kgxlo_1747811305.html", "title": "The 'rugby student' stepping up to lead Ireland", "title_page": "Six Nations 2025: The 'rugby student' stepping up to lead Ireland's hat-trick bid - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ken Owens can still remember one of his first encounters with Simon Easterby.\nLong before he was Wales captain and a starting British and Irish Lions hooker, Owens was a fresh-faced graduate from the Scarlets academy in 2005.\nBy then, Easterby was already club captain, an established Ireland international and a starting Lions back row. No better man, then, to introduce Owens to the intensity of the senior game.\n\"One of my first contact sessions, I was jackalling in a ruck and I got cleaned out as if it were a World Cup final,\" recalls Owens.\n\"He was competitive in everything he did; diligent, professional. It rubbed off on me. He was the go-to man.\n\"He always had a presence about him. He led by example and was the figurehead at the club at that time. When I went on to become a captain later in my career, I took a lot from the way he captained the side as well.\"\nTwenty years on, Easterby is still leading by example. On Saturday, the 49-year-old will take charge of Ireland for the first time, having been appointed interim head coach while Andy Farrell is seconded with the British and Irish Lions.\nHis playing and coaching career to this point paints a portrait of a man who will not be overawed by the prospect of stepping into Farrell's shoes.\nBorn in Yorkshire, Easterby comes from a sporting family. His mother, Katherine, was an Irish hockey international from Blackrock in Dublin while his father, Henry, was related to the Easterby horseracing dynasty from Yorkshire.\nHe was educated at Ampleforth College, a prestigious Catholic boarding school in North Yorkshire. It was there that, despite a love of cricket, Easterby set a course towards a career in rugby.\nAfter leaving school, Easterby spent some time in Australia and played for Harrogate - alongside his brother Guy, another future Ireland international - and Leeds before moving to Llanelli in 1999.\nBy the time he left Scarlets in 2014, he had amassed more than 200 appearances, spent five years as captain and another five as coach, first overseeing the defence before taking the top job in 2012.\nOperating on the blind side of the scrum, he sustained more than his fair share of knocks, from an Achilles rupture and a broken nose, to being knocked out cold in the 2006 Powergen Cup final following a collision with London Wasps full-back Mark van Gisbergen.\nWhile playing alongside him, Owens saw in Easterby not only a hard-as-nails leader but a man destined for a fruitful coaching career.\n\"He always spoke and communicated well - he had the aggression that came naturally to him, but he was a student of the game as well,\" said Owens, who retired in 2024 after a career that yielded 91 Wales caps and five Lions Test appearances.\n\"He understood rugby. As a player, the way you turned the ball over, making decisions around contact area and was very good in the line-out.\n\"I think you see some players who go into coaching and see the game really easily and he's always had that. It's no surprise he's been successful as a coach.\"\nEasterby became a legend in Welsh club rugby, but he also forged a pretty decent career in green.\nHaving turned down Clive Woodward's invitation to play for England, he chose Ireland. He won 65 caps, and by the time he announced his retirement on St Patrick's Day in 2008, he was the country's most-capped flanker.\nHe made his debut against Scotland in the 2000 Six Nations, one of five new faces - alongside Ronan O'Gara, Peter Stringer, Shane Horgan and John Hayes - introduced by Ireland boss Warren Gatland in a shake-up after a 50-18 thumping by England.\nEasterby played the full game, which Ireland won 44-22, and was retained at blind-side flanker for the remainder of the championship.\nHe wasn't always a guaranteed starter, though. At the 2003 World Cup in Australia, he was on the fringes of Eddie O'Sullivan's side, but became a success story in an otherwise familiar tale of Irish woe that ended in a quarter-final exit.\nFrom there, Easterby became one of O'Sullivan's most trusted on-field lieutenants.\n\"He was a physical and powerful athlete, as you'd expect from a back row, but you could see he was one of the smarter ones,\" says Chris Henry, one of Easterby's successors in the Irish back row.\n\"He was part of that class back-row era with Denis Leamy, David Wallace and Neil Best.\"\nTwo years after the World Cup, O'Sullivan handed him the captaincy for the 2005 autumn series following injuries to Brian O'Driscoll and Paul O'Connell.\nThat was an especially big year for him. In addition to seizing his Lions chance - which came after fellow Ampleforth College alum Lawrence Dallaglio's injury - he also married Sarra Elgan Rees, the television presenter and daughter of former Wales international Elgan Rees.\nHaving served a long apprenticeship in the backroom team, Easterby has now been thrust into the spotlight.\nHe named his first team on Thursday, and while confidently fielding questions from reporters at Aviva Stadium, he pinpointed where he feels he has developed as a coach.\n\"I think as a young coach and a young head coach, as I was at a club, you are trying to do everything and every part of the game, and you end up not being able to see the wood for the trees,\" he explained.\n\"It's all-consuming, but over a period of time you realise what you can do and what you can share with other coaches. Over time you develop a feel for players, what they are going through and how you can support that and impact that.\n\"Yes, there are always technical and tactical things that you want to keep strong on your side, but I think it is those conversations you have with players and the chats that you have over a period of time that allows you to get a feel for that player.\n\"Then, hopefully, you can get the best out of them whether they are starting, on the bench or not involved at all.\"\nAnalysis, preparation, man-management. Easterby seemingly has a handle on these aspects of coaching. On Saturday, the world will find out how he copes with the rest.", "url": "https://www.bbc.com/sport/rugby-union/articles/cx2k5n5kgxlo"}