{"authors": ["Gary Rose", "www.facebook.com"], "date_download": "2025-05-20 13:22:01", "date_modify": "2025-05-20 13:22:01", "date_publish": "2023-07-26 07:03:59", "description": "Spain coach Jorge Vilda warns there is more to come from his side after they thrashed Zambia to progress to the last 16 of the Fifa Women's World Cup with a game to spare.", "filename": "sport_football_66290701_1747747321.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6843/production/_130519662_hermoso.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66290701_1747747321.html", "title": "Spain 5-0 Zambia: Big win sends Spain into last 16", "title_page": "Spain 5-0 Zambia: Big win sends Spain into last 16 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Spain coach Jorge Vilda warned there is more to come from his side after they thrashed Zambia to progress to the last 16 of the Fifa Women's World Cup with a game to spare.\nJenni Hermoso and Alba Redondo both scored twice as the Spanish secured a second successive win at the tournament in Australia and New Zealand.\nSpain have scored eight goals so far without reply, underlining their credentials as potential World Cup winners, but Vilda insists his side can play even better.\nSpain play Japan on Monday, 31 July (08:00 BST) in a game that will decide the Group C winner, and the Vilda said: \"We haven't seen the best version of Spain, that is absolutely clear.\n\"We have four days to improve, recover physically and mentally, and put in a better performance against Japan.\"\nSpain opened their campaign with a comfortable 3-0 win against Costa Rica last week, having a total of 46 shots on goal.\nThey picked up where they left off against Zambia, racing into a ninth-minute lead when Teresa Abelleira drove in a stunning strike from distance.\nHermoso doubled the lead just four minutes later, heading home a cross on her 100th appearance for her country.\nRedondo then rounded the goalkeeper in the second half before Hermoso scored her 50th international goal late on after a lengthy video assistant referee check.\nHermoso almost had a hat-trick soon after but her shot was pushed on to the crossbar, but Spain got their fifth when Redondo drove home in the final few minutes.", "url": "https://www.bbc.com/sport/football/66290701"}