{"authors": ["Jonty Colman", "www.facebook.com"], "date_download": "2025-05-20 14:34:17", "date_modify": "2025-05-20 14:34:17", "date_publish": "2023-07-28 18:36:08", "description": "All the drama and excitement from day two of the fifth Ashes Test at The Oval in digest format.", "filename": "sport_cricket_66336532_1747751657.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5449/production/_130577512_gettyimages-1576492623.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66336532_1747751657.html", "title": "Ashes 2023: Stuart Broad's brilliance and Steve Smith's Superman dive", "title_page": "Ashes 2023: Stuart Broad's brilliance and Steve Smith's Superman dive - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England's hopes of drawing the Ashes hang in the balance after day two at The Oval.\nAfter a slow-scoring start to the day for Australia, they were reduced to 185-7 in their response to England's first-innings total of 283, before ending on 295 all out.\nHere are some of the best day two takeaways.\nEngland bowler Stuart Broad entered the Ashes history books early in the afternoon session when he removed Australia opener Usman Khawaja lbw.\nThe wicket was his 150th in Tests against Australia and in bringing up the milestone, Broad became just the third player to do so and the first Englishman, behind only Australian greats Shane Warne (195) and Glenn McGrath (157).\nA few deliveries later, Broad removed Travis Head on four to claim his 151st Ashes scalp, bowling alongside his fellow fast-bowling great Jimmy Anderson, who picked up his 690th Test wicket to remove Mitchell Marsh later in the afternoon.\nWhile both have featured in a similar number of Ashes matches, Anderson has bowled significantly more deliveries. Despite that, Broad has been the serial wicket-taker of the duo against Australia, warranting his nickname of 'Mr Ashes'.\nBroad's career bowling average in Ashes cricket is an impressive 28.81, with Anderson further behind on 35.4.\n\"Australia haven't tried to score. They have just sat in to bat a long period of time without remembering you have to put a bit of pressure on the bowlers. Try to show a little bit of intent. This morning I thought it's the worse I've ever seen Australia bat in my time watching them. They never play like that.\"\nFormer England captain Michael Vaughan did not hold back in his criticism of Australia's batters on day two. The tourists' defensive and slow approach to scoring runs almost came back to haunt them as a flurry of wickets in the afternoon session put England in the driving seat.\nIn the morning session, Australia's batters scored just 54 runs off 26 overs, a rate of 2.08 runs per over.\nRead more from Vaughan here.", "url": "https://www.bbc.com/sport/cricket/66336532"}