{"authors": ["Mark Mitchener", "www.facebook.com"], "date_download": "2025-05-21 03:45:00", "date_modify": "2025-05-21 03:45:00", "date_publish": "2025-04-06 15:18:41", "description": "All you need to know about promotion, relegation and qualification for Europe in England and Scotland's top men's football leagues, and the Women's Super League.", "filename": "sport_football_articles_c5yr0n82jgko_1747799100.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7c07/live/17c43bd0-2826-11f0-8c66-ebf25fc2cfef.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c5yr0n82jgko_1747799100.html", "title": "Premier League, WSL, EFL, Scottish football: Ups, downs & European qualification", "title_page": "Premier League, WSL, EFL, Scottish football: Ups, downs & European qualification - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Liverpool clinched the Premier League title on 27 April with a 5-1 win over Tottenham at Anfield.\nThe top five teams are guaranteed qualification for the league phase of the Champions League - with Arsenal's win over Real Madrid on 8 April making certain that England will be one of the two associations with the highest Uefa coefficients for 2024-25, and clinching a fifth place in addition to the usual four.\nLiverpool and Arsenal are assured of their Champions League places, with the other three spots between Newcastle, Chelsea, Aston Villa, Manchester City and Nottingham Forest.\nThe winner of the Europa League - Manchester United or Tottenham - will qualify for the league phase of the Champions League as an additional (sixth) English team, regardless of their Premier League finishing position.\nThe sixth-placed Premier League team will qualify for the league phase of the Europa League, along with FA Cup winners Crystal Palace.\nNewcastle United's victory in the Carabao Cup final means that at worst they will qualify for the Conference League play-off round. But if they qualify for Europe by their league position, that Conference League spot will revert to the league and go to the seventh-placed team.\nIf Chelsea win the Conference League but fail to reach the Champions League, they will qualify for the league phase of the Europa League.\nThe bottom three teams are relegated to the Championship. Southampton became the earliest team to be relegated (in terms of games) in Premier League history when they lost 3-1 at Tottenham on 6 April. They were joined by Leicester City on 20 April after their 1-0 defeat by Liverpool, and Ipswich Town on 26 April after a 3-0 loss at Newcastle.\nBirmingham City became the first team in England's top five divisions to be promoted when they won 2-1 at Peterborough on 8 April, and clinched the title without kicking a ball four days later as Wrexham drew 0-0 at Wigan. Wrexham made sure of the second automatic promotion place on 26 April when they beat Charlton 3-0.\nIn the play-off final for the third promotion place, Leyton Orient face Charlton Athletic on 25 May.\nThe bottom four teams are relegated to League Two. Shrewsbury Town's relegation was confirmed on 18 April because of Burton's 0-0 draw at Exeter, Cambridge United joined them on 26 April after losing 2-1 at Burton, while Burton then sent both Bristol Rovers and Crawley Town down by drawing 1-1 with Wigan on 29 April.", "url": "https://www.bbc.com/sport/football/articles/c5yr0n82jgko"}