{"authors": ["Nick Hope", "www.facebook.com"], "date_download": "2025-05-19 15:25:58", "date_modify": "2025-05-19 15:25:58", "date_publish": "2015-02-26 06:43:03", "description": "Paralympic champion Kelly Gallagher's guide Charlotte Evans misses the Para-alpine World Championships with concussion.", "filename": "sport_disability-sport_31635087_1747668358.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81249000/jpg/_81249244_47599ccb-292c-4420-aaf8-fb303941d0c2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_disability-sport_31635087_1747668358.html", "title": "Kelly Gallagher's guide Charlotte Evans misses Para-alpine Worlds", "title_page": "Kelly Gallagher's guide Charlotte Evans misses Para-alpine Worlds - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Paralympic champion Kelly Gallagher's guide Charlotte Evans will miss the 2015 Para-alpine World Championships because of concussion.\nVisually impaired skier Gallagher will train alongside coach Ross Green in the hope they can race together in Canada.\nEvans collided with Gallagher in training last month.\n\"We don't want to rush her back and risk complications,\" British performance director Duncan Freshwater said.\nThe IPC Alpine Skiing World Championships take place from 28 February to 10 March in Panorama.\nGallagher - who won Britain's first-ever Winter Paralympic gold medal in Sochi last year with Evans - revealed details of January's crash in Austria earlier this month.\nEvans - a former British ski racer - is said to be showing signs of improvement but not to an extent where she can consider returning to the slopes.\n\"We have been advised that she needs a little longer to recover,\" Freshwater told BBC Sport.\n\"Charlotte is one of the best guides in the world and it is a huge loss to the team, but the most important thing is for her to recover 100%.\"\nGallagher and coach Green - who finished 15th in the combined event for Team GB at the 2002 Winter Olympics - qualified to compete in Canada by racing together in Italy last week.\nThey won a Europa Cup race, albeit in a weakened field of just two pairs of athletes.\nThe duo are likely to enter all five disciplines in Panorama.", "url": "https://www.bbc.com/sport/disability-sport/31635087"}