{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:28:42", "date_modify": "2025-05-21 05:28:42", "date_publish": "2025-01-14 15:23:33", "description": "Luton Town fans have their say on the appointment of Matt Bloomfield as their new manager.", "filename": "sport_football_articles_cy48g138ke4o_1747805322.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0124/live/c23c6ab0-0914-11ef-82e8-cd354766a224.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy48g138ke4o_1747805322.html", "title": "Matt Bloomfield: Is new Luton Town boss right man for Hatters?", "title_page": "Matt Bloomfield: Is new Luton Town boss right man for Hatters? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Luton Town have named Matt Bloomfield as their new manager.\nHe has led Wycombe Wanderers to second place in League One and is now charged with hauling the Hatters clear of the Championship relegation zone.\nIs he the right choice to replace Rob Edwards?\nYou can have your say here.\nHere are some of the views from fans:\nSoulsUnknown - Excellent news for Luton. Let's hope he can kick start our season. COYH\nSimon - The irony would be if Luton go down and Wycombe go up.\nWhathojeeves - Good, no messing about with the appointment. Now Matt get to it and have the Kenny rocking again.\nGabs99 - I think he might regret not finishing the project at Wycombe. If they got promoted his stock would have been higher for a better job in the summer.\nNeil - is this a good choice? Personally I don't know because of the other names being bandied about, this is the dark horse. To Wycombe, all I can say is, good luck for the rest of the season, and who knows, may be seeing you next season.\nDan - This is a very cheap appointment indeed, the hierarchy didn't need to do this, they have the money and they should have gone for Championship experience (Steve Cooper) or (O'Neill) someone who knows the division and knows how to get them out of a relegation fight. This is an extremely underwhelming appointment indeed and unproven too which only highlights the board's lack of knowledge.", "url": "https://www.bbc.com/sport/football/articles/cy48g138ke4o"}