{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:24:02", "date_modify": "2025-05-21 06:24:02", "date_publish": "2025-01-31 12:52:07", "description": "Cardiff City: Manolis Siopis confirms exit with heartfelt message", "filename": "sport_football_articles_czj301ygrzvo_1747808642.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f837/live/b777dee0-dfd1-11ef-a108-5b0fc408bc51.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_czj301ygrzvo_1747808642.html", "title": "Cardiff City: Manolis Siopis confirms exit with heartfelt message", "title_page": "Cardiff City: Manolis Siopis confirms exit with heartfelt message - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manolis Siopis has confirmed his imminent Cardiff City departure with a heartfelt message for the club's fans.\nThe Greece midfielder, 30, is set to return to his homeland with official confirmation of his permanent transfer to Panathinaikos expected on Friday.\nAfter a bright start to his Cardiff career following his move to south Wales in 2023, Siopis has featured less regularly of late.\nBut he remains a big hit with the club's supporters thanks to his colourful personality and combative attitude on the pitch.\nWriting on Instagram, Siopis said: \"It's been an incredible experience playing for Cardiff City, and I feel truly blessed to have shared so many beautiful moments with you.\n\"I want to take a moment to express my heartfelt gratitude to the amazing fans for your unwavering love and support. A huge thank you to my team for making my dream of playing in such a competitive league a reality.\n\"A special thanks to everyone at the club - the staff, coaches, board members, and everyone working behind the scenes - your hard work and dedication make this club special.\n\"Wishing you all the best! May the team reach new heights, overcome every challenge, and continue making the fans proud. I'll always be cheering you on, and who knows - maybe our paths will cross again someday.\"", "url": "https://www.bbc.com/sport/football/articles/czj301ygrzvo"}