{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:22:27", "date_modify": "2025-05-21 06:22:27", "date_publish": "2025-03-31 14:20:01", "description": "Alan Philpott will face Lewis McGrillen in the co-main event at the PFL Europe fight night in Belfast on 10 May.", "filename": "sport_mixed-martial-arts_articles_c985y4k088zo_1747808547.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/fe29/live/ea6f06a0-0e2c-11f0-b851-29ea4ea8a4cd.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_mixed-martial-arts_articles_c985y4k088zo_1747808547.html", "title": "PFL Europe Belfast: Alan Philpott to face Lewis McGrillen in co-main event at PFL Belfast", "title_page": "PFL Europe Belfast: Alan Philpott to face Lewis McGrillen in co-main event at PFL Belfast - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Alan Philpott will face Lewis McGrillen in the co-main event at the PFL Europe fight night in Belfast on 10 May.\nThe Ballymena native will fight on the same card as Paul Hughes, who takes on Bruno Miranda at SSE Arena.\nThe 32-year-old believes he is ready for Manchester's McGrillen, who has lost just once in his 12 professional fights.\n\"I've got the perfect style I believe to counter McGrillen. He's a tough fighter, he's going to come and push the pace from the start, I've got to be fit, smart and switched on at all times,\" Philpott said.\n\"He has got the power, the left hand that could put me away at any time, but whenever I face someone like that it excites me, and I will excel and show the best performance of my career.\"\nPhilpott has a professional record of 21-16 and last fought in February, when he defeated Tomoya Hirakawa in Australia.\nAfter training in Ballymena alongside Norman Parke, Greg Loughran and the UFC's Rhys McKee, he moved to Liverpool to work with Dean Garnett.\nMcGrillen was the 2024 PFL Europe Bantamweight champion, knocking out Alexander Luster in the second round to win the title in Lyon, France in December.\nTen of the 24-year-old's 11professional wins have come by KO/TKO, including stopping Garnett in a thrilling semi-final of the PFL tournament.\nHe trains under Carl Prince at Manchester Top Team alongside UFC's Lerone Murphy.", "url": "https://www.bbc.com/sport/mixed-martial-arts/articles/c985y4k088zo"}