{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:48:11", "date_modify": "2025-04-26 07:48:11", "date_publish": "2025-02-26 22:58:37", "description": "After Larne got the better of Loughgall 4-1 draw at Lakeview Park, BBC Sport NI got the views of Inver Reds boss Gary Haveron and the host's first-team coach Daniel Wright.", "filename": "sport_articles_clyrrnp33jyo_1745653691.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2b6c/live/dcce27d0-f494-11ef-839b-6909acee4532.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_clyrrnp33jyo_1745653691.html", "title": "Larne pleased to be back among the goals - reaction", "title_page": "Larne pleased to be back among the goals - reaction - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "After Larne got the better of Loughgall 4-1 draw at Lakeview Park, BBC Sport NI got the views of Inver Reds boss Gary Haveron and the host's first-team coach Daniel Wright.\nHaveron on the result:\n\"It's never easy to come down here, it's a really difficult place to come down and play.\n\"You just see the results, everyone struggles down here, there's usually just the odd goal in it.\n\"So to win 4-1 was very pleasing, to get the goals we've been lacking was pleasing. Job done and we get up the road.\"\nOn going fifth in the table, still with games in hand:\n\"At one point had we won our games in hand we'd have been up there challenging at the top of the table.\n\"It's getting over the line and getting the games won. We go to Ballymena on Saturday, a really tricky play to go and play, it's another grass pitch probably not in the best condition because of the atrocious weather we've had.\n\"It's going to be another really difficult game where we'll have to go and grind out a result.\"\nWright on the defeat:\n\"We just lost our way in the second half. We played to their strengths, allowed them to get on the ball a bit more. They found spaces in behind us and we never really recovered.\n\"We're really disappointed because we honestly believed there was a chance there tonight. It hasn't worked out for us and it's frustrating.\"\nOn conceding five minutes into the second half\n\"That's the story of our season, we've conceded goals at awful times of the game.\n\"It's never a good time to concede but when you're coming out at the start of the second half, you want 10 or 15 minutes to get a feel for it and get to grips with the game.\n\"On too many occasions we haven't allowed ourselves to do that.\"", "url": "https://www.bbc.co.uk/sport/articles/clyrrnp33jyo"}