{"authors": ["Tasnim Chowdhury", "www.facebook.com"], "date_download": "2025-05-21 07:29:25", "date_modify": "2025-05-21 07:29:25", "date_publish": "2025-01-13 15:07:46", "description": "Ruud van Nistelrooy press conference: Leicester City vs Crystal Palace", "filename": "sport_football_articles_c99yrxk4x3go_1747812565.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5111/live/1ef9d430-d1c0-11ef-94cb-5f844ceb9e30.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c99yrxk4x3go_1747812565.html", "title": "Ruud van Nistelrooy press conference: Leicester City vs Crystal Palace", "title_page": "Ruud van Nistelrooy press conference: Leicester City vs Crystal Palace - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "On team news, Van Nistelrooy said there is \"no news on injuries\". Jannik Vestergaard was part of team training on Monday and Leicester expect him to be in Wednesday's squad.\nOn their FA Cup fourth round draw against Manchester United: \"I was hoping for a home game against a team in a league below us maybe, or two. But then the first team that got [drawn] out was United and then we were second. It is going to be the third time. It's going to be Manchester United and Leicester in three different competitions so, special. Also special to go back there, that's for sure.\"\nLeicester have been linked with Parma defender Woyo Coulibaly, but Van Nistelrooy said \"we cannot confirm any news on any new player, so let's see how things develop\".\nOn the transfer window: \"The most important thing is from the conversations in December that we've had before I signed – we're aligned with that. It's clear what is possible and what's not. We are aligned and in the process looking to strengthen but it has to be the right one. As I said before it's a responsibility to get the right players in within the possibility so that's the main thing.\"\nOn the pressure as Leicester manager: \"The pressure is fantastic. You have to embrace it and be happy to be able to show what you've got as an individual, as a team in these key moments. Every second we're in this league, we have to be ready and happy that we're there and that we're competing, that we can show who we are. It's a fantastic challenge these two home games.\"\nOn whether Leicester are good enough to stay up: \"It's not a maybe. I see the characteristics and qualities in players that are there. That is the most important thing. When I first signed, I believed it was possible with this squad to stay in. We need luck. Losing Mads [Hermansen] and Abdul Fatawu were big blows but we have to adjust and find ways. We've shown over the past six weeks that we're making the steps in the right direction to make sure performances get turned into points.\"\nOn Crystal Palace: \"A game of football is never the same. I look at their squad, I look at their players and the qualities they have within the team, from back to front and that is a very good Premier League side. We have to be aware of that. Very strong centre-backs and very good wing-backs, players up front that can change the game in a matter of seconds. It's going to be a tough one for us. We want to compete, do well, show what we're about in our way and it's a good challenge for Wednesday.\"", "url": "https://www.bbc.com/sport/football/articles/c99yrxk4x3go"}