{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:34:49", "date_modify": "2025-04-26 04:34:49", "date_publish": "2025-02-28 12:46:51", "description": "Newcastle v Brighton preview: 'Magic of FA Cup lives on' - Welbeck", "filename": "sport_football_articles_cm2ddjz3mlno_1745642089.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4bbd/live/131a97c0-f5cf-11ef-85ee-0589f92b739a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cm2ddjz3mlno_1745642089.html", "title": "Newcastle v Brighton preview: 'Magic of FA Cup lives on'", "title_page": "Newcastle v Brighton preview: 'Magic of FA Cup lives on' - Welbeck - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Two-time FA Cup winner with Arsenal Danny Welbeck says his Brighton side have a \"great opportunity\" to reach the quarter-final of the competition when they travel to Newcastle on Sunday in the fifth round.\nThe Seagulls have reached the semi-final twice in the past six years - most recently losing on penalties to Manchester United in 2023 - and will have hopes to go futher and win the club's first ever major trophy.\n\"It's a great opportunity, it's a great cup tie to be involved in,\" Welbeck told BBC Radio Sussex.\n\"We at Brighton are pushing and want to be involved in these type of games. We've got one to look forward to this weekend.\n\"It's going to be a really difficult game but one that we are going to work our socks off for like we have done these past few weeks and try and progress to the next round.\n\"To win the FA Cup is massive, I've done that more than once. It's great, I like the FA Cup, I really enjoy it. From growing up as a young boy and watching the FA Cup and all these special memories and special moments - it's a great to be a part of. The magic of the FA Cup lives on.\"\nBrighton travel to the north east to face Eddie Howe's side who will have one eye on the Carabao Cup final in March. The Magpies are on a run of three losses in their past four Premier League matches.\n\"Newcastle are a really tough side to play against but we've been there and already have the experience of playing in front of the crowd there at St James' Park,\" Welbeck added.\n\"We know the atmosphere is going to be special. It's going to be ramped up even more but we're going to be prepared.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cm2ddjz3mlno"}