{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:57:17", "date_modify": "2025-05-21 03:57:17", "date_publish": "2025-04-07 12:50:56", "description": "Arsenal see off Real Madrid to reach the Champions League semi-finals - ensuring the top five finishers in the Premier League will qualify for next season's competition.", "filename": "sport_football_articles_c1kjdpmdyx9o_1747799837.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5a11/live/867afc10-1b17-11f0-9468-51959e310ca6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c1kjdpmdyx9o_1747799837.html", "title": "Champions League semi-finals: preview, fixtures & route to the final", "title_page": "Champions League semi-finals: preview, fixtures & route to the final - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Arsenal booked their place in the Champions League semi-finals with victory over Real Madrid on Wednesday.\nThe Gunners took a 3-0 lead into the second leg before winning 2-1 in Madrid to seal a 5-1 aggregate triumph.\nAston Villa, meanwhile, had their dreams ended despite an impressive fightback after defeat by Paris St-Germain - who will face Arsenal in the semis - on Tuesday.\nIn the other quarter-final ties, Barcelona reached the semi-finals with a 5-3 aggregate win against Borussia Dortmund, who won the second leg 3-1, while Inter Milan beat Bayern Munich 4-3 on aggregate after drawing the second leg 2-2.\nHighlights of every Champions League game are available on BBC iPlayer and the BBC Sport website and app.\nEngland are top of the coefficient table and Arsenal's win over Real ensured the Premier League would get an extra spot in the Champions League.\nThat means the top five in the Premier League will all play in next season's Champions League. However, there could be seven English teams if Arsenal win the competition, but finish outside the top five in the Premier League, which is unlikely, and either Manchester United or Tottenham win the Europa League.\nThe second additional Champions League spot is likely to go to either Italy's Serie A or Spain's La Liga, although Germany's Bundesliga still has an outside chance of getting the extra place.", "url": "https://www.bbc.com/sport/football/articles/c1kjdpmdyx9o"}