{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:45:24", "date_modify": "2025-05-19 14:45:24", "date_publish": "2017-07-14 00:00:00", "description": "Chris Morris and Vernon Philander rebuild after South Africa fell from 179-2 to 235-6 on the first evening of the second Test at Trent Bridge.", "filename": "sport_live_cricket_38520661_1747665924.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_live_cricket_38520661_1747665924.html", "title": "England v South Africa, second Test, first day, Trent Bridge", "title_page": "England v South Africa, second Test, first day, Trent Bridge - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Goodbye...\nAn intriguing day of old fashioned Test match cricket then, which has left the match nicely poised at the close on day one.\nMake sure you join us tomorrow at 10.30am (BST) for day two when we'll most likely see how England handle the pitch.\nPost\nMichael Vaughan\nEx-England captain on BBC Test Match Special\nIt was a momentum change in the day when England brought Dawson on. South Africa thought 'this is an opportunity' and then it puts pressure on the seamers.\nI don't know what this issue is with Moeen Ali he is bowling better than I have seen him.\nPost\nMichael Vaughan\nEx-England captain on BBC Test Match Special\nI think England did bowl too short. The drives that went to the boundary went square so they were full but too wide. I don't think the bowlers hit off stump often enough.\nThis partnership has given South Africa the day. I would much prefer to be in their shoes.\n'We will be in with a chance tomorrow'\nEngland wicketkeeper Jonny Bairstow: \"It is pretty even. We would have taken that last session. They were in front at tea so we will take four wickets in the final session. We will be in with a chance in the morning. The ball didn't do as much in the afternoon as the morning. We had some luck and needed it.\n\"We were going to bowl anyway. Last time we played here we bowled bowled pretty well. They applied themselves well and credit to them.\"\nAsked if the England bowlers bowled too short: \"I don't think so. We were trying to attack off stump. If you pitch it up too much you get driven for four.\"\nAnd asked about his catch: \"It is something I have been working on so I am delighted to catch one down the leg side.\"\nPost\nSummed up well by Michael Vaughan, really. England fought back well after lunch although a number of South Africa's middle order batsmen gave their wickets away rather than being undone by rip snorting deliveries.\nBatting certainly got easier as the day wore on. England can take comfort from the fact that they managed to nip out Hashim Amla for 78 given his propensity to make a big hundred when well set.\nPost\nMichael Vaughan\nEx-England captain on BBC Test Match Special\nIt has been a good day for South Africa. It started in a positive sense in winning the toss and batting first. Kuhn played nicely and Amla was at his solid best. In the afternoon it looked like they would post a big score but then the collapse after tea and the comeback from England. This partnership is 74 and they have just played sensibly.\nClose of play - SA 309-6\nPhilander 54 Morris 23\nBen Stokes forces Chris Morris to play with a peach of a delivery to Chris Morris first up which nips away without finding the edge. Gasps from Jonny Bairstow behind the stumps.\nSouth Africa are able to milk a couple of singles to leave Morris on strike for the final deliver.\nThe crowd cheer Stokes into the crease for the last ball of the day and this time it finds the edge of Morris' bat but it falls short of the slip cordon.\nPost\nGraeme Swann\nEx-England spinner on BBC Test Match Special\nThe spinners have done a job but they have come on not expecting to take wickets. They have not bowled badly.\nDawson puts it there or there abouts but doesn't really spin it. Moeen should have bowled more after last week.\nBroad's figures are excellent. They could have pitched it up a yard further but I thought South Africa batted well this morning.\nSA 295-6\n86 overs\nIt looks like there are no real demons in this pitch now. Vernon Philander has made this look relatively easy and even feels confident enough to play a few strokes against Stuart Broad despite it being late in the day.\nBroad's first ball is biffed through the covers off the back foot by Philander. Two balls later he punches the ball down the ground and he and Chris Morris run three.\nA weary Broad grunts through his final two deliveries.", "url": "https://www.bbc.com/sport/live/cricket/38520661"}