{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:09:11", "date_modify": "2025-05-20 13:09:11", "date_publish": "2023-08-02 11:38:44", "description": "Finn Russell will captain Scotland for the first time against France at Murrayfield on Saturday, with Jamie Ritchie ruled out with a minor injury.", "filename": "sport_rugby-union_66381103_1747746551.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/15D07/production/_130615398_20807157.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-union_66381103_1747746551.html", "title": "Scotland v France: Finn Russell takes on captaincy, with Jamie Ritchie absent", "title_page": "Scotland v France: Finn Russell takes on captaincy, with Jamie Ritchie absent - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "\"Infectious competitiveness\" and strong leadership skills make Finn Russell an ideal choice to captain Scotland, head coach Gregor Townsend suggests.\nWith a minor injury ruling out Jamie Ritchie, the fly-half is given the honour for the first time against France at Murrayfield on Saturday as he earns a 70th cap.\n\"He has always been a leader for us in terms of attack,\" Townsend explained. \"He has obviously got older, got more experience and it's the right time to give him that opportunity.\"\nRussell's promotion to captain comes less than 10 months after Townsend left the 30-year-old out of his initial squad for the 2022 autumn series.\nThe Bath summer signing shone against New Zealand and Argentina when brought back into the fold in November and carried that good form into the Six Nations, with Scotland finishing third.\n\"He's hitting that sweet spot after playing for 10-12 years in one position and against some of the best teams around,\" Townsend said. \"You get an understanding of where space might open up, what you can bring as a player.\n\"If you've got the physical side right too, then you can exploit those opportunities.\n\"He's really motivated about playing for Scotland and for playing club rugby for the next few years. If you can get that mix and he continues to improve, we have one of the best players in that position in the world with us.\n\"Finn is a very good connecter. He likes spending time with other people in the team and that's a really good way of leading. His knowledge of the game is very good and his competitiveness is infectious.\n\"He wants to win. He might be doing it with a smile, other times he's winding up the opposition or getting back for a tackle. We want our leaders prepared to put their bodies on the line, to work hard to help the team win.\"", "url": "https://www.bbc.com/sport/rugby-union/66381103"}