{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:40:26", "date_modify": "2025-05-21 07:40:26", "date_publish": "2025-02-11 00:00:00", "description": "Derby's are held to a goalless draw with Oxford United, as the Rams continue negotiations to bring in Blackburn head coach John Eustace as their new boss.", "filename": "sport_football_live_cwyp2ee9985t_1747813226.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cwyp2ee9985t_1747813226.html", "title": "Derby County 0-0 Oxford United: Rams draw as they close in on new boss John Eustace", "title_page": "Derby County 0-0 Oxford United: Rams draw as they close in on new boss John Eustace - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Derby County were held to a goalless draw with Oxford United as the Rams continued negotiations to appoint Blackburn head coach John Eustace as their new boss.\nThe 45-year-old is understood to be poised to take over as Rams boss, but was not spotted in the stands at Pride Park as Derby's hierarchy worked through the evening to try complete a deal to have him swap a promotion push with Rovers for a relegation battle with the East Midlands side.\nWhat he missed out on was an underwhelming draw that extended Derby's winless run to 10 matches across all competitions – although it was enough to lift them out of the drop zone on goal difference.\nChances were limited in a listless first half, although Siriki Dembele did force Derby's Jacob Widell Zetterstrom into a diving save from distance.\nLars-Jorgen Salvesen called Oxford goalkeeper Jamie Cumming into two saves in quick succession on the hour mark, while Marcus Harness wastefully headed over for the hosts soon after as Derby played out a second successive draw under interim boss Matt Hamshaw after ending a seven-match losing league run.\nThe draw leaves Oxford mid-table and comes after they suffered their first league defeat under ex-Rams boss Gary Rowett just a week earlier.\nAn unbeaten first month in charge of the U's – which was brought to an end by Burnley – earned Rowett the Championship manager of the month award for January.\nBefore the trip to Derby, Rowett joked that he hoped he would not win the gong \"because of the so-called curse\" – with a perceived trend that collecting the accolade precedes poor results.\nWhat he oversaw was a hard-fought draw against a side battling to avoid an immediate return to League One.\nAnticipation was high at Pride Park, with Eustace expected to be in attendance as the new Rams boss following more than 24 hours of negotiations with club chiefs after Blackburn \"reluctantly\" gave him permission to begin talks on Monday.\nOn the pitch, there were few first-half moments that roused the 25,999 spectators in the stands.\nNathaniel Mendez-Laing twice tested Oxford goalkeeper Jamie Cumming, while Kenzo Goudmijn dragged a shot wide for Derby and Dembele forced Zetterstrom into a diving save.\nOpportunities to break the deadlock remained scarce after the interval, with Salvesen doing well to direct an acrobatic effort on target, but his scissor-kick lacked any real power.\nThe Norwegian went on to test Cumming soon after with a header before Harness squandered what was the most gilt-edged chance afforded by ether side on a night dominated by resolute defensive performances.\nInterim Derby County boss Matt Hamshaw said:\n\"I'm disappointed and a bit frustrated. I probably felt a little like how the fans did - we were a bit passive, I thought we were a bit one-paced and thought we didn't take enough risks.\n\"I don't want to be too downbeat, we got a point and a clean sheet but I expect much better really. I know I'm a little bit negative, but I just have really high demands and really high expectations for the group.\n\"It doesn't feel like a great point at this moment in time, but tomorrow morning when I wake up and the lads come in and I see the league table, it might feel like a good point.\"\nOn Eustace's links to the job: \"It's probably been like every 28 hours at every football club. There is always rumours, always obstacles, always debate, always exactly this. Some people want a manger out, some people want a manager in. It's nothing new. That's football.\n\"Hopefully a new manager will be here [for Friday's match against QPR]. If he is, that's fantastic, and if he isn't rest assured I will try 100% to get the three points.\"\nOxford United boss Gary Rowett said:\n\"It was a difficult game, as we knew it would be. It was quite physical, which Derby tried to make it. It's a strength they have got.\n\"It was a game that lacked quality. I thought we got embroiled in a little bit of a fight and little bit of a scrap.\n\"It was disappointing from our perspective, having only lost to Burnley in 11 games we have shown a level of quality and today we didn't quite do that. But you also have to be respectful of the division and teams are fighting for their lives aren't they.\n\"The fact that the [manager of the month] curse didn't strike at Derby was also nice.\"", "url": "https://www.bbc.com/sport/football/live/cwyp2ee9985t"}