{"authors": ["Ffion Wynne", "www.facebook.com"], "date_download": "2025-05-21 06:17:53", "date_modify": "2025-05-21 06:17:53", "date_publish": "2025-01-14 05:24:05", "description": "Afghanistan cricketer Firooza Amiri criticises the ICC for what she says is a lack of support.", "filename": "sport_cricket_articles_c9d5l6lpq80o_1747808273.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5021/live/0057c530-d230-11ef-a41b-e3f126b8b955.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c9d5l6lpq80o_1747808273.html", "title": "Afghanistan cricketer Firooza Amiri says ICC 'did nothing' after national team fled", "title_page": "Afghanistan cricketer Firooza Amiri says ICC 'did nothing' after national team fled - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Afghanistan cricketer Firooza Amiri has criticised the International Cricket Council (ICC) for what she says is a lack of support after members of the women's national team had to flee to Australia.\nFemale participation in sport in Afghanistan has effectively been outlawed since 2021 when the Taliban returned to power.\nShortly after, more than 20 members of the country's national women's team fled the country.\n\"Cricket Australia have done more for us than the ICC have,\" Amiri told BBC Test Match Special during the second one-day international of the Women's Ashes in Melbourne.\n\"They have always pushed to keep hope alive for us. We've sent many messages asking for help because we've sacrificed so much to be here.\n\"We came to a new country as young people and we expected the ICC to do much more for us but they did nothing and we haven't heard from them since we have been here.\"\nIn a statement last week, the ICC said \"it remains closely engaged with the situation in Afghanistan\".\nAmiri had to leave many of her friends in Afghanistan but her parents were able to join her, and she had to learn English in order to get herself a job.\nThe team asked the ICC if they would be allowed to play as a refugee side when they first fled, which has not been approved.\nThey are playing in an exhibition match against a Cricket Without Borders XI before the Women's Ashes Test match in Melbourne on 30 January and Amiri hopes it can send a message to women who have lost their rights in her home country and around the world.\n\"Cricket can break boundaries, so we want to keep hopes alive - we want to play and educate,\" she added.\nThe Afghanistan women's team has gained more attention in recent weeks with UK politicians writing to the England and Wales Cricket Board (ECB) calling for England's men to refuse to play against Afghanistan in a Champions Trophy match in Lahore, Pakistan, on 26 February.\nThe ECB has also called on the ICC to act, as chief executive Richard Gould wrote to the global governing body to take action after what he called \"gender apartheid\".\nHe also called for Afghanistan's funding to be withheld until women's cricket is reinstated and support given to Afghan women's players.\nAmiri said she and her team-mates are \"proud\" of the Afghanistan's men's side, who have retained their full Test-match status from the ICC, and that she simply wants her own team to be able to play alongside them.\n\"There is one cricket ground in Afghanistan. The men's team came from nothing, they fought hard to be where they are today,\" said Amiri, who wants to continue playing cricket alongside a dream of becoming the first Afghan commentator on the game.\n\"I'm proud, but for us it is heartbreaking. It all comes down to the ICC, they have to recognise us as a team because we have a right to play too.\"", "url": "https://www.bbc.com/sport/cricket/articles/c9d5l6lpq80o"}