{"authors": ["Clive Lindsay", "www.facebook.com"], "date_download": "2025-04-26 04:38:53", "date_modify": "2025-04-26 04:38:53", "date_publish": "2025-02-28 09:51:55", "description": "Game of the weekend: Hibs v Hearts", "filename": "sport_articles_cwydd9dpg1go_1745642333.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a0b7/live/7e367df0-f5b9-11ef-8c03-7dfdbeeb2526.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cwydd9dpg1go_1745642333.html", "title": "Game of the weekend: Hibs v Hearts", "title_page": "Game of the weekend: Hibs v Hearts - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "After horrendous starts to the league season, Hibs stuck by their head coach while rivals Hearts changed theirs. Both strategies appear to have worked.\nWhen the sides drew 1-1 at Easter Road in October, three games after Neil Critchley succeeded the sacked Steven Naismith, they remained tied on points at the foot of the table, with Hibs bottom on goal difference.\nFew at the time would have fancied the chances of either finishing the season in third place.\nAfter Hibs won 2-1 at Tynecastle on Boxing Day, Hearts were still stuck in second bottom, while the visitors' win merely lifted them five points clear of the relegation play-off spot, albeit up to seventh.\nHowever, Sunday's derby has switched from being a relegation dogfight into a race to secure a place in the top half, with Hibs having moved up to fourth and Hearts to sixth - for the first time since August - after both enjoyed 3-1 wins in midweek.\nIndeed, both will have their sights set firmly on catching an Aberdeen side who have regained third spot after ending a dismal spell of their own but suffered a 5-1 thumping away to leaders Celtic on Tuesday.\nHearts, though, can ill-afford to slip up this time as they head to the other side of Edinburgh Castle, considering they are four points behind Hibs and Dundee United - and a further point adrift of the Dons.\nCritchley's side have suffered just one defeat - to second-top Rangers - in 12 outings and are seven unbeaten on the road.\nHowever, David Gray's hosts are on an even more impressive unbeaten run of 14, winning 10 of them, eight of those at Easter Road.\nA derby cracker would appear assured after Hibs and Hearts displayed their new-found resilience by coming back from a goal down to beat United and St Mirren, respectively, on Wednesday.\nWith seven goals in eight games since arriving on loan from Union Saint-Gilloise, striker Elton Kabangu has been instrumental in Hearts' mid-season push and will provide a stern test for the defensive stability that has been the foundation of Hibs' own recovery.", "url": "https://www.bbc.co.uk/sport/articles/cwydd9dpg1go"}