{"authors": ["Gary Rose", "www.facebook.com"], "date_download": "2025-04-26 07:25:49", "date_modify": "2025-04-26 07:25:49", "date_publish": "2025-02-27 23:07:52", "description": "Leicester boss Ruud van Nistelrooy insists his side are \"still in the fight\" to stay up despite suffering an 11th loss in 12 Premier League games at West Ham.", "filename": "sport_football_articles_ckgddxgwklpo_1745652349.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2c52/live/8437cae0-f55c-11ef-a8c3-ad1a8de32987.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_ckgddxgwklpo_1745652349.html", "title": "Van Nistelrooy vows Leicester 'still in the fight' to avoid drop", "title_page": "Van Nistelrooy vows Leicester 'still in the fight' to avoid drop - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Before Leicester City won the Premier League title in 2016, they pulled off one of the greatest of great escapes to avoid relegation to the Championship.\nA repeat of that looks very unlikely this time - even though their current situation is not as precarious.\nBack in 2014-15 they were rooted to the foot of the table for much of the season, only climbing off it in April as a run of seven wins from their final nine games took them to unexpected safety.\nBut this Leicester team look barely capable of winning one game, let alone going on a run of victories, as Thursday's 2-0 loss to West Ham left them five points adrift of safety.\n\"We are going to get up again,\" vowed boss Ruud van Nistelrooy after the game.\n\"We are still in this fight, mathematically we are there and we keep fighting as long as we can.\n\"It must be clear that the fight was only one half today and that is not enough.\"\nLeicester sacked Steve Cooper on 24 November with the club 16th after 12 league games, but the change has not had anywhere near the impact the Foxes would have hoped - and the statistics make for concerning reading:\nThe Foxes have lost 11 of their past 12 Premier League games (won one).\nIn his 14 games in charge, Van Nistelrooy has picked up just seven points, three fewer than previous boss Cooper managed this season (10 in 12 games).\nNo side has conceded more own-goals in the Premier League this season than Leicester (three, level with West Ham and Wolves).\nLeicester have also failed to score in each of their past four Premier League games, last doing so in February 2017 (a run of six).\nOn Leicester's struggles to score, Van Nistelrooy added: \"If you play like this in the first half you are not going to score. We were not even close to scoring.\n\"In the second half we were much closer to score. At least you give yourself an opportunity.\"\nIn Leicester's favour, however, is time.\nA five-point deficit is not insurmountable and they have 11 league games left - that's 33 points to play for.\nBut their upcoming run of fixtures looks tough with their next four games being trips to Chelsea and Manchester City and home matches against Manchester United and Newcastle.\nLeicester defender Wout Faes says the players still believe they can stay up.\n\"Of course, there has to be belief,\" the Belgian said.\n\"Weekend after weekend the games count down. I don't think we have to think too much about going forward.\n\"We just have to think game by game and we have to start winning very soon because the games are counting down.\"\nThose who have watched some of their recent games, however, are not so optimistic.\nFormer Leicester midfielder Neil Lennon said on TNT Sports: \"I hate to say it about any group of players but it is really hard to make a case for them on what we have seen.\n\"West Ham didn't have to be anywhere near their best to win the game comfortably. There was zero quality, zero belief and the game just seemed to pass them by.\"\n\"I think they are gone,\" added former Chelsea forward Joe Cole. \"I think them and Southampton are gone.\n\"How do you get these players to show some kind of spark from now to the end of the season?\"", "url": "https://www.bbc.co.uk/sport/football/articles/ckgddxgwklpo"}