{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:02:47", "date_modify": "2025-05-21 05:02:47", "date_publish": "2025-04-04 09:33:27", "description": "Everton condemn death threats made towards James Tarkowski and his family following the defender's tackle in Wednesday's Merseyside derby at Anfield.", "filename": "sport_football_articles_c4gr3ryxdpko_1747803767.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2df1/live/73ec5360-1157-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c4gr3ryxdpko_1747803767.html", "title": "Everton condemn death threats towards James Tarkowski", "title_page": "Everton condemn death threats towards James Tarkowski - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Everton have condemned death threats made towards James Tarkowski and his family following the defender's tackle in Wednesday's Merseyside derby at Anfield.\nTarkowski was booked for a robust challenge on Liverpool midfielder Alexis Mac Allister, but the Premier League's refereeing body later said he should have been sent off.\n\"Everton Football Club is aware of threats made towards James Tarkowski and his family on social media. Such behaviour is completely unacceptable and has no place in football or society,\" read a Toffees statement.\n\"The club is liaising with James and his wife Samantha, and stands ready to engage with the social media companies and assist the police with any potential investigation.\n\"Everton strongly condemns any form of online or offline intimidation, threats or abuse directed at players, staff or their families.\"\nTarkowski's wife Samantha said the abuse was \"beyond disgusting\" in an Instagram post.\n\"The level of abuse my husband is receiving wishing death on him, vile comments about me, about us as a couple and about him as a person is beyond disgusting,\" she said.\n\"People forget that he is more than just a footballer. He is a husband, a son, a brother, a friend and most importantly the father of our two children.\n\"Football is a sport, but the way some so-called fans behave is disgraceful. The abuse, the threats - it's not passion, it's pathetic. We're real people and this goes far beyond football.\"\nTarkowski was seen speaking to Mac Allister on the pitch at the final whistle and said the Argentina international had accepted his apology.\n\"I spoke to him and apologised because it was not a great tackle,\" he told Premier League Productions.\n\"When the ball fell between us I thought he was going to come and was expecting it to be a big old school 50-50 challenge. But he pulled out of the tackle and as I lunged, followed through and in, I caught him pretty high.\n\"I've apologised to him and he accepted it, so not a great one from me.\"", "url": "https://www.bbc.com/sport/football/articles/c4gr3ryxdpko"}