{"authors": ["Gareth Vincent", "www.facebook.com"], "date_download": "2025-05-21 05:48:38", "date_modify": "2025-05-21 05:48:38", "date_publish": "2025-01-31 13:55:12", "description": "Luke Williams says he will not \"run for cover\" as Swansea City look to end their miserable run when they host Coventry City on Saturday.", "filename": "sport_football_articles_c2l0vg2e9evo_1747806518.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/aca5/live/5d655430-dfd3-11ef-a108-5b0fc408bc51.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c2l0vg2e9evo_1747806518.html", "title": "Swansea City: Luke Williams 'won't run for cover' in bid to end poor run", "title_page": "Swansea City: Luke Williams 'won't run for cover' in bid to end poor run - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Luke Williams says he will not \"run for cover\" as Swansea City look to end their miserable run when they host Coventry City on Saturday.\nSwansea have endured a dreadful January, taking only one point from five league games – which included a heavy defeat in the south Wales derby – as well as exiting the FA Cup.\nThe slump in form has seen Swansea drop from ninth in the Championship to 17th, while they are also having to deal with the shock loss of long-time club captain Matt Grimes.\nWhile he acknowledges this has been a difficult spell, Williams says he is \"more than happy to embrace the challenge\".\n\"If I came here and only wanted to be the head coach when things were going well… you don't deserve the job,\" the Swansea head coach said.\n\"It is extremely tough because it's my entire life. Every waking moment - and most of the sleeping ones I think - is absolutely consumed with Swansea City Football Club.\n\"I am certainly not going to run for cover. I cannot wait for good times again and I look forward to deserving [to hear] the fans singing my name. I love that - there's nothing better - but you need to earn it.\"\nSwansea moved to within four points of the Championship play-off places courtesy of back-to-back home wins at the end of December.\nBut their form since has collapsed, scoring just three goals and conceding 18 during January.\nThe Swans were though unfortunate to lose their most recent home game, when Harry Darling was sent off against Sheffield United, and Williams has \"full confidence\" that their form will turn around.\nWilliams pointed to the struggles this season of Manchester City and Manchester United as evidence that \"all clubs suffer\".\nBut he added: \"Certainly we have to be able to withstand the pressure. We have to come out fighting and be able to give everybody that loves this club a boost.", "url": "https://www.bbc.com/sport/football/articles/c2l0vg2e9evo"}