{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:19:05", "date_modify": "2025-05-19 15:19:05", "date_publish": "2015-02-13 12:31:30", "description": "Cheltenham Town's first game after Paul Buckle's departure ends in a home loss to play-off chasing Bury.", "filename": "sport_football_31423501_1747667945.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/58194000/jpg/_58194818_football-464x261.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31423501_1747667945.html", "title": "Cheltenham Town 1-2 Bury", "title_page": "Cheltenham Town 1-2 Bury - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cheltenham Town's first game after Paul Buckle's departure ended in a loss to play-off chasing Bury.\nBoss Buckle left by mutual consent on Friday, but the Robins are still a point adrift of safety after four successive defeats.\nDanny Mayor fired in from 20 yards before Danny Rose chested in Andrew Tutte's cross for the visitors.\nCheltenham hit back on 24 minutes, when Wes Burns released Denny Johnstone to finish, but an equaliser never came.\nBury are level on points with seventh-placed Plymouth and remain outside the play-off places on goal difference.\nMeanwhile, Cheltenham chairman Paul Baker has said ex-midfielder Grant McCann and former manager John Ward have expressed an interest in the vacancy, external at Whaddon Road, with Russell Milton currently in caretaker charge.\nCheltenham Town caretaker boss Russell Milton told BBC Radio Gloucestershire:\n\"Although we've lost, if the players give me that, or whoever's in charge, for 15 games, I think we'll be alright.\n\"In the second half, we were camped up there and it was just that final bit of end product that we lacked.\n\"They didn't have a shot in the second half, so that part was pleasing, it's just that final little bit now we need to do.\n\"I'd love the job. For me personally it's the way forward. I think I'm ready for it.\"\nBury manager David Flitcroft told BBC Radio Manchester:", "url": "https://www.bbc.com/sport/football/31423501"}