{"authors": ["Eilidh Davies", "www.facebook.com"], "date_download": "2025-05-21 07:47:00", "date_modify": "2025-05-21 07:47:00", "date_publish": "2024-12-23 16:14:13", "description": "Highland businessman Alan Savage has once again stepped in to keep Inverness Caledonian Thistle afloat, administrator BDO reveals.", "filename": "sport_football_articles_c7863pp0e63o_1747813620.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f781/live/76349110-c147-11ef-a0f2-fd81ae5962f4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c7863pp0e63o_1747813620.html", "title": "Inverness CT: Alan Savage steps in again as one bid for club rejected", "title_page": "Inverness CT: Alan Savage steps in again as one bid for club rejected - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Highland businessman Alan Savage has once again stepped in to keep Inverness Caledonian Thistle afloat, administrator BDO has revealed.\nIt also confirmed that there is significant interest from 15 parties in buying the Scottish League 1 football club, including a foreign investor to whom they spoke last Thursday.\nBDO's James Stephen told coaching staff on Monday that one offer had already been rejected but that ongoing issues with land around the stadium were a potential obstacle to a sale.\n\"I'm optimistic,\" he said, however. \"Alan's given us a great period of stability to iron out all these issues, but I really want to see it moving forward in January.\n\"I would like to get to a preferred bidders stage, with a view to putting forward a company voluntary arrangement proposal to the creditors. I'd like to see the land situation sorted out as part of that.\"\nStephen explained that there is a significant funding gap until the end of the season but that club consultant Savage has again agreed to bridge that financially while a sale is pursued.\nThe administrator was unable to reveal the amount involved, but he also encouraged the local community to come forward to assist Savage with current funding.\nCaley Thistle, which entered administration in October, has a lease for their Caledonian Stadium home, owned by the Inverness Common Good Fund and administered by Highland Council, until 2094.\nHowever, the club is a sub-tenant of 10 acres of land, which includes the car parks, with the head tenant being Inverness Caledonian Thistle Properties (ICTP), controlled by former chairman Ross Morrison and ex-director David Cameron, which purchased it in 2023.\nStephen said the club was in a weak position regarding the land as the agreement could be terminated with short notice and the land could therefore be subject to a change of use.\nFollowing administration, ICTP had offered to sell a significant portion of the land to the club, or a perspective buyer, but is seeking \"financial recompense\".\nWhile Stephen suggested that this was not fatal to the sale, it does add a significant cost to any acquisition and he is due to meet Morrison for talks in January.\nMeanwhile, BDO was pleased that efforts on the field of play had improved, with Caley Thistle having won four of their latest six fixtures, although they remain second bottom ahead of Dumbarton after both received points deductions for going into administration.\nSavage said the atmosphere at the club now was \"fantastic\", everyone at the Caley Thistle had a new lease of life and that one player asked to extend his contract last week.", "url": "https://www.bbc.com/sport/football/articles/c7863pp0e63o"}