{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:44:49", "date_modify": "2025-05-21 05:44:49", "date_publish": "2025-04-02 22:14:36", "description": "Manchester City 2-0 Leicester: Ruud van Nistelrooy reacts to defeat", "filename": "sport_football_articles_cpq7de59zpwo_1747806289.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8969/live/d66b5e80-100f-11f0-992e-13a2fb1a4046.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cpq7de59zpwo_1747806289.html", "title": "Manchester City 2-0 Leicester: Ruud van Nistelrooy reacts to defeat", "title_page": "Manchester City 2-0 Leicester: Ruud van Nistelrooy reacts to defeat - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Leicester boss Ruud van Nistelrooy, speaking to Sky Sports: \"Bad start. Concede early and then a second at 29 minutes. Then we have to control to make sure it's not three or four at half-time.\n\"Not scoring, losing games, bad start is extra hard to recover from. Situation we're in, only by hard work can we get out. The gap is huge now it's a challenge. Nevertheless we have eight games to play and we have to represent ourselves in the best possible way and that's a challenge.\"\nOn difficulty of not scoring when a goalscorer himself: \"Ironic isn't it? Hard for all of us. We're working, trying things. We want to improve, the two goals we conceded are our own mistakes and you can't afford that especially away at City. Scoring goals is a problem, the ball doesn't seem to go in.\n\"Today, before the game, I mentioned it because the gap was already big. I asked the players that the remaining moments we have at this level we have to make the most of it no matter the table or the score in the game. We have to go from first to last minute and give it everything.\n\"We can be real about it, 12 points eight games to play. It's a very big difference, too much. Focus on game to game and presenting ourselves in the best possible way. That is the main target now.\"", "url": "https://www.bbc.com/sport/football/articles/cpq7de59zpwo"}