{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:48:35", "date_modify": "2025-05-21 05:48:35", "date_publish": "2025-01-31 13:47:54", "description": "Female cricketers from Afghanistan are to become the first recipients of support from a Global Refugee Cricket Fund.", "filename": "sport_cricket_articles_ce8jqn0r44go_1747806515.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/493c/live/1ebbd150-dfd8-11ef-8899-07ba6c6a90c6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_ce8jqn0r44go_1747806515.html", "title": "Afghan women's cricketers to get support from MCC Global Refugee Fund", "title_page": "Afghan women's cricketers to get support from MCC Global Refugee Fund - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Female cricketers from Afghanistan are to become the first recipients of support from a Global Refugee Cricket Fund.\nThe fund, established by the Marylebone Cricket Club (MCC) and its charitable foundation, will raise money for Pitch Our Future, a programme supporting exiled Afghan women's cricketers in Australia.\nMore than 20 members of the former Afghanistan women's national team have been in Australia since the Taliban's return to power in 2021, because female participation in sport in the country has effectively been outlawed.\nOn Thursday an Afghanistan Women's XI played an exhibition match in Melbourne, their first match as a collective since fleeing to Australia.\nThe England and Wales Cricket Board has made an initial donation of £100,000 to the Global Refugee Fund.\nThe fund is looking to provide refugees with access to facilities, offer education, promote advocacy and build both high-performance and community programmes.\nIn 2020, 25 players were given professional contracts by the Afghanistan Cricket Board but after the Taliban returned and they could no longer play or train safely, they had asked the International Cricket Council (ICC) for permission to play as a refugee team. The request was denied.\nThe ICC has now been invited to take part in a steering group that will ensure what the MCC is calling a \"sustained and structured approach\".", "url": "https://www.bbc.com/sport/cricket/articles/ce8jqn0r44go"}