{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:27:14", "date_modify": "2025-04-26 04:27:14", "date_publish": "2025-03-03 10:55:12", "description": "Man Utd news: Bruno Fernandes says goal remains to win a trophy this season", "filename": "sport_football_articles_cy5ne704krgo_1745641634.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/31ae/live/34115440-f814-11ef-8dde-aff9d405c81c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cy5ne704krgo_1745641634.html", "title": "Man Utd news: Bruno Fernandes says goal remains to win a trophy this season", "title_page": "Man Utd news: Bruno Fernandes says goal remains to win a trophy this season - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Manchester United captain Bruno Fernandes says silverware remains this season's focus so all of their efforts now have to turn to the Europa League.\nThe FA Cup holders were denied a place in the quarter-finals after losing to Fulham on penalties, so their European campaign is their only route to a trophy.\nReal Sociedad are Thursday's opponents in the first leg of the last 16 in Spain.\n\"We look forward now to the rest of the season, obviously with the main focus on the next game in a competition where we want to go forward,\" said Fernandes. \"It's one of our goals for this season to try to get a trophy.\n\"We know that we had many injuries in this period and we don't have as many players [as we would like].\n\"We've been playing almost always with the same players for long spells and it's been difficult, so we just now need to recover and focus ourselves to do the best we can, to get the best fresh legs to the next game.\n\"It's going to be a tough one. They are a Spanish team that plays brilliant football.\n\"Very, very good players up front, very [good] quality coming out from the back, so we need to be fresh to run again, because they will make us run and then when we have the ball we have to make them run too.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cy5ne704krgo"}