{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:35:31", "date_modify": "2025-04-26 03:35:31", "date_publish": "2025-03-08 00:00:00", "description": "Exeter pick up their first home League One win since Boxing Day with a 2-0 victory over fellow strugglers Shrewsbury.", "filename": "sport_football_live_c9vygvv3l9yt_1745638531.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/948a/live/810c1060-fc41-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_c9vygvv3l9yt_1745638531.html", "title": "Exeter City 2-0 Shrewsbury Town", "title_page": "Exeter City 2-0 Shrewsbury Town: Grecians get rare League One win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Exeter picked up their first home League One win since Boxing Day with a 2-0 victory over fellow strugglers Shrewsbury.\nCaleb Watts and Demetri Mitchell scored either side of half-time to ensure Josh Magennis' penalty miss was not costly.\nShrewsbury started well with Luca Hoole firing over the bar inside two minutes, while Watts twice went close for Exeter after good work by Magennis on each occasion.\nExeter had a great chance to take the lead in the 27th minute when they were awarded a penalty after a foul by Josh Feeney on Pat Jones, but former Exeter goalkeeper Jamal Blackman guessed correctly, diving to his left, and pushed Magennis' spot-kick behind.\nThe respite was brief, though, as from the resulting corner, the ball bounced around the six-yard box and Watts expertly guided Alex Hartridge's header in off the upright for his second goal of the season.\nExeter started the second half with real purpose and Mitchell made it 2-0 with a superb volley from 15 yards across goal and into the bottom corner on 48 minutes.\nHoole almost pulled one back with a superb shot from distance, but Exeter goalkeeper Joe Whitworth was equal to it and that was as good as it got for the Shrews, who were second best on the afternoon.", "url": "https://www.bbc.co.uk/sport/football/live/c9vygvv3l9yt"}