{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:04:56", "date_modify": "2025-05-21 05:04:56", "date_publish": "2025-04-04 07:36:30", "description": "Chelsea news: Fan views on 1-0 win over Tottenham", "filename": "sport_football_articles_c78j6e57zj4o_1747803896.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c78j6e57zj4o_1747803896.html", "title": "Chelsea news: Fan views on 1-0 win over Tottenham", "title_page": "Chelsea news: Fan views on 1-0 win over Tottenham - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your views on Chelsea's win over Tottenham in the Premier League.\nHere are some of your comments:\nChelsea fans\nSteve: A hard fought and much needed win. Tottenham were flat until the last 20 minutes. Robert Sanchez played well and is doing right in kicking the ball long more often. Chelsea are still slowing the ball down too often, but we are back in the top four and I'm happy with that.\nNick: There's no surprise the return of Cole Palmer and, in particular, Nicolas Jackson coincided with a much improved all-round performance. Chelsea played with greater verve, spirit and aggression than in recent weeks and fully deserved the win, which was more comprehensive than the scoreline suggests.\nClayton: What a game of football. The skill level was the best I've seen from a Chelsea team. The atmosphere was electric - we all knew how much we needed a performance and to get it against Spurs! The best game of the season. We are starting to see a fight and spirit, from defence to midfield, that got us trophies before. I'm buzzing.\nSteve: Currently, this is not a good Chelsea side. The fact that they are fourth speaks volumes for the quality of the league this season. Realistically, I don't think they have it in them to fight for a Champions League place either. They need some experienced 'old heads' in the team for moments like this.\nTottenham fans\nJoshua: Yet another miserable performance. We only showed signs of threat near the end of the game, by which time it was too late. Ange is hanging by his last thread - the Europa League. If he doesn't win that 'trophy in his second year', then I don't see him having a future at Spurs. It was great at the start, but now Ange's reign has to come to an end if we want to improve as a football team.\nAndy: Poor Ange has been out of his depth all season. He is a one-trick pony and the best managers in the world have worked him out quickly. The players look dispirited. We have no chance of winning another game in Europe and even the Southampton game is a worrying fixture.", "url": "https://www.bbc.com/sport/football/articles/c78j6e57zj4o"}