{"authors": ["Paul Battison", "www.facebook.com"], "date_download": "2025-05-21 04:32:21", "date_modify": "2025-05-21 04:32:21", "date_publish": "2025-04-05 06:57:16", "description": "BBC Sport looks at the stats and why Lerone Murphy can grasp the British MMA limelight against Josh Emmett in Las Vegas on Saturday.", "filename": "sport_mixed-martial-arts_articles_cd7v5gg7940o_1747801941.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9445/live/b47f54c0-1168-11f0-a3a8-cd0c869b6aeb.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_mixed-martial-arts_articles_cd7v5gg7940o_1747801941.html", "title": "UFC: Why Lerone Murphy can grasp the British MMA limelight against Josh Emmett", "title_page": "UFC: Why Lerone Murphy can grasp the British MMA limelight against Josh Emmett - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "In the build-up to his past few UFC fights, Lerone Murphy has been asked the same question by journalists.\n\"For someone who is undefeated throughout their career, do you think you're going under the radar?\"\nThe 33-year-old from Manchester has won 15 bouts and drawn one since his debut in 2016, and is on a seven-fight win streak in the UFC.\nYet he doesn't get the love from fans or pre-fight buzz around his fights that his form perhaps deserves.\nMurphy says it is because he is \"quiet\" compared to other brash characters in the UFC, who antagonise opponents to sell fights, with the featherweight maintaining \"he will always be himself\".\nOn the back of UFC London, where many top British stars failed to deliver, Murphy has the chance to let his fighting do the talking and thrust himself into the limelight.\nOn Saturday in Las Vegas, Murphy faces the biggest challenge of his career when he takes on American Josh Emmett in a headlining bout at the UFC Apex.\nMurphy is the favourite with odds makers going into the bout, so BBC Sport have looked at the stats that may give the Briton the edge.\nMurphy has described the meeting with 40-year-old Emmett as a number one contender fight. Alexander Volkanovski and Diego Lopes will meet for the title itself - which is being vacated by Ilia Topuria - at UFC 314 in Miami on 12 April.\nA comprehensive win will certainly raise Murphy's claim for a shot, but he is arguably in the pecking order behind Russia's Movsar Evloev, who is on an eight-fight UFC win streak at featherweight.\nDespite this, Murphy's seven victories is the second-longest winning run in the division.\nHis streak matches the best runs set by Topuria, former title holder Conor McGregor and UFC legend Jose Aldo.\nHis form hasn't gone unnoticed by his employers either, with Murphy confirming this week he has signed a new six-fight deal with the UFC.\nMurphy's success in the promotion has largely stemmed from his high-level striking.\nHe has consistently out-struck opponents, with his standout performance being against UFC veteran Edson Barboza last year.\nThe Briton landed 220 significant strikes in the bout, which is the fourth-most in UFC history in a single contest.\nOnly Max Holloway has landed more, with the American landing a remarkable 445 against Calvin Kattar in 2021, 290 versus Brian Ortega in 2018 and 230 during his bout with Yair Rodriguez in 2021.\nMurphy also:\nHolds the fourth-highest striking differential in UFC featherweight history at 2.13\nIs ninth on the featherweight list for significant strike accuracy at 54.1%\nHas the fifth-highest takedown accuracy in UFC featherweight history at 54.2%\nAlthough Murphy shines technically, critics have pointed to his lack of finishes as being a reason for his achievements \"going under the radar\".\nMurphy points to the calibre of opponents he's faced, such as Dan Ige, who he beat in October.\n\"I know people want to see finishes. I never come into fights thinking 'I'm just gonna have a boring fight and get a decision',\" said Murphy.\n\"But you've got to look at the guys I've been in there with, they're hard to finish. Dan Ige has never been finished.\"", "url": "https://www.bbc.com/sport/mixed-martial-arts/articles/cd7v5gg7940o"}