{"authors": ["Alasdair Lamont", "www.facebook.com"], "date_download": "2025-05-21 07:08:01", "date_modify": "2025-05-21 07:08:01", "date_publish": "2025-01-22 14:56:25", "description": "'Positive result at Old Trafford would give Clement much-needed boost'", "filename": "sport_articles_c391xdxvnrxo_1747811281.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4e73/live/d2e55710-d8cf-11ef-a37f-eba91255dc3d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c391xdxvnrxo_1747811281.html", "title": "'Positive result at Old Trafford would give Clement much-needed boost'", "title_page": "'Positive result at Old Trafford would give Clement much-needed boost' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "For this footballing giant, once the dominant force in the league but now miles off the pace and with a manager under pressure as a result of a yawning gap between them and their most bitter rivals, European football offers some solace from domestic tribulations. Sound familiar?\nRuben Amorim's Manchester United welcome Rangers to Old Trafford in the Europa League with plenty in common and little for Philippe Clement and his side to fear as they consider the prospect of automatic qualification for the last 16.\nThat may yet prove fanciful, but a positive result in the Theatre of Dreams is not beyond them if they can hit the heights of Nice and United cannot muster a better showing than they offered in defeat at home to Brighton at the weekend.\nClement will have to shuffle his pack once again with Ianis Hagi unavailable and Mohamed Diomande suspended in addition to the customary lengthy injury list. There could be a place on the bench again for Bailey Rice and Findlay Curtis, who both acquitted themselves well on Sunday, albeit against considerably lower-level opposition.\nIt is inconceivable that Rangers won't progress in Europe beyond this league stage, but what remains to be determined is whether they go through as one of the top eight or have to play off as one of the clubs ranked between ninth and 24th.\nThe computerised projections suggest 15 points will be required to qualify automatically, which Rangers could achieve with a draw on Thursday and a win in their final game at home to Union Saint-Gilloise.\nRegardless of the outcome in Manchester, victory in that final game should at least be enough to secure a seeded place in the play-off round, but a positive result at Old Trafford would do wonders for morale and give Clement a much-needed filip as he seeks to justify the show of faith from the board.", "url": "https://www.bbc.com/sport/articles/c391xdxvnrxo"}