{"authors": ["Nizaar Kinsella", "www.facebook.com"], "date_download": "2025-04-26 06:15:54", "date_modify": "2025-04-26 06:15:54", "date_publish": "2025-03-01 20:44:42", "description": "The Brazil forward was sent off late in extra time as Wolves were knocked out of the FA Cup by Bournemouth on penalties. But how costly will his dismissal be for the club's Premier League survival?", "filename": "sport_football_articles_crknx12gxr6o_1745648154.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/30e5/live/3049e2f0-f6ca-11ef-a811-cd286d96b2f6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_crknx12gxr6o_1745648154.html", "title": "Matheus Cunha: How costly will forward's red card prove for Wolves?", "title_page": "Matheus Cunha: How costly will forward's red card prove for Wolves? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An FA Cup fifth-round defeat by Bournemouth was a disappointing blow for Wolves, but the impact of losing star forward Matheus Cunha for at least three Premier League matches may hurt even more.\nThe 25-year-old had to be dragged down the tunnel and was unable to take part in the penalty shootout following his red card in the final minute of extra time for an unsavoury clash with Cherries defender Milos Kerkez.\nWolves boss Vitor Pereira said: \"Of course, the emotional side was very high and not only inside the pitch, but on the bench and in the stands, a lot of pressure everywhere. In the end it happens.\n\"It should not happen, but this is something that happens in football.\"\nBoth Matt Doherty and Boubacar Traore missed spot-kicks for Wolves in the 5-4 shootout defeat after a 1-1 draw over 120 minutes at Vitality Stadium.\nIt was a dramatic climax to a game where Evanilson had put the Cherries ahead on his return from injury, before his fellow Brazilian Cunha levelled with a sensational equaliser from around 30 yards.\nHowever, Cunha's display went from magical to madness with a dismissal that will leave his side - fourth bottom in the Premier League - without their best player for crucial games in their relegation fight.\nThe red-mist moment, where he clashed multiple times with Kerkez, including fighting, kicking out at the Hungarian full-back while he was on the ground and aiming a headbutt when Kerkez had got back to his feet.\nAfter being pulled away by team-mates, referee Sam Barrott eventually gave him a red card but a furious Cunha refused to leave the field, needing to be escorted and pushed down the tunnel.\nHe will be suspended for three games following the red card for violent conduct, but additional games cannot be ruled out because of the severity of the incident and having already served a two-match ban for clashing with Ipswich Town security in December.\nFormer Arsenal defender Martin Keown said on Match of the Day: \"The ability he has is top level, the goal he scored belongs in the Champions League, but then suddenly we see the ugly.\n\"I have not seen that on the football pitch since the 1970s - he just lost it. The referee had to send him off. They couldn't get him out of the ground. This was the ugly part and it is something he has to stop.\n\"Wolves need points to stay up. He will be a huge loss.\"\nWolves boss Pereira told BBC Match of the Day: \"When the situation happened I was looking for the ball.\n\"It means that I didn't see the situation, but football is emotional and the level was very high today. Not only inside the pitch, but outside [the pitch]. With a lot of pressure, and in the end these are things that can happen.\n\"You know now he is frustrated, he is better in my opinion. I never speak to the team when we are nervous or frustrated. It is better to wait one day and think about everything. After we can have a talk.\n\"Of course, he is an important player, but next game we play with 11 and start with 11.\"\nSpeaking in his post-match news conference, he added: \"Matheus is a special player and today he played extra time. The last three weeks he has a problem in the hamstring and he tried.\n\"I didn't see the situation. Don't ask me about it because I was looking at the other end. In the end the referee decided the red card.\"\nAsked about whether Cunha deserves another chance, Pereira added: \"Of course, he is important but I cannot speak about what I don't know. It is important to check the situation, to look for what happened because I was looking for the other side.\n\"The others say to me he kick, he punch, he do what he did with the head and the player went to hospital? No, OK. But it is a situation that cannot happen of course.\n\"To judge the situation, I must have the clear image in my mind.\"\nBournemouth boss Andoni Iraola criticised the decision to show Kerkez a yellow card in the Cunha clash. It was was the defender's second in this season's FA Cup and means he will be banned from playing in the quarter-final tie.\n\"Milos Kerkez has received a yellow card for adopting an aggressive attitude,\" said Iraola. \"After what they have done to Milos Kerkez, they should reward him because [of] the attitude he has.\n\"They punch him, they kick him on the floor, they headbutt him and he doesn't react! You punish this? I will have to say to Milos [that] probably I cannot do as well as a player.\n\"The prize is they show him a yellow card and he will not play the quarter-final. Yes, I am very disappointed with the refereeing.\"", "url": "https://www.bbc.co.uk/sport/football/articles/crknx12gxr6o"}