{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:55:13", "date_modify": "2025-05-20 13:55:13", "date_publish": "2023-07-31 11:20:25", "description": "Newcastle United podcast: 'We overachieved last season'", "filename": "sport_articles_cqq44kl3qzko_1747749313.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0b12/live/75c98ad0-2f91-11ee-999b-b74dedc428d3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cqq44kl3qzko_1747749313.html", "title": "Newcastle United podcast: 'We overachieved last season'", "title_page": "Newcastle United podcast: 'We overachieved last season' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "In the latest BBC Newcastle United podcast, fan forum member Joshua Nichol outlines his hopes ahead of the upcoming season: \"I'd like to see us do well in one of the cups. If we can finish third in our Champions League group and then have a kick at the Europa League knockouts, that might be a good option.\n\"Finishing in the top eight would make it a reasonable season. We did overachieve last season, no one would've said we would finish fourth at the start.\n\"We overachieved and had players playing out of their skin to achieve that. But, if we earn another European spot, that would be a success.\"\nHe also shared his opinions on Newcastle's club membership, which should allow more fans to access games: \"I can certainly see why the club have created the membership scheme. It gives members the chance to enter a ballot to get tickets, which are hard to come by.\n\"It's been hard to get to games since the takeover. But, the cost is slightly prohibitive, £37 to potentially not even get a game might put people off.\n\"The club should increase accessibility, that's what the fan zone will do with screening games. The Supporters' Trust have called for more clarity with tickets. The first game of the season is 12th August, yet we still don't know how to get tickets.\"", "url": "https://www.bbc.com/sport/articles/cqq44kl3qzko"}