{"authors": ["Chris Wathan", "www.facebook.com"], "date_download": "2025-05-21 06:22:52", "date_modify": "2025-05-21 06:22:52", "date_publish": "2025-03-31 14:06:57", "description": "BBC Sport Wales looks at the main talking points as League One promotion hopefuls Wrexham report record financial results.", "filename": "sport_football_articles_ce92zk757vlo_1747808572.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/84a8/live/eb51c120-0e0e-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ce92zk757vlo_1747808572.html", "title": "Wrexham: Five key insights from record financial results", "title_page": "Wrexham: Five key insights from record financial results - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wrexham have reported record financial results that show they brought in more money as a League Two club than many Championship sides.\nThe north Wales club - now in League One - confirmed their revenue for their first year back in the English Football League (EFL) was £26.7m.\nThe figure underlines the impact of the ownership of A-list pair Ryan Reynolds and Rob McElhenney and their growing profile.\nThe full details have been released as Wrexham publish their accounts for the 2023-24 season, which saw the club make a £2.7m loss.\nIn a report from directors, Wrexham said: \"The goal of the new owners is to grow the team and establish Wrexham AFC as a Premier League club in front of increased attendances, and in an improved stadium, while making a positive difference to the wider community in Wrexham.\"\nBBC Sport Wales looks at the main talking points to emerge from the latest accounts.\nFour years ago, before the club's Hollywood takeover, Wrexham's non-league revenue was recorded at £1.148m.\nThe annual turnover has exploded year on year, now rising 155% from last year's £10.5m to the £26.7m for the season in which they won promotion from League Two at the first attempt. The club believe this is a record for a League Two side.\nTo put it into context, Deloitte's most recent annual review of football finance has the League Two average at £5.4m, while Championship clubs - other than those receiving parachute payments - are at £22m.\nBut it is not unexpected.\nGiven Wrexham's global profile, association with huge brands and a stadium naming-rights deal saw commercial revenue boom to £13.18m.\nWith every game a sell-out - including fans from various countries desperate for a Stok Racecourse ticket - matchday revenue was up to £5m, and shirt sales helped drive retail income to £4.45m.\nWhat is not included is revenue from the 'Welcome to Wrexham' documentary that has made stars of the club and players such as Paul Mullin.\nThat is because the club do not actually earn money directly from the show, which airs on both sides of the Atlantic and sees cameras follow Wrexham's fortunes from the inside.\nBut its indirect impact is obvious, with the club now seeing more revenue generated from outside the United Kingdom than on these shores.\nWrexham's story - and shirts - hitting the screens of non-football fans and untapped markets helps explain why they have attracted the sponsorship agreements they have.\nFor example, the coffee company which lends its name to the rebranded Stok Racecourse agreed that deal, even though the product is not sold in the country Wrexham play in.\nOutgoings for the year ending June 2024 include payments to the companies owned by Reynolds and McElhenney for the work done in making the most of the Stateside opportunities and nailing those big commercial deals.\nIn their accounts, Wrexham said this \"significantly assisted us to achieve our record turnover\".\nAs with any club, the biggest outgoing was wages - of £11m - which explains why Wrexham still posted a loss of £2.72m, albeit one that is down on last year's £5.11m.\nThat is despite the wage bill jumping up 59% to a level well above any other side in League Two.\nThere was also a rise in staff levels, including the semi-pro women's team in the top-flight Adran Premier as well an increase in off-the-field employees.\nAnd there was a £0.82m payment on promotion bonuses plus work to improve the stadium, including the installation of a new temporary stand.\nThe loss is still way down on the average yearly loss for a Championship club of around £20m.\nAverage losses for a League Two club, according to Deloitte, are £1.5m.\nWrexham have long been keen not to pin all their ambitions on a documentary and the financial rewards that follow.\nAnd the accounts show that as much as the club have benefited from the backing of their celebrity owners, they are not really being bankrolled by them.\nAccording to the strategic financial report accompanying the accounts, a key event after the financial year end was the repayment of loans from Reynolds and McElhenney, that had grown to £15m.\nThe money was partly tied into funds provided to purchase the lease of the Stok Racecourse in order to develop and expand.\nWith work on a new Kop stand potentially beginning at the end of the season, further expansion has already been talked about as a way of increasing local revenue streams.\nThere have been no further charges lodged at Companies House since, meaning the club are loan-free.\nThere has, though, been investment from the New York-based Allyn family, who have been introduced as minority shareholders.\nAs well as the stadium, there are plans to develop a training ground and for expansion of facilities for the academy and women's side.\nWrexham's backers could increasingly come into the picture as financial support - with past loans being cleared paving the way for that to happen - but ultimately, all that will be done with the aim of building a club that can sustain success on and off the field.\nWith a month of the season to go, Wrexham are still on course for an unprecedented third successive promotion - and could be playing Championship football in four months' time.\nNext year's accounts will take in this campaign, during which the club's transfer record has been broken on a number of occasions and the wage bill has inevitably risen.\nBut reaching the second tier for only the second time in the club's history would mean access to even more revenues.\nJust becoming part of the Championship would see a boost to TV payments, while sponsorship deals would expect to be even more prized.\nWrexham have this season made key office appointments that should drive further commercial opportunities.\nAnd there is no sign of the global interest waning, with McElhenney being vocal about wanting to improve the ability to sell Wrexham shirts in the USA given that the club have had more matches screened in the States than any other EFL side.\nThe Championship would of course mean far greater outgoings, especially with the work on the Kop to limit capacity for a year.\nBut the Wrexham buzz - and financial trend - is showing little signs of slowing.", "url": "https://www.bbc.com/sport/football/articles/ce92zk757vlo"}