{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:24:51", "date_modify": "2025-05-20 13:24:51", "date_publish": "2023-08-02 07:23:23", "description": "Former Northern Ireland midfielder Jim Magilton is excited by \"the next chapter of his football journey\" as manager of Irish Premiership side Cliftonville.", "filename": "sport_football_66363240_1747747491.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/BCA1/production/_130598284_jimmagilton.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66363240_1747747491.html", "title": "Jim Magilton: Becoming Cliftonville manager 'another chapter' for ex-Northern Ireland midfielder", "title_page": "Jim Magilton: Becoming Cliftonville manager 'another chapter' for ex-Northern Ireland midfielder - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jim Magilton's career in football has been a long and varied one up to this point but his appointment as manager of Irish Premiership club Cliftonville represents a new challenge for the former Northern Ireland international.\nThe 54-year-old, who won 52 caps, was named as the new boss of the north Belfast club in June, succeeding Paddy McLaughlin, who left to join Derry City as assistant manager three months previously.\nHis new role is the latest instalment in a footballing journey that began as a player with a spell at Liverpool as a teenage apprentice, then on to Oxford United, Southampton, Sheffield Wednesday and Ipswich Town.\nHe went on to manage Ipswich Town, Queen's Park Rangers, Australian side Melbourne Victory and Northern Ireland Under-21s, was assistant to Michael O'Neill at Shamrock Rovers and was elite performance director with the Irish Football Association for seven years between 2013 and 2020.\nMost recently, in 2021, he was sporting director at Dundalk, including a period as interim manager, and has also been a regular football pundit on television.\n\"I've always enjoyed it, every aspect of the football journey and this is just the next chapter in my life,\" reflected Magilton at the media launch of the 2023-24 Premiership season.\n\"You look at every period of your life, leaving at 16, having a career in England and travelling around. I have met some fantastic people.\n\"When I first went into management, being the player was still in my veins and that was a difficult transition, there's no question about that.\n\"I've gained a wealth of experience, a wealth of knowledge and I'm calmer and more relaxed in that situation.\"\nMagilton says the latest turn of events in his career did \"not really come as a shock\" and that his short tenure in charge of team affairs at Dundalk had reawakened his appetite for management.\n\"As I've learned throughout my career phone calls change lives and that phone call is the next stage in my journey.\n\"The time at Dundalk actually helped as when I was thrown into that interim manager role it whetted the juices again.\n\"It triggered something and when the opportunity came along I grabbed it.\n\"As Cliftonville manager I'm extremely proud to be working with this group of players and look forward to the challenge.\"\nThe ex-midfielder, renowned for his range of passing during a distinguished playing career, becomes the Solitude club's first full-time manager, but has found recruitment challenging amid a competitive market.\nCliftonville finished fourth in the league last season and missed out on European football after losing to Glentoran in the play-off final.\nMagilton is keen to build on the progress made by former boss McLaughlin which saw the Reds contend in the upper echelons of the Premiership table but must wait a week longer than originally anticipated to begin his side's competitive season because of Linfield's involvement in continental competition.\n\"The aim is to be ultra competitive, to build on the successes that Paddy has created at the football club and to make sure we are in and around European places, also to make sure we can nurture homegrown talent too.\n\"I look forward to the Glenavon game [which now begins their season on 12 August]. There'll be added pressure because it's our first game and it's a home game, but we'll be well prepared for that.\"", "url": "https://www.bbc.com/sport/football/66363240"}