{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:25:28", "date_modify": "2025-05-21 04:25:28", "date_publish": "2025-01-18 00:00:00", "description": "Stockport come out on top against fellow League One play-off contenders Reading with a 3-1 win at the SCL Stadium.", "filename": "sport_football_live_ckg0v4z9z8dt_1747801528.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_ckg0v4z9z8dt_1747801528.html", "title": "Reading 1-3 Stockport County", "title_page": "Reading 1-3 Stockport County - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Stockport came out on top against fellow League One play-off contenders Reading with a 3-1 win at the SCL Stadium.\nLively County were well worth their 2-0 interval advantage through early goals from Isaac Olaofe and Callum Connolly.\nSam Smith reduced the gap for Reading in the 61st minute but Stockport substitute Jack Diamond made it 3-1 seven minutes later to wrap up the points.\nReading went into the game in better form than their opponents, unbeaten in four league matches, while Stockport had not won in the same number of fixtures.\nHowever, County were out of the blocks quickly and led 2-0 after only 13 minutes, with former Royals midfielder Oliver Norwood the architect of both goals.\nFirst, he provided the fifth-minute corner for Macauley Southam-Hales to head on for Olaofe to tap in from close range.\nEight minutes later, Norwood swung in a free-kick that the unmarked Connolly nodded in firmly past exposed home keeper Joel Pereira.\nThe hosts offered little going forward, with Stockport looking more likely to increase their lead as Pereira had to save further efforts from Norwood and Kyle Wootton.\nReading needed a swift response after the break and got it when Smith flicked in at the near post, from a Charlie Savage free-kick, for his 10th goal of the season.\nBut County replied in the 68th minute after a quick break, Diamond easily beating Pereira from inside the area.", "url": "https://www.bbc.com/sport/football/live/ckg0v4z9z8dt"}