{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:37:57", "date_modify": "2025-05-20 14:37:57", "date_publish": "2023-07-28 13:37:29", "description": "Saints squad a ‘work in progress’ says MacLean", "filename": "sport_articles_ce9g6ry0ql7o_1747751877.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c55d/live/28ea39a0-2d4b-11ee-b1d7-8fdc93c2782e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_ce9g6ry0ql7o_1747751877.html", "title": "Saints squad a ‘work in progress’ says MacLean", "title_page": "Saints squad a ‘work in progress’ says MacLean - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Steven MacLean insists he is focused on winning their Viaplay Cup group stage match against Stirling Albion despite already being knocked out of the competition.\nThe St Johnstone manager says “there are positions up for grabs” that players need to fight for ahead of the start of the new campaign.\n“When you go out of a competition it's not nice but we’re a work in progress, with the injuries we have and we need to add a bit of quality, we're certainly not panicking but we know we need to be better,” said MacLean.\n“With the squad just now I've not got the depth there to influence the game, it's hard to ask young players to go on and affect the game when you're losing.\n“It's all about preparing for the start of the league now, we want to win the game on Saturday against Stirling but there are positions that are up for grabs and it’s up to the players to make sure that they're ready for the Hearts game.\n“It was always going to be difficult getting the signings done late but I'm looking for quality over quantity.\n“We're trying to do that as quick as we can, we’re close to one and when that gets done hopefully we’ll add another two or three.\n“The budget is what it is, players want as much as they can have which is understandable, we've lost players to other clubs in the league because they paid more money but that’s the way it is.”", "url": "https://www.bbc.com/sport/articles/ce9g6ry0ql7o"}