{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:44:49", "date_modify": "2025-05-21 07:44:49", "date_publish": "2025-03-28 09:18:14", "description": "Former Premier League manager Harry Redknapp jokes England boss Thomas Tuchel is \"a German spy\" while at a charity event.", "filename": "sport_football_articles_cddy11j9p98o_1747813489.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c047/live/c1f713d0-0b5b-11f0-bfd4-4d7731a02bb0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cddy11j9p98o_1747813489.html", "title": "Thomas Tuchel: Harry Redknapp jokes England manager is a 'German spy'", "title_page": "Thomas Tuchel: Harry Redknapp jokes England manager is a 'German spy' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Premier League manager Harry Redknapp appeared to make a Nazi salute after joking England boss Thomas Tuchel was \"a German spy\" when speaking at a charity event.\nTuchel became England manager in January and led them to World Cup qualifying wins over Albania and Latvia in his first two games in charge.\nEx-Portsmouth, Tottenham and West Ham manager Redknapp, 78, was speaking in front of an audience at an event in London before those matches last week, and was asked for his thoughts on the German.\n\"I'll be honest with you, I think he's a German spy. I'm telling you,\" Redknapp is seen saying in a video clip obtained by the Guardian., external\n\"Seriously, he's been sent over to [expletive] us up. He has. I'm telling ya, he's like Lord Haw Haw in the war – 'We have your best soldiers captured' and all that.\"\nWilliam Joyce, known as Lord Haw-Haw, broadcast Nazi propaganda to the UK during World War Two.\nRedknapp also imagined an instruction given to Tuchel to \"go over and ruin that team\".\nAnd he appeared to make a Nazi salute gesture as he made the comments to the audience, who were laughing.\nBBC Sport has approached Redknapp for comment.\nThe incident has prompted some criticism of Redknapp on social media, though German comedian Henning Wehn - a regular guest on BBC Radio 5 live's Fighting Talk - said: \"What a non-story. Lighten up! If we're not allowed a bit of banter, what's the point of football? Or anything.\"\nTuchel is the third foreign permanent England manager after Swede Sven-Goran Eriksson and Italian Fabio Capello.\nAsked about that fact in October, he said \"sorry I have a German passport\". Earlier this month, he said he needed to \"earn the right\" to sing the national anthem.\nFormer Borussia Dortmund boss Tuchel led Chelsea to the 2020-21 Champions League in his previous spell working in England.\nRedknapp was the last English manager to win a major domestic trophy - the 2008 FA Cup with Portsmouth - before Eddie Howe led Newcastle to victory in this year's Carabao Cup final.\nRedknapp's last managerial role was at Birmingham City in 2017. He also had spells with Bournemouth, Southampton, QPR and the Jordan national team.", "url": "https://www.bbc.com/sport/football/articles/cddy11j9p98o"}