{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:48:45", "date_modify": "2025-05-21 06:48:45", "date_publish": "2025-03-28 21:10:36", "description": "Novak Djokovic cruises past Grigor Dimitrov to reach his first Miami Open final since 2016 and move within one win of his 100th career ATP title", "filename": "sport_tennis_articles_cvgwg4n9geko_1747810125.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f70f/live/51b09960-0c15-11f0-893d-63321fefb6c2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_tennis_articles_cvgwg4n9geko_1747810125.html", "title": "Novak Djokovic reaches Miami Open final to close on 100th career title", "title_page": "Novak Djokovic reaches Miami Open final to close on 100th career title - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Novak Djokovic cruised past Grigor Dimitrov to reach his first Miami Open final since 2016 and move within one win of his 100th career ATP title.\nHe will face unseeded Czech player Jakub Mensik in Sunday's final following his shock 7-6 (7-4) 4-6 7-6 (7-4) victory over American Taylor Fritz in Friday's second semi-final.\nBulgaria's Dimitrov broke Djokovic in the opening game, but the Serb, watched by his coach Andy Murray, broke back.\nWorld number five Djokovic, 37, reeled off five straight games to win the first set.\nDimitrov made a shaky start to the second set and the 24-time Grand Slam champion took advantage to go through 6-2 6-3.\n\"Ever since I won my 99th [title], which was the Olympic Games in Paris, I've been playing with the prospect of winning the special 100 titles,\" said Djokovic.\n\"I've been trying to find that necessary and much-needed level of tennis that will put me in a position to fight for a trophy, a big trophy.\n\"That's what I've been doing this week, to be honest. I've been very happy with the way I prepared for the tournament, the way I've been playing. I haven't dropped a set.\n\"It's a great opportunity. Let's see what happens in two days.\"\nThings started off well in windy conditions for 14th seed Dimitrov, 33, who won the first game on Djokovic's serve but was unable to capitalise and the classy Serb hit his stride and easily won the first set.\nAfter a fan was ejected after saying something to annoy Dimitrov, the Bulgarian made a slow start to the second set.\nDimitrov, last year's beaten finalist, won three of his service games, but Djokovic was just too good.\nThe six-time Miami Open champion only made five unforced errors to his opponent's 32.\n\"There were a couple of tight games in the last part of the match,\" said Djokovic.\n\"It was 4-2, 30-30 and he missed a couple of forehands, and then I found some really good serves with new balls in the last game.\n\"These were tricky conditions. Very swirly. The wind was not consistent, changing a lot. It's not easy to find control of the ball.\n\"I tried to make him play in these conditions because he's a clean hitter. I knew he'd struggle if I made him play an extra shot. He struggled with the first serve more than I did.\"\nThe fourth seed, at 37 years and 10 months old, is the oldest ATP Masters 1000 finalist ever, having also been the oldest semi-finalist.", "url": "https://www.bbc.com/sport/tennis/articles/cvgwg4n9geko"}