{"authors": ["Gary Rose", "www.facebook.com"], "date_download": "2025-05-20 12:22:23", "date_modify": "2025-05-20 12:22:23", "date_publish": "2023-08-04 15:04:22", "description": "Japan take a step closer to a second Women's World Cup title by beating Norway 3-1 to reach the quarter-finals.", "filename": "sport_football_66404312_1747743743.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/FCEA/production/_130664746_japan.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66404312_1747743743.html", "title": "Japan 3-1 Norway: Japanese into World Cup quarter-finals", "title_page": "Japan 3-1 Norway: Japanese into World Cup quarter-finals - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Japan took a step closer to a second Women's World Cup title when they beat Norway to reach the quarter-finals.\nThe 2011 champions made the ideal start when Norway defender Ingrid Engen turned Hinata Miyazawa's cross into her own net.\nHowever, Norway equalised a few minutes later when Guro Reiten headed home.\nRisa Shimizu's heavily defected strike restored Japan's lead before Hinata Miyazawa raced through to score a third and seal her side's progress.\nThe goal cemented Japan's place in the quarter-finals and kept Miyazawa on target for the Golden Boot - she leads the scoring charts in Australia and New Zealand on five.\n\"I am really happy to have scored the goal but it is because all of the team worked for that,\" she said. \"I want to score more.\"\nNorway were second best for much of the game but almost set up an exciting finish when goalkeeper Ayaka Yamashita superbly kept out Karina Saevik's bullet header.\nJapan will play either defending champions the United States or Sweden in the last eight.\n\"The team is very positive, kept up the pace and I think we have become tougher than before,\" Japan coach Futoshi Ikeda said.\nJapan are seeking their first Women's World Cup title in 12 years and they have barely put a foot wrong at this tournament.\nThey breezed through the group stage without dropping a point, including an eye-catching 4-0 win against fellow quarter-finalists Spain in their final group game.\nIn that game they played devastating counter-attacking football - winning despite having just 23% possession to show they can dig in and grind out victory against a tough opponent.\nReiten's goal is the first they have conceded at this World Cup but apart from that header they once again delivered a strong defensive display.\nOn the rare occasion their defence was beaten, Yamashita was there to make an incredible save.", "url": "https://www.bbc.com/sport/football/66404312"}