{"authors": ["Phil Dawkes", "www.facebook.com"], "date_download": "2025-05-19 15:19:51", "date_modify": "2025-05-19 15:19:51", "date_publish": "2015-01-29 16:52:24", "description": "John Carver claims victory in his first game since being confirmed as Newcastle head coach as Hull's poor run continues.", "filename": "sport_football_30963566_1747667991.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/80698000/jpg/_80698540_cabella.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_30963566_1747667991.html", "title": "Hull City 0-3 Newcastle United", "title_page": "Hull City 0-3 Newcastle United - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "John Carver claimed victory in his first game since being confirmed as Newcastle head coach as Hull's losing run continued.\nRemy Cabella's 20-yard strike gave Newcastle the lead at the KC Stadium before Hull's Ahmed Elmohamady had a goal ruled out for a clear handball.\nSammy Ameobi's long-range goal gave the away side a firm grip on the game.\nCarver's team sealed the win with 12 minutes to go courtesy of a deflected finish from substitute Yoan Gouffran.\nIn this fixture last season, then-Newcastle boss Alan Pardew head-butted Hull midfielder David Meyler in the 4-1 away win.\nPardew's recent departure to Crystal Palace took the off-field heat out of the contest and focused attention on the pitch, where the away side were again vastly superior.\nNewcastle are now 11 points above their opponents, who remain in the bottom three and were once again toothless in attack despite the return of Abel Hernandez and Nikica Jelavic.\nManager Steve Bruce revealed before the game that Hull had agreed a fee for Lokomotiv Moscow's Senegalese striker Dame N'Doye and his arrival cannot come soon enough.\nNewcastle struggled for the first quarter of the game but Hull's continued inability to turn chances into goals meant the home side quickly lost their initial positivity.\nNewcastle capitalised on this either side of half-time as Cabella created room for himself and fired in from outside the box for his first Newcastle goal in the 40th minute before Ameobi drove home from even further out soon after the break.\nHull manager Steve Bruce: \"For 30 minutes there wasn't much in it but after that it was a succession of errors. It was an awful sight when you are not getting enough to go rescue something. We need to make sure that never happens again.\n\"We had umpteen chances at goal and we needed to take one of them and then we conceded a terrible goal. But then you need fight and determination to avoid one of those embarrassing afternoons, which if we are honest is what it became.\n\"We need to roll our sleeves up and show what we are about. If we do that we will be OK. But if we don't then we will be in trouble.\"\nNewcastle head coach John Carver: \"I thought it was an excellent game from our point of view. We had a good game plan.\n\"Remy Cabella produced what I asked him to produce before the game - a wonderful strike. He had the composure in the right area. We have been concerned about his end product but he is now starting to produce.\n\"There was a bit of pressure on but it is my job to control that. I can take the pressure but I want the players to express themselves and I think they did that today.\"", "url": "https://www.bbc.com/sport/football/30963566"}