{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:37:43", "date_modify": "2025-05-21 07:37:43", "date_publish": "2025-03-28 12:34:15", "description": "Former Barcelona and Brazil defender Dani Alves has a sexual assault conviction overturned on appeal by a Spanish court.", "filename": "sport_football_articles_c8rkrgx3x11o_1747813063.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1375/live/ca4f7dd0-0bc7-11f0-9028-6b47f4f81c48.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c8rkrgx3x11o_1747813063.html", "title": "Dani Alves: Spanish court quashes former Barcelona and Brazil defender's sexual assault conviction", "title_page": "Dani Alves: Spanish court quashes former Barcelona and Brazil defender's sexual assault conviction - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Barcelona and Brazil defender Dani Alves has had a rape conviction overturned on appeal by a Spanish court.\nThe appeals division of Catalonia's High Court of Justice unanimously upheld the appeal by the 41-year-old and acquitted him, saying the case against him had \"inconsistencies and contradictions\".\nAlves was sentenced to four and a half years in prison in February 2024 after being found guilty of sexually assaulting a woman in a Barcelona nightclub in 2022.\nThe former full-back, who earned 126 international caps, was released on bail in March 2024 while his appeal was heard by a higher court.\nThe appeal court said that the ruling in the original court case \"contains, throughout the reasoning, a series of gaps, inaccuracies, inconsistencies and contradictions regarding the facts, the legal assessment and their consequences.\n\"The complainant's account, which should have been subjected to greater scrutiny, has not been compared with the fingerprint and biological evidence, which support the defence's argument.\"", "url": "https://www.bbc.com/sport/football/articles/c8rkrgx3x11o"}