{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:38:50", "date_modify": "2025-05-21 03:38:50", "date_publish": "2025-04-08 00:00:00", "description": "Moussa Sissoko's close-range effort guides play-off chasing Watford past struggling Hull City at Vicarage Road.", "filename": "sport_football_live_c8epwkkz7ept_1747798730.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8d0f/live/a656bbe0-14ba-11f0-a455-cf1d5f751d2f.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c8epwkkz7ept_1747798730.html", "title": "Watford 1-0 Hull: Moussa Sissoko keeps Hornets' faint play-off hopes alive", "title_page": "Watford 1-0 Hull: Moussa Sissoko keeps Hornets' faint play-off hopes alive - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Moussa Sissoko's second-half finish gave Watford victory over struggling Hull City to keep their faint hopes of a Championship play-off place alive.\nEdo Kayembe rattled the crossbar with a spectacular effort after just 30 seconds, the only major action of an otherwise lifeless first half.\nSissoko's goal on 54 minutes, knocked in from close range after Caleb Wiley's cross from the left, was a fair reward for the Hornets' control throughout the match.\nHull offered very little throughout the content at Vicarage Road, and remain precariously close to the relegation zone.\nWatford's victory puts them four points behind sixth-placed Middlesbrough, and ends a tough run of form for Tom Cleverley's side.\nThey had won just one of their previous six matches, a set of results that appeared to push the Hornets out of the play-off race.\nHowever, they played with pace and patience in this match, with Rocco Vata forcing a good save from Ivor Pandur in the Hull goal in the first half.\nThe Republic of Ireland international also had a shot deflected wide in the second period, one of few incidents in a largely uneventful game.\nHull were unbeaten in five of their previous six games, a run which had given them some breathing space in the Championship relegation fight.\nThis was a far from convincing display from Ruben Selles' side, forcing only one save from Egil Selvik during the match.\nLuton, Stoke and Derby drawing meant results went the Tigers' way, but they remain perilously close to the drop zone with Cardiff just two points behind them.\nWatford manager Tom Cleverley told BBC 3CR:\n\"I am super, super proud this evening of a group of really inexperienced players, really maturely seeing out a game, determined to win the game, and lead by their captain [Sissoko], who was outstanding all night.\n\"Until [the play-offs] is mathematically out of the question, we will keep pushing for it.\n\"For us, the next game is the only one we focus on. I want to show progress, I want this group to get back on an upward trajectory. We've equalled last year's points tally.\n\"If sixth is that upward curve, that's almost a miracle, but if that's eighth, or ninth, we want to finish the season strongly.\"\nHull manager Ruben Selles told BBC Radio Humberside:\n\"We were competitive enough, the game was won in one action, they had a little bit more quality into the final third.\n\"We gave up pressure too easily for their goal, and we defended out of structure. We can do much better tracking the runner.\n\"We have got a lot of good situations in the last few months. We didn't get the results today, but we have not been inconsistent. The league is very competitive.\n\"The players are dealing with [the relegation battle] as well as they can do it. I do not see a team, or a player, that cannot deal with this situation.\"", "url": "https://www.bbc.com/sport/football/live/c8epwkkz7ept"}