{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:25:49", "date_modify": "2025-05-20 13:25:49", "date_publish": "2023-08-02 06:58:19", "description": "Saudi club continue chase for Rangers forward, St Johnstone and Ross County line up new arrivals...", "filename": "sport_football_66380778_1747747549.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/172BF/production/_130611949_-3b02f209-102b-473e-97c1-677c64d20700.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66380778_1747747549.html", "title": "Scottish Gossip: Rangers, Celtic, St Johnstone, Ross County, Livingston, Sakala, Doig", "title_page": "Scottish Gossip: Rangers, Celtic, St Johnstone, Ross County, Livingston, Sakala, Doig - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Published\n2 August 2023\nSaudi Arabian club Al-Fayha are to return with a fresh £3m bid for Fashion Sakala despite the Rangers striker rejecting their initial advances. (Daily Mail, print edition)\nJose Cifuentes is expected in Glasgow today as the Ecuador midfielder nears the completion of a four-year deal with Rangers. (Daily Record), external\nDundee are closing in on goalkeeper Trevor Carson after agreeing a six figure fee with St Mirren. (Daily Record), external\nSt Johnstone have agreed a two-year deal for versatile former Liverpool and Southampton defender Oludare Olufunwa. (Courier), external\nRoss County are in the chase to land a loan move for Arsenal striker Nathan Butler-Oyedeji. (Press & Journal), external\nFormer Celtic striker Chris Sutton has warned Brendan Rodgers to think twice before rushing to replace Joe Hart as his number one goalkeeper. (Daily Record), external\n\"If I got sacked tomorrow then I'd be back on a building site trying to pay my mortgage,\" says Livingston boss David Martindale, who insists success is keeping the West Lothian club in the top flight. (Scottish Sun), external\nScotland Under-21 defender Josh Doig is in talks with Fulham after spending a year with Hellas Verona in Serie A. (Calciomercato via Daily Record, external)\nMiddlesbrough are considering a bid for Sunderland and Scotland striker Ross Stewart. (Football Insider), external\nSubscribe & follow updates on your Premiership team", "url": "https://www.bbc.com/sport/football/66380778"}