{"authors": ["Jonathan Agnew", "www.facebook.com"], "date_download": "2025-04-26 07:41:33", "date_modify": "2025-04-26 07:41:33", "date_publish": "2025-02-26 21:31:28", "description": "Replacing Jos Buttler as captain could rejuvenate him as a player and is the sensible thing for England to do after Champions Trophy exit, says Jonathan Agnew.", "filename": "sport_cricket_articles_crknek1pxz2o_1745653293.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7c92/live/72f8fcd0-f486-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_cricket_articles_crknek1pxz2o_1745653293.html", "title": "Jonathan Agnew on Jos Buttler's future as England captain", "title_page": "Jonathan Agnew on Jos Buttler's future as England captain - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "From 1999 at Edgbaston in their own tournament to defeat by Bangladesh in Adelaide in 2015, I have covered plenty of shambolic England exits in global tournaments.\nEach time it feels like the lowest point – that things cannot go on – and Wednesday's defeat by Afghanistan in the Champions Trophy ranks among those dark days of the past.\nEngland have disintegrated as a white-ball outfit since their two World Cup wins in 2019 (ODI) and 2022 (T20).\nIt is time to once again plan for the future because relieving Jos Buttler of the captaincy is simply the sensible thing to do.\nWhenever I have dealt with him, Buttler has always been a very nice guy. He won that T20 World Cup as skipper in 2022 but, even if he says he enjoys the role, the captaincy has never felt like a natural fit.\nHe has spoken about practising his smile in the mirror and after Wednesday's defeat told the media he had to think whether he is \"part of the problem or the solution\", which sounds like the words of someone whose mind is a little mixed up.\nButtler will be 37 by the time the next 50-over World Cup comes along in 2027.\nThere is no reason why he cannot stay in the team as a player until then, especially if stepping down releases him of the burden, puts that smile on his face and allows him to go back to being the destructive batsman we know he can be.\nBut moving on to another leader now, most likely Harry Brook, would give him time to bed in before that tournament in South Africa, Zimbabwe and Namibia. It just feels like the right thing to do.\nTo his credit, Buttler actually began this tournament with the correct message. He said how his batters needed to learn to change through the gears when necessary, and go back down a gear when necessary.\nThe problem is, only Ben Duckett in the defeat by Australia and Joe Root in his 120 against Afghanistan showed any capabilities of being able to do so.\nThe dismissals of Phil Salt and Jamie Smith were horrendous on Wednesday.\nSalt's shot – a limp swipe across the line to be bowled – was a real jaw-dropper while Smith left me lost for words. He has impressed in his first nine Tests since his debut last summer but to charge the first ball of spin in the innings cannot be explained.\nBatting in the top three of a 50-over match on flat batting tracks such as these is such a privilege, and a good player should be able to get himself in to make a bucket-full.\nInstead, Smith played a bad shot against Australia to be caught at mid-on and to go caught at point having a swing against Afghanistan leaves serious questions as to whether he is the right man for the number three position.\nIt was also the latest example of England having far too much of a T20 mindset.\nTake Jofra Archer, for example.\nIn both of England's defeats – matches they should really have won - he tried back-of-the-hand stuff, slower balls and all of his variations. That is not 50-over cricket. It is T20.\nPace is great but it has to be accurate pace like Azmatullah Omarzai showed. He is not express and largely does not have all of the tricks but he runs in hard, is accurate and bowls to his field – something England have struggled to do.\nWhile they largely picked their best players in this tournament, Buttler and coach Brendon McCullum put all of their eggs into the pace basket - picking Archer and Mark Wood in both games and swapping Jamie Overton for Brydon Carse in the second – and it has never looked right as an attack.\nAdd in that England have always been juggling their resources having picked only four frontline bowlers, making up the numbers with Joe Root and Liam Livingstone, and it is clear mistakes have been made.\nYou need five proper bowlers in an ODI so the management has to take some of the blame for that but again we come back to the fact English cricket does not take 50-over cricket seriously.\nAll of these issues – the failure to lay a platform when batting and an inability to be consistent with the ball – are because the players are not used to playing the format.\nThe next generation are not playing it because the domestic competition [The One-Day Cup] has been downgraded and when the summer comes you can bet many key players will not feature against West Indies in May and June and South Africa in September because they will be wrapped up in cotton wool for the Ashes.\nUnless that changes I don't think we can be surprised by these results.\nAs for Brook, he has had a poor start to 2025 with an average of 16.90 across 10 matches in 50 and 20-over cricket - but we know he can play.\nThere are not many options to replace Buttler but Brook seems the most credible. He has done it before, in the five-match series against Australia last September, which will have at least got him thinking about captaincy while on the field.\nWe do not know how good a skipper he may be but those close to the camp speak highly of his cricket brain. That said, this England group is always bigging each other up so it is hard to know.\nUltimately, it can only be shown by results and performances but, if Brook does take over, he will have a nice run up to 2027.\nButtler still has years ahead as a player. He can still make his mark too.", "url": "https://www.bbc.co.uk/sport/cricket/articles/crknek1pxz2o"}