{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:01:12", "date_modify": "2025-05-20 12:01:12", "date_publish": "2023-07-26 00:00:00", "description": "Listen to live BBC Radio 5 sports extra coverage of the swimming from the World Aquatics Championships in Fukuoka, Japan.", "filename": "sport_live_swimming_65990424_1747742472.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/E903/production/_130515695_gettyimages-1412432588.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_swimming_65990424_1747742472.html", "title": "World Aquatics Championships Final's LIVE: Listen", "title_page": "World Aquatics Championships Final's LIVE: Listen - GB's Freya Anderson & Daniel Wiffen swimming action - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The World Aquatics Championships 2023\nHere's what's in store from the pool today\nBBC Sport\nThe World Aquatics Championships in Fukuoka, Japan take place from 14-30 July 2023.\nThe swimming in the pool is from 23-30 July and features the world’s top swimmers as they look to make their mark one year out from the Paris Olympics.\nWednesday’s highlights include the men’s 800m final as Ireland’s Daniel Wiffen goes for gold.\nThere are strong GB hopes in the men’s 200m individual medley, with the semi-finals taking place on Wednesday – and there is also an incredible field in the final of the women’s 200m freestyle.\nAll that comes before the session ends with the always thrilling 4x100m mixed medley relay.\nGreat Britain won five medals at the Worlds in Budapest last year - one gold, one silver and three bronze. Ben Proud’s victory in the men’s 50m freestyle was the only golden moment for a team without the injured Adam Peaty.\nThis year, Peaty is missing once again but nonetheless GB have sent a 29-strong team to Japan and there are high hopes that they can deliver individual and relay success.\nThe Radio 5 live team comprises world champion Karen Pickering, Olympic medallist Steve Parry and leading commentator John Hunt.\nThey will bring you commentary of sessions of the finals, which start every day throughout the week at 1200UK, on a variety of platforms including 5 Live, Sports Extra and Online for UK listeners.", "url": "https://www.bbc.com/sport/live/swimming/65990424"}