{"authors": ["Tyrese King", "www.facebook.com"], "date_download": "2025-05-21 05:51:50", "date_modify": "2025-05-21 05:51:50", "date_publish": "2025-01-14 11:31:18", "description": "Fabian Hurzeler press conference: Ipswich vs Brighton", "filename": "sport_football_articles_cy8x7g2g4e3o_1747806710.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0f5a/live/5ccfa4a0-4909-11ef-9e1c-3b4a473456a6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy8x7g2g4e3o_1747806710.html", "title": "Fabian Hurzeler press conference: Ipswich vs Brighton", "title_page": "Fabian Hurzeler press conference: Ipswich vs Brighton - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Hurzeler has confirmed defender Igor Julio will be out for the rest of the season after surgery on his hamstring but Lewis Dunk, Adam Webster and Jan Paul van Hecke are available.\nGeorginio Rutter and Yankubu Minteh picked up \"small\" problems during the FA Cup win at Norwich City and are doubtful.\nOn Joao Pedro's fitness: \"We will have to see today. He's training with the team and then we can decide if we'll take the risk to play him. What's most important is how the player feels. We won't do any stupid things. He hasn't been able to get into his rhythm but I spoke to him yesterday for a long time and he's in a comfortable place. Of course he would want to be on the pitch for every game, but sometimes your body doesn't want the same thing.\"\nThe Brighton boss believes it is \"very important\" for Evan Ferguson to get consistent game time after his injury problems but, while the striker is \"back on the pitch\", Hurzeler thinks it is \"too early\" for him to return to action.\nHe did not rule out a loan move for Ferguson in this transfer window, adding: \"The decision should be is what is best for the player and for the club.\"\nHe said it \"will be a challenge\" against Ipswich because they are a team that can \"play out from the back\" but also \"defend really compact in a 5-4-1 low block\".\nOn Ipswich's top scorer Liam Delap: \"I heard that Delap was a special talent when he played at my former club [Manchester City]. He's the whole package, and has had impressive performances for someone so young. He plays like an experienced striker and is so fast and athletic with a shot. He's a big, big weapon.\"", "url": "https://www.bbc.com/sport/football/articles/cy8x7g2g4e3o"}