{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:46:31", "date_modify": "2025-05-21 06:46:31", "date_publish": "2025-01-04 11:19:01", "description": "Crystal Palace vs Chelsea predictions: Chris Sutton on Premier League game", "filename": "sport_football_articles_c6239kz09z6o_1747809991.html", "image_url": "https://ichef.bbci.co.uk/ace/standard/2048/cpsprodpb/4e49/live/ff09b280-c9f9-11ef-9fd6-0be88a764111.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c6239kz09z6o_1747809991.html", "title": "Crystal Palace vs Chelsea predictions: Chris Sutton on Premier League game", "title_page": "Crystal Palace vs Chelsea predictions: Chris Sutton on Premier League game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Chris Sutton is making predictions for all 380 Premier League games this season, against a variety of guests.\nFor week 20, he takes on The Zutons frontman Dave McCabe, who supports Liverpool.\nSutton's prediction: 1-1\nChelsea are having a wobble, and the worry for manager Enzo Maresca is when will it end?\nTheir performance in their shock defeat by Ipswich was very flat and although Maresca had made a few changes for that game, I saw nothing to suggest they will bounce back with a win at Selhurst Park.\nCrystal Palace have only lost two of their past 11 league games, and they seem to have turned a corner.\nThis game smells of a draw to me, which will keep Palace moving away from the bottom three, but does not help Chelsea much at the top of the table.\nIt looks like Maresca was right when he played down his side's title chances after people like myself said before Christmas that they were genuine contenders.\nI thought he was just taking the pressure off his players but he is in the building with them every day and he knows them better than the rest of us.\nTheir past three results suggest they are not going to go the distance, and I can see them dropping more points here.\nMcCabe's prediction: 0-2\nChelsea will win this - they need to, just to make things more interesting for themselves.", "url": "https://www.bbc.com/sport/football/articles/c6239kz09z6o"}