{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:59:08", "date_modify": "2025-05-21 04:59:08", "date_publish": "2025-04-04 12:01:41", "description": "Enzo Maresca press conference: Brentford vs Chelsea preview", "filename": "sport_football_articles_c8dgq1qeggqo_1747803548.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8254/live/3cea8160-6de3-11ef-8c32-f3c2bc7494c6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c8dgq1qeggqo_1747803548.html", "title": "Enzo Maresca press conference: Brentford vs Chelsea preview", "title_page": "Enzo Maresca press conference: Brentford vs Chelsea preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Defender Wesley Fofana will not be available for Sunday's game after suffering a \"muscle problem\", while midfielder Romeo Lavia has also picked up a muscle issue but \"can be back earlier\" than Fofana.\nOn Lavia's fitness issues: \"If you compare Romeo's games this season to last season, he's already improved. This season it was difficult to go the other way, but the target with Romeo is just to try to keep him fit as much as we can. Next year, he'll play more games than this season.\"\nMaresca said the situation is \"similar\" to Reece James, who was on the bench against Tottenham: \"We try to take care of him [James]. We know that in this moment, he cannot play every three days. Hopefully soon he can start to. But the main target with him, with Romeo, with Wes, is to keep them fit because we know how important they are for us.\"\nThe Blues boss also said Enzo Fernandez is \"improving a lot\" and his \"understanding of the game is completely different now\": \"He knows where he has to stay, he knows where he has to arrive in the box. I think most of the goals he scored this season with us are because he was in the right position.\"\nMaresca expects the game with Brentford to be \"very tough\", particularly after playing on Thursday: \"It's difficult. We are probably the only team - [bar Tottenham] so for us it will be more difficult. But now it's also a matter of how we manage the tightness. We need to recover energy and we need to go again on Sunday.\"\nOn the importance of results over performances in final stages of season: \"Now the target is to try to finish where we have been all season. Probably the first five, six months, we were second. Probably the expectation changed a little bit, but I think overall, all season we have been top four, top five.\"\nHe added: \"We're going to try our best to finish there. [Thursday's] performance probably for you is better compared to previous performances. In some performances, I was also happy, because I know how difficult it is sometimes to break the low block when they sit back.\"", "url": "https://www.bbc.com/sport/football/articles/c8dgq1qeggqo"}