{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:35:34", "date_modify": "2025-05-21 05:35:34", "date_publish": "2025-04-02 14:34:47", "description": "Liverpool news: Reds 'in a tricky situation' going into Merseyside derby - John Aldridge", "filename": "sport_football_articles_cj68k7djd13o_1747805734.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/bd27/live/a0dff6f0-0fcd-11f0-9f8d-f125b11f3e53.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cj68k7djd13o_1747805734.html", "title": "Liverpool news: Reds 'in a tricky situation' going into Merseyside derby", "title_page": "Liverpool news: Reds 'in a tricky situation' going into Merseyside derby - John Aldridge - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "\"Things happen in football\" so Liverpool cannot take \"anything for granted\" as they head into the Merseyside derby, says former striker John Aldridge.\nThe Reds sit top of the Premier League table with a nine-point cushion over second-placed Arsenal, with a game in hand.\nWith the league title their one remaining trophy to play for this season, Liverpool will be looking to reinstate their 12-point lead when they host city rivals Everton on Wednesday.\n\"Liverpool have [something to worry about]. We're in a tricky situation which we haven't been in all season,\" Aldridge told BBC Radio 5 Live.\n\"We've lost a bit of confidence, going out to PSG and then Newcastle deservedly winning the [League] Cup, with a couple of dodgy games in between. They've gone off the boil a little bit.\n\"We shouldn't have any problems being nine points clear with a game in hand, but things happen in football.\n\"I don't take anything for granted. The points are there to be had and we need to make sure we don't slip up.\"\nThe Toffees have a poor recent record at Anfield and boss David Moyes has never won there in his managerial career. However, Aldridge feels the form of both sides will give them confidence.\n\"I've spoke to a couple of Everton fans and they fancy themselves for the first time in a long time against Liverpool,\" he added.\n\"They will look at the Newcastle game. A lot of things will come out of that game tonight for Everton - corners in particular, free-kicks, make it scrappy in midfield, don't let Liverpool get any fluency.\n\"Anfield is not Goodison Park - that is a cauldron at times but Anfield is a cauldron in itself. It will be tough, but if we play well then we will win the game.\"", "url": "https://www.bbc.com/sport/football/articles/cj68k7djd13o"}