{"authors": ["Jack Herrall", "www.facebook.com"], "date_download": "2025-04-26 06:57:17", "date_modify": "2025-04-26 06:57:17", "date_publish": "2025-02-28 14:25:15", "description": "Critchley on derby psychology, Hearts identity & not being a VAR fan", "filename": "sport_articles_cx299240lk7o_1745650637.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/48e0/live/1a7888b0-f5d9-11ef-a452-97c9e2e951dd.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cx299240lk7o_1745650637.html", "title": "Critchley on derby psychology, Hearts identity & not being a VAR fan", "title_page": "Critchley on derby psychology, Hearts identity & not being a VAR fan - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Critchley is \"very excited\" for the derby and wants to try to make a \"good week a great week\" with a third win on the bounce.\nHe notes Hearts and Hibs are both in \"really good form\" and it has the \"makings of a really good game\" with both sides going for victory.\nCammy Devlin is a doubt and despite his lay-off being \"frustrating\" the club are taking no chances given it was a head knock. One or two other players will be assessed but Critchley is hopeful none will be ruled out.\nCritchley says there is a \"different psychological feel\" to this game compared to the previous meeting at Easter Road in late October when the teams were in the bottom two Premiership spots.\nWith Hearts on a run of only one defeat since their Boxing Day loss to Hibs, he says finding a team's \"identity takes time\" and they are now reaping the rewards for improved consistency and becoming better at both ends of the pitch.\nThere is a \"new energy and enthusiasm from the players,\" says Critchley and he highlights the impact the January additions have had on the squad and their positive run of results, saying the \"belief and togetherness\" has grown.", "url": "https://www.bbc.co.uk/sport/articles/cx299240lk7o"}