{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:14:59", "date_modify": "2025-05-21 07:14:59", "date_publish": "2025-05-20 11:08:12", "description": "Wales interim coach Matt Sherratt names six uncapped players for the two-Test tour of Japan with hooker Dewi Lake given the captaincy.", "filename": "sport_rugby-union_articles_clygg5j80gvo_1747811699.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/acf6/live/1c2a3c10-356e-11f0-8b28-6f0e47ba60fe.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_clygg5j80gvo_1747811699.html", "title": "Wales tour of Japan: Matt Sherratt names six uncapped players with Dewi Lake captain", "title_page": "Wales tour of Japan: Matt Sherratt names six uncapped players with Dewi Lake captain - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wales interim coach Matt Sherratt has named six uncapped players for the two-Test tour of Japan, with hooker Dewi Lake given the captaincy.\nCardiff captain Liam Belcher, Dragons prop Chris Coleman, Ospreys trio Garyn Phillips, Keelan Giles and Reuben Morgan-Williams, plus Scarlets back Macs Page are the fresh faces, but there is no room for Ospreys number eight Morgan Morse.\nLake leads the 33-man squad in the absence of flanker Jac Morgan, who is on tour with the British and Irish Lions in Australia, along with Gloucester scrum-half Tomos Williams.\nThe notable absentees for Japan are locks Dafydd Jenkins, Adam Beard and Will Rowlands, Scarlets pair Henry Thomas and Ellis Mee, Gloucester duo Gareth Anscombe and Max Llewellyn, Saracens centre Nick Tompkins and Cardiff duo James Botham and Evan Lloyd.\nDragons second row Ben Carter, Scarlets fly-half Sam Costelow and Bath tight-head prop Archie Griffin return having missed the Six Nations due to injury.\nKieran Hardy, Alex Mann, Josh Macleod, James Ratti, Johnny Williams and Cameron Winnett have been handed recalls.\n\"I'm excited to get the players together in camp to begin preparations for our summer campaign,\" said Sherratt.\n\"There's a good blend of experience and young talent selected and this group has a lot of potential.\n\"Going to Japan this July is a challenge the coaches and I are relishing. We are expecting a fierce contest from Japan in these Test matches.\n\"Over the next few weeks in camp, it's about working hard, getting all our prep right on and off the pitch and gelling together as a group.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/clygg5j80gvo"}