{"authors": ["Nick Hope", "www.facebook.com"], "date_download": "2025-05-19 14:30:47", "date_modify": "2025-05-19 14:30:47", "date_publish": "2017-08-17 23:57:20", "description": "One year after Britain's Chris Langridge and Marcus Ellis won Olympic bronze, BBC Sport looks at the struggles the sport has faced since Rio.", "filename": "sport_badminton_40964337_1747665047.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/15A42/production/_97424688_marcus_ellis_chris_landridge_gettyimages.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_badminton_40964337_1747665047.html", "title": "Badminton World Championships 2017: Medal that didn't save the sport - a year on", "title_page": "Badminton World Championships 2017: Medal that didn't save the sport - a year on - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "\"We thought that with the Olympic medal we had saved our sport.\"\nBut the brutal reality for Britain's Marcus Ellis is that his Rio 2016 bronze alongside Chris Langridge did not \"save\" badminton.\nJust six months after achieving their lifetime dream, the pair received the \"devastating\" confirmation that UK Sport would not only reduce GB Badminton's four-year £5.7m funding, but remove it entirely.\nTheir bronze - one of a record haul of 67 medals - was Britain's first in badminton since 2004, the third since the sport officially entered the Olympics in 1992, and a first in men's doubles.\nOn those grounds, UK Sport assessed it as a one-off, stating the sport did not represent a \"credible\" medal opportunity for the Tokyo 2020 Games.\nAs a result, half of the 24 English players and over 50% of the support staff lost their jobs at GB Badminton's base in Milton Keynes.\nThe 12 players who remain have retained support on a much-reduced rate through Badminton England - far from ideal for Langridge, who has recently become the father of twins.\nAs he prepares for next week's World Championships in Glasgow, he and Ellis tell BBC Sport they are determined to prove their result in Rio was no fluke and that their sport deserves investment.\n\"We want to show that we can challenge for major medals regularly,\" Langridge says.\nThe players first learned of the sport's plight in December 2016 and a bid to overturn the decision failed at a hearing in February, before funding officially ended the following month.\nLangridge recalls being \"angry and so frustrated\" and Ellis describes it as \"a real kick in the teeth\".\n\"In the normal world, if you achieve something you get rewarded - but in sport we learned that by achieving something we actually got kicked to the kerb,\" said 32-year-old Langridge.\nEllis, 26, added: \"I didn't expect anything magic to happen like I'd be driving around in a Ferrari after Rio because Team GB won so many medals.\n\"But we thought it may change our lives a little for the better and that we'd secured a future for the youngsters coming through.\"\nTo compound the frustration, the remaining 12 English players discovered they were being withdrawn from the World Mixed Team Championships in Australia, which took place in May.\nIt was the first time in 30 years that England had not sent a team to a major championships - the rationale being that the money could be used to fund juniors at 10 events instead.\nBut for players to keep their world rankings high - and reduce the likelihood of drawing a top-seeded player or pairing early in a tournament - they need to compete in as many competitions as possible.\n\"With most of the big events over in Asia, it can be such an expensive sport,\" said Langridge. \"You're looking at a minimum of £1,500 and you need to reach the quarter-finals to break even.\n\"It's tough because I'm going to be spending time away from my wife and the twins, but also because I know I need results and that puts more pressure on every time I compete.\"\nAnd because of that lack of money, Ellis and Langridge have been forced to innovate.\n\"We've literally been helping one another out with massages and bought cheap bits of equipment. They don't replace the real thing but it's better than nothing,\" Langridge said.\nThere is no prize money at the World Championships, but Ellis says he would rather win in a medal in Glasgow because of the prestige it brings.\nOn 12 June, Langridge and wife Emma welcomed their twin daughters into the world.\nEllis says he is now used to \"seeing him come in practically with matchsticks to keep his eyes open\" - and Langridge says he was ill-equipped for the shock of raising twins.\nFor a while, he was not even sure if continuing in the sport was realistic.\n\"For the first few weeks, there were times I wasn't even getting an hour's sleep and I'd be trying to go into training and literally feeling as though my body was crumbling,\" he says.\n\"I've had to ask myself if it was feasible to carry on. I went from the high of the Olympics, to the amazing news that we were going to have twins, to then worrying how I was going to provide for them.\n\"Stopping has crossed my mind because I just want to be able to provide for my family.\"\nAfter some time away from the sport, Langridge and Ellis have been unable to attain a noteworthy result since last summer's Games, losing in the quarter-finals of this year's European Championships.\nHowever, after a \"solid\" block of training before the World Championships, they are now adamant that they can return to their best.\n\"Scotland is just up the road for us, whereas the competition is coming from the rest of the world, so we have to see that as an advantage,\" said Ellis.\n\"It hasn't been an easy time for us, but I truly believe that we'll perform again.\"\nLangridge, who has won Olympic, European and Commonwealth medals, added; \"I'm more appreciative of what I've achieved in my career now.\n\"When we're playing well, anything is possible and I want another major achievement to share with the twins now they're in the world.\"\nIn June, badminton joined with 10 other sports who missed out on funding to try and convince new UK Sport chairperson Dame Katherine Grainger to revise the organisation's 'no compromise' approach.\nUK Sport only back those disciplines they believe have genuine Olympic medal prospects at forthcoming Games.\nGail Emms, the 2004 badminton Olympic silver medallist, has described it as the \"Simon Cowell approach to funding\" but it has seen Great Britain significantly increase their medal haul from 30 at Athens 2004, external to 67 at Rio 2016.\nUK Sport insist decisions are \"not taken lightly\" and with Grainger due to meet representatives from the unfunded sports over the coming weeks, they insist the door is not closed for future investment.\n\"There is the opportunity for any unfunded sport to present a case for investment at the point of the annual review,\" a UK Sport spokesperson told BBC Sport.\nSuccess at the Glasgow World Championships would certainly strengthen badminton's position, but Langridge is sceptical.\n\"If I'm brutally honest, even if we won four golds I think UK Sport would say: 'Thank you very much, but we're not interested,'\" he says.\n\"I feel they look at some sports which are 'pen and paper' and very easy to analyse - how quick can you do this, how far can you do this? But you can't analyse badminton the same way.\"\nRegardless of UK Sport's decisions, those running badminton in the UK are taking steps towards becoming self-sufficient by using crowdfunding, sponsorship and membership programmes.\n\"Things are starting to settle down now and, after a challenging few months, the squad is in a good place,\" Badminton England chief executive Adrian Christy told BBC Sport.\n\"Sport England have been incredibly helpful enabling us to prepare as best we can heading towards the Commonwealth Games, but the level of athlete award is nowhere near what they had though.\n\"On average I'd probably say it's around 50% less than previously, but it's given them that hunger.\"", "url": "https://www.bbc.com/sport/badminton/40964337"}