{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:44:33", "date_modify": "2025-05-21 06:44:33", "date_publish": "2025-01-31 09:43:13", "description": "Newcastle news: Fan views on Miguel Almiron leaving", "filename": "sport_football_articles_cx24ddeyzgeo_1747809873.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cx24ddeyzgeo_1747809873.html", "title": "Newcastle news: Fan views on Miguel Almiron leaving", "title_page": "Newcastle news: Fan views on Miguel Almiron leaving - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked how you were feeling following the news that Miguel Almiron has returned to Atlanta United after six years at Newcastle and asked for your standout moments from the Paraguayan.\nHere are some of your comments:\nPeter: Gracias por todos, Miggy! One of the most hard-working, honest players. I'll remember his smile most of all, and the celebration after he opened the scoring on that glorious night against Paris St-Germain.\nTim: A true club player who gave 110% in every game he played in. Scored our first goal in Europe in two decades and some other crackers as well in his time. He's had a good run and I for one wish him well for the future. A lovely lad as well. Good luck, Miggy!\nJoff: Almiron epitomised everything that was exciting about the Toon team as it emerged from the doldrums of the Mike Ashley era. His effort and passion were on show every time he pulled the shirt on. We owe him. He will remain in all Toon hearts for a long time, in the same way as the likes of Nobby Solano and Cheick Tiote.\nKen: Only positive memories of Miggy. His work ethic was probably better than anyone, he was happy and always a smile and he scored some brilliant goals in our best season for years. The only downside was how some fans disrespected him on social media. It makes you ashamed of the fans at times. His love of Newcastle will ensure he will be remembered fondly and always be welcome in Newcastle.\nSteve: Miggy let no one down, I just wished the club could have given him a final swansong this Saturday. He would have got the send-off with best wishes like no other. Will miss his smile.", "url": "https://www.bbc.com/sport/football/articles/cx24ddeyzgeo"}