{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:11:09", "date_modify": "2025-05-21 07:11:09", "date_publish": "2025-01-22 15:50:19", "description": "Real Valladolid accuse Manchester City of encouraging one of their players to break his contract to force through a move to the Premier League club.", "filename": "sport_football_articles_ckg7rj9e4rdo_1747811469.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6045/live/395df620-d8c9-11ef-bf89-cf1be2bb19ea.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ckg7rj9e4rdo_1747811469.html", "title": "Manchester City: Real Valladolid accuse club of encouraging player to break contract", "title_page": "Manchester City: Real Valladolid accuse club of encouraging player to break contract - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Real Valladolid have accused Manchester City of encouraging one of their players to break his contract to force through a move to the Premier League club.\nDefender Juma Bah told the Spanish club on Tuesday that he intends to terminate his contract, allowing City to sign the player for a much lower fee.\nCity had sent a request to Valladolid earlier in the day asking to begin negotiations over a permanent deal for the 18-year-old, Valladolid said in a statement.\nBah then did not turn up for training on Wednesday, with the Spanish Football Association confirming he had deposited the necessary amount to terminate his contract.\nValladolid say the teenager's decision was \"supposedly supported and guided by Manchester City and his agent\" and has \"caused great disappointment and indignation\".\n\"The club considers that Manchester City is behind the player's decision, and appears to have advised the player to take this route.\"\nThe 18-year-old joined Valladolid on a season-long loan from AIK Freetong in his native Sierra Leone last summer and the club exercised a clause earlier this month to turn it into a permanent deal.\nBut Bah is still under a youth contract and has so far refused to sign a senior deal that would significantly increase his release clause.\nValladolid say they will take disciplinary action against Bah and will do whatever they can to \"defend\" the clubs's interests.\nBBC Sport has approached Manchester City for comment.", "url": "https://www.bbc.com/sport/football/articles/ckg7rj9e4rdo"}