{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:03:00", "date_modify": "2025-04-26 07:03:00", "date_publish": "2025-02-28 08:10:42", "description": "Nottingham Forest podcast: Milenkovic on possibility of Europe", "filename": "sport_football_articles_cwyeennz0l5o_1745650980.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/30cd/live/82be8da0-f536-11ef-a372-9f83dba237c1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cwyeennz0l5o_1745650980.html", "title": "Nottingham Forest podcast: Milenkovic on possibility of Europe", "title_page": "Nottingham Forest podcast: Milenkovic on possibility of Europe - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Nikola Milenkovic says Nottingham Forest \"need to stay humble\" and \"keep improving\" if they want to end the season successfully and gain Champions League qualification.\nSpeaking on the latest episode of BBC Radio Nottingham's Shut Up And Show More Football podcast, the defender says he didn't think the club would be in contention for Europe when he originally joined, but \"it's the reality\" now.\n\"Nobody expected us to be in this position, we are not surprised now - it's the reality - we need to stay humble with our feet on the ground and keep improving,\" he told the BBC Radio Nottingham podcast.\nMilenkovic has had to adapt to playing different formations throughout the season, but believes the team are capable of playing however they are set up.\n\"There are some differences between playing a three or four, but I think today defenders are modern so they need to know how to play three or four - it doesn't matter anymore,\" he added.\n\"There are differences, with three there is less movement on the sides and with four you need to run more - we are ready to play both, it's up to Nuno to decide.\"\nYoung defenders Murillo and Morato have often been partnering the Serbian in defence, and speaking about the Brazilians Milkenovic said: \"They're really good players. They're so young with big potential, I think they will get better and better, but they're already so good but they have really, really big potential.\n\"We also have [Willy] Boly and Zach [Abbott]. We are trying to help each other on the pitch and to know what the player next to you will do in certain moments so you will react better.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cwyeennz0l5o"}