{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:35:20", "date_modify": "2025-05-21 06:35:20", "date_publish": "2025-01-22 16:29:09", "description": "West Brom sign Northern Ireland midfielder Isaac Price from Belgian club Standard Liege for an undisclosed fee.", "filename": "sport_football_articles_c983pelw9wyo_1747809320.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4f5c/live/55b22e00-d8dc-11ef-a289-b3809f04eef2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c983pelw9wyo_1747809320.html", "title": "Isaac Price: West Brom sign Northern Ireland midfielder from Standard Liege", "title_page": "Isaac Price: West Brom sign Northern Ireland midfielder from Standard Liege - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "West Bromwich Albion have signed midfielder Isaac Price from Belgian club Standard Liege for an undisclosed fee.\nThe club's first new recruit since the return to the club of boss Tony Mowbray, he has agreed a four and a half year contract.\nThe Northern Ireland international began his career with Everton, making two substitute appearances in the Premier League but moved to Liege in 2023.\n\"Isaac is a bright, young player whose dynamic midfield play continues our commitment to develop a more youthful, attack-minded style,\" said sporting director Andrew Nestor.\n\"At just 21, Isaac already has good top-level experience and I'm pleased we have secured his services permanently on a long-term contract.\"\nPrice has won 18 international caps so far, scoring six goals including a hat-trick against Bulgaria last October.\nHe played 50 games in Belgium's Pro League and he leaves Liege with the club seventh in the table to join an Albion side in the same position and pushing hard for a play-off spot.\n\"It's a great opportunity for me to show the manager what I can do,\" said Price.\n\"I'd say I'm a box-to-box midfielder. I like to get involved in the attacking play but scoring more goals is an area I'd like to improve. I like defending as well. I love getting back and making tackles.\"\nWest Brom are next in action on Saturday with a home game against Portsmouth.", "url": "https://www.bbc.com/sport/football/articles/c983pelw9wyo"}