{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:10:51", "date_modify": "2025-05-20 13:10:51", "date_publish": "2023-08-01 09:44:00", "description": "Chelsea: 'Blues ready for the new season' - your views", "filename": "sport_articles_clwzx3eq7pxo_1747746651.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c3b1/live/9fbe6060-3043-11ee-8f52-fbf70e4bf742.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_clwzx3eq7pxo_1747746651.html", "title": "Chelsea: 'Blues ready for the new season'", "title_page": "Chelsea: 'Blues ready for the new season' - your views - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Chelsea boss Mauricio Pochettino is pleased with his forward options and said Nicolas Jackson and Christopher Nkunku \"complement each other really well\".\nWe asked what you made of the Blues' pre-season performances, and the squad.\nHere are some of your thoughts:\nJarvis: Obviously, it's great to see a fast-flowing and confident Chelsea on this pre-season tour. However, I thought the idea was to slim down an unmanageable squad. More and more new players are turning up on what seems to be a daily basis! And we are still stuck with Lukaku!\nDavid: Poch seems level-headed and clear-sighted about who Chelsea are and the kind of players he wants - ie. no splash buys if the player does not suit the formation. Striker/goals seems to have been addressed, the key 18 need to be sorted. Top four is a must.\nEric: The impressive friendly performances prove that Chelsea are ready for next season. However, Cucurella, Sterling and Chukwuemeka will have to fight for their positions before it's too late. Adding Caicedo, Kudus and Disasi will help boost the young players. Poch should avoid wasting talents on loan deals but rather nurture them to grow as a team.\nNick: I've been really energised by Chelsea's performances so far. Hoping the Dortmund game will give us an insight into a potential starting line-up, but no-one has let us down. Nkunku, Jackson, Mudryk and Madueke looks to be a front four that would scare any defence in the Premier League, especially supported by Chukwuemeka, Chilwell, James and Enzo.", "url": "https://www.bbc.com/sport/articles/clwzx3eq7pxo"}