{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:04:37", "date_modify": "2025-05-21 04:04:37", "date_publish": "2025-01-15 09:22:47", "description": "Huddersfield Town sign Bolton Wanderers striker Dion Charles for an undisclosed fee on a two-and-a-half-year deal.", "filename": "sport_football_articles_cd6404v70p1o_1747800277.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/911a/live/5b36ce20-d31f-11ef-b2be-934577244959.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cd6404v70p1o_1747800277.html", "title": "Dion Charles: Huddersfield Town sign Bolton Wanderers striker", "title_page": "Dion Charles: Huddersfield Town sign Bolton Wanderers striker - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Huddersfield Town have signed Bolton Wanderers striker Dion Charles for an undisclosed fee on a two-and-a-half-year deal.\nThe 29-year-old Northern Ireland international scored 45 goals in 122 league appearances for the Whites.\nBolton boss manager Ian Evatt revealed that the club had accepted an offer from their League One rivals for the Northern Ireland international after their EFL Trophy win at Lincoln on Tuesday.\nCharles did not feature in that match and had only been a substitute in their past two League One matches.\n\"We've had an offer for Dion that we've deemed acceptable,\" Evatt told BBC Radio Manchester, external. \"It's from Huddersfield.\n\"We've come together and we've decided that it's an acceptable offer for us and that's all I really need to say on it.\"\nCharles could make his debut for the Terriers, who are fourth in the third tier and unbeaten in the league since 1 October, at Blackpool on Saturday.\nTown have scored 37 goals in 24 games, 13 fewer than second-placed Wycombe, and bolstered their frontline earlier this month with the addition of striker Joe Taylor from Luton Town.\n\"I was immediately attracted to the ambition of the club and prospect of playing my part in getting Huddersfield Town back where we belong, so I'm delighted to have completed the move and become a Town player,\" Charles told the club website., external\n\"There's a really important second half of the season to come, but with the team in great form and the mood around the club so positive, I'm just looking forward to pulling on the shirt for the first time and showing what I'm all about.\"", "url": "https://www.bbc.com/sport/football/articles/cd6404v70p1o"}