{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:52:15", "date_modify": "2025-05-21 06:52:15", "date_publish": "2025-03-29 19:50:52", "description": "Boss Daniel Farke is \"100% convinced\" that Leeds United will play in the Premier League next season.", "filename": "sport_football_articles_c8x8llklk98o_1747810335.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a2ee/live/a37211c0-0cd3-11f0-9025-f3e7e963b60e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c8x8llklk98o_1747810335.html", "title": "Daniel Farke: Leeds United boss '100% convinced' Whites will win promotion", "title_page": "Daniel Farke: Leeds United boss '100% convinced' Whites will win promotion - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Boss Daniel Farke has said he is \"100% convinced\" that Leeds United will play in the Premier League next season, despite missing the chance to go back to the top of the Championship.\nZan Vipotnik's 96th-minute equaliser earned Swansea City a point from a 2-2 draw at Elland Road, leaving Leeds two points behind Sheffield United, who took over as leaders after beating Coventry 3-1 on Friday.\nLeeds were five points clear of the Blades after winning at Bramall Lane late last month.\nBut after collecting only six points in five games since, Farke's side now find themselves second, only ahead of third-placed Burnley on goal difference.\n\"We have gone many, many steps and right now it's the final step. That's always the most difficult,\" he said.\n\"There's never a guarantee of success but we have been in this situation before.\n\"I know how tricky it sometimes is to lead from the front but also what is necessary to bring it over the line and we will try everything to make sure the lads have the best chance to make the final step.\n\"If you ask me right now, I'm 100% convinced that next season we will play in the Premier League.\"\nLast season, Leeds saw their automatic promotion hopes derailed by a run of only one win from their final six league games, including a 4-0 thrashing at QPR, which allowed Ipswich to claim second place alongside champions Leicester.\nAnd they suffered further disappointment in the play-offs, losing to Southampton at Wembley in the final.\nHowever, Farke has insisted that last season has no bearing on their chances this time.\n\"It's a different group and a different scenario,\" he said. \"Last season we were not in the situation of leading from the front, or had a point gap to the others or the others had to chase.\n\"This season we have been in the leading role and we are still in the situation that if we win we will finish in the top two due to the fact they [Burnley and Sheffield United] have to play against each other.\"\nLeeds had the perfect start against Swansea, with Brenden Aaronson giving them a first-minute lead before Illan Meslier saved a Josh Tymon penalty.\nKeeper Meslier then dropped the ball to gift Harry Darling an equaliser only for Willy Gnonto to seemingly win it for Leeds.\nHowever, Vipotnik fired home deep into stoppage time to silence Elland Road - in stark contrast to the joy the Leeds fans felt following late comeback wins against Sunderland and Sheffield United last month.\n\"If you want to take part in sports, you can't expect the sun to be always shining,\" Farke told BBC Radio Leeds. \"Sometimes you are on the wrong end over the course of a long season.\n\"We have had great winners at the last moment of the game when the opponent felt the disappointment and had to suffer like we did today.\n\"Today we are on the wrong end. If you concede an equaliser in this manner then of course it's heartbreaking.\"\nKeeper Meslier has come in for criticism this season following a series of high-profile errors and was at fault for Swansea's first equaliser.\nHowever, Farke refused to criticise his keeper and admitted his team was flat after the international break.\n\"It was obvious to see what happened today,\" he said. \"It was a typical first game after an international break, it was a scruffy game. We weren't at our best.\n\"The team was more or less not together for two weeks, we just had one training session.\n\"We spoke at half-time about shaking off the rustiness of the international break and we were much better in the second half.\n\"We reacted fantastically to their [first] equaliser. We found the next gear and the substitutions made an impact.\n\"We took the risk bringing Willy [Gnonto] on and it looked like it was written for him to score the winner.\"", "url": "https://www.bbc.com/sport/football/articles/c8x8llklk98o"}