{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:36:23", "date_modify": "2025-04-26 04:36:23", "date_publish": "2025-02-28 11:55:08", "description": "Liverpool news: Trent Alexander-Arnold - Ball winner? Risk taker?", "filename": "sport_football_articles_cq8yy7lppxzo_1745642183.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/79dd/live/fb707880-f522-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cq8yy7lppxzo_1745642183.html", "title": "Liverpool news: Trent Alexander-Arnold", "title_page": "Liverpool news: Trent Alexander-Arnold - Ball winner? Risk taker? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Which Liverpool player has won possession the most times this season?\nRyan Gravenberch would be a popular and correct answer. His winning of the ball 146 times leads from a player who few would instinctively select.\nSecond on the list - despite social media snippets and memes on how many times he has been dribbled past - is a certain Trent Alexander-Arnold.\nThe full-back, so often derided for his defending, must be doing something right given he has regained possession on 118 occasions. That puts him ahead of scurrying midfielder Alexis Mac Allister (112) and the galloping Dominik Szobozslai (106).\nSo where does the critical narrative come from?\nAlexander-Arnold, 26, is of course out of contract this summer. Wherever his future takes him, the 'dribbled past' label is one he could do with shaking off. Does it carry weight? In a word, yes.\nThis season an opponent has gone past him 51 times. For Liverpool, Mac Allister sits second in that unwanted metric on 38, before a substantial drop. Bradley - who of course challenges Alexander-Arnold at right-back - has been passed seven times with a dribble.\nOn top of that, according to Opta data, Alexander-Arnold has only won around 20% of his aerial duels, with Bradley at 71%. Ibrahima Konate (76%), Gravenberch (75%) and Virgil van Dijk (71%) stand well clear, with left-back Andy Robertson on a lowly (26%), much like Alexander-Arnold.\nWhen mapping the number of errors leading to a shot, Alexander-Arnold also tops the pile on four, two clear of captain Van Dijk.\nIn truth, the data paints a confusing picture of a player who opposition teams seem to target. This allows him to win possession back a lot for the Reds but opens him up to a greater number of dribbles, errors and aerial challenges.\nIt appears, from the numbers at least, he remains a defender under pressure. His manager, team-mates and a supportive fanbase will however continue to point to his attacking output.\nIn a competition where Mohamed Salah has his own ball to play with at the top of the rankings, Alexander-Arnold has created the second highest number of chances and is also second for assists at Liverpool.\nHe embodies risk and reward. The league table currently points to the Reds coming out on the right side of the equation.", "url": "https://www.bbc.co.uk/sport/football/articles/cq8yy7lppxzo"}