{"authors": ["Nick Hope", "www.facebook.com"], "date_download": "2025-05-20 14:11:06", "date_modify": "2025-05-20 14:11:06", "date_publish": "2023-07-30 08:19:04", "description": "Tom Daley will return to diving after a two-year break and bid for a place at Paris 2024.", "filename": "sport_diving_66353357_1747750266.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/182FC/production/_130586099_gettyimages-1364078920.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_diving_66353357_1747750266.html", "title": "Paris 2024: Tom Daley to return to diving after two-year break", "title_page": "Paris 2024: Tom Daley to return to diving after two-year break - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tom Daley will return to diving after a two-year break and bid for a place at Paris 2024 after son Robbie said he wanted to see his father compete at an Olympics.\nDaley, 29, won gold in the 10m synchro alongside Matty Lee at the Tokyo Olympics but has not competed since.\nAfter opting against returning for this year's World Championships, where the first batch of Olympic qualification quota places were on offer, it was widely thought Daley was planning to officially call time on his career.\nHowever, he says a recent visit to the Olympic and Paralympic Museum in Colorado Springs, USA, with his son Robbie changed the direction of his life.\n\"Paris 2024 is definitely a goal,\" the Olympic, world, European and Commonwealth champion said in a post on social media., external\n\"I'm not ready to be done and I don't think I was ready to be done and hang up my trunks and move on with that part of my life and especially when my son Robbie said 'Pappa I want to see you dive at the Olympics'.\"\nDaley, who recently became a father for the second time to son Phoenix, says he wants to \"set an example\" to his children by \"working hard\" to achieve what would be a British-record fifth Olympic Games appearance for a British diver.\nAfter making his Olympic debut as a 14-year-old at Beijing in 2008, he won bronze medals at London 2012 and Rio 2016, before finally claiming gold at the delayed Tokyo Games in July 2021, where he also won another individual bronze.\n\"We had the best time at time at the Olympic and Paralympic Museum playing different games and at the end we went into a room to watch a video about what it means to be an athlete and see those inspirational journeys,\" recalled the three-time world champion.\n\"I just wept; I couldn't control myself, I hadn't grieved diving.\n\"I hadn't been doing it anymore and that I in theory had retired and couldn't imagine going back to doing it again.\n\"Coming out of that museum something changed in me and that has lit a new flame and fire inside me to see where this goes.\"\nThe British diving team recently returned from the 2023 World Championships with an impressive haul of three medals, but notably did not claim podium finishes in the men's 10m or men's 10m synchro events.\nDaley's Olympic gold medal-winning team-mate Lee and his new partner Noah Williams claimed world silver together in 2022, but finished fourth in Japan.\nShould his return progress as he hopes then Daley's first competition back is likely to be the World Championship selection event at the end of the year before the Doha World Championships in February.\nThe Paris Olympics will be held from 26 July to 11 August 2024.", "url": "https://www.bbc.com/sport/diving/66353357"}