{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:39:20", "date_modify": "2025-05-20 12:39:20", "date_publish": "2023-08-03 17:00:26", "description": "Celtic squad in 'learning phase of development' - Rodgers", "filename": "sport_articles_c512j5dnp2go_1747744760.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1d6d/live/d51e1430-321e-11ee-8f52-fbf70e4bf742.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c512j5dnp2go_1747744760.html", "title": "Celtic squad in 'learning phase of development' - Rodgers", "title_page": "Celtic squad in 'learning phase of development' - Rodgers - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Brendan Rodgers believes there’s more improvement to come from the Celtic squad after last season’s treble-winning exploits.\nRodgers gets his second Parkhead reign under way with the visit of Ross County on Saturday.\n“It’s a fantastic group of players that are still very much in the learning phase of their development and I’ve really enjoyed working with them so far,” he said.\n“The standards have been set here over many years, not just the last 5-10. Celtic as a club has a high expectation, high standards, and any manager coming into here that’s what you embrace and look forward to.\n“I understand what they are and that was a big reason for me coming back here, to try to continue and develop those and improve those.”\nRodgers is relishing his competitive Celtic Park bow after being given a warm reception by the fans at James Forrest’s testimonial game in midweek.\n“Nothing but excitement and really looking forward to it,” he said. “We obviously had a really good night in James’ testimonial and the crowd were ever so kind.\n“My focus is purely on preparing the team, but just driving up to the stadium and seeing all the supporters at the weekend, and obviously the flag day, which is a commemoration of the great work the players and staff did last season, is a symbol of what we’re fighting for to win again. It gives great motivation.”", "url": "https://www.bbc.com/sport/articles/c512j5dnp2go"}