{"authors": ["David Mohan", "www.facebook.com"], "date_download": "2025-04-26 06:14:52", "date_modify": "2025-04-26 06:14:52", "date_publish": "2025-03-01 23:08:24", "description": "Belfast's Lewis Crocker wins a dramatic IBF eliminator against Paddy Donovan after his opponent is disqualified for delivering a punch after the bell at the end of the eighth round.", "filename": "sport_boxing_articles_cqjd41g0ee4o_1745648092.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7f10/live/712b2960-f6f1-11ef-98bc-4dd6895299ec.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_boxing_articles_cqjd41g0ee4o_1745648092.html", "title": "Lewis Crocker v Paddy Donovan: Belfast fighter wins chaotic fight via disqualification", "title_page": "Lewis Crocker v Paddy Donovan: Belfast fighter wins chaotic fight via disqualification - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A hugely dramatic night in Belfast ended in chaotic scenes as Lewis Crocker was awarded the win in his IBF world title eliminator after opponent Paddy Donovan was disqualified at the end of the eighth round.\nCrocker's unbeaten professional record survived after referee Marcus McDonnell called time on a thrilling contest because Donovan landed with a big right hand delivered after the bell.\nThe sudden conclusion came just after the Limerick fighter had sent Crocker down with a huge shot.\nDonovan earlier had points deducted in rounds six and eight for use of the elbow and head.\nThe dramatic finish resulted in confusion as Donovan initially thought he had secured the knockout before realising McDonnell had disqualified him.\n\"The crowd is ferocious in here. They say I hit him after the bell, but I thought I hit him on the bell,\" Donovan told DAZN.\n\"You can see Lewis was a beaten man and I won the fight fair and square. The ref took my dreams away tonight.\"\nDonovan added: \"We're going to appeal the decision and I want an automatic rematch right on the spot.\"\nBelfast fighter Crocker spent most of the opening round marching forward with his hands high and tight, his elbows tucked, with southpaw Donovan looking for separation to let his fast hands go and its was the latter who was the busier.\nThe contest began to open up in the second as they both got through with shots on the inside, but Crocker was more economical as he seemed determined not to waste anything by throwing for the sake of it, yet this was allowing Donovan to get into a flow although he was forced to work non-stop.\nA cut appeared over Crocker's right eye in the third with referee McDonnell signalling it came from a punch and it was becoming a gruelling battle as the boxers traded up close.\nDonovan seemed to use downstairs as his target with Crocker bringing the uppercut into play but he would find himself with a huge welt under the left eye by the end of the fourth.\nThese were visible signs that 'The Real Deal' was making a dent - his speed was hugely effective as he was first to land when they were at middle distance.\nDonovan had been warned on a couple of occasions for use of the elbow and in the sixth, it was once too many as a point was deducted.\nStill, there was a sense that Donovan was in the lead on the cards and Crocker needed something to get a bit of momentum to bring his crowd back to life.\nA couple of shots did that in the seventh, but Donovan's use of the head saw him on the end of another scolding and perhaps fortunate not to lose another point.\nHis response was to up the pace as he threw in flurries, closing out the round in good style and he seemed to be on top in the eighth as he marched forward, but did ultimately lose that second point for use of the head.\nAgain, he upped the pace and a shot into the mid-section had Crocker down. The Belfast man rose and threw some wild shots as they heard the bell, but Donovan wasn't done and inexplicably threw well after the bell on a vulnerable Crocker who was down and there was no option but to call it.\nWhat happens next is difficult to predict as Crocker moves to 21-0 and Donovan is now stuck with a first loss. As it stands, it is the Belfast man moving on to a welterweight title shot, although a rematch may not be out of the question.\nOn the undercard, Padraig McCrory suffered an eighth-round loss to Craig Richards as a body shot from the Londoner closed the show.\nKurt Walker improved his record to 12-0 as the Lisburn featherweight came through an all-action battle against former Anthony Cacace foe Leon Woodstock to win via majority decision (97-93, 96-94, 95-95).\nSteven Ward claimed the bragging rights in his all-Belfast clash against Tommy McCarthy with a sixth-round stoppage.\nMcCarthy was down from a big left at the end of the second and then again from a right in the sixth - this time unlocking the door to the finish as the follow-up assault saw referee Hugh Russell Jnr step in.\nIn another local derby at super-bantamweight, Ruadhan Farrell settled the argument with a 79-73 points win over Gerard Hughes after the pair drew at the same venue in late 2023.\nEarlier in the night there were points wins for Jack O'Neill and Aaron Bowen, but Tipperary's Shauna Browne was sensationally blasted out by Elif Nur Turhan after just 43 seconds of their WBC lightweight eliminator.", "url": "https://www.bbc.co.uk/sport/boxing/articles/cqjd41g0ee4o"}