{"authors": ["Amy Canavan", "www.facebook.com"], "date_download": "2025-05-21 04:32:03", "date_modify": "2025-05-21 04:32:03", "date_publish": "2025-04-05 07:12:00", "description": "Amy Canavan ponders Scotland women's position after a 4-0 loss at home to Germany in the Nations League.", "filename": "sport_football_articles_cy8ey1xzj7vo_1747801923.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d098/live/d06bda40-11b4-11f0-9370-59b7b42c0429.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy8ey1xzj7vo_1747801923.html", "title": "Scotland women 'in transition' but where should they be heading after 4-0 loss to Germany?", "title_page": "Scotland women 'in transition' but where should they be heading after 4-0 loss to Germany? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "There is little doubt Scotland are in a period of transition. There is, though, an abundance of uncertainty as to where they fit in, in the women's international game.\nFriday night's four-goal defeat by Germany was another example that League A of the Nations League - or at least competing competitively there - is a stretch too far for the Scots.\nThat was made evident on their first foray in the competition's top tier back in 2023 when they picked up just two points - in back-to-back draws with Belgium - and finished bottom, resulting in relegation to League B.\nWhen there last year, though, the Scots were unbeaten with five wins from six, having netted 13 goals in the process.\nWhile such results built up the feel-good factor around Pedro Martinez Losa's then-side, midfielder Erin Cuthbert suggested the scores perhaps created a \"false sense of security\" in the lead up to their ultimate Euro 2025 play-off final failure against Finland.\nOver the two legs, Scotland struggled to lay a finger on the Finns. Although their performance against the Netherlands last month was an improvement on the anonymous showing against Austria on matchday one, they were outclassed by the Germans at Tannadice.\nSo just where, or what, is Scotland's level?\nIt seems foolish to say, but Scotland were the more dominant side in the first half in Dundee, despite going in two goals down.\nA couple of sucker-punches - the opener inside a minute and an own-goal for the second - set them back in an otherwise comfortable first 45.\nThe return of Amy Rodgers and her defensive instincts allowed Real Madrid's Caroline Weir and Chelsea's Cuthbert to create and control the tempo at Tannadice.\nBoth missed chances and passes in the final third, though, something which Cuthbert believes is one of the recurring issues at this level for her side.\n\"That little bit of cutting edge, finding a moment, a pass - the killer pass, the killer ball, the killer shot, maybe that's the difference between winning and losing games,\" the 26-year-old said.\n\"We want to be hard to beat first and foremost. We're disappointed giving away four goals, whether it's a transition period or not, we're disappointed. It's no excuse.\n\"We want to be keeping clean sheets, being hard to beat and then taking our chances when they come.\"\nHad Scotland done that, they might have struck a little fear into their better opponents - like they did last month, for a wee while at least, by taking the lead against the Dutch.\nBut fleeting, fine moments from a side building for the future is far from what's required at this elite level. Superiority soon squashes sentiment.\nInterim head coach Michael McArdle ought to be admired for using his time at the helm as a chance to change things up a bit.\nOnly five players who started in Helsinki in December did so at Tannadice, while three who featured at all didn't even make this squad.\nIt's been quite the shake-up, and arguably one required, after the golden generation appeared to miss their golden hour by failing to reach a major tournament for the third time in a row.\nBut this group, littered with future stars as well as experienced players at their peak, appear a little in limbo.\nUnderstandably, the players say they want to be in League A, testing themselves against the cream of the continent, but results would consistently show it's quite the reach. When do the scuddings start to outweigh the learnings?\nShould the Scots drop back into League B, which they're on course to do, they'd then, in most cases, go into games as favourites against sides they simply are stronger than.\nThe message from the campaign in 2023, which ended with the calamitous thrashing at home to England, was that they believed they'd matured and improved against the top teams. Something which would prepare them for qualifying for the Euros.\nThat, obviously, didn't come to fruition.\nMcArdle says the aim for now is to break in, and remain, in the world's top 20. Scotland are currently 24th, while there are 12 European nations in that target bracket. On paper, that would suggest the Scots should be a League A side.\nBut since McArdle's predecessor, Martinez Losa, took over in July 2021, only once have the Scots beaten a top-30 side in a competitive game - a 1-0 World Cup play-off semi-final against Austria more than two years ago.\nGames like Friday offer up \"valuable experience and exposure to international football\" insists Cuthbert, but exactly what Scotland are gaining and where they are growing, remains up in the air.", "url": "https://www.bbc.com/sport/football/articles/cy8ey1xzj7vo"}