{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:04:47", "date_modify": "2025-05-21 04:04:47", "date_publish": "2025-01-09 00:00:00", "description": "Premier League strugglers Everton begin their post-Sean Dyche era with victory over League One Peterborough in the FA Cup third round.", "filename": "sport_football_live_c4gp1pjjx03t_1747800287.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c4gp1pjjx03t_1747800287.html", "title": "Everton 2-0 Peterborough: Beto and Iliman Ndiaye goals seal FA Cup third-round win", "title_page": "Everton 2-0 Peterborough: Beto and Iliman Ndiaye goals seal FA Cup third-round win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Premier League strugglers Everton began their post-Sean Dyche era with victory over League One Peterborough in the FA Cup third round.\nThe build-up to Thursday's tie had been overshadowed by the bombshell news of manager Dyche's sacking, which was announced by the club just three hours before kick-off.\nWith Everton Under-18s boss Leighton Baines and captain Seamus Coleman installed as caretaker managers, the pair led the side to victory on a bitterly cold evening at Goodison Park.\nPortuguese striker Beto scored the opening goal of the contest three minutes before half-time, latching on to teenager Harrison Armstrong's sublime through ball before going round goalkeeper Nicholas Bilokapic and slotting in.\nJust before the goal, Beto had sent a header straight at the visiting keeper, while midfielder Orel Mangala rattled the top of the crossbar with a delightful volley.\nDarren Ferguson's side did have a couple of chances of their own - winger Cian Hayes seeing an effort blocked in front of goal by Jarrad Branthwaite and Ricky-Jade Jones having a strike towards the near post pushed away by Joao Virginia.\nIliman Ndiaye's injury-time penalty ensured Everton's name will be in the draw for the fourth round, but there will be major concerns over on-loan striker Armando Broja, who was taken off on a stretcher with an apparent leg injury.\nThis was just the second competitive meeting between the two sides and was set to pit English football stalwarts Dyche and Ferguson against each other, with the pair having a combined 1,388 games of managerial experience.\nBut dramatic circumstances in the lead-up to the game ended with Dyche being dismissed by Everton owners the Friedkin Group after discussions between the two parties.\nDyche had been at the training ground earlier in the day and it was his starting eleven deployed in the game, with former team-mates Baines and Coleman asked to take charge of the team in the afternoon.\nFive-time FA Cup winners Everton progressed in the competition but showed few signs of a bounce from the managerial change in front of a subdued crowd, with the team often failing to break the lines against a side 19th in the third tier.\nOn the one rare occasion that impressive 17-year-old Armstrong did manage to slip a pass through, Everton scored the goal that gave them the lead.\nBeto, who was given limited game-time by Dyche, showed what the goal-shy Blues have been missing with a well-taken effort to take his tally to three for the season.\nLate in stoppage time, Ndiaye scored from the spot to lead the side's scoring chart with four goals this term after Branthwaite was bundled over at the back post by Jadel Katongo.\nMeanwhile, Everton will await the appointment of a new manager as well as the extent of Broja's injury, sustained in a tackle by visiting defender Emmanuel Fernandez which took the ball and wiped out the man.\nThe contest also missed out on featuring a father-and-son duo in action against each other - experienced Everton full-back Ashley Young came on as a substitute in the second half, but his teenage son Tyler remained on the Peterborough bench.", "url": "https://www.bbc.com/sport/football/live/c4gp1pjjx03t"}