{"authors": ["Andy Burke", "www.facebook.com"], "date_download": "2025-05-21 06:16:05", "date_modify": "2025-05-21 06:16:05", "date_publish": "2025-01-31 14:10:48", "description": "Finn Russell says Scotland must be ready to face the strongest Italy side he has faced when they kick off their Six Nations campaign on Saturday.", "filename": "sport_rugby-union_articles_ckg0mll3p95o_1747808165.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a8fe/live/ea65a810-dfda-11ef-a819-277e390a7a08.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_ckg0mll3p95o_1747808165.html", "title": "Six Nations 2025: Finn Russell ready for 'strongest Italy' side", "title_page": "Six Nations 2025: Finn Russell ready for 'strongest Italy' side - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Finn Russell says Scotland must be braced for the best Italy side he has ever faced when they kick off their Six Nations campaign at Murrayfield on Saturday.\nThe Scots' title challenge was derailed last year when they lost to the Azzurri in Rome.\nAnd with danger men such as Juan Ignacio Brex, Tommaso Menoncello and Ange Capuozzo behind a powerful pack of forwards, Russell knows injury-hit Scotland will need to hit the ground running.\n\"I think the first game of the tournament is tough for everyone because you've not seen what's going to happen,\" Russell said.\n\"You get further into the tournament, you get a feel for how teams are trying to play and I think over the past few years Italy have always had something different and something up their sleeves.\n\"It's going to be interesting to see if they have something and how we adapt to that.\n\"But for me, it's the best, strongest Italian team that I've faced.\"\nScotland have not won the title in the 25 years of the Six Nations era and have failed to even mount a serious challenge since they won the last Five Nations Championship in 1999.\nMany believe the current squad to be the best since Jim Telfer's champion side, although that has been considered the case for a number for years now, and Russell says the team must find a way to block out the noise coming from outside the camp.\n\"I think the last few years we've come in with some expectations and with the group that we've got, I think it's quite right to have those expectations,\" said the 32-year-old, who will co-captain the Scotland side alongside Rory Darge following Sione Tuipulotu's injury.\n\"I think we've come in with a really good mindset this tournament, which in my opinion has been different to the last few or any of the ones I've been involved in, which is great to see.\n\"But I think we've got to focus on now just getting Saturday right and depending on the outcome, we'll get back on Monday and we'll reassess where we are and go again.\n\"That's been a point we've been trying to drive this week, of not looking at winning the tournament just yet - that's obviously the goal for every team in it, but there's a long way to go before you get that title obviously.\n\"And we need to get the training right, then we need to get each game right as it comes and if we're to win on Saturday, the media starts talking Scotland up, the expectations go up a little bit.\n\"We can't let that affect us, we've just got to control what we can and make sure that all the outside noise doesn't get into the camp and we just focus on our job and stay grounded and stay true to what we're trying to achieve here.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/ckg0mll3p95o"}