{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:21:22", "date_modify": "2025-05-21 05:21:22", "date_publish": "2025-01-14 17:21:26", "description": "Nottingham Forest vs Liverpool - fans preview", "filename": "sport_football_articles_c9d5ln677wdo_1747804882.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6a91/live/88cd0420-d262-11ef-9dbb-9559c8b74d9b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c9d5ln677wdo_1747804882.html", "title": "Nottingham Forest vs Liverpool", "title_page": "Nottingham Forest vs Liverpool - fans preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "\"If tonight goes our way, people might start to think differently.\"\nNottingham Forest fan Ben Marshall says the club's supporters have been coy about thinking their side is in the title race - but accepts that could change quickly.\n\"We've got to be realistic,\" he told BBC Radio 5 Live Breakfast. \"Tonight is a really tough test - it all still feels quite frankly surreal.\n\"You talk about a top of the table Premier League clash and then you realise it's us - it's fantastic.\n\"The whole city is excited - we're just enjoying the ride. European football is something we're absolutely in the frame for but we've got our feet on the ground.\n\"To suggest we're on for a title push is probably a little too soon, but if tonight goes our way, people might start to think differently.\"\nOn the other side of the game, Liverpool fan John Gibbons from The Anfield Wrap agreed on its importance and says there is \"respect\" for the challenge Forest will pose.\n\"We found them really tough to play against at Anfield and last year was similar,\" he said. \"Arne Slot was surprised earlier in the season that they lost, and I think Liverpool will have a lot more respect for them.\n\"It's a massive game for us and a big opportunity, if we can win the top of the table looks even better from a Liverpool point of view.\"\n\"I'm happy to put my neck on the line and say a Liverpool win. This team normally comes good on the big nights and it's a big one tonight.\n\"I think Liverpool will win 2-1.\"", "url": "https://www.bbc.com/sport/football/articles/c9d5ln677wdo"}