{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:33:27", "date_modify": "2025-05-21 04:33:27", "date_publish": "2025-04-04 21:10:41", "description": "Wales say the leg injury Ceri Holland suffered in their 2-1 defeat by Denmark \"is not as serious as first feared\".", "filename": "sport_football_articles_cj3x0vxgxmpo_1747802007.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3ca1/live/c6001700-1200-11f0-937d-1f221a30ef2a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cj3x0vxgxmpo_1747802007.html", "title": "Nations League: Wales allay fears over Ceri Holland leg injury", "title_page": "Nations League: Wales allay fears over Ceri Holland leg injury - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wales have allayed fears over the injury that led to midfielder Ceri Holland being helped off on a stretcher during their Friday night 2-1 Nations League defeat by Denmark at Cardiff City Stadium.\nHolland received treatment for close to 10 minutes and was taken straight to hospital with her right leg in a protective boot after a heavy collision.\nThe Football Association of Wales (FAW) posted on social media: \"Following swift action by the FAW medical team at last night's match after Ceri Holland's injury, assessments will continue between club and country medical teams.\n\"The leg injury is not as serious as first feared.\"\nHolland scored Wales' goal and was their player of the match as they performed admirably against Denmark.\nIn the aftermath of the game, boss Rhian Wilkinson expressed concern about the injury, saying: \"It looked like a really big tackle. We are hoping for a bone bruise, but we don't know anything at this point so we won't speculate.\"\nHolland was in tears as she was helped off with Wilkinson describing her efforts as \"excellent\".\nThe Wales boss added: \"She gives everything and puts her body on the line. We hope it is just one of those that hurt a lot. Fingers crossed that is what it will be.\"\nWilkinson added: \"I saw the tackle quickly on my iPad, to me it looked like two women fully committed to a tackle.\n\"She was obviously in a lot of pain and discomfort.\"\nFormer Wales international Nia Jones told BBC Match of the Day Wales that Holland's injury overshadowed the whole game.\n\"I am sure Rhian Wilkinson will say there's plenty to take from that game, but it's really difficult to look beyond what happened to Ceri Holland,\" she said.\n\"We are all hoping it's not as bad as it looked.\"\nWales international Sophie Ingle, who is currently sidelined after having anterior cruciate ligament (ACL) surgery, says Holland is a vital component in the Wales side.\n\"She is such a key player for us. She's on the trajectory of being really strong and always being a starter,\" Ingle told Match of the Day Wales.\n\"It didn't look nice. It was contact. I didn't really see a twist or anything.\n\"Sometimes it is better if it's straight contact, but the fact she was upset and stayed down is not like her. She usually gets up pretty much straight away.\"", "url": "https://www.bbc.com/sport/football/articles/cj3x0vxgxmpo"}