{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:25:22", "date_modify": "2025-05-21 06:25:22", "date_publish": "2024-12-24 12:05:03", "description": "Tottenham are \"short in a couple of areas\" and \"need to reinforce\" during the January transfer window, says Ange Postecoglou.", "filename": "sport_football_articles_c983pl13el7o_1747808722.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8fa4/live/f574df40-c1ea-11ef-9e39-993e47e9d020.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c983pl13el7o_1747808722.html", "title": "Tottenham: Ange Postecoglou says club \"need to reinforce\" during January transfer window", "title_page": "Tottenham: Ange Postecoglou says club \"need to reinforce\" during January transfer window - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tottenham are \"short in a couple of areas\" and \"need to reinforce\" during the January transfer window, says manager Ange Postecoglou.\nSpurs have lost three of their past four Premier League games to slip to 11th in the table, and were beaten 6-3 at home by Liverpool on Sunday.\nThat run has coincided with injuries to key players, including goalkeeper Guglielmo Vicario, and defenders Micky van de Ven and Cristian Romero.\nSpeaking before the club's trip to fourth-placed Nottingham Forest on 26 December, Postecoglou confirmed the club intend to strengthen in January.\n\"Like I said a while ago, we've been planning. A lot of it was going to be around where we're at around this time. Fair to say we're still a little bit short in a couple of areas and we need to reinforce,\" said Postecoglou.\n\"January's trickier in terms of what sort of players you can bring in. For us, ideal - for any club, I guess - you want to bring in people who are going to make you stronger.\"\nDespite Tottenham's indifferent Premier League form, they are through to the Carabao Cup semi-finals after a thrilling 4-3 win against Manchester United earlier this month.\nThey are also in contention to qualify for the next phase of the Europa League, and play Tamworth in the third round of the FA Cup on 12 January.\n\"It's not like our schedule's going to ease up at any stage. So I think it makes sense. We will try and reinforce,\" added Postecoglou.\n\"You don't just want to panic and bring in anybody, that you don't think will help our cause in the back half of the year, but I think we've already shown we are pretty methodical and prudent about our work.\"\nPostecoglou has faced questions over Spurs' recent Premier League results and his tactics, but he refused to place any of the blame on his players.\nHe added: \"They are giving absolute maximum effort and that's backed up by the physical parameters you put against what they're doing. They're trying to do it in the way that I'm asking them to. So how can I be critical of that?\"\nPostecoglou also defended his reaction last week, where he accused a Match of the Day reporter of discounting the impact of Tottenham's defensive injuries after their defeat by Liverpool.\n\"I wasn't angry, but I don't know many managers that bounce into interviews after a defeat and are all cheery,\" he said.\n\"Fair to say I am getting tired of the same questions over and over, and perhaps after a defeat it's easier to get a reaction.\"", "url": "https://www.bbc.com/sport/football/articles/c983pl13el7o"}