{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:14:51", "date_modify": "2025-05-21 06:14:51", "date_publish": "2025-01-01 09:44:43", "description": "Katie Boulter helps Great Britain beat Australia to reach the United Cup quarter-final in Sydney.", "filename": "sport_tennis_articles_cj90dle71xzo_1747808091.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0b28/live/4e902370-c851-11ef-9fd6-0be88a764111.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_tennis_articles_cj90dle71xzo_1747808091.html", "title": "United Cup: Katie Boulter leads Great Britain to quarter-final", "title_page": "United Cup: Katie Boulter leads Great Britain to quarter-final - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Katie Boulter beat Australia's Olivia Gadecki in straight sets to ensure Great Britain reached the United Cup quarter-finals in Sydney.\nBoulter knew a straight-set victory from any of the three rubbers against the hosts would take GB through as Group F winners.\nIn the first match of the tie, Boulter won 6-2 6-1 inside 70 minutes to secure qualification before Australia won the next two encounters.\nAlex de Minaur, Boulter's fiance, thrashed GB's Billy Harris 6-2 6-1 before joining up with Gadecki in the mixed doubles and beating Charles Broom and Olivia Nicholls 6-3 7-6 (7-3).\nBritain had beaten Argentina 2-1 in their opening tie at the event on Tuesday and while all three teams in the group finished with the same points, GB finished in top spot because they had won the most sets.\n\"I've been trying to avoid all the stats on all this but we were at dinner with [former British number one] Laura Robson last night, and she thankfully told me I had to win in straight sets,\" Boulter said.\n\"So I was feeling the pressure from last night.\"\nAlexander Shevchenko helped Kazakhstan reach the quarter-finals as they knocked out defending champions Germany, who were without world number two Alexander Zverev because of a biceps injury.\nPoland also qualified, with Iga Swiatek beating the Czech Republic's Karolina Muchova.", "url": "https://www.bbc.com/sport/tennis/articles/cj90dle71xzo"}