{"authors": ["Ciaran Varley", "www.facebook.com"], "date_download": "2025-05-21 06:14:46", "date_modify": "2025-05-21 06:14:46", "date_publish": "2024-12-22 00:16:22", "description": "Former England manager Gareth Southgate explains why he chose Adele's Someone Like You as one of his tracks on the latest episode of Desert Island Discs.", "filename": "sport_football_articles_cy4pdjpvz17o_1747808086.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4a00/live/d36e7df0-bd28-11ef-aff0-072ce821b6ab.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy4pdjpvz17o_1747808086.html", "title": "Adele, England & Man Utd: Gareth Southgate's Desert Island Discs", "title_page": "Adele, England & Man Utd: Gareth Southgate's Desert Island Discs - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Gareth Southgate has revealed on BBC Radio 4's Desert Island Discs that he made the decision to leave his job as England manager before the end of Euro 2024.\nThe 54-year-old, who was a guest on the latest episode of the long-running programme, chose Adele's Someone Like You as one of the eight songs he would take with him if cast away to a desert island, explaining to presenter Lauren Laverne that he \"kept playing it towards the end of the last Euros\" because \"I knew I was going to be leaving\".\nSouthgate resigned as manager in July, two days after England were beaten 2-1 by Spain in the Euro 2024 final.\nHe admitted that he had already decided before the final that it was \"time for change on all sides\".\nSpeaking about the Adele track, Southgate said: \"There were so many of the words in it that, even if I hear it today, it relates to my relationship with England.\"\nThe song, which appears on Adele's 2011 album 21, is written from the point of view of a woman addressing her ex-partner.\n\"They've got to move on and you wish them the best and there are regrets, but there were actually memories that were made,\" Southgate explained.\nThe former midfielder and defender managed his country for 102 games in eight years in charge and is the only manager bar 1966 World Cup winner Sir Alf Ramsey to lead the England men's team into a major tournament final, which he did twice – at Euro 2020 and Euro 2024.\nHe told Desert Island Discs that he is \"not against\" doing something \"totally different\" and that his next career move \"doesn't have to be within coaching\".\n\"When you're a coach and you've had one of the biggest jobs, how do you follow that up?\" said Southgate.\nSouthgate's fourth choice was The Whole of The Moon by The Waterboys, released in 1985.\nHe said that the track reminds him of pre-season tours in Portugal with Crystal Palace, whom he captained to the 1993-94 First Division championship after being named captain, aged just 23.\n\"There was a bar that we used to go in and at the end of the night, the band would play this track,\" Southgate said, explaining that the team would habitually stay until the end so that they could join in.\n\"Lads who played with me in that era would recognise this song from that period of our early 20s.\"\nSouthgate started out as an apprentice at Palace, earning £27.50 a week, \"plus your travel expenses,\" after being let go by Southampton aged 13.\nHe said that he is not \"bitter\" about his rejection by the Saints, but added: \"I've still got the letter at home, tucked away in a drawer.\"\nAlongside selecting eight different tracks, Southgate was allowed to choose a book and a luxury item.\nAs his luxury item, he selected a coffee machine, saying that he had become a \"coffee snob\" recently.\nSouthgate also chose The Chimp Paradox by psychiatrist Professor Steve Peters, who has worked with a number of elite athletes, including British Cycling, snooker player Ronnie O'Sullivan and both Liverpool and England football teams.\nSouthgate described Peters' work as \"a brilliantly simple way of explaining why we react in the way we do at certain moments\".\nHe also revealed that he is in a book club with other dads from his daughter's former school and that they have read 40-50 works of classic fiction, including JD Salinger's The Catcher in The Rye, Daphne du Maurier's Rebecca and Ian McEwan's On Chesil Beach.", "url": "https://www.bbc.com/sport/football/articles/cy4pdjpvz17o"}