{"authors": ["Dafydd Pritchard", "www.facebook.com"], "date_download": "2025-05-21 05:57:10", "date_modify": "2025-05-21 05:57:10", "date_publish": "2025-02-08 17:57:36", "description": "Cardiff City beat fellow Championship strugglers Stoke City on penalties in an exhilarating FA Cup tie to reach the fifth round.", "filename": "sport_football_articles_c5yex68kjx1o_1747807030.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5dc9/live/c5153ad0-e65b-11ef-a819-277e390a7a08.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c5yex68kjx1o_1747807030.html", "title": "Stoke City 3-3 Cardiff City: Bluebirds win on penalties", "title_page": "Stoke City 3-3 Cardiff City: Bluebirds win on penalties - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cardiff City overcame fellow Championship strugglers Stoke City on penalties in an exhilarating FA Cup tie to reach the fifth round.\nCardiff made a flying start with two goals in the opening 19 minutes as Rubin Colwill fired them ahead before Yousef Salech exploited hesitant Stoke defending to poke in.\nLewis Koumas struck with a firm low finish shortly before half-time to pull a goal back for the hosts, and the Wales forward scored again a minute after the restart to equalise.\nStoke then led through Lewis Baker's penalty, conceded by Bluebirds substitute Jasper Daland who managed to injure himself in fouling Emre Tezgel.\nBut the Welsh side were not done. Colwill scored his second with a low strike from the edge of the penalty area which seemed to take a touch on its way in.\nAfter both sides missed chances in extra time, Cardiff goalkeeper Ethan Horvath made what proved to be the decisive save in the penalty shootout from Michael Rose and Colwill converted his spot-kick to send Omer Riza's team through.\nCardiff can now look forward to a first fifth-round FA Cup tie in 11 years – with the draw to come on Monday – while Stoke will focus solely on avoiding relegation to League One.\nWith just one point separating the teams in the battle for Championship survival, 18th-place Stoke and Cardiff in 19th made 16 changes between them for this cup tie.\nDespite Koumas having an early headed goal disallowed for offside, Cardiff controlled the early exchanges after handing first starts to new signings Salech and Sivert Mannsverk and welcoming captain Aaron Ramsey back from injury for his first club appearance since August.\nColwill put the visitors in front in the eighth minute as he evaded a couple of Stoke defenders before finding the bottom corner with a left-footed strike.\nSalech headed wide soon afterwards but swiftly made amends, latching on to Joel Bagan's hopeful long ball and getting between Stoke centre-back Ben Gibson and goalkeeper Jack Bonham to lift the ball into the net.\nThe home side finished the first half strongly with Koumas latching on to Wouter Burger's excellent through ball to finish confidently.\nBurger also had a hand in the Wales international's second goal as his clever dummy from a throw-in allowed Koumas to cut inside on to his right foot and score from close range.\nIf Cardiff's defending was a little passive there, it was shambolic for Stoke's penalty. Daland failed to control a simple pass and, as the ball looped up, he was beaten to it by Tezgel, who he kicked to the ground in an attempt to clear.\nBaker converted his penalty and the Bet365 Stadium, quiet for much of the game, erupted.\nJust as Cardiff looked to be floored, they hauled themselves off the canvass as Colwill guided a right-footed effort into the bottom corner with the help of a deflection.\nJoe Ralls and Will Fish had chances to put the visitors back in front but were denied by Bonham, while both sides missed chances in extra time.\nIn the shootout, Salech and Tatsuki Seko hit the woodwork for each side before Horvath's save from Rose allowed Colwill to secure victory by powering his penalty down the middle.\nStoke manager Mark Robins told BBC Radio Stoke:\n\"We started really poorly. They didn't need to work very hard to get their goals. To turn it around, we showed good character and played good football\n\"We contrived to sit a little deeper, we were poor in the transition and from that point [Cardiff's third goal] the game became too scrappy.\n\"We're disappointed to go out but we've lost on penalties, not lost the game. Lewis Koumas was outstanding and we got minutes into players.\"\nCardiff manager Omer Riza told BBC Radio Wales:\n\"We made hard work of it. They [Stoke] showed good character to come back. We gave them a lifeline at 2-1 and didn't start the second half well enough.\n\"But the boys showed good character to come back and win the game in the end. That was satisfying.\n\"Rubin's been excellent and out of possession he had to work really hard. I think there was a bit of cramp setting in with a few of the lads. They showed really good character and togetherness, and I said to the boys that character could elevate us.\"", "url": "https://www.bbc.com/sport/football/articles/c5yex68kjx1o"}