{"authors": ["Liam McLeod", "www.facebook.com"], "date_download": "2025-05-21 07:36:37", "date_modify": "2025-05-21 07:36:37", "date_publish": "2025-01-22 10:16:08", "description": "Aberdeen: 'Calderwood provided Dons fans with memories to last a lifetime'", "filename": "sport_articles_cg7z27m5d4no_1747812997.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8671/live/fa5f2260-d840-11ef-87df-d575b9a434a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cg7z27m5d4no_1747812997.html", "title": "'Calderwood provided Dons fans with memories to last a lifetime'", "title_page": "Aberdeen: 'Calderwood provided Dons fans with memories to last a lifetime' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The draw for the fifth round of the Scottish Cup provided a very apt tie as Aberdeen and Dunfermline Athletic were paired in the fight for a quarter-final berth.\nIt comes in the week the sad news was announced that Jimmy Calderwood had lost his battle with dementia. He managed both and provided Dons and Pars supporters with memories that will last a lifetime.\nIt mustn't be forgotten how far down the hole Aberdeen had gone after several botched managerial appointments in the late 1990s and at the turn of the century.\nThe decade between winning the League Cup in 1995 and Calderwood taking the reins was pretty grim for Dons fans, with the odd win over the big Glasgow two and two cup final appearances under Ebbe Skovdahl about the extent of the pleasure they could draw from their team.\nClub legend Willie Miller arrived back at Pittodrie in 2004 in the role of director of football and Calderwood was in situ not long after to replace Steve Paterson with the team languishing in second bottom having jostled with the spectre of relegation more than once in previous seasons.\nCalderwood signed Hearts midfielder Scott Severin, breathed life into what was already in the building and the Dons improved almost immediately. They were unfortunate to miss out on third place in that first campaign.\nThey finished behind Tony Mowbray's talented Hibernian team that was content to lose 1-0 at home to Rangers on the final day as it meant they could pip Calderwood's men to a spot in the Uefa Cup on goal difference. It was the lesser-spoken about tale on Helicopter Sunday. That result left Aberdeen needing a five-goal victory over Hearts, but they ultimately had to settle for 2-0.\nCalderwood built on it, however, and Aberdeen were never out of the top six during his steady tenure though it was cup defeats to lower-league opponents that cost him the job in the end.\nHaving spoken to him about it, that was a massive regret of his, particularly the calamitous Scottish Cup semi-final loss to Queen of the South in 2008 with a Rangers side running on empty waiting in the final.\nHowever, history will be kind to Calderwood and his time at the club by those who watched the side, with those memorable European exploits against Dnipro, Copenhagen and Bayern Munich incredible high points.\nA good man gone but not forgotten.", "url": "https://www.bbc.com/sport/articles/cg7z27m5d4no"}