{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:46:23", "date_modify": "2025-05-20 11:46:23", "date_publish": "2023-08-07 11:44:13", "description": "Who will be champions, which clubs will spring a surprise and who are the players to look out for as Europe's top leagues get under way?", "filename": "sport_football_66270539_1747741583.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2799/production/_130673101_whatsubject.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66270539_1747741583.html", "title": "The big European preview: Predictions, ones to watch, surprise packages & more", "title_page": "The big European preview: Predictions, ones to watch, surprise packages & more - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Start date: Friday, 11 August\nCan defending champions Feyenoord build their own period of dominance in the Eredivisie after holding off PSV Eindhoven and stopping Ajax's charge for a fourth straight title?\nPSV will be aiming to get through the Champions League qualifiers to join Arne Slot's title-winning side in the group stage, while Ajax face a play-off to reach the Europa League proper.\nAs Heracles Almelo, PEC Zwolle and Almere City move up to the Dutch top division, Groningen, Cambuur and FC Emmen drop out.\nMichael Statham, Football Oranje\nChampions: The Eredivisie is gaining an extra Champions League ticket this season due to its rise to sixth place in the European coefficient rankings, so competition will be fierce not only for finishing first, but also second (which will now gift group-stage entry), and third (now a ticket for the qualifying rounds). We may see the traditional three of Ajax, Feyenoord and PSV joined by a youthful-yet-talented AZ Alkmaar and FC Twente, who have an incredible home league record of late.\nAjax are under new management in Maurice Steijn but still need a lot of work to recover from last season, added to the losses of players such as Dusan Tadic and Jurrien Timber.\nPSV also have a new manager in Peter Bosz, who will need to replace the influential Xavi Simons. Feyenoord therefore look the strongest shout to retain their Eredivisie crown - Slot has shown he is currently the best manager in the Netherlands, he has a strong playing squad, and the confident fans always make De Kuip a special home ground.\nTop scorer: Young Costa Rican striker Manfred Ugalde signed a permanent deal with FC Twente this summer. His end-of-season form on loan suggests he could kick on to rack up a big total. Ajax's Brian Brobbey and Feyenoord's Santiago Gimenez are two other names to consider given they will play regularly as first-choice strikers.\nSurprise package: NEC Nijmegen have made some shrewd signings to add to their experienced core of Jasper Cillessen and Lasse Schone. They may push for the European places.\nOne to watch: Jorrel Hato is the latest Ajax teenager to break through; I would expect the 17-year-old to start a lot of games at either centre-back or left-back this season. AZ Alkmaar signed 21-year-old defender Alexandre Penetra from Portuguese side Famalicao - he could be another name on people's lips in the future. As for an older player to watch, Noa Lang returns to the Eredivisie from Club Brugge with a big price tag as he looks to replace the goals and assists of Cody Gakpo at PSV.\nStart date: Friday, 11 August\nXavi's Barcelona are the reigning champions but will again face competition for the title from Real Madrid, who have strengthened with the signing of Jude Bellingham and teenage sensation Arda Guler but sold captain Karim Benzema to Al-Ittihad and lost Marco Asensio to Paris St-Germain.\nAtletico Madrid and Real Sociedad will join Barca and Real in the Champions League group stages.\nReal Valladolid, Espanyol and Elche were relegated to the Segunda Division, with Granada, Las Palmas and Alaves taking their place in the top tier of Spanish football.\nBarcelona will spend the season away from the Nou Camp as it undergoes renovation, moving to the Montjuic stadium in the city.\nRuairidh Barlow, editor Football Espana\nChampions: Neither Real Madrid nor Barcelona look dramatically better or worse. Barcelona will have more problems with a drop in hunger, a move to Montjuic and increased focus on Europe, but you don't lose 31 goals and replace them with a midfielder even if it is Jude Bellingham (although Kylian Mbappe's presence would make Real Madrid strong favourites).\nTop Scorer: Robert Lewandowski. The Polish striker is a level above the other finishers in the league - last year he was out of form for several months and still managed 23 goals.\nSurprise Package: Getafe. Given Girona, Rayo and Osasuna can no longer be counted as surprises, Getafe will come bounding back to mid-table and perhaps even the European race under the expert tutelage of Jose Bordalas with bite and brio. Slightly risky given goalscorer Enes Unal is out until January, but Getafe underperformed last season, and Bordalas almost always overperforms.\nOne to watch: Viktor Tsygankov is settled after his first six months at Girona - he was already putting in the odd brilliant performance, and the Catalans will lean into his brilliant left foot even more this season.\nStart date: Friday, 11 August\nLuis Enrique is the latest manager tasked with leading Paris St-Germain to European glory. In the league, PSG will hope to make it three titles in a row. Lens are in the group stages of the Champions League with PSG, while Marseille must go through qualifiers to secure their place.\nAuxerre, Ajaccio, Troyes and Angers were the four teams demoted from Ligue 1 as they reduced the amount of clubs from 20 to 18 for the 2023-24 season. This meant only two teams, Le Havre and Metz, secured promotion from Ligue 2.\nThomas Broggini, French football journalist\nChampions: My answer won't surprise you. Even if Lionel Messi left and despite Kylian Mbappe's situation, I don't see how PSG will not win Ligue 1, based on the potential of the new players they bought and the difference between them and the other teams. The new project with Luis Enrique can be very interesting. It will probably take time to see them at 100%, but it should be enough to win in France. Then, the Champions League is another story.\nTop scorer: If Mbappe stays, which is still possible, he will probably be top scorer again. Otherwise, Alexandre Lacazette (Lyon) is always very regular.\nSurprise package: Strasbourg could be a surprise, with Patrick Vieira as a coach and a new economic power. He is charismatic and experienced enough to lead this ambitious project. I believe a lot in Lorient, who have a brilliant coach (Regis Le Bris) and a very consistent idea of what they want - they bought interesting players and have this culture of playing attractive football.\nOne to watch: Lens could make another good season but it depends how they will handle the Champions League; it is always tricky for a team who is not used to it. Then, it is hard to predict something for Marseille, since a new coach (Marcelino) arrived, which is the case almost every season, but they could make do quite well considering the players who arrived, even more if Alexis Sanchez stays.\nStart date: Friday, 11 August\nBenfica won the Portuguese title last season and have strengthened by re-signing Angel Di Maria who previously played for the club from 2007 to 2010.\nJust two points separated Benfica from second-placed Porto, who secured Portugal's two Champions League group-stage spots. Braga must go through qualifying if they are to join them.\nMoreirense, Farense and Estrela da Amadora were promoted to the Primeira Liga, while Maritimo, Pacos Ferreira and Santa Clara will ply their trade in Liga Portugal 2 next season.\nDiogo Pombo, editor Tribuna Expresso\nChampions: Hard to tell, but, given what we saw from the pre-season and moves from the top clubs in the summer transfer market, Benfica seems to start ahead - they have the best squad depth, got Orkun Kokcu and Di Maria to strengthen their starting 11 and have a style of play that is hard to play against.\nSergio Conceicao's Porto need reinforcements (desperately in the left- and right-back positions) and creative spark in a team that he always gets the most out of in big games with his tactical mastery, but he needs a squad that gives him weapons. Sporting will continue with their tactical shape under Ruben Amorim, who enters his fourth full season in charge with questions marks regarding his ability to give something new to a well worked (and fully seen) model. Braga seem ready to challenge again for a top-three finish and a Champions League spot.\nTop scorer: If he ends up staying, Goncalo Ramos - because Benfica's style of play will continue to generate a lot for anyone who plays in the centre forward position. Viktor Gyokeres, a new addition at Sporting, may end up scoring a lot as well.\nSurprise package: Not that it's too surprising, but I reckon Braga will continue to force their way between the three 'Grandes'. They have the same coach, most of the key players from last season are still there and made a statement with their summer spending (Jose Fonte, Rony Lopes, Rodrigo Salazar). If they reach the Champions League group stage, much of their season will depend on how they manage the grind of challenging for a top-three spot while facing much tougher midweek opposition in Europe until Christmas.\nOne to watch: Despite his age, Di Maria still has the whole package (technique, creative spark, big-game experience, etc.) to wreck havoc amongst the opposition in the Portuguese league and be the standout performer in the competition.\nStart date: Saturday, 19 August\nAfter winning their first Scudetto in more than 30 years, Napoli face a tough task in retaining their title under new manager Rudi Garcia, while Juventus, who finished seventh, will be wanting to make up for ground lost last season after being docked points over the club's transfer dealings.\nLazio, Inter Milan and AC Milan join Napoli in the Champions League group stages, while Claudio Ranieri's Cagliari, Frosinone and Genoa are the sides with a point to prove after earning promotion from Serie B.\nInter, with star forward Lautaro Martinez joined by new recruit Marcus Thuram, should have plenty of goals in them.\nMina Rzouki, Italian football expert\nChampions: Inter. Last season's Champions League finalists should have challenged for the title last season and will surely start this new campaign as favourites again. Having reinforced their midfield even further, they boast strength in the middle and in defence and possess one of the finest strikers in the league.\nThe attack is yet to be completed considering the departure of both Edin Dzeko and Romelu Lukaku but Simone Inzaghi has shown that he is adept at creating teams that can play in a multitude of ways to secure victories. With Napoli bringing in a new coach and Milan signing so many new players, it is Inter who boast stability and the chance to continue this project that should lead them to another title.\nTop scorer: Victor Osimhen. In a year when everyone is desperate to buy the perfect and complete striker, Napoli can boast one of the very best number nines in the world. Fresh from lifting the Scudetto with Napoli, the club can count themselves lucky to have kept the player within the ranks.\nSmart, technically gifted, strong and with a mentality that belongs to the elite, Osimhen was top scorer last season and is the favourite to score an endless amount of goals again this term.\nSurprise Package: Atalanta. Having sold Rasmus Hojlund to Manchester United for a hefty profit, Atalanta have reinvested that money to bring in both Gianluca Scamacca and Charles De Ketelaere, two players who have yet to demonstrate their full potential. However under Gian Piero Gasperini, a coach renowned for teaching football and developing great talent, Atalanta could be the team to watch this season.\nItaly's famed tactician Arrigo Sacchi is not alone in thinking this squad could achieve a place in the top four and possibly challenge for more!\nPlayer to watch: Samuel Chukwueze. Milan have had a busy summer on the transfer market. They may have sold fan favourite Sandro Tonali but they have reinforced the squad especially in the attacking areas. With lots of names to look out for from Christian Pulisic to Yunus Musah, it is Chukwueze who could well make the difference.\nFor some time, Milan have had a lopsided attack, dependent on the attacking potential of Rafael Leao on the left. With Chukwueze set to play on the right, Milan will boast balance and two explosive and dynamic players on either wing.\nChukwueze is unpredictable, electric and capable of providing for the team on and off the ball after having been trained by greats like Unai Emery at Villarreal. His capability of performing on the big stage makes him the player to watch at this newly revolutionised Milan.", "url": "https://www.bbc.com/sport/football/66270539"}