{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:10:56", "date_modify": "2025-05-21 04:10:56", "date_publish": "2025-04-06 11:47:28", "description": "Hull City head coach Ruben Selles says it was important his side fought until the end in their 1-0 win at Sheffield Wednesday.", "filename": "sport_football_articles_ckg10kdx8deo_1747800656.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b2c0/live/067c1110-12da-11f0-b182-81b971f8bd66.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ckg10kdx8deo_1747800656.html", "title": "Hull City: Ruben Selles praises spirit in Sheffield Wednesday win", "title_page": "Hull City: Ruben Selles praises spirit in Sheffield Wednesday win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Hull City head coach Ruben Selles said it was important his side fought until the end in their 1-0 win at Sheffield Wednesday.\nCharlie Hughes' stoppage-time winner secured a vital three points in the Tigers' battle against relegation, lifting them up to 19th in the table.\nSelles lauded his players and added that they know the pain of losing by tight margins late in games.\n\"We knew we would need to stay in the game if we wanted to get chances, and at the end the boys got that header and three points,\" he told BBC Radio Humberside.\n\"We've been on the other side, where you lose the game in the final action, and today was a really good feeling.\"\nSelles also claimed the result shows how tough the Championship is to compete in.\n\"In a Championship game it's really difficult to read the opponent, especially away from home, but you need to manage to stay in the game and when there are good moments to score and you don't, you have to manage not to concede,\" he added.\n\"Every game since I have been here was decided by one action - a 1-0 or a 2-1 situation, and you have to fight for that to go to your side.\"", "url": "https://www.bbc.com/sport/football/articles/ckg10kdx8deo"}