{"authors": ["Mike Taylor", "www.facebook.com"], "date_download": "2025-04-26 08:09:39", "date_modify": "2025-04-26 08:09:39", "date_publish": "2025-02-26 12:55:19", "description": "Aston Villa news: Opinion - Mike Taylor on Unai Emery's 'wicked dilemma'", "filename": "sport_football_articles_cevxel1n7p8o_1745654979.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7437/live/663df3c0-f02f-11ef-a819-277e390a7a08.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cevxel1n7p8o_1745654979.html", "title": "Aston Villa news: Opinion", "title_page": "Aston Villa news: Opinion - Mike Taylor on Unai Emery's 'wicked dilemma' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "\"We have to be happy, because we have FA Cup on Friday, and we have Champions League next week. If we are not playing those competitions, we will rest a lot of days.\n\"Of course, I prefer to play in a lot of matches in different competitions like we are. But the Premier League we will play in 12 days again, and of course this is the first objective. I think we can achieve our objective.\"\nWhen you speak to Unai Emery, and observe him at work, it is hard to believe that there has ever been anyone quite so besotted with football as him. More specifically, he is clearly besotted by football matches.\nOccasionally, you meet a coach who leaves you with the impression that the coaching itself is the pure form of this work, and the matches are almost a disturbance. Not Emery. Although meticulous in his planning, you could imagine if he had enough resources he would manage a match every day and still never tire of it.\nBut the resources are the problem. Perhaps the workload is too obvious an explanation for Villa's misfiring form – especially away – this season, but it is becoming hard to see past it.\nThey maintained a similar schedule in the Conference League last season and still managed to finish fourth, but were clearly worn out by the end of April. Emery's annoyance last week at the scheduling of the Liverpool game was notable. While relishing the contest, he was mindful of the strain on his players.\nThe frustration is greater because so many points have been squandered from promising positions. Yes, every team ends a season with some what-ifs, but Villa, now 10th, have fumbled away more than enough points to put them as high as third.\nJust now, they are on course to miss Europe next season, which will hurt after two years of exciting journeys, and hurt Emery most of all. They could get there through the FA Cup, but that would mean more matches, and more work.\nSacrificing one competition in the hope of enhancing chances in another does not feel right for Villa either, though. It is a wicked dilemma. Villa and Emery want it all, and why shouldn't they? But what has in many ways been Aston Villa's most memorable season for a generation may also turn out to be the most maddening.\nAston Villa v Cardiff City – live commentary on BBC Radio WM (all frequencies and BBC Sounds), Friday 20:00 GMT", "url": "https://www.bbc.co.uk/sport/football/articles/cevxel1n7p8o"}