{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:43:08", "date_modify": "2025-05-20 11:43:08", "date_publish": "2023-08-06 15:28:54", "description": "Harry Kane scores four goals as Tottenham beat Shakhtar Donetsk in their penultimate pre-season friendly before the start of the Premier League.", "filename": "sport_football_66422649_1747741388.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/12DA1/production/_130671277_gettyimages-1580911668.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66422649_1747741388.html", "title": "Harry Kane scores four as Tottenham beat Shakhtar; Harry Maguire booed as Manchester United draw", "title_page": "Harry Kane scores four as Tottenham beat Shakhtar; Harry Maguire booed as Manchester United draw - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Harry Kane scored four goals as Tottenham beat Shakhtar Donetsk 5-1 in their penultimate pre-season friendly before the start of the Premier League.\nKane's future at Spurs remains the subject of intense scrutiny with a year left on his contract and Bayern Munich stepping up their interest in him.\nAnd the 30-year-old put on a typically clinical display to remind Spurs what they will be missing should he leave.\nKane's England team-mate Harry Maguire, however, endured another mixed day.\nThe Manchester United defender, 30, was booed by Red Devils fans after his errant pass led to Athletic Bilbao's opener in Dublin - but he later made amends by setting up Facundo Pellistri's stoppage-time equaliser.\nMaguire's treatment was far from the rapturous welcome handed out in north London to Kane, who was also given the captain's armband against the Ukrainian champions by manager Ange Postecoglou.\nThe match was new boss Postecoglou's first game in charge in front of his own supporters at Tottenham Hotspur Stadium, with Spurs' two previous friendlies having taken place during a tour of Asia.\nAnd it will have left the Australian keener than ever to retain the services of Kane, who produced a virtuoso performance in what Spurs fans will hope was not a farewell with a flourish.\nThe striker has featured in all three Spurs friendlies this summer and played more than 80 minutes on Sunday, coming off just after his fourth goal and prompting loud 'we want you to stay' chants from supporters.\nHe opened the scoring from the penalty spot after a foul on James Maddison who - after Shakhtar levelled - set up Kane's second with a pinpoint cross that the England skipper headed in from close range.\nThe link-up between the international team-mates promises much, should Kane stay, but his hat-trick strike came from a more familiar source as he tucked away Dejan Kulusevski's defence-splitting ball.\nHe tapped home his fourth after Dmytro Riznyk parried Manor Solomon's shot. Kane's replacement Dane Scarlett added a fifth with an emphatic strike in stoppage time of the charity match to raise funds for Ukraine amid the ongoing Russian invasion.\nTottenham open their Premier League campaign at Brentford on 13 August.\nWhile Kane is a wanted man, Maguire's future remains uncertain for a far different reason having long fallen out of favour with Red Devils boss Erik ten Hag, who stripped him of the club captaincy this summer.\nEverton and West Ham have been linked with the centre-back, who was part of a largely second-string Manchester United XI to take on Spanish side Bilbao at the Aviva Stadium.\nThe majority of Ten Hag's first-choice team played in Saturday's 3-1 win over Lens although Christian Eriksen, Jadon Sancho and Aaron Wan-Bissaka were among those lining up alongside Maguire in Ireland.\nBut inside half an hour, Maguire's loose pass was intercepted by the visitors, with Nico Williams profiting to put Bilbao ahead.\nIt seemed the error would prove decisive, but Maguire headed down Wan-Bissaka's high ball into the path of Pellistri for the Uruguayan winger to hook home a leveller with the last kick of the game.\nElsewhere, Brighton midfielder Moises Caicedo, heavily linked with a transfer to Chelsea, was left out of the Seagulls' squad as they drew 1-1 with La Liga side Rayo Vallecano at Amex Stadium.\nAlvaro Garcia put the visitors in front but Joao Pedro, a club-record summer signing from Championship side Watford, levelled from the penalty spot after a foul on Pervis Estupinan.\nNewcastle United rounded off their pre-season with an impressive 4-0 win over La Liga side Villarreal at St James' Park as new signing Harvey Barnes scored twice, while Jacob Murphy and Joelinton also netted.\nMagpies boss Eddie Howe confirmed afterwards that he hopes to have the arrival of Southampton full-back Tino Livramento finalised in time for his side's Premier League opener against Aston Villa on Saturday.", "url": "https://www.bbc.com/sport/football/66422649"}