{"authors": ["Katie Wright", "www.facebook.com"], "date_download": "2025-05-20 14:31:02", "date_modify": "2025-05-20 14:31:02", "date_publish": "2023-07-29 03:16:47", "description": "Australia captain Sam Kerr says she is \"definitely\" going to be available to face Canada in her side's crucial final group match at the Women's World Cup.", "filename": "sport_football_66339701_1747751462.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/47E8/production/_130580481_gettyimages-1577575578-1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66339701_1747751462.html", "title": "Sam Kerr: Matildas captain fit for final Women's World Cup group game", "title_page": "Sam Kerr: Matildas captain fit for final Women's World Cup group game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Australia captain Sam Kerr says she is \"definitely\" going to be available to face Canada in Monday's crucial group match at the Women's World Cup.\nThe Chelsea striker missed the co-hosts' opening two games with a calf injury she suffered on the eve of the tournament.\n\"I'm feeling good,\" said Kerr. \"I was out on the pitch today.\"\nThe Matildas suffered a shock 3-2 loss to Nigeria on Thursday to leave them facing a battle to reach the last 16.\n\"It's going to go down to the wire - I'm definitely going to be available,\" said Kerr, Australia's all-time top scorer.\n\"The plan has always been the same - miss the first two games and then reassess.\n\"I've done everything under the sun to get fit to be selected. I've given everything in the last 10 days, and four years before that, to be here.\"\nKerr, 29, watched from the sidelines as her side edged the Republic of Ireland 1-0 in their opening match in Sydney and then saw them lose a lead and go down 3-2 to Nigeria in Brisbane.\nThat result left the Matildas in third place in Group B and needing a victory over second-placed Olympic champions Canada on Monday to guarantee a place in the knockout stages.\nNigeria, who currently top the group on goal difference, face bottom side the Republic of Ireland in Group B's other match.\nHer Australia team-mate Ellie Carpenter said: \"Sam is a great leader and a great captain… and we've really felt her there on the sidelines.\n\"We're all supporting her, and it's great for her to have her boots back on, as she's a world-class player.\n\"Mentally, it's massive to have her available, and for the opposition too, knowing we have her available for this game. We're excited to have her back in the squad.\"\nMatildas coach Tony Gustavsson previously said they would wait until the last minute to make a decision on Kerr's fitness.\n\"If she's available we're going to need to come up with a plan together to see what we can do to maximise the potential minutes she has - if she's available,\" he said.", "url": "https://www.bbc.com/sport/football/66339701"}