{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 08:01:26", "date_modify": "2025-05-21 08:01:26", "date_publish": "2025-03-27 16:35:36", "description": "Uefa has opened an investigation into allegations of indecent conduct by four Real Madrid players during their Champions League last-16 win against Atletico Madrid.", "filename": "sport_football_articles_c20dxyxzprzo_1747814486.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cf1c/live/21640f30-0b20-11f0-88df-cbea984e02db.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c20dxyxzprzo_1747814486.html", "title": "Uefa probe four Real Madrid players for indecent conduct in Champions League win over Atletico", "title_page": "Uefa probe four Real Madrid players for indecent conduct in Champions League win over Atletico - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Uefa has opened an investigation into allegations of indecent conduct by four Real Madrid players during their Champions League last-16 win against Atletico Madrid.\nAntonio Rudiger, Kylian Mbappe, Vinicius Jr and Dani Ceballos allegedly made gestures towards the home fans after Real Madrid beat their city rivals on penalties to book their place in the quarter-finals.\nTV pictures showed German defender Rudiger appearing to make a throat-slitting motion, apparently towards the crowd after the shootout victory, while Mbappe was shown seemingly making a crotch-grabbing gesture.\nSpanish media said, external Atletico reported the actions to Uefa last week.\nThe players could be at risk of suspension but there is no guarantee the case will be heard before their quarter-final with Arsenal. The first leg for that tie is at Emirates Stadium on 8 April and the return leg a week later.\nIn a statement, Uefa said: \"[An] ethics and disciplinary inspector has been appointed to investigate allegations of indecent conduct\" made by the four Real Madrid players.\n\"Further information regarding this matter will be made available in due course.\"", "url": "https://www.bbc.com/sport/football/articles/c20dxyxzprzo"}