{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:46:53", "date_modify": "2025-05-21 06:46:53", "date_publish": "2025-01-31 08:39:33", "description": "Former world champion Michael Smith says he is suffering from arthritis in his right hand.", "filename": "sport_darts_articles_clyn1gw89gyo_1747810013.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f93a/live/3dd89a80-dfa8-11ef-a319-fb4e7360c4ec.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_darts_articles_clyn1gw89gyo_1747810013.html", "title": "Michael Smith reveals arthritis issue after World Masters defeat", "title_page": "Michael Smith reveals arthritis issue after World Masters defeat - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former world champion Michael Smith says he is suffering from arthritis in his right hand.\nSmith, who won the world title in 2023, issued a statement after he was knocked out of the World Masters in Milton Keynes on Thursday by Dutchman Danny Noppert.\n\"I broke both my wrists when I was 19 and now it's catching up with me and now suffering with arthritis to my right hand,\" said Englishman Smith., external\n\"This isn't sympathy or a cry for help. This is letting you all in to it. I've never given up or stopped from any pain.\"\nSmith, who throws with his right hand, hit a nine-darter immediately after Michael van Gerwen just missed one in what was described as the greatest leg of darts when winning the World Championship final in 2023.\nBut his form has dropped and he is down to number 16 in the world after losing in the second round of the World Championship.\nThe 34-year-old from St Helens, nicknamed 'Bully Boy', also said he has been suffering from a shoulder injury for the past six weeks which has required physiotherapy every two to three days.\n\"I see the specialist Monday and when I know, you will know, what will happen over the next month or so,\" he said.\n\"I'll never let anything beat me and I promise I'll be back very, very quickly.\"", "url": "https://www.bbc.com/sport/darts/articles/clyn1gw89gyo"}