{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:45:48", "date_modify": "2025-05-21 05:45:48", "date_publish": "2025-02-08 23:43:38", "description": "Anthony Davis' impressive debut for the Dallas Mavericks is cut short by injury during their win against the Houston Rockets.", "filename": "sport_basketball_articles_c5y6zlyypggo_1747806348.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2506/live/29949bc0-e672-11ef-9c04-1ff0f06f0a42.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_basketball_articles_c5y6zlyypggo_1747806348.html", "title": "NBA: Anthony Davis goes off injured during Dallas Mavericks debut against Houston Rockets", "title_page": "NBA: Anthony Davis goes off injured during Dallas Mavericks debut against Houston Rockets - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Anthony Davis' impressive debut for the Dallas Mavericks was cut short during their 116-105 win over the Houston Rockets because of a non-contact injury.\nDavis, 31, moved to Dallas from the Los Angeles Lakers last week as part of a blockbuster trade involving NBA All-Star Luka Doncic.\nDespite fans protesting Doncic's switch to the Lakers before the game, Davis scored 26 points with 16 rebounds and seven assists before his withdrawal.\nHe dropped to the floor clutching his lower body late in the third quarter, when he tried to defend a driving dunk by Houston's Alperen Sengun.\nMavericks' Klay Thompson and Kyrie Irving also scored 13 points each.\nDavis missed the Mavericks win against the Boston Celtics on Friday as he was recovering from an abdominal strain suffered in his final game with the Lakers on 28 January.\nHe received a warm reception from the crowd when he assisted Daniel Gafford early in the first quarter.\nMavericks were 65-48 up at half-time but had their lead cut to two points as Houston rallied in the third quarter.\nTwo three-pointers by Naji Marshall and points by Irving put Dallas back in control heading into the final 15 minutes as they inflicted a sixth straight defeat on their opponents.\nDavis later played down his injury, telling reporters: \"My leg got tight, like a little spasm.\n\"I came back to try to get it loose while still dealing with the abdominal strain. But I managed to loosen it up, and it's nothing serious. I'm fine.\"", "url": "https://www.bbc.com/sport/basketball/articles/c5y6zlyypggo"}