{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:34:11", "date_modify": "2025-05-21 04:34:11", "date_publish": "2025-04-05 00:00:00", "description": "Follow live text and listen to match commentary as Glasgow face Leicester in the last 16 of the European Champions Cup.", "filename": "sport_rugby-union_live_ckgrj1e1r1jt_1747802051.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_live_ckgrj1e1r1jt_1747802051.html", "title": "European Champions Cup LIVE: Glasgow vs Leicester", "title_page": "European Champions Cup LIVE: Glasgow vs Leicester - scores, live updates and radio commentary - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "G'night\nFT: Glasgow Warriors 43-19 Leicester Tigers\nWe'll leave it there for tonight, as Glasgow sweep aside Leicester to book their spot in the quarter-finals of the Champions Cup.\nThey will have to step it up when they take on Leinster on Friday night, which Franco Smith was keen to highlight.\nFor now though, they can focus on a job well done.\n'We weren't accurate' - Hewat\nFT: Glasgow Warriors 43-19 Leicester Tigers\nLeicester attack coach Peter Hewat tells Premier Sports: \"Very disappointed. We defended well in the first half, took a lot of pressure and made a lot of tackles.\n\"We gave them easy entry into our 22 in both halves and by the end that took its toll.\n\"Our mentality was pretty good. We just probably weren't accurate and let ourselves down a little bit.\n\"Every game now feels like a knockout game and that's the way we're treating the next one. We'll have a few days off and then get back into it.\"\n'We left tries out there' - Smith\nFT: Glasgow Warriors 43-19 Leicester Tigers\nGlasgow Warriors head coach Franco Smith tells Premier Sports: \"I still feel we made a lot of errors, a lot of mistakes, which is down to nerves. Some tries left out there but I'm happy with the result.\n\"We're getting better as a group and we didn't want to disappoint.\n\"Leinster pose a completely different challenge. They know how to handle strategic moments in the game. They've got the complete package, a good rush defence - they put you under pressure.\n\"It's going to be difficult with guys coming back in the next few weeks. We'll see how we approach this week. The boys out there tonight played well, but one or two fresh players might add value.\"\nPost\nFT: Glasgow Warriors 43-19 Leicester Tigers\nTom English\nBBC Scotland's chief sports writer\nGlasgow have waited for so long to win a knockout game in Europe’s top-tier competition. They did it very comfortably tonight.\nStill missing Tuipulotu, Jones, Dempsey, Cummings, Williamson but they were dominant.\nDublin next. They’ll be underdogs, yes, but they possess a helluva bite.\nRoute to the final\nFT: Glasgow Warriors 43-19 Leicester Tigers\nSix tickets are booked for the quarter-finals, two places remain. Who will complete the line-up for the last eight?\nQuarter-final draw (ties to be played on the weekend 11/12/13 April):\nBordeaux-Begles or Ulster v Munster\nToulon v Toulouse or Sale Sharks\nLeinster v Glasgow Warriors\nNorthampton Saints v Castres\nSemi-final draw (ties to be played on the weekend 2/3/4 May):\nBordeaux/Ulster/Munster v Toulon/Toulouse/Sale\nLeinster/Glasgow v Northampton/Castres\n'The perfect night' for Glasgow\nFT: Glasgow Warriors 43-19 Leicester Tigers\nFraser Brown\nFormer Scotland hooker on BBC Radio 5 Sports Extra\nProbably the perfect night for Glasgow and Franco Smith.\nGreat performance. In the first half, they didn't put the points on the board that they should have. The 10-minute blitz at the start of the second half was all they needed.\nIt allowed them to rotate, bring the subs up nice and early, and wrap the players up for what is going to be a massive bruising encounter next week in Dublin.\nThey've given Franco Smith enough to be angry about when he goes downstairs, to keep everyone's feet on the floor.\n'Tigers second best'\nFT: Glasgow Warriors 43-19 Leicester Tigers\nTom Varndell\nFormer England and Leicester wing on BBC Radio 5 Sports Extra\nIt was a better second-half performance from Tigers, but they were second best in most aspects.\nIn European rugby you can't be off the boil. Fair play to Glasgow - at points today they were brilliant.\nTry GLASGOW WARRIORS 43-19 Leicester Tigers\nHenco Venter\nGlasgow will be heading to Dublin to face Leinster in the quarter-finals.\nHenco Venter crashes through a would-be tackler for his second try of the night.\nIt came after a strong rolling maul that splintered just before the line.\nAdam Hasting's conversion bounces away off the post.\nPost\nGlasgow Warriors 38-19 Leicester Tigers\nFraser Brown\nFormer Scotland hooker on BBC Radio 5 Sports Extra\nWhat Leicester have changed since half-time is their attacking breakdown has been much, much better.\nThey're on it early, cleaning deep, and taking Glasgow players past the breakdown. It's stopping Glasgow being able to set.\nIt must have been something they looked at at half-time.\nPost\nGlasgow 38-19 Leicester\nAndy Burke\nBBC Sport Scotland at Scotstoun Stadium\nGlasgow have taken their foot off the gas here, Leicester have started playing some rugby and suddenly the English side are finding some joy.\nA 19-point lead should be plenty to see Warriors through, but the home fans wouldn't mind seeing one more Glasgow try just to extinguish any Tigers hopes of a miraculous comeback.", "url": "https://www.bbc.com/sport/rugby-union/live/ckgrj1e1r1jt"}