{"authors": ["Phil McNulty", "www.facebook.com"], "date_download": "2025-05-21 06:44:01", "date_modify": "2025-05-21 06:44:01", "date_publish": "2025-03-30 20:01:13", "description": "Pep Guardiola still faces a huge Manchester City rebuild but clouds lift as they reach a seventh successive FA Cup semi-final, says chief football writer Phil McNulty.", "filename": "sport_football_articles_c9ve8xz4yv0o_1747809841.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/03c1/live/1f0e8570-0d9c-11f0-b234-07dc7691c360.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c9ve8xz4yv0o_1747809841.html", "title": "Bournemouth 1-2 Man City: Clouds lift to Guardiola as his side head back to Wembley in FA Cup", "title_page": "Bournemouth 1-2 Man City: Clouds lift to Guardiola as his side head back to Wembley in FA Cup - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Pep Guardiola's frantic body language released every frustration suffered in a season of mediocrity as the clouds lifted and the sun finally shone on Manchester City at Bournemouth.\nGuardiola has cut a tortured, agonised figure for most of a campaign in which the form of his City side fell off a cliff after claiming a historic four successive Premier League titles.\nIt left the FA Cup as the only target left to stop Guardiola suffering the rare ignominy of finishing a season empty-handed for the first time since his opening one at City in 2016-17 - which was the only campaign he has not won a trophy as a manager.\nAnd watching Guardiola at close quarters at Vitality Stadium as City came from behind to win 2-1 made a mockery of Guardiola's own assertion that not even winning the FA Cup could make up for failing to make a dent in the Premier League and Champions League.\nIt was pure theatre watching a man so used to glory - who lives for success - exude relief, celebration and then uncontained joy when City deservedly got over the line.\nThis was Guardiola publicly savouring the sweet taste of victory after so often failing to find solutions to the crisis, certainly by their own standards, that has dragged City down this term.\nHe said City came to the Vitality \"with flip-flops\" when they suffered their first Premier League defeat of the season in November. This was strictly business.\n\"In November, we came here for a holiday against a team that competes,\" he added.\nThe only thing that smacked of a holiday here was the glorious south-coast weather as British Summer Time arrived - and City had to survive a storm of their own making before securing the win.\nFrom the first minute, Guardiola burned with desire for victory, a livewire in the technical area throughout and at the final whistle after a win that sealed a remarkable seventh successive FA Cup semi-final appearance, this time against Nottingham Forest.\nAnd, as all the great managers do, Guardiola still kept his analytical mind ice-cold throughout the fiery touchline behaviour to make the change that turned the tide of this quarter-final when City trailed to Evanilson's scrambled goal at the interval.\nGuardiola removed the struggling central defender Abdukodir Khusanov, switching Josko Gvardiol into the middle and introducing talented 20-year-old Nico O'Reilly at left-back.\nO'Reilly's natural position, as Guardiola confirmed, is a number 10, but here he did damage on the flanks, setting up an equaliser for Erling Haaland, who had missed a first-half penalty, then played in substitute Omar Marmoush for the winner.\nAt the heart of it all was Guardiola - excitable, animated and showing with every action just how important the FA Cup is to him and City.\nEven by his own standards, Guardiola has rarely looked as engaged and involved as this.\nHe has a huge rebuild on his hands, and some cracks were still visible here, with an ageing squad containing the players he described as \"legendary\" called into action such as Ederson, Bernardo Silva, Ilkay Gundogan and Kevin de Bruyne.\nThis might be the last shot at glory as City players for some.\nAnd the use of Matheus Nunes at right-back, a position even his greatest admirers would not suggest he has the qualities for, showed how Guardiola has had an air of desperation about some resources he has juggled this season.\nThis was, however, about the here and now - not the future. The old trophy-winning muscle memory of Guardiola and his players kicked in when it mattered.\nIf the FA Cup really is struggling to count as a consolation prize for Guardiola and City this season, you could have fooled everyone inside this ground who watched him.\nWinning the cup would not disguise the scale of the renewal Guardiola must oversee to restore City to their former eminence, but the great old prize will certainly be something to be going on with.\nThe club also expects to learn the outcome of the hearing into 115 charges of alleged Premier League financial rule breaches imminently.\nGuardiola's fist-pumping reaction to Haaland's equaliser was a wild outpouring of joy, as was his reaction to Marmoush's winner. The manager even picked up a booking for an altercation with the officials.\nHaaland suffered a mixed day, missing a third penalty from his past six attempts, then limping off with an ankle injury after his goal.\nThe strike for the equaliser means he is the first player to score 30 goals or more in all competitions in each of his first three seasons while playing for Premier League clubs since Ruud van Nistelrooy for Manchester Utd from 2001-02 to 2003-04.\nIt looked like it was all Guardiola could do to stop himself entering the action at some points, mixing applause for his players with furious expressions of discontent at moments of carelessness.\nAnd at the final whistle Guardiola's elation overflowed in front of City fans basking in the glorious sunshine.\nHe marched at pace around every player, wrapping them in fierce bear hugs and even planting kisses on some.\nGuardiola then joined the celebrations with the travelling supporters, conducting their \"We've got Guardiola\" anthem along with other songs before grabbing the young hero O'Reilly, shoving him towards the stands to take the acclaim his match-winning turn deserved.\nAnd who can blame Guardiola, as O'Reilly is emerging as City's FA Cup talisman?\nHe has been directly involved in five goals in four appearances in the competition this season, with three goals and two assists.\nO'Reilly is also the first City substitute to assist two goals in a game since Gundogan against Leeds United in December 2021.\nGuardiola said: \"Nico is a number 10. He possesses such quality in the final third and has so much vision. We thought he could do it for us on the left as well, and he did.\"\nIf Guardiola is looking for vital signs of a brighter future, the composure and class of O'Reilly certainly provides one.\nThe Spaniard added: \"We played an outstanding game and had incredible chances, missed a penalty. We conceded with one chance we gave away. Our approach was magnificent.\n\"Seven times in a row into the semi-final of the FA Cup. No team has done it and it will be difficult for any other to do what these legendary players, the new ones and the old ones, will have done.\"\nAnd as City move within sight of another trophy, Guardiola proved once more that even amid unaccustomed struggles, old trophy-winning habits die hard for great managers and players.", "url": "https://www.bbc.com/sport/football/articles/c9ve8xz4yv0o"}