{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:11:08", "date_modify": "2025-05-19 15:11:08", "date_publish": "2017-07-05 00:00:00", "description": "How Rafael Nadal won in straight sets to reach the third round after Andy Murray made it four British wins in a day.", "filename": "sport_live_tennis_40071456_1747667468.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_live_tennis_40071456_1747667468.html", "title": "Wimbledon day three: Andy Murray, Johanna Konta, Heather Watson and Aljaz Bedene all win", "title_page": "Wimbledon day three: Andy Murray, Johanna Konta, Heather Watson and Aljaz Bedene all win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Game, set and match - Giorgi\nGiorgi 6-4 6-7 (10-12) 6-1 Keys*\nWe have our shock on court three. The number 17 seed, Madison Keys, of the USA, is out, losing in three sets to Italy's Camila Giorgi.\nThe world number 86 won 6-4 6-7 (10-12) 6-1. She had wasted four match points in the tie-break but took her fifth opportunity to advance.\nPost\n*Ostapenko 4-6 7-6 (7-4) 3-3 Abanda\nFrench Open champion Jelena Ostapenko is fighting to stay in the competition against unseeded Francoise Abanda of Canada. The 13th seed from Latvia lost 6-4 in the first set, won the second set tie-break 7-4 and we are with serve in the third.\nThat match faces a race against time to be finished before the light is deemed to be too bad to continue.\nPost\nGiorgi 6-4 6-7 (10-12) 3-0 Keys*\nMadison Keys saved four match points during the second set but is a break and 3-0 down in the deciding set against unseeded Italian Camile Giorgi.\nKeys is the 17th seed, while Giorgi is ranked 86th in the world.\nPost\nNadal 6-4 6-2 7-5 Young\nJonathan Jurejko\nBBC Sport at Wimbledon\nJob done for Rafa. He's loving life back on Centre Court. Four bicep-bulging fist pumps and a roar up to the darkening Wimbledon sky tell you what winning here means to him.\nAnd he still finds time to whip off his shirt once last time to a cacophony of wolf-whistles.\nHe's the Cristiano Ronaldo of tennis...\nPost\nPat Cash\nFormer Wimbledon champion on BBC TV\nRafa was cruising and playing well. Occasionally he loses his timing and aggression. You have to give credit to Young, he's very talented and has it all.\nNadal is working his way into the tournament. He served pretty well and got his rhythm. He will be more than happy.\nGame, set and match Halep\nHaddad Maia 5-7 3-6 Halep\nWomen's second seed Simona Halep is safely into the last 32 after a straight-set win over 21-year-old Brazilian Beatriz Haddad Maia (who beat Laura Robson in the first round).\nHalep won it 7-5 6-3 to set up a third-round tie with China's Shuai Peng, a 6-2 6-2 winner over Spanish 25th seed Carla Suarez Navarro.\nNadal breaks back\n*Nadal 6-4 6-2 6-5 Young\nRafa's not rattled by this turn of events. He's gone 0-30 up.\nBut he is a little aggravated now as someone in the crowd shouted out and put him off.\nWith his head back in the game, Nadal has two break points and he slams a forehand cross-court to break back immediately.\nThe fourth seed will serve for the match (again).\nPost\nNadal 6-4 6-3 5-5 Young*\nJonathan Jurejko\nBBC Sport at Wimbledon\nWell it looks like Rafa mugged me off...\nIt's going on longer than five minutes. Helped, of course, by some serious tenacity from Donald Young.\n\"I don't want to go home Donald!\" shouts one fan.\nNeither does the American...\nPost\nBoris Becker\nThree-time Wimbledon champion on BBC TV\nWell deserved Donald Young, he didn't rise to the intensisty, he took the chances, never gave up. Now he has to cool down again and find his concentration.", "url": "https://www.bbc.com/sport/live/tennis/40071456"}