{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:24:27", "date_modify": "2025-05-20 12:24:27", "date_publish": "2023-08-04 11:37:23", "description": "European medallists Ciara Mageean, Mark English and Thomas Barr lead Ireland's largest ever squad for the World Championships in Budapest next month.", "filename": "sport_athletics_66405755_1747743867.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/102F6/production/_130649266_inpho_02076738.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_athletics_66405755_1747743867.html", "title": "World Athletics Championships: Mageean and Adeleke named in largest ever Irish squad", "title_page": "World Athletics Championships: Mageean and Adeleke named in largest ever Irish squad - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "European medallists Ciara Mageean, Mark English and Thomas Barr will lead Ireland into next month's World Athletics Championships in Budapest.\nRhasidat Adeleke and Sarah Lavin are also part of the 23-strong squad.\nTokyo Olympian Phil Healy withdrew from consideration in order to recover \"mentally and physically\" for the Olympic Games next summer.\nRobert Heffernan won Ireland's last medal with a gold in the 50km walk in 2013.\n\"This team includes multiple athletes, both seasoned campaigners and rising stars,\" said Paul McNamara, Athletics Ireland director of high performance.\n\"[The team] are primed to make an impact, building further on the upward trajectory seen in Oregon and Munich in 2022.\n\"With 16 individual athletes selected, and the potential for further additions in the coming days, plus two relay squads, this is the largest team we have sent to a World Championships, despite the higher qualification standards than any previous edition of this championships, and with eight athletes inside the A standard.\"\nThe nine-day competition begins on 19 August at the National Athletics Stadium in Hungary, where over 2,000 athletes from 200 countries will compete for world titles.\nMageean, who topped Sonia O'Sullivan's long standing national mile record last month, will run in the 1500m with European U23 medallists Sophie O'Sullivan and Sarah Healy.\nEnglish and national 800m champion John Fitzsimons will compete in the 800m event and Thomas Barr returns to the 400m hurdles while Rhasidat Adeleke takes on the 400m sprint, having broken her own Irish record in June to claim gold at the NCAA Championships.\nHealy, who finished fourth in the 400m final at the National Championships, had been due to compete in the women's 4x400m relay race.\n\"It has been an extremely tough and testing 16 months where I questioned continuing with the sport many times,\" she said on social media.\n\"However, nothing is ever linear so we battled on and made a lot of progress in terms of the diagnosis, treatment and regulation of my Autoimmune Disease. We just lost a lot of consistency and time, training wise.\"\nNick Griggs will lead the charge for Team Ireland at the European Athletics U20 Championships competing in both the 1500m and 3000m events in Israel this month.\nThe Tyrone runner won gold in the 3000m at the U20 European Championships in 2021 in Tallinn, Estonia.", "url": "https://www.bbc.com/sport/athletics/66405755"}