{"authors": ["Jonathan Jurejko", "www.facebook.com"], "date_download": "2025-05-21 07:38:44", "date_modify": "2025-05-21 07:38:44", "date_publish": "2025-01-22 09:52:50", "description": "Defending champion Jannik Sinner dismisses concerns about his physical state to thrash home hope Alex De Minaur and reach the Australian Open semi-finals.", "filename": "sport_tennis_articles_cdd92e30qgeo_1747813124.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/72ac/live/024194e0-d8b4-11ef-8504-3783a4c4149b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_tennis_articles_cdd92e30qgeo_1747813124.html", "title": "Australian Open 2025 results: Jannik Sinner thrashes Alex de Minaur after Ben Shelton beats Lorenzo Sonego", "title_page": "Australian Open 2025 results: Jannik Sinner thrashes Alex de Minaur after Ben Shelton beats Lorenzo Sonego - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Defending champion Jannik Sinner dismissed concerns about his physical state to thrash home hope Alex de Minaur and reach the Australian Open semi-finals.\nSinner struggled with illness in his previous match but looked sharp in a 6-3 6-2 6-1 victory over eighth seed De Minaur.\nTwo days after being sick before playing Denmark's Holger Rune and needing to see a doctor, Sinner said he felt \"ready\" when he woke up on Wednesday.\nSinner denied speculation he had pneumonia, saying blood tests after his fourth-round match were \"all good\".\n\"I feel like the illness has gone away now. I was feeling much, much better this morning,\" the world number one said.\n\"When you are young you recover very fast - so it's a bit different.\"\nThe 23-year-old Italian will face American Ben Shelton in the last four on Friday.\nShelton, 22, reached the Melbourne semi-finals for the first time with a battling 6-4 7-5 4-6 7-6 (7-4) against Italy's Lorenzo Sonego.\nAnticipation was high among the Australian fans arriving at Rod Laver Arena that De Minaur could cause a shock - particularly given the uncertainty about Sinner's condition.\nA pale-looking Sinner was visibly shaking in his chair during his fourth-round win over Rune and benefitted from an enforced 20-minute break when the net broke.\nBut Sinner looked healthy in a performance where he proved again to be a class above De Minaur.\nThe world number one struck the ball sweetly and consistently to outlast De Minaur in the rallies.\nClinching six breaks of serves, and saving just the one chance for De Minaur in the second set, illustrated his dominance.\nAfterwards Sinner said he had \"a very easy day\" on Tuesday, hitting with his coaches for only \"half an hour or 40 minutes\" to maintain rhythm.\n\"I felt ready for today,\" Sinner added.\n\"When you play a night session you try to sleep as long as you can and eat healthy.\"\nDe Minaur came into the match with a terrible record against his opponent, losing all nine of their previous meetings and winning just one set in the process.\nThe 25-year-old Australian was looking to end that unwanted run and become the first home player since 2005 to reach the men's singles semi-finals.\nBut what was expected to be a raucous atmosphere failed to materialise on a cool Melbourne night.\nIt was testament to Sinner's assured display that he largely silenced the majority of the 15,000 fans.\n\"Right now my worst match-up on tour is Jannik. The head to head doesn't lie,\" said De Minaur.\n\"In these types of conditions where it's a little bit colder and you can't really get the ball out of his strike zone, he can just unload and not miss. It's tough.\"", "url": "https://www.bbc.com/sport/tennis/articles/cdd92e30qgeo"}