{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:27:20", "date_modify": "2025-05-19 15:27:20", "date_publish": "2017-07-16 00:00:00", "description": "Follow live text and BBC Radio 5 live commentary of the 2017 World Para-athletics Championships from London Stadium.", "filename": "sport_live_disability-sport_40387931_1747668440.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_live_disability-sport_40387931_1747668440.html", "title": "World Para-athletics Championships 2017: Text & radio coverage", "title_page": "World Para-athletics Championships 2017: Text & radio coverage - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Thanks and goodbye\nAnd we will end the live text page there.\nWe will have updates from the Monday morning session during our Sportsday Live page before a full live text page from 18:45 BST on Monday covering the evening's action.\nThere will also be live commentary on BBC Radio 5 live in the evening as well.\nThank you for joining us and see you soon.\nTwo more medals tonight for Great Britain\nSo what an evening it has been at London Stadium.\nJonnie Peacock clinched the eighth gold medal for Great Britain with victory in the men's 100m T44 final, while Maria Lyle added a bronze medal in the women's 200m T35.\nYou can read Chris Osborne's report of the action here.\n'Sacrifices have paid off'\nMen's 100m T13 final\nBBC Radio 5 live\nIreland's Jason Smyth, the men's 100m T13 world champion, has been talking to BBC Radio 5 live. He said: \"I'm absolutely delighted, that's what we come to world championships for to cross the line first.\n\"To be here and be part of it is incredible. I've been very fortunate, I've been in the sport since 2005 and pretty much won gold medals all the way. I've made a huge amount of sacrifices and it has paid off.\"\nChiassaro eighth in men's 1500m T54\nMen's 1500m T54\nThe last race of the day was the men's 1500m T54, with Great Britain's Richard Chiassaro well down the field.\nSwitzerland's Marcel Hug wins it in three minutes 04.33 seconds, with Tunisia's Yassine Gharbi second and Alhassane Balde of Germany coming third.\nChiassaro came eighth in a time of 3.06.24.\nRuddock seventh in the shot put\nMen's shot put F35\nOne result from earlier to bring you, and it is in the men's shot put F35 competition.\nBritain's Sam Ruddock was in the line-up and he came seventh, with a best effort of 12.84m\nA new championship record of 15.30m gave Fu Xinhan of China the gold medal.\n'Hearing the crowd helps'\nMen's 1500m T54 (21:45 BST)\nRichard Chiassaro has already been in action once today as he finished second in his heat in the men's 1500m T54 competition to qualify for the final, which is the final event of the night at about 21:45 BST.\nThe 35-year-old told BBC Radio 5 live: \"It was good, exactly how I wanted to it. I took the lead and I didn't want to go out and get surrounded by the others.\"\nAsked how much the home crowd helps him, he added: \"From the Anniversary Games last year when I did the 1500m, it was not until I got over the line that I actually felt tired. Hearing the crowd gets you through the race.\"\nAn 18-year-old veteran?\nWomen's 100m T42 (21:35 BST)\nShe is only 18, but Julie Rogers, who is aiming for gold in the women's 100m T42 final tonight, has already competed at two Paralympics.\nShe was only 13 when she competed in the seated volleyball event at London 2012, before taking part in the women's 100m T42 at Rio four years later.\nRogers, who was born with a tibia and fibula missing, posted this picture on Twitter in the build-up to this event and looks to be loving her time in London.\n'Insane'\nMen's 100m T44 - Great Britain's Jonnie Peacock wins gold\nJonnie Peacock tells BBC Radio 5 live: \"It was so scary, I was cramping in my warm-up, I was stretching my hamstring over and over again and that is not a usual thing to do on the start-line. I'm so thankful I finished in one piece.\n\"Coming back here is insane. There is no other place that treats Para sport like this, we have taken it a step on, if we could have every World Championships here that would be great as the way everyone laps it up is insane.\n'Every World Championships should be here'\nMen's 100m T44 - Great Britain's Jonnie Peacock wins gold\nMen's 100m T44 gold medallist Jonnie Peacock, speaking to the crowd, says: \"I was feeling some serious cramp in the warm-up. The heats showed I'm in good form at the moment. If I had dipped I might have got that world record (in the heat).\n\"This event shows every World Championships should be held here.\"\n'I was so scared'\nMen's 100m T44 - Great Britain's Jonnie Peacock wins gold\nJonnie Peacock, the eighth British gold medallist of the 2017 World Para-athletics Championships, has just been talking to Channel 4. He said: \"I was in the warm-up area and feeling cramp everywhere, I was so scared, I thought I may fall over in the middle of the race.\n\"I'm just so thankful I managed to finish the race and come away with the win.\n\"I knew I was in a great place and in the heat I should've ran through and got the world record. The crowd is phenomenal, I was blown away. It is so great to be a part of it.\"\nPost\nMen's 100m T44 - Great Britain's Jonnie Peacock wins gold\nChris Osborne\nBBC Sport at London Stadium\nWheerrrrreee's Jonnie?\nMr Peacock went on a jog around London Stadium to lap up the euphoria. Channel 4 have had to leg it round to interview him.\nThe rest of us will need to sit patiently in the mixed zone. But we don't mind.\nJason Smyth wins for Ireland\nMen's 100m T13 final\nJason Smyth of Ireland takes world championship gold for the fourth successive event with victory in the men's 100m T13 final.\nBut there is to be no new world record for the Irishman, as he won in 10.63 seconds, faster than in his heat, but not beating his best time of 10.46 seconds. Matusz Michalski of Poland takes silver, with America's Chad Perris coming third.\nIreland's Smyth targets world record\nMen's 100m T13 (21:06 BST)\nWe could well be seeing a world record in the men's 100m T13 as Ireland's Jason Smyth, the current record holder, qualified for the final earlier today by winning his heat.\nThe visually-impaired double London 2012 Paralympic gold medallist won in 10.73 seconds and is confident of beating his world record of 10.46.\n\"That felt very comfortable,\" said Smyth after his heat.\n\"I think I can beat the world record. Can I do it? Absolutely. But at a major championships, it is firstly about crossing the line first.\"\nGreat Britain's Zak Skinner missed out on the final after coming fourth in his heat, despite setting a new personal best of 11.15 seconds.", "url": "https://www.bbc.com/sport/live/disability-sport/40387931"}