{"authors": ["Matthew Henry", "www.facebook.com"], "date_download": "2025-05-21 03:48:53", "date_modify": "2025-05-21 03:48:53", "date_publish": "2025-04-07 15:37:39", "description": "Rob Key has played the odds in naming Harry Brook England's white-ball captain. Giving the job to Ben Stokes was too big a risk to take.", "filename": "sport_cricket_articles_c2lzjdl5znlo_1747799333.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0ae9/live/f25ccc80-13bd-11f0-b1c4-498f305c3d3a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c2lzjdl5znlo_1747799333.html", "title": "Harry Brook: Rob Key plays the odds in preferring batter to Ben Stokes as England white-ball captain", "title_page": "Harry Brook: Rob Key plays the odds in preferring batter to Ben Stokes as England white-ball captain - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Rob Key once played poker until 3am with the late great Shane Warne.\nNext week he will celebrate three years in the role of managing director of England men's cricket - a period during which he has rarely been averse to a gamble.\nA fiery all-rounder picked as captain, a Test coach appointed who had never led in the red-ball game and a host of youngsters given their debuts despite limited domestic records.\nHowever, Key has played the odds in appointing Harry Brook as white-ball captain. There is a reason you are told to never risk more than you can afford to lose.\nGiving the job to Ben Stokes, as Key suggested he might, would have been the equivalent to carefully building a profit across a night at the roulette table, only to throw your earnings on a lucky number with closing time in sight.\nEngland have been building for this winter's Ashes series ever since Key and Stokes took post.\nKey has wisely decided that, with the first Test in Perth seven months away, adding the white-ball captaincy to his injury-ravaged talisman's workload was one risk he was not willing to take.\nOnce he did so, Brook was always the obvious choice to replace Jos Buttler.\nDomestic captains outside of the current XI, the likes of Sam Billings or James Vince, were considered but a captain must be worth their place in the team.\nJoe Root was not interested, others not secure enough in their position. In some ways, Brook was the only option.\nIn the 26-year-old Yorkshireman, England will get another captain in the image of Stokes and Brendon McCullum - their all-format, all-powerful coach.\nThe similarities are in style - Brook has been a leading disciple of the pair's Test revolution - and in Brook's grounding too.\nHis cricket education was finished at Sedbergh School but, rather than the public-school system, he learned the game at Burley-in-Wharfedale's Hodson Park - where there is a bench bearing his late grandfather's name.\nBrook, like Stokes and McCullum, is street-smart - hardened by playing in Yorkshire's tough men's leagues by the age of 13 - and rough around the edges.\nHe is straight-talking, often a man of few words in interviews - some might say a classic Yorkshire trait.\nAt the Indian Premier League he said he was happy to \"shut up\" local fans who had been \"slagging him off\" and, when standing in as England skipper last year, said \"who cares?\" in response to criticism of English dismissals.\nKey has said England's players have been guilty of \"talking rubbish\" in the media during their recent poor run. Honesty may be what this struggling England white-ball team needs but Brook must be wary of the scrutiny that comes with leadership.\nBefore Brook's debut he was described as \"dumb\" by Stokes, something for which the all-rounder later apologised.\nHis answers may be brief but do not mistake that for a lack of cricket brain.\nBrook's 317 against Pakistan last year may take the headlines but one of his best innings was in the drawn 2023 Ashes series at Headingley, when he hit 75 in a chase which had to be managed with the urn on the line.\nBrook, like Stokes, is a remarkably hard worker.\nHe was the chubby kid at Sedbergh, told he would not make a county cricketer because he was not fit enough in the field.\nBrook corrected that by running in the Cumbrian fells and last year he used a break, because of the death of his grandmother, to shed pounds and became the leading fielder in the England team.\nThat is one area in which England's white-ball teams are trailing the best teams in the world.\nThe sample size is small - five matches against Australia and one season with Northern Superchargers in The Hundred - when it comes to assessing what sort of England captain Brook will be.\nStill, do not expect significant change.\n\"It is very similar to how we want to play in Test cricket. Always looking to put the bowler under pressure and make them change,\" he said during that Australia series, when asked how he wanted the 50-over side to play.\nBrook admitted himself he was \"frantic\" at the start of that series but overall, despite England losing 3-2 to the world champions, he largely impressed.\nHe showed imagination in a win at Chester-le-Street where Cameron Green was caught by a fielder in an unusual position behind the non-striking batter, and bowler Jacob Bethell immediately turned to celebrate in Brook's direction.\nKey will also hope captaincy brings the best of Brook the white-ball player.\nBrook scored 110 in that win at Durham, which remains his only international white-ball century despite all of his obvious talent.\nHe was not the only England batter to struggle, but a difficult time in the Champions Trophy and the tour of India that preceded it leaves him with 188 runs across 11 white-ball innings at an average of 17.09 this year.\nThe biggest negative of appointing Brook is the workload it adds to one of England's busiest players as a Test, 50-over and T20 mainstay.\nEngland's schedule is packed, with 11 Tests, nine one-day internationals and 12 T20s before the end of the Ashes in January.\nThere is then a T20 World Cup in India and Sri Lanka to follow in late February and March, where Brook will lead on the global stage for the first time.\nFor now at least, England's plan is that he will play everything.\nThere are no direct clashes in fixtures while he is young, does not have children and has had a decent break - having skipped this year's Indian Premier League.\nIt is not without risk. A burnt-out Brook would hurt England almost as much as an injury to Stokes in Australia.\nFor Key, though, this one is a gamble worth taking.", "url": "https://www.bbc.com/sport/cricket/articles/c2lzjdl5znlo"}