{"authors": ["Ciaran Varley", "www.facebook.com"], "date_download": "2025-05-21 06:26:56", "date_modify": "2025-05-21 06:26:56", "date_publish": "2025-04-01 09:20:51", "description": "Baller League UK is into its second week, with YouTubers bossing ex-Premier League stars on the touchline.", "filename": "sport_football_articles_cgkg7zx5d4yo_1747808816.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7071/live/377a0b90-0eda-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cgkg7zx5d4yo_1747808816.html", "title": "Baller League UK: YouTubers get better of Premier League legends on touchline", "title_page": "Baller League UK: YouTubers get better of Premier League legends on touchline - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "YouTuber Angry Ginge's Yanited are top of the table in Baller League UK after bossing teams managed by Arsenal's Invincibles and former Chelsea captain John Terry in the opening two matchdays.\nIt's all part of the disruptive world of this new six-a-side tournament, where other managers include the likes of Ballon d'Or winner Luis Figo and rapper Dave.\nBaller League was set up in Germany by entrepreneur Felix Starck alongside footballers Mats Hummels and Lukas Podolski, and has now come to the UK and US.\nKSI, who has 24.8 million YouTube subscribers, is president of the UK version.\nThere are matches every Monday until 2 June on indoor football pitches at Copper Box Arena, London, with 12 teams competing.\nThe top four teams will qualify for the play-offs in mid-June, with two semi-finals and a final to decide a champion.\nPlayers are paid £400 per match and the teams are made up of recently retired professionals, futsal players, free agents and released academy players, who all came through trials in London and Manchester.\nPlayed on short indoor pitches in 15-minute halves, with multiple dynamic rule-changes throughout, the format favours flair players, high-scoring and strong tackling.\nEach match is streamed live, with YouTuber Chunkz hosting a weekly show where celebrities and other stars from the world of football drop in. In matchday two, Tottenham Hotspur defender Kevin Danso was a pitchside co-commentator.\nInnovative rules make the game fast-moving and high-scoring.\nThere are no corners - if the ball goes behind off the opposition three times, a penalty is awarded to the attacking team. Cue plenty of long shots in matchday two, aiming to either score or get the ball deflected behind.\nIn the final three minutes of each half different rules are added, including a 3 vs 3 format, long-range goals scored from behind the offside line counting as double and goalkeepers being unable to use their hands.\nUnder one of the rules, attacking players are given a 30-second limit before they have to shoot.\nCoaches can also throw in a white flag to challenge a refereeing decision.\nOn the coaching side, Baller League have enlisted an impressive roll call of current and ex-professional footballers, as well as YouTubers and celebrities.\nFormer Arsenal players Jens Lehmann, Freddie Ljungberg and Robert Pires, who all played in Arsene Wenger's 'Invincible' side of 2003-04, manage N5 FC – the name being a reference to North London.\nThey're bottom of the table after losing their opening two matches - a 7-2 matchday one loss to Yanited and a 7-3 defeat by Deportrio, who are managed by Gary Lineker, Alan Shearer and Micah Richards.\nRichards was every bit as animated on the touchline after that win as one might imagine.\nFormer Chelsea and England captain Terry's 26ers are also down at the bottom of the table following two losses, as are Wembley Rangers, managed by Arsenal legend Ian Wright and Lioness Chloe Kelly.\nMeanwhile, Angry Ginge's Yanited are top of the table, having scored 14 goals across their first two matches in the tournament.", "url": "https://www.bbc.com/sport/football/articles/cgkg7zx5d4yo"}