{"authors": ["Clive Lindsay", "www.facebook.com"], "date_download": "2025-04-26 04:38:46", "date_modify": "2025-04-26 04:38:46", "date_publish": "2025-02-28 10:02:33", "description": "Manager in spotlight: Tony Docherty", "filename": "sport_articles_cr522y8gr5lo_1745642326.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3b54/live/c16c30f0-f5ba-11ef-9e61-71ee71f26eb1.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cr522y8gr5lo_1745642326.html", "title": "Manager in spotlight: Tony Docherty", "title_page": "Manager in spotlight: Tony Docherty - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "When Dundee thumped Motherwell 4-0 to leapfrog the visitors into fifth place in early December, the talk was about two sides from the City of Discovery finishing in the top six.\nHowever, after a run of five straight league defeats for Tony Docherty's side, the fear of relegation blues have returned to the Dens Park side of Tannadice Street.\nNow four points adrift of third-bottom Kilmarnock and only three clear of St Johnstone, Saturday's visit of the Premiership's bottom side could be season defining for Dundee.\nHaving only appointed Simo Valakari in October, Saints appear ready to stick with their Finnish manager even if relegated.\nIn contrast, pressure will mount on Docherty - from Dundee fans at least - should the improving Perth side secure a sixth win in their latest eight outings to draw level in what could then develop into a two-team dogfight to avoid the automatic relegation spot.\nA victory for either would, of course, take them closer to one, if not two, of the teams immediately above, considering Kilmarnock visit Ross County.\nTo do so, Dundee must repeat the form they showed in beating United and Airdrieonians in the cup amid their run of six without a win in the league.\nThey did beat Saints 3-1 in their latest meeting, at McDiarmid Park in January.\nIt was the Perth side who prevailed 2-1 on their previous visit to Dens in October, but since then they have only won once in eight away games.\nThat was also their only win in eight meetings between the sides and St Johnstone have not won twice running at Dens in a single season since 1998-99.\nDocherty will hope that trend continues.", "url": "https://www.bbc.co.uk/sport/articles/cr522y8gr5lo"}