{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:05:51", "date_modify": "2025-05-21 04:05:51", "date_publish": "2024-12-29 00:00:00", "description": "Pep Guardiola celebrates 500 games in charge of Manchester City with a nervy win over Leicester.", "filename": "sport_football_live_cgq1epj0pgwt_1747800351.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cgq1epj0pgwt_1747800351.html", "title": "Leicester City 0-2 Manchester City: Pep Guardiola celebrates milestone as Erling Haaland scores in victory", "title_page": "Leicester City 0-2 Manchester City: Pep Guardiola celebrates milestone as Erling Haaland scores in victory - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Pep Guardiola celebrated 500 games in charge of Manchester City with a nervy win over Leicester.\nSavinho and Erling Haaland gave the floundering defending champions just a second win in their last 10 Premier League games.\nIt was still not enough to lift them back into the top four, instead leaving them fifth and 14 points behind leaders Liverpool who beat West Ham 5-0.\nGuardiola had promised not to give up amid the worst run of his managerial career but the visitors lived dangerously at the King Power Stadium with Jamie Vardy twice going close and Facundo Buonanotte hitting the post for the Foxes.\nConfidence clearly needs to be rebuilt at City but it was good enough to beat a Leicester side who are fading after a promising start under Ruud van Nistelrooy.\nIt is now four straight defeats for the Foxes and five in seven games since Steve Cooper was sacked in November which leaves them in the relegation zone.\nVardy had the hosts' best first-half chance, thwarted by Stefan Ortega after Josko Gvardiol's mistake, before Buonanotte's header rebounded off the post but by then they were already trailing to Savinho's 21st-minute goal - his first for City.\nGoalkeeper Jakub Stolarczyk, who denied Haaland early, parried Phil Foden's shot and winger Savinho fired in high from six yards.\nLeicester still sensed they could exploit City's brittle backline and James Justin came close to a second-half leveller, only for Manuel Akanji to hack clear.\nVardy - who also hit the bar late on - then fired over from six yards before Haaland ended any hopes of a comeback, heading in Savinho's cross with 16 minutes left.\nPep Guardiola sounded like a broken man after Manchester City's 2-1 defeat at Aston Villa before Christmas.\nSubdued and searching for answers he was a shadow of his former self.\nOn Sunday, you could see what the victory at Leicester meant to him and the squad following their celebrations at the final whistle.\nGuardiola himself admitted in his post-match press conference it was relief more than happiness.\nGuardiola, marking 500 games in charge at City, was serenaded by the travelling supporters throughout the game and clearly had not lost that support – after four straight titles why would he – and he clearly needed this win more than anyone.\nIt was nervy with the Foxes striking the woodwork twice and Jamie Vardy missing another fine chance and one win at struggling Leicester will not cure all the problems. It can however at least be a platform.\nThey failed to rediscover any momentum following the 3-0 win over Nottingham Forest at the start of the month and cannot afford to fall further behind the top four, with Guardiola conceding City may not qualify for the Champions League if their slide continues.\nGames against West Ham, Brentford and Ipswich are to come – plus Salford in the FA Cup – and maintaining form essential if it is not going to be another false dawn.\nLeicester should not be judged too harshly after Christmas defeats by Liverpool and Manchester City – especially as Ruud van Nistelrooy assesses his squad – but concerns will grow soon enough.\nFour straight defeats, after a moral-boosting four points from Van Nistelrooy's first two games, have seen the Foxes slip into the relegation zone.\nThere were encouraging aspects in the performance, especially the chances created, but it was a story which many struggling clubs would be able to tell: The misfiring champions come to town, the hosts put up a good fight and could have taken something yet are ultimately left pointless.\nVan Nistelrooy wanted to take his early weeks to discover what was really needed for the January transfer window and, after conceding 14 goals in five games, will likely think defensive reinforcements are required.\nLeicester now go to Aston Villa before hosting Fulham and Crystal Palace in the Premier League next month and it will be paramount to stop leaking goals.", "url": "https://www.bbc.com/sport/football/live/cgq1epj0pgwt"}