{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:39:54", "date_modify": "2025-04-26 03:39:54", "date_publish": "2025-03-05 10:51:46", "description": "Swansea City: 'Pass the ball less and high energy' - Paul Heckingbottom on Swans", "filename": "sport_football_articles_c4g08d1z8ppo_1745638794.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c39c/live/f1e30ef0-f9ae-11ef-b257-2b725ccbdd87.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c4g08d1z8ppo_1745638794.html", "title": "Swansea City: 'Pass the ball less and high energy'", "title_page": "Swansea City: 'Pass the ball less and high energy' - Paul Heckingbottom on Swans - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Preston North End manager Paul Heckingbottom reckons Swansea City look a side more concerned with high energy than high possession following the departure of Luke Williams.\nPreston were left frustrated after creating the better chances in Tuesday's goalless draw with Swansea at Deepdale.\nSwansea controlled the contest in the first 25 minutes, but then relied on a battling defensive performance – and some wayward Preston finishing – to hold on for a point.\nCaretaker Swans boss Alan Sheehan said the pitch at Preston made it \"very difficult\" for his team to play possession football.\n\"When we tried to pass the ball, it takes three touches instead of two in the conditions out there,\" the Irishman added.\nBut having watched Swansea in the flesh – and analysed their win over Blackburn Rovers in Sheehan's first game in charge – Heckingbottom felt there was a pattern in their style of play.\n\"We knew watching Swansea's game [against Blackburn] their approach - high energy,\" the former Sheffield United boss said.\n\"That's the big difference in them – pass the ball less and high energy.\"\nHeckingbottom felt Preston's failure to be clinical in front of goal cost them a second successive win, following their impressive FA Cup triumph over Burnley last Saturday.\n\"Swansea had 10 days [between games] and we were off the back of a big game at the weekend,\" he added.\n\"So we had to make sure we guarded against it being a flat performance from us.\n\"We should have won the game. We created more than enough. If you ask our front players, if they had those chances again, they'd take them on another day.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c4g08d1z8ppo"}