{"authors": ["Lewis Irons", "www.facebook.com"], "date_download": "2025-05-21 04:54:29", "date_modify": "2025-05-21 04:54:29", "date_publish": "2025-04-04 15:04:44", "description": "St Mirren deserve more credit, says Robinson", "filename": "sport_articles_cpwz2q07ewro_1747803269.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b5e0/live/f24d32c0-1165-11f0-ba60-99b08c2860b3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cpwz2q07ewro_1747803269.html", "title": "St Mirren deserve more credit, says Robinson", "title_page": "St Mirren deserve more credit, says Robinson - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "St Mirren manager Stephen Robinson says his players \"haven't had enough credit\" as they target a top-six finish for the third season in a row.\nSaints are aiming for their first win against Dundee this season in their penultimate match before the split, and Robinson believes his players have the mentality required to finish in the top half yet again.\nThe Paisley men are currently seventh, a point behind Hearts.\n\"Personally, I don't think the players have had enough credit for it,\" the Northern Irishman said.\n\"It's now expected that St Mirren should be in the running for a top-six place and I read articles saying we should be in there. I don't know what that's based on, bar the quality of the players and the quality of the recruitment. It's all credit to them.\n\"I've said it all along but I think with about eight games to go we were in the running, now to be a point off the top six and to have a real chance again for three years in a row is a real achievement, no matter what happens in the end.\n\"It's been a trying season but it just shows the character of these players that they're still in this position.\"\nRobinson says his players believe they belong in the top six.\n\"I believe they do. Within our dressing room we believe that we're a very good side,\" he added.\n\"Sometimes things go for you, sometimes things are out of your control which a lot of it has been this season.\n\"The resilience they've shown, the quality they've shown, is testament to the group.\"", "url": "https://www.bbc.com/sport/articles/cpwz2q07ewro"}