{"authors": ["Tyrone Smith", "www.facebook.com"], "date_download": "2025-04-26 04:23:28", "date_modify": "2025-04-26 04:23:28", "date_publish": "2025-03-03 13:14:01", "description": "Dundee United 'still in the mix' for third - Sam Dalby", "filename": "sport_articles_c4g7r3e1xp4o_1745641408.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/28d9/live/42ee8ab0-f831-11ef-a8b4-b37546a32a57.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_c4g7r3e1xp4o_1745641408.html", "title": "Dundee United 'still in the mix' for third", "title_page": "Dundee United 'still in the mix' for third - Sam Dalby - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Sam Dalby insists Dundee United are \"still in the mix\" to finish in a European spot, despite squandering a two-goal lead against fellow hopefuls, Aberdeen.\nUnited soared into a first-half 2-0 lead at Pittodrie, but Jim Goodwin's side blew it, having to settle for a point in the north-east.\nThe result means they remain fifth in the table, two points behind third-placed Hibernian, following their Edinburgh derby victory, and just one behind the Dons.\nHowever, on-loan Wrexham striker Dalby says there's no reason United still can't finish as high as third.\n\"We are still in the mix and that is the most important thing,\" the 25-year-old said. \"They [Aberdeen] haven't extended the gap on us.\n\"They're a good side and we tired a little bit towards the end but we will take the point at the end of the day.\"\nAs has often been the case this season, Dalby contributed to the draw, netting his 13th Premiership goal of the campaign.\nHe leads the league charts, so, what's the secret to his success?\n\"I would say my own mindset and trying to get in the box and attack things as much as possible,\" he added.\n\"I would probably say past seasons I have come to the ball a bit too much, rather than trying stay in the six yard box and get on the end of things.\n\"I came here because I wanted to play games and get a good season under my belt and obviously the gaffer has trusted me to play since I have been here, so I am thankful for that.\"", "url": "https://www.bbc.co.uk/sport/articles/c4g7r3e1xp4o"}