{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:46:25", "date_modify": "2025-05-21 06:46:25", "date_publish": "2025-03-30 15:42:19", "description": "Preston 0-3 Aston Villa: What Unai Emery said", "filename": "sport_football_articles_c807edg58kro_1747809985.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/20e4/live/729f4900-0d7d-11f0-a1c5-cd0d1898b025.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c807edg58kro_1747809985.html", "title": "Preston 0-3 Aston Villa: What Unai Emery said", "title_page": "Preston 0-3 Aston Villa: What Unai Emery said - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Unai Emery has been speaking after Aston Villa's 3-0 victory against Preston in the FA Cup. \"We played a serious match. Of course we are concerned about our goals in every competition, we try to reduce chances for the opponent and today the best work we did playing seriously.\n\"The first half was equal more or less but we didn't concede chances, we were more in their box. The second half we scored the first goal and after that it was more difficult for them and we felt more comfortable. We played 90 minutes being so responsible in our work.\"\nOn Rashford: \"Firstly his commitment to work, to adapt quickly is very important and he is doing that. Then to feel comfortable playing in his best level, there's still work to do but today he made one step forward, feeling comfortable and scoring goals.\"\nOn the chance of winning a trophy: \"Firstly I am proud of how the owners and the club is responding. When we arrived here we were speaking about how much we want to work here together.\n\"To play in Europe and we did, to be in contention for a trophy and last year we were in the Conference League. We are increasing our level, our demands. We are in the top eight of the Premier League more or less, we are in Europe, we are going to play in the quarter-finals of the Champions League, I think the ambition the owners showed is on the field. I am very demanding to try and do my best.\"", "url": "https://www.bbc.com/sport/football/articles/c807edg58kro"}