{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 08:02:40", "date_modify": "2025-05-21 08:02:40", "date_publish": "2025-03-27 15:43:39", "description": "The Kenya Football Federation launches an investigation into allegations that goalkeeper Patrick Matasi has been involved in match manipulation.", "filename": "sport_football_articles_cqlyqp0en07o_1747814560.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f207/live/7cf5cc60-0b09-11f0-a70a-3789f4a4779e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cqlyqp0en07o_1747814560.html", "title": "Kenya keeper the subject of match-fixing investigation", "title_page": "Patrick Matasi: Kenya keeper the subject of match-fixing investigation - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The Kenya Football Federation (FKF) has launched an investigation into allegations that goalkeeper Patrick Matasi has been involved in match manipulation.\nThe 37-year-old, who plays for Kenyan Premier League club Kakamega Homeboyz, has won over 30 international caps.\nHis most recent appearance for the Harambee Stars came in October last year, in a qualifier for the 2025 Africa Cup of Nations.\nAn undated video posted online - which the BBC has not been able to verify - appears to show Matasi agreeing a deal to influence the outcome of a league game.\n\"I have spoken to him. He was also shocked at what he was seeing in the video and he told me he doesn't know about match-fixing,\" Homeboyz owner Cleophas Shimanyula told BBC Sport Africa.\nThe FKF said it would work with world governing body Fifa, the Confederation of African Football and other \"relevant authorities\" during its investigation.\n\"We reaffirm our zero-tolerance policy on match manipulation and are committed to safeguarding the credibility of our competitions,\" a statement added.\n\"This investigation will adhere to FKF's anti-match manipulation regulations and Fifa guidelines, ensuring a fair, transparent, and thorough process.\n\"The rights of the player and his club will be respected, and appropriate action will be taken based on the findings.\"\nBBC Sport Africa has contacted Matasi for comment.\nShimanyula backed Matasi, pointing to the fact the veteran has kept three clean sheets in as many games since joining the club a month ago.\n\"When we watched this video, we found that Matasi has not wronged the club,\" he said.\n\"In a video there can misinterpretations and false narratives and we cannot trust everything.\n\"He will keep playing for us because there's no wrongdoing on his part as far as we are concerned - unless there's evidence or the FKF writes to us to say they are suspecting the player of some wrongdoing.\n\"He is innocent until proven guilty and then we will act.\"\nThe FKF has called on anyone with credible information to assist its investigation, with any reports to be handled with strict confidentiality.\nShimanyula also challenged the Kenyan footballing community to provide evidence against Matasi.\n\"Kakamega Homeboyz is against any form of match manipulation,\" he said.\n\"In the past we've reported match-fixing regarding some of our players who fixed a game with the coach and punishments were handed down by Fifa.\n\"We have our own internal systems that we use to also look at match-fixing and I cannot speak on behalf of other clubs.\n\"As Kakamega Homeboyz we are asking anyone who has evidence of Matasi fixing a game to bring it forward.\"", "url": "https://www.bbc.com/sport/football/articles/cqlyqp0en07o"}