{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:07:20", "date_modify": "2025-05-21 05:07:20", "date_publish": "2025-01-23 11:15:51", "description": "Head of rugby Johann van Graan says Bath have \"no regrets\" following their exit from the Champions Cup last weekend.", "filename": "sport_rugby-union_articles_c98y9z5qm9ro_1747804040.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2928/live/7c630580-d975-11ef-a7bb-3fe4cd8ea938.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c98y9z5qm9ro_1747804040.html", "title": "Bath have 'no regrets' after Champions Cup exit", "title_page": "Johann van Graan: Bath have 'no regrets' after Champions Cup exit - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Bath have \"no regrets\" following their exit from the Champions Cup last weekend, according to head of rugby Johann van Graan.\nBath were beaten 47-21 by Leinster in their final pool game last Sunday, during which they had prop Beno Obano sent off following two yellow cards.\nThe team - who are top of the Premiership - won only one of their four European games this season, against ASM Clermont Auvergne, with losses also to Benetton and La Rochelle, and have dropped into the Challenge Cup for the knock-out stage.\n\"Really happy with how we prepared in the week, really happy with how we started both halves, [could be a] bit more clinical five yards from their tryline and also in big pressure games - similar to Toulouse a year ago - we just fell short and will take our learnings and then move on,\" Van Graan told BBC Radio Bristol.\n\"We had opportunities against La Rochelle in the rain and then we lost in the last minute of the game against Benetton away, and I think that moment is a big swing of three points both ways.\n\"Absolutely no regrets from our side. We've loved the last two weeks, we move forward in a different competition now. We're not going to spend an awful amount of time on it.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/c98y9z5qm9ro"}