{"authors": ["Tom English", "www.facebook.com"], "date_download": "2025-05-21 07:10:05", "date_modify": "2025-05-21 07:10:05", "date_publish": "2025-02-08 08:02:21", "description": "Scotland have a miserable recent record against Ireland - this is how Gregor Townsend's side can defeat the Six Nations champions.", "filename": "sport_rugby-union_articles_ceq9pln08e0o_1747811405.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0812/live/b1ce80f0-e497-11ef-ad78-495d7242957d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_ceq9pln08e0o_1747811405.html", "title": "Six Nations 2025: Scotland v Ireland", "title_page": "Six Nations 2025: Scotland v Ireland - how home side can win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Scotland coach Gregor Townsend was asked after his side's opening-weekend victory against Italy how he hoped to beat Six Nations champions Ireland eight days later at Murrayfield.\n\"By scoring more points than them,\" he replied.\nHis brevity was understandable. Having lost this fixture 10 times in a row, a proper analysis of the things Scotland must - and must not do - against their bogey team requires more than one answer shortly after the end of a different game.\nSo, how can Scotland end their miserable recent record against Ireland? What does the grim history tell us about how they can get it done?\nIn Dublin last year, Ireland got off to a shaky start. In the opening minutes they gave away a penalty, a free-kick, got charged down and turned over. Finn Russell made it 3-0. An encouraging beginning.\nThen Scotland messed up. They had a lineout close to their own line and threw it to Dan Sheehan, who went over. That game was a proper physical battle, with a four-point gap at the end. Scotland gave Ireland a free seven to Sheehan.\n'Cheap points' is a term used by successive Scotland captains against Ireland. Over the 10 defeats, this kind of wounding error is a theme.\nIn 2022, while trailing 14-5, Stuart Hogg got greedy when going for the corner while Sam Johnson was free inside. Hugo Keenan put him into touch. A certain try was gone.\nThe piece-de-resistance of calamities came in 2020, when Hogg dropped the ball going over the Ireland line in Dublin. That was in the 50th minute. A converted try would have brought the score level at 13-13. And Scotland would have had momentum.\nTony Ward, the former Ireland fly-half working for RTE, said the Scots were the better team that day.\nIn 2019 Scotland started quickly at Murrayfield only to concede via a cock-up between Tommy Seymour and Sean Maitland.\nThe year before that, Peter Horne gave away an easy seven points early in Dublin when his pass was intercepted. Scotland butchered multiple chances that day, every error proving grist to Ireland's mill.\nEvery team makes mistakes but Scotland's mistakes in this fixture tend to be absolute whoppers. That has to stop.\nScotland have had a tendency to be blown away in short order, shipping a lot of points without reply. At the 2023 World Cup they were 36-0 down within an hour. Lights out.\nIn the 2023 Six Nations they were leading 7-3 after 17 minutes before conceding 19 unanswered points. In 2022 they were 14-0 down inside half an hour. In the Nations Cup in 2020 they conceded 19 unanswered points in 12 minutes.\nAt the 2019 World Cup they trailed 19-3 before the half hour. In 2018 Ireland led 21-3 after 46 minutes.\nGiving Ireland big leads is ruinous to your health. The biggest points advantage Scotland have had in any game in the past 10 was six. Building some scoreboard pressure might be an idea for Sunday.\nIreland had a tough time against England last Saturday. Their breakdown was in bother in the face of a furious 40 minutes from the visitors and their error count was high. But they fixed it.\nAnd that is one of Ireland's greatest strengths - they have the nous to think their way through bad moments.\nSunday is a day for leaders who can steer Scotland through choppy waters. All of Scotland's go-to men have to step up, particularly when things are at their most challenging.\nWhat else? They need to attack Ireland's lineout, which was a worry for them coming into this championship. England, bizarrely, never really went after it.\nThey need to get Ireland trying to play catch-up. Putting them under pressure is paramount. And they need a break or two. Soft points for rather than against. Some big calls going their way. A crowd engaged and raucous from the start.\nAll of that and the jinx might end. Might.", "url": "https://www.bbc.com/sport/rugby-union/articles/ceq9pln08e0o"}