{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:54:17", "date_modify": "2025-05-20 11:54:17", "date_publish": "2023-08-06 00:00:00", "description": "Follow live commentary & text updates from the Community Shield as Manchester City face Arsenal at Wembley Stadium.", "filename": "sport_live_football_65935485_1747742057.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/87A7/production/_130672743_gettyimages-1596733055.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_football_65935485_1747742057.html", "title": "Arsenal vs Man City in Community Shield at Wembley", "title_page": "Arsenal vs Man City in Community Shield at Wembley - score, commentary & updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Goodbye\nArsenal 1-1 Man City (4-1 pens)\nConsider the curtain raised. Thanks for joining us this afternoon as Arsenal won the Community Shield.\nRead Gary Rose's match report from Wembley here.\nThe Premier League starts in five days with Manchester City visiting Burnley. See you then.\nPost\nArsenal 1-1 Man City (4-1 pens)\nErling Haaland has failed to score in his last six appearances for Manchester City, having previously never gone more than three games without scoring for the club.\nHe failed to attempt a shot for the second time since joining last year, the other instance coming against Spurs in February.\n'Hopefully we can win Treble again'\nArsenal 1-1 Man City (4-1 pens)\nManchester City\nManchester City goalscorer Cole Palmer to ITV: \"Very close. Gutted to concede in the last minutes.\n\"We have to pick ourselves up and go again.\n\"When I got the ball Pep told me to be myself. I cut in and saw the far corner. Thankfully it went in.\n\"We'll have to see what the plan is for next season. Hopefully play as many games as possible. I feel fresh from England, the [Euro U21s] final wasn't that long ago.\n\"Hopefully we can win the Treble again but it will be a difficult ask. The lads are sharp in training.\"\nget involved\nGet Involved\n#bbcfootball, text 81111 (UK only - standard rates apply) or WhatsApp 03301231826\nFootball wise, it doesn't mean much, but this is a big win for Arsenal psychologically. That is why Arteta was desperate to win.\nBrendan, Kansas City, USA\nPaul: It is “only” a community shield but beating City in any game is not easy to do. They’re the best team in the world. Better to go into a season with a win in any game than a loss or draw.\nSarah Morgan: This Gunner before Community Shield: Penalties aren't a fair way to settle a game.\nAfter: I like them much better now and we were edging that game towards the end.\nWould I feel the same if it was the other way round? No. Am I alone in my double standard? Doubt it!\n'I'm buzzing'\nArsenal 1-1 Man City (4-1 pens)\nArsenal\nArsenal midfielder Declan Rice speaking to ITV: \"I am buzzing, this is what I visioned when I joined.\n\"City gave us what we expected, but I am buzzing – so happy. You have to have the patience against them, you have to have mini games within the game against them like the manager said to us before.\n\"To win today, my first for the club.\n\"I feel I've grown a lot in the last three weeks. There's a lot of information to take in of what the manager wants. I'm eager to learn and keep improving.\n\"I'm sure we can achieve anything this seaosn - we just need to remain focused.\"\n'It's a statement... that mental block is gone'\nArsenal 1-1 Man City (4-1 pens)\nArsenal\nArsenal goalkeeper Aaron Ramsdale to ITV: \"We worked hard on it. We've been working hard for two years. We haven't had luck which was probably needed in previous seasons. We've stuck at it. It's worked today.\"\nOn what this means for the season: \"I'm not sure. City are a bit behind their pre-season. For us, it's a statement. It's a marker to know we can go and beat Man City in a big game when it matters.\n\"I'm not sure what it'll be like this season. But that mental block is gone. We're ready to push on now.\"", "url": "https://www.bbc.com/sport/live/football/65935485"}