{"authors": ["Joe Bradshaw", "www.facebook.com"], "date_download": "2025-05-21 04:47:12", "date_modify": "2025-05-21 04:47:12", "date_publish": "2025-01-23 13:29:04", "description": "Crystal Palace news: Is Romain Esse the next Championship gem?", "filename": "sport_football_articles_cn57y0v9vw2o_1747802832.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/bd46/live/b6649a70-d98c-11ef-bc01-8f2c83dad217.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cn57y0v9vw2o_1747802832.html", "title": "Crystal Palace news: Is Romain Esse the next Championship gem?", "title_page": "Crystal Palace news: Is Romain Esse the next Championship gem? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Not many teams have the same hit rate as Crystal Palace when it comes to striking gold from the Championship.\nThis week's signing of talented teenager Romain Esse from Millwall has a similar vibe to previous moves for Eberechi Eze, Michael Olise and Adam Wharton, young stars ready to showcase their talents on a bigger platform.\nAll three of those have been huge hits at Selhurst Park, but at the point of signing how does Esse's pedigree compare?\nThe above graph shows the appearances, goals and assists figures for each of the players at their previous clubs - Eze at QPR, Olise at Reading and Wharton at Blackburn Rovers.\nClearly, Eze was the most experienced when he signed, chalking up more than 100 appearances in west London and arguably being overdue his move to the Premier League.\nAt 19, Esse has actually played more senior games than Wharton who needed just 51 games to showcase his talent at Ewood Park.\nOne slightly jarring comparison is the assists marker - Esse has just one in 66 games as opposed to Olise who had 14 by the time he left Reading.\nDoes this hint at a lack of end product from a raw midfielder still finding his feet in senior football or could it just be a symptom of playing in a mid-table Championship side that has scored the second fewest in the division this season?\nAs and when Esse breaks into the Palace side, boss Oliver Glasner will want pace, skill and end product.\nFollowing in the footsteps of those who came before him would be an excellent start.", "url": "https://www.bbc.com/sport/football/articles/cn57y0v9vw2o"}