{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:55:04", "date_modify": "2025-05-21 03:55:04", "date_publish": "2025-04-07 14:04:19", "description": "Head coach Neil Critchley insists Europe 'not beyond' Hearts yet", "filename": "sport_articles_c8rgklmnkdlo_1747799704.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/db8f/live/7172ae60-13a8-11f0-8bf3-33a2b06eeb4d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c8rgklmnkdlo_1747799704.html", "title": "Critchley insists Europe 'not beyond' Hearts yet", "title_page": "Head coach Neil Critchley insists Europe 'not beyond' Hearts yet - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Neil Critchley believes European football next season is still achievable for Hearts, although he admits their 1-0 defeat by Dundee United on Sunday makes it more difficult.\nThe Tynecastle side are eight points behind United in fifth after that loss with six matches of the season remaining.\nThey could reach Europe via a top-five finish in the league, or with a Scottish Cup triumph - they face Aberdeen in the semi-finals later this month.\nHearts must beat Motherwell this weekend to guarantee their spot in the top six before the league splits and Critchley says that must be the priority.\n\"I wouldn't say it's beyond us yet,\" Critchley said, when asked about Hearts' European prospects.\n\"It's obviously harder, but if we can get into the top six then we've got to play those teams [Dundee United, Aberdeen and Hibernian], and then we can take points off them,\" said Critchley.\n\"It's not beyond us, but we've got to get there first, so our first priority is to go to Motherwell and win next week.\n\"The positive thing is it's in our favour [to make top six]. We're not relying on other results. We know if we go there and win, then it's job done. It's still in our hands and we have to use that as a positive.\n\"If we play like we did against Dundee United, with a little bit of better quality, then that will give us a good chance.\"", "url": "https://www.bbc.com/sport/articles/c8rgklmnkdlo"}