{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:41:43", "date_modify": "2025-05-20 11:41:43", "date_publish": "2023-08-06 17:15:09", "description": "Lowry delight as '24-hour whirlwind' ends in winning debut", "filename": "sport_articles_c2vzygn9385o_1747741303.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c2vzygn9385o_1747741303.html", "title": "Lowry delight as '24-hour whirlwind' ends in winning debut", "title_page": "Lowry delight as '24-hour whirlwind' ends in winning debut - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Alex Lowry only made a 15-minute cameo appearance in Heart of Midlothian's opening-day win over St Johnstone, but it came at the end of \"a whirlwind\" couple of days that led to his departure from Rangers on loan for the first time in his career.\nThe 20-year-old midfielder is due to spend a season at Tynecastle following positive talks with Hearts technical director Steven Naismith, the former Rangers striker.\n\"I spoke to Naisy on Thursday night and then Friday after training got the text saying that's it all done,\" the Scotland Under-21 international said.\n\"A quick jump up to the Oriam, got my medical done, got everything signed and into the squad today. Definitely a whirlwind 24 hours - but one I've enjoyed.\"\nAsked why he chose Hearts head of other offers, Lowry told BBC Scotland: \"Just the platform to play. The fans are brilliant and I love playing at Tynecastle and I look forward to playing there now.\"\n\"The lure of European football\" was also one of the main reasons he decided to head east to Edinburgh, so he hopes \"we can carry this on\" into Thursday's Europa Conference League third qualifying first-leg trip to face Rosenborg in Norway.\n\"Just good to get my debut and I thought it was a good win,\" he said of the 2-0 victory in Perth.", "url": "https://www.bbc.com/sport/articles/c2vzygn9385o"}