{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:41:08", "date_modify": "2025-04-26 07:41:08", "date_publish": "2025-02-27 12:00:01", "description": "Scarlets back Macs Page has signed a first senior professional contract in his break-through season after graduating from the academy.", "filename": "sport_rugby-union_articles_c74kkze8dg9o_1745653268.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/65eb/live/731be0f0-f4f0-11ef-ae0a-4bca4f518eb0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_c74kkze8dg9o_1745653268.html", "title": "Macs Page: Scarlets young back signs new contract", "title_page": "Macs Page: Scarlets young back signs new contract - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Scarlets back Macs Page has signed a first senior professional contract after graduating from the academy.\nPage, who can play centre and wing, has enjoyed a breakthrough season at Parc y Scarlets with four tries in 13 appearances so far.\nThe 20-year-old, who hails from Pembrokeshire, was part of the Swansea City football academy before committing to rugby.\n\"Growing up, it was always a dream to play for the Scarlets and I've been fortunate to have had that chance this season and now be part of the senior squad,\" said Page.\n\"The season couldn't have gone much better for me personally. I have been lucky to have had opportunities and been able to score some nice tries along the way.\"\nPage is the first re-signing Scarlets have announced with more expected in the coming weeks.\n\"When we first saw Macs as a teenager it was clear he was a special talent with a huge amount of potential and it is brilliant to see how he has taken his opportunities this season,\" said Scarlets head coach Dwayne Peel.\n\"Macs is an X-factor player who can deliver some big moments in games, as he has shown with the tries he has scored.\"", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/c74kkze8dg9o"}