{"authors": ["Bobbie Jackson", "www.facebook.com"], "date_download": "2025-05-21 04:26:18", "date_modify": "2025-05-21 04:26:18", "date_publish": "2025-01-23 19:01:38", "description": "Nottingham Forest striker Chris Wood signs a new contract to keep him at the City Ground until 2027.", "filename": "sport_football_articles_cd64gq5lvpxo_1747801578.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/bc6f/live/c42a60e0-d9be-11ef-abf7-8b2a99c77ef2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cd64gq5lvpxo_1747801578.html", "title": "Chris Wood: Nottingham Forest striker signs extension until 2027", "title_page": "Chris Wood: Nottingham Forest striker signs extension until 2027 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Nottingham Forest striker Chris Wood has signed a new contract to keep him at the City Ground until 2027.\nWood has been one of the stars of the season so far, scoring 14 goals in 22 Premier League appearances to help Forest to third in the standings.\nThe 33-year-old joined Forest on loan from Newcastle in January 2023 and completed a permanent move in June that year.\nDespite only being at the club for two years he is their leading Premier League goalscorer, overtaking Bryan Roy's record of 24 in December.\n\"I'm very excited and very happy to have it completed and done, and I'm looking forward to the next couple of years, at least,\" Wood said.\n\"I saw the ambition when I first arrived. When I spoke to the owner and his family and saw where they want to be and where they see this club to be - it was clear they have high ambitions and big dreams. He has backed the club for years, even before promotion to the Premier League, which is fantastic, and the team is pushing in the right direction.\n\"I can't thank the fans enough, they always come in voice and they're always behind the team and myself, it's a pleasure playing in front of them. Here's to a few more years together.\"\nWood's previous deal was set to expire at the end of this season.\nHe is the second player to commit to the club this month after centre-back Murillo agreed a new four-and-a-half year deal.\nThe New Zealand striker was named as Forest's first Premier League Player of the Month in November, also becoming the first from his country to achieve that feat.\n\"He has performed exceptionally well with us,\" Nottingham Forest owner Evangelos Marinakis said.\n\"More than just his goals, he epitomises everything that it means to wear the Garibaldi red - hard work, a fighting and winning spirit, and the attitude to never give up. He is a winner and a role model to inspire all of us, and we reward his dedication with ours.\"\nWood scored 14 goals to help Forest beat relegation from the top flight in 2023-24 and has 30 in 65 appearances across all competitions.\nHis form at the City Ground raised to another level following the appointment of manager Nuno Espirito Santo in December 2023, with 25 of his 29 league goals for the club coming under the Portuguese.\nWood has again proved his value to Forest this season as they attempt to return to the European stage for the first time since reaching the quarter-finals of the Uefa Cup in 1995-96.\nForest are two-time European Cup winners, lifting the trophy in successive seasons in 1979 and 1980.\nThey are unbeaten in eight league games and are the only team to beat table-toppers Liverpool this campaign, winning 1-0 at Anfield in September, while they drew 1-1 in the return at the City Ground.\nNuno's side are six points adrift of Liverpool and have a six-point cushion to fifth-placed Manchester City in the race for a Champions League berth.\nOnly Newcastle's Alexander Isak (15), Manchester City's Erling Haaland (17) and Liverpool's Mohamed Salah (18) have scored more times than Wood in the league this season.\nWood also boasts the fifth best record when it comes to goal contributions in the Premier League this term, chipping in with 16 for Nuno's side.\nHe made his international debut for New Zealand in June 2009 and has scored 34 goals in 74 appearances for the All Whites.\nWood initially moved to England in 2009 but struggled to settle at West Brom, spending six separate spells on loan, including a stint at Leicester who he joined on a permanent deal in 2013.\nLeeds signed Wood in 2015 and he scored 44 times in 88 games at Elland Road before Burnley handed over a club record fee for his services two years later.\nWood scored 10 goals during Burnley's 2017-18 Premier League campaign to secure the Clarets a place in the Europa League.\nNewcastle paid £25m for Wood in January 2022 but just five goals in 39 appearances saw him head out to Forest.\nNick Mashiter, BBC Sport\nTying down Chris Wood to a new deal - richly deserved and well earned - is another piece of the City Ground puzzle.\nIt follows centre-back Murillo's new contract earlier this week and it is unlikely to be the last, with talks continuing over defender Ola Aina.\nThere has always been a relaxed and positive attitude towards Wood's deal at the club, with all parties confident an agreement would be reached.\nThe move - Wood joining initially on loan from Newcastle two years ago - has worked out handsomely for everyone and he has become a talisman for this season's shock Champions League challenge.\nThe deal will take Wood past his 35th birthday and the New Zealand international has already spoken about playing until he is 40.\nThat may not be for Forest but while they are together there is no reason why both cannot continue to shine.", "url": "https://www.bbc.com/sport/football/articles/cd64gq5lvpxo"}