{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:43:28", "date_modify": "2025-05-21 04:43:28", "date_publish": "2025-01-23 14:39:30", "description": "Shrewsbury boss Gareth Ainsworth tells BBC Radio Shropshire he wants to keep on-loan Leo Castledine, Funso Ojo & Josh Feeney.", "filename": "sport_football_articles_c98y989m3gro_1747802608.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3cd5/live/d6fc3ba0-d98f-11ef-bc01-8f2c83dad217.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c98y989m3gro_1747802608.html", "title": "Shrewsbury Town: Gareth Ainsworth keen to keep on-loan trio", "title_page": "Shrewsbury Town: Gareth Ainsworth keen to keep on-loan trio - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Shrewsbury Town boss Gareth Ainsworth has told BBC Radio Shropshire that he wants to keep on-loan trio Leo Castledine, Funso Ojo and Josh Feeney.\nThe League One relegation battlers used up their full quota of five permitted loan signings in August, but have since allowed Arsenal's Charles Sagoe Jr and Aston Villa's Tommi O'Reilly to go back.\nThat frees up two potential loan signings in the final fortnight of the January window, but Ainsworth is keen not to lose Villa defender Feeney and midfielders Ojo (Port Vale) and Castledine (Chelsea).\n\"I'm really happy with all three,\" Ainsworth told BBC Radio Shropshire. \"Right now, right here, none of those three will be leaving the club if it was down to me.\n\"Obviously, there are other clubs involved. But I want them all here. They are all totally bought into the fight.\n\"I know once everyone is on board, with the way I want things done, the way that we play and what we can achieve, you'll see some fantastic results.\"\nShrewsbury have so far made three January signings, all from non-league - Leamington striker Callum Stewart, Eastleigh midfielder Dom Gape and Telford striker Ricardo Dinanga, as well as extending keeper Jamal Blackman's deal.", "url": "https://www.bbc.com/sport/football/articles/c98y989m3gro"}