{"authors": ["Nicola Pearson", "www.facebook.com"], "date_download": "2025-05-21 05:35:28", "date_modify": "2025-05-21 05:35:28", "date_publish": "2025-01-14 16:05:12", "description": "Oliver Glasner press conference: Leicester vs Crystal Palace preview", "filename": "sport_football_articles_cqx9wp7w080o_1747805728.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8249/live/031e5ce0-6de3-11ef-b970-9f202720b57a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cqx9wp7w080o_1747805728.html", "title": "Oliver Glasner press conference: Leicester vs Crystal Palace preview", "title_page": "Oliver Glasner press conference: Leicester vs Crystal Palace preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "After a recent outbreak of illness in the squad, Glasner confirmed that \"the flu is gone fortunately, so all the players who were ill [last week] are now available\", including Jean-Philippe Mateta, Maxence Lacroix and Tyrick Mitchell.\nHe also confirmed Will Hughes \"has trained two days with us\" and will be included on Wednesday, but fellow midfielder Adam Wharton will not be available.\nThe Eagles boss added: \"[Wharton] is making progress. Everything is going in the right direction and I expect him back training with the team, maybe by the end of January, but probably the beginning of February.\"\nOn the news that midfielder Justin Devenny has signed a new two-year contract: \"Very positive signal. A player from academy doing really well, has played many more minutes with us, he deserved this new contract. He is doing well, working very hard, is a very good talent. It is a win-win for the club extending contract of an academy player and a good chance for him to get more minutes.\"\nOn whether there was any update on Trevoh Chalobah's situation after he was left out of the FA Cup team due to contractual issues: \"I didn't see him today so can't tell you anything.\"\nHe added: \"It's a little bit of a tricky situation. Chelsea has the possibility to call him back from loan. There is a little bit of uncertainty at the moment over whether they will do it. We need clarity and he needs clarity, so that's the situation and let's see. He wants to stay here but it's a decision Chelsea can take. He is performing very well for us and has high standing in our locker room.\"\nGlasner acknowledged a number of players were not in the team when they last faced Leicester, adding: \"Back then, we had players not being in their best shape after a very short pre-season - starting with two defeats, their self-confidence wasn't here. I think we're in a much better situation and shape now, the players know how we want to play and what we want to do.\"\nThe Palace boss said they \"don't care\" if they play home or away, they \"always enter the game with the same mindset, which is going and winning\". He continued: \"We don't care about the circumstances, whether it's rainy or not, if it's windy or not, if it's cold or not. If we play at home or away, we can't influence that. We always focus only on the things we can influence.\"", "url": "https://www.bbc.com/sport/football/articles/cqx9wp7w080o"}