{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:08:27", "date_modify": "2025-05-21 07:08:27", "date_publish": "2025-01-13 22:28:48", "description": "Wales head coach Warren Gatland says fly-half Gareth Anscombe still has an international future despite being dropped for the 2025 Six Nations.", "filename": "sport_rugby-union_articles_cm27zv5revzo_1747811307.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7a0a/live/19244fa0-d1c4-11ef-9f8b-6138f0924d77.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cm27zv5revzo_1747811307.html", "title": "Gareth Anscombe: Wales coach Warren Gatland says fly-half still has Test future", "title_page": "Gareth Anscombe: Wales coach Warren Gatland says fly-half still has Test future - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wales head coach Warren Gatland says Gareth Anscombe still has an international future despite the fly-half being dropped for the 2025 Six Nations.\nWith the injured Sam Costelow ruled out, Gatland has named uncapped Dan Edwards and Cardiff's Ben Thomas, who primarily plays at centre, as the two fly-half options in his 34-man squad.\nWhen asked whether Anscombe will struggle to play for Wales again, Gatland responded: \"No, I don't think so.\n\"We will pick up injuries at some stage and we know we've got that experience to come in.\"\nAnscombe, 33, has been left out while full-back Liam Williams, 33, and number eight Taulupe Faletau, 34, have been recalled to the squad.\nGatland stated he thought the Gloucester fly-half might not make the 2027 World Cup in Australia.\n\"We've spoken about 10 as being the position to develop some strength in depth over the next couple of years, looking short term and long term,\" said Gatland.\n\"We know Gareth has a lot of experience. One of the things we talked about is he'll be 36 by the next World Cup, so will he be around? We need to develop some options and experience.\n\"It's definitely a position of concern and losing someone like Sam Costelow as well probably didn't help.\n\"Someone like Dan gets that opportunity to put his hand up and hopefully we can support him and he can go and make the most of it.\"\nAnscombe joined Gloucester this season after recovering from a long-term groin injury.\n\"He hasn't been doing the kicking duties at Gloucester in terms of kick-offs, kicking for touch or taking goals,\" said Gatland.\n\"Over the last couple of campaigns he hasn't been able to handle that load with the kicking stuff.\n\"I'm sure he would have been able to do that and we know how experienced he is.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/cm27zv5revzo"}