{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:57:41", "date_modify": "2025-05-20 11:57:41", "date_publish": "2023-08-06 10:56:39", "description": "Carlisle United and Cumbria Police are to investigate the throwing of missiles at Saturday's game with Fleetwood.", "filename": "sport_football_66421597_1747742261.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/F29B/production/_130670126_gettyimages-1234183247.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66421597_1747742261.html", "title": "Carlisle United & Cumbria Police investigate missile incidents at Fleetwood home game", "title_page": "Carlisle United & Cumbria Police investigate missile incidents at Fleetwood home game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Carlisle United and Cumbria Police are to investigate incidents of objects being thrown on to the pitch during Saturday's home game against Fleetwood.\nThe club pleaded with fans to stop via a second-half public address system announcement and redeployed stewards and staff to avoid further incidents.\nA tweet by Carlisle United FC Police, external said such incidents are punishable under the Football (Offences) Act.\nIt added fans could face banning orders and the club could face further action.\nLast week the club were fined £7,500 following an independent regulatory commission investigation into racist chanting by supporters during the League Two match against Bradford at Brunton Park on 26 December.\nThe Cumbrians admitted to the breach of Football Association rule E21, around discriminatory behaviour.\nThe incident on Saturday, as the club began life back in League One in front of 10,279 fans at Brunton Park\nManager Paul Simpson pleaded with fans to \"stop being stupid\".\nHe added: \"All of our money at this football club goes into a pot to make the club better.\n\"If we go lining the pockets of the FA for stupid idiots who want to throw stuff on the pitch, it's going to affect us.\n\"We've got to deal with it and be more grown up about it. The 99.99% have been magnificent today, to get over 10,000 is a real credit to our supporters.\n\"A tiny minority, we have some idiots who are throwing things from the Warwick Road End, and they're going to cost this football club.\n\"If you have some clown, or more than one clown, who wants to throw things, we're going to end up throwing money away and giving it to the FA - and they don't need it as much as we do.\"", "url": "https://www.bbc.com/sport/football/66421597"}