{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:34:27", "date_modify": "2025-05-21 07:34:27", "date_publish": "2025-05-20 14:07:15", "description": "Hearts fan views: 'If McInnes wants a few Ferraris, let him have them'", "filename": "sport_articles_cn4qq894p83o_1747812867.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d2da/live/9fa99b20-fa7e-11ee-97f7-e98b193ef1b8.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cn4qq894p83o_1747812867.html", "title": "Hearts fan views: 'If McInnes wants a few Ferraris, let him have them'", "title_page": "Hearts fan views: 'If McInnes wants a few Ferraris, let him have them' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your views on what Derek McInnes' priorities should be as new Hearts head coach.\nHere's what some of you said:\nJarrod: Too often recently Hearts have gone for the cheap option with recruitment. McInnes has a track record of developing players so we should back his judgement and go all out to bring in his targets. If he wants a few Ferraris, let him have them.\nDave: First thing is to create a Hearts identity and team mentality. Then get back to footballing basics with players who will buy into that. Keep it simple and direct. Previous coaches seemed to over-coach players who in turn lost their own initiative to mix things up during the game. You have to play within a structure but don't stifle your own players' reading of situations as they develop on the field. All easier said than done.\nDonald: We need to build a spine to the team that is as strong as the old castle rock. A commanding centre-half needs brought in that we haven't seen since the Steven Pressley days. A proven goalscorer too, whether that is Lawrence Shankland putting the fresh ink on a new contract, or if we can unearth a superstar using the Jamestown Analytics.\nMarc: Firstly, I think the appointment of McInnes is the best option for Hearts. McInnes has proven over the years to be a successful manager, wherever he has been. Apart from keeping Shankland, whose goals of the last three years are irreplaceable, he needs to make Hearts strong defensively again. Building a solid foundation, making us hard to beat and not get bullied, which we have the past few years. Then adding pace in wide areas, like he had at Aberdeen, playing with tricky, pacey, inverted wingers. Let's make Hearts hard to beat and make Tynecastle a fortress again, a place no team enjoys playing at, then hopefully we can kick on from there.\nJockie: McInnes not my choice of a Hearts manager, but we have him and I will back him and the team. Like what he said during his interview, he now needs to back that up with actions and playing a style of football Hearts fans want to see, challenge the Old Firm and of course put Hibs to the sword.", "url": "https://www.bbc.com/sport/articles/cn4qq894p83o"}