{"authors": ["Alasdair Lamont", "www.facebook.com"], "date_download": "2025-05-21 04:01:49", "date_modify": "2025-05-21 04:01:49", "date_publish": "2025-01-15 09:36:53", "description": "Rangers: Philippe Clement still under pressure", "filename": "sport_articles_c17edew0w5eo_1747800109.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/246e/live/ac5a4d50-d323-11ef-87df-d575b9a434a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c17edew0w5eo_1747800109.html", "title": "Rangers: Philippe Clement still under pressure", "title_page": "Rangers: Philippe Clement still under pressure - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The Rangers board's backing of Philippe Clement at the weekend was not unanimously welcomed by supporters and the caveat issued by new chief executive Patrick Stewart that results must improve means there will be pressure on the Belgian every time his side take to the field - and that includes on Wednesday night against Aberdeen.\nRangers' home form - at least in terms of results - has been close to perfect and as good as Celtic's, so that, allied to Aberdeen's long run without a win, suggests he should be able to navigate this fixture without increased calls for his sacking.\nStewart's media briefing may not have produced the headlines every fan wanted to see, but it should at least have reassured them they now have a man running the club who is capable of creating and implementing a strategy to take Rangers forward.\nThe results of the independent review he has commissioned will be intriguing, although there may be tough decisions required before its outcome is known in two or three months' time.\nHis stance that only one or two additions to the squad will be sanctioned this month is understandable with the league title an unrealistic goal, although European ambitions may also be stymied as a result.\nThat would appear to be the arena in which Clement has the best chance of convincing his critics he can turn Rangers' fortunes around.\nIf he could guide them directly into the last 16, his stock would rise once more and even if the play-off route is required - still the more likely scenario - it would be a tremendous achievement and one for which Clement and the players would deserve great credit.\nA Europa League trip to Old Trafford beckons but before that Aberdeen then Fraserburgh in the Scottish Cup must be dealt with. Victory in both those games is surely non-negotiable.", "url": "https://www.bbc.com/sport/articles/c17edew0w5eo"}