{"authors": ["Drew Heatley", "www.facebook.com"], "date_download": "2025-05-21 06:05:23", "date_modify": "2025-05-21 06:05:23", "date_publish": "2024-12-24 15:37:31", "description": "Fulham news: Opinion - fan's moment of the year", "filename": "sport_football_articles_c75wv4xwngzo_1747807523.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ed37/live/daad5110-b629-11ee-beb5-e1400df560f2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c75wv4xwngzo_1747807523.html", "title": "Opinion - fan's moment of the year - BBC Sport", "title_page": "Fulham news: Opinion - fan's moment of the year - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It is testament to the year that we have had under Marco Silva that it is hard to pick a single moment out.\nBut, when it came down to it, I couldn't look past Harry Wilson's injury-time double against Brentford in November.\nIt has always been tricky to define who our purest, undiluted rivals are. Chelsea are the closest geographically but, up until this century, they were typically much higher up the football pyramid, and their feeling of superiority and indifference continues even now.\nThen there is QPR and Brentford. We have enjoyed many tussles with the former during the past two decades, but it is with the latter that we have battled regularly throughout the lean days of the 1980s and 90s - and so they are our biggest foes in many of our fans' eyes, myself included.\nAnd, crucially, the Bees edge us in head-to-heads, creating even more needle.\nSo when it looked like we were set to fall to another defeat, as 90 minutes approached and then passed, it was a bitter pill to swallow.\nThe jubilation in the Hammersmith End for Wilson's first goal, a deft flick, was uninhibited - generations arm in arm, strangers embracing.\nAnd the scenes for his winning header - our latest-ever Premier League goal - were the type typically associated with those heady European nights under Roy Hodgson years ago.\nThis year has been all about progress for Fulham - improving the squad, developing our stadium and moving up the table.\nBut, when it comes down to it, nothing in football gets the blood pumping more than a last-minute goal or two - and good old fashioned bragging rights.\nHere's to more of the same in 2025.", "url": "https://www.bbc.com/sport/football/articles/c75wv4xwngzo"}