{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:37:28", "date_modify": "2025-05-21 07:37:28", "date_publish": "2025-03-28 12:52:15", "description": "Brighton news: 'My life doesn't change' even if I'm a PL boss", "filename": "sport_football_articles_c1mnmnzzzndo_1747813048.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/458d/live/72f4a7d0-0bc3-11f0-9028-6b47f4f81c48.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c1mnmnzzzndo_1747813048.html", "title": "Brighton news: 'My life doesn't change' even if I'm a PL boss", "title_page": "Brighton news: 'My life doesn't change' even if I'm a PL boss - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Fabian Hurzeler says he does not think about the elevated status that comes with being a head coach in the Premier League as he just wants to continue to live a normal life.\nThe 32-year-old was spotted while at home for a days in the international break by a Brighton supporter, who went on to chat to him about this weekend's upcoming FA Cup quarter-final.\nIn Friday's media conference, Hurzeler was asked about whether his life has changed since moving to Brighton from Bundesliga II side St Pauli because of the prominence of English football worldwide.\n\"I don't think about things like that as it is part of the business and you have to accept it,\" replied Hurzeler. \"My life doesn't change because I want to stay as the same Fabian I have always been.\n\"I always want to be that guy who is available for my players, who is the biggest supporter of my players, embraces challenges and works hard for the club so that they can be successful.\n\"That is how I want to be seen. I am not thinking about whether I am being recognised.\n\"I don't think I can't do that or go there because I just want to live my life. I am obsessed with football and that is why I try to focus on these things.\"", "url": "https://www.bbc.com/sport/football/articles/c1mnmnzzzndo"}