{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:55:22", "date_modify": "2025-05-21 06:55:22", "date_publish": "2025-03-29 15:12:05", "description": "France produce a clinical second-half performance in La Rochelle to inflict first defeat of this year's Women's Six Nations on Scotland.", "filename": "sport_rugby-union_articles_c2kgkepn5n7o_1747810522.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/35cb/live/7a784c80-0cba-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c2kgkepn5n7o_1747810522.html", "title": "Women's Six Nations 2025: France 38-15 Scotland", "title_page": "Women's Six Nations 2025: France 38-15 Scotland - hosts produce dominant second half - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "France produced a clinical second-half performance in La Rochelle to inflict a first defeat of this year's Women's Six Nations on Scotland.\nThe hosts took control of the first half to race into a 13-0 lead through a well-taken try by fly-half Carla Arbez and two penalties from Morgane Bourgeois.\nBut Emma Orr's opportunistic score brought the visitors back within touching at half-time.\nHowever, France scrum-half Pauline Bourdon Sansus was the star of a dominant second-half performance as she hit a sensational drop-goal before setting up Manae Feleu for a try.\nFlanker Seraphine Okemba grabbed Les Bleus' third try, with full-back Bourgeois picking up the all-important bonus-point score.\nWith the clock in the red, replacement hooker Elis Martin scored Scotland's only try of a disappointing second period.\nBryan Easson's side, who finished fourth in last year's Six Nations, defeated Wales in their opening game.\nScotland next face Italy on 13 April, while France, who are seeking a first Six Nations title since 2018, host Wales on 12 April.\nScotland travelled to La Rochelle with plenty of optimism after coming out on the right side of an opening-round thriller against Wales in Edinburgh.\nConfidence was also enhanced by Ireland's battling display against France last week, when they missed a number of opportunities in Belfast to pull off an unexpected upset.\nDespite Les Bleus coming out fast in front of a packed Stade Marcel-Deflandre, unforced errors meant they only scored one try through the sharp feet of Arbez.\nEasson's side had plenty of ball in the opening exchanges but failed to convert their pressure into points until Orr scooped up a loose kick through to dive over.\nIt was Lisa Thomson's boot that set up the try and that combination almost worked again early in the second half, with Orr this time spilling the ball over the tryline.\nThat missed opportunity proved costly as France punished the visitors' second-half mistakes.\nFrom a goalline dropout, Bourdon Sansus banged over a long-range drop-goal – the first in the Women's Six Nations in 11 years - to add to Bourgeois' clinical nature from the kicking tee to maintain distance between the sides.\nThe pick of the hosts' final two tries came through Okemba, who latched on to a speculator one-handed offload by wing Kelly Arbey, as the class between the two sides showed.\nScotland narrowly lost 15-5 against these opponents in Edinburgh in the last Six Nations, but away from home proved a much harder task to pick up their first win over France since 2010.\nFrance will hope to build on this result to set up a potential Grand Slam decider against England in their final game on 26 April at Allianz Stadium.", "url": "https://www.bbc.com/sport/rugby-union/articles/c2kgkepn5n7o"}