{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:16:22", "date_modify": "2025-05-20 14:16:22", "date_publish": "2023-07-30 00:00:00", "description": "Relive Terence Crawford's nine-round stoppage win over Errol Spence Jr in undisputed welterweight contest at the T-Mobile Arena in Las Vegas", "filename": "sport_live_boxing_65838246_1747750582.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7E66/production/_130585323_gettyimages-1579865453.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_boxing_65838246_1747750582.html", "title": "Relive Terence Crawford's stoppage win over Errol Spence Jr in undisputed welterweight contest", "title_page": "Relive Terence Crawford's stoppage win over Errol Spence Jr in undisputed welterweight contest - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Post\nThe day is just beginning for many of our UK-based readers but already we have had one of the great boxing matches.\nRead all about it in the report below, and we will see you later!\nCrawford beats Spence to win undisputed welterweight title\nTerence Crawford dismantled Errol Spence Jr to become the four-belt era's first undisputed welterweight champion.\nThe WBO champion, 35, knocked Spence down three times before the referee ended the punishment in the ninth.\nThe win makes him the first man to win undisputed titles in two weight classes as he stripped his domestic rival of his WBC, WBA (Super) and IBF titles.\nSpence, 31, was undefeated in 28 fights and the Las Vegas showdown was his eighth world title bout in a row.\nBut Crawford, in his 18th consecutive championship bout, staked a firm claim as the world's best boxer as he extended his win streak to 40 fights at T-Mobile Arena.\nRead the full report here.\n'I'm an overachiever'\nI thought Terence Crawford spoke so well in his immediate post-fight comments, humble and respectful of his opponent.\nHere's a little bit more from what he said: “I’m so blessed. I only dreamed of being a world champion. I’m an overachiever.\n\"I want to thank Spence and his team, because without him none of this would be possible.”\n'Who is p4p star in world boxing?'\nKal Sajad\nBBC Sport boxing reporter\nIn less than a week we've seen two fighters stake their claim of being the pound-for-pound star of world boxing.\nOn Tuesday, Japanese superstar Naoya Inoue stopped Stephen Fulton to become a four-division world champion.\nTrue to his nickname, 'Monster' Naoya strikes fear into most opponent. His knockout ratio (22 stoppages in 25 wins) is unreal for a fighter in the lower weight classes.\nBut then you have Crawford, a future hall of fame star who tonight showed he is levels above anybody else in his division. His all-round boxing skills are unmatched.\nYou can make a case for either fighter being the best in the world.\n'We witnessed greatness'\nKal Sajad\nBBC Sport boxing reporter\nAstonishing. Masterclass. Sheer-dominance. There are millions of superlatives you can use to describe that performance by Terence Crawford.\nSo many pundits, fighters and fans felt it would go the distance. Many picked Errol Spence Jr to win. Hardly anyone saw it go the way it did.\nCrawford worked his opponent out in the first round and then stamped his authority thereafter. The jab, the shot variation, the power punches - it was a joy to watch. We witnessed greatness.\nJust woke up?\nFor the benefit of our readers in Europe who are just starting their day, here is a brief recap of what you missed.\nTerence Crawford stopped Errol Spence Jr in the ninth round in Las Vegas to become the undisputed welterweight champion.\nCrawford produced an incredible display of boxing that Spence simply had no answer to.\nHe now holds the WBO, WBC, WBA (Super) and IBF belts and is now a two-weight undisputed champion, becoming the first male to achieve the feat in the four-belt era.\n'Wow!'\nAmir Khan\nFormer unified light-welterweight world champion on TNT Sports\nOn what it is like to face Crawford: He was always one step ahead of you. He was making me miss by inches.\nHe has such a great sharpness, his jab today is what got him the win. It is so accurate, so patient. It was like he was hitting him when he wanted to hit him.\nOne of the best performances I have ever seen. Spence is one of the best fighters in the world. The fight he had there, how Crawford destroyed and dismantled him. Wow!\n'One of best boxing performances I've ever seen'\nFormer world champion Carl Frampton on TNT Sports: \"That was one of the best boxing performances I have ever seen. I've seen many over the years but to make an elite fighter like Errol Spence look not elite, very ordinary at times, was very special.\"\n'We have to do it again'\nAnd let's hear from Errol Spence: \"He was the better fighter on the night, he dictated with the jab, my timing was a little bit off and he was catching me between shots.\n\"His timing was just better tonight, I make no excuses. He was the better man tonight.\n\"He was throwing the harder jab, he had his timer down on point.\"\nRe-match? \"We've got to do it again. I would be a lot better, it would be a lot closer. We got to do it again.\"\nPost\nA bit more from Terence Crawford, on the stoppage: \"It was a good stoppage. I was on the verge. The referee did what he was supposed to do to protect the fighter.\"\nRe-match? \"Of course the public would buy it, look how many people came out to show us both support tonight. If the fight happens again I am pretty sure the support will come out again for both of us.\"\nAlongside some of the greats? \"I am so mixed, so many emotions. I just want to thank God, that's all I want to do. I want to give honour to him.\"\n'I believe I showed how great Terence Crawford is tonight'\nTerence Crawford is up on the ropes celebrating. He then slips on the belts before giving his thoughts on the fight in the ring.\n\"I want to give honour to God, because without him none of this would be possible,\" he says. \"I only dreamed of being a world champion. No-one believed in me when I was coming up, but I made everyone believe.\n\"I kept praying to God I would get the opportunity to show the world how great Terence Crawford is and I believe tonight I did that.\n\"Spence is a tremendous talent, he has a great jab and we were worried about it coming in. But take away his best attribute and the rest is history.\"\nRound 9\nSpence v Crawford\nCrawford is surely so far ahead on the cards that he can afford a quiet round, but almost everything he has done in this fight has been on point. His defending has been strong, and his punches well placed and well timed.\nSpence is wobbling on his feet now and gets caught a couple of times as he tries to connect with some shots of his own.\nCrawford senses the end is near and goes in with a strong right hand before the referee steps in!\nIt's all over, brilliant from Crawford!", "url": "https://www.bbc.com/sport/live/boxing/65838246"}