{"authors": ["Mark Mitchener", "www.facebook.com"], "date_download": "2025-05-21 07:13:41", "date_modify": "2025-05-21 07:13:41", "date_publish": "2025-01-22 15:33:13", "description": "Bournemouth news: Opinion - Mark Mitchener on Justin Kluivert", "filename": "sport_football_articles_c3vp55v7wxyo_1747811621.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f341/live/53a1e480-4835-11ef-b74c-bb483a802c97.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c3vp55v7wxyo_1747811621.html", "title": "Opinion - Mark Mitchener on Justin Kluivert - BBC Sport", "title_page": "Bournemouth news: Opinion - Mark Mitchener on Justin Kluivert - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It is an old footballing adage that a new manager's first signing is a 'statement' as to how the new gaffer intends to play, or how the board are seen to be backing his vision.\nLower down the leagues, it is not always like that.\nFormer midfielder Mark Molesley, more recently a manager himself at Weymouth and Southend, talks with pride (a little tongue in cheek) at how his permanent move from Grays Athletic to Bournemouth made him Eddie Howe's first managerial signing.\nIn reality, the newly appointed caretaker boss was scrabbling to put a side out for their first League Two fixture of 2009, and it made sense to retain Molesley who had been on loan.\nIndeed, the modern shift towards a system whereby a \"head coach\" is now less involved with the mechanics of transfers, contracts and recruitment than predecessors with the title \"manager\", makes this idea about the first signing a little outdated.\nHaving said that, Andoni Iraola's first signing for Bournemouth, Justin Kluivert, has been in the headlines after his second hat-trick of the season set up Saturday's demolition job at Newcastle.\nNot only did it end the Magpies' run of nine successive wins, it left more people wondering if Cherries owner Bill Foley's dream of European football could materialise.\nKluivert's third goal in the 92nd minute was the pick of the bunch, but if Iraola had anything approaching a full-strength bench, the Dutchman would surely have been hauled off long beforehand.\nOnly once in 59 Cherries appearances has Kluivert played the entire game from start to finish - his brief in the number-10 role usually being to run teams ragged for 60-70 minutes before Iraola brings on one of his 'finishers'.\nInjuries and a threadbare bench have quashed those plans. It was only after Milos Kerkez added a fourth goal to put the result beyond doubt that Kluivert and Dango Ouattara were withdrawn in the 97th minute for development squad duo Ben Winterburn and debutant Remy Rees-Dottin.\nKluivert's career has taken him to through the Netherlands, Italy, Germany, France, Spain and now England, changing countries five times in as many years.\nNow back in the Dutch squad, and with a new baby on the way soon, Kluivert is in the best form of his career. A very good time to finally step out of his famous father's shadow and put down some roots of his own.", "url": "https://www.bbc.com/sport/football/articles/c3vp55v7wxyo"}