{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:14:51", "date_modify": "2025-05-21 05:14:51", "date_publish": "2025-04-07 00:00:00", "description": "Free-scoring Newcastle heap more misery on relegation-bound Leicester as the Magpies' Champions League pursuit gathers momentum.", "filename": "sport_football_live_cy8qnv29xv2t_1747804491.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/276e/live/50a1f4d0-13f2-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cy8qnv29xv2t_1747804491.html", "title": "Leicester 0-3 Newcastle: Foxes set unwanted record as Magpies go joint-fourth", "title_page": "Leicester 0-3 Newcastle: Foxes set unwanted record as Magpies go joint-fourth - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "'It's very disappointing and worrying'\nFT: Leicester City 0-3 Newcastle\nLeicester City\nLeicester boss Ruud van Nistelrooy, speaking to BBC Match of the Day: \"Very difficult especially after 33 minutes, we lost another game starting with the best intentions. We lost another early goal. It's very disappointing and worrying.\n\"It's a big challenge. We all know the run of form we're in. It's extremely difficult. Especially if there aren't light points to build on.\n\"The most difficult thing is we are in a place for such a long time and there are no results. The most important thing is the club and to bring it forward. That's the worrying part.\nOn Jeremy Monga: \"You could see glimpses of his great qualities. He's a great winger and has speed. He's a fantastic talent, a great boy. He deserved these minutes and hopefully, more to come.\n\"It's clear and we've been saying that. We want to show what we're about and show our qualities but we aren't able to.\n\"I want the club to do well. The club is first and that is something to consider. It is hard because I came to the club to help it forward but it is clear there haven't been enough results to get points on the board and that's not good enough.\"\n'Important to sleep on it and recover'\nFT: Leicester City 0-3 Newcastle\nLeicester City\nLeicester boss Ruud van Nistelrooy speaking to Sky Sports: \"It's clear where it went wrong very early in the game again.\"\nOn if goals were avoidable: \"If we look at the three goals carefully we could have done better in all three. Newcastle are deadly on counter attack and finished the game very quickly.\"\nOn worrying stats: \"What is worrying is the run of form, the lack of goals, the lack of results we can't produce. Trying different things, different structures, different players in different positions and the results are not there.\"\nOn not changing his starting XI again: \"Looking over the last month we tried different things and different ways to play with different personnel. You want to give that a chance. That's what we tried to do. If you keep changing every week you can't see that progress but it's very worrying.\"\nOn not scoring for eight successive home games: \"It shows. It's a confidence thing. In the second half you can see when there is no pressure anymore it frees people up. Then you see some reasonable football. When the pressure is on it becomes very difficult. With an early couple of goals it collapses.\"\nOn if he still has the fight to continue at Leicester: \"This is a difficult night. It's important to analyse this and sleep on it and recover. That is it for now. There are no questions, but it's dealing with another setback for now that's what I can say.\"\n'I think we're in a good place'\nFT: Leicester 0-3 Newcastle\nNewcastle United\nNewcastle manager Eddie Howe, speaking to Sky Sports: \"I think we're in a good place. Today was always going to be difficult for us but we started the game so strongly and put ourselves in a good position. We're playing with confidence but we're going to need it because the next three games are tough.\n\"If you can start fast and score the first goal then it can influence the game. The first goal was high quality.\nOn Jacob Murphy: \"He's up there for him. He's played well all season for us. He's always been a great team player for us with work ethic but this season he's added goals. I'm really pleased for him that he's getting more recognition.\nOn Fabian Schar's shot: \"He brings a flair that not many centre-backs can bring. It's another Fabian moment. For a split second, I thought it was in. There are not many centre-backs in football that can do what he can do.\n\"There was a worry when we won the cup that we'd drop. Just a subconscious feeling that you've achieved a massive high and there's a fall from that. The challenge for the group was can you go again and they've done that well.\nOn reaching the top four: \"It will mean a great deal to us. It's difficult to think too far ahead and think of the implications. We need to do our job and that is to win games.\nOn Alexander Isak's fitness: \"I think he's 100% fit, I wouldn't have taken any risk with him tonight if he wasn't. I don't think we'll have to manage him.\"\n'A massive win for us'\nFT: Leicester 0-3 Newcastle\nNewcastle United\nNewcastle boss Eddie Howe speaking to BBC Sport: \"Really pleased. A massive win for us. We knew it wasn't going to be easy. We started really well and that gave us the foundation to go and win.\n\"It was a bright start. The first goal was a real highlight for us in terms of quality. When you start the game in that fashion it makes it easier for you. Leicester were competitive but I wanted us to add more goals.\"\nOn Fabian Schar's long-range effort hitting the woodwork: \"It's another Fabian moment. He's capable of these things and he has delivered again. For a second I thought it was in. Jacob did really well to follow up and get the tap-in.\"\nOn the team keeping their focus after winning silverware: \"That was the biggest challenge for us. I can't complement them enough. They are a very down to earth, humble group who want to do well and represent the club in the right way. They have shown that in the last few weeks.\"\nOn how he sees the race for Champions League football: \"It's going to hot up. The next week for us is a big week. We have three really tough games and that will go a long way in seeing where we are at the end of the season. We are in a better position than we were but there is still a lot of work to do.\"\n'We need to keep the pressure on'\nFT Leicester City 0-3 Newcastle\nNewcastle United\nJacob Murphy speaking to Sky Sports: \"I think the message going into it was to get a quick start. Knowing that if we got a quick start 'could their fans turn on them?' That plays into our hands. We got off to a quick start with some goals which was good.\nOn his first goal: \"We always talk about box occupation, can we flood the box. You can see how many players we had in the box and it makes it difficult to defend. I saw it really late but got my foot on it.\"\nOn his second goal: \"It was a bit scary when it came back because I wasn't sure about first time finish or to control it. By the time I controlled it about seven times I managed to sort my feet out and score!\"\nOn form: \"I'm exactly where I need to be, at the back post tapping it in. It's always nice to hear numbers, to score, I love assisting. If I can add value every game then regardless of the numbers I'll always be content.\"\nOn buzz at Newcastle: \"It's been unbelievable. The bus tour was out of this world, such a great day. You can see why the greats get addicted to winning trophies, the feeling it gives you. Now we're back training, you want that again next season. We want to keep striving for better and taste it again.\"\nOn Champions League qualification: \"It's hugely important for us. We can see other English teams doing really well, we've had a taste of it last season. We've got eight games to go now, no other distractions. I think we can really put a challenge up to the teams around us, one game it can all change so we need to keep the pressure on.\"\n'It's a horrible moment for the club'\nFT: Leicester City 0-3 Newcastle\nLeicester City\nLeicester defender James Justin speaking to Premier League Productions: \"It's hard to describe, to be honest, with how it's been and it makes us feel awful right at the moment. You feel disconnection and disappointment when you step off the pitch. All we can do is give our all for the shirt. It's not been good enough for a couple of months now.\n\"It's hard to find confidence. I don't know how many games it's been since we last picked up a point. It's a horrible moment for the club with how we're playing on the pitch and trying to regain any confidence. There were bright spells from the lads who came off the bench and that's the one positive to take.\n\"There is still a chance for us and we have to fight and claw for it but we aren't showing it on the pitch.\"\n'We need to keep this run going'\nFT: Leicester 0-3 Newcastle\nNewcastle United\nNewcastle goalscorer Harvey Barnes speaking to Sky Sports: \"We are going into games at the minute feeling confident we are going to win. That is the mindset we need for the rest of the season. We have a lot to play for and need to keep this run going.\"\nOn what it would mean to qualify for the Champions League after winning the Carabao Cup: \"Huge. That was one of our main aims this season to win silverware which we have done. We made it clear after that we need to reset. There is a lot to play for and we have started that period really well with two wins. We don't want the season now to finish on a downer. We are fully focused.\"\nOn scoring three first-half goals: \"The early game gave the team a boost but the team will look back and we weren't at our fluid best tonight.\"\nOn laying down a marker for European places: \"We know we are in a good position in the table. All we can do is our job and win our games and we will finish in the top four or five. If we win the games the teams will be chasing us and not us chasing them.\"", "url": "https://www.bbc.com/sport/football/live/cy8qnv29xv2t"}