{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:21:07", "date_modify": "2025-05-21 06:21:07", "date_publish": "2025-04-01 00:00:00", "description": "Reaction as Nottingham Forest beat Man Utd, Saka scores for Arsenal in win against Fulham and Wolves win.", "filename": "sport_football_live_c5y9p539djlt_1747808467.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7ec0/live/10e1b250-0f37-11f0-ac9f-c37d6fd89579.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c5y9p539djlt_1747808467.html", "title": "Premier League LIVE: Arsenal 2-1 Fulham, Wolves 1-0 West Ham & Nott'm Forest 1-0 Man Utd", "title_page": "Premier League LIVE: Arsenal 2-1 Fulham, Wolves 1-0 West Ham & Nott'm Forest 1-0 Man Utd - radio, text & score - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Thanks and goodbye\nThat is all for this live page on a night where Wolves, Arsenal and Nottingham Forest all record victories.\nThere are six more Premier League games coming up tomorrow and this is what is on the schedule...\nBournemouth v Ipswich Town\nBrighton v Aston Villa\nManchester City v Leicester City\nNewcastle United v Brentford\nSouthampton v Crystal Palace\nLiverpool v Everton\nWe'll be up and running from 18:30 BST so hopefully you can join us then. Thanks for joining us and until next time, bye for now.\nElanga's stunning solo strike defeats former club\nFT: Nottingham Forest 1-0 Manchester United\nNick Mashiter\nBBC Sport football news reporter at the City Ground\nNottingham Forest moved closer to realising their Champions League dream as Anthony Elanga's solo strike defeated his former club Manchester United.\nThe winger, who joined United as a 12-year-old, sprinted 70 yards before finishing into the bottom corner to catch the visitors cold with an early winner. He joined Forest from United for £15m in 2023, in search of regular football, and continued his excellent season against his former club.\nMurillo ensured the win with a dramatic goalline clearance from Harry Maguire in the final seconds.\nForest remain third in the Premier League with an eight-point lead over fourth-placed Chelsea, who host Tottenham on Thursday, and it is hard to see how Nuno Espirito Santo's side fail to secure Champions League football from here.\nInto the FA Cup semi-finals - where they face Manchester City at Wembley this month - and on the brink of a first European campaign since 1996, Forest are almost in dreamland.\nEfficient and effective, they completed a double over United for the first time since 1991-92 with a 13th clean sheet of the season and condemned the visitors to their 13th defeat of the campaign.\nRuben Amorim's side were neat and tidy in spells but there was little punch to their attack, as they were unable to break down their organised hosts, while they struggled to contain Elanga.\nDiogo Dalot's first-half header bounced off the bar and Bruno Fernandes tested goalkeeper Matz Sels early on but they are still looking for successive Premier League wins this season.\nSaka makes scoring return for Arsenal\nFT: Arsenal 2-1 Fulham\nAlex Howell\nBBC football news reporter at the Emirates Stadium\nBukayo Saka scored just seven minutes into his return after 101 days out injured to help Arsenal beat Fulham at Emirates Stadium.\nThe England forward came off the bench in the second half, with the score at 1-0, and showed Arsenal what they have missed during his absence, heading in Gabriel Martinelli's flick at the far post on 73 minutes.\nMikel Merino had given the Gunners the lead in the 37th minute when his shot was deflected into the corner after Ethan Nwaneri's cut-back. Rodrigo Muniz pulled a goal back for Fulham in stoppage time when his shot was deflected by William Saliba and wrong-footed goalkeeper David Raya.\nThe win moved Arsenal to within nine points of runaway leaders Liverpool.\nIt was a mixed night for the Gunners though who, despite the positive of having Saka back from his serious hamstring injury, lost centre-back Gabriel early in the first half, which is a worry for manager Mikel Arteta with a Champions League quarter-final against Real Madrid next week.\nFulham defended deep throughout the match but should have pulled one back much earlier when substitute Muniz headed wide from six yards out with the goal gaping.\nArsenal take on Everton on Saturday in the Premier League before preparing for the first leg of their quarter-final against Real at home on Tuesday.\nStrand Larsen scores only goal as Wolves beat West Ham\nFT: Wolves 1-0 West Ham\nAlex Brotherton\nBBC Sport journalist\nJorgen Strand Larsen made it three goals in two games as Wolverhampton Wanderers beat West Ham United to move further away from the relegation zone.\nThe Norway striker sat out the international break with a fractured hand, but returned to record a 10th Premier League strike this season.\nWith Wolves talisman Matheus Cunha still suspended, the 25-year-old Strand Larsen converted just inside the penalty area in the 21st minute following a mazy run from Joao Gomes, albeit with the help of a slight deflection off West Ham's former Wolves defender Max Kilman.\nThe hosts came close to doubling their lead five minutes later following another Gomes surge and run from Strand Larsen, but Marshall Munetsi's snatched effort crashed off the crossbar.\nWest Ham never really got going in the first half, although Evan Ferguson - making his first start for the club since his January loan move from Brighton - should have converted Jarrod Bowen's cut-back at the far post 13 minutes in.\n'We have to improve in the final third'\nFT: Nottingham Forest 1-0 Manchester United\nManchester United\nMan Utd boss Ruben Amorim, speaking to BBC MOTD: \"We suffered that first goal and it helped the opponent to play the game they want. We have quality in the last third, but we tried everything to score a goal and we didn't score, and we lose three points.\n\"We were so near the [Forest] box, but we lacked quality in the final third.\n\"We have to improve and we are pushing the opponent more to their half, now we have to improve in the final third. They have a lot of men [behind the ball] and it was hard to make a connection to get inside the box.\n\"It is always frustrating when you don't win. Especially when you look at game, we deserve more than losing the game.\n\"Today we push the maximum that we can. We were so near the goal especially in the end.\"\n'It is impossible not to love him'\nFT: Arsenal 2-1 Fulham\nArsenal\nArsenal boss Mikel Arteta speaking to BBC Radio 5 Live about Bukayo Saka: \"It was an incredible moment. The way the people reacted to him and showed him that level of love, respect, admiration - it was beautiful to watch.\n\"The reason for it is how he is as a person. After scoring his reaction straight away was to go to the physios and sports science guys to say thank you for all of the help they have given him the last four months. That is the guy he is. It is impossible not to love him.\n\"[His injury] has been very tough for everybody. When you are trying to win the Champions League and Premier League you need your best players on the pitch so for him to be out for four months has been extremely tough.\n\"He has been connected and tried to help the rest of the players so that when he came back that made sure he was in a good position.\n\"I told him to stay focused on what you have to do on the pitch because it is a lot to do that with all the emotion as well. Stick with what you have to do and focus on those actions.\"\n'We deserved more'\nFT: Nottingham Forest 1-0 Manchester United\nManchester United\nManchester United boss Ruben Amorim speaking to BBC Radio 5 Live: \"It is clear we should have taken something, but we have to focus on the goal we conceded. Nottingham are really good on the transition and it was a goal from nothing.\n\"Suffering the first goal in this way puts the opponent in the position they want to be in, defending with a lot of men and making the transitions. During the game we lacked a bit of quality in the final third which is important when you are trying to win games. We deserved more.\"\nOn the Forest goal: \"We have men to block and a whole pitch to run in which to make a foul. We have to make better decisions.\"\nOn introducing Harry Maguire as a sub: \"If you look at the game in the final 15 minutes they were defending with six men in the box so we had to get more players in there. We cannot get inside the box with the combinations.\n\"Harry Maguire is really strong on set pieces and when you are in the opposite box you are a striker not a defender. He is maybe the best guy to play inside the box.\"\nOn the Manchester derby on Sunday: \"If you look at the game we are improving the way we play football, we are creating chances and dominating the games more. We know that this season is going to be like that, win momentum, lose momentum. We continue going into the next match.\"\n'We're lucky to have him'\nFT: Arsenal 2-1 Fulham\nArsenal\nArsenal winger Gabriel Martinelli speaking to BBC Radio 5 Live: \"We deserved the win. We suffered a bit in the end. I don't think we needed to suffer the goal but we conceded it. But we were able to see it out and win the game.\"\nOn Bukayo Saka's return: \"We know how good he is and how important he is for our team. He is one of the captains as well. We trust him so much. I'm really happy for him. It's good to have him back and we are lucky to have him.\n\"It's not good being out. We prefer to be on the pitch and helping the team but we need to try to improve things when we get injuries. We did it and now we are happy to have him back.\"\nOn more injuries tonight: \"It's not good for us to lose a player like Gabi, but it is what it is. We are going to have to see what happened with him and if he is good for the next game, and if not we will have to try to adapt. We know how good we are and we are going to try to win the games even though he is injured.\"\nOn exciting games to come: \"We have a big game coming up against Madrid and we are going to try to win the Premier League as well. We are going to try to win the games and win a title.\"\n'Saka deserved this'\nFT: Arsenal 2-1 Fulham\nArsenal\nMikel Arteta speaking to Sky Sports:\nOn Bukayo Saka: \"Good opportunity to see how much people love him and missed him. When you are away it's good to understand who you are as a person and the reception was magnificent. He lifted the stadium, he deserved it and he deserved it because he does things every day. Good example.\n\"It was for the team who helped him during the rehab. It was a good moment. It's about energy and when the stadium is behind the team and showing support and encouragement it lifts the whole place. Exactly what we need.\n\"We deserved to win the game. We were dominant but it's true we conceded the goal because we didn't defend the box well enough. When you concede a goal two minutes to go in the Premier League you hang in there for the rest.\n\"We expected this [from Fulham], well coached, difficult to get through. Have to be patient and aggressive, our front line was and [Gabriel] Martinelli had a good game.\n\"We are strong as a team, the culture is strong, the willingness to adapt and go for it is also there.\"\nOn Gabriel: \"We are worried because he never wants to come off. He's not sure about how big it is and what it is exactly.\nHamstring? \"He felt something there yes.\"\nDoubt for Real Madrid? \"It depends, the way he is normally, difficult but lets see.\"\nJurrien Timber? \"He was struggling earlier and yesterday he wasn't at his best but we lost Ben [White] as well so he did a big effort to try and play.\"\n'It was a very hard game for us'\nFT: Nottingham Forest 1-0 Manchester United\nNottingham Forest\nNottingham Forest boss Nuno Espirito Santo, speaking to TNT Sports: \"Suffer, hard work, believe, helping each other, clearance on the line. It was a very hard game for us.\"\nOn Anthony Elanga's goal: \"He's a special boy and he gives this team his speed. He does it by himself and we are delighted.\"\nOn Ryan Yates: \"He is a special player for us, club captain and he is heart of the team.\"\nOn making two first half substitutes: \"Look, I think the game was going away from us, we were not able to control and United were given too many situations. \"We decided on the injury [to Ola Aina] to go to a back five and Morato could give a hand. That was the reason behind it.\"\nOn Ola Aina's injury: \"We don't know. Hopefully, it is not too serious.\"\nOn doing the double over Manchester United: \"The records, the boys are breaking all of them and today the City Ground was part of the game. We were against the ropes. The City ground helps us.\"\nOn the Champions League: \"Let's focus on the next one. It is day-by-day.\"\n'Still plenty to play for at Arsenal this season'\nFT: Arsenal 2-1 Fulham\nGlenn Murray\nFormer Brighton striker on BBC Radio 5 Live\nArsenal want as much momentum as possible going into those fixtures against Real Madrid.\nThey are season-defining games. If they get through then they would be just two games from the final and it could then be a historic year.\nAll of a sudden no-one is talking about coming runners-up in the Premier League again and letting slip the chance to win it when Man City faltered. It would be about the Champions League.\nThere is still plenty to play for here at Arsenal this season.\n'Don't know how big Gabriel injury is'\nFT: Arsenal 2-1 Fulham\nArsenal\nMikel Arteta speaking to BBC MOTD about Bukayo Saka: \"When you have the opportunity to see how much people appreciate you - it was a good moment and we played some big parts of the game really well and won the game.\"\nCelebrating with staff: \"These kids are really appreciative of everything they did for him. The staff put in a lot of work and it also tells the person behind the player. The way we had to suffer the last few minutes, conceding the goal really poor. Overall after international break I'm pleased to play really well.\"\nOn Gabriel Martinelli: \"A real threat, took initiative and a really good level. We have a lot to play in the league and international week is always tricky. To see the cohesion and understand the team and compete was really good.\"\nConcern for Gabriel? \"Yes because he never comes off. He felt something. We don't know how big it is. We will assess him before the next games.\"\nTimber? \"Yes, he was also struggling. He was struggling a bit yesterday too.\"\n'Not a good performance'\nFT: Arsenal 2-1 Fulham\nFulham\nFulham boss Marco Silva speaking to BBC MOTD: \"Wasn't a good game from us. Arsenal deserved to win, not a good first half. Difficult when they took control. Even in the first 10 minutes we looked like we were not aggressive enough, not doing the right moves. We had the ball but not with the attacking aggression we have to have. The second goal makes a massive impact, it's clear we have to try to stop that. Reaction after that was good, subs had impact on the game but it was a bit too late. Rodrigo [Muniz] had a chance to score around 79 minutes but overall not a good performance. They fought until the end but not the best one.\"\nFA Cup hangover? \"No. Something that was done last Saturday and we have to move on. It's not an excuse what we showed then was that and we have to show different things. Arsenal much fresher than us in some moments, we tried fresh legs and to be more aggressive. Second half better than first, more chances. Our first half not good.\n\"The schedule is what it is. Some players have played more minutes. It's been tough for Alex [Iwobi] he's been playing week in week out. He's played lots of minutes. We have to manage the players because of the international break.\n\"Premier League doesn't allow you to switch off or allow you to be sloppy in moments when you are attacking or defending. It's clear we have to be consistent.\"\nBack-to-back defeats on the mind? \"It cannot. It's something that's not in my mind. We lost the game and now we lost a second but we have to look forward. We'll analyse this one and then move on for another big game on Sunday.\"\n'I'm one of the fastest players in the league'\nFT: Nottingham Forest 1-0 Manchester United\nNottingham Forest\nNottingham Forest goalscorer Anthony Elanga, speaking to TNT Sports: \"It is about attacking the space and getting to the opposite goal as quick as I can. I saw the space and I believe I'm one of the fastest players in the league. The finish is something I have been trying to work on. Left foot or right foot, I am quite comfortable with both feet this season.\n\"All you want to do is keep on improving, coming here is about playing and developing. I appreciate Manchester United so much as I learned a lot there. I am enjoying my football and I want to keep on going.\n\"We have one of the lowest possession in the league, but it has been effective and it is something we have worked on since pre-season. Murillo's block means more than a goal, seeing it on the bench I was like 'Wow'.\nOn Forest's team spirit: \"It started in pre-season, the manager came in December last season and when he came we struggled.\n\"He got his ideas across [during pre-season] and we have been able to play different systems. Every player can play any position. That togetherness is important and it says it on the pitch.\"", "url": "https://www.bbc.com/sport/football/live/c5y9p539djlt"}