{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:48:20", "date_modify": "2025-05-20 13:48:20", "date_publish": "2023-07-31 12:49:28", "description": "Wolverhampton Wanderers: Joe Hodge on Wolves' pre-season", "filename": "sport_articles_cj5nnndm7z7o_1747748900.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cf13/live/9552f6b0-2f9c-11ee-bfac-8791d231cdd4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cj5nnndm7z7o_1747748900.html", "title": "Wolverhampton Wanderers: Joe Hodge on Wolves' pre-season", "title_page": "Wolverhampton Wanderers: Joe Hodge on Wolves' pre-season - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wolves' Republic of Ireland Under-21 midfielder Joe Hodge has been speaking to the club's media about the pre-season draw against Celtic at the Aviva Stadium in Dublin: \"We're only two weeks away from the season starting, so any minutes against a good team is going to help us start off well, hopefully.\n\"I loved playing in the Wolves shirt. Hopefully I'll be back here [the Aviva Stadium] soon playing in a green jersey. It was my first time - I've been waiting to play here for ages and it's been a dream of mine really to play here.\"\nOn his pre-season experience so far: \"It's been a good week. The game against Porto was a good challenge, as was this game. We've been training hard and hopefully we've been improving as a team as well, so hopefully it will do us some good going into the season in two weeks' time.\nOn his ambitions for the Premier League season: \"I want to play every week - that's what I want to do. I know it's not realistic and I'm not going to, but my aim is to work as hard as I can, train well every day, and when I get the chance try to do my best.\n\"That's a challenge - with the quality in the squad, it's not an easy thing to do. I'm just doing my best and trying to learn from all of the players and the gaffer, and see where that takes me.\"", "url": "https://www.bbc.com/sport/articles/cj5nnndm7z7o"}