{"authors": ["Freddie Pye", "www.facebook.com"], "date_download": "2025-05-21 05:45:37", "date_modify": "2025-05-21 05:45:37", "date_publish": "2025-04-02 13:47:00", "description": "Man City news: Opinion - Fan writer on Erling Haaland injury", "filename": "sport_football_articles_cr7853xky8no_1747806337.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b73a/live/07616130-b62d-11ee-beb5-e1400df560f2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cr7853xky8no_1747806337.html", "title": "Man City news: Opinion", "title_page": "Man City news: Opinion - Fan writer on Erling Haaland injury - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Sometimes in football there are things you simply cannot write.\nFor Manchester City, that has happened over, and over, and over again across the past 25 years. This season has been no different, albeit in a varying version and away from the dramatics of the football pitch.\nPep Guardiola has had to battle a relentless conveyor belt of injury concerns to his biggest stars - from Ruben Dias to Kevin de Bruyne, Ederson to Jeremy Doku.\nOne ever present throughout that uncertainty has been Erling Haaland, who has managed to stay fit and record yet another 30-plus goal contribution campaign at a time when the entire squad seems to be under-performing.\nThat is until now, and the business end of the season. A time when Manchester City need to put together a winning run of form - something that they are more than used to at this time of year - to secure themselves in the 2025-26 Champions League and perhaps even claim a silver lining in this campaign with the FA Cup.\nThis is the moment when the biggest stars would usually step up, but given the way this current crop of players are performing and reacting to adversity, nothing is off the table.\nNow more than ever, those in sky blue and white desperately need to stand in for their goalscoring phenomenon and provide the impetus in front of the net to make up for perhaps the greatest loss in terms of personnel so far this season.\nGuardiola has suggested he has players with a \"sense of goal\" to stand in for Haaland, and a whole host of players spring to mind. Omar Marmoush, Phil Foden, De Bruyne... The list goes on.\nCould we even see a return of Ilkay Gundogan into a false nine role? In football, there are things you simply cannot write.", "url": "https://www.bbc.com/sport/football/articles/cr7853xky8no"}