{"authors": ["Ian Kennedy", "www.facebook.com"], "date_download": "2025-04-26 08:11:40", "date_modify": "2025-04-26 08:11:40", "date_publish": "2025-02-26 11:56:33", "description": "Everton news: Opinion - 'Toffees are now looking up, not down'", "filename": "sport_football_articles_cx28p6x132xo_1745655100.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5b58/live/9796be80-6ea6-11ef-8c1a-df523ba43a9a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cx28p6x132xo_1745655100.html", "title": "Opinion - 'Toffees are now looking up, not down' - BBC Sport", "title_page": "Everton news: Opinion - 'Toffees are now looking up, not down' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Wednesday's game at Brentford looks tough on paper, but this is a confident Everton side that can look back on recent away wins over Brighton and Crystal Palace.\nThe Blues can go into the game with a real belief they can come away with something positive, especially with Brentford without a home win in the league since December. The Bees have, however, looked good away from home, highlighted by Friday's 4-0 victory at Leicester.\nSo it is a good game in prospect and Everton will have to be very wary of Brentford's attacking threat.\nThat said, the home side will know the Toffees have a rejuvenated striker in Beto, and are creating far more chances.\nEverton are now looking up, not down, and although they will have been disappointed to draw with Manchester United on Saturday having been 2-0 up, it is still another point towards mid-table security.\nDavid Moyes says there is still work to do to ensure survival - and that is no bad thing.\nNo let up, keep it going, not safe yet. It is the right attitude to have and it is working brilliantly at the moment.\nListen to Total Sport Merseyside from 18:00 on weeknights and find details here of live Everton match commentaries on BBC Radio Merseyside", "url": "https://www.bbc.co.uk/sport/football/articles/cx28p6x132xo"}