{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:44:44", "date_modify": "2025-05-21 03:44:44", "date_publish": "2025-04-06 15:33:47", "description": "Derry's Brendan Rogers reflects on the Oak Leafers' 1-25 to 1-15 loss to Donegal in Sunday's Ulster SFC preliminary-round game in Ballybofey.", "filename": "sport_articles_c8epdgly8pko_1747799084.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3c98/live/6b0825c0-12fc-11f0-baa6-cf6d1e060075.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c8epdgly8pko_1747799084.html", "title": "Donegal 1-25 Derry 1-15: Brendan Rogers reflects on 'difficult day' for Oak Leafers", "title_page": "Donegal 1-25 Derry 1-15: Brendan Rogers reflects on 'difficult day' for Oak Leafers - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Derry's Brendan Rogers, who was named man-of-the-match by BBC co-commentator Philly McMahon, reflects on the Oak Leafers' 1-25 to 1-15 loss to Donegal in Sunday's Ulster SFC preliminary-round game in Ballybofey:\n\"At the end of the first half we were three down and I suppose at that point we'd have been better off trying to kill the first half out and we maybe over-egged a couple of attacks.\n\"That actually led to them getting 1-1 and stretched it a wee bit for us at half-time, but we did come out with a bit of a bounce.\n\"I suppose after the first 12 minutes (of the second half) we had a fair gap of rushed shots and I had one myself.\n\"When you don't get that momentum again, it becomes tougher when they're chipping away at the one-pointers and we were missing maybe a couple of two-pointers. [There is] lots for ourselves to look at in terms of how the momentum swung, but Donegal were clinical and they kept pegging away and made it harder for us to chase.\n\"It was a difficult day for us now, we were chasing for most of it.\"\nOn his injury worries leading into Sunday's game:\n\"It didn't matter if it was going to be hurt or not.\n\"That's not non-negotiable, I was playing and the effort them boys to do all year, the least you can do is give you everything for them and that's just the way it is, it's never going to be anything else.\"\nOn Shane McGuigan's first-half penalty, which was saved by Shaun Patton:\n\"It would definitely have changed the momentum of how we attacked but I don't think that had the biggest bearing on the game.\n\"It was that early in the game, there was so much football to be played and it was still level for a while after that, so no I wouldn't have said that was the big factor in it.\"", "url": "https://www.bbc.com/sport/articles/c8epdgly8pko"}