{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:51:23", "date_modify": "2025-05-21 03:51:23", "date_publish": "2025-04-07 10:47:53", "description": "Novak Djokovic serving for success and Jessica Pegula wins on clay - the latest edition of our weekly tennis round-up.", "filename": "sport_tennis_articles_cvgp6qq6wn6o_1747799483.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6181/live/671b90c0-1395-11f0-ac9f-c37d6fd89579.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_tennis_articles_cvgp6qq6wn6o_1747799483.html", "title": "Second Serve: Novak Djokovic rediscovers mojo before Monte Carlo Masters", "title_page": "Second Serve: Novak Djokovic rediscovers mojo before Monte Carlo Masters - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "There is no escaping the fact that age is catching up with Novak Djokovic.\nWith his 38th birthday fast approaching, the evidence shows the 24-time Grand Slam champion's powers are waning.\nBut as the men's clay-court season begins in Monte Carlo, Djokovic looks in a much better place than a fortnight ago.\nFinishing runner-up in Miami to Czech teenager Jakub Mensik showed that the world number five is not ready to roll into retirement yet.\n\"There is no doubt that [motivation] has become more difficult throughout my career but the performances in Miami give me more inspiration to keep going,\" Djokovic said.\nThe Serb veteran knows his serve needs to be potent if he is going to challenge at the upcoming French Open and Wimbledon.\nUnable to rely as much on physicality against his younger opponents, Djokovic wants the accuracy of his opening shot - an underrated part of his game - to help limit the baseline rallies.\nWe saw the effectiveness in Miami.\nBased on precision rather than power, he landed 79% of first serves - including a career-high 87% in the semi-final against Grigor Dimitrov - and only faced seven break points in his opening five matches.\n\"Now I know what it's like to be John Isner,\" he joked after beating Dimitrov.\nDjokovic has not won a major since the 2023 US Open and claimed only one title last season - albeit the Olympic gold he had long craved.\nThat came on the Roland Garros clay, where he aims to win a standalone 25th Grand Slam title in June.\nHis other priority is becoming only the third man to claim a 100th tour-level singles title.\nHe will, however, have to come through a strong field in Monte Carlo, with 17 of the top 20 players competing.\nBritain's Jack Draper is one of them, with Alexander Zverev and Carlos Alcaraz among the favourites.\n\"It is a different surface and I have not had much time to get used to this tournament so my expectations are not that high,\" Djokovic said.\nWith so many professional tennis tournaments taking place across the world, and across so many levels, it can be hard to keep up with everything from one week to the next.\nAs part of BBC Sport's commitment to offer more for tennis fans, Second Serve will be your weekly round-up of the biggest stories in the sport.\nAs well as the main talking point, you can see which ATP and WTA players are making significant progress - or struggling for form, how the British contingent are doing and what the next stops on the calendars are.\nYou can also sign up to get the latest tennis news from BBC Sport delivered straight to your mobile phone.", "url": "https://www.bbc.com/sport/tennis/articles/cvgp6qq6wn6o"}