{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:57:15", "date_modify": "2025-05-21 03:57:15", "date_publish": "2025-04-07 12:51:46", "description": "Wycombe manager Mike Dodds says Wrexham have the advantage in the League One promotion race after a \"harsh\" week.", "filename": "sport_articles_ckg51v951qjo_1747799835.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3c55/live/34178800-13ae-11f0-92ad-eb42d450dc76.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_ckg51v951qjo_1747799835.html", "title": "Wycombe's 'harsh' week hands promotion advantage to Wrexham", "title_page": "Wycombe's 'harsh' week hands promotion advantage to Wrexham - Dodds - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wycombe manager Mike Dodds says Wrexham now have the advantage in the League One automatic promotion race after falling six points behind the Welsh side with defeat by Reading.\nThe Chairboys were in second place from November to late-March, but a mixed set of results, including Saturday's loss and a goalless draw against bottom-side Shrewsbury in their past two matches, has seen them fall into the play-off spots.\n\"I think it's a really harsh week,\" Dodds told BBC Three Counties Radio.\n\"The fans, the people behind the scenes, the players, don't deserve what's happened.\n\"At the moment it's gutwrenching. When you're in our position, the weight of the world is on your shoulders a bit.\n\"The advantage is with Wrexham at the moment, I'm not naive to that, but that can swing very very quickly.\"\nWhen Dodds joined, Wycombe were four points behind leaders Birmingham in second, and four points clear of Wrexham.\nBut inconsistent form, and as Dodds admitted, a lack of \"quality and luck\" in the final third, has seen his team fall 17 points behind Blues.\nThey do still have a game in hand on Wrexham.\n\"We created 50 shots on target in three games, the goalkeeper hasn't had to make a save, the opposition [Reading] had three shots on target,\" Dodds added.\n\"We should have six points, we've got one, which is really tough to take.\n\"When you lose, people go down a rabbit hole and try to find something to latch on to. The fact that we haven't scored in the last two games will be a talking point, but I can't listen to that nonsense.\"\nWycombe visit out-of-form Huddersfield on Tuesday looking to close the gap to Wrexham to three points.\n\"They're all must-win games in my head,\" Dodds said.\n\"Regardless of who we're playing, we want to try and create a culture where every single game, we go into it wanting to win.\"", "url": "https://www.bbc.com/sport/articles/ckg51v951qjo"}