{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:01:10", "date_modify": "2025-05-21 06:01:10", "date_publish": "2025-01-31 13:32:56", "description": "Ruben Amorim press conference: Man Utd vs Crystal Palace preview", "filename": "sport_football_articles_cx2ygxdn05xo_1747807270.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/eec5/live/993cf210-a90a-11ef-a4fe-a3e9a6c5d640.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cx2ygxdn05xo_1747807270.html", "title": "Ruben Amorim press conference: Man Utd vs Crystal Palace preview", "title_page": "Ruben Amorim press conference: Man Utd vs Crystal Palace preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester United boss Ruben Amorim has been speaking to the media before Sunday's Premier League game against Crystal Palace (kick-off 14:00 GMT).\nOn Alejandro Garnacho's form in recent matches:\n\"He changed right away since that game against Manchester City, the way he understands things, he understands that I just want to help him and I just want to win games.\n\"He changed in everything - the approach when I talk to him, the way he recovers, he understands sometimes I'm a different coach and that I'm demanding in my way.\n\"Sometimes it's hard with the first impact because it's a different type of coach. He understands [now] that it's never in a bad way - it's always for him.\n\"I think all the merit is for Garnacho. He is improving and we want to continue to improve with Garnacho. On Thursday he understood the position, the moments of playing inside or outside, and the connection with Dalot is improving a lot.\"\nOn whether talks over a new contract and uncertainty over his future may have affected Kobbie Mainoo's form:\n\"I don't think it's the contract. Everyone in England sees him as a very, very good player. He played in the Euro 2024 final.\n\"The key point is the position. It demands a lot from him. In that position on Thursday, I feel he's more happy to play. Simple as that. I felt, watching him, he was so happy on the pitch. That's important for me because if they are happy they play better.\"\nOn how soon Luke Shaw may return to action:\n\"It will take a little bit more time. I think he needs to train more, to spend more time with his team-mates playing normal or small-sided games, not just working alone.\n\"He stayed to do a different type of work, he's going to get together with the team when we arrive [back to Manchester]. When I feel it is the right moment, he will get minutes in the games.\"", "url": "https://www.bbc.com/sport/football/articles/cx2ygxdn05xo"}