{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:40:49", "date_modify": "2025-05-20 11:40:49", "date_publish": "2023-08-06 17:08:24", "description": "Tottenham: Harry Kane scores four in friendly win over Shakhtar Donetsk", "filename": "sport_articles_c1rzyjrr7rdo_1747741249.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/efe2/live/d9337c90-3467-11ee-87ff-2d99c81f721a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c1rzyjrr7rdo_1747741249.html", "title": "Tottenham: Harry Kane scores four in friendly win over Shakhtar Donetsk", "title_page": "Tottenham: Harry Kane scores four in friendly win over Shakhtar Donetsk - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Harry Kane brushed aside continued speculation about his future at Tottenham with four goals in Sunday's 5-1 home friendly win over Shakhtar Donetsk.\nIt was reported that Bayern Munich wanted an answer from Tottenham by Friday about whether they were prepared to sell striker Kane, who has a year remaining on his contract with Spurs.\n\"We know there's one deadline and that's the end of the transfer window,\" said Spurs boss Ange Postecoglou. \"Beyond that, I'm in open dialogue with Harry and with the club on a regular basis. I've said to them that if the status quo changes then inform me.\n\"I don't need to know about the comings and goings in between. I just want to deal with what's in front of me because, irrespective of the outcome of that, I'm building a team here. I can't wait (around) for a decision either way to get going.\n\"We don't have the time or the luxury to do that. I'm working with what's in front of me. You saw today that Harry certainly is invested in what we're doing and we'll keep on doing that unless something changes.\"\nAsked about Bayern's recent public comments about their pursuit of the England captain, the Spurs boss added: \"That's up to Bayern to decide. If that's the way they want to conduct things, it's not up to me to judge that. It doesn't affect me. I don't sit there on a daily basis and worry about what other clubs are doing.\n\"I think what is factual right now is that he is a contracted player of our football club. I certainly wouldn't talk about contracted players at other football clubs but I'm not at Bayern so they can go the way they want.\"", "url": "https://www.bbc.com/sport/articles/c1rzyjrr7rdo"}