{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:14:04", "date_modify": "2025-04-26 04:14:04", "date_publish": "2025-03-04 11:27:16", "description": "Former midfielder Ben Gladwin wants to get people \"feeling a little bit better\" at MK Dons after being put in interim charge.", "filename": "sport_football_articles_crkn6nz5r0xo_1745640844.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/44bb/live/eafbb0d0-f8e4-11ef-9628-add78e51db09.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_crkn6nz5r0xo_1745640844.html", "title": "Ben Gladwin: Interim boss hopes to 'unlock' MK Dons potential", "title_page": "Ben Gladwin: Interim boss hopes to 'unlock' MK Dons potential - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Former MK Dons midfielder Ben Gladwin wants to get people \"feeling a little bit better\" at the League Two club after taking the helm.\nThe 32-year-old was put in interim charge on Monday following the sacking of Scott Lindsey a day earlier.\nThe Dons will look for their first win since 28 January in Tuesday's game at Accrington Stanley, one of four away fixtures in their next five.\n\"The biggest thing we can look to do in this period of time, however long it lasts, is just getting everybody pulling in the same direction, everybody feeling a little bit better, (with) performances at a level where everyone can feel proud and really connected to it,\" Gladwin told BBC Three Counties Radio.\nGladwin had a short spell as Crawley Town caretaker boss when Lindsey left the Sussex club to move to Stadium: MK in September.\nHe subsequently followed Lindsey to become part of the Dons coaching team and is now succeeding him on a caretaker basis for a second time, with MK 17th in the table, having taken only one point from their past six games.\nGladwin added: \"It's the second time in seven months I've ended up doing it. Hopefully I'm a little more prepared this time.\n\"Just trying to unlock the performances and make the players feel free enough to perform at their best level is definitely the angle I'm going to go at - try to create a really good energy and environment around the place.\n\"Building squads and putting players together doesn't always click immediately. It's our job now to find a solution for the guys, provide them with a feeling of connection and some clarity that when they go on that pitch, they understand how they can hurt the opposition and how they can protect our goal together.\"", "url": "https://www.bbc.co.uk/sport/football/articles/crkn6nz5r0xo"}