{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:45:10", "date_modify": "2025-05-20 11:45:10", "date_publish": "2023-08-06 13:13:55", "description": "DIGIONLY", "filename": "sport_football_66378423_1747741510.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66378423_1747741510.html", "title": "Sunday's Championship reports", "title_page": "Sunday's Championship reports - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Leicester City 2-1 Coventry City\nLeicester City midfielder Kiernan Dewsbury-Hall struck two late goals as the relegated Foxes began life back in the Championship by beating luckless Coventry City.\nLast season's beaten Championship play-off finalists looked on course for a deserved three points when they led through Kyle McFadzean's 47th-minute opener from a near-post corner.\nThe Gus Hamer-inspired Sky Blues also wasted good chances either side of the City skipper's strike.\nBut Mark Robins' men were made to pay when Dewsbury-Hall levelled on 77 minutes before being fed by new signing Stephy Mavididi to curl home an 87th-minute winner - and earn victory for new Foxes boss Enzo Maresca, in his first game in charge.\nLeeds United 2-2 Cardiff City\nLeeds United made a dramatic return to the Championship - and start to manager Daniel Farke's reign - as Crysencio Summerville's added-time equaliser capped their fightback from two goals down to draw with Cardiff City.\nThe Bluebirds, also under the guidance of a new boss in Erol Bulut, had to withstand heavy Leeds pressure but clinical counter-attacking goals by debutants Josh Bowler and Ike Ugbo had given the visitors a 2-0 half-time lead.\nA towering header by Leeds captain Liam Cooper early in the second half fuelled a resurgence from the dominant hosts, who missed several chances.\nJust as it looked like Cardiff would cling on for a memorable victory, Summerville finished superbly five minutes into time added on to spark jubilant celebrations at Elland Road.\nA point was the least Leeds deserved. The stats told the story of their supremacy: 72% possession, 25 shots to Cardiff's seven and six on target compared to their opponents' two.\nSunderland 1-2 Ipswich Town\nIpswich made a dream return to the Championship after clinging on to record an eye-catching win at 10-man Sunderland.\nGoals either side of half-time from Nathan Broadhead, a former Sunderland loanee, and George Hirst, saw the Tractor Boys continue the momentum which saw them finish last season's League One campaign unbeaten in 19 matches.\nSunderland's youthful side looked good in the first half and, despite having Trai Hume sent-off 18 minutes from time, they ensured a rousing finale as Dan Neil clipped in a volley on 86 minutes and then hit the post 14 minutes into added time.\nIpswich held on and are now unbeaten in their opening league fixture over the past 10 seasons.\nIt was a first defeat against Ipswich in six matches as a manager for Sunderland boss Tony Mowbray, whose last game as a player was for the Tractor Boys in the 2000 play-off final when they were promoted to the Premier League - the last time the club had been promoted until this year.", "url": "https://www.bbc.com/sport/football/66378423"}