{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:17:36", "date_modify": "2025-05-20 13:17:36", "date_publish": "2023-08-02 12:31:06", "description": "Despite the club's finances being world's apart, Newport boss Graham Coughlan says he holds no animosity against League Two rivals Wrexham.", "filename": "sport_football_66384235_1747747056.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5551/production/_130614812_gettyimages-1484216305.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66384235_1747747056.html", "title": "Newport boss Coughlan holds no animosity against new league rivals Wrexham", "title_page": "Newport boss Coughlan holds no animosity against new league rivals Wrexham - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Newport boss Graham Coughlan says he holds no animosity against their new League Two rivals Wrexham.\nThe two Welsh clubs are world's apart in terms of fame and finances, with newly-promoted Wrexham able to dip into a Hollywood pot of gold.\nFan-owned County are in dire need of investment - with the added blow of losing some key players this summer.\n\"It's not something that I'm going to get jealous, envious or screwed up about,\" Coughlan said.\n\"I've got to concentrate on us, I've got to make the best of what we've got. I can't look at what we've not got.\"\nCoughlan took charge of Newport last October and his budget for this season will again be one of the lowest in the league.\nNewport begin away to Accrington Stanley off the back of a pre-season which included fixtures against Undy, Pontypridd, Sheffield and Swansea.\nWrexham mark their long-awaited return to the football league by hosting Milton Keynes Dons.\nTheir pre-season has been quite the contrast with a major US tour involving fixtures against Chelsea, LA Galaxy II, Manchester United XV and Philadelphia Union II.\n\"I think it's a great story and a great thing to do to invest in a football club... hats off to them,\" Coughlan told Radio Wales Breakfast.\n\"They spend and they blow us out of the water but that's part and parcel of the football pyramid at this moment in time.\n\"I remember as a kid watching the Welsh team play in Wrexham. It's steeped in history, steeped in tradition and it's good to see a club back and fighting.\n\"I actually played against them when they were last in the football league, I might get into trouble for saying that but I don't hold any animosity against Wrexham, we have to focus on ourselves and do our best.\"", "url": "https://www.bbc.com/sport/football/66384235"}