{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:27:29", "date_modify": "2025-05-20 13:27:29", "date_publish": "2023-07-26 11:00:12", "description": "York Valkyrie sign England & former St Helens centre Carrie Roberts for the rest of the 2023 Women's Super League season.", "filename": "sport_rugby-league_66313256_1747747649.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/90F8/production/_130521173_pc4_1583.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-league_66313256_1747747649.html", "title": "Carrie Roberts: York Valkyrie sign ex-St Helens and England centre", "title_page": "Carrie Roberts: York Valkyrie sign ex-St Helens and England centre - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "York Valkyrie have signed England international and former St Helens centre Carrie Roberts for the rest of the 2023 Women's Super League season.\nThe 33-year-old returned to her army job at the end of 2022, having won everything with Saints and played in the World Cup with England.\nRoberts, who serves in the Royal Electrical & Mechanical Engineers, will combine playing with her military role.\n\"I've really missed playing,\" Roberts said of her return to the sport.\n\"I'm back in work full-time now with my job in the Army. Having been there since January, I've settled into the job now and felt like I had the opportunity to commit enough time back into rugby league.\"\nRoberts was a try-scoring regular for Saints in her spell as a hard-running centre and York are keen to tap into that threat for their end-of-season run-in.\n\"To be able to bring Carrie into the group is a massive boost for us at this stage of the season,\" boss Lindsay Anfield said. \"We have a young squad, so to be able to sign someone with her experience in is huge.\n\"I've known Carrie for a while, having worked with her during my time coaching with England, and I've always been really impressed by her work ethic and how tough and uncompromising she is as an athlete.\"", "url": "https://www.bbc.com/sport/rugby-league/66313256"}