{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:12:31", "date_modify": "2025-05-21 05:12:31", "date_publish": "2025-01-31 23:37:27", "description": "Rory McIlroy loses ground on day two of the Pebble Beach Pro-Am as an erratic two-under-par 70 puts him six behind the leader, Austrian Sepp Straka.", "filename": "sport_golf_articles_cvgmr048ddeo_1747804351.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/28c9/live/c47e3d30-e014-11ef-be98-798cbbed3362.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_golf_articles_cvgmr048ddeo_1747804351.html", "title": "Rory McIlroy: World number three six off Pebble Beach lead after erratic 70", "title_page": "Rory McIlroy: World number three six off Pebble Beach lead after erratic 70 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "AT&T Pebble Beach Pro-Am second round leaderboard\n-14 S Straka (Aut); -11 C Davis (Aus), R Henley (US); -10 A Eckroat (US), J Rose (Eng), T Finau (US), T Kim (Kor), A Novak (US).\nSelected others: -9 V Hovland (Nor); -8 R McIlroy (Nir), S Lowry (Ire), J Thomas (US), C Morikawa; -7 S Scheffler (US).\nFull leaderboard\nRory McIlroy lost ground on day two of the Pebble Beach Pro-Am in California as an erratic two-under-par 70 at the event's signature course left him six behind leader Sepp Straka.\nMcIlroy's Europe Ryder Cup team-mate from 2023 - who won his third PGA Tour title in January - fired a second successive 65 which moved him to 14 under par and three ahead of first-round leader Russell Henley and Australia's Cam Davis.\nUS player Henley followed up his 64 at Spyglass Hill with a 69 at Pebble Beach, with Davis' 68 at Spyglass including a bogey at his final hole.\nMcIlroy, whose opening 66 at Spyglass Hill included a hole-in-one as he was only two behind Henley, looked poised to reel in Austrian Straka on day two when four birdies in his opening seven holes left him only two off the pace.\nBut the world number three's round stalled when a run of four pars was followed by successive bogeys at the 12th and 13th, and further shots went at the 16th and 17th before he undid some of the damage by holing a 25-foot eagle putt at the last.\nEngland's Justin Rose ended the day in a group sharing fourth place on 10 under after he carded a 69 at Spyglass Hill, while Shane Lowry stood alongside McIlroy on eight under after his 70 at the same course.\nWorld number one Scottie Scheffler was a further shot back after carding a 70 at Pebble Beach.", "url": "https://www.bbc.com/sport/golf/articles/cvgmr048ddeo"}