{"authors": ["Matt Lloyd", "www.facebook.com"], "date_download": "2025-05-20 11:58:38", "date_modify": "2025-05-20 11:58:38", "date_publish": "2023-08-06 09:39:32", "description": "BBC Sport Wales analyses who impressed most and what areas need work following Wales' 20-9 victory over England in Cardiff.", "filename": "sport_rugby-union_66420617_1747742318.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/17C10/production/_130669279_cdf_050823_cf_wales_v_england_123.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-union_66420617_1747742318.html", "title": "Wales 20-9 England: Who impressed in Wales' warm-up opener", "title_page": "Wales 20-9 England: Who impressed in Wales' warm-up opener - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wales kicked off their World Cup warm-up campaign with a convincing victory over rivals England in Cardiff.\nHead coach Warren Gatland insisted the performance was \"more important\" than the result as he builds to France 2023.\nBut after just two wins in the last 12 games, the result will start healing the scars of a chaotic and sometimes cruel season in Welsh rugby.\nBut what did we learn from Saturday's 20-9 win and who emerged bigger winners than others for the World Cup?\nGatland said he only knows three of his starting team to face Fiji on 10 September, though there are a few players who made a strong case against England.\nTo win your first game as captain is one thing, to do so against England and be named player of the match is the stuff dreams are made of.\nDestiny had called Morgan to the Wales captaincy having been tipped for the role from an early age.\nBorn in the same valley as one of the most respected and beloved of Wales leaders, his appointment was all the more poignant just days after Clive Rowlands died.\nThey are very different characters but Morgan quietly grew into this game, made as many metres as wing Louis Rees-Zammit and played a key role in both tries.\nHe also made the most tackles of any player and his hit on Tom Pearson had shades of Gavin Henson on Mathew Tait in 2005.\nThere are other contenders for the captaincy, but the 23-year-old Morgan must now be among the favourites for the full-time job.\nWith concerns still hanging over the fitness of Taulupe Faletau and the retirement of Josh Navidi - who was the pre-match stadium DJ - Wales are in serious need of a number eight option.\nAaron Wainwright - remarkably one of four Cardiff Metropolitan University graduates in the starting teams - was that man in 2021 when Faletau was previously injured.\nThe Dragons back row has been largely ignored since then, but roared back to embody the difference between the teams in the second half.\nHe carried the ball more times than any other Wales player and created the opening try with his deft off-load. No wonder his performance was hailed \"excellent\" by Gatland.\nInjuries are always a significant danger of these warm-up games as the likes of Leigh Halfpenny, Rhys Webb (both in 2015) and Henson (2011) can testify to.\nSo it is with bated breath that every fall is monitored.\nHooker Ryan Elias was desperately unlucky to tweak a hamstring in the opening minutes, having missed the Six Nations with a snapped Achilles tendon.\nAnd there are concerns over lock Dafydd Jenkins' knee after an excellent display was cut short in the second half.\nHowever, Will Rowlands came through unscathed from his first rugby since last November as Wales began life without Alun Wyn Jones.\nOn a day of five new Wales caps, it was the two who came off the bench that impressed most.\nWales struggled at the scrum in the first half but Henry Thomas - a former England international - swiftly sorted the problems and dominated his tussle against Red Rose captain Ellis Genge.\nGatland knows the importance of a set-piece and that 30-minute cameo may have booked the prop a place to France.\nSimilarly back row Taine Plumtree showed what he can do in the same amount of time and it could now be a straight choice between him and Christ Tshiunza for the World Cup.\nDan Lydiate is set to get his chance at Twickenham next Saturday.\nNeither side will be happy with the way referee Nic Berry fussily over-manged the scrums, but it was clear that Wales' new props Corey Domachowski and Keiron Assiratti found the step up challenging.\nThe Cardiff pair still offered plenty around the pitch, particularly Domachowski with his tackling and carries.\nHowever, a third of Wales' total penalties conceded came from the two new caps. They will learn from the experience.\nGatland puts great stock in fitness and has spent the last two months flogging his players in Switzerland and Turkey, as well as army training in south Wales.\nThat investment paid off on Saturday where England looked out on their feet in the second half while Wales ploughed on to the final whistle.\nGatland also knows having players who can cover more than one position is vital when it comes to naming his final squad.\nHowever, who would have thought centres Mason Grady and George North would audition for roles in the second row and back row following Jenkins' injury. Wales actually won a scrum penalty with North packing down at flanker.\nA special moment for possibly one of the most popular players in Welsh rugby.\nWe still don't know where - or if - Halfpenny will play next season and his place at the World Cup is far from guaranteed.\nBut he kicked perfectly on a milestone day, in winning his 100th cap, and one he more than deserved.\nWales' World Cup opponents Australia and Fiji both fired ominous warnings before Wales took the field.\nA young Wallabies side produced a vastly improved display to lead New Zealand 17-3 at half-time following early tries by Marika Koroibete and Tom Hooper. However, Richie Mo'unga's last-minute kick snatched a 23-20 win for the hosts in Dunedin.\nFiji ran in five tries in Tokyo to clinch the Pacific Nations Cup with a comfortable 35-12 win against Japan.", "url": "https://www.bbc.com/sport/rugby-union/66420617"}