{"authors": ["Timothy Abraham", "www.facebook.com"], "date_download": "2025-05-20 14:00:22", "date_modify": "2025-05-20 14:00:22", "date_publish": "2023-07-31 07:29:50", "description": "Nicholas Pooran smashed a brutal unbeaten century as MI New York won the inaugural Major League Cricket title in Dallas.", "filename": "sport_cricket_66357444_1747749622.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/501D/production/_130590502_minewyork.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66357444_1747749622.html", "title": "Major League Cricket: Nicholas Pooran century inspires MI New York to inaugural title", "title_page": "Major League Cricket: Nicholas Pooran century inspires MI New York to inaugural title - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Nicholas Pooran hit an unbeaten century as MI New York beat Seattle Orcas by seven wickets to win the inaugural Major League Cricket title.\nQuinton de Kock's 52-ball 87 helped Seattle post 183-9 as Trent Boult (3-34) and Rashid Khan (3-9) claimed three wickets apiece for New York.\nPooran then clubbed 13 sixes and 10 fours in his 137 not out from 55 balls while Dewald Brevis chipped in with 20.\nNew York eased home with 24 balls to spare as Pooran hit the winning runs.\nWest Indies wicketkeeper-batter Pooran, who deputised for the injured Kieron Pollard as New York's captain, finished as MLC's leading run-scorer with 388 runs at an average of 64.66, ahead of De Kock (264 at 44).\n\"I told myself that I just needed to bat like Nicky P and not think about batting like the captain,\" said Pooran, who has played 61 ODIs and 75 T20 internationals for West Indies.\n\"I just backed my skills. The platform was there today and the opportunity was there. I had to be brave and it worked for me.\"\nNew Zealander Boult was the tournament's leading wicket-taker with 22 wickets at an average of 10.36.\nUSA international Cameron Gannon, who finished as MLC's second-highest wicket with 11 wickets at 17.36 for Seattle, was named domestic player of the tournament.\n\"The quality has been exceptional,\" said Australia-born Gannon.\n\"Having overseas players and playing this tournament has been so much fun. I think it is going to be fantastic for USA cricket moving forward.\"\nAfter several false dawns, cricket finally looks well placed to establish itself in the United States, spearheaded by its flagship T20 franchise tournament.\nAttendances at the two venues have encouraged organisers, with curious American sports fans drawn to the tournament in addition to vast swathes of the South Asian diaspora.\nMLC's efforts to gain prominence in the US have also been boosted by some influential names.\nSatya Nadella, the chairman and chief executive of Microsoft and co-owner of the Seattle Orcas, bowled the ceremonial first ball before the final at the Grand Prairie Stadium in Dallas.\nFormer India captain Sunil Gavaskar was on hand to award the trophy while Nita Ambani, co-owner of the Mumbai Indians, celebrated with New York's players and posed for selfies with some of the 8,000 fans in attendance.\nIndia's prime minister, Narendra Modi even mentioned cricket's growth in the US at a state dinner attended by President Joe Biden at the White House recently.\n\"The US has emphatically shown the rest of the cricket world that it is capable of successfully hosting cricket of the highest calibre,\" MLC co-founder Vijay Srinivasan told BBC Sport after the final.\n\"To hear from the fans and the players who came to MLC this season on how much it exceeded their expectations, and more importantly, that they can't wait to be back next season is both humbling and energising at once.\n\"I can't think of another sport that has come out of the gates like MLC has in the US - practically all matches sold out in both venues, amazing atmospheres and fans actually building allegiances to their home teams even though we are playing in just two venues.\n\"We are going to build on this incredible launch season to come back even better in 2024.\"\nMLC's founders have already indicated their desire to lure England's best players to the tournament in the future. Even though it clashes with the English summer it could prove hard to resist.", "url": "https://www.bbc.com/sport/cricket/66357444"}