{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:39:16", "date_modify": "2025-05-19 14:39:16", "date_publish": "2017-08-12 00:00:00", "description": "Four Championship sides maintain their 100% starts to the season - relive Saturday's EFL action as it happened.", "filename": "sport_live_football_40721710_1747665556.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_live_football_40721710_1747665556.html", "title": "Saturday's EFL action as it happened", "title_page": "Saturday's EFL action as it happened - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Post\nAnd that's just about it for today. Thanks for being with us during our six-hour EFL marathon.\nWe've had hat-tricks, hammerings, seven-goal thrillers and a sprinkling of controversy too. You can find reports of all 34 games on the BBC Sport website and app.\nHope you can join us tomorrow for more Premier League and Championship action.\nPost\nNorwich v Sunderland (Sunday, 13:30 BST)\nSimon Grayson's reign as Sunderland manager has started promisingly, with a victory at Bury in the Carabao Cup on Thursday following their Championship draw with Derby.\nFind out how the Black Cats get on against Norwich tomorrow in BBC Sport's live text coverage, which is set to begin at 13:00 BST.\nIt was awful, really awful - Bruce\nFT: Cardiff 3-0 Aston Villa\nResult of the day in the Championship? That has to be Cardiff's 3-0 win over Aston Villa, which leaves the Welsh side as one of four clubs with 100% records.\nVilla boss Steve Bruce had some very strong words to say about his side's performance - click on the play button below to hear his interview with BBC WM...\nGestede goal gets Middlesbrough off the mark\nFT: Middlesbrough 1-0 Sheffield United\nWell out of nowhere that second half came to life, right at the death (if that makes sense).\nIf you're just joining us, read Phil Cartwright's match report...\nMiddlesbrough 1-0 Sheffield United\nRudy Gestede's header gives Middlesbrough victory over Sheffield United and earns Boro's first league points of the season.\nRead More\nFULL-TIME\nMiddlesbrough 1-0 Sheffield United\nWell that was some late drama after what was otherwise a rather low-key second half.\nRudy Gestede's header proves to be the decisive goal for Boro, but Sheffield United have a stoppage-time effort ruled out for offside.\nIt looked like Dael Fry headed into his own net, but Jack O'Connell was adjudged to be offside.\nA controversial conclusion.\nSheffield United have goal disallowed!\nMiddlesbrough 1-0 Sheffield United\nThat is why a one-goal lead is never really enough.\nThe Blades put in an inswinging free-kick which is bundled into the Boro net by Jack O'Connell, but the assistant rules it out for offside.\nIt takes the visiting players ages to realise, but their celebrations are eventually halted.\nWas it the right decision? It doesn't look like it, I'm afraid.\nPost\nMiddlesbrough 1-0 Sheffield United\nA half-chance for the Blades, as Leon Clarke tests Darren Randolph at his near post.\nHis initial attempt at a cross is blocked, and his shot is split by the Boro keeper, who gathers it at the second attempt.\nWe're into four minutes of added time.\nPost\nMiddlesbrough 1-0 Sheffield United\nI'd normally try to build up the tension as we enter the closing stages, but it honestly feels like Boro are cruising towards the three points.\nA one-goal lead is never safe, but it feels more than enough right now.\nSUBSTITUTION\nMiddlesbrough 1-0 Sheffield United\nA change for each side as we enter the final 10 minutes of normal time.\nIn search of a goal, Sheffield United turn to fresh-faced David Brooks, who takes the place of Kieron Freeman.\nMeanwhile, Boro take off record signing Britt Assombalonga, with former West Ham forward Ashley Fletcher coming on.\nPost\nMiddlesbrough 1-0 Sheffield United\nIf you're at all surprised at how few chances Boro have given their opponents, consider this stat...\nThe hosts haven't conceded more than once in any of their last 44 home matches in the second tier, keeping 27 clean sheets in that time.\nSafe to say the Blades will need something special to break their opponents down - have I seen anything to suggest that will happen? Not really.\nSUBSTITUTION\nMiddlesbrough 1-0 Sheffield United\nBoro bring on Chelsea loanee Lewis Baker, a playmaker, for goalscorer Rudy Gestede, who had been quiet in the second half.\nChed Evans set up two goals in the first appearance of his second spell with Sheffield United in midweek, and the striker is once again introduced by the Blades.\nEvans comes on for the largely ineffective skipper Billy Sharp.\nGREAT SAVE!\nMiddlesbrough 1-0 Sheffield United\nThat's the closest the visitors have come to getting on level terms.\nLeon Clarke holds the ball up brilliant on the edge of the area and nudges back for Paul Coutts, whose shot is deflected and tipped wide by Boro keeper Darren Randolph.\nThe former West Ham stopper then comes comfortably to collect the resulting corner.\nNever underestimate the importance of a top goalie.\n\"There's still a long way to go\"\nFT: Derby 0-2 Wolves\nWolves won 2-0 at Derby to maintain their 100% start, thanks to goals from Barry Douglas and Ivan Cavaleiro.\nWolves head coach Nuno Espírito Santo told BBC WM:\n\"I’m pleased with the work of the boys. I have to congratulate them for the effort they made today. It’s a good start, a good game again. There’s still a long way to go, still a lot of work to do, but the boys did a fantastic job today.\n\"I think the spaces were in the Derby team. I think we should take advantage sooner to close the game but the chances are there. The goals will come but every moment of the game is important: defending well and clean sheets is the first step to winning.\"\nSUBSTITUTION\nMiddlesbrough 1-0 Sheffield United\nChris Wilder has given it the best part of 15 minutes of the second half, and hasn't seen enough spark from his Sheffield United side.\nThe solution? He replaces Samir Carruthers with Mark Duffy, who started his career in Liverpool's academy.\nCan he provide that little something the visitors have lacked in the final third thus far?\nPost\nMiddlesbrough 1-0 Sheffield United\nSo far it's been more about Sheffield United holding off the hosts, rather than the Blades looking for an equaliser themselves.\nHowever, with Billy Sharp on the pitch you feel they always have a chance of getting a goal from nothing.\nSince the start of last season, the experienced striker has scored more goals (31) than any other player in the top four tiers of English football.", "url": "https://www.bbc.com/sport/live/football/40721710"}