{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:40:11", "date_modify": "2025-05-19 14:40:11", "date_publish": "2017-08-19 10:52:39", "description": "Devante Cole's double ensures Fleetwood Town's perfect start to the new campaign rolls on as they beat AFC Wimbledon.", "filename": "sport_football_40907955_1747665611.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/15C36/production/_90724198_football_getty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_40907955_1747665611.html", "title": "Fleetwood Town 2-0 AFC Wimbledon", "title_page": "Fleetwood Town 2-0 AFC Wimbledon - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Devante Cole's double ensured Fleetwood Town's perfect start to the new League One campaign rolled on as they saw off AFC Wimbledon.\nCole's double made it nine points from a possible nine for Uwe Rosler's side as they built on wins over Rotherham and Northampton.\nThe swirling winds set the tone for an aerial battle in the opening stages but when Fleetwood eventually got the ball down they looked a constant threat.\nMidfield maestro Kyle Dempsey pulled the strings in the middle of the park and he orchestrated the opening goal.\nThe former Huddersfield man found a pocket of space on the right and slid the ball over to Jordy Hiwula, who teed up Cole to curl the ball home from the corner of the box in the 19th minute.\nCole struck again in the 57th minute, a perfectly-weighted Dempsey pass down the channel released him on the left with the striker cutting inside and curling the ball into the top-right corner.\nIt was not all one-way traffic though as Wimbledon enjoyed a spell of pressure after the goal.\nCody McDonald failed to set up a grandstand finish as he nodded the ball onto the bar with Lyle Taylor also wasting some good late chances for the visitors as Fleetwood absorbed the pressure.", "url": "https://www.bbc.com/sport/football/40907955"}