{"authors": ["Harry Poole", "www.facebook.com"], "date_download": "2025-05-21 05:08:23", "date_modify": "2025-05-21 05:08:23", "date_publish": "2025-01-23 10:34:07", "description": "Madison Keys stuns world number two Iga Swiatek to set up an Australian Open final against two-time defending champion Aryna Sabalenka.", "filename": "sport_tennis_articles_cpdx47d7559o_1747804103.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d650/live/0c789560-d98d-11ef-9738-e521aedf78f0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_tennis_articles_cpdx47d7559o_1747804103.html", "title": "Australian Open 2025 results: Madison Keys stuns Iga Swiatek to set up Aryna Sabalenka final", "title_page": "Australian Open 2025 results: Madison Keys stuns Iga Swiatek to set up Aryna Sabalenka final - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Madison Keys saved a match point before stunning world number two Iga Swiatek to set up an Australian Open final against two-time defending champion Aryna Sabalenka.\nKeys claimed a shock 5-7 6-1 7-6 (10-8) victory over five-time Grand Slam champion Swiatek to reach the second major final of her career.\nPoland's Swiatek served for the match at 6-5 in the third set and held match point but Keys saved it, broke back and then recovered from 7-5 down in a fraught tie-breaker to advance.\nKeys said: \"The third set was so up and down. There were so many big points and break point chances. I feel I blacked out at one point and I was just there running around.\"\nKeys' victory came after Belarusian top seed Sabalenka earned the chance to become the first woman in 26 years to win three successive Australian Open titles with a commanding 6-4 6-2 win over close friend Paula Badosa.\nWhile Keys has achieved a career-best Australian Open run, Sabalenka is aiming to emulate Martina Hingis' three straight titles between 1997-99.\n\"I have goosebumps. I am so proud of myself and my team that we were able to put ourselves in such a situation,\" Sabalenka said.\n\"If I put my name in history it will mean the world for me. I couldn't even dream of it.\"\nSwiatek's loss also means Sabalenka will retain the world number one ranking after the tournament.\nSwiatek had been in imperious form in Melbourne, losing just 14 games across her five matches before the semi-finals.\nFor context, only three players in history have dropped fewer games in making the last four at the Australian Open in a 128-player draw during the Open era.\nHowever, the four-time French Open winner was undone by an inspired Keys, determined to win an Australian Open semi-final at the third attempt.\nA messy start featuring five breaks of serve in the opening six games set the tone for an awkward night under Rod Laver Arena roof for Swiatek, who broke for a fourth time to take the first set before capitulating in the second.\nKeys took just 27 minutes to overwhelm Swiatek reeling off five straight games to force a deciding set.\nBoth players saved numerous break points as the tension ramped up during an enthralling, high-quality deciding set.\nSwiatek eventually took her eighth opportunity to break for a 6-5 lead but, after failing to take her first match point, conceded serve with a double fault.\nA winner-takes-all tie-break was what Keys and the match deserved but Swiatek looked to be in control of it at 7-5 up.\nHowever, in a final impressive show of physical and mental resilience, Keys won five of the next six points to complete a sensational win after two hours and 35 minutes.\nOn facing Sabalenka in the final, Keys said: \"There will definitely be some big hitting and not a lot of long points, but I'm really excited for the challenge.\"", "url": "https://www.bbc.com/sport/tennis/articles/cpdx47d7559o"}