{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:35:43", "date_modify": "2025-05-20 13:35:43", "date_publish": "2023-08-01 17:15:07", "description": "Killie still have 'a bit to do' but McInnes insists 'the work is being done'", "filename": "sport_articles_ce5r2ge2zzeo_1747748143.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9884/live/ce211d30-308e-11ee-8f52-fbf70e4bf742.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_ce5r2ge2zzeo_1747748143.html", "title": "Killie still have 'a bit to do' but McInnes insists 'the work is being done'", "title_page": "Killie still have 'a bit to do' but McInnes insists 'the work is being done' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Derek McInnes believes his Kilmarnock squad is “significantly stronger” after Liam Donnelly agreed a new contract with the club.\nThe 27-year-old midfielder, who joined Killie from Motherwell on a one-year deal last summer, re-signed on a two-year contract and will remain with Killie until 2025.\n“He said if he was staying in Scotland he would be signing for us,\" McInnes said ahead of Donnelly ahead of his side's league opener against Rangers.\n“We agreed a deal a while ago but he had a lot to consider with his family.\n“Even this week there was a club in Scotland offering him more money to sign and he stood by his word so, really good to get him, although he is away behind everyone else (fitness wise) but we sign players for the season.”\nThe Northern Ireland international is the eleventh summer recruit, with McInnes adding there has been more \"experience\" in his signings.\n“We let a lot of players go to free up the space to give us scope to rebuild the squad,\" the Killie boss added.\n“We have tried to reduce the amount of loans we have in comparison to last season, that would be an indication that we have done the work, trying to give players contracts to become Kilmarnock players, so we feel we have a good level of player in the building. The proof will be at the end of the season.\n“We still have a bit to do, we still have forward areas to be dealt with, we are still trying to get at least one in between now and the window closing.\n“But if we can get a few of our senior players back who have been out, like Joe Wright, Kyle Vassell and Rory McKenzie, then the squad looks significantly stronger but as I say time will tell with that.”", "url": "https://www.bbc.com/sport/articles/ce5r2ge2zzeo"}