{"authors": ["Pat Riddell", "www.facebook.com"], "date_download": "2025-05-21 06:03:54", "date_modify": "2025-05-21 06:03:54", "date_publish": "2024-12-24 15:39:02", "description": "Nottingham Forest news: Opinion - fan's moment of the year", "filename": "sport_football_articles_cge9xw725wgo_1747807434.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2992/live/78122530-b62e-11ee-8f07-bbfdfa890097.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cge9xw725wgo_1747807434.html", "title": "Nottingham Forest news: Opinion", "title_page": "Nottingham Forest news: Opinion - fan's moment of the year - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Only four clubs have scored against Liverpool at Anfield in the Premier League this season. Only one of them have won.\nIn fact, Arne Slot's side have only been defeated once in the league this season. And that victory was Nottingham Forest's first at Anfield in 55 years.\nThere have been several memorable moments this year for Forest, particularly since this enthralling season began in August. But that historic win is up there for many reasons — most importantly, it was an early marker for this season. It demonstrated that we can win anywhere, that Nuno Espirito Santo's side have the tactical nous to deliver those kind of performances and that getting one over on our old-time European rivals instilled a confidence that only games like that can bring.\nI was in the departure lounge at Heathrow Terminal 5, desperately trying to catch a glimpse on my phone; we took off before I knew the final result. Our writer George Edwards was there though, and described it as \"total ecstasy… perhaps the greatest away moment this century\".\nHaving slumped to a 3-0 defeat in the same fixture last season, Forest were already a more resolute outfit having strengthened in key areas. Nuno's team selection was a surprise but clearly part of a carefully thought through game plan. Stifling Liverpool's attack is no easy task but that's exactly what the Reds did — playing in their sky blue kit — displaying their determination and collective organisation. The devastating part of the strategy was bringing on the benched pair of Anthony Elanga and Callum Hudson-Odoi, whose pace and match-winning exploits were the difference on the day.\nI don't think there's a Forest fan who didn't remain on a high for days, even weeks, after that win. Given how the season has panned out so far, both sides have performed beyond expectations — and this result was hugely significant in a current and historic context.", "url": "https://www.bbc.com/sport/football/articles/cge9xw725wgo"}