{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:00:04", "date_modify": "2025-05-21 07:00:04", "date_publish": "2025-03-29 07:59:17", "description": "World number one Scottie Scheffler hits a course record 62 to lead the Houston Open by one shot after the second round, with Rory McIlroy seven shots back.", "filename": "sport_golf_articles_cx2021gjyqjo_1747810804.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b64c/live/9228a070-0c6d-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_golf_articles_cx2021gjyqjo_1747810804.html", "title": "Houston Open: Scottie Scheffler hits course record 62 to lead by one shot", "title_page": "Houston Open: Scottie Scheffler hits course record 62 to lead by one shot - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Rory McIlroy birdied his last three holes to squeeze inside the cut line in the second round of the Houston Open as world number one Scottie Scheffler opened a one-shot lead with a course record 62.\nScheffler set the pace with eight birdies and no bogeys to move to 11 under par for the tournament, enjoying the best of the early conditions at Memorial Park before thunderstorms meant play was suspended on day two\nCanadian Taylor Pendrith is a shot back on 10 under alongside America's Ryan Gerard and Australia's Min Woo Lee, who birdied the last two holes of his second round.\nMcIlroy carded a 66 to finish on four under for the day and the tournament, while England's Danny Willett and Matt Wallace are both on two under, with both men missing the cut by a shot.\nWhile some of the field had to complete their second rounds on Saturday due to bad light, McIlroy had no such concerns. He sunk a series of smart putts in his late run of birdies.\nThe Northern Ireland player's round was interrupted for two hours as the thunderstorms passed, and darkness was falling as his finished.\nIt was an improvement on a level-par opening round which he described as \"pedestrian\", but he still slipped further off the pace, seven shots behind leader Scheffler.\n\"I holed a couple of putts,\" McIlroy said. \"That was it. It was nice to see a couple of putts go in and get finished.\n\"It was a little dicey there at the end. Nice to finish the round the way I did.\"\nScheffler, meanwhile, posted his best round since returning from a hand injury sustained while cooking over Christmas.\nHe remains bogey-free for his first 36 holes, charging to the front after building on an opening three-under 67, as he warms up for the defence of his US Masters title in April.\n\"It was important for me to stay patient out there,\" said Scheffler. \"It was nice to get off to a good start and kind of hold the momentum and keep the card clean.\"", "url": "https://www.bbc.com/sport/golf/articles/cx2021gjyqjo"}