{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-05-21 03:40:59", "date_modify": "2025-05-21 03:40:59", "date_publish": "2025-04-06 21:07:21", "description": "After Man City and Man Utd played out a dull goalless Premier League draw, BBC Sport looks at what is ahead of both clubs.", "filename": "sport_football_articles_c05nl2ve3nmo_1747798859.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e43f/live/f8a52040-132e-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c05nl2ve3nmo_1747798859.html", "title": "Manchester United 0-0 Manchester City: Major changes needed at both clubs", "title_page": "Manchester United 0-0 Manchester City: Major changes needed at both clubs - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "\"Not so much red or blue - grey would be better.\"\nThe overwhelming feeling around the 196th Manchester derby was neatly summed up by a comment posted on the BBC Sport website.\nIt might be a stretch to claim, as one respondent did, it was 'the worst derby match in the world'. But the sentiment encapsulated the mood.\n\"It's a Manchester derby,\" seethed former United captain Gary Neville on Sky Sports after the dull goalless draw at Old Trafford. \"It should have more blood, thunder, risk, and courage involved in playing the game.\n\"The congratulations and love-in I'm watching says both teams are happy with 0-0. It looks like it's Sunday afternoon and they're going to go for a roast dinner together now.\"\nUnited head coach Ruben Amorim has not been in England long but the former Sporting boss has worked a few things out.\n\"I understand everything,\" he said. \"Gary Neville is critical about everything. I understand that part.\"\nAmorim's assessment was a simple one. How could anyone expect a reprise of the great games of the past, from either the red or blue sides of the great Mancunian divide, given where the two teams are at the moment?\nCity remain outside the top four, which would guarantee qualification for the Champions League next season.\nMore pertinently, while they remain fifth - which will almost certainly secure a spot in Europe's elite competition - they will drop down if Newcastle win either of their two matches in hand, starting with Monday's home match against nearly doomed Leicester.\n\"I understand we are, in the moment, doing the worst season in history,\" said Amorim. \"Manchester City won everything in the past but this season are struggling.\n\"We are not in the best moments to give the best spectacle to every fan. When we are not fighting for the big things, of course it's different.\n\"You have to look at the context of the game. I understand the critical aspect of players that played in this game in a different way, because they were fighting for the titles every time.\"\nUnsurprisingly, another outspoken former United captain wasn't having any of that.\n\"They get interviewed as if a draw isn't too bad,\" Roy Keane said. \"A draw doesn't get you anywhere fast. It isn't good enough.\n\"Forget the top teams. I'm on about competing with Brentford and Crystal Palace and Wolves and all these teams. Are you telling me Man Utd should be behind them, even with this group of players?\"\nFor context, United - on course for their worst-ever Premier League season - are six points ahead of Wolves. Brentford, one place above them in 12th, are four points ahead.\nThere were also post-match chants against the Glazer family from home fans who stayed behind, determined to crank up pressure on the American majority owners, who they blame for United's parlous state.\nBut Amorim and City boss Pep Guardiola have to set aside the noise to deliver significant improvement.\n\"You see the numbers of players who have been at the top for four, five, six years,\" said Guardiola. \"This year, we drop. It's not one, it's all of them - that's why we are struggling to win games.\"\nMan Utd midfielder Bruno Fernandes had a different take on the lack of intensity.\n\"It can't be like it was in the past, a lot of things have changed, with VAR, everything,\" he said. \"With VAR, you can't do that. We can't be as rough as we want in the duels. Everything has changed.\"\n\"That was one of the dullest Manchester derbies I've seen,\" Chris Sutton told BBC Radio 5 Live. \"It tells you where the clubs are at. Both have a lot of work to do in the summer.\"\nUnited's problems are huge.\nIt is difficult to imagine Amorim choosing many of the players available to him in an ideal squad.\nBut the fundamental point is a lack of goal threat. United have failed to score in 11 of their 31 Premier League games this season. Aside from matches against the three teams destined to go down, they have scored two goals or more on six occasions, including when they lost at home to Nottingham Forest on 7 December.\n\"We had the same lack of goal [threat],\" said Amorim, when asked about comparisons to last Tuesday's defeat by Forest at the City Ground.\nUnited need to be significantly better at recruitment in the summer than they have been on the pitch this term.\nWing-backs, central defenders and central midfield are all areas of weakness, let alone up front, where Rasmus Hojlund and Joshua Zirkzee continue to toil for little reward. It is now a combined four goals in 48 appearances for the pair since the Europa League win over Viktoria Plzen on 12 December, when Hojlund scored twice.\nOn Sunday, Amorim talked about how he thinks things are going on the good days. That implied there have been other days when he has wondered if United are heading in the right direction.\n\"In the moment it's still really hard every day, but of course you can imagine that the next season is going to be so much different,\" he said. \"That's why I'm always saying I'm in a rush. Everybody here is suffering a lot with all these changes. We have to show something in the next year, right away.\n\"In the good days you think like that, that it was important to come [here] in the middle of the season, to work with the players, to improve the players as soon as possible, to start the next season with the better idea of what we want.\"", "url": "https://www.bbc.com/sport/football/articles/c05nl2ve3nmo"}