{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:52:15", "date_modify": "2025-05-21 03:52:15", "date_publish": "2025-04-07 10:09:26", "description": "Wales' record cap-holder Jess Fishlock has not travelled to Gothenberg for Tuesday's Nations League game because of injury.", "filename": "sport_football_articles_c89g7zq2wyeo_1747799535.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5b4b/live/6fa78af0-135e-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c89g7zq2wyeo_1747799535.html", "title": "Women's Nations League: Injured Jess Fishlock misses Wales trip to Sweden", "title_page": "Women's Nations League: Injured Jess Fishlock misses Wales trip to Sweden - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wales will be without influential midfielder Jess Fishlock for Tuesday's Nations League game in Sweden.\nRecord cap-holder Fishlock, 38, has not travelled to Gothenburg because of injury.\nWales' all-time leading scorer came into this camp having missed her most recent club match for Seattle Reign and was an unused substitute in Friday's 2-1 home defeat by Denmark.\nFishlock won her latest, and 160th, cap as a second-half substitute in February's 1-1 draw with Sweden at Wrexham's Stok Racecourse.\nShe had started the 1-0 loss in Italy three days earlier in Wales' opening Nations League Group A4 game.\nWales boss Rhian Wilkinson says it was a difficult decision not to bring Fishlock to Sweden.\n\"Jess is someone who would play every game,\" Wilkinson said.\n\"It was with her and in combination with the fantastic medical team in Seattle as well as in Wales [that the decision to leave Fishlock in Wales was made].\n\"We had a conversation about how to get Jess to be feeling the best possible. She would keep going and going and going, but we felt this was the right time to get her rest and recovery to make sure she, as well, is feeling at her best possible [level] next [international window].\"", "url": "https://www.bbc.com/sport/football/articles/c89g7zq2wyeo"}