{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:21:14", "date_modify": "2025-04-26 04:21:14", "date_publish": "2025-03-03 14:59:14", "description": "Millwall boss Alex Neil says playing with 10 men meant Lions couldn't give 'full flavour' of their improvement.", "filename": "sport_football_articles_cy05j1pwgxvo_1745641274.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5069/live/08019fd0-f824-11ef-a033-b58d3bfaf1a1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cy05j1pwgxvo_1745641274.html", "title": "Millwall: Alex Neil says red card stopped Lions from showing true selves", "title_page": "Millwall: Alex Neil says red card stopped Lions from showing true selves - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Alex Neil was frustrated his Millwall side were unable to showcase their improvement against Premier League opposition after the early red card against Crystal Palace.\nLions keeper Liam Roberts was dismissed for his high challenge on Jean-Philippe Mateta just eight minutes into the FA Cup fifth round tie at Selhurst Park.\nMillwall went into the tie having lost just one of their last nine games in all competitions but were beaten 3-1 with Wes Harding's goal deep into first-half injury time, which briefly restored hope, proving merely a consolation.\n\"Coming here with 11 men is a difficult task, given the form they have been in, we've basically played the whole game with 10 men which is really tough,\" Neil told BBC Radio London.\n\"There's natural frustration because I wanted to come here and show what we were capable of. Naturally that changed when we had a man sent-off.\n\"We don't really know how it would have panned out. We couldn't give a full flavour of how we have been playing of late.\n\"The goals we conceded was probably my biggest frustration. One is an own goal, we just need to clear our lines, we don't do it properly, it ends up in the net, the second we don't get a clearance right, it lands to their player and ends up in the net.\n\"We got a goal which gives us a bit of a lifeline, half-time gave me an opportunity to change the shape a bit, it made us much more compact, better, harder to break down, but the third goal is a set-play. It took the game away from us.\"\nMateta has since been released from hospital after treatment for a head injury and Neil insisted the whole club wished the French forward well with his recovery.\n\"I'm not suggesting the tackle wasn't a bad one,\" he added. \"Liam's come out, he's mistimed a challenge, if he's caught the lad he deserves to be sent-off, we accept that.\n\"I am not accepting anybody suggesting Liam has tried to hurt the player. We're five minutes into the game, we're trying to win the game.\n\"I hope the lad is fine, I hope he comes back if it's a serious injury, we wish him the best. For anyone to suggest Liam would intentionally hurt him is way off the mark for me.\n\"Liam said he hit the ball. It's hard to stop that momentum when you're rushing out. He'll be disappointed he's injured. There was certainly not any malice or intention on his part to hurt a player.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cy05j1pwgxvo"}