{"authors": ["Andrew Benson", "www.facebook.com"], "date_download": "2025-05-20 14:27:20", "date_modify": "2025-05-20 14:27:20", "date_publish": "2023-07-29 11:33:27", "description": "Max Verstappen pips McLaren's Oscar Piastri to pole position for the Belgian Grand Prix sprint race by just 0.011 seconds.", "filename": "sport_formula1_66348369_1747751240.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/13644/production/_130582497_gettyimages-1578335724.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_formula1_66348369_1747751240.html", "title": "Belgian Grand Prix: Max Verstappen shades brilliant Oscar Piastri to claim sprint pole", "title_page": "Belgian Grand Prix: Max Verstappen shades brilliant Oscar Piastri to claim sprint pole - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Max Verstappen pipped McLaren's Oscar Piastri to pole position for the Belgian Grand Prix sprint race by just 0.011 seconds.\nThe world champion was the very last driver to cross the line on a drying track, the condition of which was improving consistently throughout the session.\nNevertheless, Piastri's performance continued the strong impression the Australian is making in his debut season.\nCarlos Sainz led Charles Leclerc for an all-Ferrari second row of the grid.\nPiastri's team-mate Lando Norris was fifth, ahead of the Alpine of Pierre Gasly, Mercedes' Lewis Hamilton and Red Bull's Sergio Perez in eighth, 0.905secs slower than team-mate Verstappen.\nAlpine's Esteban Ocon and Mercedes' George Russell completed the top 10.\nAston Martin sabotaged their own efforts by sending Lance Stroll out on medium-compound slick tyres at the end of the second session before the track was ready for them.\nThe Canadian crashed at the fast left-hander of Turn Nine, bringing out a red flag with just 40 seconds of the session remaining, and that meant team-mate Fernando Alonso, on his 42nd birthday, was also eliminated because he had not yet set a time.\nThe session started on a wet track but progressively dried throughout, until it was finally ready for slicks for the final top-10 shootout.\nVerstappen, who set pole on Friday for Sunday's grand prix by a much bigger margin of more than 0.8secs, said: \"The gap was not as big as yesterday, my second sector was maybe a bit careful - Turn Eight and Nine was very slippery. But it's OK. Let's see if it is going to rain again in the afternoon.\"\nPiastri was torn between the disappointment of being so close to pole and the pleasure of achieving his best F1 qualifying position so far.\n\"Especially in conditions like that, you can lose that much time and 100 times that very easily,\" he said.\n\"I was very happy with my lap. I thought I did a good job. Of course, there's always point in the lap when you think, 'I could have gained 0.011secs.' Our car really likes it like that. Its a nice place to be.\n\"If there is one place where you want to start second rather than first, it's probably here, so I am going to say I did that on purpose.\n\"But the weather could change again for the sprint. Either I'll have hopefully a nice tow down to Turn Five or I'll be able to at least see where I'm going.\n\"I can't thank the team enough. It's still pretty amazing that we are disappointed with being in second rather than on pole.\"", "url": "https://www.bbc.com/sport/formula1/66348369"}