{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 08:04:26", "date_modify": "2025-04-26 08:04:26", "date_publish": "2025-02-26 15:47:59", "description": "Non-league coach Rosi Webb believes having women in charge of men's professional teams could become a norm once one club is \"brave enough\" to do it.", "filename": "sport_football_articles_c1lpv6j6z74o_1745654666.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5d9e/live/824b2380-f453-11ef-9d52-1b1b29dc5f7f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c1lpv6j6z74o_1745654666.html", "title": "Rosi Webb: Non-league coach hopes women get chance with men's professional teams", "title_page": "Rosi Webb: Non-league coach hopes women get chance with men's professional teams - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Non-league coach Rosi Webb believes having women in charge of men's professional teams could become a norm once a club is \"brave enough\" to be the first to do it.\nStanway Pegasus boss Webb, one of very few female coaches in charge of a men's team in England, recently obtained a Uefa A licence.\nIt entitles her to coach teams up to the second tier of English football, but she would need a Uefa Pro licence for a job in the Premier League.\n\"There's certainly a lot of talented females out there that, first of all, hold the right qualifications but also have experience in the game,\" Webb told BBC Essex.\n\"I think sometimes clubs aren't brave enough to do it because if they were we'd have a female [in charge of a team] already.\n\"As soon as one club does it, it will probably start to become the norm a little bit but it will take that first club to take that step.\"\nNo club has ever appointed a female manager in the top five tiers of English football, although Hannah Dingley had a two-week spell as interim boss of Forest Green Rovers in 2023 when she was head of their academy.\nWebb believes that a woman should only be appointed on merit, not on the basis of attracting headlines.\n\"I'd like to think that there's a club out there that will give a female a job because they deserve the job,\" she added.\n\"It's got to be the right fit for the club. It's like any job - whoever gets it should be the right person for the job.\"\nWebb obtained her A licence 10 years on from earning her previous B qualification after studying over a period of eight months at the St George's Park national training centre near Burton upon Trent.\n\"It was a bit of a relief because the course is so intense, like you'd expect it to be being a Uefa qualification,\" Webb said. \"It took about a year to complete.\n\"In between each block, you'd have two online calls and talk about things like tactics and strategy and you'd also have a minimum of six visits, so a coach developer would come out into your environment and watch your sessions.\"\nShe added: \"There's always going to be trends in the game and we've gone from playing long to playing out [from] the back - it will be a forever-evolving game and we see things now where players don't just play one position, they look to rotate.\n\"It's also the other bits around it like analysis and injury prevention, which all inform the practices you're putting on - it's not just a case of turning up and putting sessions on, you have to take into account everything that comes along with it.\"\nStanway face Framlingham this weekend and are hoping to go one better than the last two seasons when they lost out in the Eastern Counties League Division One North play-offs.\nGiven her current level of qualification permits her to coach up to Championship level, Webb was asked whether she would fancy coaching a club such as leaders Leeds United one day.\nShe replied: \"Not sure about Leeds United but certainly that's probably the aim in around that kind of standard at some point, I guess.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c1lpv6j6z74o"}