{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:13:51", "date_modify": "2025-05-19 15:13:51", "date_publish": "2015-02-10 13:19:42", "description": "Mikael Lustig is likely to miss Celtic's Europa League tie with Inter Milan and Kris Commons' participation is in doubt.", "filename": "sport_football_31367880_1747667631.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/80908000/jpg/_80908820_lustig-commons.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31367880_1747667631.html", "title": "Celtic's Kris Commons & Mikael Lustig injured before Inter Milan tie", "title_page": "Celtic's Kris Commons & Mikael Lustig injured before Inter Milan tie - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Mikael Lustig is likely to miss Celtic's Europa League match against Inter Milan and Kris Commons is a doubt for the first leg of the last 32 tie.\nLustig is out for a month with an ankle injury, while forward Commons has a thigh problem and could be missing for two weeks.\n\"Kris Commons has pulled a [thigh] muscle but hopefully it will be one to two weeks,\" said manager Ronny Deila.\n\"It could be much worse. He can be [fit for Inter].\"\nDeila is not, however, expecting Swedish full back Lustig to be available for the Inter tie, with the first leg on 19 February and the return in Milan a week later.\nLustig and Commons were both injured in the Scottish Cup win over Dundee at the weekend.\n\"It's more serious for Mikael, it may be three to four weeks,\" Deila added.\nAfter Celtic's 2-0 win over Dundee, Deila travelled to Milan and watched Inter beat Palermo 3-0 in Serie A.\nInter have struggled in the league this season and are currently 11th in the standings, and the Celtic manager is confident his side can see off the Italian giants.\n\"Inter is a good team, it's a big club with many good players,\" he added. \"But after their match I sat with a good feeling - we have a chance.\n\"We can beat Inter Milan, if not we would stay at home. We're progressing all the time and have a very good squad.\n\"I believe it's possible and that's the most important thing. We are much more prepared than we were in the group stages of the Europa League so I'm going into the match with a good feeling and thinking we have a good chance.\"\nRecent signings from Dundee United Stuart Armstrong and Gary Mackay-Steven are eligible for the tie and could make their debuts against Partick Thistle on Wednesday.\n\"They are in the squad and we will see if they start the game or be on the bench,\" Deila said. \"We need all the players we can during this time, we need to be strong squad-wise.\"\nCeltic have won their last six games in all competitions and have not conceded a goal in seven.\nGoalkeeper Craig Gordon is delighted with the team's form but insists the domestic treble is still a long shot.\n\"It's a very difficult thing to do, it's hardly ever been done,\" the 32-year-old said.\n\"Not many teams have managed to do that so we'll just continue trying to win as many games as we can.\n\"It's what we want to do but it's so difficult, we're not setting ourselves any targets, I'm certainly not. I just go into every game and try to win it then see where we are at the end of the season.\"", "url": "https://www.bbc.com/sport/football/31367880"}