{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:00:34", "date_modify": "2025-05-21 04:00:34", "date_publish": "2025-02-01 15:03:44", "description": "Racing 92 announce the departure of head coach Stuart Lancaster with immediate effect to end a difficult time in Paris for the former England boss.", "filename": "sport_rugby-union_articles_cvg8p5j27q3o_1747800034.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/eb1e/live/95e06cf0-e0aa-11ef-a544-6d6714619779.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cvg8p5j27q3o_1747800034.html", "title": "Stuart Lancaster departs Racing 92 after difficult run", "title_page": "Stuart Lancaster departs Racing 92 after difficult run - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Racing 92 have announced the departure of head coach Stuart Lancaster with immediate effect to end a difficult time in Paris for the former England boss.\nThe 55-year-old joined Racing in 2023 and leaves after failing to qualify for the knockout stages of the Investec Champions Cup, with the French side 12th in the Top 14 after nine league defeats.\nFormer Racing prop Patrice Collazo, who was previously involved with the club as an academy coach, will take over until the end of the season.\nIn a statement, Racing said: \"Racing 92 and Stuart Lancaster have decided to end their collaboration with immediate effect.\n\"Racing 92 thanks Stuart Lancaster and wishes him the best for his future. For his part, Stuart wishes Racing 92 the best for the end of this season and for future seasons.\"\nLancaster was in charge of England from 2011-2015 before his move to Leinster in 2016, where he endured a successful spell as senior coach under director of rugby Leo Cullen, winning the Champions Cup in 2018.\nHe recently responded to \"false\" reports, external linking him to the vacant Munster head coach role and a return to Ireland.\nLancaster recruited former England captain Owen Farrell and 22-year-old wing Henry Arundell, who scored five tries for Steve Borthwick's side at the 2023 Rugby World Cup, to Racing.\nThe Parisians finished sixth in Lancaster's first Top 14 season and were defeated in the last 16 of the Champions Cup by champions Toulouse.", "url": "https://www.bbc.com/sport/rugby-union/articles/cvg8p5j27q3o"}