{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:45:44", "date_modify": "2025-05-20 13:45:44", "date_publish": "2023-07-25 11:51:11", "description": "Liverpool: What to do about Fabinho and Henderson exits?", "filename": "sport_articles_cn06e5l2g01o_1747748744.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2b86/live/da7cb180-2abb-11ee-b1d7-8fdc93c2782e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cn06e5l2g01o_1747748744.html", "title": "Liverpool: What to do about Fabinho and Henderson exits?", "title_page": "Liverpool: What to do about Fabinho and Henderson exits? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Liverpool fan and season ticket holder Iain Christie discussing the impact of Fabinho and Jordan Henderson's potential exits on BBC Radio Merseyside's The Red Kop podcast: \"I'm not confident.\n\"I think a lot of what Liverpool have done well in the past is planned and gone 'OK this guy's going to go so six months in advance we're talking to this club, we've got a fee agreed'.\n\"You saw it with (Alexis) Mac Allister. They're the type of signings we've been making for the last five years.\n\"But this hand grenade of Fabinho and Henderson going all within a week - I think one or both of them would have been starting against Chelsea. These aren't squad players, these aren't players that we're easing out.\n\"I don't think we were going to be looking to do this defensive midfield business until next season.\n\"Now you've got players who we're looking at and linked with - the strongest links being with (Romeo) Lavia and (Khephren) Thuram. If you were the club selling those players you'd sit there and go 'alright that's another £10m, £20m, how much do you want them?'\n\"Suddenly Liverpool have found themselves in that position and the only way out is to wait the clubs out.\"\nGet Liverpool news and fan views sent direct to your phone", "url": "https://www.bbc.com/sport/articles/cn06e5l2g01o"}