{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:44:56", "date_modify": "2025-05-20 14:44:56", "date_publish": "2023-07-27 21:05:21", "description": "Chris McQueen scores a crucial try as Huddersfield keep their faint Super League play-off hopes alive with victory over Hull FC.", "filename": "sport_rugby-league_66301479_1747752296.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/CB61/production/_130556025_b63462b69432921e0954db9b902ece8a25e16e29.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-league_66301479_1747752296.html", "title": "Super League: Huddersfield 19-12 Hull FC - Giants keep faint play-off hopes alive with tense win", "title_page": "Super League: Huddersfield 19-12 Hull FC - Giants keep faint play-off hopes alive with tense win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Huddersfield Giants kept their faint Super League play-off hopes alive as Chris McQueen's try broke the deadlock against fellow hopefuls Hull FC.\nThe forward scored the only try of a tense second half, with Oliver Russell's drop-goal securing the win.\nThat made it three consecutive wins for the Giants for the first time this season, and denied Hull their own hat-trick of victories.\nHull were also eyeing the chance to boost their own play-off chances.\nA victory would have moved them level with sixth-placed neighbours Hull KR.\nThey had led through Adam Swift and Brad Fash tries in the first half after Jermaine McGillvary had given the home side the lead, but Tui Lolohea levelled the scores before half time.\nBoth sides went into the game in form, Huddersfield having eased away from relegation fears and Hull having chalked up seven wins in their previous ten games.\nIan Watson's side were off to a fine start as Jake Connor's 40/20 kick gave them good field position from which the full-back sent winger McGillvary bouncing over for his 249th career try.\nThat sharp start turned sour as Hull scored twice in five minutes and then McGillvary limped off with a hamstring injury.\nJake Clifford's break opened up the Giants defence for Jordan Lane to send Swift over, and then sloppy defending allowed Brad Fash to dart underneath the posts.\nHuddersfield levelled the scores at the break as Russell's excellent high kick sparked a foot race between Hull full-back Davy Litten and Lolohea, with the latter getting the scoring touch.\nThe second half was tight, with discipline key, and when Jake Trueman was penalised for a silly offence at the play-the-ball, knocking the ball from Sam Halsall's hands, it led directly to the defining moment of the game.\nChris Hill had been driving Huddersfield forward relentlessly, but then he showed his ability with a deft pass that sent McQueen racing over.\nRussell, whose kicking was impeccable, added the extras and then calmly dropped the ball between the posts to ensure Hull needed two scores.\nHuddersfield head coach Ian Watson:\n\"We're just focusing week by week. We have to look at every single game coming up. It will be no different for Castleford next week. I've always had trust in the group.\n\"Both teams were a bit nervous, or looked nervous. The start of the game was really intense. A few weeks back we would have lost that game, but the grit we showed was outstanding.\n\"Both teams were desperate to get the win, we stuck in it to get the win. It was a great result. We had to adapt.\n\"We spoke at half-time because there was a couple of things they were doing on the edges to get one-on-ones.\n\"Jermaine [McGillvary] looks like he's done his hamstring, which isn't great. Hopefully we've caught it and it's not as bad as we think.\"\nHull FC coach Tony Smith told BBC Radio Humberside:\n\"Defensively we were OK, apart from a couple of little blips that cost us a little bit, but in offence we weren't.\n\"We had a little ten-minute period where we might have got carried away with ourselves and thought we were just going to put on some support plays and run through the middle of them because we scored a couple of tries like that.\n\"We didn't, and there wasn't much resemblance to what we've practised through the week in the way that we played. It looked a bit panicky, unplanned and off-the-cuff.\n\"It wasn't pretty to watch. I don't think either team ripped it up.\n\"We are patching a few people up and lost two centres tonight. Cameron Scott was cramping up and couldn't keep going, and Liam Sutcliffe has a compound fracture - he looked down and noticed the bone was sticking out, and calmly got the attention of the physio and got himself off the field.\n\"But that wasn't why we didn't win. We just weren't composed and were a bit all over the place.\"\nHuddersfield: Connor; Halsall, Bibby, Naiqama, McGillvary; Russell, Lolohea; Hill, Milner, Wilson, Cudjoe, McQueen, Yates.\nInterchanges: Peats, Greenwood, Hewitt, English.\nHull FC: Litten; Swift, Sutcliffe, Scott, McIntosh; Trueman, Clifford; Fash, Houghton, Sao, Lane, Savelio, Cator.\nInterchanges: Dwyer, Lovodua, Satae, Taylor.", "url": "https://www.bbc.com/sport/rugby-league/66301479"}