{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:27:04", "date_modify": "2025-05-21 07:27:04", "date_publish": "2025-05-20 19:16:44", "description": "Celtic: Kasper Schmeichel urges fans to 'never take success for granted'", "filename": "sport_articles_c1j55wgjw1xo_1747812424.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0bcf/live/d31cc780-35a5-11f0-bb51-b172ed46873e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c1j55wgjw1xo_1747812424.html", "title": "Schmeichel urges fans to 'never take success for granted'", "title_page": "Celtic: Kasper Schmeichel urges fans to 'never take success for granted' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Kasper Schmeichel has urged Celtic fans to never take success for granted as they aim to win a sixth domestic treble in nine seasons.\nVictory over Aberdeen in the Saturday's Scottish Cup final would make it 22 trophies out of 27 since Brendan Rodgers first arrived at Celtic Park in the summer of 2016.\nThe Parkhead side won a 13th Scottish Premiership title in 14 seasons this term and lifted the trophy in front of a jubilant home crowd at the weekend.\nHaving defeated Rangers on penalties in a dramatic League Cup final in December, Celtic can seal another clean sweep by beating the Dons in their final game of the season at Hampden.\nDenmark keeper Schmeichel told Celtic's official podcast: \"We must never, ever take these for granted, because it's not easy winning trophies or titles.\n\"Celtic have been able to do it because we have maintained an incredibly high standard of professionalism that's rooted deeply in hard work and dedication. Without that, it's not going to happen.\n\"So one thing I always would preach to anybody, any football fan, is to never take for granted the opportunity and never take for granted how much hard work goes into getting those opportunities.\n\"There are big clubs that go through big periods of transition, so you must never take these things for granted.\n\"We've got to enjoy them because you never know what's around the corner. But one thing I can guarantee, from my knowledge of the people in this building, is that no-one's going to let up.\"", "url": "https://www.bbc.com/sport/articles/c1j55wgjw1xo"}