{"authors": ["Nizaar Kinsella", "www.facebook.com"], "date_download": "2025-05-21 07:09:16", "date_modify": "2025-05-21 07:09:16", "date_publish": "2025-01-13 22:06:30", "description": "Bayern Munich's 19-year-old winger Mathys Tel is a target for the Blues during the January transfer window with the German side interested in Chelsea forward Christopher Nkunku.", "filename": "sport_football_articles_cedn92yp062o_1747811356.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7aed/live/9cae42f0-d1fa-11ef-9fd6-0be88a764111.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cedn92yp062o_1747811356.html", "title": "Chelsea make enquiry for Bayern Munich winger Mathys Tel", "title_page": "Chelsea make enquiry for Bayern Munich winger Mathys Tel - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Chelsea have made an enquiry to sign Bayern Munich winger Mathys Tel amid interest from the German side in their forward Christopher Nkunku.\nThe Blues, who first expressed an interest in Tel in the summer, have told Bayern they are willing to make an offer for the 19-year-old should he become available.\nHowever, they have not offered Nkunku in a swap deal despite knowing that Bayern have had a longstanding interest in the 27-year-old France international, who joined Chelsea from German club RB Leipzig for £50m in 2023.\nIt isn't known how likely Chelsea's approach is to succeed given Tel is under contract until 2029 at the Allianz Arena – or whether the winger would try to force through a move to Stamford Bridge.\nHe has started just two Bundesliga games under new manager Vincent Kompany, who last summer left his role as Burnley boss to take over at Bayern.\nChelsea are also interested in signing Crystal Palace centre-back Marc Guehi but could wait until the summer when the England international will have just one year left on his current deal.\nBlues manager Enzo Maresca has openly admitted to admiring Guehi's talents while also saying Ben Chilwell, Carney Chukwuemeka and Cesare Casadei can leave the club this month.", "url": "https://www.bbc.com/sport/football/articles/cedn92yp062o"}