{"authors": ["James Law", "www.facebook.com"], "date_download": "2025-05-19 14:55:04", "date_modify": "2025-05-19 14:55:04", "date_publish": "2017-07-04 14:55:39", "description": "Sprinter Cameron Chalmers turns down a spot at the London Anniversary Games to rest before the European Under-23 Championships.", "filename": "sport_athletics_40493397_1747666504.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/11787/production/_96395517_cameronchalmers_gettyimages-634709954.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_athletics_40493397_1747666504.html", "title": "Cameron Chalmers turns down London Anniversary Games 400m place", "title_page": "Cameron Chalmers turns down London Anniversary Games 400m place - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cameron Chalmers says he turned down a 400m spot at this weekend's London Anniversary Games to rest before next week's European Under-23 Championships.\nThe 20-year-old, from Guernsey, came third at the British trials on Sunday to boost his World Championship hopes.\nIt has been a breakthrough season for Chalmers, who initially planned to run at the Island Games before pulling out.\n\"I actually got a phone call yesterday offering me a lane which I turned down, as crazy as that sounds,\" he said.\n\"If you're running at the Olympic Stadium, there's potentially a bit of money there as well and it would definitely have been the highest level race I've ever done in my life.\n\"But it's just the wrong timing, to put it plainly. I've run half-a-second quicker than I thought I would [this season] and that's suddenly opened a lot of doors, so I'm a victim of my own success a little bit.\"\nChalmers, who only started in the sport four years ago, ran 46.11 seconds at the 400m trials in Birmingham, just short of his personal best time of 45.64 seconds, set in June.\nHe missed out on automatic qualification for next month's World Championships in London, but hopes to figure as part of Great Britain's 4x400m squad.\n\"If they take five, six or seven athletes then, based off my performance, I'm definitely in the mix to be considered for that,\" he added to BBC Sport.\n\"But it's really out of my control now. I'll just have to wait and see whether I'm picked for that.\"", "url": "https://www.bbc.com/sport/athletics/40493397"}