{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:28:42", "date_modify": "2025-04-26 07:28:42", "date_publish": "2025-02-27 18:28:57", "description": "Jenson Button says he just \"wants to win a race\" in 2025 as he prepares to start his second World Endurance Championship (WEC) season.", "filename": "sport_motorsport_articles_c04zzq1r3qyo_1745652522.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7b67/live/3faf0660-f5dc-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_motorsport_articles_c04zzq1r3qyo_1745652522.html", "title": "Jenson Button: Former F1 champion aims to win on World Endurance Championship return", "title_page": "Jenson Button: Former F1 champion aims to win on World Endurance Championship return - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Jenson Button says he just \"wants to win a race\" in 2025 as he prepares to start his second season racing in the World Endurance Championship (WEC) this weekend.\nThe 2009 Formula One world champion begins the long-distance championship's eight-race campaign at the Qatar 1812km on Friday.\nHe is again racing for British outfit Hertz Team Jota in the top hypercar class, the team now affiliated with Cadillac for the first time after running Porsche engines last season.\n\"Jota has won a race every year it's competed in WEC, so that's pretty, pretty impressive - I think we need to continue that trend,\" Button told BBC Radio Somerset.\n\"Every driver will say they want to win [the 24 Hours of] Le Mans and that's top of the bucket list. I just want to win a race.\n\"When you stand on the top of that podium and you know the talent that you've been up against in terms of drivers, manufacturers, teams, it's a very impressive feat - so that has to be the aim and there's no reason why we can't.\n\"We have no excuses. The car's good. I think the team of people we have are good.\"\nButton finished 19th in the 2024 drivers championship, with his best result sixth at the Six Hours of Fuji race in September, while he was also ninth at Le Mans.\nDespite missing one of the pre-season practice sessions due to a bout of bronchitis, Button said he has \"got to grips reasonably quickly\" with the new car.\nThere are also advantages to being in a manufacturer's team which the 45-year-old believes will give Jota more of an edge this year.\n\"You feel the difference and I think it's because when you have an issue you can work with the tools a lot more because it's obviously all open,\" Button said.\n\"Whereas last year we were limited on what we can actually do and certain things we just could not change because we weren't allowed to.\n\"It's what [Porsche] Penske basically chose and we went with it whereas here it's a lot more open and there's a lot more adjustability and things get done a lot quicker.\n\"I think it's a lot easier to make progress and find comfort in the car.\"\nLast year was Button's first full season of racing since 2019 when he competed in Japan's Super GT Championship. While getting back into driving was not an issue, adjusting to the complex systems in the cars was the biggest learning curve.\n\"It's not [a case of] you set it up and then you just drive it,\" Button said.\n\"It was understanding the tools and they can make a massive difference to how the car feels and you can really benefit if you understand those tools.\n\"This year it's been a lot easier. It's obviously different systems but a lot of the stuff does the same.\"", "url": "https://www.bbc.co.uk/sport/motorsport/articles/c04zzq1r3qyo"}