{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:53:19", "date_modify": "2025-04-26 06:53:19", "date_publish": "2025-03-01 00:00:00", "description": "Champions Wigan Warriors score eight tries in an impressive 48-24 victory over Warrington Wolves in the first Super League game to be played in the United States.", "filename": "sport_rugby-league_live_clyn9w44d20t_1745650399.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-league_live_clyn9w44d20t_1745650399.html", "title": "Super League: Wigan Warriors earn impressive win over Warrington Wolves in Las Vegas", "title_page": "Super League: Wigan Warriors earn impressive win over Warrington Wolves in Las Vegas - as it happened - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "One down, three to go\nFT: Wigan 48-24 Warrington\nWell then, what a night this is shaping up to be.\nA scintillating 80 minutes saw Wigan coast to victory against and off-the-pace Warrington.\n12 tries and not a single missed kick made for some strong entertainment.\nBut the fun doesn't stop there.\nI'll be back at just before 02:00 GMT to take you through England Women v Australia Women.\nFor now though, thank you for joining us.\n'Rugby league has to have a presence in Las Vegas'\nFT: Wigan 48-24 Warrington\nWigan Warriors boss Matt Peet told Sky Sports:\n\"Both teams tried to play some open rugby.\n\"This group rises to the big occasion and they enjoyed the privilege.\n\"There elements in the second half I was disappointed with but we would have taken this [result] before the game.\n\"I'm very proud of the team and how they've handled it.\n\"As a competition we have to have a presence here. There's so many eyes on the sport and so many relationships being made. Those might be business ones or fan ones but it's so important to be part of it.\"\n'We put on a performance on the big stage'\nFT: Wigan 48-24 Warrington\nWigan Warriors forward Junior Nsemba told Sky Sports:\n\"I feel like the team put on a performance on the big stage. We've been practising it all week. We appreciate all the fans for coming over too, it's a long way to Vegas.\n\"I thought I did alright. I had a good performance on the pitch but that goes back to my teammates.\n\"We gave away points that we didn't want to concede and that's something we've got to work on.\"\n'It's ticked a lot of boxes'\nFT: Wigan 48-24 Warrington\nKevin Brown\nFormer England international on BBC Radio 5 Sports Extra\nOne of the noticeable things for me was how quick the game was. We often reflect on games and say we need to speed the ruck up.\nI don't know if it was by design or the occasion but that was just so much easier to watch because it was quick. It was quick from minute one and got quicker and quicker and we had 70 points scored.\nAs a rugby league fan, I would rather have a game like that every day of the week than a 0-0.\nRegardless of who you support or what you want to see, it's ticked a lot of boxes. Vegas is a place that's about entertainment and there's nothing more entertaining that watching Bevan French or Matty Ashton go the length of the field and showing the athletic prowess they have.\n'The scoreline shows how tough it was'\nFT: Wigan 48-24 Warrington\nWigan Warriors half-back Bevan French told Sky Sports:\n\"The scoreline probably represents how tough it was out there. We made it clear we wanted to be entertaining as it's the first time that Super League has the platform to be here.\n\"Both teams have done that and hopefully they've set the platform to have us back next year and do it again.\n\"We're not used to this type of weather at this time of year in Super League so we had to take it up a notch.\"\nPost\nFT: Wigan 48-24 Warrington\nKevin Brown\nFormer England international on BBC Radio 5 Sports Extra\nIt you had given Matty Peet that scoreline before the game he would have snapped your hand off.\nFrom half-time, I think he will have been disgusted by Wigan's defence and the number of points they have leaked but credit to Warrington, they didn't give up and they put some smiles on Warrington fans' faces who had gone all that way and supported they side.\nFull time\nWigan 48-24 Warrington\nAnd that late try brings down the curtain on this historic Super League fixture in Las Vegas.\nWigan were mightily impressive and register a second successive win and consign Warrington to a first defeat of the season.\nAt times it looked like a bleak night's work for Warrington as Wigan had raced into a 42-0 lead.\nA strong final showing from Sam Burgess' side sees them break the 20-point barrier to restore some pride - but for large parts of that game they looked well off the pace.\nTRY: Wigan 48-24 Warrington\nMatty Ashton, goal Josh Thewlis\nHaha, I love rugby league.\nThis game has been bonkers and now Warrington's Matty Ashton intercepts and runs in from almost 100 metres - the last 10 or so comes with just one boot having lost it in the build up.\nJosh Thewlis adds an impressive kick and Warrington finish with 24 points to their name when not so long ago it looked like they might be on the receiving end of a chastening nilling at the hands of Wigan Warriors.\nTRY: Wigan 42-18 Warrington\nMatty Dufty, goal Josh Thewlis\nMatty Dufty's try is given. It comes after a fantastic pass from Oli Leyland in the build-up and he does all the hard work needed to crash over the line with four Wigan men trying to hold him up short of the line.\nJosh Thewlis adds the two.\nIn all honesty I'm not sure why that needed to be reviewed but it's given, anyway.\nPost\nWigan 42-12 Warrington\nPaul Rowley\nSalford Red Devils head coach on BBC Radio 5 Sports Extra\nI think Wigan have put their cue on the rack in the last 10 minutes, the intensity of their performance has dropped considerably.\nWarrington haven't needed asking twice, they've ramped up in their strength of carrying and have had a lot of field position in the last 10-15 minutes.", "url": "https://www.bbc.co.uk/sport/rugby-league/live/clyn9w44d20t"}