{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:47:56", "date_modify": "2025-04-26 03:47:56", "date_publish": "2025-03-05 15:24:07", "description": "Huddersfield Town owner Kevin Nagle calls on supporters to stick with the side despite indifferent recent form.", "filename": "sport_football_articles_cn52kv4l72po_1745639276.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ceae/live/46d0d990-f9d4-11ef-adf5-bddd64abc471.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cn52kv4l72po_1745639276.html", "title": "Kevin Nagle: Huddersfield owner calls on fans to stick with side", "title_page": "Kevin Nagle: Huddersfield owner calls on fans to stick with side - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Huddersfield Town owner Kevin Nagle has called on supporters to stick with the players despite indifferent recent form.\nThe Terriers have won just four of their past 14 League One games and have failed to score a goal in any of their past six home matches.\nMichael Duff's side are now sixth in the table, one point above seventh-placed Bolton but having played a game more.\n\"We're in the play-off positions and we need to support the club and the players. We don't need to boo them,\" Nagle told BBC Radio Leeds before Tuesday's 1-0 home defeat by Wrexham.\n\"Boo them if they're not giving it 100% but we haven't seen that yet.\n\"These are players who are sensitive as well and the manager has had one of the longest [unbeaten] runs on record this season. We have to remember that.\"\nTown, who were relegated from the Championship last season, went on a run of 16 league games without defeat from 1 October until a 1-0 home reverse by Bolton on 25 January.\nAmerican businessman Nagle recently responded to critical fans on social media but said that many of the people complaining about how the team is performing are \"keyboard warriors\".\n\"I saw the fans' frustration and I understand that. I wanted them to see I wasn't ignoring them,\" he said.\n\"I put it all in perspective, what percentage of the universe are on X? It's a small number and they tend to be very active and they're keyboard warriors.\n\"I know the greater audience is a little bit more patient.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cn52kv4l72po"}