{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:32:32", "date_modify": "2025-05-19 15:32:32", "date_publish": "2017-07-03 17:44:34", "description": "Centuries from Jimmy Adams and James Vince give Hampshire control on day one of their Division One match against Surrey.", "filename": "sport_cricket_40455626_1747668752.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/61B1/production/_96790052_gettyimages-806242994.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_cricket_40455626_1747668752.html", "title": "Surrey v Hampshire: Jimmy Adams and James Vince hit centuries for away side", "title_page": "Surrey v Hampshire: Jimmy Adams and James Vince hit centuries for away side - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jimmy Adams and James Vince struck centuries to put Hampshire in control on day one against Surrey at the Oval.\nThe duo both hit their second County Championship tons of the season as they put on 161 runs for the third wicket.\nVince took the aggressive role, hitting 19 boundaries to reach his 100 from just 121 balls before Tom Curran (2-71) had him caught behind for 104.\nGeorge Bailey (61 not out) and Adams put on 129 before Adams was bowled in the last over, leaving Hampshire 361-4.\nIt was a near-perfect innings from left-hander Adams, who hit 19 fours and two sixes, offering no chances until he was dismissed by a full ball - the 262nd he faced - from off-spinner Amar Virdi.\nHampshire won the toss but lost Lewis McManus, opening because of Liam Dawson's England Test call-up, for 13 when he was bowled by an inswinging yorker from Sam Curran.\nRilee Rossouw, on a terrible run of form, made 28 but edged Tom Curran to second slip, before Vince took centre stage, scoring fluently through the offside, with 76 of his 104 runs coming from fours.\nBailey then played a well-judged support role for Adams, getting Hampshire past the new ball before Adams' dismissal with five balls left brought stumps.", "url": "https://www.bbc.com/sport/cricket/40455626"}