{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:17:42", "date_modify": "2025-05-21 04:17:42", "date_publish": "2025-04-05 17:01:38", "description": "Ipswich 1-2 Wolves: What Kieran McKenna said", "filename": "sport_football_articles_cy0xpggl714o_1747801062.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy0xpggl714o_1747801062.html", "title": "Ipswich 1-2 Wolves: What Kieran McKenna said", "title_page": "Ipswich 1-2 Wolves: What Kieran McKenna said - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ipswich boss Kieran McKenna has been speaking to Premier League Productions about the home defeat: \"We are gutted, it's very sad in the dressing room. The players put everything in and we weren't able to find enough in the second half to get the result we wanted.\n\"The first half wasn't a beautiful game, but we had great energy and scored the goal. The second half energy played a part. There are players who pushed really hard to get out on the pitch on Wednesday, so to go again today was difficult. Energy was a challenge.\n\"They are a strong opponent who bring on good substitutes and put pressure on. I thought we had ridden it out. You can call it lucky, a high quality substitute that changed the game and gave all the energy to them, but we weren't able to find anything else.\n\"We know where we are at. I can't ask for more from many of the players - they have given everything. A lot have come on the journey from League One. A lot of them have performed really well and done themselves proud.\n\"We know the strength of the league and we know opponents can bring on top international talent off the bench.\"\nOn the motivation in the squad: \"It can't change too much for us. Today is a sad day and if we had got the win today, it would have felt good.\n\"We know we are probably going to fall short. We play Chelsea, Newcastle and we have some good games coming up. I don't think motivation will be an issue.\n\"We'll take a day or two to get over this one and try to deliver a performance to be proud of in the coming weeks.\"", "url": "https://www.bbc.com/sport/football/articles/cy0xpggl714o"}