{"authors": ["Andrew Benson", "www.facebook.com"], "date_download": "2025-05-21 04:11:31", "date_modify": "2025-05-21 04:11:31", "date_publish": "2025-04-06 11:19:02", "description": "Max Verstappen won in Japan with a weekend of the sort of rare perfection that comes only from drivers of the very highest quality, says Andrew Benson.", "filename": "sport_formula1_articles_c4g479ewwx2o_1747800691.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/302a/live/cce4de70-1309-11f0-bb1f-752fc4c9ccf8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_formula1_articles_c4g479ewwx2o_1747800691.html", "title": "Japanese Grand Prix: Max Verstappen steals Suzuka with McLaren stuck in 'rabbit hole'", "title_page": "Japanese Grand Prix: Max Verstappen steals Suzuka with McLaren stuck in 'rabbit hole' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Max Verstappen stole the Japanese Grand Prix from McLaren with a weekend of the sort of rare perfection that comes only from drivers of the very highest quality.\nVerstappen's Red Bull was not the fastest car around Suzuka, but the four-time champion converted his stunning pole position on Saturday into his fourth consecutive win at the track.\nHis drive on Sunday - under pressure from the McLarens all race, albeit knowing that overtaking was next to impossible in cars with relatively closely matched performance - was flawless.\nBut his weekend was made with a qualifying lap that drew superlatives from all over the F1 paddock.\nVerstappen's engineer Gianpiero Lambiase described it as \"insane\". Aston Martin driver Fernando Alonso, a friend and fan of Verstappen, said it was \"magical\" and that \"only he can do that\". Verstappen himself called it \"very rare\".\nIt gave Verstappen pole from McLaren's Lando Norris by just 0.012 seconds. Knowing that if he retained the lead at the start, the race was a long way to being won, Verstappen did exactly that.\nWith overtaking so difficult, McLaren's one chance to beat him was by stopping Norris for fresh tyres before Verstappen.\nBut they did not take that opportunity, and once Verstappen won the race out of the pits after he and Norris stopped on the same lap, all he had to do was keep it clean and mistake-free. The McLarens were always there, right behind, ready to pounce on any error. But Verstappen being Verstappen, none came.\nVerstappen's qualifying lap \"came out of nowhere\", Red Bull motorsport adviser Helmut Marko told BBC Sport.\n\"First corner - unbelievable the speed he was going in,\" Marko said. \"It's like his body doesn't feel G-forces. When the car is to his liking, he can drive 110%. Every corner absolutely on the limit and, like in races, he doesn't make mistakes.\"\nOverlaying their laps, Norris and Verstappen were neck and neck until the final chicane. Verstappen nailed it, Norris lost some time, and pole was decided.\nNorris' team-mate Oscar Piastri, on provisional pole after the first runs in final qualifying, made a mistake early in his last effort, and slipped back to third.\nMcLaren team principal Andrea Stella said: \"I'm sure our two drivers will have commented themselves that their qualifying laps were not the best laps in qualifying in their careers.\n\"Clearly, when Max elevates the game so much, you need to nail laps in qualifying and you need to bring home any possible millisecond.\n\"Yesterday it was indeed a matter of milliseconds, with 43-45 milliseconds between P3 and P1. Ultimately, I think the qualifying laps in Q3 were even more of a determining factor than anything that happened today in the race.\"\nMcLaren's one chink of light in the race was the pit stops. Norris was about 1.5 seconds behind Verstappen as they neared, just about within theoretical range of the 'undercut', where a driver gains a position by stopping first and using the time gained on fresh tyres to be ahead by the time his rival exits the pits.\nBut McLaren were undone by an unfortunate set of circumstances.\nThey 'dummied' a stop with Norris on lap 18, with a fake radio message telling him to pit. Red Bull ignored them.\nThen Mercedes stopped George Russell on lap 19. His pace on new tyres threatened to undercut him ahead of Piastri. And that meant McLaren had to pit Piastri on lap 20 to be sure of retaining his position. Although the McLaren was faster than the Mercedes, the difficulty of overtaking meant they did not believe Piastri would have been able to pass Russell on track.\nThat gave the game away to Red Bull, who realised Norris would come in next time around. So they stopped Verstappen. Keeping Norris out would not have worked - he'd have lost more time on his old tyres. So he had to pit, too.\nEven then, McLaren fashioned a sliver of a chance. Norris' stop was a full second faster than Verstappen's and the Briton was halfway alongside the Red Bull when they exited the pits. But Verstappen was entitled to keep his line, and he did.\nThe narrowing track meant Norris' trajectory took him on to the grass. He had to back off, and the lead stayed with Verstappen.\n\"Maybe we could have tried more with strategy,\" Norris said. \"We'll discuss that.\n\"Could we have gone earlier? Yes. But then you're at risk of safety cars. If you box three laps earlier and the safety car comes out, you look stupid.\"\nStella said it was \"unclear\" whether the undercut would have worked. He said they would \"review\" the data. But on Sunday evening he was not prepared to say that this was a race that got away, as McLaren subsequently said about their strategy choices at Canada and Silverstone last year.\nAlthough the McLaren was the fastest car, other circumstances of Suzuka played against them once Verstappen was on pole.\nTheir car has a tyre-wear advantage and that is traditionally high at Suzuka. Last year, that might have meant their pace advantage would have grown through the stints, creating an overtaking possibility.\nBut the first sector of the lap had been resurfaced and that led to degradation being low, so they had lost one of their theoretical advantages over their rivals.\n\"So, once, for instance, you nail the qualifying laps like Max did yesterday,\" Stella said, \"then it gets a little bit difficult to get out of the rabbit hole.\"\nVerstappen's performance underlined just how significant a threat he remains to the title hopes of McLaren, Norris and Piastri despite Red Bull's somewhat difficult start to the season. Not least because, in what seems to be in ultimate terms the third fastest car in F1, he is now only one point behind Norris in the championship.\n\"I know how good he is,\" Norris said. \"I know what he's capable of doing. So I would say nothing is a surprise any more. But yeah, I still believe that we're going to have some good races and we can go toe-to-toe and that some days he'll come out on top and others I will.\"\nAs for Verstappen, he said his performance over the Japan weekend felt as special to him as it did to those looking in from the outside.\nBut he added: \"It also means I really care even though it has not been the easiest start to the year for us. We are not where we want to be in terms of performance.\n\"This weekend has been just really, really nice. Sometimes you have those kind of moments when you get some really great laps out of it.\"\nBut if the weekend was a reminder to McLaren what they are up against in the shape of Verstappen - and Stella insisted, too, that they still felt a threat from Mercedes and Ferrari, that the season was still in a \"transient phase\" where relative performance was dictated by circuit variability - so also were there warning signs for Red Bull.\nAlonso says that Verstappen's performance at the weekend reminded him of his 2012 season, when he fought valiantly but ultimately unsuccessfully for the title with Ferrari against a much faster Red Bull in the hands of Sebastian Vettel, in what he regards as his finest season.\n\"I have been fighting for world championships with the third, fourth fastest car,\" the Spaniard said. \"So at the end it is difficult, as it was difficult for me to beat Vettel. I hope for him he can fight until the end but they need to improve a little bit the car.\n\"He won four, so he can fight with a little bit less competitive car. It is hard and I think people don't realise how difficult it is, and how you need to make perfect every weekend. And he's doing that so far.\"\nThere is a degree of irony in the fact that Alonso's race engineer at Ferrari at the time was Stella.\n\"Max at the moment is somehow making the difference himself,\" the Italian said, \"but it's very difficult to keep up for 24 events in a season if you don't have the best car.\"", "url": "https://www.bbc.com/sport/formula1/articles/c4g479ewwx2o"}