{"authors": ["Jamie Lyall", "www.facebook.com"], "date_download": "2025-05-19 14:42:18", "date_modify": "2025-05-19 14:42:18", "date_publish": "2017-08-25 13:37:55", "description": "Hibernian head coach Neil Lennon says \"talks are almost concluded\" on a new contract at Easter Road.", "filename": "sport_football_41052071_1747665738.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/14F99/production/_97531958_13701398.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_41052071_1747665738.html", "title": "Neil Lennon: Hibernian head coach close to agreeing new contract", "title_page": "Neil Lennon: Hibernian head coach close to agreeing new contract - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Head coach Neil Lennon is close to signing a new contract at Hibernian.\nFormer Celtic manager Lennon joined the Easter Road club last summer, guiding Hibs back to the Scottish Premiership in his debut campaign.\n\"Talks are almost concluded,\" Lennon, 46, said. \"I'm hoping we can get things announced over the next 24-48 hours.\n\"I'm delighted. Not too sure on [the length of deal] just yet but we'll come out with all the details when the time is right.\"\nLennon says Hibs remain a great fit for him.\n\"I'm very happy with the players that we have and the reaction from the supporters has been fantastic,\" he said. \"I couldn't have asked for any more and I don't see why I shouldn't continue on here.\n\"This is a big city club and I think there's evidence of that already with the gates we're having at home. That appeals to me. My players have also been tremendous in everything I've asked of them and I have a very good relationship with the board.\n\"In terms of satisfaction and enjoyment I get, the excitement I still get, it's all there for me.\n\"I've no ambitions short-term to look elsewhere. I've no need for any distractions and I wouldn't entertain them at the minute either. This club has given me an opportunity to be successful again and I think I owe it to them to give it everything I've got.\"\nHibs' winning return to the top flight was abruptly ended by Hamilton Academical on Saturday, who left Leith with a surprise 3-1 victory.", "url": "https://www.bbc.com/sport/football/41052071"}