{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:08:10", "date_modify": "2025-05-21 04:08:10", "date_publish": "2025-02-09 16:48:24", "description": "Ireland's Test against Zimbabwe in Bulawayo is set for a tense finish on Monday as the hosts need 109 runs to win with only three wickets left.", "filename": "sport_cricket_articles_cx2mdw92dklo_1747800490.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3e36/live/4665e3b0-e705-11ef-9b11-a943219c72d4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cx2mdw92dklo_1747800490.html", "title": "Zimbabwe v Ireland one-off Test: Bulawayo contest set for tense finish", "title_page": "Zimbabwe v Ireland one-off Test: Bulawayo contest set for tense finish - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ireland's one-off Test against Zimbabwe in Bulawayo is set for a tense finish on Monday as the hosts require 109 runs to win with only three wickets remaining.\nRain meant only 53 overs were possible on Sunday's day four as Zimbabwe - chasing 292 for victory - moved from 38-3 to 183-7.\nThe hosts' hopes for victory look likely to mainly rest with Wesley Madhevere who is unbeaten on 61 after his patient knock off 147 balls.\nMadhevere came to the crease after Barry McCarthy bowled Trevor Gwandu with Zimbabwe having only added two runs to their overnight total.\nA 65-run fifth-wicket partnership between Madhevere and Brian Bennett - which came either side of the lengthy rain interruption - boosted the hosts before the latter departed for 45 as Ireland spinner Matthew Humphreys picked up his second wicket.\nMadhevere and skipper Johnathan Campbell (33) then produced another productive 55-run stand which was again broken by Humphreys after he caught and bowled the captain.\nHumphreys' fourth wicket, when he dismissed Nyasha Mayavo with Paul Stirling taking the catch, left Zimbabwe on 173-7 and the hosts added 10 more runs before the close.", "url": "https://www.bbc.com/sport/cricket/articles/cx2mdw92dklo"}