{"authors": ["Scott Read", "www.facebook.com"], "date_download": "2025-04-26 07:39:16", "date_modify": "2025-04-26 07:39:16", "date_publish": "2025-02-27 13:24:41", "description": "Chelsea news: On-loan Burnley defender Bashir Humphreys profiled", "filename": "sport_football_articles_cq8yk97k42po_1745653156.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/854d/live/32452dd0-f445-11ef-9e61-71ee71f26eb1.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cq8yk97k42po_1745653156.html", "title": "Chelsea news: On-loan Burnley defender Bashir Humphreys profiled", "title_page": "Chelsea news: On-loan Burnley defender Bashir Humphreys profiled - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Had you been at Molineux for Bashir Humphreys' Burnley debut at Wolves in the League Cup in August, you would be forgiven for being uncertain of his strongest position.\nHe played left-back, right-back and centre-half in the same game, and he did not look out of place in any of them. However, it is at left-back where he has found his place in what could turn into a record-breaking defensive season.\nIn the Clarets' sequence of 12 consecutive Championship clean sheets, Humphreys has started eight times. Crucially, during this run, he has started all three games against promotion rivals - away to Sheffield United on Boxing Day, and at home against Sunderland and Leeds United.\nHe has also been preferred at left-back in both Lancashire derbies - away games at Blackburn Rovers and Preston North End - a sign of the trust he has gained from manager Scott Parker.\nDuring this run he also scored the second goal of his professional career, finding himself at the edge of the penalty area and finishing confidently against Hull.\nWhen I asked Humphreys about that goal he said: \"I'll be honest, I can't really remember what happened,\" but he did have clearer thoughts on how his game has developed since that versatile display at Wolves. He added: \"At that time I felt like I was playing out of position at full-back but now I feel comfortable there.\n\"There has been a lot of growth for me. I feel like I've got more confidence in that position and it's about experiencing things in game.\"\nHumphreys is looking to become the second-successive left-back on loan from Chelsea to win promotion at Turf Moor, following Ian Maatsen's successful season under Vincent Kompany.\nAnd, just like Maatsen, if the Blues decide they do not need him, he will not be short of suitors.", "url": "https://www.bbc.co.uk/sport/football/articles/cq8yk97k42po"}