{"authors": ["Andy Gray", "www.facebook.com"], "date_download": "2025-05-21 03:36:41", "date_modify": "2025-05-21 03:36:41", "date_publish": "2025-02-06 07:49:39", "description": "Luke Humphries, Stephen Bunting and Luke Littler open up about the realities of being a pro darts player - including travel, schedules and sacrifices.", "filename": "sport_darts_articles_clyzddmz860o_1747798601.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ca4c/live/85aecc60-e3f6-11ef-9fe7-c13d2767f737.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_darts_articles_clyzddmz860o_1747798601.html", "title": "Premier League Darts: What is the reality of being a professional player?", "title_page": "Premier League Darts: What is the reality of being a professional player? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "\"Sometimes the people at home just see you throwing darts and that's it. There's a lot more that goes into it.\"\nThe glamour, fame and financial rewards - there's never been a better time to be involved with darts as the sport continues to grow at a rapid rate.\nBut there's a lot that goes on behind the scenes for players to make it to the top of the game.\nWorld number one Luke Humphries knows first hand the sacrifices that are made.\nSpeaking before the opening night of the 2025 Premier League Darts in Belfast, Humphries said: \"Being in this tournament is in a lot of people's dreams, but it is really tough.\n\"You leave on a Wednesday and come home on a Friday. There's four hours that people are watching you on a Thursday night, but a lot more that goes into it.\n\"There is a lot of travelling and a lot of sacrifice, but we're all really lucky to do what we do. We're getting paid incredibly well, so it's a blessing for us all. We can't complain.\"\nHeading into his second year on the Premier League schedule, 2024 world champion Humphries says he learned a lot about how to pace himself from his first year with the additional matches.\n\"If you're a newbie you won't know what to expect or how to handle things. I think last year will help me,\" he said.\n\"Managing your calendar the best you can, it's so stacked. You physically can't play in everything, it's almost impossible.\n\"I'll keep myself very busy throughout the year and I'll be careful in how I pick and choose what tournaments I miss to make sure I don't burn myself out.\"\nFor Stephen Bunting, playing in the Premier League has been worth the wait.\nAfter making his debut in the competition in 2015 after making the switch to the PDC as reigning BDO world champion, Bunting will feature for a second time 10 years on.\n\"I did fall out of love with it when my form wasn't good and things weren't going right,\" said Bunting, who \"didn't always believe\" he could return to the Premier League.\n\"There is peaks and troughs in everyone's career. To pick myself up from where I was, in the doldrums and really thought about walking away from the sport, to where I am now - world number five, the way I'm playing with confidence - it's all positive.\n\"It's all a big deal to me and I'm enjoying the ride.\"\nBunting may be a fans' favourite, but it's not just his popularity that has seen him regain his place in the Premier League.\nAfter a resurgent 2024, the 39-year-old reached the World Championship semi-finals, won the Bahrain Masters and now sits at a career-high fifth in the world. That progress isn't something that happened overnight.\nAs well as practising with Humphries before the World Championships, Bunting has been open about his work with a sports psychologist and hypnotist to help him improve his game.\n\"I believe that has been a massive help to get where I am today,\" he added.\n\"I've worked really hard over the past few years to push my profile and push myself back into the top 10 in the world.\n\"It was always important to me to play in the Premier League.\n\"If I had never have played in it again I could have said I gave it a good go, but now I'm relishing each and every week I'm going to be playing in the Premier League.\"\nWhile playing in the Premier League brings extra commitment, Bunting says having his wife, Keila, and son, Tobias, at events helps deal with the extra pressures.\nIn his words, \"it's like a night out\" for the family.\n\"You always hear people moaning about travelling and stuff, but if you're at home you're not earning money,\" he added.\n\"There are only eight of us so you're really privileged to be part of that, so if that means walking to the end of the earth to play in the Premier League, it's so important to me to be in that.\n\"I want to be in this as a regular for years to come and want to have a long career. To get the best out of it I need to be as dedicated as I can be.\"\nWhile Humphries has talked about the sacrifices made in professional sport, world champion Luke Littler has a unique experience of being involved in the Premier League as a teenager.\nWhile Littler, who turned 18 at the end of January, is riding the crest of an ever-growing wave, it means his life is far removed from the traditional teenager as he focuses on his darts career.\n\"It's just a case of missing out on things,\" said Littler, who relaxes away from the oche by gaming.\n\"I go out with my friends when I do come home. I'll always make time for it.\n\"They could be out near enough every night but I'm playing for tens of thousands of pounds, and that's what I want to do.\n\"I'm used to it all now. I'm used to the travelling and I'm used to the Premier League format.\n\"I've done it once before and I'm definitely going to do it for many more years.\"\nYou can follow live text commentary from each Premier League match day on the BBC Sport website.", "url": "https://www.bbc.com/sport/darts/articles/clyzddmz860o"}