{"authors": ["Rob Staton", "www.facebook.com"], "date_download": "2025-05-21 06:14:18", "date_modify": "2025-05-21 06:14:18", "date_publish": "2025-04-01 11:00:49", "description": "BBC Radio Sheffield's Rob Staton says patience is running out at Sheffield Wednesday after March's wages were not paid on time.", "filename": "sport_football_articles_cr5d4zp33pyo_1747808058.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8c0a/live/11e4f980-0edf-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cr5d4zp33pyo_1747808058.html", "title": "BBC Radio Sheffield's Rob Staton says patience is running out at Sheffield Wednesday", "title_page": "BBC Radio Sheffield's Rob Staton says patience is running out at Sheffield Wednesday - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A growing number of fans are angry and demanding answers after it emerged that, not for the first time during Dejphon Chansiri's reign as Sheffield Wednesday owner, the players have not been paid on time.\nMany are asking why the club sells season tickets in an early-bird window before Christmas, yet in March, there isn't enough money to even pay wages?\nA statement claims it's down to \"significant sums of money\" being owed to Chansiri's other businesses, \"impacting immediate cashflow\".\nHowever, you get the sense patience for a lot of people has run out.\nThe Owls were placed under a second registration embargo in 12 months by the EFL last November over amounts owed to HM Revenue and Customs. Now this.\nHow financially sustainable is this club? What exactly is the future of Sheffield Wednesday? These are questions that need to be answered with more than just a statement. Fans are worried and some will feel embarrassed. They deserve answers.\nThis latest admittance will lead to growing calls for Chansiri to sell the club.\nThe Owls might be five points off the play-offs but they lack the solid base that typically accompanies teams challenging for the top flight. Fans dream of a Premier League return after 25 years but it's not realistic in this environment. The club is a long way off in terms of infrastructure and finances.\nIt's the latest reason why a talented young manager in Danny Rohl, the club's greatest asset, may leave amid reported interest from elsewhere.", "url": "https://www.bbc.com/sport/football/articles/cr5d4zp33pyo"}