{"authors": ["Adwaidh Rajan", "www.facebook.com"], "date_download": "2025-04-26 07:47:46", "date_modify": "2025-04-26 07:47:46", "date_publish": "2025-02-26 23:31:01", "description": "Brentford has goalkeeper Mark Flekken to thank after salvaging a 1-1 draw against visitors Everton in the Premier League on Wednesday.", "filename": "sport_football_articles_cq8yyx2g77no_1745653666.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7792/live/b2f75f50-f497-11ef-839b-6909acee4532.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cq8yyx2g77no_1745653666.html", "title": "Brentford 1-1 Everton: Mark Flekken saves the blushes for Thomas Frank's side", "title_page": "Brentford 1-1 Everton: Mark Flekken saves the blushes for Thomas Frank's side - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Brentford had goalkeeper Mark Flekken to thank after salvaging a 1-1 draw against visitors Everton in the Premier League on Wednesday.\nThe result meant Thomas Frank's side fell eight points behind fifth-placed Chelsea but it could have been worse for the Bees if not for their Dutch shot-stopper.\nWith the hosts failing to find a breakthrough at the other end, Everton had two gilt-edged chances to take the lead in the first half.\nOn both occasions, Beto went one-on-one with Flekken with the keeper emerging on top both times to keep the score level before Yoane Wissa pulled Frank's side ahead in the first-half stoppage time.\nThe 31-year-old keeper also showed good reflex to keep out Jack Harrison's inswinging corner at the start of the second period.\nHe also denied the Toffees a victory in the closing stages, once again advancing off his line to deny Beto in the 88th minute.\n\"We should give big credit to Mark because we still got the draw with three one-on-ones for Beto and he saved it,\" Wissa told TNT Sports after the game.\n\"We could have lost today but we didn't.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cq8yyx2g77no"}