{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:04:45", "date_modify": "2025-05-21 04:04:45", "date_publish": "2025-01-09 00:00:00", "description": "Rangers' away woes in the Scottish Premiership continue as they are held by Dundee to extend their winless run on the road to four matches.", "filename": "sport_football_live_c5yxnx22285t_1747800285.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c5yxnx22285t_1747800285.html", "title": "Dundee 1-1 Rangers: report, reaction & stats", "title_page": "Dundee 1-1 Rangers: report, reaction & stats - BBC Sport Scottish Premiership coverage - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "There were a lot of fantastic performances for Dundee, but Adewumi was the best player on the pitch.\nHis goal was a deceptively difficult one to convert as it sat up off the turf, but the Burnley loanee made it look simple with a swipe of his right boot.\nHe was in the right place at the right time to tap home another, which might have won it but for Murray being a bit too keen to run on to Josh Mulligan's pass.\nAdewumi also had another fierce shot saved by Liam Kelly, and right at the end he was back in his own box shielding the ball out of play to get the result over the line.\nMulligan's running power was so effective on the break for Dundee as well, and he reacted quickest in the box to pounce on Scott Tiffoney's deflected strike and cross for Adewumi's goal.\nWith 10 players out injured - including star man Lyall Cameron - this was an impressive result and performance from Tony Docherty's side.\nIt is remarkable that Rangers were nine points behind Celtic on Christmas Day, beat their rivals 3-0 on 2 January and are now 15 points behind them.\nThe reason for that is their shocking away form, with defeat by St Mirren now added to by draws at Motherwell, Hibernian, and Dundee since Santa Claus visited.\nThirteen points and 13 goals in 11 matches on the road is nowhere near good enough for a club of Rangers' resources.\nAnd that is despite recent injuries which resulted in 20-year-old Clinton Nsiala playing his first senior game and left-back Ridvan Yilmaz continuing at right-back.\nThe most frustrating thing for Rangers fans is how often their side end up chasing away games, but with little conviction or belief that they can turn things around.\nThey have only scored four goals in the final 15 minutes of Premiership matches this season, the lowest total in the league.\nDiomande's effort off a post was the only real chance of substance in the final quarter, and it was a long-range effort.\nThe anger displayed from the away end spells trouble for Clement. For despite the dominant win over Celtic and excellent European performances, the Belgian is continually undermined by lacklustre away displays.\nDundee manager Tony Docherty: \"That was such a strong team performance, taking into consideration we have 10 players out.\n\"I'm really proud of the players. I'm tinged with a bit of disappointment, but of course I'm happy with a point against Rangers, I need to be pleased with it.\"\nRangers manager Philippe Clement: \"We made it difficult for ourselves after six minutes conceding a goal with not good defending.\n\"Dundee made a low block with a lot of people, we've done well in recent weeks opening it with runs, but we didn't do that today.\n\"I understand the fans' reaction, I'm also not happy losing these two points.\"", "url": "https://www.bbc.com/sport/football/live/c5yxnx22285t"}