{"authors": ["Lorraine McKenna", "www.facebook.com"], "date_download": "2025-04-26 03:43:42", "date_modify": "2025-04-26 03:43:42", "date_publish": "2025-03-05 08:25:35", "description": "BBC Sport takes a look at the six rookie drivers joining the grid for the 2025 Formula 1 season.", "filename": "sport_formula1_articles_cn5273l635no_1745639022.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c783/live/16b032d0-f90a-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_formula1_articles_cn5273l635no_1745639022.html", "title": "Formula 1 2025: Who are the rookies joining the grid this season?", "title_page": "Formula 1 2025: Who are the rookies joining the grid this season? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "There are plenty of fresh faces joining the grid for the 2025 Formula 1 season.\nSix rookies - the most since 2001- will take to the track for the new campaign, with only constructors' champions McLaren and Aston Martin sticking with the same drivers.\nBBC Sport takes a look at the young stars hoping to impress on their full F1 debuts.\nReplacing seven-time world champion Lewis Hamilton would be tough for any driver, let alone an 18-year-old with just one season in Formula 2 under his belt.\nAndrea Kimi Antonelli has been keen to stress he is \"just another Mercedes driver\" and not Hamilton's replacement. However, as a Silver Arrows protege since the age of 11, big things are expected of the Italian.\nAntonelli took part in first practice at the Italian Grand Prix in Monza last year, but his hour was cut short when a crash on his second push lap ended his session early.\nBriton Oliver Beaman made headlines with his super-sub appearance for Ferrari at the Saudi Arabian Grand Prix last year, scoring six points on his debut as a last-minute replacement for Carlos Sainz, who had appendicitis.\nThe 19-year-old also stepped in for Kevin Magnussen in Azerbaijan and Brazil at Haas - the team he has now signed for on a multi-year deal.\nBearman says the only uncertainty for his first full season is how the car will perform, adding: \"I'm quite certain I feel confident heading into round one, what I can do and how comfortable I am in F1 at this stage.\"\nLiam Lawson is technically a full season rookie, but with the added experience of 11 grands prix.\nFollowing two cameos for Red Bull's sister team in 2023 and 2024, the New Zealander has bypassed a permanent spot with the newly named Racing Bulls and has gone straight to being four-time world champion Max Verstappen's team-mate instead.\n\"I've seen Liam grow throughout the junior team and he fully deserves his shot with the team,\" said Verstappen.\nWith Esteban Ocon starting a new life with Haas, Alpine have promoted reserve driver Jack Doohan for the 2025 campaign.\nThe 22-year-old, who is the son of five-time MotoGP world champion Mick Doohan, raced for the French team at the Abu Dhabi Grand Prix in December.\nDoohan has already had to face questions about his future after Alpine signed Franco Colapinto from Williams as their new reserve driver. But the Australian says he will \"embrace\" any pressure that comes his way and \"enjoy it\".\nGabriel Bortoleto is following in the footsteps of Charles Leclerc, George Russell and Oscar Piastri as a rookie driver who is the back-to-back Formula 2 and Formula 3 champion.\nThe Brazilian produced an eye-catching display during his title-winning F2 campaign when he went from last to first at the feature race in Monza.\nWhile Audi-owned Sauber will be unlikely to challenge for podiums, Bortoleto says his \"mindset of trying to win will never change\".", "url": "https://www.bbc.co.uk/sport/formula1/articles/cn5273l635no"}