{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:55:52", "date_modify": "2025-05-21 03:55:52", "date_publish": "2025-04-07 13:40:20", "description": "Northern Ireland's Rhys McKee believes he has \"finally arrived\" in the UFC after recording his first win in the organisation on Saturday.", "filename": "sport_mixed-martial-arts_articles_ce3v424vqp1o_1747799752.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/da45/live/fef20400-13b4-11f0-92ad-eb42d450dc76.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_mixed-martial-arts_articles_ce3v424vqp1o_1747799752.html", "title": "Rhys McKee: First win '15 years in the making' for Ballymena fighter", "title_page": "Rhys McKee: First win '15 years in the making' for Ballymena fighter - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Northern Ireland's Rhys McKee believes he has \"finally arrived\" in the UFC after recording his first win in the organisation on Saturday.\nAfter losing his opening four bouts in the UFC, the 29-year-old earned a 'Performance of the Night' accolade with an impressive stoppage win over Romania's Daniel Frunza.\n\"I probably never truly believed how good I was until this fight camp,\" McKee said after the bout.\n\"I have literally woken up every day dreaming about how I'm going to finish this fight. I just knew I was going to win. It was in my heart and soul.\"\nThe Ballymena fighter dropped Frunza multiple times throughout the opening round as he dominated the welterweight encounter.\nHis Romanian opponent made it to the bell at the end of the first but such was the volume of blows landed by McKee, the doctor made the decision to call the fight off.\n\"Rhys McKee has finally arrived to the UFC,\" the man nicknamed 'Skeletor' added after the victory.\n\"It was a detour over a few years but this win has been 14 or 15 years in the making and we got it done in true Rhys McKee fight fashion.\n\"Being 0-4 in the UFC, many people wouldn't have had the confidence I had, and the guts I had to walk forward the way I was. There's still going to be a lot of people underestimate me, but bring them forward.\"\nMcKee's last outing before Saturday's win was a split decision defeat to Chidi Njokuani in March 2024 but with victory now under his belt, the 29-year-old wants to keep active and is targeting more fights in 2025.\n\"I want three fights this year. To be honest, I don't even know what month it is so I'll sit back with the team and we'll develop more and work out when we're going next.\"", "url": "https://www.bbc.com/sport/mixed-martial-arts/articles/ce3v424vqp1o"}