{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:50:45", "date_modify": "2025-04-26 03:50:45", "date_publish": "2025-03-05 12:29:05", "description": "Coldplay will work alongside Fifa to decide a \"set of artists\" to perform a half-time show at the 2026 World Cup final.", "filename": "sport_football_articles_cge1q41np7go_1745639445.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c0e9/live/135ea250-f9c4-11ef-9e3a-ef9ebe93cf17.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cge1q41np7go_1745639445.html", "title": "Coldplay to help decide 2026 World Cup final half-time show performers", "title_page": "Coldplay to help decide 2026 World Cup final half-time show performers  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The 2026 World Cup final will stage a Super Bowl-style half-time show for the first time, with Coldplay helping to pick a \"list of artists\" to perform.\nThe tournament, which will be co-hosted by the USA, Canada and Mexico, concludes with the final on 19 July 2026 at the MetLife Stadium in New Jersey.\nThough pre-match performances at showpiece occasions such as the Champions League final have become commonplace, there has never been a half-time show at a World Cup final.\nHalf-times in the regular NFL season last around 15 minutes but they are extended up to 30 minutes at the Super Bowl in order to accommodate a half-time show.\nFifa president Gianni Infantino says Coldplay lead singer Chris Martin and band manager Phil Harvey will help to establish a set of artists to perform in the 15-minute break at next year's final.\n\"I can confirm the first ever half-time show at a Fifa World Cup final in New York New Jersey,\" Infantino wrote on Instagram.\n\"This will be a historic moment for the Fifa World Cup and a show befitting the biggest sporting event in the world.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cge1q41np7go"}