{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:52:31", "date_modify": "2025-05-21 07:52:31", "date_publish": "2025-01-13 16:02:41", "description": "Brentford vs Manchester City: Thomas Frank on Pep Guardiola's side's dip in form", "filename": "sport_football_articles_cy5klly2ry6o_1747813951.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f817/live/b79d3960-d1a8-11ef-a14b-8f7223b7d1ef.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy5klly2ry6o_1747813951.html", "title": "Brentford vs Manchester City: Thomas Frank on Pep Guardiola's side's dip in form", "title_page": "Brentford vs Manchester City: Thomas Frank on Pep Guardiola's side's dip in form - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Brentford boss Thomas Frank does not believe Manchester City's recent dip in form would have surprised \"best coach in the world\" Pep Guardiola.\nGuardiola's side hit an unprecedented slump in November and December, including a run of six league defeats in eight matches, before chalking up three straight wins in all competitions since a home Boxing Day draw against Everton.\nThe defending champions are 12 points behind leaders Liverpool and two points adrift of the top four before Tuesday's trip to face the Bees in the league at Gtech Community Stadium.\n\"A fantastic team with a fantastic coach and fantastic players,\" Frank said. \"I don't think it's a surprise for Pep that they've had a dip.\n\"You never know when it is coming, but you know that not one team in the world can consistently just win year after year.\n\"It's impossible, especially in the best league in the world.\n\"What they've done for the past four years shouldn't be possible. It's hugely impressive and he will go again.\"\nFrank and Guardiola are the Premier League's two longest-serving managers, boasting six years and eight-and-a-half years respectively in their current roles.\n\"For me, he is the best coach in the world,\" Frank added. \"He's also the outlier when he is that good because I think he can stay as long as he wants to.\n\"Of course, everyone needs to perform - even Pep and he says that himself - but he's that good that he can come up with solutions.\"", "url": "https://www.bbc.com/sport/football/articles/cy5klly2ry6o"}