{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:19:41", "date_modify": "2025-05-19 15:19:41", "date_publish": "2015-02-10 10:30:34", "description": "Wales escape sanctions after World Rugby accept WRU medical staff did not see second George North incident on video.", "filename": "sport_rugby-union_31360525_1747667981.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/80849000/jpg/_80849705_cdf_060215_cf_wales_v_england_075.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_rugby-union_31360525_1747667981.html", "title": "Wales avoid sanctions over George North head injury", "title_page": "Wales avoid sanctions over George North head injury - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wales will not face sanctions after wing George North remained on the field following a second blow to the head in the 21-16 loss to England.\nWorld Rugby - the sport's governing body - says North should not have played on after TV replays appeared to show him being knocked unconscious in the 61st minute.\nHowever, it accepts the Wales team medical staff did not see the incident.\nWorld Rugby will also investigate using TV technology to assist medical teams.\nNorth was taken off the field after receiving an accidental kick to the head in the first half of the opening match in the 2015 Six Nations championship, but allowed back on after eight minutes following medical tests.\nBut the fact he carried on to the end of the game following the second blow prompted World Rugby to ask the Welsh Rugby Union (WRU) to explain their treatment of the player.\nWales medical manager Prav Mathema said on Monday they accepted North should have been taken off after the second blow, but that none of the medical team had seen the incident at the time and did not have access to video replays.\nA spokesman for World Rugby confirmed they had the power to impose sanctions, but felt they WRU's explanation meant they were not appropriate.\nThe governing body's written statement said the Wales medical team's handling of the first incident \"followed the correct protocols\" and acknowledged a lack of video replays meant they missed the second incident.\nIt added: \"World Rugby accepts the WRU's explanation that neither the team medical staff nor the independent doctor had sight of the incident and understands that the medics acted within the framework of information they had at the time and would have taken a different course of action had they had direct pitch-side visibility or access to the same broadcast footage seen by those watching on television.\"\nThe governing body - formerly known as the International Rugby Board - said that as a result of the incident it was investigating ways of improving the monitoring of players during a game.", "url": "https://www.bbc.com/sport/rugby-union/31360525"}