{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:54:02", "date_modify": "2025-05-20 14:54:02", "date_publish": "2023-07-27 13:16:38", "description": "Leigh boss Adrian Lam says John Asiata has \"no intention to ever hurt anyone\".", "filename": "sport_rugby-league_66326097_1747752842.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/10757/production/_130551476_shutterstock_editorial_13770239bq.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-league_66326097_1747752842.html", "title": "John Asiata: Leigh captain has 'no intention to hurt anyone' says head coach Adrian Lam", "title_page": "John Asiata: Leigh captain has 'no intention to hurt anyone' says head coach Adrian Lam - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Leigh Leopards boss Adrian Lam says John Asiata has \"no intention to ever hurt anyone\" amid a row over his part in St Helens' Agnatius Paasi and Alex Walmsley suffering long-term injuries.\nAsiata tackled the pair during Leigh's Challenge Cup semi-final victory.\nBoth suffered serious knee injures and are out for the season, with Saints boss Paul Wellens later accusing the RFL of failing to protect players.\n\"John's character is second to none,\" Lam told BBC Radio Manchester.\n\"I've watched him as a player, person and family man, there is no better person in this world than him in terms of his morals and the way that he plays his game.\n\"He has no intention to ever hurt anyone, he is a great leader, he's what this club is all about and he has taken us forward into the future with his leadership.\"\nPaasi is out for nine months with a torn anterior cruciate knee ligament following Saints' defeat, while Walmsley is out for 12 weeks with a lesser MCL injury.\nAsiata was not charged by the match review panel following the match, but Wellens alleged that the panel did not wait for the results of Paasi and Walmsley's scans to come to their decision.\nIn response, the RFL said their approach was consistent with previous cases \"where clubs have cited incidents and alleged serious injuries to players.\"\n\"For me I've taken a step back from that [Asiata incident] this week,\" Lam added.\n\"As important as John is to me as a coach and to the players and this community, it'll be handed over to the top level to deal with.\"", "url": "https://www.bbc.com/sport/rugby-league/66326097"}