{"authors": ["Emma Smith", "www.facebook.com"], "date_download": "2025-05-21 07:40:38", "date_modify": "2025-05-21 07:40:38", "date_publish": "2025-01-13 16:00:58", "description": "The postponed Merseyside derby between Everton and Liverpool is rearranged to Wednesday, 12 February.", "filename": "sport_football_articles_c863q3l72zvo_1747813238.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/88e0/live/c087dfa0-d1c4-11ef-9fd6-0be88a764111.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c863q3l72zvo_1747813238.html", "title": "Everton v Liverpool: Postponed Merseyside derby rescheduled for 12 February", "title_page": "Everton v Liverpool: Postponed Merseyside derby rescheduled for 12 February - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The postponed Premier League game between Everton and Liverpool has been rearranged to Wednesday, 12 February at 19:30 GMT.\nWith Everton poised to move into their new stadium at Bramley-Moore Dock this summer, it is set to be the final league game between the Merseyside rivals to be played at Goodison Park.\nThe original game on 7 December was called off because of Storm Darragh, amid fears for supporter safety.\nThe 12 February date is subject to Liverpool finishing in the top eight of the Champions League table, because it clashes with the play-offs for teams finishing between ninth and 24th in the league.\nLiverpool have won all six of their Champions League games and are top of the table, six points clear of ninth place, with two games remaining.\nThe Reds host French side Lille in their penultimate group fixture on 21 January, before travelling to the Netherlands to take on PSV Eindhoven eight days later.\nOne point from those two games will be enough to send Arne Slot's side into the round of 16, and ensure the game can take place on the new date.", "url": "https://www.bbc.com/sport/football/articles/c863q3l72zvo"}