{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:37:19", "date_modify": "2025-05-21 04:37:19", "date_publish": "2025-04-04 16:45:02", "description": "Monaghan legend and BBC pundit Conor McManus says winning a first Ulster title since 2008 will be a massive priority for All-Ireland champions Armagh.", "filename": "sport_articles_c3v9r3zg9qpo_1747802239.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/aaae/live/ed0aee80-115e-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c3v9r3zg9qpo_1747802239.html", "title": "Ulster SFC 2025: Anglo-Celt big priority for Armagh", "title_page": "Ulster SFC 2025: Anglo-Celt big priority for Armagh - Conor McManus - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Armagh are carrying the All-Ireland champions tag for the first time in over 20 years and will obviously have a huge say in where the Ulster Championship ends up.\nThis Armagh squad have been on the go a long time now and haven't managed to win an Ulster title, so that will definitely be in their heads. They've lost the past two finals on penalties and you'd expect them to be there or thereabouts again.\nObviously, Donegal are the holders and they're even stronger than they were last year.\nThey have a few big players back involved. Michael Murphy's the biggest one of those, Odhran McFadden-Ferry's back in there, Finbarr Roarty and Eoin McHugh too, so they've a deeper and better squad.\nJim McGuinness has always put massive stock on the Ulster Championship and this year will be no different.\nTyrone are an interesting case. They were relegated from Division One, but relegated with seven points and victories over Donegal and Dublin, which is pretty unique.\nI don't think they will be overly concerned with where they're at. In fact, they will be relatively content, and knowing Malachy O'Rourke, Ryan Porter and Leo McBride, they will leave no stone unturned getting Tyrone ready to face Cavan in a fortnight's time.\nFor Monaghan, winning games has bred confidence. That's big going into a championship campaign, but it must be said that the standard in Division Two this year was quite poor.\nA lot of Monaghan games I watched, they were very comfortable wins against Cork, Louth and Meath. The standard of those teams isn't comparable to what they'll face in Ulster.", "url": "https://www.bbc.com/sport/articles/c3v9r3zg9qpo"}