{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:24:38", "date_modify": "2025-05-21 05:24:38", "date_publish": "2025-02-12 00:00:00", "description": "Benfica take control of their Champions League play-off with an away win against a Monaco side that have to play most of the second half with only 10 men.", "filename": "sport_football_live_crm7pmrrpe0t_1747805078.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_crm7pmrrpe0t_1747805078.html", "title": "Monaco 0-1 Benfica: Visitors win first leg of Champions League play-off tie", "title_page": "Monaco 0-1 Benfica: Visitors win first leg of Champions League play-off tie - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Benfica took control of their Champions League play-off with an away win against a Monaco side that had to play most of the second half with only 10 men.\nThe visitors went ahead thanks to a superb chipped finish from a tight angle by Vangelis Pavlidis after only three minutes of the second half.\nFour minutes later, the hosts were reduced to 10 men as Libyan midfielder Moatasem Al-Musrati was shown a second yellow card on his Champions League debut.\nHe had tried to get Benfica defender Alvaro Carreras booked for a challenge, but was instead shown a yellow card himself and then a red.\nThe first half had few clear-cut chances, although Benfica goalkeeper Anatoliy Trubin did well to save Maghnes Akliouche's shot across goal.\nCarreras, who was at Manchester United but never made a senior appearance for them before joining Benfica last summer, had two chances, but fired just wide and then brought a save from home goalkeeper Radoslaw Majecki.\nThe second leg in Lisbon takes place on Tuesday, with Benfica favourites to move into the last 16.\nBut they may be without former Manchester United winger Angel di Maria for the return game after the Argentine had to go off late on with a hamstring injury.\nThe winner of this play-off tie would face either Liverpool or Barcelona in a two-legged clash in March.", "url": "https://www.bbc.com/sport/football/live/crm7pmrrpe0t"}