{"authors": ["Harry Poole", "www.facebook.com"], "date_download": "2025-04-26 03:40:08", "date_modify": "2025-04-26 03:40:08", "date_publish": "2025-03-05 10:28:34", "description": "Former world indoor 60m champion Richard Kilty announces his retirement from athletics after helping Team GB to men's 4x100m relay bronze at Paris 2024.", "filename": "sport_olympics_articles_cg5dzl2r6l0o_1745638808.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ffff/live/e4d2fcc0-f9a4-11ef-a629-ef88fbd35a13.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_olympics_articles_cg5dzl2r6l0o_1745638808.html", "title": "Richard Kilty: Britain's former world indoor 60m champion retires", "title_page": "Richard Kilty: Britain's former world indoor 60m champion retires - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Britain's former world champion sprinter Richard Kilty has announced his retirement from athletics.\nKilty, 35, won 60m gold at the World Indoor Championships in Sopot, Poland in 2014 before claiming back-to-back European indoor 60m titles in 2015 and 2017.\nHe was part of Team GB's bronze medal-winning men's 4x100m relay squad at the Paris 2024 Olympic Games, competing in the heats before Jeremiah Azu, Louie Hinchliffe, Nethaneel Mitchell-Blake and Zharnel Hughes ran in the final.\nThat Olympic medal ensured he would end his career having made every major international podium available to him - both indoors and outdoors.\nIn total Kilty, known as the Teesside Tornado, won eight major international medals during his career, including five in relay events.\nAs part of Britain's men's 4x100m team he also won European Championship gold in 2014, the Commonwealth Games title in 2018, and World Championship silver in 2019.\nHowever, the British team featuring Kilty, Hughes and Mitchell-Blake was stripped of their Olympic silver medals achieved in Tokyo two years later, after team member CJ Ujah was found to have committed a doping violation.\nKilty said that winning a bronze medal at Paris 2024 had completed his Olympic \"recovery mission\" as he ensured he completed the set of major championship medals across his career.\nHe did not compete in the Olympic final after tearing his Achilles tendon in ensuring Team GB earned automatic qualification for the medal race.", "url": "https://www.bbc.co.uk/sport/olympics/articles/cg5dzl2r6l0o"}