{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:46:37", "date_modify": "2025-05-21 04:46:37", "date_publish": "2025-02-01 04:46:32", "description": "Ben McKinney's run-a-ball 110 helps England Lions salvage some pride during an-innings-and-10-run defeat by Australia A in an unofficial Test in Sydney.", "filename": "sport_cricket_articles_cg45n43242no_1747802797.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9c64/live/013ec710-e058-11ef-a319-fb4e7360c4ec.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cg45n43242no_1747802797.html", "title": "Australia A v England Lions: Ben McKinney's run-a-ball 110 in vain as Andrew Flintoff's side lose by an innings and 10 runs", "title_page": "Australia A v England Lions: Ben McKinney's run-a-ball 110 in vain as Andrew Flintoff's side lose by an innings and 10 runs - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ben McKinney's run-a-ball 110 helped England Lions salvage some pride during an-innings-and-10-run defeat by Australia A in an unofficial Test in Sydney.\nEngland began their second innings on day three at Cricket Central in Wilson Park on 116-2 - 141 runs in arrears - having followed on to Australia's 373-9 declared.\nDurham left-hander McKinney notched his second first-class hundred after he had resumed in the morning session on 67 not out.\nHowever, when the 20-year-old was caught by Xavier Bartlett off the bowling of Aaron Hardie with the score on 164 it spelled the beginning of the end for the Lions.\nMatty Hurst made a stoic 35 and Rocky Flintoff hit a gritty 21 but they were the only other England batters into double figures on the third day as Aussie seamer Jordan Buckingham finished with 4-41.\nThis match was the last of the Lions' three four-day games down under.\nThey lost the first by seven wickets in Brisbane despite 94 for McKinney but managed to draw the second thanks to a century from 16-year-old Flintoff.\nFlintoff is the son of former England all-rounder Andrew who is coach of the England Lions for this tour.", "url": "https://www.bbc.com/sport/cricket/articles/cg45n43242no"}