{"authors": ["Nigel Ringland", "www.facebook.com"], "date_download": "2025-05-20 13:39:50", "date_modify": "2025-05-20 13:39:50", "date_publish": "2023-07-25 21:15:42", "description": "Ireland defeat Ukraine 7-0 to book their place in the semi-finals of the EuroHockey Division 2 tournament in Dublin with a game to spare.", "filename": "sport_hockey_66303806_1747748390.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/E787/production/_130517295_leecole.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_hockey_66303806_1747748390.html", "title": "EuroHockey Championship II: Ireland defeat Ukraine 7-0 to book semi-final place", "title_page": "EuroHockey Championship II: Ireland defeat Ukraine 7-0 to book semi-final place - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ireland defeated Ukraine 7-0 to book their place in the semi-finals of the EuroHockey Division 2 tournament in Dublin with one game to spare.\nLee Cole scored a hat-trick, with Shane O'Donoghue grabbing two and Conor Empey and Ben Walker also on target.\nIreland have scored 16 goals in their first two games and conceded none after an opening 9-0 victory over the Czech Republic on Sunday.\nThe Irish team will complete the pool stages against Portugal on Wednesday.\nTheir opponents in Friday's semi-finals are likely to be Scotland or Italy and a win would secure a place at next January's Olympic qualification tournaments.\nIreland dominated the first quarter but rather like the opening game against the Czech Republic they couldn't find the goal that their approach play deserved.\nIt was Ukrainian goalkeeper Bohdan Tovstolytkin who kept them at bay denying Conor Empey and then producing an outstanding point-blank reflex stop from Ben Johnson's effort.\nThe visitors best chance came from the opening penalty corner of the game early in the second quarter and Davey Harte made a good save from Andrii Koshelenko to keep the game goalless.\nHowever, it didn't take Ireland long to change that with two penalty corner goals in the space of seven minutes before the half time interval.\nShane O'Donoghue's drag flick over the pad of Tovstolytkin made it 1-0 and Lee Cole did almost the same thing although this time the goalie got something on the shot but couldn't keep it out.\nO'Donoghue found the net again in the third quarter as Ireland turned the screw forcing a number of corners that eventually yielded the third goal and he was only denied a hat-trick by another good save from Tovstolytkin.\nUnfortunately for the goalkeeper the rebound was knocked goal wards and blocked on the line by a Ukrainian foot.\nCole stepped up to convert the resulting penalty stroke and he repeated the trick late in the final quarter to complete his hat-trick.\nEmpey then scored from another corner before Walker's reverse stick shot rounded off the scoring and another excellent Irish performance.", "url": "https://www.bbc.com/sport/hockey/66303806"}