{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:32:42", "date_modify": "2025-05-20 13:32:42", "date_publish": "2023-08-02 00:00:00", "description": "Follow text and radio commentary as London Spirit host Oval Invincibles in the 2023 Women's Hundred.", "filename": "sport_live_cricket_66306056_1747747962.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_cricket_66306056_1747747962.html", "title": "The Hundred 2023 LIVE: London Spirit vs Oval Invincibles in women's competition plus score, commentary, video highlights & updates", "title_page": "The Hundred 2023 LIVE: London Spirit vs Oval Invincibles in women's competition plus score, commentary, video highlights & updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "See you later...\nHopefully we will get some play in the men's match between London Spirit and Oval Invincibles, which is due to start at 18:30 BST and is live on BBC Two at 18:15.\nWe will have live text commentary of that match on the BBC Sport website, too.\nSee you later on for that one.\nMatch abandoned\nA ground sheet next to the covers on the pitch being used for this afternoon's match was briefly peeled back by the groundstaff at Lord's to enable some excess water to be cleared up.\nHowever, that sheet is now firmly back in place. The skies are still decidedly grey, it's drizzling and umbrellas are being put back up.\nA few minutes later the umpires met with Spirit skipper Heather Knight and Invincibles counterpart Dane van Niekerk and all parties shook hands.\nThe match abandoned has been without a ball being bowled.\nPost\nAn update of sorts from Lord's.\nThe cut-off time for a match to start is 17:12 BST - that would be a 25-ball-a-side match with a 10-minute interval between innings and a scheduled finish time of 17:55.\nThere are a few more supporters inside the ground now, but the covers are still on and umbrellas up at the moment so they could be in for a bit of a wait.\nWe shall endeavour to keep you updated with more news when we get it.\nDelayed start...\nWelcome to live text commentary of the London Spirit vs Oval Invincibles women's match in The Hundred from Lord's.\nAlice Capsey and Claudie Cooper, either side of Kira Chathli, offered an optimistic thumbs up when the Invincibles arrived at HQ a little earlier.\nBut the hoods pulled up over the heads are a giveaway. Yes, you guessed it - it's raining in St John's Wood and the covers are very much on.\nAs things stand we are looking at a delayed start and, almost certainly, a reduced game. We'll bring you more information as we get it.", "url": "https://www.bbc.com/sport/live/cricket/66306056"}