{"authors": ["Sam Drury", "www.facebook.com"], "date_download": "2025-05-20 13:25:57", "date_modify": "2025-05-20 13:25:57", "date_publish": "2023-08-02 06:28:24", "description": "England have named uncapped Surrey seamer in their squad for the New Zealand series - and he is set to go to World Cup. Here's what to expect from him.", "filename": "sport_cricket_66361672_1747747557.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/B4C8/production/_130608264_england_nxtgen_gusatkinson.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66361672_1747747557.html", "title": "Gus Atkinson: What to expect from England's new seamer", "title_page": "Gus Atkinson: What to expect from England's new seamer - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A version of this article was published on 2 August 2023.\nGus Atkinson has that most precious commodity in cricket - pace.\nThe Surrey bowler's rise to prominence over the past year might best be defined by that one small but crucial word.\nThat rise has culminated in Atkinson being named in England's squads for the white-ball series against New Zealand in September - and he is now set to travel to India as part of the squad looking to defend the 50-over World Cup in October.\nAtkinson has made his way into the squad as a high-pace option after Jofra Archer and Olly Stone were unable to recover from injury.\nSince his debut in 2020, Atkinson had made only five first-class appearances prior to last summer.\nHe played another four in 2022, along with six Vitality Blast games, but that was enough to earn him stints with Desert Vipers in the ILT20 and Pakistan Super League franchise Islamabad United.\nBy early June of this year, with James Anderson and Ollie Robinson injured, he was being touted as an option for England's Test against Ireland.\nWhen you've got pace, things can happen quickly.\n\"He's definitely put on a yard over the winter,\" said BBC London cricket commentator Mark Church.\n\"Everybody has noticed this summer how hard he's hitting the keeper's gloves. His bouncer is rapid and he hurries batters up with genuine pace.\n\"That is what everyone is looking for, that point of difference.\n\"He's a real talent and what I love about Gus is that he's sort of gone under the radar a touch until now. It is very noticeable how he has quickened up this season. He seems to have bulked up a bit.\"\nNow 25, Atkinson's early progress was hampered by injury as he suffered stress fractures in 2017, 2018 and 2019 before working his way back to dismiss Sir Alastair Cook on his first-class debut.\nThe former England captain was among Atkinson's victims again as the Surrey quick took a career-best 6-68 against Essex in the County Championship in May.\n\"I was impressed,\" Cook told BBC Sport. \"He can hit a very good, hard natural length.\n\"It doesn't look like it takes too much effort for him to bowl quickly, so you would say there is probably a bit more in the tank.\n\"It looks easy, but he is striving for as much pace as he can get. It looks like there is a bit more untapped pace.\n\"He also has raw skills to be able to move the ball - a bit like when I first saw Mark Wood.\"\nChurch added: \"People who haven't seen him before sit there and go, 'hang on, where has he come from?'.\n\"He's a dream for a captain in that there's no fuss, no bother - you can just bung him the ball and he sort of glides into the crease. There is no change to his action whatever.\"\nIt is that smooth, repeatable action that has led to comparisons with another England fast bowler, Jofra Archer. But Atkinson is not one to get carried away or overawed by this new-found attention.\n\"He wouldn't be fazed by anything,\" Church said. \"The reason for that is that he keeps it very, very simple.\n\"The other key thing is that he can bat. In this Surrey side you see him wandering in at nine or 10 and he looks in no trouble whatsoever and plays some gorgeous shots.\n\"By the back end of his career he could end up batting as high as six or seven. He's that good.\"\nChurch thought England's post-World Cup tour of the West Indies would be a \"really good time for England to have a look\" at Atkinson.\nAtkinson's chance is going to come sooner than that.\n\"He's got all the skills with the white ball,\" said Church. \"Get him in there with an eye on playing a bit of Test cricket.\n\"His name has been mentioned an awful lot lately. The reason is that he's picking up his wickets and doing it at pace. That is what England are looking for without a shadow of a doubt.\"", "url": "https://www.bbc.com/sport/cricket/66361672"}