{"authors": ["Sean Kearns", "www.facebook.com"], "date_download": "2025-05-21 06:18:23", "date_modify": "2025-05-21 06:18:23", "date_publish": "2025-01-31 11:30:35", "description": "Manchester City will play Real Madrid while Celtic will face Bayern Munich in the Champions League play-off round.", "filename": "sport_football_articles_cz7enne7dq0o_1747808303.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3dd1/live/df622000-dfd6-11ef-bd1b-d536627785f2.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cz7enne7dq0o_1747808303.html", "title": "Champions League play-offs draw: Man City v Real Madrid, Celtic v Bayern", "title_page": "Champions League play-offs draw: Man City v Real Madrid, Celtic v Bayern - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester City will play 15-time European Cup winners Real Madrid and Celtic will face Bayern Munich in the Champions League play-off round.\nCity, the 2023 Champions League winners, will host Madrid at Etihad Stadium on 11 February before travelling to Spain for the second leg on 19 February.\nCeltic, the first British club to win the trophy when they did so in 1967, will face Bayern Munich at Celtic Park on 12 February before the Bundesliga club host Brendan Rodgers' side at Allianz Arena in the second leg on 18 February.\nThe winners of City's tie against Madrid and Celtic's meeting with Bayern will face either German side Bayer Leverkusen or Spanish club Atletico Madrid in the last 16.\nThe draw for the last 16 is on 21 February, following the conclusion of the play-off ties, but some elements of that draw are pre-determined.\nClubs that finished in the top eight of the 36-team Champions League group table progressed directly to the last 16. The teams in the bottom eight were eliminated.\nThe remaining 16 teams that finished between ninth and 24th place progressed into the play-offs.\nOf those 16 teams, the clubs that finished ninth to 16th in the league phase were seeded into four pairs for the play-off draw.\nThose that finished from 17th to 24th were put into four unseeded pairs.\nUnseeded teams were drawn against one of two seeded teams, with seeded teams hosting the second leg of the play-off as they finished higher in the first phase table.\nCity finished 22nd in the league table while Celtic finished 21st.\nIt meant the two sides would face one of Real Madrid or Bayern Munich, who finished 11th and 12th respectively in the group stage.\nLiverpool, Arsenal and Aston Villa progressed straight to the last 16 after finishing in the top eight of the league phase.\nThe draw to finalise the last-16 ties is made on 21 February, when the eight winners of the play-off ties will be known.\nSome elements of the last-16 draw are already decided because teams in the top eight of the league phase were split into four seeded pairs based on their position in the table.\nTeams in the seeded pair will face the winners of one of the two play-off ties they have already been bracketed with.\nLiverpool finished top of the league phase and are paired with second-place Barcelona. Those teams will play either the winners of the Brest v Paris St-Germain tie or the team that progresses from Monaco's meeting with Benfica.\nArsenal were third and are paired with Italian club Inter Milan, who were fourth. The Gunners or Inter will play either the winners of Juventus v PSV Eindhoven or Feyenoord against AC Milan.\nVilla were eighth and are paired with seventh-placed Lille and those teams will face the winners of Club Brugge v Atalanta or Sporting v Borussia Dortmund.", "url": "https://www.bbc.com/sport/football/articles/cz7enne7dq0o"}