{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:59:20", "date_modify": "2025-05-21 04:59:20", "date_publish": "2025-02-12 00:00:00", "description": "Anis Mehmeti scores both goals as Bristol City beat Stoke to maintain their push for the Championship play-offs.", "filename": "sport_football_live_czj32jll3wjt_1747803560.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_czj32jll3wjt_1747803560.html", "title": "Bristol City 2-0 Stoke City: Mehmeti double gives Robins victory", "title_page": "Bristol City 2-0 Stoke City: Mehmeti double gives Robins victory - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Anis Mehmeti grabbed both goals to hand Bristol City victory against Stoke City and maintain their push for the play-offs.\nThe Albanian scored the home side's opener in the 11th minute following a well-worked move, before adding another during the second half with a powerful angled shot.\nStoke went close when Nathan Lowe's speculative cross hit the bar, but the hosts always looked in control of the game.\nThe victory leaves Bristol City on 45 points, just two points outside the top six, while Stoke City continue to look over their shoulder in 19th spot, three points above the drop zone.\nLiam Manning's side started the brightest as a long forward pass was brilliantly controlled by the lively Mehmeti in the box, giving a glimpse of what was to follow.\nHe laid off the ball to Scott Twine, whose curling shot was well held by Viktor Johansson.\nIt only took 11 minutes for the hosts to break the deadlock as a slick move involving several passes was brought to a successful conclusion by Twine's lovely through-ball to Sykes, whose cross from the right-wing was easily converted by Mehmeti from close range.\nStoke almost levelled immediately when Lowe's cross from the byline clipped the top of the bar.\nThe Robins responded with an opportunity that really should have been converted as Max Bird raced onto a loose ball and drove a left-footed shot just wide of the far post.\nThe Ashton Gate side were soon asking more questions of their opponents again following the restart as Rob Dickie got away from his marker to reach Twine's set-piece only to flick his header wide.\nMehmeti made sure of the victory in the 73rd minute when he smashed a fierce angled strike into the top corner, following Dickie's header from Bird's corner.\nStoke keeper Johansson did not stand a chance of preventing the Albanian's 11th goal of the campaign.\nSub Yu Hirakawa almost made it three, but was denied by a fine save from Johansson, who also kept out a Nahki Wells effort moments later as the home side piled on more pressure.\nBristol City boss Liam Manning told BBC Radio Bristol:\n\"The first goal was an outstanding moment of quality. In the second half it was about managing the game without the ball, which was important.\n\"The lads are such a top group to work with. We are able to move on quickly, which is a strength of the group, and we were able to find a way to win. In terms of managing the game and being professional, we did that well.\n\"There are goals in this group of players, as we can see. There was some top play, not only in our goals, but other chances. We got into some good areas and if you keep doing that you will score eventually.\n\"We had an honest meeting yesterday about what we can do better, how we can improve. We need to be tough on ourselves, not hide away, and the players were open to that.\"\nStoke manager Mark Robins told BBC Radio Stoke:\n\"We had more possession and didn't have a shot on target, which is a damning statistic, and one I'm embarrassed about.\n\"We have to win the duels, have an attacking intent and get that impetus by playing in a way that you mean it, rather than the apologetic performance we've just seen. The players are more capable than that – they know that.\n\"Everyone who pays their hard-earned money deserves the minimum, which is a side that's running and fighting. We are working hard, but not in the right way. Mentally, we weren't at it.\n\"We have to be miles better than that, and have the intent and a desire to score goals. These are young players who tend to be resilient but, in a game, can sometimes get overawed. There were two moments in the game where we switched off, allowing them to shoot and score.\"", "url": "https://www.bbc.com/sport/football/live/czj32jll3wjt"}