{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:37:02", "date_modify": "2025-05-21 07:37:02", "date_publish": "2024-12-23 19:30:57", "description": "Winger James Teelan will join Portadown on a free transfer when the January transfer window opens.", "filename": "sport_articles_clygnwg9zyeo_1747813022.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/374b/live/60637ab0-c163-11ef-a964-0721b998793b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_clygnwg9zyeo_1747813022.html", "title": "Teelan to join Ports in January after Crues release", "title_page": "Irish Premiership: James Teelan to join Ports in January after Crues release - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Winger James Teelan will join Portadown on a free transfer when the January transfer window opens.\nThe 22-year-old, who spent time in the Ports academy when he was younger, was released by fellow Irish Premiership side Crusaders in October.\nTeelan, who started his senior career with Dungannon Swifts, was a standout performer for Newry City, making 87 appearances and scoring 27 goals in two seasons at the club.\nHe then moved on to the Crues in 2023 but played just 24 times during his 18 months at Seaview.\nHe spent the second half of last season on loan at Carrick Rangers.\nPortadown boss Niall Currie is delighted to add Teelan to his squad next month.\n\"He's explosive and will carry a real threat. We felt we needed to strengthen our wide areas and James can play right across the front line,\" Currie told the club's website.\n\"He comes after not featuring regularly at Crusaders but we're confident we can get his career going in the right direction again and give him the platform to get back to his very best.\"\nTeelan is also looking forward to working with Currie, who has led Portadown to second in the table in their first season back in the top-flight.\n\"I feel as though Niall is the right manager to get the best out of me and I can't wait to get started and playing in front of the supporters.\"", "url": "https://www.bbc.com/sport/articles/clygnwg9zyeo"}