{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:19:19", "date_modify": "2025-05-20 13:19:19", "date_publish": "2023-08-02 10:42:01", "description": "Half-back Jake Clifford will exit Hull FC at the end of the 2023 Super League season to join NRL club North Queensland Cowboys.", "filename": "sport_rugby-league_66382912_1747747159.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/10EDD/production/_130614396_gettyimages-1469304646.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-league_66382912_1747747159.html", "title": "Jake Clifford: Hull FC half-back to leave in 2024 for North Queensland Cowboys return", "title_page": "Jake Clifford: Hull FC half-back to leave in 2024 for North Queensland Cowboys return - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Half-back Jake Clifford will leave Hull FC at the end of the 2023 Super League season to return to National Rugby League club North Queensland Cowboys.\nThe Cairns-born 25-year-old has scored six tries and 46 goals in 20 league and cup games since joining from Newcastle Knights for this season.\nHe played 42 games over a four-year spell in Townsville at the start of his career, and will return \"home\" in 2024.\n\"We're excited about what he can bring,\" Cowboys GM Micheal Luck said., external\n\"It's always a bonus to be able to bring a North Queensland boy home.\"\nClifford's move to Super League alongside Knights full-back team-mate Tex Hoy was an eye-catching coup for Hull, and even in a short stint has been a success.\nWith 14 try assists he ranked ninth in the Super League, and his combination with Jake Trueman has been improving since the stand-off's return from a lengthy knee ligament injury.\nOnce back at the Cowboys, he will fill the void left by Ben Hampton's move and challenge former Cronulla NRL premiership winner Chad Townsend and ex-Queensland Origin playmaker Tom Dearden for a spot.\n\"Jake has been honest with us throughout and it has been a genuinely difficult decision for him, he's really enjoying his time at the club,\" Hull FC boss Tony Smith said.\n\"I think if it was any other club he wouldn't be going back, but we understand the draw of being close to family and friends, especially with a young child.\n\"He was always going to come to a point where he was ready for a return to the NRL, which we hoped wouldn't have been as soon, but we fully support his decision.\"\nHull say they will make announcements around their own recruitment - including a replacement for Clifford - \"over the coming weeks\".", "url": "https://www.bbc.com/sport/rugby-league/66382912"}