{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:23:47", "date_modify": "2025-05-21 07:23:47", "date_publish": "2025-03-28 15:48:43", "description": "Swindon Town manager Ian Holloway signs a new contract, keeping him at the League Two club until the end of the 2027-28 season.", "filename": "sport_football_articles_c7434zn8zjdo_1747812227.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/89ce/live/396aaab0-0bea-11f0-a325-a3a96822a2be.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c7434zn8zjdo_1747812227.html", "title": "Ian Holloway: Swindon Town boss signs new contract until end of 2027-28", "title_page": "Ian Holloway: Swindon Town boss signs new contract until end of 2027-28 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Swindon Town manager Ian Holloway has signed a new contract, keeping him at the League Two club until the end of the 2027-28 season.\nHolloway was appointed by Swindon in October, nearly four years since he left his last role in charge of Grimsby Town.\nThe Robins were three points above the relegation zone when he came to the club and now sit 15th, with eight games left this season.\nThey have gained 36 points from 24 league games during his tenure, while also going unbeaten in their past 10 League Two games at the Nigel Eady County Ground.\n\"I'm absolutely delighted to have signed a new contract. I'm honoured to be trusted,\" said Holloway.\n\"We will ensure that our fanbase grows and our fans do more to meet and connect with our supporters, and it's really important that they buy into why they are here and why it's so important.\"\nIn a joint statement, the club's chairman, Clem Morfuni, and chief executive officer, Anthony Hall, added: \"Ian has revitalised the squad since his arrival back in October and moved the team in the correct direction.\n\"We really believe in the culture that Ian is creating and building here at the club.\"", "url": "https://www.bbc.com/sport/football/articles/c7434zn8zjdo"}