{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:45:26", "date_modify": "2025-05-19 14:45:26", "date_publish": "2017-07-20 21:24:23", "description": "Chris Froome should win his fourth Tour de France title - but the race is \"not over yet\", says ex-British road race champion Rob Hayles.", "filename": "sport_cycling_40673039_1747665926.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/DC7A/production/_97024465_froome_index_reuters.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_cycling_40673039_1747665926.html", "title": "Tour de France 2017: Chris Froome 'should' claim fourth title - Rob Hayles", "title_page": "Tour de France 2017: Chris Froome 'should' claim fourth title - Rob Hayles - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Chris Froome should win his fourth Tour de France title this weekend - but the race is \"not over yet\", says ex-British road race champion Rob Hayles.\nBriton Froome, 32, finished fourth on Thursday's tough stage 18 and has a 23-second lead over France's Romain Bardet with three stages remaining.\nBut the fight shown by his rivals means a third Froome victory in a row is not certain, Hayles told BBC Radio 5 live.\n\"He hasn't won it yet. He should, but this has been a tough battle,\" he said.\n\"The way these guys fought up the side of this mountain, they absolutely turned themselves inside out,\" added the former Olympic track cyclist.\nTeam Sky's Froome also believes overall victory is not yet certain despite having completed \"the toughest part of the Tour\".\nFollowing a flat route on Friday's stage 19, the riders face the final individual time trial on Saturday in the penultimate stage in Marseille.\n\"It's nice to get through the Alps feeling good and looking forward to the time trial now in Marseille,\" added Froome.\n\"Rigoberto Uran is my biggest threat in Marseille. From the general classification group, he is the next strongest in time trials. He's only 29 seconds behind so he will be the guy to look out for.\"", "url": "https://www.bbc.com/sport/cycling/40673039"}