{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:13:50", "date_modify": "2025-05-19 15:13:50", "date_publish": "2015-03-03 08:39:30", "description": "AFC St Austell manager Phil Lafferty is confident his side can win the FA Vase after reaching the semi-finals.", "filename": "sport_football_31707229_1747667630.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81335000/jpg/_81335673_staustellfootball4_creditstaustellvoice.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31707229_1747667630.html", "title": "AFC St Austell can win the FA Vase, says boss Phil Lafferty", "title_page": "AFC St Austell can win the FA Vase, says boss Phil Lafferty - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "AFC St Austell manager Phil Lafferty is confident his side can win the FA Vase.\nThey beat Ascot United 3-2 in the quarter-finals to set up a two-legged semi-final against either Glossop North End or Shaw Lane Aquaforce.\n\"The dream is still alive and we firmly believe we can go all the way, right throughout the club both on and off the pitch,\" he told BBC Radio Cornwall.\n\"We'll be doing everything we can to give our club and our town the best opportunity to progress to the final.\"\nSt Austell are the first Cornish club to reach the last four of the FA Vase since Truro City won the trophy in 2007., external\n\"To be able to fly the flag and give the whole town a lift, and see the overwhelming amount of people who turned up in atrocious conditions to watch us (against Ascot) shows we can all come together and really enjoy the day out as we did on Saturday,\" said Lafferty.\n\"Reaching Wembley is the ultimate goal and prize for the occasion and financially.\n\"(The prize money) does make a huge difference to any club out of the 536 that have entered this competition this season, it's the lifeblood of every club.\"", "url": "https://www.bbc.com/sport/football/31707229"}