{"authors": ["Ben Marvell", "www.facebook.com"], "date_download": "2025-05-21 06:53:42", "date_modify": "2025-05-21 06:53:42", "date_publish": "2025-03-29 17:53:11", "description": "Bath confirm their status as Premiership title favourites with an exciting 47-28 win over play-off chasing Harlequins at The Rec.", "filename": "sport_rugby-union_articles_c8j0z7wzmn1o_1747810422.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3dd3/live/3ccbf5b0-0cbc-11f0-bffd-fb98b4c4f9e8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c8j0z7wzmn1o_1747810422.html", "title": "Bath 47-28 Harlequins - hosts overpower Quins to remain top", "title_page": "Bath 47-28 Harlequins - hosts overpower Quins to remain top - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Premiership leaders Bath confirmed their status as title favourites with an exciting 47-28 win over play-off chasing Harlequins at The Recreation Ground.\nIn a frantic first half, the home team scored first through Joe Cokanasiga's set-piece effort, before further tries from Ted Hill, Ross Molony and Will Muir put the away team to the sword.\nLuke Northmore and Titi Lamositele responded for Quins before Muir went over for his second on the verge of half-time.\nFin Baxter then powered over early in the second half as Quins looked to launch a comeback, before Max Ojomoh's interception and Francois van Wyk's effort put the game beyond the visitors, with Sam Riley's late consolation giving Quins a bonus point.\nBut. on the flip side for Bath, England lock Charlie Ewels left the field after 35 minutes in obvious discomfort and must be a doubt for next Friday's European Challenge Cup tie at Pau.\nChasing their fifth victory on the bounce in all competitions, Bath's intensity put Quins on the backfoot from the kick-off.\nFollowing a flowing set-piece move from a lineout, Tom de Glanville fed Cokanasiga who bumped off two would-be tacklers to score in the corner.\nIt proved to be a double whammy for Quins, with the unfortunate Rodrigo Isgro being injured during the final tackle and receiving a yellow card for head-to-head contact with the rampaging Bath winger.\nBath took advantage of the extra man to score a second through Hill, with the flanker striding through after patient build up play.\nWhen Quins had the ball they looked dangerous and should have had a try following Northmore's break, only for the final pass to Tyrone Green to go astray.\nMarcus Smith was then yellow carded for cynical play around the ruck, before Molony powered his way over following successive close-range drives.\nFrom the resulting kick-off Bath scored again as de Glanville charged up the touchline before feeding Muir to power over in the corner for the bonus-point score.\nNorthmore got Quins' first points of the day following Tom Lawday's break, before Lamositele spotted a gap by the Bath posts to burrow his way over after Jamie Benson's drive.\nMuir went over for his second just before the break but Quins scored first after the teams re-emerged as Baxter forced his way over from close-range following successive attacking phases, before Bath had a Ben Spencer try chalked off for a forward pass.\nWith the away side attacking, Ojomoh's length-of-the-field interception score dashed any Quins hopes of a comeback, before Will Butt's break sent replacement van Wyk through a gap to dive over.\nRiley's effort gave the away team a deserved losing bonus point, but the point was not enough to lift Danny Wilson's fifth-placed side into the play-off spots, while Bath are now 10 points clear on top.\nBath boss Johann van Graan:\n\"It's obviously very painful for Charlie Ewels. If there is a doubt about him, we won't consider him for next weekend. I don't have anything specific to report, but at least he had a smile at the end.\n\"We're very chuffed about the five points. We knew that this was a big moment in the season in terms of two games after the Six Nations, both at home. This was a very good Quins team that had just beaten Saracens. We anticipated that they would bring their power game, which they did.\n\"It was a cracking atmosphere at The Rec. It just seemed a lot louder than last week. It was two teams again that wanted to play positive rugby and that is a trademark of this Premiership. We started the first 25 minutes fantastically well, to be 26-0 up. We scored tries and scrambled well. We just keep doing what we are doing.\n\"But as I have said on many occasions we will only see at the back end of May where we are at. There are five rounds left so we can just keep focusing on what we need to do and keep trying to improve. But we're obviously satisfied with 10 league points from the last two weeks. Now it's back into Europe.''\nBath winger Will Muir told BBC Radio Bristol:\n\"It was a battle. I talked to a few of the lads and we thought it must be coming to half-time and it was only 12 minutes in.\n\"It's never easy against them. You know that they never roll over. It felt like a relief to get it over the line really. They're so dangerous when they throw it about, you can never really switch off.\n\"Tom de Glanville assisted both of my tries, I owe him a pint after this.\n\"You look at the table, there are eight or nine teams who could finish in the top four, so every game is massive.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/c8j0z7wzmn1o"}