{"authors": ["Nick Mashiter", "www.facebook.com"], "date_download": "2025-04-26 07:40:09", "date_modify": "2025-04-26 07:40:09", "date_publish": "2025-02-27 12:38:21", "description": "Boss Ruud Van Nistelrooy admits Leicester's public disagreements cannot happen again.", "filename": "sport_football_articles_clyrrger0y0o_1745653209.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2507/live/1451a420-f4fe-11ef-9808-4d9b058d1a40.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_clyrrger0y0o_1745653209.html", "title": "Leicester City: Ruud van Nistelrooy wants unity at West Ham", "title_page": "Leicester City: Ruud van Nistelrooy wants unity at West Ham - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Boss Ruud Van Nistelrooy admits Leicester's public disagreements cannot happen again.\nMads Hermansen and midfielder Boubakary Soumare argued on the pitch after Fabio Carvalho scored Brentford's final goal in Friday's 4-0 defeat to the Bees.\nThe second-bottom Foxes go to West Ham on Thursday looking to close the five-point gap to safety after Wolves lost to Fulham on Tuesday.\nVan Nistelrooy, who has lost 10 of his last 11 Premier League games, now only wants displays of unity.\nHe said: \"We have to address this type of behaviour. As a team it's good to hold each other accountable. But it can't be like that, out in the open.\n\"It was the first time it's happened. The players handled it themselves, within the team, so that was a good reaction in the dressing room.\n\"This week it's been assessed and it's not something that will help us going forwards. I can't see that happening again. The players know.\n\"I didn't think it was a huge incident but it was something we discussed. The players handled it and, for me, it's a finished matter.\"\nAfter the defeat to Brentford, Van Nistelrooy described Leicester's situation as alarming and he will continue to honest as the Foxes need to face reality.\n\"The situation we are in is alarming because we want to stay in the league,\" said the former Manchester United and Real Madrid striker.\n\"But it's also the reality of where we are in comparison to the competition we face. In that context, I try to explain how I see the challenge we are facing.\n\"At the same time, we are so motivated and we believe we can go against all odds, because that's what we have to do. It's possible. It's been done before at this club.\"", "url": "https://www.bbc.co.uk/sport/football/articles/clyrrger0y0o"}