{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:44:49", "date_modify": "2025-05-21 06:44:49", "date_publish": "2025-03-30 17:57:47", "description": "Bournemouth 1-2 Man City: What Andoni Iraola said", "filename": "sport_football_articles_ce84d364714o_1747809889.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/fdb0/live/71732a70-0d90-11f0-80e2-6f5e46851467.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ce84d364714o_1747809889.html", "title": "Bournemouth 1-2 Man City: What Andoni Iraola said", "title_page": "Bournemouth 1-2 Man City: What Andoni Iraola said - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Bournemouth manager Andoni Iraola has been speaking to ITV after today's FA Cup defeat: \"I think the game first half we played very well but second half the game was for them. We couldn't keep the same intensity level, we were not as aggressive and we were a lot more passive.\n\"Even with the changes, we were lacking energy, especially up front. We were not able to play at the same level we did in the first half.\"\nOn whether Kepa should have saved Omar Marmoush's goal: \"Yes probably. There is a chance but overall I don't think we lost because of this. Overall I think we were better in the first half, we played the game we wanted to play but second half they were better and we couldn't affect the long possessions. We were not dangerous enough.\"\nOn whether the injuries/suspensions in the side had a negative impact on the side today: \"Yes. It isn't just the starting eleven. It gives you good options from the bench to give us the same level. I felt David Brooks, Evanilson, after 50 minutes or something - they can play but they don't play at the same intensity level, the press is not the same as before. We couldn't maintain that level.\"", "url": "https://www.bbc.com/sport/football/articles/ce84d364714o"}