{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:13:49", "date_modify": "2025-05-19 15:13:49", "date_publish": "2015-02-18 20:50:20", "description": "Jockey Jason Maguire could miss the Cheltenham Festival next month after being given a 14-day ban at Ludlow.", "filename": "sport_horse-racing_31527343_1747667629.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/73521000/jpg/_73521998_73521997.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_horse-racing_31527343_1747667629.html", "title": "Cheltenham: Jason Maguire could miss festival after two-week ban", "title_page": "Cheltenham: Jason Maguire could miss festival after two-week ban - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jockey Jason Maguire could miss next month's Cheltenham Festival after being given a 14-day ban under the 'non-triers' rule at Ludlow on Wednesday.\nThe 2011 Grand National winner, external finished seventh on the Ben Pauling-trained Born To Succeed in the Onny Maiden Hurdle.\nMaguire is due to be banned from 4-17 March, which means he would miss the four-day Festival starting on 10 March.\nThe 34-year-old said: \"I have no comment to make but I'm definitely going to appeal.\"\nMaguire, who missed Cheltenham last year because of injury, was found guilty by stewards of \"schooling/conditioning the horse on the racecourse\".\nTrainer Hauling was also found guilty and fined £3,000. He, too, said he would appeal against the decision.\nBorn To Succeed, a five-year-old gelding, was banned from running in any race for 40 days.\nMaguire's mount finished 23 and three-quarter lengths behind the winner, 20-1 shot King Alfonso.\nThe British Horseracing Authority said in a statement: \"The rider stated that his instructions were to drop the gelding in and get him settled and then to do his best work late on.\n\"He further added that the gelding became very tired at the entrance to the home straight, was not quick enough to take any gaps and did not jump well in the closing stages. He therefore felt it prudent to keep a good hold of the horse.\n\"The trainer confirmed that the rider had ridden in accordance with his instructions and added that Born To Succeed is an extremely nervous horse at home.\"", "url": "https://www.bbc.com/sport/horse-racing/31527343"}