{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:16:16", "date_modify": "2025-05-21 06:16:16", "date_publish": "2024-12-26 00:00:00", "description": "Score updates and text commentary from games across League One and League Two, including Birmingham City v Burton Albion and Wrexham v Blackpool.", "filename": "sport_football_live_cg520rj2jmmt_1747808176.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cg520rj2jmmt_1747808176.html", "title": "EFL League One & Two LIVE: Score updates and text commentary from 24 matches", "title_page": "EFL League One & Two LIVE: Score updates and text commentary from 24 matches - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Goodbye from us\n#bbcefl\nWhat an action packed Boxing Day it's been in Leagues One and two, with a couple of West Midlands sides sitting pretty at the top of the third and fourth tiers respectively.\nBirmingham picked up their eighth victory in a row after overcoming Burton to sit a point adrift on top of the League One tree.\nAnd in League Two Walsall continued their good form to go nine points clear at the top of the table after their win over Doncaster. It's now 12 league games unbeaten and five wins on the spin for the Saddlers - who have a game in hand on their rivals, too.\nWe'll be back on Sunday for more thrills and spills in the EFL.\nThanks as ever for joining us and enjoy your Boxing Day evening.\nCarlisle drop to the bottom\n#bbcefl\nVictory for Colchester United and Fleetwood Town saw those two sides progress in the League Two table.\nBarrow were well beaten by Salford City and Newport County conceded five at Bromley as the two of them sunk lower down in the table.\nThe top part of the bottom half of the table remains incredibly tight, Colchester, Fleetwood, Barrow and Newport all have 26 points.\nCarlisle were defeated by Morecambe in a 1-0 defeat that means they now drop down to the bottom of the table.\nWalsall lead the way\n#bbcefl\nIt was a Boxing Day to remember for Walsall as they claimed a big three points over Doncaster Rovers and both Port Vale and Crewe lost in their respective games.\nThe gap for Mat Sadler's side is now nine points to second placed Port Vale.\nWith Chesterfield losing to Fleetwood and AFC Wimbledon drawing with Swindon Town, the Dons climb up into fifth position in the table.\nSalford City and Bradford City both won to move them up into ninth and tenth in the table respectively.\nSalop rise off the bottom spot\n#bbcefl\nA tough day for Burton carries an extra wound as Shrewbury's win over ninth place Lincoln City takes them off the bottom and sinks the Brewers.\nCrawley Town's defeat in the early kick-off means they are unable to escape the bottom four while Stevenage and Peterborough all take a tumble downwards.\nBut perhaps it will be Blackpool most aggrieved by today's outcomes after a controversial penalty decision goes against them and sends them into the bottom 10.\nTop four continue to thrive\n#bbcefl\nA great day for the top four sees them all gain three points and drift ahead of the pack while Stockport's loss to Huddersfield sees them stay in fifth place but fall off the pace.\nReading's big win over Northampton Town means they rise to sixth while Mansfield's return to form sees them back in contention for the play-offs in eighth.\nBarnsley's late win puts them up to seventh but losers Bolton drop down to 10th.\nWhile Lincoln City fail to get anything from basement dwellers Shrewsbury Town to see them drop to ninth.\nLeague Two full-time headlines\nBromley put five past Newport in an action-packed encounter that sees them extend their undefeated run in all competitions to eight games.\nPort Vale failed to put any pressure on league leaders Walsall as they suffered a 2-1 defeat at Bradford that was capped off with Tom Sang seeing red in added time.\nThe dismissals kept coming, this time it was Tyrese Fornah for Salford, luckily his first-half goal helped the Ammies claim a 3-0 win against Barrow.\nMK Dons were beaten at home by Notts County with goals from George Abbot and Dan Crowley rounding off a solid victory for the Magpies.\nLeague One full-time headlines\nA goal in the 89th minute from Adam Phillips saw Barnsley take all three points against Bolton, springing them into a playoff place.\nExeter came from a goal behind to beat Bristol Rovers 3-1 as Rovers new manager Inigo Calderon watched on from the stands.\nKevin Nolan suffered a heavy defeat in his first game in charge of Northampton as they lost 4-1 to Reading, however.\nMansfield took three points on the road against Peterborough scoring three goals against a ten-man Posh after George Nevett was dismissed for the home side.\nFULL-TIME\nWrexham 2-1 Blackpool\nA controversial penalty decision gives Wrexham the win in a tight game that ends with plenty of sting for a competitive Blackpool.\nA handball decision goes Wrexham's way but it's one that might not ring true after a second look.\nSteven Fletcher hit the ball home from the spot to see Wrexham stay within three points of the top of the table.\nThe referee is given an earful from captain James Husband, Blackpool boss Steve Bruce shakes his head with disappointment and the away fans head home feeling robbed of a sixth game undefeated.\nLeague Two latest\nCheltenham lead Crewe 2-1 through Joel Colwill and Newport are determined to make a game of it against Bromley as they now trail 4-2.\nColchester have doubled their lead against Gillingham thanks to John- Kymani Gordon\nSalford's Tyrese Fornah has gone from hero to zero and from goal scorer to dismissed as he sees red against Barrow and Fleetwood have doubled their lead against a Chesterfield side that has won four of their past five before today.", "url": "https://www.bbc.com/sport/football/live/cg520rj2jmmt"}