{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:59:48", "date_modify": "2025-05-19 14:59:48", "date_publish": "2017-07-03 20:51:59", "description": "New Saints interim manager Scott Ruscoe says his side will be on the front foot in their Champions League qualifier against FC Europa.", "filename": "sport_football_40485952_1747666788.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/13234/production/_96788387_ruscoe.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_40485952_1747666788.html", "title": "Champions League: New Saints face 'cup final' - Scott Ruscoe", "title_page": "Champions League: New Saints face 'cup final' - Scott Ruscoe - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "New Saints interim manager Scott Ruscoe says his side's Champions League first qualifying round, second leg against FC Europa will be \"like a cup final.\"\nThe Welsh champions rtrail 2-1 to the Gibraltese side, who host the second leg at the Estadio Algarve in Portugal.\n\"We're playing in a ground that's not home to them and they've had to travel as well,\" Ruscoe told BBC Wales Sport.\n\"It's like a one-off cup final for me and that's exactly how we'll treat it.\"\nSaints' Champions League hopes are hanging by a thread after defeat in the first leg at Park Hall.\nAlex Quillo gave the Gibraltese side an early lead but Scott Quigley levelled for the home side before Kike Gómez sealed victory late in the game.\nRuscoe was disappointed with his side's first leg performance but is confident his side can secure a second qualifying round tie against Croatian side HNK Rijeka.\n\"There's a couple of things we are going to tweak in our game but we won't be changing a great deal,\" Ruscoe said.\n\"We'll be on the front foot, be positive and looking to turn the tie around.\n\"We're only one behind in the tie and we feel we can score two, three, four goals away from home.\"", "url": "https://www.bbc.com/sport/football/40485952"}