{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:23:35", "date_modify": "2025-05-19 14:23:35", "date_publish": "2015-03-20 13:17:11", "description": "Substitute Richard Chaplow scores in injury time as Ipswich grab three points against high flying Watford at Vicarage Road.", "filename": "sport_football_31882510_1747664615.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81821000/jpg/_81821710_richardchaplow.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31882510_1747664615.html", "title": "Watford 0-1 Ipswich Town", "title_page": "Watford 0-1 Ipswich Town - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Substitute Richard Chaplow scored in injury time to earn Ipswich three points against high-flying Watford.\nA tight first half yielded few chances with Heurelho Gomes' save from Town striker Luke Varney's shot the nearest either side came to a breakthrough.\nWith the game drifting towards a draw the substitutes combined to find a goal when Freddie Sears set up Chaplow to finish past Gomes.\nWatford, who had no shots on target, stay second in the Championship.\nThe home side had won six of their previous seven games at Vicarage Road but struggled to break down a resilient Ipswich side in the first half, with Adlene Guedioura's 25-yard shot over the bar the closest they came.\nWith the midfields cancelling each other out chances were at a premium, but Hornets' goalkeeper Gomes had to be alert to turn Varney's effort wide after he cut in from the right.\nIpswich's midfield continually broke up play and Mick McCarthy's side did threaten the goal with Sears' long-range attempt, which was followed by Luke Chambers' header from the resulting corner.\nWatford's best chance fell to Odion Ighalo, who turned and shot over the bar at the near post after Troy Deeney burst down the right-hand side.\nIpswich shut the Championship's second-top scorers down excellently throughout and executed their counter-attacking game-plan with a minute remaining.\nSears raced away from the Hornets' defence before squaring to Chaplow, who placed a right-footed finish into the bottom corner.\nThe win ended a run of six games unbeaten for Watford and moves McCarthy's side into the play-offs, after Brentford were held by Millwall.\nWatford head coach Slavisa Jokanovic:\n\"It's disappointing and with the game we lost today it's a normal emotion. We've won many games in the past in the last minute and today we lost the game.\n\"I accept, first of all, this is my responsibility because I don't want to close the game out and we're looking for a way to try and win it.\n\"I made a mistake, my team made a mistake in the last moments and we lost one point.\"\nIpswich boss Mick McCarthy:\n\"With seven games to go, it's a huge result for us, it's fabulous and we're back in the top six.\n\"I thought it was a really top tactical performance as much as anything against a team that try and play through you.\n\"We had to change a couple of times to accommodate them and I thought we did it particularly well. It's a great victory in the last minute and it's a great finish by Chappers (Richard Chaplow). I thought all the subs contributed really well today.\"", "url": "https://www.bbc.com/sport/football/31882510"}