{"authors": ["Jane Lewis", "www.facebook.com"], "date_download": "2025-05-21 07:30:02", "date_modify": "2025-05-21 07:30:02", "date_publish": "2025-05-20 16:35:47", "description": "Who makes the final SWPL team of the week of the season?", "filename": "sport_articles_ce9v27493geo_1747812602.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/04e2/live/6bfba380-3598-11f0-8947-7d6241f9fce9.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_ce9v27493geo_1747812602.html", "title": "Who makes the final SWPL team of the week of the season?", "title_page": "Who makes the final SWPL team of the week of the season? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Noa Schumacher (Hibs): Made a couple of big saves early on in the title shootout match against Rangers. The one to stop Mia Macaulay as she raced through was especially impressive and it set the tone for resilient Hibs' win.\nKimberley Smit (Glasgow City): Brilliant header for City's opening goal against Hearts. Comfortable at the back too and was consistently looking to set up attacks.\nLinzi Taylor (Hibs): Scored the winning goal to seal her side's first SWPL in 18 years. And what a goal it was. The defender raced forward and her finish was exceptional. A cool volley.\nSiobhan Hunter (Hibs): When Rangers were piling on the pressure the defender put her body on the line to keep them at bay. A typical all-or-nothing performance from a key player for Hibs.\nLouise Brown (Montrose): Set up the opener against Dundee United to set Montrose on their way to a huge win as they retained their top-flight status. Also scored their fourth to seal a good end to the season.\nHayley Lauder (Glasgow City): In her 250th appearance for City, the Scotland international's influence was clear. On-point delivery for the opening goal too.\nKirsten Reilly (Hibs): Committed all afternoon, whether it was driving forward or breaking up play. Confident to have a go at goal from 30 yards and was unlucky when her effort cracked the bar.\nLucy Ashworth-Clifford (Celtic): Scored two and provided two assists in the thrashing of Motherwell. Her second strike was all about great pressure and persistence.\nNicole Kazlova (Glasgow City): Great awareness and positioning as she grabbed city's second goal. Could have had more too, was a constant threat.\nKathleen McGovern (Hibs): The striker's commitment was exemplified when she set up the winning goal. She chased the ball, did brilliantly to keep it in play, then floated in a great ball for Taylor. The 22-year-old has had an amazing season and deserved to play a part in such a big goal.", "url": "https://www.bbc.com/sport/articles/ce9v27493geo"}