{"authors": ["Emlyn Begley", "www.facebook.com"], "date_download": "2025-05-20 12:10:17", "date_modify": "2025-05-20 12:10:17", "date_publish": "2023-08-05 08:14:19", "description": "BBC Sport looks at six new imports to English football who could hit the ground running this season.", "filename": "sport_football_66370752_1747743017.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/C332/production/_130607994_gettyimages-1555328792.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66370752_1747743017.html", "title": "Premier League summer signings: Six new recruits hoping for immediate impact", "title_page": "Premier League summer signings: Six new recruits hoping for immediate impact - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The Premier League starts next week and there will be a lot of new signings looking to make an early impression.\nBBC Sport looks at six new imports to English football who could hit the ground running and have a real impact.\nAston Villa pulled off a coup by signing Bayer Leverkusen and France winger Moussa Diaby, 24, for a reported club record £51.9m.\nDiaby, one of the quickest players in Germany,, external can play anywhere across the front line; he scored 49 goals and made 48 assists in his 173 games for Leverkusen.\nLast season, he was involved in more Bundesliga goals than any of his team-mates, scoring nine times himself and providing eight assists.\nNobody created better chances from open play in the German top flight than Diaby in 2022-23. He assisted shots with an expected goals value of 7.92, more than one point clear of anybody else.\nDiaby - who has 10 caps for France - has two goals for Villa in pre-season, netting against Premier League sides Brentford and Fulham in the USA.\nBut boss Unai Emery admits he and his staff still have to work out Diaby's best position.\nDeep-lying playmaker Mahmoud Dahoud, 27, joined Brighton on a free transfer this summer after leaving Borussia Dortmund.\nHe will play in a potentially new-look Albion midfield, with James Milner joining from Liverpool, Alexis Mac Allister going to the Reds and Chelsea trying to sign Moises Caicedo.\nDahoud won two caps for Germany, both in 2020, and played 141 times for Dortmund, although just 10 of them came last season following shoulder surgery.\nIn 2021-22, the last season during which he played regularly, he had more attacking sequence involvements per 90 minutes than any other Dortmund player in the league - 4.9. That includes shots, chances created and build-up.\nDahoud was much sought after when he left Borussia Monchengladbach for Dortmund in 2017 and has put in some impressive performances for Albion in their pre-season fixtures in the USA.\nFrance forward Christopher Nkunku could be one of the Premier League's standout players this season after signing from RB Leipzig for £52m.\nThe versatile 25-year-old scored 58 goals for the Bundesliga club in the past two seasons and the Blues will hope he is the answer to their striking problems.\nDespite missing nine games with an injury that kept him out of the World Cup, he still finished joint top scorer in last season's German top flight with 16 goals.\nThe previous campaign he was named the Bundesliga's player of the year despite being outscored by Robert Lewandowski and Erling Haaland.\nHe was a winger or number 10 when he joined Leipzig from Paris St-Germain in 2019 but has been used as a striker in recent times, and Mauricio Pochettino may well see that as his position at Stamford Bridge.\nThe former PSG forward has scored three goals in pre-season for Chelsea, finding the net once against each of Wrexham, Brighton and Fulham.\nHe injured his knee in a friendly against Borussia Dortmund, with Pochettino saying \"hopefully it is not a big issue\".\nHungary captain Dominik Szoboszlai, 22, will be a key part of the Reds' new-look midfield this season along with Argentina World Cup winner Mac Allister.\nWith captain Jordan Henderson and defensive midfielder Fabinho moving to Saudi Arabia and Naby Keita, James Milner and Alex Oxlade-Chamberlain leaving on free transfers, the centre of the park has undergone a full overhaul.\nSzoboszlai, a £60m signing from Leipzig, played as a winger for most of his time in the German Bundesliga, but is more likely to play as one of the attacking midfielders at Anfield.\nOnly two players created more chances in open play than Szoboszlai's 47 in the Bundesliga last season. He also played the pass before a chance was created 41 times - more than anybody else.\nHe missed a few days of pre-season after hurting his ankle but has still featured in the Reds' midfield.\nHopefully his new club learn to spell his name soon - as his shirt had the name 'Szosbozlai', putting the middle s in the wrong place, during a friendly against Bayern Munich played in Singapore.\nNewcastle United made midfielder Sandro Tonali, 23, Italy's most expensive footballer when they signed him from AC Milan.\nTonali helped Milan win Serie A in 2021-22 and was part of the side that reached last season's Champions League semi-finals.\nA battling but technically gifted player, he is capable of playing as an attacking or a defensive midfielder. He created more chances in Serie A than any of his Milan team-mates last season (62).\nTonali has already caught the eye in some of the Magpies' pre-season games.", "url": "https://www.bbc.com/sport/football/66370752"}