{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:04:26", "date_modify": "2025-04-26 04:04:26", "date_publish": "2025-03-03 19:05:42", "description": "Former Ireland international Donncha O'Callaghan believes Garry Ringrose's Six Nations red card against Wales \"holds a massive mirror\" up to rugby's disciplinary processes.", "filename": "sport_articles_cpv4k34pnmxo_1745640266.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8fcd/live/4ea0ec30-f83c-11ef-9241-f1bc6b2390b0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cpv4k34pnmxo_1745640266.html", "title": "Six Nations: Ireland 'incredibly lucky' over Garry Ringrose ban believes former lock Donncha O'Callaghan", "title_page": "Six Nations: Ireland 'incredibly lucky' over Garry Ringrose ban believes former lock  Donncha O'Callaghan - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Former Ireland international Donncha O'Callaghan believes Garry Ringrose's Six Nations red card against Wales \"holds a massive mirror\" up to rugby's disciplinary processes.\nIreland centre Ringrose was dismissed for a high tackle on Ben Thomas in the Principality Stadium last month but will sit out just one championship game, his side's hosting of France in Dublin on Saturday.\n\"If we're going to give the bans, we need to stand by them. Otherwise we're undermining all our officials,\" said O'Callaghan on Rugby Union Weekly.\n\"We [Ireland] are incredibly lucky to have Garry back on the pitch so soon.\n\"Nothing towards him. He's an incredible player, not a bit dirty, an incredible guy, but that went wrong.\n\"To see the way the citing went is disappointing.\"\nRingrose's three-game ban came after the mid-range entry point of a six week/match suspension was reduced by 50% taking into account his guilty plea and previous disciplinary record.\nA further game will be taken off should Ringrose complete World Rugby's Coaching Intervention Programme.", "url": "https://www.bbc.co.uk/sport/articles/cpv4k34pnmxo"}