{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:25:08", "date_modify": "2025-05-21 05:25:08", "date_publish": "2025-04-03 14:05:58", "description": "Prolific former Stoke City and Crewe Alexandra forward Johnny King passes away at the age of 92.", "filename": "sport_football_articles_cly1jxp66e3o_1747805108.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/de23/live/4988df80-108f-11f0-94b3-d3222284d093.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cly1jxp66e3o_1747805108.html", "title": "Johnny King: Stoke City and Crewe Alexandra mourn prolific forward's death", "title_page": "Johnny King: Stoke City and Crewe Alexandra mourn prolific forward's death - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Near-neighbours Stoke City and Crewe Alexandra are mourning the death of former Potters forward Johnny King at the age of 92.\nKing scored 113 goals in 311 Stoke appearances in the 1950s, placing him fifth in the list of the club's all-time scorers.\nHe came through the ranks at Crewe Alexandra before moving to the Victoria Ground in 1953 to lead the line for Stoke in Division Two for eight seasons, finishing as top scorer on three occasions.\nThe left-footer moved to Division One club Cardiff in 1961 before returning to Gresty Road the following year and helping the Railwaymen earn promotion.\nHe played a further four years before hanging up his boots in 1967.\nA Potters statement read:, external \"We send our thoughts and sincere condolences to Johnny's family and friends at this sad time.\"\nCrewe, meanwhile, described King, who scored 185 goals in 591 games across his two spells with the Alex, as \"one of the best players to ever wear the red shirt\".\n\"He continued to be a familiar and much-loved presence at Gresty Road and in the local area long after his retirement,\" their tribute added.\n\"The thoughts and condolences of everybody at Crewe Alexandra are with Johnny's friends and family at this difficult time.\"", "url": "https://www.bbc.com/sport/football/articles/cly1jxp66e3o"}