{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:27:34", "date_modify": "2025-05-20 13:27:34", "date_publish": "2023-07-24 10:09:11", "description": "Dai Young leaves his Cardiff director of rugby role as investigation into bullying allegations finds \"insufficient evidence\".", "filename": "sport_rugby-union_65558969_1747747654.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/DC50/production/_129700465_cdf_150123_cf_cardiff_v_newcastle_045.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-union_65558969_1747747654.html", "title": "Dai Young: Cardiff exit agreed after 'insufficient evidence' found to support bullying claims", "title_page": "Dai Young: Cardiff exit agreed after 'insufficient evidence' found to support bullying claims - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Dai Young has left as Cardiff director of rugby role despite an investigation into bullying allegations finding \"insufficient evidence\".\nYoung was suspended on 20 April but denied the accusations and an independent investigation was launched.\nA barrister concluded there was insufficient evidence to support any allegations.\nHowever, Young and Cardiff agreed to his departure after relationships became \"strained\".\nA Cardiff statement read: \"As has been widely reported in the media, on 20 April 2023, Dai Young was suspended from his role as director of rugby by Cardiff Rugby following allegations of bullying, which he categorically denied.\n\"Given the nature of these allegations and mindful of its duty of care to all employees, Cardiff Rugby commissioned a barrister to carry out an independent investigation.\n\"Following a thorough process, the barrister concluded that there was insufficient evidence to support the allegations and that no further action should be taken in relation to them.\n\"Unfortunately, this process has caused strain on the working relationship between Cardiff Rugby and Dai Young.\n\"In the circumstances, regrettably, it has been mutually agreed by the parties to terminate Dai's employment contract in accordance with terms within that allow for early termination.\n\"Cardiff Rugby would like to thank Dai for his latest contribution to the club during the last two years, which culminated in the club finishing as the highest-placed Welsh club in the United Rugby Championship, which secured a return to the European Champions Cup. We wish Dai the very best with whatever the future holds for him.\n\"Work will now begin to appoint a successor and coaching team at the Arms Park with 14 weeks still remaining until the 2023-24 season kicks off.\"\nMatt Sherratt and Richie Rees have been taking Cardiff pre-season training in Young's absence with the pair the only remaining senior coaches remaining currently in the set-up.\nSince the end of last season, Cardiff have lost defence coach Richard Hodges and forwards coach to Zebre and Gloucester respectively, while set-piece specialist Duane Goodfield has also left.\nFormer Wales and Cardiff coach Rob Howley has been installed as the early favourite to become the long-term successor.", "url": "https://www.bbc.com/sport/rugby-union/65558969"}