{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:58:08", "date_modify": "2025-05-21 04:58:08", "date_publish": "2025-01-23 09:33:27", "description": "Bristol City boss Liam Manning says forward Fally Mayulu has \"interest\" from other clubs and could move in the transfer window.", "filename": "sport_football_articles_cn7gz467x8go_1747803488.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6362/live/9e235090-d96a-11ef-b576-a3407362ca93.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cn7gz467x8go_1747803488.html", "title": "Fally Mayulu: Bristol City striker has 'interest' from other clubs", "title_page": "Fally Mayulu: Bristol City striker has 'interest' from other clubs - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Bristol City forward Fally Mayulu has \"interest\" from other clubs and could move in the January transfer window, according to head coach Liam Manning.\nThe striker signed last summer from Rapid Vienna for an undisclosed fee and while he scored in his first two Championship games, only two of his 15 league appearances have been starts.\nThe 22-year-old was not in the squad for the past two games at Coventry City and Sheffield Wednesday.\n\"I think it speaks a bit around the depth we've got, Fally not travelling,\" Manning told BBC Radio Bristol.\n\"He's got interest, there's a discussion in-house to go, 'Right, what's the best for the club and for him and what does that look like?'\n\"There's interest in him but nothing concrete at the moment.\"\nThe Frenchman signed a four-year deal at Ashton Gate in the summer although Manning said in December it had \"taken him time\" to adapt to the Championship.\nHowever, he stressed he felt Mayulu would be \"important\" for the club in the future.\n\"He's massively training better now so he's definitely heading in the right direction\" Manning said at the time.", "url": "https://www.bbc.com/sport/football/articles/cn7gz467x8go"}