{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:28:23", "date_modify": "2025-05-21 07:28:23", "date_publish": "2025-03-28 19:38:48", "description": "Fulham vs Crystal Palace predictions: Chris Sutton on FA Cup tie", "filename": "sport_football_articles_c5y4ye6xyk9o_1747812503.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/561d/live/fbee38e0-d1d4-11ef-87df-d575b9a434a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c5y4ye6xyk9o_1747812503.html", "title": "Fulham vs Crystal Palace predictions: Chris Sutton on FA Cup tie", "title_page": "Fulham vs Crystal Palace predictions: Chris Sutton on FA Cup tie - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Crystal Palace won at Craven Cottage at the end of February and it is a ground where they have a decent record - they have not lost there in their past six visits, since 2005.\nIt is a boost for Palace that Jean-Philippe Mateta is available to lead their attack - he can play wearing a special mask to protect his ear after his injury against Millwall in the fifth round - but we will have to see how much he has been affected by such a horrific challenge.\nThe Eagles are a well-balanced team who seem to be improving all the time under Oliver Glasner - they have lost only two of their past 14 games.\nI have found Fulham hard to predict this season because they have been less reliable than usual at home, but they are still having a strong campaign. They are in the mix for the Champions League places, and are only three points behind fifth-placed Manchester City.\nPalace are very strong on the road but they have not played for the past three weeks - their game against Newcastle before the international break was postponed because of the Carabao Cup final.\nWe often talk about teams needing a rest, but my concern is how that break has affected their momentum.\nThis is going to be a close game, but I actually fancy Fulham to edge it. Marco Silva's side have got goals in them, and my gut feeling is that they will get through in 90 minutes.\nI just hope both managers go for it properly, and don't prioritise next week's midweek Premier League games [Fulham are at Arsenal on Tuesday and Palace travel to Southampton on Wednesday] instead of this tie.\nFulham and Palace have shown this season they have got enough quality in their strongest starting XIs to go all the way in the FA Cup, especially this year when the competition appears so open.\nThey are both in a great position to finally win a major trophy, so why not try to make history and give their fans something to celebrate?\nPalace's only previous cup success was winning the Zenith Data Systems Cup in 1991.\nI can imagine their fans enjoyed that day a lot, but lifting the FA Cup would be on a different planet, and the same goes for Fulham, who have not even been in an FA Cup semi-final since 2002.\nSutton's prediction: 2-1", "url": "https://www.bbc.com/sport/football/articles/c5y4ye6xyk9o"}