{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:22:20", "date_modify": "2025-05-20 14:22:20", "date_publish": "2023-07-29 08:10:08", "description": "Manchester City: Nathan Ake signs new contract to 2027", "filename": "sport_articles_czqy83n4dz4o_1747750940.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/35ab/live/2729a500-2de7-11ee-9a65-45d5b11d79ed.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_czqy83n4dz4o_1747750940.html", "title": "Manchester City: Nathan Ake signs new contract to 2027", "title_page": "Manchester City: Nathan Ake signs new contract to 2027 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Nathan Ake has said he is focusing on making Manchester City supporters \"proud\" after signing a two-year extension to his contract at the club.\nThe Netherlands defender, 28, has committed himself to Etihad Stadium until 2027.\nAke made 41 appearances last season as City won the Treble, and has featured 81 times since arriving from Bournemouth for £40m in August 2020.\n\"This is the best club in the world, I have no doubts about that. Being a Manchester City player makes me incredibly proud every single day.\n\"It’s a football club that expects excellence in every area, which makes for the perfect environment to improve. It drives me on and makes me better. I am at the stage of my career where I want to keep developing, and I can definitely do that here.\n\"Pep [Guardiola] is the best manager in football – a genius who has made me see the game differently. To be able to work with him for longer is a real privilege. I am so grateful to him for everything he has done for me, both personally and professionally.\n\"I also want to thank the City fans for their support. I have really felt it since I came here, and it helps me so much. My focus now is on making them proud and winning more trophies.\"", "url": "https://www.bbc.com/sport/articles/czqy83n4dz4o"}