{"authors": ["Coral Barry", "www.facebook.com"], "date_download": "2025-05-21 03:43:47", "date_modify": "2025-05-21 03:43:47", "date_publish": "2025-01-19 08:33:22", "description": "Islam Makhachev stopped Renato Moicano to retain his UFC lightweight title in stunning fashion at UFC 311 in California.", "filename": "sport_mixed-martial-arts_articles_cjde3zpj383o_1747799027.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8459/live/2fbb0090-d635-11ef-bbcb-e18188e71859.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_mixed-martial-arts_articles_cjde3zpj383o_1747799027.html", "title": "UFC 311: Islam Makhachev breaks Khabib Nurmagomedov's record with win over Renato Moicano", "title_page": "UFC 311: Islam Makhachev breaks Khabib Nurmagomedov's record with win over Renato Moicano - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Islam Makhachev submitted Renato Moicano in one round to successfully retain his lightweight title at UFC 311 and set a new record.\nThe Russian has now defended his belt four times in a row, a first in the UFC.\nThe record was previously jointly held by legends Khabib Nurmagomedov, Benson Henderson and BJ Penn, who all managed three defences.\nMakhachev, 33, staked his claim as the UFC's pound-for-pound best with an unstoppable performance on Saturday night in Inglewood, California.\n\"I like this belt,\" Makhachev said. \"If somebody wants this belt, come to the cage.\"\nNurmagomedov was in Makhachev's corner, having taken on a coaching role since retiring from fighting.\nBrazil's Moicano, 35, stepped in on 24 hours' notice on Friday, but he was no match for the dominant champion.\nLess than a minute had passed after the first bell when Makhachev trapped a struggling Moicano in a brabo choke, forcing the challenger to tap almost immediately.\n\"I'm always looking for the finish,\" Makhachev said.\n\"I'm not just talk. All fight week, all my camp, all media, if my opponent gives me a small chance, I will close the night.\"\nMakhachev also extended his current winning streak to 15, improving his overall record to 27 wins and just one loss.\nUFC president Dana White acknowledged Makhachev as his personal pound-for-pound best having spent the last 12 months making the case for heavyweight champion Jon Jones.\nWhile there was joy for coach Khabib in the main event, his cousin and second fighter in a title fight on Saturday did not fare as well.\nUmar Nurmagomedov, 29, was outpointed by resilient bantamweight champion Merab Dvalishvili over five gruelling rounds.\nDvalishvili, 34, weathered an early storm and took control of the contest in the second half of the bout, helped by him setting a ferocious pace.\nAll three judges gave the fight to Dvalishvili, with scores of 48-47, 48-47 and 49-46, as the Georgian improved his record to 19 wins and four losses.\nNurmagomedov, 29, protested against the scorecards but accepted most of the rounds were \"close\" as he slumped to his first career defeat in 19 fights.\nThe Russian, who said he broke his hand in the first round, had been the favourite going into the bout.\n\"I am the machine,\" Dvalishvili said, adding that he had an infection in his leg before fight night.\n\"Umar is a tough fighter and he's good but he called me old. Yes, I'm old but I'm working every day.\n\"I'm a harder worker. The whole world was against me.\"", "url": "https://www.bbc.com/sport/mixed-martial-arts/articles/cjde3zpj383o"}