{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:24:38", "date_modify": "2025-05-21 04:24:38", "date_publish": "2025-04-07 00:00:00", "description": "Dan Ndoye's wonder goal denies Napoli the chance to close the gap on Serie A leaders Inter Milan as they draw at Bologna.", "filename": "sport_football_live_cx20ny1wk71t_1747801478.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/db45/live/062775d0-13f5-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cx20ny1wk71t_1747801478.html", "title": "Bologna 1-1 Napoli: Wonder goal stops visitors closing gap on Inter Milan", "title_page": "Bologna 1-1 Napoli: Wonder goal stops visitors closing gap on Inter Milan - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Dan Ndoye's wonder goal denied Napoli the chance to close the gap on Serie A leaders Inter Milan as they hung on for a point away at Bologna on Monday evening.\nThe visitors were looking to capitalise on Inter's 2-2 draw with Parma on Saturday, knowing a win would have reduced the deficit to a single point with seven games remaining.\nDespite the absence of suspended manager Antonio Conte, Napoli looked like doing just that when Andre-Frank Anguissa produced a mazy run before going round Lukasz Skorupski and finishing in the 18th minute.\nMateo Politano almost doubled the visitors' lead after rounding replacement keeper Federico Ravaglia - on for the injured Skorupski - but the substitute recovered well to block.\nBologna dominated the second half as Napoli sat back, and their pressure told when Ndoye equalised with a remarkable finish in the 64th minute.\nThe Switzerland forward ran across the six-yard box to meet Jens Odgaard's low left-wing cross at the near post, flicking the ball with his left heel and sending it over Napoli goalkeeper Simone Scuffet and in off the crossbar.\nBologna could have snatched all three points in the 90th minute when Scuffet palmed Emil Holm's header straight to Santiago Castro, but the substitute somehow bundled wide from two yards out.\nNapoli then almost won the game themselves when Amir Rrahmani's stoppage-time effort across the face of goal evaded Romelu Lukaku and Anguissa.\nThe draw means Napoli remain second in the table and trail Inter by three points, while in-form Bologna miss the chance to leapfrog Atalanta in third.", "url": "https://www.bbc.com/sport/football/live/cx20ny1wk71t"}