{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:34:34", "date_modify": "2025-04-26 07:34:34", "date_publish": "2025-02-27 15:38:52", "description": "Plymouth Argyle head coach Miron Muslic says it will be \"the biggest honour of my life\" to take on Manchester City boss Pep Guardiola in the FA Cup.", "filename": "sport_football_articles_cd7eeyg4z3wo_1745652874.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/574f/live/4550f3b0-f51b-11ef-a276-596f7e6218f8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cd7eeyg4z3wo_1745652874.html", "title": "FA Cup: Pep Guardiola is 'a giant' and facing Manchester City boss an 'honour' for Plymouth boss Miron Muslic", "title_page": "FA Cup: Pep Guardiola is 'a giant' and facing Manchester City boss an 'honour' for Plymouth boss Miron Muslic - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Plymouth Argyle head coach Miron Muslic says it will be \"the biggest honour of my life\" to take on Manchester City boss Pep Guardiola in the FA Cup.\nMuslic succeeded Wayne Rooney as Argyle boss in January and guided the Pilgrims to a 1-0 win over runaway Premier League leaders Liverpool in the last round.\nThe Bosnian-born Austrian has guided Argyle off the bottom of the Championship and to within three points of safety, before their next league game on Tuesday against Hull City - the side immediately above them in the table.\nThe former Cercle Brugge boss says former Barcelona and Bayern Munich boss Guardiola, who has guided City to six Premier League titles, two FA Cups, four EFL Cups and the 2023 Champions League, is someone he looks up to.\n\"I think he's a giant in our sport, a giant as a coach,\" Muslic told BBC Radio Devon.\n\"I think he's one of the most successful coaches in sports history, one of the most successful coaches in football history.\n\"It's the biggest honour in my life, in my career as a coach, so I'm very much looking forward to shaking his hand and telling him that he's a giant of our sport and a huge, huge role model for every single coach in the world.\"\nArgyle beat a much-weakened Liverpool side at Home Park in the fourth round earlier this month, but are likely to face a stronger City team in round five.\nWith Guardiola's team knocked out of the Champions League last week and 20 points off Liverpool with 11 games to play, the FA Cup represents Manchester City's only realistic chance of silverware until this summer's revamped Club World Cup.\nMuslic says he and his staff have studied City and have a plan to try to cause another upset - and their third win against a top-flight side in the FA Cup this season, after beating Brentford 1-0 in the third round last month.\n\"The team has dominated the Premier League for the last seven or eight years, so it truly feels like something very, very big and truly feels like a reward,\" Muslic said of his side's challenge at the Etihad on Saturday.\n\"We're going to try to enjoy this, it's a fantastic opportunity, it's a big stage to represent Argyle - the best possible - and we see this as a massive opportunity.\n\"It's tough, it's a big game for all the players, but it's a big game for us as an organisation and a wonderful one, especially for the Green Army.\"\nBut while the FA Cup has its magic, the league is still the priority for Argyle.\nThe Pilgrims have one of the smallest budgets in the second tier and survived on the final day of last season - having beaten Ipswich Town and Sheffield Wednesday to the League One title in 2023.\nHaving struggled under former England captain Rooney, Muslic has revitalised Argyle - shoring up what was the worst defence in the EFL to oversee a run of just one defeat in their past seven matches.\nDespite the excitement of a trip to Manchester City, Muslic is firm in his belief that Tuesday's Championship game at relegation rivals Hull City is a bigger deal.\n\"I've not only half an eye, I have both eyes on Hull City,\" he said.\n\"We will try again to manage and find the right balance between having this beautiful adventure in front of us, like Liverpool and now City, and finding the right balance to be super competitive just three nights later against Hull.\n\"We as staff have found a good way to manage this and to rebalance the team after Liverpool to face Millwall, and I think we will need the same approach again, but in terms of the importance of the games Hull is way more important for us.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cd7eeyg4z3wo"}