{"authors": ["Caroline Chapman", "www.facebook.com"], "date_download": "2025-05-19 14:41:10", "date_modify": "2025-05-19 14:41:10", "date_publish": "2017-08-18 13:09:51", "description": "Ten-man West Ham twice come from behind but Charlie Austin's injury time penalty gives Southampton their first victory under Mauricio Pellegrino.", "filename": "sport_football_40908330_1747665670.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0F36/production/_97449830_gettyimages-835499272.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_40908330_1747665670.html", "title": "Southampton 3-2 West Ham United", "title_page": "Southampton 3-2 West Ham United - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ten-man West Ham twice came from behind but Charlie Austin's injury time penalty gave Southampton their first victory under Mauricio Pellegrino.\nHaving failed to score in their last six home matches, Saints took the lead after only 10 minutes when Manolo Gabbiadini side-footed past Joe Hart.\nWest Ham's problems then spiralled, as Marko Arnautovic was sent off for elbowing Jack Stephens, before Dusan Tadic made it 2-0 from the penalty spot after Jose Fonte brought down Steven Davis.\nSummer signing Javier Hernandez thought he had snatched an unlikely comeback for the visitors with two goals from close range either side of half time.\nBut the Hammers conceded a second penalty when Pablo Zabaleta bundled into Maya Yoshida and substitute Austin coolly slotted past Hart.\nReferee Lee Mason had some important decisions to make throughout the dramatic match at St Mary's - and he got most of them right.\nMason was left with little choice but show a straight red to Arnautovic on 33 minutes, after the Hammers' record signing needlessly raised his elbow into Stephens' neck. The Austria international later apologised to the fans for his dismissal.\nThe first penalty was also an easy one to give, as former Saints defender Fonte pulled down Davis, but the second spot-kick in the 91st minute was a more contentious matter.\nZabaleta caught a rising Yoshida in the back, as he went to head the ball from close range, and Mason decided the Hammers defender had impeded his Southampton counter-part.\nWest Ham had earlier had a handball appeal against Stephens waved away, while the referee did not punish Mark Noble for his rash challenge on Saints midfielder Mario Lemina, who was making his debut following his £18.1m move from Juventus.\nBefore facing the Hammers, Southampton had not scored on home soil since 5 April - 576 minutes of football.\nThey had 29 shots against Swansea last week, landing only two on target in their goalless draw, so there was a collective sigh of relief around St Mary's when Gabbidani slotted home after Nathan Redmond's through ball.\nSaints were only able to score from open play once during the match, but Gabbiadini and Redmond both went close with long-range efforts.\nSubstitute Shane Long had the ball in the net in the second-half but referee Mason had already blown for a foul on goalkeeper Hart in the build-up.\nMarko Arnautovic posted a message on social media after the game: \"I want to apologise to all of the West Ham fans. Just want to let you know that I didn't want to let me team down and you fans. A big apology to you all.\"\nWest Ham manager Slaven Bilic on Arnautovic's sending off: \"It is a big blow because you have to play with 10 men for a big part of the game. We have spoken about everything and that will stay inside the dressing room.\"\nSouthampton manager Mauricio Pellegrino: \"It was a difficult game because we had everything under control after a sending off and two goals. This is football.\n\"West Ham are a strong team and they won a lot of balls in our box. It was a nice game to see, but difficult for a manager to be in.\"", "url": "https://www.bbc.com/sport/football/40908330"}