{"authors": ["Bobbie Jackson", "www.facebook.com"], "date_download": "2025-05-21 06:57:41", "date_modify": "2025-05-21 06:57:41", "date_publish": "2025-02-08 08:56:34", "description": "Cool, calm and collected, heavyweight Otto Wallin is happy to take everything in his stride but knows he needs to take some risks to achieve the ultimate reward of becoming a world champion.", "filename": "sport_boxing_articles_cr7epz94x2go_1747810661.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/01da/live/685036c0-e60f-11ef-af01-096ba6900a39.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_boxing_articles_cr7epz94x2go_1747810661.html", "title": "Wallin aims to end Sweden's 65-year wait for heavyweight world champion", "title_page": "Chisora v Wallin: Otto Wallin aims to end Sweden's 65-year wait for heavyweight world champion - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cool, calm and collected, heavyweight Otto Wallin is happy to take everything in his stride but knows he needs to take some risks to achieve the ultimate reward of becoming a world champion.\nWallin's nickname 'All In' seems to contrast hugely with his quiet and reserved persona outside the ring. However, he is a different character once he steps through the ropes.\n\"It's about risk and reward,\" Wallin told BBC Sport.\n\"When you get an offer for a good fight, that's what you have been waiting for so you are going to take it. I think I have a smart team around me that advise me.\n\"I haven't won all of them, but I always believe I learn and can get better.\"\nWallin, 34, headlines at Manchester's Co-op Live Arena against Derek Chisora on Saturday in a bout that has been elevated to an IBF title eliminator, with the victor in line to face either champion Daniel Dubois or Joseph Parker, who square off on 22 February in Riyadh.\nSweden has not celebrated a heavyweight world champion since Ingemar Johansson in 1960. Wallin believes \"it's time we have another one\".\nThe build-up for the event billed as 'The Last Dance' has largely centred around Chisora, who will make his 49th ringwalk and last on UK soil, with the 41-year-old planning to retire after his 50th bout overseas.\nFor Wallin, he is happy to allow his rival to take the limelight as he focuses on the job in hand.\n\"The crowd will be on his side. I like that, though. There is less pressure,\" Wallin added.\nWallin wasn't the first choice to face Chisora in the UK send-off on Saturday, with Jarrell Miller initially in negotiations until a dispute between the American and his promoter opened the door.\nIt's not the first time that Wallin has proved to be the go-to man in his career - he has earned a reputation for stepping up when opportunities are presented.\nWallin went up against Tyson Fury, prior to the Briton's second meeting with Deontay Wilder, but came up short to suffer the first loss of his career.\nHe rebuilt momentum with a run of six successive victories, including the biggest win of his career against former unified cruiserweight world champion Murat Gassiev, although he also endured several downs during that sequence.\nA meeting with BJ Flores was cancelled on the day it was scheduled to take place after the American was deemed medically unfit to compete, while Dillian Whyte withdrew on just 10 days' notice due to a shoulder injury.\n\"Back then I had a tough time with boxing, it felt like I was in a bad place with fights,\" Wallin said.\n\"I would have liked bigger fights during that period but everything happens for a reason. I'm just glad I'm getting opportunities now and I can take full advantage of them.\"\nAfter seeing off Gassiev in Turkey, Wallin earned a date with Anthony Joshua but the former two-time heavyweight champion proved too good and stopped him in round five.\n\"I was the underdog [against Gassiev] but I came through and beat him,\" Wallin added.\n\"I was worried I wouldn't get an opportunity like this again. Sometimes you have to wait and then all of a sudden you get a call like I did for this fight [against Chisora].\"", "url": "https://www.bbc.com/sport/boxing/articles/cr7epz94x2go"}