{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:22:58", "date_modify": "2025-05-21 06:22:58", "date_publish": "2025-04-04 00:00:00", "description": "Follow live text as Edinburgh take on South Africa's Lions in the last 16 of the European Challenge Cup.", "filename": "sport_rugby-union_live_c4gr5579rnnt_1747808578.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_live_c4gr5579rnnt_1747808578.html", "title": "URC: Edinburgh v Lions", "title_page": "URC: Edinburgh v Lions - live text, BBC Sport - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ta-ta\nFT: Edinburgh 24-12 Lions\nThat's all for tonight, as Edinburgh book their spot in the Challenge Cup quarter-finals, where they will take on either Bayonne or Bulls.\nWe'll be back tomorrow for Glasgow's Champions Cup last-16 tie against Leicester Tigers, but until then, goodbye.\n'Tremendous effort and good performance' - Everitt\nFT: Edinburgh 24-12 Lions\nEdinburgh head coach Sean Everitt tells Premier Sports: \"The guys put in a tremendous amount of effort in the first half and played some scintillating rugby.\n\"Probably could have scored some more tries if we're being picky, but pleased with how we defended.\n\"It was a good performance all-round. We've created opportunities in the past and not finished them off.\n\"[Freddy Douglas] is an incredible talent. He's just going to get better with more time on the pitch.\n\"It's a massive opportunity [in the quarter-finals]. For us, it's back to work on Monday and trying to improve on this performance.\"\nConverted try Edinburgh 24-12 LIONS\nJaco Visagie\nTry given.\nIt was a powerful carry from Jaco Visagie and he just about wriggles and rolls to get the ball to the artificial surface.\nThe conversion is good and Edinburgh's lead is now 12.\nThey couldn't stage a comeback, could they? There surely isn't enough time.\nPost\nEdinburgh 17-5 Lions\nAndy Burke\nBBC Sport Scotland at Hive Stadium\nThe Lions coaching team are sitting just along from me and are screaming at their players to \"get off the line\" in defence, which they are doing more effectively than in the first half.\nThey seem pleased with what they're seeing from their team in this second half. Clearly they think this match is still there for them.\nNext score is crucial.", "url": "https://www.bbc.com/sport/rugby-union/live/c4gr5579rnnt"}