{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:49:26", "date_modify": "2025-05-20 11:49:26", "date_publish": "2023-08-07 00:00:00", "description": "Watch, listen and follow live updates as England beat Nigeria in the last 16 at the 2023 Women's World Cup.", "filename": "sport_live_football_65582985_1747741766.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/DC93/production/_130676465_gettyimages-1598337045.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_football_65582985_1747741766.html", "title": "England vs Nigeria LIVE: Watch Fifa Women's World Cup 2023", "title_page": "England vs Nigeria LIVE: Watch Fifa Women's World Cup 2023 - score, commentary & updates from Lionesses' last-16 game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Thank you and goodbye\nThat's all for our coverage of England's penalty shootout win over Nigeria in the last 16 of the World Cup.\nTo follow the game between hosts Australia and Denmark, click here.\nI'll leave you with the penalty that took the Lionesses in to the last eight...\nPost\nFT: England 0-0 Nigeria (4-2 on pens)\nNigeria have won just one of their 15 Fifa Women’s World Cup matches against European sides (D4 L10), failing to score in seven of their last eight games against such opposition in the competition.\nThe Super Falcons also became the first side to draw as many as three games nil-nil at a single Fifa Women’s World Cup tournament.\nThis was just the second time England have played out a goalless draw in the competition (also vs Germany in 2007) in what was their 30th match overall.\nPost\nFT: England 0-0 Nigeria (4-2 on pens)\nFollowing their penalty shootout victory, England have reached at least the quarter final stage at all six Fifa Women’s World Cup tournaments they have appeared in.\nThis was a serious warning shot that they need to improve in the last eight, though. They're unlikely to get away with a display like this again.\n'England need to step it up'\nFT: England 0-0 Nigeria (4-2 on pens)\nAnita Asante\nFormer England defender on BBC Radio 5 Live\nI think from either of their next opponents, Jamaica or Colombia, they can expect more of the same.\nEngland can't rest from this performance, they definitely need to step it up for the next game.\n'Nigeria are fantastic'\nFT: England 0-0 Nigeria (4-2 on pens)\nKaren Bardsley\nFormer England and Manchester City goalkeeper on BBC Radio 5 Live\nNigeria are a fantastic side.\nThey played with so much freedom, allowing their front three to attack and those interchanges of the wide players, you could see England struggled to cope with the fluidity of it.\nI'm relieved that we managed to get through that because I was wondering where the goals were going to come from to be honest.\n'This team is special'\nEngland\nEngland's Chloe Kelly to BBC One: \"It's amazing, anything that's thrown at us we show what we're capable of.\n\"We dig deep as a group and we believe in our ability. We believe in what we're told to do. We've been practicing a lot and it's working.\n\"[Before the penalty] For me I'm thinking going to score, once I win that mental battle I'm good.\n\"It's the team, this team is special. We did it in the Euros, we did it in the Finalissima, we keep pushing forward and there's more to come from this team.\"\n'Hard truths are needed in England dressing room'\nFT: England 0-0 Nigeria (4-2 on pens)\nAnita Asante\nFormer England defender on BBC Radio 5 Live\nEngland will go back, analyse the game and hopefully there will be some hard truths in the changing room.\nThey need to hold each other accountable, including that moment with Lauren James.\nEngland are very lucky to have progressed to the quarter-finals and they definitely need to step up performances if they want to get all the way to a final.\nPost\nJonas Eidevall\nArsenal manager on BBC One\nThis is knockout football. If you're going to go all the way and win a World Cup you might need to win a shootout. Now, if this comes up in the competition again, England will be ready for it.\nPost\nKaren Bardsley\nFormer England and Manchester City goalkeeper on BBC Radio 5 Live\nI'm so relieved that they have managed to get this over the line. It is now about re-grouping and going again.\nThey're now without their best attacking player in Lauren James so it is a case of thinking where do we go from here?\nPost\nFT: England 0-0 Nigeria (4-2 on pens)\nTalk about digging deep!\nEngland were staring down the barrel of a World Cup exit after being second best to Nigeria and then losing Lauren James to a red card late in the 90 minutes.\nBut once again, the Lionesses find a way.\nWhen the dust settles, they'll realise they got out of jail because they did not play well.\nPost\nKaren Bardsley\nFormer England and Manchester City goalkeeper on BBC Radio 5 Live\nHonestly I feel like no one is more relieved in the stadium than I am right now!\nWhat a game from Nigeria, played so well.\nYou feel for Nnadozie, Kelly hit it with all her might and she had no chance stopping that from flying in the net!", "url": "https://www.bbc.com/sport/live/football/65582985"}