{"authors": ["Lauren McCann", "www.facebook.com"], "date_download": "2025-05-21 05:54:00", "date_modify": "2025-05-21 05:54:00", "date_publish": "2025-04-02 07:54:11", "description": "Ahead of the start of the Ulster Football Championship, BBC Sport NI takes a look at the prospects of the nine competing teams.", "filename": "sport_articles_c5yr33kyey2o_1747806840.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e80f/live/bc592850-0e44-11f0-bfea-d170975f1d6a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c5yr33kyey2o_1747806840.html", "title": "Ulster SFC: All you need to know about this year's provincial football championship", "title_page": "Ulster SFC: All you need to know about this year's provincial football championship - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The Ulster Senior Football Championship is upon us again and will no doubt bring plenty of thrills and spills.\nHolders Donegal kick off this year's provincial competition with a preliminary tie against Derry on Sunday, which you can watch live on BBC Two NI, BBC iPlayer and BBC Sport website.\nAhead of the start of the championship, BBC Sport NI takes a look at all you need to know about the nine counties involved.\nAntrim almost didn't feature in this year's Ulster Championship after their quarter-final tie against All-Ireland champions Armagh was moved to Newry's Pairc Esler due to capacity concerns and health and safety issues with Corrigan Park.\nCaptain Patrick McBride said the county's football panel had agreed that they would not play the game if it was not staged at their home ground in west Belfast, with the \"Corrigan or nowhere\" stance backed by the county board, putting the match in jeopardy.\nUlster GAA eventually reversed their earlier decision, and the game is set to go ahead at Corrigan Park.\nMcEntee's side will be huge underdogs against the Orchard County after a disappointing Allianz Football League campaign saw them relegated to Division Four with just two wins from their seven games.\nThe Saffrons are without a win in this competition since 2014 and were beaten by Down in the last-eight 12 months ago.\nBeaten finalists on penalties a year ago, defending All-Ireland champions Armagh will be aiming to go one better as they look to win their first Ulster title since 2008.\nThe Orchard County are firm favourites to overcome a struggling Antrim side in their opening fixture but it seems they will have to do so without forward Rian O'Neill.\nArmagh boss Kieran McGeeney told reporters in January that the Crossmaglen man was \"taking a few months to himself\" and did not give a date for his return to the inter-county scene.\nAs well as the absence of O'Neill, Armagh have been without captain Aidan Forker, Jason Duffy, Connaire Mackin, Tiernan Kelly, Ben Crealey and Niall Grimley through stages of the league because of illness and injury, although there is hope all six will be fit to return for the Antrim game.\nDespite missing so many key players, Armagh finished sixth in Division One, retaining their status in the top tier ahead of Tyrone on head-to-head record after three wins, three loses and a draw.\nDarragh McMullen and Tomas McCormack have taken opportunities presented to them by the various injuries, alongside Belleek's Callum O'Neill, who performed well in his first start in Armagh's thumping victory against Derry.\nCavan will be seeking revenge in their quarter-final meeting with Tyrone in Omagh on 13 April after the Red Hands won 1-23 to 3-16 after extra-time 12 months ago.\nRaymond Galligan's side, who won the Ulster title in 2020, had a topsy-turvy Division Two campaign.\nAfter shipping 5-43 in their first two defeats, they rattled off four consecutive wins but then missed out on promotion after losing narrowly at home to Cork in their final game.\nThe Breffni County have been missing Oisin Kiernan, Jason McLoughlin, Darragh Lovett, Conor Madden and Killian Clarke through injury during the league campaign although the return of Gearoid McKiernan's return has been a boost for the squad.\nGalligan will also hope to call upon star forward Paddy Lynch for their Ulster opener at Healy Park next month as he continues to work his way back from an ACL injury sustained in April last year.\nDerry had a miserable league campaign under new boss Paddy Tally, suffering relegation after finishing bottom of Division One and without a win from their seven games.\nThey will hope to change the downbeat mood around the county by pulling off a shock and beating in-form Donegal on Sunday.\nAfter winning back-to-back Ulster titles, Derry were stunned by Jim McGuinness' eventual winners in the quarter-finals last year - a few weeks after winning the Division One League title.\nDerry's chances of an upset win aren't being helped by an injury crisis with Brendan Rogers expected to join the already ruled out quartet of Gareth McKinless, Odhran Lynch, Conor McCluskey and Anton Tohill in missing the Ballybofey contest.\nIn addition, Ciaran McFaul, Niall Loughlin and Lachlan Murray are also doubts for this weekend's preliminary-round tie.\nDonegal will be confident of winning back-to-back Anglo-Celt Cups as they did in 2018 and 2019.\nJim McGuinness' side held their nerve to triumph 6-5 on penalties against Armagh in last year's final to win the Ulster title for the first time in five years.\nThey come into their preliminary meeting with a depleted Derry side as favourites after beating the Oak Leafers, then holders, at this stage of the competition last year and in the league at the start of March.\nThe Tir Conaill men finished fourth in Division One with four wins from seven games, including a 1-22 to 1-19 victory against Derry in Ballyshannon after coming from eight points down with 15 minutes left to play.\nMichael Murphy has been carefully managed since his return to the panel after two seasons out it seems with the intention to have him firing on all cylinders for the championship.\nIn fact, McGuinness has been careful with the majority of his squad, regularly rotating by using 36 players across their seven games.\nAs a result, his panel see primed to go all guns blazing against Derry in the first step on their quest to retain the title.\nDown reached the semi-finals of the competition last year after beating Antrim before suffering an agonising one-point defeat against Armagh - which was a game they could and probably should have won.\nConor Laverty's side will aim to make the last four once again after being drawn to face Fermanagh in Enniskillen on 19 April.\nThe Mournemen were relegated from Division Two on head-to-head despite winning three of their seven league games.\nThey did, however, produce an impressive display to beat Monaghan in their final league game and also have All-Ireland action to look forward to later this year after winning the Tailteann Cup last year.\nLast winners of an Ulster title in 1994, Down will probably be marginal favourites going into the Enniskillen game before facing into a tough-looking semi-final against either Donegal, Derry or Monaghan - even though they defeated the Farney men 10 days ago.\nMonaghan have the longest wait out of the nine counties to get their Ulster Championship campaign under way after they were drawn against the winners of Sunday's preliminary tie between Donegal and Derry on 20 April.\nIf Donegal are the opposition, that game will be played at Clones with Celtic Park the venue if the Oak Leafers shock Jim McGuinness' side this weekend.\nIt has been 10 years since Monaghan won an Ulster title, but they did recently collect league silverware and seem to be making progress under new manager Gabriel Bannigan.\nThey earned promotion from Division Two by winning the league title, beating Roscommon 1-26 to 0-19 at Croke Park in the decider after picking up five wins from their seven league games.\nWith Conor McManus no longer part of the squad, goalkeeper Rory Beggan's scores have proved important for the Farney men this season - although the tweaking of the new rules may restrict his open-play movement into opposition territory.\nThe keeper contributed 0-7 in the Division Two final, including three two-pointers from frees and a point from a 45 as he finished Monaghan's top scorer in the league with a tally of 0-38.\nLike Derry, Tyrone were relegated to Division Two, but were unbeaten in their last three games which will breed cautious optimism ahead of their Ulster opener against Cavan on 13 April.\nMalachy O'Rourke's side went down despite finishing on seven points like Armagh after three wins from their seven games.\nThey saved their best display for the final day as they produced a good performance to beat Dublin 2-20 to 1-16.\nWinners of the Anglo-Celt Cup in 2021 - the same year they went on to win the All-Ireland title - the Red Hands fell at the semi-final stage last year after a two-point loss to eventual winners Donegal.\nTyrone are currently contending with a number of injury worries ahead of their home tie against Cavan.\nPadraig Hampsey, who did not feature in the league campaign, and Mark Bradley are both fitness doubts, with Conor Meyler ruled out and Ben McDonnell also battling to overcome a knock ahead of the Cavan game.\nYet the return to action of brothers Darragh and Ruairi Canavan during the latter stages of the league campaign will aid Tyrone's cause.", "url": "https://www.bbc.com/sport/articles/c5yr33kyey2o"}