{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-05-21 03:59:20", "date_modify": "2025-05-21 03:59:20", "date_publish": "2025-04-07 07:34:47", "description": "Man Utd 0-0 Man City: Simon Stone analysis on summer transfer window", "filename": "sport_football_articles_ce92n950j2po_1747799960.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/59c8/live/c7d01cf0-137d-11f0-a9df-914426228455.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ce92n950j2po_1747799960.html", "title": "Man Utd 0-0 Man City: Simon Stone analysis on summer transfer window", "title_page": "Man Utd 0-0 Man City: Simon Stone analysis on summer transfer window - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "For Manchester City, the journey to their preferred destination is far easier to navigate than for neighbours Manchester United - and there is more belief in Guardiola to keep everyone on the right path.\nYet, for them too there are hazards, not least in the unknowns.\nBy his own admission, he kept faith in too many of his long-serving players last summer. That will not happen again.\nWe already know Kevin de Bruyne is leaving but there are questions over plenty of others in his squad, not all of them fringe, injured or unwanted players.\nThe futures of Jack Grealish, Bernardo Silva and Ederson, all involved against United, have to be determined.\nJuventus full-back Andrea Cambiaso and Bayer Leverkusen midfielder Florian Wirtz are mentioned most frequently as likely additions to Guardiola's squad - but there will probably be more than two new faces.\nClearly, who they can sign will be impacted by the outcome of the hearing into the 115 charges of alleged Premier League financial rule breaches. Guardiola cannot control that situation.\nCity's status and the pull of the manager will ensure they remain an attractive proposition even if they fail to qualify for next season's Champions League.\nHowever, it would be a blow to his pride if, for the first time in his senior managerial career, he fails to take a team into the elite club competition.\nNot that he is thinking so far ahead.", "url": "https://www.bbc.com/sport/football/articles/ce92n950j2po"}