{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:54:23", "date_modify": "2025-04-26 06:54:23", "date_publish": "2025-02-28 16:03:46", "description": "Brendan Rodgers insists Celtic's 13-point advantage at the top of the Scottish Premiership \"doesn't mean anything\" as he urges his players to maintain their levels.", "filename": "sport_football_articles_cn7vxl2vp3zo_1745650463.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5aa9/live/b4975bc0-f5ec-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cn7vxl2vp3zo_1745650463.html", "title": "Brendan Rodgers: Leaders Celtic must maintain 'highest level' in Scottish Premiership", "title_page": "Brendan Rodgers: Leaders Celtic must maintain 'highest level' in Scottish Premiership - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Brendan Rodgers insists Celtic's 13-point advantage at the top of the Scottish Premiership \"doesn't mean anything\" as he urged his players to maintain their levels.\nWith 10 league games to go, six more wins would guarantee the club's fourth top-flight title in a row. St Mirren host the reigning champions on Saturday (17:30 GMT).\nRodgers' side are also on course for a domestic treble, having won the League Cup in December and with a home tie against Hibernian in the Scottish Cup on 9 March.\n\"We have the advantage in the league of course, but for me it doesn't mean anything,\" Rodgers said.\n\"We have to go into every game to win and to perform at the highest level we can. The whole nature is to start fast and finish strong as a top team.\"\nAfter a busy fixture schedule at the start of 2025, Celtic's game load will lighten from March to May.\n\"The whole point was to get to this point of the season in the best place we possibly could,\" Rodgers said. \"We arrive now into this stage of the season where virtually from Saturday we'll go into one game a week.\n\"So the freshness, the ability to train, to work on things, becomes a great advantage for us and that's all we can ask.\"\nSecond-placed Rangers will have a chance to trim Celtic's emphatic lead to 10 points for a short while at least, with interim boss Barry Ferguson's team tackling Motherwell at Ibrox (15:00 GMT).\nYet Rangers have been unable to keep pace with Celtic this season, with Rodgers' side pulling away.\n\"The players have really set a top standard,\" Rodgers said. \"It's been relentless for the last three and a half months.\n\"In the last three months, we've played over half a season's games in three months. I think it's 23 games or something we've played.\n\"Because of the nature of how we play and the level we want to play at, they've been absolutely magnificent. I can't speak highly enough of them, but we've still got a big job to do.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cn7vxl2vp3zo"}