{"authors": ["Shamoon Hafez", "www.facebook.com"], "date_download": "2025-05-19 15:07:33", "date_modify": "2025-05-19 15:07:33", "date_publish": "2015-01-30 12:28:03", "description": "Jonathan Walters scores a hat-trick for Stoke as QPR lose their 11th straight away game in the Premier League.", "filename": "sport_football_30963548_1747667253.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/80698000/jpg/_80698765_walters-pa.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_30963548_1747667253.html", "title": "Stoke City 3-1 Queens Park Rangers", "title_page": "Stoke City 3-1 Queens Park Rangers - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jonathan Walters struck a hat-trick for Stoke as QPR lost their 11th straight away game in the Premier League.\nWalters gave the hosts the lead by punishing poor defending, curling a right-foot shot into the bottom corner.\nAnd he doubled his side's advantage with a neat finish after exchanging passes with Stephen Ireland.\nNiko Kranjcar pulled a goal back for QPR and Asmir Begovic superbly tipped Joey Barton's free-kick on to the crossbar, before Walters's late header.\nThe save from Barton was one of three crucial interventions from Begovic in the second period as the visitors pressed for an equaliser.\nBut defeat means Rangers have now lost every game they have played away from Loftus Road this season, the worst start to a top-flight campaign since Liverpool in 1953-54.\nHarry Redknapp's side have now conceded a league-high 42 goals in 23 games and only Leicester are beneath them in the table.\nIn contrast, former QPR boss Mark Hughes' Potters look in confident form - just two defeats in their past 11 games taking them up to ninth.\nThe atmosphere at the Britannia Stadium was sombre as Stoke celebrated the life of club legend Sir Stanley Matthews, who would have turned 100 on Sunday.\nOn the pitch, it was a quiet opening, with neither side able to create any clear-cut opportunities, not helped by the typically blustery conditions.\nBut the game burst into life on 21 minutes. As QPR attempted to play their way out of trouble, Ireland's backheel sent Walters through, and he calmly netted the opener.\nKranjcar reduced the arrears by slotting into an open net after Charlie Austin's deflected effort fell into his path.\nAs they pushed for an equaliser, Eduardo Vargas's spectacular scissor kick was pushed away by Begovic.\nThe Bosnian goalkeeper then diverted Barton's rasping free-kick onto the bar and was at full stretch to keep out Leroy Fer's long-range strike.\nThe equaliser did not come, and Walters thumped home a powerful header in injury time to wrap up the victory.\nStoke manager Mark Hughes:\n\"We allowed them back in because at 2-0 up we were comfortable. With the wind and the conditions they had a real go in the second half.\n\"Jon Walters was the star man and is a key player for us. He gives everything in every game and is a credit to his profession. It was his 200th game today and to get a hat-trick it is special for him.\n\"We have good ability in the wide areas and key areas in the field, but it wasn't a great game and not of a great quality.\"\nQPR manager Harry Redknapp:\n\"People look and the score is 3-1, and say it was convincing - how we got beaten I don't know.\n\"We started well, and suddenly we lose the ball under no pressure and find ourselves 2-0 down, we certainly didn't deserve to be.\n\"We just batter them in the second half, but just couldn't score. All three goals conceded were individual errors. Credit to Walters but he won't get an easier hat-trick. We can't keep making individual errors like that.\"", "url": "https://www.bbc.com/sport/football/30963548"}