{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:57:08", "date_modify": "2025-05-20 14:57:08", "date_publish": "2023-07-27 07:07:16", "description": "Man United: Ten Hag emphasises need for clinical striker", "filename": "sport_articles_c99xvrz0yj8o_1747753028.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/fb8b/live/566d4db0-2c4a-11ee-b1d7-8fdc93c2782e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c99xvrz0yj8o_1747753028.html", "title": "Man United: Ten Hag emphasises need for clinical striker", "title_page": "Man United: Ten Hag emphasises need for clinical striker - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Erik ten Hag says Manchester United's inability to take their chances against Real Madrid \"absolutely\" emphasised their need for a new striker.\nThe Red Devils lost 2-0 to the Spanish giants in Houston on Wednesday evening.\nJude Bellingham opened the scoring with a lovely clipped finish and substitute Joselu wrapped up a 2-0 Madrid win with a stunning acrobatic strike late on.\nUnited had chances of their own but failed to score with any of their 14 attempts - an all too familiar tale given their problems taking opportunities last season.\nAsked if the attacking display in Texas emphasised why they are looking to sign a new striker, Ten Hag said: \"Absolutely.\n\"There were two things - the pressing can be better from the start, and scoring goals.\n\"I think we need more players who are capable to be in the one-on-ones and we had the situations of one-on-ones.\n\"It was (Marcus) Rashford, it was, I thought, Scott McTominay in one-on-one situations. Garnacho, a one-on-one situation. From the situations, you have to score.\"\nUnited are pushing to sign Atalanta striker Rasmus Hojlund - with talks over a deal underway - as they look to bring in a frontman.\nOn the hunt for a striker, Ten Hag added: \"It's always difficult to say. We are working 24-7. We do and everyone, well not everyone, but a lot in the club, and we give all the power to get this done. We never talk about players under contract with another club, so we have our targets in the background. We are busy with it to get the right player to sign a contract for us.\"\nThe club have already brought in Chelsea midfielder Mason Mount and Inter Milan goalkeeper Andre Onana this summer, with the latter making his debut in Houston.\n\"I think good, solid,\" Ten Hag said of Onana's display.\n\"Two very good saves.\n\"He was there in the moment the team needed him, so he did his job. I think he integrated well in our team.\n\"This is the first game and detail, we have a lot of work to do between him and the defending part (of the team).\n\"You could see with the second goal where we are not close at the back post. It can't be that and goals will come there.\n\"There are things that are rules we have to follow, and they'll come quick, that we integrate that into our way of play.\"", "url": "https://www.bbc.com/sport/articles/c99xvrz0yj8o"}