{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:38:24", "date_modify": "2025-05-21 06:38:24", "date_publish": "2025-04-01 00:00:00", "description": "Watch the highlights as Portadown and Glenavon play out a 1-1 draw in the mid-Ulster derby at Shamrock Park.", "filename": "sport_football_live_cpwdw820wj8t_1747809504.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/37aa/live/80d9b090-0d6a-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cpwdw820wj8t_1747809504.html", "title": "Highlights: Ports and Glenavon share Shamrock Park spoils", "title_page": "Highlights: Ports and Glenavon share Shamrock Park spoils - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Final whistle\nThat is all from us after a goal fest across the six Irish Premiership games this evening.\nYou can read the report from those six games here.\nHighlights and reaction will follow on the BBC Sport website.\nThanks for joining us - goodnight.\nFULL-TIME\nLinfield 3-1 Crusaders\nRunaway champions Linfield add another three points to their tally with a 3-1 victory over Crusaders at Windsor Park.\nRobbie McDaid's early strike gave the Blues the advantage at the break, before Matthew Fitzpatrick and Kieran Offord both netted in the second half.\nJay Boyd grabbed a consolation for the visitors but it's David Healy's side who move to 79 points for the season with four games remaining.\nFULL-TIME\nPortadown 1-1 Glenavon\nThe game ends all square at Shamrock Park.\nBoth goals came in the first half, with Ahu Obhakhan opening the scoring for the home side on the 21st minute before Harry Murphy headed Glenavon level on the 37th minute.\nThe second half was full of grit and effort but little in the way of clear cut chances.\nBut then right at the death, with what was the final action of the game, Josh Ukek cuts inside and tries to curl the ball into the top corner of the Glenavon goal.\nMark Byrne fumbles it and the ball falls to James Teelan, but his headed effort was weak and went wide of the target, much to the relief of Byrne.\nFULL-TIME\nDungannon Swifts 1-1 Larne\nAll over at Stangmore Park where the sides must settle for a point apiece.\nA Gael Bigirimana own-goal edged the visitors in from midway through the opening half as he attempted to block Chris Gallagher's cross.\nThe Swifts responded positively to this setback and levelled with an own goal of their own just after the half hour, Ryan Nolan putting through his own net under pressure from Tomas Galvin.\nNeither side was able to find a winner after the break so it's honours even at the end of 90 minutes.\nGREAT SAVE!\nLinfield 3-1 Crusaders\nJonny Tuffey does well to get down to his right to deny Matthew Fitzpatrick from a second goal of the evening.\nThe Blues are camped in the Crusaders half in added time as they look at put the icing on the cake with a fourth goal.", "url": "https://www.bbc.com/sport/football/live/cpwdw820wj8t"}