{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:24:39", "date_modify": "2025-05-21 05:24:39", "date_publish": "2025-02-12 00:00:00", "description": "Follow live text commentary, score updates and match stats from Feyenoord vs AC Milan in the UEFA Champions League", "filename": "sport_football_live_cvgezgvvzzkt_1747805079.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cvgezgvvzzkt_1747805079.html", "title": "Feyenoord vs AC Milan: UEFA Champions League stats & head-to-head", "title_page": "Feyenoord vs AC Milan: UEFA Champions League stats & head-to-head - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "This will be just the third meeting between Feyenoord and Milan in European competition, with the pair winning one match each during their two-legged European Cup Round of Last 16 clash during the 1969-70 season – the Dutch team progressed to the next round (0-1 defeat away in the 1st leg and 2-0 win at home in the 2nd leg).\nMilan have failed to win any of their last four games in major European competition against sides from the Netherlands (D3 L1), since a 3-1 win over SC Heerenveen in the UEFA Cup in October 2008.\nFeyenoord have lost just one of their 11 home games in major European competition against sides from Italy (W6 D4), a 1-2 defeat against Roma in February 2015 in the UEFA Europa League Last 32.\nMilan have failed to win any of their last 11 away games in the UEFA Champions League knockout rounds (D4 L7), scoring just three goals in total across their last 10 matches in that run.\nFeyenoord are playing in the knockout rounds of the UEFA Champions League/European Cup for the first time since the 1984-85 season, losing 1-2 on aggregate to Panathinaikos in the first round (0-0 at home, 1-2 away).\nDuring the UEFA Champions League league phase this season, only matches featuring Barcelona (41) witnessed more goals in total than those involving Feyenoord (39). Of the 24 teams to progress from that stage of the competition, the Dutch side conceded the most goals (21).\nMilan’s Santiago Giménez is the player with the best minutes per goal ratio in the UEFA Champions League this season (min. 4 goals), averaging one every 59 minutes (five goals in five appearances).\nMilan’s Christian Pulisic scored four goals during the UEFA Champions League league phase this season, with Olivier Giroud the last player to have more for the club (5 in 2022/23) in a single campaign in the competition. In the process, he also became the first USMNT player to score that many goals in a UCL campaign.\nOnly Atalanta’s Charles De Ketelaere (5) recorded more assists during the UEFA Champions League league phase this season than Feyenoord’s Igor Paixão (4). In total, the Brazilian has five goal contributions in the competition this season with only Santiago Giménez (6 this season) ever having more during a UCL campaign for Feyenoord.\nMilan’s Rafael Leão has completed 30 dribbles in the UEFA Champions League this season, the most of any player during the league phase. Indeed, since making his debut in the competition in September 2021, only Vinícius Júnior (134) has completed more in this period than Leão (97).", "url": "https://www.bbc.com/sport/football/live/cvgezgvvzzkt"}