{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:51:46", "date_modify": "2025-05-19 14:51:46", "date_publish": "2017-07-04 17:29:39", "description": "Hampshire captain George Bailey hits 161 as the away side declare on 648-7 against Surrey at The Oval on day two.", "filename": "sport_cricket_40489072_1747666306.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/12390/production/_96804647_gettyimages-807516552.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_cricket_40489072_1747666306.html", "title": "Surrey v Hampshire: George Bailey hits 161 as Hants pile on runs at The Oval", "title_page": "Surrey v Hampshire: George Bailey hits 161 as Hants pile on runs at The Oval - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "George Bailey hit 161 for Hampshire who declared on 648-7 as batsmen dominated on day two against Surrey at The Oval.\nHampshire captain Bailey batted through the entire first session with Sean Ervine (83), putting on 167 before the Zimbabwean dragged on Conor McKerr.\nIan Holland (58 not out) and Gareth Berg's rapid 35 saw the away side post their fifth-highest first-class score.\nMark Stoneman (56) then fell with three overs left, leaving Surrey 113-1 at stumps, trailing by 535 runs.\nErvine pushed the score on comfortably alongside Bailey, punishing the bad balls, before he inside-edged McKerr on to his stumps to depart at 528-5.\nBailey brought up his 150 with a six off Scott Borthwick, but was caught by Mark Footitt on the boundary from the leg-spinner soon afterwards.\nHolland's maiden County Championship half-century continued the momentum, while Berg's aggressive 16-ball stay saw him smash three sixes and two fours before being caught on the boundary to prompt the declaration.\nHopes of Hampshire pressing home their advantage appeared to be fading as Stoneman and Rory Burns (45 not out) put on 103 for the first wicket, but Stoneman edged Ervine to Rilee Rossouw at first slip to bring in nightwatchman McKerr to reach the close.", "url": "https://www.bbc.com/sport/cricket/40489072"}