{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:10:46", "date_modify": "2025-05-19 15:10:46", "date_publish": "2015-02-13 11:32:18", "description": "Manchester United boss Louis van Gaal says he is not worried about criticism of his team's style by Paul Scholes.", "filename": "sport_football_31452399_1747667446.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/80911000/png/_80911593_mmftbvangaaldossier3.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31452399_1747667446.html", "title": "Man Utd: Louis van Gaal not worried by Scholes criticism", "title_page": "Man Utd: Louis van Gaal not worried by Scholes criticism - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester United manager Louis van Gaal is not worried by criticism of his team's style of play from former Old Trafford favourite Paul Scholes.\nEx-midfielder Scholes said United's football was \"miserable\" and failing the club's attacking traditions.\nHe wrote in the Independent:, external \"At the moment I'm struggling to watch Van Gaal's team with any great enjoyment.\"\nBut Van Gaal replied: \"I don't worry about that. Paul Scholes is one of the fans and fans can criticise us.\"\nUnited sit third in the Premier League after Wednesday's 3-1 victory over Burnley at Old Trafford, a display which Van Gaal \"didn't like\".\nAnd the Dutchman admitted that after eight months in charge of United he doesn't yet know his best formation having used a flat back four, three at the back and various midfield permutations.\n\"No, I don't think so,\" said Van Gaal when asked if he had settled on a preferred set-up. \"I have played five or six systems and I am looking still for the balance.\n\"But this system (4-4-2) is more attractive than normally and I can play with more attacking players. That's the reason I am doing that.\n\"In spite of the fact that we are looking for the balance, our results are not bad and our defensive organisation is not bad. So, I cannot say that I am very disappointed about that.\n\"But we have to do it (develop tactics) now and normally you have to do it pre-season.\"\nScholes, who made his United debut in 1994 and played 676 times for the club while winning 11 Premier League titles, also accused the current players of taking options that are too safe and contrasted the team's style with the tactics adopted by his former boss Sir Alex Ferguson.\nThe Salford-born player added: \"In the periods of my career when I stopped passing the ball forward, or when I stopped looking for the risky pass that might open up a defence, the consequences were the same. The manager stopped picking me.\n\"I got back into the team when I went back to doing it the way he wanted.", "url": "https://www.bbc.com/sport/football/31452399"}