{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:46:12", "date_modify": "2025-05-21 06:46:12", "date_publish": "2025-03-30 16:13:57", "description": "Ireland record a first away win in the Women's Six Nations since 2021 with a 54-12 victory over Italy in Parma.", "filename": "sport_rugby-union_articles_clyql1e5587o_1747809972.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/be02/live/2e100c90-0d94-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_clyql1e5587o_1747809972.html", "title": "Women's Six Nations: Italy 12-54 Ireland", "title_page": "Women's Six Nations: Italy 12-54 Ireland - Anna McGann hat-trick helps eight-try visitors to thumping victory at Stadio Sergio Lanfranchi - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ireland recorded a first away win in the Women's Six Nations since 2021 with a 54-12 victory over Italy in Parma.\nScott Bemand's side scored four tries in each half with Anna McGann providing a hat-trick at the Stadio Sergio Lanfranchi.\nReturning to the site of their failure to qualify for the last World Cup, the visitors crossed for two scores in the opening seven minutes to take control of the game and beat Italy for the first time since 2022.\nAoife Dalton, Amee-Leigh Costigan, Linda Djougang, Dorothy Wall and Brittany Hogan also scored tries for Ireland, while Dannah O'Brien added seven conversions.\nIreland made a slow start in their otherwise encouraging defeat by France in round one but flew out of the traps in Parma to set the foundations of their victory.\nErin King had already secured an early breakdown turnover when Italy lock Valeria Fedrighi was sent to the sin-bin after only 52 seconds.\nThe high tackle on Edel McMahon was further punished when Ireland scored twice during the 10 minutes against 14 players.\nHaving felt they failed to make the most of a player advantage against France last week, Ireland showed patience when their maul stalled and Aoife Dalton was on hand to scoop up a loose ball and finish powerfully for the opener.\nBefore Fegrighi's return, an Eve Higgins break created the space for McGann to go over for her first.\nScrum-half Sofia Stefan, who was a bright spark for the hosts throughout her hour on the pitch, responded when she caught Ireland cold from a scrum and scampered over from the base.\nBut another break from Higgins created Ireland's third score of the half, this time for Amee-Leigh Costigan, and they would secure the try bonus point before the break when McGann crossed again after more patient play in attack.\nItaly looked set to mount a response in the final minutes of the half but, after strong work from prop Niamh O'Dowd, Dalton held up Vittoria Vecchini over the line.\nAoife Wafer had a score ruled out for obstruction at the line-out five minutes into the second half, but Ireland would get their fifth try when prop Linda Djougang crashed over in the 55th minute.\nThe loose-head was sent to the sin-bin for a high tackle on Emma Stevanin three minutes later with the punishment remaining a yellow card after a TMO bunker review.\nStill while down to 14, replacement second row Dorothy Wall finished off another patient Irish move for the side's sixth try.\nCentre Beatrice Rigoni scored for Italy when she cleverly pounced on a loose ball and wriggled over the line, but the hosts were well beaten for the second consecutive week after a heavy loss to England in round one.\nIreland scored twice more in the final three minutes through Brittany Hogan and the third of McGann's hat-trick in the last play of the game.\nAfter the fallow week, Ireland will host champions England in Cork on 12 April while Italy are next in action against Scotland the next day.", "url": "https://www.bbc.com/sport/rugby-union/articles/clyql1e5587o"}