{"authors": ["Henry Moeran", "www.facebook.com"], "date_download": "2025-05-21 05:23:37", "date_modify": "2025-05-21 05:23:37", "date_publish": "2025-04-03 15:05:41", "description": "The England and Wales Cricket Board remain confident sales of stakes in The Hundred teams will go through at the agreed price, despite extending the window for deals to be completed.", "filename": "sport_cricket_articles_c0jz83zy39qo_1747805017.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b9be/live/946fa020-0bf2-11f0-a31d-7bdcf6d7d2f6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c0jz83zy39qo_1747805017.html", "title": "The Hundred: ECB say sales of franchises will go through at agreed price despite extending deadline", "title_page": "The Hundred: ECB say sales of franchises will go through at agreed price despite extending deadline - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The England and Wales Cricket Board remain confident sales of stakes in The Hundred teams will go through at the agreed price, despite extending the window for deals to be completed.\nIn February, the ECB oversaw the sale of stakes in the eight franchises to private investors, achieving a collective value of more than £975m and bringing in about £520m to be split across the game in this country.\nHowever, on Friday, it emerged the eight-week exclusivity period to finalise agreements has had to be extended after delays in negotiations.\n\"I'd hope [to reach a conclusion] in the next month or so, perhaps sooner,\" said ECB chief executive Richard Gould.\n\"Some parties are absolutely ready to go now, others have additional questions. It's the quality of the conversations and not timescale we're focused on.\"\nOne factor that was always likely to be an issue was how different global markets access the revenue available from big television audiences.\nHistorically the ECB has driven that revenue through a domestic subscription model, whereas India and the United States - where several investors are from - tend to focus on advertising.\n\"There are differences in the markets, [but] working through those different models has been a helpful element,\" added Gould.\n\"We're making sure we can best protect their investment and give them the certainty we can to help them to drive value. They're investing a lot of money into our game. We want to make sure they can reap the dividends as well.\"\nGould said there was no doubt about any of the deals going through.\n\"The valuations are absolutely locked in,\" he said. \"I don't see any risk at all at this point.\"\nThe Hundred has long been a source of frustration to county cricket supporters who feel the 18 teams are negatively impacted by the marquee competition.\nA county-led review offering feedback as to how a future structure could work will be undertaken in the coming weeks.\nRob Andrew, managing director of the professional game, said: \"There's a general feeling that these competitions can be improved, and we'll make sure everybody's views are listened to\n\"The schedule is not perfect. Our job is to try and pull all the views together.\"\nAsked whether the T20 Blast has suffered because of The Hundred, Andrew said: \"There's a feeling The Blast needs a refresh, to give it that renewed energy lost a little bit through The Hundred dynamics in recent years.\n\"Nothing's on the table, nothing's off the table.\"\nMeanwhile, the ECB remains hopeful of continuing to host the World Test Championship final beyond the current deal.\nJune's showpiece at Lord's between Australia and South Africa is the last year the final, which is held every two years, is slated to be in England.\n\"We've done such a good job and Lord's will build on that this year,\" said Gould.\n\"When people see more sell-out crowds then hopefully the arguments about moving it around the world will recede.\"", "url": "https://www.bbc.com/sport/cricket/articles/c0jz83zy39qo"}