{"authors": ["Alex Howell", "www.facebook.com"], "date_download": "2025-04-26 06:46:37", "date_modify": "2025-04-26 06:46:37", "date_publish": "2025-03-01 13:17:40", "description": "Crystal Palace striker Jean-Philippe Mateta says he is \"doing well\" despite being taken to hospital after being kicked in the head by Millwall goalkeeper Liam Roberts.", "filename": "sport_football_articles_cd92lzj02x0o_1745649997.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1b71/live/04a4b550-f6c8-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cd92lzj02x0o_1745649997.html", "title": "Jean-Philippe Mateta: Crystal Palace forward sustains head injury after Millwall keeper challenge", "title_page": "Jean-Philippe Mateta: Crystal Palace forward sustains head injury after Millwall keeper challenge - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Crystal Palace striker Jean-Philippe Mateta said he is \"doing well\" despite being taken to hospital after he was kicked in the head by Millwall goalkeeper Liam Roberts.\nAn emotional Steve Parish, Crystal Palace's chairman, told BBC Sport that Roberts had \"endangered a fellow professional and maybe his life\".\nRoberts was sent off in the eighth minute after a video assistant referee (VAR) review during Saturday's FA Cup fifth-round tie. The footage showed he kicked the side of Mateta's head, having dashed from his line to clear the ball.\nThe French forward, 27, was treated on the pitch and given oxygen before being taken to an ambulance, with substitute Eddie Nketiah coming on and scoring in the 3-1 win for the Premier League side.\nPalace manager Oliver Glasner said the foul \"could have been the end of JP's career\" while Millwall boss Alex Neil insisted Roberts had not intended to hurt Mateta.\nPosting on social media, external on Saturday, Mateta said: \"I'm doing well. I hope to be back very soon and stronger than ever. Well done guys for the great job today.\"\nLater on Saturday night Palace said Mateta had been discharged from hospital.\n\"He received specialist treatment and 25 stitches to a severe laceration to his left ear,\" the club said. \"All scans were clear and JP is feeling well.\"\nThirteen minutes were added on at the end of the first half at Selhurst Park following the incident, with Palace 2-0 up after an own goal by Japhet Tanganga and a Daniel Munoz strike.\nParish told BBC One at half-time: \"So far, what we know is he [Mateta] has a bad gash behind his ear.\n\"In all the time I've watched football, I've not seen a challenge like it. That is the most reckless challenge on a football pitch I think I've ever seen, and I think he [Roberts] needs to have a long, hard look at himself because he's endangering a fellow professional and maybe his life.\n\"It is difficult for me to talk about the rest of the game. It's a terrible challenge.\"\nFormer Arsenal defender Martin Keown said on Match of the Day: \"It is like a kung-fu kick.\n\"It is unbelievable how he has got his foot that high. Terrible, horrific challenge.\n\"It gets worse every time I look at it. The referee should have seen it, it was right in front of him.\"\nMateta has been in superb form for the Eagles this season, scoring 15 goals in 33 appearances overall - including eight in his past eight Premier League games.\nThe Football Association has condemned some \"let him die\" chants made towards Mateta by some Millwall fans while he was receiving treatment on the pitch, but said they do not breach its regulations.\nHowever, the FA will investigate homophobic chants aimed towards Ben Chilwell, on loan at Palace from Chelsea, from Millwall supporters.\nPalace boss Glasner said the incident was so bad he initially did not want to watch it again.\n\"He's at the hospital and I heard he's conscious, and he has a serious ear injury,\" Glasner said.\n\"I didn't want to see it after the game, because you never want to watch an injury, but because I was told you have to talk about it, I watched it, and it was very, very serious foul play.\n\"Just imagine if he hits his face straight, with all this power and the studs, it could have been the end of JP's career.\n\"I'm pretty sure he did not want to injure JP in this situation, but I also think you have to decide when you make such an impact, that you just can't do it in this way - the risk of a very serious injury is just too high.\n\"I don't feel happiness, still sadness and doubt, because of how serious JP's injury is. My fingers are crossed, and hopefully he can play in the quarter-finals, in four weeks, we all hope it's not that serious.\"\nMillwall manager Neil added: \"He's tried to get the ball, he's mistimed it and caught the lad. It's no more than that from my perspective.\n\"He has certainly not intended to hurt the player or anything like it. We wish Mateta the best and hope he gets back on the pitch.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cd92lzj02x0o"}