{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:25:58", "date_modify": "2025-05-20 12:25:58", "date_publish": "2023-08-03 15:38:39", "description": "Swansea City sign Newcastle United defender Harrison Ashby on loan and is available for for Saturday's Championship opener against Birmingham City.", "filename": "sport_football_66398459_1747743958.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5982/production/_130641922_shutterstock_editorial_13748308bl.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66398459_1747743958.html", "title": "Harrison Ashby: Swansea City sign Newcastle United defender on loan", "title_page": "Harrison Ashby: Swansea City sign Newcastle United defender on loan - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Swansea City have signed defender Harrison Ashby on season-long loan from Newcastle United.\nAshby, 21, is available for Swansea's Championship opener against Birmingham City on Saturday.\nThe right wing-back is Swansea's sixth summer signing.\n\"First and foremost he is a good defender, but one who can also get in the final third and deliver good crosses too,\" said Swans head coach Michael Duff.\n\"He wants to get out there, and play lots of games.\"\nAshby was a youngster at Chelsea before moving to West Ham United in 2020, where he made seven senior appearances.\nThe Scotland Under-21 international joined Newcastle United for an undisclosed fee in January 2023 but has yet to make a first team appearance.\nAshby's arrival comes after Swansea brought in goalkeeper Carl Rushworth on loan from Brighton and Hove Albion and forward Mykola Kuharevich from Troyes.\nJosh Ginnelly, Josh Key and Jerry Yates have also joined Swansea during the close season.\nBut Duff says he is still eager to further bolster his ranks before the 1 September transfer deadline, with the Swansea boss stating he is keen to recruit a left wing-back following the departure of Ryan Manning.\n\"I don't think I'm breaking any secrets, I think we need a left-sided player,\" explained Duff.\n\"That's something we're looking for. It's not a case of we haven't been looking. We have been trying. That has been a frustrating one.\n\"We're still looking to be active for a couple more.\"\nJoel Piroe is expected to lead the line for the Swans against Birmingham amid interest from clubs including Leicester City, Atalanta and Leeds United.\nDuff reiterated that the club are yet to receive a formal offer for the Dutchman, who netted 44 goals across his first two seasons in south Wales.\n\"I've had conversations with Joel, there's been no bids,\" added Duff.\n\"Until there's a bid, he's our player. He's been absolutely top-drawer the way he's gone about it all.\"\nHowever Wales Under-21 striker Josh Thomas has joined League One club Port Vale on a season-long loan despite scoring five goals in pre-season.\nJoe Allen and Josh Ginnelly are continuing to be monitored for minor injuries in pre-season, although goalkeeper Steven Benda and midfielder Liam Walsh are unavailable for Saturday's clash with Birmingham.\nSpeaking ahead of the Swans' fixture against the Blues, Duff said: \"I'm not a big one for making predictions.\n\"I think it's the most competitive Championship for a long time. You look at the teams that came up, big teams, and the teams that came down are very well supported, financially as well, so it's going to be really competitive. That's all we want to be.\"\nMeanwhile, Swansea announced on Thursday evening that former chairman Huw Jenkins had left the board of directors.\nJenkins resigned as chairman in February 2019 to a backdrop of increasing criticism from some sections of supporters but had remained involved with the club, which thanked him and \"wished him well\".\nSwansea also confirmed that \"new shares have been issued following investment from the club's majority ownership, which includes chairman Andy Coleman\".\nThe brief statement added: \"While this move results in other shareholders becoming diluted, including the Swansea City Supporters' Trust, it will not affect the Trust's fully protected and non-dilutable 5% shareholding in the club, nor their right to a place on the club's board of directors.\"", "url": "https://www.bbc.com/sport/football/66398459"}