{"authors": ["Amy MacBeath", "www.facebook.com"], "date_download": "2025-05-21 06:04:27", "date_modify": "2025-05-21 06:04:27", "date_publish": "2025-04-01 15:31:37", "description": "Ross County: Cowie on the 'beauty of the Premiership', belief and being the top six outsiders", "filename": "sport_articles_cgkg7062j1lo_1747807467.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8b5c/live/546a8070-0f0e-11f0-8926-611e8cb1ab81.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cgkg7062j1lo_1747807467.html", "title": "Ross County: Cowie on the 'beauty of the Premiership', belief and being the top six outsiders", "title_page": "Ross County: Cowie on the 'beauty of the Premiership', belief and being the top six outsiders - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "On the 1-0 home defeat by Dundee United, the Staggies boss says his side are \"disappointed and frustrated\" at missing out on \"a real opportunity to continue the momentum\".\nWith two games left before the split, Cowie insists County \"strive for six points and that will always be the case\". While they are huge outsiders for a top-six place he says \"that's the beauty of the league - everyone is striving for something\" so the points are \"so valuable\" for everyone.\nOn stopping the Dons' nine-game unbeaten run, Cowie will use his side's 2-1 win in the last meeting to show what they can achieve and strive to do again.\nAsked if County are confident they can avoid being drawn into a relegation scrap this season, he says \"we are sitting ninth in the league for a reason\" having enjoyed some \"relatively good\" form since Christmas. That has given them the \"evidence and real belief going into every game\".\nOn how tight the Premiership is this season, Cowie described it as \"ultra-competitive\" and a league where you \"have really got to earn what you get\" from every match.", "url": "https://www.bbc.com/sport/articles/cgkg7062j1lo"}