{"authors": ["Charlotte Cohen", "www.facebook.com"], "date_download": "2025-05-21 07:32:20", "date_modify": "2025-05-21 07:32:20", "date_publish": "2025-03-28 16:56:52", "description": "Celtic: Talks under way over new deal for 'brilliant' Daizen Maeda", "filename": "sport_articles_cx2x20m0x1eo_1747812740.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6a9b/live/fea4f5e0-0be7-11f0-8ae9-2975efdc7f47.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cx2x20m0x1eo_1747812740.html", "title": "Celtic: Talks under way over new deal for 'brilliant' Daizen Maeda", "title_page": "Celtic: Talks under way over new deal for 'brilliant' Daizen Maeda - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Brendan Rodgers says talks are under way aimed at securing \"brilliant\" Celtic forward Daizen Maeda on an extended contract.\nThe 27-year-old Japan international, whose current deal expires in summer 2027, has been in superb form this season, netting 28 goals in 42 appearances.\nWhen asked about a new deal for the versatile forward, manager Rodgers said: \"Absolutely, if there is that possibility to do that.\n\"I've spoken with [majority shareholder] Dermot [Desmond] and the club and spoken with the player. Hopefully in the future that is something that can be done.\n\"He's been absolutely brilliant for us this season. Wherever he's played, however he's played, he's had an amazing season. So of course you would love to tie up one of your best players.\"\nHowever, Rodgers admits Maeda is being coy about where his future lies.\n\"He doesn't give away much, other than saying he's very happy,\" the boss added.\n\"But listen, I'm also under no illusions here. There are very few players that are going to do what Callum McGregor does, some of these players have a lifetime here, like James Forrest.\n\"Some players, especially those from other parts of the world, they might fancy a change. It's nothing to do with Celtic or the club or the support, it's just life. But all I can do is judge when he's here.\n\"He's been brilliant here. He's still contracted well here to the club. But of course there has been chats around improving that for him because he's grown into one of the top players here.\n\"He earns every penny. We feel as a club he deserves more. So we want to do that. But of course it has to work both ways.\"", "url": "https://www.bbc.com/sport/articles/cx2x20m0x1eo"}