{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:15:32", "date_modify": "2025-05-21 06:15:32", "date_publish": "2025-01-04 19:30:10", "description": "Gary Haveron says Larne \"got what we deserved\" as the Irish Premiership champions were knocked out of the Irish Cup by Limavady United.", "filename": "sport_football_articles_c878v778g53o_1747808132.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/674c/live/b3e32910-cacd-11ef-94df-33b0323b7c60.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c878v778g53o_1747808132.html", "title": "Irish Cup: 'No excuses' as Limavady stun Larne", "title_page": "Irish Cup: 'No excuses' as Limavady stun Larne - Gary Haveron - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Gary Haveron says Larne \"got what we deserved\" as the Irish Premiership champions were knocked out of the Irish Cup by Limavady United.\nAfter a goalless 90 minutes, Ruairi Boorman scored the only goal of the game in extra-time as the second tier side stunned Haveron's outfit at the Showgrounds.\nLimavady are rewarded for their win with a trip to Irish Premiership side Crusaders in the last-16, while Larne's wait for an Irish Cup triumph rolls on.\n\"There are no excuses. Limavady were hungrier and they played the conditions much better than we did,\" said Larne's first team head coach Haveron.\n\"We got what we deserved.\"\nLimavady manager Paul Owens said he was \"delighted for everyone involved\" as his side pulled off a huge upset.\nThe club are second in the Championship and chasing leaders Bangor and Owens said it was his aim to guide the club to the top flight.\n\"We're a Championship club who are striving to reach the Premiership,\" he said.\n\"This shows the potential of the club when we are producing performances like that against a Uefa Conference League side.\n\"Someone reminded me this morning that they just beat Gent, so it is a huge day for the club. I think it was fully-deserved.\"\nOwens added \"there is a lot of work that goes on behind the scenes\" so it was \"brilliant to put in a performance like that\".\n\"There has been a hell of a lot of sacrifice over the Christmas period.\n\"We've been in every two days. We've had a good run of form which has obviously helped but that is a real reward and sacrifice for all the hard work.\n\"Our preparations have been a bit disrupted with the weather, we had a training session called off on Thursday so tactically, there wasn't a whole lot of work done.\n\"We tried to press as high as we can, we didn't want to sit in. There was nothing in the game, which was brilliant for us and Ruairi getting the goal in extra-time, the scenes were brilliant.\"", "url": "https://www.bbc.com/sport/football/articles/c878v778g53o"}