{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:13:19", "date_modify": "2025-05-21 05:13:19", "date_publish": "2025-04-05 00:00:00", "description": "Oxford United give their Championship survival hopes a huge boost with a win over promotion-chasing Sheffield United.", "filename": "sport_football_live_cy0xgkz32j1t_1747804399.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8826/live/3f0ea890-1234-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cy0xgkz32j1t_1747804399.html", "title": "Oxford United 1-0 Sheffield United: Blades miss chance to return to top of Championship", "title_page": "Oxford United 1-0 Sheffield United: Blades miss chance to return to top of Championship - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Oxford United gave their Championship survival hopes a huge boost as they beat promotion-chasing Sheffield United.\nSiriki Dembele's first-half strike separated the two teams and lifts Oxford - who put in an excellent defensive second-half display - four points above the relegation zone with six matches left to play.\nSydie Peck came closest to an equaliser for the second-placed Blades who stay below leaders Burnley but remain a point above Leeds United in the automatic promotion places following the Whites' draw against Luton Town earlier on Saturday.\nThe defeat ends a run of six straight away wins for the Blades, their best run of form on the road in 132 years.\nOxford started the match on the front foot and Przemyslaw Placheta's delightful left-footed cross found Mark Harris at the back post but the Wales international was unable to get good enough contact and the ball drifted out for a goal kick.\nThe visitors took a while to settle down but midway through the first half, Harrison Burrows got down the left-hand side and struck from range but Oxford keeper Jamie Cumming was equal to it.\nMoments later, good work from Ben Brereton Diaz down the right saw him find Tyrese Campbell in the box but his effort from eight yards out was excellently saved by an outstretched leg from Cumming.\nEx-Sheffield Wednesday midfielder Will Vaulks' long throw was then headed on by Ben Nelson at the near post and, after the Blades failed to clear, the ball eventually fell at the feet of Dembele who slotted the ball past the on-rushing Michael Cooper to give the hosts a surprise half-time lead.\nThe Blades looked like they received a stern half-time team talk by Chris Wilder, who returned to the Kassam Stadium after spending over five years in charge of the U's from 2008 until 2014.\nAnd three minutes after the break, Peck saw his header cleared off the line after meeting a pinpoint corner from Burrows.\nWilder looked to his bench and made five changes - including the introduction of Crystal Palace loanee Jesurun Rak-Sakyi on the hour mark - in an attempt to get back on level terms and the 22-year-old instantly looked to give the Blades impetus from the wing forcing the U's defence back.\nWith 20 minutes left, Gus Hamer then found Peck just outside the box but his right footed effort went a whisker wide of Cumming's goal as United threatened to get back into the match.\nThat was as close as the visitors got to scoring, however, as Gary Rowett's side held on to pick up just their second win in 12 games.\nSheffield United boss Chris Wilder told BBC Radio Sheffield:\n\"We didn't do enough so there's no arguments about the result.\n\"They started better than us - a team fighting for their lives, they stuck it on us with long throws. We had two or three opportunities before they scored which we should probably take.\n\"There was an opportunity to gain three points but well done to Gary [Rowett], they deserve their win and obviously an amazing away record comes to an end.\n\"It's not an attitude problem, we just made some bad decisions. It was a slow pitch, a dry day, and we have to recognise we have to play a little bit quicker and more direct.\n\"We've got to make better decisions, to do something different. We didn't do the basics right.\n\"The game's not won on a coupon, the game's won on a pitch, and we didn't do enough to win.\"", "url": "https://www.bbc.com/sport/football/live/cy0xgkz32j1t"}