{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:37:03", "date_modify": "2025-05-21 06:37:03", "date_publish": "2025-02-08 12:07:52", "description": "Centre James Hume said he \"didn't feel out of place\" as he made a try-scoring return to action for Ulster after nine months out with a knee injury.", "filename": "sport_articles_cly9wnmg4ngo_1747809423.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6bd2/live/b184e090-e612-11ef-b69e-d1a9cb83b595.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cly9wnmg4ngo_1747809423.html", "title": "James Hume: Try-scoring return against Reds 'felt good' for Ulster centre", "title_page": "James Hume: Try-scoring return against Reds 'felt good' for Ulster centre - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Centre James Hume said he \"didn't feel out of place\" as he made a try-scoring return to action for Ulster after nine months out with a knee injury.\nHume played 50 minutes of the province's 38-31 defeat to Queensland Reds in a mid-season friendly match at Kingspan Stadium on Friday night.\nHe touched down in the corner to score early in the second half shortly before he was replaced, and the 26-year-old was pleased with his display as he came through unscathed in his first appearance of the season.\n\"I did water boy at the Leinster game [a 20-27 home loss in November] which was ages ago so I've been in and round the match day experience, so it was great this week to be involved, I loved it,\" he said.\n\"It was nice to come in after the Zebre game [a 14-15 home loss in January] and change a few things, do the basics well and lead from the front.\n\"I haven't had a try in a long time, so it felt good, and I didn't feel out of place at all, it was seamless.\"\nHume praised the work of Ulster physio Gareth O'Neill for helping him through the long rehabilitation programme and getting him back playing within the nine-month time frame he had envisaged.\n\"Everything went to plan, Gareth has got me feeling more comfortable than when I was last playing,\" he explained.\nHume who has won three caps for Ireland, was also able to call upon help from a close support network of friends and relatives as well as Ulster hooker Tom Stewart, who was recovering from an ankle injury whilst Hume was also out.\n\"There were some really dark times but I have exceptionally good friends and family there to make me feel good so it could have been way worse.\n\"Tom helped me as well, he was getting his ankle rehabbed for five months during my nine months, so we had some good craic together.\"", "url": "https://www.bbc.com/sport/articles/cly9wnmg4ngo"}