{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:54:25", "date_modify": "2025-05-20 13:54:25", "date_publish": "2023-07-26 00:00:00", "description": "Japan beat Costa Rica 2-0 in Group C of the 2023 Women's World Cup.", "filename": "sport_live_football_66158478_1747749265.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/E089/production/_130518475_jap_goal_celebrate.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_football_66158478_1747749265.html", "title": "Fifa Women's World Cup LIVE: Japan vs Costa Rica score, commentary & updates from Group C game", "title_page": "Fifa Women's World Cup LIVE: Japan vs Costa Rica score, commentary & updates from Group C game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "FULL-TIME\nJapan 2-0 Costa Rica\nAll over!\nAs routine a win as Japan will have as they beat Costa Rica to put them on the verge of a place in the last 16.\nIf Spain avoid defeat to Zambia in the coming hours then Japan go through.\n'Japan have not been clinical enough'\nJapan 2-0 Costa Rica\nSiobhan Chamberlain\nEx-England and Man Utd goalkeeper on ITV1\nThey have created opportunities, there is no doubt of that. But they haven't got them on target enough or been ruthless enough, which could come back to haunt them in the latter stages [of the tournament].\nYou are not going to get 24 opportunities against a USA, and England, a Spain.\nPost\nJapan 2-0 Costa Rica\nGood header from Riko Ueki, who is unmarked in the middle of the box but once again Daniela Solera is there to make the save.\nCosta Rica have faced 70(!) attempts on goal in their two games at this tournament.\nPost\nJapan 2-0 Costa Rica\nJapan are preparing for a fifth change with Miyabi Moriya waiting to go on.\nUp goes the fourth official's board and there's five minutes of time added on.\nPost\nJapan 2-0 Costa Rica\nJapan feel to have dropped down a gear with the win in the bag - they are conserving energy for what will likely be a battle for top spot with Spain in their final group game.\nPost\nJapan 2-0 Costa Rica\nA shot on target for Costa Rica!\nJapan make a mess of trying to play the ball out from the back and Gloriana Villalobos is set up on the edge of the box but her strike is straight at Ayaka Yamashita.\nPost\nJapan 2-0 Costa Rica\nAnother shot for Daniela Solera, who has probably been the busiest person at this World Cup, but it is the sort of same she will take all day long as Kiko Seike prods a tame effort straight at the Costa Rica goalkeeper.\nJust over 10 minutes to go.\nPost\nJapan 2-0 Costa Rica\nJapan are still plugging away to try and get that third, even though they don't really need one. They pass the ball quickly to tee up Hinata Miyazawa for a shot on the edge of the area but her low drive is held by Daniela Solera.\nPost\nJapan 2-0 Costa Rica\nMélissa Herrera gets her head to a cross to take it away from Saki Kumagai inside the Costa Rica box.\nJapan have another corner, it is cleared but Japan resume their attack quickly and Riko Ueki heads straight at Daniela Solera.\nCLOSE!\nJapan 2-0 Costa Rica\nJapan have a corner and it is headed up in the air by a Costa Rica defender before Hinata Miyazawa volleys over.\nTwenty attempts on goal so far for Japan.\nPost\nJapan 2-0 Costa Rica\nDaniela Solera is back up on her feet and joking with her team-mates. She shakes hands with Riko Ueki after that collision between the pair and we look okay to resume shortly.", "url": "https://www.bbc.com/sport/live/football/66158478"}