{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:28:38", "date_modify": "2025-04-26 07:28:38", "date_publish": "2025-02-27 18:36:35", "description": "'There will be many minutes we have to suffer' - Wimmer on Ibrox trip", "filename": "sport_articles_c0kggpj5152o_1745652518.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d395/live/2be8f490-f52f-11ef-9621-af4ff1a2bf4c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_c0kggpj5152o_1745652518.html", "title": "'There will be many minutes we have to suffer' - Wimmer on Ibrox trip", "title_page": "'There will be many minutes we have to suffer' - Wimmer on Ibrox trip - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Motherwell manager Michael Wimmer admitted his team will \"have to suffer\" at times at Ibrox on Saturday but wants them to be brave on the ball.\nThe Fir Park side go into the Rangers clash off the back of Wimmer's first win in charge and the German is eager to bring the \"self-confidence\" of that 2-1 victory over Dundee to Glasgow.\n\"It's a big challenge on Saturday,\" Wimmer said. \"But I like it, to compete with the best teams, it makes us better. And I like this challenge.\n\"It's not easy, but it's easier to drive to Ibrox with a win after Wednesday. But it's a great team, they're in the last 16 of the Europa League, which says everything. But we will bring our performance and who knows what is possible?\n\"I think there will be many minutes we have to suffer. But this is football, it's always like this against a great team.\"\nRangers were stung early by Kilmarnock on Wednesday night, going 2-0 down before roaring back for a 4-2 win in Barry Ferguson's first game in charge.\n\"If we are good out of possession, perhaps we can win the ball, and then we have good counter-attacks,\" Wimmer added. \"We can be dangerous in these scenarios.\n\"But I also want to see that my team is brave in possession, that they also have the courage to have possession. Because if you never have the ball, it's not fun and it's too much suffering.\"", "url": "https://www.bbc.co.uk/sport/articles/c0kggpj5152o"}