{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:38:45", "date_modify": "2025-05-20 14:38:45", "date_publish": "2023-07-28 12:35:28", "description": "Nottingham Forest: 'More strength in midfield and firepower upfront ' - Your views", "filename": "sport_articles_cv2xvy84471o_1747751925.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0f17/live/4c5afb30-2d3d-11ee-b1d7-8fdc93c2782e.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cv2xvy84471o_1747751925.html", "title": "Nottingham Forest: 'More strength in midfield and firepower upfront '", "title_page": "Nottingham Forest: 'More strength in midfield and firepower upfront ' - Your views - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "After Steve Cooper said he still \"needs more players\" following Nottingham Forest's pre-season defeat by Leeds United, we asked you for your views on where the Reds must strengthen.\nHere are a selection of your comments:\nTom: We need better players to strengthen a squad which struggled for a lot of last season. The problem has been lack of possession and goals, especially away from home. More strength in midfield and firepower up front needed - and then hope there will be fewer injuries.\nMark: We simply must get that Dean Henderson deal done. None of our keepers are commanding enough. We also need another striker. We've been linked with dozens of players but nothing concrete, it seems. I like Leicester's Kelechi Iheanacho, albeit he's not an out-and-out striker. We need a solid midfield general, such as Leicester's Wilfred Ndidi or Ibrahim Sangare of PSV, who are two we've been linked with.\nAndy: Still need a few new faces. A goalkeeper, a centre-back, a defensive midfielder and a striker - plus we need to sell some players to balance the books.\nMatthew: We need another left-back as we are very short there. We also need a mobile centre-back with Niakhate out injured again, two goalkeepers as Hennessey and Horvath aren't good enough for the Premier League, and a back-up for Awoniyi. We then need to ship out Boly or McKenna, Cook, Shelvey, Wood, Dennis, Arter, Hennessey and Horvath.", "url": "https://www.bbc.com/sport/articles/cv2xvy84471o"}