{"authors": ["Matthew Howarth", "www.facebook.com"], "date_download": "2025-05-21 03:59:48", "date_modify": "2025-05-21 03:59:48", "date_publish": "2025-02-01 15:27:53", "description": "Nottingham Forest 7-0 Brighton: Ruthless hosts deliver perfect response", "filename": "sport_football_articles_c4g90m1gp7mo_1747799988.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/29d8/live/a29bf350-e0b0-11ef-a319-fb4e7360c4ec.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c4g90m1gp7mo_1747799988.html", "title": "Nottingham Forest 7-0 Brighton: Ruthless hosts deliver perfect response", "title_page": "Nottingham Forest 7-0 Brighton: Ruthless hosts deliver perfect response - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "How do you respond to your heaviest defeat of the season? By claiming your biggest top-flight victory in nearly 34 years.\nThat's just what high-flying Nottingham Forest did against Brighton on Saturday, romping to a 7-0 victory to deliver the ideal reaction to last weekend's 5-0 reverse at Bournemouth.\nNuno Espirito Santo's switch to a back three, designed to give his attacking players more freedom, proved a masterstroke as his players treated the home supporters at the City Ground to a ruthless attacking display, in which Chris Wood and Anthony Elanga played integral roles.\nWood, who had scored nine league goals against Brighton before Saturday, lifted his 2024-25 league tally to 17 with a well-taken treble. Only Stan Collymore (22 in 1994-95) has scored more for Forest in a single season in the competition.\nAfter setting up Morgan Gibbs-White's header and Wood's first of the afternoon before the break, Elanga completed a hat-trick of assists in the second half when he teed up Wood following a mazy run.\nThe home side were given a helping hand by Brighton on a number of occasions as Lewis Dunk put through his own net for the opener, Tariq Lamptey conceded a penalty for a clumsy foul on Gibbs-White and goalkeeper Bart Verbruggen passed straight to Jota Silva for Forest's seventh.\nBut there was no taking the shine off a ruthless Forest performance as Nuno's team registered their biggest league win since thrashing Chelsea 7-0 in the top-flight in April 1991.", "url": "https://www.bbc.com/sport/football/articles/c4g90m1gp7mo"}