{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:41:33", "date_modify": "2025-05-20 11:41:33", "date_publish": "2023-08-06 18:58:17", "description": "Bryson DeChambeau produces one of the most remarkable rounds in the history of golf on Sunday, shooting 58 to win the LIV Golf Greenbrier title.", "filename": "sport_golf_66419472_1747741293.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/A435/production/_130673024_gettyimages-1596787648.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_golf_66419472_1747741293.html", "title": "Bryson DeChambeau hits rare 58 to win LIV Golf Greenbrier title", "title_page": "Bryson DeChambeau hits rare 58 to win LIV Golf Greenbrier title - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Bryson DeChambeau produced one of the most remarkable rounds in the history of golf on Sunday, shooting 58 to win the LIV Golf Greenbrier title.\nThe 2020 US Open champion had 13 birdies and one bogey in his 12-under-par round to finish 23 under for the 54-hole event in West Virginia.\nThe score matches the lowest round on the PGA Tour, set by Jim Furyk in 2016 at TPC River Highlands in Connecticut.\nDeChambeau said it is \"probably the greatest moment in my golfing career\".\nIt is the lowest round recorded in the LIV series, which launched in 2021.\n\"It's beyond words,\" DeChambeau said. \"I've been working so hard for a long time and I knew something special was going to come at some point. I just didn't know when.\"\nThere have only been a handful of rounds of 58 recorded in top-level professional golf.\nTwo were on the Japan Tour, posted by Japan's Ryo Ishikawa in 2010 at The Crowns and by South Korean Kim Seong-hyeon in 2021 at the Golf Partner Pro-Am.\nGerman Stephan Jager had a 58 on the Web.com Tour in California in 2016 and Spain's Alejandro del Rey hit the same mark on the European Challenge Tour in Switzerland in 2021.\nThere have also been a number of 58s on developmental tours while Irishman David Carey made a 57 at the Cervino Open on the third-tier Alps Tour.\nThere have been 11 rounds of 59 on the PGA Tour, Sweden's Annika Sorenstam has the only 59 on the LPGA Tour and Englishman Oliver Fisher is the sole golfer to hit 59 on the European Tour.\nAmerican DeChambeau, 29, ended up winning by six shots from Chile's Mito Pereira, who had a closing 63.\nThe Old White course which hosted this week's tournament was the scene of a 59 from Australian Stuart Appleby during a PGA Tour event in 2010.\nDeChambeau birdied 22 of his last 34 holes for his first victory since the 2021 Arnold Palmer Invitational at Bay Hill.\nIt was DeChambeau's first win since his father, Jon, died last November at age 63 after years of battling kidney disease.\n\"He was with me out there all day today, no doubt,\" DeChambeau said.\n\"It has been a really difficult couple of years but doing it this way and finishing out with a 58... it's just amazing what I was able to do. I'm super excited.\"", "url": "https://www.bbc.com/sport/golf/66419472"}