{"authors": ["Ffion Wynne", "www.facebook.com"], "date_download": "2025-05-21 03:41:52", "date_modify": "2025-05-21 03:41:52", "date_publish": "2025-04-06 18:29:12", "description": "Russia's Alex Ovechkin becomes the National Hockey League's highest all-time scorer by hitting his 895th career goal to surpass the legendary Wayne Gretzky.", "filename": "sport_ice-hockey_articles_cjwv02e5j3xo_1747798912.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2a64/live/4aea1800-1312-11f0-a8f7-59659b31eb3f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_ice-hockey_articles_cjwv02e5j3xo_1747798912.html", "title": "NHL: Alex Ovechkin beats legend Wayne Gretzky's NHL goal record", "title_page": "NHL: Alex Ovechkin beats legend Wayne Gretzky's NHL goal record - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Russia's Alex Ovechkin has become the National Hockey League's highest all-time scorer by hitting his 895th career goal to surpass the legendary Wayne Gretzky's 31-year mark.\nCanadian Hall of Famer Gretzky broke the record previously held by his compatriot Gordie Howe in 1994.\nWashington Capitals' Ovechkin scored the historic goal against the New York Islanders on Sunday, with Gretzky in attendance.\nThe game was paused for almost 20 minutes as players and spectators acknowledged the historic moment.\nOvechkin was joined by NHL commissioner Gary Bettman and four-time Stanley Cup winner Gretzky, who said: \"I can tell you first hand, I know how hard it is to get 894 - [so] 895 is pretty special.\n\"They say records are made to be broken but I'm not sure who's gonna get more goals than that.\"\nOvechkin celebrated with his team-mates, completed a lap of the arena and then shook hands with his Islanders opponents before being joined by his family.\n\"What a moment for hockey, what a moment for myself,\" Ovechkin said.\n\"Finally no-one's gonna ask me about 'when you're gonna do it'. It's over right now.\"\nThe achievement was celebrated in Moscow-born Ovechkin's homeland too, with the Russian Olympic Committee and Russian President Vladimir Putin's economic envoy Kirill Dmitriev among those posting on social media.\nHis feat is all the more remarkable given that his season was interrupted for a few weeks when he broke his leg in November.", "url": "https://www.bbc.com/sport/ice-hockey/articles/cjwv02e5j3xo"}