{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:40:02", "date_modify": "2025-05-21 07:40:02", "date_publish": "2025-03-28 11:36:23", "description": "Edel McMahon will lead Ireland out in Sunday's Six Nations game with Italy as coach Scott Bemand makes three changes for the Parma encounter.", "filename": "sport_rugby-union_articles_cgl0l0g8250o_1747813202.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9b1d/live/1d8bd9a0-0bc6-11f0-9028-6b47f4f81c48.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cgl0l0g8250o_1747813202.html", "title": "McMahon returns to captain Ireland against Italy", "title_page": "Women's Six Nations: Edel McMahon returns to captain Ireland against Italy - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Women's Six Nations, Italy v Ireland\nVenue: Stadio Sergio Lanfranchi, Parma Date: Sunday, 30 March Kick-off: 15:00 BST\nCoverage: Live on BBC Two NI, BBC iPlayer and BBC Sport website & app from 14:45\nEdel McMahon will lead Ireland out in Sunday's Six Nations game against Italy as coach Scott Bemand makes three changes for the Parma encounter.\nMcMahon started on the bench in last weekend's 27-15 defeat by France in the opener but is named at blindside flanker in place of Brittany Hogan.\nAoibheann Reilly comes in at scrum-half for Emily Lane and Fiona Tuite takes over from Dorothy Wall in the second row.\nBemand says his side are \"in good health\" ahead of the match at the Stadio Sergio Lanfranchi.\nIreland came close to causing an upset in Belfast but in the end lost to France, who won despite a 20th-minute red card for Gabrielle Vernier.\nItaly started their campaign with a 38-5 away defeat by England last Sunday.\nIreland: Flood; McGann, Dalton, Higgins, Costigan (capt); O'Brien, Reilly; O'Dowd, Jones, Djougang, Campbell, Tuite, McMahon, King, Wafer\nReplacements: Moloney, McCarthy, Haney, Moore, Wall, Hogan, Lane, Breen", "url": "https://www.bbc.com/sport/rugby-union/articles/cgl0l0g8250o"}