{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:16:08", "date_modify": "2025-05-21 04:16:08", "date_publish": "2025-04-05 18:34:09", "description": "Gloucestershire fight back with the ball but Derbyshire remain on top on day two of their County Championship match.", "filename": "sport_cricket_articles_ckg19r779z9o_1747800968.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cd7b/live/c89cece0-124b-11f0-a75c-b716eb718e3b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_ckg19r779z9o_1747800968.html", "title": "County Championship: Gloucestershire fight back but Derbyshire on top", "title_page": "County Championship: Gloucestershire fight back but Derbyshire on top - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Derbyshire captain Wayne Madsen again left his mark on Gloucestershire with the 40th first-class century of his career on the second day of the County Championship Division Two match at Derby.\nThe 41-year-old's hundred was his sixth against Gloucestershire and put his side in a commanding position with support from Harry Came who scored 83 and shared a third wicket stand of 177.\nMadsen also completed 16,000 first-class runs during his 118 and with Zak Chappell adding a breezy 61 from 67 balls, Derbyshire reached 391, a lead of 169.\nMarchant de Lange with 3-31 was the pick of the bowlers for Gloucestershire who closed on 128-3, still 41 runs behind, with Ben Charlesworth unbeaten on 77.\nGloucestershire went into day two well aware of the damage Madsen could do and under another cloudless sky, he made the most of some very accommodating bowling.\nThe visitors' attack, with the notable exception of de Lange, lacked the discipline and consistency to put Madsen and Came under pressure, serving up far too many short and wide balls that could be dispatched to the ropes.\nMadsen welcomed Zaman Akhter by upper-cutting the seamer for six before Came reached his 50 which contained nine fours from 80 balls.\nDerbyshire cruised along serenely with 68 runs coming in the first hour with Madsen reaching an inevitable half-century and the 89th of his first-class career off 81 balls.\nGloucestershire's miserable morning got worse when Came on 64 edged Matt Taylor to second slip where Ollie Price fumbled the chance.\nPrice made amends with the penultimate ball of the session, trapping Came lbw as he went back to work the ball to leg but at lunch, Derbyshire were 49 ahead with Madsen eight away from another hundred.\nWhatever was said in the visitors dressing room clearly made an impression because they had their best spell of the match after the interval.\nDe Lange quickly had Brooke Guest caught behind and in his next over tempted Luis Reeve into a drive which Ollie Price pouched at second slip.\nWhen Anuj Dal was trapped on the crease by Tom Price, Derbyshire had lost four wickets in 26 balls for 10 runs and the Price brothers combined two overs later to remove Martin Andersson.\nAs the wickets tumbled around him, Madsen went to his hundred, the 39th first-class for Derbyshire, from 144 balls, and although Ollie Price dropped him four runs later, the off-spinner finally removed him when he missed a reverse sweep.\nBut Chappell crushed any hopes Gloucestershire entertained of wrapping up the innings quickly by dispatching Ollie Price for two big sixes on his way to a 60 ball 50.\nTaylor returned to bowl Chappell and have Jack Morley caught behind but Derbyshire had reasserted their authority leaving Gloucestershire with a lot of batting to do.\nThey started badly, losing Chris Dent cheaply when he got an inside edge into his stumps going half forward to Chappell in the seventh over.\nBut Ben Charlesworth and Ollie Price played with increasing authority to add 70 from 98 balls before Derbyshire set a trap which snared Price.\nPat Brown posted a leg gully for Price who turned a ball off his hip into the waiting hands of Andersson and Reece struck another blow when Miles Hammond moved across his stumps and was lbw.\nCharlesworth and James Bracey negotiated the last five overs but they will need to bat for a long time tomorrow to keep Gloucestershire in the contest.", "url": "https://www.bbc.com/sport/cricket/articles/ckg19r779z9o"}