{"authors": ["Dominic Raynor", "www.facebook.com"], "date_download": "2025-05-19 14:59:33", "date_modify": "2025-05-19 14:59:33", "date_publish": "2015-02-20 12:03:13", "description": "Dame N'Doye scores his second Premier League goal in as many games as Hull earn a late win over 10-man QPR.", "filename": "sport_football_31466664_1747666773.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81153000/jpg/_81153591_damendoyeceleb_getty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31466664_1747666773.html", "title": "Hull City 2-1 Queens Park Rangers", "title_page": "Hull City 2-1 Queens Park Rangers - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Dame N'Doye scored his second Premier League goal in as many games as Hull City earned a late win over 10-man QPR to move clear of the relegation zone.\nNikica Jelavic volleyed the home side into a 16th-minute lead from Steven Caulker's poor headed clearance.\nCharlie Austin then headed a first-half equaliser for QPR just minutes after Joey Barton had been sent off for lashing out at Tom Huddlestone.\nHull move up to 15th, while QPR are above the drop zone on goal difference.\nQPR responded quickly as debutant right-back Darnell Furlong - son of former Hoops striker Paul - mustered their first effort on goal. But his powerful header from the edge of the area was beaten away from the top corner by goalkeeper Allan McGregor.\nFurlong was then indirectly involved in a pivotal moment when his foul on Jelavic, for which he received a yellow card, resulted in the scuffle that led to a red card for visiting captain Barton.\nBarton, who was on a Premier League record run of seven consecutive yellow cards, appeared to be playing peacemaker but a soft shove on Hull defender Alex Bruce was followed by a swing at Huddlestone's groin and referee Anthony Taylor deemed it a sending-off offence.\nA feeling of injustice galvanised the away side and when Matt Phillips delivered yet another curling cross from the right, Austin headed home. The England hopeful was close to joining Hull in £4.5m move from Burnley in 2013, only for Tigers to pull out because of concern over the striker's knee.\nAustin, who has scored 44 goals for QPR since the that move broke down, was keen to remind the home fans of what they missed out on, celebrating his equaliser by hobbling about holding his supposedly dodgy knee.\nBut it was Hull, and birthday-boy N'Doye who had the last laugh, as the 30-year-old Senegal striker, a £3m signing from Lokomotiv Moscow on transfer deadline day, headed in at the death after being denied by a great save from Green moments earlier.\nHull City manager Steve Bruce: \"I think it's happened to us five or six times this year when we have conceded late on, so we were due one, that is for sure. Robert Green made a great save just 30 seconds before and I thought: 'We would take a point from here.'\n\"When we did get 2-1 up we had five centre-forwards on the pitch and I thought 'what am I going to do now?' It was back to the school days.\n\"It's always been important for us that Nikica Jelavic stays fit. That was the key for us. He was injured in the warm-up at Arsenal in October, he had an operation and came back too quickly from that. We needed something if Jelavic broke down, and Dame N'Doye I first saw in Denmark in the Champions League.\n\"We had to work extremely hard to get him but he has now got two in two games, and that could just be the difference.\"\nQPR manager Chris Ramsey: \"I am absolutely disappointed for the players, they could not have given more today. They tried to keep that point we had at half-time, but we cannot let it crush us because we have got more games to come.\n\"Robert Green made an outstanding save, but unfortunately [there was] a lapse of concentration right at the end, and that is what happens in the Premier League.\n\"It was a long time to go with 10 men, and to be honest for parts of it we tried to play but it was difficult. Hull are a very good side.\"", "url": "https://www.bbc.com/sport/football/31466664"}