{"authors": ["Jonty Colman", "www.facebook.com"], "date_download": "2025-05-21 04:23:22", "date_modify": "2025-05-21 04:23:22", "date_publish": "2025-01-23 16:00:11", "description": "Crystal Palace head coach Laura Kaminski spoke to the media ahead of her side's Women's Super League fixture with Tottenham on Sunday", "filename": "sport_football_articles_c0rqvw117e0o_1747801402.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3f42/live/ea6f9d00-d9a1-11ef-941c-57ca5bda0a5e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c0rqvw117e0o_1747801402.html", "title": "Crystal Palace press conference: Crystal Palace vs Tottenham preview", "title_page": "Crystal Palace press conference: Crystal Palace vs Tottenham preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Crystal Palace head coach Laura Kaminski believes the recent signings of Canadian forward Clarissa Larisey and Finnish forward Ria Oling will add value to her squad.\nPalace have signed the duo in the past week, with Larisey, 25 and Oling, 30, arriving from Swedish sides Hacken and Rosenborg respectively.\nSpeaking ahead of Sunday's Women's Super League match at home to Tottenham (14:00 GMT kick-off) where both could make their debuts, Kaminski spoke highly of the duo.\n\"They're different players in the sense that they offer different attributes,\" Kaminski told BBC Sport. \"Both players are going to add a lot of value to the squad and really support the squad depth now as we move into the second half of the season.\n\"Clarissa is a very quick threat and has proved that in terms of goals and being a real threat in behind. Ria has also been adding value in terms of off the pitch, on the pitch as both players will do, but Ria will offer a little bit of security as well as [being] a fantastic ball carrier.\n\"I'm very pleased with both of them and both have been settling in and gelling with the squad, which is nice.\"", "url": "https://www.bbc.com/sport/football/articles/c0rqvw117e0o"}