{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:59:05", "date_modify": "2025-05-21 03:59:05", "date_publish": "2025-04-07 07:59:05", "description": "Brentford 0-0 Chelsea: Fan views on Premier League game", "filename": "sport_football_articles_c5y4d55rq0wo_1747799945.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c5y4d55rq0wo_1747799945.html", "title": "Brentford 0-0 Chelsea: Fan views on Premier League game", "title_page": "Brentford 0-0 Chelsea: Fan views on Premier League game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your thoughts after Sunday's Premier League game between Brentford and Chelsea.\nHere are some of your comments:\nBrentford fans\nNick: Really strong first half from Brentford but we didn't create very many really good chances. We struggled to cope with Chelsea's changes and looked tired with no real attacking options on the bench. Thomas Frank doesn't get too much wrong, but not having a substitute forward seemed like a mistake. Kevin Schade looked knackered and Yoane Wissa was starting to cramp. Flekken looked assured, claimed the ball really well and made some good saves.\nMitchell: We played well without creating masses of chances. We lacked positivity with Yehor Yarmoliuk on but Vitaly Janelt helped. We missed two gilt-edged chances at the end, but a draw is probably the right result.\nMel: Another day of missed chances against a top-six team. Our defence once again showed defiance and stability. On balance, we should have nicked the game but a point was well deserved against a top-class side. Hint for Frank's staff: Schade needs some mental strengthening, he is a great lad who oozes speed and talent but sadly lacks confidence in his own ability. Well done Bees and great to hear our full-backs are nearing match readiness.\nChelsea fans\nAnn: Rubbish again, Chelsea. What is the manager doing? He will lose his place by not putting his best players on. You need to do better.\nKeith: We didn't lose is about all I can say about this game. There were some good performances but it is another two points dropped that were much needed.", "url": "https://www.bbc.com/sport/football/articles/c5y4d55rq0wo"}