{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:18:55", "date_modify": "2025-04-26 06:18:55", "date_publish": "2025-03-01 07:16:02", "description": "Donovan Mitchell scores 41 points as the Cleveland Cavaliers come from behind to beat the Boston Celtics.", "filename": "sport_basketball_articles_c9815wrj05do_1745648335.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2184/live/2c4b66c0-f66a-11ef-90f3-cd2828e858c7.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_basketball_articles_c9815wrj05do_1745648335.html", "title": "NBA round-up: Donovan Mitchell guides Cleveland Cavaliers to win over Boston Celtics", "title_page": "NBA round-up: Donovan Mitchell guides Cleveland Cavaliers to win over Boston Celtics - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Donovan Mitchell scored 41 points, including 26 in the second half, as the Cleveland Cavaliers came from behind to beat reigning NBA champions the Boston Celtics.\nIn the match between the Eastern Conference's leading teams, Cleveland trailed by 22 points less than five minutes into the game but fought back to win 123-116.\nIt was the Cavaliers' seventh straight victory on the road and ninth consecutive overall - and they have the NBA's best record (49-10).\nDarius Garland added 20 points for Cleveland and Evan Mobley contributed 17 points and 12 rebounds as they held off the Celtics, who were missing starters Kristaps Porzingis (illness) and Jrue Holiday (hand).\nBoston power forward Jayson Tatum had 46 points, 16 rebounds and nine assists while Jaylen Brown added 37 points.\nA Mobley three-pointer gave the Cavs their first lead of the game with eight minutes and 43 seconds left in the fourth quarter.\nBrown levelled it up at 114-114 with just over three minutes remaining, but Mitchell responded with a couple of driving baskets and the Cavaliers won to extend their conference advantage over the Celtics (42-18).\nThe Celtics beat Cleveland in the second round of last season's play-offs and Mitchell hailed the importance of Friday's win.\n\"It's a measuring stick,\" he said. \"These guys have won a championship and we want to continue to get to where they're at.\n\"The biggest thing is we fought. The biggest thing is just resiliency.\"\nIn Los Angeles, Luka Doncic celebrated his 26th birthday by scoring a game-high 31 points in the Lakers' 106-102 victory over city rivals the Clippers.\nLeBron James added 28 points and 13 rebounds for the Lakers, who withstood a late challenge from a Clippers team led by Ivica Zubac's 27 points and 16 rebounds.\nWestern Conference pacesetters Oklahoma City Thunder eased to a 135-119 victory over the Atlanta Hawks, with Shai Gilgeous-Alexander scoring 31 points to help then climb to a 48-11 record.\nNikola Jokic had his 28th triple-double of the season for the Denver Nuggets as they ended the Detroit Pistons' eight-game winning streak.\nJokic, the NBA's reigning Most Valuable Player, scored 23 points with 17 rebounds and 15 assists before sitting out most of the fourth quarter in the Nuggets' 134-119 victory.\nDenver guard Jamal Murray led all scorers with 31 points and team-mate Michael Porter Jr had a 28-point haul.", "url": "https://www.bbc.co.uk/sport/basketball/articles/c9815wrj05do"}