{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:48:36", "date_modify": "2025-05-21 05:48:36", "date_publish": "2025-01-31 13:54:06", "description": "'Success for Scotland would be top-three finish' - Johnnie Beattie", "filename": "sport_articles_c5y2dxnqdeko_1747806516.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7dab/live/e9e42790-dfd0-11ef-a108-5b0fc408bc51.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c5y2dxnqdeko_1747806516.html", "title": "'Success for Scotland would be top-three finish'", "title_page": "'Success for Scotland would be top-three finish' - Johnnie Beattie - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Scotland number eight Johnnie Beattie says the current side is \"the best I've seen\" but that success in this year's Six Nations \"would be a top-three finish\".\nScotland, who get under way against Italy at Murrayfield on Saturday, are without injured captain Sione Tuipulotu for the championship.\n\"This is the best Scottish side I've seen\", Beattie told BBC Sport. \"It is the best-coached side and in terms of talent the best since they won the last Five Nations in 1999. However, other sides have a greater depth of talent.\n\"Tuipulotu has been our brightest spark over the last three years with the way he challenges the gainline physically and brings Huw Jones on to the ball with short passes.\n\"It will be a huge opportunity for Stafford McDowall, who operated at a high level in the autumn. He knows his role as it is similar to how Glasgow play.\n\"Success for Scotland would be a top-three finish.\"\nBeattie has picked out Darcy Graham - absolutely electric on the wing\" - as his player to watch and is backing Jonny Gray to be a Lions bolter.\n\"After pretty much two years out of the game he has come back this year for Bordeaux and been just incessant in the way he plays the game,\" Beattie said. \"He doesn't miss tackles and is always in the game.\"", "url": "https://www.bbc.com/sport/articles/c5y2dxnqdeko"}