{"authors": ["Iain Carter", "www.facebook.com"], "date_download": "2025-05-21 04:04:35", "date_modify": "2025-05-21 04:04:35", "date_publish": "2025-01-15 09:28:05", "description": "Rory McIlroy says he has advised Tom McKibbin against switching to LIV Golf, adding they have had \"multiple conversations\" on the subject.", "filename": "sport_golf_articles_c15z991py5qo_1747800275.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b6b5/live/e536ed40-d319-11ef-844c-a7207455ca97.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_golf_articles_c15z991py5qo_1747800275.html", "title": "Rory McIlroy: Four-time major winner advised Tom McKibbin against LIV switch", "title_page": "Rory McIlroy: Four-time major winner advised Tom McKibbin against LIV switch - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Rory McIlroy is \"disappointed\" his fellow Northern Irishman Tom McKibbin is on the verge of making a surprise move to the breakaway LIV Tour.\nThe 35-year-old world number three says he would \"make a different decision\" to the one the player he has mentored is contemplating.\nMcKibbin, 22, is set to turn his back on the PGA Tour to join the Saudi Arabia funded circuit, having earned a place on the US circuit through his performances on the DP World Tour last year.\nMcIlroy has advised McKibbin ever since the younger player emerged as a junior at the same Holywood Golf Club near Belfast where the four times major champion learned the game.\nThe former world number one has revealed he has had several conversations with McKibbin regarding the proposed move. He said: \"Personally for me it would be a little disappointing if it were to happen.\n\"But I made it perfectly clear: I am not going to stand your way if you need to make the decision you feel like you need to make for yourself.\n\"At the same time, I feel like he's giving up a lot to not really benefit that much.\"\nMcIlroy believes the financial rewards on offer are not worth what McKibbin will sacrifice by moving to LIV. McKibbin is expected to receive a $5m signing on fee.\n\"No one knows exactly how much he's going to get,\" McIlroy told reporters at the Hero Dubai Desert Classic where he is the defending champion this week.\n\"What I would say is, there is still a ton of money to be made on the PGA Tour and the DP World Tour. There is so much money in the game, and some would argue too much money in the game for the eyeballs that we attract.\n\"I think that for whatever the benefit may be, I don't think it's worth the sacrifice to what he's potentially going to give up.\"\nMcKibbin will not be able to earn world ranking points playing LIV's 14 tournament schedule which will make it harder to qualify for majors and the Ryder Cup. But he is in the field for this year's Open Championship at Royal Portrush.\n\"I think he's got a ton of potential,\" McIlroy said. \"I said to him, if I were in your shoes, I would make a different choice than the one you're thinking of making.\n\"Working so hard to get your tour card in the States, something that he did, to achieve that goal last year was a big achievement.\n\"I think what he potentially is sacrificing and giving up with access to majors, potential Ryder Cup spot, if I were in his position and I had his potential, which I think I have been before, I wouldn't make that decision.\"\nMany observers are astonished that McKibbin seems set to go against the advice of his mentor, who was named winner of the 2024 Seve Ballesteros Trophy on Wednesday after being voted player of the year by his fellow DP World Tour professionals.\nHe is guaranteed a minimum of $500,000 from a season on the PGA Tour with the potential to earn far more in prize money.\nMcIlroy was among the first to congratulate his compatriot when he earned his US card here in Dubai last November.\n\"I'm disappointed that I won't get to see him that often, I was looking forward to seeing him a bit in the States,\" McIlroy told BBC Sport.\n\"I've thought about this a lot and I feel very lucky that LIV wasn't around when I was first coming up because who knows what would have happened?\n\"But the experiences I had and what I had to do whether it be here on the DP World Tour or the first couple of years on the PGA Tour, I think all of those experiences made me a better player.\n\"That's just one perspective and what I think. Tom's going to do what he thinks is best for him.\"\nAs McIlroy was making his comments, McKibbin was playing the pre-tournament pro-am here and strolling onto the ninth green adjacent to the Dubai tournament's media centre.\nThis may prove the young star's final appearance on the DP World Tour before LIV's season begins in Riyadh next month.\n\"I have known Tom since he was 10, 11 years old, and as soon as he got the offer, he rang me,\" McIlroy revealed.\n\"And I talked to him multiple times over the course of December to get a feel for what he was thinking, and basically what he was going to do.\n\"And all I could do is give my perspective. But I'm not him. I'm not in his shoes. He's a grown man at this point and can make his own decisions.\"", "url": "https://www.bbc.com/sport/golf/articles/c15z991py5qo"}