{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:38:20", "date_modify": "2025-05-20 14:38:20", "date_publish": "2023-07-28 12:51:02", "description": "Essex sign Kent wicketkeeper Jordan Cox on a three-year contract which will start next season.", "filename": "sport_cricket_66337060_1747751900.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/79B5/production/_130575113_gettyimages-1402857266.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66337060_1747751900.html", "title": "Jordan Cox: Essex sign Kent wicketkeeper on three-year contract", "title_page": "Jordan Cox: Essex sign Kent wicketkeeper on three-year contract - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Essex have signed Kent wicketkeeper Jordan Cox on a three-year contract which will start next season.\nThe 22-year-old has made 2,276 first-class runs since his debut in 2019, including four centuries.\nHe and Jack Leaning set a Kent record with a stand of 423 against Sussex in 2020 - Cox's share was 238 not out.\nThe following season he was named man of the match after scoring 58 not out off 28 balls as Kent beat Somerset by 25 runs in the T20 Blast final.\nCox received his first England call-up at the end of last season when the team went to Pakistan for seven T20 internationals, but has yet to make an appearance.\nHe has also played T20 cricket in Australia, South Africa, Pakistan and Sri Lanka and appeared for Oval Invincibles in The Hundred.\nEssex head coach Anthony McGrath described Cox as a \"young, hungry cricketer looking to impress in all formats\".\nHe continued: \"He will add real depth and quality to our batting line-up, as well as strengthening our wicketkeeping ranks too, and we are all very much looking forward to working with him.\"\nKent director of cricket Paul Downton said they were \"disappointed\" that Cox decided to move on.\n\"He has made a name for himself as a Kent cricketer and has been extremely well supported by the club,\" he added.", "url": "https://www.bbc.com/sport/cricket/66337060"}