{"authors": ["Dan Roan", "www.facebook.com"], "date_download": "2025-05-21 07:31:34", "date_modify": "2025-05-21 07:31:34", "date_publish": "2025-01-30 21:56:07", "description": "Lord Coe says his pitch to be the first British president of the International Olympic Committee \"seems to have landed well\".", "filename": "sport_olympics_articles_cwy1vjwmjvxo_1747812694.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9105/live/daf132c0-df51-11ef-9a06-5d7639ec876d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_olympics_articles_cwy1vjwmjvxo_1747812694.html", "title": "Lord Coe pitches to be first British president of the International Olympic Committee", "title_page": "Lord Coe pitches to be first British president of the International Olympic Committee - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Lord Coe says his pitch to be the first British president of the International Olympic Committee \"seems to have landed well\" with the organisation's members, but \"there's a long road ahead of us\".\nThe head of World Athletics and his six rivals hoping to succeed Thomas Bach gave brief presentations in Lausanne, Switzerland on Thursday.\nThe election takes place in March in Greece.\n\"I hope I was able to communicate my love for the Olympic movement,\" Coe told BBC Sport.\n\"I hope that I was able to get across the purpose and the energy that I think the role requires.\n\"It's not a job, it's a passion, and I hope this is what I can convey over the next few weeks.\"\nBritain's two-time Olympic 1500m champion has vowed to shake up the IOC, pledging to innovate, empower athletes, and introduce \"clear, science-based policies\" to protect the female category amid continuing debate over gender eligibility rules.\nUnder Coe, World Athletics has banned transgender women from competing in the female category at international events and toughened the rules over the participation of competitors with differences in sex development (DSD).\nIn his speech, Coe told the 110 IOC members: \"We must never lose sight of what makes the Games special and we are in danger of doing that. Competition must be fair, integrity absolute and sporting excellence non-negotiable.\n\"So we will maintain a laser-like focus on sporting excellence; we will protect and promote the integrity of women's sport, and we will strengthen anti-doping systems, all of which I have done, together with my Council at World Athletics.\"\nWhen asked how he felt his words had been received, Coe said: \"The honest answer to that of course is that you don't know. That's really up to the membership.\n\"I was asking [them] not just to cast a vote for me, but to cast a vote for themselves. A vote of confidence in the skills and the ability and the experience that sits within the IOC, because that in itself is enough to help us navigate those challenges.\n\"The 'holy grail' for any organisation, particularly in sport, is how to excite and maintain the engagement of young people. It's a cluttered landscape. There are many, many distractions and sport needs to figure out how it maintains excitement and interest, particularly Olympic sport.\"\nIOC rules meant candidates were only allowed to speak for fifteen minutes at the closed-doors event, with media barred and no scope for questions from members afterwards.\n\"I'm sure that whoever is successful will want to review a whole series of things,\" said Coe when asked about the lack of transparency in the process.\n\"I think how we choose the leadership of the IOC - in the same way [as] any organisation - will need looking at. And we just need to make sure that we're giving the members ample opportunity to really understand the motivations of people that sit behind those bids, and that can only be personal interaction.\n\"But I've been involved in politics long enough to know that you don't pick a fight with the returning officer on the eve of the election!\"\nCoe faces competition from Spaniard Juan Antonio Samaranch Jr, France's David Lappartient, Zimbabwean Kirsty Coventry, Japan's Morinari Watanabe, Swede Johan Eliasch and Prince Feisal al Hussein of Jordan.", "url": "https://www.bbc.com/sport/olympics/articles/cwy1vjwmjvxo"}