{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:57:02", "date_modify": "2025-05-20 14:57:02", "date_publish": "2023-07-27 07:36:18", "description": "'Incredibly versatile' Trossard gives Arsenal 'something very different'", "filename": "sport_articles_clewl44d5v0o_1747753022.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e4ea/live/daa016e0-2c4e-11ee-b1d7-8fdc93c2782e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_clewl44d5v0o_1747753022.html", "title": "'Incredibly versatile' Trossard gives Arsenal 'something very different'", "title_page": "'Incredibly versatile' Trossard gives Arsenal 'something very different' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Arsenal boss Mikel Arteta praised the performance of Leandro Trossard after Wednesday night's feisty pre-season friendly win over Barcelona.\nThe Gunners came from behind to ensure a winning end to their summer US tour, with the Belgian grabbing a brace alongside goals from Bukayo Saka, Kai Havertz and Fabio Viera in a 5-3 win.\n\"It’s great to see him score – he’s been working so hard,\" the Spaniard said post-match.\n\"He came in a really good condition for pre-season and he's a player that gives us something very different to the wingers that we have.\n\"He’s got incredible versatility and predictability to play in the positions. It’s great and will be good for his confidence, that’s for sure.\"\nArteta also hinted that Arsenal will continue to be active in the transfer market - particularly with outgoings - after spending over £200m on arrivals so far.\n\"We have 30 players here which is unsustainable, and obviously the market is still open, and things can happen - but we are prepared,\" he added.\n\"We are really happy with the squad we have at the moment; we obviously have improvements to make in terms of what we want to do in games, and we have to do that.\n\"Overall, I’m really pleased with the team.\"", "url": "https://www.bbc.com/sport/articles/clewl44d5v0o"}