{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:40:45", "date_modify": "2025-04-26 06:40:45", "date_publish": "2025-03-02 13:53:48", "description": "Home favourite Dylan Naidoo beats England's Laurie Canter in a play-off to win the rain-hit South African Open.", "filename": "sport_golf_articles_cj4n2v4ywygo_1745649645.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e16a/live/a6db7910-f76a-11ef-841c-1f98008bd439.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_golf_articles_cj4n2v4ywygo_1745649645.html", "title": "South African Open: Dylan Naidoo beats Laurie Canter in play-off after final round abandoned", "title_page": "South African Open: Dylan Naidoo beats Laurie Canter in play-off after final round abandoned - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "South Africa Open final standings\n-14 D Naidoo (SA), L Canter (Eng)Naidoo wins after first play-off hole -13 M Penge (Eng); -12 D Fichardt (SA), B Grace (SA), C Maas (SA); -11 A Pavan (Ita), D Whitnell (Eng).\nSelected others: -10 S Jamieson (Sco); -9 S Bairstow (Eng), R Mansell (Eng), -8 T Clements (Eng), N Kimsey (Eng); -7 R Ramsey (Sco), -6 J Donaldson (Wal)\nFull leaderboard\nHome favourite Dylan Naidoo claimed a dramatic play-off win over England's Laurie Canter after Sunday's final round at the South African Open was washed out because of rain.\nThe pair shared the lead on 14 under after both round two and three needed to be completed on Saturday, but the continuing inclement weather in Durban meant the fourth round was abandoned and the tournament went straight to a hole-by-hole play-off between them at the 18th.\nNaidoo, 27, played a delightful pitched second shot which left him with a four-foot birdie putt, while Canter chipped beyond the pin.\nThe Englishman, who won in Bahrain last month, then saw his birdie putt veer beyond the hole, but Naidoo held his nerve to claim a first DP Tour victory.\nIt also secured his place at July's Open Championship at Royal Portrush.", "url": "https://www.bbc.co.uk/sport/golf/articles/cj4n2v4ywygo"}