{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:47:33", "date_modify": "2025-05-20 13:47:33", "date_publish": "2023-07-31 12:53:30", "description": "Republic of Ireland boss Vera Pauw says her players leave the World Cup as \"world stars\" as they end their tournament debut with a point against Nigeria.", "filename": "sport_football_66359356_1747748853.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8DA3/production/_130595263_gettyimages-1566288670-1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66359356_1747748853.html", "title": "Women's World Cup 2023: Republic of Ireland players bow out as 'world stars', says boss Vera Pauw", "title_page": "Women's World Cup 2023: Republic of Ireland players bow out as 'world stars', says boss Vera Pauw - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Republic of Ireland boss Vera Pauw said her players leave the World Cup as \"world stars\" as they ended their debut with a point against Nigeria.\nThe Republic had already been eliminated from Group B following defeats by Australia and Canada.\nAfter a goalless draw with Nigeria, Pauw said she was \"really proud\".\n\"These players came into the tournament as very good players, they come out of the tournament as world stars,\" she said.\nIn their first-ever major tournament, the Republic fell to a 1-0 loss to co-hosts Australia in Sydney before a 2-1 defeat by Canada in Perth.\nThey were unable to sign off their World Cup adventure with a first win, but Pauw was upbeat after watching her side push three high-quality teams all the way.\n\"I think we can be really proud,\" added Pauw, who faces an uncertain future as Republic manager with her contract set to expire after the tournament.\n\"Three top-10 nations, I've said it before I think Nigeria are a top-10 nation, and we've played equal games against them. We lost by a penalty [to Australia] an own-goal [to Canada] and now a draw. It is amazing.\"\nPauw, who also said guiding the Irish to their first-ever World Cup point was a \"fantastic feeling\", added: \"It will change their lives. Not only in the experience that they've had but they will get other contracts, get more opportunities and the next generation can step in so it's amazing.\"\nWhile Pauw was positive about her team's performance, the build-up to the game was overshadowed by the Dutchwoman saying she and the players deserved clarity over her future.\nBut when asked if the Nigeria game felt like her last, Pauw said: \"I don't feel this is my last game because we are going home from a World Cup.\n\"Why would I not be at the homecoming? I go back with my team. Otherwise I would have stayed here and enjoyed the World Cup.\"\nPauw also explained her decision not to consider Katie McCabe's request for \"fresh legs\" in the second half.\n\"Why would we change? If Katie McCabe says that she wants a change that doesn't mean [we change]. She's not the coach.\n\"Everybody was doing so well. I said 'what do you want Katie, take our best player off?'\n\"A player is allowed to be emotional and say that but I step back to analyse and we make changes that are necessary.\n\"A player can always ask but as a coach it's not a refusal - as a coach you make decisions on what is necessary. A player can say anything to the coach, at least to me.\"\nWhen asked about the nature of the request from McCabe - who later posted an emoji with a zipped mouth, external on Twitter - Pauw said: \"That she wanted fresh legs - on her side.\n\"Everybody was doing so well. Sinead Farrelly was arguably the best player on the pitch at that moment, so I was not prepared to take the best player off.\"", "url": "https://www.bbc.com/sport/football/66359356"}