{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:43:39", "date_modify": "2025-04-26 06:43:39", "date_publish": "2025-03-01 17:45:03", "description": "Truro City manager John Askey hails his side as they thrash Chesham United 4-1 in National League South.", "filename": "sport_football_articles_cq5zwq0v8g1o_1745649819.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/99a6/live/95392d70-f6c4-11ef-a811-cd286d96b2f6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cq5zwq0v8g1o_1745649819.html", "title": "Truro City boss John Askey hails side after 4-1 win at Chesham United", "title_page": "Truro City boss John Askey hails side after 4-1 win at Chesham United - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Truro City manager John Askey could not hide his pleasure as his side thrashed Chesham United 4-1 in National League South.\nCaptain Connor Riley-Lowe gave the Tinners a fourth-minute lead before Tyler Harvey scored for the second successive game to make it 2-0 after 13 minutes.\nDominic Johnson-Fisher made it 3-0 three minutes from half-time before Luke Jephcott scored for the second time since joining on loan to make it 4-0 midway through the second half.\nMichael Weiss got a consolation for the hosts with three minutes to go as Truro consolidated fifth place in National League South.\nThey are two points off second-placed Eastbourne Borough with two games in hand and a further three points behind leaders Dorking Wanderers.\n\"We couldn't have started any better,\" Askey told BBC Radio Cornwall.\n\"It's the worst pitch I've seen for a long time, but we've dealt with the conditions and a really good performance.\n\"A lot of individual performances were really good so I can't be any more pleased.\n\"Every time we went forward we looked as though we were going to create something or score and that was the case.\n\"We probably could have had one or two more, but I was just disappointed that we conceded because the performance didn't deserve that, we deserved to get another clean sheet.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cq5zwq0v8g1o"}