{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:45:37", "date_modify": "2025-05-21 07:45:37", "date_publish": "2025-05-20 11:44:49", "description": "New manager an 'exciting prospect' for Kilmarnock, says David Watson", "filename": "sport_articles_c93llg40x0ro_1747813537.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ad75/live/ec5fc200-355b-11f0-bf15-094eef773db0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c93llg40x0ro_1747813537.html", "title": "New manager an 'exciting prospect' for Kilmarnock", "title_page": "New manager an 'exciting prospect' for Kilmarnock, says David Watson - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Midfielder David Watson says the idea of a new manager coming into Kilmarnock is an \"exciting prospect\".\nDerek McInnes' move to Hearts was confirmed on Monday after three-and-a-half years at Rugby Park.\nFormer Kilmarnock striker Steven Naismith has been linked with the vacant position at the Ayrshire club, while Tony Docherty, Stuart Kettlewell and Liam Fox are all out of work after recently leaving Premiership side.\nUnder-18s coach Chris Burke, who stepped up on a caretaker basis for the final league game of the season against Hearts, has been mooted.\nAsked if it was an uncertain period for the players as they headed off for their summer break without a manager, young midfielder Watson said: \"I don't think it's an uncertainty.\n\"I think it's more of an excitement to see who's going to come in and how they're going to work and to learn from a new manager.\n\"I've only done it once obviously with going from Tommy Wright to Derek McInnes, but it's an exciting prospect of somebody else coming in and seeing how they view football.\n\"It's quite exciting to see how we're going to play and how we're going to set up and how we do things differently or how it compares to other managers.\"\nFormer Scotland international Burke, who oversaw a 1-0 defeat at home to Hearts in Sunday's final Premiership clash, is open minded about what the future holds for him.\n\"I'm still new in my (coaching) journey, which is good,\" he said. \"So for myself, I need to make sure that if anything like this did happen anywhere in any club, then I'd have to make sure I'm ready for it.\n\"I need to have the best version of myself. I couldn't tell you what the next step is. I couldn't tell you my next journey in football. It's crazy.\n\"I was video analysing Under-18s teams and then before you know it, I'm video analysing Hearts' first team and you've got Lawrence Shankland on the team.\n\"It's crazy. Football is as mad as it is and it turns around very, very quickly.\"", "url": "https://www.bbc.com/sport/articles/c93llg40x0ro"}