{"authors": ["Andy Cryer", "www.facebook.com"], "date_download": "2025-05-21 07:26:02", "date_modify": "2025-05-21 07:26:02", "date_publish": "2025-05-20 23:23:00", "description": "Pep Guardiola says he will quit as Manchester City manager unless he is given a smaller squad next season.", "filename": "sport_football_articles_c5ykk83y74no_1747812362.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9ff4/live/6f6843f0-35cc-11f0-afd1-d969c7c30916.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c5ykk83y74no_1747812362.html", "title": "Pep Guardiola: Manchester City manager says he will quit club if squad size not reduced", "title_page": "Pep Guardiola: Manchester City manager says he will quit club if squad size not reduced - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Pep Guardiola has threatened to quit as manager of Manchester City if the club does not reduce the size of his squad this summer, saying leaving so many players out is \"impossible for my soul\".\nA number of Man City's senior players were not included in the matchday squad for Tuesday's 3-1 win against Bournemouth and Guardiola says he is unhappy at leaving so many players out.\nAbdukodir Khusanov, Savinho, James McAtee, Claudio Echeverri and Rico Lewis all missed out on Tuesday's 20-man matchday squad as City moved to third in the Premier League and within a point of Champions League qualification.\nBut, despite this showing the depth Guardiola has at his disposal, the Spaniard wants to work with a smaller squad next season.\nHe said: \"I said to the club I don't want that [a bigger squad]. I don't want to leave five or six players in the freezer. I don't want that. I will quit. Make a shorter squad, I will stay.\n\"It's impossible for my soul to [tell] my players in the tribune [stands] that they cannot play.\"\nGuardiola says it is difficult to continually leave players out of City's matchday squad.\n\"Maybe [for] three, four months we couldn't select 11 players, we didn't have defenders, it was so difficult. After, people came back, but next season it cannot be like that,\" the 54-year-old added.\n\"As a manager I cannot train 24 players and every time I select I have to have four, five, six stay in Manchester at home because they cannot play. This is not going to happen. I said to the club, I don't want that.\"\nCity spent more than £200m on four players in January, with Khusanov, Omar Marmoush, Nico Gonzalez and Vitor Reis arriving at the Etihad Stadium while Echeverri, a 2024 signing from River Plate, also joined following a loan spell back at the Argentine club.\nKevin de Bruyne is the only player confirmed to be leaving City this summer, while the future of midfielder Jack Grealish, who last started a Premier League match on 2 April, is also in doubt.\nWhen asked if it meant more exits were inevitable, Guardiola - who signed a deal keeping him at the club until 2027 - said: \"It is a question for the club. I don't want to have 24, 25, 26 players when everyone is fit. If I have injuries, unlucky, we have some players for the academy and we do it.\"\nGuardiola said a big squad is unsustainable and that it is important for \"the soul of the team\" that his players \"create another connection with each other that this season we lost it a bit\".\nAll Premier League clubs can name a 25-man squad, but this is not an exhaustive list of all players eligible to play. A team can also include under-21 players who are eligible over and above the 25-man squad limit.\nManchester City's website lists 28 first-team squad members, plus four players who are on loan elsewhere.\nGuardiola has explained in the past, external why he prefers to manage a smaller squad, going into the 2023-24 season with 20 senior players.\nIn comparison, Chelsea's official website lists 31 players in their squad list, with 21 other players out on loan, Brighton and Tottenham list 29 players, while Wolves name 30 players on their squad list.\nClubs with smaller squads than Manchester City this season include Arsenal with just 24 players and champions Liverpool , Aston Villa, Everton and Nottingham Forest with 25 squad players.", "url": "https://www.bbc.com/sport/football/articles/c5ykk83y74no"}