{"authors": ["Andy Burke", "www.facebook.com"], "date_download": "2025-04-26 03:40:42", "date_modify": "2025-04-26 03:40:42", "date_publish": "2025-03-05 09:42:34", "description": "BBC Scotland's Andy Burke examines how Scotland centre Huw Jones has rebuilt himself into one of the world's finest outside centres.", "filename": "sport_rugby-union_articles_c20drp4vnn8o_1745638842.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0456/live/5f8543c0-f94a-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_c20drp4vnn8o_1745638842.html", "title": "Six Nations 2025: The second coming of Scotland's Huw Jones", "title_page": "Six Nations 2025: The second coming of Scotland's Huw Jones - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "\"I'm so proud of how Huw's managed to bounce back, get back in the Scotland squad and become, genuinely, one of the best players in the world.\"\nDanny Care shared a Harlequins dressing room with Huw Jones at a time when the Scotland centre's career was at a crossroads.\nAfter an electric start to his Test career that yielded 10 tries from his first 14 Scotland appearances - including scores against England, France and New Zealand – a November 2018 defeat by Wales exposed serious flaws in Jones' game.\nHe fell off two tackles that led to two tries as Wales won 21-10 in Cardiff. Suddenly the eulogising about his razor-sharp attacking game was replaced by questions about whether his defence could cut it at the top level.\nJones soon fell out of favour under Dave Rennie at Glasgow Warriors and lost his place in the Scotland squad, missing out on the 2019 World Cup squad as Chris Harris, valued primarily for his defensive nous, made the 13 jersey his own.\nSo how did Jones rebuild from those lows to establish himself as one of the best outside centres in the world?\nRennie felt Jones was unable, or perhaps unwilling, to bring the defensive side of his game up to the required standard. Having lost the trust of his coach - if he ever had it – Jones took himself down to the English Premiership with Harlequins for the 2021-22 season.\nAfter initially struggling to work his way into the starting XV, Jones finally got a run in the team – at full-back.\n\"I think he was so underrated then, for whatever reason, by the powers that be above,\" said former England scrum-half Care, who is now a BBC pundit.\n\"I certainly was dumbfounded every time they would name the team that we wouldn't have Huw Jones in it. It blew my mind a little bit, really. He then found his way into the team at 15 for us and was unbelievable.\n\"He is an incredible rugby player. There are no downsides to Huw's game. His evasive skills, his speed, his power, his strength, his work-rate off the ball and being defensively very, very strong and solid.\n\"In attack, he's the type of player you just want to give the ball to and let him do his thing. Stuff happens when he plays. I was absolutely gutted when he left Quins.\"\nJones returned to Glasgow in 2022, coinciding with the appointment of Franco Smith as head coach.\nAlready in the building was Sione Tuipulotu, a midfield partner seemingly tailor-made to complement Jones' skills.\nAffectionately dubbed 'Huwipulotu' by Warriors fans, they have become arguably Scotland's greatest centre pairing of the professional era and were instrumental in Glasgow's URC title win last season.\nSince returning to Scotstoun, Jones has become a more rounded player, adding defensive solidity to his dazzling attacking skills.\n\"When you're younger and you first burst on to the scene, you can get away with just being supremely talented,\" said Pete Horne, who played alongside Jones for club and country and now coaches his former team-mate as part of Gregor Townsend's backroom staff.\n\"At at the top level, all the little details matter more than anything. And I think that's something with Huw, the penny's dropped with him. Defensively he's come on leaps and bounds. He's one of our best defenders.\n\"Another area that often goes unnoticed is the breakdown area, especially the way that Scotland play. We're constantly moving the ball into wide channels and Huw has improved that no end.\n\"He is incredible at running lines. His timing and his change of pace on to the ball is amazing. Not only does that create him so many line breaks but it also creates so much for us out the back of him because defenders have to respect him.\"\nThe second coming of Jones has arguably been more impressive than those heady days when he announced himself on the biggest stage in a blur of epic tries.\nHis try count now sits at 23 in 56 Tests, with four in this Six Nations alone despite Scotland's stuttering campaign.\nHe appears in a strong position for selection for this summer's British and Irish Lions tour to Australia, with many pundits believing it is a shootout between Jones and Ireland's Garry Ringrose for the starting 13 jersey.\n\"I think he's got a really strong chance of going on the Lions tour,\" said Care.\n\"There's not that many out-and-out 13s but also Huw has shown he could play 12, he could play on the wing, he could play 15. So I think he's the perfect Lions squad pick because he's got that versatility.\n\"I also think he's got a massive shout of starting in that 13 shirt in a Test team. I would love to see him on a Lions tour.\"\nJones has proved time and again he is a 'big game' player. Sixteen of his 23 Test tries have come in the Six Nations – a Scotland record he holds alongside Duhan van der Merwe and Stuart Hogg.\nHe has scored against every side in the Six Nations bar one - a try against Wales on Saturday at Murrayfield will complete the set.\nWhether that happens or not, Jones' game now is about so much more than just tries.", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/c20drp4vnn8o"}