{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:38:55", "date_modify": "2025-05-21 07:38:55", "date_publish": "2024-12-23 18:38:25", "description": "The Friedkin Group's takeover of Everton from Farhad Moshiri has created \"more of a positive energy\" around the club, says Toffees boss Sean Dyche.", "filename": "sport_football_articles_c047v49vpvvo_1747813135.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e888/live/9fda9250-c154-11ef-b200-e594162e2327.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c047v49vpvvo_1747813135.html", "title": "Everton: Sean Dyche says Toffees takeover has created 'positive energy'", "title_page": "Everton: Sean Dyche says Toffees takeover has created 'positive energy' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The Friedkin Group's takeover of Everton from Farhad Moshiri has created \"more of a positive energy\" around the club, says Toffees boss Sean Dyche.\nThe deal, which was completed on 19 December and is believed to be worth in excess of £400m, ended Moshiri's turbulent reign at Goodison Park.\nThe British-Iranian businessman bought a 49.6% share of the club in 2016 before increasing his stake to 94.1% six years later.\nThe Toffees have been a top-flight club since the 1953–54 campaign but have finished 16th, 17th and 15th in the past three Premier League seasons.\nEverton are four points above the relegation zone but are unbeaten in three games following victory over Wolves and goalless draws with title-chasing Arsenal and Chelsea.\nReflecting on Moshiri's tenure, Dyche said: \"This has been an indifferent period for many different reasons.\n\"Expectation went higher, spending went lower, which is always a challenge when that happens.\n\"The ownership seems to have given a more balanced view of the club at the moment, a more positive outlook, which is helpful of course, and then it's for us to keep building on the pitch.\"\nDyche, whose side faces a Manchester City team with seven defeats in their past nine games on Boxing Day, added: \"The new owners' words are just 'stability' and I think that seems to have brought calmness. But that doesn't last forever.\n\"I think there just seems to be an air of changing the mood about Everton Football Club. It just seems to have lifted things.\"", "url": "https://www.bbc.com/sport/football/articles/c047v49vpvvo"}