{"authors": ["Chris Osborne at London Stadium", "www.facebook.com"], "date_download": "2025-05-19 15:26:30", "date_modify": "2025-05-19 15:26:30", "date_publish": "2017-07-16 10:12:08", "description": "Britain's Jonnie Peacock takes 100m gold as Aled Davies wins his third discus world title at the World Para-athletics Championships.", "filename": "sport_disability-sport_40623112_1747668390.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/B58C/production/_96967464_jonniepeacock_getty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_disability-sport_40623112_1747668390.html", "title": "World Para-athletics Championships: Jonnie Peacock wins second T44 gold", "title_page": "World Para-athletics Championships: Jonnie Peacock wins second T44 gold - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jonnie Peacock stormed to victory in the T44 100m final at the World Para-athletics Championships in London to claim Britain's eighth gold medal.\nThe 24-year-old two-time Paralympic champion finished in 10.75 seconds for his second world title.\nPeacock, a single-leg amputee, crossed the line ahead of German Johannes Floors and American Jarryd Wallace.\nIn the morning session, Britain's Aled Davies won his third world title in the F42 discus.\nWelshman Davies, the London 2012 champion and world-record holder, threw 51.54m to beat second-placed Tom Habscheid of Luxembourg.\nThe 26-year-old can add gold this Saturday in the shot put, an event he won at Rio 2016 and at the last two World Championships.\nAnd there was a bronze medal for Scotland's Maria Lyle in the T35 200m.\nLyle, 17, who has cerebral palsy, had won 10m and 200m silver at the 2015 Worlds.\nGB are leading the medal table with 15 in total, following Saturday's incredible haul of nine medals, including five golds.\nFloors and the 2013 200m world champion Wallace had been expected to be Peacock's main rivals for 100m glory, particularly with America's Richard Browne not present to defend his title.\nBut when Peacock won his heat in a personal best time of 10.64 seconds, just 0.03secs short of Browne's world record, the result looked a foregone conclusion.\n\"It was so scary, I was cramping in my warm-up,\" he told BBC Radio 5 live. \"I was stretching my hamstring over and over again and that is not a usual thing to do on the start line. I'm so thankful I finished in one piece.\n\"Coming back here is insane. There is no other place that treats para-sport like this. We have taken it a step on. If we could have every World Championships here, that would be great as the way everyone laps it up is insane.\"\nDavies, who is a close friend of team-mate Peacock, was born with talipese and hemi-hemilia, which means his right leg is missing bones, muscle and ligaments.\nHe has focused on shot put recently, after discus was dropped for Rio 2016, but will be aiming to complete the triple double in London by claiming the discus and shot put titles at three consecutive Worlds.\n\"I'm overwhelmed. It's not the event I've been practising. I'm probably a bit too big for discus at the moment,\" he told BBC Radio 5 live.\n\"I'm built for shot put and you'll see that Saturday. I've got something special.\n\"This is such a special place with so many memories. I wanted to give the crowd a gold medal.\"\nIreland's Jason Smyth, the fastest Para-athlete in the world, successfully defended his title to become a nine-time World and Paralympic champion.\nThere was anticipation that the visually impaired athlete might break his own world record of 10.46 seconds, but he clocked a time of 10.63.\nCanada's Brent Lakatos - the husband of Stef Reid, Britain's gold medal-winning T44 long jumper from Saturday - won his eighth world crown by taking the T53 200m.\nBut he was down in fifth in the T54 1500m final, an event in which he holds the world record, with Swiss double Paralympic champion Marcel Hug taking gold.", "url": "https://www.bbc.com/sport/disability-sport/40623112"}