{"authors": ["Dan Roan", "www.facebook.com"], "date_download": "2025-05-21 05:15:41", "date_modify": "2025-05-21 05:15:41", "date_publish": "2025-04-03 17:48:05", "description": "After US president Donald Trump unveiled his new trade tariffs, BBC sports editor Dan Roan looks at what impact the move could have on the world of sport.", "filename": "sport_articles_c93gqz97wy9o_1747804541.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9019/live/d55dbba0-10aa-11f0-9af0-9909a653fc84.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c93gqz97wy9o_1747804541.html", "title": "Donald Trump tariffs: How might they affect sport?", "title_page": "Donald Trump tariffs: How might they affect sport? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "\"It's potentially the difference between life and death.\"\nThe words of a \"hugely frustrated\" Lynn Calder - the head of Ineos Automotive, the car company owned by Manchester United minority shareholder Sir Jim Ratcliffe - when talking about the impact United States tariffs would have on the business.\nWith its manufacturing based in France, the company now faces the prospect of 25% tariffs being imposed on vehicles exported to the crucial American market, with Calder admitting it was \"vulnerable to tariffs\" and needed \"direct and urgent political intervention\"., external\nHer stark warning was a reminder of the effect the duties introduced by US President Donald Trump will have on the wide range of industries linked to sport through investment or sponsorship.\nGlobal stock markets have fallen as investors reacted amid fears of inflation, but beyond the wider economic turmoil, how else could the ripples of a trade war affect the world of sport?\nTrump's so-called 'Liberation Day' could have ramifications for a club such as Manchester United in other ways.\n\"It has $650m of loans from the US because the club is listed in New York,\" football finance expert Kieran Maguire told BBC Sport.\n\"If the Trump administration's tariffs have a positive impact on the US dollar and it strengthens, that means the value of those loans in sterling terms will increase, and this could hit United's accounts and have implications for Profit and Sustainability rules (PSR) that limit clubs' losses.\n\"In the 2022 accounts there was a £58m cost due to foreign exchange movements on these loans. So the United board will be watching with interest as to what happens in terms of the market reaction to these tariffs as far as global exchange rates are concerned.\"\nThe US is set to stage some of the world's biggest sports events over the next few years, including the 2026 World Cup and 2028 LA Olympics and Paralympics.\nThese events are meant to provide overseas businesses with a key opportunity to raise their profile and boost sales in the US.\nKorean car manufacturer Hyundai Group, for instance, will look to take advantage of its sponsorship deal with football governing body Fifa during the Club World Cup this year, and then the World Cup in 2026. But could Trump's aggressive trade policies make such businesses think again?\n\"I suspect some sponsors are now re-assessing how they 'activate' such deals in the US, given the trade barriers that have now been imposed,\" says John Zerafa, a sports event bid strategist.\n\"Why would a sponsor spend millions of pounds doing so if it is now prohibitive to sell in America?\"\nMany sports teams and athletes are also sponsored by sportswear brands.\nWith most of these companies relying on materials and manufacturing in Asia - where Trump has directed some of the highest tariffs - it is no surprise that shares in the likes of Nike, Adidas and Puma have all fallen sharply, with fears that higher importing costs would be passed on to consumers.\nHowever Maguire says the impact should be limited. \"For a $100 (£76.36) replica sports jersey sold in the US, manufacturing costs are likely to be in the region of $12-15 dollars at source, and maybe even lower,\" he says.\n\"So even if there's a 40% tariff when the goods are imported to the US, that'll only be around $4 more.\n\"Consumers are used to paying premium prices in sports retail. The manufacturer and retailer should absorb some of this, and it shouldn't impact on the amount being sold - or the commissions being earned by clubs that sell merchandise.\"\nThe European Sponsorship Association told BBC Sport that it was \"monitoring the situation closely and will actively seek the views of the sport sponsorship community\".\n\"As a representative body we will respond accordingly if there proves to be any sign of a material negative impact on the industry,\" it said.\nAmid talk of a trade war, Trump's tariffs have also raised questions over the atmosphere at the various sports events it is due to host, not least the Ryder Cup in the US later this year.\nWith European Union leaders highly critical of the policy, it would be little surprise if anti-European sentiment among the American fans is intensified.\nAnd then there's the 2026 World Cup, which the US is co-hosting alongside Mexico and Canada.\nIn January, Trump vowed to impose tariffs of 25% on imports from the neighbouring countries - America's two biggest trading partners - in a move he said was designed to address the entry of opioid drug fentanyl to the US, the large amounts of undocumented migrants that have come across US borders, as well as trade deficits.\nLast month Trump claimed the political and economic tensions between the US and its World Cup co-hosts would be good for the tournament. \"I think it's going to make it more exciting. Tension's a good thing,\" he said.\nHe also announced the formation of a World Cup taskforce, external which he will chair to ensure the tournament runs smoothly. Fifa has been approached for comment on their response to the US President's tariffs.\nBut Trump's protectionist policies raise serious questions over the three countries' willingness and ability to work together on security for instance, or to ensure fans can gain entry visas, and then pass easily across borders.\nWith imported materials such as steel and aluminium more expensive, there may also be concerns about the development of infrastructure for the tournament.\nTrump has also spoken provocatively about making Canada 'the 51st state', leading to the US anthem being booed by Canadian fans at NBA and NHL fixtures.\nCould the additional tensions over tariffs mean such scenes are repeated at the World Cup or even the Olympics?\n\"Nations and cities host global sports events for a variety of reasons, from enhancing reputation and driving global investment, to sending a message to the world that you are open, welcoming and ready to do business. It seems nothing could be further from the truth in terms of Trump's America,\" says Zerafa.\n\"It's not just tariffs. From forced repatriations, and hostility to the EU and Nato, to a possible takeover of Greenland and bad blood with Canada. All this makes it a very challenging backdrop for the World Cup 2026 and LA Games in 2028 to promote that narrative.\"\nThe IOC has been approached for comment. Insiders told BBC Sport they are confident that Trump's love of sport - and his desire for LA 2028 to be a successful global platform towards the end of his second term in office - will ensure that preparations for the Olympics are not derailed by geopolitics.\nWith retaliatory tariffs being imposed by other countries, a trade war could impact any person, team or league buying sports equipment that is made in the US, as well as American consumers of products manufactured overseas of course.\nThe Premier League exports its content to the US via its lucrative £2bn TV deal with NBC, but because this is deemed a service rather than a product, the tariffs do not apply.\n\"As such there should be no consequences, unless there is some form of escalation in the trade relationship between the UK and the US,\" says Maguire.\n\"So the Premier League won't have to come to some sort of compromise with its broadcast partner.\"\nA bigger concern for the UK football industry will be consumers having less money to spend on tickets and TV subscriptions if fears of a recession come to pass.", "url": "https://www.bbc.com/sport/articles/c93gqz97wy9o"}