{"authors": ["Phil Parry", "www.facebook.com"], "date_download": "2025-05-21 05:05:56", "date_modify": "2025-05-21 05:05:56", "date_publish": "2025-01-23 11:26:40", "description": "Brentford news: Opinion - Phil Parry on Keane Lewis-Potter", "filename": "sport_football_articles_cn7gz3l8y3po_1747803956.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/34ed/live/7c4ea6d0-4780-11ef-9e1c-3b4a473456a6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cn7gz3l8y3po_1747803956.html", "title": "Opinion - Phil Parry on Keane Lewis-Potter - BBC Sport", "title_page": "Brentford news: Opinion - Phil Parry on Keane Lewis-Potter - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The fact that there was disappointment at securing just one point against Manchester City and Liverpool last week is a clear indication of the level of performance in both matches from Brentford.\nThomas Frank insisted the draw with City was the first time his side had gone \"toe to toe with a top-three side for 90 minutes\" since being promoted to the top flight. He certainly was not wrong about a match they could have justifiably won.\nNaturally, positive performances and outcomes help focus attention on the players, as well as the coaches, who are making a difference. The likes of Yoan Wissa and Bryan Mbeumo will attract attention due to their attacking prowess but there are others who deserve credit from the wider footballing world.\nOne such player is Keane Lewis-Potter, now in his third season with the club after arriving from Hull City in July 2022. Injury in his first campaign hampered his opportunities, while last season he admitted it was hard to deal with the mental challenges and frustration of starting just 15 games in the top flight.\nPatience has paid off and this season he has become an invaluable part of the starting XI, displaying incredible adaptability. A winger who has played at wing-back, in 2024-25 Lewis-Potter has been deployed as a left back in a four-man defence - a position he admits he has had to learn.\nHe has done it extremely well, dealing on Saturday with the dual threat of Mohammed Salah and Trent Alexander-Arnold for example. He has shown great defensive acumen but also the capability to spring forward into a more natural attacking mode.\nFans will be keen to see Lewis-Potter used in a more offensive way from now on, but what he has shown covering for Rico Henry is that he is can play a variety of positions at a very high level.\nThat only bodes well for more starts and banishing that frustration.", "url": "https://www.bbc.com/sport/football/articles/cn7gz3l8y3po"}