{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:56:03", "date_modify": "2025-05-21 07:56:03", "date_publish": "2025-03-27 21:45:22", "description": "Loughgall announce former Finn Harps and Dungannon Swifts boss Darren Murphy as their new manager on a three-year deal.", "filename": "sport_articles_cevxrr97y0no_1747814163.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/393d/live/780e2770-0b53-11f0-852c-e5502ca11fa3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cevxrr97y0no_1747814163.html", "title": "Loughgall announce Murphy as their new manager", "title_page": "Irish Premiership: Loughgall announce Murphy as their new manager - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Irish Premiership side Loughgall have announced former Dungannon Swifts boss Darren Murphy as their new manager on a three-year deal.\nMurphy's appointment follows confirmation earlier this week of his departure as manager of League of Ireland First Division side Finn Harps.\nHe replaces former Villagers boss Dean Smith, who recently parted company with the struggling Lakeview Park outfit.\nLoughgall sit nine points adrift of Carrick Rangers at the foot of the table, having won just four and drawn six of their 33 league matches to date this season.\nThe 50-year-old's previous coaching jobs also include being part of the backroom staff at both Linfield and Crusaders.\nLoughgall chairman Sam Nicholson said: \"We moved swiftly to appoint a new manager and after a thorough selection process, we believe Darren is the ideal candidate to drive Loughgall FC forward.\n\"His vision and expertise will be invaluable in developing our boys and girls youth academies.\n\"We are excited to see Darren's impact throughout the club and are committed to ensuring a successful future for Loughgall FC.\"\nThe current backroom staff will remain in place for next Tuesday's league game against Ballymena United, with Murphy in attendance.", "url": "https://www.bbc.com/sport/articles/cevxrr97y0no"}