{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:08:59", "date_modify": "2025-05-20 12:08:59", "date_publish": "2023-08-05 10:22:35", "description": "Tottenham sign 18-year-old central defender Ashley Phillips on a five-year deal from Blackburn Rovers.", "filename": "sport_football_66415714_1747742939.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1E42/production/_130664770_gettyimages-1248126747-1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66415714_1747742939.html", "title": "Ashley Phillips: Tottenham sign England Under-19 defender from Blackburn Rovers", "title_page": "Ashley Phillips: Tottenham sign England Under-19 defender from Blackburn Rovers - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tottenham Hotspur have signed England Under-19 centre-back Ashley Phillips from Blackburn Rovers.\nThe 18-year-old, who played eight times for Rovers in the Championship last season, has signed a five-year deal.\nHe joined Blackburn aged 12 in 2017 and progressed through the academy before making his first-team debut in 2022.\nTottenham activated his £2m release clause and the defender becomes their sixth summer signing under new manager Ange Postecoglou.\nThey have also recruited England midfielder James Maddison, external for £40m from Leicester City and Italian goalkeeper Guglielmo Vicario from Serie A side Empoli, while Israel winger Manor Solomon joined on a free transfer after leaving Shakhtar Donetsk.\nLoan deals for Sweden forward Dejan Kulusevski from Juventus and Spain full-back Pedro Porro from Sporting Lisbon have also been made permanent.\n\"I've matured so much at a young age and it really means a lot,\" said Phillips as he thanked Blackburn for developing his talent.\n\"Blackburn Rovers will always have a place in my heart and I wish the club all the best going forward.\"\nPhillips has been a regular in England's youth set-up since he switched his allegiance from Wales in 2021 and he captained England Under-18s against Norway in June.\nTottenham's 2023-24 Premier League campaign begins away at Brentford on Saturday, 13 August.", "url": "https://www.bbc.com/sport/football/66415714"}