{"authors": ["David Currie", "www.facebook.com"], "date_download": "2025-05-21 07:39:58", "date_modify": "2025-05-21 07:39:58", "date_publish": "2025-03-28 11:40:21", "description": "St Mirren: Robinson on VAR grievance, 'huge' mistakes & injury issues", "filename": "sport_articles_c70w0wlvzn4o_1747813198.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/aab9/live/ad6c3ca0-0bc5-11f0-9028-6b47f4f81c48.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c70w0wlvzn4o_1747813198.html", "title": "Robinson on VAR grievance, 'huge' mistakes & injury issues", "title_page": "St Mirren: Robinson on VAR grievance, 'huge' mistakes & injury issues - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Robinson says a change in laws is required so that VAR can recommend reviews of second yellow cards.\nHe described the current situation as \"blatantly wrong\" after receiving an acknowledgement from the Scottish FA that Toyosi Olusanya's second yellow against Motherwell was a mistake.\nRobinson says this is the third time St Mirren have been on the end of ''second yellow'' mistakes this season and the club are \"top of the league\" for decisions going against them. He adds these decisions are \"huge\" and can affect where you finish in the league.\nThe manager has fresh injury concerns with Killian Phillips missing training all week because of a back spasm and Alex Iacovetti ruled out with a hamstring/back issue. Elvis Bwomono is sidelined with a calf injury sustained on international duty and Olusanya is suspended, but Mikael Mandron is back in training although unlikely to feature on Saturday.\nDespite the absences, Robinsons insists his side are \"strong enough to win\" and, with three games to go until the split and a four-point deficit on sixth place, Robinson adds: \"We believe we can go and get a good amount of points and see what happens.\"\nOn St Mirren failing to beat Kilmarnock since 2021, Robinson says: \"I haven't been here four years, so I can't take the blame for all of that! There's nothing between the sides. Both good sides. Both don't get acknowledged for the level of football we play at times. People say we're organised, we're physical. People take that as a slant. I think that's the minimum you should be as a manager.\"", "url": "https://www.bbc.com/sport/articles/c70w0wlvzn4o"}