{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:06:57", "date_modify": "2025-05-20 14:06:57", "date_publish": "2023-07-31 00:00:00", "description": "Follow live text commentary as Japan face Spain & Costa Rica play Zambia in Group C of the 2023 Women's World Cup.", "filename": "sport_live_football_66183274_1747750017.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/51B7/production/_130591902_gettyimages-1582439216.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_football_66183274_1747750017.html", "title": "Fifa Women's World Cup LIVE: Japan vs Spain & Costa Rica vs Zambia score, commentary & updates from Group C", "title_page": "Fifa Women's World Cup LIVE: Japan vs Spain & Costa Rica vs Zambia score, commentary & updates from Group C - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Thanks and goodbye\nWhat a day it has been for Japan, who thrashed Spain to advance as Group C winners, and Zambia as they gained their first ever win at a World Cup.\nIt promises to be a dramatic few hours as Australia look for a victory against Canada to stay in the tournament.\nYou can follow all the action here.\nFor this page, the final whistle has gone, so thanks for your company and see you soon.\nMore to come\nIt's a busy day 12 of the 2023 Fifa Women's World Cup, with two matches still to come as Australia look to keep their hopes alive and they need to beat Canada to advance.\nThis is what is still to come on Monday...\nGroup B - Canada v Australia (11:00 BST)\nGroup B - Republic of Ireland v Nigeria (11:00 BST)\nJapan thump Spain to book last-16 Norway tie - read the report\nFT: Japan 4-0 Spain\nNeil Johnston\nBBC Sport at Wellington Regional Stadium\nJapan showed why they are serious contenders at the Women's World Cup by hammering Spain to finish top of Group C and book a last-16 showdown with Norway.\nThe 2011 world champions made it look easy as they scored three times before half-time, with Hinata Miyazawa getting two to take her tally to four goals and become the tournament's leading scorer.\nThe attacking midfielder put Japan ahead with a calm finish after Spain's defence had been exposed, before Riko Ueki doubled the lead with a deflected finish which looped into the net.\nMiyazawa, who scored two in Japan's opening group game against Zambia, made it 3-0 by firing across goal and into the net in front of a crowd of 20,957.\nSubstitute Mina Tanaka added to Spain's pain with a fourth goal in the 83rd minute.\nZambia beat Costa Rica for first Women's World Cup win - read the report\nFT: Costa Rica 1-3 Zambia\nJoe Rindl\nBBC Sport\nZambia secured their first Women's World Cup win by edging out Costa Rica in their final Group C match.\nLushomo Mweemba opened the scoring for Zambia inside the first three minutes and Barbra Banda added a second from the spot midway through the first half.\nCosta Rica's Melissa Herrera pulled a goal back shortly after the break, but Racheal Kundananji completed the win, netting a third in injury time.\nBoth sides had already been eliminated after two matches. Zambia had lost 5-0 against both Japan and Spain in their first two games.\nHow Group C finishes\nJapan 4-0 Spain; Costa Rica 1-3 Zambia\nThis is how Group C ends.\nJapan with a superb record, played three, won three, scored 11, conceded none.\nSpain also through and will be desperately trying to instantly forget about this one.\nZambia's first ever win sees them move above Costa Rica, who end up pointless.\nFULL-TIME\nCosta Rica 1-3 Zambia\nZambia, after 5-0 defeats in both their first two games, get their first ever win at a Women's World Cup.\nLushomo Mweemba volleyed them in front inside three minutes and Barbra Banda converted a penalty, after she had been fouled, for number two.\nMelissa Herrera pulled one back for Costa Rica, but Zambia scored a third in injury time through Racheal Kundananji.\nCosta Rica, just as they did in their previous finals appearance in 2015, will be going home after losing all three of their group matches.\n'Inspiring the next generation'\nCosta Rica 1-3 Zambia\nSiobhan Chamberlain\nEx-England and Man Utd goalkeeper on ITV4\nZambia have had to withstand so much pressure from Costa Rica, but they look to have sealed their first ever World Cup win here.\nHopefuly there are little girls back home that will be dreaming of representing Zambia in the World Cup.\nThey are inspiring that next generation, and will look to make their presence on this stage a regular occurence.\nFULL-TIME\nJapan 4-0 Spain\nBrilliantly ruthless from Japan, who soaked up the Spain pressure before a delightful display of counter-attacking football.\nHinata Miyazawa with two to move on to four and be the tournament's top goalscorer so far, with Riko Ueki and Mina Tanaka also on the scoresheet.\nSpain, despite having 77% of the ball, are left humbled and embarrassed.\nJapan advance as Group C winners and play fellow former winners Norway, while Spain take on Group A winners Switzerland.\nGOAL - Costa Rica 1-3 Zambia\nRacheal Kundananji\nThat should do it for Zambia, that should be their first ever World Cup win.\nBarbra Banda with a lovely reverse pass, Racheal Kundananji takes a touch then slots the ball past Daniela Solera.\nThree goals and maybe three points and a bit of history for the African nation.\nPost\nJapan 4-0 Spain\nWhat a match it will be in the last 16 as Japan, the 2011 winners, take on 1995 champions Norway.\nJapan are 11th in the world rankings, Norway 12th and both in great form.\nNorway, after a slow start to the tournament, losing 1-0 to co-hosts New Zealand, turned on the style yesterday by crushing the Philippines 6-0 - the joint largest win of the tournament.\nSaturday, 5 August in Wellington at 09:00 BST is when that one takes place. One to watch out for.\n'Back to the drawing board for Spain'\nJapan 4-0 Spain\nEmma Byrne\nFormer Ireland goalkeeper on ITV1\nWhat a finish from Mina Tanaka.\nThere's not much space there, just an absolutely exquisite finish.\nLittle step over, she doesn't even need to look up, she knows whether the goal is.\nAbsolute pure quality.\nSpain will have to look at these goals because it is poor defending. You can't concede from a throw in like that. They'll have to go back to the drawing board.\nGOAL - Japan 4-0 Spain\nMina Tanaka\nIt's a thrashing!\nThis is one of the goals of the tournament. Mina Tanaka collects the ball close to the right touchline and steps on the accelerator pedal.\nShe runs direct at the defence, produces a stepover to create space for the shot, jinks on to her left foot and curls a stunning finish into the top corner.\nWonderful.\nCLOSE!\nCosta Rica 1-2 Zambia\nA chance for 2-2.\nMaria Coto shoots wide for Costa Rica at the back post, when she should've hit the target. Neither side has won a World Cup match, with Costa Rica unsuccessful in their previous five matches across two tournaments.\nTen minutes plus injury time to rescue this one and deny Zambia their first victory themselves.", "url": "https://www.bbc.com/sport/live/football/66183274"}