{"authors": ["Amy MacBeath", "www.facebook.com"], "date_download": "2025-05-21 04:58:10", "date_modify": "2025-05-21 04:58:10", "date_publish": "2025-04-04 13:02:08", "description": "The 'big ask' Cowie has urged Ross County to achieve", "filename": "sport_articles_cjr744rn815o_1747803490.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c78f/live/ff1a2240-113f-11f0-8874-0979deb646d0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cjr744rn815o_1747803490.html", "title": "The 'big ask' Cowie has urged Ross County to achieve", "title_page": "The 'big ask' Cowie has urged Ross County to achieve - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Don Cowie is confident Ross County can avoid being drawn into a third successive relegation scrap.\nHaving survived via the play-offs in the past two seasons, County are consigned to the bottom six this term following last weekend's defeat by Dundee United.\nBut with a four-point cushion over second-bottom Dundee, and a nine-point gap on St Johnstone, the Staggies boss is looking up rather than over his shoulder as his side prepare to host Aberdeen on Saturday.\n\"We are sitting ninth in the league for a reason,\" said Cowie. \"Our form has been relatively good since the turn of the year and that gives us evidence and real belief going into every game.\n\"Last time we played Aberdeen we came out on top, so we've got something to look back on and what we can achieve. And that's what we'll strive to do.\n\"We have to embrace the challenge of playing a massive club in the country here in Dingwall.\n\"We are disappointed and frustrated on the back of the [United] game. We thought it was a real opportunity to continue the momentum and keep stepping forward. We move on.\"\nCowie has challenged his side to head into the split with back-to-back wins over the Dons and St Mirren.\n\"We've got two games left, six points to play for and that's what we'll strive to try and achieve. Big ask, but there's no reason why we can't do it,\" he added.", "url": "https://www.bbc.com/sport/articles/cjr744rn815o"}