{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:15:43", "date_modify": "2025-05-20 14:15:43", "date_publish": "2023-07-29 16:51:19", "description": "India batter Ajinkya Rahane opts out of Leicestershire deal with Australian Peter Handscomb extending his stay for the One-Day Cup.", "filename": "sport_cricket_66350789_1747750543.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/115E2/production/_130583117_gettyimages-1497931291.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66350789_1747750543.html", "title": "Ajinkya Rahane: India star opts out of Leicestershire deal as Peter Handscomb stays", "title_page": "Ajinkya Rahane: India star opts out of Leicestershire deal as Peter Handscomb stays - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former India captain Ajinkya Rahane will not join Leicestershire for the One-Day Cup, with Australian batter Peter Handscomb replacing him.\nThe 35-year-old was due to join up with the Foxes squad after India's Test tour of the West Indies.\nYet he asked to take a break from cricket in August and September after a packed schedule with the India Premier League and World Test Championship.\nHandscomb has extended his stay with the Foxes through the cup competition.\nDirector of cricket Claude Henderson said, external: \"Firstly, we are fully understanding of Ajinkya's situation. He has experienced a hectic schedule in recent months, both in India and travelling with the national team, and we accept his wishes to recover and spend some time with his family.\n\"He is extremely grateful for our understanding and still hopes to play for Leicestershire one day. Thankfully, we had planned for a situation like this, and we are delighted Peter is staying on with the team.\"\nHandscomb has scored 809 runs for the club this season, including 681 at an average of 45.4 in Division Two of the County Championship.\nThe 32-year-old keeper-batter has scored nearly 4,000 List A runs including 632 runs at 33.26 for his country, including a crucial 117 during Australia's highest ever One-Day International run chase - achieved during the four-wicket win over India at Mohali in March 2019.\nHandscomb has previous experience of 50-over cricket in England, representing Middlesex in 2021, and Yorkshire in 2017, where he returned 504 runs at an average of 63.\nHe will be available for all eight group stage matches, starting with the trip to Surrey on 3 August, as well as any quarter or semi-final fixtures.", "url": "https://www.bbc.com/sport/cricket/66350789"}