{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:05:49", "date_modify": "2025-05-21 04:05:49", "date_publish": "2025-01-09 00:00:00", "description": "Premier League Fulham begin their FA Cup campaign with a dominant victory against second-tier Watford to seal a fourth-round spot.", "filename": "sport_football_live_c1kedezz484t_1747800349.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c1kedezz484t_1747800349.html", "title": "Fulham 4-1 Watford: Premier League side stroll to FA Cup third round win", "title_page": "Fulham 4-1 Watford: Premier League side stroll to FA Cup third round win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Premier League Fulham began their FA Cup campaign with a dominant victory against second-tier Watford to seal a fourth-round spot.\nBarring a short-lived Watford fightback after Rocco Vata netted a stunning equaliser from around 30 yards to cancel out Rodrigo Muniz' 26th-minute opener, the balance always seemed to be in home side's favour.\nFulham had the bulk of the possession and far more promising chances as they mostly kept their Championship opponents penned back inside their own half.\nStriker Raul Jimenez was introduced at half-time and swiftly restored the hosts' lead, firing into the top corner from the penalty spot after Adama Traore was brought down near the edge of the box.\nDefender Joachim Andersen extended their advantage with an excellent finish from a corner, rifling past Jonathan Bond on the volley after his initial effort was blocked.\nFulham were rampant and netted a fourth goal with five minutes left to cap off a confident performance when Timothy Castagne nodded home Martial Godo's cross.\nWatford just could not deal with the constant pressure as they suffered their eighth successive game without a clean sheet as Fulham claimed a deserved place in Sunday's fourth-round draw.\nTheir consolation goal was an outstanding piece of individual quality from 19-year-old Vata, who turned just inside the Fulham half, sprinted forward and sent a powerful drive into the top corner which keeper Steven Benda had little chance of saving.\nThe equaliser was one of only two shots on target mustered by Watford from their five shots overall, a statistic which paled in comparison to Fulham's eight on target from 27 shots.\nFrom the opening minutes, Fulham took control and never looked like losing it.\nMarco Silva's side were energetic, accurate and aggressive in attack. Adama Traore and Alex Iwobi caused problems from the wings, while their build-up play was also impressive.\nAndreas Pereira and Sasa Lukic were well attuned to Watford's attempts to counter-attack, with the hosts constantly preventing them getting out of their own half.\nThe visitors had just two touches in Fulham's box before Vata's equaliser - and that only rose to three by the end.\nSilva, up against the club he left in 2018 for Everton, made seven changes to the side held to a 2-2 draw by Ipswich on Sunday, but it did not affect their performance.\nStriker Jimenez made an impact off the bench, scoring his third penalty in five days after two against Ipswich, and his quick movement and strength on the ball proved hard for Watford's back five to handle.\nFulham could have had more goals, with Pereira cracking the bar with a fine volley as Tom Cleverley's Hornets suffered a fourth defeat in a row in all competitions.", "url": "https://www.bbc.com/sport/football/live/c1kedezz484t"}