{"authors": ["Gareth Griffiths", "www.facebook.com"], "date_download": "2025-05-21 05:21:15", "date_modify": "2025-05-21 05:21:15", "date_publish": "2025-01-31 22:26:40", "description": "Antoine Dupont inspires France as they cruise to a record opening Six Nations victory against woeful Wales in Paris.", "filename": "sport_rugby-union_articles_cpvmdx4z9ego_1747804875.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/af93/live/2a293f20-e026-11ef-a819-277e390a7a08.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cpvmdx4z9ego_1747804875.html", "title": "France 43-0 Wales: Antoine Dupont inspires hosts to Six Nations victory", "title_page": "France 43-0 Wales: Antoine Dupont inspires hosts to Six Nations victory - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Antoine Dupont inspired France to a crushing record opening Six Nations victory against woeful Wales in Paris.\nFrance heaped more misery on Warren Gatland's side in the seven-try success as a hapless Welsh team were completely outclassed.\nHome captain Dupont dazzled on his Six Nations return as he provided the inspiration with three try assists before he was taken off after only 49 minutes.\nIn contrast, his half-back partner Romain Ntamack suffered a disappointing night on his international return when he was shown a 71st minute red card for a dangerous tackle on opposite number Ben Thomas.\nWings Theo Attissogbe and Louis Bielle-Biarrey had both crossed for two tries as the hosts led 28-0 at half-time.\nReplacements Julien Marchand and Emilien Gailleton and number eight Gregory Alldritt scored tries after the break to complete the drubbing.\nWales have now suffered 13 successive Test match defeats in a streak stretching back to October 2023.\nIt was a record tournament defeat for Wales in France, surpassing the 36-3 loss in 1991 in Paris.\nIt was the first time they have not scored a point in a Six Nations match, with the previous occasion they failed to get on the scoreboard against France coming at Wembley in the Five Nations era in 1998 in a 51-0 loss.\nIt was also the first time Wales had not scored a point since 2007 when they lost 31-0 to Australia.\nWales also lost centre Owen Watkin to a serious knee injury, while number eight Aaron Wainwright was also an early departure because of a facial issue.\nGatland suffered defeat in his 150th international in charge of Wales as he started his 13th Six Nations tournament in this role.\nThe New Zealander has now lost 19 of the 25 Test matches he has overseen since returning for a second stint in December 2022.\nWales collected the dreaded Six Nations Wooden Spoon last year as they endured a bleak 2024, losing every Test in a calendar year for the first time since 1937 with 11 international failures.\nGatland had talked about looking to block out the negativity, creating a siege mentality and warning people to \"write Wales off at their peril\".\nBut the talk could not stop another crushing defeat. This was a seventh successive Six Nations loss and a seventh consecutive defeat against France.\nThe Welsh Rugby Union (WRU) had given Gatland a vote of confidence before this tournament, but signalled his position was on the line during during it.\nWales now travel to Nice for a week's training before heading to play Italy in Rome next Saturday, while England will host France on the same day.\nFrance are just on a different level to Wales with scrum-half Dupont the master orchestrator, proving why he is the considered the best player in the world as he tore Wales apart.\nThe 28-year-old missed the 2024 Six Nations to focus on sevens before his home Olympics in Paris where he helped his nation win gold.\nDupont returned in the autumn to inspire France to a successful series including a victory against New Zealand.\nHis brilliance was again on show at the Stade de France with coach Fabien Galthie having the luxury of withdrawing him early with the game won and the rest of the tournament in mind.\nThe one regret will be the Ntamack red card with the Toulouse fly-half making his first international start in 17 months because of injury.\nWales only had four starting survivors from the defeat against South Africa, but welcomed back experienced backs Liam Williams and Josh Adams, while there were first Wales starts for front-row duo Evan Lloyd and Henry Thomas.\nBut the new-look side predictably could not contain their opponents. Dupont almost scored in the opening exchanges, but was denied under the posts by Wales wing Tom Rogers with help from scrum-half Tomos Williams.\nNumber eight Wainwright was forced off in the fourth minute and replaced by Tommy Reffell, who made an instant impression with a turnover.\nWales showed some early bright touches in attack with Morgan, Rogers and Tomos Williams to the fore.\nThe visitors were let down by handling errors, with one from centre Nick Tompkins following a Dupont heavy hit, almost leading to a try for flanker Paul Boudehent.\nDupont's sublime cross kick unlocked the Wales defence as it landed into the hands of Attissogbe with Ramos converting.\nThis fired France into action and a superb offload from Ramos released Bielle-Biarrey to sprint over.\nWales lost centre Watkin to a sickening injury which forced a backline reshuffle with Ben Thomas switching to his more familiar role at centre and a first cap for 21-year-old Ospreys fly-half Dan Edwards.\nHooker Lloyd was given a card for a high shoulder tackle on Bielle-Biarrey with referee Paul Williams initially showing him a yellow card that was not upgraded to a red.\nWith Wales down to 14 men, Dupont beautifully burst through the Welsh defence to provide Attissogbe with his second score.\nOnce more it was the French captain who provided the vision for the bonus-point score with his long pass reaching Bielle-Biarrey as France led 28-0 at half-time.\nWales changed their front-row trio early in the second half, while France made six alterations at the same time.\nForwards Oscar Jegou and Hugo Auradou, who were investigated over rape claims last year before those accusations were dismissed in December by authorities in Argentina, also came off the replacements bench in the second half.\nThe two players, allowed to leave Argentina in September, always denied any wrongdoing and said the sex was consensual. The plaintiff has challenged the court's decision and the next hearing will take place on 10 February.\nTheir inclusion was escalated by injuries to flanker Charles Ollivon - who is out for the rest of the season - and lock Thibaud Flament's muscle issue.\nOne of the other replacements, Marchand, crossed for the fifth try from a driving maul before Gailleton latched onto a cross kick from, Ntamack who was later sent off for his challenge on Thomas.\nThe numbers were evened up when Wales replacement lock Freddie Thomas was shown a yellow card and Alldritt completed the rout to send the home fans home happy and consign Gatland's side to yet another dismal defeat.", "url": "https://www.bbc.com/sport/rugby-union/articles/cpvmdx4z9ego"}