{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:54:28", "date_modify": "2025-05-21 06:54:28", "date_publish": "2025-03-29 17:17:35", "description": "Fourteen-man Munster move back into the play-off positions in the URC as they hold on to beat an error-ridden Connacht 30-24 in Castlebar.", "filename": "sport_rugby-union_articles_cvg1g25dwpzo_1747810468.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/48f8/live/e303b0e0-0cb1-11f0-8c7a-7b0a3ee76a48.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cvg1g25dwpzo_1747810468.html", "title": "United Rugby Championship: Munster beat Connacht in Castlebar to return to play-off spots", "title_page": "United Rugby Championship: Munster beat Connacht in Castlebar to return to play-off spots - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Fourteen-man Munster moved back into the play-off positions in the United Rugby Championship as they held on to beat an error-ridden Connacht 30-24 at a windy Castlebar.\nIreland half-backs Craig Casey and Jack Crowley notched Munster tries with Tom Ahern and Diarmuid Barron also touching down, while Sean Jansen twice crossed for Connacht and Caolin Blade and Josh Ioane were also on target.\nThe game was a 25,000 sell-out at the MacHale Park GAA venue as Connacht played in county Mayo for the first time during the professional era but for the most part, the home side failed to rise to the occasion against a hugely committed Munster.\nConnacht were 15-5 down after 26 minutes when they suddenly seemed to be given a lifeline as Munster centre Alex Nankivell was sent off for a head-high challenge on home captain Cian Prendergast, who had to be replaced.\nDespite being down to 14 men, Munster went on to extend their advantage to 30-12 by the 59th minute and they repelled late Connacht pressure after scores from Hansen and Ioane.\nMunster's win moves them up to fifth place in the table with Connacht now in 12th spot and in danger of losing further ground after the completion of Saturday's remaining fixtures.\nAided by the strong breeze in the first half, Crowley kicked Munster into an early lead before back row Ahern easily barged past Mack Hansen to notch the visitors' first touchdown in the 12th minute after the fly-half's clever kick over the Connacht defence.\nConnacht cut Munster's lead to 8-5 in the 21st minute as Jansen finished off a period of pressure but not for the only time, they immediately conceded as Calvin Nash brushed past Santiago Cordero's weak tackle to set up Casey's try.\nThe home side still looked in a strong position when Nankivell received his red card but the only remaining score in the first period was kicked by man of the match Crowley which left Munster 18-5 up at the interval.\nGiven their second-half wind advantage, Connacht's prospects continued to look promising when Bundee Aki's pass to Finn Treacy set up Blade's touchdown in the 45th minute, with Ioane's conversion cutting the margin to six points.\nBut once again, Connacht put themselves under immediate pressure as Shamus Hurley Langton's handling transgression in a ruck was eventually punished by Crowley's try after Casey's lightning quick pass to his Ireland colleague.\nCrowley added the conversion and as Munster controlled the remainder of the third quarter, Barron's close-range finish increased their advantage to 30-12 after 59 minutes.\nHelped by Tadhg Beirne's 61st-minute yellow card which reduced his side to 13 men, Connacht did rally as Jansen notched his second try before Ioane's score reduced Munster's lead to 30-24 with eight minutes remaining.\nConnacht thought they had notched their fifth try with three minutes left after replacement Dylan Tierney-Martin touched down but the score was ruled out after Aki was adjudged to have illegally taken out Gavin Coombes in a ruck.\nWith Munster down to 13 again after the yellow carding of Niall Scannell, Connacht had one final chance deep in the visitors' 22 but Jean Kleyn poached the line-out to seal the visitors' victory\nConnacht: Hansen; Mullins, Gavin, Bundee Aki, Treacy; Ioane, Blade; Duggan, Heffernan, Bealham; Joyce, Murray; Prendergast (capt), Hurley-Langton, Jansen.\nReplacements: Tierney-Martin, Buckley, Aungier, Murphy, Boyle, Devine, Hanrahan, Cordero.\nMunster: O'Connor; Nash, Farrell, Nankivell, O'Brien; Crowley, Casey; Loughman, Barron, Jager; Wycherley, Beirne (capt); Ahern, Hodnett, Coombes.\nReplacements: N Scannell, Wycherley, Archer, Kleyn, Quinn, Murray, R Scannell, Kendellen.\nReferee: C Evans (WRU)", "url": "https://www.bbc.com/sport/rugby-union/articles/cvg1g25dwpzo"}