{"authors": ["Thomas Duncan", "www.facebook.com"], "date_download": "2025-05-21 05:54:46", "date_modify": "2025-05-21 05:54:46", "date_publish": "2025-04-02 07:12:40", "description": "After a 5-1 thumping by St Mirren, BBC Sport Scotland examines why Kilmarnock have struggled this season after the highs of their 2023-24 campaign.", "filename": "sport_football_articles_cg5q6gevjg4o_1747806886.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6807/live/f6b942a0-0ef8-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cg5q6gevjg4o_1747806886.html", "title": "Kilmarnock: Why have club regressed this season?", "title_page": "Kilmarnock: Why have club regressed this season? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Kilmarnock's 5-1 weekend thumping at the hands of St Mirren has set a few alarm bells ringing in Ayrshire.\nA team who started the season going close to playing in the Conference League after a superb fourth-place finish last term has slipped to 10th in the Scottish Premiership with seven games of the season to play.\nDerek McInnes' side are just one point above the relegation play-off spot and six from the bottom, the same distance to seventh-place St Mirren above them.\nA poor season after a strong one is not an unusual phenomenon in Scottish football outside the big Glasgow two.\nAberdeen, Heart of Midlothian, Dundee United and others in recent years have toiled the campaign after qualifying for Europe as early season qualifiers take their toll.\nBut that in itself is not the sole reason. So what has gone wrong at Rugby Park?\nThere is no simple or clean answer to that straightforward question, but the downturn has been stark.\nKillie had accrued an impressive 51 points by the time the league split last year, but the best they can hope for after 33 games this term is 38 points.\nTheir success last term was built on solid foundations at the back and an excellent home record.\nMcInnes' men kept 14 clean sheets and conceded the fourth fewest goals in the Premiership while winning 10 games at Rugby Park and losing just four against Ross County, Celtic, Rangers and Hearts.\nOnly the best the league had to offer could come away from Ayrshire with points and both Old Firm sides left with nothing in matches last year.\nThose foundations have started to crack this term, though.\nKilmarnock have already conceded nine more goals than they did in the whole of last term, keeping just six clean sheets so far.\nAt home, they have won six of 15 games, while their away form, which has been a struggle in the last three campaigns, has worsened with just two league wins.\nThe 5-1 loss in Paisley encapsulated the difference as a squad that was resilient, physically up for the battle and attuned to the conditions last term turned in a limp and fragile display in the howling rain.\n\"Every goal that was scored was avoidable from a defensive point of view,\" former Kilmarnock striker and Hearts head coach Steven Naismith said on Sportscene.\n\"If you look at the expected goals for, both teams had 1.6. That tells you a lot about Kilmarnock's defensive performance.\n\"Going into the bottom six, this game needs to be a wake up call. They need to make sure the home form is on point until the end of the season.\"\nCentre-back Stuart Findlay's absence is potentially a big reason why Kilmarnock have struggled more defensively this season.\nThe 29-year-old only made his return from injury as a late substitute at the weekend, having been missing since the end of October.\nHe played every minute in all but one league game last season and was a colossus.\nMcInnes will hope his comeback can shore up the backline for the run in.\nGoalkeeper has also been an issue. Kieran O'Hara and Robby McCrorie have shared duties this season, with the former having the worst save percentage in the league, while the latter ranks 10th among keepers to have played at least 10 games.\nIt also could add to the general anxiety in defence, with Dundee and Aberdeen the other notable sides to have used two goalkeepers and struggled to stop conceding.\nChange has been a theme as McInnes has made a lot of rotations to his line up to try to find the right formula, something some fans have grown frustrated with.\nHowever, injuries have hampered the Kilmarnock boss, as has discipline.\nSeven red cards is the most of any side in the league and a series of them in the early part of the season cost them points and momentum.\nSo where does all that leave the manager? The buck always seems to stop in the dugout and grumbling about McInnes is growing.\nCould he have been more consistent with selection? Did the squad need more fresh faces after last season?\nThe former Aberdeen and St Johnstone boss apologised to supporters for the display in Paisley but is confident they can end the season strongly and avoid relegation.\n\"I think we will,\" he said. \"I think we're better than some teams in the league. I feel we've got bigger and better performances in us.\"\nWith a lot of the Kilmarnock squads' contracts expiring, it feels like there will be a reset come the end of the season.\nWith McInnes' vast experience and track record in Scottish football, you could envisage another turnaround.\nHowever, with no wins in five and fine margins in the league, everyone at Kilmarnock is hoping, if that is the case, it comes sooner rather than later.", "url": "https://www.bbc.com/sport/football/articles/cg5q6gevjg4o"}