{"authors": ["Emma Middleton", "www.facebook.com"], "date_download": "2025-05-21 03:43:43", "date_modify": "2025-05-21 03:43:43", "date_publish": "2025-02-04 11:57:41", "description": "BBC Sport takes you through how the Premier League Darts works, the prize money on offer, and whether Luke Littler will be playing.", "filename": "sport_darts_articles_cy8xgrv0093o_1747799023.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2f5d/live/5dc73ec0-e24e-11ef-98f8-8332cc0694b3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_darts_articles_cy8xgrv0093o_1747799023.html", "title": "Premier League Darts 2025: Schedule, results, prize money, players", "title_page": "Premier League Darts 2025: Schedule, results, prize money, players - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Luke Littler is back to defend his Premier League Darts title, now with a PDC World Championship win under his belt.\nThe eight-player tournament started on Thursday, 6 February, with weekly fixtures building towards the final in London on Thursday, 29 May.\nYou can follow live text commentary from each match night on the BBC Sport website.\nEvery Thursday, the eight players go head-to-head in a straight knockout tournament. So, each player will be entered at the quarter-final stage, before moving to the semi-finals and then a final.\nThese matches are all played over the best of 11 legs (or games of darts).\nPlayers take home points from each of these rounds. The winner of the night gets five points, the runner-up three points, and each semi-finalist wins two points.\nAll eight players are re-entered into the tournament for the next round on the following Thursday.\nThe players meet each other once at the quarter-final stage from weeks one to seven, and then again in weeks nine to 15. The matches in weeks eight and 16 are played based on position in the league at that point.\nThe four players at the top of the table by the end of night 16 qualify for the final play-offs, which take place on Thursday, 29 May.\nLuke Littler, Luke Humphries and Gerwyn Price are through this year, with one place still up for grabs for either Nathan Aspinall or Michael van Gerwen,\nThe semi-finals of the play-offs are played over 19 legs, while the winner is crowned in a final match played across the best of 21 legs.\nFormer world champions Peter Wright and Michael Smith are not included in the line-up despite featuring in the 2024 league.\nDave Chisnall, world number six when the line-up was announced, is the highest-ranked player in the PDC Order of Merit not to feature.\nWorld Grand Prix champion Mike de Decker also misses out and is the first player to do so despite winning a major tournament.", "url": "https://www.bbc.com/sport/darts/articles/cy8xgrv0093o"}