{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:54:10", "date_modify": "2025-05-21 07:54:10", "date_publish": "2025-05-20 00:00:00", "description": "Recap and watch Tuesday's Europa League final build-up as Ruben Amorim and Ange Postecoglou hold news conferences before Wednesday's showpiece event.", "filename": "sport_football_live_ckgq20xj208t_1747814050.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/54c0/live/633c2090-35ab-11f0-96c3-cf669419a2b0.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_ckgq20xj208t_1747814050.html", "title": "Recap Europa League final news conferences, team news and build-up", "title_page": "Recap Europa League final news conferences, team news and build-up - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Moving on...to Bilbao\nTottenham v Man Utd (Wed, 20:00 BST)\nIt's been moving day in Bilbao and across the intervening countries between the UK down to the port town in the Basque region of northern Spain.\nUp to 80,000 Manchester United and Tottenham supporters are expected to descend on the venue of Wednesday's Europa League final between the two Premier League sides.\nWe have brought you a flavour today of that mass movement of people: by plane, boat, train or automobile - someone even swam the English Channel to kick off their marathon journey.\nScroll down these pages to read the supporters' stories, and the top lines from some blockbuster news conferences from both clubs.\nVisit the 'watch & listen' tab at the top of this page to watch those exchanges with the media, including Spurs boss Ange Postecoglou's \"spellbinding\" display.\nYou can also watch Tottenham's 30-minute training session.\nEnjoy.\n'He is' - Fernandes on rumours Amorim is not under pressure for his job\nTottenham v Man Utd (Wed, 20:00 BST)\nIt was put to Manchester United manager Ruben Amorim that he was not under the same kind of pressure for his job as Tottenham counterpart Ange Postecoglou.\nHis captain, Bruno Fernandes, kindly chipped in, saying \"he is\" - ie. Amorim should be worried about his future at Old Trafford.\nTo which the Red Devils head coach explained that Fernandes \"wants my job - he will be a good coach, he just needs to learn to deal with people.\"\nClick play to listen to the full, playful exchange.\nBruno's Bantz\nTottenham v Man Utd (Wed, 20:00 BST)\nSimon Stone\nBBC Sport chief football news reporter in Bilbao\nThe Manchester United camp is a relaxed place judging by that press conference.\nThere was Ruben Amorim laughing when Harry Maguire was asked about his dribbling skills, and the United defender saying his manager has him practicing in training.\nThen, when Amorim was in the process of being asked why he doesn't seem to be under the same kind of pressure at United as Ange Postecoglou is at Tottenham, skipper Bruno Fernandes stepped in.\n\"He is,\" said the United skipper, bringing more laughs from Amorim.\nIt was all very jovial and all very light hearted.\nUnited fans must hope the pressure remains off come kick-off tomorrow.\n'I am always happy to help' - Maguire on playing as a stand-in striker\nTottenham v Man Utd (Wed, 20:00 BST)\nManchester United\nManchester United defender Harry Maguire on supplying an assist in the first leg of the semi-final at Athletic Bilbao and playing as a makeshift striker in the quarter-final win over Lyon: \"The manager has me dribbling every day in training up and down the wing. No, I found myself on the wing against Bilbao and managed to put a good cross in and Casa [Casemiro] scored the goal.\n\"In the Europa League game before that [the second leg win over Lyon in the quarter-finals] the manager asked me to go up front in the later minutes of the game, but hopefully tomorrow night I will not be going up front. I don't want to be going up front and chasing the game, I want to be defending a lead from my position in defence. I am always happy to help, but also more than happy to play in my favoured position.\"\n'People see what we are trying to do'\nTottenham v Man Utd (Wed, 20:00 BST)\nManchester United\nManchester United manager Ruben Amorim was asked whether he is surprised or grateful that he doesn't seem to be under the same pressure as Ange Postecoglou: \"I know that at this kind of club, also in Tottenham but especially at Manchester United it's strange because you have some coaches here that loses some games and they are sacked - it's hard to explain.\n\"I think people see what we are trying to do. I think people see that sometimes I am thinking more in the club than in myself. People understand, especially the board understand that we have a lot of issues that in the context is really hard. I don't know how to explain. I will try to prove myself to the fans, board but I don't have an explanation for you.\n\"We will reach a moment that we have to win no matter what. I don't have an explanation for that.\"\n'Every player wants to play for this club - that will never change'\nTottenham v Man Utd (Wed, 20:00 BST)\nManchester United\nManchester United captain Bruno Fernandes was asked how big he believes the Europa League final is: \"Every game that you have the chance to win a trophy is very big, but apart from that every game at this club is massive. As the players we just think about what we have ahead of us, and what we have ahead of us is the chance to get our hands on a trophy.\"\nOn what winning the final would mean to the club: \"It won't affect what the past has done to us, but what it can affect is the future. Winning a competition gives you a lot of things. In this case you get a place in the Champions League and a lot of revenue for the club.\n\"It gets more players wanting to come to the club, but at this club it doesn't change that much in this aspect as every player wants to play for this club. That's a thing that will never change because the name of this club speaks for itself.\"\nOn whether previous defeats against Tottenham this season count for anything: \"The main thing we have ahead of us is a massive final against a team that we know very well, but in a competition that is very different from the Premier League, so it's going to be a completely different game.\"\n'We have bigger things to deal with to put this club back to the top'\nTottenham v Man Utd (Wed, 20:00 BST)\nManchester United\nManchester United manager Ruben Amorim was asked about his previous comments that 'winning would change the summer but wouldn't necessarily fix the problems,' he said: \"I think it's hard to speak about it in this moment because we need to be excited and confident but we already know the problems. There are a lot of things we need to change in our club. The way we do everything during the week in Carrington, the recruitment, the academy I think we need to improve.\n\"It's hard to point one thing. That will not be solved by winning a cup. I will say it again, for me we have bigger things to deal with to put this club back to the top.\n\"Tomorrow, it will be important for us and our fans that feeling of winning can help us have the strength to do every job we have to do. We have a lot to do in our club, not just winning tomorrow but tomorrow will be massive for us and our fans.\"\n'You can be an amazing player and the following week the villain'\nTottenham v Man Utd (Wed, 20:00 BST)\nManchester United\nManchester United defender Harry Maguire was asked how he survived a 'toxic atmosphere' at the club to win his place back in the team: \"It's amazing to be back in the team and playing regularly. This season I have played a lot of football. I don't take too much notice of the plaudits from the media and things like that. When you play for this club you can be an amazing player and the following week you can be the villain. That's part and parcel of playing for this club.\n\"I don't read too much into it. I try and stay as level as I can. Every game I go into it and try my best, and that's all you can do.\"\n'I just focus on the way we play'\nTottenham v Man Utd (Wed, 20:00 BST)\nManchester United\nManchester United manager Ruben Amorim on their system and shape in the FA Cup final last year: \"Our system is a normal system that can change the characteristics. It's not about playing with or without a striker.\n\"It doesn't matter what happened in the last final because it was a different team, competition, context - everything was different.\n\"I just focus on the way we play, Tottenham play, what we can do to be better than the last two games, that was my focus, not the last time we won a cup.\"\n'I am sure next season we will improve an awful amount'\nTottenham v Man Utd (Wed, 20:00 BST)\nManchester United\nManchester United defender Harry Maguire on the side's inconsistent results: \"Of course it is a frustration. When you play for this club you want to win every football match and this season we have been far too inconsistent.\n\"We haven't won enough, in the Premier League it's not been good enough. Europa League has been different, we have performed at a high level and we have proven that we can beat anybody.\n\"I am sure next season we will improve an awful amount, after a full pre-season [with manager Ruben Amorim]. As players we are all looking forward to that but we have got a big game tomorrow night, and that's first and foremost.\n\"It's a special night, a special occasion - we have prepared well the last few days and it's one that we are looking forward to.\"\n'The best way to prepare something is to compete'\nTottenham v Man Utd (Wed, 20:00 BST)\nManchester United\nManchester United manager Ruben Amorim on what advantage they might get from their own approach to the build-up: \"The advantage I don't know. I don't know the context of Tottenham. What I know is the last game against Bilbao, we had that game and then we rested some players because we were afraid of some injuries and then we had a full week to prepare for the game and I felt with five days to the final, I felt that the best thing to prepare for the final was to give time to the players to play so I cannot respond from the side of Tottenham.\n\"For me it was really clear, we need to compete, the best way to prepare something is to compete. I had that feeling and I pushed the players against West Ham in the end of the game and I felt that against Chelsea we showed something and to prove that we when we are focused, when we play our game we can control any game in a any place so it was a good day to compete and prepare the final, that was the idea.\"\n'A big game, a big final and a big opportunity'\nTottenham v Man Utd (Wed, 20:00 BST)\nManchester United\nManchester United captain Bruno Fernandes on the opportunity facing the squad: \"We want to be at the top of everything. Not only the Europa League, not only the Premier League, we want to be at the top of the FA Cup, the Carabao Cup. Everything we are involved in this club needs to be fighting for.\n\"Obviously we know it is not always possible to be in the final or winning trophies, but our aim and our goal has to always be to be in until the end of the competitions fighting for the possibility of winning trophies and that's what we want.\n\"Tomorrow we have a big chance in a competition where our aim at the start of the season was being in Bilbao for the final - everything we have to focus on is that we have a big game, a big final and a big opportunity.\"\n'Our club can have revenues without Champions League'\nTottenham v Man Utd (Wed, 20:00 BST)\nManchester United\nManchester United manager Ruben Amorim was asked if he and the team are playing for more than themselves, given cutbacks at the club: \"I think it's not the case. We are doing things that we need to do but for example I came from the club that in order to survive and to maintain the players you need to be in the Champions League. This is not the case.\n\"Our club can have revenues without Champions League. It's a big, massive club with fans around the world. It is a big brand. We just need to be focused and do things in the right way so I don't see it like that. I'm always playing for more than myself. I'm coaching for my players, staff and especially the fans.\"\n'The main thing is that our club brings the trophy back to Manchester'\nTottenham v Man Utd (Wed, 20:00 BST)\nManchester United\nBruno Fernandes on whether he dreams of making history, following the five Manchester United captains to have lifted a European trophy: \"The Europa League is everything that is in our minds because we play the final tomorrow. We can be successful in the Europa League.\n\"Obviously, we know that in the Premier League we haven't been as good as we want, and all the other cups the same because our aim is always to get to the end of the competitions and win the trophies.\n\"I am not here thinking I am going to be one of the captains lifting the European trophy. Obviously, it's a very good feeling, I'm very proud of it but at the same time for me the main thing is that our club gets to bring the trophy back to Manchester.\"\n'Winning a European title is really important'\nTottenham v Man Utd (Wed, 20:00 BST)\nManchester United\nManchester United manager Ruben Amorim was asked whether this game can 'mask' what's happened over the last few months or 'give them a new future': \"A new future for me I think is not the case but it's going to help us to finish the season and many people will look at our team in a different way because winning a European title is really important.\n\"But, again, nothing is going to change our season, everybody knows winning a European title can help us have the feeling that can help us to build a future.\"\n'Yoro, Zirkzee and Dalot can help us win the game'\nTottenham v Man Utd (Wed, 20:00 BST)\nManchester United\nManchester United manager Ruben Amorim on team news: \"They [Yoro, Zirkzee and Dalot] recovered quite well, they pushed. Of course we respect the feeling of the player but we push a little bit because they want to be part of the team and that is a very good sign and it's very good for us.\n\"Of course they are limited in the minutes for the game but they can help us win the game.\"", "url": "https://www.bbc.com/sport/football/live/ckgq20xj208t"}