{"authors": ["Peter Scrivener", "www.facebook.com"], "date_download": "2025-05-21 05:19:31", "date_modify": "2025-05-21 05:19:31", "date_publish": "2025-04-03 21:21:17", "description": "England's world number one Lottie Woad shares the lead heading into the final round of the Augusta National Women's Amateur as she looks to become the first to defend the title.", "filename": "sport_golf_articles_c0r5glyrwplo_1747804771.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ca60/live/0a39f310-10cf-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_golf_articles_c0r5glyrwplo_1747804771.html", "title": "Augusta National Women's Amateur: Lottie Woad shares lead heading to Augusta finale", "title_page": "Augusta National Women's Amateur: Lottie Woad shares lead heading to Augusta finale - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England's defending champion Lottie Woad holds a share of the lead going into the final round of the Augusta National Women's Amateur in Georgia.\nThe 21-year-old, who is the world number one amateur, is trying to become the first player to win successive titles in the sixth staging of the prestigious event, which has the third round at Augusta National, home of the Masters.\n\"I can definitely use last year,\" said Woad who went into the final round 12 months ago two shots ahead of the field.\n\"I had the lead and then lost it. If that happens again, then I'd know that I've come back from there before. So they're positive memories.\"\nWoad had three birdies and a bogey in a solid two-under-par 70 in the second round at the Champions Retreat course.\nThat improved her overall score to nine under par, and left her joint top with American Kiara Romero.\nOvernight leader Megha Ganne is in a three-way tie for second place on eight under after she shot a 73 to follow a 63 in the opening round.", "url": "https://www.bbc.com/sport/golf/articles/c0r5glyrwplo"}