{"authors": ["Stephan Shemilt", "www.facebook.com"], "date_download": "2025-05-20 13:51:34", "date_modify": "2025-05-20 13:51:34", "date_publish": "2023-07-31 17:36:49", "description": "Stuart Broad ends his glittering career by bowling England to another dramatic victory in the fifth Test against Australia to leave a memorable Ashes series level at 2-2.", "filename": "sport_cricket_66362287_1747749094.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/CFCF/production/_130599135_broad.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66362287_1747749094.html", "title": "The Ashes 2023: Stuart Broad bowls England to win over Australia", "title_page": "The Ashes 2023: Stuart Broad bowls England to win over Australia - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Stuart Broad ended his glittering career by bowling England to another dramatic victory in the fifth Test against Australia to leave a memorable Ashes series level at 2-2.\nBroad, in his final Test before retiring, took the last two wickets as England bowled out the tourists for 334 to win by 49 runs in front of a raucous crowd at The Oval.\nChris Woakes was immense in taking 4-50 while off-spinner Moeen Ali, battling a groin injury in the last Test of his career, picked up a crucial 3-76.\nResuming on 135-0 in pursuit of 384, Australia lost David Warner and Usman Khawaja to Woakes' morning burst, while Mark Wood accounted for Marnus Labuschagne.\nThe visitors were put back on course for one of their greatest run-chases by Steve Smith, who made 54, and 43 from Travis Head.\nBut after a rain delay of more than two hours, Woakes and Moeen were the architects of an Australian collapse of five wickets for 30 runs.\nAlex Carey and Todd Murphy raised tension with a ninth-wicket stand of 35 only for Broad to produce a last moment of theatre.\nLooking to change England's luck, Broad switched the bails at the non-striker's end and, next ball, bowled a beauty to have Murphy caught by wicketkeeper Jonny Bairstow.\nBroad then had Carey caught behind to seal victory and, amid high emotion at a ground renowned for goodbyes, left the field arm in arm with Moeen.\nEngland's win replicates the 2-2 draw of four years ago and preserves an unbeaten home record in Ashes series that stretches back to 2001.\nThough Australia retain the urn, which they will defend down under in 2025-26, their wait for a win in this country will be up to 26 years when they next visit in 2027.\nThis was a magnificent finale to a series for the ages, another tense affair in front of a passionate crowd with the added drama of the rain delay thrown in.\nBefore this summer, 25 of the 340 previous Ashes Tests had been won by three wickets or fewer, or 50 runs or fewer. This series has had four such victories.\nThe action on Monday was never less than compelling. Led by Woakes, England were excellent with the ball, only for old foe Smith to threaten another act of defiance.\nIf was after the rain delay that the match swung decisively in England's direction, with four wickets falling in as many overs. The scalp of Smith in particular sparked wild celebrations on the field and in the stands, a mixture of delight and relief.\nIn the end, a draw feels like a fair result at end of a wonderful battle between cricket's oldest rivals. Australia took advantage of England's mistakes to lead 2-0 before the hosts roared back. Ben Stokes' side probably would have won 3-2 had rain not ruined the end of the fourth Test.\nIt has been a series of countless memorable moments: Zak Crawley driving the first ball for four, Stokes' declaration on the first day of the series, the controversy around Bairstow being stumped at Lord's, the nerve-shredding conclusion to the third Test and Crawley's hundred at Old Trafford to name a few.\nBut the enduring image was of Broad, an Ashes warrior, first conjuring the wicket of Murphy with one of his old tricks, then sparking joyous scenes with his final delivery in Test cricket.\nNeither Woakes nor Moeen were in England's plans at the start of the summer, but have played vital roles in levelling the series.\nMoeen, out of retirement, has overcome a finger injury and the groin problem to bat at number three and lead the spin attack. Woakes, balancing the side because of Stokes' inability to bowl, ends with 19 wickets from only three matches and was named player of the series.\nEngland were flat on Sunday, yet on Monday had use of a ball that had been switched only 11 deliveries before play was ended by rain on the fourth day. With it, Woakes was a constant threat, finding devilish seam movement to spearhead the attack.\nWarner poked behind for 60 and Khawaja was pinned on the crease to be lbw for 72. After Labuschagne edged Wood to the safe hands of Crawley at second slip, England had taken 3-29, only to be stalled by Smith and Head.\nWoakes and Moeen were rejuvenated after the rain break. Moeen drew Head into an edge to slip, before Mitchell Marsh inside-edged on to his pad and was athletically caught by Bairstow.\nIn between, Woakes struck the all-important blow to have Smith edge to second slip, before Mitchell Starc fell in the same manner. When Australia captain Pat Cummins miscued Moeen into his pad and was caught by Stokes, the stage was set for Broad.\nAs England opted against taking the second new ball, Broad regularly beat the bat in the frustrating stand between Carey and Murphy, which evoked memories of Cummins and Nathan Lyon guiding Australia to victory in the first Test.\nJust as England might have contemplated a change, Broad accounted for Murphy, resulting in a release of emotion from the crowd that had spotted the changing of the bails. When he had finished celebrating, Broad patted the bails in acknowledgement.\nIt seemed like he might miss out on the fairytale ending when Crawley dropped an edge off Carey, but Broad would not be denied a final moment of glory as an England cricketer.\nBBC cricket correspondent Jonathan Agnew on Test Match Special: \"I really don't think Stuart Broad could have had a better script than this, it's a dream finish.\"\nFormer England captain Michael Vaughan on TMS: \"Fairytales can happen. An incredible crowd, a brilliant series. This has been absolutely incredible, it's had everything.\n\"Broad bowled beautifully today, I don't know why he's quitting. He played magnificently. Australia controlled the game at times but this England side have got this knack of fighting back.\"\nFormer England captain Sir Alastair Cook on TMS: \"It had to be Stuart Broad, it just had to be. That's why chasing such a big total is so hard. The crowd was right behind England, you just felt like they had that edge.\"", "url": "https://www.bbc.com/sport/cricket/66362287"}