{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:43:21", "date_modify": "2025-05-21 06:43:21", "date_publish": "2025-01-04 12:18:12", "description": "The All-Ireland club SFC semi-final between Dr Crokes and Errigal Ciaran is postponed until next week.", "filename": "sport_articles_cy09zzpl7zpo_1747809801.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/955d/live/c9411c00-ca95-11ef-8aa7-690308ce7831.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cy09zzpl7zpo_1747809801.html", "title": "Dr Crokes v Errigal Ciaran All-Ireland semi-final postponed", "title_page": "Dr Crokes v Errigal Ciaran All-Ireland semi-final postponed - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The All-Ireland club SFC semi-final between Dr Crokes and Errigal Ciaran has been postponed.\nThe game was set to take place at 15:30 GMT on Sunday at O'Moore Park in Portlaoise.\nA pitch inspection took place on Saturday afternoon and the decision was taken to postpone the game.\nThe final four encounter which pits the Ulster champions against Kerry side Dr Crokes has been rescheduled for Saturday 11 January at the same venue, with throw-in time to be confirmed on Monday.\nLater in the day a decision was taken to postpone the other scheduled All-Ireland semi-final between Cuala and Coolera/Strandhill.\nThe meeting between the Leinster and Connacht champions was to have taken place at Breffni Park in Cavan, which will now host the last-four tie on Saturday 11 January.\nThe GAA had said it would monitor the condition of playing surfaces over the weekend after weather warnings for snow and ice were issued on Friday.\nMet Eireann issued an orange warning for six counties, with significant snowfall expected over the weekend.\nFollowing an inspection on Saturday morning, Derry club Ballinderry's All-Ireland Intermediate semi-final against Kerry's Austin Stacks went ahead at Dublin's Parnell Park, with the Ulster side running out 0-11 to 0-7 victors.", "url": "https://www.bbc.com/sport/articles/cy09zzpl7zpo"}