{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-05-20 14:06:33", "date_modify": "2025-05-20 14:06:33", "date_publish": "2023-07-30 18:37:53", "description": "Brighton forward Evan Ferguson tells the BBC how he knew Brighton was the right club to join when he first went on trial at the club.", "filename": "sport_football_66356478_1747749993.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5E22/production/_130589042_gettyimages-1577474075.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66356478_1747749993.html", "title": "Brighton 'pathway' convinced me to join over rivals, says Evan Ferguson", "title_page": "Brighton 'pathway' convinced me to join over rivals, says Evan Ferguson - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "While some of his old school friends back home in Bettystown are trying to work out what to do next now their studies have come to an end, for Evan Ferguson, the pathway is clear.\nAt 18, the Brighton striker already has a contract that runs to 2028 and a secure place in Roberto De Zerbi's squad as the Seagulls look to match last season's stellar achievements.\nFerguson's rise is as startling as his club's.\nA campaign that started with an EFL Cup appearance at Forest Green and featured three EFL Trophy appearances for Brighton's Under-21 side ended with 10 goals for the senior team, a Republic of Ireland debut and predictions he could one day be as good as England captain Harry Kane.\nNot that such plaudits bother Ferguson too much - he is as laid back as they come.\n\"When you are in it and you have that many games to play and that many things to concentrate on, you get lost in what you are doing,\" he said.\n\"I wouldn't say I was nervous. When you are training, you are always wanting to play, so when you get the opportunity, you have to be ready and fortunately I did well.\"\nIt is testament to Ferguson's youth that the story of Brighton's ascent from the bottom of League Two to European qualification for the first time in their history largely goes over his head.\n\"I was always coming over [to England] for trials,\" said Ferguson, who started out at the St Kevin's boys club in Dublin before moving on to League of Ireland side Bohemians. \"I came to Brighton and thought 'that's the club for me'.\n\"It was the people and the fact they showed a pathway - it made me feel as though it was the right club.\n\"I know some of the players have gone through the different leagues and stuff like that but I have only known Brighton being in the Premier League.\"", "url": "https://www.bbc.com/sport/football/66356478"}