{"authors": ["Andrew Benson", "www.facebook.com"], "date_download": "2025-05-20 14:07:54", "date_modify": "2025-05-20 14:07:54", "date_publish": "2023-07-30 14:33:32", "description": "Max Verstappen was in imperious form as he came from sixth on the grid to win the Belgian Grand Prix.", "filename": "sport_formula1_66354506_1747750074.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4BBC/production/_130588391_gettyimages-1565333938.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_formula1_66354506_1747750074.html", "title": "Belgian Grand Prix: Max Verstappen extends title lead with eighth straight victory", "title_page": "Belgian Grand Prix: Max Verstappen extends title lead with eighth straight victory - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Max Verstappen was in imperious form as he came from sixth on the grid to win the Belgian Grand Prix.\nThe Red Bull driver's eighth consecutive victory in the final race before the summer break extended his championship lead to 125 points.\nVerstappen led Sergio Perez home to a Red Bull one-two but was in another league from his team-mate.\nFerrari's Charles Leclerc took third ahead of Mercedes' Lewis Hamilton and Aston Martin's Fernando Alonso.\n\"It's a new spot, that's for sure - [winning from] P6. I knew that we had a great car. It was just about surviving Turn One,\" said Verstappen.\n\"From there onwards I made the the right overtakes. I just got a little bit stuck in the beginning in a DRS Zone and once that cleared I could just do my own thing - really enjoyable.\"\nVerstappen drove cautiously in the early laps as he picked his way up from his unusually low grid position, caused by a five-place grid penalty for using too many gearbox parts after he had qualified on pole by 0.8 seconds.\nThe world champion was up to fourth on the first lap but did not pass Hamilton until lap six and Leclerc until lap nine, both times using the DRS overtaking aid to overtake into the Les Combes chicane at the end of the long Kemmel straight.\nPerez, who had passed Leclerc for the lead up the same straight on the first lap, hung on in front until his pit stop on lap 13.\nVerstappen pitted the next time around, and only then began to show something like his true potential.\nEmerging two seconds back from Perez, Verstappen was a second back after his first lap out of the pits, on his tail next time around, and ahead halfway along the Kemmel straight on lap 17.\nWhat followed was a crushing demonstration of superiority over even a driver in the same car.\nThe Dutchman was 1.6secs ahead by the end of that lap, driving it two seconds faster than Perez.\nHe took it relatively cautiously on the next lap, extending his lead by 'only' 0.7secs, but then was 1.4secs faster the next time around.\nThe only jeopardy remaining in the race were some testy messages from his race engineer Gianpiero Lambiase.\nThe Briton asked Verstappen to \"use his head\" before his first pit stop, only for the driver to ask whether Perez had been given the same command - effectively to manage his pace. Lambiase responded with \"I suggest you follow my instructions and trust me\".\nA mid-race shower of rain was enough to add some tension for the drivers, but not to make them switch to treaded intermediate tyres. It did lead to a scary moment for Verstappen, though, when he had a wobble at high speed in the daunting Eau Rouge swerves, but managed to hold on to the car.\nAfter his second stop, Lambiase scolded Verstappen that he had \"used a lot of the tyres on the out lap\", driving in a way which the engineer did not deem sensible.\nVerstappen responded by setting fastest lap, extending his advantage by 2.3secs in one circuit.\nLambiase warned him: \"This tyre had reasonable degradation in the first stint; I'd advise you to use your head a bit more.\"\nVerstappen responded: \"I could also push on and do another stop - a bit of pit stop practice.\"\nIt was his 10th win in 12 races and he continues to look as though he could win every race remaining this season, with no discernible opposition on the horizon.", "url": "https://www.bbc.com/sport/formula1/66354506"}