{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:24:57", "date_modify": "2025-05-20 13:24:57", "date_publish": "2023-08-02 07:10:21", "description": "All four of the year's first-time major winners and several home hopefuls are among the names in a stacked field at the 2023 Women's Scottish Open.", "filename": "sport_golf_66355456_1747747497.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/11FBC/production/_130606637_gettyimages-1500665195.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_golf_66355456_1747747497.html", "title": "Women's Scottish Open 2023: Celine Boutier and Gemma Dryburgh among hopefuls", "title_page": "Women's Scottish Open 2023: Celine Boutier and Gemma Dryburgh among hopefuls - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Gemma Dryburgh has already ticked two career goals off her list in the past few days. Now she aims to shine on home soil at the Women's Scottish Open and close in on her long-held Solheim Cup dream.\nThe Scot headed to Ayrshire with a spring in her step after her best finish in a major, eighth place at the Evian Championship in France on Sunday.\nIt continued Dryburgh's remarkable ascent - her first LPGA Tour triumph at the Japan Classic last November \"changed everything\" for the 30-year-old, earning a two-year exemption on the circuit and entry to the majors.\nIt is not only her results that are \"trending in the right direction\". Twelve months ago Dryburgh was 183rd in the world rankings. She is now 50th, and harbouring serious hopes of gatecrashing Team Europe for a Solheim Cup debut in September.\nEuropean captain Suzann Pettersen, who has already said the Scot is \"very much on my shortlist\", will be among the spectators as Dryburgh bids for glory and qualification points in a line-up laden with serious quality at the testing Dundonald Links.\n\"It feels good to be back, I look forward to this event all year - it's like a major for me, coming home,\" said Dryburgh, who heads a seven-strong Scottish playing contingent.\n\"It was a goal of mine this year to get a top 10 in a major, so I've ticked that one off.\n\"It's an amazing feeling. It was a big goal for my career to make the top 50, so I'll need to set some new ones. I thought I'd maybe just be outside, so to get that 50th position was pretty special.\n\"I've been watching Solheim since I can remember and it's always been a dream of mine to play for the European team. It gives me goosebumps thinking about it.\n\"I just need to focus on my game and hopefully my golf can do the talking.\"\nAsked about Dryburgh's form, Pettersen told BBC Scotland: \"Hard work brings good results and good results brings confidence. It's great to see how she has matured up to the next level.\n\"There is still a lot of golf to be played before we announce the team in three weeks time. If she keeps playing the way she is you can't rule her out of qualifying outright. She is very much on my shortlist for sure.\"\nGolf's newest major champion Celine Boutier has barely had time to allow her achievement to sink in before travelling to Scotland.\nBoutier arrived fresh from an emphatic home triumph, winning by six shots at the Evian Championship.\nThe 29-year-old continued the trend this season of first-time major winners and all four champions are teeing it up at Dundonald. Life is certainly sweet for Boutier. Well, apart from her clubs still being in transit when she spoke on Tuesday.\n\"It was an incredible week and to share it with my family and fans was fantastic,\" Boutier said of her major triumph. \"The past couple of days I've been really overwhelmed with the amount of support. It was a dream come true.\n\"Unfortunately my clubs have not arrived yet, but hopefully they will be on the next flight tonight.\"\nNow in its seventh year of being co-sanctioned by the LPGA and LET Tours, the Women's Scottish Open boasts a hefty £1.5m prize fund.\nIt has attracted six of the world's top 10 this week. Joining Boutier are fellow 2023 major winners Lilia Vu, Ruoning Yin and Allisen Corpuz, while Minjee Lee and Atthaya Thitikul are both runners-up at the Women's Scottish Open in recent years.\nJapan's Ayaka Furue is back to defend the title she won with a flourish 12 months ago, closing with a course-record 62.\nFurue is one of four past champions in a line-up featuring 18 major winners, 45 LPGA champions and 59 LET winners.\nThe tournament is a rare opportunity for tour players to compete on a links course and provides a compelling precursor to the final major of the season, the Women's Open.\nThat will be played on the heathland layout of Walton Heath in Surrey next week, but warm-ups do not come much better than the unique challenges of links golf and the Scottish elements. Just ask Boutier.\n\"Even though Walton Heath is not a traditional links I still feel it's good to be here to get used to the wind and the weather,\" Boutier said. \"It's a great week to prepare for the Women's Open.\"", "url": "https://www.bbc.com/sport/golf/66355456"}