{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:00:17", "date_modify": "2025-05-20 13:00:17", "date_publish": "2023-08-01 12:07:30", "description": "Bristol City will not be able to go on a spending spree even if they sell midfielder Alex Scott, says manager Nigel Pearson.", "filename": "sport_football_66373086_1747746017.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9AC4/production/_130602693_shutterstock_editorial_14013438gn.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66373086_1747746017.html", "title": "Alex Scott: Bristol City will not sell midfielder for less than £25m - Nigel Pearson", "title_page": "Alex Scott: Bristol City will not sell midfielder for less than £25m - Nigel Pearson - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Bristol City will not be able to go on a spending spree even if they sell midfielder Alex Scott for his £25m price tag, says manager Nigel Pearson.\nScott, 19, has been touted for a move to a Premier League side.\nA number of bids have been made for the England Under-20 player but the Robins want to keep him.\n\"It won't make any difference whether we do a deal for Alex or not, because our wage bill will be topped out,\" Pearson told BBC Radio Bristol.\n\"Even if we get £25m-plus for Alex Scott we won't be able to go out on a spending spree. It's in our interest to keep him in and that's what we will try to do.\n\"There have been bids in for him, but we'll try and keep him.\n\"But we're always on the lookout to try and add to the squad and make us better than we already are and I think that's something that will be constant for us.\"\nGuernsey-born Scott joined Bristol City's academy in 2019 from hometown club Guernsey FC and signed a four-year deal with the club on his 18th birthday.\nHe played 42 out of 46 league games last season and was voted the Championship's young player of the year at the end of 2022-23.\n\"I don't know how many bids there have been, as far as I'm concerned we've made our stance quite clear as a football club and that is for somebody to gain the opportunity to talk to him we're talking about £25m,\" Pearson said.\n\"There have been reports of bids for £21m and stuff like that in various news outlets, I've even read with interest some journalists saying that maybe we're setting our price too high for him.\n\"But what they fail to understand is we don't want to sell him, that's why we're pricing him the way that we are, and actually having seen him since the start of pre-season we should be asking £30m for him, never mind £25m.\n\"The bottom line is we as a club have said 'he's going to cost £25m as a starting point' and if something happens where he goes for less than that then I won't be very happy, I can tell you that now.\n\"As far as I'm concerned we've made as statement as a club and we've got ourselves into a decent position financially in terms of where we are, we've built a squad based on what our physical, but also our financial restraints are and so all those things together mean we're in a pretty good place, and we'll be stronger if we keep Alex in.\"\nBristol City have brought in four new players this summer in defenders Ross McCrorie, Rob Dickie and Haydon Roberts and midfielder Jason Knight.\nThey finished 14th in the Championship last year and Pearson did not rule out bringing in another player before the end of the transfer window.\n\"I'm happy with the group of players that we have now, we've got a much better balance, the atmosphere within the club is, for the most part, very positive and this season gives us a real opportunity to show what we're about, so I'm looking forward to it,\" Pearson added.\n\"We've got a pretty well-balanced, pacey, energetic team, and I think that bodes very well for us in the Championship.\n\"It will still be a very, very tough league of course, I'm not expecting it to be anything other than a very, very tough year. But I think we've got as good a chance as anybody, I really do believe that.\"\nMeanwhile, Rob Atkinson will not be with the squad until \"the new year, maybe\" after rupturing his anterior cruciate ligament in February and midfielder Ayman Benarous - who re-ruptured his ACL in December - is progressing well in his recovery but there is still no timescale on his return.", "url": "https://www.bbc.com/sport/football/66373086"}