{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:35:16", "date_modify": "2025-05-20 14:35:16", "date_publish": "2023-07-25 18:09:06", "description": "Liverpool: Is Trent Alexander-Arnold a number six?", "filename": "sport_articles_cz9306vq3d9o_1747751716.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/29a4/live/b2d05400-2ac7-11ee-b1d7-8fdc93c2782e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cz9306vq3d9o_1747751716.html", "title": "Liverpool: Is Trent Alexander-Arnold a number six?", "title_page": "Liverpool: Is Trent Alexander-Arnold a number six? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "BBC Radio Merseyside contributor Iain Christie discussing Trent Alexander-Arnold's positioning on the latest episode of The Red Kop podcast: \"I think if he does start there (in midfield) against Chelsea it's because we haven't done the business in the right way.\n\"I love Trent Alexander-Arnold, I think he's a fantastic right-back. I was dead against the idea of the full-back tucking into midfield. I hated it when I watched it against Arsenal but then it slowly grew on me and I realised what he could bring in that role.\n\"But that's a very different role to the pure number six and the reason why he could do so much in midfield at the end of last season is because he had a man alongside him - Fabinho - getting his foot in, winning the ball, and as soon as he gets it moving it forward.\n\"If Trent does start in that number six you're really curtailing all the things he's best at. You're saying 'you have to be the deepest midfielder, you have to watch what the attacking players are doing, you don't wander off and join in'.\n\"The lovely stuff we saw him doing - turning up on the edge of the area, those beautiful little chipped balls, those shots, the havoc he was causing - is very different from the pure six. It takes a mindset and I'm not sure he has that mindset.\"\nListen to the full episode on BBC Sounds", "url": "https://www.bbc.com/sport/articles/cz9306vq3d9o"}