{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:11:49", "date_modify": "2025-05-21 04:11:49", "date_publish": "2025-04-06 11:08:50", "description": "Injuries to key players leave Derry as big underdogs in Sunday's Ulster SFC preliminary-round tie away at holders Donegal.", "filename": "sport_articles_cn0wxr15prgo_1747800709.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a31e/live/3bd58230-1166-11f0-ba60-99b08c2860b3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cn0wxr15prgo_1747800709.html", "title": "Ulster SFC 2025: Injuries to hamper Derry's championship hopes?", "title_page": "Ulster SFC 2025: Injuries to hamper Derry's championship hopes? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manager: Paddy Tally Captain: Conor Glass Fixture: Donegal v Derry – Pairc Mac Cumhaill, Sunday, 6 April, 14:00 BST\nDerry had a miserable league campaign under new boss Paddy Tally, suffering relegation after finishing bottom of Division One and without a win from their seven games.\nThey will hope to change the downbeat mood around the county by pulling off a shock and beating in-form Donegal on Sunday.\nAfter winning back-to-back Ulster titles, Derry were stunned by Jim McGuinness' eventual winners in the quarter-finals last year - a few weeks after winning the Division One League title.\nDerry's chances of an upset win aren't being helped by an injury crisis with the quartet of Gareth McKinless, Odhran Lynch, Conor McCluskey and Anton Tohill all ruled out of the Ballybofey contest.\nBrendan Rogers was a major doubt missing Derry's final two league games after limping out of their defeat to Donegal in Ballyshannon but he has been named to start at full-back.\nIn addition, Ciaran McFaul, Niall Loughlin and Lachlan Murray were also doubts for this weekend's preliminary-round tie but McFaul and Murray have been named to start with Loughlin named amongst the substitutes.", "url": "https://www.bbc.com/sport/articles/cn0wxr15prgo"}