{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:42:38", "date_modify": "2025-05-21 05:42:38", "date_publish": "2025-02-08 20:58:05", "description": "SA20 awards: Marco Jansen named player of 2025 tournament", "filename": "sport_cricket_articles_c93l213jd4xo_1747806158.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/de92/live/33821760-e65f-11ef-9205-613768543557.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c93l213jd4xo_1747806158.html", "title": "SA20 awards: Marco Jansen named player of 2025 tournament", "title_page": "SA20 awards: Marco Jansen named player of 2025 tournament - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "South Africa all-rounder Marco Jansen was named player of the tournament in the third edition of the SA20.\nJansen, 24, was part of the Sunrisers Eastern Cape side that was beaten by MI Cape Town in the final as they looked to win a third successive title.\nThe left-armer was also named the tournament's best bowler after finishing as the leading wicket-taker with 19 at an average of 18.42. His economy rate was only 7.14 too.\nHe scored 204 runs in the middle order and often dug Sunrisers out of trouble.\nPaarl Royals opener Lhuan-dre Pretorius was named the tournament's best batter after finishing as the top run-scorer with 397 runs at an average of 33.08 and an impressive strike-rate of 166.81.\nThe 18-year-old was playing in the tournament for the first time and was part of a formidable opening partnership alongside Joe Root, before he left for England's tour of India.\nMI Cape Town batter Dewald Brevis was named rising star of the season after scoring 291 runs at an average of 48.5 and strike-rate of 184.18.\nJansen's South Africa team-mates Aiden Markram and Heinrich Klassen are the two previous winners of the player of the tournament award.", "url": "https://www.bbc.com/sport/cricket/articles/c93l213jd4xo"}