{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:43:13", "date_modify": "2025-05-21 06:43:13", "date_publish": "2025-03-28 22:26:01", "description": "Ards manager John Bailie says that holders Cliftonville \"fully deserved\" their 3-0 Irish Cup semi-final win at Windsor Park.", "filename": "sport_articles_cdx2x4x4y45o_1747809793.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/fe00/live/8fcb4f20-0c23-11f0-91f1-3bb93ded1c83.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cdx2x4x4y45o_1747809793.html", "title": "Irish Cup: Cliftonville 'fully deserved' semi-final win", "title_page": "Irish Cup: Cliftonville 'fully deserved' semi-final win - Bailie - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ards manager John Bailie said that holders Cliftonville \"fully deserved\" their 3-0 Irish Cup semi-final win at Windsor Park.\nJoe Gormley opened the scoring for the Reds before substitutes Alex Parsons and Ryan Corrigan added goals in the second half.\nAnd Bailie believes his Championship side were beaten by a superior team as the Reds reached a second successive Irish Cup final.\n\"It's been a really tough night, we knew it would be tough, Cliftonville are a quality side, and they played some quality stuff tonight,\" he told BBC Sport NI.\n\"They fully deserved their win, they played really well and did a good number on us.\"\nBailie bemoaned Ards' misfortune with the few chances they created when the game was still in the balance as well as their naivety in being caught on the counter-attack by Cliftonville.\n\"We struggled for large parts tonight with their movement, but to be fair to our lads we stayed in the game for a long time,\" he added.\n\"At 1-0 we had a few half chances, and you need those to go in and at 2-0 we had the one [from Darius Roohi] that just goes over the crossbar.\n\"If we had a bit more quality it might have been a different game, but the last 10-15 minutes you could see the legs were gone and every time Cliftonville broke they looked as though they could score.\"\nThe Ards boss admitted the defeat would hurt for a while but he praised his players for making it to the last four, knocking out Premiership sides Ballymena United and Loughgall in the process.\n\"There will be disappointment, but they just have to suck that up and learn from the occasion, we can't dwell on it.\n\"We got beat by a team that can beat any team in the league. It is not a disgrace, we are not ashamed, I told the players to be proud of our cup run and their efforts.\n\"Tonight, we fell short, but we have to accept that.\"", "url": "https://www.bbc.com/sport/articles/cdx2x4x4y45o"}