{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:53:40", "date_modify": "2025-04-26 03:53:40", "date_publish": "2025-03-03 08:00:13", "description": "Bournemouth 1-1 Wolves (5-4 on penalties): Fan views on FA Cup game", "filename": "sport_football_articles_cn04w89l984o_1745639620.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cn04w89l984o_1745639620.html", "title": "Bournemouth 1-1 Wolves (5-4 on penalties): Fan views on FA Cup game", "title_page": "Bournemouth 1-1 Wolves (5-4 on penalties): Fan views on FA Cup game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "We asked for your views on the FA Cup fifth round match between Bournemouth and Wolves.\nHere are some of your comments:\nBournemouth fans\nColin: A very one-sided affair. Unbelievable attacking from the Cherries, over 30 shots! Terrific defending from Wolves. A fair result, finally!\nSteve: Superb. We fully deserved that result after last week's loss in the league.\nMike: Great persistence and we held our nerves in the shootout after Dean Huijsen missed his penalty. Luckily Wolves shot themselves in the foot when Matheus Cunha became reckless and cost them. Bournemouth must learn to finish teams off after taking the lead and become more clinical in the last third.\nLance: Bournemouth proved, like every week, that they are fighters and never give up. I hope the squad will stick together in seasons to come. Never change a winning team, as they say.\nWolves fans\nPeter: Cunha cost us the game and now possibly the league. That is twice his temper has got the best of him. If he can't control it, he may as well go. Toti Gomes was outstanding in defence.\nBG: We need league points more than we need a cup run. Losing this game was likely, but losing Cunha will be more costly.\nSteve: Wolves defended well. Cunha was irresponsible and petulant - he isn't playing in a Sunday morning pub match! Overall, Bournemouth deserved to win but they also need to stop hacking like a Sunday morning team. They were making way too many dangerous tackles, which do not belong in the Premier league.", "url": "https://www.bbc.co.uk/sport/football/articles/cn04w89l984o"}