{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:19:23", "date_modify": "2025-05-20 12:19:23", "date_publish": "2023-08-04 21:56:19", "description": "Barcelona make Bernardo Silva a priority, West Ham boss David Moyes' job at risk, Manchester United want Aurelien Tchouameni, plus more.", "filename": "sport_66408810_1747743563.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/CF22/production/_130662035_gossip_silva_getty3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_66408810_1747743563.html", "title": "Saturday's gossip: Silva, Moyes, Tchouameni, Amrabat, Vlahovic, Alvarez, Walker", "title_page": "Saturday's gossip: Silva, Moyes, Tchouameni, Amrabat, Vlahovic, Alvarez, Walker - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Barcelona will make Manchester City's 28-year-old midfielder Bernardo Silva their priority with France winger Ousmane Dembele, 26, set to join Paris St-Germain. (Mundo Deportivo - in Spanish), external\nWest Ham manager David Moyes' job is at risk with tensions rising at the club about their transfer targets. (Mail) , external\nWest Ham are set to discuss a deal for Mexico midfielder Edson Alvarez with Ajax, having agreed personal terms with the 25-year-old. (Fabrizio Romano), external\nManchester United manager Erik ten Hag wants the club to bring in 23-year-old Real Madrid midfielder Aurelien Tchouameni, who is also a target for German club Bayern Munich. (Sport - in Spanish), external\nMorocco midfielder Sofyan Amrabat has been left out of Fiorentina's squad for pre-season friendlies this weekend amid interest in the 26-year-old from Manchester United. (Manchester Evening News), external\nBrentford are set to turn down Arsenal's opening bid for Spain goalkeeper David Raya, 27, but negotiations will continue over a deal. (Athletic - subscription required), external\nReal Madrid are set to rival Chelsea for the signing of 23-year-old Juventus and Serbia striker Dusan Vlahovic if their attempts fail to bring PSG's France striker Kylian Mbappe, 24, to the Bernabeu. (Cadena Ser - in Spanish), external\nWolves are exploring replacements for manager Julen Lopetegui, who could leave the club amid frustration over transfer policy this summer. (Mirror), external\nBelgium midfielder Romeo Lavia was an unused substitute for Southampton in their Championship opener against Sheffield Wednesday, with a third bid expected soon from Liverpool for the 19-year-old. (Goal), external\nManchester City are considering Bayer Leverkusen and Germany forward Florian Wirtz, 20, as a potential replacement for 32-year-old Algeria winger Riyad Mahrez, who has left to join Saudi Arabian side Al-Ahli. (Football Transfers), external\nChelsea are looking at PSG's 29-year-old Argentina midfielder Leandro Parades after becoming frustrated in their attempts to sign Brighton's Ecuador midfielder Moises Caicedo, 21. (Standard), external\nChelsea have also had a bid rejected for Montpellier's France Under-21 striker Elye Wahi, 20. (RMC Sport - in French), external\nTottenham are moving closer to a deal for 22-year-old Wolfsburg's Dutch defender Micky van de Ven in a deal worth an initial 40m euros and possibly rising to 50m euros with add-ons. (Sky Sports), external\nAfter signing Van de Ven, Spurs will look to bolster their defence further by moving for Bayer Leverkusen's 24-year-old Burkina Faso centre-back Edmond Tapsoba, who is rated at £50m by the Bundesliga club. (Football Insider), external\nManchester City have offered a new contract to England defender Kyle Walker in a bid to keep the 33-year-old at the club amid interest from Bayern Munich. (Athletic - subscription required), external\nBrighton are interested in Inter Milan midfielder Kristjan Asllani, with Seagulls boss Roberto de Zerbi an admirer of the 21-year-old Albania international. (Tuttomercatoweb.com - in Italian), external\nInter Milan have agreed a fee with Bayern Munich for Switzerland keeper Yann Sommer and the 34-year-old will have his medical next week before signing a two-year contract with the Italian club. (Football Italia), external\nAtalanta are set to beat Inter Milan to the signing of West's Ham's 24-year-old Italy striker Gianluca Scamacca. (Football Italia), external\nBarcelona are willing to accept offers of around 10m euros (£8.6m) for 22-year-old United States full-back Sergino Dest. (Athletic - subscription required), external\nChelsea have approached investors about raising as much as $500m (£392m) in capital - with any money invested possibly rewarded with a stake in the club. (Bloomberg - subscription required), external", "url": "https://www.bbc.com/sport/66408810"}