{"authors": ["Ross Morren", "www.facebook.com"], "date_download": "2025-05-21 06:22:01", "date_modify": "2025-05-21 06:22:01", "date_publish": "2024-12-24 12:03:17", "description": "Ross County fan's voice: 'Opportunity missed as Staggies fail to kick on'", "filename": "sport_articles_c5y8v00pq3no_1747808521.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3296/live/7bc0af50-c1ed-11ef-a0f2-fd81ae5962f4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c5y8v00pq3no_1747808521.html", "title": "Ross County fan's voice: 'Opportunity missed as Staggies fail to kick on'", "title_page": "Ross County fan's voice: 'Opportunity missed as Staggies fail to kick on' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ross County's 2-1 defeat against St Mirren on Saturday felt like an opportunity missed for the Staggies.\nMichee Efete's first goal for the club less than a minute after half-time cancelled out Alex Iacovitti's opener for the visitors on his return to Dingwall.\nThe momentum was with Don Cowie's side following Efete's equaliser and when Scott Tanser was shown a second yellow card for the visitors after 55 minutes, it should have been the moment that handed County the initiative to go on and win.\nInstead, the players failed to kick on and went back into their shells. There was no bravery or tempo in their play and when they got into forward areas, their final ball was seriously lacking quality and conviction.\nIn comparison, the character shown from St Mirren when they went down to 10 men was outstanding. They defended resolutely and looked dangerous on the counter, which led to Oisin Smyth's 89th-minte free-kick winner.\nThat late blow rounded off a really poor afternoon for the Staggies. Similar to the defeat at Hibs the week prior, a lack of character and poor decision-making in key moments ultimately cost us.\nCowie will demand a response from his side at Dens Park on Boxing Day. A first away win in the Premiership in 2024 would be an excellent late Christmas present for every County fan.", "url": "https://www.bbc.com/sport/articles/c5y8v00pq3no"}