{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:32:49", "date_modify": "2025-05-19 14:32:49", "date_publish": "2017-07-10 16:17:33", "description": "Romelu Lukaku was mooted for a return to Premier League champions Chelsea until Manchester United made their move. But why is he so sought after?", "filename": "sport_football_40520856_1747665169.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/17634/production/_96869759_lukaku.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_40520856_1747665169.html", "title": "Romelu Lukaku: Is Man Utd's £75m swoop for Everton striker a good move?", "title_page": "Romelu Lukaku: Is Man Utd's £75m swoop for Everton striker a good move? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Romelu Lukaku was mooted to be returning to Premier League champions Chelsea... that was before Manchester United agreed a deal with Everton for an initial £75m.\nSo why is the 24-year-old striker so sought after, and what might Lukaku bring to his new club?\nFormer Everton and England midfielder Leon Osman, who played with him for three seasons, says he has not seen a better one-on-one finisher, while Phil Neville, who played for both clubs involved, believes he will give United an added dimension.\nThe Belgium forward joined Chelsea from Anderlecht in 2011.\nAfter a loan spell, he was sold to Everton for £28m by current United boss Mourinho during the Portuguese manager's second spell in charge of Chelsea in 2014.\nOsman: Everton have got a fantastic price - £47m profit on a player that was your record signing couple of years back is a great return.\nManchester United have identified a player who could fill the void Zlatan Ibrahimovic is going to leave. It could work for both clubs.\nHe could potentially be worth the money. He's certainly been scoring a lot of goals in the Premier League.\nI think he will be a good, popular figure in the dressing room. He will fit in quite well with the players he already knows, like Paul Pogba.\nNeville: What you've got is a young striker who is proven in the Premier League and he's got great experience at scoring goals.\nHe's a 20-goals-a-season man and maybe more as he's getting older in a better team with better service. So £75m seems quite a fair price for somebody of that ability and that age.\nThere will be a £100m transfer very shortly, I'm convinced of that, so I ignore the fees now and look at the product and the quality the clubs are buying.\nWith a £75m price tag, a club with a huge global fanbase and a demanding, high-profile manager, does Lukaku have the temperament to deal with the added pressure?\nLO: He's a big guy and a big presence. As he's matured, he's had quite a bit more to say in the dressing room. It will be interesting to see if he can walk into the Manchester United dressing room and continue to do that.\nThroughout his youth and development, he has aspired to reach the very top. I think he'll fit well. He's got the temperament to handle the big situations.\nHe's a big character off the pitch. He does believe in himself. He has a big self-confidence. You've seen that when he gets on a roll with scoring. He really does get a head of steam up and scores game after game. The United fans will be delighted if they can see that.\nHe works hard in front of goal. I'm not sure you'd see him doing extra running sessions behind closed doors. He does like to see the ball hitting the back of the net and if there's a shooting drill he'll be involved.\nHe got criticised at times at Everton for not tracking back, but Manchester United won't have an issue with that. They didn't with Ibrahimovic. They'll happily let Lukaku stay up front and save his energy for the big moments in the game.\nPN: Romelu Lukaku is a different player now to when Mourinho sold him at Chelsea. He's a better player and his record is sensational - 25 goals last season, 18 the year before, even 17 Premier League goals going back to his West Brom days. If he gets anything like that 17-20 this year, United will be successful.\nUnited drew 10 of their 19 home games last season and failed to score more than once each time.\nEight of those came against teams who finished the season below them - 16 dropped points which if they had been turned into victories could have seen them challenging for second, rather than finishing sixth.\nLO: It's an incredibly big price tag but you've got a player who could turn those draws into wins for Manchester United. That could potentially be a championship for them.\nHe'll bring goalscoring. It's as simple as that, an ability to find the back of the net. Barring Ibrahimovic, that was Manchester United's big falling down last season.\nThat's Lukaku's forte. He's been criticised for only doing it in the games against lesser clubs. They're the games in which United struggled at home last season so it should be a good fit.\nPN: I wouldn't be surprised if Jose wants to bring in another striker. Maybe someone who can play second foil, alongside Marcus Rashford, Anthony Martial and Lukaku because they've got a lot of games.\nFor United to win the league next year they're going to have to score 90-100 goals because they're going to have to start demolishing teams rather than winning by one or two goals.\nIn the past three seasons, Lukaku has made 36 Premier League appearances against Chelsea, Manchester United, Manchester City, Arsenal, Spurs and Liverpool - he has scored just five goals.\nLO: You could claim in the past he's scored goals against the lesser teams because his side were on the attack more and allowed to create chances.\nAgainst the bigger teams it's more of a defensive situation where the striker can get isolated.\nI do feel he will get more goals for Manchester United against the bigger teams.\nHe plays on the shoulder of defenders, he likes to run over the top of defenders. I don't think I've seen a better one-on-one-type finisher with the goalkeeper than Lukaku.\nHe has a belief in himself that those goals will come. If he doesn't get the chances he will certainly tell his team-mates. Whether it be right or wrong, he seems to have a voice which has become more apparent as he's got older.\nPN: He's a different type of striker from what United have had for a long time - someone who can run in behind, be a little bit of a battering ram and can let United play on the counter-attack. They could not play on the break with Ibrahimovic because of age.\nLukaku was the Premier League's second top scorer with 25 goals least season, behind Tottenham's Harry Kane (29) - but is there more to come?\nLO: He's got a big personality and a big desire to play at the very, very top. He's got the ambition for it. I believe he's got the ability for it, certainly in front of goal.\nHe's a big focal point as a striker to help the team and take knocks. He can frustrate at times with his hold-up ability, which is an area I do think he can improve on.\nI believe he can still get better. He's not quite peaked.\nI know he likes to put the work in. He's a student of the game, he watches players and games to learn from and that's great when you're buying a player who can still improve.\nThe way Manchester United play will suit Lukaku better than the way Chelsea often play. You look at Didier Drogba and Diego Costa - Chelsea require big all-round players who are physical and hold the ball up, bring people into play and batter opposition defenders at times.\nAs big and physical as Lukaku is, I don't think his hold-up play is suited to that. He's more about running in behind and getting on the end of things.\nIf he stays fit, he'll score a lot of goals over the next few seasons.", "url": "https://www.bbc.com/sport/football/40520856"}