{"authors": ["Nizaar Kinsella", "www.facebook.com"], "date_download": "2025-04-26 06:55:18", "date_modify": "2025-04-26 06:55:18", "date_publish": "2025-02-28 15:34:53", "description": "Bourmemouth news: Andoni Iraola on Lewis Cook's England chances", "filename": "sport_football_articles_c99np0x22reo_1745650518.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/eb6b/live/8b3312e0-f5e9-11ef-9e7b-21c750c82d19.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c99np0x22reo_1745650518.html", "title": "Bourmemouth news: Andoni Iraola on Lewis Cook's England chances", "title_page": "Bourmemouth news: Andoni Iraola on Lewis Cook's England chances - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Bournemouth manager Andoni Iraola was diplomatic about whether new England manager Thomas Tuchel should call up Lewis Cook.\nBut there was no doubt that he thinks his midfielder, who got one cap for his national team in 2018, is good enough to play at international level.\nCook's grandfather collected £17,000 after his £500 bet on his grandson made his England debut in a 1-1 draw against Italy.\nAsked about it by BBC Sport, Iraola said: \"I love Lewis Cook. I think he's a very, very good player. I'm very lucky to have him in our squad but is the same way you asked me when Dom Solanke was here first season.\n\"For us, he's very good but I don't know the plans of the new manager. I don't know what he thinks the only thing I can say that for me Cook is a top player and I feel very lucky to have him.\n\"Thomas Tuchel is probably analysing not 25 but maybe 100 English players. We will be happy if it happens for him personally because you always want the best for your players.\"\nBefore the FA Cup fifth-round tie on Saturday with Wolves, Cook told BBC Radio Solent about playing out of position at right-back amid a recent injury crisis at Bournemouth.\n\"I'd obviously love to play in central midfield but the midfield we have a lot of options in all positions and would have an incredible bench if everyone was fit,\" he said. \"But I've enjoyed learning and happy to play at right-back as well.\"\nBournemouth have only reached the quarter-final of the FA Cup on two previous occasions and has never progressed further in its 126-year history.\nHowever, Iraola has achieved success in cup competitions at his previous clubs, remarkably reaching the semi-final of the Copa del Rey in 2020 with second division Mirandes. That was a feat that had been managed just once before in the club's 92-year history, and he led them to victories over La Liga sides Celta Vigo, Sevilla and Villarreal on the cup run.\nSimilarly, he took Madrid-based minnows Rayo Vallecano to the semi-final in 2023 - also just the second time in the club's history - and he now hopes to beat Wolves to reach the quarter-finals with Bournemouth on Saturday afternoon.\n\"We are talking about reaching the quarter-finals,\" added the Cherries boss. \"That starts to sound really nice. So I think the way these games are played are a little bit different.\"\nIraola confirmed midfielder Ryan Christie has suffered an \"acute injury\" but could be fit in time while Julian Araujo is back from a hamstring injury sustained in November after being cleared by a specialist in Finland.", "url": "https://www.bbc.co.uk/sport/football/articles/c99np0x22reo"}