{"authors": ["Alvin McCaig", "www.facebook.com"], "date_download": "2025-05-19 14:31:11", "date_modify": "2025-05-19 14:31:11", "date_publish": "2017-08-05 13:22:36", "description": "Hosting the Women's European U19 Championship offers up so many opportunities for Northern Ireland captain Emma McMaster.", "filename": "sport_football_40764950_1747665071.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1273B/production/_97197557_emmacel2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_40764950_1747665071.html", "title": "Uefa Women's U19 Championship: Ambition fuelling Northern Ireland's bid for success", "title_page": "Uefa Women's U19 Championship: Ambition fuelling Northern Ireland's bid for success - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Leading out the hosts in a major European tournament will be just one box ticked for Northern Ireland skipper Emma McMaster.\nThe Uefa Women's U19 Championship represents so much more for the teenage student from Ballynahinch in County Down.\nTo prove Northern Ireland can mix it with the continent's elite, the chance to catch the eye of professional clubs and to inspire girls to get on the football pitch and follow in their footsteps.\nIt's an opportunity to be seized with both hands and the Cliftonville Ladies midfielder is determined not to miss out.\n\"We're not here just to make up the numbers - we're a very good side and we aim to show that in the tournament,\" said Chelsea fan Emma.\n\"It's fantastic that Northern Ireland is hosting such a big event and it opens up possibilities for all us.\n\"There will be plenty of scouts at the games so a few good performances could make a big difference to our careers.\n\"We all dream of playing professional football, like some of the Northern Ireland senior women's team, and it's an added incentive to impress when it all starts next week.\n\"It would also be great if the tournament encourages more girls to play football and hopefully we'll have plenty of young fans at the matches.\"\nEmma's passion for the game was ignited at the age of four, kicking a ball about in the garden with her sister.\nTeam football meant playing alongside boys but Emma excelled and was marked out early as a leader by skippering her side.\nFrank Lampard and Steven Gerrard were childhood heroes but now her footballing role models, including England winger Karen Carney, are found in the female ranks.\nIt reflects the growth and increased profile of women's football, with Northern Ireland but one example.\nFrom a starting point of 18 teams in the 1970s, the NI Women's Football Association now boasts 55 sides.\nThere is also the elite Women's Premiership, a seven-team league formed last year and where Emma hones her skills.\nMedia coverage is on the increase and Northern Ireland's three group games will be streamed live on the BBC Sport website.\n\"The publicity has been brilliant so far and and it's really encouraging for us that so many people will following our progress in the tournament,\" added Emma.\n\"I was just treated as another player in the boys team and being a girl has never been a barrier for me, I've always been encouraged.\n\"The women's game is really taking off here and it would be great if in years to come it became semi-professional like the men's Irish Premiership.\n\"Simone Magill is at Everton and is among many in the senior international team to play in England - I'm just 18, I've plenty of years ahead of me and they are an inspiration, showing what is possible for us.\"\nNorthern Ireland kick off the tournament on Tuesday against a Spain side which has reached the final four times in the last five years.\nCeltic neighbours Scotland are next up at Windsor Park before a final group game against six-times champions Germany.\nIt's a tall order for Alfie Wylie's team but they are high on confidence after two impressive wins over Wales a fortnight ago in the Super Cup NI youth tournament.\nAn opening 3-1 victory at the Ballymena Showgrounds was followed by a 4-0 hammering, which included a top-corner cracker from the Northern Ireland captain.\n\"That was definitely my best international goal and it was a superb performance from the team,\" said Emma.\n\"Our preparations are going so well and there's a real buzz in the squad, we can't wait to get started on Tuesday.\n\"We're massive underdogs but that suits us fine as we're determined to prove the doubters wrong and hopefully spring a surprise.\n\"Yes, it's going to be tough but this is Northern Ireland's first time in the finals and we are relishing the challenge.\"", "url": "https://www.bbc.com/sport/football/40764950"}