{"authors": ["Lewis Deighton", "www.facebook.com"], "date_download": "2025-04-26 06:50:53", "date_modify": "2025-04-26 06:50:53", "date_publish": "2025-02-28 18:03:10", "description": "Leeds fan writer Lewis Deighton gives his thoughts on how they are lighting up the Championship.", "filename": "sport_football_articles_cr7285krpy7o_1745650253.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c28e/live/d240fc60-f5fd-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cr7285krpy7o_1745650253.html", "title": "Leeds fan writer Lewis Deighton on how they are lighting up the Championship", "title_page": "Leeds fan writer Lewis Deighton on how they are lighting up the Championship - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Leeds keep cruising and I keep bruising – that away end at Bramall Lane was not for the weak. It's apt that Tanaka's first name is pronounced 'ow' because my shins are so battered that you'd think Farke subbed me on.\n\"Who better to play next then than seemingly our title contenders in Sheffield United?\"\nI wrote that last week after our late comeback against Sunderland, and who better indeed. Make that consecutive wins against promotion rivals in dramatic fashion.\nI touched last week on the similarities between our comeback against Sunderland and the one against Leicester a year prior – not expecting an even closer parallel just seven days later.\nLeicester went ahead in the 15th minute. Blades went ahead in the 14th. We won both games 3-1 having trailed in the 70th minute. We scored two goals inside three minutes after the 79th minute in both. We scored after the 88th minute in both. Coming a year and a day apart, it's almost freaky how alike they are.\nRather like Sunderland, Chris Wilder's side nullified us for a large portion of the game – but through sheer blind hope I was convinced that an equaliser would come out of nowhere and turn the tide.\nAt 1-1 I'd like to say that I saw us winning it but honestly I just wanted the full-time whistle. Did anyone foresee Ao Tanaka popping up for a header in the 89th minute? I love that man. There were about three seconds where you could hear a pin drop and then so much noise that I could barely hear myself.\nPeople were still picking themselves up off the floor as Joel Piroe struck for the third. A mere minute between the goals and absolute carnage ensued. An elderly gentleman who'd been stood behind me was somehow several rows in front of me once everything calmed down – enough said.\nAny suggestion that we are boring to watch is in the past. Too early to say that we're winning the Championship – but we are certainly lighting it up.", "url": "https://www.bbc.co.uk/sport/football/articles/cr7285krpy7o"}