{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:37:31", "date_modify": "2025-04-26 03:37:31", "date_publish": "2025-03-08 00:00:00", "description": "Sunderland maintain their outside hope of automatic promotion from the Championship as Chris Mepham's goal gives them a 2-1 win over struggling Cardiff City at the Stadium of Light.", "filename": "sport_football_live_czx7yxx2regt_1745638651.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_czx7yxx2regt_1745638651.html", "title": "Mepham's first Sunderland goal secures victory over Cardiff City", "title_page": "Mepham's first Sunderland goal secures victory over Cardiff City - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Sunderland maintained their outside hope of automatic promotion from the Championship as Chris Mepham's goal gave them a 2-1 win over struggling Cardiff City at the Stadium of Light.\nSunderland raced into an early second minute lead thanks to Eliezer Mayenda who finished firmly after working space in the Cardiff penalty area.\nThe Bluebirds levelled against the run of play on 41 minutes as Isaak Davies - making his first start of the season – finished from a tight angle as Sunderland appealed for a foul on goalkeeper Anthony Patterson.\nBoth sides had chances to win the match in a more even second half with Yousef Salech rattling the post before Mepham fired home his first Sunderland goal on 77 minutes from close-range after a free-kick routine caught Cardiff cold.\nVictory sees Sunderland remain eight points off the automatic promotion spots in fourth, while Cardiff are one place and four points above the Championship drop zone.\nSunderland secured a third successive league win against Cardiff for the first time in 103 years as they secured a valuable three points as they bid to stay in touch with Leeds, Sheffield United and Burnley at the top of the Championship.\nThe Black Cats came into this contest as well rested as a Championship side is ever going to be in March, having not played for eight days and with manager Regis Le Bris afforded the luxury of naming an unchanged XI from the 2-1 win at Sheffield Wednesday last time out.\nCardiff boss Omer Riza made three changes from the side beaten 2-1 at home by Burnley in midweek, with Davies finally able to make his return from long-term injury.\nThe Bluebirds have been dismal on the road for months, having won just one of their past 19 away Championship matches and they made the long journey north without a win away from home in 2025.\nCardiff could not contain Sunderland from the first moments of the game and it was the red-hot Mayenda who opened the scoring inside two minutes as he worked the ball into space in the penalty area before lashing home assuredly with a precise left-footed finish from Patrick Roberts' pass.\nMayenda scored both the goals in Sunderland's win at Hillsborough and he pulled Cardiff all over the pitch along with his fellow tormentor, Romaine Mundle, though Roberts was forced off by injury.\nThe hosts were nevertheless in control and saw Trai Hume and Alan Browne fire wide while Mundle and Jobe Bellingham saw efforts blocked as Cardiff were forced to defend deep and in numbers.\nCardiff did come close on 29 minutes when Dan Neil conceded possession, but Callum Robinson fired wide with Anthony Patterson beaten if the effort was on target.\nThe leveller did arrived on 41 minutes as Davies finished from a narrow angle after Patterson failed to claim a cross with Sunderland's appeals for a free-kick waved away.\nSunderland might still have led at the break, but Mundle's shot was saved by Ethan Horvath and Mayenda hit the side-netting after being sent clear by Bellingham and rounding the goalkeeper.\nIt was Cardiff who had the first big chance of the second half and the Bluebirds were unlucky not to lead as Yousef Salech's volley cannoned back out off the inside of the post with Patterson doing brilliantly to get a vital touch on the ball.\nAt the other end Horvath saved from Chris Rigg's header but the hosts lacked the cohesion and tempo they exhibited in the early stages of the contest.\nHowever, Sunderland did find a moment of quality when they really needed it as Wilson Isidor pealed away into space as Cardiff anticipated a free-kick being lofted into their box and Isidor's cross was turned home by Mepham from close-range on 77 minutes as the Wales international picked the perfect moment to score his first Black Cats goal.\nSunderland head coach Regis Le Bris told BBC Radio Newcastle:\n\"We scored early which is always a good idea and for 20 minutes we were very good, the way I want us to play.\n\"At half-time I was disappointed. The question of consistency is key. If we could have maintained that level we would have scored two or three more goals because we were really dominant.\n\"We allowed our opponent to find solutions and confidence and they scored and it was deserved at that part of the game.\n\"In the last stage of the game we were better. It was more a reaction than massive control. We found a solution and that is a positive for us.\"\nCardiff City boss Omer Riza told BBC Radio Wales:\n\"When you come to a place like this if you leave with a point, the way the league is at the moment, you are happy and we should have come away with a point.\n\"One lapse of concentration from a freekick. We don't get given cheap opportunities like that.\n\"Yousef Salech had one saved which could have made it 2-1. If we had left here with a point I think we would have deserved it.\n\"If that chance goes in it is 2-1 and they are chasing the game. But we've conceded a goal, the manner of which I'm unhappy with, having worked so hard.\"", "url": "https://www.bbc.co.uk/sport/football/live/czx7yxx2regt"}