{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:55:33", "date_modify": "2025-04-26 07:55:33", "date_publish": "2025-02-25 12:51:48", "description": "Ole Romeny says he signed for Oxford \"to play, be important for the club and score goals\" after making his full debut against West Brom.", "filename": "sport_football_articles_cp8yq384eepo_1745654133.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/142a/live/59fbe540-f36d-11ef-a30e-87a8a95b0cd7.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cp8yq384eepo_1745654133.html", "title": "Ole Romeny: Oxford United striker knows he needs to score goals", "title_page": "Ole Romeny: Oxford United striker knows he needs to score goals - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Oxford United striker Ole Romeny says he knows he \"needs to score goals\" following his big-money move to the club in the January window.\nThe 24-year-old joined the U's from Dutch top-flight club Utrecht for a fee understood to be a club record and made his full debut in Saturday's 2-0 Championship defeat by West Bromwich Albion at The Hawthorns.\n\"I'm really happy to start. I felt good. Of course, I want to play every game,\" Romeny told BBC Radio Oxford.\n\"I came here to play and to be important for the team and that's the only thing I care about. I need to score goals.\n\"There's always pressure. Everywhere you play. I enjoy my football so I don't really think about all those other things.\"\nRomeny, who made four appearances from the bench prior to the trip to Albion, said he doesn't feel the weight of expectation despite his price tag, adding: \"there's always pressure - everywhere you play - I don't really think about all those things\".\nHe has no problem with being the lone target man in games under boss Gary Rowett, a system that can leave him looking isolated at times, especially away from home.\n\"You need to be strong, keep the ball and be a rest point for the team and I think I can do that,\" Romeny said.\n\"I'm comfortable on the ball and like it at my feet so it suits me.\"\nRomeny echoed Rowett's views that Oxford needed to be \"more clinical\", adding that they \"were lacking a bit of communication\" against the play-off chasing Baggies but said they \"need to stay positive\".\nUnited take on another promotion candidate in Coventry City on Saturday with their nine-game unbeaten run at the start of Rowett's reign just after Christmas providing them with an eight point cushion above the relegation zone.\nRomeny said they are \"not focusing\" on the table instead \"giving everything every game to try to win - you cannot do more than that\".", "url": "https://www.bbc.co.uk/sport/football/articles/cp8yq384eepo"}