{"authors": ["Ross Morren", "www.facebook.com"], "date_download": "2025-04-26 07:54:22", "date_modify": "2025-04-26 07:54:22", "date_publish": "2025-02-25 13:22:15", "description": "Ross County fan voice: 'Can top-six dream become reality?'", "filename": "sport_articles_cy83xyyr587o_1745654062.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1657/live/b17f61a0-f360-11ef-8c03-7dfdbeeb2526.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cy83xyyr587o_1745654062.html", "title": "Ross County fan voice: 'Can top-six dream become reality?'", "title_page": "Ross County fan voice: 'Can top-six dream become reality?' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The 3-1 win against Dundee was the perfect example of the progress Ross County have made this season.\nThe Staggies have picked up nine points out of nine against Dundee and scored eight goals. Last term they only picked up a single point and failed to net in the sides' three meetings.\nEarlier this season, if the Staggies suffered an early setback in a match it could have unsettled them. However, when Simon Murray fired Dundee ahead in the fourth minute against his former club, the reaction from County was outstanding.\nThe hosts took control and pinned Dundee back in their own half, with Kieran Phillips heading his first goal for the club. Following his move from Huddersfield in January, Phillips has quickly gelled into the attack alongside Ronan Hale and Noah Chilvers.\nAkil Wright then scored his latest goal of the season contender with an outrageous scissor kick to fire the Staggies ahead. Wright, who netted a spectacular strike against Aberdeen last month, has been outstanding and will be a very strong candidate for County's player of the season.\nThe attacking trio of Phillips, Hale and Chilvers showed how dangerous they can be as all three combined for County's third goal, scored by Chilvers. It's the second week in a row the front three have played a key part in the build-up to a goal.\nCounty are now within two points of the top six and five clear of Dundee in 11th. If we can end this week with a strong haul of points from matches against St Johnstone and Kilmarnock, the dream of a top-six finish might just start to look like reality.", "url": "https://www.bbc.co.uk/sport/articles/cy83xyyr587o"}