{"authors": ["Jonty Colman", "www.facebook.com"], "date_download": "2025-05-21 03:43:09", "date_modify": "2025-05-21 03:43:09", "date_publish": "2025-04-06 16:44:29", "description": "Brentford 0-0 Chelsea: Missed chances cost Bees against Blues", "filename": "sport_football_articles_c77nree6gzgo_1747798989.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/eb16/live/5a57a430-1306-11f0-baa6-cf6d1e060075.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c77nree6gzgo_1747798989.html", "title": "Brentford 0-0 Chelsea: Missed chances cost Bees against Blues", "title_page": "Brentford 0-0 Chelsea: Missed chances cost Bees against Blues - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "While Chelsea had 21 shots to Brentford's nine in the goalless draw between the two sides, the Bees had the better chances and based off them, should have taken three points.\nIn the first half, Mikkel Damgaard was through on goal six yards out, but completely missed the ball when he only had Blues goalkeeper Robert Sanchez to beat.\nKeane Lewis-Potter's header from a corner also Sanchez into a good diving stop and while Chelsea's second half substitutions led to them controlling the flow of the second half, it was the Bees who had three golden chances in a five-minute flurry late on.\nBryan Mbuemo exchanged a one-two with Yoane Wissa before his effort on goal was denied by Sanchez.\nFrom the resulting corner, Sepp van den Berg, who almost turned into his own net earlier in the half, headed over from close range before Wissa himself steered wide with a header of his own.\nBetween the two sides, Opta said an expected goals (xG) total of 2.54 had been generated between both teams, the third highest in a Premier League game this season which has ended 0-0.\nHad either of Damsgaard, Mbuemo, Wissa, Van den Berg or Lewis-Potter taken their chances, the Bees would have ended their eight-game wait for a home victory in the league and boosted their slim hopes of qualifying for European football for the first time in their history.", "url": "https://www.bbc.com/sport/football/articles/c77nree6gzgo"}