{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:36:54", "date_modify": "2025-04-26 04:36:54", "date_publish": "2025-02-28 11:33:08", "description": "New Blackburn Rovers boss Valerien Ismael will stick to the principles which have brought him success elsewhere in his coaching career.", "filename": "sport_football_articles_cg700x7e9r5o_1745642214.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0ee9/live/394f5e80-f5c5-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cg700x7e9r5o_1745642214.html", "title": "Valerien Ismael: New Blackburn boss to stick to his principles", "title_page": "Valerien Ismael: New Blackburn boss to stick to his principles - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "New Blackburn Rovers boss Valerien Ismael says he intends to stick to the principles which have brought him success elsewhere.\nThe Frenchman was appointed as John Eustace's replacement this week after the latter made the surprise decision to jump from a play-off challenge to a relegation battle with Derby a fortnight ago.\n\"I have my principles on the pitch, and I have my rules: respect, discipline, commitment, and hard work. They were my rules as a player, human being, and head coach,\" Ismael told BBC Radio Lancashire.\n\"I try to stick to my words because I know it brought me my success.\n\"Football is a bumpy road for a head coach but you have to stay true to yourself, stick to your principles but try to adapt and evolve.\"\nIsmael's first game in charge of Blackburn is at home to Norwich City in the Championship on Saturday (12:30 GMT).\nThe former Barnsley and West Brom head coach has been out of football for nearly a year after leaving Watford last March but will take his time before making any major changes at Ewood Park.\n\"We have a short-term focus to support the players and not to touch too much because the players have done well so it means something is right at the minute,\" he added.\n\"But I have the division of the summer where I will prepare the windows and assess the players - I have to observe what type of players I have to do the job I want to do.\n\"I don't want to force anything, for the player to do the job they have to feel comfortable. How many players will be out of contract, how many will we need to take in - it's a massive job we have to do but we are ready.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cg700x7e9r5o"}