{"authors": ["Tasnim Chowdhury", "www.facebook.com"], "date_download": "2025-05-21 07:49:04", "date_modify": "2025-05-21 07:49:04", "date_publish": "2025-05-18 17:55:08", "description": "All the key BBC coverage details for the Monaco Grand Prix, which takes place from 23-25 May.", "filename": "sport_formula1_articles_c989g30y41qo_1747813744.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e50f/live/5759c4a0-340f-11f0-8944-2b1dd2bd7018.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_formula1_articles_c989g30y41qo_1747813744.html", "title": "Monaco Grand Prix practice, qualifying and race times, UK times, plus Monte Carlo weather forecast", "title_page": "Monaco Grand Prix practice, qualifying and race times, UK times, plus Monte Carlo weather forecast - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Round eight of the 2025 Formula 1 season heads to Monte Carlo for the Monaco Grand Prix from 23-25 May.\nMcLaren's Oscar Piastri continues to lead the drivers' championship, 13 points clear of team-mate Lando Norris.\nMax Verstappen remains third in the championship after winning his second race this season for Red Bull at Imola.\nIn the constructors' standings, McLaren lead second-placed Mercedes by 132 points.\nSunday's race in Monaco starts at 14:00 BST.\nCommentary of the race will be available on BBC Radio 5 Live, with practice and qualifying on BBC Radio 5 Sports Extra 2 on BBC Sounds, plus the BBC Sport website and app.\nYou can also listen via most smart speakers. All you need to do is say \"ask BBC Sounds to play the Monaco Grand Prix\".\nMake sure to download the Chequered Flag podcast, which previews and reviews every race of the season.\nAll times BST\nFriday, 23 May\nFirst practice: 12:30-13:30 (BBC Radio 5 Sports Extra 2, BBC Sounds and smart speakers)\nSecond practice: 16:00-17:00 (BBC Radio 5 Sports Extra 2, BBC Sounds and smart speakers)\nSaturday, 24 May\nThird practice: 11:30-12:30 (BBC Radio 5 Sports Extra 2, BBC Sounds and smart speakers)\nQualifying: 15:00-16:00 (BBC Radio 5 Sports Extra 2, BBC Sounds and smart speakers)\nSunday, 25 May\nRace: 14:00 (BBC Radio 5 Live, BBC Sounds and smart speakers)", "url": "https://www.bbc.com/sport/formula1/articles/c989g30y41qo"}