{"authors": ["Ben Miller", "www.facebook.com"], "date_download": "2025-05-20 12:47:19", "date_modify": "2025-05-20 12:47:19", "date_publish": "2023-08-03 08:26:08", "description": "Professional Fighters League star Frans Mlambo and boss Peter Murray on the plan for PFL Africa, led by Cameroon's Francis Ngannou.", "filename": "sport_africa_66268586_1747745239.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/25A0/production/_130623690_gettyimages-1258763271.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_africa_66268586_1747745239.html", "title": "PFL Africa: How ex-UFC champion Francis Ngannou's 'masterpiece' will grow MMA", "title_page": "PFL Africa: How ex-UFC champion Francis Ngannou's 'masterpiece' will grow MMA - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ex-UFC champion Francis Ngannou has described plans for a mixed martial arts (MMA) league in Africa as the \"masterpiece\" of his new deal with the Professional Fighters League (PFL).\nA hero in his home country Cameroon, Ngannou's story is remarkable partly for his rise from childhood poverty to UFC champion, with the budding boxer risking a perilous journey from Africa to Europe that included a spell in prison upon reaching Spain on an inflatable raft.\nNow the heavyweight icon, who signed a deal earlier this year as a minority equity owner and chairman of the newly created PFL Africa, wants fighters to be able to follow his path \"without risking their lives or all of the stuff that I've been through\".\nSo what is the vision for the ambitious project and are MMA fighters in Africa ready to take centre stage?\nA long-time sparring partner of Conor McGregor, Dublin-based Frans Mlambo left his birth country of South Africa 20 years ago and is one of the most successful stars out of the two-time UFC champion's SBG gym in the Irish capital.\nWhen he returned home to visit Johannesburg gym Fight Militia, Mlambo expected his opponents to prove somewhat easier than in Europe - but was surprised by what he found.\n\"I thought I was going to go in and own everybody,\" says the bantamweight, who takes The Zulu Irishman as one of his nicknames, talking to BBC Sport Africa.\n\"I thought I was going to smoke all these guys and play around with them.\n\"When I started training with these guys, it was unbelievable. They were just rag-dolling me around.\n\"The level was way higher than I could have possibly assumed, and that's at every level - the striking, the jiu-jitsu, the wrestling.\n\"There is unbelievable talent coming out of South Africa that just hasn't been seen yet.\"\nThe conditioning and determination of fighters in Cameroon impresses Ngannou - but he knows better than most how much support they need to realise their goals.\n\"It's an opportunity to develop talent, to help fighters with facilities and give them proper training,\" the star of the promotion's new Super Fight division said at PFL 5 in Atlanta last month.\n\"I'm very excited to be a part of that. The dream is coming home - get yourself ready and be prepared, because it's going to be big-time. No excuses.\"\nNgannou joined Nigerian-born pair Kamaru Usman and Israel Adesanya in becoming a UFC champion in 2021, leading to talk that the trio had raised the profile of MMA in Africa as powerfully as McGregor did in Europe.\n\"There was an immense rise of interest in MMA in Africa, and that was before these great fighters came along,\" says Mlambo, who won on his PFL debut in Berlin in July. \"I can only imagine what it is like now.\n\"I saw how it happened with Ireland off the back of Conor and now Africa has amazing fighters who are growing the sport for them.\n\"I definitely think it's a big and growing market. It's a market that is great for the PFL.\"\nNo major global MMA organisation has held an event in Africa, although the UFC told BBC Sport Africa in April that Senegal is \"top of its list\" when it comes to potential host countries.\nPFL chief executive Peter Murray says the African league will launch in 2025 and sees a \"massive\" market where 70% of people are under 30 - the world's youngest population - and mobile service subscriptions and middle-class urbanisation are growing rapidly.\nMurray adds that PFL Africa will form part of an \"ecosystem\" alongside new sporting competitions such as the NBA's Basketball Africa League, which is predominantly contested by players from 12 African countries.\n\"This will be an African company and sports league with African management, as well as ownership,\" says Murray, naming South Africa, Nigeria, Ivory Coast and Cameroon as examples of countries that are \"absolutely in the mix\" to hold events.\n\"We've done our due diligence and we have a strategy to enter the marketplace.\n\"There's an expansive, high-calibre talent pool and we'll be investing in developing athletes under Francis' leadership and bringing more resources, coaching and training space to different parts of Africa.\"\nAs is the case in the US and Europe, the competition format will consist of a regular season, play-offs and finals, with the champions having the chance to join the US league, which has a top prize in each division of $1m.\n\"The very best will compete,\" says Murray, envisioning a \"Champions League of MMA\" across six regional leagues worldwide by 2026. \"Francis has paved the way.\n\"Other athletes all over the continent who are competing professionally will now have a proper league to develop and a professional organisation to support their journeys.\n\"We will give them that path to become global champions - and everything that comes with that.\"\n\"Ngannou signing with the PFL gave me hope for the sport,\" says Mlambo.\n\"For how hard you work to get good at the sport, you have to put in so much - and what you get back most of the time just isn't enough.\n\"I've been in the sport for so long and I've done so much and achieved so much, but the financial side of it doesn't show that.\n\"PFL Africa is just an absolutely fantastic idea.\n\"What the PFL are doing alongside Ngannou and the movement in Africa is showing that they are willing to change that, which is the right thing to do.\n\"This will impact every professional MMA fighter globally. It is exactly what needs to happen in the sport.\"", "url": "https://www.bbc.com/sport/africa/66268586"}