{"authors": ["James Shield", "www.facebook.com"], "date_download": "2025-05-21 05:53:26", "date_modify": "2025-05-21 05:53:26", "date_publish": "2025-04-02 08:18:09", "description": "Alfie Middlemiss was following in his father's footsteps in acting before becoming a professional boxer.", "filename": "sport_boxing_articles_cwye8013dzeo_1747806806.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c9ff/live/ac8088e0-0b1c-11f0-88df-cbea984e02db.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_boxing_articles_cwye8013dzeo_1747806806.html", "title": "Boxing: Alfie Middlemiss swaps acting career for the boxing ring", "title_page": "Boxing: Alfie Middlemiss swaps acting career for the boxing ring - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The son of a former soap star and successful actor himself, Alfie Middlemiss is used to the drama and theatrics surrounding major boxing events.\nIndeed, the 21-year-old believes the skills he developed in showbusiness will prove invaluable moving forward after deciding to abandon his burgeoning screen career and pursue one as a fighter instead.\n\"I definitely think they're transferable and should come in handy,\" says Middlemiss, whose father Phil played Des Barnes in Coronation Street throughout the 1990s.\n\"There are things I've learnt in that field that I can already see are going to be useful now.\n\"They can help me sell a bout and, when I get a little bit further down the line, they'll also help me in front of the television cameras.\n\"A lot of people can freeze when they're all pointed at them. I get it because it's completely out of their comfort zone.\n\"But I'm used to having that spotlight on me so it's nothing out of the ordinary.\"\nFrom Manchester, Middlemiss appeared destined to establish himself as a major face on UK television before suddenly deciding to follow a totally different path.\nWith a showreel including credits on Emmerdale and Waterloo Road, his decision shocked many within drama circles. But not, it transpires, those closest to him given his competitive streak.\n\"Acting can be tough but it's a damn sight easier than boxing,\" Middlemiss laughs.\n\"My family and friends know how competitive I am and my dad has always loved boxing so I don't think they fell off their chairs when they found out what I wanted to do.\n\"OK, they were probably a bit surprised. But not stunned or speechless, I don't think, because of how I am.\n\"There are more relaxing ways to make a living but there's something about boxing which immediately grabbed me. I think it's the pressure you have to put yourself under because, in the ring, it's just you and the other guy so you can't rely on anyone else.\n\"You have to show focus and have a drive to keep improving. You can never let up.\n\"From the first moment I walked into a gym it just appealed to me. Maybe because, in my eyes, it's the ultimate and purest test you can ever experience.\"\nMiddlesmiss, who starred alongside Sally Lindsay and Robin Asquith in the Madame Blanc Mysteries, was actually a promising cricketer before deciding to don the gloves.\nBut long fielding days put Middlesmiss off the sport, breaking his dad's heart who loved attending the lengthy matches.\n\"It's the polar opposite to boxing,\" Middlesmiss says. \"I just fell out of love with it in the end. It was a gradual decline.\"", "url": "https://www.bbc.com/sport/boxing/articles/cwye8013dzeo"}