{"authors": ["David Michael", "www.facebook.com"], "date_download": "2025-04-26 04:13:21", "date_modify": "2025-04-26 04:13:21", "date_publish": "2025-03-04 11:42:27", "description": "Aston Villa news: Opinion - Fan writer on prioritising the cups over the Premier League", "filename": "sport_football_articles_crrd7pp22dxo_1745640801.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6747/live/de989c40-f02e-11ef-a319-fb4e7360c4ec.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_crrd7pp22dxo_1745640801.html", "title": "Aston Villa news: Opinion", "title_page": "Aston Villa news: Opinion - Fan writer on prioritising the cups over the Premier League - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Let's not kid ourselves any longer. Aston Villa are now fully focused on the cup competitions, which surely explains their recent stuttering league form.\nIn the club's 150th anniversary, there will be no better way to celebrate it than to lift silverware. If they do not, next season will mark a new significant anniversary - 30 years since their most recent significant trophy.\nFollowing their 2-0 win over Cardiff City that set up a quarter-final trip to Preston, the FA Cup is their most likely route. But at the moment, it feels only an appetiser as Villa set their sights on something much bigger over the next week - reaching the Champions League quarter-finals.\nMuch like recent favourable FA Cup draws, the last-16 draw was kind to Villa, handing them a tie against Club Brugge - the lowest-seeded team from the initial league stage, finishing 24th and only squeezing through on goal difference.\nThat said, Brugge have already proven their mettle by knocking out last season's Europa League winners Atalanta over two legs in the play-off round.\nBrugge's only defeat in their past 13 home European games was a 3-0 loss to Borussia Dortmund. And Villa, of course, have already tasted defeat at the Jan Breydel Stadium this season, losing 1-0 in the league phase. Unai Emery will hope Marco Asensio and Marcus Rashford can get more joy in the away leg than their new team-mates managed back in November.\nWith reinforcements incoming after the March international break - Pau Torres, Ross Barkley, Boubacar Kamara, and Amadou Onana - Villa should hopefully have a strong squad for a potential double quarter-final date.\nWhile some Villa fans will just be happy to be there, for Emery it could already offer his best chance of fulfilling his own trophy dreams with the club.", "url": "https://www.bbc.co.uk/sport/football/articles/crrd7pp22dxo"}