{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 08:06:42", "date_modify": "2025-04-26 08:06:42", "date_publish": "2025-02-26 14:25:31", "description": "Didier Drogba defends former manager Jose Mourinho and insists the Portuguese is \"not a racist\" after Galatasaray accused the Fenerbahce manager of making \"racist statements\" following the 0-0 draw on Monday between the rivals.", "filename": "sport_football_articles_c20dgj4d8z4o_1745654802.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3b95/live/a4a7e030-f449-11ef-837a-fdc1fd381948.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c20dgj4d8z4o_1745654802.html", "title": "Jose Mourinho: Didier Drogba defends former manager and insists the Portuguese is \"not a racist\"", "title_page": "Jose Mourinho: Didier Drogba defends former manager and insists the Portuguese is \"not a racist\" - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Didier Drogba has defended his former Chelsea manager Jose Mourinho, insisting the Portuguese is \"not a racist\".\nGalatasaray accused Fenerbahce manager Mourinho of making \"racist statements\" following the goalless draw between the Turkish Super Lig rivals on Monday.\nSpeaking after the Istanbul derby, Mourinho said the home bench had been \"jumping like monkeys\".\nBut Drogba, who scored 20 goals in 53 appearances for Galatasaray in the 2013-14 season, offered support of Mourinho, who was his boss during two spells at Chelsea.\n\"You know how proud I was to wear the yellow and red jersey and my love for the most decorated club in Turkey!!,\" the former Ivory Coast striker posted on X.\n\"We all know how passionate and heated rivalries can be, and I've been lucky enough to experience it.\n\"I've seen the recent comments about Jose Mourinho. Trust me when I tell you I have known Jose for 25 years and he is not a racist and history [past and recent] is there to prove it.\n\"How can my \"Dad\" be a racist. Come on guys.\"\nFormer Chelsea, Manchester United and Real Madrid manager Mourinho took charge of Fenerbahce in June 2024 after leaving Roma.\nBefore the Galatasaray encounter, he also repeated criticism of Turkish referees, saying it would have been a \"disaster\" to use an official from the country.\nSlovenian Slavko Vincic was the referee after both clubs requested a foreign official take charge of the fixture.\nSources close to Mourinho say he has been angered by the allegations and is assessing his legal options.\nThey say he has worked closely with scores of black players over the course of his career and does not feel any of them would believe him to hold any views of a racist nature.\n\"Jose Mourinho's systematic derogatory comments about the Turkish Super Lig, Turkish referees and the Turkish nation since his employment in Turkey are increasingly concerning,\" said Galatasaray board member Can Natan.\n\"His recent remarks following the derby match between Galatasaray and Fenerbahce, in which he stated that Galatasaray's bench was \"jumping like monkeys\", are not only insulting but also illustrate a troubling pattern that crosses the borders of racist behavior.\n\"For someone in Mourinho's position, it is essential to promote respect rather than resort to disparaging comments that foster division. Such behaviour is unacceptable and demands serious reflection on the impact of his words. Influential figures in football should lead by example and contribute positively to the sport.\"\nFenerbahce said the comments had been taken \"completely out of context\".\nMourinho has been highly critical about the level of refereeing in the Turkish Super Lig. In November, the 62-year-old said he would not have taken the Fenerbahce job if he had known the standards of officiating and was subsequently handed a one-match ban and fine of about £15,000.\nMourinho has yet to speak publicly on Galatasaray's statement.", "url": "https://www.bbc.co.uk/sport/football/articles/c20dgj4d8z4o"}