{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:21:51", "date_modify": "2025-05-20 14:21:51", "date_publish": "2023-07-28 17:29:14", "description": "Juventus are kicked out of this season's Europa Conference League and fined for breaching Financial Fair Play rules, Uefa has announced.", "filename": "sport_football_66342566_1747750911.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/69D9/production/_130579072_gettyimages-1489447703.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66342566_1747750911.html", "title": "Juventus are kicked out of Europa Conference League by Uefa for breaching FFP rules", "title_page": "Juventus are kicked out of Europa Conference League by Uefa for breaching FFP rules - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Juventus have been kicked out of this season's Europa Conference League by Uefa and fined for breaching Financial Fair Play (FFP) rules.\nEuropean football's governing body has also fined Chelsea for breaching FFP rules as a result of \"submitting incomplete financial information\".\nUefa says the matter relates to transactions which took place between 2012 and 2019.\nJuventus have been fined £17.14m, while Chelsea have been fined £8.57m.\nThe Italian club will only have to pay half of their fine if their financial records for the next three years comply with regulations, while Chelsea have already agreed to pay the settlement figure.\nThe Blues have spent around £600m on 19 new players since new owner Todd Boehly took charge of the club in May 2022, but their fine relates to a seven-year period while Roman Abramovich had control of the club.\nUefa said: \"Following the club's sale in May 2022, the new ownership identified, and proactively reported to Uefa, instances of potentially incomplete financial reporting under the club's previous ownership.\"\nIn a response, Chelsea said they \"fully co-operated and assisted Uefa\" in their investigations and \"entered into a settlement agreement\" with the governing body.\n\"In accordance with the club's ownership group's core principles of full compliance and transparency with its regulators, we are grateful that this case has been concluded by proactive disclosure of information to Uefa and a settlement that fully resolves the reported matters,\" said the Premier League club, external.\nThe Italian Football Federation (FIGC) must now notify Uefa of which club will replace Juve in the third-tier European competition. It is likely to be Fiorentina, who were beaten by West Ham in last year's final, after they finished eighth in Serie A.\nThe case against Juventus follows a 718,000 euro (£620,000) fine as part of a settlement agreement with Italian football authorities over a case concerning payment of player salaries.\nJuventus had also been docked 10 Serie A points last season following a hearing into the club's past transfer dealings.\nThey were initially handed a 15-point penalty in January but Italy's highest sporting court overturned that decision in April and ordered the case to be re-examined.\nThey would have finished fourth and qualified for next season's Champions League had they not been sanctioned.\nIn response to the charge, Juventus said they accept Uefa's decision and will not be lodging an appeal.\nClub president Gianluca Ferrero said: \"We regret the decision of the Uefa. We do not share the interpretation that has been given of our defence, and we remain firmly convinced of the legitimacy of our actions and the validity of our arguments.\n\"However, we have decided not to appeal this judgment.\n\"Lodging an appeal, possibly to other levels of judgement, with uncertain outcomes and timing, would increase the uncertainty with respect to our eventual participation in the 2024/25 Uefa Champions League.\"", "url": "https://www.bbc.com/sport/football/66342566"}