{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:56:30", "date_modify": "2025-05-21 06:56:30", "date_publish": "2025-01-04 11:19:47", "description": "Southampton vs Brentford predictions: Chris Sutton on Premier League game", "filename": "sport_football_articles_c623em92510o_1747810590.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/69f5/live/8d509450-c9fa-11ef-9fd6-0be88a764111.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c623em92510o_1747810590.html", "title": "Southampton vs Brentford predictions: Chris Sutton on Premier League game", "title_page": "Southampton vs Brentford predictions: Chris Sutton on Premier League game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Chris Sutton is making predictions for all 380 Premier League games this season, against a variety of guests.\nFor week 20, he takes on The Zutons frontman Dave McCabe, who supports Liverpool.\nSutton's prediction: 1-2\nThis is a tough one to call because while Southampton are adrift at the bottom and absolutely desperate for points, Brentford are not in great form either.\nSaints' new boss Ivan Juric has been quite feisty since his appointment, and his side have only been narrowly beaten in both his games in charge.\nIt is noticeable how often Southampton like to lump it now under Juric, compared with their possession-based style of play under Russell Martin.\nHowever, while it is also clear they will put up a fight I don't see much changing for them results-wise.\nBrentford are a battle-hardened Premier League team, so a direct approach will not faze them, and they also have goals in their team.\nThe Bees are yet to win on the road this season and only picked up their first away point against Brighton last time out but, this time, I see them taking all three.\nMcCabe's prediction: 1-2\nBrentford all day.", "url": "https://www.bbc.com/sport/football/articles/c623em92510o"}