{"authors": ["Emma Smith", "www.facebook.com"], "date_download": "2025-04-26 06:46:36", "date_modify": "2025-04-26 06:46:36", "date_publish": "2025-03-01 13:18:37", "description": "Burnley players decline to shake hands with Preston striker Milutin Osmajic before their FA Cup fifth-round tie amid a racism row between the two clubs.", "filename": "sport_football_articles_cge1nxn5n5qo_1745649996.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7038/live/65fe8760-f69e-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cge1nxn5n5qo_1745649996.html", "title": "Milutin Osmajic: Burnley players refuse handshake with Preston striker amid racism row", "title_page": "Milutin Osmajic: Burnley players refuse handshake with Preston striker amid racism row - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Burnley players declined to shake hands with Preston striker Milutin Osmajic before their FA Cup fifth-round tie amid a racism row between the two clubs.\nOsmajic was accused of racially abusing Burnley midfielder Hannibal Mejbri when the Lancashire rivals met in the Championship on 15 February.\nMontenegro forward Osmajic, who \"strongly refuted\" the allegations, was named in Preston's starting XI for the tie on Saturday lunchtime, while Hannibal was left out of the Burnley squad entirely.\nDuring the pre-match handshakes at Deepdale, none of the Burnley players offered their hands to Osmajic, who was last in the line of Preston players filing along the Clarets XI.\nAfter attempting to shake hands with a couple of Burnley players, Osmajic then walked along the rest of the line without interacting with the opposition.\nBurnley manager Scott Parker said after the game that the decision not to shake hands with Osmajic was the players' idea, but he was fully supportive of it.\nOsmajic scored during the first half to put Preston two goals ahead in their eventual 3-0 victory, and celebrated by taunting the away fans with his hands cupped around his ears before being embraced by his team-mates.\nBefore the game, Parker confirmed Hannibal was fit but he had chosen to leave out the Tunisia midfielder to protect him from the spotlight.\nParker told BBC iPlayer before kick-off: \"As I said earlier in the week in the press conference, fundamentally I need to protect Hannibal and making sure of the right decision.\n\"It has been a tough decision and we come here a bit weakened today because Hannibal is a vitally important member of this squad, and I felt it was the best decision for Hannibal.\n\"I wouldn't want to put him in a situation here, so we have made the decision for the best for Hannibal. That is why he is not in the matchday squad.\"\nAsked whether the decision was made after speaking with Hannibal, Parker said: \"It was mainly my decision. Hannibal was selectable today but he is a young boy that experienced something here only a few weeks ago and I just made that decision to keep him out of here and we have another game on Tuesday.\"\nHannibal was the target of chants from the Preston supporters during the game at Deepdale, with Parker describing them as \"sad\" and illustrative of why he had not picked the player.\nThe Football Association (FA) is currently investigating the incident between Osmajic and Hannibal. If found guilty, Osmajic faces a minimum ban of six games.\nParker said of the investigation: \"It probably is taking a bit of time. It is a serious allegation with a lot of investigating that needs to go on.\"\nPreston manager Paul Heckingbottom said he had picked Osmajic after talks with the player.\n\"If he wouldn't have been up for it [he would have been left out],\" Heckingbottom said after the game.\n\"He was fine - he wanted to be involved. We discussed possible things that could happen.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cge1nxn5n5qo"}