{"authors": ["Joe Bradshaw", "www.facebook.com"], "date_download": "2025-05-21 05:46:06", "date_modify": "2025-05-21 05:46:06", "date_publish": "2025-04-02 13:32:55", "description": "Man Utd news: What to do with Alejandro Garnacho? Have your say", "filename": "sport_football_articles_czx4r824kz2o_1747806366.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ebd5/live/5ba79e80-0fbe-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_czx4r824kz2o_1747806366.html", "title": "Man Utd news: What to do with Alejandro Garnacho? Have your say", "title_page": "Man Utd news: What to do with Alejandro Garnacho? Have your say - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Watching Anthony Elanga blitz through Manchester United's defence to score the decisive goal for Nottingham Forest on Tuesday was tough for the visitors' fans.\nThe forward rarely showed such dynamism when wearing a United shirt, but his speed, close control and devastating finish stood out on a night of low quality in front of goal.\nAt the opposite end of the pitch, United's (in theory) most effective dribbler, Alejandro Garnacho, cut a frustrated figure throughout.\nAnd that is not a new story for the 20-year-old.\nLinked with a move to Chelsea in January, it has been a difficult season for Garnacho, and questions about his suitability for Ruben Amorim's tactical set-up are increasing.\nThe stats do not offer mitigation either.\nThis season, in the Premier League, he has averaged 1.4 chances created per game, ranking him 72nd out of all players who have played 900 or more minutes.\nPerhaps most damningly of all, his dribble success rate - for players attempting more than 50 - is just 30.8%, which places him rock bottom in 58th place.\nIn fairness to Garnacho, he does get plenty of shots off in a game, averaging three and a half per 90 minutes, but that merely makes his shot conversion rate worse – his figure of 5.9% ranking him down the list once again (71st out of 80).\nEven when comparing with Garnacho's own numbers, the figures make disappointing reading.\nHe is still digging out the same number of shots as in 2023-24, with an average of 3.5 a game - but in other metrics, he is down.\nLast year, he created 1.6 chances per game. That is only a small decrease on this season's 1.4, but that was over more games than he has played in 2024-25.\nAnd then there's the dribble success rate.\nLast season's 42.8% was nothing sensational, but it was middle of the road for similar players as opposed to rock bottom.\nIt suggests a forward who heads down blind alleys with the ball at his feet, usually losing possession and offering little product.\nAmorim said on Tuesday that Garnacho is \"sometimes trying too much\" and \"sometimes doesn't make the best choice\".\nPerhaps that is understandable for a young player finding his way in the game, but his on-pitch demeanour can perhaps make it hard to warm to him.\nBeing outshone by Elanga, who is the latest ex-United player to thrive away from Old Trafford, surely only makes it rankle more for supporters.\nWhat United choose to do with another academy product who is not delivering on his potential could be a common theme over a tricky-looking summer.\nShould Amorim do more to get the best out of Garnacho or is it on the player to improve? Is he even the right fit for United?\nTell us what the future holds", "url": "https://www.bbc.com/sport/football/articles/czx4r824kz2o"}