{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:34:45", "date_modify": "2025-05-21 04:34:45", "date_publish": "2025-04-04 18:45:44", "description": "Northamptonshire collapse to 118-7 in response to Kent's 231 all out as wickets tumble on day one at Wantage Road.", "filename": "sport_cricket_articles_cx2929r58l1o_1747802085.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f1cb/live/d0997ac0-1184-11f0-9a9e-afe4b53e7e1b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cx2929r58l1o_1747802085.html", "title": "County Championship: 17 wickets fall in opening day between Northants and Kent", "title_page": "County Championship: 17 wickets fall in opening day between Northants and Kent - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tawanda Muyeye struck a sparkling 72 on an opening day marked by batting collapses as Kent were bowled out for 231 in their County Championship match against Northamptonshire at Wantage Road.\nMuyeye hit nine boundaries as Kent dominated either side of lunch in a fourth wicket stand with Jack Leaning (40) worth 104.\nBut young Northamptonshire paceman Raphy Weatherall set off a procession of Kent wickets, snaring three in three overs, during an impressive spell which accounted for Muyeye and Leaning as Kent lost five for 33 in 9.5 overs.\nGrant Stewart and Jas Singh then took two wickets each as Kent turned the screws in a testing evening session as Northants closed the day on 118-7, trailing by 113.\nOnly Rob Keogh's battling unbeaten 53 held the innings together, offering some hope going into day two.\nEarlier left-arm quick Liam Guthrie struck twice in his opening spell in his first match in Northamptonshire colours, cleaning up England Test opener Zak Crawley for one in just the third over of the day.\nCrawley never looked comfortable against the Australian and fell playing a booming drive to an in-swinger which knocked two stumps out of the ground.\nKent kept the scoreboard ticking before skipper Daniel Bell-Drummond was caught behind pushing outside off-stump to give Guthrie his second scalp.\nJustin Broad then accounted for Ben Compton with a full one which nipped back and knocked over off-stump.\nKent though started to find their groove, helped by some wayward bowling with Leaning taking three boundaries off one over from Leech while Muyeye brought up a fluent half century off just 60 balls.\nAfter lunch Northamptonshire temporarily put the brake on scoring with Guthrie almost picking up Muyeye on 57, but James Sales could not hold on at first slip.\nRuns started flowing again though as the Kent pair brought up their 100-stand, before Weatherall's triple breakthrough. Finding plenty of bounce and movement, the 20-year-old showed off the extra yard of pace he added during the winter.\nFirst Leaning played down the wrong line and was caught behind. In his next over Weatherall speared one back in to send Muyeye's off-stump cartwheeling.\nIn between Joey Evison also fell to a needless run-out thanks to a relay effort between Procter and Broad with a direct hit.\nWith the first ball of his next over, Weatherall hit the top off Stewart's off-stump. He almost picked up Keith Dudgeon later in the over but Broad shelled an easy chance at third slip. The Kent collapse continued when Leech had Harry Finch caught in the slips.\nDudgeon (26) and Singh staged a late fightback, adding 34 for the ninth wicket before left-arm spinner Saif Zaib nipped in to claim the final two wickets in two balls although Northamptonshire were left to rue the 38 runs they conceded in extras.", "url": "https://www.bbc.com/sport/cricket/articles/cx2929r58l1o"}