{"authors": ["Andrew Benson", "www.facebook.com"], "date_download": "2025-05-20 14:05:35", "date_modify": "2025-05-20 14:05:35", "date_publish": "2023-07-30 19:38:22", "description": "Max Verstappen is toying with Formula 1 at the moment as he canters towards a third straight drivers' title, writes Andrew Benson.", "filename": "sport_formula1_66356525_1747749935.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1066/production/_130589140_hi086578298.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_formula1_66356525_1747749935.html", "title": "Belgian Grand Prix: 'Cheeky' Max Verstappen toys with rivals as third world title looms large", "title_page": "Belgian Grand Prix: 'Cheeky' Max Verstappen toys with rivals as third world title looms large - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Max Verstappen is toying with Formula 1 at the moment.\nThe Dutchman won the Belgian Grand Prix for Red Bull at a canter from sixth on the grid while barely appearing to extend himself.\nWhen he wanted to overtake Sergio Perez for the lead, he lapped two seconds faster than his Red Bull team-mate at will.\nOnce out front Verstappen spent the rest of the race engaging in light-hearted badinage with his race engineer Gianpiero Lambiase as they bickered about how hard he should push.\nVerstappen was so at ease once in the lead that he was able to joke with his team. After being asked by Lambiase to take it easier on his final set of tyres, due to Red Bull's concerns about their durability, his response was to suggest he push even harder, extend an even bigger gap and take another set to give the team some pit stop practice.\nNot that they need it, given Red Bull consistently have the fastest pit stops.\n\"He has all reason to be a bit cheeky,\" said Toto Wolff, boss of the Mercedes team that two years ago were going toe-to-toe with Verstappen for the title, but now appear helpless and lost in trying to understand just why Red Bull's advantage is so big.\n\"[He's] just driving around. On merit. Nothing else to say. As much as it's annoying.\"\nMercedes driver Lewis Hamilton had another way of putting it. \"He is having a smoke and a pancake,\" Hamilton said, referencing the old Austin Powers quote about Dutch people and marijuana.\nThough Verstappen's searing pace may have given the impression that he ignored Lambiase's demands to back off, especially once he crossed the line 22.3 seconds ahead of the only man in the same car, that was not the reality.\nVerstappen, Lambiase said after the race, \"did listen\". It just didn't look like it, so great was his superiority.\nVerstappen took a dominant pole position won by more than 0.8 seconds, but was demoted five places by a grid penalty for using too many gearbox parts.\nIt took him just over 16 of the 44 laps to reach the front of the field. \"I'm surprised it took him so long,\" Red Bull team principal Christian Horner said.\nHorner quickly qualified that he was joking, but you know what they say about many a true word. His remark actually reflected the belief throughout the F1 paddock - before the grand prix started many were debating how many laps it would take Verstappen to get into the lead.\nMost people's answers were in single figures - some of them very small ones.\nThe reason it took as long as it did was that for a few laps he became stuck in a 'DRS train' behind Ferrari's Charles Leclerc and Hamilton's Mercedes.\nHamilton was within range of Leclerc and could use his DRS overtaking aid for a straight-line speed boost. And this meant that even though Verstappen was close enough to use his, the advantage was neutralised, partly because Hamilton's car was running trimmed out and was the fastest on the main straight in Belgium.\n\"Once Charles broke Lewis's DRS, I could pass and then get Lewis,\" Verstappen said, \"but I hurt my tyres too much. Once I got the new mediums on I could do my pace.\"\nPerez has been on a long run of shaky races, but before qualifying on Friday Horner gave him a warning - another example of jokes and truth.\n\"I told him that I wasn't going to talk to him if he wasn't in the top five,\" Horner said. \"And I'd squeeze part of his anatomy [too]. It seemed to do the job.\"\nPerez did indeed finally produce the sort of performance Red Bull expect of him every weekend. But that did not make it any less of a dispiriting weekend for the Mexican.\nPerez qualified 0.877 seconds behind Verstappen on Friday for the grand prix, was 0.905secs off the pace in the sprint shooutout on Saturday, and Verstappen's superiority in the grand prix was awe-inspiring.\nPerez pitted first, as was his right as the leader. Verstappen came in a lap later, emerging two seconds behind.\nTaking it easy on his tyres so as not to overheat them, Verstappen was 1.1secs behind after his out lap. That became 0.3secs as they crossed the line next time around. Drafting Perez through Eau Rouge, he was through into the lead long before the end of the Kemmel straight, and pulled out 1.6secs in the remaining two-thirds of the lap.\nOn the lap he overtook Perez, Verstappen was two seconds faster than his team-mate. A couple of laps later, he was 1.5secs faster. He backed off, to the extent of now only pulling out over 0.5secs a lap.\nWhen, a few laps later, Lambiase warned him he was risking taking too much out of his tyres, he responded by setting the fastest lap - 2.3secs faster than Perez on the same tour.\nEven a heart-in-mouth moment when he almost lost the car at 180mph through Eau Rouge during light mid-race rain couldn't stop him.\n\"It is not the best place to go sideways,\" Verstappen said, \"but luckily nothing happened.\" It was at least, he admitted, stressful enough to elicit \"a swear word\" in the cockpit.\n\"What we are witnessing with Max at the moment,\" Horner said, \"is something you see once in a generation.\n\"Like all the great drivers, he has that extra capacity. And what we're seeing is his ability to read a tyre, read a race, extract absolutely everything out of it. It's great to see. He is just at the top of his form.\"\nThe superlatives are in danger of running out. This was Verstappen's 10th win in 12 races this year and his eighth in a row. If he wins his home grand prix at Zandvoort after the summer break on 27 August, he will equal Sebastian Vettel's all-time record of nine consecutive grand prix victories.\nWhen the main point of interest in a grand prix is a debate between the winner and his race engineer about how fast he should or should not be going, you know that the opposition are in trouble.\nIn Spa, it was Ferrari and Mercedes who were closest to Red Bull in the see-sawing battle behind the runaway leaders.\nLeclerc drove extremely well to keep Hamilton at arm's length, and to make at least one of the Red Bulls look as if it belongs to the same category as the other cars for much of the afternoon.\nBut this is a man who for the first half of last year was a title rival for Verstappen. Although third was a positive result for Ferrari in the context of their current position, Leclerc admitted the first half of the season \"didn't go well - we are very far from where we put our expectations\".\nMcLaren, the surprise package of the previous three races, had a difficult weekend. And Aston Martin, for whom Fernando Alonso scored six podiums in the first eight races, had their fourth consecutive weekend at the back end of the front-running teams, although the Spanish legend is still just hanging on ahead of Hamilton in third place in the championship.\nAs for Mercedes, they had an upgrade in Belgium as they continue to pursue the development direction pioneered by Red Bull in as much as they can within the limitations of their car's architecture. But the dreaded bouncing that afflicted them for much of last season was back.\nWolff said: \"[We are] following similar development routes but there is one car which was just faster - 1.5s per lap when he was pushing at the beginning of the stint.\n\"The main limiting factor was the bouncing. The car was bouncing on every straight. Even Blanchimont was a corner here - Lewis had to lift and it's easily flat normally.\n\"You're bouncing on the straight, you're overheating the tyres and the braking. It's a vicious circle. Frustrating to check out for the holidays like this.\"\nIt was a busy weekend off track, with the focus mainly on Alpine, a team who seem to be in something close to disarray at the moment.\nThey have had a difficult first part of the season, far from their own ambitions, and the senior management of Renault have clearly lost patience, with a series of changes being made in recent weeks.\nLaurent Rossi, appointed chief executive officer at the beginning of the Alpine project in 2021, has been removed. A switch of focus to \"special projects\" is the official line.\nA new vice-president of motorsports, Bruno Famin, was appointed a couple of weeks ago. And this weekend the team principal Otmar Szafnauer and sporting director Alan Permane have lost their jobs, to the widespread dismay of the paddock.\nPermane is a low-profile figure in public terms, but in F1 everyone knows him. He joined the 'Enstone team' in 1989, and it was in his early days there that he earned his nickname 'Bat', because of the long hours he worked.\nHe has been there ever since, through its various guises, starting as an engineer, rising through the ranks to effectively run the outfit on a day-to-day basis. He has won four world titles with them, two each with Michael Schumacher as Benetton and Fernando Alonso as Renault, but also stuck with them through the difficult, financially-stricken Lotus era of the early 2010s.\nPermane has been central to the rule-making process for many years and is particularly close with Steve Nielsen, formerly a colleague, and now sporting director at the FIA, as well as Red Bull sporting director Jonathan Wheatley, and Mercedes technical director James Allison.\nThat someone of this credibility should be rewarded for this loyalty and commitment with the treatment he received from Renault management at the weekend caused general disbelief.\nAlain Prost, who won his fourth world title in a Renault-powered Williams and was non-executive director for Renault in F1 before an acrimonious split a couple of years ago, made his feelings clear in a scathing interview with France's L'Equipe newspaper, accusing Renault of fundamentally misunderstanding how to achieve success in F1.\nPermane himself spent the weekend receiving gestures of support from pretty much everyone in the paddock.\n\"It's incredibly sad,\" he said. \"It all happened very suddenly. I felt huge support from the whole team and the paddock, from team principals down. It's been amazing.\"\nOn Friday, Horner paid tribute to Permane in the news conference, somewhat uncomfortably for Famin, who was sitting nearby. And on Sunday, while \"not really wanting to be drawn into commenting on other teams\", the boss of the team now pulverising the competition in F1 made his feelings clear again.\n\"They have obviously had their own decisions and reasons for making their changes,\" Horner said.\n\"While I have never worked with Alan Permane, sometimes there has to be respect shown for somebody that has put in 34 years of hard graft and been involved in world championships with Michael Schumacher and Fernando Alonso.\n\"He has also been a steady hand during periods of that team going virtually into administration, out of administration and into different ownership and so on.\n\"He has been a constant there during that period. That earns respect and recognition, and I'm sure he's a guy - as with Otmar - it won't be the last you'll see of him in the pit lane, I have no doubt about that.\"", "url": "https://www.bbc.com/sport/formula1/66356525"}