{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:54:45", "date_modify": "2025-05-21 04:54:45", "date_publish": "2025-01-23 12:00:34", "description": "Swansea City complete the loan signing of Burnley centre-back Hannes Delcroix.", "filename": "sport_football_articles_c8d91zzp457o_1747803285.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d199/live/e1158ee0-da50-11ef-9101-0340529baaeb.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c8d91zzp457o_1747803285.html", "title": "Football transfers: Swansea City sign Burnley defender Hannes Delcroix on loan", "title_page": "Football transfers: Swansea City sign Burnley defender Hannes Delcroix on loan  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Swansea City have completed the loan signing of Burnley centre-back Hannes Delcroix.\nThe one-cap Belgium international arrived in Wales on Thursday and is available for Saturday's trip to Norwich City.\n\"We're delighted to have an additional option in defence with Hannes joining us,\" said Swans boss Williams.\n\"His versatility and experience will be invaluable to us. He has played in the top-flight and at international level, and we're hopeful he will make an immediate impact on our squad.\"\nDelcroix, 25, provides Swansea head coach Luke Williams with a welcome option at the heart of the defence for the remainder of the 2024-25 season.\nHe made 15 appearances for Burnley as they were relegated from the Premier League in 2023-24, but is yet to play this season thanks in part to injury.\nAfter returning to fitness, he was on the bench for Burnley's FA Cup win at Reading earlier this month.\nDelcroix, who can also play at left-back, signed a three-year deal at Burnley after joining from Anderlecht in 2023.\nThe move saw him reunite with then Clarets boss Vincent Kompany, who he had played for at the Belgian club.\nBorn in Haiti and raised in Belgium, he came through the ranks at Anderlecht and represented his country at various age grades before making his solitary senior appearance for the Red Devils under Roberto Martinez in 2020.\nHe will provide competition for Ben Cabango and Harry Darling at Swansea, and may go straight into Williams' side at Norwich City this Saturday with Darling facing a three-match ban following his sending off against Sheffield United in midweek.\nSwansea appealed against Darling's dismissal, for a challenge on Rhian Brewster, but the red card was not overturned, meaning the central defender will miss the matches against Norwich, Coventry City and Bristol City.\nDelcroix's arrival will boost a Swansea squad which has lacked depth in various positions throughout the season.\nNelson Abbey provided central defensive back-up in the first half of the campaign, but his loan spell from Olympiakos was cut short at the start of January after the former Reading player managed only one Swansea appearance.", "url": "https://www.bbc.com/sport/football/articles/c8d91zzp457o"}