{"authors": ["Ged Scott and Owen Taylor", "www.facebook.com"], "date_download": "2025-04-26 07:55:37", "date_modify": "2025-04-26 07:55:37", "date_publish": "2025-02-25 12:47:34", "description": "Shrewsbury Town's trip to Peterborough on Saturday starts a 'do or die' four-game run for the League One relegation battlers.", "filename": "sport_football_articles_cx29pwrdx18o_1745654137.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0b34/live/e93464f0-f36b-11ef-a30e-87a8a95b0cd7.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cx29pwrdx18o_1745654137.html", "title": "Shrewsbury Town: Peterborough game kicks off key four-game test", "title_page": "Shrewsbury Town: Peterborough game kicks off key four-game test - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "League One relegation battlers Shrewsbury Town's fate this season could be determined over the next four 'do or die' games - all against fellow strugglers.\nAfter climbing to 21st place, within three points of safety, Gareth Ainsworth's side have had their confidence knocked by three successive home defeats in the space of eight days.\nLosing to Bolton Wanderers (3-2), Huddersfield Town (1-0) and on Saturday against Stevenage (1-0) has dropped Ainsworth's men back to 23rd, seven points behind 20th-placed Peterborough United, who they now visit on Saturday.\nBut the meeting with Darren Ferguson's Posh marks the start of four successive matches all against teams currently just above them - as they must also host Bristol Rovers (19th) and Burton Albion (21st) either side of a trip to 18th-placed Exeter.\n\"It's coming down to that time now where it's do or die really,\" said former Town defender Elliott Bennett, who now works as a match summariser for Radio Shropshire after retiring at the end of last season.\n\"The next four games are quite favourable in the fixture list, if you look at the teams around Shrewsbury in the league.\"\nShrewsbury are League One's longest survivors and looking to secure third-tier football for an 11th straight season, after winning promotion under Micky Mellon in 2015.\n\"After getting seven points from three games, everything was looking really positive,\" said Bennett. \"I wasn't expecting it to then be three defeats on the bounce, particularly with them being home games.\n\"You're just hoping that can change again and swing back around. I think there'll be lots of twists and turns before the end of the season.\n\"If Peterborough win and it's made a 10-point gap, it goes back to that realm of where it was when he first came in.\n\"If they get off to a bad start on Saturday, then it makes it even more difficult. But I know Gareth Ainsworth will be really positive - because that's the way he is.\"\nOne player whose immediate future remains under the microscope is on-loan Chelsea midfielder Leo Castledine, who has missed seven games with a reported back injury.\n\"I'm hoping to get Leo back at some stage,\" Ainsworth told BBC Radio Shropshire. \"Chelsea will be looking at him, and they'll be working really closely with our medical team.\n\"There's been reports in the paper about his back. It's maybe a little bit naughty without actual medical people releasing what is the problem with Leo.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cx29pwrdx18o"}