{"authors": ["Grant Young", "www.facebook.com"], "date_download": "2025-05-21 05:21:52", "date_modify": "2025-05-21 05:21:52", "date_publish": "2025-01-14 14:10:38", "description": "Warriors fan column: 'Video game rugby from Glasgow against Racing'", "filename": "sport_articles_cq5g2pyyxdqo_1747804912.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/90e0/live/380bbba0-d27e-11ef-94cb-5f844ceb9e30.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cq5g2pyyxdqo_1747804912.html", "title": "Warriors fan column: 'Video game rugby from Glasgow against Racing'", "title_page": "Warriors fan column: 'Video game rugby from Glasgow against Racing' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Another milestone ticked off by this history-making squad as the result, and others across the weekend, confirmed Glasgow would have a home time in the Champions Cup round of 16.\nWhen you look at the calibre of teams in the competition, that's a pretty big step forward Warriors have taken from recent seasons.\nFranco Smith set out his team confident of a result and my golly, did Glasgow come out in the first half.\nIt was video game rugby the way the ball was zipping round. Confidence was oozing and it seemed Warriors would cross the line every time they attacked.\nFrom the second minute, when George Horne - now European leading try scorer for the Warriors crossed the line, the floodgates were firmly open. Glasgow tore the Parisians to shreds.\nGlasgow were running away with it when a bulldozing Sione Tuipulotu - who has had nearly every word in the dictionary used to describe how incredibly he has performed this season - sliced cleanly through to touch down try number four.\nFor 60 minutes Glasgow were brilliant, Rory Darge scored a fifth early in the second half to cap a brilliant ¾ of the game.\nBut, if there's one question mark over Glasgow, it's their inability to dominate for the full 80 minutes. They have a tendency to slightly step off the gas.\nRacing came into the game and for the first time, showed a little tempo themselves. A cynical, almost tired, hand in the ruck meant Matt Fagerson missed the final 10 minutes with an avoidable yellow. This galvanised the French side, who within four minutes of being a man up, had scored two tries. The defence looked tired in the end but held together as Glasgow ran out 10 point victors.\nThe midfield duo of Huwipulotu continue to cause every team issues.\nOnce deemed unimpactful as a defender, Huw Jones is incredible. Both he and Tuipulotu are the ticking heartbeat to the defence and it is no wonder that both are being spoken of for Lions inclusion.", "url": "https://www.bbc.com/sport/articles/cq5g2pyyxdqo"}