{"authors": ["Tyrone Smith", "www.facebook.com"], "date_download": "2025-05-21 07:28:46", "date_modify": "2025-05-21 07:28:46", "date_publish": "2025-01-13 15:17:16", "description": "'We don't like it, we're in a situation we shouldn't be in' - Baningime", "filename": "sport_articles_cr7envxdmz2o_1747812526.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3ead/live/70689490-d1c1-11ef-9f8b-6138f0924d77.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cr7envxdmz2o_1747812526.html", "title": "'We don't like it, we're in a situation we shouldn't be in' - Baningime", "title_page": "'We don't like it, we're in a situation we shouldn't be in' - Baningime - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Beni Baningime is confident Hearts will \"definitely be able to get out of this hole they don't like being in\" as the Gorgie club remain eleventh in the Scottish Premiership after their draw with Aberdeen.\nThe midfielder stressed the players have got themselves into this position, but there are \"no excuses\" with European football now out of their schedule.\nHe believes Hearts are showing they are \"solid\" after extending their unbeaten run to four games.\n\"I think we have been solid recently and that is the emphasis the manager has really given,\" Baningime told BBC Scotland.\n\"We have to be hard to beat as a team and the identity is if someone is going to score, they are going to have to score a worldie. We can't be conceding sloppy and silly goals.\n\"I think from now on it's one game a week – it is always hard with Europe, but even with that we shouldn't be where we are. I think we have enough talent in that changing room to be better and I think we will be better.\n\"But with fewer games, the gaffer can have a lot of time with us to instill what he wants, whereas maybe before it was like, you're playing Sunday, you're playing Thursday, you didn't have that time, but now I think there are no excuses and I think we will definitely be able to turn it round.\"\nIn their last two games, Hearts have drawn with fourth-placed Aberdeen and defeated third-place Dundee United, which the midfielder hopes can breed confidence and a better mentality.\n\"There are a lot of games left and we need to get ourselves out of this,\" he stressed.\n\"We are nine points away from St Johnstone, it's not a nice feeling to be second bottom.\n\"We don't like it, I know the fans don't like it so ultimately we can't be looking up too much, without understanding the reality of where we are. We are in a situation that we shouldn't be in or I don't believe that we should be in and taking it one game at a time will be the best thing.\n\"We have beat Dundee United who are third at times we were the better team today, away at the team who are fourth so why shouldn't we have that mentality?\n\"With that mentality, get out of this situation, get out of this hole that you have placed yourself in and hopefully your ability will show.\"", "url": "https://www.bbc.com/sport/articles/cr7envxdmz2o"}