{"authors": ["Kheredine Idessane", "www.facebook.com"], "date_download": "2025-04-26 07:48:58", "date_modify": "2025-04-26 07:48:58", "date_publish": "2025-02-26 22:55:21", "description": "Dundee United v Hibs: Analysis", "filename": "sport_articles_cdjydvne0xvo_1745653738.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/fc72/live/74884700-f494-11ef-839b-6909acee4532.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cdjydvne0xvo_1745653738.html", "title": "Dundee United v Hibs: Analysis", "title_page": "Dundee United v Hibs: Analysis - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Before the match, United manager Jim Goodwin said a point would not be a disaster, as it would have taken his side third on goal difference while maintaining momentum following the weekend win over Motherwell.\nThe fact his side were so close will frustrate him - as will some of the refereeing by David Dickinson and his team.\nThere was widespread confusion as to why Dalby's effort was ruled out, with an initial offside check aborted due to an inability for VAR Matthew MacDermid to draw the lines due to the number of players blocking the view.\nWhen guidance filtered through that it was for handball, it made things clearer but the replays did not scream a clear and obvious infringement.\nMoreover, before Bowie's winner, United were insistent they should have had a corner. Hibs were awarded a goal kick, and a minute later they scored.\nOverall, though this was still a pretty good showing from United, who were applauded off by a home crowd who didn't see those late Hibs goals coming.\nUnited looked particularly threatening from the wide areas, in which Will Ferry and Ryan Strain excelled, hitting double figures for crosses between them.\nThere' is still plenty to play for in United's season, with a top-six finish - and potentially better - very much in their own hands.", "url": "https://www.bbc.co.uk/sport/articles/cdjydvne0xvo"}