{"authors": ["Tasnim Chowdhury", "www.facebook.com"], "date_download": "2025-05-21 07:59:48", "date_modify": "2025-05-21 07:59:48", "date_publish": "2025-01-03 15:49:33", "description": "Unai Emery press conference: Aston Villa vs Leicester City", "filename": "sport_football_articles_cdx90k4gdgzo_1747814388.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6296/live/dbade4a0-4907-11ef-b74c-bb483a802c97.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cdx90k4gdgzo_1747814388.html", "title": "Unai Emery press conference: Aston Villa vs Leicester City", "title_page": "Unai Emery press conference: Aston Villa vs Leicester City - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Emery spoke about those who are unable to play: \"Not Jhon Duran because he is suspended [and] not Pau Torres because he has a broken metatarsal and he is going to be out for more or less two months. Diego Carlos is also not ready - he has a small injury. Not Morgan Rogers because he is suspended with five yellow cards. The other players are in the squad and available.\"\nOn the future of Jaden Philogene who has been linked with a move to Ipswich: \"He has the potential and he didn't show his potential in the first six months with us. He played some important matches, like against Bayern Munich and Manchester United. I am not wanting him to leave but we are speaking about the different options and maybe there could be one for him. He's not available for the match tomorrow.\"\nOn their achievements in 2024: \"We achieved our best objective that we can dream to be in the Champions League . Now, we are starting the new year, focusing on the match against Leicester, and starting the second part of the season at home.\"\nOn his plans for the transfer window: \"The club is trying to increase our level. If someone has to leave, we are open to it. The most important thing to me is the match tomorrow. I am not going to speak a lot about the transfer window.\"\nOn the possibilities for Villa in 2025: \"Our challenge is to always try to improve, to increase our demands and our standards in everything. Champions League will be fantastic. Hopefully we can keep improving and being consistent.\"\nOn Leicester City head coach Ruud van Nistelrooy: \"As a player, he was fantastic. I admired him a lot - as a coach as well. I had a small conversation with him when he was here with Manchester United at Villa Park. Hopefully he can show his potential as a coach like he did as a player.\"", "url": "https://www.bbc.com/sport/football/articles/cdx90k4gdgzo"}