{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:46:28", "date_modify": "2025-05-20 11:46:28", "date_publish": "2023-08-07 12:11:20", "description": "Veteran lock Brodie Retallick is named in New Zealand's 33-man World Cup squad, despite suffering a knee injury against Australia.", "filename": "sport_rugby-union_66429263_1747741588.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7A91/production/_130677313_gettyimages-1544931188.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-union_66429263_1747741588.html", "title": "New Zealand World Cup squad: Brodie Retallick in All Blacks squad despite injury", "title_page": "New Zealand World Cup squad: Brodie Retallick in All Blacks squad despite injury - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Veteran lock Brodie Retallick has been named in New Zealand's 33-man squad for the Rugby World Cup, despite suffering a knee injury against Australia.\nRetallick, 32, went off in the dramatic 23-20 win on Saturday and is set to miss the World Cup opener against hosts France on 8 September.\nProp Joe Moody, who is also injured, is the notable absentee from the squad.\n\"I will miss maybe two games, three at worst, so just have to follow the plan,\" Retallick said.\nAll Blacks head coach Ian Foster said it would be \"around six weeks\" before the 103-cap lock can play again.\nRetallick, who is going to his third World Cup, hopes to be fit for New Zealand's second pool game against Namibia on 15 September.\n\"It's a little bit sore but I am going on the timeline the doctors have said and hopefully I will be available for the second pool game,\" he said.\nMoody, 34, a starter at the 2015 and 2019 World Cups, has not played since May because of an ankle injury.\n\"We've got a lot of faith in him, he's a special player and has done a lot for the black jersey and hopefully there will be an opportunity later for him,\" said Foster.\nFlanker Sam Cane will captain the side as the All Blacks bid to win the World Cup for a record fourth time.", "url": "https://www.bbc.com/sport/rugby-union/66429263"}