{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:58:13", "date_modify": "2025-04-26 07:58:13", "date_publish": "2025-02-25 11:48:04", "description": "Is former skipper Barry Ferguson the right choice to revive Rangers?", "filename": "sport_articles_cn9v3gwvq91o_1745654293.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f132/live/8603aca0-f36c-11ef-a30e-87a8a95b0cd7.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cn9v3gwvq91o_1745654293.html", "title": "Is former skipper Barry Ferguson the right choice to revive Rangers?", "title_page": "Is former skipper Barry Ferguson the right choice to revive Rangers? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Rangers legend Barry Ferguson is back at Ibrox – but is he the right man to revive the club in the remainder of a torrid season?\nFerguson, along with fellow former players Neil McCann, Billy Dodds and Allan McGregor as well as Issame Charai, who assisted the sacked Philippe Clement, has taken interim charge until summer.\nA hero as a player and skipper in a career that yielded 15 trophies with Rangers, Ferguson has never coached above League One level and has been out of work for three years since an unsuccessful spell with Alloa Athletic.\nHowever, former Rangers defender Maurice Ross believes Ferguson, 47, can be a \"lightning rod\" and drive standards at a club languishing 13 points behind Premiership leaders Celtic but with a Europa League last-16 tie against Fenerbahce looming.\nSpeaking on the BBC's Scottish football podcast, Ross said of his former team-mate's appointment: \"It will give a bit of excitement, a bit of energy back into the building again.\n\"And it's something I did notice when I've been back at the club for the last three, four months. There was a lack of Rangers people in the building. There was a lot of suits.\n\"When you look at the appointment in isolation, Barry's going to be the kind of lightning rod, similar to the way that Steven Gerrard was.\n\"I also know Neil McCann is a very capable coach. It feels like they're going back to the people that were in the building when Rangers were successful. And that comes with behaviours, attitudes, certain standard setting.\"\nJordan Campbell, football reporter for The Athletic, says putting Ferguson in charge can be viewed as an \"easy win\" by the under-pressure Rangers board to appease fans, but notes the risk involved.\n\"It's an easy win in the sense it gets the fans on board again,\" said Campbell. \"But I was surprised in terms of you look at the CV … he's never coached at this level.\n\"When you speak to people behind the scenes, since Gerrard left, there's been a lack of authority at the club. You think of the amount of turnover there's been, with chief executives, sporting directors, they've not even replaced some of them.\n\"I think Ferguson coming in gives that authority. So I think for a short-term sort of culture shock it could be effective, but also you look at the experience of them coaching wise and it is a risk because let's not pretend that being a good footballer makes a good manager.\"", "url": "https://www.bbc.co.uk/sport/articles/cn9v3gwvq91o"}