{"authors": ["Ian Woodcock", "www.facebook.com"], "date_download": "2025-05-20 12:12:12", "date_modify": "2025-05-20 12:12:12", "date_publish": "2023-08-04 19:00:19", "description": "Southampton make the perfect start to life back in the EFL thanks to Che Adams' late winner at promoted Sheffield Wednesday.", "filename": "sport_football_66333585_1747743132.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/C75C/production/_130663015_shutterstock_editorial_14032674bv.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66333585_1747743132.html", "title": "Sheffield Wednesday 1-2 Southampton: Che Adams scores winner as Saints start with win", "title_page": "Sheffield Wednesday 1-2 Southampton: Che Adams scores winner as Saints start with win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Relegated Southampton made the perfect start to life back in the English Football League thanks to substitute Che Adams' late winner at promoted Sheffield Wednesday.\nThe visitors took an early lead when Nathan Tella cut in from the right and unleashed a fine left-footed shot from the edge of the area, that took the smallest of flicks off the back of team-mate Adam Armstrong's head on its way past Owls goalkeeper Cameron Dawson.\nThe home side, who had been utterly outplayed in the first half, levelled after the break when Lee Gregory smashed home after a corner was headed back across goal.\nIt looked set to fizzle out to a draw before Saints skipper James Ward-Prowse, making his first league appearance below the top flight, cut the ball back for Scotland striker Adams to convert from close range and give Russell Martin a win in his first league game in charge.\nUnusually, for two teams who changed leagues and managers in the summer, there was just one new signing in each starting XI, as both managers stuck with players who had been contracted to the club last season.\nSouthampton, playing in the Championship for the first time since 2012, were on the front foot from the start and took a deserved early lead when Tella's effort, which was surely goal-bound, brushed a ducking Armstrong's head on its way in.\nFor all their dominance Saints struggled to find a second goal and a Jack Stephens effort from a corner, hacked off the line by Callum Paterson, was as close as they came.\nWednesday, under Xisco Munoz for the first time after Darren Moore left the club in the summer despite leading them to promotion from League One, made a much better start to the second half and Gregory kept his cool to equalise.\nIt was perhaps fitting that England international Ward-Prowse, who has been linked with a move to West Ham and seems unlikely to spend a season in the second tier, was at the heart of the winning goal. His penetrating run into the home area was not tracked and his pullback left ex-Sheffield United man Adams with a simple tap-in.\nThe south-coast team had ended last season on a run of 13 games without victory, but they stood firm through nine minutes of time added on to claim a first opening-day win in a decade.\nOn this evidence, there should be many more wins this season than last.\nSheffield Wednesday boss Xisco Munoz:\n\"I think the team understand what we want, we were very close.\n\"The reaction of the players in the second half was good. This is the best performance of the six games we have had.\n\"It is four weeks together, some players arrived yesterday.\n\"We need to follow this attitude. We know the opponent we had, they are very dangerous, you close your eyes two times and they hurt you.\n\"We were very close today. We need to improve.\"\nSouthampton boss Russell Martin:\n\"The hardest decision for the team was to decide which striker we played, I think we can get both on the pitch as well.\n\"They both got a goal and the way Che reacted to not playing was amazing - brilliant energy and so respectful.\n\"There was a lot of noise around him, we turned down a bid for him a couple of weeks ago and nothing has happened since.\n\"The way he dealt with that is amazing. He got a nice reception getting off the bus from Sheffield Wednesday fans, so for him to score I am delighted.\"", "url": "https://www.bbc.com/sport/football/66333585"}