{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:00:14", "date_modify": "2025-04-26 07:00:14", "date_publish": "2025-03-02 00:00:00", "description": "Dele Alli is named in a matchday squad for the first time in two years with Roma narrowly beating 10-man Como.", "filename": "sport_football_live_c39v17rj1edt_1745650814.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2fa4/live/f0d80a20-f796-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_c39v17rj1edt_1745650814.html", "title": "Roma 2-1 Como: Dele Alli named on bench for first time in two years", "title_page": "Roma 2-1 Como: Dele Alli named on bench for first time in two years - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Dele Alli was named in a matchday squad for the first time in two years as Roma narrowly beat 10-man Como.\nThe 28-year-old's last appearance came in February 2023 for Turkish side Besiktas in a goalless draw with Antalyaspor.\nAfter spending a month training with Serie A side Como, who are managed by Spain World Cup winner Cesc Fabregas, Dele signed an initial 18-month contract in January 2025.\nHe has been without a club since June when he left Everton, but he carried on training under then-manager Sean Dyche before joining Como on trial.\nIn an emotional interview with Gary Neville in July 2023, Dele revealed he was sexually abused at six years old and dealing drugs aged eight. He also admitted drinking alcohol and taking sleeping pills during his career, but emphasised his desire to return to playing after receiving support for his off-field problems.\nFabregas' side took a shock lead at the Stadio Olimpico when Lucas de Cunha finished a minute before half-time.\nBelgium international Alexis Saelemaekers fired Roma level in the 61st minute - two minutes before Como were reduced to 10 men after Marc-Oliver Kempf was sent off for a second bookable offence.\nArtem Dovbyk sealed the win for Claudio Ranieri's side in the 76th minute to send them up to eighth and six points adrift of fourth-placed Juventus.\nComo, however, remain 13th - six points clear of the relegation zone.", "url": "https://www.bbc.co.uk/sport/football/live/c39v17rj1edt"}