{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:38:38", "date_modify": "2025-05-20 14:38:38", "date_publish": "2023-07-28 12:45:28", "description": "Jersey end their 2024 T20 World Cup Europe Region Qualifier campaign with a 28-run win over Denmark.", "filename": "sport_cricket_66293657_1747751918.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2163/production/_130574580_t20qual_aus-v-jer_20072023_022.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66293657_1747751918.html", "title": "T20 World Cup Qualifier: Jersey beat Denmark by 28 runs to end tournament on a high", "title_page": "T20 World Cup Qualifier: Jersey beat Denmark by 28 runs to end tournament on a high - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jersey ended the 2024 T20 World Cup Europe Region Qualifier with an 28-run win over Denmark.\nNick Greenwood and Charlie Brennan both hit 43 as Jersey made 159 all out.\nBut Jersey's last five wickets fell for 17 runs as Denmark's Nicolaj Damgaard got a hat-trick while Hamid Mazhar Shah took two wickets in two balls.\nIn reply the Danes could only muster 131-7 as Rhys Palmer took 2-21 while fellow spinner Elliot Miles returned figures of 2-26.\nThe win means Jersey finish fourth in the tournament in Scotland as they failed to progress past the final qualifying round for a T20 World Cup for the fourth time.\nDespite winning their opening game against Austria, Jersey found it tough at times in Scotland.\nA 15-run loss to the hosts was followed by a frustrating 25-run defeat by Italy before being thrashed by nine wickets by Ireland on Monday.\nDespite a 51-run win over Germany on Tuesday Jersey's hopes of making the World Cup were ended as favourites Ireland and Scotland both won their first four games.\nAgainst Denmark, Jersey reached 142-5 in the 16th over as Brennan got his highest score of the tournament while Greenwood kept up his impressive form with a sixth score above 30 in seven games.\nBut once Brennan was caught by Taranjit Singh off Shah the floodgates opened. Shah caught and bowled debutant Patrick Gouge with his very next ball and almost trapped Julius Sumeraur lbw for a hat-trick.\nSumerauer went on to make four runs before becoming the first of Damgaard's three victims in three balls as he was caught by Musa Shaeen Mahmood before skipper Charles Perchard was bowled for a duck and Miles was caught by Singh to send the Danes into wild celebrations.\nZak Tribe was caught for 10 off the final ball of the innings to leave Jersey on 159 all out as Damgaard ended with figures of 3-23 while Shah was one of three Danes to take two wickets.\nIn reply Denmark slumped to 12-2 off 2.1 overs as Damgaard was bowled by Sumerauer for one while Miles took skipper Shah's wicket for a three-ball duck.\nBut Singh and Saif Ali Ahmed came together and put on 75 for the third wicket before Ahmed was trapped lbw by Miles for 46 off 36 balls.\nMiles caught Singh off Rhys Palmer's bowling for 45 to leave the Danes on 102-4 with 32 balls to go.\nDenmark went on to lose two more wickets to run outs, while Palmer took a second scalp, as they tried in vain to reach their target.", "url": "https://www.bbc.com/sport/cricket/66293657"}