{"authors": ["George O'Neill", "www.facebook.com"], "date_download": "2025-05-20 11:54:00", "date_modify": "2025-05-20 11:54:00", "date_publish": "2023-08-05 18:21:24", "description": "Scotland head coach Gregor Townsend hails Scotland's fighting qualities after they come from 18 points behind to beat France in their second World Cup warm-up.", "filename": "sport_rugby-union_66418597_1747742040.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/11090/production/_130667796_20811020.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-union_66418597_1747742040.html", "title": "Gregor Townsend says Scotland were 'smart and courageous' in France win", "title_page": "Gregor Townsend says Scotland were 'smart and courageous' in France win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Scotland head coach Gregor Townsend hailed Scotland's fighting qualities after they came from 18 points behind to beat France in their second World Cup warm-up.\nScotland were 21-3 behind at half-time, but roared back to win 25-21 at Murrayfield.\n\"A really big test for us,\" Townsend said. \"The opposition, the scoreline, one man down, you have to be smart and courageous to get through that, and the players were today.\n\"To be put under so much pressure with a team that's 18 points up and then you go a man down, to show the resilience, the learning of how to win, and that steel to keep them out at the end is great. Really encouraging.\"\nScotland looked like a different side after the break, but Townsend said the message to his players at half-time was fairly straightforward.\n\"We had some good moments in the first half, but we weren't strong enough in the contact area. That had to be the first thing we improved, and we were defensively outstanding in the second half. To concede zero points and a lot of that with a man down.\n\"The attack just grew - the players have been doing so well [on that front] in training.\n\"The stats all point to teams that are up at half-time tend to win, so if you're well down at half-time it's going to be tough, but we have a team that can score points very quickly, can put you under pressure. I was pleased with the fitness, and with the bench today. They brought more energy than their opposite numbers and had big plays.\"\nScotland lost first-choice scrum-half Ben White to an ankle injury in the first half, and will also be sweating over the outcome of a disciplinary hearing for Zander Fagerson, who was sent off after he made contact with Pierre Bourgarit's head, but Townsend remains optimistic that both players could be available for Scotland's World Cup opener against South Africa.\n\"Ben White was carrying an injury coming into the camp, but has trained fully. It is the same ankle so we cross our fingers that there's nothing serious,\" he said.\n\"Zander came in to clear contact in a fast nature and you have to do that when teams are jackling, but there was head contact. I hope they see it as a rugby incident, but we'll have to wait and see.\"", "url": "https://www.bbc.com/sport/rugby-union/66418597"}