{"authors": ["Nicola Pearson", "www.facebook.com"], "date_download": "2025-04-26 07:36:05", "date_modify": "2025-04-26 07:36:05", "date_publish": "2025-02-27 14:51:55", "description": "Newcastle news: Analysis on Bruno Guimaraes", "filename": "sport_football_articles_cx299j8ypwzo_1745652965.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ac60/live/a61575b0-f514-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cx299j8ypwzo_1745652965.html", "title": "Newcastle news: Analysis on Bruno Guimaraes", "title_page": "Newcastle news: Analysis on Bruno Guimaraes - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "\"He's been awful lately.\"\nThat was former Newcastle defender John Anderson's withering view of captain Bruno Guimaraes after the 2-0 defeat by Liverpool on Wednesday made it just three points from a possible 12 in February.\nIt is stark contrast to the form of December and January that began with a scintillating 3-3 draw against the same opponents and also included six consecutive wins.\nWhether the reason for or a consequence of, Newcastle's form over the winter period has mirrored that of Guimaraes.\nThe 27-year-old has started every Premier League game so far this season, and hit a purple patch in the 10 matches from the beginning of December through to the end of January, scoring two goals and making five assists, resulting in a goal contributions per 90 minutes of 0.7.\nHowever, across six games in all competitions in February, the Brazil midfielder failed to register a goal or an assist.\nIt is not the only marker in which he has regressed.\nWhen comparing per 90 minutes, Guimaraes' chances created has nosedived from 2.5 to just 0.3, while his touches in the opposition box has more than halved from 3.3 to 1.3.\nWith his total shots per 90 dropping from 1.4 to 0.8 and overall xG falling to just 0.16 from 1.5, it is clear to see his effectiveness in front of goal has declined.\nBut what about the other areas of the midfielder's game?\nBoss Eddie Howe naturally wants his midfielders to provide the link between attack and defence, protecting and progressing the ball effectively.\nUnfortunately, Guimaraes' passes per 90 have slumped from 51 to 38, and his efficiency has also dropped from 84.3% to 81.6%. Small increments for sure but when added together there has been a downturn in his displays.\nAnd when it comes to the more defensive side of the game, the number of tackles Guimaraes is putting in per 90 has lessened from 2.4 to 1.6. Indeed, the only metric where he has increased is the amount of fouls - from 1.27 per game to 1.6!\nIf Newcastle are to stay in contention for Champions League qualification, and stand a chance of winning their first major silverware since 1955 when they head to Wembley on 16 March, they will need their captain to rediscover his form.\n*all stats provided by Opta", "url": "https://www.bbc.co.uk/sport/football/articles/cx299j8ypwzo"}