{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:24:11", "date_modify": "2025-05-19 15:24:11", "date_publish": "2017-07-04 06:27:27", "description": "Scott Brown pledges himself to Celtic and Scotland, but question marks are raised about the futures of Moussa Dembele and Stuart Armstrong.", "filename": "sport_football_40490822_1747668251.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/CE71/production/_96794825_13685674.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_40490822_1747668251.html", "title": "Scottish Gossip: Celtic, Rangers, Southampton, Kilmarnock, Arsenal, Chelsea, West Ham, West Brom, Brighton, Dundee Utd, Motherwell", "title_page": "Scottish Gossip: Celtic, Rangers, Southampton, Kilmarnock, Arsenal, Chelsea, West Ham, West Brom, Brighton, Dundee Utd, Motherwell - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Celtic captain Scott Brown has pledged his long-term future to both his club and country by revealing he will sign a contract extension with the Scottish champions and will remain available for selection by Gordon Strachan's Scotland indefinitely. (The National), external\nStriker Moussa Dembele looks set to leave Celtic this summer, with Arsenal, Chelsea and West Ham United all interested, but manager Brendan Rodgers says the Scottish champions would not consider selling the 20-year-old until they have completed their Champions League qualification games. (Scottish Sun), external\nSouthampton, who have already paid hefty fees to sign Victor Wanyama, Fraser Forster and Virgil van Dijk from Celtic, are weighing up a move to make 25-year-old midfielder Stuart Armstrong their next £10m capture from the Scottish champions, but the Glasgow club would not consider any offer until after the Champions League qualifiers. (Daily Mail), external\nSouthampton are still keen on Celtic midfielder Stuart Armstrong, while Premier League rivals West Bromwich Albion and Brighton are also keeping tabs on the Scotland international. (Daily Record), external\nSouthampton have joined the fight to land 25-year-old midfielder Stuart Armstrong, who is out of contract with Celtic next summer and whose future is in the balance after so far refusing terms on a new contract. (Scottish Sun), external\nFormer Rangers defender Kirk Broadfoot's switch from Rotherham United to Kilmarnock is set to be completed this morning, with the 32-year-old surplus to requirements at the Millers following their relegation from the English Championship. (Daily Record), external\nPreston North End are ready to name Alex Neil, sacked last season by Championship rivals Norwich City, as their new manager after a top level meeting with chairman Peter Ridsdale. (The Sun), external\nSwansea City face competition from a number of other clubs, including Rangers, Leicester City and Newcastle United, to sign Coventry City's 20-year-old midfielder, George Thomas.(Wales Online), external\nRangers manager Pedro Caixinha has insisted he had to ban his players from wearing boots in the green of city rivals Celtic to defend the Ibrox club's \"culture\". (Daily Record), external\nManager Pedro Caixinha has said it is \"unthinkable\" to contemplate his side crashing out of the Europa League tonight against Progres Niederkorn, the Luxembourg side that has never won a single match in European competition. (Evening Times), external\nRangers manager Pedro Caixinha has told his players to treat their second leg against Progres Niederkorn like the Europa League final. (The National), external\nSt Johnstone manager Tommy Wright is considering fielding Steven MacLean against Trakai in Thursday's Europa League second leg, despite the striker having not played on an artificial pitch for two years on medical advice to protect his knees. (Daily Express, print edition)\nBjorn Johnsen has not travelled to Ireland with Hearts for pre-season training as doubts over the American-born Norwegian's future continue, with Bolton Wanderers among clubs interested in the 25-year-old. (Daily Record, print edition)\nNew Dundee United arrival Patrick N'Koyi says he felt like he had been kidnapped by Sukhotai this summer after the Thai top-flight club paraded the 27-year-old Dutchman as a new signing after he arrived for what he thought was a fact-finding mission. (Daily Record), external", "url": "https://www.bbc.com/sport/football/40490822"}