{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:01:09", "date_modify": "2025-04-26 07:01:09", "date_publish": "2025-03-02 00:00:00", "description": "Follow live text commentary, score updates and match stats from Crystal Palace vs Liverpool in the Women's Super League", "filename": "sport_football_live_cgr2n4qgx9vt_1745650869.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2adc/live/9883a5d0-f77a-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_cgr2n4qgx9vt_1745650869.html", "title": "Women's Super League", "title_page": "Crystal Palace vs Liverpool: Women's Super League stats & head-to-head - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Crystal Palace's hopes of avoiding relegation from the Women's Super League were dented by Sunday's home defeat by Liverpool.\nJasmine Matthews' first-half strike was enough to give Amber Whiteley a winning start to her second stint as Liverpool interim manager, following Matt Beard's departure on Thursday.\nPalace, who are bottom of the table with just six points from 15 matches, also had a new face in the dugout in Leif Smerud, who replaced Laura Kaminski on Friday.\nLiverpool should have gone ahead after four minutes but Marie-Therese Hobinger could only head wide when left completely unmarked at the far post.\nMatthews made no such mistake six minutes later, as she rifled the ball past Shae Yanez in the Palace goal after the hosts failed to clear a corner.\nPalace waited until the stroke of half-time to threaten the visitors, with Rachael Laws producing a fine save with her legs to deny Abbie Larkin's rifled effort.\nCornelia Kapocs had a clear chance to double Liverpool's advantage shortly after the break, but could only fire over the crossbar on the stretch with the goal gaping.\nMy Cato saw her goal-bound effort blocked as Palace pushed for a leveller, before the Swedish midfielder almost turned into her own net while attempting to clear a ball across the face of goal.\nPalace continued to push with Cato forcing Laws into a smart double save, but were unable to end their wait for a second win in the WSL, and remain four points from safety at the bottom of the table.\nVictory moves Liverpool up to sixth with 18 points after 15 games, and will not have done Whiteley's hopes of being appointed manager on a permanent basis any harm.", "url": "https://www.bbc.co.uk/sport/football/live/cgr2n4qgx9vt"}