{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:56:04", "date_modify": "2025-05-20 13:56:04", "date_publish": "2023-07-31 10:59:48", "description": "Wales are outclassed 83-34 by defending champions New Zealand in their Pool G match at the Netball World Cup in Cape Town.", "filename": "sport_netball_66360372_1747749364.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7AC5/production/_130592413_gettyimages-1566028355.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_netball_66360372_1747749364.html", "title": "Netball World Cup 2023: Wales 34-83 New Zealand - Feathers lose to defending champions", "title_page": "Netball World Cup 2023: Wales 34-83 New Zealand - Feathers lose to defending champions - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wales were outclassed by defending champions New Zealand in their Pool G match at the Netball World Cup.\nThe Silver Ferns enjoyed a perfect scoring opening quarter to build a 19-8 lead in Cape Town.\nThey continued to assert their dominance as the Welsh Feathers looked static and struggled to live with the speed of ball.\nNew Zealand were 40-16 up at half-time, 65-22 by the end of the third quarter, with the match finishing 83-34.\nIt was a perfect start to stage two of the competition for the Ferns, who are ranked second in the world, seven places above Wales.\nThey had won their first three matches to progress as Pool winners, while Wales beat Sri Lanka to secure their place.\nIt was always going to be a tough ask for Wales, but Emily Handyside's team started well enough in the opening quarter, the difference being Ferns' accuracy in the shooting circle.\nThe intensity began to dip from the second as New Zealand dominated the turnovers.\nTo their credit, Wales finished with a flourish and reached doubles figures for the first time in the final quarter as Handyside gave the whole squad a run out.\nBoth Ferns and Feathers now have a day off before returning to action on Wednesday.\nWales take on Uganda, while New Zealand play the hosts South Africa.\nWales captain Nia Jones said: \"We knew today was probably a bit out of reach for us in terms of where we're at as a national team.\n\"There were structures that we put out today that worked and if they worked against these guys, we know that they will work against Uganda and Trinidad and Tobago, that's what we really need to look at and stick to it for a little bit longer.\n\"I think we lost a bit of our discipline, we know they off-mark, they have got a break zone and we fell into their traps a little bit too often today.\"\nWales squad: Nia Jones (capt), Bethan Dyke (vice-captain), Lucy Howells, Clare Jones, Nansi Kuti, Zoe Matthewman, Shona O'Dwyer, Ella Powell-Davies, Georgia Rowe, Christina Shaw, Sarie Watkins, Phillipa Yarranton.", "url": "https://www.bbc.com/sport/netball/66360372"}