{"authors": ["Andy Burke", "www.facebook.com"], "date_download": "2025-05-21 03:58:04", "date_modify": "2025-05-21 03:58:04", "date_publish": "2025-04-07 08:44:37", "description": "Glasgow 43-19 Leicester: Three things we learned", "filename": "sport_articles_cz95enxylgzo_1747799884.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e07f/live/35753bb0-138c-11f0-b751-af2aaed03a76.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cz95enxylgzo_1747799884.html", "title": "Glasgow 43-19 Leicester: Three things we learned", "title_page": "Glasgow 43-19 Leicester: Three things we learned - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Venter the man for the big occasion\nHenco Venter has been the bedrock of Glasgow Warriors' success in recent times.\nThe big number eight was immense against Leicester, his two tries merely the cherry on top of a phenomenal all round, man of the match display.\nSpeaking to the South African after the match, it was clear what a wrench it is for him to be leaving Glasgow at the end of the season to join Brive.\nHe wants to go out with a bang, speaking about winning both the URC and Champions Cup before he exits. His winner's mentality and leadership will be missed.\nVenter arrived as a journeyman whose signing was questioned by many. No matter how the remainder of his final season pans out, he will depart Scotstoun as a hero.\nVailanu brings the power\nSione Vailanu is a big weapon in the Glasgow back-row. The problem has been keeping him fit long enough to properly make his mark.\nHe showed against Leicester what he brings to the party. His ball-carrying was outstanding, blasting over the gain-line time and again to get Warriors on the front foot.\nThe Tongan's two tries either side of half-time were crucial in shaking off a Tigers side who were desperately trying to stay in the fight.\nWith Jack Dempsey facing a race against time to recover from injury to play any further part this season, Vailanu could have a big role to play in what could be an exciting finale to Warriors campaign.\nHastings getting back to his best\nAfter such a horrendous time with injuries, it's so good to see Adam Hastings healthy and starting to get back to something approaching top form.\nYou could see the Scotland fly-half growing in confidence as the game progressed, taking the ball a little flatter to the line each time and getting more zip into his passes.\nHis goalkicking was near flawless, nailing six from seven attempts, and the one he missed from out wide into the wind was desperately unlucky to drop just short.\nWith Tom Jordan departing at the end of the season for Bristol, Hastings is going to be a key player for Glasgow moving forward. It's encouraging to see him getting back to the level we know he can operate at.", "url": "https://www.bbc.com/sport/articles/cz95enxylgzo"}