{"authors": ["Andrew Benson", "www.facebook.com"], "date_download": "2025-05-21 05:01:08", "date_modify": "2025-05-21 05:01:08", "date_publish": "2025-04-04 10:42:54", "description": "A proposal to bring back V10 engines to Formula 1 is set to be rejected by the sport's engine manufacturers next week.", "filename": "sport_formula1_articles_cvgp79740mko_1747803668.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3099/live/8dba3810-0a23-11f0-9b80-0382e8b85b17.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_formula1_articles_cvgp79740mko_1747803668.html", "title": "Proposal to bring back V10 engines set to be rejected", "title_page": "F1: Proposal to bring back V10 engines set to be rejected - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A proposal to bring back V10 engines to Formula 1 is set to be rejected by the sport's engine manufacturers next week.\nMohammed Ben Sulayem, the president of governing body the FIA, has been championing a plan to reintroduce high-revving, big capacity naturally aspirated engines to F1.\nBen Sulayem has been pushing for the move to happen as early as 2028 or 2029 - despite F1 introducing a new engine formula next year that is scheduled to run until the end of 2030.\nBut under F1's governance system, the plan needs to be backed by four of the five engine manufacturers that will be in F1 next year, which are Mercedes, Ferrari, Honda, Audi and Red Bull Powertrains, which is backed by Ford.\nAudi had already indicated its support for the 2026 engine formula, which retains 1.6-litre turbo hybrid engines but increases the proportion of total power provided by the electrical part of the engine to about 50% from the current 20%. These will be run on fully sustainable fuels.\nHonda, which abandoned plans to quit F1 because of the new rules, has now indicated it also backs hybrid engines.\nKoji Watanabe, president of Honda Racing Corporation, told motorsport.com Japan: \"We know that the FIA intends to introduce naturally aspirated V10 engines from 2028. However, we have not received detailed information from the FIA. There will be meetings organised by the FIA, in which the engine manufacturers will participate, and we would like to discuss it there first.\n\"At the moment we don't have any details. We can't say whether V10s are acceptable or not in terms of efficiency. We would first like to understand the details of what is being proposed before we start a discussion.\n\"A meeting is planned, and at that meeting we want to express our point of view as engine manufacturers.\n\"As far as Honda is concerned, our reason for entering F1 again is electrification and (the type of) powertrains.\"\nMercedes is open to discussing the idea of a new engine formula but says it would need it to retain a hybrid element for the company to stay interested.\nThe opposition of Honda and Audi alone is enough to torpedo the plan. With Mercedes also against the idea of abandoning hybrids, it appears to have no chance of success, even though Red Bull and Ferrari are said to back the idea.\nThe manufacturers will meet with the FIA to discuss the future of engines at the Bahrain Grand Prix on 11 April.\nThe FIA hopes to secure a clear answer on the manufacturers' vision for the future.\nBen Sulayem had signalled that the introduction of sustainable fuels, which cut the carbon emissions from an internal combustion engine from between 80-100% depending on the way the fuel is manufactured, could open the door to the return of loud, high-revving engines.\nV10s became the default engine in F1 from the mid-1990s until 2005, after which the sport switched to V8s, and have a resonance with a certain section of the fan base.\nHowever, Mercedes F1 boss Toto Wolff is one of a number of senior figures who have questioned whether the changing fan demographic means that V10s are no longer as important.\nMany younger, female fans have become interested in F1 following the Covid pandemic and the success of Netflix's Drive to Survive series.\nWolff said: \"You need to be open-minded. We're all racers, we like the engines of the past, and then you need to strike the right balance between what is exciting to us dinosaurs, screaming loud engines, and then the fanbase, and the audiences that are on the track.\n\"And maybe that has migrated a little bit from pure petrolheads to younger demographics, to families that are coming on to the track that haven't even been part of those years.\n\"All of this needs to be set as questions, as what are the objectives for a future regulation change in a few years, and then let's analyse that based on data and come to a conclusion that is for the best of our sport.\n\"Because this is the single most important denominator between the FIA, Formula 1, the teams, that we want to have the greatest product for our fans.\"", "url": "https://www.bbc.com/sport/formula1/articles/cvgp79740mko"}