{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:42:50", "date_modify": "2025-05-20 14:42:50", "date_publish": "2023-07-25 08:17:02", "description": "Derbyshire sign former Pakistan fast bowler Mohammad Amir as an overseas player for the first half of next season.", "filename": "sport_cricket_66299091_1747752170.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/CC42/production/_130509225_shutterstock_editorial_12237639b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66299091_1747752170.html", "title": "Mohammad Amir: Derbyshire sign former Pakistan bowler for 2024 season", "title_page": "Mohammad Amir: Derbyshire sign former Pakistan bowler for 2024 season - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Derbyshire have signed former Pakistan fast bowler Mohammad Amir as an overseas player for the first half of next season.\nAmir will play in the first half of the County Championship campaign in 2024 and the T20 Blast group stages.\nThe 31-year-old will reunite with Derbyshire head of cricket and former Pakistan national coach Mickey Arthur.\n\"Mohammad is a world-renowned fast bowler and someone who I am delighted to bring to Derbyshire,\" said Arthur.\n\"I know all about his quality - he has been a big-game player throughout his career and that's something I've seen first-hand.\"\nAmir took 259 international wickets in 147 matches for Pakistan across all formats, including 119 Test dismissals, and was a key member of the side which won the 2017 ICC Champions Trophy under Arthur.\nHe retired from international cricket in 2020.\nThe paceman has County Championship experience with Essex as well as a shorter stay with Gloucestershire, and has also played in The Hundred for London Spirit.\nOverall, Amir has claimed 266 first-class wickets at an average of just 22.63, and 287 T20 scalps across the globe at 22.28.\n\"I've enjoyed my experiences of county cricket in the past and joining up with Mickey, who I've had so much success with internationally, is something I'm looking forward to,\" he said.\n\"The County Championship is so special and I've always enjoyed playing first-class cricket in England. I've spoken to Mickey about the quality in the squad and I want to put in the performances to help Derbyshire challenge in red and white-ball cricket next summer.\"", "url": "https://www.bbc.com/sport/cricket/66299091"}