{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:59:02", "date_modify": "2025-05-21 04:59:02", "date_publish": "2025-04-04 12:26:09", "description": "John Souttar puts his Rangers future on hold", "filename": "sport_articles_c8epw4453xno_1747803542.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3008/live/4e4a5bf0-114f-11f0-b9dd-2ba6af6e9a36.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c8epw4453xno_1747803542.html", "title": "Souttar puts his Rangers future on hold", "title_page": "John Souttar puts his Rangers future on hold  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "John Souttar says his Rangers future is \"on the back-burner\" as a summer of change looms at Ibrox.\nScotland defender Souttar, who joined Rangers from Hearts in 2022, is out of contract at the end of next season.\nRangers are in the midst of a takeover involving US-based 49ers Enterprises, the investment wing of the San Francisco 49ers NFL franchise, and there is also managerial uncertainty with Barry Ferguson in interim charge until the end of the season.\nIbrox CEO Patrick Stewart has stated his intention to prevent the loss of key players for free after Alfredo Morelos and Ryan Kent ran down their contracts in recent years.\nSouttar, speaking in the build-up to Saturday's visit of Hibs to Ibrox, said of his contract situation: \"To be honest, I've not spoken about that for a while.\n\"There has been loads of changes at the club so that situation has gone on the back-burner.\n\"I've not spoken to anyone about it for a while. I'm just concentrating on my football and let others deal with what they have to deal with. Hopefully it then gets resolved.\n\"There is so much going on at the club just now. I'm sure that when there is some stability that'll get sorted.\"\nDespite Rangers following up their derby win at Celtic with a 4-3 away victory over Dundee, Souttar admits they need to tighten up after falling 2-0 behind in five of their past seven matches, including four of six under Ferguson.\n\"A lot needs to improve from how we started the game against Dundee, conceding the goals we did,\" the 28-year-old added.\n\"Obviously it's good that we came back and scored the goals. But we shouldn't need to score four goals to win a game.\n\"It's something we've been looking at and something we need to improve. That's something we simply cannot allow to happen, whether we're at home or away. A lot of the mistakes were basic errors.\"", "url": "https://www.bbc.com/sport/articles/c8epw4453xno"}