{"authors": ["Nick Mashiter", "www.facebook.com"], "date_download": "2025-04-26 04:25:53", "date_modify": "2025-04-26 04:25:53", "date_publish": "2025-03-03 11:55:22", "description": null, "filename": "sport_football_articles_cvgpd34ev3xo_1745641553.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8799/live/b7c967d0-f81b-11ef-8dde-aff9d405c81c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cvgpd34ev3xo_1745641553.html", "title": "Crystal Palace 3-1 Millwall: Could keeper Liam Roberts face further punishment?", "title_page": "Crystal Palace 3-1 Millwall: Could keeper Liam Roberts face further punishment? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Millwall goalkeeper could face further punishment for his horror challenge on Jean-Philippe Mateta.\nCrystal Palace striker Mateta was taken to hospital after being kicked in the head by Roberts in the eighth minute of Palace's 3-1 FA Cup fifth-round win on Saturday.\nRoberts was sent off after a VAR review, with the footage showing he kicked the side of Mateta's head, having dashed from his line to clear the ball. Play was initially allowed to carry on by referee Michael Oliver.\nThe 27-year-old forward was treated on the pitch and given oxygen before being taken to an ambulance. He needed 25 stitches for a severe laceration to his left ear.\nThe Football Association could now look into the challenge if it deems the red card - with Roberts now suspended for three games - to be insufficient punishment.\nIf the FA thinks a dismissal offence is \"truly exceptional\", it can seek to increase the sanction by submitting a claim to a regulatory commission.\nThey have until 13:00 GMT on Tuesday to do this and submit evidence to the Lions, with the Championship side then having a further two days - until 18:00 on Thursday - to respond and provide any evidence supporting their case the red card was \"clearly sufficient\".\nThe regulatory commission would then hear the case and decide Roberts' new punishment if any FA claim is successful.\nMateta posted on social media on Saturday: \"I'm doing well. I hope to be back very soon and stronger than ever. Well done guys for the great job today.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cvgpd34ev3xo"}