{"authors": ["George O'Neill", "www.facebook.com"], "date_download": "2025-04-26 04:26:11", "date_modify": "2025-04-26 04:26:11", "date_publish": "2025-03-03 11:35:03", "description": "Munster 28-34 Edinburgh: Three things we learned", "filename": "sport_articles_cdrxg0013xvo_1745641571.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ecf2/live/9a9ed0c0-f792-11ef-ba30-7dc3acc49c5d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cdrxg0013xvo_1745641571.html", "title": "Munster 28-34 Edinburgh: Three things we learned", "title_page": "Munster 28-34 Edinburgh: Three things we learned - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Scrum dominance provides platform\nEdinburgh's surprise win in Cork was built on a magnificent display from their forward pack.\nLed by the excellent Boan Venter, Edinburgh won eight penalties at scrum time, providing both territory and momentum.\nThe visitors' physical dominance was particularly evident in the first half, and it provided the platform for Sean Everitt's side to run in four first-half tries and take a 22-point lead into the break.\nBen Muncaster and Magnus Bradbury were also impressive with ball in hand for Edinburgh, who needed a response after dismal defeats by Scarlets and Zebre.\nVersatile Currie shows his worth\nWith Emiliano Boffelli and Harry Paterson injured, and Darcy Graham and Duhan van der Merwe away with Scotland, Matt Currie has been shunted onto the wing from his usual centre berth.\nHe showed finishing instincts that any of Edinburgh's four absentees would have been proud of against Munster, scoring a magnificent hat-trick that proved decisive.\nHis first and third scores were opportunistic, born out of relentless running and a never-say-die attitude, while his second relied on strength as he held off several defenders to reach the line.\nCurrie's work-rate and attitude are a fine example as Edinburgh look to put their recent struggles behind them and make the play-offs.\nPlay-off hopes boosted\nSpeaking of their league hopes, the five-point victory took Edinburgh back into the URC's top eight and eased some of the pressure on Everitt and his players.\nThe challenge now for Edinburgh is to back up their first away win in 10 months with both performances and positive results against Benetton and Dragons.\nInconsistency has been Edinburgh's weakness again and again in recent years, and they cannot allow this win to be a one-off with six games of the regular league season remaining.", "url": "https://www.bbc.co.uk/sport/articles/cdrxg0013xvo"}