{"authors": ["Millie Sian", "www.facebook.com"], "date_download": "2025-05-21 05:00:31", "date_modify": "2025-05-21 05:00:31", "date_publish": "2025-04-04 11:09:08", "description": "Ange Postecoglou press conference: Tottenham vs Southampton", "filename": "sport_football_articles_czrv3v62nngo_1747803631.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f21e/live/f7d58710-6de1-11ef-8c32-f3c2bc7494c6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_czrv3v62nngo_1747803631.html", "title": "Ange Postecoglou press conference: Tottenham vs Southampton", "title_page": "Ange Postecoglou press conference: Tottenham vs Southampton - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "There hasn't been a lot of time to reflect on the 1-0 defeat to Chelsea on Thursday night but he intends to do that in training today.\nHe said that Tottenham have taken their \"fair share of blows this season\" but the aim is to \"dust themselves off\" and \"work on repeating a lot of what they showed\" against Chelsea last time out.\nHe said he doesn't \"get affected\" by any negativity or criticism he receives from the supporters, but \"it is a little bit unfair to target the players in this situation\".\nWhen asked about cupping his ear towards the Tottenham supporters after Pape Matar Sarr's disallowed goal, he responded: \"I made a mistake, I celebrated a goal. Since VAR came in, I've made a conscious effort to not really celebrate goals anymore because you have to wait for everything to get checked off.\"\nHe was keen to highlight that his response was to \"celebrate and get the fans to make some noise\" after the goal, adding: \"My mistake was celebrating a goal - VAR has defeated me - so I won't be doing that again.\"\nHis comment about feeling \"such a disconnect with the world\" was in relation to VAR: \"As human beings, we are just so accepting of everything. We accepted mobile phones into our lives and now we are trying to reel them back because of the damage they cause. It's too late - the horse is bolted - and it is the same with VAR in football, but we just let it roll on.\"\nMicky van de Ven \"cramped up\" last time out but there is no further injury concern: \"He hasn't played for 90 minutes for a while, but the positive thing is that he felt good apart from that. It was a tough game defensively, so he had to work hard.\"\nDane Scarlett was left out of the squad due to being \"a bit sore\" after coming back from a loan spell where he had not played much. He was given the weekend off but has been \"working really hard in training to get his conditioning up\".\nSouthampton's visit to Tottenham Hotspur Stadium will be an opportunity to \"build some momentum\" going into their Europa League quarter-final first leg against Eintracht Frankfurt on Thursday.\nThere will be a couple of changes and he will rotate his squad \"to a certain extent\", but the players are \"in a good place physically\" so he doesn't feel the need to manage their game time.", "url": "https://www.bbc.com/sport/football/articles/czrv3v62nngo"}