{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:38:53", "date_modify": "2025-05-19 15:38:53", "date_publish": "2017-07-11 17:05:54", "description": "Michael McKillop and Jason Smyth want to repeat their London 2012 triumphs at the World Para Athletics Championships.", "filename": "sport_athletics_40573224_1747669133.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/882B/production/_96495843_mckillopsmyth.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_athletics_40573224_1747669133.html", "title": "World Para-athletics Championships: McKillop and Smyth return to London", "title_page": "World Para-athletics Championships: McKillop and Smyth return to London - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ireland's Michael McKillop and Jason Smyth are determined to repeat their London 2012 heroics at the World Para Athletics Championships which begin in the Olympic Stadium on Friday.\nBoth Northern Irishmen will have the chance to match the two gold medals they won in London five years ago.\nIf all goes to plan, the friends could win 100m and 800m titles within 15 minutes of each other on Sunday night.\n\"Whenever we won at London 2012, the stadium turned green,\" says McKillop.\n\"It will be great to have that opportunity again for the island of Ireland. Fingers crossed, it will be another amazing night.\"\nHowever, while McKillop is bubbling with confidence after clocking his best 800m time in three years (1:58.25) at last week's Belfast International, the 27-year-old North Belfast Harrier, who has a mild form of cerebral palsy, is mindful that the standard in the T37 and T38 middle distance events is \"rising all the time\".\n\"I know Canada's Liam Stanley, who took the silver behind me in the T37 1500m final in Rio, is getting better all the time so it's not going to be easy.\n\"But I still want to win. There is no greater feeling that being on the podium, hearing your national anthem and looking at the people in the crowd clapping and celebrating what you have achieved. I love that.\"\nMcKillop has been beset by injury since 2012 and his annual stint on the treatment table this year was caused by a calf problem in January.\nHowever, \"unbelievable\" physio work by Kerry Kirk at the Sports Institute in Jordanstown got the Glengormley man back on the track much quicker than he expected.\nAn impressive 4:04 for 1500m at the Northern Ireland Championships in early June suggested McKillop was peaking at the right time and while he then clocked a disappointing 4:09 metric mile a couple of weeks later, his 800m time last Wednesday was a \"huge confidence booster\".\n\"I got back sooner than I normally would after such an injury. That's why you saw me run 1:58 for 800m last week and not 2:05.\n\"I feel back as an athlete and I'll be in a stadium in front of 60,000 people believing I can run my fastest,\" adds McKillop, who has not lost at paralympic level since 2006.\nHeading into London, Smyth, who dashed home from the last world championships in Doha two years ago for the birth of his daughter Evie, insists his motivation to win remains \"as strong as ever\".\n\"At the end of my career, I will want to be able to look back and think that I did everything possible to keep improving as as an athlete.\n\"I will want to leave my sport on a high rather than dwindling away,\" adds Smyth who intends to remain in competition until at least Tokyo 2020.\nWith the Mark Kirk-trained Ballyclare man James Hamilton representing the host nation at the London championships, McKillop will be the first of the Northern Ireland trio in action when he competes in the T38 800m heats on Friday evening (20:25 BST).", "url": "https://www.bbc.com/sport/athletics/40573224"}