{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:19:58", "date_modify": "2025-04-26 04:19:58", "date_publish": "2025-03-03 16:11:41", "description": "Ruben Selles wants visiting teams to feel \"uncomfortable\" playing Hull City at the MKM Stadium.", "filename": "sport_football_articles_c05m7yremdyo_1745641198.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c150/live/8c039200-f849-11ef-b5bf-275f2ed479cc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c05m7yremdyo_1745641198.html", "title": "Hull City: Ruben Selles wants visitors to feel 'uncomfortable' at MKM", "title_page": "Hull City: Ruben Selles wants visitors to feel 'uncomfortable' at MKM - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Ruben Selles wants Hull City fans to create an 'uncomfortable' atmosphere for visiting teams as the Tigers try to preserve their Championship status.\nFourth-bottom City welcome second-bottom Plymouth, three points behind, to the MKM Stadium on Tuesday (19:45 GMT) aiming to bounce back from a 1-0 defeat at fellow strugglers Cardiff seven days prior.\nArgyle remain winless on the road this season and have scored only six goals on their travels while Selles' side have failed to take three points in six home games in all competitions since beating Swansea on 21 December.\nSelles told BBC Radio Humberside, external \"everyone was hurt by the result\" against Cardiff but said: \"We are ready for tomorrow.\n\"They have been more solid and stable since the new coach (Miron Muslic) arrived.\n\"They'll come trying to get their first victory of the season away from home as we will try to get a victory in front of our fans, we have not done that in a couple of months.\n\"It would be good for us to get one and then move forward. We need a lot of support from our fans. We want people to create an environment where people feel really uncomfortable to come and play in our stadium.\"\nSelles said he hoped Aston Villa loanee Louie Barry might return from a knee injury before the end of the campaign after limping off at Sunderland on 22 February.\nSean McLoughlin is available after a back injury which forced him off against Cardiff while Kasey Palmer is likely to feature on the bench. Steven Alzate is also selectable though Matt Crooks suffered a facial injury in training and might miss out.\nBelgian midfielder Eliot Matazo will however be sidelined until next season with an ACL injury sustained against Cardiff which Selles said was \"very unfortunate\".\n\"He was potentially one of the best players on the pitch against Sunderland and Cardiff,\" Selles added. \"He was finding his football here with us, he was comfortable in playing the game in the style and the way we want.\n\"He'll be out for part of the beginning of next season. It's bad news for us.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c05m7yremdyo"}