{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:09:48", "date_modify": "2025-05-21 06:09:48", "date_publish": "2025-01-04 21:22:46", "description": "Ards manager John Bailie says he doesn't see the 2-1 win over Ballymena United in the Irish Cup as an upset.", "filename": "sport_articles_cj90kjly81lo_1747807788.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ec18/live/7851fe30-cadc-11ef-8fb6-23e7e434a3e9.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cj90kjly81lo_1747807788.html", "title": "'A brilliant day for the club' - Bailie on Ards victory", "title_page": "Irish Cup: 'A brilliant day for the club' - Bailie on Ards victory over Ballymena - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ards manager John Bailie says he doesn't see the 2-1 win over Ballymena United in the Irish Cup as an upset.\nGoals from Lee Newell and Aidan Steele gave the Championship side a 2-0 lead at the Showgrounds.\nEthan Devine pulled one back for the Premiership hosts but Ards held firm to earn a place in the sixth round.\n\"It's a brilliant day for the club - a difficult day, the pitch was difficult to play on,\" said Bailie.\n\"Any win in the Irish Cup is a massive day and we're really pleased to be in the sixth round.\n\"We haven't really saw it as an upset - that's not degrading Ballymena. We came here two months ago in the League Cup and lost 1-0. Truth be told we were unlucky to lose.\"\nArds, who sit seventh in the Championship, have been drawn away to Belfast Celtic or Moyola Park in the last 16.\n\"We've quite a few players missing and we've come here with our form in the league patchy but our performances have been very good - that's been frustrating for me as a manager.\n\"We've tried to drum into our players that against anyone we've quite a bit of quality in our squad.\n\"Ballymena threw the kitchen sink at us in the second half and I think we deserved our rewards today.\"", "url": "https://www.bbc.com/sport/articles/cj90kjly81lo"}