{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:41:25", "date_modify": "2025-05-20 11:41:25", "date_publish": "2023-08-06 17:35:55", "description": "Arsenal: Aaron Ramsdale and Declan Rice on Community Shield win", "filename": "sport_articles_c72eyd87pp8o_1747741285.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/275f/live/83c327c0-347f-11ee-be68-2728f4481360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c72eyd87pp8o_1747741285.html", "title": "Arsenal: Aaron Ramsdale and Declan Rice on Community Shield win", "title_page": "Arsenal: Aaron Ramsdale and Declan Rice on Community Shield win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Arsenal goalkeeper Aaron Ramsdale, speaking to ITV after the Gunners' win over Manchester City in the Community Shield: \"We worked hard on it. We've been working hard for two years. We haven't had luck which was probably needed in previous seasons. We've stuck at it. It's worked today.\"\nOn what this means for the season: \"I'm not sure. City are a bit behind their pre-season. For us, it's a statement. It's a marker to know we can go and beat Man City in a big game when it matters.\n\"I'm not sure what it'll be like this season. But that mental block is gone. We're ready to push on now.\"\nArsenal midfielder Declan Rice, speaking to ITV: \"I am buzzing, this is what I visioned when I joined.\n\"City gave us what we expected, but I am buzzing - so happy. You have to have the patience against them, you have to have mini games within the game against them like the manager said to us before.\n\"I feel I've grown a lot in the last three weeks. There's a lot of information to take in of what the manager wants. I'm eager to learn and keep improving.\n\"I'm sure we can achieve anything this season - we just need to remain focused.\"", "url": "https://www.bbc.com/sport/articles/c72eyd87pp8o"}