{"authors": ["Emma Sanders", "www.facebook.com"], "date_download": "2025-04-26 04:10:19", "date_modify": "2025-04-26 04:10:19", "date_publish": "2025-03-02 17:55:49", "description": "From playing in rented park spaces to becoming the world's most expensive. This is Naomi Girma's story from those who know her best.", "filename": "sport_football_articles_cd65jn94j60o_1745640619.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e0fa/live/6498b2c0-f783-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cd65jn94j60o_1745640619.html", "title": "Naomi Girma: Journey of the world's most expensive female player", "title_page": "Naomi Girma: Journey of the world's most expensive female player - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "It is not often a centre-back steals the show.\nBut when Naomi Girma made her Chelsea debut in their Women's Super League draw at Brighton, all eyes were on her.\nThe United States international became the world's most expensive women's transfer signing when Chelsea spent £900,000 to bring her in from San Diego Wave in January.\nShe was named in Sonia Bompastor's starting XI as they were given a stern test by Brighton but she showed glimpses of composure and quality before her introduction was cut short through injury on the hour mark.\nSo who is Girma, why was she in such high demand and what lies ahead for the future?\nGirma grew up in San Jose, California, to an Ethiopian-American family and played football in rented spaces in parks with friends.\nHer football experience began at the age of four, when her dad was a coach of local team Maleda Soccer Club, and she eventually joined Central Valley Crossfire five years later.\nShe has said, external she was often \"the only black girl on my team\", and praised the support of her fellow Ethiopian-Americans and family as her career developed, along with that of coach Bob Joyce.\nIt was at Central Valley Crossfire where she linked up with Joyce in an all-girls team, and played there from the age of nine to 17.\n\"She was a star track athlete in 400m at high school with good endurance and incredible speed,\" Joyce told BBC Sport after revealing Girma had taken part in a training session only because she followed a class-mate to the club.\n\"Most of the time she played for me as a central midfielder. I remember one coach coming up to me and saying 'oh my god, she was shredding us today'.\n\"With her left foot or right foot, it did not matter. She worked really hard on her weaker foot - the left. All of that contributed to her success.\"\nBy the time she was ready to join the National Women's Soccer League, Girma was well-known in the US from her time at Stanford University.\nFormer San Diego Wave manager Casey Stoney's first job at the club was the college draft and there was no doubt in her mind who her first pick should be.\n\"I remember watching so much footage [of Girma] and I was like 'we need to pick this centre-back as number one,'\" Stoney told BBC Sport.\n\"I had a few good battles internally because other people didn't want to pick her as number one and I was very strong because I saw so much talent and potential.\n\"I know a centre-back when I see one. I'm very big on how we build our foundations and I just felt she would give us so much.\"\nGirma's success at San Diego Wave was instant. She was named the NWSL's defender of the year and rookie of the year after her first season.\nShe then signed a new three-year deal, helped San Diego Wave win the NWSL Shield, and was named defender of the year again in 2024.\nOn the international stage, she was US Soccer's female player of the year in 2023 and played every minute as they won gold at the 2024 Olympic Games.\n\"When I first met Naomi she didn't - and still doesn't - know how good she is,\" said Stoney.\n\"We worked a lot individually with her on her footwork and her positioning. She's got so much ability to cover ground at speed and to read the game.\n\"She second-guessed herself a lot, and I was like 'no, just trust yourself, your judgement is good'.\nJoyce said Girma will \"cope well in England\" because of her temperament, which enables her to adapt to any situation.\n\"She is academically smart and reads the game so smartly. She is socially smart and good at reading how people are, how to fit in and how to succeed,\" he added.\nEight-time European champions Lyon made a bid for Girma before Chelsea broke the world-record transfer fee.\nShe had wanted a move to Europe \"almost a year ago\" according to current San Diego Wave head coach Jonas Eidevall.\nThe prospect of playing Champions League football, competing in the Women's Super League and living in London, which Girma once described as a \"dream trip\", were all factors in her move.\nStoney said she was \"not surprised\" Girma joined Chelsea, while USA boss Emma Hayes believes it is a good thing to see players moving to Europe.\n\"I want them to feel happy. Happy and well-developed players lead to success on the pitch,\" said Hayes, who managed Chelsea for 12 years before joining the USA.\n\"We will see even more US players dotted across the world, the game is growing and that is not a bad thing.\"\nBut Eidevall said a \"limiting factor\" for NWSL clubs was their ability to compete with salaries offered by European clubs.\n\"If the NWSL is to be the best league in the world, it's really important to have the best players in the world playing in the league,\" he told BBC Sport.\n\"Right now the reality is the league is not close to matching the salaries that those top players can get in the top European clubs.\n\"I don't believe in forcing any player to stay - I don't think we get the best out of people that way. It was a good solution between San Diego and Chelsea.\"\nAt first impression, Girma is warm and empathetic, with an infectious smile, as seen in her first interview with BBC Sport.\nShe is clearly popular among her team-mates and coaches alike.\n\"Anyone who ever coached her or played with her would say 'I love Naomi,'\" according to Joyce.\nStoney added: \"She is quietly confident, but humble. She just gets on with everybody. She is really likeable.\n\"She is never going to be the loudest in the room but she is really likeable and just a really nice person.\"\nGirma has a degree in symbolic systems and a master's degree in management science and engineering, adding to her intelligence on the pitch.\n\"She is a hard worker and willing to work hard,\" added Joyce. \"She has the right temperament and does not get too high or too low.\n\"Some talented people have psychological issues, but Naomi is very even-tempered. She is funny, very kind and a happy person. She does well in any environment.\"\nThe USA star has devoted time to championing mental health after losing best friend Katie Meyer to suicide in 2022.\nShe wrote a public letter to Meyer, external in 2023, dedicating her performances at the Women's World Cup to her and later becoming an ambassador for Kaiser Permanente, an American healthcare company.\n\"As a person and a leader, she is someone who is exceptionally humble, and whose natural ability to read the game and make decisions under pressure, is beyond her years,\" said USA boss Hayes.\n\"She is a great team-mate, great communicator and is growing in her development as a leader.\n\"She will have an unbelievable career at Chelsea and the fans will love her.\"\nDescribed as \"the best defender in the world\" by Hayes, Girma will have to adapt to the WSL quickly with the spotlight on her.\nChelsea are chasing a quadruple this season and there is hope her arrival will help them clinch an elusive European title.\nHoran, who won the Champions League with Lyon in 2022, said it is a \"challenge in itself\" to move to a league where there is a different style to the NWSL.\n\"That's one of the coolest learning experiences - different habits and different ways of playing and how they value the ball over there,\" said Horan.\n\"They have tough games. Every WSL game is very competitive nowadays so that will be so great for her.\n\"Getting to experience Champions League... I'm excited for her.\"\nAs well as thriving at club level, many expect Girma to one day take on the armband with the USA national team.\nHoran, the current USA captain, said she wants Girma \"to take on that role as seamlessly as possible when I'm gone\".\n\"It's a little bit easier when the girl plays well every single game,\" said Horan.\n\"She's one of the best players on the field and she brings that standard every single game. That's someone that people look to.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cd65jn94j60o"}