{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:57:38", "date_modify": "2025-05-21 04:57:38", "date_publish": "2025-04-04 00:00:00", "description": "Live text commentary of Greece versus Republic of Ireland, followed by live video coverage of Romania against Northern Ireland in the Women’s Nations League", "filename": "sport_football_live_cp8km15ylkdt_1747803458.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cp8km15ylkdt_1747803458.html", "title": "Women's Nations League - NI held by Romania as ROI beat Greece - as it happened", "title_page": "Women's Nations League - NI held by Romania as ROI beat Greece - as it happened - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Final whistle\nFT: Romania 1-1 Northern Ireland\nThat is all from us on a disappointing night for Northern Ireland, who are held to a draw in Bucharest.\nYou can read Andy Gray's report from the game here.\nIt was a better night for the Republic of Ireland, who beat Greece 4-0 in Crete.\nYou can read John Haughey's report from that game here.\nWe will be back on Tuesday as Northern Ireland face Romania at Windsor Park, whilst the Republic of Ireland welcome Greece to Tallaght Stadium.\nSee you then, but for now, goodnight!\nFULL-TIME\nRomania 1-1 Northern Ireland\nA frustrating game for Northern Ireland, who are held to a draw by Romania in Bucharest.\nDanielle Maxwell had opened the scoring, but Northern Ireland gifted Romania a leveller and Tanya Oxtoby's side struggled to break down the hosts in a quiet enough second half.\nRomania almost grabbed all three points with that late strike that rattled the crossbar, but a draw was a fair enough result.\nNorthern Ireland will want an improved display at Windsor Park on Tuesday when these two sides meet again.\nINJURY TIME\nRomania 1-1 Northern Ireland\nThere will be five minutes of additional time at the end of this game.\nI hope I am wrong, but I can't see either side getting a late winner as this game has started to peter out, although Simone Magill did deliver late on against Bosnia-Herzegovina for Northern Ireland last time out...", "url": "https://www.bbc.com/sport/football/live/cp8km15ylkdt"}