{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:39:17", "date_modify": "2025-05-20 14:39:17", "date_publish": "2023-07-29 00:00:00", "description": "Reaction and tributes to England legend Stuart Broad, who has announced his retirement.", "filename": "sport_live_cricket_64959414_1747751957.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/11A38/production/_130584227_broad.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_cricket_64959414_1747751957.html", "title": "The Ashes LIVE: England vs Australia, fifth Test day three, Kia Oval", "title_page": "The Ashes LIVE: England vs Australia, fifth Test day three, Kia Oval - score, commentary, video highlights & updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Post\nThank you for joining us for quite the rollercoaster day!\nYou can read the match report from Stephan Shemilt at The Oval here.\nWe will be back tomorrow morning from 8:00 BST for more reaction and look ahead to England's push for victory.\nAnd you can also catch today's highlights on BBC Two and iPlayer now.\n'When I spoke to Jimmy I got a bit emotional'\nStuart Broad speaking to Test Match Special about James Anderson's reaction to his retirement: \"He just said 'are you joking?'. We then had a hug. I went to see Stokes and Baz last night and said thanks for all you have done for me.\n\"It is always hard. When I spoke to Jimmy I got a bit emotional. But ultimately we have a game to win here. We can do the reminiscing afterwards if we get the job done.\"\n'I'll love cricket forever because of Baz and Ben'\nMore from Stuart Broad, speaking to BBC Test Match SpeciaI:\n\"I never expected to play five Tests against Australia this summer but I did set myself the challenge to be fit and available. I feel very proud I was able to do that.\n\"My emotions playing Ashes cricket is something that has carried me through. Ashes cricket is the ultimate competitiveness for English cricket and it has brought the best out of me.\"\n8-15 at Trent Bridge his best spell?: It is hard to look past that on my own ground with friends and family there. It was one of my most enjoyable days of cricket.\n\"But this series has been spectacular and incredible to be a part of. Every session you are on the edge of your seat.\n\"I wanted to leave playing and loving it with great memories and experiences and the last 14 months have been out of this world for me. Seeing what Baz and Ben have done for the mindset of a team. I'll love cricket forever for that.\n\"Last March [when he was dropped for the West Indies tour] there were times I thought I would never play for England again and that hurt. So to have another opportunity and to have the 14 months I have had, bringing so much entertainment to the country, it has been a huge pleasure. I have learned so much about leadership and management from those two.\n\"I have been part of some fantastic teams and it is lovely to go out now having played for one of the best of them.\"\nPost\nMore from Stuart Broad on Sky Sports: \"A little bit [emotional]. I have thought a lot about it and even up until eight o'clock last night, I wasn't 50/50 but I was a little bit unsure.\n\"But once I went to Stokesy's room and told him I felt really happy. I feel really content with everything I have achieved in the game and ultimately the decision came down to I knew I wanted to leave the game loving cricket and my last memories being a really enjoyable changing room.\n\"I have so many friends and figures in management that I've been around for so long. I look around and I have played so much cricket with all of them. It feels like my changing room and I wanted to sort of walk away playing with a group of players I love to bits.\"\n\"No, Ben didn't [try to change my mind]. He really understood the decision. I hadn't talked a lot about it. I hadn't mentioned it to him beforehand but I wanted to make sure I was clear in my mind. I wasn't really going in for a negotiation really. I was like 'I need to be clear' before I mentioned it to anyone.\"\nPost\nEngland bowler Stuart Broad speaking to Sky Sports: \"Tomorrow - well Monday - will be my last game of cricket. It's been a wonderful ride, a huge privilege to wear the Nottinghamshire and the England badge as much as I have and I'm loving cricket as much as I ever have. It's been such a wonderful series to be a part of and I've always wanted to finish it on top. This series feels like one of the most enjoyable and entertaining I've been a part of.\"\n\"[I decided] at about 8.30 last night. I've been thinking about it for the last few weeks but England v Australia has always been the pinnacle for me. I've loved the battles with Australia I've had personally and as a team.\n\"I've got a love affair with Ashes cricket and I think I wanted my last bat and bowl to be in the Ashes.\n\"I told Stokesy last night and told the changing room this morning and to be honest, it felt the right time. I didn't want friends or teammates at Nottinghamshire to see things that might come out so I prefer to just say it and give it a good crack for the last Australia innings.\"", "url": "https://www.bbc.com/sport/live/cricket/64959414"}