{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:14:18", "date_modify": "2025-05-21 05:14:18", "date_publish": "2025-04-05 00:00:00", "description": "Hull City defender Charlie Hughes heads in a 94th-minute winner at Sheffield Wednesday.", "filename": "sport_football_live_cglxke7537dt_1747804458.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/083b/live/7fa1ee80-1239-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cglxke7537dt_1747804458.html", "title": "Sheffield Wednesday 0-1 Hull City: Tigers get vital three points in survival bid", "title_page": "Sheffield Wednesday 0-1 Hull City: Tigers get vital three points in survival bid - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Hull City defender Charlie Hughes headed in a 94th-minute winner at Sheffield Wednesday to give them a vital three points in their battle against relegation from the Championship.\nHughes' powerful finish provided a grandstand end to an otherwise dire encounter which saw the Owls suffer a fourth successive home defeat.\nHull remain in trouble, with Luton Town and Derby County below them rousing themselves in recent weeks to find form, but the Tigers bounced back from defeat at Luton last week, their first in five games, to secure the win at Hillsborough.\nThey still needed Ivor Pandur to produce a fine late stop from Dominic Iorfa to retain the lead, and put an end to Wednesday's lingering hopes of a play-off place.\nHull went into the game knowing that Luton, one of the Championship's in-form teams, had picked up a point at home to Leeds earlier in the day, and they responded with a dogged performance against a Wednesday side that has now lost four consecutive home games for the first time since 2012.\nThe Tigers began on the front foot but Sean McLoughlin sliced one chance wide following a corner and Michael Ihiekwe got a telling deflection on Kyle Joseph's shot as the Owls managed to stand firm.\nWednesday fashioned two headed chances in a largely humdrum first half, but both fell to Josh Windass rather than aerial specialist Michael Smith, and Hull keeper Pandur was able to save both with ease.\nThe best chance of the first half came at the other end as Joseph was teed up, eight yards out, but 19-year-old Wednesday keeper Pierce Charles produced a superb save to claw his shot away.\nWindass was on the end of another opportunity early in the second half, getting ahead of his marker to meet Marvin Johnson's cross, but again Pandur was perfectly positioned to save.\nWednesday looked most likely to break the deadlock as the game moved towards a close, but Pandur kept out Shea Charles' shot as the on-loan Southampton man burst clear of the defence.\nHull had one last chance as they were awarded a free-kick, and when Fenerbahce loanee Lincoln Henrique curled it to the edge of the penalty area, Hughes met it with a thunderous header that flew past Charles.\nSheffield Wednesday manager Danny Rohl told BBC Radio Sheffield:\n\"Big credit to my team, to take this tough week, to stay here and go again, to fight again for our club. It took time to come into it, but in the second half it was one direction.\n\"It's hard but the key message for me is that this team has big, big character and big, big belief. A lot of players take all the setbacks again and again and it makes me very proud.\n\"The motivation comes from the inner circle, there's no question mark. The emotional level was there - they want to fight, they want to go and do everything, but you can understand what it means for this group.\n\"It makes no sense to speak about the play-offs. We should be honest, and we're not ready for the play-offs. We did an outstanding job and felt we were always close, but in the second half of the season in all these tight games, we could have won maybe six home games, but we didn't.\"\nHull City head coach Ruben Selles told BBC Radio Humberside:\n\"We knew we would need to stay in the game if we wanted to get chances, and at the end the boys got that header and three points.\n\"We've been on the other side, where you lose the game in the final action, and today was a really good feeling.\n\"In a Championship game it's really difficult to read the opponent, especially away from home, but you need to manage to stay in the game and when there are good moments to score and you don't get it, you have to manage not to concede.\n\"Every game since I have been here was decided by one action - a 1-0 or a 2-1 situation, and you have to fight for that to go to your side.\"", "url": "https://www.bbc.com/sport/football/live/cglxke7537dt"}