{"authors": ["Mike Peter", "www.facebook.com"], "date_download": "2025-05-20 12:12:32", "date_modify": "2025-05-20 12:12:32", "date_publish": "2023-08-04 16:53:38", "description": "Welsh Fire only narrowly beat Southern Brave at the Ageas Bowl despite scoring the second highest score in tournament history.", "filename": "sport_cricket_66400490_1747743152.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1857A/production/_130660799_a888d57d88ed2c3a61f8d38a256b194d3a9547de-1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66400490_1747743152.html", "title": "The Hundred 2023: Welsh Fire beat Southern Brave in high-scoring thriller", "title_page": "The Hundred 2023: Welsh Fire beat Southern Brave in high-scoring thriller - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Welsh Fire only narrowly beat Southern Brave despite scoring the second-highest total in the Women's Hundred.\nTammy Beaumont and Hayley Matthews combined for an opening partnership of 80 as Fire reached 165-3.\nSmriti Mandhana and Danni Wyatt replied with 96 runs from the top of the order to set a strong Brave platform.\nAn unbeaten Mandhana (70*) accelerated towards the close, but Matthews held the home side to five runs from the final set as Fire won by four runs.\nMatch Hero Hayley Matthews, talking to Sky Sports: \"It was great. It was a pretty good wicket and we wanted to get a big score on the board, we knew they'd come hard so we're glad to get over the line.\n\"It's huge for the team. We've spoke about not getting over the line in previous years so it's pretty special to do it today when it was close and cap it off.\n\"I wasn't sure how many they needed off the final set. I just knew what I wanted to bowl and wanted to nail it. I'm glad I got it done.\"\nWelsh Fire captain Tammy Beaumont, talking to Sky Sports: \"What a game of cricket that was. The crowd were treated to an epic. With Danni Wyatt and Smriti Mandhana you never know if you've got enough runs. The bowlers stuck at it hard. I'm ecstatic.\n\"Only in the last three balls was I confident. Freya Kemp is an extremely talented player.\n\"Hayley Matthews has done it for West Indies for a very long time. After her third set she said 'don't bowl me again', but I said 'Hayls, you're going to have to' and she said 'no worries, boss'.\"\nYou can watch Hundred matches on BBC Two and BBC iPlayer every Wednesday and Saturday throughout the competition, alongside both finals on Sunday, 27 August. More details here.", "url": "https://www.bbc.com/sport/cricket/66400490"}