{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:49:22", "date_modify": "2025-05-21 05:49:22", "date_publish": "2025-01-14 11:56:58", "description": "Man City news: 'Pep Guardiola has thrown Kyle Walker under the bus' - Theo Walcott", "filename": "sport_football_articles_c5ye59nwr08o_1747806562.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7229/live/57584760-d24e-11ef-afca-fd8d41ed4ae1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c5ye59nwr08o_1747806562.html", "title": "Man City news: 'Pep Guardiola has thrown Kyle Walker under the bus'", "title_page": "Man City news: 'Pep Guardiola has thrown Kyle Walker under the bus' - Theo Walcott - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Kyle Walker has been \"thrown under the bus\" by manager Pep Guardiola publicly indicating his captain's desire to leave Manchester City, says former Arsenal and England winger Theo Walcott.\n\"That was a conversation for just between him and Pep,\" Walcott told BBC Radio 5 Live's Monday Night Club.\n\"It takes away from the performances of Manchester City and gets us talking about something completely different. Maybe that's what Pep wants to happen - to distract with a player he has nothing to do with at this moment in time but is still at the football cub.\n\"There is a person there who will still do a job because of how professional he is and has been for many many years.\n\"Having someone round the club who can comfort players in what it means to play for Manchester City is important. We must not forget how important he has been for England too.\n\"Pep has actually really thrown him under the bus doing something like this very publicly, personally.\"\nWalker, 34, joined City in Guardiola's second season in charge in 2017 and Walcott believes the time may have naturally come for him to try a new environment.\n\"Players come to a point where they just want change,\" he added.\n\"As a player, you can't fault all his achievements, but there are cracks slowly starting to show now with his focus slowly fading.\n\"A new set-up and new culture - wherever he may go - may do a lot of good for him.\n\"The enjoyment has just completely gone from a player who has achieved so much. You should always enjoy it.\"", "url": "https://www.bbc.com/sport/football/articles/c5ye59nwr08o"}