{"authors": ["Brent Pilnick", "www.facebook.com"], "date_download": "2025-05-21 04:12:23", "date_modify": "2025-05-21 04:12:23", "date_publish": "2025-01-15 08:14:55", "description": "Oxford United boss Gary Rowett says he would be interested in bringing Millwall and Wales striker Tom Bradshaw to the club.", "filename": "sport_football_articles_crm7zglymkno_1747800743.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2fc7/live/2ef7d550-d2cc-11ef-a95c-5b151e1edf12.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_crm7zglymkno_1747800743.html", "title": "Tom Bradshaw: Millwall striker would be 'great' for Oxford United", "title_page": "Tom Bradshaw: Millwall striker would be 'great' for Oxford United - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Oxford United boss Gary Rowett says he would be interested in bringing Millwall and Wales striker Tom Bradshaw to the club.\nBradshaw, 32, played for Rowett when he was Millwall boss last season.\nHe has been linked with a move to the U's, having struggled to establish himself in the side this season.\n\"He's the type of player that certainly I know very well,\" Rowett told BBC Sport.\n\"I worked with him for years, he's got incredible enthusiasm, he presses really well, diligent, scores goals - he scored 17 goals in the Championship for me about 18 months ago.\"\nRowett says Bradshaw, who was last capped for Wales in October 2023, would be an ideal addition to his side as they look to establish themselves in the Championship after winning promotion last season.\n\"We've a group of players that we want to look at the model which has been very successful for Oxford, which is helping develop players, helping them to improve and have an opportunity to build assets whilst building performance,\" he added.\n\"But I think in this division you also need players that know the level and know what you require.\n\"I think this window is going to be a little bit of a blend of those, but Tom would certainly be a great addition for us.\"", "url": "https://www.bbc.com/sport/football/articles/crm7zglymkno"}