{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:21:56", "date_modify": "2025-05-21 05:21:56", "date_publish": "2025-04-03 12:08:11", "description": "Swansea City owners Brett Cravatt and Jason Cohen say the club must increase revenues and cut costs if they are to continue to be competitive in the Championship.", "filename": "sport_football_articles_c1wdjy89lxvo_1747804916.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/af86/live/ea08a6b0-107c-11f0-8c6c-d990c1c0e96b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c1wdjy89lxvo_1747804916.html", "title": "Swansea City must 'increase revenues and cut costs'", "title_page": "Swansea City must 'increase revenues and cut costs' - Brett Cravatt and Jason Cohen - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Swansea City owners Brett Cravatt and Jason Cohen say the club must increase revenues and cut costs if they are to continue to be competitive in the Championship.\nSwansea have been in the second tier since their seven-year spell in the Premier League came to an end in 2018.\nWhile Swansea reached the play-offs in 2020 and 2021, they finished 14th last season having ended up 10th and 15th respectively in the two campaigns prior to that.\nWith seven games of the current season remaining, Swansea are 16th and still in need of points to ensure they avoid the drop to League One.\nAmerican businessmen Cravatt and Cohen have been the key decision-makers at Swansea since the takeover of the club last November.\nIn a wide-ranging open letter to fans, the duo have made it clear that Swansea's financial situation must be addressed.\n\"Our staff across all parts of the business will be tasked with increasing revenues and reducing costs because that has a real and direct impact on our ability to be successful,\" they said.\nLast weekend, Swansea announced a pre-tax loss of £15.2m for the latest financial year.\nIn what has been a turbulent spell for the Welsh club, chairman Andy Coleman has moved aside – and will officially leave his role in the summer – with new chief executive Tom Gorringe now running the club on a day-to-day basis.\nCravatt and Cohen say former Bristol Rovers chief executive Gorringe has been \"tasked with restructuring the club to ensure that we operate efficiently and maintain optimal standards\".\nThe duo say player trading has allowed Swansea to operate within EFL profit and sustainability rules in recent years.\n\"These rules, in their most basic form, allow the club to accumulate losses of £39m over a rolling three-year period,\" Cravatt and Cohen said.\n\"These constraints alongside the parachute payments paid to those clubs coming down from the Premier League mean that we must look for new ways to drive income and reduce costs to increase our opportunities to invest on the pitch and give us the best possible chance of success.\n\"However, over recent seasons we have seen our cost base increase and income decrease, ultimately making us less competitive.\n\"We will be looking to address this over the coming months by identifying and realising efficiencies within the operation to allow us as much flexibility within the market as possible.\"\n\"Alan has done a great job in the fixtures that he has taken so far and that has allowed us the space to thoroughly review the market for all candidates for the [manager's] role,\" they said.\n\"We have enjoyed a great working relationship with Alan, and he has demonstrated his dedication to the club during his time with us, turning down a number of high-profile opportunities to stay at Swansea City.\n\"While the process to ensure that we identify the right candidate for the role continues, we are happy with the progress that has been made on the pitch.\"\nThe letter also revealed that Swansea have appointed James Morgan-Snowley - who previously worked at Rangers - as their new head of scouting, while data expert Adam Worth has been promoted to global head of analytics and recruitment.\nCravatt and Cohen say that while their focus is on \"doing all we can to invest in the club, to make sensible and informed decisions to move things forward\", they want Swansea fans to \"stay behind the team and the staff and keep the noise coming at the stadium\".\nThey are to purchase 500 tickets for each of Swansea's four remaining home games this season for members of the \"local community and grassroots clubs\", while they will also lay on free coach travel for the trip to Queens Park Rangers on Monday, 21 April.", "url": "https://www.bbc.com/sport/football/articles/c1wdjy89lxvo"}