{"authors": ["Alex Howell", "www.facebook.com"], "date_download": "2025-05-21 06:55:07", "date_modify": "2025-05-21 06:55:07", "date_publish": "2025-03-29 16:41:24", "description": "After dropping his daughter there for a Taylor Swift concert, Crystal Palace boss Oliver Glasner will now get his own taste of Wembley.", "filename": "sport_football_articles_c8rkr7rpyj5o_1747810507.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/53b0/live/7eb7c060-0cb9-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c8rkr7rpyj5o_1747810507.html", "title": "FA Cup: How Oliver Glasner turned Crystal Palace into FA Cup contenders", "title_page": "FA Cup: How Oliver Glasner turned Crystal Palace into FA Cup contenders  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Now Crystal Palace have secured their place in the last four of the FA Cup, it's hard to believe that they did not win their first game of the Premier League season until late October.\nThe Eagles had won two games in the Carabao Cup against Championship opposition, but tension was starting to build around Selhurst Park before that much-needed victory over Tottenham in their ninth league game of the season.\nThe memories of those struggles are far in the past now as supporters and those around the club begin to look forward to a trip to Wembley after an impressive 3-0 win away at Fulham, having last reached the semi-finals in 2022.\nThe Eagles have never won the FA Cup and have lost twice in the final, in 1990 and 2016, but can dream of lifting the first major trophy in their history, which dates back to 1861 depending on which historian you believe.\nTheir turnaround has been masterminded by manager Oliver Glasner and since the start of 2025, only Liverpool (11) have won more games in all competitions among Premier League sides than Glasner's Palace (10).\nThe Eagles, with eight, have also recorded more clean sheets than any other English top-flight side in that time.\nGlasner has always said he knew the start of the season would be tricky after a summer where they lost star player Michael Olise to Bayern Munich, had a large part of their squad involved in major tournaments and had four players sign on deadline day.\nIt's taken time for all of those factors to settle down but in Glasner's trusted 3-4-2-1 formation, the Eagles are highly organised and have built real momentum as they approach the end of the season.\nPalace have lost just twice in their past 15 games - which is all the more impressive when somehow they have only managed to win three games at home in the league all season.\nThe Eagles' back three of Chris Richards, Maxence Lacroix and Marc Guehi is as solid a unit as you will find across the Premier League.\nGlasner was asked by BBC Sport if the match against Fulham, in which the visitors were under pressure at the start before finishing strongly, mirrored their season and the exciting end it could have.\n\"The season is not over. If this is the end today I wouldn't be happy,\" Glasner said.\n\"I think this is just the start of our crunch time. Two months now, hopefully we have 12 games to play.\n\"The good thing is we are in a good momentum and the players are in a good shape.\n\"The next two months we always stay together and we have many games and we can get into our best shape again.\n\"I think today, especially at the beginning, we were far away from this. We need to be at our best to win as many games as possible.\"\nThe Crystal Palace supporters were singing about their trip to Wembley but Glasner would not be drawn on his thoughts on what it would mean if his side were able to lift a trophy at the national stadium.\n\"I don't want to talk about winning a trophy because even in the next game we can't win a trophy. It is just the semi-finals,\" he said.\n\"When you enter a cup competition it doesn't matter if you lose in round number one or the semi-finals, we enter the competition to win it.\n\"It is a great achievement to play the semi-final and especially in that environment at Wembley as it is always something special.\"", "url": "https://www.bbc.com/sport/football/articles/c8rkr7rpyj5o"}