{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:40:06", "date_modify": "2025-04-26 03:40:06", "date_publish": "2025-03-05 10:29:29", "description": "US Open champion Bryson DeChambeau urges the local authority that operates Dalmuir to keep the municipal course in Glasgow open.", "filename": "sport_golf_articles_cy7xn4vg2y5o_1745638806.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5a1f/live/3b84c4b0-f9ad-11ef-b257-2b725ccbdd87.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_golf_articles_cy7xn4vg2y5o_1745638806.html", "title": "Bryson DeChambeau calls for Dalmuir golf course to be kept open", "title_page": "Bryson DeChambeau calls for Dalmuir golf course to be kept open - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "US Open champion Bryson DeChambeau has urged the local authority that operates Dalmuir to keep the municipal course on the north-west outskirts of Glasgow open.\nThe public-run course's future will be debated by West Dunbartonshire Council at a budget meeting on Wednesday evening.\nDalmuir could be closed completely, reduced to 12 holes or remain at 18 but with a rise in membership rates and green fees.\nMore than 3,500 people have signed a petition urging the authority to save the course while the SNP group in the Labour-minority council has also backed the campaign to keep Dalmuir open.\nDalmuir was threatened with closure last year and the council says it costs more than £100,000 a year to subsidise the expenditure to run the course.\nLong-time tour caddie Craig Connelly, who lives near Dalmuir, shared a video by DeChambeau on X during which the two-time US Open champion emphasises the impact golf can have on a community.\n\"I'm here to tell you how important a public golf course is to the ecosystem, not only just golf in general, but the community,\" said the 31-year-old American.\n\"Sometimes people don't realise the impact of golf and what it is for a community, whether it's character development, personal growth, learning more about yourself or family development.\n\"If you don't have golf courses like Dalmuir and a community like Dalmuir, it's difficult to continue to grow not only just a sport, but a community.\n\"This golf course is super important and I hope people can understand how important it is to go out and sign that petition and keep this course alive and to make a different future for generations to come.\"", "url": "https://www.bbc.co.uk/sport/golf/articles/cy7xn4vg2y5o"}