{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:31:13", "date_modify": "2025-05-19 14:31:13", "date_publish": "2017-08-05 13:02:10", "description": "Alan Forsyth hopes the Glasgow crowd will boost promotion-chasing Scotland in the Men's EuroHockey Championships II.", "filename": "sport_scotland_40838388_1747665073.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/184E/production/_97222260_9997086.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_scotland_40838388_1747665073.html", "title": "EuroHockey Championships II: Home crowd boosts promotion-chasing Scotland", "title_page": "EuroHockey Championships II: Home crowd boosts promotion-chasing Scotland - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Forward Alan Forsyth hopes playing in front of a home crowd will boost Scotland's chances at this month's Men's EuroHockey Championships II.\nThe host nation are one of eight countries competing in Glasgow to win promotion to the sport's top division.\nScotland will face France, Portugal and Ukraine in Pool A, with the overall championship winners and runners-up elevated to the top tier.\n\"I honestly think home advantage does help,\" Forsyth said.\n\"It gives you that buzz of playing in front of friends and family who don't often get to come see you.\"\nThe forward is the son of national head coach Derek Forsyth, and one of only two Scots in the GB hockey squad. The 25-year-old is also the youngest player to reach 50 appearances for the Blue Sticks, and hopes hosting the continental tournament will help raise the sport's profile in his homeland.\nScottish hockey participation has risen by 40% since the creation of the National Hockey Centre ahead of the 2014 Glasgow Commonwealth Games.\n\"Once you come see it, you get a totally different opinion on it and I think that's really important,\" Forsyth added. \"There's more to it than just a stick and a ball.\"\nCaptain Chris Grassick says the Scots head into the tournament buoyed by confidence, after narrowly missing out on a World Cup place with a 1-1 draw against Canada at the World League semi-final tournament in June.\nScotland begin their campaign against France on Sunday, with the final held on Saturday, 12 August.\n\"We've trained really hard since the World League in London,\" Grassick, who plays for Surbiton, said. \"It'll be a good test against France here. We're the underdogs for that game on paper but we'll back ourselves when it comes down to it.\n\"Playing at home brings different pressures. There's an expectation from the crowd for you to turn up and deliver from the start. We've got to focus on our play and not get too carried away.\"", "url": "https://www.bbc.com/sport/scotland/40838388"}