{"authors": ["Andrew Benson", "www.facebook.com"], "date_download": "2025-05-19 15:12:47", "date_modify": "2025-05-19 15:12:47", "date_publish": "2015-02-03 19:44:45", "description": "Andrew Benson squints his eyes through Red Bull's wacky test livery to spot some design features that could make the difference.", "filename": "sport_formula1_31119094_1747667567.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/80817000/jpg/_80817972_red_bull_side_front_view_getty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_formula1_31119094_1747667567.html", "title": "F1 testing: Red Bull's new design features studied in detail", "title_page": "F1 testing: Red Bull's new design features studied in detail - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Red Bull caused a stir by starting pre-season Formula 1 testing with their new car in a camouflage livery.\nIt is similar to the way road-car manufacturers decorate their new models when they are trying to keep them away from the prying eyes of spy photographers.\nRed Bull team principal Christian Horner has not revealed why the team chose to use this livery. His only explanation was that Red Bull had \"never been afraid to do things a bit differently\".\nBut this is a notoriously secretive team, even within the carefully guarded world of F1 engineering - they regularly make mechanics stand in front of sensitive parts of the car on the grid at grands prix to prevent photographers taking pictures.\nRed Bull have set the standard for aerodynamic design excellence in the last five or six years in F1.\nAnd their chassis itself was arguably at least as good as the Mercedes last year, with most of their deficit to the world champions explained by the lack of power of the Renault engine, and the ways in which Red Bull had to compromise optimal car performance to compensate.\nSo Red Bull are clearly trying to prevent the photographers - many of whom are also employed by teams to provide spy pictures of rivals' cars - from getting a good picture of the new RB11.\nBut what are Red Bull trying to hide?\nThe camouflage livery starts at the very front of the car, and so do the secrets of the new Red Bull.\nNew regulations this year have been aimed at outlawing the 'anteater' noses that proliferated last season as a way around badly written rules that were intended to make the noses lower for safety reasons.\nThere are fewer ways around this now the rules have been tidied up, but the teams are still trying to come up with ways to reduce the aerodynamic losses inherent in a lower nose.\nThere are two solutions to this - a low nose tip which enhances front downforce by creating a 'venturi effect' of speeded up air and therefore lower pressure between nose and front wing, but which harms airflow to the rear; or a higher nose which reduces front downforce but enhances rear performance.\nRed Bull's design appears to be aimed at having their cake and eating it.\nThey have met the requirements of two different minimum cross-sectional areas at the nose tip and a short distance behind it by having a stubby protuberance sticking out from a wider, flatter section of nose cone.\nBut the bodywork under the protruberance has a venturi shape on its underside - enhancing downforce - while on either side of it there is space for more air to flow through into the section under the bottom of the chassis and from there to the rear of the car.\nSauber have come up with a similar - albeit more bulbous - solution on their car.\nOne of the features of Red Bulls in recent years has been the team's decision to employ ducts in the nose to pass air through the chassis and out of the top in front of the driver.\nThis tidies up the airflow under the nose and therefore makes it move faster, reducing pressure and thereby increasing downforce.\nLast year the duct was on the underside of the nose, but this year extends around to the two side edges of the chassis, where it transitions from horizontal to vertical. The inlets can be seen underneath the camera mounting pods.\nIt then exits behind the driver number on the top of the chassis.\nF1 aerodynamic design at the front of the car focuses on a creating a powerful vortex of air that starts from the front wing, flows inside the front wheels and then around the side pods and through the back of the car between the bodywork and the rear wheels.\nIt is akin to black magic, making this work, but the more powerful the vortex, the more downforce the car creates and the faster it goes around corners.\nIt is usually impossible to see this airflow - but there was a rare opportunity at the Brazilian Grand Prix a couple of years ago when a damp practice session meant it could actually be glimpsed on some of the cars.\nThe problems in creating it start with the relationship between the front wing and the wheels.\nAs the front wing only can extend only about halfway across the front tyres following a rule change for 2014, it is all the harder to set this airflow up.\nThe wheels create an effective wall, and produce what is called 'dirty air' that can disrupt the smooth flow of air around the car.\nOne way to reduce this effect is a so-called 'blown front axle'. This is created by ducting air from the brake ducts on the inside of the wheels, through a hollow axle and out of a hole in the wheel nut.\nThis airflow, if it is powerful enough, prevents the wake from the tyres from disturbing that vortex.\nWill the Red Bull car have other secrets that have so far not been spotted? Certainly. And many of the design features that dictate the pace of an F1 car are hidden under the skin, never to be seen by outside eyes.\nEqually, as with all F1 cars, it is a prototype that will constantly change and be honed through the year.\nBut when in its definitive 2015 livery at the first race, it will be a little easier to spot what these features are.", "url": "https://www.bbc.com/sport/formula1/31119094"}