{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:49:17", "date_modify": "2025-05-20 11:49:17", "date_publish": "2023-08-07 09:36:05", "description": null, "filename": "sport_articles_cyjg9wnj194o_1747741757.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/025e/live/6b459e50-3504-11ee-bde6-7ffba94c56ae.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cyjg9wnj194o_1747741757.html", "title": "BBC Sport", "title_page": " - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked you for your thoughts after Hibs' opening-league defeat to St Mirren.\nHere's what you had to say:\nMartin: HORRENDOUS! Played like 11 strangers meeting for the first time. Three games in and two defeats... no good.\nCam: Embarrassing performance from Hibs. The exact same uselessness in a lot of positions from the game in Andorra. Players are not up to the standard needed.\nDavid: First half was very poor indeed. St Mirren were well in control. Hibs did get back into it but the sucker-punch just killed us... poor defending and costly mistakes.\nJohn: Unfortunately Hibs can't afford the luxury of four or five players being bellow par. Lee Johnson keeps harping on lack of quality yet we keep signing average journeymen... Up and down season again I'm afraid.\nColin: It's great to be wise after the event and we have some fans who are brilliant in hindsight! Manager let down with uncompetitive midfield and Boyle and Youan ineffective.\nLoyalty now goes out of the window and we need to build on a better defensive shape for the future. We'll score goals but we need to be better out of possession.\nKenny: This performance was poor especially in the first half. The game had last season written all over it. We have some very good players but they are badly led. Don’t think I will be back until there is a change of manager.\nGeorge: Same old, same old. Hibs'd it, again. Further comment unnecessary.\nFergis: Absolutely dreadful. Out-worked and out-played for 70 minutes, no idea what we were doing. Not seen Boyle as quiet as today, probably only Newell and Doidge get close to pass marks.\nTo be fair, we got exactly what we deserved", "url": "https://www.bbc.com/sport/articles/cyjg9wnj194o"}