{"authors": ["Katie Stafford", "www.facebook.com"], "date_download": "2025-05-21 07:43:06", "date_modify": "2025-05-21 07:43:06", "date_publish": "2025-03-28 10:16:43", "description": "Fabian Hurzeler press conference: Brighton vs Nottingham Forest preview", "filename": "sport_football_articles_cp9y9xkz0gro_1747813386.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0f5a/live/5ccfa4a0-4909-11ef-9e1c-3b4a473456a6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cp9y9xkz0gro_1747813386.html", "title": "Fabian Hurzeler press conference: Brighton vs Nottingham Forest preview", "title_page": "Fabian Hurzeler press conference: Brighton vs Nottingham Forest preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Lewis Dunk, Solly March and Matt O'Riley are expected to be available but Tariq Lamptey \"will be out for longer\".\nHe said \"it is so far so good\" in terms of international players returning with no issues so Kaoru Mitoma and Joao Pedro should be able to start Saturday's game.\nOn feeling the importance of the game: \"Even when I spent some time in my home town, a Brighton fan called my name and he said he was really looking forward to watch the game. So you feel it, but it is important that you don't make it artificially big.\"\nMore on dealing with quarter-final pressure: \"It is an important game like all of the other games in which we have to go to our limits. That is what we have to do again tomorrow. We all know it is a big opportunity and chance.\"\nHe said the players who did not go on international duty had a few days off \"and then came back with a lot of energy and full of spirit to continue this [seven game unbeaten] run\".\nOn The FA Cup seemingly being more open this season: \"The clubs who are in it remain in it for a reason and deserve to be there. I wouldn't say that just because the bigger teams are out, as it is always an opportunity to win if you are in.\"\nHe said \"being authentic and creating togetherness\" is what he came in to do and \"trusting that process\" means you might have the opportunity to win something. Hurzeler added: \"It is not about me or trying to build a legacy, it's about achieving something as a team.\"\nOn opponents Nottingham Forest: \"We only have to look at the table. If a team is that long at the top of the table then they are there for a reason. They are a top team with a lot of individual quality. It is an opportunity to prove how far we are in our development and we will try to make the next step.\"", "url": "https://www.bbc.com/sport/football/articles/cp9y9xkz0gro"}