{"authors": ["Tom Mallows", "www.facebook.com"], "date_download": "2025-05-20 11:38:07", "date_modify": "2025-05-20 11:38:07", "date_publish": "2023-08-06 19:52:29", "description": "Oval Invincibles and Welsh Fire play out the first tie in The Hundred after a thrilling finish at the Kia Oval.", "filename": "sport_cricket_66424379_1747741087.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/167E9/production/_130673129_gettyimages-1596968654.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66424379_1747741087.html", "title": "The Hundred 2023: Oval Invincibles against Welsh Fire ends in dramatic tie", "title_page": "The Hundred 2023: Oval Invincibles against Welsh Fire ends in dramatic tie - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Oval Invincibles and Welsh Fire played out the first tie in The Hundred after a thrilling finish at the Kia Oval.\nNeeding three runs to win off the final ball, Tom Curran's despairing dive ensured Invincibles got two runs to finish on 138-7, matching Fire's score.\nCurran impressed with bat and ball, ending unbeaten on 38 from 18 balls as well as taking 2-27.\nWelsh Fire earlier reached 138-6 from their 100 balls, including a gutsy 69 from 46 deliveries by Joe Clarke.\nA fine half-century from Jordan Cox seemed to have put Invincibles in control, but his dismissal for 51 triggered a mid-innings collapse, as they lost four wickets for 12 runs to slump to 100-6.\nDefeat looked likely with 38 more runs still needed off 17 balls, but Curran hit four booming sixes to give his side a chance for victory off the final ball.\nBoth sides were then left nervously waiting for the third umpire's decision on the big screen, with some Welsh Fire players celebrating, thinking wicketkeeper Clarke had whipped off the bails with Curran short of his ground.\nThe eventual decision of not out sparked huge cheers from the Oval crowd, who were treated to a pulsating match that swung one way and then the other.", "url": "https://www.bbc.com/sport/cricket/66424379"}