{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:32:22", "date_modify": "2025-05-21 06:32:22", "date_publish": "2025-03-31 17:25:42", "description": "IPL 2025 results: MI beat KKR as Debutant Ashwani Kumar stars as debut", "filename": "sport_cricket_articles_c3v9krkwpd6o_1747809142.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2e94/live/9b09a7d0-0e4c-11f0-8fda-f199207bcb26.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c3v9krkwpd6o_1747809142.html", "title": "IPL 2025 results: MI beat KKR as Debutant Ashwani Kumar stars as debut", "title_page": "IPL 2025 results: MI beat KKR as  Debutant Ashwani Kumar stars as debut - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Seamer Ashwani Kumar took 4-24 on his Indian Premier League debut to help Mumbai Indians beat Kolkata Knight Riders by eight wickets.\nThe left-armer was the star of the show as the 2024 champions KKR were dismissed for 116 in 16.2 overs.\nMumbai easily chased down their target with 43 balls to spare, as opener Ryan Rickelton made an unbeaten 62 to help his side record their first win in this year's tournament.\nKKR endured a horror start to their innings, losing openers Sunil Narine and Quinton de Kock for a duck and one respectively, slipping to 2-2.\nAshwani, who was playing in just his fifth senior T20, soon got in on the act, seeing KKR captain Ajinkya Rahane caught at backward point from his first ball in the competition.\nHe would then have caught Rinku Singh caught in a similar area, before bowling impact sub Manish Pandey and the dangerous Andre Russell.\nThe 23-year-old did not even get a chance to bowl a fourth over as Mitchell Santner wrapped up the innings with the dismissal of Ramandeep Singh, who edged to short third.\nRickelton and Rohit Sharma put on 46 for the opening wicket before the latter toe-ended a shot to Harshit Rana at mid-off off Russell's bowling.\nEngland's Will Jacks added 16 before he was caught impressively by Rahane at cover to hand Russell a second wicket.\nBut by that point the match was already over as a contest, and Suryakumar Yadav closed the game in style, hitting Russell for consecutive fours then a six a few balls later, finishing the innings in the 13th over.\nThe result means MI rise from the bottom of the table to sixth, and are replaced by KKR, whose net run-rate has dropped to -1.428.", "url": "https://www.bbc.com/sport/cricket/articles/c3v9krkwpd6o"}