{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:16:24", "date_modify": "2025-05-21 07:16:24", "date_publish": "2025-01-14 00:00:00", "description": "Follow live text commentary and score updates as Cardiff host Watford & Plymouth Argyle face Oxford United in the EFL Championship.", "filename": "sport_football_live_c62wpw1lre5t_1747811784.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c62wpw1lre5t_1747811784.html", "title": "EFL Championship LIVE: Cardiff City v Watford, Plymouth Argyle v Oxford United", "title_page": "EFL Championship LIVE: Cardiff City v Watford, Plymouth Argyle v Oxford United - live score & text updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Thanks for joining us!\nIt ended a point and a goal apiece in both of our Championship matches tonight.\nWe'll be back tomorrow night as strugglers Portsmouth make the long journey to Lancashire to take on promotion-chasing Blackburn Rovers at Ewood Park (19:45 GMT).\nWe hope you can join us again then, but for now, it is good night from us.\nHow the bottom of the Championship looks\nIt's a night of 'if-onlys' for three teams in the battle against the drop.\nCardiff are out of the bottom three after drawing 1-1 at home to Watford, but conceding a late equaliser was a bitter blow for the Bluebirds.\nIn another 1-1 draw, Rami Al Hajj's equaliser kept Plymouth very much still in touch at the bottom - and prevented Oxford from moving eight rather than six points clear of the relegation places. A win for the Pilgrims would have taken them level on points with Hull and Portsmouth.\nPost\nFT: Plymouth 1-1 Oxford\nJerome Sale\nBBC Radio Oxford commentator\nThere were a few chances at the end but I think you take what you can get.\nI know the Oxford United players are exhausted, but the Oxford fans who came here tonight deserve an applause for their support throughout the game.\nPost\nFT: Plymouth 1-1 Oxford\nKatie Middleton\nEx-captain of Plymouth Ladies on BBC Radio Devon\nI just don't think Argyle did enough in the second half.\nAfter Oxford had gone ahead they sat in comfortably behind the ball in the second half. They probably created the better opportunities towards the end of the half.\nIt's disappointing to not get three points from a game we probably should have won.\nFULL-TIME\nPlymouth 1-1 Oxford United\nIt ends all square at Home Park - both sides will have to settle for a point.\nMiron Muslic's first game in charge was certainly an interesting one with both sides probably scoring against the run of play tonight.\nThe hosts dominated the first half but were undone by Will Vaulks' wonderful long-range strike - undoubtedly one of Oxford's best goals this season.\nThe visitors started the second half strongly but Rami Al Hajj's accurate 63rd-minute header earned the hosts a point and closes Argyle to within two points of safety, although 22nd-placed Portsmouth have played two fewer games than the Pilgrims.\nFULL-TIME\nCardiff 1-1 Watford\nIt's all over.\nVakoun Bayo's late equaliser prevents Watford falling to a fourth consecutive Championship defeat. It doesn't prevent Cardiff climbing out of the relegation zone, but the Bluebirds will nevertheless be disappointed not to have held on for what would have been only their second win in 12 matches.\nCardiff were the better side for much of the game and Cian Ashford's goal midway through the second half looked like giving them all three points. Next up for them is the small matter of a home match against arch-rivals Swansea on Saturday.\nCHANCE\nPlymouth 1-1 Oxford United\nOh its a great chance for the visitors to nick a winner!\nSiriki Dembele, the substitute, takes an air shot but when the ball comes back to him he manages to wriggle through a couple of challenges before striking an excellent effort from 18 yards which was well kept out by Daniel Grimshaw.\nPost\nPlymouth 1-1 Oxford\nNathan Cooper\nBBC Radio Oxford commentator\nIt's almost a two at the back for Plymouth, it looks like a 2-4-4.\nOxford are getting stretched, the Oxford fans are doing their best to help their team over the line.\nSUBSTITUTION\nPlymouth 1-1 Oxford United\nBrave change from Argyle boss Muslic and a statement of intent with five minutes to go.\nCentral defender Victor Palsson is withdrawn and replaced by forward Ibrahim Cissoko as the hosts look to claim all three points.\nMeanwhile, Tymo Puchacz looks to have gone down with some old-fashioned cramp.\nCLOSE!\nPlymouth 1-1 Oxford United\nAfter so many poor set-pieces, Tymo Puchacz puts in a wicked corner from the left-hand side, right underneath goalkeeper Cumming, but the referee blows for a foul, seemingly for a push.\nWe've seen a lot of reasons why Argyle were so keen on bringing in Puchacz in the January window.\nPost\nPlymouth 1-1 Oxford\nAlan Richardson\nBBC Radio Devon\nThat's very poor from the referee, he's so close to the incident and he's clearly won the ball.\nNot only has he given a foul but he's also booked him.", "url": "https://www.bbc.com/sport/football/live/c62wpw1lre5t"}