{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:41:28", "date_modify": "2025-05-21 04:41:28", "date_publish": "2025-04-03 08:35:50", "description": "Liverpool 1-0 Everton: Fan views", "filename": "sport_football_articles_c1w0y7rnqzno_1747802488.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c1w0y7rnqzno_1747802488.html", "title": "0 Everton: Fan views", "title_page": "Liverpool 1-0  Everton: Fan views - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your views on Liverpool's Premier League win over against Everton.\nHere are some of your comments:\nLiverpool fans\nTommy: Hard-won game with Everton parking the bus and time-wasting. Virgil van Dijk and Mohamed Salah's form has dropped dramatically and both were carried throughout the match while Andy Robertson and Ibou Konate were best at the back. Luis Diaz was like a wasp at a picnic and Dominik Szoboszlai never stopped running. We do need to play better though.\nTyra: Not a great performance but we'll take the three points. If one of our players did what James Tarkowski did, it would have been a straight red immediately without any need for VAR. Ridiculous.\nKen: It was never going to be easy against this Everton team and their tactics so it feels even more satisfying to come out on top after a war of attrition. The team was the star here in battling for every ball. That said, the standard of officiating on the pitch and in the VAR booth was woeful again.\nTim: On the whole we deserved the win but I was concerned how easy our centre-backs were beaten by Beto. Poor defending by both at times and they are world class . And what has happened to Salah? It was like playing with 10 men. That said three hard-fought points and we move on.\nYusuf: Great way to bounce back from a difficult period and no better opponent than our enemies across Stanley Park. Diaz gave 100% throughout and it was a well-taken goal from Jota. And please cut Salah some slack - he has been quiet recently but that is just natural - he's not going to score or assist every game. Just need to keep the machine going for another eight games.\nEverton fans\nLee: A decent hard-working performance, and definitely a red card! But the game was won by a goalscorer, which sadly is something we lack! Tough run of games to play but it's in our own hands to stay up.\nMozza: Decent performance but was expecting more. Doucoure and Harrison were a complete waste of time and should not get on the pitch again this season. We should play Broja or Chermiti instead of Beto if they are going to be the future.\nJeff: We could - and might even should - have been ahead with Beto's chance. That's the crucial moment in the match for me. Not the two VAR decicions. But on those matters: Tarkowski was lucky to get away with a yellow and he defended clumsily for their goal. Instead of critising the VAR for a possible offside, we should rather be critical at Tarkowski. He has become a liability this season.\nBarry: The right result. We didn't create too much and the massive difference of Liverpool's spend on their squad compared to ours ultimately showed through. Might have been different if Beto had scored rather than hitting the post, but the gulf in class will need to be closed if we hope to get anywhere near European spots, starting with a major overhaul this summer.", "url": "https://www.bbc.com/sport/football/articles/c1w0y7rnqzno"}