{"authors": ["Brian McLauchlin", "www.facebook.com"], "date_download": "2025-05-21 04:39:22", "date_modify": "2025-05-21 04:39:22", "date_publish": "2025-04-04 15:34:29", "description": "'We all want more variety' in Premiership - Critchley", "filename": "sport_articles_c74zx0zz3m8o_1747802362.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5046/live/f6df0f90-1168-11f0-a3a8-cd0c869b6aeb.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c74zx0zz3m8o_1747802362.html", "title": "'We all want more variety' in Premiership - Critchley", "title_page": "'We all want more variety' in Premiership - Critchley - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Neil Critchley says the current set-up in the Scottish top flight \"can't be right\" and \"can't be fair\" as discussions continue over possible restructuring.\nHearts are sixth in the league and need to win both of their pre-split matches - against Dundee United and Motherwell - to guarantee a top-half finish.\nCritchley took charge at Tynecastle in October and says he is not experienced enough in Scottish football to offer an opinion on what is the best route forwards, but believes some teams having more home games than others provides an imbalance.\n\"Obviously I've seen the reports this week about the possibility of the reconstruction of the league,\" he said. \"I don't yet feel as though I've been here long enough to offer my opinion.\n\"From the general consensus of everyone that I've spoken to, staff, supporters, they would like more teams in the league for competition for variety. If you get that, then I don't think the split happens.\n\"It doesn't seem quite right that you possibly play more games away or at home. That then suggests that the competition can't be fair, which for me, from a logical way of looking at things, can't be right.\n\"My general feeling is surely more teams, home and away. There's pros and cons for everything, isn't there?\n\"I know finances play a part in that as well, but variety is the spice of life and we all want a little bit more variety in the competition, I think.\"\nAfter Craig Halkett returned to the squad last weekend, fellow defenders Jamie McCart, Frankie Kent and Stephen Kingsley are all back in full training and pushing for involvement in Sunday's visit of Dundee United.\n\"So far, the players who've returned, there's been no complications, no issues,\" added Critchley.\n\"They've trained, they're feeling good. It's nice to have their presence on the pitch, their experience and seniority back into the group. They've got good voices around the dressing room.\n\"They add a lot to the group, and you can see how keen they are to be involved. I think they sense we could be in for a really good end to the season.\"", "url": "https://www.bbc.com/sport/articles/c74zx0zz3m8o"}