{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:37:00", "date_modify": "2025-05-21 05:37:00", "date_publish": "2025-04-01 07:50:48", "description": "Northern Ireland's world number two Rory McIlroy says he is dealing with an elbow issue in the run up to next week's Masters at Augusta.", "filename": "sport_golf_articles_cvgq377gz83o_1747805820.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/02e8/live/dfbc2f00-0eca-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_golf_articles_cvgq377gz83o_1747805820.html", "title": "Rory McIlroy at Masters: World number two dealing with elbow issue before Augusta National", "title_page": "Rory McIlroy at Masters: World number two dealing with elbow issue before Augusta National - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "World number two Rory McIlroy says he is dealing with an elbow issue in the run-up to next week's Masters.\nThe Northern Irishman finished joint fifth at the Houston Open on Sunday after an impressive six under par final round of 64 but said his elbow had been \"bothering\" him.\nThe Masters, which is the only one of golf's four majors that McIlroy has yet to win, takes place at Augusta National in Georgia from 10-13 April.\n\"My right elbow has been bothering me a little bit so I'll maybe just get some treatment on that and make sure that is OK going into Augusta,\" the 35-year-old told the Golf Channel.\n\"I've got my coach Michael Bannon coming in [on Monday], we'll do some work and make sure everything is in good shape for a week's time.\"\nMcIlroy, whose last major win came at the 2014 US PGA Championship, is looking to become the sixth player to complete a career Grand Slam at Augusta.\nHe famously let a final-round lead slip in 2011 before finishing tied for 15th and was second behind Scottie Scheffler three years ago.\nThe four-time major champion has had a strong start to 2025 with victories on the PGA Tour at the Pebble Beach Pro-Am and Players Championship.\n\"It was a solid week,\" McIlroy added on his fifth-place finish in Texas, which included two rounds of 64.\n\"[I] still don't think my game is 100% under the control I would want, but it's nice to have a week to work on some things.\"", "url": "https://www.bbc.com/sport/golf/articles/cvgq377gz83o"}