{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:48:57", "date_modify": "2025-05-21 05:48:57", "date_publish": "2025-04-02 11:13:09", "description": "Match official Tom Foley is to leave his role at the Rugby Football Union after 15 years' refereeing to \"pursue new opportunities\".", "filename": "sport_rugby-union_articles_cx20nwd2re1o_1747806537.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b33d/live/d2dffa00-0fb0-11f0-9f4f-1b858dcfe51a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cx20nwd2re1o_1747806537.html", "title": "Tom Foley: Rugby match official to leave role", "title_page": "Tom Foley: Rugby match official to leave role - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Match official Tom Foley is to leave his role at the Rugby Football Union after 15 years' refereeing to \"pursue new opportunities\".\nFoley, from Bath, began his career officiating in the National League and has been a referee in Premiership rugby since 2014, working on more than 250 matches.\nHe stepped down from international rugby in November 2023 after receiving a \"torrent of criticism and abuse\" working at the Rugby World Cup final as the television match official.\nHis career has seen him officiate in four Premiership finals as well as four Champions Cup finals in 2018, 2021, 2022 and 2023.\nFoley's first international match was in 2011 and he officiated in 48 Tests in total before retiring after the South Africa v New Zealand World Cup final in October 2023.\nDuring that game, All Blacks captain Sam Cane's yellow card upgraded to a red card following a 'bunker' review by foul play review officer Ben Whitehouse.\nAt the time, Foley said: \"The pressure and scrutiny I came under after the Rugby World Cup final, along with a torrent of criticism and abuse online, has helped to reaffirm that this is the right decision for me at this point in my life.\n\"While it's a privilege to be at the heart of some of the sport's most iconic moments, the increasing levels of vitriol, when the demands and expectation are so high, have led me to this moment.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/cx20nwd2re1o"}