{"authors": ["Matty Fairnie", "www.facebook.com"], "date_download": "2025-05-21 06:08:21", "date_modify": "2025-05-21 06:08:21", "date_publish": "2025-01-14 10:38:11", "description": "Hibernian fan column: 'From relegation contenders to sight-setting Europe'", "filename": "sport_articles_cy5kl94nkgeo_1747807701.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/fe62/live/87376770-d24b-11ef-9fd6-0be88a764111.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cy5kl94nkgeo_1747807701.html", "title": "Hibernian fan column: 'From relegation contenders to sight-setting Europe'", "title_page": "Hibernian fan column: 'From relegation contenders to sight-setting Europe' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "While it wasn't the edge-of-your-seat entertainment that Hibs and Rangers served up last weekend at Easter Road, the Hibees' 3-1 win over Motherwell had more than enough about it to leave the home fans buzzing as they headed out into the cold Leith night.\nA quick-fire double in the first half from Martin Boyle and Nectar Triantis put Hibs out of reach of a very lethargic Motherwell, and despite the visitors clawing a second half goal back, Hibs never looked likely to take anything other than three points from the match.\nThis was as competent and comfortable a win as you'll see in the top flight outside of Rangers and Celtic. Hibs are a side brimming with confidence and despite lining up without key players like Elie Youan, Joe Newell, Marvin Ekpiteta, Mykola Kuharevich, and Keiran Bowie, Hibs still had more than enough to keep Motherwell at bay.\nIt's testament to the work that David Gray has done with the side that a team that had looked like real relegation contenders are now looking up the table and thinking about whether a European spot is out of the question.\nNobody is getting carried away, though. We only have to look at Aberdeen to see how badly the wheels can come off and so for now, we are all just hoping that this great run carries on for a bit longer, starting with Clydebank in the Scottish Cup on Saturday.", "url": "https://www.bbc.com/sport/articles/cy5kl94nkgeo"}