{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:05:18", "date_modify": "2025-05-21 06:05:18", "date_publish": "2025-04-01 14:49:03", "description": "Thomas Frank press conference: Newcastle vs Brentford preview", "filename": "sport_football_articles_cd6jqzx6lg3o_1747807518.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a1f7/live/1ea09b30-4909-11ef-96a8-e710c6bfc866.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cd6jqzx6lg3o_1747807518.html", "title": "Thomas Frank press conference: Newcastle vs Brentford preview", "title_page": "Thomas Frank press conference: Newcastle vs Brentford preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The Brentford squad to face Newcastle is looking \"quite positive\", with full-back Michael Kayode available for selection again after a knee injury. However, Mathias Jensen \"is not ready yet\" after a recent illness meant he missed some training.\nRico Henry, Aaron Hickey and Gustavo Nunes all featured in the Bees' under-21s match on Monday, but Frank confirmed it is \"too short for them to be involved\" on Wednesday: \"All three looked good and ticked the physical boxes.\"\nHe added: \"Rico is the one who is furthest ahead of the three - I think he is close to returning to the squad. It could be for Chelsea [on Sunday], but let's see. Hickey is on track. He had some minor pain which limited his minutes - we're being extra cautious.\"\nOn longer-term knee injuries for Igor Thiago and Josh Dasilva: \"Thiago is progressing - going a little bit slower, but progressing. He is building the muscle volume and strength around the knee to make sure he ticks all of the strength markers. He is running, and he is also part training, so it's moving forward. Josh Dasilva is a little bit further off it than Igor.\"\nFrank said it was \"extremely important\" Christian Norgaard signed a new deal with the club: \"We've done quite well in the Premier League in the past four years and he's been an integral part of that. A big reason why we have done OK is our culture, and Norgaard is a big driver of that, on and off the pitch. At a club, there will always be transition of players in and out, but it's also important to have some stability.\"\nHe added: \"Maybe this season is his best so far... Sometimes, you don't see it or recognise it as much when you are a holding midfielder, but he is so important in terms of breaking up play, interceptions and playing forward when you win the ball back. This season, he has quite a few goals and assists, too.\"\nOn facing Carabao Cup winners Newcastle at St James' Park: \"I hope they had an unbelievable party because they deserved it. It's their first major cup in almost a lifetime. It's an incredible achievement for them and I'm really happy on their behalf. I'm pretty sure they will come flying out under the floodlights for a celebration.\"", "url": "https://www.bbc.com/sport/football/articles/cd6jqzx6lg3o"}