{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:45:39", "date_modify": "2025-05-21 07:45:39", "date_publish": "2025-03-28 08:47:13", "description": "Trent Alexander-Arnold: Three players who struggled after leaving Liverpool", "filename": "sport_football_articles_c86p8wxj9v6o_1747813539.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8db1/live/bd783220-0afd-11f0-94d4-6f954f5dcfa3.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c86p8wxj9v6o_1747813539.html", "title": "Three players who struggled after leaving Liverpool", "title_page": "Trent Alexander-Arnold: Three players who struggled after leaving Liverpool - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "If Trent Alexander-Arnold does become the latest to depart Anfield at the height of their powers for a European giant, he will be treading a familiar path.\nWhile the likes of Luis Suarez, Raheem Sterling and Xabi Alonso became great successes elsewhere, departure from Liverpool has not always guaranteed glory.\nBBC Sport looks at three players who did not find the grass greener away from Anfield.\nFernando Torres\nAfter arriving at Liverpool in 2007, Fernando Torres finished third in both the Ballon d'Or and Fifa World Player of the Year in 2008 and scored the winning goal for Spain in the Euros final.\nHe scored 81 goals in 142 games for the Reds before Chelsea broke the British transfer record by paying £50m to sign a 26-year-old Torres in January 2011.\nAfter controversy surrounding his exit, Torres' form dried up completely in west London. After taking 14 games to score his first goal, he went on to manage 45 in 172 games for Chelsea, and just 20 in 110 Premier League appearances.\nHe may have won the Champions League and FA Cup in 2012, but did not start either final and was an unused substitute in the latter.\nTorres later said on the move: \"I always said it was my fault. I was old enough to find solutions but I didn't do it. I won the trophies but I didn't do it every week.\"\nMichael Owen\nMichael Owen signed for Liverpool aged 12 and had won two Premier League Golden Boots by the age of 19. His meteoric rise continued and two years later he played a key role in a treble of the EFL Cup, FA Cup and Uefa Cup, becoming the fourth English player to win the Ballon d'Or.\nFollowing an injury-plagued 2003-04 season, Owen signed for Real Madrid but struggled for form and consistency among Real's Galaticos. He managed 16 goals in 45 games but returned to the Premier League with Newcastle just a year later for a club-record fee.\nHe never recovered his Liverpool form, playing just 79 games across four seasons at St James' Park before tarnishing his Anfield legacy by joining arch-rivals Manchester United.", "url": "https://www.bbc.com/sport/football/articles/c86p8wxj9v6o"}