{"authors": ["Amy Canavan", "www.facebook.com"], "date_download": "2025-05-20 12:16:30", "date_modify": "2025-05-20 12:16:30", "date_publish": "2023-08-04 15:06:11", "description": "BBC Sport Scotland takes a look at what we can expect from the Championship, arguably the most unpredictable league in Scotland.", "filename": "sport_football_66388728_1747743390.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/C318/production/_130644994_-609c1045-b8da-49db-9242-25a942b7c49b.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66388728_1747743390.html", "title": "Scottish Championship preview: What to expect from second tier this season", "title_page": "Scottish Championship preview: What to expect from second tier this season - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Are you still recovering from last season's climax to the Scottish Championship? It's understandable if so, because it was utterly enthralling.\nNine of the 10 teams entered their final fixture not knowing which division they would be playing in the following season.\nAfter a glut of goals and foggy Friday night conditions, Dundee shot off up to the big league while both Cove Rangers and Hamilton Academical dropped down into League 1.\nIn their place, the second tier welcomes Dundee United - although it isn't a party they especially wanted an invite to. Dunfermline Athletic and Airdrieonians, however, are happy to be back at the table again.\nAlong with the other eight teams, though, they have big shoes to fill if this edition of the Scottish Championship is to match its predecessor for drama.\nTo mark its return, BBC Sport Scotland takes a look at what we can expect from arguably the most unpredictable league in Scotland.\nA ball hasn't been kicked in the Championship and Jim Goodwin already finds himself under a heap of pressure to deliver.\nDundee United will be many people's favourite to bounce right back up, but that's not as easy as it sounds. On their last slip down a division, it took four years to rise again.\nThat sort of spell out of the top flight will not be tolerated again, however. Following their embarrassing League Cup group stage - which included a defeat to SPFL new boys, The Spartans - there really is no margin for error.\nThe Tangerines will kick off the league season at Gayfield on Friday night - live on BBC Scotland. A year ago to the day, they defeated AZ Alkmaar 1-0 at Tannadice. How quickly things can change.\nThe squad has had a little shake-up since then, too, with the United boss opting for those with experience on Scottish soil. Luring Ross Docherty and Kevin Holt from Partick Thistle - and making the former club captain - brings stability. With help from Liam Grimshaw and Declan Gallagher, it suggests a sound base.\nIf he can stay fit, Louis Moult should score plenty of goals to fire United towards the Premiership once more.\nArbroath will be aiming to keep the 31-year-old quiet on an opening night where few will expect anything from them. That's the way Dick Campbell's side like it though. They thrive off the underdog tag and it would be foolish to write them off...\nAnyone who has so much as glanced at the second tier in recent years will know better than to nail their colours to the mast. But you could do worse than back one of the horses that ran eventual winners Dundee close.\nQueen's Park matched the dark blues to the wire last term, but there is a very different shape to the Spiders this season. Not only will they finally be calling Lesser Hampden - now known as The City Stadium - home they are under the stewardship of Dutchman Robin Veldman, who promises \"attractive, dominant football\" after Owen Coyle's departure.\nAyr United may have lost the season's top scorer in Dipo Akinyemi, but that didn't stop Lee Bullen's side from romping their League Cup group, which included top-flight side St Johnstone. Acquiring former internationals Jamie Murphy and Aiden McGeady could help their quest for the Premiership too with, experience so important in this tight division.\nPartick Thistle were pipped on penalties against Ross County in an extraordinary play-off final. Kris Doolan has lost a few of his key men since then, though. Alongside the aforementioned Docherty and Holt, the talented pair of Scott Tiffoney and Kyle Turner have left for the Premiership with Dundee and Ross County respectively.\nIn his first full campaign at the helm, the former Thistle striker will be expected to mount a charge for the top division again - and no-one more than his captain Brian Graham wants that.\nAmong last season's last-weekend madness, Greenock Morton's sterling campaign drifted a little under the radar. Given the resources - or lack of - for Dougie Imrie, to fall just one point short of the play-offs was quite a feat. Cappielow will once again need to be a fortress should The Ton go close to a shockwave.\nBilly Dodds has said he has learned his lesson after Inverness Caledonian Thistle's season was hampered with injuries. Hopeful that a better break for players following their Scottish Cup final defeat will reduce the queue to the medical room, the Highland side are likely to be challengers for promotion.\nThe odd team out at the end of last season was Raith Rovers. Their spot in the second tier was secure before the climax of the campaign. It appears, on paper, that Ian Murray used that extra stress-free time to scoop a few significant signings that could finally edge the Rovers back into at least the play-offs.\nJosh Mullin impressed for Ayr United, while Jack Hamilton knows how to find the back of the net in the Championship. With Kevin Dabrowski in goal, former County captain Keith Watson and returning Rover Euan Murray in front of him, Stark's Park could feasibly be home to a special season.\nOne thing we know for sure is it'll host Fife derbies again, with Dunfermline Athletic in the second tier. James McPake's side stormed League 1 and will fancy their chances of making a dent in this division, so don't expect them to settle for just being there.\nThere hasn't been too much business at East End Park, but former St Johnstone and Rangers striker Michael O'Halloran is rarely shy in front of goal.\nSpeaking of goals, Airdrieonians are destined to be a thrilling addition to an already explosive league.\nRhys McCabe's side scored 82 goals in League 1, 19 more than the Pars. And who can forget their 7-2 aggregate play-off semi-final result against Falkirk?\nThe 31-year-old player-manager still chips in with a goal or two, including a penalty against Dundee on their way to League Cup group stage progression.\nThe Diamonds have lost Callum Smith to Raith, but with the likes of former Rangers striker Calum Gallagher and ex-Par Gabby McGill in the ranks, a moment of magic can be produced at the click of a finger.\nHas that sprinkling of 'what could be' whetted your appetite?\nIt won't be easy to top last season's tales, but if half of this preview comes to fruition, it won't be far short.", "url": "https://www.bbc.com/sport/football/66388728"}