{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:54:59", "date_modify": "2025-05-21 07:54:59", "date_publish": "2025-01-13 15:30:02", "description": "Celtic: Brendan Rodgers on Kuhn & Maeda fitness, Idah drought & Kyogo links", "filename": "sport_football_articles_cy7gddm5gjmo_1747814099.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1dbd/live/9ba3f3f0-d1af-11ef-bbe0-eb255759a6ac.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy7gddm5gjmo_1747814099.html", "title": "Rodgers on Kuhn & Maeda fitness, Idah drought & Kyogo links", "title_page": "Celtic: Brendan Rodgers on Kuhn & Maeda fitness, Idah drought & Kyogo links - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Nicolas Kuhn is back available for selection having missed the 4-1 win against Ross County, while fellow winger Daizen Maeda - who was also absent last time out - will be assessed on Tuesday before the game.\nRodgers says he is not concerned by Adam Idah's lack of goals currently, and backed the Republic of Ireland striker to come good in front of goal. Rodgers also pointed out how his teams do not rely on one player to score, and goals are spread throughout his squad.\nSays he is \"delighted\" for Johnny Kenny, who Rodgers believes has returned from his loan spell at Shamrock Rovers a better player. Says there will be a decision made soon as to whether his development is better served at Celtic or with another loan spell.\nOn Dundee, Rodgers expects Tony Docherty's team to be \"tight and compact\". Says it is about Celtic staying patient and taking chances when they arise.\nRodgers is determined to bring new players to Parkhead during the January window to provide a \"freshness\" for the second half of the season, but would not reveal how many signings he has in mind.\nWhen asked about speculation linking Kyogo with a move away from the club, Rodgers says the Japan striker is \"just the same guy\" and will be involved against Dundee. Suggested a perceived lack of goal celebration against Ross County may have been down to the amount of goals he scores or the freezing temperatures in Dingwall.", "url": "https://www.bbc.com/sport/football/articles/cy7gddm5gjmo"}