{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:56:32", "date_modify": "2025-05-20 11:56:32", "date_publish": "2023-07-26 13:58:32", "description": "Newcastle United: Fans and Supporters Trust on ticketing clarity", "filename": "sport_articles_cw5rn2d6l7ro_1747742192.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/80f6/live/815ab160-2bba-11ee-84fe-bd718738f15b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cw5rn2d6l7ro_1747742192.html", "title": "Newcastle United: Fans and Supporters Trust on ticketing clarity", "title_page": "Newcastle United: Fans and Supporters Trust on ticketing clarity - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Harry De Cosemo, BBC Sport\nNewcastle United Supporters Trust has called on the club to provide clarity “as soon as possible” with no tickets yet on sale for the opening game of the season.\nThe Magpies host Aston Villa on 12 August in the Premier League, but there's still been no announcement on when tickets will be made available.\nSign up for a membership scheme began on Wednesday, allowing fans to be entered into a ballot for home tickets, with no season tickets available for purchase.\nIt's not clear when the ballot for the Aston Villa game will take place, leaving fans frustrated.\n“The club needs to get tickets for the Aston Villa game, and the Manchester City game, on sale as soon as possible,” NUST chairman Greg Tomlinson told BBC Sport.\n“Fans need to book travel and hotels if they need them.\n“The shorter the period to the match means higher costs for our supporters.\n“Going forward, the club also needs to commit to a period of how long they will run the ballot for members, so fans can have certainty.”\nThis season also commences the use of a digital ticketing system, leading to confusion among fans about how it will work.\n“Information is needed on all those outstanding questions, including on the implementation and usability of the new digital ticketing process because it will be new for a lot of people,” said Tomlinson.\nThe club say their supporter liaison officer and box office are on hand for supporter queries and has remained in contact with the Trust. Tomlinson praised their communication and engagement.\nThe Trust has asked its members for feedback on the new scheme before making a public comment.", "url": "https://www.bbc.com/sport/articles/cw5rn2d6l7ro"}