{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:34:06", "date_modify": "2025-05-20 12:34:06", "date_publish": "2023-08-04 08:52:56", "description": "Leicester City podcast: Fans really excited for M69 derby return", "filename": "sport_articles_c843kdyr1npo_1747744446.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c0d5/live/a11d3240-32a2-11ee-a154-7d808d235ea7.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c843kdyr1npo_1747744446.html", "title": "Leicester City podcast: Fans really excited for M69 derby return", "title_page": "Leicester City podcast: Fans really excited for M69 derby return - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Leicester City kick off their Championship campaign on Sunday as they host Midlands rivals Coventry City at the King Power Stadium.\nFormer Coventry goalkeeper Steve Ogrizovic has been discussing the Foxes' first opponents on the When You're Smiling podcast: \"Even though we've lost quite a few players, we've also signed some exciting players. I get the feeling that there's some real excitement this year and you can see that with the number of season tickets that have been sold, it's a record.\n\"Players will change but our style of play won't, I don't even think the system will change. Mark Robins has had a lot of success playing three at the back with wing-backs, I think that will continue.\n\"The one thing that Robins needs to decide is whether he goes with a midfield of four players and plays just one striker, or if he plays two strikers with three midfielders in there. So that'll be the major thing that he'll be working on.\"\nThe last time Leicester City and Coventry City faced each other in any competition was back in the 2011-12 season.\nOgrizovic on the return of the M69 derby: \"It's one that has got the fans really excited. It's the first game of the season and we're playing the neighbours.\n\"For any Leicester City fan that thinks it's easy to get automatic promotion, it's not. It's going to be a little bit difficult for them.\"", "url": "https://www.bbc.com/sport/articles/c843kdyr1npo"}