{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:27:55", "date_modify": "2025-04-26 04:27:55", "date_publish": "2025-03-02 10:54:37", "description": "Ards manager John Bailie says that it is \"surreal\" for his Championship side to be in the semi-finals of the Irish Cup.", "filename": "sport_articles_c3w1dpz1zq6o_1745641675.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8566/live/80d406e0-f753-11ef-b0ec-f990ca2ebe14.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_c3w1dpz1zq6o_1745641675.html", "title": "'Surreal' for Ards to be in Irish Cup semi-final - Bailie", "title_page": "Irish Cup: 'Surreal' for Ards to be in Irish Cup semi-final - Bailie - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Ards manager John Bailie said that it is \"surreal\" for his Championship side to be in the semi-finals of the Irish Cup.\nThe north Down side beat Premiership Loughgall 2-0 on Saturday with goals from Michael Ruddy and Eamon Scannell helping them to victory in the quarter-final tie.\nThey are in the last four of the Irish Cup for the first time since 1995 and will face holders Cliftonville for a place in the final.\n\"It's a bit surreal, we have done really well in cup competitions in terms of performance levels when we've been tested against Premiership teams,\" Bailie told BBC Sport NI.\n\"Semi-final don't come along often for a club like Ards so it's going to be a big day.\"\nBailie believes Ards were worthy winners at Clandeboye Park as they set up another meeting with Cliftonville, who edged them on penalties in the County Antrim Shield earlier in the season.\n\"We came into the game fairly confident, not cocky but we knew we had a chance because Loughgall have been struggling,\" he added.\n\"We thoroughly deserved it in the end, to a man we were very good, everyone gave their all.\"", "url": "https://www.bbc.co.uk/sport/articles/c3w1dpz1zq6o"}