{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:38:45", "date_modify": "2025-05-21 06:38:45", "date_publish": "2025-02-08 11:47:13", "description": "Aberdeen working hard to 'find a way back' to good results - Thelin", "filename": "sport_articles_crr0pwjz2wko_1747809525.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/190a/live/da302800-e578-11ef-a497-e7c752cdc9f3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_crr0pwjz2wko_1747809525.html", "title": "Aberdeen working hard to 'find a way back' to good results", "title_page": "Aberdeen working hard to 'find a way back' to good results - Thelin - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Aberdeen manager Jimmy Thelin has vowed it will be a more aggressive Dons team that takes to the pitch against Dunfermline in the Scottish Cup on Sunday.\nThe Dons boss was very critical of his side following last weekend's 2-0 defeat at Hibs, a result which extended their winless league run to 14 games.\nAberdeen knocked out League Two side Elgin City in the previous round of the competition and Thelin is hoping for a similar outcome this weekend.\n\"I think it is another chance for us to change the way we approach the games and the identity we want to show for our fans,\" he said.\n\"They [Dunfermline] have changed manager, they are a good team but we are also a good team we have just been out of form for a while.\n\"How the players have responded this week and the training sessions with the new players, we are really ready to show our fans we can win this cup game.\n\"Sometimes in bad runs you have to look in the mirror and from there you need to take that responsibility and change quickly.\n\"We are looking forward to the game and it is going to be a more intense and aggressive Aberdeen on the pitch.\n\"We know we have to do better, that is clear to everyone so now we have to work together to fix it.\n\"But the support has been there every game at home and away and that is so important to get out of this difficult run that we keep pushing together, it is the board, it is the chairman, everybody around the team is working so hard together with the supporters to find a way back to good results again.\"", "url": "https://www.bbc.com/sport/articles/crr0pwjz2wko"}