{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:51:03", "date_modify": "2025-04-26 06:51:03", "date_publish": "2025-02-28 17:54:45", "description": "After an international week, the Women's Super League returns on Sunday with a busy day of six matches.", "filename": "sport_football_articles_cwyjjwxywmko_1745650263.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ee06/live/800cd080-f5f9-11ef-9e61-71ee71f26eb1.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cwyjjwxywmko_1745650263.html", "title": "Five talking points as WSL returns after international break", "title_page": "Five talking points as WSL returns after international break - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "After an international week, the Women's Super League returns on Sunday with a busy day of six matches.\nUnbeaten league leaders Chelsea resume their push for a sixth successive WSL title, holding a seven-point lead at the top with eight league games to go.\nSunday's matches are:\nManchester United v Leicester City (12:30 GMT - live on BBC iPlayer)\nAston Villa v Everton (14:00 GMT)\nCrystal Palace v Liverpool (14:00 GMT)\nTottenham v Manchester City (14:00 GMT)\nBrighton v Chelsea (15:00 GMT)\nArsenal v West Ham (17:30 GMT)\nHere are some of the talking points ahead of this weekend's games.\nChelsea fans have waited to see world record signing Naomi Girma make her first Blues appearance, and she may finally make her debut this weekend.\nGirma, who Chelsea signed from San Diego Wave for £900,000 in January, has yet to make an appearance as she has been recovering from a calf injury.\nBut she could be set to take to the field on Sunday, when Chelsea take on Brighton, with manager Sonia Bompastor telling a news conference on Friday that defender Girma \"should\" be in the squad.\nChelsea are seven points clear at the top of the table and are the only side still unbeaten. Their opponents, Brighton, are fifth and have not won in their past six league games.\nHowever, Brighton put up a good showing when these sides met earlier in the season and are bolstered by the return of former Chelsea forward Fran Kirby from injury.\n\"We'll go in with belief,\" said England international Kirby. \"The last game against Chelsea was probably one of the best performances of the season. Hopefully we can learn from that game. It's going to be a case of every player doing their job - and a half.\"\nLiverpool and Crystal Palace go head to head on Sunday as the clubs begin new phases in the season after sacking Matt Beard and Laura Kaminski this week.\nLiverpool dismissed manager Beard on Thursday, with the Reds seventh in the WSL table, while bottom-of-the-league Palace announced Kaminski's exit on Friday.\nAmber Whiteley has taken interim charge of the Reds, with a search for a new manager already under way.\nWhiteley said in Friday's pre-match news conference she wants the job on a permanent basis.\n\"I will put my name in the hat, but let's get Palace out of the way first and I can think a bit longer term after that,\" she said.\n\"I am in a far better position having had the time with Matt and working under him. I'm so grateful to Matt for everything that he has given to me personally over the last three and a bit years. I'm going to miss him.\"\nPalace, who have only won one league match and collected six league points all season, confirmed experienced Norwegian coach Leif Smerud as their new manager.\nThe international break has given teams a break from regular football, but when Manchester City play Tottenham on Sunday it marks the beginning of a gruelling run of eight games in 29 days for Gareth Taylor's City side.\nThey have to contest the League Cup final, both legs of their Women's Champions League quarter-final and a league game against Chelsea, an FA Cup quarter-final against Aston Villa, and other league games against West Ham and Brighton.\nIt is unsurprising, therefore, that manager Taylor says it will be \"really tough\" for his side to get the results they want in March.\n\"There's a lot going on in this month and I think the conversation will certainly be 'attack the next game, don't try and give too much thought to what's further down the road',\" Taylor said.\nThe situation is made even more difficult by the number of injuries in the squad – including a fresh hamstring issue for Rebecca Knaak – and players having departed.\nLaura Coombs, Lauren Hemp and Alex Greenwood potentially completing their recoveries from injury could help, but that won't stop it being a tricky few weeks.\nLeicester gained only their third win of the WSL season on 16 February with a 3-0 victory over Aston Villa to move up to 10th, six points clear of bottom-placed Crystal Palace.\nBut the Foxes' task could not be any tougher in the coming days, as they meet both the top two away from home in the space of four days.\nThey play on Sunday away against a Manchester United side who have won six WSL games in a row. After that, Amandine Miquel's Leicester travel to runaway leaders Chelsea, although the Foxes are the only side to take points off the Blues this season, drawing 1-1 in December.\n\"The team is ready, they are fighting,\" said Miquel on Thursday. \"We have two games so close so it will be an occasion for most of the players to play. We play opponents of good quality so we will make rotations to be able to have the best teams that we can put on the pitch.\n\"We want to go to every game like we can win. If we don't feel like that, we might as well not go and stay here. We're going to go for both games to do our best to see if we can get a point or two.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cwyjjwxywmko"}