{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:34:03", "date_modify": "2025-05-21 07:34:03", "date_publish": "2025-01-25 00:00:00", "description": "Stoke City and Oxford United play out a scoreless draw in the Championship where the U's struck the woodwork late on and the home side had calls for a penalty rejected.", "filename": "sport_football_live_c14nxpnexv1t_1747812843.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c14nxpnexv1t_1747812843.html", "title": "Stoke City 0-0 Oxford United: Ole Romeny hits crossbar late on in stalemate", "title_page": "Stoke City 0-0 Oxford United: Ole Romeny hits crossbar late on in stalemate - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Stoke City and Oxford United played out a goalless draw in the Championship where the U's struck the woodwork late on and the home side had calls for a penalty rejected.\nSubstitute Ole Romeny, making his debut after arriving from FC Utrecht earlier in the month, had a glorious chance to win the game for Oxford with 10 minutes remaining but his effort on an empty net from a tight angle struck the crossbar.\nPotters striker Nathan Lowe was barged to the floor earlier on in the match while waiting to control a pass in the box, but referee Farai Hallam did not see it as a penalty.\nThe result had minimal impact on each side's league position but Gary Rowett extended his unbeaten run to eight league games, since being appointed in December. Mark Robins is still waiting for his first victory as Stoke boss.\nOxford came closest to scoring first in the opening 15 minutes of the game, Przemyslaw Placheta picked up the ball outside the right-hand area of the box and found Cameron Brannagan in space.\nBrannagan then had a shot blocked before pouncing on the deflection for a second effort that forced a really good save out of Viktor Johansson, diving low to his left.\nThe U's then passed themselves into trouble minutes later. Peter Kioso under-hit a back pass from the right touchline and into the path of Stoke's Andrew Moran who had a strike saved by Oxford keeper Jamie Cumming.\nIn the second half, the Potters called for a penalty when a looping pass made its way towards Lowe who looked to be barged to the floor by Kioso in the box as he waited for the ball to come down.\nBut referee Hallam was not convinced the incident was deserving of a spot-kick and waved for play to continue.\nTom Bradshaw played just over an hour in his first start since signing from Millwall and had a decent scoring opportunity after being played through but his effort was smothered by Stoke stopper Johansson.\nLowe was then played through on goal and had the ball in the back of the net with a tidy finish but play was called back as the assistant referee had his flag raised for offside.\nThere was a big chance for Oxford to win the game late on when Stoke keeper Johansson tried to usher the ball out of play on the left touchline but was caught out by substitute Romeny who had chased him down.\nThe forward nabbed the ball off the goalkeeper and ran through with the goal empty from a tight angle, but his shot struck the woodwork and bounced away from danger.\nOxford United boss Gary Rowett speaking to BBC Radio Oxford:\n\"We certainly could have had all three points with that chance right at the end.\n\"Maybe because it's his (Ole Romeny's) first game and a chance like that he snatched at it a little bit but he is very unlucky.\n\"I thought it was going to be a really tough game but we navigated it quite well, we had more possession, chances and the bigger of the chances.\n\"I never felt like we were massively in trouble but then there wasn't a huge amount in the game, we take the clean sheet and another point away from home.\"", "url": "https://www.bbc.com/sport/football/live/c14nxpnexv1t"}