{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:06:31", "date_modify": "2025-05-21 07:06:31", "date_publish": "2025-03-29 00:00:00", "description": "Follow live text commentary, score updates and match stats from Stoke City v Queens Park Rangers in the Championship", "filename": "sport_football_live_c8e7z7z154rt_1747811191.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/dbfc/live/17050260-0cba-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c8e7z7z154rt_1747811191.html", "title": "Stoke City v Queens Park Rangers: Championship stats & head-to-head", "title_page": "Stoke City v Queens Park Rangers: Championship stats & head-to-head - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Stoke City bolstered their chances of Championship survival with a convincing 3-1 win over Queens Park Rangers.\nBae Jun-ho slid in the Potters' opener from close range thanks to Junior Tchamadeu's low cross before the right back got a goal of his own goal from the edge of the area just before half-time.\nIt went bad from worse for QPR soon after the restart as Million Manhoef rounded goalkeeper Paul Nardi to grab Stoke's third, but the visitors did at least reduce the deficit in the final quarter through substitute Yang Min-hyeok.\nA vital win for the relegation-threatened Potters moves them up to 18th on 42 points, three behind 15th-placed QPR who have now picked up just one point in their past five games.\nAfter a late defeat to Millwall before the international break, Stoke manager Mark Robins would have been delighted by his team's early dominance, evidenced by the Potters' 14 first-half touches in QPR's box, compared to the visitors' zero.\nQPR were first threatened by the impressive right side combination of Tchamadeu and Manhoef in the 13th minute but the former's cross just missed the oncoming Stoke attackers.\nThe same link up made the difference after 21 minutes as Tchamadeu received another pass from Manhoef in a swift counter attack before flashing a low ball into the box for left winger Bae Jun-ho to smash in the opener.\nThe provider turned scorer in the 44th minute as London-born Tchamadeu followed up Manhoef's saved effort with a sweet left-footed strike into the bottom right corner.\nIt was three within 10 minutes of the second half as Lewis Baker's incisive ball, threaded between QPR's centre-backs, found Manhoef to round Nardi and finish.\nOne thing former Coventry boss Robins would have been upset with was the failure to extend the lead further as Stoke missed a host of chances before 18-year-old Tottenham loanee Yang Min-hyeok popped up for QPR to create a nervy finale.\nThe South Korean fizzed in a left-footed shot past Sweden goalkeeper Viktor Johansson into the far corner but despite Stoke tiring towards the end, there was to be no famous comeback for Marti Cifuentes' side.\nStoke City's Million Manhoef told BBC Radio Stoke:\n\"This is the first time I've played 90 minutes. At the end of the game of course I felt tired but it's the first time for this and I'm very happy. This is the first time where I felt good.\n\"Also, I was sick for a week, my ankle was blown up so it was not how I wanted to come back but it's getting better and now I'm fit, happy to score and happy to play a good game from the start.\n\"I think since I came back I didn't play good from the start so I'm happy to have that back and now I want to keep going.\"\nQPR boss Marti Cifuentes:\n\"We were 70 minutes late into the game today. Poor performance and even though we tried to show some pride, I think it was far too late.\n\"They played through us, which is the main principle – to not let the opposition play through us – and they scored two goals in a similar situation.\n\"I would have made 11 (half-time substitutions) if I could have done it, I was not happy and this is on me. I think that some of the players who came from the bench helped us to get a little bit better, but the start was not very high.\"", "url": "https://www.bbc.com/sport/football/live/c8e7z7z154rt"}