{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:06:00", "date_modify": "2025-05-19 15:06:00", "date_publish": "2015-02-26 18:11:28", "description": "The demise of Parma is 'like the sinking of the Titanic', the Italian club's former striker Alessandro Melli says.", "filename": "sport_football_31646944_1747667160.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81270000/jpg/_81270664_parma.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31646944_1747667160.html", "title": "Ex-Parma striker Alessandro Melli calls club's situation 'dramatic'", "title_page": "Ex-Parma striker Alessandro Melli calls club's situation 'dramatic' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The demise of two-time Uefa Cup winners Parma has been likened to the sinking of the Titanic by the club's former striker Alessandro Melli.\nSerie A's bottom club has run out of money and was forced to call off the 22 February home game with Udinese as it could not pay for stewards.\n\"The situation's pretty dramatic, every day there's bad news,\" Melli told BBC World Service Sport.\n\"Every day they take a piece of Parma away.\"\nParma finished sixth in Serie A last season, under the guidance of former Italy midfielder Roberto Donadoni, to secure European qualification for the first time since 2007.\nBut the 1995 and 1999 Uefa Cup winners were prevented from competing in the Europa League for not meeting Uefa's club licensing criteria because of unpaid bills.\nPlayers and staff continue to go without their salaries.\nMelli, 45, was part of Parma's 1993 European Cup Winners' Cup success and is now the club's general manager.\n\"In these years, and especially in the last year, I've always thought Parma was like the Titanic,\" said the Italian, who also helped Parma win the Uefa Super Cup in 1993.\n\"There were people who believed they were travelling first class and then other people who were doing all the hard, dirty work without being paid.\n\"I've always thought that just like the famous tragedy and in the movie, sooner or later an iceberg would come and hit us.\n\"And the problems we had with the Uefa licensing last year, that excluded us from the Europa League, was precisely that iceberg, the beginning of the end.\"\nParma, Serie A runners-up in 1996-97, have just 10 points from 23 Serie A games.\nThey are 13 points from safety with 15 matches remaining.", "url": "https://www.bbc.com/sport/football/31646944"}