{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:42:27", "date_modify": "2025-05-19 14:42:27", "date_publish": "2017-08-19 19:08:03", "description": "Leigh beat Catalans Dragons for their first time to boost their hopes of extending their Super League stay.", "filename": "sport_rugby-league_40938590_1747665747.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/11E59/production/_97450337_higson_sw.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_rugby-league_40938590_1747665747.html", "title": "Qualifiers: Catalans Dragons 6-30 Leigh Centurions", "title_page": "Qualifiers: Catalans Dragons 6-30 Leigh Centurions - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Published\n19 August 2017\nThe Qualifiers\nLeigh beat Catalans Dragons for the first time to boost their hopes of extending their Super League stay.\nAdam Higson ran in two first-half tries to help put Leigh - the only side to be promoted to the top-flight via the Qualifiers when they went up last year - 10-0 up at the break.\nCorey Paterson and Josh Drinkwater grabbed further scores before Brayden Wiliame went in for Dragons' only try.\nPaterson's second completed the win, leaving Catalans fifth in the table.\nThe French side have earned just one win from three games as they battle to avoid relegation, and can be overtaken in the Qualifiers table by Championship clubs London Broncos and Featherstone on Sunday if either one seals victory.\nCatalans Dragons: Tierney; Duport, Inu, Wiliame, Yaha; Walsh, Myler; Moa, Aiton, Casty, Anderson, Horo, Bird.\nReplacements: Bousquet; Garcia, Baitieri, Margalet.\nLeigh Centurions: McNally; Dawson, Brown, Langi, Higson, Reynolds, Drinkwater; Hansen, Mortimer, Maria, Paterson, Vea, Burr.\nReplacements: Higham, Stewart, Hopkins, Richards.\nReferee: Phil Bentham.\nAround the BBC\nWatch the Super League Show on BBC iPlayer\nWhat's on BBC Sport?\n5 live podcast\nRelated internet links\nCatalans Dragons\nLeigh Centurions\nRugby league commentaries\nRFL\nSuper League\nThe BBC's Super League Show on Facebook (requires registration)\nThe BBC is not responsible for the content of external sites.", "url": "https://www.bbc.com/sport/rugby-league/40938590"}