{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:44:54", "date_modify": "2025-05-21 05:44:54", "date_publish": "2025-04-02 14:20:55", "description": "Middlesbrough boss Michael Carrick says his side will not be distracted by issues between Blackburn Rovers supporters and their owners as they head to Ewood Park on Friday evening.", "filename": "sport_football_articles_c3ev847dqezo_1747806294.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f8de/live/dd23e420-0fcb-11f0-b163-ebec0b1bfc32.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c3ev847dqezo_1747806294.html", "title": "Middlesbrough: 'Boro won't get caught up in Rovers dispute", "title_page": "Middlesbrough: 'Boro won't get caught up in Rovers dispute - Michael Carrick - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Middlesbrough boss Michael Carrick says his side will not be distracted by the ongoing issues between the Blackburn Rovers supporters and their owners as they head to Ewood Park on Friday evening (20:00 BST).\nRovers fan groups have asked senior club officials to steer clear of Blackburn's remaining games this season amid discontent over the club's management.\nCarrick acknowledges the tense atmosphere surrounding their opponents could affect the game but believes the side just need to have \"tunnel vision\" to find success.\n\"It's not really for us to get caught up in or almost think about too much.\n\"When you go away from home, most of the time it's about managing the atmosphere and trying to get up in the game or take control of the game.\n\"It's more about us and preparing for the game, training right, improving on last week and the game is going to take care of itself.\"\nBoro will still be hampered with injuries, with much-needed defenders not ready to make the trip.\nDael Fry and George Edmundson are \"getting there\" but won't be ready for Friday, while Luke Ayling \"isn't totally written off\" but could be out for the remainder of the season with an ankle injury.", "url": "https://www.bbc.com/sport/football/articles/c3ev847dqezo"}