{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:37:56", "date_modify": "2025-05-21 06:37:56", "date_publish": "2025-04-03 00:00:00", "description": "Chelsea moved back into the Premier League top four with a win that piled further pressure on Tottenham boss Ange Postecoglou.", "filename": "sport_football_live_ce3q1n1l023t_1747809476.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/28c1/live/6dbe3be0-10c9-11f0-b234-07dc7691c360.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_ce3q1n1l023t_1747809476.html", "title": "Chelsea 1-0 Tottenham LIVE: Blues boost top-four hopes to pile pressure on Postecoglou", "title_page": "Chelsea 1-0 Tottenham LIVE: Blues boost top-four hopes to pile pressure on Postecoglou - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Thanks and goodbye\nFT: Chelsea 1-0 Tottenham\nThat is all for tonight as Chelsea got a vital three points to move into the top four with a tight 1-0 win over Tottenham on another difficult night for Ange Postecoglou.\nThanks as always for joining us and for your comments.\nUntil next time, bye for now.\nChelsea beat Spurs to move back into top four - read the report\nFT: Chelsea 1-0 Tottenham\nEmily Salley\nBBC Sport\nEnzo Fernandez scored as Chelsea beat Tottenham to move into the Premier League's top four and boost their hopes of Champions League football next season.\nDefeat for Spurs piled more pressure on head coach Ange Postecoglou - whose side stay 14th, and remain on course to finish outside the top 10 for the first time since 2008.\nThe Blues, boosted by the returns from injury of Cole Palmer and Nicolas Jackson, dominated proceedings at Stamford Bridge, but they were frustrated by a goalless first-half having missed plenty of opportunities.\nThey carried the same threat after the interval and were rewarded in the 50th minute when Fernandez headed home Palmer's inch-perfect delivery.\nMoises Caicedo swept a crisp volley past Guglielmo Vicario moments later, but the goal was ruled out for a marginal offside in the build-up following a four-minute VAR review.\nTottenham then had an equaliser ruled out after substitute Pape Matar Sarr fired in from 20 yards out.\nReferee Craig Pawson, advised by VAR to have a look at the pitchside monitor, overturned his decision after watching the Spurs midfielder catch Caicedo with his studs before taking aim.\nThe result moves Chelsea to fourth in the Premier League, knocking reigning champions Manchester City down to fifth and Newcastle to sixth.\nPost\nFT: Chelsea 1-0 Tottenham\nTottenham boss Ange Postecoglou on claims he cupped his ears towards Spurs fans after Pape Sarr thought he had equalised. He had earlier been jeered for making the change,\nHe said: \"Oh, jeez mate. It is incredible, we just scored, I wanted to hear them cheer, I wanted them to get excited, I wanted to win the game with the momentum, it wasn't the first time my substitution was booed.\"\nWhen pressed on whether it was a mistake to do it: \"I am at some disconnect with the world these days - I don't know. Maybe you are right.\"\n'VAR should've only taken 30 seconds to rule out Spurs goal'\nFT: Chelsea 1-0 Tottenham\nJamie Redknapp\nFormer Tottenham midfielder on Sky Sports\nOn Ange Postecoglou's VAR complaints: \"It [Tottenham's goal being disallowed] was clear and obvious, I would say that.\n\"I totally get his frustration because it does border on re-refereeing the game, but ultimately, it got to the right decision. How he [Craig Pawson] had to stand at the screen and look at it as long as he did when you can see it's a blatant foul. He catches him high, it's quite a nasty foul to be honest.\n\"This is what we put VAR in for, to help the referee. but it should be 30 seconds, go and look at it. You should understand the game enough.\"\nVAR 'killing the spectacle of the game' - Postecoglou\nFT: Chelsea 1-0 Tottenham\nTottenham Hotspur\nTottenham boss Ange Postecoglou on VAR, speaking to Sky Sports: \"It's killing the game mate, it's not the same game it used to be. We all sat on our couches last night and watched TV [when Everton's James Tarkowski was not sent off for a high challenge on Liverpool's Alexis Mac Allister] and I guarantee you if Jarred Gillett was VAR last night it would've been a different outcome so you just don't know what we're going to get.\n\"You are standing around for 12 minutes. It's just killing the game, but no-one cares about that, they just love the drama and controversy and I'm sure there will be 24 hours discussion about it and that's what everyone wants - they're not really interested that it's killing the spectacle of the game.\n\"If a referee sees that and he needs to see it for six minutes, what's clear and obvious about it?\n\"Last night we were all sat on our couches and saw one replay and thought 'oh my god'. Tonight we sat there and were waiting for six minutes for something that VAR official Jarred Gillett thought was clear and obvious - it's crazy, it's madness. We accept it and have to take the fall out from it. Clear and obvious? What does that suggest, that it's on the first replay. That's why the game is going the way it is.\"\n'Last 10 minutes showed our togetherness'\nFT: Chelsea 1-0 Tottenham\nChelsea\nChelsea manager Enzo Maresca speaking to Sky Sports: \"The result is an important part because we are close to the end of the season. At the same time we try to achieve the result playing in the way we want to play. At some moments the team was very good, then we don't work every day, we don't like to finish the game like we did in the last five minutes. If we want to become an important team we need to win in a dirty way, ugly way and [I'm] quite happy.\n\"Overall, I think it was a very good performance, I think we deserved to win the game we created enough chances already in the first half to score. In the last 10 minutes I think the team showed effort, togetherness, spirit and it's something that we need.\n\"If you measure on the result then for sure if we achieve Champions League is an important thing but from my point of view, I try to see how we improve day by day and I can see, since the first day, I think the team is getting better and better.\"\n'We let in a disappointing goal'\nFT: Chelsea 1-0 Tottenham\nTottenham Hotspur\nTottenham boss Ange Postecoglou, speaking to Sky Sports, said: \"It's a difficult night, a tight game and not an easy place to come. We had to work hard to stay in the game, we let in a disappointing goal then fought our way back into the game but weren't able to get anything out of it.\n\"It is still a work in progress, the first time we had the whole group in together and in the final third we could've been a bit cleaner with our football but for the most part we handled it quite well.\n\"It's a tough ask coming here, there was still enough there tonight to show the lads are getting back to the level we need.\"\n'The fans got us through that'\nFT: Chelsea 1-0 Tottenham\nChelsea\nChelsea defender Levi Colwill speaking to Sky Sports: \"It was a tough one out there but it meant everything to me, the boys and the fans, especially. The fans were amazing out there. they got us through that I can tell you that.\n\"It was giving the Tottenham fans stick and that was what we needed. That gave us the extra 10 minutes, the runs at the end and the boys were buzzing from it. That was amazing.\n\"We felt comfortable. We knew how they play and we knew how to hurt them. Today we played really well and we could've scored way more chances.\n\"Everyone always says I have a load of potential but I don't think potential means anything, you've got to show it every game. This season, at times, I have at times I haven't. I need to keep progressing and learning because I know where I can be and under this gaffer he'll take me there I'm sure.\n\"We need to win games at the end of the day. we're fighting for Champions League. To win games we have to change style sometimes. We knew they have a high line and we have Nicolas Jackson. He's a huge threat, to feet and in behind and we know if we play to his advantages we'll score goals and today we did score goals through that.\"", "url": "https://www.bbc.com/sport/football/live/ce3q1n1l023t"}