{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:19:55", "date_modify": "2025-05-21 04:19:55", "date_publish": "2025-01-24 00:00:00", "description": "Watch live action from the World Indoor Bowls Championships at Potters Resort.", "filename": "sport_bowls_live_cewxjkdzezrt_1747801195.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_bowls_live_cewxjkdzezrt_1747801195.html", "title": "World Indoor Bowls Championships LIVE: Watch live action from the open singles quarter-finals from Potters Resort", "title_page": "World Indoor Bowls Championships LIVE: Watch live action from the open singles quarter-finals from Potters Resort - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Holder Anderson beaten by Gourlay in world quarters\nReigning champion Stewart Anderson has been knocked out of the World Indoor Bowls by fellow Scot David Gourlay in the quarter-finals.\nGourlay, who lifted the trophy in 1996, beat the top seed and three-time champion 8-6 9-7 at Potters in Great Yarmouth.\nThe eighth seed will face Robert Paxton in Saturday's semi-finals after the fifth-seeded 2020 champion beat fellow Englishman Les Gillett, seeded four and who won it in 2022, 10-4 7-5.\nIn the other all-England quarter-final, two-time champion Mark Dawes, the sixth seed, edged out qualifier Paul Hartley 5-7 7-6 2-0.\nDawes awaits the winner of Friday's final quarter-final, with five-time champion Paul Foster, seeded two, seeking revenge for his mixed doubles final defeat when he takes on fellow Scot Jason Banks, who is seeded seven.\nForrest clinches World Indoor Bowls singles title\nJulie Forrest edged out Scottish compatriot Beth Riva to win the women's singles title at the World Indoor Bowls Championships in Norfolk.\nForrest, 56, triumphed 11-8 8-9 2-0 to win the title for the third time after singles successes at Yarmouth in 2019 and 2020.\n\"I dug deep again. It was a matter of keeping my head and keep going,\" Forrest told BBC Sport.\n\"My brother-in-law died six months ago and I felt he was here with me. I feel he was there getting me through the games.\"\nRiva won the mixed doubles title on Tuesday alongside Jason Banks in what was the 21-year-old law student's first time competing in the tournament.\n\"I am delighted to compete in a final like that and it's been a great week. I've enjoyed every moment,\" Riva said.\n\"I was beaten today by the better player - Julie was unbelievably good. No matter how close I was getting my balls she was determined. She is a worthy winner and a legend who deserves the trophy.\"\nWorld Indoor Bowls Championships\nBBC Sport\nThe prestigious World Indoor Bowls Championships will be held at Potters Resorts, Hopton-on-Sea, Great Yarmouth, England, for the 27th year.\nPotters is to bowls what The Crucible Theatre is to snooker, and Ally Pally is to darts, with the best of the best coming to compete over 16 days of competition.\nThe favourite to win the open singles title this year is defending champion Stewart Anderson, who beat fellow Scot Alex Marshall in the final last January.\nHow to get into bowls\nBBC Sport\nThere's Lawn Bowls, which you'll see in the Commonwealth Games and is played on a flat rectangular bowling green. The aim is simple - to get your bowls as close as possible to a smaller target ball called the 'jack'.\nCrown Green Bowls is similar, but is played on a square bowling green which is made of natural grass, with a larger jack. There is a raised area or 'crown' in the green that makes the ground uneven, making it a bit more difficult.\nIndoor Bowls again offers a different surface, played on a carpeted area.How do I start?\nCheck out Scottish Bowls, external or Bowls Scotland, external, Bowls Wales, external, Irish Bowling Association, external and Bowls England, external for clubs in your area.\nYou can also try the British Crown Green Bowling Association, external or the English, external, Scottish, external or Irish, external Indoor Bowls Associations.", "url": "https://www.bbc.com/sport/bowls/live/cewxjkdzezrt"}