{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:55:31", "date_modify": "2025-05-20 13:55:31", "date_publish": "2023-07-31 11:20:56", "description": "West Ham: Is Harry Maguire worth pursuing?", "filename": "sport_articles_c04xx944yzyo_1747749331.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0d63/live/5f700570-2efb-11ee-999b-b74dedc428d3.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c04xx944yzyo_1747749331.html", "title": "West Ham: Is Harry Maguire worth pursuing?", "title_page": "West Ham: Is Harry Maguire worth pursuing? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "After West Ham had a bid turned down for Harry Maguire, we asked if they should still pursue the Manchester United defender.\nHere are some of your responses:\nLes Cordery: Harry Maguire is not for West Ham - we need a centre-forward as a priority and Joao Palhinha from Fulham.\nSimon: West Ham transfer news? There isn't any. So close to the season starting and the club is a mess. A director of football who's trying, and being hindered by Sullivan and Moyes. Our best player sold. I'm just hoping there are three worse teams than us this season.\nArthurMo: I do not think Maguire is the right choice for West Ham. He is too expensive for what he can offer and how many years will he have left? I would prefer someone younger, nearly there but developing. After all we need to steadily grow to become a dominant team.\nDavid: Player of limited ability, I was surprised when he went to Man Utd. Thinks he is better than he is, not versatile enough, not right for West ham.\nSteve: What a shambolic management team. Why would anyone want to come to us? Get rid of them all. We are two weeks away from the new season and the best we can do is Harry Maguire. No thanks - he is arrogant and does not want to come here - leave him where he is.\nRay: I'd rather we went for McTominay than Maguire. He's far more useful as a defensive midfielder and is very underrated at Manchester United. Having him alongside Ward-Prowse would be amazing. Then we definitely need a striker. We have talent coming through the ranks but I'm not sure if they are ready.", "url": "https://www.bbc.com/sport/articles/c04xx944yzyo"}