{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:13:15", "date_modify": "2025-04-26 04:13:15", "date_publish": "2025-03-04 11:43:33", "description": "Bournemouth: FA Cup 'a big opportunity for Wembley' - Iraola", "filename": "sport_football_articles_c5yrlrj0nd1o_1745640795.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/94f6/live/e9118220-f8e6-11ef-9628-add78e51db09.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c5yrlrj0nd1o_1745640795.html", "title": "Bournemouth: FA Cup 'a big opportunity for Wembley'", "title_page": "Bournemouth: FA Cup 'a big opportunity for Wembley' - Iraola - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Bournemouth boss Andoni Iraola says the Cherries \"obviously\" want to go all the way in the FA Cup, but the club haven't \"been the luckiest in the draw\" as the south coast side will have to overcome Manchester City for a trip to Wembley and a place in the semi-finals.\nSpeaking on BBC Radio 5 Live Breakfast about drawing the reigning Premier League champions, Iraola said: \"I think we've not been very lucky, to be honest.\n\"I think there was probably only one (situation) worse, that was City away. At least we have to play them at home - but it's a big challenge for us. It's a big opportunity and we will give our best, and see if it's enough to be in the semi-finals.\"\nThe Spaniard also said it's \"a personal goal\" of his own to get the club to Wembley, and he's aiming for the Cherries to go all the way.\n\"Yeah, obviously,\" he said after being asked if it's nice to still have a chance of winning the trophy.\n\"I think Bournemouth has never achieved to arrive to the semi-finals.\n\"It's a challenge that we have, a big opportunity also to play in Wembley. That is a personal goal also for me individually, for the team, for the club. But it is true that probably we've not been the luckiest in the draw.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c5yrlrj0nd1o"}