{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:16:43", "date_modify": "2025-05-21 07:16:43", "date_publish": "2025-05-20 10:25:17", "description": "Burnley release Nathan Redmond and Jonjo Shelvey, but sign four on-loan players permanently, following their promotion to the Premier League.", "filename": "sport_football_articles_c9911x4ygjro_1747811803.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7095/live/40409e60-355e-11f0-96c3-cf669419a2b0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c9911x4ygjro_1747811803.html", "title": "Burnley release Nathan Redmond and Jonjo Shelvey after promotion to Premier League", "title_page": "Burnley release Nathan Redmond and Jonjo Shelvey after promotion to Premier League - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Burnley have released Nathan Redmond and Jonjo Shelvey following promotion to the Premier League - but have also completed the permanent signings of four on-loan players.\nRedmond, 31, had an injury-hit spell with the Clarets, missing most of 2024 with a hamstring injury along with another period out due to a calf issue.\nIn total, he made 16 appearances in all competitions, including just three this season, with two of those coming in the Championship.\nShelvey, 33, joined in January on a short-term deal, following the expiration of his contract with Turkish side Eyupspor, and made four Burnley appearances.\nHowever, loan players Jaidon Anthony, Marcus Edwards, Bashir Humphreys and Zian Flemming will all join the club permanently this summer.\nAnthony, 25, made 43 appearances on loan from Bournemouth and scored eight goals, while 26-year-old Edwards scored twice in 16 appearances after joining from Portuguese side Sporting in January.\nDefender Humphreys made 28 appearances after joining from Chelsea, and Millwall loanee Flemming scored 14 goals in 37 games to help power the club to automatic promotion.\nThe club said they are in discussions with out-of-contract trio Josh Brownhill, CJ Egan-Riley and Ashley Barnes, while Jeremy Sarmiento will return to Brighton & Hove Albion after the conclusion of his spell on loan.", "url": "https://www.bbc.com/sport/football/articles/c9911x4ygjro"}