{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:22:56", "date_modify": "2025-05-20 12:22:56", "date_publish": "2023-08-04 14:41:26", "description": "Fraser excited for season as St Mirren 'add different layers to our game'", "filename": "sport_articles_cpwy5wq813yo_1747743776.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/679f/live/76ba8600-32bc-11ee-a8f8-95ed2df685e6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cpwy5wq813yo_1747743776.html", "title": "Fraser excited for season as St Mirren 'add different layers to our game'", "title_page": "Fraser excited for season as St Mirren 'add different layers to our game' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "St Mirren defender Marcus Fraser says his side are “looking sharp” and ready to prove last season's success was no flash in the pan.\nAfter coming sixth last term - their highest finish since 1985 - the Buddies travel to Easter Road to face Hibs in their Premiership opener having already qualified for the Viaplay Cup last 16.\n\"Before the league starts you want to get as many minutes in games as you can,” said Fraser.\n\"We have had a few pre-season games then the four Viaplay Cup ties so everyone is looking sharp and everything is coming together so hopefully we can take that into Sunday.\n\"At this stage of the week, in the build-up to the first league game of the season there is always excitement around the place.\n\"Everyone is fighting to get that starting place, the training is good, the tempo is high and it is really exciting for everyone and hopefully a successful season for us coming up.\n\"The manager (Stephen Robinson) and Diarmuid O'Carroll (assistant) have been telling the boys that we don't want to be a good team for one season, we want to add to that.\n\"We have been working in pre-season to add different layers to our game and hopefully we can see that in the coming weeks and bring that to the games.\"", "url": "https://www.bbc.com/sport/articles/cpwy5wq813yo"}