{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:35:02", "date_modify": "2025-04-26 07:35:02", "date_publish": "2025-02-27 15:12:21", "description": "Jurgen Klopp is one of the notable subjects to have been transformed into a styrofoam float for the Mainz carnival parade on Shrove Monday.", "filename": "sport_football_articles_c04zzr73vgpo_1745652902.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/433f/live/d7ae64a0-f51a-11ef-a276-596f7e6218f8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c04zzr73vgpo_1745652902.html", "title": "Jurgen Klopp: Mainz carnival to parade float of ex-Liverpool manager", "title_page": "Jurgen Klopp: Mainz carnival to parade float of ex-Liverpool manager - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Jurgen Klopp is one of the notable subjects to have been transformed into a styrofoam float for the Mainz carnival parade on Shrove Monday.\nThe float portrays Klopp with wings made of banknotes and holding a can of Red Bull's energy drink along with a football.\n\"For Kloppo values he no longer cares about, used to matter. Because Red Bull lures with a lot of money, he is now falling off his pedestal with a crash,\" reads a message on the side of the float.\nKlopp was appointed global head of soccer at Red Bull in October 2024 but has ruled out managing one of the teams under the organisation's umbrella.\nThe German played for Mainz then stepped straight into the dugout, leading the club into the Bundesliga for the first time in their history.\nAustrian company Red Bull football owns clubs around the globe including Red Bull Salzburg, New York Red Bulls, Brazilian club Red Bull Bragantino and recently acquired a stake in Leeds United.\nIt is also finances RB Leipzig but does not technically own the Bundesliga club.\nRB Leipzig are often referred to as the \"most hated club in Germany\" and have faced regular protests by opposition fans ranging from boycotting games to the arrest of 28 Borussia Dortmund fans for throwing cans and stones at rival supporters in 2017.\nBorussia Dortmund have been critical of the rise of clubs such as Leipzig that have less tradition and are accused of being used as marketing vehicles.\nKlopp, who managed 319 games during his time at Dortmund, has faced criticism in his homeland since stepping into his new role.\nThe former Liverpool manager is one of 10 themed floats made of styrofoam, steel and papier-mache, each of which costs 15,000 euros (£12,400).\nAmong the other floats are Russian President Vladimir Putin stroking the back of North Korean leader Kim Jong-un and a crashed aeroplane with German Chancellor Olaf Scholz at the controls, Economics Minister Robert Habeck in the back, and former Finance Minister Christian Lindner, who has been thrown from the middle seat.", "url": "https://www.bbc.co.uk/sport/football/articles/c04zzr73vgpo"}