{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:45:54", "date_modify": "2025-05-21 06:45:54", "date_publish": "2025-03-30 16:15:12", "description": "France 'too powerful' for Scotland, Edinburgh win 'papers over cracks' & Glasgow impress 'on both sides of ball'", "filename": "sport_articles_cewgl4pxj2yo_1747809954.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e642/live/c163e610-0d80-11f0-b234-07dc7691c360.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cewgl4pxj2yo_1747809954.html", "title": "France 'too powerful' for Scotland, Edinburgh win 'papers over cracks' & Glasgow impress 'on both sides of ball'", "title_page": "France 'too powerful' for Scotland, Edinburgh win 'papers over cracks' & Glasgow impress 'on both sides of ball' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your opinions on the Scottish rugby action over the weekend.\nHere's a taste of what you had to say:\nSCOTLAND WOMEN\nJ: Amazing match in La Rochelle and amazing atmosphere in the stadium. France were too powerful and took advantage in seven minutes of madness, but Scotland did us fans proud. What a place to watch a game, too - wonderful and welcoming local support, with fans staying in their seats to cheer the team long after the final whistle.\nJohnny: Why does the coaching team leave most of their replacements until late in the game? In this game there was a big shift in momentum with three quick tries but three or four of the subs were not used until the last 10 minutes. With a squad of 23, we don't seem to make the most of our replacements.\nHopey: Difficult match for the Scotland team. France were clearly more powerful and had player after player able to make yards in contact. Cannot fault the team for effort and showed that their belief was still strong to score their second try at the end of the game. Take the loss and move on.\nEDINBURGH\nKenny: First-class first half, but the second period a different story. Dropped balls and sloppy passing plus the ongoing line-out problems emerged. Ross Thompson continues to struggle at fly half.\nDavid: How good was Darcy Graham? Scored one try, set up another, and got Edinburgh behind the Dragons defence on so many occasions. When Graham is not there and Edinburgh have to batter down the door, or find some creativity elsewhere, they have a tendency to struggle.\nAndy: Great to get bonus point win but being honest, Dragons are a poor side and Edinburgh left about half a dozen tries out there due to lack of composure and terrible handling. A lot of work to do if they're to make the play-offs and progress in Europe.\nSteve: Healthy looking scoreline that papered over a lot of cracks. No disrespect to Dragons, but our performance could have seen us lose to every other team in the league. Easy to see the errors but thankfully Graham and Paddy Harrison had a stellar first half. Cammy Scott looked decent when he came and Ross McCann was solid and busy again.\nGLASGOW\nIain: The SRU & Glasgow need to pull out all the stops to secure Franco Smith on an extended contract to prevent him from being offered the Wales job - we can't afford to lose him.\nJames: A game of two halves, both equally exciting despite the difference in scoring. Loved it.", "url": "https://www.bbc.com/sport/articles/cewgl4pxj2yo"}