{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:01:49", "date_modify": "2025-05-21 07:01:49", "date_publish": "2024-12-27 00:00:00", "description": "Kai Havertz scores the only goal as Arsenal beat a stubborn Ipswich Town side to move up to second in the Premier League.", "filename": "sport_football_live_cgrw118pyp8t_1747810909.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cgrw118pyp8t_1747810909.html", "title": "Arsenal 1-0 Ipswich: Kai Havertz claims first-half winner", "title_page": "Arsenal 1-0 Ipswich: Kai Havertz claims first-half winner - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "'We want to be first'\nFT: Arsenal 1-0 Ipswich\nArsenal\nArsenal manager Mikel Arteta, speaking to BBC Match of the Day: \"It was what it was. In the first half especially we were super dominant and should have scored more chances. The second half we didn't start great and credit to them, they were tough to break down and are well organised.\"\nOn how players stepped up without injured Bukayo Saka: \"Very good. It will be different. We had moments in the second half. It is a unit that is new and will take time for players to understand fully.\"\nOn the title race: \"Considering all the circumstances we had this season, the amount of times we had to play with 10 men, all the injuries that we had, it's good to be in the position that we are but it's not where we want to be. We want to be first.\"\n'We restricted them to nothing'\nFT: Arsenal 1-0 Ipswich\nArsenal\nArsenal boss Mikel Arteta, speaking to Amazon Prime: \"Frustration when you win? No. Things to improve? Yes.\n\"They started very significantly and we have to get used to that. Credit to them as they're very well organised, but we restricted them to nothing - we had two or three openings.\"\nOn Myles Lewis-Skelly: \"He is a special character.\n\"He is well ahead of his age and then he has qualities where he adapts to the way that we are playing.\n\"Credit to him.\"\nOn having Christmas Day off: \"For many years I have not had a chance to open the presents and it was special.\"\nOn playing without Bukayo Saka: \"Very different we will evolve that. In the second half I liked it more.\n\"It will take a bit of time.\"\nOn the January transfer window: \"We don't know. We will see, hopefully we don't see any more injuries.\"\n'Resilient and compact'\nFT: Arsenal 1-0 Ipswich\nIpswich Town\nIpswich manager Kieran McKenna, speaking to BBC Match of the Day: \"The players worked really hard and we got the game to a good place in the second half after a good 20 minutes. Early on we were pinned in and couldn't get out but to where we were after 89 minutes I was really pleased.\n\"In the first half it was only the goal where I thought we needed to defend better. We were resilient and compact when we needed to be. Arsenal spent a lot of the first half in our defensive third but unable to penetrate.\"\nOn response after heavy loss against Newcastle: \"It was a god step back in the right direction for us. We didn't hit our levels against Newcastle. We knew today we had to be resilient and we did that.\"\nOn the return of Kalvin Phillips: \"I thought he did well. Luke Wolfenden deserves a mention too. Kalvin played 90 plus minutes and Wolfy almost 90 and both did really well.\"\nOn taking something from this game: \"I think we can. Some defending was good and we'll need that on Monday against Chelsea.\"\nContrasting views on Pedro incident\nFT: Brighton 0-0 Brentford\nMichael Emons\nBBC Sport at the Amex Stadium\nIn the second half Brighton striker Joao Pedro was fortunate to not make contact with Brentford's Yehor Yarmoliuk after swinging an elbow at the substitute who had been pulling his shirt with the Brentford man getting a yellow card.\nThe incident was checked by VAR, but no action was taken against Pedro.\nSpeaking on Amazon Prime, former Premier League referee Mark Clattenburg said there would only have been a sending off for violent conduct if there had been contact, but it would have been an \"easy\" red card if Pedro had connected with Yarmoliuk.\nFair to say both managers had a different view.\nThomas Frank spoke in his news conference first and when asked if it should have been a red card, said: \"Yes. As I understand the rules, you can't swing an arm to hit someone, whether you hit them or not.\n\"That's why we have got VAR. It happened, we have to make it [VAR] better in the future.\"\nBut Brighton boss Fabian Hurzeler did not see the incident the same. When told of Frank's words, he replied: \"It's an interesting opinion, I see it completely different. For my it's not a red card, why would it be a red card? You just try to get free from someone.\"\n'Could have shown more belief'\nFT: Arsenal 1-0 Ipswich\nIpswich Town\nIpswich manager Kieran McKenna, speaking to Amazon Prime: \"It was a difficult first 20 minutes, we got pinned in by a good side. We grew into the game well and turned a bit of momentum at the end of the first half and got into some good positions in the second half.\n\"There were a few situations late in the game where we could have shown more belief but we were too hesitant.\n\"It was important that we ended the game solid and feel we can be compact. We'll take confidence from that. The way we turned momentum to put the game in a good position for us, I think is something to take confidence from.\"\nOn Kalvin Phillips: \"He had a good run of games early in the season and then has been working his way back from injury and did well.\"\n'Hopefully, the new year brings trophies'\nFT: Arsenal 1-0 Ipswich\nArsenal\nArsenal midfielder Declan Rice, speaking to Amazon Prime:\"I think it has been constant thing for us, dominating games but teams have been coming here with a low block - it is tough to break down a 5-4-1 [formation].\n\"Second half, I feel we could have had one or two more. Luckily enough in the end it was an important win.\"\nOn his volley from a corner: \"I couldn't have hit that much better. I was watching the ball the whole way.\n\"Teams are trying to stop us from set-pieces. They were taken back from that one. We stick to our process as we are really good at them.\"\nOn Bukayo Saka's injury: \"He come off early in the game the other day.\n\"Tonight was different out there without him. We are going to have to adapt, for sure.\"\nOn his position: \"Sometimes when the manager asks me to arrive in the box it is a bit unnatural for me, but it makes me more hungry for goals.\n\"I had a bit of a slow start to the season off the back of the Euros, but I feel much more back to myself.\"\nOn 2024: \"It has been a good year. We have done well, but it is not what we want.\n\"Hopefully, the new year brings trophies. To make that next step to be amongst the elite. We can keep winning games, but it doesn't mean anything if you don't win anything.\"\nOn Liverpool and title competition: \"Massive respect to them. They are full throttle. They don't let anyone breathe and we need someone to help us out so they can drop some points.\n\"I think Chelsea have been outstanding. They've been amazing the way they've been playing.\"\n'Coach who believes in me'\nFT: Arsenal 1-0 Ipswich\nIpswich Town\nIpswich midfielder Kalvin Phillips, speaking to Amazon Prime: \"Arsenal are very good team and they had a lot of the ball, created a few chances. We created a few in the second half but we just need that extra bit of special play at the end.\n\"It's always difficult coming to Arsenal and we didn't have much to lose a 1-0 so we came out and tried to force them into mistakes in the second half.\"\nOn a first start since October: \"I did alright. I was blowing towards the end. It was nice to be back playing. We've got a good group, coach and staff. They keep us fit even when we aren't playing.\"\nOn Arsenal: \"They are a really good team, really strong. I think Liverpool are the standout team so far but I think Arsenal are the ones who will push them in the end.\"\nOn targets for 2025: \"Just to play as many games as possible. I'm at my best when I'm playing week in week out. When you join a team like Man City, it's tough to not be involved but you have to stay strong. I've got a coach who believes in me here and trusts me to go and perform.\"", "url": "https://www.bbc.com/sport/football/live/cgrw118pyp8t"}