{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:32:44", "date_modify": "2025-05-19 14:32:44", "date_publish": "2017-08-04 16:20:13", "description": "Skipper Billy Sharp earns Sheffield United a victorious return to the Championship with the winner against Brentford.", "filename": "sport_football_40760770_1747665164.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/115E6/production/_97224117_pa-32297401.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_40760770_1747665164.html", "title": "Sheffield United 1-0 Brentford", "title_page": "Sheffield United 1-0 Brentford - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Striker Billy Sharp scored the only goal to ensure Sheffield United made a winning start to life back in the Championship against Brentford.\nThe Blades, back in the second tier after six seasons away, went in front just before half-time when skipper Sharp headed in Leon Clarke's cross.\nSharp might have had another after the break when he tapped in a rebounded free-kick but was ruled offside.\nBrentford rallied and had chances but were unable to find an equaliser.\nThere will have been extra satisfaction at this result for manager Chris Wilder, not only as a boyhood Blades fan but also as it was his first experience of the Championship as a manager.\nBramall Lane was suitably buzzing with 26,746 fans and it was a happy coincidence for the home support that another fan in Sharp netted the key goal.\nBrentford, who had not won on the opening day in five attempts, saw that run extended despite a much improved second-half which saw Nico Yennaris, Lasse Vibe and Neal Maupay all denied.\nSheffield United manager Chris Wilder:\n\"We've had it tough in this city, a football city as it is. That is a reward for the outstanding support, loyalty and love of their football club that they've shown through thick and thin.\n\"The atmosphere was right up there today. Outstanding effort against a brilliant Brentford side. The roar that greeted us, the positivity allowed the players to lift their game at times when they were very, very tired.\n\"Billy's goalscoring record speaks for itself and I think we've created chances today. We didn't play particularly well with the ball - we can play a lot better.\"\nBrentford boss Dean Smith:\n\"A disappointing result, probably not what our performance deserved. I thought first half was a bit of a nothing game, it looked a little bit slow and the pitch slowed up.\n\"We didn't move the ball as quick as we normally do and I don't think they did either.\n\"There wasn't a lot of goalmouth action in the first half. I thought we had a couple of good chances. Billy Sharp's had one chance and scored but that's what he does.\"", "url": "https://www.bbc.com/sport/football/40760770"}