{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:55:29", "date_modify": "2025-05-20 13:55:29", "date_publish": "2023-07-31 11:24:57", "description": "Leicester City podcast: Maresca's tactics, Coady injury, Mavididi", "filename": "sport_articles_c2811ppxk24o_1747749329.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/abb3/live/744cbd90-2f8b-11ee-a250-c9a4d46a1cc3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c2811ppxk24o_1747749329.html", "title": "Leicester City podcast: Maresca's tactics, Coady injury, Mavididi", "title_page": "Leicester City podcast: Maresca's tactics, Coady injury, Mavididi - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Leicester winger Matt Piper has been analysing the Foxes' defeat to Premier League opposition Liverpool on the When You're Smiling podcast: \"For 30 minutes I thought we did brilliantly - the way that they played through the aggressive press of Liverpool, transitioned the ball, and created some opportunities against such a good side.\n\"But between 30 and 38 minutes, Leicester did really fold. They crumbled, there was no real leadership out there, there was no one that calmed it down and tried to keep it tight.\n\"With Maresca's philosophy and style of play, we're going to have to accept, as a fanbase, that they are going to make mistakes at times. But that was far too many and far too often. If that happens next week against Coventry, I think we'll be in big trouble.\n\"Hopefully Mavididi is signed and announced because I think we need some more excitment about a new signing coming in. Then, who knows, maybe one more as cover for the Conor Coady injury because I think we really did lack that leadership throughout the game.\"\nOn whether or not Enzo Maresca's philosophy has clicked yet: \"I don't think it has. I think it will take a while and it will take patience from not just Maresca and his team, but also the fanbase. I think the way he wants to play, it is risky. But if you get it right the rewards are huge.\n\"I'm not going to come here and batter the team and the way that Maresca plays, he's only been our manager for six weeks. He's had four or five games with his team, he's not had that long to work with them. It's not been ideal being on this tour, if we're honest.\n\"It is going to take time to evolve the way he wants to play and make sure that is transmitted to the players. Coady, Winks and Vardy have said some really positive things about him - so I'm confident in the manager.\"", "url": "https://www.bbc.com/sport/articles/c2811ppxk24o"}