{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:54:35", "date_modify": "2025-05-21 03:54:35", "date_publish": "2025-01-15 11:04:16", "description": "Patricio 'Pitbull' Freire says he has been granted an \"unconditional release\" from the PFL.", "filename": "sport_mixed-martial-arts_articles_cp3j1y1z51jo_1747799675.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6867/live/ed015aa0-d32e-11ef-9bab-e1537b3d246b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_mixed-martial-arts_articles_cp3j1y1z51jo_1747799675.html", "title": "MMA: PFL release Bellator champion Patricio 'Pitbull' Freire", "title_page": "MMA: PFL release Bellator champion Patricio 'Pitbull' Freire - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Patricio 'Pitbull' Freire says he has been granted an \"unconditional release\" from the PFL after publicly criticising the MMA promotion.\nPitbull, 37, hit out at the PFL on Tuesday on social media after it was confirmed the PFL would be ending the Bellator brand.\nThe Brazilian was one of Bellator's top stars before it merged with the PFL in late 2023.\nPFL chairman Donn Davis initially announced Pitbull's release before the Bellator two-weight champion insisted they were retaining their right to match any deal another promotion offered him.\nPitbull then posted on X that he had been informed the release would be \"unconditional\".\n\"I'll be waiting for the corrected release letter,\" Pitbull said.\nPitbull's release comes during a hectic 24 hours for the PFL as they announced Bellator would be discontinued and all fighters would now compete under the PFL brand.\nThe announcement came shortly after Pitbull began posting on X, complaining about being stonewalled following his release request last December and the PFL reportedly attempting to re-negotiate fighters' contracts.\nThe PFL is expected to announce further changes to their season format this week.", "url": "https://www.bbc.com/sport/mixed-martial-arts/articles/cp3j1y1z51jo"}