{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:56:32", "date_modify": "2025-04-26 03:56:32", "date_publish": "2025-03-04 15:05:43", "description": "Wing Mack Hansen says the Ireland squad are excited by the challenge of welcoming France to Dublin in the Six Nations on Saturday afternoon (14:15 GMT).", "filename": "sport_rugby-union_articles_czdnvygj6l4o_1745639792.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e5a7/live/049ad9d0-f903-11ef-b5c1-27f306935cb2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_czdnvygj6l4o_1745639792.html", "title": "Six Nations 2025: Ireland v France the sort of game you live for", "title_page": "Six Nations 2025: Ireland v France the sort of game you live for - Mack Hansen - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Wing Mack Hansen says the Ireland squad are excited by the challenge of welcoming France to Dublin for Saturday's highly-anticipated Six Nations game (14:15 GMT).\nThe hosts top the championship table with 14 points, three ahead of the French, and are targeting a historic third outright title in succession.\nThe pair have developed a keen rivalry in recent seasons, finishing first and second in each of the previous three Six Nations campaigns, while Saturday's encounter will have the added emotion for Ireland of being a final home Test for retiring centurions Peter O'Mahony, Conor Murray and Cian Healy.\n\"One to 23 are world class players. It's a big challenge and we're excited for it,\" said Hansen.\n\"These are the sort of games that you live for, being able to send some guys off with their last home game and put a stamp on the Six Nations.\n\"It's really exciting and I think we're ready for the challenge.\"\nThe 26-year-old Connacht player, who signed a new contract this week through to 2027, added that the squad knew this was to be final Six Nations for Murray, Healy and O'Mahony before the announcement and that they have attempted to make \"this whole campaign special\" for the trio.\n\"They're such big parts of the team. Talking about it before, they bring so much experience on the field, but off the field as well. They bring so much craic, laughter and good times.\n\"It's more about making it as special for them as possible as a whole, the whole campaign.\n\"Obviously, yeah, we're going to try and get a win for them.\"", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/czdnvygj6l4o"}