{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:09:31", "date_modify": "2025-05-21 06:09:31", "date_publish": "2025-03-31 10:47:06", "description": "Alexander Zverev spurns chance to close gap on Jannik Sinner, plus Emma Raducanu's run - the latest edition of our weekly tennis round-up.", "filename": "sport_tennis_articles_cnvzv5mr72no_1747807771.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3e4e/live/61b14b00-0e10-11f0-ba12-8d27eb561761.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_tennis_articles_cnvzv5mr72no_1747807771.html", "title": "Second Serve: Alexander Zverev spurns chance to catch Jannik Sinner, Emma Raducanu and Alexandra Eala enjoy Miami runs", "title_page": "Second Serve: Alexander Zverev spurns chance to catch Jannik Sinner, Emma Raducanu and Alexandra Eala enjoy Miami runs - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jannik Sinner isn't even allowed to play competitive tennis, yet he's still strengthened his grip as the world's leading men's player.\nSinner, of course, is almost halfway through a three-month ban for a doping offence, which ruled him out of the 'Sunshine Double' in Indian Wells and Miami.\nBut he watched on as his nearest rivals - Alexander Zverev and Carlos Alcaraz - both fumbled the chance to significantly narrow the gap at the top of the ATP rankings.\nIt looks increasingly likely Sinner will lead the way when he returns in Rome at the start of May.\nSinner still holds a lead of 2,685 ranking points over Zverev, while Alcaraz is 3,610 adrift.\nWith 1,000 points available to the Monte Carlo and Madrid champions, plus 500 for winning Barcelona or Munich, a slim opportunity for Zverev remains.\nSeizing the chance to overtake Sinner had been on Zverev's mind. Then he started, by his own admission, \"playing terrible\".\nThe world number two was beaten by American qualifier Learner Tien in the Acapulco second round, 43rd-ranked Tallon Griekspoor in the Indian Wells second round, and France's Arthur Fils in the Miami Open fourth round.\n\"I have been losing a lot of matches that I feel like I couldn't control lately,\" Zverev said after his Miami exit.\n\"I have to look at myself more than anything else.\"\nAnd what about Alcaraz? As we discussed in last week's Second Serve, he also has some soul-searching to do.\nSinner is not the only one to have cemented his spot as the world's leading player this month - although Aryna Sabalenka has actually done it herself on the court.\nAfter winning Miami and finishing runner-up at Indian Wells, she has moved more than 3,000 points clear of second-placed Iga Swiatek in the WTA rankings.\nSabalenka's dominance - having won the most matches this year (23) and reached the most finals (four) - will be secure until the French Open at the very least.\nWith so many professional tennis tournaments taking place across the world, and across so many levels, it can be hard to keep up with everything from one week to the next.\nAs part of BBC Sport's commitment to offer more for tennis fans, Second Serve will be your weekly round-up of the biggest stories in the sport.\nAs well as the main talking point, you can see which ATP and WTA players are making significant progress - or struggling for form, how the British contingent are doing and what the next stops on the calendars are.\nYou can also sign up to get the latest tennis news from BBC Sport delivered straight to your mobile phone.", "url": "https://www.bbc.com/sport/tennis/articles/cnvzv5mr72no"}