{"authors": ["David McDaid", "www.facebook.com"], "date_download": "2025-05-19 15:37:37", "date_modify": "2025-05-19 15:37:37", "date_publish": "2017-08-24 10:32:11", "description": "Cheavon Clarke is a man not even the Grim Reaper can knock out - and once told Prince Charles he would \"give you the old one-two\".", "filename": "sport_boxing_41035191_1747669057.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1352E/production/_97505197_princecharlescheavonclarke.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_boxing_41035191_1747669057.html", "title": "World Amateur Boxing Championships: Cheavon Clarke on coming back to life", "title_page": "World Amateur Boxing Championships: Cheavon Clarke on coming back to life - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cheavon Clarke is a boxer not even the Grim Reaper can knock out.\nThe 26-year-old has gone toe to toe with death and survived to tell the tale. Twice.\n\"I don't believe in 'you only live once',\" he says. \"Two must be my lucky number. Although I thought it was 14.\"\nAs he rips up floorboards while renovating his club gym in Gravesend, Clarke displays all the power associated with his heavyweight stature.\nBut aged eight, and again at 18, his body momentarily fell lifeless.\nThe first happened after he fell off a ladder and was impaled by a metal spike in Jamaica, where he was born.\nThe second came when his appendix burst, leaking poison through his system.\n\"When I woke up, the doctor said to me: 'Mr Clarke, you are a very lucky man. During the operation you flatlined and we had to do everything to save you.'\n\"I came back to life. It's fair to say God didn't want me.\"\nClarke lifts up his shirt to reveal his scarred abdomen, but these are not experiences he talks about regularly.\n\"I don't want to burden people with a sad story,\" he says. \"In fact, I only spoke to my mum about it for the first time the other day.\"\nSurely coming back from death twice is a positive story, though?\n\"Sometimes, I do think how far I've come - but then I think that's in the past and you can't live on yesterday,\" he says.\n\"People are always getting annoyed with me because I don't make plans, I just live one day to the next. You never know if you'll be alive or dead.\"\nClarke found boxing at Gravesham ABC after moving from Jamaica to Kent aged 11 with his mum and sister.\nAfter a stint as a lorry driver - \"I like being alone and it gave me time to think\" - he represented Jamaica at the 2014 Commonwealth Games in Glasgow.\n\"I met Prince Charles there,\" he says. \"He came to one of our training sessions. I told him: 'I'm a bad man. I'll give you the old one-two.' I think he found it funny. I even made the Queen's Speech video that year.\"\nBut that royal encounter paled next to sharing a hallway in the athletes' village with sprinting great Usain Bolt.\nClarke has since changed his sporting allegiance from Jamaica to Great Britain, and it seems to be paying off.\nHaving made little impact in Glasgow, he won silver in his first outing for GB at this summer's European Championships, knocking out a former Olympic champion before losing to the current one.\n\"It's going all right, but I can't dwell on that,\" he says. \"It did mean a lot because hopefully it shows people in Gravesend, Kent, or anywhere, what you can do if you work hard at it.\"\nNext stop is Hamburg, and the World Championships,, external where - as one of 10 British fighters - he will aim to make it two medals from two appearances.\nHis team-mates include Peter McGrail, the recently crowned European champion, and Olympians Galal Yafai and Pat McCormack, who both took silver in Ukraine.\nAnd though Clarke says he doesn't make plans, there is one formulating in his head when it comes to his boxing.\n\"Especially in the last couple of years, I've thought about Tokyo a bit. I'd like to go there, do some damage, win a medal - a gold medal - inspire people. Yeah. Olympics. 2020. Gold medal.\"\nYou get the feeling it might take more than a couple of killer punches to stop him.", "url": "https://www.bbc.com/sport/boxing/41035191"}