{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:36:39", "date_modify": "2025-05-21 07:36:39", "date_publish": "2025-02-11 00:00:00", "description": "Follow live text commentary, score updates and match stats from Manchester City vs Real Madrid in the UEFA Champions League", "filename": "sport_football_live_ce8jp331p0jt_1747812999.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_ce8jp331p0jt_1747812999.html", "title": "UEFA Champions League", "title_page": "Manchester City vs Real Madrid: UEFA Champions League stats & head-to-head - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester City are fighting for Champions League survival and a place in the last 16 after Jude Bellingham's injury-time winner settled a tense play-off first leg in Real Madrid's favour.\nPep Guardiola's side rediscovered more of their true form early on at Etihad Stadium as Jack Grealish and Josko Gvardiol combined to set up Erling Haaland for a confident finish after 19 minutes.\nGrealish, who had made a fine start, then went off injured and after Haaland hit the bar shortly after the break, Real took control.\nReal let City off the hook by failing to take their chances until Kylian Mbappe scrambled home a close-range finish on the hour.\nThey continued to squander opportunities, including two for Bellingham, and were punished when Haaland put City back in front from the spot after 80 minutes following Dani Ceballos' foul on Phil Foden.\nReal, however, hit back with four minutes left, former City man Brahim Diaz equalisingbefore Bellingham finally hit the target, sliding in from close range to leave the holders as firm favourites to reach the knockout stage in next week's second leg at The Bernabeu.\nManchester City's big Champions League night started with flashes of the old form re-emerging, only to end in bitter disappointment as the failings that have characterised their disappointing season surfaced once more.\nWith Grealish probing and Haaland providing the cutting edge, City made the perfect start. It was a bitter blow when the former went off injured after half an hour.\nReal had already started to pose a threat through the pace of Mbappe and the trickery of Rodrygo and Vinicius Junior, but the pivotal moment for City came when Haaland's deflected shot bounced back off the bar. A two-goal lead might have made a significant difference.\nThe 15-time champions then started to apply remorseless pressure on City, who were overcome by tired legs and were actually labouring badly when Haaland put them back in front against the run of play late on.\nOnce again, key men such as Bernardo Silva and Kevin De Bruyne looked like players with too many miles on the clock, while Ruben Dias and John Stones have been managing their game time carefully.\nAnd in that agonising conclusion, City went from thinking they might take a lead to The Bernabeu, to settling for a draw, then suffering the pain of defeat.\nCity now face a mammoth task to take this stuttering Champions League campaign beyond the play-off stage.\nReal Madrid may not be at their best just yet, but they still possess the talent and nous to get the job done in most Champions League circumstances that confront them. This is the time of the season when they come alive.\nCarlo Ancelotti was, for him at least, animated at some points as a succession of chances came and went for Real, who posed a threat all night.\nWhen Mbappe drew them level with a scuffed finish, these ruthless campaigners went for City's throat, only for Haaland's penalty to throw them off course with 10 minutes left.\nNo matter for a team that has been around this block more than any other, scenting City's fatigue and victory, which was duly delivered when Bellingham turned home the winner with seconds left.\nAncelotti, who has seen and done it all, saw his side pull off the sort of victory that is their trademark, making them a feared proposition as long as they remain in the Champions League.\nReal Madrid are confident at The Bernabeu even if they have a deficit in the tournament they regard as their personal property. It is hard to see how Manchester City turn this around in their current state.", "url": "https://www.bbc.com/sport/football/live/ce8jp331p0jt"}