{"authors": ["Ged Scott", "www.facebook.com"], "date_download": "2025-05-21 07:57:14", "date_modify": "2025-05-21 07:57:14", "date_publish": "2025-03-27 18:50:53", "description": "New Shrewsbury Town boss Michael Appleton is keen to make an impact at League One's relegation-haunted bottom club.", "filename": "sport_football_articles_ckg1d41x0yvo_1747814234.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ceed/live/7a490040-0b27-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ckg1d41x0yvo_1747814234.html", "title": "Michael Appleton: New Shrewsbury boss keen to make an impact", "title_page": "Michael Appleton: New Shrewsbury boss keen to make an impact - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "New Shrewsbury Town head coach Michael Appleton is keen to make an immediate impact despite coming in at such an awkward time for the relegation-haunted bottom club.\nThe 49-year-old Mancunian, who did his best work in management in his time at Oxford United and Lincoln City, has not worked since losing his job at Charlton Athletic in January 2024 - and he admits that he was actually looking to get back in the hot seat next season.\n\"I was sat at home two to three weeks ago,\" he said. \"I've had a bit of a break from the game. And in my head it was that I want to be back in the dug-out for the start of the season.\"\nBut then came the call from Town's director of football Mickey Moore to fill the breach left by Gareth Ainsworth's sudden departure for Gillingham.\nAnd now, with his new side 14 points adrft of safety, Appleton faces the daunting task of leading League One's bottom club against pacesetting, big-spending Birmingham City on Saturday at St Andrew's.\nIt is the same challenge Ainsworth faced when he took over at Oteley Road in November - and Shrewsbury responded with a 3-2 victory.\nThe odds on lightning striking twice this weekend are now even longer, but Appleton is keen to quickly show that he has what it takes to lead the club beyond the initial nine games he has been contracted for.\n\"When I first spoke to Micky Moore they just wanted to bring in an interim manager and deal with these nine games,\" he added.\n\"I didn't expect the phone call and the conversation that I had.\n\"It's an added bonus for me. Hopefully that will work in favour of the football club.\n\"I'm energised and ready to go again. And I'm sure getting closer to that ninth game there'll be a discussion of what that looks like after that.\"", "url": "https://www.bbc.com/sport/football/articles/ckg1d41x0yvo"}