{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:49:23", "date_modify": "2025-05-21 05:49:23", "date_publish": "2025-01-14 11:55:54", "description": "Big Bash League 2024-25 results: Jacob Bethell stars but cannot help Melbourne Renegades avoid elimination", "filename": "sport_cricket_articles_clynre3p2w6o_1747806563.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d9fb/live/0360b640-d26e-11ef-8926-89a9332957ee.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_clynre3p2w6o_1747806563.html", "title": "Big Bash League 2024-25 results: Jacob Bethell stars but cannot help Melbourne Renegades avoid elimination", "title_page": "Big Bash League 2024-25 results: Jacob Bethell stars but cannot help Melbourne Renegades avoid elimination - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England's Jacob Bethell produced a brilliant all-round display but could not prevant Melbourne Renegades suffering a four-wicket defeat by Hobart Hurricanes in the Big Bash League.\nRenegades were 23-3 but Bethell, 21, smashed 87 off 50 balls before being run out in the final over as they posted 154-7.\nThe left-hander hit eight fours and four sixes in his first half-century of the tournament.\nHe then opened the bowling and dismissed Charlie Wakim in his second over as Hurricanes, who had already qualified for the knockouts, slipped to 50-3.\nSmall partnerships saw them require 24 from 24 balls but Bethell removed Matthew Wade to turn the game again.\nRenegades squeezed to leave Hurricanes needing eight from the final over but Tim David (24* off 15) hit the third ball for six before taking a single to seal the win.\nHurricanes go top of the table and a win in their final game would see them secure top spot and two chances to reach the final.\nRenegades are no longer able to qualify for the knockouts.", "url": "https://www.bbc.com/sport/cricket/articles/clynre3p2w6o"}