{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:04:13", "date_modify": "2025-04-26 04:04:13", "date_publish": "2025-03-04 00:00:00", "description": "Follow live text and score updates from 24 fixtures across a busy night in League One & League Two.", "filename": "sport_football_live_cn9398x10z3t_1745640253.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_cn9398x10z3t_1745640253.html", "title": "EFL LIVE: League One & League Two 24 fixtures", "title_page": "EFL LIVE: League One & League Two 24 fixtures - text & score updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Chasers make gains on Tuesday night\n#bbcefl\nShrove Tuesday was a good night for the chasers in the third and fourth tier.\nLeague One leaders Birmingham lost for the first time in 19 league games at Bolton, allowing Wycombe to trim the gap to nine points, while Wrexham also kept in touch with a win at Huddersfield.\nAnd once runaway League Two leaders Walsall continued their recent wobble with a draw at bottom side Carlisle, as second-placed Bradford moved to within just two points with victory over Cheltenham.\nThings are very much flipping one way then the other as we head towards the run-in.\nOur next live EFL text will be on Friday night as Norwich City welcome Oxford United.\nUntil then, goodnight!\nAnd then it was two...\n#bbcefl\nBradford's emphatic 3-0 win over Cheltenham coupled with Walsall's draw at bottom side Carlisle means the Saddlers' lead at the top is now down to just two points. It was 12 only a few weeks ago.\nThe Bantams also moved five points clear of Doncaster in third after they suffered a 1-0 defeat at Bromley, but Notts County couldn't take advantage as they also lost, going down 2-1 at home to Barrow.\nAFC Wimbledon, Port Vale and Crewe all failed to win too.\nAt the bottom, Morecambe picked up a vital three points to move within one point of Tranmere following their draw at Grimsby.\nIn League One...\n#bbcefl\nIt's been a good night for Wycombe and Wrexham who both win and Birmingham's lead at the top is reduced to nine points, though they still have a game in hand.\nBolton and Charlton both won again to boost their play-off hopes but a fourth straight defeat for Leyton Orient has seen them slip further back.\nBristol Rovers' draw with bottom side Shrewsbury takes them three points clear of Burton Albion in 21st, while Salop remain eight points adrift of safety.\nFULL-TIME\nWycombe 2-0 Burton\nWycombe secure all three points after a great finish from Daniel Udoh and an own goal from Burton defender Jack Armer after he misjudged his goalkeepers positioning.\nIt was a well-deserved victory in the end as Burton failed to create any real chances.\nThe second-half changes showed that the home side didn't have to change their gear.\nThey'll be pleased with that result after the weekend's defeat.\nBurton will have it all to do to stay up as they didn't do enough to find a goal.\nFULL-TIME\nBolton 3-1 Birmingham\nA statement win for Bolton in their quest to reach the play-offs as they end Birmingham's 18-game unbeaten run.\nEmil Hansson had given Blues the lead after 23 minutes but the Trotters hit back with an excellent turnaround.\nFirst, John McAtee drilled in an equaliser at the near post before George Thomason reacted quickest to steer home and put Bolton ahead.\nAaron Collins then rounded off a night to remember with a lovely turn and finish after fine work by Joel Randall.", "url": "https://www.bbc.co.uk/sport/football/live/cn9398x10z3t"}