{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 08:02:25", "date_modify": "2025-05-21 08:02:25", "date_publish": "2025-03-27 16:15:22", "description": "Celtic's Paulo Bernardo raring to 'give it all' after injury lay-off", "filename": "sport_articles_cz9nd7px30go_1747814545.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/38c4/live/c6479920-0b22-11f0-88df-cbea984e02db.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cz9nd7px30go_1747814545.html", "title": "Bernardo raring to 'give it all' after injury lay-off", "title_page": "Celtic's Paulo Bernardo raring to 'give it all' after injury lay-off - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Celtic midfielder Paulo Bernardo is raring to go for the final run of games in the season after returning from a seven-week injury lay-off.\nThe Portugal Under-21 international, who suffered an ankle injury against Raith Rovers in the Scottish Cup at the start of February, is back in contention for Brendan Rodgers' side when they face Hearts this weekend.\n\"I can play football again so I'm really excited for the coming weeks,\" Bernardo, 23, said.\n\"The injury was bad but I recovered very well and hopefully I can play from now on.\n\"It's been a while for me being off the pitch so probably not 90 minutes but I will do the best as I can if the coach wants me to play.\n\"It was bad when I saw the results of the scan because I thought it was a short time injured and it wasn't.\n\"I had the opportunity to recover well and to work on other things that I couldn't do during the season. It was a good time to recover and to do other things too.\"\nBernardo missed key games including the Champions League tie with Bayern Munich and derby loss to Rangers.\nCeltic remain 13 points clear at the top of the Scottish Premiership though and are in the Scottish Cup semi-finals against St Johnstone, with the midfielder eager to \"give it all\" between now and the end of the campaign.\n\"We as a team still have some goals to achieve and we will try our best to do that as soon as possible,\" Bernardo added.\n\"For me personally, I want to have good games before the end of the season and do my best every game. Each opportunity that I have, I will try to give it all on the pitch.\"", "url": "https://www.bbc.com/sport/articles/cz9nd7px30go"}