{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:37:20", "date_modify": "2025-05-21 04:37:20", "date_publish": "2025-04-04 16:42:00", "description": "'Football romantic' Simo Valakari relishing challenge of stopping Celtic", "filename": "sport_articles_cz6dl05zgwwo_1747802240.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2958/live/64b43240-1167-11f0-a3a8-cd0c869b6aeb.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cz6dl05zgwwo_1747802240.html", "title": "'Football romantic' Simo Valakari relishing challenge of stopping Celtic", "title_page": "'Football romantic' Simo Valakari relishing challenge of stopping Celtic - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Simo Valakari knows how Celtic will play against St Johnstone on Sunday, but admits it doesn't make his side's task any easier.\nThe Perth men are bottom of the Premiership, five points adrift of Dundee and six behind Kilmarnock and safety, while runaway leaders Celtic are closing in on the title.\n\"Sometimes – and understand me right – it's easier to play against the top teams because it's so clear what they are doing,\" Valakari said.\n\"I can say when the ball goes there, what's happening there. It's so clear but then how do you stop that because they do it and do it and they have the quality.\n\"But for the players, it's very clear. This will happen, so how can we manage to stop that? But that's our job.\n\"I'm a football fan, I'm a football romantic and when I see a team playing like Celtic do, to be that far ahead and still executing the principal of their game identity, this makes me feel 'Wow, this is a top, top team' and it's a big credit to the manager.\n\"But as I said, it's our job. It's still football. It's 11 versus 11. We have good players out there.\n\"Yes, we need some moments, maybe that the ball will bounce our way, but we know what we're going to do. We need to execute it, and it's not enough that we execute it the first 15 minutes, 30 minutes, 45 minutes. It needs to be spot on all game.\"", "url": "https://www.bbc.com/sport/articles/cz6dl05zgwwo"}