{"authors": ["Matthew Henry", "www.facebook.com"], "date_download": "2025-05-21 04:16:22", "date_modify": "2025-05-21 04:16:22", "date_publish": "2025-04-05 18:08:45", "description": "Jofra Archer takes three wickets to help Rajasthan Royals beat Punjab Kings by 50 runs in the Indian Premier League.", "filename": "sport_cricket_articles_cly297k0zpno_1747800982.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/79b0/live/e1abaaa0-1246-11f0-9d46-3377f28968f3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cly297k0zpno_1747800982.html", "title": "IPL 2025: Jofra Archer takes three wickets to help secure Rajasthan Royals victory", "title_page": "IPL 2025: Jofra Archer takes three wickets to help secure Rajasthan Royals victory - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jofra Archer took three wickets to help Rajasthan Royals beat Punjab Kings by 50 runs and secure a second successive victory in the Indian Premier League.\nDefending 206, England international Archer bowled Punjab opener Priyansh Arya with the first ball of the chase - a fine delivery that hit the top of the left-hander's off stump.\nArcher was then hit for two fours by in-form Punjab captain Shreyas Iyer but bowled the India international as he stepped to leg and tried to thrash the last ball of the opening over.\nWith the win secured and 56 runs still needed, Archer returned to bowl the last and took his third wicket by having Arshdeep Singh caught at extra cover.\nThe 30-year-old's final figures - 3-25 from four overs - represent his best return in this year's IPL and he was named player of the match.\nHe was hit for 0-76 in the Royals' opening match, the worst figures in IPL history, and followed with 0-33 in a defeat by Kolkata Knight Riders.\nBut 1-13 from three overs against Chennai Super Kings, including a wicket maiden with the opening over, showed promise - and he backed up that success against Punjab, hitting 94mph at one stage.\n\"The beginning of the tournament, games like that happen,\" Archer said. \"Most importantly I am happy to contribute to a team win.\n\"You have to understand you will be lucky in some circumstances and other times a batter may get ahead of you. Everyone puts in the hard yards.\n\"Every day is not going to be a great day but with the good days you have to enjoy them.\"\nArcher was named the IPL's Most Valuable Player in 2020 but that was before his series of back and elbow injuries which have dogged his recent career.\nEngland still hope he could return to Test cricket this year, either against India this summer or in the Ashes against Australia over winter.\nArcher's burst pushed the Royals further into the ascendency after contributions of 67 from Yashasvi Jaiswal, 38 from Sanju Samson and 43 not out from Riyan Parag took them to 205-4.\nThe Kings slipped further to 42-4 in pursuit and although a partnership of 88 from 52 balls between Glenn Maxwell and Nehal Wadhera, who hit 62 from 41, brought them back into the game, they fell away after Maxwell was caught at long-off for 30 and finished on 155-9.\nThe win lifts Rajasthan to seventh, while the Kings are fourth following their first defeat of the season.", "url": "https://www.bbc.com/sport/cricket/articles/cly297k0zpno"}