{"authors": ["Mike Hughes", "www.facebook.com"], "date_download": "2025-04-26 08:07:48", "date_modify": "2025-04-26 08:07:48", "date_publish": "2025-02-26 14:02:44", "description": "Liverpool news: Opinion - Mike Hughes on Arne Slot", "filename": "sport_football_articles_cvgel95j43po_1745654868.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7530/live/7724f800-6ea7-11ef-b282-4535eb84fe4b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cvgel95j43po_1745654868.html", "title": "Opinion - Mike Hughes on Arne Slot - BBC Sport", "title_page": "Liverpool news: Opinion - Mike Hughes on Arne Slot - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A two-match touchline ban for Liverpool manager Arne Slot is far from ideal. His team have just established a double-digit points lead at the top of the Premier League table and look to be marching towards the title with ruthless efficiency.\nWith the man who calls the shots being positioned up in the stands at Anfield for tonight's match with Newcastle, touchline responsibilities will handed to another key member of the management team. The coaching staff will have to adapt, but that's unlikely to be a problem.\nLiverpool have been adapting since the moment he walked through the door.\nAdapting the playing style to be less about demolishing teams with a mixture of power, pace and frenetic energy, and more about exerting authority in possession and taking fewer chances with their build-up play.\nAdapting the skillsets of Ryan Gravenberch and Cody Gakpo to suit the needs and requirements of this new-look team. Both struggled to hold down regular starting places until this season. They have now become pivotal parts of the team in different areas of the pitch.\nAnd yet it is how they coped with the match circumstances on Sunday and their opponent's strengths that was the real masterclass in adaptability.\nSlot used a system that catered for Manchester City's much higher possession count, preventing Pep Guardiola's side capitalising on that because Liverpool's defensive shape without the ball just did not allow them to.\nCity were smothered by a red tide, absorbing everything they tried to throw at Liverpool, before countering with a stunning simplicity and opening the City defence up with regularity.\nThis evening, Newcastle fans will come to Anfield sensing that the one that really counts is when the two sides meet in 18 days at Wembley in the Carabao Cup final.\nBut equally for Eddie Howe, Champions League football next season remains a realistic ambition while for Slot there is the knowledge that another win tonight may see them extend their lead at the top.\nWhatever happens, Liverpool will adapt.\nThey always do.\nListen to Total Sport Merseyside from 18:00 on weeknights and find details here of live Liverpool match commentaries on BBC Radio Merseyside", "url": "https://www.bbc.co.uk/sport/football/articles/cvgel95j43po"}