{"authors": ["Phil McNulty", "www.facebook.com"], "date_download": "2025-05-21 04:55:00", "date_modify": "2025-05-21 04:55:00", "date_publish": "2025-01-15 00:05:56", "description": "Nottingham Forest's heroics were only undone by a genius double substitution by Liverpool boss Arne Slot, writes Phil McNulty.", "filename": "sport_football_articles_cz7ew42qlzyo_1747803300.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1734/live/66301310-d2cd-11ef-a95c-5b151e1edf12.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cz7ew42qlzyo_1747803300.html", "title": "Nottingham Forest 1-1 Liverpool: Hosts' heroics undone by Slot's super sub on night of pure theatre", "title_page": "Nottingham Forest 1-1 Liverpool: Hosts' heroics undone by Slot's super sub on night of pure theatre - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Nottingham Forest owner Evangelos Marinakis sat in front of his own personal giant television screen in the City Ground directors' box glued to a night of pure Premier League theatre.\nWhether Marinakis' gaze was fixed on the television or events unfolding on the pitch in front of him, he was watching the fulfilment of his burning ambition to have Forest punching above their weight with the top-flight superpowers, in this case Premier League leaders Liverpool.\nThis was a night that had everything – from a wonderful fiery atmosphere as Forest fans live the high life, to a brilliantly drilled defensive display from Nuno Espirito Santo's side, only undone by a double substitution of genius from Liverpool head coach Arne Slot that almost turned defeat to victory.\nThe end result was a 1-1 draw that left Liverpool six points clear of Forest with a game in hand, the Premier League's surprise package demonstrating they fully deserve their place in the upper reaches of the table.\nFor 66 minutes it looked like Forest were about to inflict a second knockout blow on Liverpool this season after their September win at Anfield, still the only league defeat Slot's side have suffered this season.\nThe first half was classic Forest, classic Nuno, as they took the lead in trademark fashion after eight minutes, Anthony Elanga slipping a pass beyond Virgil van Dijk into the path of striker Chris Wood, enjoying a golden season, to finish clinically for his 13th goal of the season.\nAt the heart of this monumental Forest effort was goalkeeper Matz Sels, who performed heroics as Liverpool mounted a late head of steam, along with the twin powerhouses of Murillo and Nikola Milenkovic.\nIf there is a more formidable central defensive partnership in the Premier League, then they must be an intimidating sight.\nMurillo and Milenkovic are both quality players, but have a steely resolve and a \"they shall not pass\" approach that gives Forest's counter attacking game, with Elanga and Callum Hudson-Odoi on the flanks and Wood through the middle, the platform to flourish.\nBrazilian Murillo made 18 clearances against Liverpool, the most made by any player in a Premier League game this season. Forest made 59 overall, the second most in a Premier League game behind Leicester City's 63 against Arsenal in September.\nMilenkovic made 12 clearances as Forest made it a frustrating evening for Liverpool until Diogo Jota made his impact.\nAnd what a testimony to Forest's recruitment that the pair cost a relatively small sum of £27m, 22-year-old Murillo costing £15m from Corinthians in August 2023 while Milenkovic arrived for £12m from Fiorentina in July 2024.\nKeeper Sels also falls into the bargain basement category, costing only £5m from Strasbourg in February.\nHe was another rock for Forest, making five saves, including two vital blocks from Jota as well as a flying, athletic save from Mohamed Salah as the home side held on.\nLiverpool may have had nearly 71% possession, but this is Forest's style, perfected by manager Nuno and able to frustrate arguably the best side in Europe until more power arrived from the bench.\nSlot's frustration was as high as it has been this season as Forest built that formidable red barrier, constantly pointing at his watch to complain about perceived time wasting, but his calculating mind was still cool enough to make the double change that altered the course of the game.\nHe replaced the struggling Andrew Robertson and Ibrahima Konate with Jota and Kostas Tsimikas after 66 minutes – ignoring the usual wisdom of waiting until a corner had been taken before making the changes.\nThe reward came in 22 seconds as Tsimikas' set-piece was met by Jota's header and Liverpool were level.\nIt was Jota's first touch, and Liverpool's fastest goal by a substitute in a Premier League match since records began in 2006-07.\nSlot dismissed any suggestion this was some sort of tactical masterclass, saying: \"If it had been open play, then people could maybe say it was a tactical masterclass but it was a set-piece so I don't think I deserve any credit.\n\"It was a substitution where we brought an attacker on for a defender and the fact it immediately led to a goal, you could say it was luck.\"\nSlot hid his frustration at a second successive league draw as he said: \"Since the New Year, in two out of three games most agree with me where I say we deserve more than we got.\n\"The only one the pundits didn't agree with was the [Manchester] United game but when you look at the chances we both created, we deserved more than a 2-2 in that one. Too many times now, we deserved more than we got and this is something we have to adjust as soon as we can.\n\"Our fans, our players and me, we want to win the league but we want the fans to come and see us and like what they see.\"\nNo-one – not even the hard-to-please Marinakis included – would have left the City Ground feeling short changed after this thrilling instalment of the Premier League.", "url": "https://www.bbc.com/sport/football/articles/cz7ew42qlzyo"}