{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:13:33", "date_modify": "2025-05-21 05:13:33", "date_publish": "2025-04-05 00:00:00", "description": "Derby County's four-game winning run comes to an end as they are beaten by Eom Ji-Sung's late goal in a dire game at Swansea City.", "filename": "sport_football_live_cgqv83dgjqkt_1747804413.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8d82/live/ac427860-12c5-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cgqv83dgjqkt_1747804413.html", "title": "Swansea City 1-0 Derby County: Eom Ji-Sung goal ends Rams' winning run", "title_page": "Swansea City 1-0 Derby County: Eom Ji-Sung goal ends Rams' winning run - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Derby County's four-game winning run came to an end as they were beaten by Eom Ji-Sung's late goal in a dire game at Swansea City.\nSubstitute Eom touched home Josh Key's arcing cross at the far post as Swansea snatched the points with their first chance of the afternoon 11 minutes from time.\nUp until that point, Derby had looked more likely to find a breakthrough in a desperate contest, with Craig Forsyth missing perhaps their best opportunity from one of a succession of long throws.\nBut it was Swansea who found a way to claim a victory which eases their relegation worries while adding to Derby's concerns.\nAlan Sheehan's team are now seven points clear of the bottom three in 15th, while Derby drop a place to 21st and are only outside the relegation places on goal difference having lost for the first time since 1 March.\nSwansea caretaker boss Sheehan had suggested this game would be a \"dogfight\", puffing out his cheeks as he explained how difficult Derby had made life for their opponents in recent weeks.\nHis forecast proved precise, with the only hint of goalmouth action at either end during a desperate first half coming at set-pieces.\nThere was endeavour but little quality, energy but not much class.\nDerby's throw-ins were the biggest threat, with Kane Wilson's delivery from the right eventually teeing up a volley for Forsyth which the veteran left-back dragged off target.\nForsyth then sent in his own long throw from the opposite flank, with Matt Clarke flicking on and Wilson drilling into the side netting at the far post.\nThat was about it before the break – and things did not get much prettier after it.\nSwansea were almost non-existent as an attacking force for long spells, while another Forsyth throw caused panic for the hosts as Eom scrambled clear with Kayden Jackson lurking.\nThe first save of the game came 12 minutes from the end, when Harrison Armstrong's 20-yard effort was smothered by Swansea goalkeeper Lawrence Vigouroux.\nA minute later – and almost out of nothing – the game's key moment arrived when Key cut in from the right and curled a cross beyond everybody but Eom, who tapped home to give Swansea a first victory in four matches.\nDerby, who were without top scorer Jerry Yates because he was ineligible to face his parent club, had one late chance to level when Jackson found space in the box, but Joe Allen's brilliant recovery tackle condemned the Rams to defeat.\nSwansea caretaker head coach Alan Sheehan:\n\"It wasn't a good game to watch. I am not going to sit here and say I was really enjoying it.\n\"But there are different ways to win games in the Championship. Huge credit to John Eustace, he has found a way to win games and we had to try to match their physicality.\n\"I thought we dealt with their threats but we'd have liked to cause them more problems when we had the ball.\nThere are certain ways you have to play against certain teams.\n\"We could probably be slightly more fluid today but then concede two or three set-plays. It's up to me to find the right balance.\"\nDerby head coach John Eustace:\n\"I thought we did well and limited a very good Swansea side to next to nothing. I was disappointed in the way we conceded the goal because that hasn't been us of late.\n\"We needed to defend the box better because if you give a quality team half a chance they will punish you.\n\"We have just got to keep working hard and be as competitive as we can in every game. The effort of the group was outstanding and we didn't get the result we probably deserved.\n\"We didn't create many chances but neither did they - it was a tight game.\n\"It is a mad few weeks coming up but that's the Championship. That's why all we can do is concentrate on what we can do.\"", "url": "https://www.bbc.com/sport/football/live/cgqv83dgjqkt"}