{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:10:07", "date_modify": "2025-05-21 07:10:07", "date_publish": "2025-01-14 00:00:00", "description": "Relive Tuesday's Masters first-round matches involving Judd Trump and Mark Allen at Alexandra Palace.", "filename": "sport_snooker_live_c99xr1p9z5xt_1747811407.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_snooker_live_c99xr1p9z5xt_1747811407.html", "title": "Masters Snooker 2025 LIVE: Judd Trump vs Barry Hawkins & Mark Allen vs Si Jiahui", "title_page": "Masters Snooker 2025 LIVE: Judd Trump vs Barry Hawkins & Mark Allen vs Si Jiahui - results & updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tuesday's first-round results\nHere are Tuesday's results:\nJudd Trump 6-1 Barry Hawkins\nMark Allen 6-2 Si Jiahui\nThe first round concludes on Wednesday, with reigning world champion Kyren Wilson facing Zhang Anda (13:00 GMT) and 2023 Crucible winner Luca Brecel playing Chris Wakelin (19:00 GMT).\nBoth matches will be available to watch on BBC TV, BBC iPlayer and the BBC Sport website and app.\nAllen safely through to quarter-finals\nResult: Mark Allen 6-2 Si Jiahui\nAfter a scrappy start to the eighth frame, Si Jiahui misses a routine red and Mark Allen jumps all over it with a break of 80 to secure a 6-2 win.\nHe'll play Mark Selby in the quarter-finals on Thursday.\nAllen restores two-frame lead\nMark Allen 4-2 Si Jiahui\nSi Jiahui goes for a risky pot on a red early in frame six but gets it all wrong and Mark Allen is on hand to punish him.\nThe Northern Irishman falls just short of another century, but a 94 break is more than enough for him to go 4-2 up.\nSi pulls one back\nMark Allen 3-2 Si Jiahui\nIn the first frame after the mid-session interval, Si Jiahui makes a break of 60 to get to the brink of the winning post.\nA long red to the left corner makes it safe and the Chinese debutant is back within one of the 2018 Masters champion.\nPost\nMark Allen 3-1 Si Jiahui\nKen Doherty\n1997 world champion on BBC Four\nMark Allen is such a wonderful break-builder.\nHe's got that short cue action and great control of the cue ball. When he gets in and around the pink and black, he's deadly. He's scoring very heavily.\nAfter that first frame of about 40 minutes, the frames have gone very quickly.\nSi looks relaxed out there. He missed one ball at the start of the fourth frame that he maybe should have got, but other than that I think he's coped pretty well out there.\nAllen leads by two at interval\nMark Allen 3-1 Si Jiahui\nAnother fine break from Mark Allen, this time a contribution of 70, puts him 3-1 in front at the mid-session interval.\nHe's halfway to the six frames he needs to reach the quarter-finals.\nAllen back in front with 111 break\nMark Allen 2-1 Si Jiahui\nMark Allen replies with a century break of his own to retake the lead against Si Jiahui.\nAfter a long opener, frames two and three have been won with tons.\nPost\nMark Allen 1-1 Si Jiahui\nStephen Hendry\nSeven-time world champion on BBC Four\nThis will give something for Mark Allen to think about.\nIt was a bad mistake to go in-off and this young man has shown him what can happen if he gives him chances to score.\nSi century levels the match\nMark Allen 1-1 Si Jiahui\nSi Jiahui spreads the reds all over the table with a safety shot and leaves Mark Allen a fairly easy starter.\nHowever, Allen goes in-off when potting the red.\nThat leaves Si an excellent chance to accumulate and the young Chinese player does just that - it's not always straightforward, but he knocks in a 103 break to level the match.\nAllen wins lengthy opener\nMark Allen 1-0 Si Jiahui\nMark Allen takes a first frame which lasts just over 40 minutes.\nSi Jiahui needs three attempts to get out of that snooker behind the blue - and it really is a fantastic escape - but it gives Allen the upper hand in the first frame, despite still being behind on the scoreboard.\nAnother tough snooker to hit, this time behind the black, provides the chance for Allen to put it beyond reach.\nPost\nMark Allen 0-0 Si Jiahui\nThe first frame has been going for about 30 minutes now and it's still in the balance.\nMasters debutant Si Jiahui produces some confident pots during a break of 49, which gives him a lead of 13 points with four reds left on the table.\nAfter potting a red to end a lengthy safety exchange, Allen drops Si in a horrible snooker behind the blue.\nPost\nMark Allen v Si Jiahui\nKen Doherty\n1997 world champion on BBC Four\nIf you went on current form and experience, everything weighs in Mark Allen's favour.\nHowever, this young man Si Jiahui - what a talent.\nHe's fearless, we saw what he did in the [2023] World Championship and he should have been in the final, but for that wonderful comeback from Luca Brecel in the semi-final.\nHe's great to watch and thoroughly entertaining, and this crowd will absolutely love the way he plays the game.\nPost\nMark Allen v Si Jiahui\nAfter Judd Trump's victory over Barry Hawkins earlier on Tuesday, now it is the turn of another former Masters champion to make their entrance to the 2025 tournament.\nNorthern Ireland's Mark Allen, the 2018 winner at Alexandra Palace, faces Masters debutant Si Jiahui for a place in the quarter-finals.\nThe 22-year-old from China reached the semi-final of the World Championship on his Crucible debut in 2023.\nHawkins on the scoreboard\nJudd Trump 5-1 Barry Hawkins\nBarry Hawkins gets a frame on the scoreboard and avoids a dreaded 6-0 defeat at Alexandra Palace - although not without a few alarms.\nHawkins pots a wonderful red to the middle pocket to start a break of 70, which is enough to leave Judd Trump needing a snooker.\nTrump clears up to the yellow before attempting to snooker Hawkins on the green.\n\"The Hawk\" escapes and, after more snooker attempts, he rolls in a long blue to secure the frame.\nTrump one frame from victory\nJudd Trump 5-0 Barry Hawkins\nJudd Trump moves one frame away from a place in the Masters quarter-finals.\nTrump knocks in a 56 break and, after Barry Hawkins goes in-off attempting to pot a red, Trump adds the few extra points he needs to go 5-0 ahead.", "url": "https://www.bbc.com/sport/snooker/live/c99xr1p9z5xt"}