{"authors": ["www.facebook.com"], "date_download": "2025-04-26 06:21:32", "date_modify": "2025-04-26 06:21:32", "date_publish": "2025-03-04 00:00:00", "description": "Braintree Town earn a point at Maidenhead in the National League despite having a man sent-off", "filename": "sport_football_live_cj3nn7xgl5et_1745648492.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c091/live/2a8a0930-f792-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_cj3nn7xgl5et_1745648492.html", "title": "Braintree Town earn a point at Maidenhead in the National League despite having a man sent-off", "title_page": "Braintree Town earn a point at Maidenhead in the National League despite having a man sent-off - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Jermaine Francis salvaged a point for 10-man Braintree as they earned a 3-3 National League draw at Maidenhead.\nBraintree struck four minutes in when Tom Blackwell's corner reached Matt Robinson, who nodded the ball into the far corner and the Iron continued to threaten when John Akinde had an effort saved.\nThey soon struck again when Kyrell Lisbie pounced on a loose ball at the back before tucking home in the 24th minute and continued to hunt for a third when Marley Marshall-Miranda smashed an effort off the post.\nHowever, the game took a twist on the stroke of half time, with Maidenhead scoring in the 43rd minute when Reece Smith fired past Henry Gray and Braintree were reduced to 10 men in first half stoppage time after Akinde received a second yellow card.\nThe Magpies equalised in the 67th minute when Tristan Abrahams' corner was sent into a packed six-yard area and bundled home by Shawn McCoulsky and just five minutes later, Abrahams put them ahead from the penalty spot.\nTheir lead was short-lived, however, as Francis smashed the ball home from a corner in the 78th minute to rescue a point.", "url": "https://www.bbc.co.uk/sport/football/live/cj3nn7xgl5et"}