{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:23:16", "date_modify": "2025-05-20 12:23:16", "date_publish": "2023-08-05 00:00:00", "description": "Watch coverage and follow text updates as Jamaica face Australia in the Netball World Cup semi-finals in South Africa.", "filename": "sport_live_netball_65930747_1747743796.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/71D8/production/_130644192_jamaica-v-australia_nwc-2023_badges.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_netball_65930747_1747743796.html", "title": "Netball World Cup 2023: Watch Jamaica v Australia plus score & updates", "title_page": "Netball World Cup 2023: Watch Jamaica v Australia plus score & updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Until tomorrow...\nIt just had to be, didn't it?\nA repeat of the 2018 Commonwealth Games final awaits tomorrow as England will try to take down Australia to become world champions.\nThey've beaten them before, can they do it again?\nWe'll be back at around 16:45 BST tomorrow for all the build up to that massive game between 11-time champions Australia and World Cup final debutants England.\nIt should be an absolute cracker, can't wait.\nUntil then you can keep up to date with all the latest netball news here.\nSee you tomorrow.\n'We fought until the end'\nFT: Jamaica 54-57 Australia\nBBC Sport\nJamaica's Shamera Sterling speaking BBC TV:\n\"Obviously we are gutted to have lost, but it was a good fight to the end, and I'm very proud of the players that came and showed up today.\n\"I'm alright. As I said, maybe the Diamonds wanted it more.\n\"I just want to say a huge thank you to all the supporters that came out. We really, really appreciate it.\n'These are always the hardest games'\nFT: Jamaica 54-57 Australia\nBBC Sport\nAustralia captain Liz Watson speaking to BBC TV:\n\"This is amazing. We were disappointed with our performance against England and we knew it was going to be a really hard match today against Jamaica who are playing so well.\n\"These are always the hardest games, the ones that get you qualified into that gold medal match.\"\nOn the support from fans:\n\"This is incredible. When we ran out there weere so many green and gold gans here. I know there is so much love from back home, I think it is midnight there, so thanks to everyone who stayed up to support. We love you, we feel the support. One more to go!\n'It's going down to the last seconds'\nMadison Browne\nAustralia mid-court speaking on BBC TV\nWhat has impressed me most is that when you think one team is just about to pull away the other comes back and says \"absolutely not!\" And then momentum changes again.\nWe've had multiple lead changes, multiple momentum shifts, it's really going to come down to the last seconds.", "url": "https://www.bbc.com/sport/live/netball/65930747"}