{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:25:10", "date_modify": "2025-05-21 07:25:10", "date_publish": "2025-05-19 18:40:38", "description": "Chief executive Lance Bradley has told supporters Ospreys are committed to securing the region's future and their move to St Helen's remains unchanged.", "filename": "sport_rugby-union_articles_cx2q5wnxwdyo_1747812310.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2c0f/live/79106a50-34d6-11f0-ac8f-578ab9a74773.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cx2q5wnxwdyo_1747812310.html", "title": "Welsh rugby crisis: Ospreys pledge sustainable future and St Helen's move remain unchanged", "title_page": "Welsh rugby crisis: Ospreys pledge sustainable future and St Helen's move remain unchanged - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Chief executive Lance Bradley has told supporters Ospreys are committed to securing the region's future and their impending move to St Helen's remains unchanged.\nThe Welsh Rugby Union (WRU) has announced it will move away from a model of four evenly funded clubs after Ospreys and Scarlets did not sign up to its new Professional Rugby Agreement (PRA).\nThe governing body made the announcement they were reverting to a two-tier funding model amid reports it intends to cut a professional team.\nThe WRU has neither confirmed nor denied if reducing the amount of sides from four to three is part of its plans.\nThe WRU is scheduled to meet with representatives of Ospreys, Scarlets, Cardiff and Dragons on Wednesday at a meeting of the Professional Rugby Board (PRB), which is responsible for running the professional game in Wales.\nBradley has written to fans to reassure them Ospreys are determined to survive and thrive.\n\"We understand this kind of news can cause concern, but we want to reassure you, we are committed to building a sustainable, competitive and exciting future for the Ospreys, especially as we prepare for our move to St Helen's,\" said Bradley.\n\"We're proud of who we are, what we stand for, and the role we play in Welsh rugby.\n\"There are still questions to be answered, and like you, we have many of them.\n\"While we may not have all the clarity right now, we want you to know we're fully committed to securing not just the future of the Ospreys, but to play our part in ensuring a strong future for Welsh rugby as a whole.\n\"Our focus stays the same, building a strong, sustainable future for the club, and continuing to do our supporters proud.\"\nOspreys are due to move from Swansea.com Stadium to return to the St Helen's ground in the city by the end of the year, with Swansea Council involved in the £5m redevelopment process.\nBradley says he has spoken with Swansea Council leader Rob Stewart.\n\"I'm pleased to say I can confirm the council's commitment to our redevelopment of St Helen's remains unchanged,\" said Bradley.\n\"We're grateful for their continued support.\"\nA Swansea Council spokesperson said: \"We continue to work with the Ospreys and others on the club's plan for St Helen's to be redeveloped as a centre for all levels of rugby in the years to come.\"\nThe new PRA agreement had been signed by Dragons and Cardiff, who were last month taken over by the WRU having served formal notification that they intended to enter administration.\nLast week Ospreys and Scarlets said they had asked the WRU for assurances that the takeover \"will not disproportionally benefit Cardiff and disadvantage the independent clubs\" but that has not been given.\nOn Sunday, the WRU released a statement saying that with Ospreys and Scarlets not signing by the deadline set, it had therefore taken the \"difficult but necessary decision to issue the formal two-year notice to terminate the current PRA agreement in order, in particular, to proceed with its debt refinancing\".\nIn a joint statement on Sunday, Ospreys and Scarlets expressed concern and disappointment at the WRU's position, saying it had made a U-turn that had \"created more destabilising and debilitating uncertainty in our game\".\n\"The 'One Wales' strategy had been worked on collaboratively by the WRU and all four professional clubs for more than a year,\" said Bradley.\n\"The WRU's sudden U-turn away from that strategy and commitment to a 'four teams, equally funded' model for Welsh professional rugby was surprising and disappointing.\n\"It has raised questions for all four professional clubs, and for those who back and support them.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/cx2q5wnxwdyo"}