{"authors": ["Matty Fairnie", "www.facebook.com"], "date_download": "2025-05-21 06:15:06", "date_modify": "2025-05-21 06:15:06", "date_publish": "2025-04-01 10:45:35", "description": "Fan voice: How Rocky has rolled with punches to win round Hibs support", "filename": "sport_articles_c74n83l0qqno_1747808106.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/71f1/live/7e7b1350-0e6b-11f0-ba12-8d27eb561761.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c74n83l0qqno_1747808106.html", "title": "How Rocky has rolled with punches to win round Hibs support", "title_page": "Fan voice: How Rocky has rolled with punches to win round Hibs support - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Moments before Keiron Bowie sealed Hibs' win over St Johnstone on Saturday, three of the Easter Road stands serenaded Rocky Bushiri.\nIt was done partly in the hope he'd be handed the ball to take the penalty that had just been awarded, and partly to recognise his storming foray forward that had set up the opportunity for the spot-kick to be given in the first place.\nRocky is in the final few months of his contract and the imposing centre-half must be loving life at the moment.\nHe has been an integral part of Hibs' revival this season and the love from the stands on Saturday was a far cry from the taunts of the Hearts support back on Boxing Day following his unfortunate own goal in the Edinburgh derby.\nRocky, of course, had the last laugh that day and he's barely stopped laughing since. \"He's got a mistake in him\" is a statement often thrown out when Bushiri's name is mentioned, but that's a lazy observation these days – those mistakes are few and far between and while he will still make them, that goes for any footballer at any level.\nThe 25-year-old has not always been this popular with the support. His signing was clumsily announced by Hibs shortly after the club had announced his exit following the completion of an initial loan spell, and the rumours (incorrect as they may be) were that he'd been signed by accident.\nHe's been scapegoated and made a figure of fun by commentators and pundits who really should know better, so it's a huge credit to Rocky that he has come through such adversity to prove himself a key player in a squad sitting clear in third place.\nI hope Hibs can keep him. No doubt Rocky will have many suitors and he'll have his own ambitions but if he does leave, he will go having won round a Hibs support who have taken a real shine to him.", "url": "https://www.bbc.com/sport/articles/c74n83l0qqno"}