{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:38:56", "date_modify": "2025-05-21 03:38:56", "date_publish": "2025-04-08 00:00:00", "description": "Sunderland ensure they will finish in a play-off position with a point in a dire goalless draw at Norwch City.", "filename": "sport_football_live_cn5x4wwvzn7t_1747798736.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/dc96/live/87401ff0-14b8-11f0-8a1e-3ff815141b98.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cn5x4wwvzn7t_1747798736.html", "title": "Norwich City 0-0 Sunderland: Black Cats grab play-off spot", "title_page": "Norwich City 0-0 Sunderland: Black Cats grab play-off spot - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Sunderland secured a place in the play-offs in a dour goalless stalemate with Norwich City at Carrow Road.\nThe Black Cats knew that a point away to the Canaries, themselves needing a win to keep alive faint hopes of reaching the top six, would be enough to ensure their season goes beyond 3 May.\nMiddlesbrough's home defeat by Leeds United means, although Coventry City could still overhaul Regis le Bris' side by winning their remaining six games, the Teessiders can no longer catch them.\nThe game was a non-event with Anthony Patterson keeping the Canaries at bay in a one-sided first half and Sunderland going close to a winner with a late attacking flurry.\nSunderland looked like a side that was coasting towards the play-offs, and Le Bris reinforced that mood by making changes to the starting line-up, bringing in Tommy Watson, Alan Browne, Eliezer Mayenda and Mile Aleksic to the team that won at West Bromwich Albion.\nThe Canaries had more to play for and it showed in the opening half as Anis Ben Slimane headed a great chance into the side netting and then Patterson saved well from Borja Sainz after Dan Neil had lost possession on the edge of his own box.\nSainz also had a header saved by the Sunderland keeper, while Jacob Wright fizzed a shot narrowly wide and Chris Mepham produced a fine block to deny Marcelino Nunez when he finally seemed to have beaten Patterson.\nThe second half saw Sunderland in the ascendancy, especially after Le Bris threw on Patrick Roberts, Wilson Isidor and Enzo le Fee.\nWatson hit the byline and his shot deflected to Eliezer Mayenda, whose miscued attempt was headed clear by Shane Duffy as the Black Cats pressed forward in search of a third consecutive win.\nThey were thwarted again as Angus Gunn turned Mayenda's shot into the side netting and then Neil's curler lacked the height to trouble the Norwich keeper.\nNorwich head coach Johannes Hoff Thorup told BBC Radio Norfolk:\n\"We hoped for a win and did more than enough, especially in the first half, to get it. I'm pleased with our first-half dominance. We didn't allow one shot and we created enough to score.\n\"I'm not satisfied that we didn't convert some of those moments into goals, and the second half was a little bit more open and they were probably a little bit on top in the last 10 minutes.\n\"We have been talking a lot about [clean sheets] this season and what it takes to do that away from home and against the better teams in the league, and what it takes to convert those chances into more goals, so there's a lot of work to do in the future.\n\"But I'm pleased with the overall attitude of the players.\"\nSunderland head coach Regis Le Bris told BBC Radio Newcastle:\n\"It's a great achievement for the team, the staff and the club, so it's nice to be in the play-offs and have another purpose.\n\"We earned this opportunity and now it's important to manage the squad properly, to give some minutes to the youngest players so they can learn from experiences, and for the others who have played many games so far, it will be an opportunity to find the right balance, to be in good shape and refresh when necessary.\n\"In the first half we were too reserved, but after 30 minutes it was a little bit better, and during half time we spoke about the boldness we had to have, away against a strong team, and it was better in the second half.\"", "url": "https://www.bbc.com/sport/football/live/cn5x4wwvzn7t"}