{"authors": ["Matthew Henry", "www.facebook.com"], "date_download": "2025-05-21 05:22:43", "date_modify": "2025-05-21 05:22:43", "date_publish": "2025-01-31 19:25:37", "description": "England captain Jos Buttler questions the use of the concussion replacement rule after defeat by India in the fourth T20.", "filename": "sport_cricket_articles_ce3nweyvywlo_1747804963.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ac44/live/700181e0-e005-11ef-9fd1-4bb2cc41d064.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_ce3nweyvywlo_1747804963.html", "title": "India vs England: Harshit Rana concussion sub questioned by Jos Buttler after hosts' win", "title_page": "India vs England: Harshit Rana concussion sub questioned by Jos Buttler after hosts' win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It was the controversial moment that dominated the aftermath of India's victory over England in the fourth T20 in Pune.\n\"We disagree with the decision,\" said England captain Jos Buttler.\nBowler Harshit Rana was allowed to replace batting all-rounder Shivam Dube as a concussion substitute and went on to swing the game in his side's favour with the ball.\nNo-one would dispute the importance of concussion substitutes but England were left frustrated that Harshit was the player allowed to replace Dube.\n\"Maybe at the toss next game I will say we are going to play 12 [players],\" Buttler joked afterwards.\nThe situation arose after Dube, who scored 53, was hit on the helmet by a Jamie Overton bouncer off the penultimate ball of the final over in India's innings.\nHe was assessed by India's medical staff and allowed to face the final ball, but Harshit was subsequently approved as his concussion replacement by the match referee, allowing him to take Dube's place and, crucially, bowl in England's chase.\nEngland were unhappy, however, because playing conditions state concussion subs must be \"like-for-like\".\nDube, who bowls gentle medium pace, has bowled in less than a third of his T20s since the start of 2024 and is primarily a batter, having been carded in the top seven in all of his T20 internationals.\nHarshit was making his T20 debut but bowls close to 90mph and has only batted three times in his 26 T20s - once at number 10 and twice at number 11.\nThe 23-year-old went on to dismiss Liam Livingstone, Jacob Bethell and Jamie Overton and took figures of 3-33 in India's 15-run win.\nWith the game in the balance, he also bowled the penultimate over when 25 runs were needed from 12 balls. He conceded only six and dismissed Overton to effectively seal the game.\nConcussion replacements were first introduced by the International Cricket Council in 2019.\nIn cricket, players injured in other ways can be replaced as fielders but are not able to bat or bowl.\n\"The ICC Match Referee should ordinarily approve a concussion replacement request if the replacement is a like-for-like player whose inclusion will not excessively advantage his team for the remainder of the match,\" the ICC's playing conditions state.\nThey go on to say the match referee \"should consider the likely role\" the concussed player would have played during the remainder of the match and \"the normal role\" played by the replacement.\nThe conditions also say the match referee can \"impose conditions\" on the involvement of the replacement if he would \"excessively advantage\" the team.\nThe other options to replace Dube in India's squad were quick bowler Mohammed Shami, wicketkeeper-batter Dhruv Jurel, spin-bowling all-rounder Washington Sundar or batting all-rounder Ramandeep Singh, who bowls medium pace like Dube.\nButtler accepted Harshit's inclusion was not the reason for England's defeat but said he disagreed with the match referee's decision.\n\"It is not a like-for-like replacement,\" said Buttler, who added that he would seek clarification from the match referee Javagal Srinath.\n\"Either Dube has put on 25mph with ball or Harshit has really improved his batting.\n\"As I came out to bat I was thinking 'who is Harshit on for?'\n\"They said he is the concussion replacement which I obviously disagree with.\"\nFormer England captain Sir Alastair Cook said the decision makes \"no sense\".\n\"Replacing a big-hitting batting all-rounder, who has bowled one over in the IPL [in 2024], with a guy who can't bat and bowls heavy seam makes no sense to me whatsoever,\" he told TNT Sports.\n\"It seems absolute madness that you are allowed to do it, but credit to the lad on debut, but he shouldn't be allowed to play there.\n\"It gave the captain another brilliant option.\"\nEngland's defeat meant India took an unassailable 3-1 lead in the five-match series.\nThey reached 62-0 in pursuit of 182 but Ben Duckett was caught off the last ball of the powerplay, Phil Salt was bowled in the next over and Buttler was caught in the eighth.\nThey were also well-placed with Harry Brook unbeaten on 51, needing 53 from 34 balls, before he scooped leg-spinner Varun Chakravarthy to short fine leg.\n\"England were dumb with some of their shots and that is quite a hard thing to say because T20 cricket is a balancing act,\" Cook said. \"Sometimes the modern thinking is not right.\n\"Ben Duckett played beautifully today and we were 62-0 with one ball of the powerplay left. Just see it out and knock a single, then regroup again.\n\"I don't know if it is ego to just keep on playing their way. Just take a single and think about how important the next three or four overs against spin are going to be and your best player of spin can go at six or seven an over.\n\"If Brook had hit Chakravarthy for six runs they'd have needed just 10 in the final five overs with their best bowler done.\n\"He tried to play the ramp, almost as if his ego said that is the way we've been told to play. I get that you have to play with freedom to play T20 cricket, and to be able to express yourself, but you also have to play the situation in front of you and give yourself the best chance of ultimately winning the game.\"", "url": "https://www.bbc.com/sport/cricket/articles/ce3nweyvywlo"}