{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:45:46", "date_modify": "2025-05-21 05:45:46", "date_publish": "2025-01-14 12:47:03", "description": "Luton Town appoint Wycombe Wanderers head coach Matt Bloomfield as their new manager.", "filename": "sport_football_articles_czj3ymrkveko_1747806346.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8d64/live/f45f00b0-d278-11ef-9377-192b32874917.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_czj3ymrkveko_1747806346.html", "title": "Matt Bloomfield: Luton Town appoint Wycombe boss as new manager", "title_page": "Matt Bloomfield: Luton Town appoint Wycombe boss as new manager - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Luton Town have appointed Wycombe Wanderers head coach Matt Bloomfield as their new manager on a three-and-a-half-year contract.\nThe 40-year-old leaves the promotion-chasing League One side to replace Rob Edwards at Kenilworth Road just a week after the former Welsh international, who famously guided the Hatters to Premier League promotion in 2023, left the club by mutual consent as they struggle near the bottom of the Championship.\nLuton are 20th in the second tier, just two places and two points clear of the bottom three, as they look to avoid back-to-back relegations after losing their Premier League status after just one season in the top flight last May.\nBloomfield said it was a \"genuine honour and a privilege\" to take the helm at The Hatters. \"I'm incredibly proud and very, very happy to be here,\" he told the club's website, external.\nWycombe, who are second in League One, said they they remain focused on a \"long-term vision\" for the club and \"building on this season's foundations of success\".\n\"The club is naturally disappointed with Matt's decision to leave in the middle of the season,\" said a statement on Wycombe's website, external.\n\"However, we respect his decision to pursue this new chapter in his career. He leaves with the gratitude and best wishes of everyone at Wycombe Wanderers.\"\nBloomfield's assistant coach Richard Thomas, first-team coach Lee Harrison and senior analyst Ben Cirne will join him in making the switch to Luton.\nHis first game in charge will be at home to Preston North End on Saturday.\nLuton are the third club in three different divisions of the English Football League that Bloomfield has taken charge of in less than three years.\nThe former midfielder retired as a long-serving player at Wycombe in 2022 and moved into coaching with the Chairboys before being appointed as Colchester boss later that same year.\nWithin months he was back in League One as Gareth Ainsworth's successor at Wycombe, a club he first signed for in 2003 as a player after being released by Ipswich Town as a teenager.\nLuton chief executive Gary Sweet said Luton had \"gone above and beyond to compensate Wycombe\" to secure Bloomfield and his support staff.\nHe thanked the third-tier club for their \"co-operation in ensuring a swift and smooth transition\".\n\"Since returning to Wycombe as manager we have been hugely impressed with his work in leading them back towards the top of League One, and especially in how they have done it in such an entertaining way, forging a reputation for front-footed attacking football,\" Sweet added.\n\"We identified Matt's personal and team-building qualities as the outstanding candidate to fit in with the culture we have long established here at Luton Town.\"\nBloomfield said the depth of research Luton did on him and the sides he has managed gave him the \"feeling of being wanted\" and convince him \"that this was the right move at the right time\".\nWhile he was Wycombe boss for less than two years, his 19 seasons as a player there earned him the nickname of 'Mr Wycombe'.\nHe made 558 appearances for the club, and in the last of those seasons, 2021-22, he was named as a first-team coach alongside his playing duties.\nHe helped Wanderers to three promotions from League Two and was also part of the squad which took them into the Championship for the only time in their history, in 2019-20.\nHis first managerial appointment was at Colchester United in September 2022, and after guiding them away from the League Two relegation zone with nine wins from his 27 games in charge, he was appointed as Wycombe manager in February 2023 after Gareth Ainsworth left to join Queens Park Rangers.\nHe took Wycombe to the EFL Trophy final for the first time in their history last season and this year has led them into League One promotion contention with a 19-match unbeaten run that ended against Charlton Athletic on 29 December.\nAs Wycombe now search for a replacement, a caretaker coaching team made up of development coaches - including Sam Grace, Harry Hudson, Matty Dye and Jerome John - will oversee training and their upcoming fixtures.", "url": "https://www.bbc.com/sport/football/articles/czj3ymrkveko"}