{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:32:52", "date_modify": "2025-05-21 07:32:52", "date_publish": "2025-01-22 11:18:38", "description": "Arsenal news: Fan views on the one thing no-one is talking about", "filename": "sport_football_articles_c4gxp12nwzlo_1747812772.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c4gxp12nwzlo_1747812772.html", "title": "Arsenal news: Fan views on the one thing no-one is talking about", "title_page": "Arsenal news: Fan views on the one thing no-one is talking about - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for you what one thing - good or bad - that nobody is talking about at Arsenal but should be.\nHere are some of your comments:\nGuy: I feel Ben White's injury isn't being talked about enough. The past two seasons our defence has been rock solid. Last season we conceded 29 goals in the whole of the Premier League season. We are already at 21 this season. His absence has made a big difference, he also offered assists and worked well going forward.\nDan: Forget Bukayo Saka's and Gabriel Jesus' injuries. I think White's injury has caused us more problems. Since he got injured, our defensive record has been quite poor compared to this time last season. Not only that, but he added so much more to our attack that I haven't seen from Jurrien Timber.\nRachel: Do the Arsenal coaching team need to take a serious look at training methods and investigate reasons why so many players are out with injuries? Very disappointing to see new players like RIccardo Calafiori have already suffered several muscular problems. Is this usual for this player or only an issue since he came to Arsenal? Or are certain players injury prone?\nWill: Kai Havertz wins every aerial duel - we would and have been, far worse without him. The number nine isn't the problem. Liverpool score their goals from their right wing while our best player (who is also our right-winger) is injured and we have no-one close to that level to replace him. Injuries kill a team. We just have to accept that and go again.\nBob: Arsenal desperately needed goals from midfield and made the naive mistake of letting Emile Smith Rowe go to Fulham so they could bankroll the purchase of an incredibly injury-prone defender in Calafiori. He can be a joy to watch when he's fit and sharp - but with the history of the surgery he's needed, the warning signs were there that he was better suited to a slower league than the Premier League. Spending on him was a gamble that so far looks like it didn't pay off.", "url": "https://www.bbc.com/sport/football/articles/c4gxp12nwzlo"}