{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:37:44", "date_modify": "2025-05-21 07:37:44", "date_publish": "2025-03-28 12:30:55", "description": "Blackburn Rovers fan groups urge three senior officials to stay away from games amid unhappiness at how the club is being run.", "filename": "sport_football_articles_cz6161z4531o_1747813064.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e5fd/live/b4b423a0-0bc6-11f0-9028-6b47f4f81c48.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cz6161z4531o_1747813064.html", "title": "Blackburn: Fan groups urge senior club officials to stay away from games", "title_page": "Blackburn: Fan groups urge senior club officials to stay away from games - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A collection of Blackburn Rovers supporters groups are calling upon senior club officials to stay away from the side's remaining games this season.\nThe fan groups want chief executive officer Steve Waggott, head of football operations Rudy Gestede and chief operating officer, and representative of the owners, Suhail Pasha to not attend any of the final eight league matches.\nThe groups believe these figures have become a target for frustrations at how the club is being run and their absence could result in a more positive environment for the team to perform in.\nIn response, the club welcomed the call for unity, but insisted the senior leadership team will continue to attend matches.\n\"While differences of opinion exist, our shared goal is clear – to drive the club forward together,\" Rovers' statement said.\n\"As we enter the final eight Championship fixtures of the season, our focus must remain on supporting the team in what could be a decisive period for the club.\"\nBlackburn have slipped to ninth in the Championship, five points adrift of the play-off spots.\nRovers have taken just one point from their past five games, including four matches under new head coach Valerien Ismael.\nThe Frenchman arrived to replace John Eustace, who left the club to join struggling Derby County last month.\nBut a season that looked so promising - after a run of six straight wins in November and December had Blackburn as high as fifth and hopeful of maintaining a play-off push - is threatening to go the other way.\nThe club needed a strong transfer window to reinforce gaps in the squad but ended up scrambling in three players on deadline day.\nAnd since that strong run before Christmas, they have only collected 15 points from their past 18 matches.\nThey also face a situation this summer when 12 players either end their loan deals or are out of contract.\nAgainst this backdrop, the fan groups state the presence of Waggott, Gestede and Pasha has become a \"source of division\" among supporters and that their absence could engender a more \"unified and focused atmosphere\".\nThey are unhappy at the direction the club is taking on what is also the 30th anniversary of their Premier League title win.\nTheir statement on X, external said: \"Supporters' frustrations have grown due to concerns over the management of playing assets, declining matchday attendances and reports of executive pay increases during a period of serious uncertainty for the club.\"\nMany Rovers fans also believe it is time for new ownership at the club after nearly 15 years under the Venky's group.\n\"There is a growing sentiment [former owner] Jack Walker's legacy is being slowly eroded, resulting in an increasing desire for new ownership,\" the fan group statement said.", "url": "https://www.bbc.com/sport/football/articles/cz6161z4531o"}