{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:27:41", "date_modify": "2025-04-26 06:27:41", "date_publish": "2025-02-28 18:36:28", "description": "Former rugby player James Thomas swaps Manchester City for Warwickshire to become the Bears' new performance director.", "filename": "sport_cricket_articles_cgq9v8p5d3jo_1745648861.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d99d/live/297905f0-f5f3-11ef-bd6e-cd71c2e1454a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_cricket_articles_cgq9v8p5d3jo_1745648861.html", "title": "Warwickshire: Man City's James Thomas joins as performance director", "title_page": "Warwickshire: Man City's James Thomas joins as performance director - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Warwickshire have appointed Manchester City director of performance services James Thomas as their new performance director.\nThe former professional rugby union player, 42, succeeds former New Zealand Test player Gavin Larsen, 62, who quit in November \"for personal reasons\".\nThomas, who the club say is \"one of sport's leading high-performance experts\", is originally from the North East and played his rugby at Leeds, but is now based in Shropshire, living in Shrewsbury.\nHe will have responsibility for the county's men's and women's teams and also for the Birmingham Phoenix Hundred team, in which Warwickshire now hold a 51% share after Knighthead Capital, the American group co-owned by legendary NFL quarterback Tom Brady, took a 49% share. Knighthead also own football neighbours Birmingham City.\n\"James is recognised in high-performance sport as a real talent,\" said Warwickshire chief executive Stuart Cain. \"We wanted someone with real strategic experience of creating world-class, successful performance environments.\n\"Having worked globally, he understands the impact of other leagues on domestic structures, something we really need to get our head around as franchise cricket develops.\n\"The review also demonstrated our need to modernise the way we recruit and prepare for games with greater use of data and analysis.\n\"James has some really interesting ideas and plenty of experience in this space which will help us build more accountability and structure in to how we bring in and develop players, as well as create winning teams.\"", "url": "https://www.bbc.co.uk/sport/cricket/articles/cgq9v8p5d3jo"}