{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:44:04", "date_modify": "2025-04-26 07:44:04", "date_publish": "2025-02-26 18:04:19", "description": "Warrington Wolves head coach Sam Burgess will join the team in Las Vegas on Wednesday having been given a visa to enter the United States.", "filename": "sport_rugby-league_articles_ckgyrjvygpno_1745653444.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8d2d/live/bab8c770-f469-11ef-aeb3-bb556fdec0fe.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-league_articles_ckgyrjvygpno_1745653444.html", "title": "Sam Burgess: Warrington Wolves coach to join team in Las Vegas after being given US visa", "title_page": "Sam Burgess: Warrington Wolves coach to join team in Las Vegas after being given US visa - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Warrington Wolves head coach Sam Burgess will join the team in Las Vegas on Wednesday, having been given a visa to enter the United States.\nBurgess did not fly on Sunday before his team's Super League match against Wigan Warriors as he awaited clearance to enter the country.\nThe 36-year-old encountered issues obtaining a visa and reportedly visited the US embassy in London, in order to get his application approved in time for the fixture at the Allegiant Stadium on Saturday.\nAssistant coach Martin Gleeson told BBC Radio Merseyside: \"It's a huge bonus. There was a bit of uncertainty earlier in the week, but he is on his way now and he'll get here late this evening.\n\"We don't have a training day today, but he will be back for the planning of tomorrow's session when we link up with Penrith and the rest of the week will go as normal.\n\"It's great news for Sam, the club and the event over here.\"\nDespite the uncertainty over whether Burgess would be able to join the squad, Gleeson said it had not impacted on their preparations.\n\"It's out of our control what happened and the lads just got on with the job. It is what it is and we have that mentality,\" Gleeson added.\n\"I'm not sure the lads are fully aware yet that he'll be here tonight but we knew there was a high probability of him being able to get over in midweek and everything's gone according to plan so the lads will be buzzing.\"", "url": "https://www.bbc.co.uk/sport/rugby-league/articles/ckgyrjvygpno"}