{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:34:48", "date_modify": "2025-05-20 13:34:48", "date_publish": "2023-08-01 17:21:30", "description": "Prop Pierre Schoeman says Scotland can no longer be satisfied with pointing to progress and must fulfil their potential at the Rugby World Cup.", "filename": "sport_rugby-union_66376901_1747748088.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/16DDC/production/_130606639_20699397.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-union_66376901_1747748088.html", "title": "Scotland v France: Pierre Schoeman on Rugby World Cup expectation", "title_page": "Scotland v France: Pierre Schoeman on Rugby World Cup expectation - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Pierre Schoeman says Scotland can no longer be satisfied with pointing to progress and must fulfil their potential at the Rugby World Cup.\nThe Scots exited at the pool stage in Japan four years ago but are now ranked fifth in the world.\nThey host France on Saturday in the second of four warm-ups games.\n\"It's no more building phases or learning, you have to produce and deliver now,\" prop Schoeman told the BBC Scotland Rugby Podcast.\n\"The room for error is so small with these big teams, big players, big packs, but that's the challenge you want to play in and go up against.\n\"You prepare your whole life to play in these big Tests. Growing up as a guy who is in love with rugby, you want to go up against the giants. The biggest games, the biggest tests, the biggest moments.\"\nThe Scots began their warm-up schedule with a 25-13 victory over Italy at Murrayfield on Saturday.\nA number of key players, including Finn Russell, Duhan van der Merwe and captain Jamie Ritchie, were rested for that match but are expected to return to face the World Cup hosts in Edinburgh as preparations step up for the tournament in the autumn.\nGregor Townsend's men are outsiders to emerge from Pool B, with defending champions South Africa and Ireland, the world's top-ranked side, also in the group.\nSchoeman, however, is relishing the chance to take on the top sides and is especially motivated to face South Africa, the land of his birth.\n\"I'm very excited to play against them if selected,\" he said. \"We just work every day on the next test, the next hurdle which is France now, but there is already excitement for that.\n\"What better than to go to a World Cup in France and to play one of the best teams first? That's excellent.\n\"And to play one of the top teams [France] before the World Cup, that's even better.\n\"The World Cup is massive and it's a massive honour to prep for that, but the next week is the biggest thing. This game against France at Murrayfield, that's where our focus lies now.\"", "url": "https://www.bbc.com/sport/rugby-union/66376901"}