{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 08:02:50", "date_modify": "2025-05-21 08:02:50", "date_publish": "2025-01-13 13:31:40", "description": "Charlton Athletic sign academy prospect Josh Laqeretabua to a new long-term contract.", "filename": "sport_football_articles_c77r441v5mjo_1747814570.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9b8c/live/2f38e560-d1ad-11ef-bbe0-eb255759a6ac.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c77r441v5mjo_1747814570.html", "title": "Charlton Athletic extend academy defender Josh Laqeretabua", "title_page": "Charlton Athletic extend academy defender Josh Laqeretabua - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Charlton Athletic have signed academy prospect Josh Laqeretabua to a new long-term contract.\nThe 19-year-old defender, who represented Fiji at the 2023 Fifa Under-20 World Cup, has made eight senior appearances for the Addicks in all competitions since making his first-team debut in September 2023.\nSigning a deal until 2028 with a club option of an additional year, Laqeretabua said he was \"delighted\" to remain with the club whose academy he joined at under-nine level.\n\"It's nice to have a gaffer that takes you under his wing, puts faith in you and gives you opportunities,\" he told the club website., external\nLaqeretabua penned his first professional contract with the club in July 2023, making his full debut in October 2023 when starting Charlton's 4-2 win over Aston Villa's under-21s in the EFL Trophy.\nHis league debut arrived via a substitute appearance in November, in Charlton's 1-0 victory against Burton Albion - one of six appearances across all competitions this season.\nAddicks boss Nathan Jones said the club was \"really pleased\" the versatile defender had committed his future to Charlton.\n\"The club has a history of producing real, top end defenders and we believe Josh can be in that category,\" added Jones.\n\"He's had a tough time with injuries, which he is coming through now. He's been with the men's first-team for a significant number of months now in terms of training.\n\"He has athleticism and real quality. We're delighted that he's trusted us with his development and so we're excited about what the future can bring for him.\"", "url": "https://www.bbc.com/sport/football/articles/c77r441v5mjo"}