{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:45:56", "date_modify": "2025-05-21 07:45:56", "date_publish": "2025-03-28 08:27:11", "description": "Plymouth Argyle head coach Miron Muslic says he \"will try everything possible\" to extend Mustapha Bundu's stay at the club.", "filename": "sport_football_articles_c2erex00mkeo_1747813556.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/44b7/live/6adc6cc0-0ba7-11f0-9344-957e0d9fa61c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c2erex00mkeo_1747813556.html", "title": "Mustapha Bundu: Plymouth Argyle keen to extend forward's contract", "title_page": "Mustapha Bundu: Plymouth Argyle keen to extend forward's contract - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Plymouth Argyle head coach Miron Muslic says he 'will try everything possible' to extend Mustapha Bundu's stay at the club.\nThe 28-year-old Sierra Leone forward's two-year contract runs out at the end of the season.\nHe has scored in each of his last two Argyle appearances and also found the net in his country's 3-1 win over Guinea-Bissau last week.\nBundu has become a key part of Argyle's attack since Muslic took over at Home Park in January as the Pilgrims try and avoid relegation from the Championship.\n\"Musa has been in a good way since January,\" Muslic said.\n\"I think we also found a good position for him, how to take advantage of his profile because the advantage of Musa is he can actually play three or four different positions.\n\"He was signed as a right winger, he can also play on the left side and as a 10, but I even think he can play as a number nine with his back to goal because he can come into the ball and be the target player.\n\"I'm very happy with his performance, I'm aware he's running out of contract.\n\"It will be very, very good for us to try everything possible to keep this guy a little bit longer for us.\"", "url": "https://www.bbc.com/sport/football/articles/c2erex00mkeo"}