{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:10:48", "date_modify": "2025-05-21 07:10:48", "date_publish": "2025-03-30 10:00:20", "description": "Cyriel Dessers makes sure his 100th competitive appearance for Rangers is a memorable one, following a host of spurned chances with a late winner in a thrilling comeback away to Dundee.", "filename": "sport_football_articles_c78j5njylqeo_1747811448.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/748d/live/cf322ce0-0d42-11f0-81ee-8746eed4d16f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c78j5njylqeo_1747811448.html", "title": "'Brilliant worker' Cyriel Dessers delivers at death to mark Rangers century", "title_page": "'Brilliant worker' Cyriel Dessers delivers at death to mark Rangers century - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cyriel Dessers made sure his 100th competitive appearance for Rangers was a memorable one, grabbing a stoppage-time winner in a topsy-turvy, seven-goal epic away to Dundee.\nThe 30-year-old striker was the hero, but only after putting visiting fans and his manager through the wringer with a host of missed chances, along with a VAR offside intervention.\nBarry Ferguson declared Dessers \"a joy to work with\" but the interim boss must have been close to exasperated.\nThe Nigerian had 12 attempts on goal, the highest total for a player in the Premiership this season. Nine of those were on target.\n\"He should have had about five (goals),\" said Sportscene host Steven Thompson, \"But the great thing about Dessers is that he just keeps coming back for more.\"\nHis 23rd goal of the season arrived with effort number 10 in the 93rd minute as he finally found a way past goalkeeper Trevor Carson.\nAaron Donnelly's attempt at a headed clearance sat up for Dessers, who controlled with his chest before turning home a deft finish.\nTough to take for relegation-threatened Dundee, who twice held a two-goal lead, but demonstrative of the enigmatic Dessers, who might just best represent a wildly inconsistent season for his team.\nYes, his tally should be higher but he regularly makes a vital contribution.", "url": "https://www.bbc.com/sport/football/articles/c78j5njylqeo"}