{"authors": ["Nick Mashiter", "www.facebook.com"], "date_download": "2025-05-21 03:43:28", "date_modify": "2025-05-21 03:43:28", "date_publish": "2024-12-19 14:32:57", "description": "Premier League strugglers Wolves appoint former Porto boss Vitor Pereira as their new head coach.", "filename": "sport_football_articles_cy8ykme9m33o_1747799008.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3fba/live/93b829a0-be17-11ef-89ab-d55cbbf64b27.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy8ykme9m33o_1747799008.html", "title": "Wolves: Vitor Pereira appointed new head coach of Premier League strugglers", "title_page": "Wolves: Vitor Pereira appointed new head coach of Premier League strugglers - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Premier League strugglers Wolves have appointed former Porto boss Vitor Pereira as their new head coach.\nThe experienced Portuguese joins from Saudi Pro League side Al-Shabab on an 18-month contract, with Wolves paying about £825,000 in compensation.\nHe replaces Gary O'Neil, who was sacked on Sunday following Saturday's 2-1 defeat to Ipswich, which left Wolves second bottom of the Premier League.\nPereira took charge of training for the first time on Thursday and his opening game is Sunday's trip to Leicester, who are 17th in the table and five points clear of Wolves.\nWolves had been assessing their options for a number of weeks and sounded out candidates, including former West Ham manager David Moyes.\nPereira quickly became the frontrunner and joins having won Primeira Liga titles with Porto in 2012 and 2013 and the Greek Super League with Olympiakos in 2015.\nHe had been in charge at Al-Shabab since February and leaves them sixth in the Saudi Pro League.\nThe 56-year-old succeeds O'Neil, who was appointed at Molineux in August 2023, with Wolves having lost 11 of their 16 Premier League games this season.\nThey have won just twice, against Southampton and Fulham, with their seven-year stay in the top flight under threat.\nWolves chairman Jeff Shi said: \"Vitor is a highly respected and experienced coach who has achieved success across different leagues and will bring a new approach for the test ahead.\n\"This is a challenging moment for the club, and we want to thank Vitor for taking on this responsibility.\n\"We have full confidence in his ability to guide us back on track, alongside the players and staff, and the entire club will be united in supporting him to achieve success.\"\nRight decision for Wolves? What are his priorities?\nLet us know using the form below.", "url": "https://www.bbc.com/sport/football/articles/cy8ykme9m33o"}