{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:59:38", "date_modify": "2025-05-21 03:59:38", "date_publish": "2025-01-15 10:28:47", "description": "Former Everton manager Sean Dyche says successor David Moyes will \"build on the stable footing we have implemented\".", "filename": "sport_football_articles_cy0p9pxez63o_1747799978.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8adb/live/35ca3d90-d322-11ef-9bab-e1537b3d246b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy0p9pxez63o_1747799978.html", "title": "Everton: Sean Dyche says David Moyes will 'push club forward'", "title_page": "Everton: Sean Dyche says David Moyes will 'push club forward' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Everton manager David Moyes will \"push the club forward\", says predecessor Sean Dyche.\nMoyes was appointed on Saturday for his second spell in charge, two days after Dyche was sacked.\nDyche took charge in January 2023, helping Everton finish one place above the Premier League relegation zone in 2023-24 and 15th last season - 14 points clear of relegation despite an eight-point deduction for breaching financial regulations.\nEverton are currently 16th in the table, a point above the bottom three.\nIn a statement, external released through the League Managers Association, Dyche said: \"David is a manager who I have great respect for and I believe he and his staff will help to push the club forward again and build on the stable footing we have implemented in the past two years.\n\"The right time has come to leave the club, with the team in good shape.\n\"My part as a custodian has been played and I will forever take great pride in that.\"\nEverton were sanctioned twice last season for financial breaches.\nThey were docked 10 points - reduced to six on appeal - then two points by the Premier League.\nDyche said he experienced \"some extremely difficult situations\" during one of the \"toughest periods\" in Everton's history.\nEverton host Aston Villa in the league on Wednesday in Moyes' first game back.\nHe managed Everton from 2002 to 2013, finishing in the top eight nine times and reaching the FA Cup final.", "url": "https://www.bbc.com/sport/football/articles/cy0p9pxez63o"}