{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:45:24", "date_modify": "2025-05-21 03:45:24", "date_publish": "2025-01-23 17:19:52", "description": "Arsenal news: Opinion - Fara Williams on Gunners' game management", "filename": "sport_football_articles_c203xxdqn5eo_1747799124.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d635/live/a97973f0-6e9b-11ef-b02d-c5f3b724a1ea.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c203xxdqn5eo_1747799124.html", "title": "Opinion - Fara Williams on Gunners' game management - BBC Sport", "title_page": "Arsenal news: Opinion - Fara Williams on Gunners' game management - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "There is always talk around Arsenal needing a striker but they create more than enough opportunities to put games to bed.\nWhen you do not take them, you leave teams in a game and then the chances are that the opposition pull one back and the momentum shifts.\nIt feels like they are going through a very similar spell to last year around the Christmas period. They have a high expected goals (xG) per game but they just do not kill games off.\nThat is part of the issue, but also they cannot deny that the game management needs to be better.\nThey missed Martin Odegaard when he was out injured and as he came back, Bukayo Saka was sidelined, so they have struggled with creativity building up to goals.\nFrom open play, it is apparent they are not scoring as many goals and if you took away the goals from set-pieces, then they would be in a worse position.\nLast season they had a back four that did not really change and they were defensively solid. They conceded the fewest goals in the league and that played a big part in them pushing for the Premier League title.\nThey have lost Ben White this season and maybe that is part of the problem down the right-hand side because they do look easier to score against than in recent years.\nArsenal have controlled the majority of their games but still looked vulnerable. They need that number nine to rely on when things are not going well.", "url": "https://www.bbc.com/sport/football/articles/c203xxdqn5eo"}