{"authors": ["Dan Roan", "www.facebook.com"], "date_download": "2025-05-21 07:55:45", "date_modify": "2025-05-21 07:55:45", "date_publish": "2025-05-20 05:13:13", "description": "Manchester United play \"the most financially important match in the club's history\" against Tottenham on Wednesday - BBC sports editor Dan Roan explains why it is one they cannot afford to lose.", "filename": "sport_football_articles_cly3wed9de5o_1747814145.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3a2c/live/b2619f00-34c1-11f0-aa60-d5869f4a84da.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cly3wed9de5o_1747814145.html", "title": "Europa League final: The £100m match Manchester United can't afford to lose", "title_page": "Europa League final: The £100m match Manchester United can't afford to lose - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "\"It's a crossroads moment.\"\nThat is the verdict of former Manchester United first-team coach Rene Meulensteen on the club's Europa League final against Tottenham on Wednesday.\nLike all United fans, the Dutchman is coming to terms with a bitterly disappointing domestic campaign, and dreading the consequences of failure in Bilbao.\n\"It would be a silver lining. A win in the Europa League isn't going to make up for the most disastrous season,\" Meulensteen told BBC Sport, with United languishing 16th in the Premier League, and now condemned to their lowest top-flight finish for more than half a century.\n\"But if they don't win it, why would we expect anything different next season? The trophy would free up some finances to get players in.\n\"If they don't win it, we won't be in Europe, and I really worry what the future is going to look like.\"\nWith qualification for the lucrative Champions League the prize for the Europa League winners, and set against the backdrop of United's long decline, it is easy to see why the match is being portrayed as such a defining moment at Old Trafford.\nBut just how significant is it really?\n\"Financially, it's the most important match in the club's history,\" says football finance expert Kieran Maguire.\n\"Champions League participation is crucial, because it could generate over £100m from tickets, broadcast money, and sponsor bonuses.\"\nWith four home games guaranteed, Maguire estimates that there could then be an additional £30m-£40m if United go deep into the competition.\nWhile the benefits of being back in the expanded Champions League apply just as much to Spurs of course, United arguably need it more.\nSpurs recorded an annual loss of £26m last year, while United's deficit was £113m over the same period. That took their total losses to £300m over the past three years.\nThe sense of underperformance is even more stark given United generated total revenue of £651m last year, the fourth highest by any club in world football.\nBut due largely to the leveraged takeover by majority owners the Glazer family in 2005, the club are also more than £1bn in debt, which costs tens of millions of pounds a year to service. And that burden is set to increase in the years ahead because of refinancing and higher interest rates.\nIndeed, United have admitted they have been at risk of failing to comply with Premier League profit and sustainability rules (PSR) that limit clubs' losses.\nIn March, co-owner and petro-chemicals billionaire Sir Jim Ratcliffe told me the club would have gone bust by the end of the year if significant action had not been taken, bemoaning the financial burden of several players he had inherited who \"were overpaid and not good enough\".\nMeanwhile, fans are clinging to reports linking the club with moves for potential targets such as Liam Delap, Antoine Semenyo and Matheus Cunha. But if United fail to sell loaned-out, high-earning players such as Marcus Rashford, Jadon Sancho and Antony, acquisitions could hinge on what happens in Bilbao.\nLuring new players to Old Trafford is likely to be much easier if the club can offer European football. And United have admitted that if they are to improve their underperforming squad, they need to cut outgoings, hence the hundreds of staff redundancies, and ticket price increases imposed by Ratcliffe - that have sparked protests by fans.\n\"United still have one of the highest wage bills in the Premier League. They have a squad which has cost more than £1bn, and many of those deals have been on credit, so they have outstanding instalments of over £300m that need to be paid,\" says Maguire.\n\"So they need the cash from the Champions League to meet their ongoing financial obligations, and that's before they start recruiting the players the manager wants. The additional revenue will put the club in a far stronger position in terms of a reboot.\"\nSuch thoughts are echoed by former United defender Rio Ferdinand who told PA that victory could spark a \"new era\" for the club.\n\"With Manchester United, they need the money to recruit for this manager and it's a vital period for him in that sense,\" he said. \"I do think it's a chance to press the restart button and it will be a new era if these are the guys who managed to win.\"\nWith each finishing position in the Premier League table worth around £3m, United have made around £30m less than the club's executives would have been planning for.\nFor the Ineos hierarchy, a trophy would also help compensate for the £14.5m spent on the sacking of former manager Erik ten Hag - who was retained and then backed in the transfer market last summer - and the hiring and firing of former sporting director Dan Ashworth.\nUnder mounting scrutiny over such decisions, club bosses are also yet to explain how they will afford to build a proposed new stadium estimated to be costing at least £2bn.\nAt a time when Ratcliffe is reducing his other sports investments, including an Ineos sponsorship agreement with Spurs, in a challenging economic landscape for the chemicals industry, a first European trophy since taking over at Old Trafford would be a very timely boost.\nWinning in Bilbao would also come at a cost. With player contracts heavily incentivised, Maguire estimates that qualifying for the Champions League will also mean United could face having to pay out 25% extra on wages. But he maintains that the Champions League would still be \"transformative\".\nManager Ruben Amorim hinted as much when admitting that the Champions League was more important to him than winning the Europa League. \"The best way to help us to get to the top in a few years is the Champions League, not the cup,\" he said.\nWhen asked if being out of Europe next season might actually help by giving him more time to work on his squad, he was clear that losing the final against Spurs would be \"really bad... the patience of the fans and you guys [the media] next year if we don't win it is going to be on the limit\".\nFor Spurs, the prospect of a first trophy since 2008 is also a chance to salvage something from a desperate Premier League campaign that – just like United - has redefined what domestic failure looks like for a so-called 'Big Six' club.\nTheir season has also featured furious fan protests over a perceived lack of investment by the club's owner Enic and the approach of chairman Daniel Levy.\n\"Qualifying for the Champions League would be in the desirable category for Spurs, rather than essential,\" says Maguire.\n\"They are the best-run business in the Premier League. They have the most profits historically. They have an ability to generate money from non-football activities to a far greater extent than any other club, so they've always got this as a support mechanism.\"\nAt United, a second consecutive season out of the Champions League means the club will have to pay kit provider Adidas a £10m penalty under the terms of their deal.\nSpeaking on condition of anonymity, one former senior United figure predicts that the sponsorship revenue the club have prided themselves on over so many years could be at risk of \"collapsing\" if they are out of Europe for only the second time in 35 years, and that their brand value is now at a pivotal moment.\n\"Not being a European team creates more existential issues around the whole model\" they told BBC Sport, pointing to the end of the Tezos sponsorship of the club's training kit this summer, with no announcement yet about any replacement.\n\"It's not healthy, and people start to question whether you are still a 'big club'. But win, and it keeps the wheels spinning. The cash will be 'lifeblood' that allows them to keep trading. If not, they'll have to look at selling homegrown talent like Alejandro Garnacho and Kobbie Mainoo to give them the funds they want.\"\nSome United fans travelling to Bilbao will hope the match evokes memories of the 1991 Cup Winners' Cup triumph - which helped spark the subsequent Sir Alex Ferguson glory years, and showed the club could perform again at a European level.\nOthers will look to 2017 as inspiration, when Jose Mourinho's team won the Europa League final to rescue Champions League qualification after finishing sixth in the Premier League. But given how much worse United's league performance has become, this feels much more significant.\nLose against Spurs, and many will feel that Ineos' already ambitious Mission 21 plan to turn United into Premier League champions by 2028 could start to look like Mission Impossible. However, senior United insiders dispute the suggestion that this is \"win or bust\", insisting that the cost-cutting programme the club are implementing is designed to give flexibility in the summer transfer window, and has been predicated on a 'no-Europe' scenario.\nWhile they accept that winning the Europa League would provide a major boost, they say the key is fixing the club's structure.\nBoth Amorim and his counterpart, Spurs boss Ange Postecoglou, have played down suggestions that the Europa League offers some kind of panacea. Indeed, with Spurs also on course for their worst-ever Premier League season, victory may not be enough to keep Postecoglou in his job, while Amorim seems secure in his, even if his team loses.\nAnd yet there is no denying that there will still be a huge amount at stake on Wednesday, making this one of the most eagerly anticipated matches of the season.\nWhile the neutrals can enjoy the jeopardy, United and Spurs fans will long for a much-needed sense of hope at the end of a season to forget. Here in Bilbao, a city known for its regeneration, lies a chance to kickstart a revival.\nLose, however, and the road to recovery will feel much longer.", "url": "https://www.bbc.com/sport/football/articles/cly3wed9de5o"}