{"authors": ["Jonty Colman", "www.facebook.com"], "date_download": "2025-05-20 12:34:29", "date_modify": "2025-05-20 12:34:29", "date_publish": "2023-08-04 08:11:35", "description": "Surrey wicketkeeper-batter Jamie Smith is a \"generational talent\" and wants to feature for England in all three formats.", "filename": "sport_cricket_66385461_1747744469.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/12D0F/production/_130617077_england_nxtgen_jamiesmith.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66385461_1747744469.html", "title": "England Next Gen: 'Generational talent' Jamie Smith destined for international honours", "title_page": "England Next Gen: 'Generational talent' Jamie Smith destined for international honours - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Throughout the 2023 Hundred, BBC Sport is running a feature series called England Next Gen, designed to look at players who may make the step up to international cricket in the next few years. Next up is Birmingham Phoenix and Surrey wicketkeeper-batter Jamie Smith.\nJamie Smith has one dream - to represent England in all formats of the game.\nDespite turning 23 less than a month ago, Smith already has over 2,500 first-class runs for Surrey, and a further 1,100 in white-ball domestic cricket.\nThe wicketkeeper-batter has been on England's radar for some time.\n\"Jamie Smith is a nailed-on certainty to be playing cricket for England. He is a generational talent. The man is a genius,\" said BBC Test Match Special commentator Dan Norcross.\nSmith featured in six matches for England under-19s in their multi-format series in Bangladesh in 2019, captaining in the four white-ball matches.\nFor Surrey, his chances of keeping this year have been limited by Ben Foakes' omission from England's Ashes squad, but Smith says that has \"done him the world of good\".\nIt has allowed him to focus on his batting - and he averages 41.81 in Division One of the County Championship this season, putting him in the top ten leading run-scorers alongside the likes of Alastair Cook, Dan Lawrence and James Vince.\nAll of those have played for England at Test level and the Surrey hot-prospect, who plays for the Birmingham Phoenix in the 2023 edition of The Hundred, hopes for international honours soon.\n\"I'm very proud of what I've achieved so far and I'm looking to push on in the last couple months of this season,\" Smith told BBC Sport. \"Hopefully, that can culminate in playing for England in all formats in the future.\"\nSomeone who knows Smith better than most is Phoenix team-mate and former England Under-19s colleague Dan Mousley. The duo have known each other since Mousley was 17, and five years on, the spinning all-rounder believes Smith's England senior debut is a case of when rather than if.\n\"Even the first time I met him I thought 'Jesus, he's a proper player', and it doesn't surprise me how well he is doing at all,\" said Mousley.\n\"He can 100% play all formats for England and have a long, successful career.\n\"I don't think he's too far away, I wouldn't be surprised in the next 18 months if he's playing for England.\"\nSmith's tally of 669 runs in first-class cricket is already his career-best for a season, with Surrey still having three County Championship matches remaining next month as they eye back-to-back Division One titles.\nThis year, his tally of runs have come at a strike-rate of 64.38, and that significantly increased rate of scoring includes a 77-ball knock of 114 in the fourth innings at Kent in June, with Surrey chasing a 98-year record 501.\nWhile Smith knows that England favour attack-minded batters in the Brendon McCullum and Ben Stokes era, he does not put his improved season down to an increase in his strike-rate, more to a confidence-boosting England Lions tour to Sri Lanka in January.\nOn the tour he scored 202 runs across two multi-day matches at an average of 67.33, including an 82-ball 126, leaving him with a series strike-rate of 124.69.\n\"It's been pretty clear messaging that if you want to play for England you have to be fearless and know when to take the game on and try and put people under pressure,\" said Smith.\n\"This year there has been a massive emphasis on finding the best ways, at different times, to score runs and be positive with that.\n\"Also, being adaptable, you've got to read the situation - and that mindset shift has been huge for me and it's given me a lot of confidence to get out there and perform at my best.\"\nMousley knows all about Smith's batting from playing with him for England's under-19s and earlier this season the two faced each other in the County Championship, where Mousley got a first-hand sight of the form Smith is currently in.\n\"When he was batting with the tail, he really stood out for me, just the maturity to bat with the tail and choosing the right options,\" said Mousley.\n\"He's very, very difficult to bowl to. He's got all the shots and to see him do really well is really, really pleasing.\n\"His shot over extra cover, he hits that better than anyone to be honest.\"\nSmith was part of The Hundred last year but failed to make a single appearance for London Spirit, only to be picked up by Phoenix in this year's draft for £50,000.\nWith all games televised, unlike the County Championship and T20 blast, Smith sees the opportunity for him and others to use it as a platform to set-up an imminent career in international cricket.\n\"It's a fantastic opportunity. We've seen a few players already that have made the step up into international cricket, there's probably a few more that are going to make it off the back of this tournament alone.\"\nWith England set to go through a period of change because of an ageing squad after October and November's 50-over World Cup, Smith's opportunity may come in the near future.\nMost believe he is ready now.", "url": "https://www.bbc.com/sport/cricket/66385461"}