{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:40:28", "date_modify": "2025-05-21 07:40:28", "date_publish": "2025-02-11 00:00:00", "description": "Dan James' double sets Leeds on course to a comfortable win at Watford to extend their lead at the top of the Championship.", "filename": "sport_football_live_c2472zz3nq3t_1747813228.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c2472zz3nq3t_1747813228.html", "title": "Watford 0-4 Leeds United: Dan James sparks Leeds romp against Hornets", "title_page": "Watford 0-4 Leeds United: Dan James sparks Leeds romp against Hornets - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Leeds maintained their promotion charge with an emphatic 4-0 victory against Watford at Vicarage Road to extend their lead at the top of the Championship table to five points.\nTwo goals inside nine first-half minutes from Dan James - the Wales international pouncing on mistakes from the Hornets - set Daniel Farke's side on course.\nA third before half-time from Manor Solomon added further pain and an intricate move finished off with brilliant close control from Joel Piroe just after the hour left Leeds free to coast home unchallenged.\nWatford deserved credit for not giving up the fight against the league leaders, pushing hard to the final whistle, but defeat added to a poor run of just one win in their past 10 matches for Tom Cleverley's side, who slipped to 12th place.\nWatford had eased growing pressure on their manager with a creditable 2-2 draw away at Sunderland on Saturday and made a bright enough start, exchanging chances with Leeds in the opening minutes.\nBut any positivity at Vicarage Road evaporated quickly with a string of unforced errors which, against a side as confident as the league leaders, were always likely to be punished.\nJames was first to capitalise, latching on to a loose pass from Edo Kayembe inside his own half, driving forward and slotting past Egil Selvik in the Hornets' goal.\nEight minutes later, it was Kayembe who was again the villain, this time with a loose pass inside the Leeds penalty area. Two passes and one lightning counter attack later, through Ilia Gruev and Piroe, James had the ball again.\nHis finish this time, high inside Selvik's left hand post, was emphatic.\nWatford saw enough of the ball to believe they were still in it but on 35 minutes two became three - Manor Solomon receiving the ball from a throw in, cutting inside and firing home via a wicked deflection off the heel of Mattie Pollock which left Selvik no chance.\nLeeds were not done, adding a fourth just after the hour mark, Ao Tanaka combining with Piroe, whose dazzling close control put Pollock on his backside and whose left-foot finish proved too good for Selvik.\nIt was a 14th league goal of an increasingly impressive season for the striker.\nWith Leeds cutting loose with their full repertoire of attacking skills, James went close to bagging his hat-trick, pushing a shot from distance just wide after a flowing move.\nYet, with Leeds relaxing, the home side never gave up the fight and might have grabbed a consolation, Giorgi Chakvetadze hitting the bar and Imran Louza forcing a fine save from Illan Meslier three minutes from time.\nWatford manager Tom Cleverley speaking to BBC Three Counties Radio:\n\"A tough night? Absolutely. We were in the presence of a very strong Championship side. I think we knew that before but it is one of the best teams I have seen at this level.\n\"It should give us inspiration that they are the levels we want to get to. I feel like all my players have got the potential to reach that level but it doesn't just happen so I challenge the players to be more intense in their work in the week, more professional wherever they can – and I am not saying any of them are unprofessional. You can always do more.\n\"But there were some positives with the character we showed to try and play so I cannot criticise my players. It would have been easy to chuck the towel in or start looking towards Saturday and protecting yourself when the game is done but they kept going.\"\nLeeds manager Daniel Farke speaking to BBC Radio Leeds:\n\"We started on the front foot with good chances but I have to say that Watford also had good situations in the first 10 minutes. They are a good side who are dangerous on the counter-attack so it was important for us to score the first goal.\n\"I'm not sure the 4-0 reflects how difficult this game was because I really like how Tom [Cleverley] sets up his team. I think he is doing an excellent job here and it was difficult to take possession away from them.\n\"I predict not many teams will leave here with three points so I am pretty happy with the win and the scoreline and clean sheet.\n\"But we were really excellent in executing our counter-attacks and the fourth goal was poetry in motion. You would have to say the individual performance of the players up front was of a top level.\n\"If we perform like this our offensive row is unplayable at times.\"", "url": "https://www.bbc.com/sport/football/live/c2472zz3nq3t"}