{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:22:44", "date_modify": "2025-05-21 05:22:44", "date_publish": "2025-01-23 08:15:11", "description": "Teenager Rocky Flintoff, son of former England all-rounder Andrew, scores a century for England Lions in Australia.", "filename": "sport_cricket_articles_c23nm5jd8z5o_1747804964.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2851/live/e73893e0-d95f-11ef-968b-2da667d2a722.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c23nm5jd8z5o_1747804964.html", "title": "Rocky Flintoff scores century for England Lions in Australia", "title_page": "Rocky Flintoff scores century for England Lions in Australia - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Rocky Flintoff, son of former England all-rounder Andrew, scored a century for England Lions against a Cricket Australia XI in Brisbane.\nFlintoff, 16, was batting at number nine and struck 108 from 127 balls in the Lions' first-innings 319 all out.\nHe is being coached by his father for the Lions tour, where the England team were beaten by seven wickets in the first match.\nFlintoff's century helped the Lions build a healthy lead over Cricket Australia, who trail by 72 runs having reached 33-1 in their second innings.\nOpener Alex Davies' 76 was the second-highest score while Freddie McCann, who made 51, also helped rescue the Lions from 161-7.\nEngland Test-capped bowler Josh Tongue supported Flintoff with five from 29 balls and Mitchell Stanley dug in for four from 27.\nIn the first innings, Lions seamer Pat Brown took a hat-trick in his 5-21, as Cricket Australia slipped to 55-4 but recovered thanks to wicketkeeper Ryan Hicks' 64.\nEngland Test spinner Shoaib Bashir took 1-62 from his 16 overs.\nFlintoff signed his first professional deal for Lancashire in June after making a century for the club's second XI in April.\nHe made his first-team debut in July and has since played four first-class matches and seven List A games.\nAnalysis by BBC chief cricket reporter Stephan Shemilt\nEven after his astonishing rise last summer, eyebrows were raised when Rocky Flintoff was named as part of the England Lions tour of Australia, a trip partly designed to be preparation for the Ashes down under later this year.\nFlintoff had been quietly added to a Lions squad in South Africa in December, albeit when already in the country with the England U19s, but this seemed a huge step for a youngster averaging 12 from his four first-class matches. Given the head coach is his father, there were whispers of nepotism.\nNow we have another landmark in a remarkable story. The bowling attack of the CA XI was made up of youngsters and journeymen, but Flintoff made runs where others close to the England senior side did not.\nHe may now have put himself in line to play in the 'Test' against a very strong Australia A side in Sydney next week.\nComparisons to his father are easy to make. Shots that Rocky plays are almost an avatar of Andrew. They even run in a similar way.\nHis development is also being fiercely protected. Andrew has barely spoken to the media since he returned to cricket following his life-changing crash while filming an episode of Top Gear. So far, every request to hear from Rocky has been rejected.\nWith Archie Vaughan also currently leading the England Under-19s, there is understandable excitement about the sons of legends making their way in the game, though it is not just youngsters with famous surnames coming through. Keep an eye on James Minto, Harry Moore, Thomas Rew and Farhan Ahmed.", "url": "https://www.bbc.com/sport/cricket/articles/c23nm5jd8z5o"}