{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:50:38", "date_modify": "2025-05-21 03:50:38", "date_publish": "2025-04-07 11:08:08", "description": "Tottenham 3-1 Southampton: Fan views on Premier League game", "filename": "sport_football_articles_cn4wm8pnm7ro_1747799438.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cn4wm8pnm7ro_1747799438.html", "title": "Tottenham 3-1 Southampton: Fan views on Premier League game", "title_page": "Tottenham 3-1 Southampton: Fan views on Premier League game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your thoughts after Sunday's Premier League game between Tottenham and Southampton, which saw Ange Postecoglou's side claim their 11th league win of the season.\nHere are some of your comments:\nDoug: The first half is how we should be playing every week. We broke fast, closed down quickly and were aggressive going forward. We should have been 4-0 or 5-0 up at half-time. The second half was the opposite, the kind of performance us fans are sick of seeing. We had a great opportunity to show what we can do, but instead we sat back and had a lazy second half.\nWill: A good first half but, for some reason, there was no energy or intensity. Any team will see an opportunity to come back against us, after seeing that we have no urgency. It was like we were in the 120th minute of extra time, not the 60th minute of normal time. We always have to put pressure on ourselves as per. Many improvements needed for Thursday.\nChris: A result that \"papers over the cracks\" at Spurs, against probably the worst ever side in Premier League history. The second half was poor, we looked passive and more worried about conceding rather than finishing the game off. Don't be fooled Spurs fans, Wolves will be a much harder test.\nJamie: It was a limp and inept performance from a poor Spurs team. A better team would have dispensed Spurs with ease. Saying that, Southampton didn't have the quality or belief to get at Tottenham with any conviction. Ange is on borrowed time. They won't win the Europa League in this form.", "url": "https://www.bbc.com/sport/football/articles/cn4wm8pnm7ro"}