{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:50:42", "date_modify": "2025-05-21 03:50:42", "date_publish": "2025-04-07 11:07:16", "description": "West Ham 2-2 Bournemouth: Fan views on Premier League game", "filename": "sport_football_articles_clywn592ky2o_1747799442.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_clywn592ky2o_1747799442.html", "title": "West Ham 2-2 Bournemouth: Fan views on Premier League game", "title_page": "West Ham 2-2 Bournemouth: Fan views on Premier League game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your thoughts after Saturday's Premier League draw between West Ham and Bournemouth.\nHere are some of your comments:\nWest Ham fans\nRobert: There's progress under Potter but the style of play has been similar under three coaches which suggest perhaps we have the wrong mix of players. We certainly need more pace and creativity in the team. Niclas Fullkrug's run of games now should help us score more goals.\nStephen: Graham Potter got his starting XI wrong. In the second half with the introduction of Fullkrug, the game changed in our favour as it gave Lucas Paqueta and Jarrod Bowen more opportunities. Probably a fair result but still a frustrating team to watch.\nMik: It's disturbing that we need an entire half before we can get into a game. It's nothing new as it happened under David Moyes and Julen Lopetegui as well, but Graham Potter has to get his side on it from the start. Bournemouth were quicker and better from the start. This must change.\nBournemouth fans\nStu: Lacking the energy and drive we had at the start of the season. Too many misplaced passes and missing that sparkle. A draw away isn't all that bad but a month or so ago we'd be winning games like this. I think European football is a step too far this season but plenty to build on for 2025-26.\nAndrew: Fell asleep for a spell in the second half which gave West Ham the impetus. Fortunately we squared things, which set up a fun final 10 minutes where tactics and formula football went out the window for both sides.", "url": "https://www.bbc.com/sport/football/articles/clywn592ky2o"}