{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:37:19", "date_modify": "2025-05-21 07:37:19", "date_publish": "2025-05-20 15:01:59", "description": "West Bromwich Albion announce the release of Semi Ajayi, Grady Diangana and John Swift at the end of their contracts", "filename": "sport_football_articles_c7533719r2po_1747813039.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1de0/live/7591f810-357d-11f0-9f00-498a49351714.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c7533719r2po_1747813039.html", "title": "West Bromwch Albion release Semi Ajayi, Grady Diangana and John Swift", "title_page": "West Bromwch Albion release Semi Ajayi, Grady Diangana and John Swift - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "West Bromwich Albion have announced that Semi Ajayi, Grady Diangana and John Swift, who have over 500 club appearances between them, will all be leaving the club at the end of their contracts.\nThe departures mean the end of six-year stays for Nigeria defender Ajayi and DR Congo midfielder Diangana, who both played a part in promotion to the Premier League in 2019-20 as well as the campaign in the top flight that followed.\nAjayi made 177 appearances after signing from Rotherham United in 2019, while Diangana initially arrived on loan in the same summer and later signed permanently, going on to play 202 games and score 26 goals.\nSwift leaves three years after joining the club from Reading and making 126 appearances. He made an instant impact, scoring the equaliser at Middlesbrough in his first start for the club in 2022.\nAjayi made just 15 Championship appearances this season after two lengthy spells out with hamstring problems.\nDiangana has also been on the fringes this season, most of his appearances coming as a substitute, while Swift has started fewer than half of their league games in the campaign just ended.\nHeading the list of academy players given new deals is 21-year-old Reyes Cleary, who had loan spells at Walsall and Hartlepool United last season.", "url": "https://www.bbc.com/sport/football/articles/c7533719r2po"}