{"authors": ["Sam Drury", "www.facebook.com"], "date_download": "2025-05-21 05:19:55", "date_modify": "2025-05-21 05:19:55", "date_publish": "2025-04-03 21:01:20", "description": "Stephen Bunting claims his first Premier League victories of the season on the way to winning night nine in Berlin.", "filename": "sport_darts_articles_cd6jve6w3n2o_1747804795.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5563/live/890bbb80-10c3-11f0-8d69-dff4a207f5f1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_darts_articles_cd6jve6w3n2o_1747804795.html", "title": "Premier League Darts results: Stephen Bunting ends winless run to triumph in Berlin", "title_page": "Premier League Darts results: Stephen Bunting ends winless run to triumph in Berlin - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Stephen Bunting claimed his first Premier League victories of the season to win night nine in Berlin.\nHaving lost all eight of his previous matches in this year's competition, Bunting overcame Nathan Aspinall and Luke Humphries, before beating Gerwyn Price 6-5 in a topsy-turvy final at the Uber Arena.\nAfter six breaks of throw to start the final, Bunting took out 96 in two darts for the first hold to go 4-3 ahead.\nHowever, a pumped-up Price levelled, broke again and then missed two match darts as Bunting hit double eight to force a one-leg shootout.\nWith a tense final leg still in the balance, 'The Bullet' produced a brilliant 107 checkout to seal a memorable success.\n\"Don't get me wrong, there have been times through the Premier League where I've thought, 'Could I finish on zero points'?\" Bunting told Sky Sports.\n\"But to get off the mark tonight and to win a night is such a special feeling.\n\"This is going to give me huge confidence and I can't wait to finish the campaign. I've really enjoyed it, even though I've not won a game until tonight.\"\nWorld champion Luke Littler remains top of the table despite a rare off night that saw him hit just two of his 13 darts at double in a 6-2 loss to Chris Dobey in the quarter-finals.\nLittler's lead has been cut to six points after world number one Humphries claimed five legs on the spin from 3-1 down to beat Rob Cross 6-3.\nPrice is up to third after receiving a bye in the quarters following Michael van Gerwen's withdrawal with a shoulder injury.\nThe Welshman enjoyed a convincing 6-2 win over Dobey in the semi-finals after Bunting had beaten Humphries by the same score in the other last-four tie.\nBunting will also face Humphries in the last eight on Thursday, 10 April in Manchester, while Littler will take on Price on night 10.", "url": "https://www.bbc.com/sport/darts/articles/cd6jve6w3n2o"}