{"authors": ["Andrew Benson", "www.facebook.com"], "date_download": "2025-05-20 14:38:42", "date_modify": "2025-05-20 14:38:42", "date_publish": "2023-07-28 13:20:08", "description": "Alpine will part ways with team principal Otmar Szafnauer and sporting director Alan Permane after the Belgian Grand Prix.", "filename": "sport_formula1_66340347_1747751922.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/D969/production/_130575655_gettyimages-1406208051.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_formula1_66340347_1747751922.html", "title": "Formula 1: Alpine to part company with team boss Otmar Szafnauer and sporting director Alan Permane", "title_page": "Formula 1: Alpine to part company with team boss Otmar Szafnauer and sporting director Alan Permane - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Alpine will part ways with team principal Otmar Szafnauer and sporting director Alan Permane after this weekend's Belgian Grand Prix.\nThe latest in a series of management changes come after a disappointing performance by the Renault-owned team so far this season.\nAlpine are also losing chief technical officer Pat Fry, who will start the same role at Williams later this year.\nAlpine have failed to meet the targets they set for themselves this year.\nThey started the season aiming to finish fourth for a second consecutive year while also moving closer to the top three teams.\nInstead, they are sixth and have been leapfrogged by Aston Martin and McLaren.\nThe decision to split with Szafnauer and Permane comes just over a week after former Alpine chief executive officer Laurent Rossi was moved into a new role in special projects at Renault and replaced with a new CEO in Philippe Krief.\nAnd that happened two weeks after Bruno Famin was named vice-president of Alpine Motorsport.\nFamin said at the Belgian Grand Prix on Friday that the moves had been made with \"the aim of reaching faster the level of performance we are waiting for\".\nHe added that the team, Szafnauer and Permane \"were not on the same line on the timeline\" and that \"we have a different view of the way of doing it\".\nFamin will take on the role of interim team principal while Julian Rouse, head of the team's young driver academy, will be interim sporting director.\nSzafnauer joined Alpine from Aston Martin, where he was team principal since August 2018, when the team was known as Racing Point. It became Aston Martin in 2021.\nPrior to that, he was a senior executive of the team in its previous guise as Force India since 2009.\nPermane has been with Alpine in its various guises for 34 years. He started working for the Benetton team in 1989, and moved during its shifting to Renault, then Lotus, back to Renault again and then Alpine. He held many engineering roles before becoming sporting director in 2012.\nIn that position, he has been central to the way the team has been run for the past decade. A statement thanked him for his \"34 distinguished years at Enstone\", the team's base.\nAlpine said both Szafnauer and Permane would stay in position until the end of the Belgian Grand Prix weekend before departing.\nRed Bull team principal Christian Horner said Permane's three decades at the team was \"a truly remarkable achievement\".\nHe added: \"He has been one of the mainstays of that period and been there through the championship years with Michael Schumacher and Fernando Alonso.\n\"He is a hugely competent guy - I doubt he is going to be unemployed for too long.\"\nFry, an experienced design engineer who has previously held senior positions at McLaren and Ferrari, had been at Renault/Alpine since 2020. He will start his new role at Williams on 1 November.\nHis move is the first senior appointment made by new Williams team principal James Vowles since he joined the team from Mercedes in February.\nVowles has set himself the target of returning Williams to competitiveness and the team have already moved forward this season.\nVowles pointed to the success Fry had had turning around the fortunes of first McLaren when he joined them in 2018 and then Renault/Alpine from 2020 as to how he could be effective at Williams.\nVowles said Fry was effective at \"organisations where you need someone to come and roll their sleeves up and get stuck into the systems\".\nVowles has put great emphasis on changing Williams' culture and said the team were looking for \"empowerment and training up the next generation\".\n\"It's not about blame,\" he said. \"You allow failure as long as you talk about it afterwards. Pat is not political. McLaren and Alpine were in a difficult state and he's done a good job with that.\"\nHe said he still wanted to employ a technical director to lead the design department and report to Fry and had identified \"four or five names - but there is nothing to say on that yet\".\nHe said he believed his own decision to leave his role as Mercedes strategy director, followed by Fry's move, would persuade others they \"wanted to be on the same journey\".", "url": "https://www.bbc.com/sport/formula1/66340347"}