{"authors": ["Phil Cartwright", "www.facebook.com"], "date_download": "2025-05-21 07:46:28", "date_modify": "2025-05-21 07:46:28", "date_publish": "2025-05-18 22:48:46", "description": "World number one Scottie Scheffler holds off a rejuvenated Jon Rahm to convert his overnight lead into a maiden US PGA Championship title.", "filename": "sport_golf_articles_cy90vqdllq8o_1747813588.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2d56/live/fe488d70-3449-11f0-ad28-119e56f2fc91.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_golf_articles_cy90vqdllq8o_1747813588.html", "title": "US PGA Championship 2025: Scottie Scheffler wins by five strokes after holding off Jon Rahm challenge", "title_page": "US PGA Championship 2025: Scottie Scheffler wins by five strokes after holding off Jon Rahm challenge - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "An emotional Scottie Scheffler held off the rejuvenated Jon Rahm to convert his 54-hole lead into a maiden US PGA Championship title.\nWhile the winning margin of five strokes suggests his third major was a formality, a different story threatened to unfold at Quail Hollow.\nWorld number one Scheffler began three shots ahead and five clear of Rahm, but it became a two-way duel for the Wanamaker Trophy.\nA patchy front nine from Scheffler, along with Spaniard Rahm's flurry of birdies around the turn, meant they shared the lead midway through the final round.\nHowever, Rahm collapsed over his final three holes and Scheffler coasted to a major title that joins his Masters victories in 2022 and 2024.\nThe 28-year-old was in tears walking down the 18th and his animated celebrations after sinking the winning putt demonstrated how much this latest title means to him.\nBefore collecting the trophy, Scheffler said: \"I knew it was going to be a challenging day.\n\"Finishing off a major championship is always difficult and I did a good job of staying patient on the front nine.\n\"I didn't play my best stuff but I kept myself in it, stepped up on the back nine and had a good nine holes.\"\nAfter opening the door for Rahm by shooting two over par for his first nine, Scheffler posted birdies on the 10th, 14th and 15th to re-establish a buffer.\nAs Rahm tried to catch his American rival, his dreams of his own third major triumph were crushed on the tricky 'Green Mile' finale.\nHe made a bogey on 16 before sending his tee shot into the water on the par-three 17th on his way to a double-bogey five. Two more dropped shots on the last hole saw him topple to a tie of eighth.\nAbove him, Bryson DeChambeau continued his fine recent record in majors by finishing in a share of second alongside fellow Americans Davis Riley and Harris English, whose six-under round of 65 catapulted him up the leaderboard.\nRory McIlroy, playing his first major since completing a career Grand Slam at the Masters in April, finished with a 72 to end three over par in a tie for 47th.\nDefending champion Xander Schauffele fared marginally better, shooting 68 on Sunday to finish one under for the championship and sneak inside the top 30.\nAt last year's US PGA, Scheffler was arrested outside Valhalla Golf Club in Kentucky before his second round, as he tried to avoid heavy traffic caused by an earlier unrelated accident in which a male pedestrian died.\nAll of the subsequent charges he faced were dropped a couple of weeks later and, a year on, Scheffler stamped his authority on this tournament.\nHaving played his final five holes on Saturday in five under par, his was a commanding position heading into the final round.\nHis previous two major wins at Augusta National had been almost processions after holding the 54-hole lead. This, however, was anything but until the closing stretch.\nA clumsy bogey at the first gave Scheffler's rivals hope but, after getting his shot straight back at the second, he actually led by five standing on the fifth tee, with his chasers faltering.\nAround the turn, though, Rahm made his move and as the world number one stumbled to bogeys on the sixth and ninth, it was suddenly all square.\nBut Scheffler's composure and ability to shoot a good score when not playing at his best are among his countless strengths - and they were demonstrated to full effect on the back nine.\nWatched by his wife and infant son by the 18th green, his emotion became evident as he approached the final hole. A closing bogey was incidental with victory, his third in the past 14 majors, long since assured.\nThis win was Scheffler's 15th on the PGA Tour and comes just three years and 94 days since his first. That is the third fastest since 1950, behind only Tiger Woods (three years, 32 days) and Jack Nicklaus (three years, 45 days).\nRahm said afterwards that his late demise was a \"tough pill to swallow\" but the fact he got himself in the mix on the final day will do a lot to dispel the discussion about a drop-off in his results at majors since his switch to LIV at the end of 2023.\nHis best finish in 2024 was a tie for seventh at The Open but, until this week, he had not been a realistic contender in any of the five majors since leaving the PGA Tour.\nOn Saturday, he insisted there was no correlation between his major form and LIV move, and at Quail Hollow he demonstrated why he should never be discounted as a challenger for golf's biggest prizes.\nAiming to become the first Spaniard to win the US PGA Championship in its 107th edition, he started with seven solid pars, before exploding into life with birdies on the eighth, 10th and 11th to tie the lead.\nAfter Scheffler pulled clear again, he narrowly missed chances to re-ascend the top of the leaderboard down the back nine, before his title bid slipped away in dramatic fashion.\n\"There's been a lot of good happening this week and a lot of positive feelings to take for the rest of the year,\" the 2023 Masters and 2021 US Open winner Rahm added.\n\"I think it's the first time I've been in position to win a major that close and haven't done it. The only times I think I've been in the lead in a major on a Sunday, I've been able to close it out.\"\nAt the start of play, a host of players hoped to shoot low to pressurise the world number one, but their challenges never materialised.\nNowhere more so was that exemplified than on the par-four first. Of the final eight players to head out, Rahm made par but the other seven, including Scheffler, all carded a five.\nPerennial major contender DeChambeau played well once again but was unable to build sustained momentum during his one-under 70.\n\"It's another top five and I'm always proud to top five in a major,\" DeChambeau said.\n\"I feel like I'm playing good when I'm doing that but it's disappointing not to get the job done because that's what I came here to do.\"\nStarting almost four hours before the final group, English had almost finished his round by the time the leaders set off and his 65 - the lowest round on Sunday - secured his best finish at a major.", "url": "https://www.bbc.com/sport/golf/articles/cy90vqdllq8o"}