{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:25:03", "date_modify": "2025-05-21 07:25:03", "date_publish": "2025-01-22 11:19:20", "description": "Torquay United manager Paul Wotton slams his players after they concede a stoppage-time goal to draw 2-2 at mid-table Slough Town.", "filename": "sport_football_articles_cz7e00w2gd7o_1747812303.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/43e9/live/a0d35bd0-d8ae-11ef-b727-bdbf55ba60e2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cz7e00w2gd7o_1747812303.html", "title": "Torquay United: Paul Wotton slams 'suicidal' Gulls after Slough leveller", "title_page": "Torquay United: Paul Wotton slams 'suicidal' Gulls after Slough leveller - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Torquay United manager Paul Wotton has slammed his players after they conceded a stoppage-time goal to draw 2-2 at mid-table Slough Town.\nThe point, coupled with Boreham Wood's 3-1 win over Hampton and Richmond, sees the Gulls drop to second - on goal difference - in National League South.\n\"I can't believe what I've just seen in the last minute of that game,\" Wotton said after Dan Bayliss scored in the sixth minute of stoppage time.\n\"The game's over, we've got the ball in the corner, we decide to cross it.\n\"They break and then, as happened in the second half, we don't get anywhere near close enough to stop a cross.\n\"The game's done at 2-1. I can't believe what I've just seen that last minute.\"\nThe Gulls had been about to celebrate what was a late victory after Dean Moxey had scored in the 89th minute.\nThat goal put Torquay ahead again having been pegged back after John Goddard had cancelled out Oscar Threlkeld's early opener.\n\"The last 50 to 60 seconds is just suicidal. It's just insane game management, which is really poor on our part,\" Wotton told BBC Radio Devon.\n\"We've had two away games now - two points that should have been six, so we're under no illusions that the players have to learn from that.\n\"If that happens again next week, I would like to think we don't do that.\n\"So sometimes you have to learn lessons the hard way - it's a very, very, very disappointed, angry dressing room.\"", "url": "https://www.bbc.com/sport/football/articles/cz7e00w2gd7o"}