{"authors": ["Ben Ramsdale", "www.facebook.com"], "date_download": "2025-04-26 06:55:35", "date_modify": "2025-04-26 06:55:35", "date_publish": "2025-02-28 15:21:19", "description": "Fulham boss Marco Silva has been speaking to the media before Sunday's FA Cup game against Manchester United (kick-off 16:30 GMT).", "filename": "sport_football_articles_cn4884dzy47o_1745650535.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9b67/live/608060b0-6de1-11ef-b970-9f202720b57a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cn4884dzy47o_1745650535.html", "title": "Marco Silva press conference: Man Utd vs Fulham preview", "title_page": "Marco Silva press conference: Man Utd vs Fulham preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Silva confirmed Harry Wilson, Reiss Nelson and Kenny Tete all remain absent through injury for Sunday's game.\nBetter news on the injury front comes in the form of midfielder Emile Smith Rowe. The Fulham boss said the 24-year-old has returned to training and could come into contention for the match.\nHe claimed the FA Cup is a \"big ambition\" for the club and the passion to do well in the competition runs through the entire squad.\nIn response to Alex Iwobi admitting that he plays five-a-side with his friends during the season in a podcast this week, Silva said: \"I would prefer him to enjoy his friends in a different way\" and added that \"the most important thing for him is his job at Fulham Football Club\".\nHe said his side \"don't feel intimidation in any stadium in this country\" when asked if Manchester United don't hold the fear-factor they once did.\nSilva stated that \"it's too early\" to think about winning the FA Cup and wants his side to keep their focus on taking one game at a time. He did, however, add that the team are feeling \"really positive\" about Sunday's fixture.", "url": "https://www.bbc.co.uk/sport/football/articles/cn4884dzy47o"}