{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:52:55", "date_modify": "2025-05-21 03:52:55", "date_publish": "2025-04-07 09:36:36", "description": "Liverpool news: Fan views on defeat by Fulham", "filename": "sport_football_articles_c20x4r3rk41o_1747799575.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c20x4r3rk41o_1747799575.html", "title": "Liverpool news: Fan views on defeat by Fulham", "title_page": "Liverpool news: Fan views on defeat by Fulham - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Following Liverpool's first defeat away from home in the Premier League under boss Arne Slot, we asked you to have your say on the 3-1 loss to Fulham.\nHere are some of your comments:\nPhil: Liverpool looked like they didn't want to win the game until Luis Diaz and Conor Bradley came on. So many back passes. Need a bit of heavy metal football back in our game.\nSteve: No panic but what a lacklustre display. A masterclass in giving the ball away. We seem to excel in giving ourselves a second half challenge, which we failed at on this occasion although at least upped our game. Taking nothing away from Fulham who played really well, but I would expect to take something out of that game.\nRichard: It's clearly been a long season - the players look knackered! But Arne Slot has a lot of work to do during the summer. There are players that I think need to leave and players that need to be brought in. We lost that game today in the first half. You can't expect to win a game when you concede three goals in 15 minutes. The entire back four were at fault for goals today. I think most of those players will be glad when this season is over.\nJames: Two points here: One - Mohamed Salah has had a dip in form. The gaffer is taking too long to realise that. Two - regular defenders Ibrahima Konate and Virgil van Dijk are out of sorts. Reshuffling the team rather than relying on tired legs will help a great deal.\nSteve: It's becoming a little sloppy again. Whether it's attitude or a little arrogance, I don't know. But a truly good team would not let it happen. Liverpool were playing like a slick team but it seems to have dropped off. All the background transfer talk doesn't help. They need more urgency and to get a grip.", "url": "https://www.bbc.com/sport/football/articles/c20x4r3rk41o"}