{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:13:09", "date_modify": "2025-05-20 13:13:09", "date_publish": "2023-08-01 06:35:35", "description": "Spectators at the DC Open are warned that Ukraine's Elina Svitolina would not shake hands with Victoria Azarenka.", "filename": "sport_tennis_66369434_1747746789.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/14636/production/_130601538_gettyimages-1583982684.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_tennis_66369434_1747746789.html", "title": "Russia-Ukraine conflict: Fans warned Elina Svitolina and Victoria Azarenka would not shake hands at DC Open", "title_page": "Russia-Ukraine conflict: Fans warned Elina Svitolina and Victoria Azarenka would not shake hands at DC Open - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Spectators at the DC Open were warned that Ukraine's Elina Svitolina would not shake hands with Victoria Azarenka.\nDuring the Russia-Ukraine conflict, Svitolina has refused to shake hands with opponents from Russia or Belarus.\nBelarusian Azarenka was booed after Svitolina beat her at Wimbledon and to avoid a repeat, the scoreboard showed a message during Svitolina's 7-6 (7-2) 6-4 first-round win in Washington DC.\n\"It's the right thing,\" said world number 27 Svitolina.\n\"I asked for the WTA [Women's Tennis Association] to respect the decision of Ukrainians and they did.\"\nAt the end of the match, both players headed straight to the sidelines and the umpire.\nTwo-time Australian Open champion Azarenka, playing on her 34th birthday, said the warning to fans had arrived \"18 months too late\" and asked whether it was a big story.\n\"We just move on. We play a tennis match. As I said in Wimbledon, I accept, respect somebody's position. That's it,\" she added.\nBoth players had failed to clinch the first set on their own serve before Wimbledon semi-finalist Svitolina won it in a tie-break.\nThe message was shown after the first set, and there was just one hold of serve in the second as 28-year-old Svitolina sealed victory over the world number 19.", "url": "https://www.bbc.com/sport/tennis/66369434"}