{"authors": ["Emma Sanders", "www.facebook.com"], "date_download": "2025-05-20 13:02:56", "date_modify": "2025-05-20 13:02:56", "date_publish": "2023-08-01 09:34:51", "description": "Lauren James produces a sensational performance as England sweep aside China to book their place in the last 16 of the Women's World Cup.", "filename": "sport_football_66369572_1747746176.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6F5F/production/_130611582_gettyimages-1585012995.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66369572_1747746176.html", "title": "China 1-6 England: Lauren James' stunning display powers England into last 16", "title_page": "China 1-6 England: Lauren James' stunning display powers England into last 16 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Lauren James produced a sensational individual performance as England entertained to sweep aside China and book their place in the last 16 of the Women's World Cup as group winners.\nIt was a display worthy of their status as European champions and James once again lit the stage alight in Adelaide with two sensational goals and three assists.\nThe 13,497 in attendance were treated to a masterclass from Chelsea's James, who announced her arrival at the World Cup with the match-winner against Denmark on Friday.\nShe helped England get off to the perfect start when she teed up Alessia Russo for the opener, and later slipped the ball through to Lauren Hemp to coolly place it into the bottom corner.\nIt was largely one-way traffic as England dominated and overwhelmed, James striking it first time into the corner from the edge of the box to make it 3-0 before another stunning finish was ruled out by video assistant referee (VAR) for offside in the build-up.\nChina knew they were heading out of the tournament unless they responded, so they came out with more aggression in the second half, unnerving England slightly when Shuang Wang scored from the penalty spot after VAR picked up a handball by defender Lucy Bronze.\nBut James was not done yet - she volleyed Jess Carter's deep cross past helpless goalkeeper Yu Zhu for England's fourth before substitute Chloe Kelly and striker Rachel Daly joined the party.\nEngland, who had quietly gone about their business in the group stages, will have raised eyebrows with this performance before their last-16 match against Nigeria on Monday, which will be shown live on BBC One at 08:30 BST.\nChina are out of the competition after Denmark beat Haiti to finish in second place in Group D.\nManager Sarina Wiegman kept everyone guessing when she named her starting XI, with England fans anxiously waiting to see how they would set up without injured midfielder Keira Walsh.\nWiegman's response was to unleash England's attacking talent on a China side who struggled to match them in physicality, intensity and sharpness.\nJames oozed magic and unpredictability, Hemp used her pace to test China's defence and captain Millie Bright was ferocious in her tackling, winning the ball back on countless occasions.\nAfter nudging past Haiti and Denmark with fairly underwhelming 1-0 wins, England were keen to impose themselves from the start. Although China had chances in the second half, they were always second best.\nGoalkeeper Mary Earps will be disappointed not to keep a clean sheet, but she made two smart saves to deny Chen Qiaozhu.\nWhile England are yet to meet a side ranked inside the world's top 10 at the tournament, this will help quieten doubts that they might struggle without the instrumental Walsh.\n\"We're really growing into the tournament now,\" said captain Bright. \"We got a lot of criticism in the first two games but we were not concerned at all.\n\"It's unbelievable to be in the same team as [the youngsters]. It feels ridiculous and I'm quite proud. Players feeling like they can express themselves on the pitch is what we want.\"\nThe name on everyone's lips following England's win over Denmark was 'Lauren James', and those leaving Adelaide on Tuesday evening will struggle to forget her performance against China any time soon.\nShe punished China for the space they allowed her on the edge of the box in the first half and could have had a hat-trick were it not for the intervention of VAR.\nGreeted on the touchline by a grinning Wiegman, James was substituted with time to spare in the second half and went off to a standing ovation from large sections of the stadium.\n\"She's special - a very special player for us and for women's football in general,\" said Kelly. \"She's a special talent and the future is bright.\"\nShe became only the third player on record (since 2011) to be directly involved in five goals in a Women's World Cup game.\nWith competition for attacking places in England's starting XI extremely high, James has proven she is far too good to leave out of the side and is quickly becoming a star at this tournament at the age of 21.", "url": "https://www.bbc.com/sport/football/66369572"}