{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:43:14", "date_modify": "2025-05-20 11:43:14", "date_publish": "2023-08-06 14:46:41", "description": "Cornwall head coach Mike Abbott says he is proud of his injury-hit side despite their 56-4 loss at home to Oldham.", "filename": "sport_rugby-league_66422077_1747741394.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/179CD/production/_130671769_mediaitem130671768.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-league_66422077_1747741394.html", "title": "Cornwall boss Mike Abbott proud despite heavy Oldham defeat", "title_page": "Cornwall boss Mike Abbott proud despite heavy Oldham defeat - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Published\n6 August 2023\nCornwall head coach Mike Abbott says he is proud of his injury-hit side despite their 56-4 loss at home to Oldham.\nHaving conceded a Connor Carr try after four minutes, George Mitchell made it 4-4 two minutes later at Penryn.\nBut the Roughyeds took control as they scored 11 unanswered tries, four from Carr, as Cornwall dropped down to ninth place in League One.\n\"We were pretty banged up coming into this with players playing out of position,\" Abbott told BBC Cornwall.\n\"A lot of what we do is very creative in how we play and we're not afraid to attack, but that rhythm and system as split up today and it was a little bit clunky at times.\n\"But for effort and endeavour and just sticking in and having a go, I can't fault the boys.\"\nThe loss ended a decent run of form for the Choughs, who had won three of their previous four games going into the match.\nBut Midlands Hurricanes' earlier win over bottom side London Skolars lifted them above Cornwall.\nRelated topics\nAround the BBC\nThe Super League Show\nRelated internet links\nCornwall RLFC\nThe Super League Show Facebook\nSuper League\nRugby Football League\nThe BBC is not responsible for the content of external sites.", "url": "https://www.bbc.com/sport/rugby-league/66422077"}