{"authors": ["Nicola Pearson", "www.facebook.com"], "date_download": "2025-05-21 05:58:49", "date_modify": "2025-05-21 05:58:49", "date_publish": "2024-12-24 14:25:05", "description": "Enzo Maresca press conference: Chelsea vs Fulham preview", "filename": "sport_football_articles_ckgxn2r4gdko_1747807129.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8254/live/3cea8160-6de3-11ef-8c32-f3c2bc7494c6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ckgxn2r4gdko_1747807129.html", "title": "Enzo Maresca press conference: Chelsea vs Fulham preview", "title_page": "Enzo Maresca press conference: Chelsea vs Fulham preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Maresca confirmed that Romeo Lavia is \"still recovering\" but is \"much, much better\", however, the match on Thursday will be too soon for the midfielder.\nOn if he is trying to keep pressure off the players when he says they are not in the title race: \"It is not about the pressure for the players or for the club or for me, it is about the reality. Not about the pressure because we would like that kind of pressure and hopefully soon we can. The reason I said we are not there is because the reality is we are not there. We will see game by game.\"\nThe Chelsea boss said \"it is football\" when asked about Fulham's poor record at Stamford Bridge and added: \"Against Brentford it was the other side and we won that. I don't pay attention to the past, I just try to be focused on what they do, how we can beat them, how we can be good on the ball and off the ball. The results you can't control, but you can control how you play.\"\nOn the January transfer window: \"For us, the main focus is we have a clear idea about players. We could have players who aren't playing a lot who may leave, but in this moment it is not something we pay attention to. We have three games before that then we will see.\"\nOn if they have given Mykhailo Mudryk, who failed a drugs test, time away from Chelsea: \"In this moment, it is also good he can disconnect a bit from the situation.\"\nHe said Chelsea hitting the post and crossbar more than anyone in the league this season is a \"consequence\" of them creating chances and he hopes \"in future we can be a bit more lucky and take chances\".\nOn Cole Palmer struggling to find space against Everton: \"Next step for Cole is to manage that moment. Most teams mark man to man so it is difficult for him. One solution could be Joao [Pedro], another could be Joao and Cole together.\"", "url": "https://www.bbc.com/sport/football/articles/ckgxn2r4gdko"}