{"authors": ["Brent Pilnick", "www.facebook.com"], "date_download": "2025-05-20 12:04:40", "date_modify": "2025-05-20 12:04:40", "date_publish": "2023-08-05 11:49:39", "description": "Two goals in two minutes help Plymouth Argyle beat Huddersfield Town and win their first game in the Championship since 2010.", "filename": "sport_football_66345297_1747742680.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2824/production/_130667201_argyklehuddersfieldindexrex.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66345297_1747742680.html", "title": "Plymouth Argyle 3-1 Huddersfield Town: Pilgrims win on return to Championship", "title_page": "Plymouth Argyle 3-1 Huddersfield Town: Pilgrims win on return to Championship - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Two goals in two second-half minutes saw Plymouth Argyle beat Huddersfield Town in their first Championship game in more than 13 years.\nSummer signing Morgan Whittaker gave the Pilgrims a dream start as he scored from close range, but Huddersfield got a deserved equaliser in first-half stoppage time through Michal Helik.\nHaving seen the Terriers go close, Argyle weathered the storm as Bali Mumba's superb individual goal gave Argyle the lead with 17 minutes left.\nAnd soon after the result was put beyond doubt as Whittaker put Ryan Hardie through on goal and the Scot coolly finished.\nHaving helped Huddersfield perform miracles to stay up against the odds last season Neil Warnock saw his side concede a sloppy opener as Argyle impressed early on.\nA sixth-minute cross into the area was not dealt with and Whittaker, a £1m summer signing from Swansea City after being on loan last season, capped his return to Home Park by forcing the ball home.\nBut as the half continued Huddersfield grew into the game and should have drawn level when Josh Koroma smashed a low effort into the side netting after 23 minutes - the forward was left unmarked at the back post after Sorba Thomas' cross from the right.\nThe Pilgrims began to look nervous as the half wore on as they cheaply gave away possession too often - and they were eventually made to play as Helik levelled from close range after Koroma's left-footed shot from the edge of the box came back off the post and fell to the feet of the defender.\nHuddersfield twice almost went ahead early in the second half as Brahima Diarra's curling left-footed cross from the right got caught in the strong Home Park wind and was clawed out of the top left corner by Conor Hazard.\nFive minutes later Diarra robbed the Pilgrims keeper eight yards out but Hazard was able to get a hand to the Malian's effort which he should have converted.\nBut Argyle began to improve as Mumba, like Whittaker a former loanee returning to Plymouth on a £1m deal, scored what must be the finest goal of his young career.\nThe former Norwich City player cut in from the left 50 yards out from goal and beat a number of players as he skipped into the penalty area before producing a superbly delicate finish.\nHardie raced through to slot home the third left-footed soon after thanks to Whittaker's pass as Argyle's two big-money summer signings proved their worth.\nTown could have pulled a goal back soon after, but Hazard made an excellent point-blank save from Danny Ward after Jack Rudoni's cutback.\nBut despite some late pressure in nine minutes of second-half stoppage time they could not create a clear-cut chance to pull a goal back.\nPlymouth Argyle manager Steven Schumacher told BBC Sport:\n\"I really enjoyed the game. I thought it was two teams that went right at it from the very start.\n\"It was hard fought, intense and I think that's what we're going to have to expect from all of these games.\n\"It didn't feel like there was any time in the middle of the pitch, there was always someone right up against our players and I'm just really pleased to come out of it with the three points.\n\"I thought we played well, we competed and we showed bits of quality when we needed to and we did enough to win the game.\"\nHuddersfield Town manager Neil Warnock told BBC Sport:\n\"We had to work really hard to lose that game.\n\"I didn't feel in any threat if I'm honest, even in the second half, we made elementary mistakes really.\n\"You've got to take your chances, you're not going to get better chances than Jack's free header and Josh's, how much time did he have at the back post?\n\"If you take some of them it puts more pressure on the home side and the fans and things go different.\n\"It's fine margins really, and whilst I'm disappointed with the result it didn't surprise me that the two wide lads ended up winning it for them really as we made mistakes defending against them, and if we do that you're going to get punished.\"", "url": "https://www.bbc.com/sport/football/66345297"}