{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:38:19", "date_modify": "2025-05-21 07:38:19", "date_publish": "2025-03-28 12:29:09", "description": "Docherty 'absolutely' expects to face a different Rangers side under Ferguson", "filename": "sport_articles_cgm13rvkkjxo_1747813099.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1ca3/live/9ac70fe0-0b33-11f0-b1de-e342f84c59e9.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cgm13rvkkjxo_1747813099.html", "title": "Docherty 'absolutely' expects to face a different Rangers side under Ferguson", "title_page": "Docherty 'absolutely' expects to face a different Rangers side under Ferguson  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tony Docherty \"absolutely\" expects a different Rangers side this weekend from the one Dundee have faced three times already this season.\nRangers knocked Dundee out of the League Cup in early December, followed by a home win at Ibrox and a draw at Dens Park - all under Philippe Clement - but Docherty says the Ibrox club's style is now much changed since Barry Ferguson took interim charge.\n\"Yeah, I do, absolutely [expect a different challenge from Rangers],\" said the Dark Blues manager.\n\"I think they've done really well since Barry's been in. As every interim manager would do, they change things.\n\"They do the opposite of what the previous regime was and they've changed the shape of the team, they've changed the formation of the team, they've changed a wee bit of their training regime.\n\"They've got a reaction from the players, which is down to Barry getting in there. He's got good experience there as well with [Billy] Dodds and Neil [McCann]. They've gone in and changed things and, yes, there has been a reaction.\"\nMidfielder Josh Mulligan has called for Dundee to replicate the performance they delivered in the derby win over Dundee United as they attempt to rise out of the relegation play-off spot.\n\"It's obviously more difficult [playing against Rangers and Celtic], there a lot more good players but it's the same mentality going into the game, similar to the last performance, just on the front foot,\" said Mulligan.\n\"If we can put it in that similar level then I think we'll get a result.\"", "url": "https://www.bbc.com/sport/articles/cgm13rvkkjxo"}