{"authors": ["Jonty Colman", "www.facebook.com"], "date_download": "2025-05-21 04:55:18", "date_modify": "2025-05-21 04:55:18", "date_publish": "2025-01-05 16:19:24", "description": "Pakistan fight back on day three of the second Test in Cape Town after being forced to follow on by South Africa", "filename": "sport_cricket_articles_cj90kwk2mrdo_1747803318.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0f7e/live/e4f21980-cb6d-11ef-a23c-4f9d386d7c26.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cj90kwk2mrdo_1747803318.html", "title": "South Africa vs Pakistan: Tourists fight back after Shan Masood century", "title_page": "South Africa vs Pakistan: Tourists fight back after Shan Masood century - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Pakistan openers Babar Azam and Shan Masood put on a 205-run partnership to keep the second Test against South Africa alive.\nThe visitors had been forced to follow on at Newlands after they were bowled out for 194 on day three.\nResponding to South Africa's first innings total of 615, Masood (102 not out) passed three figures late in the day, while Azam was dismissed on 81 before close by Marco Jansen.\nPakistan began the day on 64-3, trailing South Africa by 314 runs, with the hosts still to bat for a second time.\nFormer Test captain Azam made 58 before being dismissed by Kwena Maphaka to end his 98-run partnership with wicketkeeper Mohammad Rizwan (46).\nAzam's departure started a flurry of Pakistan wickets, with the visitors losing their final seven for 76 runs.\nKagiso Rabada took three wickets, with spinners Keshav Maharaj and Maphaka claiming two each.\nWith Pakistan trailing by a massive 421 runs, South Africa enforced the follow on only to see Masood and Azam record Pakistan's highest opening-wicket partnership since December 2022.\nThe tourists still face a daunting task, needing another 208 runs simply to draw level with South Africa, with two days of play remaining.\nThe Proteas are playing in their final Test match before facing Australia in the final of the World Test Championship at Lord's in June.", "url": "https://www.bbc.com/sport/cricket/articles/cj90kwk2mrdo"}