{"authors": ["Ninad Barbadikar", "www.facebook.com"], "date_download": "2025-05-21 07:44:42", "date_modify": "2025-05-21 07:44:42", "date_publish": "2025-03-28 09:30:02", "description": "Before their FA Cup quarter-final, BBC Sport explains why Fabian Hurzeler is proving to be another managerial success story for Brighton.", "filename": "sport_football_articles_cj3nkml32mvo_1747813482.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d295/live/2fd7c460-0a4b-11f0-94d4-6f954f5dcfa3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cj3nkml32mvo_1747813482.html", "title": "Fabian Hurzeler: How Brighton boss has managed transition from Roberto de Zerbi", "title_page": "Fabian Hurzeler: How Brighton boss has managed transition from Roberto de Zerbi - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Fabian Hurzeler had big shoes to fill at Amex Stadium following Roberto de Zerbi's exit, but the Seagulls are continuing to soar in the Premier League.\nThe 32-year-old has Brighton seventh in the table before they face Aston Villa next week, another team battling for a Champions League place.\nFirst, however, Albion face Nottingham Forest in the FA Cup quarter-finals - with a spot in the last four at Wembley at stake.\nBBC Sport analyses Hurzeler's impact and how he has tweaked De Zerbi's ways to extract even more out of Brighton's talented squad.\nContinuity has been key to Brighton's successful transition to Hurzeler's methods, whose own ideas of football aren't that different from his predecessor, as he revealed earlier in the season.\n\"He brought this current energy to the players,\" said Hurzeler, when talking about De Zerbi.\n\"So I don't have to make a complete turnaround of the players because they were familiar with this.\"\nThe young German's arrival has seen him implement some key principles, one being overloading the opposition's last line of defence with attackers and midfielders.\n\"You occupy opponents more if you have more players in the last line,\" he added.\n\"Then you create more dynamism with deep runs and how many players can create deep runs.\"\nThis bold approach to occupying defenders helps Brighton push defensive lines deeper and keep their opposition pinned as well. Increasing their numbers inside the penalty area means that the crosser has a number of options and contact is bound to be made by one of the players attacking.\nOne of the wingers will move inward and join the attacking line, and one of the two midfielders in Brighton's 4-2-3-1 formation will also push up to provide support in the box. Their match-winner against Manchester City earlier this season was one such example, where Matt O'Riley burst past Rico Lewis into the City box to score.\nBrighton's underlying data from last campaign under De Zerbi suggested their style of play was most similar to Pep Guardiola's City - but Hurzeler's approach has taken them away from that, with more directness introduced in possession.\nThe average Brighton possession sequence is about 3.5 passes, making them one of the more dynamic sides in the Premier League.\nBrighton's time spent during possession sequences has reduced, from being as high as 13.44 seconds last season (2nd highest during 2023-24) to now being 10.47 seconds. Hurzeler wants them to move the ball quicker and attack with intensity.\nWhereas under De Zerbi they possessed the ball a lot more in their own third to bait the opposition press, Brighton are now happy to play long balls when necessary to reach the final third, win second balls and then move the ball centrally or funnel it wide for cutback opportunities or crosses.\nMeasuring the speed of their attacks by looking at direct speed, Brighton have clocked an average of 1.79 m/s, a significant increase on their speed of 1.56 m/s under De Zerbi, which made them the second slowest in the division last season.\nOne noteworthy development out of possession has been Hurzeler's use of a 5-4-1 mid-block against the ball, often using Yankuba Minteh as a makeshift wing-back to form a five-man chain. This has helped improve their defensive coverage and also provided Joel Veltman with some support against direct wingers.\nTheir compactness against the ball has seen Brighton rank high up in the league for multiple pressing metrics per match:\nPressures in final third - 61.3 (2nd)\nPressed Sequences - 12.8 (2nd)\nCounter pressures - 56.2 (4th)\nHurzeler's tactics have proven his flexibility in and out of possession and, although they have been found out by teams a couple of times, Brighton are now on an unbeaten run of seven matches in all competitions.\nHurzeler has spoken of the importance of courage from players executing his football and, in Jan Paul van Hecke, he has one of the finest ball-playing centre-backs in the Premier League.\nThe Dutchman is the key at the back for Brighton to break through opposition lines and then find his team-mates in space, who will progress the attack further.", "url": "https://www.bbc.com/sport/football/articles/cj3nkml32mvo"}