{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:59:40", "date_modify": "2025-05-20 14:59:40", "date_publish": "2023-07-26 11:44:00", "description": "Commonwealth champion Brodie Williams says he will be aiming for a debut medal when he takes to the pool at the World Championships on Friday.", "filename": "sport_swimming_66299669_1747753180.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/44C1/production/_130510671_gettyimages-1412520959.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_swimming_66299669_1747753180.html", "title": "Brodie Williams aims for World Championship medal after Commonwealth success", "title_page": "Brodie Williams aims for World Championship medal after Commonwealth success - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Commonwealth champion Brodie Williams said he will be aiming for a debut medal when he takes to the pool at the World Championships on Friday.\nWilliams won gold in the 200m backstroke at the 2022 Games in Birmingham, his first major individual international medal.\nThe 24-year-old is ramping up his preparations one year from the Paris Olympics as he seeks selection.\nHe finished fourth at the Worlds last year, his best result at the event.\n\"I think it's only right to aim for a medal,\" Williams told BBC Points West.\n\"If I go out there and get a personal best I'll be happy with that as well but I want to be on the podiums hopefully, that's what I want to do. I just [have to] try my best I guess.\"\nSomerset-born Williams came away from the Commonwealth Games two years ago with three medals, including another gold in the 4x100m medley relay and a silver in the 100m backstroke.\nHe says he watches the races back almost every month as were so integral to his career, for both him and his family.\n\"It's built a lot of confidence for me, especially on the international stage. I know that I can get amongst the medals now, it's just doing it with the Commonwealths and adding a few more countries in there,\" Williams said.\n\"It's done me a lot of good and I'm just looking forward to moving it on.\"", "url": "https://www.bbc.com/sport/swimming/66299669"}