{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:16:45", "date_modify": "2025-05-21 07:16:45", "date_publish": "2025-05-20 00:00:00", "description": "Follow reaction as Man City beat Bournemouth to boost their push for Europe and FA Cup winners Crystal Palace beat Wolves.", "filename": "sport_football_live_c3wddejnl9pt_1747811805.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6022/live/c6cae320-35c5-11f0-96c3-cf669419a2b0.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c3wddejnl9pt_1747811805.html", "title": "Man City 3-1 Bournemouth & Crystal Palace 4-2 Wolves LIVE: Reaction as Kevin de Bruyne says farewell to Etihad", "title_page": "Man City 3-1 Bournemouth & Crystal Palace 4-2 Wolves LIVE: Reaction as Kevin de Bruyne says farewell to Etihad - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Goodbye!\nWell that's all from us!\nAn emotional night at both the Etihad and Selhurst Park as Kevin de Bruyne says goodbye to the fans on his final home appearance for the club and Crystal Palace parade the FA Cup they won at the weekend.\nThe race for Europe goes down to the final day of the season but City have made sure it's in their hands.\nWe'll see you on Sunday for the big one. One last rodeo.\n'De Bruyne is someone you cannot buy'\nFT: Man City 3-1 Bournemouth\nManchester City\nManchester City boss Pep Guardiola speaking to Sky Sports on Kevin De Bruyne: \"There's something that you cannot buy, if you're honest. He got all the love especially the gratitude for the player year after year what he's done.\n\"The most important thing was to win the game and we did it against an incredible opponent. They destroyed us in the Premier League in the first leg. The games are always good, we had chances, they had chances, it was open and the people enjoy.\"\nOn how emotions they felt as it was De Bruyne's last game: \"It was true we felt something, it was his day we wanted to win for him. The vibes we had since we arrived were there.\"\nOn taking De Bruyne off: \"Again, I remember at the start of the season we conceded a lot of goals and I cannot forget he played 100 minutes a few days ago it was so demanding. The incredible chance he had to score a goal would've been the cherry on the cake.\n\"I remembered immediately when it happened, maybe the second season of him when we were together and this was quite similar [to the miss against Chelsea].\"\nOn Nico Gonzalez scoring and Rodri returning: \"It's good news, Nico is a fantastic guy. I think he made a fantastic goal and it's fantastic news Rodri is back.\"\nOn needing a point for Champions League: \"It's a pity that against Southampton we couldn't collect the points. Now it would be already done . On Sunday we have a tough opponent. We go there to win to take the point we need to be next season in the Champions League.\"\n'Too many mistakes for one game'\nFT: Crystal Palace 4-2 Wolves\nWolves\nWolves boss Vítor Pereira, speaking to Sky Sports: \"We made a lot of mistakes. This team is very dangerous in the counter attack. If we go inside or the middle we know if they get the ball they will create a fast transition.\n\"When we were in the best moment of the game to score 3-2, we had chance to make it 3-3 two times but another mistake finished the game. I cannot accept that.\n\"We must keep our feet on the ground, calm down again and be humble - running and fighting and doing the tactical things.\n\"My team is one with organisation and tactical maturity. Today there were too many mistakes for one game.\"\n'The goals were four gifts'\nFT: Crystal Palace 4-2 Wolves\nWolves\nWolves boss Vítor Pereira, speaking to BBC MOTD: \"We cannot compete at this level if we offer gifts to them and in my opinion they were four gifts.\n\"In the moment we had chance to score 3-3 another mistake and this is not possible, we must be focused until the last minute. We must be our best level every time.\n\"I must speak about the team - as a team we committed mistakes that we cannot commit. In this league if you commit a mistake they punish you.\n\"The Premier League is no a league we can come here to be a part of the party for them. We come here to compete for three points.\"\n'I couldn't have written a better story and a better ending'\nFT: Crystal Palace 4-2 Wolves\nCrystal Palace\nCrystal Palace defender Joel Ward, who is 35 years old and leaving the club after 13 years, told Sky Sports: \"What a way to sign off. I couldn't have written a better story and a better ending. I feel honoured and incredibly blessed to have had this time at Palace and I look forward to the next challenge in front of me.\n\"There's a belief in that changing room and I'm sure these lads will take this club forwards. What an exciting period of time, I've been part of this club for so long. I will be following these guys next season, this is a fairy-tale ending for me.\n\"It means the world. I wouldn't be here if it was not for the family and they supported me and the sacrifices they made in the early years. All the players and managers over the years helped me continue the journey.\n\"The manager demands a lot from us and then it's up to us to fill our potential. He knows us inside and out. To bring home a major trophy and take this club into Europe, he deserves all the plaudits he gets.\n\"I still have the desire to play. Going across the line tonight made me realise how much I love this game so there's no chance I will be hanging them up.\"\n'Together we've built a big future for you guys'\nFT: Man City 3-1 Bournemouth\nManchester City\nMore from Manchester City midfielder Kevin De Bruyne speaking on the pitch about the fans: \"They've been so welcoming from the beginning. To have almost a full stadium supporting my family and me says everything. Who can have 50,00 people waiting for you to say goodbye? It's indescribable and thank you very much.\"\nOn there being a statue of him: \"It means I will always be part of this club. I always represent a small piece of that and whenever I come back with these guys and with family and friends I will be able to see myself standing around the stadium. I will always be here.\n\"I think the best way to describe my life with my wife and my three kids is we've fit in perfectly. We understand where the club has come to and why the club means a lot to a lot of people. Together we've built a big future for you guys, for the club to perform the way this club will perform. I know there's been a bit of a tough year for us but I think the team deserves all the support from you guys. I know they're pushing really hard and this team will be back next year pushing for all the titles, so they deserve this.\n\"I think after 10 years it was about time somebody let me talk a bit and it's time to say goodbye. I will be back but we love you and see you soon.\n'It's been a pleasure'\nFT: Man City 3-1 Bournemouth\nManchester City\nManchester City midfielder Kevin De Bruyne speaking on the pitch on how he feels leaving the club: \"Manchester is home, Manchester is where these little kids were born. I came here with my wife, Michelle, to stay for a long time, didn't expect to be here 10 years. To do what we've done as a club, supporters, teammates we've won everything. We made the city, the club bigger and now they're going to take over.\n\"I wanted to play with creativity, I wanted to play with passion. I wanted to enjoy football and I hope everyone enjoyed it. Everybody has pushed me so hard inside and outside the club to be the best version of myself and these guys, everybody we see on the screen and these guys in front of me have made me better than I was before. It's an honour to play with these guys. I've made so many friends for life. We'll be back for sure soon.\n\"This team tries to entertain people and win. This team works incredibly hard everybody behind the scenes and on the pitch. This team will win in the future, with or without me, and everybody in the city, the supporters, will be behind the team like they've done with me for the last 10 years. This team will have success that's for sure.\n\"You just want to do well and win and then when you win you want to win more. You want to push the city and we've had five/six parades and that's been incredible to witness everything that goes around in the city. All the moments with these teammates there's been too many to count. It's been a pleasure.\"\n'An outstanding and incredible group'\nFT: Crystal Palace 4-2 Wolves\nCrystal Palace\nCrystal Palace manager Oliver Glasner, speaking to Match of the Day, said: \"We spoke about it before and we didn't know what we would see and what we would get so credit to the players. We had a great energy on the pitch and that's not easy after such a huge achievement. It's an outstanding and incredible group and they showed it again. We trust every single one of the players and everyone has contributed to the success.\n\"It was a fantastic atmosphere. Everybody shouted my name and I didn't know what they wanted and someone said I should wave with my hands. It was an amazing experience and a great game. We always want everyone to have a great time at Selhurst Park and that they are happy.\"\nOn getting the highest Premier League points total for the club: \"This is the consequence of what we're talking about and to always keep our standards high and not be satisfied and take the next step. That's what this group is trying.\n\"There were many things that were not perfect but what we demand, the effort and that everyone does his job. It's great that we could raise our personal standards and that's what makes me proud.\"", "url": "https://www.bbc.com/sport/football/live/c3wddejnl9pt"}