{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:50:34", "date_modify": "2025-05-21 05:50:34", "date_publish": "2025-01-31 16:02:34", "description": "Aston Villa boss Natalia Arroyo is ready to prove she is the right woman for the job after landing a \"dream\" role in the Women's Super League.", "filename": "sport_football_articles_cly5d24m7mpo_1747806634.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/55f0/live/fb428770-dfe9-11ef-a319-fb4e7360c4ec.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cly5d24m7mpo_1747806634.html", "title": "Natalia Arroyo: Aston Villa boss on her 'dream' job in WSL", "title_page": "Natalia Arroyo: Aston Villa boss on her 'dream' job in WSL - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "New Aston Villa boss Natalia Arroyo is ready to prove she is the right woman for the job after landing a \"dream\" role in the Women's Super League.\nThe 38-year-old Spaniard, who left Real Sociedad at the end of the 2023-24 season, has signed a three-and-a-half-year deal and is the permanent replacement for Robert de Pauw, who was sacked in December.\nHer first game in charge is against Women's Super League leaders Chelsea on Sunday, a match you can watch live on BBC Two and iPlayer.\n\"I am excited to be here and to have the opportunity to coach and be a manager in the best league in Europe,\" Arroyo said.\n\"The club has a big history, it is a great project and they are really trying to make the women's team bigger here year after year and that is something that motivates me.\n\"I crossed my fingers it would happen and it finally happened and it's like a dream come true, but I haven't had time to dream.\n\"I am excited and I feel prepared but I respect I need to prove that I am prepared. The team is in a good position to be better and I think I can help them.\"\nInterim boss Shaun Goater steadied the ship after De Pauw's departure, going unbeaten in his first four games before last Sunday's 4-2 defeat by Manchester City.\nVilla sit eighth in the WSL with just three wins from their opening 12 games, but Arroyo is not focusing on her side's league position.\n\"We have this challenge to understand our position in the table is not where we want to be,\" Arroyo said.\n\"Our mission and our goal in these months is to make this gap [with the top teams] shorter. Not in terms of points, but feeling we can really compete with them in every game.\n\"We won't win the league, we need to accept that. We are too far away, but to really believe whatever we start building today will help us be strong tomorrow and in the future.\"", "url": "https://www.bbc.com/sport/football/articles/cly5d24m7mpo"}