{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:40:11", "date_modify": "2025-05-21 07:40:11", "date_publish": "2025-02-11 00:00:00", "description": "Milutin Osmajic scores the only goal as a rare Preston away win denies Norwich City a place in the Championship top six.", "filename": "sport_football_live_cdxep009ed0t_1747813211.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cdxep009ed0t_1747813211.html", "title": "Norwich City 0-1 Preston North End: Milutin Osmajic early goal secures win for Preston", "title_page": "Norwich City 0-1 Preston North End: Milutin Osmajic early goal secures win for Preston - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Milutin Osmajic's goal earned Preston only their third away win of the season and denied Norwich the chance to claim a place in the top six.\nThe Montenegro striker capped a fine performance by the Lilywhites by netting his 12th goal of the season in all competitions.\nWith Mads Frokjaer-Jensen supreme in midfield, Paul Heckingbottom's side were well worth their victory, but it came at a price with Duane Holmes stretchered off in the first half.\nThe Canaries had Championship top scorer Borja Sainz back in their side after a six-match ban, but they were hit by the loss of captain Kenny McLean to illness shortly before kick-off.\nAfter picking up seven points from their previous three games, and with Middlesbrough and Blackburn playing tomorrow night, the Canaries knew a win would see them claim a play-off position for the first time this season.\nThat reckoned without Preston's recent improvement, with the Lancashire club having now lost just one of their past eight in league and FA Cup.\nWith Ryan Porteous having an excellent debut as part of a resolute defence, Kaine Kesler-Hayden playing the wing-back role to perfection and Frokjaer-Jensen the best player on the park, the away side were well worth their win.\nThey were ahead in the fifth minute as they pressed Norwich high. Watford loanee Porteous won the ball and fed Frokjaer-Jensen, who skipped out of a strong challenge and slipped a pass for Osmajic to force the ball home.\nThe loss of Holmes following a heavy challenge by Shane Duffy was a blow but Preston could have added more goals as Ryan Ledson skewed one great chance wide and Osmajic blazed another over the bar following more superb work by Frokjaer-Jensen and Kesler-Hayden.\nNorwich were treading water, and a side that has only lost two league games at home since November 2023 rarely looked like making a contest of it.\nKesler-Hayden fired a shot narrowly side after he had been freed by a terrific Frokjaer-Jensen lofted pass, and Liam Lindsay somehow headed over from close range when Stefan Thordarson's corner found him in space.\nThose misses encouraged a late Norwich rally, but a Sainz shot which deflected wide was the only time they troubled goalkeeper Freddie Woodman.\nNorwich City head coach Johannes Hoff Thorup told BBC Radio Norfolk:\n\"My most important role is to make sure that they (the players) still know there is big belief in them because they are doing well. There will be ups and downs.\n\"We didn't really find the rhythm and flow. We know they are a physical team, and their game plan is so much about duels and tackles, and a hard fight to kill the flow in the game and we prepared for that, but it's hard.\n\"With some new faces in there they have to catch up with the rhythm and flow, and with Borja [Sainz] back after six game he also has to catch up.\n\"Then 20 minutes before kick-off Kenny [McLean] had to go out which is never ideal for us because he is so important, for the way we play and the group's experience. He has been ill bit was OK yesterday, but felt in the warm-up he couldn't really breathe.\"", "url": "https://www.bbc.com/sport/football/live/cdxep009ed0t"}