{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:08:02", "date_modify": "2025-05-21 04:08:02", "date_publish": "2025-04-06 14:15:44", "description": "Dundee fan views: 'Brilliant Murray deserves all the plaudits'", "filename": "sport_articles_cnv5qe19ge6o_1747800482.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f2c3/live/ff158d40-12d2-11f0-ba12-8d27eb561761.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cnv5qe19ge6o_1747800482.html", "title": "'Brilliant Murray deserves all the plaudits'", "title_page": "Dundee fan views: 'Brilliant Murray deserves all the plaudits' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your views on Dundee's 2-0 win against St Mirren.\nHere's what some of you said:\nBoab: Certainly not our best performance but a massive three points. We're far too open in midfield and seem to give up possession too easily, however, in saying that we are certainly good up front. Delighted with the victory.\nMark S: Excellent result. Dundee showed their fighting qualities. The win brings them back to Kilmarnock and Ross County. The home/away games post-split will be so important now.\nIain: Great result! It's a sad fact that this was our first home clean sheet in the league this season - 67 goals conceded and 23 points dropped from a winning position. We can do a whole lot better. Well done to Simon Murray, 21 goals, we'd be relegated already without him.\nMark D: Huge result. Not the prettiest but points are all that matter at this stage of the season. Money well spent to get Murray in. Who knows where we would be without him. Hopefully can get another three wins from the remaining games and should avoid the play-off.\nJefcal: We keep hearing about leaky defence but we have no midfield balance. Mo Sylla wins lots but does not create or score. No midfielder can slow things down and make a pass to our strong front players. Hence defence put under pressure. Well done but St Mirren deserved a point, 4-4-2 may be way to go.", "url": "https://www.bbc.com/sport/articles/cnv5qe19ge6o"}