{"authors": ["Laura Kirk-Francis", "www.facebook.com"], "date_download": "2025-05-21 05:45:59", "date_modify": "2025-05-21 05:45:59", "date_publish": "2025-01-14 14:22:35", "description": "Arsenal news: Opinion - 'Arteta isn't the one fluffing chances'", "filename": "sport_football_articles_c74m89r7yreo_1747806359.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/fbf6/live/712e8270-b626-11ee-beb5-e1400df560f2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c74m89r7yreo_1747806359.html", "title": "Opinion - 'Arteta isn't the one fluffing chances' - BBC Sport", "title_page": "Arsenal news: Opinion - 'Arteta isn't the one fluffing chances' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Last week, I said that January could make or break Arsenal's season. Off the back of two consecutive home losses, it looks depressingly like the latter.\nThese results have underlined a frustrating trend of underwhelming cup performances under Mikel Arteta, and have significantly added to the growing unease among fans.\nThe fanbase is now at odds over where to lay the blame. This team does not look markedly different from last season, where the same personnel produced a record-breaking campaign.\nFundamentally, Arteta isn't the one fluffing chances and missing penalties - it is more a story of individuals underdelivering compared with what we know they are capable of.\nThe players are the same, the performances are not.\nCritics of Arteta, though, will point to his failure to strengthen Arsenal's attacking line in recent transfer windows. The vocal 'Arteta out' brigade are revising the previous seasons' successes as either luck, or a dramatic overachievement that actually just masked fundamental issues with Arsenal's squad.\nI have a different view. I would argue that Arteta's decision-making has been clouded by the hot-hand fallacy - the belief that being successful previously is a predictor of future success.\nFor example, believing that Kai Havertz's turnaround last season could and would occur again this season.\nThat misplaced faith, which I think is a symptom of inexperience, rather than arrogance or stubbornness, has left the team ill-equipped to handle fluctuations in form.\nBasically, the hot-hand fallacy leads to the repetition of things that have worked in the past but may no longer be right for the present - and this could not be more true of Arsenal in January. We didn't need a plan B last year, which is why we don't have one this year.\nNow, our attention turns to Wednesday's north London derby - with a significant level of dread.\nWin, and Arsenal will at least stop the rot. But if Tottenham leave the Emirates with three points, there will be absolutely no hiding place for Arteta.", "url": "https://www.bbc.com/sport/football/articles/c74m89r7yreo"}