{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:35:40", "date_modify": "2025-05-20 13:35:40", "date_publish": "2023-08-01 17:25:04", "description": "Crystal Palace: Your views on a season under Roy Hodgson", "filename": "sport_articles_cy6ylqz3d7vo_1747748140.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2d9c/live/8cc93570-308e-11ee-8f52-fbf70e4bf742.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cy6ylqz3d7vo_1747748140.html", "title": "Crystal Palace: Your views on a season under Roy Hodgson", "title_page": "Crystal Palace: Your views on a season under Roy Hodgson - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "As Crystal Palace head into the new season with the experience of Roy Hodgson at the helm and youth in the side, we asked you for your views on how far that can take the Eagles this season.\nHere are a selection of your comments:\nJohn: Icon Zaha is now gone. The big question is, can the club keep hold of young stars like Guehi, Olise and Eze? If that can be done, plus hopefully two further attacking additions on top of that (Flamengo's Franca) - then it looks rather promising. But if say two of the above mentioned players leave, then I'm afraid it looks rather dark.\nGraham: Potentially this could be an exciting year but we must stop selling players. The board must start spending and the transfer team upping their game, especially with a decent striker, otherwise a relegation battle awaits.\nSimon: If we keep players like Eze and Olise then we can compete for seventh. Still one month to go in the window and we do need a striker who can get 10+ goals a season, but I only see loans now if we sign Franca. If we don't address the striker need then we can definitely finish top 10, so a season where we shouldn't be flirting with relegation and looking upwards!\nAndy: Crystal Palace will always be a mid-table team at best! We lack the fanbase and funding to turn into a top-five team! We've had a very good run of it over the last few seasons and fear that the relegation moment is due soon.", "url": "https://www.bbc.com/sport/articles/cy6ylqz3d7vo"}