{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:45:23", "date_modify": "2025-05-20 11:45:23", "date_publish": "2023-08-06 11:23:36", "description": "Ireland head coach Andy Farrell plays down concerns over injuries sustained by three of his players in their World Cup warm-up win over Italy.", "filename": "sport_rugby-union_66421743_1747741523.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/827F/production/_130670433_gettyimages-1578814649.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-union_66421743_1747741523.html", "title": "Ireland: Head coach Andy Farrell plays down Irish injuries after 'clunky' win over Italy", "title_page": "Ireland: Head coach Andy Farrell plays down Irish injuries after 'clunky' win over Italy - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ireland head coach Andy Farrell has allayed concerns over injuries sustained by three of his players in their World Cup warm-up win over Italy.\nNumber eight Jack Conan, full-back Jimmy O'Brien and scrum-half Craig Casey were all forced off during the 33-17 victory in Dublin.\nConan was wearing a protective boot on a foot injury sustained in the first half while O'Brien and Casey had shoulder and back issues respectively.\n\"They seem not too bad,\" Farrell said.\n\"Jimmy's shoulder has shut down a little bit, it's something he's had in the past. Jack lost power in his foot, he seems OK.\n\"Craig had a tight back which was making his hamstring cramp. They were taken off as precautions more than anything.\"\nAn experimental Ireland side, captained by Ulster's Iain Henderson, recovered from a sluggish start at a subdued Aviva Stadium to take control of the contest but did not fully convince, despite the comfortable scoreline.\nCaelan Doris produced a man-of-the-match performance for the Grand Slam winners, scoring two tries, with Dave Kilcoyne, Stuart McCloskey and replacement Cian Healy also on the scoresheet.\nWith Farrell set to reduce his current 42-man squad down to 33 for the World Cup in France, that starts in September, Ulster hooker Tom Stewart made his debut from the bench on Saturday night along with Leinster's Ciaran Frawley and Munster's Calvin Nash.\nIt was the first of three World Cup warm-up games, with meetings with England and Samoa to come.\n\"To get up and running with a victory is nice, but I think we all know really that it was a bit clunky, to say the least, at times,\" said Farrell.\n\"There was some really good stuff as far as possession is concerned and opportunities to convert were there in spades.\n\"But we weren't patient enough to be able to convert that, so I think that's the morale of the story really.\"\nUlster win Jacob Stockdale won his first Ireland cap for two years and Farrell had some encouraging words for his performance.\n\"A lot of good, and some bits that he'll hope to tidy up,\" Farrell said in assessment of the 27-year-old.\n\"It's two years from his last start. It would have been a big day for Jacob so he'll be better for the experience for sure.\"", "url": "https://www.bbc.com/sport/rugby-union/66421743"}