{"authors": ["Andrew Benson", "www.facebook.com"], "date_download": "2025-05-21 05:07:03", "date_modify": "2025-05-21 05:07:03", "date_publish": "2025-04-04 03:43:26", "description": "Alpine's Jack Doohan suffers a high-speed crash as Friday practice at the Japanese Grand Prix is punctuated by four red-flag stoppages.", "filename": "sport_formula1_articles_cj0zrre33evo_1747804023.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/29a7/live/3db79830-1130-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_formula1_articles_cj0zrre33evo_1747804023.html", "title": "Japanese Grand Prix: Jack Doohan in high-speed crash as Oscar Piastri fastest in second practice", "title_page": "Japanese Grand Prix: Jack Doohan in high-speed crash as Oscar Piastri fastest in second practice - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Alpine's Jack Doohan suffered a high-speed crash as Friday practice at the Japanese Grand Prix was punctuated by four red-flag stoppages.\nThe Australian was uninjured in the crash, which was caused because Doohan failed to shut the DRS overtaking aid, which meant the car had less grip than he expected as he entered the 160mph first corner.\nTeam principal Oliver Oakes said it had been a \"misjudgement\" and \"something to learn from\".\nDoohan's was the first of four incidents that led to the session being stopped, two of which were for the grass catching fire beside the track.\nMcLaren's Oscar Piastri ended up fastest from team-mate Lando Norris.\nThe second stoppage was caused when Aston Martin's Fernando Alonso spun off and became beached in the gravel at Degner One, shortly after the session was restarted following a 20-minute delay to repair the damage to the barriers at Turn One.\nAnd a few minutes after the session was resumed, the cars had to return to the pits when the grass caught fire between Dunlop and Degner One.\nThat left only seven minutes of running at the end of the session, but it was stopped after six when a bigger patch of grass caught fire on the run down to Spoon Curve.\nThe fires are believed to have been caused by a combination of sparks from the cars and dry grass - Japan's wet season is in the summer.\nThe country's grand prix was held in the autumn until last year, when it was moved to avoid typhoon season and to improve Formula 1's sustainability with regard to travel and logistics.\nA statement from F1's governing body, the FIA, said: \"While we continue to look into the fires that occurred during FP2, our focus before tomorrow will be on taking preemptive measures.\n\"The grass has been cut as short as possible, and loose, dried grass has been removed from affected areas. Prior to tomorrow's sessions, the grass will be dampened, and specific response teams will be stationed around the track.\"\nDoohan's accident, which badly damaged his car, was the result of an oversight by a driver in only his fourth race in F1.\nHe was on only his second flying lap of the day, as his car had been driven by reserve Ryo Hirakawa in the first session.\nThe DRS, which boosts straight-line speed by reducing downforce, is triggered to shut automatically if the driver brakes.\nDoohan turned into the first corner having lifted off but not braked, and because he did not press the DRS button, the device remained activated.\nThat meant the wing was still in its open, low-downforce position, and the car immediately spun as he entered the corner. It careered across the gravel trap before making a heavy impact with the crash barrier.\nDoohan said: \"It was a heavy one, something that caught me by surprise, and I will learn from it. I know the team has a lot of work ahead to repair the car.\"\nThe shunt could increase the pressure on the 22-year-old, who has been dealing with questions as to whether his seat is under threat following Alpine's signing of Argentine Franco Colapinto as reserve driver.\nColapinto raced for Williams last year and his presence in a race seat could unlock significant amounts of sponsorship money from Latin America.\nThe series of stoppages left it impossible to draw any serious conclusions about relative pace, although it remains clear that McLaren are the team to beat.\nOn an unusually cold day of only 13C, all the drivers mentioned the strong north-westerly winds as making life difficult on a circuit with so many long, fast corners.\nNorris said: \"We're still in a good position, it's tricky just because of the wind. Wind makes a big difference, especially on a circuit like this when it's so quick.\n\"You're on such a fine limit for a long time in the first sector, the tiniest bit of wind can upset the car a lot. I still feel good, like we're in a reasonable place.\"\nFrenchman Isack Hadjar continued to impress for Racing Bulls with third fastest time on his first visit to Suzuka, considered one of the most demanding circuits on the calendar.\nHis team-mate Liam Lawson, who was demoted from the Red Bull team after just two races before this event, was fifth fastest behind Lewis Hamilton's Ferrari.\nHamilton said: \"It felt great. We got through all the programme. We have some performance to pick up - we're not the quickest at the moment - but it's a good baseline.\n\"From weekend to weekend I'm getting more comfortable, and understanding more of the set-up changes we can do and knowing what tools I have that can get the car in a better place.\"\nMercedes' George Russell was sixth fastest, from the second Ferrari of Charles Leclerc.\nRussell said: \"A pretty positive day for us, the car has been handling really nicely and I've been pretty pleased with that. We've got to make sure it stays the same for tomorrow.\n\"It is really windy out there and tomorrow the wind is going to shift 180 degrees so that is going to really change how the car is feeling but I am confident we can be in the mix for fighting for the front two rows.\"\nMax Verstappen was eighth, complaining of understeer in his Red Bull, with Pierre Gasly's Alpine and the Williams of Carlos Sainz completing the top 10.\nYuki Tsunoda impressed in the first session, topped by Norris, after his move up to Red Bull in place of Lawson, with sixth fastest time just 0.107 seconds slower than team-mate Verstappen.\nThe Japanese was only 18th in the second session, and did not complete a representative lap on the soft tyres.\nTsunoda said: \"P1 was better than expected. Good start for myself and P2 didn't even set a lap time. Lots of work to do. Maybe slightly struggled. So far overall it's OK, just have to build up the confidence more.\"\nHe said the car felt \"a little bit more different than I expected\" out on track compared with the simulator, which he tried last week, and was \"feeling a bit more tricky\".\nVerstappen said: \"Today has been quite difficult for me, trying a lot of different things with the car but it seems like a lot of things are not really clicking at the moment, quite difficult to put the lap down.\n\"You need a lot of confidence and commitment around here and at the moment I don't feel I can use that so we still have a bit of work to do.\"", "url": "https://www.bbc.com/sport/formula1/articles/cj0zrre33evo"}