{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:18:03", "date_modify": "2025-05-21 04:18:03", "date_publish": "2025-02-09 11:03:27", "description": "The 2025 Welsh Open begins on Monday, 10 February, with seven-time world champion Ronnie O'Sullivan set to return to action.", "filename": "sport_snooker_articles_c07kyr25g41o_1747801083.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a6c5/live/b124f4f0-e6d0-11ef-ac93-4351ddbb9948.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_snooker_articles_c07kyr25g41o_1747801083.html", "title": "Welsh Open: Wilson to defend title as O'Sullivan set for return", "title_page": "Welsh Open: Wilson to defend title as O'Sullivan set for return - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The 2025 Welsh Open begins on Monday, 10 February, with seven-time world champion Ronnie O'Sullivan set to return to action.\nO'Sullivan, a four-time Welsh Open winner, did not take part in the German Masters, Masters and Championship League, and makes his return against Wales' Jamie Clarke in Tuesday's first-round match.\n'The Rocket' is joined in the bottom half of the draw by Kyren Williams, Mark Williams and Shaun Murphy, among others, while defending champion Gary Wilson starts his title defence against India's Ishpreet Singh Chadha.\nThree-time world champion Williams is one of 10 Welsh players in the 64-player competition, with each hoping to become the first Welshman to win the competition since 1999.\n'The Welsh Potting Machine' won his second Welsh Open title that year, beating Stephen Hendry 9-8 in the final, though the Scotsman got revenge four years later.\nAmateurs Florian Nuessle, Joshua Cooper and Dylan Emery feature in the first round at Venue Cymru, Llandudno, having won their respective qualifying round games.\nFirst round games take place on 10-11 February, with the final on Sunday, 16 February.", "url": "https://www.bbc.com/sport/snooker/articles/c07kyr25g41o"}