{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:27:41", "date_modify": "2025-05-21 06:27:41", "date_publish": "2025-04-01 04:24:23", "description": "Wrexham: Phil Parkinson says his side must 'fight tooth and nail' at Cambridge", "filename": "sport_football_articles_cgjl4vv23n1o_1747808861.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6b06/live/e250dd80-0e23-11f0-9a68-1b75bf032378.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cgjl4vv23n1o_1747808861.html", "title": "Wrexham: Phil Parkinson says his side must 'fight tooth and nail' at Cambridge", "title_page": "Wrexham: Phil Parkinson says his side must 'fight tooth and nail' at Cambridge  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Phil Parkinson says Wrexham will have to \"fight tooth and nail\" to maintain their impressive away form at Cambridge United as they look to take another step towards automatic promotion.\nWrexham travel to Cledara Abbey Stadium on Tuesday (19.45 BST) with Cambridge second-bottom of League One and 11 points from safety.\nBut Parkinson says the Red Dragons will have to work hard for a win as they bid to extend their advantage over Wycombe, who are currently three points below them in third with a game in hand.\n\"Cambridge will still believe they can put a run together, and we've got to be ready to fight tooth and nail like we did at Exeter,\" said the Wrexham boss.\n\"Headers, tackles, defending our box well. All of those things give you a platform to win games. We did it brilliantly, and we've got to do it again on Tuesday night.\"\nSaturday's victory at St James Park was Wrexham's seventh from their last eight games on the road.\nIt kept them second in League One ahead of the match with a Cambridge side managed by former Cardiff City boss Neil Harris.\nThe U's are winless in the last six games, though Parkinson will no doubt remind his team they did take points off Wrexham in a 2-2 draw at the Stok Racecourse in December.\n\"Neil Harris has gone back there [as head coach] and they've had a change of director of football so there will probably be a different feel to their team, but we'll make sure we have a good look at them,\" said Parkinson.\n\"Each game you take in its own entity. Exeter was a completely different game to Stockport - a different system to come up against, different style of play, different strengths and weaknesses.\n\"Our focus has to be on that. When we come away from the game, did we tick the boxes we speak about in training?\n\"The answer was yes at Exeter...so can we do it again on Tuesday?\n\"There's no let up. If you feel you can win a game at 75 per cent, you can come unstuck. Everyone's got to be focussed, prepared to run the hard yards and put bodies on the line around both boxes.\"", "url": "https://www.bbc.com/sport/football/articles/cgjl4vv23n1o"}