{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:00:02", "date_modify": "2025-05-20 14:00:02", "date_publish": "2023-07-31 08:15:45", "description": "Cornish cricket side Grampound Road are out of the National Village Cup after a 137-run loss to Leeds and Broomfield in the semi-finals.", "filename": "sport_cricket_66358649_1747749602.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/828B/production/_130591433_abd01112-85e3-4d66-aad2-b8ead7bb9d6a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66358649_1747749602.html", "title": "Grampound Road knocked out of National Village Cup in semi-finals", "title_page": "Grampound Road knocked out of National Village Cup in semi-finals - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cornish cricket side Grampound Road missed out on playing at Lord's after they lost by 137 runs to Kent-based Leeds and Broomfield in the National Village Cup semi-finals.\nLeeds and Broomfield made 207-6 in their 40 overs as George Davis top-scored with 61.\nSkipper Ed Scrivens (58) and Monte McCague (41) put on 74 for the first wicket as Alex Lean took 2-37.\nIn reply the hosts were bowled out for just 70 in 24.1 overs.\nLean was the only Grampound Road batter to make it into double figures as the opener hit 26 from 42 balls as Phillip Semmens took 5-11.\nLeeds and Broomfield will face either Milford Hall or Stayley in the final - their semi-final was abandoned due to rain and will be replayed next week.\n\"We were beaten by a better side on the day,\" Grampound Road captain Dave Neville told BBC Radio Cornwall.\n\"I was positive, I thought we would get close to it, but they bowled really, really tight.\n\"Bu it's an an amazing achievement.\n\"The boys are really disappointed in there at the moment, but when they reflect on this they'll understand that we've got through to the semi-final of the National Village Cup.\n\"It's a big occasion, a big competition, but to get to the semi-final is an amazing achievement for this club.\n\"It's a small village with a great playing area, great clubhouse, it's got everything there, so we've got to build on this and hopefully next year we can get that one step further.\"", "url": "https://www.bbc.com/sport/cricket/66358649"}