{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:25:49", "date_modify": "2025-05-20 12:25:49", "date_publish": "2023-08-04 11:59:27", "description": "Armstrong thrilled to reunite with childhood pal Kennedy", "filename": "sport_articles_ce4zw3zznvwo_1747743949.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f2a7/live/4dd083f0-32be-11ee-9217-27b202a39e56.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_ce4zw3zznvwo_1747743949.html", "title": "Armstrong thrilled to reunite with childhood pal Kennedy", "title_page": "Armstrong thrilled to reunite with childhood pal Kennedy - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Kilmarnock winger Danny Armstrong is enjoying being reunited with childhood friend Matty Kennedy at Rugby Park.\nArmstrong, 25, and 28-year-old Kennedy were neighbours in Ayr before their careers took different paths.\n\"We grew up as neighbours in Ayr around 12, 13, or maybe even younger and we moved down south,” said Armstrong.\n“We always stayed in touch, we have always stayed mates and we have had a good few holidays together so it was good to get him in the door.\n\"We have always said it [we'd play together] for a laugh, we never thought we would get the chance but it came here, we were on holiday in the summer before he knew he was signing here.\n\"I told him it was a great place to be, a great group of lads and he made the decision very quickly, it was nice to get it officially done.\"\nWith four Viaplay Cup games under their belts Killie open their Premiership campaign on Saturday at home to Michael Beale's revamped Rangers, who are playing their first competitive match of the season.\n\"I can't imagine a team like Rangers being cold,\" said Armstrong. \"We are going to have to treat them with the respect they deserve.\n\"We will set about our task, give the best account of ourselves we possibly can and hopefully it gets us the result.\"", "url": "https://www.bbc.com/sport/articles/ce4zw3zznvwo"}