{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:00:21", "date_modify": "2025-04-26 04:00:21", "date_publish": "2025-03-04 05:16:32", "description": "Swansea City: Alan Sheehan eyes unbeaten run before Preston North End test", "filename": "sport_football_articles_cwyg72l3el7o_1745640021.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ec25/live/626d7040-f831-11ef-a8b4-b37546a32a57.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cwyg72l3el7o_1745640021.html", "title": "Swansea City: Alan Sheehan eyes unbeaten run before Preston North End test", "title_page": "Swansea City: Alan Sheehan eyes unbeaten run before Preston North End test - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Alan Sheehan has challenged Swansea City to put together an unbeaten run as they prepare for a tricky trip to Preston North End on Tuesday (19:45 GMT).\nSwansea return to action after a 10-day break having claimed a pressure-easing victory against Blackburn Rovers in their first game since the departure of Luke Williams.\nThey now take on a Preston side who are only one place and two points better off in the Championship table, but have lost just one home league fixture since the opening weekend of the season.\nSwansea are nine points clear of the relegation places after the Blackburn triumph, which was just the second win in their past 10 second-tier games.\nBut Sheehan is looking for some consistency after insisting there is work to do before Swansea can look ahead with any certainty to another year in the Championship.\n\"You can't take your foot off the pedal because that distance will close again if you think you have done everything in one game,\" Swansea's caretaker boss said.\n\"One game is good, two games is better, three games etcetera. That's what you want to build a winning team.\n\"We all want to be a part of a winning football club that plays really attacking football and are aggressive.\n\"I think we have done it once. The players deserve all the praise they have got but now is an opportunity to go and do it again. That's the challenge.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cwyg72l3el7o"}