{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:12:03", "date_modify": "2025-05-21 06:12:03", "date_publish": "2025-02-08 15:31:14", "description": "Brad Hall pilots Great Britain to two-man and four-man bronze in the latest round of the bobsleigh World Cup series in Lillehammer, Norway", "filename": "sport_articles_cjexgwk388zo_1747807923.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4272/live/824af7d0-e62e-11ef-a319-fb4e7360c4ec.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cjexgwk388zo_1747807923.html", "title": "Bobsleigh World Cup: Britain win two-man and four-man bronze in Lillehammer", "title_page": "Bobsleigh World Cup: Britain win two-man and four-man bronze in Lillehammer - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Great Britain claimed bronze medals in both the two-man and four-man events in the latest round of the World Cup bobsleigh season in Lillehammer.\nBrad Hall piloted both crews on to the podium in races that doubled up as the European Championships.\nOn both occasions they finished behind the German teams of Francesco Friedrich and Johannes Lochner.\nFriedrich pipped Lochner to victory in the two-man on Saturday, when the British team of Hall and Taylor Lawrence finished 0.48 seconds off the pace.\nThe top two were reversed in Sunday's four-man as Hall and Lawrence, together with team-mates Arran Gulliver and Leon Greenwood, finished 0.2 seconds back in a dead heat for third place with Switzerland's Michael Vogt.\nIt was a fifth podium finish in six races in the four-man, helping Hall's team remain second in the standings on 1,244 points, 61 behind defending champion Friedrich.\nHall and Lawrence are third in the two-man standings and heading for a second overall medal in that discipline in three years.\nThe teams will return to Lillehammer next weekend (15-16 February) for the final round of the World Cup season, with the two-man taking place on Saturday and four-man on Sunday.", "url": "https://www.bbc.com/sport/articles/cjexgwk388zo"}