{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:27:58", "date_modify": "2025-05-20 14:27:58", "date_publish": "2023-06-28 12:38:15", "description": "All the ins and outs at Scotland's second-tier clubs during the summer transfer window.", "filename": "sport_football_66043149_1747751278.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9D87/production/_126172304_20501211.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66043149_1747751278.html", "title": "Scottish Championship ins & outs - who has moved in summer 2023?", "title_page": "Scottish Championship ins & outs - who has moved in summer 2023? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Published\n16 September 2023\nScottish Premiership ins & outs - summer 2023\nScottish League 1 ins & outs - summer 2023\nScottish League 2 ins & outs - summer 2023\nScottish Championship ins & outs - January 2023\nAirdrieonians\nIn: Mason Hancock, defender (Aberdeen); Elliot Dunlop, midfielder (St Mirren); Nikolay Todorov, forward (Dunfermline Athletic); Dean McMaster, midfielder (St Mirren, loan to permanent); Gavin Gallagher, midfielder (St Mirren).\nLoan in: Josh O'Connor, forward (Hibernian); Murray Aiken, midfielder (Hibernian).\nOut: Justin Devenney, midfielder (Crystal Palace, undisclosed); Callum Smith, forward (Raith Rovers); Euan Deveney, defender (Alloa Athletic); Kyan Gunn, midfielder (Clyde); Lachie Byrd, defender (Welling United); Bright Prince, forward (Albion Rovers); Josh Tran, midfielder (Albion Rovers); Joe Dixon, forward (Gretna 2008); Jay Riley, defender (Gretna 2008); Salim Kouider-Aissa, forward.\nLoan ended: Dean McMaster, midfielder (St Mirren); Ben Stanway, midfielder (Partick Thistle); Darren Jamieson, goalkeeper (Kelty Hearts).\nArbroath\nIn: Leighton McIntosh, forward (Cove Rangers); Kenan Dunnwald-Turan, midfielder (Straelen); Jay Bird, forward (Dagenham & Redbridge); Jess Norey, midfielder (Barking); Aaron Steele (East Fife, undisclosed); Craig Slater, midfielder (Forfar Athletic); Jermaine Hylton, forward (Rushall Olympic); Mark Stowe, midfielder (Linlithgow Rose); Alasdair Adams, goalkeeper (Musselburgh Athletic).\nOut: Lewis Banks, defender (Altrincham); Sean Adarkwa, forward (Wealdstone); Dale Hilson, forward (Stirling Albion); Cammy Gill, goalkeeper (Montrose); Kieran Shanks, forward (Peterhead, undisclosed); Dylan Paterson, midfielder (Linlithgow Rose); Bobby Linn, forward (Lochee United); Yasin Ben El-Mhanni, forward; Paul Komolafe, forward.\nLoan ended: Dylan Tait, midfielder (Hibernian); Toyosi Olusanya, midfielder (St Mirren); Scott Bitsindou, midfielder (Livingston); Steven Hetherington, midfielder (Falkirk).\nLoan out: Scott Allan, midfielder (Larne).\nAyr United\nIn: Aiden McGeady, midfielder (Hibernian); Jamie Murphy, forward (St Johnstone); George Stanger, defender (Alloa Athletic, undisclosed); Francis Amartey, forward (Aldershot Town, undisclosed); Ahkeem Rose, forward (Weymouth); Robbie Mutch, goalkeeper (Edinburgh).\nLoan in: Logan Chalmers, forward (Dundee United); Jay Senga, midfielder (Reading); Anton Dowds, forward (Partick Thistle); Elicha Ahui, defender (Lincoln City).\nOut: Dipo Akinyemi, forward (York City, undisclosed); Daire O'Connor, midfielder (Glentoran, undisclosed); Sam Ashford, forward (Cliftonville); Josh Mullin, midfielder (Raith Rovers); Jordan Houston, defender (Queen of the South); Michael Hewitt, midfielder (Hamilton Academical, undisclosed); Aidan McAdams, goalkeeper (Edinburgh City); Jayden Mitchell-Lawson, midfielder (Maidenhead United); James Dolan, midfielder (Stranraer); Kinlay Bilham, defender (Stenhousemuir); Michael Moffat, forward (Glenafton Athletic, loan to permanent); Alex Jeanes, defender (University of Stirling); Olly Pendlebury, midfielder; David Bangala, defender; Chris Maguire, forward.\nLoan ended: Alex Kirk, defender (Arsenal); Reece McAlear, midfielder (Tranmere Rovers).\nLoan out: Lyall Holding, defender (Glenafton Athletic).\nDundee United\nIn: Declan Gallagher, defender (St Mirren, undisclosed); Louis Moult, forward (Burton Albion); Ross Docherty, midfielder (Partick Thistle); Kevin Holt, defender (Partick Thistle); Liam Grimshaw, midfielder (Greenock Morton).\nLoan in: Jordan Tillson, midfielder (Ross County); Jack Walton, goalkeeper (Luton Town); Oliver Denham, defender (Cardiff City).\nOut: Dylan Levitt, midfielder (Hibernian, undisclosed); Aziz Behich, defender (Melbourne City, undisclosed); Carljohan Eriksson, goalkeeper (Nordjaelland, undisclosed); Charlie Mulgrew, defender (retired); Liam Smith, defender (Cheltenham Town); Darren Watson, midfielder (Forfar Athletic); Adam Hutchinson, defender (Forfar Athletic); Jacob Comerford, defender (East Fife); Finn Robson, midfielder (Forfar Athletic, loan to permanent); Jamie McCabe, goalkeeper (Brechin City); Steven Fletcher, forward; Arnaud Djoum, midfielder; Ryan Edwards, defender; Ian Harkes, midfielder; Peter Pawlett, midfielder.\nLoan ended: Jamie McGrath, midfielder (Wigan Athletic); Loick Ayina, defender (Huddersfield Town).\nLoan out: Logan Chalmers, forward (Ayr United); Layton Bisland, defender (Falkirk); Miller Thomson, midfielder (Montrose); Lewis O'Donnell, midfielder (Kelty Hearts); Rory MacLeod, forward (Forfar Athletic).\nDunfermline Athletic\nGreenock Morton\nInverness Caledonian Thistle\nIn: Charlie Gilmour, midfielder (St Johnstone); Adam Brooks, midfielder (Celtic); Jake Davidson, defender (Queen's Park); Luis Longstaff, midfielder (Cove Rangers); Nikola Ujdur, defender (Rockdale Ilinden); Harry Lodovica, forward (Aveley).\nLoan in: Max Anderson, midfielder (Dundee); Morgan Boyes, defender (Livingston).\nOut: Robbie Deas, defender (Kilmarnock); Scott Allardice, midfielder (Ross County); Steven Boyd, forward (Greenock Morton); Max Ram, defender (Gloucester City); Shane Sutherland, forward; Ben Woods, midfielder;\nLoan ended: Daniel MacKay, midfielder (Hibernian); Jay Henderson, midfielder (St Mirren).\nLoan out: Matthew Strachan, defender (Brora Rangers); Harry Hennem, midfielder (Clachnacuddin); Ethan Cairns, forward (Forres Mechanics).\nPartick Thistle\nIn: Blair Alston, midfielder (Kilmarnock); Scott Robinson, forward (Kilmarnock); Wasiri Williams, defender (Swansea City); Wes McDonald, forward (Hartlepool United).\nLoan in: Kerr McInroy, midfielder (Kilmarnock); Lewis Neilson, defender (Heart of Midlothian); Ben Williamson, midfielder (Rangers); Kieran Ngwenya, defender (Aberdeen); Tomi Adeloye, forward (Swindon Town).\nOut: Scott Tiffoney, midfielder (Dundee); Kyle Turner, midfielder (Ross County); Danny Mullen, forward (Derry City); Darren Brownlie, defender (Dundalk); Gallagher Lennon, defender (St Mirren); Ross Docherty, midfielder (Dundee United); Kevin Holt, defender (Dundee United); Cammy Smith, forward (Morecambe); Billy Owens, midfielder (Kelty Hearts); Gospel Ocholi, midfielder.\nLoan ended: Lee Hodson, defender (Kilmarnock); Cole McKinnon, midfielder (Rangers); Connor McAvoy, defender (Fulham).\nLoan out: Anton Dowds, forward (Ayr United); Ji Stevenson, midfielder (Clyde); Jamie Taggart, midfielder (Gartcairn); Sallu Turay, forward (Gartcairn).\nQueen's Park\nRaith Rovers\nAround the BBC\nBBC Sport Scottish Football\nRelated internet links\nSPFL\nThe BBC is not responsible for the content of external sites.", "url": "https://www.bbc.com/sport/football/66043149"}