{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:05:54", "date_modify": "2025-05-21 07:05:54", "date_publish": "2025-03-29 00:00:00", "description": "Josh Murphy's first-half strike earns Portsmouth a crucial Championship win over Blackburn to ease their relegation fears.", "filename": "sport_football_live_c4g9191zy9yt_1747811154.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c4g9191zy9yt_1747811154.html", "title": "Portsmouth 1-0 Blackburn Rovers: Josh Murphy gives Pompey crucial win", "title_page": "Portsmouth 1-0 Blackburn Rovers: Josh Murphy gives Pompey crucial win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Josh Murphy's first-half strike earned Portsmouth a crucial Championship win over Blackburn to ease their relegation fears.\nThe win for Pompey moves them seven points clear of the league's bottom three with seven remaining fixtures, while Rovers have now lost four straight league games and their play-off hopes continue to dwindle.\nMurphy scored the only goal in the 20th minute with a low, well-taken finish into the bottom corner.\nBlackburn are five points off the play-off places and have not won a league match since they beat Plymouth Argyle in mid February.\nPortsmouth asserted some early pressure on Blackburn and were good value for their half-time lead.\nThe first big chance came through dangerman Murphy who beat his man down the left and whipped in a searching ball that was just poked behind by a defender with Colby Bishop waiting in the middle.\nThe Blues took the lead midway through the first half when Murphy picked up the ball on the left, played it into Bishop who rolled it back to him and Murphy settled himself before stroking it into the bottom right-hand corner.\nThe well-worked team move had the home supporters on their feet singing Murphy's name for the next five minutes - it was his seventh league goal of the season.\nThe main effort of note for Blackburn in the first half was when Cauley Woodrow spotted Portsmouth keeper Nicolas Schmid off his line, but the Pompey man was able to just get back in time to stop the ball going in.\nThey also came close when Woodrow lifted a cross to the back post where Hayden Carter was running in, but his header narrowly missed the target.\nIn the majority of the second half there was a real lack of offensive quality from both sides.\nThey both wrestled for control of the game, enjoying spells of possession in the middle of the park and going to the bench to try and find a crucial goal.\nIn the last moments of the game Blackburn pinned Portsmouth back as they piled on the pressure but the home side defended with determination, urged on by the loud home support.\nAs the final whistle went, Fratton Park loudly roared as the win ensured that they opened up more breathing room between themselves and the bottom three.\nBlackburn Rovers boss Valerien Ismael told BBC Radio Lancashire:\n\"It was a big disappointment, especially how we approached the first half.\n\"We knew it would be difficult at the beginning with the pressure and energy, the injury changed our rhythm early on.\n\"We finished the first half better with some great chances and the second was better, we played with more confidence but we still need to believe more because we have the quality.\n\"We need to be more dangerous on the ball, we need to take more risks, the last 15 minutes there was too much backwards and square passes.\"", "url": "https://www.bbc.com/sport/football/live/c4g9191zy9yt"}