{"authors": ["Nicola Pearson", "www.facebook.com"], "date_download": "2025-05-21 07:27:55", "date_modify": "2025-05-21 07:27:55", "date_publish": "2025-05-20 18:32:35", "description": "Ruben Amorim press conference: Tottenham vs Man Utd - Europa League preview", "filename": "sport_football_articles_clygg81nv41o_1747812475.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/eec5/live/993cf210-a90a-11ef-a4fe-a3e9a6c5d640.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_clygg81nv41o_1747812475.html", "title": "Ruben Amorim press conference: Tottenham vs Man Utd", "title_page": "Ruben Amorim press conference: Tottenham vs Man Utd - Europa League preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Amorim confirmed that Leny Yoro, Diogo Dalot and Joshua Zirkzee are all in contention for the game: \"They recovered quite well, they pushed. Of course we respect the feeling of the player but we push a little bit because they want to be part of the team and that is a very good sign and it's very good for us. Of course they are limited in the minutes for the game but they can help us win the game.\"\nThe United boss said that, even if they win the Europa League, \"nothing is going to change our season\" but winning the title \"can help us have the feeling that can help us to build a future\".\nWith the widely reported redundancies at the club this season, when asked if they were playing for more than just the trophy, Amorim responded: \"I think it's not the case. We are doing things that we need to do, but, for example, I came from the club that in order to survive and to maintain the players you need to be in the Champions League. This is not the case. Our club can have revenues without Champions League.\"\nHe added: \"It's a big, massive club with fans around the world. It is a big brand. We just need to be focused and do things in the right way so I don't see it like that. I'm always playing for more than myself. I'm coaching for my players, staff and especially the fans.\"\nAmorim does not know if there will be an advantage having played players instead of resting them like Tottenham did. He said: \"I felt that the best thing to prepare for the final was to give time to the players to play so I cannot respond from the side of Tottenham. For me, it was really clear - we need to compete, the best way to prepare something is to compete.\"\nOn previous comments that winning would change the summer at Manchester United but not fix the problems: \"It's hard to speak about it in this moment because we need to be excited and confident but we already know the problems. There are a lot of things we need to change in our club. That will not be solved by winning a cup.\"\nAmorim said it is \"hard to explain\" why he does not seem to be under the same pressure over his future as Ange Postecoglou: \"I think people see what we are trying to do. I think people see that sometimes I am thinking more in the club than in myself. People understand, especially the board, that we have a lot of issues that, in the context, is really hard. I don't know how to explain. I will try to prove myself to the fans, board, but I don't have an explanation for you.\"", "url": "https://www.bbc.com/sport/football/articles/clygg81nv41o"}