{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:40:47", "date_modify": "2025-05-21 05:40:47", "date_publish": "2025-04-04 00:00:00", "description": "England move top of their Women's Nations League group with a comfortable victory over Belgium at Ashton Gate.", "filename": "sport_football_live_cjdxkgym9zjt_1747806047.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cf55/live/4f57d7e0-119d-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cjdxkgym9zjt_1747806047.html", "title": "England 5-0 Belgium: Keira Walsh & Aggie Beever-Jones score first Lionesses goals", "title_page": "England 5-0 Belgium: Keira Walsh & Aggie Beever-Jones score first Lionesses goals - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England moved top of their Women's Nations League group with a comfortable victory over Belgium at Ashton Gate.\nIn an impressive performance, Lucy Bronze flicked in the opener before Millie Bright nodded in England's second on the stroke of half-time after a Bronze assist.\nSubstitute Aggie Beever-Jones slotted past visiting goalkeeper Nicky Evrard to make it 3-0 with her first goal for the senior team, while Jess Park added a calmly-taken fourth in the 77th minute.\nKeira Walsh rounded off the success with a late strike into the bottom corner for the 27-year-old's first international goal on her 83rd cap - and it could have been many more for England in a dominant display.\nArsenal striker Alessia Russo struck the woodwork twice, while Chelsea midfielder Walsh's long-range effort also bounced back off the post.\nSarina Wiegman's side built on their victory over world champions Spain in February as they gear up to defend their European title in Switzerland this summer.\nDespite missing several players through injury, the Lionesses looked full of creativity and confidence in Bristol - and the scoreline did not flatter them.\nThey impressed going forward and were rarely tested at the back as Wiegman was able to rotate her team amid a busy club schedule.\nEngland continue their Women's Nations League campaign in Belgium on Tuesday (19:30 BST kick-off), having picked up seven points from a possible nine so far, topping Group A3 by a point from Spain who won 4-2 in Portugal.\nHaving beaten Spain at Wembley in February, boss Wiegman wanted her side to continue on the winning path - and they did it in style against bottom-of-the-table Belgium.\nIt was a controlled and clinical performance from the Lionesses as they set the tone early on with back-to-back corners, testing Evrard and her defence from the off.\nRusso, who has been in fine form for Arsenal in recent weeks, thought she had scored twice in the first half only to be denied by the woodwork after nice link-up play with Gunners team-mate Beth Mead.\nMead returned to the starting XI – Wiegman's only change from the victorious side against Spain – and she proved why it was the right decision with clever runs in behind and a blossoming partnership with Russo on show.\nMost of England's success came down their right-hand side through Mead and Bronze – the Chelsea full-back was once again a standout performer and rewarded with her goal.\nLauren James was also a threat and came close when she curled a free-kick inches over the crossbar, and it was her teasing delivery that was flicked on acrobatically by Bronze for the 21st-minute opener.\nThe experienced defender was involved in the second goal too just before half-time when she flicked on Mead's corner and Bright bravely put her head to the ball in front of goalkeeper Evrard at the back post.\nThat meant the job was mostly done and with Belgium tiring, Beever-Jones, Park and Walsh - driving a low effort home two minutes from time for her long-awaited goal - completed the rout in an enjoyable second half.\nIt was the perfect evening for Wiegman as she was able to bring off key players Ella Toone, Leah Williamson, Russo and James and gave further opportunities for Park and Beever-Jones to showcase themselves under little pressure.\n\"Of course you want to do really well in the Nations League and win which also brings you in a good position for the draw for the World Cup,\" said Wiegman afterwards.\n\"At the same time, it's preparation for the Euros. When you get the opportunity to see many players that are knocking on the door and you see combinations, that is really nice. We did that today.\"\nEngland are now starting to build some momentum as they continue their preparations for this summer's Euros in Switzerland, and this was evidence of the progress they have made in recent months.", "url": "https://www.bbc.com/sport/football/live/cjdxkgym9zjt"}