{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:47:19", "date_modify": "2025-04-26 03:47:19", "date_publish": "2025-03-08 00:00:00", "description": "Ismaila Sarr scores the only goal of the game as Crystal Palace beat Ipswich Town in a scrappy encounter at Selhurst Park.", "filename": "sport_football_live_cy87d882300t_1745639239.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/497a/live/2e110880-fc31-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_cy87d882300t_1745639239.html", "title": "Crystal Palace 1-0 Ipswich: Ismaila Sarr scores winner for hosts", "title_page": "Crystal Palace 1-0 Ipswich: Ismaila Sarr scores winner for hosts - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Ismaila Sarr scored the only goal of the game as Crystal Palace won their fourth match in a row to beat Ipswich Town in a scrappy encounter at Selhurst Park.\nIt was the first match the Eagles had to play without key striker Jean-Philippe Mateta, who needed 25 stitches to a cut on his head following a challenge from keeper Liam Roberts in the FA Cup win over Millwall last weekend.\nSarr scored the winning goal in the 82nd minute when he dribbled the ball into the area and chipped it over Alex Palmer.\nThe game lacked quality at times. Palace had the first chance of the match just two minutes into the game when Adam Wharton played through Eddie Nketiah with an excellent pass, but the striker could only shoot straight at Palmer.\nIpswich responded well and had two good opportunities of their own when Jaden Philogene's effort was well saved by Dean Henderson, before Julio Enciso also tested the Palace keeper.\nThe Eagles next went close in the second period when Eberechi Eze hit the post after his deflected cross into the box had Palmer scrambling.\nLiam Delap continued to work hard and the away side came closest when goalscorer Sarr cleared the ball off the Palace goalline when the scoreline was still set at 0-0.\nThe result means the Eagles continue their good form and have lost just once in their past 13 games.\nThe Eagles were always likely to miss the presence of key player Mateta, but his absence presented a chance for forward Nketiah, who has had a stuttering time since joining Palace from Arsenal in the summer for a deal worth up to £30m.\nThe 25-year-old started just his seventh game of the Premier League season against Ipswich, and not all of those starts have been in his favoured position as a central striker.\nNketiah looked to have turned a corner before this match and scored two goals in his past two games, with strikes coming against Aston Villa and Millwall in the FA Cup.\nThe one-time England international almost had the perfect start to this match when presented with a golden chance to keep his scoring run going. Wharton played the forward through with an excellent outside-of-the-foot pass but the striker could only shoot straight at Palmer.\nNketiah linked the play relatively well and tried to get on the end of a cross from Sarr in a bright moment, but he had a quiet afternoon on the whole.\nIt was always going to take time for Palace to adapt to playing with a different forward, but with Mateta likely to be fit for the FA Cup quarter-final against Fulham, Nketiah may have to be happy with a place on the bench for that one.\nIpswich are the only side in the Premier League without a win this calendar year.\nThe away side were bold at times against Palace and had chances through Enciso and Philogene, but as with much of the game they lacked quality to find a breakthrough.\nThe loss to Palace leaves Kieran Mckenna's side five points from safety in 18th position.\nThe only real positive for Ipswich was that Delap again looked the brightest spark of a team that has struggled.\nThe striker caused problems for the Palace backline, and with England manager Thomas Tuchel watching Delap will be wondering if he is going to be called up to his first squad next week.", "url": "https://www.bbc.co.uk/sport/football/live/cy87d882300t"}