{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:47:53", "date_modify": "2025-05-20 12:47:53", "date_publish": "2023-08-03 00:00:00", "description": "Focus on Chelsea after their undefeated US tour, while NFL legend Tom Brady invests in Birmingham City and latest transfer news.", "filename": "sport_live_football_66391835_1747745273.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/AB74/production/_130629834_gettyimages-1581294074.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_football_66391835_1747745273.html", "title": "Latest transfer news: Josko Gvardiol, Rasmus Hojlund & Kylian Mbappe", "title_page": "Latest transfer news: Josko Gvardiol, Rasmus Hojlund & Kylian Mbappe - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "See you again tomorrow\nToday's shock news, other than Tom Brady linking up with Birmingham City, came in the Women's World Cup.\nTwo-time winners Germany were knocked out in the group stages after they could only draw 1-1 with South Korea, with Morocco going through as Group H runners-up following a 1-0 win over table-toppers Colombia.\nMorocco's players had an agonising wait for Germany's match to end before they could celebrate - watch the video above for their emotional reaction when the news is confirmed.\nRead the match reports below, along with some other top stories on the BBC Sport football index:\nGermany knocked out of Women's World Cup\nMorocco beat Colombia to reach last 16\nI stayed quiet on homophobia but that ends today - Ramsdale\nSheffield United sign Arsenal defender Trusty\nOxlade-Chamberlain considering Besiktas offer\nHow will relegated sides fare in the Championship?\nBrady ownership 'feels more of a sponsorship-type deal'\nBBC Radio 5 Live\nNFL legend Tom Brady's investment in Birmingham City, after being unveiled today as a minority owner, continues a recent trend.\nA number of American stars have made minority investments in English football clubs in recent months.\nFormer NFL defensive end JJ Watt became a shareholder at Burnley in May, while actor and producer Michael B Jordan invested in Bournemouth at the end of last year.\nAmerican golfers Jordan Spieth and Justin Thomas, and NBA All-Star Russell Westbrook are also minority stakeholders in Leeds United.\nThose moves followed Hollywood stars Ryan Reynolds' and Rob McElhenney's successful ownership at Wrexham.\nHowever, Christina Philippou, sports finance expert at Portsmouth University, told BBC Radio 5 Live \"time will tell\" what impact Brady would have at Birmingham City.\nShe said: \"There is a big difference between the ownership, which is effectively what we're seeing at Wrexham, where they are involved in a lot of the day-to-day running of the club, and what we're seeing here, where basically a minority ownership means you don't have much power.\n\"He's [Tom Brady] not even on the board of directors. It does feel almost more of a sponsorship-type deal rather than an ownership. Time will tell.\"\nRead the full story here.\nFive things we learned on Chelsea tour\n5. Pochettino's plan\nAlex Howell\nFootball reporter in Chicago\nIn North Carolina, during the open training session held there, Pochettino was stood in the middle of the pitch telling his players exactly where and what he wanted from them.\nThat has continued throughout this pre-season campaign and Chelsea have played with a defined 4-2-3-1. The players have interchanged positions but the high energy and high working play is the same whoever is in the side.\nPochettino said after the match against Dortmund that he played a side he thinks could potentially play the first game of the Premier League season.\nAlthough there is still a lot of work to do, he will be pleased with finishing pre-season undefeated, having won the Premier League Summer Series and leaves the USA with his squad pushing in the same direction.\nFive things we learned on Chelsea tour\n4. Ian Maatsen\nAlex Howell\nFootball reporter in Chicago\nOne of the talking points coming into this tour was that the Chelsea squad was unbalanced.\nTo prove that point, Pochettino highlighted that they had four possible left-backs in their squad, with Ben Chilwell, Marc Cucurella, Ian Maatsen and Lewis Hall all able to play that position.\nThat competition has not stopped Ian Maatsen taking his chance to impress Pochettino.\nThe 21-year-old was named in the Championship team of the year last season as he helped Burnley win the title and get promotion back to the Premier League.\nHe’s played as an attacking left winger, as a number 10 and from the right side and he also scored two goals in the opening game against Wrexham and assisted Nicolas Jackson against Newcastle.\n\"He has the capacity to compete for different places on the pitch. He is a player you can use in different positions,\" said Pochettino.\n“I am so happy because his performance didn't change. That is what makes us really pleased because he is a player we see with enormous potential for the team.\"\nFive things we learned on Chelsea tour\n3. Young players\nAlex Howell\nFootball reporter in Chicago\nPochettino challenged the young members of his squad to take their opportunity to prove to him that they should be part of his squad for next season and some of them have definitely done that.\nBashir Humprheys has started three matches and looked very comfortable when called upon. Pochettino and his staff were aware of Humphreys and his potential and have watched clips of his performances while he was on loan at Paderborn in Bundesliga 2.\nIan Maatsen and Andrey Santos have been mentioned already but both of those players look like they could be in serious contention to be part of the first team plans.\nCesare Casadei fresh from the U20 World Cup where he won the Golden Ball and Golden Boot as Italy lost in the final to Brazil has also played a lot of minutes for the first team.\nThe 20-year-old looks physically ready to deal with Premier League football and has shown a lot of examples of powerful running from deep in midfield.\nHowever, when he was put under pressure by Fulham in the game in Washington he was caught in possession in dangerous areas and he maybe needs a loan away before competing in the Premier League.\nFive things we learned on Chelsea tour\n2. Attacking positives\nAlex Howell\nFootball reporter in Chicago\nChelsea did manage to get two big signings confirmed before they came to the USA and they have quite possibly been the players of the tour.\nChristopher Nkunku, a £52m signing from RB Leipzig, and Nicolas Jackson from Villareal have been brought in to try to get the goals flowing again.\nChelsea only managed 38 goals during the last Premier League season and Pochettino will be optimistic that things will be better this time out, although there is a concern about Nkunku who limped off with a knee injury against Borussia Dortmund.\nNkunku has scored three goals in his five pre-season appearances and has also played in a number of different positions. He’s scored all of his goals while playing as a number nine and his calm finishing has been noticeable as he’s seemed to take every chance that has come his way.\nHis versatility and ability to play in the number 10 role or on either wing means he can be partnered with Jackson, something Pochettino tried again against Dortmund.\nJackson scored 13 goals in 38 appearances for Villareal last season, including nine in their final eight league games and was close to joining Bournemouth in January.\nIn the USA he has taken to the Chelsea team seamlessly, scoring two goals and getting three assists.\nHe is excellent at holding the ball up, good at running in behind defences and as well as his goals he seems able to pick the right pass in the final third.\nFive things we learned on Chelsea tour\n1. The squad\nAlex Howell\nFootball reporter in Chicago\nIt’s been just over four weeks since Mauricio Pochettino took charge of Chelsea and started a new era at Stamford Bridge.\nThe Blues have done the majority of the preparation for the new Premier League season in the USA as they played Wrexham, Borussia Dortmund and won the Premier League Summer Series.\nHere’s what we learned following them on their tour as Chelsea look to get back to winning ways this season:\nDefinition of the squad\nChelsea came to the USA with a squad of 29 players which was mainly made up of young players. This number went up to 30 after the signing of 19-year-old Lesley Ugochukwu from Rennes.\nSince the club takeover, Chelsea have looked to sign young talented players with huge potential but this had led to Pochettino calling for ‘more experienced’ players to add to his squad.\nEnzo Fernandes and Conor Gallagher are the only two senior players that Pochettino has to call on in midfield. They have been pursuing Brighton midfielder Moises Caicedo but that deal doesn't seem to be close to being completed.\nHowever, all is not negative. Andrey Santos, the Brazilian midfielder signed from Vasco da Gama in January, has impressed at the heart of midfield and started three of the five matches in the USA and could be an option for the squad.\nPochettino has said that he will cut his squad down from its enlarged size when they return to Cobham. A number of the young players will be sent on loans and there’s the possibility of some players, like Lesly Ugochukwu, being sent to Strasbourg who have the same owners.\nIt’s understood that Pochettino sees his ideal number of players in his squad to work with at 22 or 23 with young players from the academy stepping in to make up numbers and take their chances if and when they're needed.\nThat means with the club wanting as many as three new players - one in each position of defence, midfield and attack, there’s going to be a lot of transfer activity at Chelsea before the window closes.\nTrusty has athleticism and desire to succeed - Heckingbottom\nSheffield United manager Paul Heckingbottom said new centre-back Auston Trusty had the \"athleticism and desire to succeed in the Premier League\".\n\"I'm delighted we've managed to get this one over the line, it is one of the positions we've been looking to fill and it is with a permanent transfer rather than a loan,\" said the Blades head coach, after signing Trusty, 24, for a \"significant undisclosed fee\" on a four-year contract.\n\"He is at a good age to progress, he has experience having played at international level and in the Championship last year, where we monitored him and he picked up Birmingham's player of the year award.\n\"As a coaching team we feel that he has the athleticism and desire to succeed in the Premier League.\"\n'Everything has come together'\nUnited States centre-back Auston Trusty, 24, made two substitute appearances for the national team earlier this season in the Concacaf Nations League.\nHe described signing for Sheffield United on a four-year deal from Arsenal as an \"impossible dream\" after failing to make a breakthrough during 18 months at Emirates Stadium following spells in the MLS with Philadelphia Union and Colorado Rapids.\n\"In Pennsylvania, this was a dream - almost an impossible dream but I believed in myself and the opportunity has come around, it is everything that I dreamed for,\" Trusty told Sheffield United's official website.\n\"It is crazy how quick things happen in football. I have just come back from a US tour with Arsenal and a couple of days later I am sitting here doing this interview.\n\"Things did happen very quick, but that's how football works. I was really looking for an opportunity so as soon as it came about, things and details were ironed out. I am here, I wasn't wasting any time.\n\"Everything is coming to fruition for me. I am in the right place at the right time and in the right mindset. Everything has come together how I dreamed it.\"\n'Opportunity to show my ability'\nSheffield United signing Auston Trusty played twice against his new club last season while on loan at Birmingham City, where he won the club's player of the year award.\nThe United States defender helped the Midlands side to a 1-1 draw at Bramall Lane, but was on the wrong end of a 2-1 defeat at home to the Blades on the final day of the Championship campaign.\n\"I am more than excited,\" said Trusty, who scored four goals in 48 appearances for Birmingham City but never played a competitive first-team game for parent club Arsenal.\n\"The opportunity to be here at this historic club, and an opportunity to play in the Premier League and show my ability, it is everything I could have ever dreamed of growing up as a kid.\"\n'Biggest shock of tournament'\nSouth Korea 1-1 Germany\nTwo-time world champions Germany have been sent crashing out of the Women's World Cup group stages in the biggest shock of the tournament thanks to a draw with South Korea.\nIt is the first time in Germany's history they have failed to reach the knockout stages.\nOne of the pre-tournament favourites, Germany knew they needed to better Morocco's result against Colombia to progress in Group H.\nAn early goal by South Korea's Cho So-hyun shook the Euro 2022 finalists, but captain Alexandra Popp netted her fourth goal in three matches to equalise shortly before half-time.\nGermany were heading through as group runners-up as they went off the pitch for the break but Morocco stunned Colombia in the other match to take a 1-0 lead meaning Martina Voss-Tecklenburg's side had to win.\nColombia face Jamaica on Tuesday, 8 August (09:00 BST) in the last 16, while Morocco take on France (12:00 BST) on the same day.\nRead Emma Sanders' match report for more on this story.\n'I don't see this slowing down' - Saudi spending to continue\nThe Saudi Pro League's \"remarkable\" spending spree on players is set to continue, according to one of its leading executives.\n\"I think the budgets are in place for a number of years - you know, I don't see this slowing down,\" said British director Peter Hutton, who sits on the league's board.\nThe SPL has lured some of football's biggest names since five-time Ballon d'Or winner Cristiano Ronaldo joined in January from Manchester United.\nThey include former Real Madrid striker Karim Benzema, Liverpool's former captain Jordan Henderson and established players from Chelsea, Manchester City and Bayern Munich.\nIn addition, last month Al-Hilal made a world-record £259m bid for Paris St-Germain forward Kylian Mbappe.\nHutton, who has been a senior executive at Eurosport, ESPN, IMG & Facebook, said: \"I've worked in sport for 40 years and I've never seen a project as big, as ambitious and as determined to be a success.\"\nSpeaking to BBC sports editor Dan Roan in a wide-ranging interview for BBC Radio 5 Live's special 'The Saudi Story', he said it was \"not necessarily a bad thing\" if European football was not as strong as it has been.\nHutton also put the Saudi spending into context, saying \"it has got the world of sport talking but it's a quarter or a fifth of what Premier League clubs have spent this summer\".\nLISTEN: The Saudi Story - a BBC Radio 5 Live special", "url": "https://www.bbc.com/sport/live/football/66391835"}