{"authors": ["Ronny Costello", "www.facebook.com"], "date_download": "2025-05-21 05:48:43", "date_modify": "2025-05-21 05:48:43", "date_publish": "2025-01-14 12:05:52", "description": "Dundee United fan column: 'Dramatic & unpredictable festive run keeps dreams alive'", "filename": "sport_articles_c3w8qz7v9zyo_1747806523.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8f7b/live/d2901070-d253-11ef-94cb-5f844ceb9e30.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c3w8qz7v9zyo_1747806523.html", "title": "Dundee United fan column: 'Dramatic & unpredictable festive run keeps dreams alive'", "title_page": "Dundee United fan column: 'Dramatic & unpredictable festive run keeps dreams alive'  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ah, the life of a Dundee United supporter, there's never a dull moment!\nLet's take a wee jaunt through our recent escapades of seven games in 20 days which started with a big point against runaway league leaders Celtic...\n22 December 2024: Dundee United 0-0 Celtic\nWe hosted the league leaders at Tannadice and, in true festive spirit, gifted them... absolutely nothing! A defensive masterclass saw us hold Celtic to a goalless draw, much to their frustration. Our lads were as unyielding as a Scotsman refusing to pay for a round.\n26 December 2024: St Johnstone 1-2 Dundee United\nBoxing Day brought a trip to Perth, where we unwrapped a 2-1 victory against St Johnstone. The team showed more determination than a bairn trying to stay awake for Hogmanay. Goals from Middleton and Dalby ensured the Saints were left singing the blues.\n29 December 2024: Dundee United 1-0 Aberdeen\nBack at Tannadice, we edged out the anti-Goodwin brigade from Aberdeen with a 1-0 win. It wasn't the most glamorous affair, but as any Dundonian knows, sometimes a simple pie and beans hits the spot better than fancy fare. Our defence was tighter than a hipster's jeans, securing a clean sheet.\n2nd January 2025: Dundee 1-2 Dundee United\nAh, the New Year derby. A time when families are divided, and so was the scoreline. We marched into Dens Park and claimed a 2-1 victory, proving that the city is still tangerine. The atmosphere was electric, and our winning goal sparked celebrations that probably registered on the Richter scale... I was upside down at one point!\n5 January 2025: Dundee United 0-1 Hearts\nNot all stories have happy endings and this was easily our worst performance of the run. It was a bit like trying to deep-fry a Mars bar that's just too big for the fryer. Frustrating and ultimately unsuccessful.\n8 January 2025: Celtic 2-0 Dundee United\nOn the back of losing a game and the players running on empty, what you need is a trip to Parkhead. We were not embarassed, far from it and I doff thy cap to the fans who made if through on a freezing cold Wednesday night at £37 a ticket...\n11 January 2025: St Mirren 0-1 Dundee United\nThe seventh game in 20 days took us back west as we travelled to Paisley and pocketed a 1-0 win against St Mirren. The late goal-scoring juggernaut that is Dundee United struck again, with Louis Moult rolling back the years with a terrific overhead kick effort to claim a fourth win this season over the Buddies... we must get to keep them now, no?\nIn summary, it's been a period of grit, determination, and a fair share of drama. With four wins, a draw, and two defeats, the players have shown they're made of stern stuff.\nAs we look ahead, let's keep the faith and remember... in football, as in life, it's not just about the destination but the glorious, unpredictable journey as the shed go marching on, on, on!", "url": "https://www.bbc.com/sport/articles/c3w8qz7v9zyo"}