{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:58:25", "date_modify": "2025-05-20 12:58:25", "date_publish": "2023-08-02 16:55:45", "description": "Stoke City sign defender Luke McNally on a season's loan from promoted Premier League side Burnley.", "filename": "sport_football_66388658_1747745905.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0F97/production/_130619930_lukemcn.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66388658_1747745905.html", "title": "Luke McNally: Stoke City sign Burnley defender on season's loan", "title_page": "Luke McNally: Stoke City sign Burnley defender on season's loan - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Stoke City have made their 11th summer signing by bringing in defender Luke McNally on a season's loan from promoted Premier League side Burnley.\nWhile Burnley were winning automatic promotion last season, the 23-year-old centre-back spent the second half of the campaign on loan at Coventry City.\nHe was on the losing side just twice, one of them being their 4-0 home defeat by Alex Neil's Stoke in April.\nStoke also tried to sign him during the January transfer window.\n\"Luke is a player we have been interested in for some time, having initially made contact with Burnley in January,\" said technical director Ricky Martin.\n\"We weren't surprised to see Luke consistently perform at a high level in the Championship during his loan at Coventry and we are delighted to have now recruited him at a time when he will only be better for that experience.\"\nStoke, 16th in last season's Championship, start the 2023-24 campaign with a home game against Rotherham United this Saturday.\nFormer Republic of Ireland Under-19 international McNally arrives just three days before the start of the new season.\nHe follows the arrival of defender Enda Stevens, Bournemouth midfielder Ben Pearson and keeper Mark Travers, Coventry defender Michael Rose, Preston midfielder Daniel Johnson, Portuguese striker Andre Vidigal, Wolves duo Ki-Jana Hoever and Chiquinho and strikers Wesley from Aston Villa and Ryan Mmaee from Ferencvaros.", "url": "https://www.bbc.com/sport/football/66388658"}