{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:54:12", "date_modify": "2025-04-26 06:54:12", "date_publish": "2025-02-28 16:11:35", "description": "Fenerbahce say Jose Mourinho is filing a lawsuit against Galatasaray after the rival club accused him of making racist statements.", "filename": "sport_football_articles_cjry7dj9v2po_1745650452.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/bf74/live/2b0b9100-f5ec-11ef-bd6e-cd71c2e1454a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cjry7dj9v2po_1745650452.html", "title": "Jose Mourinho: Fenerbahce manager files lawsuit against Galatasaray after Istanbul derby", "title_page": "Jose Mourinho: Fenerbahce manager files lawsuit against Galatasaray after Istanbul derby - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Jose Mourinho has filed a lawsuit against Galatasaray after the club accused him of making racist statements.\nThe Fenerbahce manager was accused by Galatasaray of making racist statements after Monday's Istanbul derby and, on Tuesday, the Portuguese's Turkish club released a statement saying his comments had been taken \"completely taken out of context\".\nOn Friday, Fenerbahce said Mourinho was filing a 1,907,000 Turkish Lira lawsuit, through the club's lawyers, against Galatasaray \"due to the attack on the personal rights\" of the Portuguese coach.\nThe amount - which is worth around £41,000 - is symbolic as 1907 is the year Fenerbahce Sports Club was founded.\nSpeaking in the news conference after Monday's 0-0 draw, Mourinho said the home bench had been \"jumping like monkeys\" and also repeated his criticism of Turkish referees, saying it would have been a \"disaster\" to use an official from the country.\nThe match was refereed by Slovenian Slavko Vincic after both clubs requested a foreign official take charge of the fixture.\nOn Thursday, Mourinho was banned for four games and fined a total of £35,194 by the Turkish Football Federation for two separate disciplinary matters.\nThe TFF said it was penalising him for \"his derogatory and offensive statements towards the Turkish referee\" and because he \"accused Turkish football of chaos and disorder with insulting and offensive statements towards both the Turkish football community and all Turkish referees\".\nHis comments included him saying that \"after the big dive in the first minute and their bench jumping like monkeys on the top of the kid... with a Turkish referee you would have a yellow card after one minute and after five minutes I would have to change [substitute] him\".\nThe TFF said \"the statements used towards the members of the opposing team were contrary to the ethics of sports and the concept of fair play, contained expressions that could encourage violence and disorder in sports, were divisive and separatist in society and could cause fan incidents\".", "url": "https://www.bbc.co.uk/sport/football/articles/cjry7dj9v2po"}