{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:52:55", "date_modify": "2025-04-26 07:52:55", "date_publish": "2025-02-25 14:30:04", "description": "Portsmouth captain Matt Ritchie says he always felt the squad was capable of staying in the Championship after his side moved nine points clear of trouble.", "filename": "sport_football_articles_cj3nenmz54vo_1745653975.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e2b6/live/f11d1010-f37d-11ef-958e-8b9bf28c4572.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cj3nenmz54vo_1745653975.html", "title": "Matt Ritchie: Portsmouth captain always confident squad was good enough to stay up", "title_page": "Matt Ritchie: Portsmouth captain always confident squad was good enough to stay up - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Portsmouth's brilliantly-timed run of form is both delighting their fans and starting to convince many observers that Championship survival is theirs for the taking.\nFor Matt Ritchie it was never seriously in doubt.\nSaturday's 2-1 win against Queens Park Rangers was Pompey's third in a row and took John Mousinho's side nine points clear of the relegation zone with 12 games to go.\nJust over a month ago, Portsmouth were next to bottom after suffering a fourth defeat in five at Blackburn.\nThat came after a start to the season that saw Mousinho's team win only one of their first 14 games and among the favourites to make an immediate return to League One.\n\"We certainly didn't feel that internally,\" Ritchie told BBC Radio Solent. \"We felt like we had enough.\n\"There were obviously some lessons we had to learn quickly and, certainly for me personally, there wasn't one moment when I thought 'I'm not sure we've got enough here'.\n\"I think we can play different ways and adapt.\"\nRitchie's third goal of the season put Pompey 2-0 up against the Hoops and although Jimmy Dunne halved the deficit with 15 minute to go, Portsmouth held on for another vital victory.\n\"It's a big win and three more points in trying to achieve Championship status for next season - that's the objective,\" Ritchie said, before adding he \"hadn't scored enough tap-ins\" in his career.\nWith a trip to bottom-club Luton up next on Saturday, before the unenviable task of trying to upset leaders Leeds a week later, Pompey have a decent chance to extend that winning run to four.\nBut Ritchie underscored the value in staying grounded, despite their winning form.\n\"We have to stay with our feet on the floor,\" he said. \"We had a nice run but the margins in those games have been so small. We have to make sure we continue to take care of the small moments.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cj3nenmz54vo"}