{"authors": ["Lauren McCann", "www.facebook.com"], "date_download": "2025-05-21 07:47:24", "date_modify": "2025-05-21 07:47:24", "date_publish": "2025-03-28 07:46:29", "description": "Northern Ireland boss Tanya Oxtoby says her side won't \"shy away\" from admitting their aim is six points in their Nations League double-header against Romania.", "filename": "sport_football_articles_c78e2x4xw83o_1747813644.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f0f6/live/f589a190-0aed-11f0-bf59-3b6bbdd820ea.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c78e2x4xw83o_1747813644.html", "title": "Northern Ireland: Tanya Oxtoby targeting six points in Romania double-header", "title_page": "Northern Ireland: Tanya Oxtoby targeting six points in Romania double-header - Oxtoby - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Northern Ireland boss Tanya Oxtoby said her side won't \"shy away\" from admitting their aim is six points in their Nations League double-header against Romania.\nRomania are bottom of Group B1 after two defeats in their first two games against Bosnia-Herzegovina and Poland.\nThey welcome NI to Bucharest on Friday 4 April before a return game at Windsor Park four days later, with Oxtoby targeting two wins to keep her side in the mix for promotion to League A.\n\"People look at it on paper and think there are maybe easy games in this group, there are not. You look at Romania's two performances in the last window, they were sensational,\" she said.\n\"I think they will be a really tough test for us, but the aim is six points, we aren't going to shy away from that.\"\nOxtoby has made two changes from last month's squad with Glentoran's Aimee Kerr earning a first call-up and the uncapped Abi Sweetlove also included.\nBoth players join Keri Halliday and Kascie Weir in transitioning from the under-19 squad to the senior set-up in recent months.\nOxtoby believes that bringing through young players is necessary to increase the player pool.\n\"We're showing the pathway is there, if you are consistently performing you will get an opportunity.\n\"By all accounts the way that Abi and Aimee have gone about things in their underage group level they seem like they're ready in terms of maturity and what they are going to bring to the group, they have no fear which is a good attribute to bring,\" she explained.\n\"We need depth in all positions and to expose players to our environment and we've been pleasantly surprised by the younger players coming in, it gives us competition for places.\"\nOxtoby admits it can be difficult to integrate a number of young players all at once especially when trying to pick up wins at the same time.\n\"It's a balancing act; we need to get results in this window but also good exposure for our young players.\n\"We need to make sure when we're looking at the younger players that technically they are proficient, tactically do they understand what it is we want them to do and will they be ready for senior international football, you won't know that until they are in the squad.\"\nNorthern Ireland are second in the group after a 2-0 defeat against Poland and a last-gasp 3-2 comeback win against Bosnia-Herzegovina in the last window.\nOxtoby conceded that her side were architects of their own downfall in the goals shipped in both games, something she knows they must improve on.\n\"This group has shown me the grit and determination; they have given me a heart attack, but they have also been able to pull results out of the bag too and we want to build on that and get some real momentum in this window,\" she added.\n\"Across both games we created our own issues, and we have to be better, but this group wants to be better, and they've taken accountability for that.\n\"When we have those [defensive] lapses, we get punished so we need to push towards a full 90-minute performance.\"\nThe Australian boss is also pleased that Northern Ireland will return to Windsor Park for the home game against Romania.\nLarne's Inver Park hosted NI's Euro play-off first leg defeat against Norway in December and last month's dramatic win against Bosnia-Herzegovina.\n\"To exploit certain spaces the size of the pitch helps, grass surface as well, we're really looking forward to being back there.\n\"We're pretty comfortable there, we have had some amazing times there and the pitch will help us with our style of play.\"", "url": "https://www.bbc.com/sport/football/articles/c78e2x4xw83o"}