{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:28:53", "date_modify": "2025-05-21 05:28:53", "date_publish": "2025-01-14 15:23:17", "description": "Scotland captain Rachel Corsie suffers 'frustrating' setback with calf injury", "filename": "sport_articles_cd64ve57nyzo_1747805333.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1310/live/500fb060-d28a-11ef-87df-d575b9a434a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cd64ve57nyzo_1747805333.html", "title": "Corsie suffers 'frustrating' setback with calf injury", "title_page": "Scotland captain Rachel Corsie suffers 'frustrating' setback with calf injury - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Scotland captain Rachel Corsie has suffered a setback on her return from injury after picking up a calf strain.\nThe Aston Villa defender missed both sets of play-offs for the national team against Hungary and Finland after undergoing surgery on her knee.\nThe 35-year-old was on track to make her return to Villa's squad this weekend as the Women's Super League resumes after the winter break, but her stint on the sidelines will continue after feeling a niggle in her calf last week.\n\"The knee is feeling really, really good, but unfortunately, I picked up a bit of a calf injury at the end of last week,\" Corsie said on the BBC's Behind the Goals podcast.\n\"I was primed and almost due to be back in the squad for this weekend, so that was really, really disappointing but it's one of these things.\n\"Calves are quite often tricky, and age plays into that too. We're probably only five days on from first feeling it so this first week, it's important to try and be as slow as possible and let it heal. That'll give me the best chance to try and be out for as little time as possible.\n\"I hate doing as little as possible so the last couple of days have been a challenge.\"\nCorsie went under the knife at the beginning of October and admitted it's been \"a tough journey\".\n\"The knee has been really tough, it's been so frustrating,\" she added.\n\"I've had a lot of knee surgeries, a lot of rehabs but I've always found with rehab, it's a process of diligence and hard work and that gets you there, but this time there was a lot of additional pain. It's been a real tough journey.\n\"I finally got to a place where I felt really, really good and that was really nice and then I've just picked up this little niggle. Hopefully not too long, but unfortunately back on the treatment table.\"", "url": "https://www.bbc.com/sport/articles/cd64ve57nyzo"}