{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:18:42", "date_modify": "2025-05-20 13:18:42", "date_publish": "2023-08-02 11:24:07", "description": "Reading's owners are looking for new investors to provide financial stability at the club following a period of major unrest.", "filename": "sport_football_66381677_1747747122.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/C315/production/_130614994_gettyimages-1247464958.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66381677_1747747122.html", "title": "Reading FC: Owners looking for new investors to provide financial stability", "title_page": "Reading FC: Owners looking for new investors to provide financial stability - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Reading's owners are looking for new investors to provide financial stability at the club.\nThe League One side were put under a fresh transfer embargo by the English Football League at the end of July for failing to pay taxes on time.\nThey had only just had a long standing two-year embargo lifted and the club was served a winding-up petition over unpaid taxes in June.\nReading say owner Dai Yongge remains fully committed to the club.\n\"Both he [Mr Dai] and chief executive Dayong Pang have been extremely active in trying to establish a sustainable source of financial backing for the football club,\" Reading said in a statement., external\n\"Despite ongoing complex cashflow constraints - related in part to the intense and protracted effects of the global pandemic which continue to impact business in China - the full wage bill has been satisfied for both players and staff at the end of the month.\"\nA BBC Sport investigation into the club revealed issues with getting money out of China and into the UK.\nReading say a recent late payment to HM Revenue & Customs which put the club back under a transfer embargo is due to be \"personally resolved\" by Mr Dai in the coming days.\nUnder the current embargo the Royals can still make signings but are limited to bringing in free agents on the maximum of a one-year deal or players on loan for half a season, up to having 23 in the squad.\nBefore the club was sanctioned, new head coach Ruben Selles said he needed at least 10 more new players to complete his squad ahead of Saturday's opening League One match at home to Peterborough.\nReading have made four signings this summer.\nThe Royals are calling for calm despite ongoing protests from fans who formed a pressure group called Sell Before We Dai.\n\"We sincerely appreciate our fans' patience and ongoing support throughout our recent challenges,\" the club continued in its statement.\n\"The new football season begins at home against Peterborough United on Saturday, 5 August and we trust that the manager, his staff and the players can count on your support from the stands as we look to get our League One campaign off to a winning start on home soil.\"", "url": "https://www.bbc.com/sport/football/66381677"}