{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:25:46", "date_modify": "2025-04-26 06:25:46", "date_publish": "2025-02-28 21:42:35", "description": "A Matt Currie hat-trick helps Edinburgh to a 34-28 victory over Munster at Musgrave Park.", "filename": "sport_articles_cx2r0y9l9r1o_1745648746.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c350/live/29ee8770-f61c-11ef-a416-3b7c7b93a27e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cx2r0y9l9r1o_1745648746.html", "title": "United Rugby Championship: Munster 28-34 Edinburgh", "title_page": "United Rugby Championship: Munster 28-34 Edinburgh - Sean Everitt's side back in play-off places with Munster win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A Matt Currie hat-trick helped Edinburgh to a 34-28 victory over Munster at Musgrave Park.\nWith the game played in Cork rather than Thomond Park, Sean Everitt's side became the first United Rugby Championship (URC) visitors to Munster's lesser used home ground to win since 2019.\nBacked by a dominant scrum, Edinburgh had their four-try bonus point wrapped up by half-time and were deserving winners despite Munster closing the gap late on.\nThe hosts, in the first game since it was confirmed Clayton McMillan will take charge next season, secured two bonus points in defeat through Sean O'Brien's late try and Billy Burns' subsequent conversion.\nThe win lifts Edinburgh into sixth place in the standings, one place and three points behind Munster.\nFly-half Ross Thompson struck the first points of the game from a penalty after his side earned a scrum penalty.\nThe visitor's dominance at the set-piece became a theme of the game but Munster did take a brief lead shortly after.\nAttacking off a backpedalling scrum, Brian Gleeson carried strongly off the base before centre Alex Nankivell finished strongly.\nThat was to be as good as it got for Munster, however.\nEdinburgh's response came after back rows Ben Muncaster and Magnus Bradbury both displayed good power before putting Thompson across the whitewash for the side's first try.\nIt was after yet another dominant scrum that they got their second, scrum-half Ben Vellacot kicking over the top with penalty advantage before McCarthy misjudged the bounce allowing Currie to get in for the try.\nThe wing had his second soon after, doing well to finish despite the attention of Nankivell who tried to get underneath the ball.\nAnd in the final play before half time, Edinburgh had their bonus-point try when, after another scrum penalty, Currie picked a brilliant line off the subsequent line-out and offloaded to send Bradbury underneath the posts.\nMunster turned to Alex Kendellen and Stephen Archer at the break, although the first scrum of the half again brought about another Edinburgh penalty.\nThe hosts were struggling to get any foothold in the game but scored an opportunistic try after Josh Wycherly charged down Thompson and Nankivell went over for his second.\nThey could not build any momentum off that try, however, and after more hesitant play in the Munster backfield, Currie collected the loose ball and completed his hat-trick.\nIf that score felt as if they made the result safe, Ben O'Connor's try with 15 minutes remaining set up Munster's chase for both losing and four-try bonus points.\nAided by Paddy Harrison's late yellow card for a high tackle, Munster would earn both through Sean O'Brien's last-gasp try and Burns' conversion to narrow the final deficit to six points.", "url": "https://www.bbc.co.uk/sport/articles/cx2r0y9l9r1o"}