{"authors": ["Sonia Oxley", "www.facebook.com"], "date_download": "2025-05-21 06:34:20", "date_modify": "2025-05-21 06:34:20", "date_publish": "2025-03-31 05:52:05", "description": "How an initially \"terrible\" first practice in Canada evolved into the creation of Britain's most successful ice dancers since Torvill and Dean.", "filename": "sport_articles_cqj4lpxpywvo_1747809260.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cfff/live/572e5150-0dcf-11f0-8fcf-7ff66f5198a2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cqj4lpxpywvo_1747809260.html", "title": "Lilah Fear & Lewis Gibson's journey to World Championship ice dance bronze medal", "title_page": "Lilah Fear & Lewis Gibson's journey to World Championship ice dance bronze medal - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "When Lilah Fear and Lewis Gibson first trained together in Montreal a decade ago, even their coach did not let them know exactly how badly it had gone.\nFear was a junior ice dancer but Gibson was new to the discipline.\nHe had been a singles skater but turning jumps into jives is not an overnight job.\nNow they are the first British figure skaters to win a medal at a World Championships since Jayne Torvill and Christopher Dean in 1984 after taking bronze on Saturday.\nBBC Sport takes a look at how an initially \"terrible\" first practice in Canada evolved into the creation of Britain's most successful ice dancers in a generation.\nFear and Gibson train at the Ice Academy of Montreal, where many of the top couples practise and whose skaters account for nine of the past 10 World Championship gold medals in ice dance.\nFear describes the environment as a \"creative, collaborative and competitive\".\n\"I think the word that comes to mind is motivating because we are training alongside our top competitors,\" the 25-year-old told BBC Sport earlier this year. \"And when you see what material they have and what they're working on, it forces everyone around them to elevate their game.\n\"We support one another, we're all friends, we're encouraging. And it's just a really very special environment. And I wouldn't trade it for the world.\"\nIt was there that they teamed up with renowned coach Romain Haguenauer - and it was he who did not let on his real thoughts on what 30-year-old Gibson has described as a \"terrible\" first practice session together in Montreal.\n\"[There were] some little passive jokes perhaps but we always felt his belief and his encouragement for us to really want to try and go as far as we could,\" Gibson said previously.\n\"That has really instilled a hard work ethic in us and also where we want to get to in the sport, it just seems that the possibilities are endless, and I think that really came from him.\"\nHaguenauer is also the coach of Americans Madison Chock and Evan Bates, who won their third successive world title this year.\nA talented artist, who loves interior decorating, DIY and drawing, Gibson has also been able to channel creativity on to the ice – something that has been actively encouraged by Haguenauer.\nAccording to Fear, their coach will always say \"why not?\" to new ideas.\nLike Gibson, Fear is also highly creative, this year designing her own dress for their free dance.\nIn that context, it was no surprise that they bucked the trend and went for a fun disco-style free dance in 2018-19 while many of their rivals were skating to more serious classical numbers.\nThe crowds got on board with the 'Disco Brits' and their scores began to rise, winning the national championships and placing sixth at the Europeans that season.\nOver the years Fear and Gibson have been known for their high-energy performances that have delighted crowds because they always look like they are having fun with their best friend.\nThey really are.\nGibson has spoken in the past of his enjoyment of performing – be it dancing with his dad or posting light-hearted social videos.\nIt was that aspect of ice dance, coupled with a struggle to consistently perform the big jumps in single and pairs skating, that persuaded him to switch disciplines in 2015 at the age of 21.\nHe had been a late starter in figure skating, only taking it up at the age of 11, and even though he was a natural – he raced through three badges in one of his first beginner sessions – he was not qualifying for the biggest events in singles.\nIn their first season together in 2016-17, he and Fear won the British ice dance title and qualified for the European Championships.\nAway from the ice, Fear enjoys performing behind the microphone, either singing or presenting podcasts.\nA psychology student with a thirst for learning, she presents and edits her own podcasts where her interview subjects range from athletes to authors to entrepreneurs.\n\"I just really have felt the power of role models in my own life, [Canadian Olympic ice dance champion] Tessa Virtue really inspired me in this sport and the belief in myself,\" she said. \"And I want to be able to give that to people in a variety of crafts from all over the world to share stories and just spark something in my listeners.\"\nGibson has been a guest on her show, revealing his love of haggis and fudge and how he has the latitude and longitude coordinates of his home town - Prestwick in Scotland - tattooed on his shoulder.\nSuccess at the World Championships has come at the ideal time with next year's Winter Olympics in Milan-Cortina looming large.\nSince finishing 10th in at the 2022 Beijing Games, Fear and Gibson have made no secret of their ambition to reach the podium in Italy for a first British Olympic figure skating medal since 1994.\nThat was a bronze for Torvill and Dean, 10 years after their famous gold, and the skating legends have often sent messages of encouragement to three-time European medallists Fear and Gibson over the years.\nTorvill and Dean have said they hope there is now a new couple who can take British ice dance forward after shouldering that job themselves for so many decades.\n\"Hopefully this will stir up momentum,\" Dean told BBC Sport last month.\n\"Success breeds success but you've got to have somebody doing that to begin with and hopefully that's what Lilah and Lewis can do for the future of British ice skating.\n\"We've been skating for together for 50 years and, you know, maybe they can see their future for another 50 years - that might shock them if they thought like that!\"", "url": "https://www.bbc.com/sport/articles/cqj4lpxpywvo"}