{"authors": ["Richard Petrie", "Stephen Watson", "www.facebook.com"], "date_download": "2025-05-21 05:28:01", "date_modify": "2025-05-21 05:28:01", "date_publish": "2025-01-14 16:31:52", "description": "Jeremy McWilliams tells BBC Sport NI that he is excited by the challenge of coming back to his roots by competing in the Ulster Superbike Championship in 2025.", "filename": "sport_motorsport_articles_cn7gmp24vzmo_1747805281.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7b45/live/03f2ba10-d28f-11ef-9b53-b56bc9bcdc17.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_motorsport_articles_cn7gmp24vzmo_1747805281.html", "title": "Jeremy McWilliams: Sixty-year-old motorcycle racer has 'spark' for new challenge in 2025", "title_page": "Jeremy McWilliams: Sixty-year-old motorcycle racer has 'spark' for new challenge in 2025 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "At a stage of life when many people are thinking of finding ways to slow things down, sixty-year-old former MotoGP rider Jeremy McWilliams is raring to go for a new high-speed challenge on two wheels in 2025.\nThe Glengormley motorcycle racer, who has raced across the world during a lengthy and distinguished career, has decided to go back to his roots to compete in a full season of the Ulster Superbike Championship on short circuits with the Northern Ireland-based JMC Racing team.\nMcWilliams' accomplishments include a victory in the 2001 Dutch world championship 250cc round at Assen, competing at the highest level of the sport in the MotoGP class, and also in World Superbikes and British Superbikes.\nSince making his debut at the North West 200 road race in 2012, he has racked up a total of 13 podium finishes, including three race wins in the Supertwins class.\nMcWilliams' racing programme in the USA in recent years has included taking victory in the King of the Baggers event at the famous Daytona circuit in 2022.\n\"I've decided to come back to my grassroots. I dipped my toe in at the end of 2024 and really enjoyed it running with Jason [McCaw, JMC Racing team owner] and the team.\n\"To be part of a professional set-up like that, which is even bigger this year, bringing new guys on board and new machinery, it gave me that spark to get back racing here in the Ulster Superbike Championship.\"\nMcWilliams will have Superbike, Supersport and Supertwin machinery at his disposal for his forthcoming campaign.\n\"I've got three different bikes and three different classes to choose from so it's about finding what's the best focus and where we fit in best.\n\"It means a lot to be competitive and enjoy racing. That's the focus to go out and be as competitive as possible on the two tracks that we've got, Kirkistown and Bishopscourt.\n\"It's a wake-up call for me, jumping back on a big bike against guys who are circuit specialists. I want to start in a strong way and see how it goes.\nThe veteran racer's longevity is illustrated by the fact that he is now \"racing against some of the guys I used to race against\". He remains as enthusiastic as ever.\n\"Racing is a lot of fun, you get together with your friends, put a bit of effort into it and try and come away with a result.\n\"The times I've been off the bike I've missed that competitive side of it so I much prefer being on this side of the fence.\n\"I'll be putting all my effort into putting a good show on and being right there at the front of the bunch. The last couple of years I've been competitive in America so there's no reason why I shouldn't be competitive here.\"\nHe will be joined in the JMC Racing team by Andy Reid and Carl Phillips.\nMcWilliams is also expected to return to the North West 200 in May, although a deal for that is not quite finalised yet.\n\"The North West 200 is just such a big event, such a fantastic atmosphere.\n\"Sitting on the grid on 2024 with that fantastic weather, with all those great people about, it's just something special.\"", "url": "https://www.bbc.com/sport/motorsport/articles/cn7gmp24vzmo"}