{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:33:38", "date_modify": "2025-05-21 07:33:38", "date_publish": "2025-01-13 17:25:39", "description": "Norwich City have triggered a clause in Anis Ben Slimane's loan deal from Sheffield United to make the midfielder's move permanent", "filename": "sport_football_articles_ce8ydyedje1o_1747812818.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/961c/live/40bfdae0-d1d1-11ef-858a-3ffeee956fe5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ce8ydyedje1o_1747812818.html", "title": "Anis Ben Slimane: Norwich City sign Sheffield United player for undisclosed fee", "title_page": "Anis Ben Slimane: Norwich City sign Sheffield United player for undisclosed fee - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Norwich City have activated a clause in the loan deal for Anis Ben Slimane that makes his move from Sheffield United permanent.\nThe Tunisia international has featured 21 times for the Canaries in the Championship since switching from the Blades in the summer, scoring twice.\nAnd he was a key player until an ankle ligament injury sustained against Luton Town on New Year's Day ruled him out for up to a month.\nNorwich announced, external that Slimane had signed a \"long-term\" contract and he told the club website: \"It's a big relief. I've really enjoyed the first six months at the club.\"\nHe has moved to Carrow Road for an undisclosed fee.\nSporting director Ben Knapper added: \"He's a great age, has slotted seamlessly into our environment, and his performance level since he's been with us has been really good. He fits well into the way that we want to play, and he's someone that we are happy to secure permanently.\n\"He has quickly established himself as a key figure amongst our group and we're looking forward to getting him back as soon as we can to help us achieve our goals in the future.\"\nFellow loanee Kaiden Gordon has, however, been recalled from his spell at Carrow Road by parent club Liverpool.\nNorwich are 11th in the Championship and will be away to Sheffield United on Saturday.", "url": "https://www.bbc.com/sport/football/articles/ce8ydyedje1o"}