{"authors": ["Katie Stafford", "www.facebook.com"], "date_download": "2025-05-21 03:49:59", "date_modify": "2025-05-21 03:49:59", "date_publish": "2025-04-07 11:39:18", "description": "Mikel Arteta press conference: Arsenal vs Real Madrid preview", "filename": "sport_football_articles_c62gzrm62r2o_1747799399.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/adba/live/e81c39a0-4842-11ef-96a8-e710c6bfc866.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c62gzrm62r2o_1747799399.html", "title": "Mikel Arteta press conference: Arsenal vs Real Madrid preview", "title_page": "Mikel Arteta press conference: Arsenal vs Real Madrid preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "There are no new injury concerns, with Arteta hopeful Jurrien Timber will be fit enough to play. Bukayo Saka \"is in a good position\" after building up his minutes over the past week.\nArteta said Arsenal have found a solution to Gabriel's absence but did not disclose who or what that may be.\nOn what he wants to see from his team: \"We are super convinced that at 20:00 on Tuesday we are ready to win and beat them. It's been 20 years since we have had this type of game so it is a great opportunity to build our own story. This is what we are here for.\"\nHe said it is \"100% a joy\" to be involved \"in a game of such magnitude\" and occasions like Tuesday's are one of the main reasons he went into management.\nOn needing a bit of luck against the Spanish giants after a rather \"unlucky\" season: \"I think we deserve it but we have to earn it. We are going to put all the ingredients in our hand to take the game in the direction we want.\"\nHis message to the fans: \"We will need our people to play every single ball with us. We need the home stadium to create special atmosphere to generate momentum. Play the game with us, don't just watch it. The confidence that can give you, there is nothing that can replicate that.\"\nHe acknowledged the \"danger\" that Real Madrid possess and how they \"can create those moments\" to turn games around, adding: \"It is something we have to prevent, for sure.\"", "url": "https://www.bbc.com/sport/football/articles/c62gzrm62r2o"}