{"authors": ["Andrew Benson", "www.facebook.com"], "date_download": "2025-04-26 04:16:22", "date_modify": "2025-04-26 04:16:22", "date_publish": "2025-03-04 09:28:23", "description": "Ferrari win a court case that blocks their former technical director Enrico Cardile from starting work at Aston Martin until July.", "filename": "sport_formula1_articles_clynx9lmrlno_1745640982.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4b2b/live/93fba930-f8d9-11ef-9628-add78e51db09.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_formula1_articles_clynx9lmrlno_1745640982.html", "title": "Ferrari win case to delay Enrico Cardile's start at Aston Martin", "title_page": "Ferrari win case to delay Enrico Cardile's start at Aston Martin - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Ferrari have won a court case in Italy that blocks their former technical director Enrico Cardile from starting work at Aston Martin until 18 July.\nCardile left Ferrari for a new role as chief technical officer at Aston Martin in July and the two teams have been in dispute about his start date ever since.\nA statement by Ferrari said Cardile was \"already violating the non-compete commitment with Ferrari\".\nThe team said the ruling was made by a judge in a court in Modena \"a few weeks ago\".\nThe statement said that the purpose of the relevant clause in Cardile's contract was \"precisely to prevent other F1 teams from gaining an unjustified competitive advantage by hiring Cardile earlier than allowed, causing irreparable harm to Ferrari\".\nAn Aston Martin statement said: \"This is a matter between Enrico and Ferrari and their legal representatives in Italy, and the parties continue to be engaged in the process.\n\"As such we won't be making any further comment. We will make an announcement in due course.\"\nFerrari's legal victory means Cardile will not be available to start work at Aston Martin until long into the development phase of the team's 2026 car.\nF1 is introducing new chassis and engine regulations together in 2026 in one of the biggest rule changes in the sport's history.\nCardile's signing was one of a series of major changes at Aston Martin as owner Lawrence Stroll seeks to turn his team into world title contenders.\nAdrian Newey, the legendary former Williams, McLaren and Red Bull designer, started work as managing technical partner of Aston Martin on 3 March.\nNewey, regarded as the greatest designer in F1 history, has begun work in time to have a significant input into the 2026 car.\nUnder F1 rules, teams were not allowed to start aerodynamic work on their 2026 cars until the start of this year.\nIn 2026, Aston Martin will become Honda's factory engine partner, having been a Mercedes customer since the team was renamed for the historic sports car brand in 2022, and for many years before that in its previous guises as Racing Point and Force India.\nThe team started working in a new factory last year, a new driver-in-the-loop simulator was inaugurated this winter, and a new wind tunnel has been built and is expected to be ready for research and development work in the coming weeks.", "url": "https://www.bbc.co.uk/sport/formula1/articles/clynx9lmrlno"}