{"authors": ["Mandeep Sanghera", "www.facebook.com"], "date_download": "2025-05-21 07:14:58", "date_modify": "2025-05-21 07:14:58", "date_publish": "2025-05-20 11:11:13", "description": "Leicester news: How can Premier League refer Foxes over alleged EFL financial breach?", "filename": "sport_football_articles_c98pp3yznreo_1747811698.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6271/live/434f4ee0-3567-11f0-82d2-d9e1e4b55ad9.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c98pp3yznreo_1747811698.html", "title": "Leicester news: How can Premier League refer Foxes over alleged EFL financial breach?", "title_page": "Leicester news: How can Premier League refer Foxes over alleged EFL financial breach? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Leicester won an appeal in September 2024 against an alleged breach of Premier League PSR rules for the 2022-23 season.\nAn independent panel found the Premier League did not have the jurisdiction to punish the Foxes as the club had been relegated to the Championship when their accounting period ended on 30 June 2023.\nThe Premier League said at the time it was \"surprised and disappointed\" by the panel's decision, while Leicester said the club had \"simply sought to ensure that the rules are applied based on how they are actually written\".\nThe Premier League then tightened its rules, external, external in April so that clubs were still bound by its rules even if they were relegated.\n\"The alleged breach relates to the assessment period concluding at the end of the 2023/24 season, when the club was a member of the EFL Championship,\" said a Premier League statement on Tuesday.\n\"The tribunal confirmed that the Premier League has the power to investigate an alleged breach of the P&S Rules [PSR] because the EFL validly transferred responsibility for its investigation to the Premier League in June 2024, when the club was promoted from the Championship.\n\"The Premier League continues to have jurisdiction even though Leicester City will be relegated to the Championship at the end of this season.\"", "url": "https://www.bbc.com/sport/football/articles/c98pp3yznreo"}