{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:38:54", "date_modify": "2025-05-21 03:38:54", "date_publish": "2025-04-08 00:00:00", "description": "Dan James scores after two minutes as Leeds United win at Middlesbrough to move back to the top of the Championship.", "filename": "sport_football_live_cwy64gg7nl9t_1747798734.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cwy64gg7nl9t_1747798734.html", "title": "Middlesbrough 0-1 Leeds United: Dan James hits early winner", "title_page": "Middlesbrough 0-1 Leeds United: Dan James hits early winner - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Leeds United returned to the top of the Championship as Dan James' early goal secured an absolutely vital victory at Middlesbrough.\nJames slid in his 12th goal of the season inside two minutes which proved to be enough as Leeds produced an excellent first-half display and held their nerve in the second.\nCoupled with Sheffield United losing and Burnley drawing, this result moved the Whites from third to first on goal difference ahead of the Clarets, with the Blades two points behind.\nIt also meant Daniel Farke's side were not left to rue two goals being disallowed for offside, which TV replays suggested were onside.\nMiddlesbrough pushed for an equaliser but defeat dropped them down a place to sixth, one point clear of Coventry City, who have a game in hand.\nComing into this fixture, Leeds had drawn their last three games, with opponents and rivals happy to pick up on a sense of déjà vu from 12 months ago.\nThen the Yorkshire club finished with eight points from the final eight games to be overhauled by Leicester City and Ipswich Town before Wembley play-off final heartache at the hands of Southampton.\nHere the wobble had started earlier with a run of seven points from six games, allowing Burnley and Sheffield United to nip in front of them.\nBut the best way to settle any nerves is by scoring and that's exactly what James' early strike did from Manor Solomon's low ball across the area after Boro had been opened up.\nThe Wales winger showed his confidence as he tested Mark Travers' palms after another good move and curled a third effort just over as the Whites dominated the early stages.\nThey had a let-off when Scotland forward Tommy Conway had the ball in the net but was flagged for offside, a fate which befell Japan midfielder Ao Tanaka at the other end.\nThe difference here was that Tanaka appeared to be onside when making his run to tap in Solomon's cross from one yard out.\nMiddlesbrough head coach Michael Carrick said:\n\"A lot of our play and the creating of opportunities was really, really good. But it's that final action which is the difference. They found it and we didn't quite find it.\n\"But everyone is really disappointed we didn't take anything out of the game after how we played and particularly after the start we had.\n\"We were the team pushing and pushing and pushing, especially in the second half, but we couldn't quite take the chances and that's football.\n\"We're disappointed because it's the result but that shows where we are as a team. But it can't derail us and it doesn't change the season in many ways because the season is alive.\"\nLeeds United manager Daniel Farke said:\n\"I'm proud of my boys. It was a tough game, overall an excellent advert for the Championship.\n\"Both sides had periods, but in the end we found a way to win this game and it was crucial today to return to our clean sheet behaviour.\n\"We had to dig in, had to deal with a couple of injuries and had one day less in between games, and Middlesbrough were in red-hot form.\n\"We had to dig in and show steel and togetherness and spirit to bring this over the line in a hard-fought game and a well-deserved win.\"", "url": "https://www.bbc.com/sport/football/live/cwy64gg7nl9t"}