{"authors": ["Lauren McCann", "www.facebook.com"], "date_download": "2025-05-21 06:19:25", "date_modify": "2025-05-21 06:19:25", "date_publish": "2025-04-01 05:30:43", "description": "Northern Ireland goalkeeper Jackie Burns says that her move to newly formed Canadian side Calgary Wild came at the \"right time\".", "filename": "sport_football_articles_cvgq3pp1reno_1747808365.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/406a/live/dbb3b3a0-0e5d-11f0-935b-db45f1a7a4cb.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cvgq3pp1reno_1747808365.html", "title": "Jackie Burns: Calgary move came at 'right time' for Northern Ireland goalkeeper", "title_page": "Jackie Burns: Calgary move came at 'right time' for Northern Ireland goalkeeper - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Northern Ireland goalkeeper Jackie Burns said that her move to newly formed Canadian side Calgary Wild came at the \"right time\".\nBurns left Championship side Bristol City last week to move to Calgary, who will play their first season in the recently established Northern Super League later this month.\nThe 28-year-old believed the move was one she could not turn down as she aims to nail down a regular starting berth after limited game time with the Robins.\n\"If an opportunity comes up to be the number one again you have to push for it,\" she said.\n\"I'm looking forward to it, it's a new challenge with a few unknowns with it being a new league and a new set-up, but from what I have heard from the coaches, it seems like the right time to move and to experience something completely different.\"\nBurns, who has previously played in the US, Iceland and Sweden, says that international duty will come as a nice distraction after a busy week of preparing to move.\n\"It's been on the cards for a while so to get it over the line has been a bit of a relief,\" she admitted.\n\"The past week and a half has been a bit of getting used to the fact it is actually happening, getting my mindset ready for that and it's hard because I had to still make myself available for Bristol but also pack up for the next move, process paperwork and jump into camp.\"\nBurns will join up with her new team after the international break ahead of the season opener on April 16 and explained that she previously toyed with the idea of moving to Canada sooner, but the transfer did not materialise.\n\"I haven't given myself much time to think about it. Going to Canada is restarting and seeing where I can get from there,\" she added.\n\"The idea was proposed to me, but I didn't know how to feel about it, it's a new league and a new team, you don't know what to expect and there are a lot of risks in that.\n\"It came around at one point and didn't work out, it came around again and I couldn't deny it. It's been nice to know there has been an interest elsewhere.\"\nEncouragement from Northern Ireland boss Tanya Oxtoby was also crucial in persuading Burns that the move was a sensible one for her international career.\n\"She was one of the first people I was in contact with, international stuff does become a big part of this, but it was a case of what is going to benefit me to help this [Northern Ireland] team more.\n\"If it is something that can give you a life experience too, then you have to take it.\"", "url": "https://www.bbc.com/sport/football/articles/cvgq3pp1reno"}