{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:46:17", "date_modify": "2025-05-20 14:46:17", "date_publish": "2023-07-27 17:30:42", "description": "Barcelona are provisionally cleared to play in the 2023-24 Champions League amid a Uefa investigation into allegations the club made payments to a referees' chief.", "filename": "sport_football_66330753_1747752377.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/14329/production/_129092728_gettyimages-1224048765.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66330753_1747752377.html", "title": "Barcelona provisionally cleared to play in Champions League amid Uefa payments probe", "title_page": "Barcelona provisionally cleared to play in Champions League amid Uefa payments probe - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Barcelona have been provisionally cleared to play in the 2023-24 Champions League amid a Uefa investigation into allegations the club made payments to a referees' chief.\nIn March, European football's governing body confirmed it was looking into claims of payments made by Barcelona for favourable refereeing decisions.\nBarcelona have denied any wrongdoing.\nWhile Barcelona have been allowed in Europe, Uefa reserved the right to punish the club in the future.\nThe Uefa investigation came after a criminal investigation was brought by the Barcelona public prosecutor's office on 10 March.\nIt was alleged that Barcelona paid 8.4m euros (£7.4m) to Jose Maria Enriquez Negreira, the former vice-president of Spain's referees' committee and his Dasnil 95 company.\nBarca, former club officials and Negreira were indicted for \"corruption\", \"breach of trust\" and \"false business records\".\nUefa said: \"The investigators in charge of the case are invited to continue and finalise their investigation and to send a further report to the appeals body if and when they consider that the admission/exclusion of FC Barcelona [in the Champions League] should be assessed.\"", "url": "https://www.bbc.com/sport/football/66330753"}