{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:06:36", "date_modify": "2025-05-21 06:06:36", "date_publish": "2025-04-01 13:58:24", "description": "Derby County boss John Eustace says veteran Erik Pieters brings valuable Championship know-how as the Rams battle to avoid relegation.", "filename": "sport_football_articles_c3wxplvx546o_1747807596.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2e61/live/ec7e2f20-0efe-11f0-9021-b1661f716c64.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c3wxplvx546o_1747807596.html", "title": "Erik Pieters: Derby County defender brings great experience", "title_page": "Erik Pieters: Derby County defender brings great experience - John Eustace - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Derby County boss John Eustace says veteran defender Erik Pieters brings valuable Championship know-how to the Rams' battle to avoid relegation.\nEight of the past 12 seasons that the 36-year-old Dutchman has spent with English clubs were in the Premier League with Burnley and Stoke City, who he first joined from PSV Eindhoven in 2013.\nHe also featured in the Championship with Stoke and had a further two years in the second division with West Bromwich Albion between 2022 and 2024 before a stint with Luton earlier this season.\nPieters left Luton without making an appearance and has joined Eustace's Rams as a free agent.\n\"When talking about signing players with good characters and great experience, Erik is certainly one of those players,\" Eustace told BBC Radio Derby.\n\"I know he has been at some great clubs and he knows the Championship inside out.\"\nEustace said Pieters was brought in as a free agent because of the uncertainty around Sondre Langas after he suffered a knee injury in their win against Blackburn last month.\nThe Norway international featured off the bench against Plymouth after that, and Eustace says the defender's future involvement will have to be \"managed\".\n\"Thankfully he said he will play until the end of the season,\" Eustace added. \"He is going through the pain barrier for us.\"", "url": "https://www.bbc.com/sport/football/articles/c3wxplvx546o"}