{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:27:05", "date_modify": "2025-04-26 04:27:05", "date_publish": "2025-03-03 11:08:04", "description": "Scott Parker says he needs to manage his Burnley squad after making nine changes in FA Cup defeat to Preston North End.", "filename": "sport_football_articles_cvg5q0ejn5go_1745641625.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6547/live/144a3690-f81e-11ef-8dde-aff9d405c81c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cvg5q0ejn5go_1745641625.html", "title": "Burnley: Scott Parker defends making nine changes for FA Cup loss", "title_page": "Burnley: Scott Parker defends making nine changes for FA Cup loss - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Disappointed Scott Parker has defended making nine changes for Burnley's FA Cup defeat at Preston.\nThe Clarets went down 3-0 at Lancashire rivals Preston North End to miss out on a potential quarter-final tie at home to Aston Villa.\nParker's side are third in the Championship, five points adrift of Sheffield United in the second automatic promotion place, and play their game in hand at Cardiff on Tuesday night.\nGoalkeeper James Trafford, defender CJ Egan-Riley and forward Zian Flemming were among the first-teamers to be rested at Deepdale, but Parker told BBC Radio Lancashire: \"It wasn't a difficult decision.\n\"If you win the tie, like we did at Southampton (in round four), it gets wiped away. This squad are together, they deserve to play in this game.\n\"We have got a quick turnaround for another big game at Cardiff, we travel on Monday. I need to manage the squad.\n\"We wanted to go through to the next round, we've not managed to do that.\"\nBurnley conceded more goals in one game than they had in their previous 15 matches in all competitions, ending a run of nine consecutive clean sheets.\n\"It's disappointing,\" Parker added. \"We fell short in a tough tie, there's no denying that.\n\"We fell short in the basics, in the foundation of this game and what was needed we came up a little bit short, we were second best to a lot of things really.\n\"I think it's fair to say it was a mixture of them playing well and us being a bit below par. For the majority of this year we have built our game on a foundation of the basics and we didn't manage to do that. It was a difficult day for us.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cvg5q0ejn5go"}