{"authors": ["Paul Grunill", "www.facebook.com"], "date_download": "2025-05-21 07:16:44", "date_modify": "2025-05-21 07:16:44", "date_publish": "2025-05-20 10:24:03", "description": "Southend United take on Forest Green in the play-offs on Wednesday.", "filename": "sport_football_articles_cx2j8gv4kzgo_1747811804.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f32c/live/e8be7900-3553-11f0-b7a7-db7402bc2830.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cx2j8gv4kzgo_1747811804.html", "title": "Southend United: Kevin Maher expects 'huge test' at Forest Green", "title_page": "Southend United: Kevin Maher expects 'huge test' at Forest Green - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "One down, two to go - but don't expect Southend United boss Kevin Maher to be thinking about a possible trip to Wembley yet.\nThey travel to Forest Green Rovers on Wednesday with the winners earning the right to face either York City or Oldham Athletic in the National League promotion final on 1 June.\nThe road to the home of football is proving a circuitous one for The Shrimpers and their band of supporters.\nA round trip of almost 600 miles took them to Gateshead for the last match of the regular season as they secured the final place in the play-offs.\nThen they travelled over 500 miles to Rochdale and back as they came from 3-1 down to win 4-3 in the first game of the knockout stage.\nThis time the journey to Nailsworth, home of Forest Green, and back is 320 miles and that is all the typically pragmatic Maher is concerned with for now.\n\"Every opponent, I have the utmost respect for. I know Forest Green and how good they'll be, how prepared they'll be, so it would be remiss of me to start thinking any further or talk about anything further than the game Wednesday,\" he told BBC Essex.\n\"It's a huge test. Steve (Cotterill) is so experienced, a top manager, and they're a real good side. We saw that at Roots Hall and at their place as well.\n\"They've been up there all season with the consistency they've got - they're really well organised and when you see their work rate and the intensity they play at, that tells you how it's going to be.\"\nThe two previous games this season ended in 2-2 draws, with Southend having to come from behind twice in both to earn a point.\nAnd Maher, who kept the team afloat through major financial issues which threatened the club's future, including transfer embargoes, is calling on every member of his squad to be ready for whatever role they may be asked to play.\n\"We go into another tough one, a semi-final, another one-off game, it might be 90, it might be 120 minutes, who knows,\" he said.\n\"Everyone's got a part to play and if you're not starting the game you've got to be ready because it might be any moment you're needed.\"\nMaher continued: \"It's about getting them to the game on Wednesday night fresh and ready to go again. There are a few bumps and bruises which you'd expect after 120 minutes (against Rochdale) but by and large, we're in an OK place.\"\nSuch is Maher's loyalty to the club he played over 380 games for and the squad he has painstakingly put together since the lifting of the embargoes and last summer's takeover by COSU (Custodians of Southend United), it is not surprising that it is reflected back at him by his players.\n\"The amount of knowledge he has on the game is so impressive to see. The things we work on and the mentality he instils in the players, it really goes a long way to how we've been doing on the pitch,\" said skipper Nathan Ralph, who scored the first goal in the win over Rochdale.\n\"I don't know of another manager who's been through harder times than the gaffer. In those times, it was just a case of not making excuses for yourself. [He said] we were in this situation and we need to be the ones to get ourselves out of it.\n\"That really helped get us motivated, get us on the pitch doing what we needed to do. In a tough period we were getting some big results that were really important for the club.\"\nMidfielder Jack Bridge previously played under Maher at non-league Chelmsford and cites him as a major influence on his development as a player.\n\"I've played a lot of games for him in the first team which I'm thankful for and we've had a lot of highs and lows but hopefully the biggest high is to come,\" the Southend-born 29-year-old said.\n\"He's had a fantastic career so just to be able to learn from him and the way he sees the game, you've just got to take everything in and go with it.\"\nIt is not just the squad who believe fiercely in the boss, who was awarded a testimonial match last weekend in which he once again donned the shorts and boots.\nFormer defender Jason Demetriou, now the club's chief scout, speaks of how Maher called him almost every day for six weeks one summer to try to persuade him not to turn his back on the game.\nAnd for first-team coach Dan Bentley, Maher's meticulous planning and willingness to take on board the views of fellow coaches are major strengths.\n\"His professionalism is second to none,\" he said.\n\"The demands he puts on us and the attention to detail he has, the planning, the professionalism, it's a pleasure to work with him - he makes me better, he makes Daz (assistant boss Darren Currie) better and as a collective we get on really well.\"\nIt is 10 years since Southend last played at Wembley, winning the League Two play-off final against Wycombe on penalties.\nBut whatever their fate at Forest Green, it has already been a season to remember.", "url": "https://www.bbc.com/sport/football/articles/cx2j8gv4kzgo"}