{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:47:24", "date_modify": "2025-04-26 03:47:24", "date_publish": "2025-03-05 00:00:00", "description": "Natasha Jonas vs Lauren Price news conference as it happened, which also featured Caroline Dubois and Cindy Ngamba.", "filename": "sport_boxing_live_cg7zk0g0989t_1745639244.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_boxing_live_cg7zk0g0989t_1745639244.html", "title": "Natasha Jonas vs Lauren Price press conference: Caroline Dubois, Cindy Ngamba & updates", "title_page": "Natasha Jonas vs Lauren Price press conference: Caroline Dubois, Cindy Ngamba & updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "That's all for now\nTrainer Joe Gallagher did his best to try and get under the skin of Lauren Price, did it work? Who knows, but Price's face certainly didn't suggest she was too bothered about accusations of dodging the biggest names and being \"over-hyped\".\nNatasha Jonas seemed pretty happy to sit back and let it all play out in front of her.\nNow let's just hope that everything goes to plan at Thursday's weigh-in and then we're all set for a cracker at the Royal Albert Hall on Friday.\nThanks for joining us and we'll see you again tomorrow.\nGet your votes in\nJonas v Price\nIt's so interesting to see how opinions change under the cover of anonymity.\nFrom conversations I've had, people seem to be torn on whether Natasha Jonas or Lauren Price will prevail or Friday, but a quick check of our vote and it's starting to become heavily swayed in one favour.\nYou've still got time to have your say.\nYou can find the option to vote in most of the stories related to Friday's card on our boxing index, but the sun is shining and I'm in a good mood today so I'll make it super easy for you today... click here, scroll down and look for the beautiful salmon coloured graphic - you can't miss it!.\nWe'll bring you the result of the vote on fight night.\nBorn to Brawl: Natasha Jonas\nJonas v Price\nBack in May 2023 Natasha Jonas told her story - and it's some story - for BBC Sport's series 'Born to Brawl'.\nAt the time of that interview, Jonas, aged 37, had conquered the light-middleweight division, on a four-fight win streak and was preparing to drop down to welterweight to face Kandi Wyatt for the vacant IBF title... she went on to win and has since added a further two victories and the WBC welterweight strap to her collection.\nPost\nJonas v Price\nJoe Gallagher poses a question to Lauren Price:\n\"You said you wanted to fight world champions last year.\n\"Where was the challenge to Sandy Ryan when she was champion? Where was the challenge to Mikaela Mayer?\"\n\"No one wanted to fight me,\" Price responds.\nBoxxer promoter Ben Shalom comes to Price's defence: \"It is true. It has been hard to get fighters to fight her.\"\n\"Mikaela didn't want it,\" Price adds.\n'Ivan Drago-type character'\nJonas v Price\nKal mentioned earlier that Joe Gallagher might steal the show today and he's doing his best to make that the case:\n\"The agenda and narrative with Lauren is that she his unbelievable fighter, this Ivan Drago-type character and that's just not the case.\n\"Lauren says she is younger and faster. David Haye thought he was until Carl Thompson aged 40 knocked him out.\n\"There's one thing with Lauren that I've seen studying her, she has grit and you can't knock that, but when it comes to boxing Tasha has the seasoning and experience.\"\nPrice 'at her peak'\nJonas v Price\nLauren Price's trainer Rob McCracken is next to speak:\n\"Tasha has achieved so much as a professional and I can understand why Tash [Jonas] is put out by someone like Lauren coming along.\n\"Natasha was brilliant with Team GB and has gone on to have a brilliant career, so it's going to be a great fight on Friday.\n\"Lauren is not 21, she is a mature female and she is at her peak. This is when she needs to be going for it.\n\"Lauren is a phenomenal boxer and has so much potential.\"", "url": "https://www.bbc.co.uk/sport/boxing/live/cg7zk0g0989t"}