{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:34:36", "date_modify": "2025-05-21 05:34:36", "date_publish": "2025-01-14 14:56:12", "description": "Leicester news: Wes Morgan says there were 'no egos' in Foxes' 2016 title winning side", "filename": "sport_football_articles_ckg0v1084pko_1747805676.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/bb27/live/1c3487f0-d1e7-11ef-a174-4f716b9e5ce9.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ckg0v1084pko_1747805676.html", "title": "Leicester news: Wes Morgan says there were 'no egos' in Foxes' 2016 title winning side", "title_page": "Leicester news: Wes Morgan says there were 'no egos' in Foxes' 2016 title winning side - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "There were \"no egos\" in the dressing room of Leicester's remarkable Premier League title-winning team, says former captain Wes Morgan.\nThe Foxes' 5,000-1 title win in 2016 was one of sport's greatest achievements, having pulled off a relegation escape just the season before.\nMorgan was a key part of the Foxes' team that helped the side triumph that included goalkeeper Kasper Schmeichel, midfielder N'Golo Kante and striker Jamie Vardy.\n\"There were no egos in there - everyone was on a normal level,\" Morgan told BBC Sport's Nick Mashiter.\n\"Yes, we had big characters - Schmeichel, Vardy, Riyad Mahrez - but in-house, everyone was 'yeah, we're doing great - there's no pressure on us'. Around the time we beat Manchester City away, that's when I actually thought, 'oh, we could actually do something special.\n\"But I never felt like we were in a title-winning season.\n\"When you're so close to that goal, to achieving something no-one thought would be possible, you start off taking things a bit more... I don't want to say seriously because we always take it seriously, but there's a lot more emphasis in making sure we do things right.\"\nDefender Morgan, who made 323 appearances for Leicester, felt the spirit in the side was always \"core\" to his time at the club.\n\"We had a solid team that would bond and do a lot of activities off the pitch together and that just made us stronger,\" he said.\n\"We had great owners as well. They would take us out. They would offer, if we won the next three out of four games, to take us out for dinner in London and little things like that, just to build that bonding and that togetherness in the team.\"\nMorgan also praised the \"superb experience and knowledge\" that manager Claudio Ranieri brought to the team to help them get over the line that campaign.\n\"Claudio was a media favourite because of his one-liners and his character in these interviews,\" said Morgan. \"He would always take the headlines.\n\"Credit to Claudio, one of the main things he did, which helped us massively, was push that narrative [of not being in the title race].\n\"He deserves massive credit because that got a lot of pressure off the Leicester boys at that time.\"", "url": "https://www.bbc.com/sport/football/articles/ckg0v1084pko"}