{"authors": ["Neil Johnston", "www.facebook.com"], "date_download": "2025-05-21 05:30:52", "date_modify": "2025-05-21 05:30:52", "date_publish": "2025-04-02 21:29:34", "description": "Newcastle 2-1 Brentford: Magpies get the job done", "filename": "sport_football_articles_c1k4nzl03p2o_1747805452.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4b51/live/48270e60-1007-11f0-a851-e1dd6a174ba8.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c1k4nzl03p2o_1747805452.html", "title": "Newcastle 2-1 Brentford: Magpies get the job done", "title_page": "Newcastle 2-1 Brentford: Magpies get the job done - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It was all about the result as far as Newcastle were concerned - and Eddie Howe's side delivered as they marked their return to the Premier League stage with a win following their Carabao Cup triumph.\nIn their first game since ending a 70-year wait for a domestic trophy, the Magpies ensured they stayed in the hunt for the Champions League after dispatching Brentford.\nThey weren't at their fluent best and there was a major debate as to whether Sandro Tonali's winner was a cross or a shot.\nIn the grand scheme of things, it didn't matter one jot.\nNewcastle had the points and the tens of thousands of fans who turned up at St James' Park decked out in black and white Wembley souvenirs went home happy.\nIt is imperative the Toon kick-on after their League Cup triumph. That starts with finishing this season strongly and qualifying for a place at European football's top table.\nAfter losing 2-0 against Manchester United in the final of the 2022-23 Carabao Cup, Newcastle won nine of their remaining 15 Premier League games to secure fourth spot.\nWill they end this season with a similar flourish?\nThe signs look good judging by Wednesday's evidence.", "url": "https://www.bbc.com/sport/football/articles/c1k4nzl03p2o"}