{"authors": ["Emily Salley", "www.facebook.com"], "date_download": "2025-05-21 06:51:00", "date_modify": "2025-05-21 06:51:00", "date_publish": "2025-03-29 23:15:17", "description": "Nottingham Forest's \"incredible\" season continues as they beat Brighton on penalties to reach the FA Cup semi-finals for the first time in 34 years.", "filename": "sport_football_articles_c1wd7j7ex57o_1747810260.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c62c/live/e86861b0-0cee-11f0-ae5b-ef55a399491d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c1wd7j7ex57o_1747810260.html", "title": "Nottingham Forest's 'incredible' season continues as club reach first FA Cup semi-final in 34 years", "title_page": "Nottingham Forest's 'incredible' season continues as club reach first FA Cup semi-final in 34 years - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "What a difference a year makes.\nIn March 2024, Nottingham Forest were teetering precariously above the Premier League relegation zone following a points deduction, and out of both domestic cup competitions.\nFast forward 12 months and they are flying high in the league - and through to a first FA Cup semi-final in 34 years after beating Brighton in a penalty shootout.\nMatz Sels made two crucial spot-kick saves at the Amex Stadium to keep Forest's hopes of a first FA Cup triumph since 1959 alive.\nThat would be reason enough to celebrate, but the Tricky Trees are also third in the top flight - well positioned to qualify for next season's Champions League and return to European competition after more than 28 years away.\n\"It's been an incredible season,\" Forest captain Ryan Yates, who scored the winning penalty, told BBC One.\n\"We have achieved nothing yet but to send [our fans] to Wembley again - we know how special it was last time, getting promoted.\n\"It will be a special day and I am so pleased for the supporters and overall I think we deserved it.\"\nPenalty shootouts have become the norm for Forest in the FA Cup this season.\nAfter a routine 2-0 win over Luton in the third round, Nuno Espirito Santo's side required spot-kicks to overcome League One's Exeter City and then Premier League strugglers Ipswich.\nA third successive shootout followed on the south coast, with little to separate Brighton and Forest following a drab game which lacked many clear-cut chances.\nSels went the right way to deny a lacklustre strike from Jack Hinshelwood before standing tall and getting a strong hand to Diego Gomez's powerful hit.\n\"In penalty shootouts you always need a little bit of luck but I'm really happy,\" the Belgium keeper said afterwards.\nSels, who has kept 12 clean sheets in the league this season, was also integral in Forest's two previous shootouts - with the decisive save against Ipswich after stopping one of Exeter's spot-kicks in the fourth round.\nNuno said: \"Matz saved again. He's been doing really well. It's the third time and we've always been successful. Credit to him.\"\nSkipper Yates sealed the victory as Forest became the first team to win three penalty shootouts in a single season in the FA Cup.\n\"I was a bit nervous to be fair, just so relieved it went in. Matz saved two penalties and I just knew I had to capitalise and send us to Wembley,\" Yates said.\nThis was the first game back for both sides after an international break and it looked like the extra miles travelled by players recently took their toll.\nBrighton's players travelled a total of 86,208 miles during the break, while Forest's players combined for a total of 83,054 miles.\nIn a cagey encounter, players appeared fatigued with both teams untidy in possession and lacking quality in the final third.\n\"Football needs to address this. I know people will say players get paid a fortune, yes they do,\" ex-England striker Gary Lineker said.\n\"But it's not just about the players' welfare, but the paying public will suffer, as you are not going to get players at their best.\"\nWhen the starting line-ups were announced before kick-off there were question marks over Nuno's decision to rest key attackers Callum Hudson-Odoi and Anthony Elanga, especially with top scorer Chris Wood missing through injury.\nIt almost seemed like the Forest boss had one eye on Tuesday's Premier League meeting against Manchester United - a chance for Forest to solidify their place in the top four and boost their bid for Champions League football next season.\nHudson-Odoi and Elanga came on just after the hour mark, and although they struggled to make an impact during the game, the former netted Forest's second spot kick.\n\"You've got to give Nuno some credit,\" said former Manchester United forward Wayne Rooney.\n\"We said before the game we thought he made a mistake resting some players, but when they go through you have got to give them credit.\"", "url": "https://www.bbc.com/sport/football/articles/c1wd7j7ex57o"}