{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:16:59", "date_modify": "2025-04-26 06:16:59", "date_publish": "2025-03-01 18:50:55", "description": "Sheffield United manager Chris Wilder praises his side's \"first class\" reaction after they beat QPR following defeat to Leeds.", "filename": "sport_football_articles_c4g07x5v5veo_1745648219.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a91f/live/ece4beb0-f6cc-11ef-a811-cd286d96b2f6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c4g07x5v5veo_1745648219.html", "title": "Chris Wilder: Sheffield United manager praises his sides' 'first class' reaction at QPR", "title_page": "Chris Wilder: Sheffield United manager praises his sides' 'first class' reaction at QPR - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Sheffield United manager Chris Wilder praises his side's \"first class\" reaction after the Blades bounced back from defeat to Leeds with victory over QPR.\n\"I have to say yet again I was so proud of the players. It was so disappointing on Monday night because they deserved a little bit more than what happened,\" Wilder told BBC Radio Sheffield.\n\"It definitely wasn't a 3-1 and we were all pretty down on Tuesday.\n\"But the reaction yet again was first class. It has never been an easy place to come here and we were up against a competitive team.\n\"We have done what we needed to do which is get the win. We have the best away record in the division and we are proud of it. It is something we need to hold on to if we are going to keep nudging our points total up.\"\nBen Brereton-Diaz and Tyrese Campbell put the Blades 2-0 up, but they were under pressure after Michael Frey converted a penalty when Harrison Burrows handled in the area.\n\"I don't agree with the referee over the penalty. He [Harrison Burrows] has turned his back and it's just smashed his arm,\" Wilder said.\n\"We were scratching our heads at the referee's performance from both technical areas today.\n\"But we have done what we needed to do which is get the win. We have the best away record in the division and we are proud of it. It is something we need to hold on to if we are going to keep nudging our points total up.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c4g07x5v5veo"}