{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:40:15", "date_modify": "2025-04-26 03:40:15", "date_publish": "2025-03-05 10:19:29", "description": "Burnley boss Scott Parker says he was \"surprised\" that his team conceded against Cardiff City on Tuesday to end their impressive clean sheet record at 12 league games.", "filename": "sport_football_articles_cgkm34nyz4po_1745638815.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/77b4/live/1d4a57f0-f9ab-11ef-b9b7-b96cc3284531.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cgkm34nyz4po_1745638815.html", "title": "Burnley: 'I was surprised we conceded'", "title_page": "Burnley: 'I was surprised we conceded' - Scott Parker - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Burnley boss Scott Parker says he was \"surprised\" that his team conceded against Cardiff City on Tuesday to end their impressive clean sheet record at 12 league games.\nYousef Salech headed the ball into the net for the Bluebirds to make it 2-1 and see the Clarets concede for the first time in the Championship since December.\nThe Lancashire side did, however, go on to claim victory after Cardiff failed to find an equaliser and see themselves within two points of the automatic promotion spots.\n\"I am pleased with the three points. We started superbly for 35 minutes, dominated and got our noses in front,\" Parker told BBC Sport.\n\"We started the second half brightly but my only complaint is we probably should have put more daylight between us.\n\"At the end you need resilience and the ability to dig in and we had that. I thought the energy was impressive. We looked like a proper team who understood their roles.\n\"It's a shame we conceded tonight but I'm more pleased that we won. I was a little bit surprised we conceded, we will have to review it.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cgkm34nyz4po"}