{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:16:52", "date_modify": "2025-05-21 06:16:52", "date_publish": "2025-01-14 08:48:09", "description": "Wales coach Warren Gatland says players involved in an independent review into Welsh rugby do not know what a professional winning culture looks like.", "filename": "sport_rugby-union_articles_c805l5n151lo_1747808212.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/580e/live/c642f730-d1e8-11ef-a174-4f716b9e5ce9.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c805l5n151lo_1747808212.html", "title": "Warren Gatland: Wales coach questions credentials of review participants", "title_page": "Warren Gatland: Wales coach questions credentials of review participants - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wales head coach Warren Gatland says participants, including players, involved in an independent review into Welsh rugby do not know what a professional winning culture looks like.\nGatland will remain in post for the 2025 Six Nations despite his position being under pressure following a record 12 successive Test defeats, a sequence that stretches back to October 2023.\nA post-Autumn Nations Series review was completed for the Welsh Rugby Union (WRU) just before Christmas.\nAs part of the wide-ranging report conducted by an external company and presented to WRU chief executive Abi Tierney, players were canvassed for anonymous feedback following a November campaign that saw Wales beaten by Fiji, Australia and South Africa.\n\"It gave us an insight into some of the things they [players] found challenging and things they wanted more of and stuff,\" said Gatland.\n\"So we've taken that on board. But you've also got to realise they are still young players as well, and that's a small moment of their thoughts.\n\"The questions I ask sometimes, of the players that have given feedback and stuff, what has their experience been in a professional winning environment?\n\"None of them have had that experience, so how do they know what that looks like?\n\"Even with regards to the people doing the reviews or being part of the process, those are the questions I asked myself. What is their experience or involvement in high-level professional sport winning environments?\n\"I'd like to think we've got people who have been involved with that environment and are lucky enough and able to draw on those past experiences, who know what it feels and smells like to be part of it.\"\nGatland enjoyed success in his first 12-year stint as Wales head coach which included three Grand Slams, four Six Nations titles and two World Cup semi-finals.\nThe New Zealander has also led the British and Irish Lions on three tours which has included a series victory against Australia and a drawn campaign against the All Blacks.\nGatland also led Wasps to Heineken Cup and English Premiership trophies, although he has had little success since 2019 with Waikato Chiefs, on the Lions tour of South Africa and during his Wales return.\nGatland admits there will be no immediate winning miracle cure with his national side now mirroring the results of the four regions and Under-20s as players experience more defeats than victories.\n\"The sad thing at the moment is we're probably a reflection of what Welsh rugby is like,\" said Gatland of his Wales national men's team.\n\"We were probably the anomaly in the past, where we weren't that, we were able to control that or step outside what was happening behind.\n\"So people are aware of the changes that need to be made to hopefully improve Welsh rugby going forward.\n\"It's not going to happen overnight, it's going to take a little bit of time.\"\nGatland accepts the review was wide-ranging.\n\"It was pretty encompassing, not just looking at the team but looking at the whole of Welsh rugby over the last 15-20 years,\" said Gatland.\n\"The pathway system, the academies and the Under-20s programme, and all things like that. It looked at things to be put in place for the future.\n\"There was some criticism of things, which you expect in any review. There were things for us to look at in terms of some changes they felt we could make going forward.\n\"There are a number of things for us that are not going to make the difference in the short term but will make a difference in the long term.\"\nGatland admits he has changed his approach to dealing with players over the years.\n\"I suppose you probably need to temper yourself a little bit to what you might have been in the past in terms of the language you might have used and how direct you were and potentially how critical you were,\" said Gatland.\n\"Sometimes you ask the question - are players today as resilient as they might have been, as tough as they might have been?\n\"I'm definitely conscious, and not just me, but all the coaches are conscious of the way we speak to the players and language we use in terms of maybe not knocking their confidence.\n\"So there's definitely been changes probably with the players in terms of that.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/c805l5n151lo"}