{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:15:57", "date_modify": "2025-05-20 13:15:57", "date_publish": "2023-08-02 14:07:45", "description": "Everton: Your views on what Premier League season holds", "filename": "sport_articles_cp37re284mmo_1747746957.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/bd34/live/b8c34a80-3138-11ee-8f52-fbf70e4bf742.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cp37re284mmo_1747746957.html", "title": "Everton: Your views on what Premier League season holds", "title_page": "Everton: Your views on what Premier League season holds - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked you whether or not Everton are in store for another relegation scrap this season.\nThe Toffees were in danger of relegation for the entirety of last season but just managed to survive on the final day.\nHere are your thoughts:\nKeith: It's plain that we're struggling to attract quality players in this window, with both finance and recent years at the wrong end of the table being the main reasons. But Dyche has built some confidence and the lads will be fit and well-drilled. I agree it will be tough, but we could maybe finish in the top half of the bottom half of the table. I'd take 12th now!\nEddie: This coming season will definitely be a relegation scrap for Everton! They’ve got no money and have spent what they have badly. I don’t know who dreams up these targets but they should be sacked!\nAnton: All Evertonians need to realise that finishing somewhere, anywhere, north of 17th place, with no genuine threat of relegation, must be seen as an excellent season for us. This decline that we're in is going to take a lot longer to get out of than what we'd all maybe like to admit. We've just got to get behind Dyche and the lads.\nJenny: We won't set the world on fire but we won't be fighting relegation. I think we will finish between 10th and 14th.", "url": "https://www.bbc.com/sport/articles/cp37re284mmo"}