{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:30:13", "date_modify": "2025-05-21 07:30:13", "date_publish": "2025-03-28 17:49:50", "description": "Southampton news: 2023-24 accounts a 'good marker for financial life in Championship'", "filename": "sport_football_articles_cp3y3eenexyo_1747812613.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3b0a/live/4c310330-0bfc-11f0-a31d-7bdcf6d7d2f6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cp3y3eenexyo_1747812613.html", "title": "2023-24 accounts a 'good marker for financial life in Championship'", "title_page": "Southampton news: 2023-24 accounts a 'good marker for financial life in Championship' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "BBC Radio Solent sports editor Adam Blackmore says Southampton's financial accounts for the year ending June 2024 are a \"good marker\" for what the club can expect should they immediately return to the Championship.\nSaints recorded a pre-tax and interest profit of £36.4m and a post-tax profit of £5.7m, following five successive years of reporting losses.\nHowever, this was aided by a mass exodus of players following relegation in 2023.\n\"They are a good marker for us to look forward to financial life in the Championship next season,\" said Blackmore.\n\"Yes, they made a net profit of £5.7m but that only happened from the fire sale of players after dropping out of the Premier League.\n\"That included Tino Livramento, James Ward-Prowse, Nathan Tella, Romeo Lavia for big money, Mislav Orsic and more. It was well over £100m of sales.\n\"The biggest problem for clubs dropping out of the Premier League is your turnover drops because of the broadcasting income. Saints' income went down over £60m from £145m to £84.8m and we can expect something similar to happen again.\n\"They also invested during that period in the Championship - over £4m in infrastructure including safe standing, a new fan zone, stadium wifi - and that's all in place and won't really need spending on again going forward.\"", "url": "https://www.bbc.com/sport/football/articles/cp3y3eenexyo"}