{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:24:54", "date_modify": "2025-05-20 13:24:54", "date_publish": "2023-08-02 07:07:27", "description": "Barcelona coach Xavi says £135m signing Ousmane Dembele has decided to leave after six years.", "filename": "sport_football_66380569_1747747494.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4917/production/_130611781_gettyimages-1459476742.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66380569_1747747494.html", "title": "Ousmane Dembele: Barcelona forward to join Paris St-Germain, says Xavi", "title_page": "Ousmane Dembele: Barcelona forward to join Paris St-Germain, says Xavi - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Barcelona forward Ousmane Dembele will join Paris St-Germain, says Barca coach Xavi.\nThe 26-year-old France international was an unused substitute in Barcelona's 1-0 pre-season friendly win over AC Milan in Las Vegas on Wednesday.\n\"He says that he has this proposal and that he has decided to leave. It is his personal decision,\" said Xavi.\nDembele has scored 40 goals in 185 games since joining Barcelona from Borussia Dortmund for £135m in 2017.\n\"I will be very clear,\" Xavi said. \"He has been very direct, that he has a proposal from Paris St-Germain, that they have called him from there and here we cannot do anything. That is why he has not played today.\n\"It hurts me because I think we have taken great care of him here so that he is happy and content and continues to make a difference for us.\"\nDembele signed a new two-year contract at Barcelona last year after a season in which he provided the most assists in La Liga.\nHe was part of the France side that reached the World Cup final in December, but a thigh injury meant he missed most of the second half of the season as Barcelona won the title.\nDembele scored in Saturday's 3-0 win over Real Madrid in Dallas, the second of three games on their pre-season tour of the United States.\nPSG have won Ligue 1 in nine of the past 11 seasons.", "url": "https://www.bbc.com/sport/football/66380569"}