{"authors": ["Tom Chappell", "www.facebook.com"], "date_download": "2025-05-21 03:46:15", "date_modify": "2025-05-21 03:46:15", "date_publish": "2025-01-23 16:57:49", "description": "Portsmouth fan Tom Chappell gives his thoughts after Pompey's 3-1 win over Stoke City at Fratton Park.", "filename": "sport_football_articles_cvgp85753n5o_1747799175.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2366/live/bbd17540-da50-11ef-a37f-eba91255dc3d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cvgp85753n5o_1747799175.html", "title": "Portsmouth FC: 'Pompey gave Stoke no right to reply'", "title_page": "Portsmouth FC: 'Pompey gave Stoke no right to reply'  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "My feeling before the game was that this would be Pompey's biggest game of the season so far - and it proved not only to be a dazzling win, but a proper performance from John Mousinho's side.\nWhether it be Colby Bishop's emphatic spot-kick, Callum Lang's audacious header and emotional celebration or Jordan Williams' colossal defensive display, there was something to like everywhere you looked at Fratton Park on Wednesday night.\nI've written previously about my frustrations with the lack of decisions from officials seeming to fall Pompey's way - the penalty early doors validates this entirely.\nIt's a decision that referee Josh Smith should make and correctly does, yet you don't often see those given. It's not something we've seen too much of go in our favour this season to date.\nColby dispatches expertly, and Pompey have their desired start. The visionary Nicolas Schmid then fires one in Lang's direction, which Pompey's goal-scoring boy nods beyond Viktor Johansson's reach.\nA fitting celebration followed as the 10-goal man wheeled in the direction of Alec Lumb's seat. A class player and an even better person.\nStoke get back in it with a goal that is disappointingly poor for all those of a Pompey persuasion - but, for me, it was our conduct coming back out after half-time that won us the night.\nWhat can only be described as pedal to the floor, Pompey gave no respite or breathing room for an opposition's right to reply - Connor Ogilvie tucks it away nicely at the back stick and the evening becomes ever so comfortable.\nThere wasn't a moment where I felt from then on that the scoreline - and more broadly, the result - was in any danger. Mousinho's characterisation of that being up there with one of the best 45s of the season is wholly accurate.\nAs the Championship table stands, Pompey can name six teams inferior to them. The challenge now is to ensure that remains the case for as long as possible.", "url": "https://www.bbc.com/sport/football/articles/cvgp85753n5o"}