{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:17:26", "date_modify": "2025-05-21 07:17:26", "date_publish": "2025-01-13 19:02:52", "description": "Legendary Scotland captain Peter Brown dies aged 83 as Gregor Townsend pays tribute.", "filename": "sport_rugby-union_articles_c3w8q1zj1v6o_1747811846.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6cad/live/6a6503b0-d1dc-11ef-858a-3ffeee956fe5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c3w8q1zj1v6o_1747811846.html", "title": "Peter Brown: Former Scotland rugby captain dies aged 83", "title_page": "Peter Brown: Former Scotland rugby captain dies aged 83 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Scotland rugby union captain Peter Brown has died aged 83 following a long illness.\nBorn in Troon to a sporting family, Brown played at club level for West of Scotland and Gala, making his international debut in a home win against France on 4 January 1964.\nBrown's father Jock was a football goalkeeper who won the Scottish Cup with Clyde in 1939, his uncle Jim played for the United States at the 1930 World Cup and his younger brother Gordon was a fellow Scotland rugby international, who also represented the British and Irish Lions on eight occasions.\nA versatile forward, Peter Brown split his 27 caps between lock and number eight and was an effective goal-kicker - his 66 points for Scotland remains a record for a member of the pack.\nHe remained heavily involved with Gala after retiring from playing, and also had a successful career in accountancy.\nIn a statement, Brown's family said: \"Peter underwent several years of chemotherapy treatment for myeloma, supported wonderfully by the haematology team at the Western General.\n\"Earlier this week, he was admitted to the Royal Infirmary following a fall at home. Peter passed away peacefully surrounded by family on Sunday 12 January.\n\"The family would like to express their gratitude to the Acute Medical Unit for their care and compassion.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/c3w8q1zj1v6o"}