{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:10:56", "date_modify": "2025-05-20 13:10:56", "date_publish": "2023-08-01 08:36:20", "description": "Fulham: Cottagers' pre-season and transfer business - your views", "filename": "sport_articles_cndke38lww9o_1747746656.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9975/live/c703f6b0-3040-11ee-8f52-fbf70e4bf742.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cndke38lww9o_1747746656.html", "title": "Fulham: Cottagers' pre-season and transfer business", "title_page": "Fulham: Cottagers' pre-season and transfer business - your views - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Fulham boss Marco Silva said new signings are \"crucial\" heading into the Premier League season because the squad is \"really short\".\nWe asked what you thought of the pre-season games, and where you think signings need to be made.\nHere are some of your thoughts:\nKeir: We need midfielders and strikers. With Fulham, you can’t say we need X or Y because, as the gaffer said, he needs multiple players in a variety of positions. It seems the Khans don’t understand that it takes more than just a shiny new stand to keep a football team in the Premier League. If Fulham don’t strengthen, we will go down.\nBrian: Ever since the Khans took over I've not slept well in pre-season. We get the usual rumours but nothing happens until late in the window, if at all. Whether they don't get the concept, I'm unsure, but Marco must be very concerned with a lightweight squad. Without doubt, we will struggle this season.\nTim: Pre-season so far has shown us that our squad depth needs serious attention. Injuries in key areas will leave us with few options and could mean we have a slow start to the season. Four or five quality players are still required. Typical Fulham - we'll likely do this business on deadline day.\nAidan: I think the season just needs to start better than the pre-season. A new left-back is needed because I'm not sure if Robinson is up to the task. But, to be honest, it was a fairly good pre-season even if we lost two games.", "url": "https://www.bbc.com/sport/articles/cndke38lww9o"}