{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:26:12", "date_modify": "2025-04-26 04:26:12", "date_publish": "2025-03-03 11:34:46", "description": "Norwich City defender Jose Cordoba says the team were unhappy with their 1-1 draw against 10-man Blackburn Rovers.", "filename": "sport_football_articles_c93nyj3pyxwo_1745641572.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/fd4a/live/d0cca0f0-f823-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c93nyj3pyxwo_1745641572.html", "title": "Norwich City: 'Blackburn was a lost game'", "title_page": "Norwich City: 'Blackburn was a lost game' - Jose Cordoba - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Norwich City defender Jose Cordoba says the team were unhappy with their 1-1 draw against 10-man Blackburn Rovers as they had plenty of opportunities to kill the game off.\nAnte Crnac scored in the 90th minute, five minutes after the dismissal of Rovers striker Emmanuel Dennis, but the Canaries went on to concede victory when Andi Weimann headed in a equaliser six minutes into stoppage time.\nA win would have left Norwich two points off a play-off spot but they now trail the top six by four with Oxford United next up at Carrow Road on Friday night.\n\"It's ugly. I think right now, we are feeling like it's a lost game,\" Cordoba told BBC Radio Norfolk.\n\"We control all the game in the first half and we had so many options to kill the game. We should have scored in the first half but we didn't.\"\nThe attacking threat came from the Canaries throughout the game, with multiple chances created for Josh Sargent, Kellan Fisher and Anis Ben Slimane, none of which were taken.\n\"It's a big frustration to not win the games. Even when you draw, you don't want to start and finish the games with a draw,\" Cordoba added.\n\"We have to keep fighting, to not give up. We have to be better.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c93nyj3pyxwo"}