{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:44:01", "date_modify": "2025-05-20 14:44:01", "date_publish": "2023-07-28 11:12:25", "description": "Leicester City podcast: Transfer activity - Vardy, Iheanacho, Daka", "filename": "sport_articles_c2vz54qejq7o_1747752241.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e08d/live/59679020-2d35-11ee-bd2e-8fa4d13d488b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c2vz54qejq7o_1747752241.html", "title": "Leicester City podcast: Transfer activity", "title_page": "Leicester City podcast: Transfer activity - Vardy, Iheanacho, Daka - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Leicester City midfielder Dean Hammond has been discussing the club's transfer activities on BBC Radio Leicester's When You're Smiling podcast: \"I've played a lot of my career in the Championship and it's a really tough league.\n£To be successful in the Championship, you need to score goals - sSo the more attacking players Leicester have got, the more chance they've got at being successful. If you look at the strikers we've got in Daka, Vardy and Iheanacho - those players can score goals.\n\"Do we need another striker? Potentially - but maybe not if we play the 4-3-3 formation. But we definitely need a wide player, and maybe even an additional wide player.\n\"Leicester City are going to be the favourites and teams are going to want to come to the King Power and not be as expansive. They're going to want to sit back, probably keep a shape, and be a little bit more defensive. So the more variety Leicester have got in their attack, the better.\n\"Having a player who can create something out of nothing is really important. When we were in the Championship, we had Knockaert and Mahrez. So, when those games are tight - at 0-0 or 1-1 - you have someone who can just create something, take someone on and stick it top corner, or play a killer pass out of nowhere.\"", "url": "https://www.bbc.com/sport/articles/c2vz54qejq7o"}