{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:49:08", "date_modify": "2025-05-21 03:49:08", "date_publish": "2025-02-09 17:44:20", "description": "Plymouth 1-0 Liverpool: What Arne Slot said", "filename": "sport_football_articles_c70qy01d18wo_1747799348.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5690/live/4c92b990-e70d-11ef-a5b2-6f302c2db239.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c70qy01d18wo_1747799348.html", "title": "Plymouth 1-0 Liverpool: What Arne Slot said", "title_page": "Plymouth 1-0 Liverpool: What Arne Slot said - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Arne Slot spoke to ITV after Liverpool's FA Cup defeat against Plymouth: \"Great game from Plymouth. Good game plan. They deserve all credit for the performance. We were not having a very good day and a result like this is the outcome.\n\"I cant say the boys didn't fight because they were for 100 minutes or so. Both teams hardly created any chances and the game was decided by a penalty. In such games, it is up to one moment and that went for them. They played a good game and deserved it.\n\"I think [the Liverpool players] are able to do better. Plymouth have a system and a way of playing where it is quite hard to create chances against. They were really aggressive when we had the ball. We expected the players to play a better game than this but we have to give credit to Plymouth as well.\n\"The players kept on fighting till the last moment. It wasn't a work rate problem. They worked really hard but they could not find any openings and chances. We just have to keep doing the same with the same work rate.\n\"It hurts everyone associated with Liverpool - fans, me and the players. We all wanted to be in the FA Cup and compete for as long as possible. It is a setback.\"", "url": "https://www.bbc.com/sport/football/articles/c70qy01d18wo"}