{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:00:28", "date_modify": "2025-05-19 15:00:28", "date_publish": "2017-07-03 19:40:08", "description": "Alexander Karapetian warns Rangers they will face a more confident Progres Niederkorn team in the Europa League on Tuesday.", "filename": "sport_football_40485803_1747666828.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/FD33/production/_96791846_13674286.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_40485803_1747666828.html", "title": "Europa League: Rangers warned of 'something in the air' in Niederkorn", "title_page": "Europa League: Rangers warned of 'something in the air' in Niederkorn - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Striker Alexander Karapetian has warned Rangers that he and his Progres Niederkorn team-mates are confident of knocking the Ibrox side out of Europe.\nThe Armenia international indicated the Luxembourg outfit would play defensively at first before a late assault as they try to overturn a 1-0 loss from the first leg in Glasgow.\n\"Now we are more confident than five days ago,\" said the 29-year-old at his team's media conference on Monday.\n\"We feel there's something in the air.\"\nKarapetian reflected on his \"good chance to score, but not a 100% chance\" in last Tuesday's first leg of the Europa League first-round qualifier, as Rangers played their first match against continental opposition in six years at a packed Ibrox Stadium.\n\"I've looked twice at it on the video. Tomorrow if I get another chance I will try to score it,\" said the Tbilisi-born player.\n\"They are a strong team, a physical team. (When) I see the striker, he looks like a monster.\n\"For the first 30 minutes maybe we were a little bit nervous. Everybody believes. We are happy. We can make a big step for Luxembourg to get to the next round because Rangers are such a big team.\n\"We hope tomorrow we can repeat our performance.\"\nMexicans Eduardo Herrera and Carlos Pena have travelled with Rangers but neither is likely to play for Pedro Caixinha's new-look team at the Stade Josy Barthel.\nProgres Niederkorn coach Paolo Amodio acknowledged that it would be \"hard work\" to replicate the performance from the first leg, but Karapetian sees a way that his team can secure their first European win in 14 attempts.\n\"If you play Rangers you cannot play so offensive,\" he said. \"First of all we need to defend and afterwards we need to score. It's normal against such big teams.\n\"Maybe in the last 20 minutes we can (move up the pitch) but in the beginning it is important we do not concede a goal.\"", "url": "https://www.bbc.com/sport/football/40485803"}