{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:12:12", "date_modify": "2025-05-21 04:12:12", "date_publish": "2025-01-23 20:33:05", "description": "Hoffenheim 2-3 Tottenham: 'You need your leaders to stand up and they did' - Ange Postecoglou reacts to win", "filename": "sport_football_articles_c5y6gxyp1gjo_1747800732.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1ca7/live/1f4f4f80-d9c9-11ef-8bba-277dd299cea4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c5y6gxyp1gjo_1747800732.html", "title": "'You need your leaders to stand up and they did'", "title_page": "Hoffenheim 2-3 Tottenham: 'You need your leaders to stand up and they did' - Ange Postecoglou reacts to win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tottenham boss Ange Postecoglou, speaking to TNT Sports: \"It's not easy to get away wins in Europe. I was watching the Champions League last night and there was only one away victory so it's tough.\n\"Credit to the boys, I thought they were outstanding first half and played really well. We looked a bit tired in the second half but hung on. Sonny [Son Heung-Min] scored a great goal to give us that extra buffer. We had the school boys out there in the end.\n\"We wanted to be a bit more aggressive and that is when Madders [James Maddison] is at his best. In the context of the game, we kind of knew if we could score early and put some pressure on them then it would give us a good foothold in the game. He was good all night but got a bit tired in the second half but he caused them a lot of problems.\"\n\"I thought the senior boys today all really stood up. You need your leaders to stand up and they did tonight.\n\"I told them to enjoy it. Winning away in Europe, it's a significant victory for us and gives us a good foothold to get into those top eight spots which will give us a week off. They enjoyed tonight, we'll recover and get ready for Sunday.\n\"It's a great position to be in, we want to finish top eight because it gives us an extra week of rest and we'll probably need it around that time.\"", "url": "https://www.bbc.com/sport/football/articles/c5y6gxyp1gjo"}