{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:02:37", "date_modify": "2025-05-20 13:02:37", "date_publish": "2023-08-01 10:48:33", "description": "'Exhilarating mystique' as squad takes shape", "filename": "sport_articles_cgrgn2d559ro_1747746157.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/51f5/live/05dba4c0-3058-11ee-8f52-fbf70e4bf742.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cgrgn2d559ro_1747746157.html", "title": "'Exhilarating mystique' as squad takes shape", "title_page": "'Exhilarating mystique' as squad takes shape - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Greg Playfair, Oor Wee Chat podcast, external\nIt’s no exaggeration to say that the month of August is eagerly anticipated each year in Edinburgh and here’s hoping that audiences will be thoroughly entertained over in Gorgie during the next 31 days and beyond.\nHearts have already managed to get themselves into the Edinburgh Festival spirit during the close season by keeping supporters and onlookers engaged with a show of ‘Who’s in Charge of The Team Anyway?’ as Technical Director Steven Naismith and Head Coach Frankie McAvoy have faced media scrutiny throughout the summer, and they’ll be hoping their double act wins the acclaim of Jambos despite the unusual job titles.\nI personally don’t see anything wrong or untoward with how Hearts have acted here, as we’re simply playing within the rules laid down by UEFA and I can’t understand the furore by some of my fellow Jambos on the situation. Wait until they see the prices of a pint at a pop-up bar during the Fringe, now that’s something worth seething over rather than a McAvoy press conference...\nThe playing squad is now taking shape after a relaxed approach to recruitment after a number of post-season departures. There have been obvious gaps to address and I’m looking forward to Frankie Kent settling into the heart of defence, as Craig Halkett's long-term absence has resulted in us being consistently weak against balls into our box for almost 18 months.\nAustralian newcomer Calem Nieuwenhof should hopefully become part of the midfield engine room with the returning Beni Baningime and allow us to have dynamism when transitioning from defence to attack.\nIt’s our imminent forward additions that have got fans excited, with Costa Rican Kenneth Vargas and Japanese Kyosuke Tagawa set to be tasked with replacing last year’s favourite, Josh Ginnelly. Whilst I have no doubt Joe Savage and the recruitment team will have done their homework and know exactly what they’re getting, I think the mystique around the duo makes it more exhilarating for us as fans.\nIn terms of opening league fixtures and cup draws for the UEFA Conference League and League Cup, I genuinely don’t think we could have asked for anything better. We’ve got a fantastic chance to put right our dismal domestic away form and I think the playing style from last season gives supporters confidence that the Hearts management team will make opposition worry about us, rather than us fixate on them, something that we witnessed too often under Robbie Neilson.\nIf we show the same level of consistency as a performer in the Edinburgh Fringe in August, then I’ve got the full belief that we will be up there competing for awards and honours throughout the 23-24 campaign.", "url": "https://www.bbc.com/sport/articles/cgrgn2d559ro"}