{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:53:16", "date_modify": "2025-04-26 07:53:16", "date_publish": "2025-02-25 14:11:28", "description": "Irish trainer John 'Shark' Hanlon can make his comeback to racing from Saturday after having his licence suspended for transporting a dead horse in public view in an open trailer.", "filename": "sport_horse-racing_articles_cx28pp7e8y8o_1745653996.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6aba/live/6bfceec0-f37b-11ef-958e-8b9bf28c4572.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_horse-racing_articles_cx28pp7e8y8o_1745653996.html", "title": "John Hanlon: Irish trainer set for racing return following suspension", "title_page": "John Hanlon: Irish trainer set for racing return following suspension - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Irish trainer John 'Shark' Hanlon can make his comeback to racing from Saturday after having his licence suspended for transporting a dead horse in public view in an open trailer.\nHanlon initially received a 10-month ban but this was cut to six months after an appeal and he could make an application to suspend the final three months if certain conditions were met.\nThe Referrals Committee met earlier this month to consider his application to review the ban and his licence was restored on February 14 in the knowledge that he would not be able to run any horses until March 1 due to a new ruling.\n\"They gave the licence back to me two weeks ago in fairness, but there's a new rule in Ireland that you have to have horses in training for 14 days before you can run them, so we'll be ready to go again from 1 March,\" said Hanlon on Tuesday.\nHanlon added that he plans to run 2023 King George VI Chase winner Hewick in this year's Grand National instead of the Cheltenham Gold Cup, which the 10-year-old is entered for.\n\"I think we'll miss the Gold Cup, the National is the plan and has been for a while.\n\"The handicapper has dropped him a little bit after his last couple of runs and he gets in the National with 11st 7lb, which I think is a nice weight because it looks like 10st 10lb could be bottom-weight, so he wouldn't be giving loads of weight to anything.\n\"As long as we get good ground, that's the main thing, and I'd rather go there fresh than be taking on Galopin Des Champs in the Gold Cup.\"", "url": "https://www.bbc.co.uk/sport/horse-racing/articles/cx28pp7e8y8o"}