{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-05-21 06:55:15", "date_modify": "2025-05-21 06:55:15", "date_publish": "2025-03-29 16:07:50", "description": "Man Utd news: Fan protest planned after Manchester City game", "filename": "sport_football_articles_c86p66lneweo_1747810515.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/19e2/live/72143200-0cb7-11f0-97e3-3568f3d0bae1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c86p66lneweo_1747810515.html", "title": "Man Utd news: Fan protest planned after Manchester City game", "title_page": "Man Utd news: Fan protest planned after Manchester City game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The '1958' Manchester United fans' group is planning a 'sit-in' protest against the Glazer ownership of the club after next Sunday's derby clash with Manchester City at Old Trafford.\nThe organisation made the announcement at Broadhurst Park as they confirmed a collaboration with FC United, the breakaway club formed by United fans opposed to the Glazer takeover in 2005.\nThe last Old Trafford sit-in came in August 2023, when thousands of fans stayed behind following a victory over Nottingham Forest.\nChris Haymes of The 1958 group said: \"We're going to get people to sit in their seats.\n\"MUST (Manchester United Supporters Trust) did a flash survey and they reckon there's going to be about 7,000 concessions, OAP people, who are not going to renew their season tickets.\n\"So, they're trying to price them out of their seats, so we're going to tell you to sit in your seat, stay in your seat. That's your seat that you paid for.\"\nEarlier this month, The 1958 organised a protest – in which thousands of United fans joined a near mile-long march to Old Trafford - before the 1-1 draw with Arsenal.\nHowever, speaking at a question and answer session ahead of FC United's Northern Premier League encounter with Stockton Town on Saturday, The 1958 spokesman Steve Crompton explained the difficulties with mass protests.\n\"Tourist fans far outweigh legacy fans,\" he said. \"You are not going to get someone travelling halfway round the world not to go into a game.\n\"Against Aston Villa [in April 2023] around 3,000 fans stayed out when the game started but optically, it makes absolutely no difference whatsoever.\"\nThe collaboration with FC United, which initially will involve shared ideas and experiences, is the first formal link-up between the club and an organised United supporter group since the 2005 split.\nThere has been unease between some involved in the two sides over the past decade, with FC United fans feeling they took a moral and principled stand by walking away to ensure, as they see it, none of their money went to the Glazer family.\nSome United fans felt walking away was a sign of disloyalty.\nThere was a question to The 1958 representatives at Broadhurst Park asking whether they would come back on a day Manchester United were playing, with the response 'this is a one-off then' when the answer came back no.", "url": "https://www.bbc.com/sport/football/articles/c86p66lneweo"}