{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:34:49", "date_modify": "2025-04-26 04:34:49", "date_publish": "2025-02-28 12:47:20", "description": "Stoke City boss Mark Robins says a visit to the club by former SAS Patrol Commander Melvyn Downes was an inspiration.", "filename": "sport_football_articles_clyzzdr9pnro_1745642089.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6ef1/live/d18b2fd0-f5cf-11ef-85ee-0589f92b739a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_clyzzdr9pnro_1745642089.html", "title": "Stoke City: Mark Robins calls SAS visit 'inspirational' for Potters", "title_page": "Stoke City: Mark Robins calls SAS visit 'inspirational' for Potters - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Mark Robins says a visit from former SAS Warrant Officer Melvyn Downes on Thursday provided some inspiration to his Potters squad.\nStoke-born City fan Downes served 24 years in the British Army, the majority with the Special Air Service, and has gone on to train special forces around the world as well as appearing on reality TV series SAS: Who Dares Wins.\nWhile the tasks facing Stoke's players are vastly different to those experienced by Downes around the globe, Robins invited him to give a talk on facing adversity and rising to challenges as they sit five points above the Championship relegation zone after three defeats in their past four games.\nRobins told BBC Radio Stoke: \"Listening to different people from different walks of life is always interesting.\n\"His story is a really interesting one. He was obviously in a tough environment wherever he went in his career. He's still here to tell the tale.\n\"It's inspiring to listen to people who have had those experiences in life and how they've dealt with them. What Army and SAS people go through, trained specialists - that obviously has an impact on you for the rest of your life.\n\"It was inspiring to listen to.\"", "url": "https://www.bbc.co.uk/sport/football/articles/clyzzdr9pnro"}