{"authors": ["Sam Dalling", "www.facebook.com"], "date_download": "2025-05-20 13:11:47", "date_modify": "2025-05-20 13:11:47", "date_publish": "2023-08-01 07:06:56", "description": "In the first of our England Next Gen series we look at Yorkshire and Southern Brave spinner Jafer Chohan - and learn how his studious note-taking is bringing out improvement.", "filename": "sport_cricket_65883947_1747746707.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/148D3/production/_130597148_england_nxtgen_jaferchohan.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_65883947_1747746707.html", "title": "Jafer Chohan: Why Yorkshire's breakout star has gone 'old school' in quest for success", "title_page": "Jafer Chohan: Why Yorkshire's breakout star has gone 'old school' in quest for success - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Throughout the 2023 Hundred, BBC Sport is running a feature series called England Next Gen, designed to look at players who may make the step up to international cricket in the next few years. We start with Southern Brave and Yorkshire spinner Jafer Chohan.\nJafer Chohan carries with him a handwritten notebook.\nYorkshire's 2023 breakout star is a fastidious cricket student, peeping under every stone to complete his preparation.\nBut the 21-year-old Chohan is not entirely sure why he went 'old school'.\n\"It just felt more proper like that,\" he explains. \"I try to write down things I can learn. I study all the batters I come up against, so I've got that for each game in my book. It's about getting better.\n\"Previously, I made notes on my phone but sometimes I was going through the motions. Now I'm at a more challenging level, I really need to be more switched on - I don't want to get found out!\"\nChohan holds wisdom beyond his age. That is doubtless why, after just 13 professional appearances, Southern Brave have selected him as Rehan Ahmed's understudy for this summer's Hundred.\nFrom club cricketer to 'wildcard' pick for The Hundred in less than 12 months, Chohan's rise is remarkable.\nPrior to signing a rookie county deal last winter with Yorkshire, Chohan was self-taught. He would scour YouTube, gleaning every snippet of information possible.\n\"It is not just watching every leg-spinner,\" he tells BBC Sport. \"It's homework - slowing things down; trying to figure out different types of grips and deliveries; analysing the fields; looking at what they're bowling to different batters.\n\"Having that deep analysis puts me in a much better place. If I just pick up one or two things, it's great. I've only played a handful of T20 games, but it feels like I've played a lot more.\"\nChohan can also pick the brains of Amar Rashid - brother of England and Yorkshire's Adil, and head coach of the Adil Rashid Cricket Academy. Rarely does a day pass without the pair speaking.\n\"I love bowling and I love working hard,\" Chohan says. \"I just want to find any single way I can to get better.\"\nThere are various tales as to how Chohan came to Yorkshire's attention.\nIn truth, there were several moving parts. Darren Gough, the county's managing director of cricket, first heard Chohan's name through his son Liam.\nGough Jr had made an unbeaten hundred for Rushden and Higham Town in the Northamptonshire Premier League, but told his dad that night of an unpickable Geddington leggie.\nA few months later, with England's T20 side en route to a world title in Australia, several of the Test squad were at Loughborough University preparing for last December's Pakistan tour.\n\"They asked for net bowlers,\" recalls Chohan, an engineering student. \"I bowled at Joe Root for a couple of hours. Afterwards, he spoke to me and asked for contact details, telling me to leave them somewhere.\n\"I was star-struck that he was even speaking to me, never mind asking me that. I did get a bit flustered.\"\nSo flustered, in fact, that Chohan forgot to leave his details. But he was not to be stopped.\n\"I'd worked for a very long time to try to get somewhere, and to get an opportunity like that… Joe Root's recommendation is not a bad one to have. I thought, 'I have to make the most of this'.\"\nFortunately, Chohan had also played National Counties cricket for Berkshire under Tom Lambert in 2022.\nThat led to a recommendation to another Tom - Tom Brown, the managing director of the South Asian Cricket Academy (SACA).\nIt was Brown who contacted former SACA coach Kabir Ali, then of Yorkshire, and suddenly Chohan was on trial at Headingley.\n\"I had thought the best-case scenario was that if I bowled well in the nets, I might get to train with them over the winter, play some twos cricket and possibly get signed from that,\" he admits.\nYet just two sessions in, head coach Ottis Gibson pulled him aside and offered terms.\n\"To be honest it was a bit of a punt,\" says Chohan. \"I'd played no second-team cricket and they hadn't really seen much of me. Thankfully now, it's starting to pay off.\"\nPrior to his Yorkshire gig, Londoner Chohan had fallen through the cracks.\nBetween the ages of nine and 17, he played for his home county Middlesex, but a contract never materialised.\nThat was based around his school commitments with Harrow, for whom he appeared twice at Lord's against Eton.\n\"Those games helped build hunger,\" he says. \"Everyone dreams of playing at Lord's for England. That was certainly my dream and still is now.\n\"Those games gave me the desire to try and make something out of cricket - I didn't want the highlight of my career to be a school game.\"\nFor a few years, though, Chohan had settled for \"going to random parks with a couple of mates, talking about leg-spin bowling and figuring things out for myself.\"\nHe is too young to remember West Indian Gibson and England hero Gough's playing days, but has seen video clips. Plus, he used to listen to Gough's radio show on the school run.\n\"I'm trying not to fanboy too hard with some of these players,\" responds a laughing Chohan.\n\"Playing with Jonny Bairstow - I try to act as if it's completely normal but my head is saying, 'this is so cool'. I'm bowling my first ball in professional cricket and Jonny Bairstow is keeping!\"\nIf Chohan feels pressure though, it is not evident. In fact, he says \"it is exactly what I play cricket for\".\nAnd, evidently, he is loving Yorkshire life despite the club being in a \"rebuilding phase\".\nAdversity, he says, has made for \"a very tight-knit group\" and Chohan is also conscious of his status as a British-Asian professional cricketer.\nHe looked up to Rashid and his fellow England international Moeen Ali, who made him \"feel like I could do this\".\n\"That's my aim,\" says Chohan. \"To be a role model for other people and make them feel like they can achieve these sorts of goals. Hopefully I can help identify the issues that are present in the county systems and slowly, slowly, make them better.\"", "url": "https://www.bbc.com/sport/cricket/65883947"}