{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:51:00", "date_modify": "2025-05-20 12:51:00", "date_publish": "2023-08-03 12:29:26", "description": "Wolves: Kalajdzic talks of \"joy and relief\" at first start after ACL injury", "filename": "sport_articles_cd1wl2wj91go_1747745460.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2982/live/72bcef70-31f4-11ee-8f52-fbf70e4bf742.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cd1wl2wj91go_1747745460.html", "title": "Wolves: Kalajdzic talks of \"joy and relief\" at first start after ACL injury", "title_page": "Wolves: Kalajdzic talks of \"joy and relief\" at first start after ACL injury - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wolves striker Sasa Kalajdzic has spoken of his \"relief\" at playing 60 minutes in Wednesday's 0-0 pre-season draw with Luton Town as he continues his return from a serious knee injury.\n\"In the beginning I didn't even think about it but after I got out I was realising and I was just smiling and very relieved,\" he said after the match.\n\"Just happy that everything went well. Right now it's just the joy and relief of being back.\"\nIt was the first time the Austrian has started a match since damaging his ACL on his club debut in September 2022 and Wolves boss Julen Lopetegui will be hoping his return can boost an attack that often misfired last season.\n\"I was just trying to soak it up,\" Kalajdzic added when asked about returning to action at Molinuex for the first time in almost a year.\n\"I was focused, I was in my own tunnel. As soon as I had my first touched I was just trying to enjoy it, and I did.\n\"For me it [the match against Luton] is crucial because now I've had a good pre-season. I couldn't do all the things the others have done because sometimes you have to take me out because it's too much.\n\"I think this was the best game I could have had right now in my situation. It was an amazing test for the physicality, the pace and everything. I played almost 60 minutes so it's getting more and more.\"", "url": "https://www.bbc.com/sport/articles/cd1wl2wj91go"}