{"authors": ["Emma Smith", "www.facebook.com"], "date_download": "2025-05-20 13:22:21", "date_modify": "2025-05-20 13:22:21", "date_publish": "2023-07-25 06:00:42", "description": "South Korea manager Colin Bell says \"at least we made one bit of history today\" despite the 2-0 Women's World Cup defeat by Colombia.", "filename": "sport_football_66297492_1747747341.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/074E/production/_130507810_gettyimages-1568708027.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66297492_1747747341.html", "title": "Casey Phair: South Korea teenager makes history as youngest World Cup player", "title_page": "Casey Phair: South Korea teenager makes history as youngest World Cup player - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "While reflecting on South Korea's disappointing Women's World Cup defeat by Colombia, manager Colin Bell wryly remarked: \"At least we made one bit of history today.\"\nHe was speaking about Casey Phair, who became the youngest player at a World Cup, male or female.\nAged 16 years 26 days, the forward was introduced in the 77th minute from the substitutes' bench in South Korea's 2-0 loss to Colombia at Sydney Football Stadium.\nShe beat the youngest player record held by Nigeria's Ifeanyi Chiejine, who was 16 years 34 days when she played at the 1999 World Cup.\nThe men's record at a World Cup is held by Northern Ireland striker Norman Whiteside, who was 17 years 40 days old when he played against Yugoslavia in 1982.\nHaving earned two caps for the country's Under-17s - in which she scored five goals - Phair was called up for the World Cup. English manager Bell was keen to blood Phair as a sign of the future for South Korean football - and a warning to his players in the present.\n\"She's been great in camp,\" Bell said after the game. \"It is difficult for a player to come on at any age at 2-0 down to make an impact.\n\"But I wanted to throw her in to give her that experience, and as a signal to everyone in our squad that these kind of players are the future.\"\nPhair's youth contrasts sharply with the rest of the squad. Bell named a South Korea starting XI with an average age of 30 years 329 days - the oldest named by any team at the Women's World Cup.\nBell could not hide his frustration at some of his senior players after the match, as they were well beaten by a Colombia side featuring another teenage talent.\nColombia's Linda Caicedo, aged 18 years 153 days, scored the second goal under minimal pressure from the opposition to become the second-youngest South American player to score a goal at the Women's World Cup, with only Brazil icon Marta doing so at a younger age.\nIt was that absence of a tackle which infuriated Bell, and his admiration of Phair was further explained when she was thrown on in the final minutes.\nPhair, who is 5ft 8in, threw herself into a couple of challenges, which is exactly what her manager had called for.\n\"She's deserved to get the chance to play,\" Bell said. \"She has trained really well, as good as anyone else.\n\"Casey is the future of this team. We need strong, fast players with physicality.\n\"We're still in the competition. We still have chances to progress but we need more intensity. We need that at club level in South Korea, need that type of player.\n\"Casey has the speed and power - that's where the rest of the team needs to step up.\"\nBell indicated he would make changes to his starting XI for South Korea's next game against Morocco on Sunday. Based on what he has said, we should expect to see more of Phair.", "url": "https://www.bbc.com/sport/football/66297492"}