{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:15:28", "date_modify": "2025-05-21 04:15:28", "date_publish": "2025-04-05 19:20:31", "description": "As Everton defender James Tarkowski gains an unusual yellow card record, we ask: Which Premier League players have received the most bookings?", "filename": "sport_football_articles_c4g23rlzne5o_1747800928.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a866/live/ec284c40-1246-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c4g23rlzne5o_1747800928.html", "title": "James Tarkowski: Everton defender makes history with most yellow cards without a red, but who has most top-flight bookings?", "title_page": "James Tarkowski: Everton defender makes history with most yellow cards without a red, but who has most top-flight bookings? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Everton defender James Tarkowski made history on Saturday when he received the 64th Premier League booking of his career.\nIt means he has the highest number of yellow cards of any player in the competition never to have received a red.\nThe 32-year-old was cautioned for a foul on Arsenal full-back Myles Lewis-Skelly as the Toffees drew 1-1 against the Gunners at Goodison Park.\nThe record-breaking caution came after captain Tarkowski received a yellow card for a foul on Alexis Mac Allister against Liverpool on Wednesday - though the Premier League's refereeing body later acknowledged he should have been dismissed.\nTarkowski now holds the unique record having played 301 Premier League matches without seeing red.\nOverall, he has received one red card in his whole career - a straight red while playing for Brentford in the Championship.\nWith six bookings this season, he has overtaken former Chelsea and Southampton midfielder Oriol Romeu and former Tottenham, Charlton and Aston Villa defender Luke Young on the list of the most Premier League bookings without receiving a red card.", "url": "https://www.bbc.com/sport/football/articles/c4g23rlzne5o"}