{"authors": ["Alex Howell", "www.facebook.com"], "date_download": "2025-05-21 06:07:27", "date_modify": "2025-05-21 06:07:27", "date_publish": "2025-04-01 19:49:55", "description": "Bukayo Saka enjoys goalscoring return for Arsenal, but defensive worries hit Gunners as Gabriel looks set to miss Champions League tie.", "filename": "sport_football_articles_c4g243mjy2zo_1747807647.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b281/live/fffc42a0-0f83-11f0-9dfb-d92aba7031b7.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c4g243mjy2zo_1747807647.html", "title": "Arsenal: Bukayo Saka's goalscoring return, but defensive worries hit Gunners", "title_page": "Arsenal: Bukayo Saka's goalscoring return, but defensive worries hit Gunners - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "While Arteta will sweat on their fitness for Real Madrid's first-leg visit next Tuesday, Saka helped take his manager's mind off injuries just seven minutes into his return as his goal sealed three points for an Arsenal side that has missed his quality.\nThe joy of seeing the 23-year-old back, and on the scoresheet, was clear among their supporters and the England international ran to celebrate with the club's lead physical performance coach Sam Wilson, who had helped him in his comeback.\n\"Yes, I think a beautiful moment to see how much our people love, respect and admire Bukayo.\" Arteta said of the celebrations following Saka's 73rd-minute goal.\n\"He's not a surprise to any of us and I think the best example is his reaction.\n\"Immediately after scoring a goal, what does he do? He goes and says thank you for all the hard work that all the sports science guys, physios and everybody involved in the recovery have done for him to be able to be in the condition that he is.\n\"I think he lifted the stadium, the energy and great to have him back.\"\nArsenal have struggled to break teams down in Saka's absence and that has been made worse with season-ending injuries to Havertz and Brazil forward Gabriel Jesus that derailed their Premier League title bid.\nThe pattern of them having lots of possession and not creating goalscoring opportunities is one supporters have seen a lot this season, and was shown again in the first half before makeshift striker Mikel Merino scored the 37th-minute opener.\nCheered by fans when his name was read out, Saka received a standing ovation when he warmed up for the first time and again when he returned to the pitch for the first time since December.\nArsenal supporters, and the club, know how important he is, and with the Champions League the only trophy left available to them this season, they need him to have any chance of getting past European champions Real Madrid in the last eight.\nThe stats back up the impact Saka has when he is in the side too.\nIn the 16 Premier League games when he was available before his injury, the Gunners scored 34 goals at a rate of 2.1 per game.\nIn the 13 he subsequently missed, they scored 19 at a rate of 1.5 per match.\nTheir points per game dropped from 2.1 to 1.9 in the time he was sidelined, while the expected goals also dropped from 1.9 to 1.2 per match and big chances per game also falling from 3.4 to 2.4 without him.\n\"It's clear to see Arsenal's fall away in the Premier League [since his injury]. There is a huge reliance on Saka and, while he has been out, they have hugely missed him.\" former Brighton striker Glenn Murray told BBC Radio 5 Live.\n\"He is back now and just in time for Real Madrid next week. It's a huge game and he will have that firmly in his sights.\n\"I think the return of Saka not only lifts the players but the whole place. Arsenal have needed a lift in all honesty.\"\nThe win over Fulham moved them to within nine points of league leaders Liverpool but the Gunners have played a game more and Murray admitted Saka's absence has been a huge reason for that.\n\"They have seen the Premier League title drifting away from them in recent weeks, they've not had a number nine and have been without their 'starboy' Saka,\" he added.\n\"There feels like there's been a lift in belief around the Emirates. Even if he is not at full tilt immediately he will bring so much to those around him.\n\"Saka is the difference maker. He just knows where to be, what to do. This time he arrives right on time at the back post to nudge the ball into an empty net.\"\nIt seems unlikely centre-back Gabriel is going to recover from a suspected hamstring injury in six days to play in a European quarter-final.\nHe is a key player for Arteta at both ends of the pitch and it will be a huge blow to Arsenal if ruled out of the Real Madrid tie.\nThe 27-year-old has scored three goals and has three assists in 28 Premier League games this season and no defender has scored more goals than the Brazilian's 17 since his debut against Fulham in September 2020.\nGabriel's injury will be assessed as Arteta confirmed: \"Gabi felt something in his hamstring.\n\"We don't know how big that is and with Jurrien as well. He was already struggling very early in the game. He managed to continue, at some point he couldn't, so that's the downside to it.\"\nArsenal's win percentage suffers when Gabriel is out of the team. The team's win percentage is 63.50% from the 159 games he has played since his Premier League debut compared to 40.90% in the 22 games he has missed in the league during that time.\nGabriel has been one of Arsenal's best performers in a challenging season and team-mate Declan Rice acknowledged his value to their Champions League chances.\n\"I don't know what's happened, I hope he's OK because he's been arguably our best player this season and we need him for big matches and big occasions.\" added Rice.\nDespite the setbacks and not being able to name a settled line-up for the majority of this campaign, Arteta said he was looking forward to future challenges.\n\"The good thing is that it's been like this the whole season.\" he added.\n\"You see [Gabriel] Martinelli today, you say we missed him three months. You see Bukayo four months, Kai four months, Gabi Jesus, almost the whole season.\n\"How we have managed to be where we are with all those injuries, Ben White hasn't participated at all this season.\n\"It's what it is. We want it so much that we're going to give it a real go and we are very excited for the next week.\"", "url": "https://www.bbc.com/sport/football/articles/c4g243mjy2zo"}