{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:50:41", "date_modify": "2025-04-26 06:50:41", "date_publish": "2025-02-28 18:10:51", "description": "Motherwell goalkeepr Balcombe targets top-six push under 'positive' Wimmer", "filename": "sport_articles_cewkg1y25e1o_1745650241.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/981b/live/c10df7a0-f5f7-11ef-9de2-8d109cf4aecf.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cewkg1y25e1o_1745650241.html", "title": "Balcombe targets top-six push under 'positive' Wimmer", "title_page": "Motherwell goalkeepr Balcombe targets top-six push under 'positive' Wimmer - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Motherwell goalkeeper Ellery Balcombe says new manager Michael Wimmer has brought a \"much more positive outlook\" to the club.\nThe Steelmen arrested a run of seven games without a win by beating Dundee in midweek on Wimmer's home debut and second game in charge after replacing Stuart Kettlewell.\n\"Obviously it's been a tough time. I think the manager coming in and giving that real positive impact has just settled us down a bit,\" Balcombe said.\n\"Wednesday was massive for us. It's good to get that first three points after what we've been through, but hopefully it's just a start.\"\nWimmer is now the second-newest manager in the top flight, with Barry Ferguson, who is now in the Ibrox dugout, next up for the German and his side in Govan on Saturday.\n\"The manager has been really positive and is just trying to keep all the boys in that same sort of mindset. So definitely upwards and onwards,\" added Balcombe.\n\"It's a much more positive outlook. He wants us to play football and not go long all the time, which is what I suit anyway, so I prefer to do that.\"\nBalcombe, 25, had an unsettled start to the year but is hopeful he can now kick on at Fir Park.\nHe had started 2025 on loan at St Mirren and briefly returned to Brentford before moving on loan to Motherwell, where he played under three managers in his first four games, including caretaker Stephen Frail.\n\"It's been a bit of a whirlwind, but it's football and I'm just looking to play games and help out the team,\" he added. \"It's football and these sort of things happen.\n\"I've played under four or five gaffers in a span of six months, so this is nothing to me. It's just how football works and hopefully now the boys can really get around the gaffer and going forward we can get that top six like we want.\"", "url": "https://www.bbc.co.uk/sport/articles/cewkg1y25e1o"}