{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:58:23", "date_modify": "2025-05-20 12:58:23", "date_publish": "2023-08-02 19:41:18", "description": "Britain's Lora Fachie qualifies fastest for the B individual pursuit at the Cycling World Championships nine months after giving birth.", "filename": "sport_disability-sport_66390281_1747745903.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/972E/production/_130620783_gettyimages-1234908144.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_disability-sport_66390281_1747745903.html", "title": "Cycling World Championships: Lora Fachie qualifies fastest nine months after giving birth", "title_page": "Cycling World Championships: Lora Fachie qualifies fastest nine months after giving birth - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Britain's Lora Fachie returned after becoming a mother by qualifying fastest for the women's B individual pursuit at the UCI Cycling World Championships in Glasgow.\nFachie and pilot Corrine Hall finished 0.204 seconds ahead of GB team-mates Sophie Unwin and Jenny Holl.\nThe two-time Paralympic champion, who is married to fellow Para-cyclist Neil, gave birth to son Fraser in October.\n\"It felt incredibly emotional returning to racing with my son there,\" she said.\n\"It spurred me on to qualify fastest, just under two seconds off my own world record. Not bad considering I'm only nine months post partum.\"\nFachie and Hall will face Unwin and Holl in Friday's final at the Sir Chris Hoy Velodrome.\nThere will also be an all-British final in the men's C3 pursuit on Sunday after defending champion Fin Graham and Paralympic champion Jaco van Gass qualified first and second.\nScotland's Graham, 23, clocked three minutes 18.662 seconds to finish 3.410secs ahead of Van Gass and lay down a marker.\nElsewhere, there was a world record for Daphne Schrager in the women's C2 individual pursuit qualifying.\nThe 22-year-old won the C3 title in 2022 but was reclassified this year. She beat the previous C2 record held by Switzerland's Flurina Rigling by more than 10 seconds and will face Rigling for gold on Friday.\nFran Brown will take on China's Qian Wangwei in the final of the women's C1 pursuit while Britain are guaranteed another medal in the men's B pursuit with Steve Bate and Chris Latham taking on Chris McDonald and Adam Duggleby for bronze.\nMorgan Newberry (women's C5 pursuit), Ryan Taylor (men's C2 pursuit), Sam Ruddock (men's C1 pursuit) and Katie Toft (women's C1 pursuit) will also ride for bronze in their events.", "url": "https://www.bbc.com/sport/disability-sport/66390281"}