{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:59:04", "date_modify": "2025-05-21 06:59:04", "date_publish": "2024-12-24 06:30:01", "description": "As Pep Guardiola and Manchester City's current crisis continues, Spanish football expert Guillem Balague takes a look at their issues - and potential solutions.", "filename": "sport_football_articles_c7vemyd9g50o_1747810744.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/81a5/live/f343f460-c10c-11ef-a2ca-e99d0c9a24e3.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c7vemyd9g50o_1747810744.html", "title": "Pep Guardiola: 'Self-doubt, errors and big changes", "title_page": "Pep Guardiola: 'Self-doubt, errors and big changes - inside crisis at Man City' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Guardiola has also been giving it a lot of thought. He has not been sleeping very well, as he has said, and has not been himself at times when talking to the media.\nHe has been talking to a lot of people about what is going on as he tries to work out the reasons for City's demise. Some reasons he knows, others he still doesn't.\nWhat people perhaps do not realise is Guardiola hugely doubts himself and always has.\nHe will be thinking \"I'm not going to be able to get us out of this\" and needs the support of people close to him to push away those insecurities - and he has that.\nHe is protected by his people who are very aware, like he is, that there are a lot of people that want City to fail.\nIt has been a turbulent time for Guardiola. Remember those marks he had on his head after the 3-3 draw with Feyenoord in the Champions League?\nHe always scratches his head, it is a gesture of nervousness. Normally nothing happens but on that day one of his nails was far too sharp so, after talking to the players in the changing room where he scratched his head because of his usual agitated gesturing, he went to the news conference.\nHis right-hand man Manel Estiarte sent him photos in a message saying \"what have you got on your head?\", but by the time Guardiola returned to the coaching room there was hardly anything there again.\nHe started that day with a cover on his nose after the same thing happened at the training ground the day before. Guardiola was having a footballing debate with Kyle Walker about positional stuff and marked his nose with that same nail.\nThere was also that remarkable news conference after the Manchester derby when he said \"I don't know what to do\".\nThat is partly true and partly not true.\nIgnore the fact Guardiola suggested he was \"not good enough\". He actually meant he was not good enough to resolve the situation with the group of players he has available and with all the other current difficulties.\nThere are obviously logical explanations for the crisis and the first one has been talked about many times - the absence of injured midfielder Rodri.\nYou know the game Jenga? When you take the wrong piece out, the whole tower collapses. That is what has happened here.\nIt is normal for teams to have an over-reliance on one player if he is the best in the world in his position. And you cannot calculate the consequences of an injury that rules someone like Rodri out for the season.\nCity are a team, like many modern ones, in which the holding midfielder is a key element to the construction.\nSo, when you take Rodri out, it is difficult to hold it together. There were Plan Bs - John Stones, Manuel Akanji, even Nathan Ake - but injuries struck.\nThe big injury list has been out of the ordinary and the busy calendar has also played a part in compounding the issues.\nHowever, one factor even Guardiola cannot explain is the big uncharacteristic errors in almost every game from international players.\nWhy did Matheus Nunes make that challenge to give away the penalty against Manchester United? Jack Grealish is sent on at the end to keep the ball and cannot do that. There are errors from Walker and other defenders. These are some of the best players in the world.\nOf course the players' mindset is important, and confidence is diminishing. Wrong decisions get taken so there is almost panic on the pitch instead of calm.\nThere are also players badly out of form who are having to play because of injuries.\nWalker is now unable to hide behind his pace, I'm not sure Kevin de Bruyne is ever getting back to the level he used to be at, Bernardo Silva and Ilkay Gundogan do not have time to rest, Grealish is not playing at his best.\nSome of these players were only meant to be playing one game a week but, because of injuries, have played 12 games in 40 days. It all has a domino effect.\nOne consequence is that Erling Haaland isn't getting the service to score. But the Norwegian still remains City's top-scorer with 13. Defender Josko Gvardiol is next on the list with just four.\nThe way their form has been analysed inside the City camp is there have only been three games where they deserved to lose (Liverpool, Bournemouth and Aston Villa). But of course it is time to change the dynamic.\nGuardiola has never protected his players so much. He has not criticised them and is not going to do so. They have won everything with him.\nInstead of doing more with them, he has tried doing less. He has sometimes given them more days off to clear their heads, so they can reset - two days this week for instance.\nPerhaps the time to change a team is when you are winning, but no-one was suggesting Man City were about to collapse when they were top and unbeaten after nine league games.\nSome people have asked how bad it has to get before City make a decision on Guardiola. The answer is that there is no decision to be made.\nMaybe if this was Real Madrid, Barcelona or Juventus, the pressure from outside would be massive and the argument would be made that Guardiola has to go. At City he has won the lot, so how can anyone say he is failing?\nYes, this is a crisis. But given all their problems, City's renewed target is finishing in the top four. That is what is in all their heads now.\nThe idea is to recover their essence by improving defensive concepts that are not there and re-establishing the intensity they are known for.\nGuardiola is planning to use the next two years of his contract, which is expected to be his last as a club manager, to prepare a new Manchester City.\nWhen he was at the end of his four years at Barcelona, he asked two managers what to do when you feel people are not responding to your instructions.\nDo you go or do the players go? Sir Alex Ferguson and Rafael Benitez both told him that the players need to go.\nGuardiola did not listen because of his emotional attachment to his players back then and he decided to leave the Camp Nou because he felt the cycle was over.\nHe will still protect his players now but there is not the same emotional attachment - so it is the players who are going to leave this time.\nIt is likely City will look to replace five or six regular starters. Guardiola knows it is the end of an era and the start of a new one.\nChanges will not be immediate and the majority of the work will be done in the summer. But they are open to any opportunities in January - and a holding midfielder is one thing they need.\nIn the summer City might want to get Spain's Martin Zubimendi from Real Sociedad and they know 60m euros (£50m) will get him.\nHe said no to Liverpool last summer even though everything was agreed, but he now wants to move on and the Premier League is the target.\nEven if they do not get Zubimendi, that is the calibre of footballer they are after.\nA new Manchester City is on its way - with changes driven by Guardiola, incoming sporting director Hugo Viana and the football department.", "url": "https://www.bbc.com/sport/football/articles/c7vemyd9g50o"}