{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:43:33", "date_modify": "2025-04-26 03:43:33", "date_publish": "2025-03-05 00:00:00", "description": "South Africa face New Zealand in the Champions Trophy semi-final in Lahore - follow live cricket scores, text updates, in-play video clips and radio commentary", "filename": "sport_cricket_live_c8059yx3ejdt_1745639013.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7ac9/live/f576c060-f9d7-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_cricket_live_c8059yx3ejdt_1745639013.html", "title": "Relive New Zealand thumping South Africa to reach the Champions Trophy final", "title_page": "Relive New Zealand thumping South Africa to reach the Champions Trophy final - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Goodbye\nThere we have it, New Zealand will take on unbeaten India for the Champions Trophy title.\nIf you missed any of today's action, here's Sam Drury's match report for you to enjoy.\nThe final will be played in Dubai, and we will be here to bring you live text commentary and video clips from 9:00 GMT on Sunday. Both teams are in great form, so let's hope we're in for a contest - make sure you join us then!\n'We were challenged by a good side'\nNew Zealand captain Mitchell Santner on the win: \"It's a cool feeling. Today we were challenged by a good side. We look forward to Dubai, we're expecting something similar in the surface. We'll get there, recover and prepare.\"\n\"The platform we were able to set was vital. We were happy with 360 but with the power that South Africa have, we knew it would be a challenge. We just tried to chip away and take some wickets in the middle.\"\nOn his performance: \"It was good. What we speak about as a group is about applying pressure, keep being aggressive with the ball and trying to take wickets. In a chase like that, if you don't get them out, they are going to catch up.\"\nOn Kane Williamson: \"That partnership was massive for us. It looked like he might've been frustrated at times but he kept going and got through the periods that South Africa challenged us. Everyone else was able to contribute and chip in.\"\nOn the final: \"I think being there and putting India under pressure at times was good for our confidence going forward. You kind of take out which things worked and which things didn't. Winning the toss might be nice.\"\n'We left too much for the middle order to do'\nSouth Africa captain Temba Bavuma: \"I do think they were above par. As well as they batted, anything over 350, we'd back ourselves to chase with the wicket hopefully getting better.\n\"From a batting point of view, we didn't get those partnerships. There were one or two there but we needed either myself or Rassie van der Dussen to emulate their top four.\n\"363 was always going to be tough. We needed someone to play well. David [Miller] did that but we needed someone else.\n\"They put us under pressure from the get-go, the way they were able to pierce the off side and keep scoring boundaries in the middle phase. Normally we pride ourselves on our ability to take wickets, especially in the middle period, and if you go into the death phase with wickets in hand, it's difficult to contain. Credit to their batters, they put us under pressure.\"\nOn what the turning point was in South Africa's chase: \"At 125-1 with myself and Rassie still batting, you wanted both of us to keep going until the 30th over. We know how destructive our middle order can be when they come in in the last 20 overs.\n\"We weren't able to do that. A soft dismissal for me, a better one for Rassie. We left too much for the middle order to do.\"\nPost\nPlayer of the match Rachin Ravindra: \"It's always a great feeling to contribute to the team. To get an emphatic win on the semi-final stage like this, I couldn't be happier.\n\"I didn't start as well as I wanted to. South Africa bowled well which limited me a little bit. Being able to work with the guys on my team is what helped me the most. It was great to be able to build some partnerships out there and it was nice to have them out there to help me.\n\"We were thinking about the 300 mark. The ball was holding, their cutters were getting a lot of bounce. Kane started accelerating nicely, then it went up from there.\n\"The thing about tournament cricket is that it's all about what's next but we're just going to take in the moment. We'll reflect on the day, chill out tonight and when we get to Dubai we'll switch on.\"\nPost\nVic Marks\nFormer England spinner on BBC Radio 5 Sports Extra\nIt was a tepid ending and New Zealand wouldn't have enjoyed the last five overs.\nThe Kiwis are the content ones, not David Miller who got his 100.\nI'm not sure if Mitchell Santner got it right, but the fact is they've still romped to victory.\nThey didn't manage to beat India the other night but they have a chance to do it in the final.", "url": "https://www.bbc.co.uk/sport/cricket/live/c8059yx3ejdt"}