{"authors": ["Tom Rostance", "www.facebook.com"], "date_download": "2025-05-19 14:40:15", "date_modify": "2025-05-19 14:40:15", "date_publish": "2017-08-04 15:01:25", "description": "Arsenal begin the season with a penalty shootout victory against Chelsea in the Community Shield at Wembley.", "filename": "sport_football_40766983_1747665615.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/124FB/production/_97230057_mediaitem97230055.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_40766983_1747665615.html", "title": "Arsenal 1-1 Chelsea (Arsenal won 4-1 on pens)", "title_page": "Arsenal 1-1 Chelsea (Arsenal won 4-1 on pens) - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Alvaro Morata missed a penalty on his Chelsea debut as Arsenal won an uncharacteristically feisty Community Shield in a shootout at Wembley.\nRecord signing Morata - a late substitute - dragged a poor effort wide moments after goalkeeper Thibaut Courtois had blazed over in a first use of a new penalty shootout system.\nPremier League champions Chelsea had gone ahead through Victor Moses, before Pedro was sent off for an ugly lunge on Mohamed Elneny.\nFrom the resulting free-kick, debutant Sead Kolasinac headed the Gunners level to take the match to penalties.\nThe shootout - the first in English football to follow the ABBA format - saw Chelsea miss back-to-back penalties to allow Olivier Giroud to win the match from the spot.\nLevel at 90 minutes, the match went straight to penalties, which were taken in the ABBA format.\nDesigned to prevent a perceived advantage to the team going first, the system sees team A take the first kick followed by team B - before team B go again. Team A then get two successive penalties, a little like the tie-break in tennis, and so on until there is a winner.\nConfused? You are not alone as not even the players seemed to understand.\nAfter Gary Cahill's opener for Chelsea was cancelled out by Theo Walcott, Arsenal defender Nacho Monreal stepped forward, correctly, to take his kick. However he was waved back by several of his Gunners team-mates, who seemed confused by the new format.\nMonreal scored, before Courtois and Morata both missed horribly, to the delight of the Arsenal fans behind the goal.\nThat allowed first Alex Oxlade-Chamberlain and then Giroud to score and start the Arsenal celebrations.\nThe Community Shield can be a rather tame occasion, more pre-season friendly than kick-start, but referee Bobby Madley was kept busy in a fiercely contested affair.\nChelsea were first to be upset when winger Willian was booked for a dive in the first half as he went down under a challenge from Hector Bellerin in the penalty area. Replays suggested that the Brazilian was tripped by his own feet, but also that Bellerin may have made contact beforehand.\nIf that was a tricky call for Madley, his decision to send off Pedro with 10 minutes remaining was more straightforward. The forward was late and high on Elneny, raking the Arsenal man's Achilles with his studs.\nAntonio Conte was angered by the decision though, and by his team's marking from the free-kick as they let Kolasinac head home from six yards out.\nUntil the red card, it looked like being victory for the champions, who shook off a sleepy first 20 minutes to have the better of the game.\nThey deservedly took the lead in the opening minute of the second half as Granit Xhaka's dreadful clearance from a corner was headed back in by Gary Cahill for Moses to finish with opportunism.\nIt looked a long way back from there for Arsenal, especially as they were without key duo Alexis Sanchez and Mesut Ozil, left out of the squad altogether by Arsene Wenger.\nSanchez only returned to training on Tuesday after illness, having taken an extended break following his participation in the Confederations Cup with Chile, while Ozil picked up a minor knock in training in the week and was not risked.\nIn their absence, the focus was on record signing Alexandre Lacazette, the only debutant to start for either side. The £46.5m man faded after having the best moment of the first period, wrapping a shot against the post after a flowing counter-attack, which he started in his own half.\nAn out-and-out striker who doesn't stray far from the penalty area, he showed enough to suggest that he will add a focal point to the Arsenal attack - particularly when partnered by Ozil and Sanchez.\nArsenal manager Arsene Wenger:\n\"Well, I don't know if it was a sending off or not but at that moment we were dominating. We had some difficult moments at the start of the second half but after that we dominated. We always looked dangerous.\n\"It is a dream to make the fans happy, a difficult dream, but we try hard. I would like that they stand behind the team as we might go through some very good periods and some not so good periods.\n\"We want to be united and together throughout the season.\"\nChelsea boss Antonio Conte:\n\"I didn't see the situation with the sending off. For this reason, it is very difficult for me to say something about this decision. This is the second game, after the FA Cup [final], that we finish with 10 men.\n\"I heard there was clearly a penalty but I did not see. We are working, we are trying to do our best. We had a tough pre-season, between the six days until we start the league it is important to be focused on the next game.\"", "url": "https://www.bbc.com/sport/football/40766983"}