{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:22:48", "date_modify": "2025-05-21 05:22:48", "date_publish": "2025-04-03 00:00:00", "description": "Stephen Bunting is victorious on night nine in Berlin, having previously failed to win a match in this year's Premier League Darts.", "filename": "sport_darts_live_clye07qy011t_1747804968.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/25fc/live/ea3220b0-10c9-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_darts_live_clye07qy011t_1747804968.html", "title": "Premier League Darts LIVE: Relive Stephen Bunting's win in Berlin as it happened", "title_page": "Premier League Darts LIVE: Relive Stephen Bunting's win in Berlin as it happened - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Goodbye!\nThank you for joining us this evening. A marvellously unpredictable evening of darts, and a most unexpected winner.\nYou can relive it all in our report, which will be published in the next few minutes, and we will be back next week for night 10 of the 2025 Premier League in Manchester.\nHope to see you then!\n'Bunting must be feeling a million dollars'\nMark Webster\nFormer BDO world champion on Sky Sports\nI was just delighted to see him get a win. He's been saying all the right things but he will have been doubting himself. He must be feeling a million dollars, I'm delighted for him.\nTo get over the line, the relief as well. It will be a tough slog to get to the play-offs, but there is a lot of Premier League darts yet to play. He's played well tonight has Stephen Bunting, and he will feel a lot more relaxed next week in Manchester.\n'To win a night is such a special feeling'\nMore from Stephen Bunting, speaking to Sky Sports after his victory in Berlin:\n\"Don't get me wrong, there have been times through the Premier League where I've thought: 'Could I finish on zero points?'\n\"But to get off the mark tonight and to win a night is such a special feeling.\n\"I felt so good in the practice room, I hit a nine-darter early on. I had a good run in Leicester the other day [in the Players Championship] which gave me a lot of confidence. I know I've been playing well and just not got the results.\n\"This is going to give me huge confidence and I can't wait to finish the campaign. I've really enjoyed it, even though I've not won a game until tonight. We all want to be in the Premier League, it's the place to be and I want to be in it for many years to come.\"\n'I was so relieved to get off zero points'\nNight nine winner Stephen Bunting, speaking to Sky Sports:\n\"After the first win, I was so relieved to get off zero points. I've put a lot of work in behind the scenes, I've tried 110% every single week without fail. I tried to give these fans everything I could, I've won an event and I'm so happy.\n\"For the past few years, I've felt I've been a far better player than I was when I won the Lakeside World Championship [in 2014]. There's a lot of hard work gone in behind the scenes, I've got a great management team and a lovely family behind me, and the fan base is unbelievable. Without these fans, I can't win games like these.\"\nPrice breaks\nBunting 4-5 Price\nOnly five 180s so far in this final, three of them to Bunting. Both men are averaging well south of 95. One for the purists is the kindest way of describing it.\nBut that's much better from Bunting, his fourth 180 of the match to set up a 45 checkout. Miss at D16... miss at D8!\nPrice requires 71. Miss at D10... hit on D5!\nA massive roar from Price, who wins the night if he holds throw. Big if.\nPrice holds\nBunting 4-4 Price\nGerwyn Price is trying to gee himself up with some big fist pumps and roars, he now needs to hold his own throw after Stephen Bunting finally did so at the seventh time of asking for both players.\nPrice has three darts to find 76, and after an awkward second dart his third plunges into D8 to keep us all square.\nBunting breaks back yet again\nBunting 3-3 Price\nIs it easier psychologically to throw against the darts? Both men have thrown poorly on their own legs so far. A very strange final, with neither man playing at their best.\nStephen Bunting narrowly misses a 108 checkout for another break, however Gerwyn Price - looking very agitated - cannot make 117.\nBunting then finishes off, and for the sixth successive leg it goes against the throw. Remarkable.\nPost\nBunting 2-3 Price\nWayne Mardle\nFormer World Championship semi-finalist on Sky Sports\nThat was the first time this evening that Stephen looked to have lost that little bit of composure - just that one dart. We'll see how that resonates, maybe it won't bother him.\nBut that was so quick, you've got to give yourself time to raise the arm from down to up, otherwise you won't reach tops.\nPrice breaks yet again\nBunting 2-3 Price\nWell this final has lacked quality, but not intrigue. And drama now, as Price gets a bounce-out!\nHe responds with 174 to set up a finish for a fifth straight break, needing the bull, but is well off target.\nBunting however totally rushes his dart at D20, hitting single five. That allows Price in again - and for the FIFTH STRAIGHT LEG, it goes against the darts.\nBunting breaks back again\nBunting 2-2 Price\nIt has been all or nothing with Gerwyn Price lately - in the last six Premier League nights he has won two, exited in the opening round in the other four.\nHere he is in another final, and after Bunting can't convert the big fish, Price aims for a 56 checkout - but this time misses twice at tops!\nBunting cannot capitalise, so Price has another three darts to go 3-1 - but he can't manage it! And Price gives a sarcastic thumbs up to the crowd, not happy at all.\nBunting sees it out - four legs, four breaks.", "url": "https://www.bbc.com/sport/darts/live/clye07qy011t"}