{"authors": ["Josh Lobley", "www.facebook.com"], "date_download": "2025-05-21 06:10:07", "date_modify": "2025-05-21 06:10:07", "date_publish": "2025-03-31 10:31:27", "description": "Marco Silva press conference: Arsenal vs Fulham", "filename": "sport_football_articles_cg5q8509d5go_1747807807.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9b67/live/608060b0-6de1-11ef-b970-9f202720b57a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cg5q8509d5go_1747807807.html", "title": "Marco Silva press conference: Arsenal vs Fulham", "title_page": "Marco Silva press conference: Arsenal vs Fulham - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Silva provided a squad news update ahead of Tuesday's match: \"Right now there is nothing serious - some knocks and tiredness from the game, which is normal.\"\nOn his opponents: \"A top side, not just in terms of individual quality but they have a collective quality. They are one of the more physical teams in the league. They like to press really high and are going to create some problems for us, but we have to be brave enough to play our game.\"\nFulham could make it four unbeaten against their London rivals: \"Our record against them has been very good and it shows that we have been doing good things against them. It's not easy to go three games without losing against a team like Arsenal, a team that are fighting to be champions. We have to be brave and match their physicality.\"\nHe says that Arsenal have a \"small advantage\" against his side because they didn't play any football last weekend: \"It's important for us to play quick [after a defeat], but probably not so quick. A game on a Wednesday is going to make much more sense for us to recover players. But we are here to respect it and prepare as best as we can.\"\nHe was asked about former Gunner Emile Smith-Rowe's impact at Craven Cottage: \"He's had some ups and downs which doesn't surprise us for a player that wasn't playing enough football in the past two seasons. He needs to find the right consistency in his game and this is the main thing for us.\"", "url": "https://www.bbc.com/sport/football/articles/cg5q8509d5go"}