{"authors": ["Chris Forryan", "www.facebook.com"], "date_download": "2025-05-21 06:14:48", "date_modify": "2025-05-21 06:14:48", "date_publish": "2025-01-14 09:19:11", "description": "Leicester news: Opinion - Van Nistelrooy praised after FA Cup win", "filename": "sport_football_articles_c5yv824rd85o_1747808088.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4487/live/4f936c40-b629-11ee-bc2f-cb5579b90709.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c5yv824rd85o_1747808088.html", "title": "Opinion - Van Nistelrooy praised after FA Cup win - BBC Sport", "title_page": "Leicester news: Opinion - Van Nistelrooy praised after FA Cup win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ant McPartlin once said: \"You weren't expecting that were you?\"\nWell no, I certainly was NOT. Now let's be honest, as priorities go this season, an FA Cup run is not atop Leicester's list. And therein lies the problem for Ruud van Nistelrooy.\nShould he he take the opportunity to blood some of the youngsters ready for a potential call-up for the senior squad in the league? They couldn't do any worse than some of the performances the so-called first team have put in this season!\nOr should he 'go big or go home' and play the big guns, albeit most of them have been firing blanks all season.\nWe had recently played Liverpool, Manchester City and Aston Villa - all Champions League sides. While we got no points points from these games, we were not humiliated and in fact we performed well. Were we, perhaps, seeing the green shoots of Ruud's philosophy coming through.\nSo there was an argument for the Dutchman not to disrupt this and stick with the same players. Well, it worked. He got everything spot on - starting line-up, tactics, substitutions.\nYes, you could argue it was only a Championship side, but this was one who had turned their season round, only losing one of their past six and winning their past two.\nThey would prove a match for most bottom-half Premier League teams - the type we need to beat if we are to survive.\nA shoutout for James Justin as well, our man of the match, but I was left wondering why no yellow ball was used.\nThe future, unlike the weather on Saturday, is bright. The future is Ruud.", "url": "https://www.bbc.com/sport/football/articles/c5yv824rd85o"}