{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:46:56", "date_modify": "2025-05-20 14:46:56", "date_publish": "2023-07-27 17:27:32", "description": "Joint-favourites Auguste Rodin and King Of Steel will face off again at the King George VI and Queen Elizabeth Stakes on Saturday.", "filename": "sport_horse-racing_66327378_1747752416.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3E8F/production/_130551061_gettyimages-1495630215.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_horse-racing_66327378_1747752416.html", "title": "King George VI: Auguste Rodin and King Of Steel set for Derby rematch", "title_page": "King George VI: Auguste Rodin and King Of Steel set for Derby rematch - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Joint-favourites Auguste Rodin and King Of Steel will face off again at the King George VI and Queen Elizabeth Stakes at Ascot on Saturday.\nAuguste Rodin chased down and beat the 66-1 outsider to win the Epsom Derby for trainer Aidan O'Brien in June.\nO'Brien's horse has since won the Irish Derby, while King Of Steel won the 2023 King Edward VII stakes at Royal Ascot.\nFrankie Dettori could become the most successful jockey in the race's history, riding Emily Upjohn.\nThe pair won the 2023 Coronation Cup, and Dettori could surpass the record of Lester Piggott, with whom he is currently tied with seven King George wins.\nThis year's field of 11 horses boasts a total of 14 Group 1 wins between them - the highest total in the race's history.\nSecond favourite Hukum won the Brigadier Gerard Stakes at Sandown in May, after recovering from an injury sustained at Epsom in June 2022, which required three screws to be inserted into his hind leg.\nHe beat last year's Derby winner Desert Crown, who has been withdrawn from the King George VI after picking up an infection in his leg.\nLast year's winner, Pyledriver, is only fifth favourite to retain. In June, he won the Hardwicke Stakes at Ascot.\nSaturday's King George VI and Queen Elizabeth Stakes is scheduled to start at 15:40 BST.", "url": "https://www.bbc.com/sport/horse-racing/66327378"}