{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:22:00", "date_modify": "2025-05-21 07:22:00", "date_publish": "2025-05-20 07:54:52", "description": "'Steven Gerrard preferred candidate for Rangers job' - gossip", "filename": "sport_articles_cd7ggnrnqero_1747812120.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/05a7/live/5c5a0fa0-354f-11f0-8519-3b5a01ebe413.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cd7ggnrnqero_1747812120.html", "title": "'Steven Gerrard preferred candidate for Rangers job'", "title_page": "'Steven Gerrard preferred candidate for Rangers job' - gossip - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Rangers manager Steven Gerrard has been identified as the Ibrox club's preferred candidate following the decision not to retain interim head coach Barry Ferguson, with Real Madrid assistant Davide Ancelotti and former Southampton boss Russell Martin having also been on the shortlist. (Daily Mail), external\nFormer Rangers manager Steven Gerrard and former Ibrox defender Russell Martin have emerged as the leading contenders to be the club's next team boss and a decision could be made by the end of this week following final talks. (Scottish Sun), external\nFormer Southampton manager Russell Martin is a serious contender to be Rangers head coach, but Real Madrid assistant Davide Ancelotti has also held discussions with the Scottish Premiership club and former Ibrox boss Steven Gerrard remains under consideration. (TeamTalk), external\nDanny Rohl's multi-million-pound release clause with Sheffield Wednesday is likely to prohibit a Rangers move for the highly-rated coach. (Football Insider), external\nFormer Rangers manager Steven Gerrard and Real Madrid assistant Davide Ancelotti are just two names that have been sounded out over taking charge at Ibrox, while former Southampton manager Russell Martin, ex-Luton Town boss Rob Edwards are also under consideriation and Sheffield Wednesday's Danny Rohl could also make the final shortlist, with no front runner at this stage. (Sky Sports), external\nBookmakers have slashed the odds on Steven Gerrard returning to Rangers as manager and he has emerged as favourite with the Ibrox club waiting on a response from Real Madrid Davide Ancelotti, who is considering his options amid interest from a number of clubs this summer. (Glasgow Times), external\nReal Madrid assistant Davide Ancelotti is leaving the Spanish club with father Carlo, who is taking charge of the Brazil national team, but is expected to move on after the two World Cup qualifiers with Ecuador and Paraguay in June to begin his career as a head coach. (The Athletic), external\nThe Scottish FA compliance officer is set to review comments made by former defender John Brown on Rangers TV querying the integrity of officials during Saturday's 2-2 draw with Hibernian. (The Herald), external\nRangers have branded the possibility of disciplinary action after John Brown's \"corrupt\" outburst on Rangers TV as \"excessive, surprising and inconsistent\". (The National), external", "url": "https://www.bbc.com/sport/articles/cd7ggnrnqero"}