{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:07:16", "date_modify": "2025-05-21 07:07:16", "date_publish": "2025-01-13 22:45:06", "description": "Derby County are closing in on the signing of Norwegian foward Lars-Jorgen Salvesen, reports BBC Radio Derby.", "filename": "sport_football_articles_ce8590lz31lo_1747811236.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e2dd/live/c1d5b760-d1fb-11ef-9598-7d91b94619e2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ce8590lz31lo_1747811236.html", "title": "Derby County: Rams close to signing forward Lars-Jorgen Salvesen", "title_page": "Derby County: Rams close to signing forward Lars-Jorgen Salvesen - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Derby County are set to sign forward Lars-Jorgen Salvesen, reports BBC Radio Derby.\nThe 28-year-old scored 12 goals for Viking FK last season as they finished third in the Norwegian top flight.\nThe fee is expected to be £800,000 with the Rams hopeful of having the deal completed before their Championship match at home to Watford on Saturday.\nSalvesen also has Champions League and Europa League experience with his previous club, Bodo Glimt.\nAnalysis - BBC Radio Derby's Dominic Dietrich\nDerby County are on the verge of finally getting Paul Warne the target man he's always wanted since arriving two-and-a-half years ago.\nWhether he pictured it being Lars-Jorgen Salvesen from Norway, who knows, but their bid for better value for money overseas has proved a tried-and-trusted method since the summer arrivals of goalkeeper Jacob Widell Zetterstrom and midfielder Kenzo Goudmijn.\nAmong the options available to Derby, I understand this is a deal that all those involved unanimously agreed on before making their move as they hope his ability in the air could prove to be the missing piece.\nBusiness in January is usually to correct the mistakes made in the summer, for Derby and Warne it could be the difference between surviving in the Championship or not.\nThe club will hope to get this deal over the line sooner rather than later, with a medical due this week, the question will be if he will arrive in time for their next league game at home against Watford on Saturday.", "url": "https://www.bbc.com/sport/football/articles/ce8590lz31lo"}