{"authors": ["Sandy Smith", "www.facebook.com"], "date_download": "2025-05-21 06:06:31", "date_modify": "2025-05-21 06:06:31", "date_publish": "2025-04-01 14:06:49", "description": "Edinburgh fan voice: 'Drama yet to come despite breezing past Dragons'", "filename": "sport_articles_c30ql9q50vyo_1747807591.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/494e/live/669de360-0f02-11f0-b234-07dc7691c360.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c30ql9q50vyo_1747807591.html", "title": "'Drama yet to come despite breezing past Dragons'", "title_page": "Edinburgh fan voice: 'Drama yet to come despite breezing past Dragons' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Apparently you shouldn't look a gift horse in the mouth, so I'm going to take this six-try, five-point victory over Dragons, say thank you and move on.\nEdinburgh's play wasn't perfect by a long shot, but on a bitterly cold night at the Hive, we inflicted the biggest margin of defeat in Dragons' terrible season so far.\nThere were a few notable performances.\nPaddy Harrison got a brace of tries and was close to getting Edinburgh's second hat-trick of the season. His second try certainly demonstrated his pace.\nOur lineout completion rate was also much better which was handy as we did have 20 lineouts.\nIn the absence of Mosese Tuipulotu there was a return of the centre pairing of James Lang and Matt Currie. Both had good games.\nCurrie's first-minute tackle prevented a certain try that might have changed the course of the game, and he finished the 80 with a strong try in the corner. Currie is now the joint-top try scorer for the club this season along with Duhan van der Merwe and Paddy Harrison.\nWes Goosen continues to provide great value, having not missed a minute of the season so far. In this game, I lost count of the high balls that Dragons sent his way, and he gobbled them up gratefully.\nHowever, the man of the match award rightfully went to Darcy Graham, who is one of those players you just love to watch. More carries, more clean breaks and more defenders beat than anyone in this match. Every time he got the ball you could sense the danger he was to the Dragons defence.\nWe could have been better. Dragons weren't exactly taxing opponents yet we gave them an easy ride in the second half and there were far too many missed opportunities because of handling errors.\nUltimately, other results went our way, and we finished the weekend in eighth. Something tells me there will be drama yet to come.\nThis week, we have a late-night date with the Lions. We'll be looking to right the wrongs of our defeat to them in Johannesburg from earlier in the season and secure a home tie in the quarter-finals of the Challenge Cup.\nHow do we go about arranging for it to be a bit breezy?", "url": "https://www.bbc.com/sport/articles/c30ql9q50vyo"}