{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:50:42", "date_modify": "2025-05-21 07:50:42", "date_publish": "2024-12-23 11:20:45", "description": "Luton Town's Pelly Ruddock Mpanzu says he \"still has it in his locker\" after his volley helped equalise in the 2-1 win over Derby County.", "filename": "sport_football_articles_cp83z7v68rgo_1747813842.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/dc91/live/69739e30-c11a-11ef-b76e-9de78285d5f5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cp83z7v68rgo_1747813842.html", "title": "Pelly Ruddock Mpanzu: Luton Town midfielder on Derby County win", "title_page": "Pelly Ruddock Mpanzu: Luton Town midfielder on Derby County win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Luton Town midfielder Pelly Ruddock Mpanzu said he \"still has it in his locker\" after his volley diverted off team-mate Tom Holmes to equalise in the 2-1 win over Derby County on Friday.\nMpanzu, 30, has been with the club since 2013, back when the Hatters were playing their football in the National League, and his clean strike a minute from time initially looked to be his first goal of the season but he was later credited with an assist.\nHowever, he does not mind who scores as long his side win.\n\"I didn't know who it hit first of all, so listen, a goals a goal right now,\" Mpanzu told BBC Radio Three Counties following the win over the Rams.\n\"I've got it in the locker still, I don't know why people are trying to doubt me. If Holmesy wants to take the goal, I'll let him have it.\"\nMpanzu also made reference to the Kenilworth Road pitch which has suffered over recent weeks because of the bad weather across England.\n\"Listen, the pitch is like a cow field right now. This game wasn't pretty but sometimes football isn't pretty. Friday night at Kenilworth Road can be difficult for anyone.\"", "url": "https://www.bbc.com/sport/football/articles/cp83z7v68rgo"}