{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:56:35", "date_modify": "2025-05-20 12:56:35", "date_publish": "2023-08-02 22:04:32", "description": "Kylian Mbappe is open to one-year Chelsea deal, Manchester United rival Liverpool for Romeo Lavia, Barcelona want Joao Cancelo, plus more.", "filename": "sport_66386223_1747745795.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/43A0/production/_130621371_mbappe.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_66386223_1747745795.html", "title": "Thursday's gossip: Mbappe, Lavia, Hojlund, Cancelo, Kane, Van de Ven, Caicedo, Hojbjerg", "title_page": "Thursday's gossip: Mbappe, Lavia, Hojlund, Cancelo, Kane, Van de Ven, Caicedo, Hojbjerg - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Paris St-Germain's France striker Kylian Mbappe, 24, has told Chelsea he would be open to joining on a one-year deal if he can move to Real Madrid on a free transfer next summer. (Sport - in Spanish), external\nManchester United want Southampton's 19-year-old Belgium midfielder Romeo Lavia after Liverpool had a bid rejected. (Independent), external\nManchester United's signing of Atalanta's 20-year-old Denmark striker Rasmus Hojlund could be delayed until this weekend after he arrived in Manchester later than planned on Tuesday. (Manchester Evening News), external\nEngland striker Harry Kane, 30, could give up a large part of his Tottenham salary to help push through a move to Bayern Munich. (Bild - in German), external\nTottenham have agreed personal terms with Wolfsburg's 22-year-old Dutch defender Micky van de Ven. (Talksport), external\nTottenham are looking to finalise the sale of 27-year-old Denmark midfielder Pierre-Emile Hojbjerg to Atletico Madrid, who value him at £30m. (90min), external\nInter Milan are interested in Arsenal's 24-year-old Japan defender Takehiro Tomiyasu. (Gazzetta dello Sport - in Italian), external\nBarcelona are in talks with Manchester City over a move for 29-year-old Portugal defender Joao Cancelo. (Talksport), external\nManchester United have opened talks with Real Sociedad over the sale of 26-year-old Netherlands midfielder Donny van de Beek, which would help fund a move for Fiorentina's 26-year-old Morocco midfielder Sofyan Amrabat. (Mail), external\nChelsea face competition for Brighton's 21-year-old Ecuador midfielder Moises Caicedo. An unidentified club has made a bid higher than Chelsea's £80m. (Athletic - subscription), external\nChelsea will make an improved offer for Caicedo, who is valued at close to £100m by Brighton. (Sky Sports), external\nAston Villa want Leeds United's 24-year-old USA midfielder Tyler Adams and are willing to meet his £25m release clause. (Mail), external\nWest Ham are looking at alternatives to Southampton's England midfielder James Ward-Prowse, 28, after having a £30m bid turned down. (Sky Sports), external\nAl-Nassr will pay 15m euros (£13m) for Barcelona's 28-year-old France defender Clement Lenglet, who is also wanted by Tottenham.(Sport - in Spanish), external\nLuton have agreed a fee of £2.5m plus add-ons to sign Blackburn's 30-year-old Belgian goalkeeper Thomas Kaminski. (Athletic - subscription), external\nInter Milan will raise their bid for West Ham's 24-year-old Italy striker Gianluca Scamacca to £21.5m. (Evening Standard), external\nBrazil winger Willian, 34, has received an offer from Saudi Arabian club Al-Shabab two weeks after agreeing a one-year contract with Fulham. (Athletic - subscription), external\nBournemouth are in advanced talks and are set to pip Wolves to the £25m signing of Bristol City's English midfielder Alex Scott. (Telegraph - subscription), external\nEverton are looking at Southampton's Ghana forward Kamaldeen Sulemana, 21, as an alternative to Leeds United's 19-year-old Italy winger Wilfried Gnonto. (Football Insider), external\nBesiktas are close to signing Arsenal's 28-year-old Ivory Coast winger Nicolas Pepe. (Transfermarkt - in Turkish), external\nNottingham Forest and West Ham are interested in Paris-St Germain's 21-year-old French forward Hugo Ekitike. (RMC Sport - in French), external\nGalatasaray are still interested in signing Manchester United's 30-year-old Brazil midfielder Fred this summer. (Mail) , external", "url": "https://www.bbc.com/sport/66386223"}