{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:47:18", "date_modify": "2025-05-20 11:47:18", "date_publish": "2023-08-07 10:03:08", "description": "Dungannon Swifts boss Rodney McAree wants to \"achieve something\" with his boyhood club on his return to Stangmore Park", "filename": "sport_football_66427045_1747741638.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/10C31/production/_130675686_inpho_01297093-1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66427045_1747741638.html", "title": "Irish Premiership: Dungannon Swifts manager Rodney McAree's ambitions for coming season", "title_page": "Irish Premiership: Dungannon Swifts manager Rodney McAree's ambitions for coming season - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Dungannon Swifts manager Rodney McAree has vowed to try and \"achieve something\" with his boyhood club ahead of their opening league fixture against champions Larne on Monday night.\nThe Swifts finished second from bottom last season under former boss Dean Shiels.\nMcAree, who won the League Cup with Dungannon in 2018, returned in June after leaving Glentoran.\n\"I was born into the club, it's in the blood,\" McAree told BBC Sport NI.\nHe added: \"It's a club that means a massive amount to me. I'm glad to be back, I'm looking forward to the challenge.\n\"I'm not back to just do a job and say that I'm at Dungannon Swifts, I want to come back and try and achieve something.\"\nDungannon travel to Inver Park on Monday night to face the defending champions.\nTiernan Lynch's side begin their title defence having crashed out of the Europa Conference League qualifiers losing 7-1 on aggregate to Kosovo Superleague winners Ballkani.\n\"Larne were the best team in the league last season, the league table doesn't lie,\" McAree added.\n\"It's a massive challenge but it's one that we'll embrace.\"\nMcAree returns to Stangmore Park following a third-place league finish as Glentoran boss, having taken over from Mick McDermott in January.\nDuring the 2016-17 season, the former Fulham midfielder led the Swifts to a seventh place finish in the Premiership, earning the Mid-Ulster club a spot in the Europa League qualification play-offs.\nThe Swifts finished last season having conceded 84 league goals, a figure that McAree is determined to improve upon.\n\"It's too much. We have to try and improve that column,\" he continued.\n\"We have to try and improve that other column too of 'goals for'.\n\"We have to try and find a system that we can put on a team on a weekly basis but if we're going to continue to concede the goals that we have done then it's a very, very tough challenge.\n\"We could sit here and say that we want to be safe and we want to stay in the league, I think it's too easy to say that. We have to improve on last season.\"", "url": "https://www.bbc.com/sport/football/66427045"}