{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:24:22", "date_modify": "2025-05-21 05:24:22", "date_publish": "2025-04-03 14:27:46", "description": "Newcastle defender Fabian Schar extends his contract at the club until the summer of 2026.", "filename": "sport_football_articles_c7054leg10xo_1747805062.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b634/live/97ce64b0-1096-11f0-b6ff-f7b4e8c1b1b9.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c7054leg10xo_1747805062.html", "title": "Schar extends Newcastle stay until summer of 2026", "title_page": "Fabian Schar extends Newcastle stay until summer of 2026 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Newcastle defender Fabian Schar has extended his contract at the club until the summer of 2026.\nThe Switzerland international joined the Magpies from Spanish club Deportivo La Coruna in July 2018.\nSchar, 33, has made 221 appearances in all competitions for Newcastle and recently helped them win the Carabao Cup, the club's first domestic trophy since they lifted the FA Cup in 1955.\nHis previous deal had been set to expire at the end of June.\n\"It's been a very good few weeks for everybody at Newcastle after winning the Carabao Cup and I'm really happy now to sign another contract with this amazing club,\" Schar said.\nHe has played 33 times for Newcastle this term, with the club fifth in the Premier League and challenging for a place in next season's Champions League.\nNewcastle head coach Eddie Howe added: \"Fabian has been outstanding in my time at the club. As well as his performances on the pitch, he has shown a fantastic attitude in the group.\n\"He has been the heartbeat of the club's season so far, and he'll continue to be a key player for us as we strive to finish as high in the table as possible.\"", "url": "https://www.bbc.com/sport/football/articles/c7054leg10xo"}