{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:43:50", "date_modify": "2025-05-21 03:43:50", "date_publish": "2025-04-06 16:19:35", "description": "Novak Djokovic says having brother Marko alongside him at the Monte Carlo Masters will \"help on a different level emotionally\".", "filename": "sport_tennis_articles_cr4n65n1xnzo_1747799030.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/554d/live/248112f0-12fd-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_tennis_articles_cr4n65n1xnzo_1747799030.html", "title": "Monte Carlo Masters: Novak Djokovic joined by brother Marko in Andy Murray's absence", "title_page": "Monte Carlo Masters: Novak Djokovic joined by brother Marko in Andy Murray's absence - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Novak Djokovic says having brother Marko alongside him at the Monte Carlo Masters will \"help on a different level emotionally\".\nSerbia's Djokovic, chasing a 100th ATP Tour singles title, is without coach Andy Murray at the clay-court event.\nDjokovic said it was \"never part of the agreement to work with Andy this week\", with the Briton expected to return for the Madrid Open later in April.\n\"My brother Marko was able to join me, so that helps me on a different level emotionally,\" 24-time Grand Slam champion Djokovic said., external\n\"Have some time with my brother and spend some time with him on the road.\"\nWorld number five Djokovic reached his first final of the season at the Miami Open in late March, losing to Czech teenager Jakub Mensik.\nThe 37-year-old has not won a singles title on the tour since the season-ending ATP Tour Finals in 2023, with his much-wanted Olympic gold not counting as an ATP title.\nDjokovic was bothered by a swollen eye during the final against Mensik and said he had a \"little bit of a viral infection\" in the lead-up to Monte Carlo.\n\"It started on semi-finals day in Miami and I did struggle with it in the finals but it's calming down,\" Djokovic said.\n\"I'm glad that I found in Miami that joy on the court and, I feel, the performance level.\n\"It's more about trying to get matches and as many as possible, and obviously to try to peak towards the end of the clay season.\"\nThird seed Djokovic has a first-round bye and will open against fellow veteran Stan Wawrinka or Chile's Alejandro Tabilo.\nAlexander Zverev, Carlos Alcaraz and Britain's Jack Draper are all competing in Monte Carlo, with the tournament under way and running to 13 April.\nWorld number three Alcaraz's only tournament win this year came in Rotterdam in February.\nMonte Carlo marks the start of his clay-court season and it a surface on which the 21-year-old has strong credentials, having won last year's French Open.\nThe four-time Grand Slam champion admits external pressure to replace the suspended Jannik Sinner as world number one has been affecting his form, but he begins in Monte Carlo with a different mindset.\nItalian Sinner is serving a three-month doping ban from tennis.\n\"A lot of people are asking me, or are telling me, that I have the chance to become number one if Jannik is not playing,\" Alcaraz told a news conference on Sunday.\n\"So probably that pressure has killed me in some way.\"\nThe Spaniard said the ranking is no longer his focus, and he expects that to allow him to play more freely.\n\"I'm just thinking that I'm not able to become number one in the clay season, even if Jannik is not playing, I don't have the chance to do it,\" Alcaraz said.\n\"I think I'm too far from Jannik. So I'm just here and I realise that I don't have to think about it and just go there and play.\n\"That's my mindset right now.\"", "url": "https://www.bbc.com/sport/tennis/articles/cr4n65n1xnzo"}