{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:47:15", "date_modify": "2025-05-21 07:47:15", "date_publish": "2025-05-18 20:38:00", "description": "The 2025 Emilia-Romagna Grand Prix may have been F1's farewell to Imola. We look back at famous moments at the classic Italian circuit.", "filename": "sport_formula1_articles_cm26jyqplrjo_1747813635.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5a53/live/61b2a940-341d-11f0-8519-3b5a01ebe413.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_formula1_articles_cm26jyqplrjo_1747813635.html", "title": "Formula 1: Images from grands prix at Imola over the years", "title_page": "Formula 1: Images from grands prix at Imola over the years - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Grid position is key at the narrow Imola circuit and securing pole position can greatly boost your chances of a race win. McLaren's Oscar Piastri started ahead of Max Verstappen on the front row in 2025 but it was the Red Bull driver who made a bold move at the Tamburello chicane on the opening lap to pass the Australian and take control of the grand prix.\nIn 1982, tensions flared between Ferrari team-mates Gilles Villeneuve (left) and Didier Pironi. Canadian Villeneuve was leading Frenchman Pironi, with third-placed Michele Alboreto far behind. Villeneuve expected that they would follow Ferrari protocol and remain in that position, but Pironi passed him on the final lap to take the win. Villeneuve vowed never to speak to Pironi again. Still furious at what he considered a betrayal, he died in a crash in qualifying for the Belgian Grand Prix two weeks later.\nOn the 30th anniversary of Ayrton Senna's death in 2024, fellow multiple world champion Sebastian Vettel drove the Brazilian's race-winning McLaren MP4/8 from 1993 as part of a tribute run, to the delight of the packed crowds inside the circuit.\n1980 was Imola's first appearance as a championship F1 race and it was awarded the honour of hosting that year's Italian Grand Prix - an event won by Brazilian driver Nelson Piquet, driving for Brabham. From 1981 up until 2006, Imola adopted the title 'San Marino Grand Prix' instead, hosting a total of 27 grands prix.\nImola made its return to Formula 1 after a 14-year absence during the Covid-19 pandemic in 2020. With many races cancelled and the schedule disrupted, the Emilia-Romagna Grand Prix was added to the revised calendar as a one-off event taking place in November. With no fans present, residents in the neighbouring houses got to see Lewis Hamilton take victory for Mercedes.\nFernando Alonso, now 43, drives for Aston Martin these days but in 2005, the Spaniard was racing for Renault and battling on the Imola track with Ferrari's seven-time world champion Michael Schumacher. Alonso beat the German to the race win, sealing his third consecutive victory of what would be his first championship season.\nMichael Schumacher is the king of Imola, winning at the historic circuit a record seven times during his career. However, in 1992, it was a different story, as the German suffered his first retirement of the season for Benetton after he spun into the tyre wall when he and team-mate Martin Brundle were hustling McLaren's Gerhard Berger on lap 21.\nOn 1 May 1994, members of the Williams team, along with the rest of the world, watched on anxiously as medics tried to save the life of their iconic driver Ayrton Senna. The 34-year-old crashed into a concrete barrier at the Tamburello corner because of a mechanical failure on his car and died a few hours later in a hospital in Bologna. His death came the day after Simtek's Roland Ratzenberger had been killed in a crash during qualifying.\nIn the aftermath of Senna and Ratzenberger's deaths 31 years ago, Imola was given a revamp, with two chicanes added to the circuit to improve safety. The monument at Tamburello has become a pilgrimage for fans; a lasting reminder of Senna's legacy within Formula 1.\nA Schumacher stood on the top step of the Imola podium in 2001, but it wasn't Michael who claimed the race victory - it was his brother Ralf. Driving for Williams, the younger Schumacher beat McLaren's David Coulthard and Ferrari's Rubens Barrichello to the chequered flag, while Michael's day in the other Scuderia ended in retirement.\nOne of the reasons fans love the old-school charm of Imola is that it's one of the few circuits left on the calendar that has corner names, not just numbers. In sequence, they are Tamburello, Villeneuve, Tosa, Piratella, Acque Minerali, Variante Alta and Rivazza. In 2006, Variante Bassa was removed and a new pit lane and start-finish complex were built.\nSenna won three times in Imola and took a record eight pole positions, but his second victory on Italian soil saw his rivalry with then McLaren team-mate Alain Prost turn sour. Following a red flag and delay for a terrifying accident involving Gerhard Berger's Ferrari on lap four, Senna overtook Frenchman Prost - who had been leading before the accident - halfway round the first lap after the restart, apparently reneging on a pre-race agreement.", "url": "https://www.bbc.com/sport/formula1/articles/cm26jyqplrjo"}