{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 08:27:56", "date_modify": "2025-05-21 08:27:56", "date_publish": "2025-05-16 21:30:39", "description": "Munster beat Benetton 30-21 to secure a place in the quarter-finals of the United Rugby Championship and ensure Champions Cup rugby next season.", "filename": "sport_rugby-union_articles_czdyld4625lo_1747816076.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9838/live/a2da6820-328f-11f0-972a-0929f16a582a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_czdyld4625lo_1747816076.html", "title": "United Rugby Championship: Munster beat Benetton to secure quarter-final spot", "title_page": "United Rugby Championship: Munster beat Benetton to secure quarter-final spot - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Munster moved sixth in the United Rugby Championship and guaranteed their place in the play-off quarter-finals and next season's Champions Cup with a hard-fought 30-21 victory over Benetton at Virgin Media Park.\nBenetton led 14-10 at the break but the Irish province responded after half-time to win.\nJack Crowley scored the opening try on 14 minutes when he dashed over from close range to score beside the posts, the Ireland fly-half converting his own touchdown.\nBenetton responded with a try from Rhyno Smith as he went on angled run, skipped through an attempted tackle and dived over, Jacob Umaga converting.\nCrowley's penalty edged the hosts in front again but the visitors went ahead with a stunning breakaway try.\nCraig Casey missed a tackle on fly-half Umaga on halfway and he fed Smith who raced away for his second try.\nFour minutes into the second half Lee Barron rumbled over from a maul after a line-out, Crowley off-target with the tee on that occasion.\nThaakir Abrahams then showed a fine turn of pace after accepting an offload for Munster's third try and Casey added a superb conversion from the touchline.\nCrowley set up the score with a cross-kick for Diarmuid Kilgallen on the wing and he provided the pass for the South African to race clear.\nA Casey penalty extended the lead to 11 but Munster weren't finished and Bautista Bernasconi barged over for their third score. Umaga's kick reduced the deficit to four.\nJosh Wycherley powered over to give the home side some breathing space, Casey contributing the additional two points.", "url": "https://www.bbc.com/sport/rugby-union/articles/czdyld4625lo"}