{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-05-20 13:56:57", "date_modify": "2025-05-20 13:56:57", "date_publish": "2023-07-31 06:21:13", "description": "New signing Andre Onana shows he will bring more to Manchester United than ball-playing ability during a 3-2 defeat by Borussia Dortmund in Las Vegas.", "filename": "sport_football_66357692_1747749417.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/75A7/production/_130591103_gettyimages-1566021428.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66357692_1747749417.html", "title": "Manchester United 2-3 Borussia Dortmund: Andre Onana rants at Harry Maguire during Las Vegas defeat", "title_page": "Manchester United 2-3 Borussia Dortmund: Andre Onana rants at Harry Maguire during Las Vegas defeat - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "New Manchester United goalkeeper Andre Onana showed he will bring more to Erik ten Hag's team than ball-playing ability during a 3-2 defeat by Borussia Dortmund in Las Vegas.\nThe 27-year-old Cameroon keeper, who came on at half-time, has a reputation for letting rip at team-mates.\nAnd he had a furious rant at Harry Maguire after a slack pass to Christian Eriksen gifted Dortmund a chance.\nOnana denied Sebastian Haller then raced from his goal to berate Maguire.\nThe former United captain kept his counsel, which is more than could be said of fellow defender Brandon Williams in a separate incident. Williams was involved in a slanging match with Tom Heaton, who started in goal as United's three-match tour of the United States ended in defeat in front of 50,857 at the Allegiant Stadium.\nWilliams had been responsible for Donyell Malen cancelling out Diogo Dalot's excellent opening strike, but took exception to being blamed by Heaton for Dortmund's second goal, barely a minute later, when Victor Lindelof gave the ball away.\nHeaton seemed to suggest Williams had been too slow getting out and had played Malen onside. Williams evidently disagreed, making his feelings known in industrial terms.\nAntony equalised for United but another defensive error - this time from Aaron Wan-Bissaka, who gifted Dortmund possession close to the penalty area - ended with Youssoufa Moukoko scoring the winner.\nIt was a sobering evening for 18-year-old Omari Forson. Given his fourth pre-season appearance, the Londoner had impressed until he got involved in a head-to-head confrontation with Karim Adeyemi.\nTen Hag was concerned enough about the situation to venture on to the pitch. Bruno Fernandes complained to the fourth official as Dortmund continued to niggle away at the young midfielder, whose concentration had evidently been affected.\nAmad Diallo missed the game with a knee injury that still requires an assessment and the Ivory Coast winger was noticeably limping as he left the stadium.\nIt is anticipated 18-year-old midfielder Kobbie Mainoo will be out for an extended period with the ankle injury he sustained in the 2-0 defeat by Real Madrid in Houston on Wednesday.\nAfter starting their pre-season campaign with three successive victories, United have now lost two games in a row.\nThey still have two more matches to play, against Lens at Old Trafford on Saturday and Athletic Bilbao in Dublin on Sunday, before they open their Premier League campaign against Wolves at Old Trafford on 14 August.\nBy that point, United hope to have completed the signing of Eriksen's Denmark team-mate Rasmus Hojlund from Serie A outfit Atalanta in a deal that could eventually cost £72m.\n\"We don't get enough media attention in Denmark - that's why people outside Denmark don't know enough (about Hojlund),\" said former Tottenham and Inter Milan midfielder Eriksen.\n\"He's a nice guy and a good player. He's developed a lot in the last year from when I first saw him with the national team. Now he's a strong number nine.\n\"I haven't seen that many games for Atalanta, but I know how they play and he fitted in well there.\n\"I spoke to him when we were with the national team last time. Of course, I've said a lot of good stuff and also said some bad stuff.\"", "url": "https://www.bbc.com/sport/football/66357692"}