{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:13:02", "date_modify": "2025-04-26 04:13:02", "date_publish": "2025-03-04 12:00:19", "description": "The Netball Super League introduces three further rule changes for the 2025 season as part of the revamped competition.", "filename": "sport_netball_articles_c1mngyvyxeno_1745640782.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7b88/live/8184e900-f853-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_netball_articles_c1mngyvyxeno_1745640782.html", "title": "Netball Super League: New rules introduced before 2025 season begins", "title_page": "Netball Super League: New rules introduced before 2025 season begins - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The Netball Super League has introduced three further rule changes for the 2025 season as part of the revamped competition.\nUnlike in previous seasons, games will not be allowed to end in a draw, with matches going to extra time if the scores are level after 60 minutes.\nTactical timeouts have also been introduced, while there will be a new system for distributing points, with one point on offer for losing teams who finish within five points or less of their opponent.\nThe league, the sport's elite domestic competition in the UK, is being reformed from 2025 as part of plans to make the division professional.\nIn the latest series of rule changes, there will be 10 minutes of extra time, with a one-minute half-time break, if the score between teams is level after 60 minutes.\nIf the score is still level at end of extra time, play will continue until one team reaches a two-goal lead.\nMeanwhile, each team will be allowed to call a 90-second tactical timeout per game. These must be called by a player on court and can only be called after a goal has been scored.\nThe NSL said tactical timeouts \"will provide players and coaches with the invaluable opportunity to make critical adjustments providing the ability to change the outcome of a game and keeping fans guessing until the final whistle\".\nAnother new addition will see losing teams that finish within five goals or less of their opponent's score claim one point - a change that \"aims to incentivise teams in a losing position to continue to fight until the last second of each game\".\nIn December, it was announced the NSL would follow suit with Australia's Super Netball league and introduce a two-point super shot.\nThe rule, which will be in play throughout the new periods of extra time, allows shooters to score two points from a dedicated area on the edge of the shooting circle during the last five minutes of each of the four quarters of every match.\nClaire Nelson, the NSL's managing director, said the latest rule changes were tailored to \"creating a fast-paced, exciting format\".\nShe added: \"Not allowing games to be played to a draw, along with tactical timeouts and the introduction of the super shot are just some of the changes that will create unmissable experiences as we take new and existing fans on a journey through the season that has jeopardy and excitement at its core.\"\nThe new NSL season begins on 14 March and one match per week will be shown live on the BBC.", "url": "https://www.bbc.co.uk/sport/netball/articles/c1mngyvyxeno"}