{"authors": ["Adonis Storr", "www.facebook.com"], "date_download": "2025-05-21 05:37:10", "date_modify": "2025-05-21 05:37:10", "date_publish": "2025-04-01 07:20:11", "description": "Leeds United fan writer Adonis Storr takes a look at Leeds' falling form and how much of the blame falls on goalkeeper Illan Meslier shoulders'.", "filename": "sport_football_articles_cm24ym4gzn1o_1747805830.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9e9f/live/dd1cadc0-0e42-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cm24ym4gzn1o_1747805830.html", "title": "Tragedy for Leeds, comedy for their rivals", "title_page": "Leeds news: Opinion - Tragedy for Leeds, comedy for their rivals - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Football returned to Elland Road last Saturday afternoon following the final international break of the season – a historically ominous time for Leeds United.\nSome Leeds fans – burdened by memories of springs past – were warning of the 'Ides of March', even during the Whites' record-breaking February form.\nBy the end of that month, United were five points clear at the top of the Championship table, with third-placed Burnley seven points adrift. One month on and it is Sheffield United who lead the league, with the Clarets and Whites trailing two points behind.\nUnited's Shakespearian March fixtures ended with Swansea at the weekend. It was a game that had all the makings of a tragedy for Leeds fans, a comedy for their rivals.\nIllan Meslier has flattered to deceive during his time in Yorkshire. But despite threatening a redemption story by keeping out a penalty and making a couple of vital saves, he was back to being the pantomime villain by the end.\nUnfortunately the Frenchman's undeniable potential is surpassed by his tendency to err. Spilling a simple catch from a corner and failing to save a speculative shot from a narrow angle, the Leeds goalkeeper fluffed his lines again when it mattered most.\nMeslier is not solely responsible for Leeds' remarkable loss of form. The whole team seems to be lacking energy. But the goalkeeper's performances are affecting his team-mates. None more so than a clearly frustrated Joe Rodon.\nIn October I asked \"can Leeds afford to keep waiting for him to improve?\" In January I wrote \"it feels like it is time to try someone else\".\nDaniel Farke has seven, maybe 10, games left to get Leeds promoted, but Meslier's mistakes have left him in an impossible position. To change goalkeeper, or not to change goalkeeper, that is now the question.", "url": "https://www.bbc.com/sport/football/articles/cm24ym4gzn1o"}