{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:01:42", "date_modify": "2025-04-26 04:01:42", "date_publish": "2025-03-07 00:00:00", "description": "Sander Kartum lights up Tynecastle with two superb goals as Hearts book their place in the Scottish Cup semi-finals at the expense of Dundee.", "filename": "sport_football_live_cwyg70vy083t_1745640102.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_cwyg70vy083t_1745640102.html", "title": "Hearts 3-1 Dundee: Kartum double helps hosts reach Scottish Cup semi-finals", "title_page": "Hearts 3-1 Dundee: Kartum double helps hosts reach Scottish Cup semi-finals - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "What's next?\nFT: Hearts 3-1 Dundee\nAnd Dundee will need that bravery next weekend when they travel to Tannadice for a massive Dundee derby.\nHearts are back in action at Tynecastle on Saturday 15 March, they host Ross County.\nDundee 'had Hearts where we wanted them'\nFT: Hearts 3-1 Dundee\nDundee manger Tony Docherty tells BBC Sportsound: \"Disappointed. I thought we played our part in the second half. We had Hearts exactly where we wanted them. We had everything going in our favour at 1-1.\n\"I don't think it's a free-kick that leads to the second goal but we need to defend that better. The third goal kind of kills it. We should do better in the middle of the pitch.\n\"If I get that bravery for the next nine games, which are nine cup finals, then we'll be okay but I need the players to step up and show that bravery.\"\n'Hearts keep taking big steps'\nFT: Hearts 3-1 Dundee\nHearts head coach Neil Critchley tells BBC Sportsound: \"The players showed a lot of character, a lot belief in what we were doing and on balance of chances, we deserved to win the game.\n\"We've seen the quality Sander Kartum has got. He's been getting better and better in training. On his left foot around the edge of the box, that's what we can do. They were two fantastic goals, match-winning goals.\n\"The players have been improving and taking big steps forward and we keep doing that tonight. When we get to Hampden, hopefully we can go and enjoy that game. I can't wait because I've never been. Really looking forward to it.\"\nPost\nFT: Hearts 3-1 Dundee\nHearts midfielder Blair Spittal tells Premier Sports: \"It's important that we got ourselves into the next round.\n\"We'll see what happens over the weekend and hopefully we get a good draw. It's something for the club to look forward to.\"\nOn whether he's claiming the second goal for his own, Spittal adds: \"Not at all,\n\"I think you could tell by my celebration that I was a wee bit embarrassed. It was something that we'd worked on and I'm just glad it hit the back of the net.\"\nPost\nFT: Hearts 3-1 Dundee\nGoalscorer Sander Kartum tells Premier Sports: \"I liked the first goal best, it was a good assist from [Blair] Spittal as well.\n\"My focus was just to hit the ball cleanly and it was a good finish.\"\nWhen asked if fans should expect those types of goals every week, Kartum adds: \"Not those type of shots but hopefully goals.\"\n'Fully deserved'\nFT: Hearts 3-1 Dundee\nHearts left-back James Penrice tells BBC Sportsound: \"Buzzing. I think the boys were brilliant tonight, it was fully deserved.\n\"We stood up to Dundee. Sander Kartum's two goals were brilliant tonight.\n\"It's so evident that this ground's one the best grounds in Scotland when the noise is for us.\"\nDISALLOWED GOAL\nHearts 3-1 Dundee\nJames Penrice gives away a free-kick about 25 yards from the Hearts goal.\nRyan Astley taps the ball into the back of the net but the flag is up for offside.\nMo Sylla, who headed the ball on to Astley, was a mile off when the free-kick came in. Would've only been a consolation anyway as the whistle goes moments later.", "url": "https://www.bbc.co.uk/sport/football/live/cwyg70vy083t"}