{"authors": ["Jonty Colman", "www.facebook.com"], "date_download": "2025-05-21 03:43:49", "date_modify": "2025-05-21 03:43:49", "date_publish": "2025-04-06 16:22:00", "description": "Brentford 0-0 Chelsea: Blues could rue latest away disappointment in race for Europe", "filename": "sport_football_articles_cy8exgjep1yo_1747799029.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/af59/live/0c6487f0-1303-11f0-baa6-cf6d1e060075.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy8exgjep1yo_1747799029.html", "title": "Brentford 0-0 Chelsea: Blues could rue latest away disappointment in race for Europe", "title_page": "Brentford 0-0 Chelsea: Blues could rue latest away disappointment in race for Europe - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Chelsea's goalless draw at Brentford marked an eighth consecutive away match without picking up a victory in the Premier League for the Blues.\nIt is Enzo Maresca's side's longest winless run away from home in the top-flight since a 16-game run stretching between April 2000 and March 2001.\nGiven five points separate Chelsea in fourth and Fulham in eighth, with fourth and fifth set to be enough for Champions League qualification, the difference between which competition the Blues and their European-chasing rivals qualify for could be decided by just a couple of points, if not fewer.\nChelsea's winless away run, starting on 22 December after a goalless draw at Everton, includes trips to Manchester, Arsenal, Brighton and Aston Villa. Most, if not all, of that quartet, will be playing European football next season.\nThe Blues' final three away games do not get any easier, with Fulham, Newcastle and Nottingham Forest, who all sit in the top eight, still on Chelsea's radar on the road between now and the end of the season.\nBut the eight-game run on the road, including a defeat to Ipswich Town and draws with Everton, Crystal Palace and Brentford, will all feel like missed opportunities.", "url": "https://www.bbc.com/sport/football/articles/cy8exgjep1yo"}