{"authors": ["Graeme McLoughlin", "www.facebook.com"], "date_download": "2025-05-21 07:33:27", "date_modify": "2025-05-21 07:33:27", "date_publish": "2025-03-26 07:58:15", "description": "Ipswich news: Has Kieran McKenna underachieved? Graeme McLoughlin Q&A", "filename": "sport_football_articles_cn89w2y3v94o_1747812807.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/03c3/live/c2a45b40-4841-11ef-96a8-e710c6bfc866.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cn89w2y3v94o_1747812807.html", "title": "Ipswich news: Has Kieran McKenna underachieved? Graeme McLoughlin Q&A", "title_page": "Ipswich news: Has Kieran McKenna underachieved? Graeme McLoughlin Q&A - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Over the course of Wednesday, we are putting your questions to BBC Radio Suffolk sports editor Graeme McLoughlin. In the first part, we ponder the level of Kieran McKenna's achievements this season.\nAndy asked: What is your view on Kieran McKenna's tactics throughout the season, which do not seem to have altered?\nGraeme: It is quite hard for me to question the tactics of a manager who has won two promotions with the club and also masterminded wins this season over Chelsea and Tottenham (on both occasions using half a dozen players who featured in League One just two years ago).\nHowever, I will give it a go, Andy! I think there have been too many occasions this season where the line-up has featured one too many changes (although Ipswich's appalling luck with injuries has not helped McKenna on that front). There have been less impactful substitutions as well. There was super-sub Jack Taylor's heroics at Wolves, but there were many more moments like that last term.\nI am sure the manager would say otherwise given what he sees day to day in training, but it feels as if Town have taken a step or two backwards from where they were at the turn of the year. There was so much optimism after the Chelsea win, but just two points from the 10 league games since might prove fatal.\nWhile they kicked on after the January signings in both 2023 and 2024 bedded in, there has not been the same growth this time around. That is ultimately down to the level they are playing at. Championship to Premier League is a bigger step up than ever before.\nJulian asked: Do you think McKenna has underachieved this season considering the £120m spend?\nGraeme: I do not feel he has underachieved, but I do feel he has learned a great deal more about the Premier League and how much stronger it is across the board compared with when he was last in the top flight working as an assistant to Ole Gunnar Solskjaer at Manchester United.\nEvery side, not just the regular trophy winners, is so much more competitive. It feels odd saying it, but was a £120m spend enough? Was it the ownership that underachieved by not breaking the bank further, especially given so little was spent the previous summer when Ipswich made the jump from League One to Championship?\nWell, the owners certainly could not do much more than what they did or else they would have run the risk of breaking financial rules. For me, there was more than a decade of underachievement at this football club not so long ago, but not right now.", "url": "https://www.bbc.com/sport/football/articles/cn89w2y3v94o"}