{"authors": ["www.facebook.com"], "date_download": "2025-04-26 07:09:02", "date_modify": "2025-04-26 07:09:02", "date_publish": "2025-03-03 00:00:00", "description": "A penalty in each half from Aidan Keena hands 10-man Derry City their second defeat in four days as they lose 2-0 to St Patrick's Athletic in Richmond Park.", "filename": "sport_football_live_czxnngzx5yyt_1745651342.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_czxnngzx5yyt_1745651342.html", "title": "St Patrick's Athletic vs Derry City: League of Ireland Premier Division", "title_page": "St Patrick's Athletic vs Derry City: League of Ireland Premier Division - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A penalty in each half from Aidan Keena handed 10-man Derry City their second defeat in four days as they lost 2-0 to St Patrick's Athletic in Richmond Park.\nIn between Keena's pair of spot-kicks, City's Carl Winchester was shown a straight red card for a strong challenge on Tottenham Hotspur-bound teenager Mason Melia.\nThree points from their first four League of Ireland Premier Division games under new boss Tiernan Lynch leaves Derry second from bottom heading into Friday's fixture at home to Galway United.\nThe Foylesiders travelled to Inchicore having lost four of their past five matches away from home.\nSt. Pat's, managed by former Republic of Ireland boss Stephen Kenny, came into the season as title favourites and picked up their first win of the campaign last Friday overcoming Sligo in a 4-3 thriller in Richmond Park.\nWhile Derry did control the ball it was the home side who looked the most threatening and when Melia was upended in the City box referee Gavin Colfer had a think before pointing to the spot and providing Saints with the chance to open the scoring.\nKeena made no mistake firing past Maher into the bottom left-hand corner.\nThe Candystripes reacted admirably to going a goal behind and were well in the contest going in at the break just 1-0 down.\nBut Winchester's contentious sending off changed the complexion of the game.\nPat's failed to create many clear-cut chances against the 10 men but when Keena was tripped inside the box the striker quickly dusted himself down and blasted the same way to the net from the spot for his fifth goal of the season to consign City to a third defeat in four games.", "url": "https://www.bbc.co.uk/sport/football/live/czxnngzx5yyt"}