{"authors": ["Emma Sanders", "www.facebook.com"], "date_download": "2025-05-20 13:41:03", "date_modify": "2025-05-20 13:41:03", "date_publish": "2023-07-24 08:20:24", "description": "Germany begin their Women's World Cup campaign in style as captain Alexandra Popp scores twice to see off debutants Morocco in Melbourne.", "filename": "sport_football_66288659_1747748463.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1611F/production/_130499309_gettyimages-1550588930.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66288659_1747748463.html", "title": "Germany 6-0 Morocco: Alexandra Popp scores twice", "title_page": "Germany 6-0 Morocco: Alexandra Popp scores twice - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Germany began their Women's World Cup campaign in style as captain Alexandra Popp scored twice to see off debutants Morocco in Melbourne.\nIt was a comfortable victory for world number two side Germany, who are heavy favourites to top Group H.\nStriker Popp, who was ruled out of the Euro 2022 final through injury, made her mark with two clinical headers in the first half.\nKlara Buhl pounced on a rebound shortly after half-time to extend Germany's lead, before Morocco's Hanane Ait el Haj and Yasmin Mrabet poked into their own net on separate occasions.\nGermany continued to cause problems and completed the rout when substitute Lea Schuller added a sixth, firing it into an empty net after a swift counter-attack on the right.\nIt was a strong performance from Martina Voss-Tecklenburg's side as they created numerous chances and looked sharp going forward, hitting the woodwork on two occasions and having a goal ruled out for offside.\nDespite missing key players Lena Oberdorf and Marina Hegering through injury, Germany maintained their impressive record in the group stages of the competition, losing only once in 25 matches.\nMorocco, one of eight teams making their World Cup debut this year, were dangerous in flashes, but they lacked the clinical touch that Germany's Popp provided at the other end.", "url": "https://www.bbc.com/sport/football/66288659"}