{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:42:48", "date_modify": "2025-05-21 03:42:48", "date_publish": "2025-04-06 17:40:14", "description": "Donegal boss Jim McGuinness insists the Ulster Championship was always his main focus after a 1-25 to 1-15 win over Derry in Sunday's preliminary-round game in Ballybofey.", "filename": "sport_articles_cr5d37gl36eo_1747798968.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6f18/live/746ddc50-1300-11f0-baa6-cf6d1e060075.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cr5d37gl36eo_1747798968.html", "title": "Donegal 1-25 Derry 1-15: Ulster Championship always number one for me", "title_page": "Donegal 1-25 Derry 1-15: Ulster Championship always number one for me - Jim McGuinness - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Donegal manager Jim McGuinness insists the Ulster Championship will \"always\" be his main focus as he watched his side get off to a flying start with a 1-25 to 1-15 win over Derry in Sunday's preliminary-round game in Ballybofey.\nSpeaking to BBC Sport NI after the game, McGuinness was asked about the \"narrative\" of him fielding weakened teams in the latter stages of his side's Division One campaign.\nIn the end, Ulster champions Donegal missed out on a place in the league final which took place last weekend, just seven days prior to the provincial opener against Derry.\n\"I'm not sure if that's a question I was going to disrespect the Ulster Championship because that's the number one for me and always will be,\" he said after Sunday's win,\" he said.\n\"I spent all my life trying to win it as a player and the same when you come into management.\n\"When you set out at the beginning of the year, there's two championships: Ulster and the All-Ireland.\n\"This is the biggest day in the calendar for a manager and thankfully, we've got over the line.\n\"We have two weeks now to go to Monaghan - a team that's tapping maybe 1-26, 1-27 every day - playing with serious fluidity, scoring power and running power. It's going to be a completely different challenge for us.\"\nMuch has been made of the new rules introduced this year, but the Donegal boss is more than happy with a more open game and his side's tally of 1-25 backs that opinion.\nHowever, he was less than impressed that his centre-back Caolan McGonagle was forced to come to the sideline after receiving treatment which ultimately left the gap for Derry's Dan Higgins to find the net.\n\"Contrary to public opinion, I like the rules and I like the fact that it is much more transitional now,\" he stressed.\n\"It's the way we like to play our football, historically, and we have players that can play that way, so there were no issues there.\n\"Where I would be very annoyed is we had our centre-half back off the pitch when Derry scored a goal. They went straight down the centre of our defence and we didn't have our six in that position. It didn't cost us today but it could have.\"", "url": "https://www.bbc.com/sport/articles/cr5d37gl36eo"}