{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:49:23", "date_modify": "2025-05-21 03:49:23", "date_publish": "2025-04-07 15:12:11", "description": "McArdle relishing 'exciting' Germany test", "filename": "sport_articles_cj0zqrpv46eo_1747799363.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0e6e/live/784ec750-13c1-11f0-94c0-094e7adca435.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cj0zqrpv46eo_1747799363.html", "title": "McArdle relishing 'exciting' Germany test", "title_page": "McArdle relishing 'exciting' Germany test - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Scotland Interim head coach Mick McArdle says he is \"excited\" at the prospect of his young squad gaining valuable experience when they take on Germany in Wolfsburg on Tuesday night.\nMcArdle's side lost 4-0 to Germany on Friday at Tannadice and although disappointed with the outcome, McArdle insists there were positives to take into Tuesday's rematch.\n\"Result-wise, it was obviously not what we were looking for,\" McArdle said.\n\"But there's moments in the game where we feel we were unlucky but also moments of real clarity that the actual stats weren't too different, other than final box entries and then getting shots at goal.\n\"It's the style of play and identity that's the most important thing. If we play with a brave style and an identity that links with our culture and our way of playing, then we'll have that connection and we'll grow through that, whereas if we sit off top opponents, we're not going to grow too much.\"\nGermany are currently ranked number three in the world and McArdle says playing the best can only help Scotland's younger players develop in the long term.\n\"That's the exciting part,\" he added. \"They're getting tested against the best in international football. They've coped very well. Mentally it is the biggest challenge for the first camp.\n\"I've got massive applause for the senior players who have been outstanding.\n\"They've focused their efforts on helping them be the best version of themselves as young players. They see their younger self in them as well, so they know how to empathise that way.\"", "url": "https://www.bbc.com/sport/articles/cj0zqrpv46eo"}