{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:57:12", "date_modify": "2025-04-26 03:57:12", "date_publish": "2025-03-04 14:18:55", "description": "Everton news: Carlos Alcaraz on David Moyes and his future role", "filename": "sport_football_articles_cd7e8gvg53no_1745639832.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2213/live/8dceab70-f901-11ef-b5c1-27f306935cb2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cd7e8gvg53no_1745639832.html", "title": "Everton news: Carlos Alcaraz on David Moyes and his future role", "title_page": "Everton news: Carlos Alcaraz on David Moyes and his future role - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Everton midfielder Carlos Alcaraz has been speaking about his \"great start\" with the Toffees and his hopes of remaining at the club once his initial loan deal is complete.\nThe Argentine joined the club in January on transfer deadline day from Brazilian side Flamengo, and speaking about his time so far in an interview on the club's official website he said: \"It's been a great start, but that start is also based on the confidence my team-mates give me on a daily basis, in training, with the warmth I have received from them, so really it's been very nice.\n\"With that affection, with that confidence that my team-mates give me, I will continue to try to show my game and hopefully things will continue to go well for me, but, more importantly I hope things go well for the club.\"\nThe 22-year-old was the only player brought into the club by David Moyes in January and praised the Everton manager for the confidence he's given him.\n\"Moyes is a great person, he's a great manager, he gives me and my team-mates a lot of confidence, but maybe more so for me as the last player to arrive in a team that is already set up,\" Alcaraz said.\n\"He's a great person and we're very happy to have him back at Everton.\"\nEverton do have an option to buy Alcaraz at the conclusion of his loan spell and although he'd like to stay at the club, the midfielder is more focused on proving himself on the pitch.\n\"I try not to think too much about the loan, the objectives and so on,\" he added.\n\"I try to keep a cool head, to be patient, but I know that if I do things right, things will take care of themselves.\n\"It would be great to stay here because the club, the institution, the fans - they're great. It's very crazy but that's why I'm very calm and will keep doing the work I've been doing and show what type of player I am.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cd7e8gvg53no"}