{"authors": ["Ged Scott", "www.facebook.com"], "date_download": "2025-05-20 12:12:16", "date_modify": "2025-05-20 12:12:16", "date_publish": "2023-08-04 17:45:35", "description": "Alex Lees & David Bedingham hit tons as Durham smash their one-day record, while Worcestershire, Gloucestershire and Warwickshire also win.", "filename": "sport_cricket_66407814_1747743136.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4282/production/_130662071_lees.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66407814_1747743136.html", "title": "One-Day Cup: Lees & Bedingham hit tons as Durham break record", "title_page": "One-Day Cup: Lees & Bedingham hit tons as Durham break record - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Durham once again showed their liking for the south of England as they smashed their previous one-day best score to hammer Sussex by 132 runs at Hove.\nThere were also One-Day Cup Group B home wins for Worcestershire and Gloucestershire, while an Ed Barnard-inspired Warwickshire won the late game against Somerset at Taunton - but it was Durham's victory that most caught the eye.\nTheir total of 427-9 was their highest in List A cricket, beating 405-4 against Kent at Beckenham in 2001 - and there have been only six other higher totals in games between English counties since one-day cricket began in 1963.\nIt was founded on another century opening partnership between in-form England Ashes reject Alex Lees and wicketkeeper Graham Clark.\nTheir 135-run stand fell short of the 242 they put on together at Beckenham two years ago, but once Clark had gone for a run-a-minute 72, Lees was joined by David Bedingham - and they both went on to hit centuries.\nLees top scored with his List A best of 144, his fifth hundred of a run-filled summer, in which he had previously hit four County Championship centuries and been first to 1,000 first-class runs.\nBedingham belted Durham's fastest List A ton - from just 52 deliveries - with six fours and seven sixes, only to depart two balls later for 102.\nMichael Jones (38) and Jonny Bushnell (37 not out) then shared a further 65 for the eighth wicket to see Durham to their record score.\nSussex never looked like getting even close to the target, despite 65 from skipper Tom Haines and a 58-run stand between Fynn Hudson-Prentice (65) and Henry Crocombe (47).\nDurham's victory was a great response to being beaten in their opening game by Worcestershire, who made it two wins out of two with their four-wicket win over Glamorgan in front of another healthy 3,500 crowd at New Road.\nSpinners Josh Baker (2-41) and Pears red-ball captain Brett D'Oliveira (3-31) shared five wickets as Glamorgan were bowled out for 199 in 40.2 overs, despite an excellent knock of 82 on his List A debut by 19-year-old Ben Kellaway.\nBut Pakistan Test player Azhar Ali, who won this competition with Somerset in 2019, then took charge of the reply.\nAlthough the hosts lost wickets to slip from 136-1 to 190-6, Azhar's accomplished 78 saw Worcestershire home with with 8.3 overs to spare.\nBoth sides are back in action on Sunday, when Worcestershire meet Somerset at Taunton and Glamorgan go to Derby, followed by Tuesday's trip to Durham.\nGloucestershire matched Worcestershire in winning their first two Group games by beating Northamptonshire by 23 runs at Cheltenham College.\nBut after a comfortable six-wicket win over Derbyshire on Wednesday, this time they were given far more of a scare thanks to a maiden century for Northants tail-ender Tom Taylor in any form of the game.\nGloucestershire themselves had earlier recovered from 142-7 to be bowled out for 278 in the 49th over with Graeme van Buuren, returning after a month out injured, picking the right moment to hit his first List A hundred.\nThe South African top-scored with a pugnacious 108, sharing an eight-wicket stand of 104 with Anwar Ali (61).\nNorthants were in real trouble at 54-6 after a burst of three wickets in 11 deliveries from Ajeet Singh Dale, when Taylor came in.\nAfter a stand of 86 with Lewis McManus (54), he was not done and shared 106 for the ninth wicket with Jack White.\nTaylor hit 16 fours and three sixes - one of them a reverse sweep - before holing out in the 47th over, when they had got the target down to 30 off 21 balls.\nHe walked off to a massive reception from the packed College Ground crowd, before Tom Price also struck in his final over to have White caught and bowled.\nGloucestershire are back in action on Monday when they face Warwickshire at Edgbaston, while Northants will look to bounce back at home to Sussex on Sunday.\nWarwickshire will also go into Monday's game on the back of a win after beating Somerset by four wickets in front of a 4,500 crowd at Taunton.\nEngland Lions all-rounder Barnard, in a new role opening the batting, hit his career-best one-day score of 94 on his List A debut for the Bears.\nAfter winning the toss, the Bears bowled out the hosts for 230 inside 47 overs, thanks to left-arm mystery spinner Jake Lintott taking 3-43 on his home town ground.\nLewis Goldsworthy, making his first appearance of the season, top scored with 78, while George Bartlett contributed 74.\nBut Warwickshire were always in command as they made 233-6 to win with 6.2 overs to spare.\nBarnard shared stands of 78 with skipper Will Rhodes (38) and 72 with Hamza Shaikh (38) before perishing in a bid to reach his century with a six. But, although 29 were still needed, Kai Smith and Lintott coolly saw their side home.\nIreland all-rounder Curtis Campher finished with 3-47 on his first Somerset appearance.", "url": "https://www.bbc.com/sport/cricket/66407814"}