{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:44:55", "date_modify": "2025-05-21 03:44:55", "date_publish": "2025-04-06 15:24:32", "description": "Luis Reece takes 10 wickets in a match for the first time as Derbyshire beat Gloucestershire by nine wickets in the County Champiopnship.", "filename": "sport_cricket_articles_cp8k2jnk20ro_1747799095.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4eb9/live/04946250-12fb-11f0-baa6-cf6d1e060075.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cp8k2jnk20ro_1747799095.html", "title": "County Championship: Reece takes 10-for as Derbyshire beat Gloucestershire", "title_page": "County Championship: Reece takes 10-for as Derbyshire beat Gloucestershire - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Luis Reece celebrated a personal milestone to set up a Derbyshire victory over Gloucestershire by nine wickets on day three of their County Championship Division Two match.\nThe all-rounder took 10 wickets in a match for the first time, finishing with 4-45 to add to his 6 -52 in the first innings.\nBen Charlesworth made 110, his third first-class century, but no one else could play a significant innings as Gloucestershire were bowled out for 259.\nThat left the home side a victory target of 91 and Caleb Jewell's unbeaten 51, his second half-century of the game, guided them home inside 20 overs to give Derbyshire a 22-point haul and a victory from the opening match of the season for the first time in six years.\nGloucestershire needed a big partnership from Charlesworth and James Bracey to have any realistic chance but they added only 10 more runs before Zak Chappell broke through as he beat Bracey's defensive push.\nTheir hopes of setting the home side any kind of challenging target rested with Charlesworth and Graeme van Buuren, who was the only batter to pass 50 in the first innings.\nHe started positively, driving Chappell down the ground for four and cutting Anuj Dal for two more boundaries but Derbyshire soon took another step closer to victory.\nMartin Andersson tempted van Buuren into an expansive drive which he edged into the hands of Wayne Madsen at second slip.\nGloucestershire were only seven ahead and now it was a question of how long they could delay the inevitable.\nCharlesworth completed a fine hundred which came off 171 balls when he turned Jack Morley behind square for a couple but the opener's timing seemed to desert him before he became the next wicket to fall.\nHe miscued advancing down the pitch to Morley and only just cleared mid-off but when he tried to pull Reece he picked out Pat Brown at mid-wicket.\nTom Price and Zaman Akhter prevented further setbacks before lunch but the stand was broken six overs into the afternoon session when Akhtar was lbw playing back to the spin of David Lloyd.\nLloyd then had Price lbw for 26 leaving Reece to run in from the City End and polish off the tail with the second new ball.\nDerbyshire lost Lloyd in the fourth over to Tom Price as they began their second innings but the main concern for Gloucestershire was improving their over-rate to avoid a points deduction.\nSpinners Ollie Price and van Buuren operated in tandem which allowed Jewell and Harry Came to ease to the finishing line in the late afternoon sunshine.\nThe only note of concern for Derbyshire was a worrying injury to substitute fielder Aneurin Donald, who appeared to damage his shoulder diving to try and save a boundary.", "url": "https://www.bbc.com/sport/cricket/articles/cp8k2jnk20ro"}