{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:50:00", "date_modify": "2025-05-21 06:50:00", "date_publish": "2025-04-02 00:00:00", "description": "Sandro Tonali scores an incredible winner to boost Newcastle's Champions League hopes in their first game since lifting the Carabao Cup.", "filename": "sport_football_live_c9dedvv0e14t_1747810200.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/eeaa/live/8f6ccf90-1001-11f0-ba12-8d27eb561761.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c9dedvv0e14t_1747810200.html", "title": "Newcastle 2-1 Brentford: Sandro Tonali freak goal boosts Champions League hopes in Premier League win", "title_page": "Newcastle 2-1 Brentford: Sandro Tonali freak goal boosts Champions League hopes in Premier League win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Sandro Tonali scored an incredible winner to boost Newcastle's hopes of a place in the Champions League as the Magpies tasted victory in their first game since lifting the Carabao Cup.\nAlexander Isak's 20th Premier League goal of the season put Eddie Howe's side ahead, but Bryan Mbeumo equalised from the penalty spot after Nick Pope's foul on Yoane Wissa changed the mood inside St James' Park.\nHowever, Tonali's cross-shot from close to the right corner flag left Brentford goalkeeper Mark Flekken red-faced and ensured Newcastle remained very much in the mix for a top-four finish.\nTonali later explained in a television interview that his effort was \"70% cross and a 30% shot\".\n\"It was difficult for the goalkeeper and difficult also for me,\" said the former AC Milan midfielder. \"Also a little bit of luck.\"\nThis game came 17 days after Newcastle beat Liverpool at Wembley to end the club's 70-year wait for a major domestic trophy.\nThe international break gave Newcastle a chance to bask in their Wembley glory, but boss Howe said it was imperative his side kicked on after that success.\nThey were far from at their fluent best but did enough to beat a Brentford side who had won all five of their away games in 2025 before this trip.\nIn-form Isak's latest goal in what is turning out to be a special season for the Sweden striker came as he guided Jacob Murphy's cross past Flekken following a slip by Mbeumo.\nThis is now the second successive season in which Isak has scored 20 or more Premier League goals for Newcastle.\nMbeumo's equaliser from the spot raised Brentford's hopes of extending their winning run on the road, before Italy midfielder Tonali had the decisive say.\nNewcastle, who moved above Chelsea into fifth, are one point behind fourth-placed Manchester City with one game in hand.\nBrentford remain 11th on 41 points.\nBrentford will be bitterly disappointed to leave St James' Park with nothing to show for their efforts.\nThe Bees have found plenty of success on the road this year, brushing aside Southampton, Crystal Palace, West Ham, Leicester and Bournemouth.\nThey failed to test Pope in the first half but it was a different story after half-time, with Ethan Pinnock heading against the post at 1-1.\nNewcastle fans were biting their nails as Mikkel Damsgaard and Kevin Schade both missed chances deep in stoppage time, while the video assistant referee reviewed a collision between Bruno Guimaraes and Damsgaard before deciding not to award Brentford a penalty.\nIn the end the Bees, who have all but secured a fifth successive season in the Premier League, lost for the first time away from home since 15 December after Tonali's outrageous finish.\nBrentford boss Thomas Frank approached Tonali after the final whistle to ask him if he meant it.\nTonali responded with a smile and a nod before his post-match television interview offered a more revealing insight.\n\"That is one in a million,\" said Frank when asked about Tonali's finish.", "url": "https://www.bbc.com/sport/football/live/c9dedvv0e14t"}