{"authors": ["Rob Butler", "www.facebook.com"], "date_download": "2025-05-21 03:55:47", "date_modify": "2025-05-21 03:55:47", "date_publish": "2025-04-07 13:44:06", "description": "Norwich City head coach Johannes Hoff Thorup provides some updates ahead of his side's game against Sunderland.", "filename": "sport_football_articles_cy0xdn66yz6o_1747799747.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0d0c/live/2bc7db80-138d-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy0xdn66yz6o_1747799747.html", "title": "Norwich City in \"strong position\" to sign Jacob Wright", "title_page": "Norwich City in \"strong position\" to sign Jacob Wright - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "After the game against Plymouth, on-loan Manchester City midfielder Jacob Wright said he wanted to make his move to the club permanent in the summer. Thorup says no decisions have been made but the Canaries are in a \"strong position\" to sign him.\nAfter winger Matej Jurasek missed the Plymouth game with a quad injury, Thorup says he is not sure when he will be available again. \"I would love to bring him in and give him some playing minutes.\" Thorup says there is hope that Jurasek could still play a part in this campaign.\nDefender Lucien Mahovo is still absent, he now has a knee injury.\nMidfielder Liam Gibbs should be \"around the squad\" for the Sunderland game after being out injured since November.\nThorup wants to see his team become more effective from set-pieces. \"We have scored more than 60 goals this season and only three of them have come from corner kicks, this should be close to 20,\" he said.\nThorup said that clear objectives were set in recent meetings with the club owners in the US. He says he fully believes the team will be where it should be in six months.", "url": "https://www.bbc.com/sport/football/articles/cy0xdn66yz6o"}