{"authors": ["Greg Playfair", "www.facebook.com"], "date_download": "2025-04-26 07:54:41", "date_modify": "2025-04-26 07:54:41", "date_publish": "2025-02-25 13:02:58", "description": "Hearts fan voice: 'Gordon debate should now be closed'", "filename": "sport_articles_c4g7pxngxldo_1745654081.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cccc/live/853eb980-f36d-11ef-896e-d7e7fb1719a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_c4g7pxngxldo_1745654081.html", "title": "'Gordon debate should now be closed'", "title_page": "Hearts fan voice: 'Gordon debate should now be closed' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Death, taxes and an eye-bleeding game of football at McDiarmid Park are three things you're guaranteed in life.\nSunday's game wasn't that bad but if it had been played in a neutral's front lawn, I wouldn't blame them for keeping the curtains shut given how terrible the pitch was.\nHearts played well in fits and spurts, with impressive individual performances from Elton Kabangu and Craig Gordon inspiring the 2-1 victory.\nKabangu has now netted seven times in his first seven appearances, yet how we'd all have hoped he could have saved one goal for the previous week against Rangers and we could be talking about Hearts being unbeaten in nine games.\nThe truth is, we could have lost for the second time in 2025 had it not been for Gordon's superb instinctive save at 1-1. I know there's been a running debate about whether Gordon should be dropped for Zander Clark, but given his heroics in Paisley and now in Perth, that argument is over for the rest of this campaign.\nThere are questions about how long the 42-year-old can last as our number one, but I sense there's a romantic desire of Gordon wanting to finish on a high and is dreaming of lifting the Scottish Cup for a fourth time in his career.\nI'll park that vision for now as this week brings a double-header versus sides who will want to thwart our attempts to finally break back into the top six, with St Mirren visiting on Wednesday before Sunday's derby trip to Easter Road.\nI'd expect Neil Critchley to rotate the team against St Mirren as the derby is a game, deep down, he'll prioritise given we haven't beaten Hibs in over 14 months.\nI'll stick my neck out and predict Lawrence Shankland will be involved in the winner - either an assist or scoring himself - to clinch a first derby win for Critchley.", "url": "https://www.bbc.co.uk/sport/articles/c4g7pxngxldo"}