{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:21:09", "date_modify": "2025-05-21 05:21:09", "date_publish": "2025-01-31 22:30:25", "description": "Ange Postecoglou insists Tottenham remains an attractive proposition for new players and says the club is \"exploring some opportunities\" before the transfer deadline.", "filename": "sport_football_articles_cz9e4l982z3o_1747804869.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4145/live/e0c51b80-e00f-11ef-8992-59cb2eb4d7c4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cz9e4l982z3o_1747804869.html", "title": "Tottenham still attractive club for prospective signings, says manager Ange Postecoglou", "title_page": "Tottenham still attractive club for prospective signings, says manager Ange Postecoglou - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ange Postecoglou insists Tottenham remain an attractive proposition for new signings - saying they are \"exploring some opportunities\" before Monday's transfer window deadline.\nSpurs are 15th in the Premier League following a seven-game winless run in the competition but are in contention for three other trophies this season.\nPostecoglou, whose squad has been wrecked by injuries, will be without nine first-team players for Sunday's league fixture at Brentford.\nHowever, Spurs are yet to sign an outfield player this month, with goalkeeper Antonin Kinsky's £12.5m move from Slavia Prague their only January addition.\nAsked if potential new signings still want to move to the club, head coach Postecoglou said: \"It depends what the players are looking for.\n\"You can look at it two ways. OK the league form is not great but there's some pretty big possibilities to have success here in the last three or four months [of the season].\n\"It's still a big club, it's still a club that can challenge for honours and it's whether the player sees the potential that we see right now, or certainly that I see. If it's too much of a hard sell, it's probably not the right one for us.\"\nDespite their poor league form, Tottenham retain hope of a first trophy since 2008.\nSpurs hold a 1-0 lead over Liverpool in the Carabao Cup semi-finals before next week's second leg, while they are also through to the FA Cup fourth round and last 16 of the Europa League.\nPostecoglou was without 12 players for Thursday's 3-0 Europa League win over Elfsborg because of injury and ineligibility, and lost defender Radu Dragusin to injury on the night.\nWhile he would not comment directly on the club's links to Bayern Munich forward Mathys Tel, Postecoglou said the club was \"exploring some opportunities in the last couple of days of the window\", which closes on Monday at 23:00 GMT.\n\"There is definitely a need for us [to make signings] and has been a need,\" Postecoglou said.\n\"That's why we've been looking for a player or two to help us with what's ahead, but they have to be the right types and fit in with what we're doing.\n\"I guess that's the tricky bit. There are plenty of players available but are they going to be the right ones? That's the question for us.\"", "url": "https://www.bbc.com/sport/football/articles/cz9e4l982z3o"}