{"authors": ["Jack Herrall", "www.facebook.com"], "date_download": "2025-04-26 06:55:05", "date_modify": "2025-04-26 06:55:05", "date_publish": "2025-02-28 15:49:42", "description": "Celtic: Rodgers on Old Firm away allocations, 'strong' finish & hard-working Bonnar", "filename": "sport_articles_c3e4vjjgvv3o_1745650505.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e05f/live/4f2e7240-f5e3-11ef-a452-97c9e2e951dd.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_c3e4vjjgvv3o_1745650505.html", "title": "Rodgers on Old Firm away allocations, 'strong' finish & hard-working Bonnar", "title_page": "Celtic: Rodgers on Old Firm away allocations, 'strong' finish & hard-working Bonnar - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "He welcomes the return of away allocations to Old Firm derbies, saying it is \"great for the game, great for the spectacle of the game, and obviously ultimately for the supporters\".\nRodgers is keen to see the away supports return to previous levels, far above this new 4% figure, saying: \"Hopefully it can get somewhere near to where it was before because that always creates an amazing atmosphere.\"\nHe adds that the issue around away fans \"wasn't a Celtic thing\" and it \"was out of our control at the beginning of it all\".\nRodgers expects to face a \"coordinated\" St Mirren but takes confidence from Celtic's win in Paisley earlier in the season where they did \"all the dirty bits of the game really well\".\nCeltic are now at the part of the season where they want to \"finish really strong\", with Rodgers' side holding a commanding 13-point lead in the Premiership and still competing for a domestic treble.\nRodgers says the club \"haven't heard anything\" on the VAR calls from Celtic's defeat by Hibs after Dundee United manager Jim Goodwin had complained about the technology in midweek.\nOn Jude Bonnar's debut in the win over Aberdeen, Rodgers says \"it's a nice reward\" for the 19-year-old and he is \"working very, very hard, which I notice\".", "url": "https://www.bbc.co.uk/sport/articles/c3e4vjjgvv3o"}