{"authors": ["Chris Wathan", "www.facebook.com"], "date_download": "2025-05-20 12:25:41", "date_modify": "2025-05-20 12:25:41", "date_publish": "2023-08-04 12:52:08", "description": "A new share issue confirms investment in the Championship club by American chairman Andy Coleman.", "filename": "sport_football_66407887_1747743941.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/B671/production/_130650764_gettyimages-1252672160.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66407887_1747743941.html", "title": "Swansea City: Chairman Andy Coleman investment brings cash boost", "title_page": "Swansea City: Chairman Andy Coleman investment brings cash boost - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Swansea City have received a financial boost from a new share issue, confirming investment in the club from American chairman Andy Coleman.\nColeman undertook a \"significant shareholding\" in the club in May.\nHe is among those from the club's majority ownership group to have purchased new shares, thought to be worth about £10m.\nIt comes after a similar sum was invested by businessman Nigel Morris last month.\nMorris, the co-founder of finance firm Capital, became a minority shareholder and took a place on the club's board.\nThe latest investment means Morris now owns 16.13% stake of the club while Swansea Supporters Trust - which has a protected 5% and place on the board - is now at 10.67%.\nA Trust statement said: \"This investment will help provide the club with new working capital as we approach the start of the new season, and we hope it will be used to support improvements to the playing squad in the remainder of this transfer window, upgrades to the club's infrastructure and contribute towards the clubs' overhead costs.\"\nColeman is part of the Swansea Football LLC ownership group alongside new director Brett Cravatt, board member Jake Silverstein and long-term stakeholders Jason Levien and Steve Kaplan. The group's shareholding stands at 69.32%.\nThe club also confirmed former chairman Huw Jenkins is no longer a director, having previously retained the status despite his resignation as chairman in February 2019.", "url": "https://www.bbc.com/sport/football/66407887"}