{"authors": ["Matt Gault", "www.facebook.com"], "date_download": "2025-05-20 14:00:25", "date_modify": "2025-05-20 14:00:25", "date_publish": "2023-07-31 07:05:54", "description": "Sunday's win was James McCarthy's ninth All-Ireland title with Dublin. After a couple of dark years, he considers this year's win the best of the lot.", "filename": "sport_gaelic-games_66355172_1747749625.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/124EC/production/_130588947_inpho_02301739.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_gaelic-games_66355172_1747749625.html", "title": "Dublin win All-Ireland: Painful road back makes ninth title the sweetest of them all for James McCarthy", "title_page": "Dublin win All-Ireland: Painful road back makes ninth title the sweetest of them all for James McCarthy - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "There is no doubt in James McCarthy's mind: Dublin's latest All-Ireland title, captured with a tense 1-15 to 1-13 win over Kerry on Sunday, is the sweetest of the nine he has now won in his remarkable career.\nIt is often easy for a player to say such a thing minutes after lifting the Sam Maguire, but when you consider the context, it is also easy to see why the Dublin captain believes it.\nMcCarthy is now one of three players - alongside team-mates Stephen Cluxton and Michael Fitzsimons - with nine All-Ireland medals to his name. He made his Dublin debut in 2010 and quickly began hoovering up titles.\nThere were All-Ireland wins in 2011 and 2013 before the sensational, record-shattering six-in-a-row sequence of 2015-2020.\nSince then, however, Dublin's senior footballers have been forced to grapple with the idea that they were no longer the best, no longer the feared kings of Croke Park.\nHaving been an unstoppable winning machine under Jim Gavin, the high-profile setbacks suffered over the last two-and-a-half years would be enough to send most teams packing. An agonising All-Ireland semi-final defeat by Mayo. Relegation to Division Two. A second All-Ireland semi-final loss, to Kerry.\nYes, for McCarthy, Sunday's victory meant even more because it was the first time Dublin had won the big one after having been written off and looked upon as a fallen giant.\n\"I have no doubt in saying that, it was the most special All-Ireland I've won,\" said the Ballymun Kickhams defender as he sipped on a celebratory pint of stout in Croke Park's press conference room.\n\"To come back after being knocked down twice. A few people rule you out, thinking the time has passed, but I knew we were still good enough to win it. I had no doubt in my mind.\"\nOf course, as Dublin manager, Dessie Farrell has been the lightning rod for the last couple of years.\nWhile the former All-Star forward led Dublin to their sixth straight title in 2020, prolonging the dominance established by his venerated predecessor, he has taken a lot of flak during his reign for presiding over what many regarded as the decline of the greatest team this sport has ever witnessed.\nAnd having watched Farrell take the hits for the players' poor performances, McCarthy said he was \"so happy\" for his manager because his \"care for everyone is truly special\".\n\"I just thought some of the words that he took, or some of the shots at him the last two years were a disgrace to be honest,\" McCarthy said of Farrell.\n\"It's always on the players when you cross that white line out there and we lost two All-Ireland semi-finals. One by a kick of a ball, one in extra-time. The margins are tight and we've come on the other side of them plenty of times.\n\"It's always somewhere in between but we were ferociously disappointed the last two seasons, they hurt, they really did hurt. But life goes on. You gather at the start of the year.\n\"We had a bit of a chat and said we'd try to get a few boys back and they'd make a difference as well.\"\n'Getting a few boys back' was, of course, a reference to the return of Stephen Cluxton, Jack McCaffrey and Paul Mannion to the Dublin set-up this year after having stepped away from inter-county commitments.\nWhile McCarthy was keen to highlight the contributions of the younger Dublin players as well, the aforementioned trio's experience and big-game nous have been pivotal.\nMcCaffrey is a former footballer of the year, while Cluxton is the greatest goalkeeper to ever play the game, a 22-year Dublin veteran who up until Paul Geaney's strike in first-half injury time on Sunday hadn't conceded a championship goal since 2019.\nThen there's Paul Mannion, who was exceptional against Kerry and whose fifth point of the afternoon edged Dublin back in front in injury time, helping him complete an All-Ireland double in 2023 after his club success with Kilmacud Crokes.\nMcCarthy had hinted at possibly retiring during his post-match interview with RTE, and when asked if this year's success felt like one last hurrah for the more seasoned members of the Dublin panel, he showed no interest in reassuring anyone that he would be back for the defence of Sam.\n\"Who knows? Maybe. Look, it's not a bad way to probably wrap it up, is it?\n\"But look, there's a lot of guys who've to make decisions and a lot of guys that will make decisions in the next couple of months.\n\"We'll see what happens. There's nothing definite but let's just enjoy the five or seven days.\"\nAt this point, Farrell - sitting to McCarthy's left - jumps in.\nWhile Dublin can bask in the glory of being on top once again, Kerry are left to reflect on a gut-wrenching conclusion to their championship as they fell short in their bid for back-to-back titles.\nKerry twice led by three points in the second half only to succumb to a strong Dublin finish.\nFor Kingdom boss Jack O'Connor, Paddy Small's goal for the Dubs was a \"huge turning point\".\n\"It's never easy losing an All-Ireland final,\" said O'Connor.\n\"It's a tough one because I thought there were stages of that game in the second half when we were like, I won't say in control, but were playing within ourselves.\n\"I just thought the goal was a huge turning point. It gave such energy to Dublin playing into the Hill.\n\"While our boys reacted really well to the goal, the energy it took to come back from the goal and go up by three, it possibly took it out of our fellas in the last five or 10 minutes.\n\"Once Dublin smelled it, they have the extra bit of experience and know-how that has seen them get over the line in tight games before and this one was no different.\"", "url": "https://www.bbc.com/sport/gaelic-games/66355172"}