{"authors": ["Nick McPheat", "www.facebook.com"], "date_download": "2025-05-21 07:54:51", "date_modify": "2025-05-21 07:54:51", "date_publish": "2025-01-22 09:38:45", "description": "'Motherwell was the first thing we spoke about' - Max Johnston on Mika Biereth", "filename": "sport_articles_c5yd41yxv1yo_1747814091.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0ccf/live/cfb29880-d831-11ef-b53e-c368a3ded67f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c5yd41yxv1yo_1747814091.html", "title": "'Motherwell was the first thing we spoke about'", "title_page": "'Motherwell was the first thing we spoke about' - Max Johnston on Mika Biereth - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "When Max Johnston first met Mika Biereth, Motherwell was the first thing on their minds.\nFir Park academy graduate Johnston had just left Lanarkshire when striker Biereth made the move to Stuart Kettlewell's side on loan from Arsenal.\nBut, only six months later, their paths eventually crossed in Austria at Sturm Graz.\n\"When Mika first joined, Motherwell was the first thing we spoke about,\" right-back Johnston tells BBC Scotland.\nBiereth had just finished a brief loan at Fir Park. Despite a lengthy injury, the Danish youngster still managed to net six goals and provide five assists in just 15 games.\nThe forward was then recalled by Arsenal and sent to Graz, where his loan became permanent after another free-scoring spell.\nThe 21-year-old's remarkable rise resulted in a move to Monaco earlier this month for a reported fee of up to 15 million euros.\n\"Mika's a top, top player,\" Johnston says of his former team-mate.\n\"He's a goal scorer, which is exactly what you want from a striker. He's powerful and he's quick. There's not much more you can ask for.\n\"And he really enjoyed his time at Motherwell. Obviously we know a few of the same boys so we spoke about it a lot, his time and my time.\n\"He only ever had good things to say.\"", "url": "https://www.bbc.com/sport/articles/c5yd41yxv1yo"}