{"authors": ["Brent Pilnick", "www.facebook.com"], "date_download": "2025-05-20 13:18:24", "date_modify": "2025-05-20 13:18:24", "date_publish": "2023-08-02 12:18:09", "description": "Truro City boss Paul Wotton looks ahead to a new season where the club will again play '46 away games' in National League South.", "filename": "sport_football_66383412_1747747104.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0B73/production/_130613920_mediaitem130613919.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66383412_1747747104.html", "title": "Truro City ready for National League South return despite being a 'nomadic' club", "title_page": "Truro City ready for National League South return despite being a 'nomadic' club - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "\"We worked a miracle really to get promoted playing 46 away games,\" reflected Truro City manager Paul Wotton.\nThe White Tigers have spent the past two years playing in Wotton's home town as they share Plymouth Parkway's Bolitho Park ground after Truro's Treyew Road home was redeveloped into a supermarket.\nBut Cornwall's nomadic leading football club has hope for the future with work starting on a new ground in Truro.\n\"It's hard. We turn up and everything's yellow and blue - which are Parkway's colours - you just haven't got a home, it's nomadic experience,\" Wotton, a former Plymouth Argyle captain and legendary figure at the newly-promoted Championship club, told BBC Sport.\n\"But there's light at the end of the tunnel now.\n\"I went down to the new site a couple of weeks ago and you can see where the pitches are going to go, you can see where the stands are going to go, it's all happening, so you've just got to put your faith in the people behind it.\"\nThis season will be the third time since 2011 that the club have made it to the National League South and the second time they will play at that level at a temporary home - they spent the first half of the 2018-19 season at Torquay United before plans for Treyew Road's closure stalled.\nAnd Wotton will argue that promotion is not before time - Truro were top of Southern League Premier Division South and eyeing promotion to the sixth tier when the Covid-19 pandemic saw the league declared null and void while the following season also fell by the wayside after just a handful of games.\nAn eighth-placed finish in 2022 was followed up by promotion last season as they finished third in the table and won the play-offs.\n\"The Southern Premier League was starting to get a little bit friendly, playing the same teams all the time,\" Wotton added.\n\"So I can't wait to play against new opposition, a better standard of opposition, better grounds, better players, better managers, bigger budgets, all that sort of thing.\n\"It's going to be tremendously tough. Nine times out of 10 the league table sort of represents the budgets really, but we punched above our weight last year and got promoted and we'll have to punch above our weight this year.\n\"It's difficult, but we'll just have to be the best at the things that require no talent, so why can't we be fitter, why can't we be more organised, why can't we plan better for games, why can't we scout teams better?\n\"There's lots of different ways to go about your business, but we'll see and I'm looking forward to it.\"", "url": "https://www.bbc.com/sport/football/66383412"}