{"authors": ["Pat Riddell", "www.facebook.com"], "date_download": "2025-05-21 05:55:14", "date_modify": "2025-05-21 05:55:14", "date_publish": "2025-01-14 11:19:42", "description": "Nottingham Forest news: Opinion - FA Cup not a distraction but essential to maintaining harmony", "filename": "sport_football_articles_c863qwdg74po_1747806914.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2992/live/78122530-b62e-11ee-8f07-bbfdfa890097.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c863qwdg74po_1747806914.html", "title": "Nottingham Forest news: Opinion", "title_page": "Nottingham Forest news: Opinion - FA Cup not a distraction but essential to maintaining harmony - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Going out in the early stages of any cup is always an excuse to use the line: \"Now we can concentrate on the league.\"\nNottingham Forest's dismissal of Luton Town in the third round of the FA Cup - not always an easy time for the Reds - sets up an away tie at Exeter City next month.\nAnd rather than it being a distraction from the job at hand - namely Liverpool on Tuesday, and the push for Europe - the cup has provided the perfect opportunity for the squad players to impress.\nNuno Espirito Santo, at Wolves and now Forest, prefers a smaller squad - for unity and spirit as much as anything - and the FA Cup allows those on the fringes to be involved in the first team and push for minutes in the league.\nMore importantly, giving those players a run out and bringing on the likes of Chris Wood, Anthony Elanga and Callum Hudson-Odoi keeps them fresh for the imminent games with top-of-the-table Liverpool and and bottom-of-the-table Southampton.\nMeanwhile, the return of midfielder Danilo after breaking his ankle in August is like a new signing in a transfer window and could further strengthen the Reds. We wait to see if there are further additions this month.\nShould we get past Exeter into the next round - and believe me, no Forest fan takes any result for granted - then the line-up might resemble something more familiar.\nBut until then, the cup is not just a distraction - welcome or otherwise - it is an essential factor in maintaining the harmony that currently exists at The City Ground.\nFixture congestion is something we can happily worry about in the future.", "url": "https://www.bbc.com/sport/football/articles/c863qwdg74po"}