{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:10:55", "date_modify": "2025-05-21 06:10:55", "date_publish": "2025-03-31 10:04:47", "description": "Cardiff City's Andy Rinomhota pays tribute to his brother following reports that Joseph Itai Rinomhota died after a Muay Thai boxing match in Thailand.", "filename": "sport_football_articles_cwy07rd8emeo_1747807855.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d29e/live/9c95edc0-0df7-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cwy07rd8emeo_1747807855.html", "title": "Andy Rinomhota: Cardiff City midfielder pays tribute after brother's death", "title_page": "Andy Rinomhota: Cardiff City midfielder pays tribute after brother's death - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cardiff City's Andy Rinomhota has paid an emotional tribute following the death of his brother, saying: \"Nothing could've prepared me for what's happened.\"\nRinnomhota has posted on social media following reports that Joseph Itai Rinomhota, 30, died after receiving a kick to the ribs during a Muay Thai boxing match on the island of Koh Samui, Thailand.\nZimbabwe international Rinomhota, 27, said: \"No words or pictures are going to be enough to show or express the love I have and will always have for you my brother.\"\nThe Leeds-born footballer added: \"Those we love don't go away, they walk beside us every day. Rest in peace Joe.\"\nReports from Thailand say Rinomhota's brother was participating in his first Muay Thai fight on Friday, 28 March and collapsed several minutes after leaving the ring following a third-round stoppage.\n\"I'm hoping this will help to heal the pain even if only slightly,\" said former Reading player Rinomhota in his Instagram post,, external which includes a picture of his brother in front of a promotional billboard for his fight.\n\"You lived life to the fullest and I know you'd have no regrets even now.\n\"As a brother they don't come better than you, caring, kind, supportive, the list is endless, you always looked after me in every way possible and I should've told you more just how much that meant to me.\n\"I know you'll continue to watch over me and provide me with the strength and love you always have.\"\nIn a statement on their X account,, external Cardiff said: \"Our thoughts and love go out to Andy Rinomhota and his family.\n\"We are all with you, Andy.\"\nRinomhota has been one of Cardiff's best performers this season, but was not involved in Saturday's draw against Sheffield Wednesday.\nA midfielder or right-back, he has played 77 games for the Bluebirds since joining from Reading in 2022.\nHe played 139 times during five years with the Royals, while he also played 16 games during a loan spell Rotherham last season.", "url": "https://www.bbc.com/sport/football/articles/cwy07rd8emeo"}