{"authors": ["Kate Blakemore", "www.facebook.com"], "date_download": "2025-05-21 05:46:29", "date_modify": "2025-05-21 05:46:29", "date_publish": "2025-04-02 13:00:27", "description": "Leicester news: Opinion - 'Go hard or go down'", "filename": "sport_football_articles_ce3vw1we533o_1747806389.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4487/live/4f936c40-b629-11ee-bc2f-cb5579b90709.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ce3vw1we533o_1747806389.html", "title": "'Go hard or go down'", "title_page": "Leicester news: Opinion - 'Go hard or go down' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Leicester City have just nine games or 810 minutes to get as many points as possible from the 27 remaining.\nIt really is the business end of the season for us. A defining period determining whether said \"business\" will be in the Premier League or Championship next season.\nIt is beginning to feel like a foregone conclusion, but then I cling onto any diminishing hope remaining by remembering that it was the 30th fixture of the season back in 2015 that Leicester's famous \"Great Escape\" began.\nUnfortunately, this season's 30th fixture comes in the form of a large obstacle called Manchester City at Etihad Stadium. There is no doubt about it, Leicester have not even reached Base Camp and yet the task set before them is a direct ascent up Mount Everest.\nI would guess most fans have accepted relegation now but, until it is mathematically confirmed, fans expect to see fight, grit, humility, dynamism, quick decision-making and proactivity. And that is just from Ruud van Nistelrooy.\nWe are desperate for our play to include aggression, tenacity, the fire in our belly and the undertone of writing us off at your peril. Kasabian's famous song \"Underdog\" plays out as the players walk onto the King Power turf and the line \"See the local loves a fighter\" needs to galvanise the team to leave it all out there. It is really a case of \"go hard or go down\".\nSome form of result against Manchester City would really help with crowd belief and atmosphere - something which we can carry into the final four home games of the season to make the King Power a cauldron as it once has been.\nAs with any underdog though, it is not the size of the dog in the fight, but the size of the fight in the dog.", "url": "https://www.bbc.com/sport/football/articles/ce3vw1we533o"}