{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:07:01", "date_modify": "2025-05-21 05:07:01", "date_publish": "2025-04-04 04:02:39", "description": "Swansea City: Luke Williams exit 'sad' but game 'keeps going' - Lawrence Vigouroux", "filename": "sport_football_articles_cp8j7r536wdo_1747804021.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/22d9/live/fab97230-1079-11f0-8c6c-d990c1c0e96b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cp8j7r536wdo_1747804021.html", "title": "Swansea City: Luke Williams exit 'sad' but game 'keeps going'", "title_page": "Swansea City: Luke Williams exit 'sad' but game 'keeps going' - Lawrence Vigouroux - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Lawrence Vigouroux was sad to see Luke Williams leave Swansea City – but says the players he left behind have not had time to dwell on the departure of their former head coach.\nWilliams, the man who signed Vigouroux last summer, said farewell to Swansea in February after a run of seven defeats in nine league games.\nSince then, Swansea have taken eight points from six games under caretaker boss Alan Sheehan to edge towards securing their Championship status for next season.\n\"It was disappointing [to see Williams go],\" goalkeeper Viogouroux said.\n\"A lot of things happened in that time. We lost Matt Grimes who was such an important player for us and then we lose the manager.\n\"I think it's football in terms of nothing is ever guaranteed for a long period of time. It was sad but football keeps going. If you feel sorry for yourself then you can end up losing way more games.\"\nDerby County's victory over Preston North End on Wednesday means 16th-placed Swansea are five points clear of the relegation places with seven games remaining this season, the first of which is at home against the Rams this Saturday (5:00 BST).\nDerby are up to 20th in the table, four points behind their weekend opponents, having won four successive games.\nAfter tackling John Eustace's rejuvenated team, Swansea host bottom-of-the-table Plymouth Argyle next Wednesday.\nSwansea head into what could be a key week knowing two home wins would make them all but safe on 51 points, and with spirits lifted by last weekend's rousing draw with promotion-chasing Leeds United.\n\"We have shown we can get results against some of the teams at the top end of the division and hopefully that continues,\" Vigouroux added.\n\"Leeds was a really tough game and it was a great result for us.\n\"But it's only a good point if we can get some result in the next two games.\"", "url": "https://www.bbc.com/sport/football/articles/cp8j7r536wdo"}