{"authors": ["Adam Williams", "www.facebook.com"], "date_download": "2025-05-19 15:15:41", "date_modify": "2025-05-19 15:15:41", "date_publish": "2015-03-06 16:21:02", "description": "Bradford and Reading face a replay for a place in the FA Cup semi-finals after a goalless draw at Valley Parade.", "filename": "sport_football_31669807_1747667741.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81466000/jpg/_81466942_stead_and_hector_getty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31669807_1747667741.html", "title": "Bradford City 0-0 Reading", "title_page": "Bradford City 0-0 Reading - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Bradford and Reading must meet again for a place in the FA Cup semi-finals after playing out a tense and scrappy goalless draw at Valley Parade.\nBoth sides hit the post but it was a game of few clear chances on a testing and uneven surface.\nPavel Pogrebnyak saw his effort strike the woodwork for the visitors while Bradford's Gary Liddle was denied by the frame from a speculative shot.\nThe replay at Madejski Stadium is scheduled for Monday, 16 March.\nBradford came into the tie having knocked out Premier League Chelsea and Sunderland en route to the last eight and named the same starting line-up that beat the Black Cats 2-0 in the fifth round.\nReading had beaten three Championship sides on their way to the quarter-finals and made two changes from the side that drew 1-1 against Bolton on Tuesday.\nIn front of a capacity crowd the hosts from League One put in some determined tackles on their Championship opponents as they sought to press in the early stages, although a weak header from James Hanson was their only chance in the opening 15 minutes.\nIt fell to the Royals to create the first clear opening when Russian striker Pogrebnyak struck a post with a right-footed shot after latching on to Jamie Mackie's cross.\nBradford hit the woodwork themselves when midfielder Liddle's speculative cross almost crept past the stranded Adam Federici.\nBradford had the better of what chances there were in a second half that proved more listless than the first.\nFelipe Morais found space moments after the restart but chose to square the ball across goal rather than shoot, while Hanson's side-footed effort flashed agonisingly wide and Andrew Davies headed just over the bar.\nReading almost snatched a late winner when Oliver Norwood floated a free-kick into the box, but a combination of the post and some desperate defending kept the ball from crossing the line with Pogrebnyak loitering.\nBradford City manager Phil Parkinson: \"We're still in the hat so we're pleased with that. You've got to give Reading credit - they came and made it difficult. It was a cagey old affair.\n\"I thought our lads did excellently in a different type of way than against Sunderland. We had to be very professional and wait for the moment to arrive. Unfortunately it didn't. In the second half we had the momentum but we didn't have that touch of class in and around the box.\n\"We look forward to the replay. Everyone will be expecting Reading to win that one but you never know what can happen on the night. We know they'll approach it differently and look to open up.\"\nReading manager Steve Clarke speaking to Match Of The Day: \"For both teams, today was a proper old-fashioned Cup tie. There were plenty of physical challenges with both sides determined not to go out. We hit the woodwork twice, they hit it once. In the second half, they pinned us back more than we would have liked, but we still looked a threat coming forward.\n\"This is still a dangerous tie for us as they've knocked two Premier League teams out. It's still 50/50 as I see it. Both sides can keep the dream going and see who they might get in the semi-final when the draw is made on Monday.\"", "url": "https://www.bbc.com/sport/football/31669807"}