{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:07:55", "date_modify": "2025-05-21 06:07:55", "date_publish": "2025-01-14 10:33:24", "description": "Nottingham Forest vs Liverpool predictions: Chris Sutton on Premier League game", "filename": "sport_football_articles_c79dzrpwlleo_1747807675.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/561d/live/fbee38e0-d1d4-11ef-87df-d575b9a434a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c79dzrpwlleo_1747807675.html", "title": "Nottingham Forest vs Liverpool predictions: Chris Sutton on Premier League game", "title_page": "Nottingham Forest vs Liverpool predictions: Chris Sutton on Premier League game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Is it fair to say Liverpool have gone a little bit flat recently?\nThat is probably a bit harsh, because they only lost narrowly to Tottenham in the first leg of their Carabao Cup semi-final, and they still should have beaten Manchester United in their last league game despite an underwhelming performance - they just were not ruthless enough.\nArne Slot's side are still six points ahead of Arsenal and Forest, with a game in hand, but I think they could drop more points here too.\nThe Forest defence has been formidable and 'The Wood Chopper' [Chris Wood] up front has been superb. The likes of Morgan Gibbs-White have really impressed me as well.\nBasically, this is going to be a very tight game with not many goals in it, and I am not going to back against Forest even if there are many ways where I think Liverpool might sneak a victory.\nYou have got to earn the right to win the Premier League, and Liverpool have done brilliantly so far.\nWhen you are in a title race, there are always moments in the season where things can go against you a little bit, like they did against United, but they did not lose.\nThis might be a period where they do stumble a bit but the teams below them are going to have to really sustain their push.\nThat's not really happened so far because Arsenal and Chelsea are both having a bit of a wobble. If Liverpool do drop more points here, those two sides really need to make the most of it.\nSutton's prediction: 1-1", "url": "https://www.bbc.com/sport/football/articles/c79dzrpwlleo"}