{"authors": ["Will Faulks", "www.facebook.com"], "date_download": "2025-04-26 04:19:55", "date_modify": "2025-04-26 04:19:55", "date_publish": "2025-03-03 16:13:16", "description": "Chelsea news: Opinion - Time to back the coach and show unity", "filename": "sport_football_articles_c3vw52vw32lo_1745641195.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2e6b/live/e7ef49b0-b628-11ee-bc2f-cb5579b90709.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c3vw52vw32lo_1745641195.html", "title": "Opinion - Time to back the coach and show unity - BBC Sport", "title_page": "Chelsea news: Opinion - Time to back the coach and show unity - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "There can be no doubting that the grand project at Chelsea has been shaken by a couple of months of bad results, but the media briefings have been widespread since last week's win with a very clear message.\nThe ownership and sporting structure are behind Enzo Maresca and happy with their decision to give Mauricio Pochettino the boot last summer.\nIt is a good time to send a message like that.\nAfter crushing a Southampton team who look like they will end the season as one of the worst Premier League teams ever, Chelsea have a game to come against a Leicester side who are not much better - plus two legs in the Conference League against a Copenhagen team who operate on a fraction of the Blues' budget.\nAll of that follows a free weekend which has given players time to rest and recover, as well as handing Maresca another extended spell on the training ground to continue to adapt his team to coping without Nicolas Jackson leading the line.\nFor those upstairs at the club, this is the time to back the coach and paint a picture of unity. Spinning last Tuesday's win into a run of four victories in a row would restore a lot of confidence, regardless of the opposition, and keep the team's progress towards a European trophy and a top-four place on course.\nSome fans will have doubts no matter what the results of this upcoming run are, and a lot more stock will be put in the results of the subsequent games against Arsenal and Tottenham.\nBut for Maresca and his squad, the here and now is what matters, and ending their bleak post-Christmas struggles with a string of wins would be invaluable.", "url": "https://www.bbc.co.uk/sport/football/articles/c3vw52vw32lo"}