{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:06:07", "date_modify": "2025-05-21 04:06:07", "date_publish": "2024-12-29 00:00:00", "description": "Follow live text commentary, score updates and match stats from Carlisle United v Accrington Stanley in League Two.", "filename": "sport_football_live_cn7rjp5g8j4t_1747800367.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cn7rjp5g8j4t_1747800367.html", "title": "Carlisle United v Accrington Stanley: League Two stats & head-to-head", "title_page": "Carlisle United v Accrington Stanley: League Two stats & head-to-head - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Goals from Kadeem Harris and Luke Armstrong earned struggling Carlisle a vital 2-1 victory against Accrington at Brunton Park.\nThe hosts took the lead early on through a composed finish from Harris and Armstrong doubled the Blues' lead after capitalising on a defensive error.\nThe visitors pulled one back through Tyler Walton, but the hosts held firm and secured the three points.\nCarlisle eased their nerves slightly when they took the lead in the 11th minute, with Harris scoring his first goal for the club after he coolly slotted home from a Jon Mellish cutback.\nStanley had two big chances just before half-time with a thunderous long-range strike from Shaun Whalley smashing against the crossbar and Ben Woods hitting a post with a header.\nCarlisle then doubled their lead through Armstrong in the 54th minute after Billy Crellin's attempted clearance was charged down by Harris and the ball fell to the feet of the striker, who made no mistake with the finish.\nStanley pulled one back through Walton in the 73rd minute after he got on the end of a long ball from Josh Woods and shrugged off Aaron Hayden to slot home.\nThe visitors had their chances to equalise, but the Blues held on to secure their second home win of the season.", "url": "https://www.bbc.com/sport/football/live/cn7rjp5g8j4t"}