{"authors": ["Mike Taylor", "www.facebook.com"], "date_download": "2025-05-21 07:44:22", "date_modify": "2025-05-21 07:44:22", "date_publish": "2025-01-30 16:36:43", "description": "Aston Villa news: Opinion - Mike Taylor of potential Jhon Duran departure", "filename": "sport_football_articles_c360z1pnd4go_1747813462.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7569/live/57a66290-4781-11ef-96a8-e710c6bfc866.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c360z1pnd4go_1747813462.html", "title": "Aston Villa news: Opinion", "title_page": "Aston Villa news: Opinion - Mike Taylor of potential Jhon Duran departure - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "One of the things that makes Unai Emery such an interesting speaker on the game is the impression that, behind all the professional intensity his job requires, he is really in this for the same thing as you and me: for the thrills.\n\"The atmosphere was FAN-TAS-TIC,\" he said expressively in the press room last night, as his thoughts and emotions tumbled out.\nIt had been an especially vivid occasion, even by the standards of the past year or two. Fittingly, given Emery's urgings to his players and Villa's supporters to make the most of every moment of this Champions League campaign, their position was in question even after their game ended, extending the drama.\nNobody wanted to rush off anyway.\nIt was almost too much. To make sure he would always remember, Morgan Rogers – still a Championship player a year ago – cradled the match ball and his man-of-the-match trophy in one arm, while taking a selfie in front of the man-of-the-match sign. The photograph will be his keepsake of a year of exceptional progress.\nThe grand occasion was bookended by reminders of the colder realities of modern football. Some around the ground were put out before kick-off by reports of Arsenal's offer for Ollie Watkins - not that the Gunners made it given Watkins' obvious ability, but more that it should become known just before such a significant game.\nWatkins did not play as if distracted. Yes, he might have scored far more than one, but his all-round centre-forward play was vital. Maybe Emery's comments on Arsenal's interest left open the possibility that he might move, but really he was only acknowledging that for every player, there is ultimately a deal too good to reject. But it would have to be a very big number.\nHe seemed resigned though, to Jhon Duran moving to Saudi Arabia: \"The players have the objective, the ambition. Sometimes they are impassioned. If he is leaving, it is because he prefers to do another way in his career.\"\nThe reported numbers probably make it good business for Villa, although Emery seemed to find the player's motivation hard to compute: \"I told you, I want him here. But what does he want?\"\nEmery did not speculate. But you could imagine Villa fans thinking of the delirious celebrations in the Holte End and wondering: \"Jhon, don't you want THAT?\"\nWolves v Aston Villa – live commentary on BBC Radio WM (95.6FM/DAB/Freeview 714), Saturday 17:30 GMT", "url": "https://www.bbc.com/sport/football/articles/c360z1pnd4go"}