{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:05:47", "date_modify": "2025-05-21 06:05:47", "date_publish": "2025-04-01 14:31:00", "description": "BBC CWR's Clive Eakin is joined by supporters Ken Stewart and Jodie Turner to look ahead to the Burnley game.", "filename": "sport_football_articles_c75d6e75nxpo_1747807547.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/eade/live/18c80460-0f05-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c75d6e75nxpo_1747807547.html", "title": "Coventry City podcast: 'We can beat Burnley by the odd goal'", "title_page": "Coventry City podcast: 'We can beat Burnley by the odd goal' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Coventry City face another tough test following the defeat at Championship leaders Sheffield United as they welcome Burnley on Saturday.\nThe Clarets are unbeaten in their past 26 games and have only conceded five goals in that time, but Sky Blues fan Ken Stewart believes Coventry can get a positive result to keep their play-off quest on track.\n\"Burnley are good defensively but we've got to be at it right from the off,\" he told BBC CWR's Sky Blues Fancast.\n\"We can't afford to mess about. Like the Sunderland game, we've got to be at it from the off, try and get an early goal.\n\"They've then got to come out a little bit more at us, so there might be a few more gaps. They've got to change their style of play if they go a goal down.\n\"But it's important we get the first goal against Burnley because they just defend and defend.\n\"Confidence is still high and I'm pretty positive about Saturday. I think we can win it by the odd goal.\"\nFellow supporter Jodie Turner says Scott Parker's side are \"not very entertaining\" and doesn't believe it will be an \"exciting\" contest.\n\"You know what, I'll take a 0-0,\" she said. \"If you offered it to me, I'd have it. But I'd like to score against them and I feel like we will.\n\"It's one of those games, it's a free hit.\"\nKen and Jodie joined BBC CWR's Clive Eakin on the Sky Blues fancast to discuss the loss to the Blades and look ahead to the clash with Burnley.", "url": "https://www.bbc.com/sport/football/articles/c75d6e75nxpo"}