{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:17:56", "date_modify": "2025-05-20 14:17:56", "date_publish": "2023-07-29 00:00:00", "description": "Listen to Open All Mics on Sportsound and follow live text updates as 30 teams take part in the final round of the League Cup group stage.", "filename": "sport_live_football_66191015_1747750676.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_football_66191015_1747750676.html", "title": "Viaplay Cup: Five top-flight sides progress, Saints stunned by Stirling", "title_page": "Viaplay Cup: Five top-flight sides progress, Saints stunned by Stirling - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "'A striker will hopefully be signed soon' - McInnes\nFT: Albion Rovers 1-2 Kilmarnock\nDerek McInnes tells BBC Scotland he thought his side were “terrific” this afternoon as they beat Albion Rovers to finish top of Group F.\nI thought the players were terrific from the first minute, getting after the game.\nSometimes it can feel a bit pre-seasony when you come away but you’ve got to make sure you take care of the game, it’s a cup tie that needed to be won.\nI thought we controlled the game and were very assured and professional.\nOn Kyle Vassell being absent from the starting line-up today, he added: “Hopefully he gets a good weeks work into him and gets himself ready for the Rangers game.\n“We’re hoping to try and make another signing at centre forward, and maybe one more plus that too.\n“If we can do that I’d be pleased with the amount of work that’s been done from the recruitment team and the board.\"\nWho else is through?\nThe three best-placed runners-up also qualify for the knock-out stages.\nStirling have 10 points, so they're guaranteed to progress as no other second-placed team matches their tally.\nMorton are likely to progress due to their goal difference being adequate enough to see them through as a best-placed runner up on nine points.\nAfter that, it gets a bit more complicated as Dundee don't play Inverness until tomorrow.\nAs it stands Hamilton, Raith Rovers and Forfar also have nine points, but Raith have a superior goal difference or goals scored out of these sides, giving them the only chance to still progress out of these sides.\nGoal difference is the first factor considered to separate the sides here with goals scored coming next if needed. Raith and Accies are level on a difference of plus three, but Rovers have scored eight goals compared to Accies' seven. Fine margins.\nShould Dundee win tomorrow, they'll also have nine points.\nHowever, Dundee would need to score a few goals to match the existing goal differences of Raith, who currently would progress with Morton and Stirling by virtue of having scored more goals than Hamilton.\nGot it? Good. Dundee's result tomorrow will make this all a lot clearer.\nClick here to have a look at all the groups.", "url": "https://www.bbc.com/sport/live/football/66191015"}