{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:46:01", "date_modify": "2025-05-20 12:46:01", "date_publish": "2023-07-25 06:15:18", "description": "Man United transfer news: Hojlund, Kudus, Kolo Muanai, Mbappe, Bayindir", "filename": "sport_articles_cp60z649664o_1747745161.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/52b0/live/c910bf40-2ab1-11ee-b1d7-8fdc93c2782e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cp60z649664o_1747745161.html", "title": "Man United transfer news: Hojlund, Kudus, Kolo Muanai, Mbappe, Bayindir", "title_page": "Man United transfer news: Hojlund, Kudus, Kolo Muanai, Mbappe, Bayindir - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester United are set to make a formal bid to Atalanta for 20-year-old Denmark striker Rasmus Hojlund this week. (Mail, external)\nUnited are only willing to pay £60m for the player, which is short of the Italian club's 100m euro (£86.5m) asking price. (Times - subscription required, external)\nThe Red Devils are looking at Eintracht Frankfurt's 24-year-old France striker Randal Kolo Muani, and boss Erik ten Hag is interested in Ajax's Ghana forward Mohammed Kudus, 22, who has also been linked with Chelsea. (Mirror, external)\nTen Hag is also looking to reinforce his side's back-up goalkeeping options with the signing of Fenerbahce's 25-year-old Turkey international Altay Bayindir. (Goal, external)\nUnited, Chelsea and Tottenham will be part of a bidding frenzy for France striker Kylian Mbappe, 24, after Paris St-Germain received a world record £259m bid from Saudi Arabian side Al-Hilal for the player. (Telegraph - subscription required, external)\nFiorentina's Morocco midfielder Sofyan Amrabat, 26, has reached an agreement to join Manchester United on a five-year deal. (Nicolo Schira, external)\nTen Hag is open to offers for several fringe Manchester United players with funds needed to launch a move for a marquee striker. (Football Insider, external)\nManchester United plan to extend the contract of English defender Aaron Wan-Bissaka, 25, after deciding not to pursue Inter Milan's 27-year-old Netherlands right-back Denzel Dumfries. (Mirror, external)", "url": "https://www.bbc.com/sport/articles/cp60z649664o"}