{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:16:56", "date_modify": "2025-05-21 04:16:56", "date_publish": "2025-04-05 17:48:57", "description": "Torquay United manager Paul Wotton says his side's title challenge is not over despite a 2-1 loss at home to Chesham United.", "filename": "sport_football_articles_ckgx8mvz5ero_1747801016.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4fc6/live/f6fb8ed0-1245-11f0-9d46-3377f28968f3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ckgx8mvz5ero_1747801016.html", "title": "Torquay United title challenge 'not over' despite Chesham loss says manager", "title_page": "Torquay United title challenge 'not over' despite Chesham loss says manager - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Torquay United manager Paul Wotton says his side's National League South title challenge is not over despite a 2-1 loss at home to mid-table Chesham United.\nHaving led through Cody Cooke's first-half goal, Chesham stuck back twice after half time with their winner coming two minutes from the end as they ended Torquay's 10-game unbeaten run.\nThe Gulls remain fifth in the table and are three points off leaders Truro City, who they face on Good Friday.\n\"We're in the same position we were before kick off, the only difference is there's a game less and the team who are top now we've got to go and play them as well,\" Wotton told BBC Radio Devon.\n\"It's not over, far from it, but it's disappointing.\"\nHaving been a substitute in the past two matches, where he had come on to get the winning goals, Cooke started the game at Plainmoor and got his third goal in as many games from Jordan Young's 32nd-minute corner.\nBut Chesham rallied after the break as Alex Lafleur fired into the bottom corner seven minutes after the restart to restore parity.\nChesham did their best to frustrate the hosts and they were rewarded when Alex Lafleur got an 88th-minute winner as Torquay lost at home for just the second time this season.\n\"We lacked a cutting edge in the final third today,\" added Wotton.\n\"Chesham got into our final third a couple of times and were ruthless with it.\n\"It's 100% three points dropped.\n\"I thought a couple of players went a bit rogue today, off plan, but it's what happens,\" he added.", "url": "https://www.bbc.com/sport/football/articles/ckgx8mvz5ero"}