{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:32:49", "date_modify": "2025-05-19 15:32:49", "date_publish": "2015-01-29 17:18:42", "description": "Liverpool striker Daniel Sturridge is \"anxious and excited\" as he prepares to return from five months out injured.", "filename": "sport_football_31046173_1747668769.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/80658000/jpg/_80658813_daniel_sturridge.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31046173_1747668769.html", "title": "Daniel Sturridge: Liverpool striker 'anxious' about return", "title_page": "Daniel Sturridge: Liverpool striker 'anxious' about return - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Liverpool striker Daniel Sturridge is \"anxious and excited\" as he prepares to return from five months out injured.\nThe 25-year-old also told BBC Radio 5 live that the mental side of his game has improved during his layoff.\nLiverpool boss Brendan Rodgers will decide on Friday if Sturridge will play Saturday's game against West Ham.\nSturridge said: \"I'm just focusing on training hard and whenever the staff feel is the right time for me to get back involved I will be.\"\nThe former Chelsea striker has not played since suffering a thigh injury while on England duty in September. Since then he has injured his calf and thigh again.\nSturridge, who had been expected to take on a key role following striker Luis Suarez's move to Barcelona, scored once in his three games for Liverpool before his injury.\nIn his absence, Rickie Lambert is the club's top-scoring striker with three goals. Midfielder Steven Gerrard is their overall top scorer with nine.\nSturridge added: \"I'm just looking forward to getting back involved - that's the main thing for me. I'm feeling great. I can't wait to get back playing again.\n\"It's been very frustrating but it's all a learning curve - these experiences help you learn something new. It's been great for the mental side of my game, I've improved that.\"\nHe believes Gerrard has the necessary attributes to manage the club at some point in the coming years.\n\"Words can't describe what he's done for Liverpool as well as his country,\" Sturridge said. \"He's still a role model of mine. I look up to him, I think everyone in the squad does. He'll be sorely missed - he's somebody who's given me a lot of experience and helped me to improve as a person and a footballer.\n\"He's still one of the best players. He'll be hard to replace from a footballing side, let alone in the dressing room.\n\"It's been a pleasure to play with him. I'm devastated he's leaving. I think he'll be at the club in some capacity very soon and I'm sure he'll manage the club one day.\"", "url": "https://www.bbc.com/sport/football/31046173"}