{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:58:23", "date_modify": "2025-05-21 03:58:23", "date_publish": "2025-04-07 08:22:57", "description": "Eight-time Dublin All-Ireland winner Philly McMahon tells BBC Sport's 'The GAA Social' that he was offered the opportunity to become the Derry manager.", "filename": "sport_articles_c7vndv2dqpeo_1747799903.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/92c2/live/7a50a1b0-1388-11f0-a0f5-835d8754b42a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c7vndv2dqpeo_1747799903.html", "title": "GAA Social: 'I almost became Derry manager'", "title_page": "GAA Social: 'I almost became Derry manager' - Philly McMahon - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Eight-time All-Ireland winner Philly McMahon has revealed that he was offered the opportunity to become the new manager of Derry before Paddy Tally was appointed to the role in November.\nThe former Dublin player, now a BBC Sport NI analyst, told The GAA Social that he gave the offer to succeed Mickey Harte as Oak Leafers boss serious consideration.\n\"I met the guys behind the scenes from Derry and they came down to me and offered me the job,\" explained the 37-year-old.\n\"I had to go through a couple of things, I had to get the right people with me, I had to speak to my wife and I have a three-year-old so they were my priority first of all.\n\"I spoke to a couple of bodies that I had an interest in bringing in and basically I was a couple of days from giving that decision and the guys that I was talking to basically said, 'Paddy's looking to take the job'.\n\"I just said to the guys, 'if there's somebody 100% in then you're better off giving it to them because they're 100%, I'm not'.\"\nMcMahon was speaking after being part of the punditry team for Derry's 1-25 to 1-15 defeat by Donegal in their Ulster SFC preliminary round tie at Ballybofey on Sunday.\nThe two-time All Star added that he would remain interested in becoming an inter-county manager.\n\"It was a very interesting opportunity. The support behind the scenes seems very good and that's what enticed me but maybe it has set me up for the next opportunity.\n\"I'd like to try, I'd like to dip my toe in [to inter-county management]. I'm really passionate about performance coaching and that's sort of management in itself.\n\"It's something I've done in all my career, the fitness industry and managing people, trying to get the best out of people, which I think as a coach or manager you have to do.\"", "url": "https://www.bbc.com/sport/articles/c7vndv2dqpeo"}