{"authors": ["Bobbie Jackson", "www.facebook.com"], "date_download": "2025-05-21 05:35:26", "date_modify": "2025-05-21 05:35:26", "date_publish": "2025-02-06 16:19:18", "description": "Derek Chisora says it has been an \"emotional\" week as he prepares to face heavyweight rival Otto Wallin in his final fight on UK soil.", "filename": "sport_boxing_articles_c2k52djnxl4o_1747805726.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c71e/live/66587bf0-e53f-11ef-a819-277e390a7a08.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_boxing_articles_c2k52djnxl4o_1747805726.html", "title": "Derek Chisora: 'Emotional' Chisora ready for UK send-off against Otto Wallin", "title_page": "Derek Chisora: 'Emotional' Chisora ready for UK send-off against Otto Wallin - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Derek Chisora said it has been an \"emotional\" week as he prepares to face Otto Wallin in his final fight on UK soil.\nThe 41-year-old heavyweight makes his 49th walk to the ring on Saturday at Co-op Live Arena as he closes in on the end of an 18-year career.\nThe Zimbabwe-born Londoner is targeting 50 fights in total, with his last bout set to take place overseas.\n\"Before I came to Manchester my wife said 'go and enjoy yourself',\" Chisora said.\n\"She said it's the week to enjoy. I'm trying to enjoy it but it's so emotional because I love this game so much. I love the ups and downs, winning and losing.\n\"It's difficult to leave boxing if you don't want to. I was told to leave at 50 fights so that's what I'm doing. I would have done 100 fights.\"\nQueensberry promoter Frank Warren announced that the bout will serve as an IBF heavyweight title eliminator, with the winner in line to face either champion Daniel Dubois or Joseph Parker, who meet on 22 February.\n\"It adds spice to the fight and makes it a more meaningful fight,\" Warren said.\n\"There's an added carrot at the end of the stick.\"\nSweden's Wallin, who lives in New York, has 27 wins, two losses and one no-contest on his record and is fighting in the UK for just the second time following his 2022 win against Kamil Sokolowski in Wales.\n\"I've been on the road before, I'm expecting a tough crowd but I'm ready for this fight,\" Wallin said.\n\"I have Swedish people coming too - some Vikings - I'm looking forward to it.\"\nChisora has faced the biggest names in the heavyweight division since making his debut in 2007.\nHe has lost to former world champion Tyson Fury on three occasions and Dillian Whyte and Parker twice, and has also come up short against Vitali Klitschko and Oleksandr Usyk.\nChisora entered Thursday's news conference at Manchester's Edwardian Hotel - the same venue where he threw a table at Whyte nine years ago - wearing a cowboy hat with a speaker playing 'American Remains' by country supergroup the Highwaymen, and he played Johnny Cash's '(Ghost) Riders In The Sky' as the two rivals faced off.\nDespite his popularity, Chisora has often been a controversial figure in boxing. The former British and Commonwealth champion was found guilty of assaulting his girlfriend in 2010 but was spared jail and handed a 12-week sentence suspended for two years.\nHe adopted a jovial approach to proceedings on Thursday, poking fun at members of the media who have \"written rubbish\" about him during his career, and attempted to draw a response from a cool and collected Wallin.\n\"Otto Wallin can play poker, he has a good poker face. I've sat here 49 times and they all say the same thing,\" Chisora said.\n\"The only fighter who stood toe-to-toe was Dillian [Whyte], Otto won't do that. We chose a smaller ring so he can't run.\"\nWallin - whose two career defeats both came against British opponents - looked happy to take a backseat on Thursday.\nThe 34-year-old Swede inflicted a nasty cut above the eye of Fury when they met in 2019 but ultimately lost via unanimous decision. His other loss came at the hands of Joshua in December 2023.\n\"I like Derek, he's a good talker. He's probably a better talker than me. He can keep talking and I'll do my talking in the ring,\" Wallin added.\n\"I'm going to win by all means necessary.\n\"He has a lot of pressure, it's supposed to be his last fight in the UK at a big arena. I try not to put pressure on myself.\"", "url": "https://www.bbc.com/sport/boxing/articles/c2k52djnxl4o"}