{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:38:36", "date_modify": "2025-05-21 04:38:36", "date_publish": "2025-01-18 00:00:00", "description": "New boss Matt Bloomfield ends Luton's four-game losing run with an encouraging goalless draw against Preston.", "filename": "sport_football_live_cq6gl8y2g19t_1747802316.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cq6gl8y2g19t_1747802316.html", "title": "Luton Town 0-0 Preston North End: Hatters held to draw in Bloomfield's first game", "title_page": "Luton Town 0-0 Preston North End: Hatters held to draw in Bloomfield's first game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "New boss Matt Bloomfield ended Luton Town's four-game losing streak with an encouraging goalless draw against Preston North End, but was unable to prevent his side from dropping into the Championship relegation zone.\nThe Hatters dominated the ball and always looked the more likely to make the breakthrough without creating many decent chances against stubborn opposition.\nJordan Clark had the only attempt on target before the break, the first of just four in total, but his left-foot strike was easily saved by keeper Freddie Woodman.\nPreston barely ventured into the final third, managing just three touches in the Luton penalty box and just two wayward efforts on goal.\nBloomfield, who was only appointed as Rob Edwards's successor on Tuesday, had talked up his new side's ability and insisted their \"belief\" remained despite losing 15 of their 27 league games this season, with their away form especially poor.\nA promising beginning reflected the positivity with Tom Holmes and Mark McGuinness both having efforts on goal blocked and the latter sending a strike wide.\nWith the home side growing in confidence, Clark, Amari'i Bell and Tom Krauss then combined for a slick move that almost ended resulted in an own goal.\nAt the other end, Preston's threat was minimal, an Andrew Hughes strike from distance that went wide after the break was as close as they came, while Luton were unable to fashion the clear chance a raucous Kenilworth Road so desperately craved.\nCarlton Morris did have a close-range strike saved but Bloomfield's side were denied a morale-boosting win and dropped to 22nd in the table following Hull City's away victory at Millwall.\nLuton Town boss Matt Bloomfield told BBC Three Counties Radio:\n\"It's a good point and good to get a clean sheet and they didn't have any shots on target.\n\"Coming off a run of five straight defeats, it was nice to get that - the first one in 12. (in all competitions). We had a good out-of-possession shape\n\"We didn't quite have the right touch in the final third. We would have liked to have created more and shot more but we understand where we are as a team\n\"There's a lot of work to do, but in terms of a foundation, I have to say I'm pleased.\"\nPreston boss Paul Heckingbottom told BBC Lancashire:\n\"I'm really pleased - from minute one to the end.\n\"It became a little bit tricky when Luton made the change, so we didn't know what team they would pick or how they would set up tactically. But we just concentrated on ourselves .\n\"At times we have not managed games away from home well enough and that cos us points so I'd love it if that was the benchmark for every single away game between now and the end of the season in terms of the mentality and the approach.\n\"But we still want to be better in other areas.\"", "url": "https://www.bbc.com/sport/football/live/cq6gl8y2g19t"}