{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:00:37", "date_modify": "2025-05-21 07:00:37", "date_publish": "2025-01-04 07:12:34", "description": "Former Masters champion Hideki Matsuyama has a one-stroke lead at the halfway point of The Sentry in Hawaii.", "filename": "sport_golf_articles_c77j054jrv1o_1747810837.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/fd63/live/5b609300-ca68-11ef-8e0d-273f188c66a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_golf_articles_c77j054jrv1o_1747810837.html", "title": "The Sentry: Hideki Matsuyama leads PGA Tour opener in Hawaii", "title_page": "The Sentry: Hideki Matsuyama leads PGA Tour opener in Hawaii - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The Sentry second-round leaderboard\n-16 H Matsuyama (Jpn); -15 C Morikawa (US); -14 C Conners (Can), M McNealy (US), T Hoge (US), T Detry (Bel); -13 K Bradley (US), H Hall (Eng), C Young (US), W Clark (US)\nSelected others: -10 R MacIntyre (Sco); -9 A Scott (Aus); -8 M Fitzpatrick (Eng), P Cantlay (US); -7 A Rai (Eng); -4 X Schauffele (US)\nFull leaderboard\nFormer Masters champion Hideki Matsuyama carded a second successive 65 to take a one-stroke lead at the halfway point of the season-opening PGA Tour event in Hawaii.\nThe Sentry features 31 PGA Tour winners and 29 players who finished inside the top 50 in the FedEx Cup standings last year.\nThe 32-year-old from Japan made eight birdies in his round to hold a slim advantage at Kapalua over another major winner, Collin Morikawa.\nThe American, who won the 2020 US PGA Championship and The Open the following year, shot a 65 thanks to five successive birdies from the 13th.\n\"I'm definitely satisfied with where I am,\" said Matsuyama.\n\"Obviously the views are beautiful here. I haven't played well here in a while, so it's good to get off to a good start.\"\nMorikawa could have finished the day level with Matsuyama but had to be content with a par at the 18th.\n\"I just hit some quality shots and gave myself a run of birdie opportunities,\" he said.\n\"I felt like for the entire back nine I had birdie looks. Obviously I made a handful, but it was just nice to see a couple drop.\"\nHoge leads as PGA Tour season starts in Hawaii\nAmerican Maverick McNealy equalled the lowest round of the day with a 64 to move to a shot behind Morikawa on 14 under alongside Canada's Corey Conners, Thomas Detry of Belgium and first-round leader Tom Hoge of the US.\nEngland's Harry Hall birdied four of his last five holes on his way to a 65 that took him into a group a further shot back that also includes US Ryder Cup captain Keegan Bradley and former US Open champion Wyndham Clark, who both carded 64s.", "url": "https://www.bbc.com/sport/golf/articles/c77j054jrv1o"}