{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:58:59", "date_modify": "2025-04-26 06:58:59", "date_publish": "2025-02-27 05:57:51", "description": "Norwich City sporting director Ben Knapper insists the Canaries have done well to be in the Championship play-off picture with the changes the club has undergone.", "filename": "sport_football_articles_c8x4qw2k4elo_1745650739.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b033/live/9aecceb0-f4ea-11ef-ae0a-4bca4f518eb0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c8x4qw2k4elo_1745650739.html", "title": "Ben Knapper: Norwich sporting director happy with club's progress", "title_page": "Ben Knapper: Norwich sporting director happy with club's progress - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Norwich City sporting director Ben Knapper insists the Canaries have done well to put themselves in the Championship play-off picture with all the changes the club has undergone in the past 12 months.\nThe Canaries have won three promotions to the Premier League in the past 10 seasons but, each time, they were relegated at the end of the following campaign.\nJohannes Hoff Thorup's side are currently 10th, four points outside the top six with 12 games to play, having lost to Leeds United in the play-offs in 2023-24.\nMark Attanasio's Norfolk FB Holdings Group will formally take control of the club at the weekend when a share issue process giving them an 85% stake is completed.\n\"Where we are is probably about where I expected us to be right now,\" Knapper told BBC Radio Norfolk's The Scrimmage.\n\"With all the changes we've made, from all levels of the club, trying to integrate a new complex playing style, lots of young players, a big shift in age profile, that was always going to be something that takes time.\n\"Every time this club is in this division, we should be targeting to try and get into the play-offs at the very least, try to get promoted and that doesn't change.\n\"We know with the choices we've made, that comes with some challenges, but we're in this for the long term to build a project that's sustainable and the first steps we've made have been really positive. There's loads to come and hopefully it can be an exciting end to the season.\"\nA year ago, Knapper said the club was \"Premier League ready\" in many respects.\nSince then, however, Thorup has replaced David Wagner as head coach, the squad has been revamped, and Attanasio - owner of Major League Baseball team Milwaukee Brewers - has progressed his takeover from former owners Delia Smith and her husband Michael Wynn Jones.\nLast summer, forward Jonathan Rowe was among the prized assets transferred elsewhere, but although the Canaries are no longer in receipt of Premier League parachute money, Knapper said the new owners had made it clear there would be no \"need\" to sell this summer, whatever the divisional circumstances.\nHowever, that does not mean offers will not be considered.\n\"The new ownership does give us that luxury of being in a position where we have a little bit more autonomy in terms of decisions we can make or not make,\" he continued.\n\"When it comes to players, we are where we are in terms of the bigger landscape, the pyramid, and it's all well and good thinking that you don't want to sell a player but if they've got a fantastic offer from a club higher up the food chain, you have to be reasonable and that's something you have to consider.\n\"We treat every situation on its merits but it's definitely not us having to go into the summer where we're having to do something, which is a nice position to be in.\"\nKnapper, Thorup and executive director Zoe Webber will travel to Phoenix in the next international break to observe baseball club Brewers' spring training camp and see if there is anything they can adapt for Norwich's benefit.\n\"The owners in general, Mark and [director] Richard [Ressler] and the whole group, are brilliant for us,\" Knapper said.\n\"They're so engaged, so passionate about it and they've got such a wealth of experience - in sport but also more broadly, which is a great resource for me.\n\"I love speaking to them and picking their brains. Sometimes they just provide a different perspective but always with the freedom of letting us get on with it, which is a real nice blend for me as a sporting director.\"\nKnapper also insisted he was satisfied with the club's transfer dealings in the past two windows.\nHe added: \"I like a lot of what we've done. I think we've managed to do a good job in terms of our selling strategy, in trying to maximise value for the club, but also in so many of the acquisitions we've made, some really exciting young players.\n\"I look at someone like Oscar Schwartau and the way that he's integrated. For someone of his age to have played the minutes he has and to watch him expressing himself has been brilliant.\n\"And Lucien Mahovo, to have plucked him from where we did [League Two side Notts County] for a really modest fee and to see the effect he's made in only nine months at the club is fantastic.\"\nUnited States international Josh Sargent has been hampered by injuries this season, but Knapper insisted the Canaries have had enough cover in attack.\n\"Ante (Crnac) is a nine, that's his core position - he can play in other positions as well, off the right, or even as a second striker but we feel good that we've got two really high-quality 'nine' options,\" Knapper said.\n\"From a squad composition perspective, we wouldn't want to be in a position where we're carrying three top expensive nines, it's not a smart use of resource and it's difficult to manage that situation as they're all going to want to play.\"\nNorwich are next in action on Saturday when they travel to Blackburn Rovers, but three of their five games in March are at home.", "url": "https://www.bbc.co.uk/sport/football/articles/c8x4qw2k4elo"}