{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:31:54", "date_modify": "2025-05-21 06:31:54", "date_publish": "2025-01-31 11:32:13", "description": "John Hales, owner of the great One Man and 2012 Grand National winner Neptune Collonges, dies at the age of 85.", "filename": "sport_horse-racing_articles_c3e100e8v3yo_1747809114.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2cbf/live/5a8b41e0-dfc2-11ef-a319-fb4e7360c4ec.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_horse-racing_articles_c3e100e8v3yo_1747809114.html", "title": "John Hales: One Man and Neptune Collonges owner dies at age of 85", "title_page": "John Hales: One Man and Neptune Collonges owner dies at age of 85 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Leading Midlands-based racehorse owner John Hales - who owned the great grey One Man as well as Grand National winner Neptune Collonges - has died at the age of 85.\nHales made his money through the Golden Bear Toys company he co-founded in 1979, which went on to produce toys and merchandise from major children's shows such as the Teletubbies, the Basil Brush Show, Thomas the Tank Engine and In The Night Garden, from their business in Telford, in Shropshire.\nBut he was best known for his work in sporting circles, most notably with the greatly loved One Man, trained in Cumbria by the late Gordon Richards, and his Aintree winner, the Paul Nicholls-trained Neptune Collonges almost two decades later in 2012.\nOne Man famously won the King George VI Chase twice in 1995 and 1996. But, although he failed to win the Cheltenham Gold Cup, he dropped in trip to win the Queen Mother Champion Chase at the Festival in 1998 - a race he won again with Azertyuiop (2004) and Politologue (2020).\nIn his latter years, Hales has enjoyed shared joint ownership with legendary ex-Manchester United manager Sir Alex Ferguson, Peter Done and Ged Mason.\nThey paid 740,000 euros (£618,577) last year for Caldwell Potter, who is in training with former champion trainer Nicholls.\nNicholls said on X: \"It is with great sadness to report that John Hales passed away last evening.\n\"A great man and a fantastic owner and friend for many people. Thoughts with his wife Pat and his wonderful family. He will be missed by so many in racing. RIP John.\"\nHales was at Windsor to enjoy his last winner just 12 days ago when Harry Skelton rode Protektorat, for brother Dan Skelton, to a 22-length win over Venetia Williams' Djelo in the Fleur De Lys Chase.", "url": "https://www.bbc.com/sport/horse-racing/articles/c3e100e8v3yo"}