{"authors": ["James Gregg & Rob Stevens", "www.facebook.com"], "date_download": "2025-05-21 07:58:32", "date_modify": "2025-05-21 07:58:32", "date_publish": "2024-12-23 10:51:43", "description": "South Africa's Cameron Carolissen hopes his appearance at the 2025 PDC World Championship can boost darts on the continent despite his first-round exit.", "filename": "sport_darts_articles_c4gjpj0e574o_1747814312.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b15b/live/57257a90-c116-11ef-b76e-9de78285d5f5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_darts_articles_c4gjpj0e574o_1747814312.html", "title": "Cameron Carolissen: South African eyes 'bigger picture' for darts on continent", "title_page": "Cameron Carolissen: South African eyes 'bigger picture' for darts on continent - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "As Africa's only representative at the 2025 PDC World Championship, Cameron Carolissen hopes his appearance can boost darts on the continent despite a first-round exit.\nThe South African suffered a narrow 3-2 defeat by Wessel Nijman, an opponent ranked 167 places above him in the world, on Friday.\nCarolissen came through a field of 105 players in Nairobi in September to qualify for the tournament at Alexandra Palace for just the second time.\n\"For the boys back home, I hope that this is an eye-opener to them,\" the 28-year-old told BBC Sport Africa.\n\"I hope they see the bigger picture, and then they can see what the ultimate goal is for darts in Africa.\n\"I'm happy that I can be here and represent not just South Africa, but Africa [as a] whole. I can go home smiling.\"\nCape Town native Carolissen took up the sport aged 12, following in the footsteps of his father and aunt who played regularly.\nNicknamed 'The Javelin', he credits much of the game's progress on the continent to his compatriot Devon Petersen, who has appeared at the World Championship nine times and reached the last 16 in 2014, 2019 and 2021.\nThe 38-year-old founded the African Darts Group (ADG) to organise events which provide a chance for players to develop and gain an insight into what top-level tournaments will be like.\n\"What the ADG is trying to achieve is creating that platform for players to get used to these opportunities - playing at Ally Pally, the World Cup or any other tournaments,\" Carolissen added.\n\"We are constantly playing in front of the cameras, [with] the media and the interviews. It just creates a little bit in terms of what to expect.\n\"To play at Alexandra Palace, it's a much bigger scale. It's about learning and adapting.\"\nNijman took the first two sets in the best-of five encounter, yet Carolissen was not overawed by the stage in north London.\nHe battled back, winning six out of eight legs to level the match and force a decider.\nThe crowd offered their backing to Carolissen by singing Waka Waka (This Time for Africa), the Shakira song which was the anthem for the 2010 Fifa World Cup staged in South Africa.\n\"You know the crowd is going to be buzzing,\" Carolissen said.\n\"I always tell boys back home: 'When you get up on stage, that's your moment where you can let your inner character out.'\n\"Once you do that, you'll be so much comfortable. If you want to give a little bit of a roar, do it.\"\nHe may have been defeated but Carolissen finished with a higher three-dart average than his Dutch opponent, as well as more scores of both 100+ and 140+.\nIt was his first experience in front of a full house at the World Championship, given his debut in December 2020 came in the middle of the coronavirus pandemic.\nOn that occasion he received what he describes as \"a freebie\" when his first-round opponent Martijn Kleermaker tested positive for Covid-19. Carolissen, handed a walkover, was subsequently beaten 3-1 by Danny Noppert in the second round.\n\"To be back at the Palace after four years and to experience the crowd, to be in such an environment, is absolutely amazing,\" the South African said.\n\"To play here is every darts player's dream.\n\"Although I wanted to win so bad against Wessel, I think my performance was enough for the world to know that Cameron Carolissen is here.\n\"I'm happy with the performance. I think I can go back home to my family at Christmas and I can just enjoy the sunshine in Cape Town.\"", "url": "https://www.bbc.com/sport/darts/articles/c4gjpj0e574o"}