{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:31:30", "date_modify": "2025-04-26 06:31:30", "date_publish": "2025-02-27 08:46:09", "description": "Brentford 1-1 Everton: Fan views", "filename": "sport_football_articles_c4g00318gz5o_1745649090.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c4g00318gz5o_1745649090.html", "title": "Brentford 1-1 Everton: Fan views", "title_page": "Brentford 1-1 Everton: Fan views - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "We asked for your views on Brentford's Premier League draw with Everton.\nHere are some of your comments:\nBrentford fans\nGeorge: A fair result. We always suffer against teams that sit back off the ball in the first half, when our attacking play is at its strongest and it is a habit that has cost us many an early exit from cups against lower-league opposition. Everton were disciplined in their defence, and while Mark Flekken put in a great shift, we always struggle without Christian Norgaard shoring up our midfield.\nNicholas: A very flat performance from the Bees and lucky to get a point in all honesty. Amazing how the home form is now deserting us at the same time the away form is excellent. Funny old game!\nJames: Pretty lacklustre game all round. Flekken bailed us out of a Beto hat-trick. An even first half but Everton came out second half with more energy and desire. We never got going after that really. Thomas Frank, again, waited too long to make changes and didn't make enough; a lot of players looked tired.\nEverton fans\nGreg: We stuck at it and could have won it if we had someone who could finish. Anyone who thinks Beto is the answer is badly mistaken. Top marks to James Garner who was pulling the strings all game. Great to have him back. Moyes is doing a fantastic job.\nDan: On another day we win that. Three great chances for Beto and he could have slid Carlos Alcaraz in late on. But on the other hand, we could have lost that and before the Moyesiah's return, we probably would have. Good fightback and effort from the lads.", "url": "https://www.bbc.co.uk/sport/football/articles/c4g00318gz5o"}