{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:55:33", "date_modify": "2025-05-21 03:55:33", "date_publish": "2025-02-01 16:23:19", "description": "Cycling's world governing body the UCI bans the general use of carbon monoxide rebreathing equipment.", "filename": "sport_cycling_articles_cjdejx30rzlo_1747799733.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3fcc/live/c86310e0-e0b6-11ef-a819-277e390a7a08.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cycling_articles_cjdejx30rzlo_1747799733.html", "title": "Carbon monoxide rebreathing banned by cycling governing body UCI", "title_page": "Carbon monoxide rebreathing banned by cycling governing body UCI - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cycling's world governing body the UCI has banned the general use of carbon monoxide rebreathing equipment.\nIt was established last year some teams were using it to measure haemoglobin levels in their riders' blood before, and after, altitude training.\nThere had been questions around whether it could be used to enhance performance if used repetitively - or if it was simply too dangerous to inhale a deadly gas as a scientific measurement.\nThe UCI said its ban will come in from 10 February, although it will still be allowed in a \"medical facility\".\n\"The inhalation of CO will remain authorised within a medical facility and under the responsibility of a medical professional experienced in the manipulation of this gas for medical reasons,\" it added.\nRepeated inhalation of carbon monoxide can result in acute health problems, said the UCI, such as lethargy, nausea, dizziness, and confusion.\n\"Such symptoms can worsen at any time and develop into problems with heart rhythm, seizures, paralysis, and loss of consciousness,\" it added.\nThis method is not illegal in the eyes of the World Anti-Doping Agency and the UCI has asked Wada to take a position on the issue.", "url": "https://www.bbc.com/sport/cycling/articles/cjdejx30rzlo"}