{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:39:17", "date_modify": "2025-05-20 11:39:17", "date_publish": "2023-08-06 19:28:48", "description": "Celine Boutier describes it as \"completely crazy\" after she captures her second victory in as many weeks at the Women's Scottish Open.", "filename": "sport_golf_66423523_1747741157.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/16465/production/_130673219_boutier.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_golf_66423523_1747741157.html", "title": "Women's Scottish Open: Celine Boutier 'in shock' after winning second title in as many weeks", "title_page": "Women's Scottish Open: Celine Boutier 'in shock' after winning second title in as many weeks - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Celine Boutier described it as \"completely crazy\" after she captured her second victory in as many weeks at the Women's Scottish Open.\nThe 29-year-old Frenchwoman won by two strokes from South Korea's Kim Hyo-Joo at Dundonald Links in Ayrshire.\nBoutier won her first major title at last week's Evian Championship in her homeland.\n\"I would have never imagined that I would be able to win not one but two tournaments in a row,\" she said.\n\"And yeah, I'm just incredibly in shock.\"\nBoutier carded a two-under-par 70 on her final round to finish at 15-under 273 for the tournament, collecting four birdies and two bogeys en route to earning £259,000.\nHer fifth LPGA Tour victory means she became the first LPGA golfer since Thailand's Ariya Jutanugarn in 2016 to follow a major championship victory with a win in the following tournament.\nShe also became the first to win consecutive tournaments on Tour since Jin Young Ko in 2021 at the Cognizant Founders Cup and BMW Ladies Championship.\n\"To be honest, I was so tired early in the week and trying to get through each round and trying to do my best,\" Boutier said. \"Being able to be in contention over the weekend, especially today, was definitely a huge bonus.\"\nEngland's Eleanor Givens was the highest-placed British finisher in joint 28th place, 12 strokes adrift, with Gemma Dryburgh the top Scot three shots further back in joint 44th.", "url": "https://www.bbc.com/sport/golf/66423523"}