{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:04:17", "date_modify": "2025-04-26 04:04:17", "date_publish": "2025-03-04 00:00:00", "description": "Reaction as Burnley win 2-1 at Cardiff, Hull claim a 2-0 victory against Plymouth, Bristol City take three points from their trip to Millwall while Preston play Swansea finishes goalless.", "filename": "sport_football_live_c78w812q30et_1745640257.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/68fc/live/821b6db0-f945-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_c78w812q30et_1745640257.html", "title": "Championship: Burnley beat Cardiff; Bristol City and Hull also win", "title_page": "Championship: Burnley beat Cardiff; Bristol City and Hull also win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Good night\n#bbcefl\nSo, Burnley's proud run of 12 clean sheets comes to an end but their win at Cardiff closes the gap to two points on second-placed Sheffield United.\nBristol City fans are dreaming of gatecrashing the play-offs with their win and it was a huge night at the bottom with Hull City's win over Plymouth.\nYou can catch-up with all the Championship news and views here and we will see you on Friday night for Norwich City against Oxford United.\n'The first 35 minutes we controlled the game' - Manning\nFT: Millwall 0-2 Bristol City\nBristol City\nBristol City manager Liam Manning said:\n\"Credit to the lads. When you look at their attitude, their desire to defend, and the way they found a way to win, the maturity … there were so many positives to take out of it.\n\"The first 35 minutes we controlled the game, dampened the noise and managed the game how we wanted it. We spoke about how hard it is to come here and that we'd need to earn the right to make the game look like how we want and we did it right for 35 minutes.\n\"The last 10 minutes of the first half we became a little bit passive, and the second half was a battle, won by a set piece and a moment of quality.\n\"It was long overdue from Zak (Vyner), right! I've been giving him a lot of stick about it. He gets credit for the job he does but you need everyone to chip in so I'm delighted he got the goal.\"\nTo come this weekend\n#bbcefl\nThere's plenty to whet the appetite when the Championship resumes this weekend.\nSheffield United will look to keep up the pressure on leaders Leeds by winning at home to Preston, 24 hours before Daniel Farke's side travel to Portsmouth.\nAnd one game we'll certainly keep a close eye on involves bottom side Derby County, with head coach John Eustace desperate for points against Blackburn - the side he quit to move to Pride Park last month.\nFirst up, it's Norwich at home to Oxford on Friday - so make sure you join us then!\nChampionship\nNorwich City v Oxford United (Friday)\nBristol City v Hull City\nBurnley v Luton Town\nCoventry City v Stoke City\nDerby County v Blackburn Rovers\nPlymouth Argyle v Sheffield Wednesday\nSheffield United v Preston North End\nSunderland v Cardiff City\nSwansea City v Middesbrough\nWatford v Millwall\nWest Brom v QPR\nPortsmouth v Leeds United (Sunday)\nJJ's not... signing for the Bengals\nFT: Cardiff 1-2 Burnley\nReaction stateside from Burnley shareholder JJ Watt who has now effectively won his bet with Clarets goalkeeper James Trafford.\nNFL legend Watt has agreed in late December to come out of retirement and play for Trafford's favourite team, the Cincinnati Bengals, if he didn't concede another goal all season.\nIt looked fanciful, until Trafford started racking up the clean sheets only for his stand to finally be broken at the Cardiff City Stadium tonight.\nWatt has since tweeted, \"I don’t like Skyline Chili anyway\", referencing the Cincinnati-based restaurant chain.\nA big night for the Clarets, Robins and Tigers\n#bbcefl\nBurnley have closed to within two points of second-placed Sheffield United with their win over Cardiff tonight.\nIt was a big night for Bristol City with their 2-0 victory at Millwall making it four games unbeaten and they are level on points with sixth-placed West Brom.\nHull City have pulled five points clear of trouble with their win over Plymouth who remain without an away league win this season and six points adrift of safety.\nPreston and Swansea remain marooned in mid-table obscurity after their goalless draw at Deepdale.\nAll eyes to Luton...\nFT: Cardiff 1-2 Burnley\nGlen Little\nEx-Burnley winger on BBC Radio Lancashire\nIt seemed like that in the last 30 minutes Burnley were just hanging on and hanging on and in the end it was a big relief just to get out of the game.\nIn the end it doesn't matter how you do it. We needed to win and we have done and now you move on to that game against Luton.\nI saw Luton last month and I thought they looked a really poor side, from the team that came down with us from the Premier League it looks like they have fallen of a cliff. Even with a new manager they look terrible.\nIt is a big opportunity to beat them at Turf Moor and a chance to get six points next week.\n'If we perform like we did in the first half, it is going to be hard work'\nFT: Hull 2-0 Plymouth\nPeter Swan\nFormer Hull City player on BBC Radio Humberside\nWe have said before Hull are not a relegation team, but they have put themselves in that situation now - and they have got to fight to get out of it.\nIf we perform like we did in the first half it is going to be hard work, but they stuck to their plan and came out in the second half and they had a bit of luck, but that is what you need if you work hard, that bit of luck will turn into chances and you have to take them.\nIt gives you the confidence to go on and win games like we did today, because Plymouth are a poor team and they will stay down in the bottom three and you can see them getting relegated.\nThere wasn't much difference between both teams in the first half. But a result at home like this will give them a bit of belief going forward.\nFULL-TIME\nCardiff 1-2 Burnley\nBurnley concede a goal after 1132 minutes of league football but more importantly they get the three points.\nGoals from Josh Brownhill and Maxime Esteve had the visitors cruising but Yousef Salech had already hit a post before breaching the Burnley defence to get his side back into it.\nSalech glanced a header against the bar in the second period while Ethan Horvath prevented Burnley from extending their lead with saves from Jaidon Anthony and Josh Cullen.\nWill Fish almost salvaged a point for Cardiff right at the death but fired across the face of goal.\nCardiff remain just five points clear of trouble while Burnley are back within two points of the automatic promotion places.", "url": "https://www.bbc.co.uk/sport/football/live/c78w812q30et"}