{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:18:59", "date_modify": "2025-05-21 07:18:59", "date_publish": "2025-05-20 09:05:37", "description": "Brighton news: Mats Wieffer on beating Liverpool and European football", "filename": "sport_football_articles_c0qggd74dzpo_1747811939.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d471/live/42be7800-3550-11f0-b7a7-db7402bc2830.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c0qggd74dzpo_1747811939.html", "title": "Brighton news: Mats Wieffer on beating Liverpool and European football", "title_page": "Brighton news: Mats Wieffer on beating Liverpool and European football - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Brighton took three points on Monday by beating Premier League champions Liverpool 3-2, keeping alive their chances of European football.\nMats Wieffer told BBC Radio Sussex: \"It's really nice. I think in the first half after 15 minutes we dominated the game, we had more possession and a couple of good chances.\n\"I think in the second half, we kept on pushing and the substitutes that came on did a good job and in the end we got it over the line. We've struggled at some points this season to get it over the line. We prevented them from making it 3-3, which we've had a problem doing this season. Amazing three points for us.\"\nOn his first season with Brighton: \"It's been a hard season for me. I came with a quad injury and was out for a long time, then I played the first game and got injured. I never got in the rhythm and now I am really fit and have got used to the intensity.\n\"I've played in good leagues, Champions League and European football, but this is something else. I don't play in my natural position, but I try to play my best football if possible. It's going well at the moment.\"\nOn it being the second highest finish for Brighton: \"Everyone wants to play European football. It's still possible.\n\"I think in the end, it's a good position especially because it's the second highest Brighton's ever achieved. We hope to play European football, for sure.\"", "url": "https://www.bbc.com/sport/football/articles/c0qggd74dzpo"}