{"authors": ["Tom Jordan", "www.facebook.com"], "date_download": "2025-05-21 06:05:42", "date_modify": "2025-05-21 06:05:42", "date_publish": "2024-12-24 15:36:08", "description": "Bournemouth news: Opinion - My moment of the year", "filename": "sport_football_articles_clyvdrwv721o_1747807542.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cc65/live/63c552c0-b627-11ee-bc2f-cb5579b90709.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_clyvdrwv721o_1747807542.html", "title": "My moment of the year", "title_page": "Bournemouth news: Opinion - My moment of the year - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It is a wonderful time to be a Cherries fan - and 2024 has been a year with many moments to cherish.\nIn particular, Bournemouth's first top-flight win over the current Premier League champions was a special one - not least given it was our first point against them.\nWhile we are fortunate enough to have witnessed some big scalps over our relatively short Premier League stint, Manchester City was one team that had always eluded us. The fixture was actually the most one-sided in the top flight, but 2024 was the year which changed all that.\nThe victory, courtesy of Antoine Semenyo and Evanilson, was not only impressive because of the result but also because of the manner of it.\nBournemouth thoroughly deserved it. They outclassed a City side full of world-class players, and Andoni Iraola won the battle of minds with one of the best in Pep Guardiola.\nBut I know what you are thinking: Manchester City are in a mini crisis and have only won one game in their past 12. And you would be correct.\nBut which side started their Premier League downfall? It was Bournemouth.\nIt was a statement to the rest of the league that simply 'surviving' was not the Cherries' only aim in 2024, instead we wanted to continue to flourish and progress in the top flight.\nHaving taken a big scalp in Arsenal a few games earlier, it was also a sign that the win was not just a 'flash in the pan'. Iraola's men mean business this season, regardless of the opposition.\nAre Bournemouth one of the main reasons for City's drop-off? Maybe. But is this a reason why Cherries fans will be ending 2024 with big smiles on our faces? Definitely!", "url": "https://www.bbc.com/sport/football/articles/clyvdrwv721o"}