{"authors": ["Odhran Crumley", "www.facebook.com"], "date_download": "2025-04-26 06:39:44", "date_modify": "2025-04-26 06:39:44", "date_publish": "2025-03-02 15:51:27", "description": "Donegal come from eight points down with 15 minutes left to play to beat Derry 1-22 to 1-19 in Ballyshannon.", "filename": "sport_articles_cy05j8wqnnzo_1745649584.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b549/live/e1708db0-f77c-11ef-b744-2fe4be9f666c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cy05j8wqnnzo_1745649584.html", "title": "Donegal stage late comeback to stun Derry in Division One", "title_page": "Football League: Donegal stage late comeback to stun Derry in Division One - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Donegal came from eight points down with 15 minutes left to play to beat Derry 1-22 to 1-19 in Ballyshannon.\nDaire O Baoill and Ciaran Thompson landed two-pointed efforts either side of a Shane O'Donnell goal as Jim McGuinness' side made a Lazarus like recovery to make it four wins from five in Division One.\nThe Oakleafers led 0-11 to 0-7 at half time after playing with the aid of whatever breeze that was on offer at Father Tierney Park with Lachlan Murray and Shane McGuigan carrying the Derry cause on the scoring front.\nDespite playing against the wind in the second half, it was Derry who edged the exchanges with Lachlan Murray and Shane McGuigan landing two-pointers of their own before Conor Glass was slipped through by Ethan Doherty before shooting low beyond Sean Patton to the back of the net.\nPaddy Tally's side led 1-18 to 0-13 with 15 minutes remaining on the clock and were dealt a hammer blow with an injury to Rogers dealing a significant blow to their cause.\nThe hosts hit an unanswered 1-6 as Shane O'Donnell played a neat one-two with Michael Murphy to hit the roof of the net to put three between them.\nThompson quickly followed with a two-pointer before a Ciaran Moore point and two from Conor O'Donnell sealing a win for Donegal to leave Derry with a slim chance of retaining their top-tier status despite being league champions.\nThe two sides will meet in Ballybofey on 6 April in the preliminary round of the Ulster senior football championship.", "url": "https://www.bbc.co.uk/sport/articles/cy05j8wqnnzo"}