{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:24:49", "date_modify": "2025-05-20 14:24:49", "date_publish": "2023-07-29 00:00:00", "description": "Follow live text updates as Scotland take on Italy in their first Rugby World Cup warm-up match.", "filename": "sport_live_rugby-union_66191019_1747751089.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_rugby-union_66191019_1747751089.html", "title": "Scotland beat Italy 25-13 at Murrayfield", "title_page": "Scotland beat Italy 25-13 at Murrayfield - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Caio!\nFT: Scotland 25-13 Italy\nI think Rory Darge summed it up best - a mixed bag for Scotland. Darcy Graham was back to his best, Ben Healy looked more than comfortable at Test level... but the hosts were hardly convincing.\nThe monsoon conditions didn't help. It was very stop-start and there was hardly any rhythm to the game in the first-half, as a stubborn seagull stole the show.\nOf course, this was an experimental team that lacked many key players - no Ritchie, no Russell, no Watson. But Scotland will need to up considerably if they want to take anything from the France game next week.\nThat's all from me for now. See you next week!\nTownsend 'knows Scotland have work to do'\nFT: Scotland 25-13 Italy\nScotland head coach Gregor Townsend tells Amazon Prime: \"Darcy [Graham] is always good on that cutback line so we aim to get the ball in his hands as much as possible. Today, we didn't do that as much as we'd like. When you get the ball into Darcy's hands, usually good things happen.\n\"From a coach's perspective, you don't want a game with no errors. You want a win, but you want things to work on during the week. There are bigger tests to come. We want to move forward with the confidence of a win, but knowing we have to work to get better.\n\"[Handling] was a concern, especially in first and second phases. We weren't able to apply the pressure we aim to apply on Italy. I was really pleased with the final try, to have the confidence to move the ball wide and it was a great finish.\n\"I felt our defence was really secure today. Set-piece, the defence of the maul. Our scrum was dominant throughout. That will be pleasing for the players and the coaches. Next week we have to tidy up those handling errors.\"\n'Mixed bag' - Darge\nFT: Scotland 25-13 Italy\nScotland captain Rory Darge tells Amazon Prime: \"It was a bit of a mixed bag. Loads of good stuff, especially in defence.\n\"The shots and physicality was really good but we'll have a lot to work on come Monday, especially taking care of the ball. It was tough conditions but we could have done a bit more, especially around the breakdown.\n\"This whole week has been special, in the build up to the game. I've been honoured.\"\nHealy 'surprised' by Player of the Match award\nFT: Scotland 25-13 Italy\nScotland's fly-half and Player of the Match, Ben Healy, tells Amazon Prime: \"It was far from perfect, as you can tell. We're just happy to get across the line with a win.\n\"I'm a bit surprised, to be honest! I made a lot of mistakes towards the end. A few of our boys dug in deep and came out with some big plays to get us across the line.\n\"I have two caps - both against Italy - and they both came down to the wire. They're a niggly team to play against and we saw that again today.\n\"Today is a step in the right direction. Pre-season was as tough as they come, so today was a reward.\"\nFull-time: Scotland 25-13 Italy\nHaven't we been here before? Scotland are run very close by Italy at Murrayfield for the second time this year, after a narrow win in the Six Nations in the spring.\nDarcy Graham scored two brilliant tries, Josh Bayliss killed the game with his first Scotland try, and Ben Healy stood out on his first Scotland start as the hosts managed to grind out that win in horrible conditions in Edinburgh.\nThe final scoreline makes it look far more convincing than it was. Italy dominated large swathes of that game, defended admirably and put Scotland under real pressure.\nPhew. Reaction coming your way shortly.\nConverted try - Darcy Graham (Scotland)\nScotland 15-6 Italy\nHe made that chance possible, so it's quite fitting Darcy Graham scores his and Scotland's second try.\nAfter that scrum on the five-metre line, Scotland punched up the middle through Stafford McDowall. He was held short but the move wasn't finished, as Ali Price drifted across the line and popped inside to the little bullet Graham, who threw himself over the line like a torpedo.\nHealy nails the kick and Scotland enjoy their biggest lead yet.", "url": "https://www.bbc.com/sport/live/rugby-union/66191019"}