{"authors": ["Harry Poole", "www.facebook.com"], "date_download": "2025-04-26 03:40:54", "date_modify": "2025-04-26 03:40:54", "date_publish": "2025-03-05 09:22:32", "description": "Great Britain's Georgia Hunter Bell seeks her first major international title at the European Athletics Indoor Championships in Apeldoorn, the Netherlands.", "filename": "sport_athletics_articles_c07zdzx23lzo_1745638854.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5338/live/481dbd40-f916-11ef-becb-07cbf84d799c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_athletics_articles_c07zdzx23lzo_1745638854.html", "title": "European Athletics Indoor Championships: Georgia Hunter Bell leads British medal hopes", "title_page": "European Athletics Indoor Championships: Georgia Hunter Bell leads British medal hopes - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Georgia Hunter Bell will chase her first major international title when she leads Great Britain's medal hopes at the European Athletics Indoor Championships in Apeldoorn, the Netherlands.\nOlympic bronze medallist Hunter Bell will line up as the fastest European woman over 1500m this year and, while another podium place is her priority, Laura Muir's British indoor record time of 3:59.58 is also in her sights.\n\"I would love to run a fast time and I do have half an eye on the British record,\" Hunter Bell, who races in the heats during Thursday's opening session, told BBC Sport.\n\"But championship racing is about the podium, not the time, so we will see if the opportunity presents itself this weekend to run fast.\"\nElsewhere, Norway's Jakob Ingebrigtsen will bid to make history by taking his tally of European indoor golds to seven with a third consecutive 1500m and 3,000m double at the championships.\nGreat Britain finished third in the medal table with three golds and six medals overall in 2023, but title-winners Keely Hodgkinson, Laura Muir and Jazmin Sawyers are all absent from the 42-strong squad.\nAnother British medal hope, world indoor pole vault champion Molly Caudery, has withdrawn to focus on the World Indoor Championships later this month as she manages a minor calf problem.\nThe championships will feature wavelight technology - the LED pacing system on the inside of the track - for the first time after European Athletics approved its use in a competitive setting, although organisers said \"it will not be used as a direct aid to athletes\".\nFollow coverage of the European Indoor Championships on BBC Two from Thursday 6 to Sunday, 9 March.\nFew could have foreseen Hunter Bell's rapid rise to the Olympic podium even just 12 months ago. Now a full-time athlete after taking a sabbatical from her cyber security job to chase her Olympic dream last summer, the 31-year-old is targeting her first international gold.\nHunter Bell set a British record time of three minutes 52.61 seconds in winning a brilliant 1500m bronze at Paris 2024, two months after she secured her first international medal at the outdoor European Championships in Rome.\nHaving achieved victory over the mile at the prestigious Millrose Games in New York and retained her British indoor 1500m title in a promising start to 2025, her season's best of 4:00.63 is almost three seconds faster than any of her competitors in Apeldoorn.\n\"Last year I was very much the underdog, this year I'm going into competitions expected to win, which is a big mental adjustment,\" said Hunter Bell, who trains alongside Olympic 800m champion Hodgkinson under coaches Trevor Painter and Jenny Meadows.\n\"It's something Keely adjusted to last year and really worked hard on. I speak to her about it to get some advice and hopefully I will develop that.\"", "url": "https://www.bbc.co.uk/sport/athletics/articles/c07zdzx23lzo"}