{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:49:53", "date_modify": "2025-05-20 14:49:53", "date_publish": "2023-07-12 14:58:41", "description": "Neymar, Karim Benzema, Riyad Mahrez, Roberto Firmino, Cristiano Ronaldo - a guide to which players and managers are at which teams in the Saudi Pro League.", "filename": "sport_football_66132139_1747752593.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/11A4E/production/_130807227_gettyimages-1585535357.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66132139_1747752593.html", "title": "Saudi Pro League: Neymar, Benzema, Mahrez - which players have joined Saudi teams this summer?", "title_page": "Saudi Pro League: Neymar, Benzema, Mahrez - which players have joined Saudi teams this summer? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "With the transfer window in Saudi Arabia now closed we take a look at who has made the switch this summer.\nSaudi Pro League teams have made many headlines this summer, with stars like Neymar, Karim Benzema and Riyad Mahrez joining Cristiano Ronaldo in the country.\nSaudi Arabia's Public Investment Fund recently took over four of the country's top teams - Al-Ittihad, Al-Nassr, Al-Hilal and Al-Ahli - while the other 14 top-flight clubs have some big-name players too.\nSo many players - and managers - have recently moved to Saudi Arabia, that it's hard to keep up.\nHere's an easy guide to which stars are playing for which clubs.\nAbha, from the city of the same name, were playing in the third tier as recently as 2017-18 before winning back-to-back promotions. They have never won a major trophy.\nThey are managed by Czeslaw Michniewicz, who was Poland's boss at last winter's World Cup in Qatar, and their biggest name is 30-year-old striker Karl Toko Ekambi, who signed from Lyon in August.\nFormer Paris St-Germain and West Brom midfielder Grzegorz Krychowiak and ex-AC Milan goalkeeper Ciprian Tatarusanu have also signed this summer.\nAl-Ahli are one of the country's biggest teams, and one of the four taken over by the PIF recently. The three-time champions were in the second tier last season but went up as champions. The Jeddah side, who share a ground with Al-Ittihad, are still looking for a manager.\nAl-Ahli have been busy attracting talent from the Premier League this summer, having signed French winger Allan Saint-Maximin from Newcastle for an undisclosed fee and paid £30m deal to bring Manchester City forward Riyad Mahrez to the club.\nEx-Liverpool striker Roberto Firmino and former Chelsea goalkeeper Edouard Mendy are their other two biggest signings this summer. Ezgjan Alioski played in the Premier League for Leeds.\nIvory Coast midfielder Franck Kessie arrived from Barcelona, Turkey defender Merih Demiral has joined from Atalanta and Brazil defender Roger Ibanez agreed a move from Roma.\nFormer Rangers and Aston Villa boss Steven Gerrard will manage Al-Ettifaq this season, with England and Liverpool midfielder Jordan Henderson joining him after completing a deal worth £12m plus add-ons.\nDutch midfielder Georginio Wijnaldum also reunites with ex-Liverpool team-mate Henderson after agreeing a switch from Paris St-Germain, while former Lyon striker Moussa Dembele is set to lead the line.\nScotland defender Jack Hendry has signed from Club Bruges, the 28-year-old having also spent a period last season on loan in Italy with Cremonese.\nForward Robin Quaison is a Sweden international.\nTheir last silverware was in the 1980s.\nAl-Fayha won the Saudi title in 2017 and the King Cup in 2022. Their manager is former Yugoslavia international Vuk Rasovic. Their Al Majma'ah Sports City stadium, with a 7,000 capacity, is the smallest in the league.\nZambia forward Fashion Sakala, who scored 24 goals for Rangers, and ex-Everton winger Henry Onyekuru both signed in August.\nVeteran goalkeeper Vladimir Stojkovic is a former Serbia international and has played for Wigan and Nottingham Forest. Striker Milan Pavkov also played for Serbia, although he was sent off against Germany in his only cap.\nAl-Hilal have won a record four Asian Champions Leagues and 18 Saudi titles. Ex-Benfica boss Jorge Jesus replaced former Oxford manager Ramon Diaz this summer.\nThey made a splash on 15 August when they signed Brazilian superstar Neymar from Paris St-Germain for a reported 90m euros (£77.6m), while also acquiring Serbia striker Aleksandar Mitrovic from Fulham in a reported £50m deal.\nAnother PIF-owned club, they also spent £47m this summer to sign Wolves captain Ruben Neves and also brought in Kalidou Koulibaly from Chelsea, former Barcelona player Malcom from Zenit St Petersburg and Lazio midfielder Sergej Milinkovic-Savic for big fees.\nMorocco goalkeeper Yassine Bounou is also in the team.\nAl-Ittihad - also owned by PIF - are Al-Hilal's big rivals in a derby known as Saudi's Clasico. They are the defending champions, with ex-Wolves and Tottenham boss Nuno Espirito Santo leading them to last season's title. Scot Ian Cathro is one of Nuno's first-team coaches.\nFormed in 1927, they are Saudi Arabia's oldest football club.\nThey were one of the biggest movers this summer, signing Real Madrid's Ballon d'Or winner Karim Benzema and N'Golo Kante, formerly of Chelsea, plus £25m Celtic forward Jota.\nThey join ex-Brazil keeper Marcelo Grohe, former West Brom defender Ahmed Hegazi and Brazilian midfielder Igor Coronado, who played for Banbury United in 2012 after coming through the MK Dons youth set-up.\nThe club has also completed a deal for Brazil midfielder Fabinho from Liverpool.\nNine-time champions Al-Nassr beat their league rivals to worldwide headlines by several months when they signed five-time Ballon d'Or winner Cristiano Ronaldo in January after his Manchester United exit. He scored 14 goals as they finished second in the Pro League.\nRonaldo's fellow Portuguese Luis Castro replaced Rudi Garcia as boss this summer, and they are another PIF-owned club.\nBayern Munich winger Sadio Mane, Inter Milan captain Marcelo Brozovic, Man Utd full-back Alex Telles and Lens midfielder Seko Fofana also made the move recently, as well as Ronaldo's Portugal team-mate Otavio, who joined from Porto.\nSpain defender Aymeric Laporte then followed from Man City, joining ex-Arsenal keeper David Ospina and ex-Benfica forward Talisca. Saudi international Mukhtar Ali played for England at Under-16 and U17 level.\nAl-Wehda, who were formed 88 years ago, last won a trophy in 1966 with the King Cup. Former Greece midfielder Georgios Donis is their manager, having moved from Al-Fateh this summer to replace Jose Luis Sierra.\nFormer Manchester United and Watford striker Odion Ighalo joined from fellow Saudi Pro League side Al-Hilal this summer.\nCosta Rica defender Oscar Duarte scored at the 2014 World Cup against Uruguay, while midfielder Faycal Fajr and goalkeeper Munir Mohamedi both featured at the 2018 World Cup for Morocco.", "url": "https://www.bbc.com/sport/football/66132139"}