{"authors": ["Matthew Cresswell", "www.facebook.com"], "date_download": "2025-05-21 08:39:07", "date_modify": "2025-05-21 08:39:07", "date_publish": "2025-02-07 21:57:32", "description": "Wigan, Hull KR and Leigh safely proceed to the fourth round of the Challenge Cup following comfortable away wins.", "filename": "sport_rugby-league_articles_cvg8zwvp70yo_1747816747.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/01a0/live/b92bb510-e592-11ef-9e85-eb815eaedf23.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-league_articles_cvg8zwvp70yo_1747816747.html", "title": "Challenge Cup: Wigan, Hull KR and Leigh through to fourth round", "title_page": "Challenge Cup: Wigan, Hull KR and Leigh through to fourth round - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Super League sides Wigan Warriors, Leigh Leopards and Hull KR safely proceeded to the fourth round of the Challenge Cup with comfortable away wins at lower league opposition.\nHolders Wigan beat Championship side Sheffield Eagles 48-12, Hull KR saw off second-tier York Knights 44-2 and Leigh Leopards thrashed League One Workington Town 60-0.\nWigan, who beat Warrington in last year's final for a record-extending 21st triumph in the competition, took the lead in south Yorkshire in the third minute thanks to Jai Field's try.\nBut they were pegged back by the hosts just moments later after Joel Farrell crashed over for the Eagles to level the scores.\nBevan French soon restored the visitors' lead and Liam Byrne and Zach Eckersley each dotted down to help put the Warriors 18 points clear at half-time.\nSecond-half tries from Sam Walters, Adam Keighran, Junior Nsemba and Kaide Ellis helped them pull away while Matty Dawson-Jones grabbed a consolation try for the Eagles.\nYork Knights opened the scoring against last year's Grand Finalists Hull KR through Will Dagger's penalty, but that was as good as it got for the hosts.\n2024 Man of Steel Mikey Lewis' superb individual try put Rovers on the board.\nTwo tries from Rhyse Martin, either side of half-time, and one each from Peta Hiku and Tom Davies - his first for the club since arriving from Catalans Dragons - helped Willie Peters' side go 24 points clear with almost an hour on the board.\nHull KR's Niall Evalds then flew over close to the sticks before turning provider for Lewis who comfortably dotted down his second of the match following a well -worked team move.\nKelepi Tanginoa grabbed the eighth and final try for the Robins.\nLeigh shattered any chance of third-tier Workington causing a huge upset by half-time after David Armstrong, Tesi Niu, Gareth O'Brien and Bailey Hodgson helped put them 22-0 up at the break.\nThe visitors smelt blood in the second half and substitute Andrew Badrock scored the Leopards' fifth try of the evening 12 minutes after the break.\nThe floodgates then opened for Leigh as Keanan Brand scored in the corner and O'Brien and Jack Hughes both crossed in quick succession as the hosts began to tire.\nWith 17 minutes left, Frankie Halton dotted down for the visitors before Aaron Pene forced his way through a flurry of missed tackles to touch down.\nNiu then scored his second of the match before Brad Dwyer completed the rout with Leigh's 11th try in Cumbria.\nSix more Super League sides, who entered the competition at this stage, are in round three action on Saturday.", "url": "https://www.bbc.com/sport/rugby-league/articles/cvg8zwvp70yo"}