{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:10:16", "date_modify": "2025-05-21 07:10:16", "date_publish": "2025-03-30 10:54:47", "description": "'Wimmer now knows exactly what he has inherited'", "filename": "sport_articles_cwyn30vxpxko_1747811416.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0d6f/live/5c007340-0d55-11f0-ac9f-c37d6fd89579.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cwyn30vxpxko_1747811416.html", "title": "'Wimmer now knows exactly what he has inherited'", "title_page": "'Wimmer now knows exactly what he has inherited' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Motherwell fans, we asked for your views after the 4-1 loss to Aberdeen at Pittodrie. Here's a taste of what you had to say...\nColin: Good first six minutes, then all downhill. Callum Slattery and Tom Sparrow were the best performers by far. There is nothing upfront, no guile or flair, no periods of decent possession. A bit of a step back under Michael Wimmer's leadership.\nDavid M: Wimmer has inherited Stuart Kettlewell's underachievers and I already see progress. There's a long way to go, but if we finish best of the rest come May, that's a better place than I feared we were heading under the previous manager.\nLet's consider that as a glitch on the journey. It won't be the last, but we are in a better place now and will be better prepared for next season.\nKevin: The honeymoon period is over. I was impressed by what Wimmer was doing when he first came in, but the St Mirren and Aberdeen games were like watching a Kettlewell team, just dire. Please bring back 4-4-2, this lone striker never works and is brutal to watch.\nAndy: Wimmer now knows exactly what he has inherited from Kettlewell - a team lacking in pace and a lack of quality in several positions, a squad tied to a formation that exposes weaknesses.\nSurvival this season and a huge rebuild next is reality. Then it's time to judge.", "url": "https://www.bbc.com/sport/articles/cwyn30vxpxko"}