{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:27:28", "date_modify": "2025-05-19 15:27:28", "date_publish": "2017-07-06 15:46:24", "description": "Huddersfield Giants improve their chances of a top-eight finish as they eased to victory over struggling Widnes Vikings.", "filename": "sport_rugby-league_40495948_1747668448.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1137D/production/_96852507_jc_huddersfield_salford_39.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_rugby-league_40495948_1747668448.html", "title": "Super League: Huddersfield Giants 40-0 Widnes Vikings", "title_page": "Super League: Huddersfield Giants 40-0 Widnes Vikings - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Published\n7 July 2017\nBetfred Super League\nHuddersfield Giants improved their chances of a top-eight finish in Super League as they eased to victory over struggling Widnes Vikings.\nGiants led 18-0 after 16 minutes with tries from Shannon Wakeman, Jermaine McGillvary and Ryan Hinchcliffe.\nAdam O'Brien and Darnell McIntosh crossed either side of half-time to extend the lead to 30 points.\nMcGillvary and Ukuma Ta'ai went over late on as the hosts moved four points clear of ninth-placed Catalans.\nWhile England winger McGillvary was in dominant form, the Giants were just as impressive as a defensive unit, as they held an opponent without points for the first time since April 2016.\nWidnes have now ended a game scoreless two times this season, having lost 34-0 at home to leaders Castleford in March.\nThe Vikings were already out of contention for a place in the top eight ahead of the Super 8s split, as they remain in 11th place with two games to play.\nHuddersfield Giants: Rankin; McGillvary, Cudjoe, Gaskell, McIntosh; Brough, Ridayrd; Rapira, Leeming, Wakeman, Roberts, Ta'ai, Hinchcliffe.\nReplacements: Clough, Dickinson, Mellor, O'Brien.\nWidnes Vikings: Thompson; Ince, Bridge, Runciman, Marsh; Mellor, Heremaia; Dudson, White, Buchanan, Whitley, Houston, Cahill.\nReplacements: Burke, Manuakafoa, Johnstone, Walker.\nReferee: Tom Grant\nAround the BBC\nWatch the Super League Show on BBC iPlayer\nWhat's on BBC Sport?\n5 live podcast\nRelated internet links\nHuddersfield Giants\nWidnes Vikings\nRugby league commentaries\nRFL\nSuper League\nThe BBC's Super League Show on Facebook (requires registration)\nThe BBC is not responsible for the content of external sites.", "url": "https://www.bbc.com/sport/rugby-league/40495948"}