{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:31:40", "date_modify": "2025-05-21 04:31:40", "date_publish": "2025-01-23 18:02:21", "description": "Morecambe are \"not in immediate jeopardy\" despite not having proof of funds for the rest of the season, says co-chairman Rod Taylor.", "filename": "sport_football_articles_cdxn5ld4ez2o_1747801900.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5228/live/bd1a7470-d9aa-11ef-b6cc-bbf64212e2cd.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cdxn5ld4ez2o_1747801900.html", "title": "Morecambe 'not in jeopardy' despite funding woes", "title_page": "Morecambe 'not in jeopardy' despite funding woes - co-chairman Rod Taylor - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Morecambe are \"not in immediate jeopardy\" despite the League Two strugglers not having proof of funds for the rest of the season, co-chairman Rod Taylor has said.\nTaylor's comments come after the club issued a statement, external on Thursday saying they were unable to sign players during the current transfer window.\nThe statement said that Bond Group, the ownership group of the club, had not provided sufficient proof of funds to the EFL to run the club until the end of May.\n\"It is down to [owner] Jason Whittingham and Bond Group to provide these funds to enable Derek Adams to strengthen the squad and sign players in this absolutely pivotal transfer window,\" Taylor told BBC Radio Lancashire.\n\"That's not saying we're in immediate jeopardy because we're not. There has been investment over the past month. There has been equity purchased. We've been successful with our FA Cup run.\n\"We don't know at this moment in time what our revenue from [the FA Cup tie at] Chelsea will be. We should know this week but right now we don't know.\n\"Those funds, and we do have funds on deposit, are to sustain the football club and hopefully put some into the transfer budget as well.\"\nIn response, owner Jason Whittingham told BBC Radio Lancashire: \"The statement has no balance and nor does it reflect work ongoing to rectify the position as soon as is practically possible. On that I am working with the EFL.\"\nTaylor also told BBC Radio Lancashire that he had spoken with Whittingham this week and had been told that he had secured additional investment from a third party and seen evidence of funds.\nHe stated that Whittingham was putting this to the EFL on Thursday and the club is awaiting a response.\n\"We've got to be cognisant of the fact there are 72 members of the EFL and Morecambe isn't the only club. A lot of people will be knocking on their door throughout this window. You can only so much,\" Taylor added.\n\"We'll hope for an early response and if it's positive, we can open that window again and ensure we have the wherewithal to secure some signings.\n\"We desperately need a change of ownership, we need an owner that will care for this football club as we do and the sooner that happens the better.\"\nKuljeet Singh Momi, who has previously stated, external he has \"contributed to the club's working capital since October 2023\", has been trying to buy the club since July last year but the takeover is yet to be finalised.\nFans protested earlier this season with a drawn-out takeover process still ongoing after Bond Group initially put the club up for sale in September 2022.\nThe club are five points adrift of safety in 23rd position in the League Two table and are at risk of dropping out of the English Football League for the first time since 2007.\nAdams, who also stated that the club have now had to call off a deal to bring two players in on loan during this window, says he will not leave the club despite their financial troubles.\nThe Scot previously left the club amid their off-the-field issues but returned last summer for a third stint in charge of the Shrimps.\n\"I spoke to the chairman and affirmed my commitment to the football club and I am happy to fight the battle, which it is,\" Adams said.\n\"The battle at this moment in time is for us to get enough points for us to stay in the league and we will continue to do that.\n\"I have to show my commitment to the club. Obviously they're committed to me. It's not easy as my reputation is on the line but this football club has helped me as a person and as a football manager as well and I'm going to try my utmost to help in these difficult circumstances.\"", "url": "https://www.bbc.com/sport/football/articles/cdxn5ld4ez2o"}