{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:47:47", "date_modify": "2025-05-21 06:47:47", "date_publish": "2025-03-30 13:57:31", "description": "What the managers said: Man Utd 2-0 Everton", "filename": "sport_football_articles_cd7v3relv8eo_1747810067.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7aa4/live/ac0f68a0-0d6e-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cd7v3relv8eo_1747810067.html", "title": "What the managers said: Man Utd 2-0 Everton", "title_page": "What the managers said: Man Utd 2-0 Everton - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Dominique Janssen and Grace Clinton scored as Manchester United moved closer to qualifying for next season's Champions League with a routine 2-0 win against Everton.Here is what the managers said after the game:\nMan Utd manager Marc Skinner speaking to BBC Sport: \"I thought we were excellent. We reduced Everton to three shots and one on target and with that it gives you control of the game. It was a really dominant performance.\n\"We want as many wins as possible and we have to take it in our stride. They are all going to be difficult but we have to do us. We're going to have to make sure we push it hard and have no regrets.\n\"We wanted to take the game to Everton and we know that if we win the ball off them, we can transition quickly. As a collective there was so much hard work. That should send shockwaves to the rest of the teams that we play.\"\nEverton manager Brian Sorensen speaking to BBC Sport: \"We need to get something more from that first half and Courtney Brosnan has been excellent all season but it is a little error. Those fine margins need to drop on our side. It wasn't our day and there are positives to take forward.\n\"There is still stuff we know we can be better at. Late on, they figured it out and caused us more trouble. They were the better team on the day but there are margins and we know we can do better in those parts.\"", "url": "https://www.bbc.com/sport/football/articles/cd7v3relv8eo"}