{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:20:59", "date_modify": "2025-05-21 06:20:59", "date_publish": "2025-03-31 15:39:53", "description": "Injured Huddersfield Town striker Dion Charles apologises to interim boss Jon Worthington after attending Bolton's game at Blackpool in the away end.", "filename": "sport_football_articles_c62x59d97eyo_1747808459.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d5c0/live/a04317a0-0e41-11f0-bfea-d170975f1d6a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c62x59d97eyo_1747808459.html", "title": "Dion Charles: Huddersfield Town striker 'naive' to attend Bolton game", "title_page": "Dion Charles: Huddersfield Town striker 'naive' to attend Bolton game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Injured Huddersfield Town striker Dion Charles has apologised to interim manager Jon Worthington for attending Bolton's game at Blackpool on Saturday in the away end.\nThe 29-year-old Northern Ireland international joined the Terriers from Wanderers in January and has yet to score for his new side in 11 appearances.\nHuddersfield were beaten 4-0 away at Charlton on Saturday, while Bolton, who are one point and one place below seventh-placed Town in League One, lost 2-1 at Bloomfield Road later that afternoon.\n\"Dion came to see me first thing on Sunday morning to apologise,\" Worthington told BBC Radio Leeds.\n\"I think ultimately he has probably been a bit naive with the context of it being another team in our league.\n\"He is injured and he isn't available for us and he was there with his three-year-old son... ultimately we draw a line under it and move on as quickly as possible.\"\nCharles is out with a hamstring injury picked up in the 1-0 defeat at Bristol Rovers on 8 March, with Worthington saying he is hopeful the forward is \"getting close\" to being available again.", "url": "https://www.bbc.com/sport/football/articles/c62x59d97eyo"}