{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:19:43", "date_modify": "2025-05-21 05:19:43", "date_publish": "2025-01-14 18:20:28", "description": "Wrexham are to submit revised plans for a new Kop stand at their Stok Racecourse home next month.", "filename": "sport_football_articles_cnvqjnpp6vdo_1747804783.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c75f/live/f4bf2570-d2a1-11ef-9108-d56750e10430.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cnvqjnpp6vdo_1747804783.html", "title": "Wrexham to submit revised Kop stand plans", "title_page": "Wrexham to submit revised Kop stand plans - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wrexham are to submit revised plans for a new Kop stand at their Stok Racecourse home next month.\nRevised designs for the new 5,500-capacity Kop Stand will be presented to Wrexham County Borough Council at the beginning of February.\nThe club said their objective remains for the new stand to be completed in time for the Uefa European Under-19 Championship finals tournament in 2026.\nThe new stand, along with other works planned at the stadium, will make Wrexham's ground fully compliant with Uefa category 4 stadium standards, allowing it to host other international events.\nWrexham chief executive Michael Williamson has described the submission of the revised designs as a \"major milestone\".\n\"We want to create a stadium which is authentic, organic and in keeping with Wrexham. The design will therefore emphasise materials that reflect the strong heritage and character of Wrexham,\" he said.\nWork on the new stand was originally due to begin in 2023 but was delayed because of what the club called \"additional complications\".\nWrexham, owned by Hollywood stars Ryan Reynolds and Rob McElhenney, appointed architects Populous to \"create a masterplan\" for their stadium.\nThe original standing Kop terrace was abandoned in 2007 and was unused until its demolition in January 2023.", "url": "https://www.bbc.com/sport/football/articles/cnvqjnpp6vdo"}