{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:36:17", "date_modify": "2025-05-21 05:36:17", "date_publish": "2025-04-01 08:34:24", "description": "Everton news: Financial reports show Toffees can 'build towards something new'", "filename": "sport_football_articles_cpvr21pk2vzo_1747805777.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/92f6/live/bde50c50-0ef0-11f0-9471-fd068d782b6b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cpvr21pk2vzo_1747805777.html", "title": "Everton news: Financial reports show Toffees can 'build towards something new'", "title_page": "Everton news: Financial reports show Toffees can 'build towards something new' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Everton have reported losses of £53m for the 2023-2024 season but Reach PLC's business of football writer Dave Powell believes their latest financial reports \"point to a more positive outlook\" at the club since The Friedkin Group's takeover.\nAlthough the figure is less than the £89m deficit the club filed from 2022-23, it is the Toffees' seventh successive season of losses.\n\"Accounts are a strange thing because they are a snapshot in time,\" Powell told BBC Radio Merseyside. \"It is hard to think of a club that has changed more, in the short amount of time since this financial year ended, than Everton.\n\"The club have been wanting to stem some of these losses. I think a lot of work has gone on behind the scenes, following the first PSR breach, to bring these costs down to a more sustainable and manageable level.\n\"These figures have come from a period when the football club were going through the long takeover process with 777 Partners and accrued a lot of stadium debt through that.\n\"There are trends in these figures that point to a more positive outlook.\n\"I think we should be looking at them through the lens of it being the final year of Farhad Moshiri's ownership - you are basically looking at the struggles that came with the final tumultuous years of his ownership.\n\"This feels like a financial year they can draw a line under and build towards something new.\n\"Player trading is an area the club can get better at. They haven't been able to add to their squad in a really meaningful way in recent years, but they are in the position now where they can think about adding to the squad as opposed to selling key players just to raise some money.\"", "url": "https://www.bbc.com/sport/football/articles/cpvr21pk2vzo"}