{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:40:18", "date_modify": "2025-05-20 11:40:18", "date_publish": "2023-08-06 17:00:08", "description": "Leigh Halfpenny may be without a club for next season but has set his sights on a third World Cup this autumn.", "filename": "sport_rugby-union_66423543_1747741218.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/12AEF/production/_130672567_gettyimages-1580044599.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-union_66423543_1747741218.html", "title": "Leigh Halfpenny vows to carry on after 100th Wales cap", "title_page": "Leigh Halfpenny vows to carry on after 100th Wales cap - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Leigh Halfpenny has set his sights on a third World Cup after celebrating a century of Wales caps in style with Saturday's 20-9 victory over England.\nThe 34-year-old described joining Wales' 100-cap club as \"surreal\" having doubted whether he would even win one.\nNow the full-back, still without a club for next season following his release by Scarlets, has vowed to carry on.\n\"You never know when your last game could be, but certainly the ambition is to keep going,\" Halfpenny said.\nHe added: \"You never take it for granted. Of course I would love to go to the World Cup in France, but there is so much competition in the squad and in the back-three positions.\"\nHalfpenny became just the ninth Welshman to reach the landmark figure, joining Alun Wyn Jones, Gethin Jenkins, George North, Dan Biggar, Stephen Jones, Gareth Thomas, Taulupe Faletau and Martyn Williams.\n\"It was a pretty special day for myself and my family,\" Halfpenny said.\n\"There are too many to mention, but it wouldn't have been possible without so many people supporting me throughout my career.\n\"I could never have dreamt of it to be honest. Winning one cap for Wales was a dream come true, and this is surreal. It hasn't really sunk in yet.\n\"There have certainly been some ups and downs along the way. There have been some really tough moments with injuries, times when I wasn't too sure whether I would get back on the field and play for Wales again.\"", "url": "https://www.bbc.com/sport/rugby-union/66423543"}