{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:27:17", "date_modify": "2025-05-21 04:27:17", "date_publish": "2025-01-18 00:00:00", "description": "Hull move out of the Championship relegation zone as Jake Cooper's unfortunate own goal gives them victory over Millwall.", "filename": "sport_football_live_cpdxvjennxdt_1747801637.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cpdxvjennxdt_1747801637.html", "title": "Millwall 0-1 Hull City: Cooper own goal earn Hull vital win", "title_page": "Millwall 0-1 Hull City: Cooper own goal earn Hull vital win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Hull City moved out of the Championship relegation zone as Jake Cooper's unfortunate own goal earned them a vital victory over Millwall at The Den.\nA tense game lacking quality and much goalmouth incident finally saw the deadlock broken just before the hour when Regan Slater drilled a ball across the face of goal which rebounded back off Cooper and beat keeper Lukas Jensen.\nA promising enough start saw both sides create chances, the Lions going close through a Mihailo Ivanovic header that was well tracked by keeper Carl Rushworth and George Honeyman shot over from 18 yards after a fine break band clever backheel by Duncan Watmore.\nIn between, Hull's Abu Kamara's strike from the right forced a fine save from onrushing Lions keeper Lukas Jensen.\nBut that was the pick of the increasingly limited goal threat until the Cooper own goal that saw Millwall slip to a sixth home defeat of the season.\nA goalless first half was no surprise given that hosts Millwall started the day as the joint-lowest scoring team in the Championship this season with 24 goals, one fewer of their similarly goal-shy opponents.\nAnd a lack of quality in the final third became increasingly clear in a game full of endeavour, but littered with stoppages and free-kicks.\nHowever, Hull's fortunes changed just before the hour mark, and perhaps it was fitting that the breakthrough came via an own goal - and from a cross.\nBefore and after that, neither side looked convincing or capable in front of goal, particularly a Millwall side whose fans were no doubt lamenting the sale of joint-top scorer Romain Esse to Crystal Palace.\nHull, who moved above Luton Town before the 15:00 GMT kick-offs, defended with little alarm and, with new signings Nordin Amrabat and Joe Gelhardt making their debuts from the bench, looked dangerous on the break in the closing stages as their mini resurgence continued under manager Ruben Selles.\nBut they did not need the security of a second goal to see out just their third win in 26 away league games against the Lions, who have now lost 10 of their 26 fixtures this season and have just one victory from their past 12.\nMillwall head coach Alex Neil:\n\"Ultimately the game got decided on a cross that hit one of our lads' heels and deflects in at the front post, and it ends up being the winning goal.\n\"From that perspective, it's really, really frustrating because if you get done with a bit of quality or if you get done by them performing better and creating numerous opportunities to comfortably win the game, you go 'OK, we need to be better.'\n\"But it was a scrappy game decided on an unfortunate moment for us, in my opinion.\n\"We're stretched at the top end of the pitch – I think anybody can see that.\n\"We've just sold Romain (Esse) for a lot of money, we've got Femi [Azeez] who's currently not available for us just now. We've got Calum Scanlon who's literally trained for one week, and he's a left-back and I've got him playing left wing, so it's not easy.\"\nHull boss Ruben Selles told BBC Radio Humberside:\n\"It's difficult always to come here and try to perform. We had some phases that we controlled the game and created situations when we should go in front.\n\"There were some situations where we didn't find the pass and ended up being under pressure, but overall I think it was a good performance.\n\"My team showed they can play in defensive scenarios and still be powerful, aggressive and win football matches.\n\"With the goal, Regan is a fantastic ball carrier, he attacked the space and we were in the situation where we had a runner at the first post, runner at the back post, another runner arriving, and every ball there either we'll score or it's very difficult to defend, and it went in.\"", "url": "https://www.bbc.com/sport/football/live/cpdxvjennxdt"}