{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:41:05", "date_modify": "2025-04-26 06:41:05", "date_publish": "2025-03-02 12:59:24", "description": "Killie fan views: 'Reality is here, we are fighting for survival'", "filename": "sport_articles_cvg7k3e072ko_1745649665.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3ef4/live/8eb4bd40-f762-11ef-9e61-71ee71f26eb1.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cvg7k3e072ko_1745649665.html", "title": "'Reality is here, we are fighting for survival'", "title_page": "Killie fan views: 'Reality is here, we are fighting for survival' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "We asked for your views on Kilmarnock's 1-0 defeat against Ross County.\nHere's what some of you said:\nScott: A depressingly predictable outcome and another away day that was a waste of time and money. I've generally been a supporter of Derek McInnes but our away record since he took over is a disgrace. Our travelling supporters deserve better. Right now I'd be delighted to finish 10th but hate saying that after last season.\nJames: Very disappointing but we have to be more clinical in front of goal. Their goalkeeper was man of the match so we just need a little bit of luck. A fluke goal has cost us and you can't legislate for that. Just when we're getting our injured players back, Kyle Magennis suffers another injury. Hopefully not too serious.\nRobert: Dreadful week, I would be more concerned about the top 10 than top six. The annoying thing is these players are capable of being much better like the way they started on Wednesday.\nAlastair: I don't blame McInnes for that display, rather the players who just were not there. Too often we look bright at the start and rapidly go down in a downward trend. People may say change manager but I would rather change players. We knew this season we would be in the bottom half but to perform like that only confirms it.\nJohn: I'm a season ticket holder at Rugby Park and I am hoping that they can stay in the top division. Two away wins all season is just not good enough.", "url": "https://www.bbc.co.uk/sport/articles/cvg7k3e072ko"}