{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:30:13", "date_modify": "2025-04-26 04:30:13", "date_publish": "2025-03-03 00:00:00", "description": "All the latest football news and reaction as Manchester United are knocked out of the FA Cup by Fulham and Manchester City are drawn away to Bournemouth in the quarter-finals.", "filename": "sport_football_live_c4g0e2jv827t_1745641813.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/bc5f/live/4eb90a10-f826-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_c4g0e2jv827t_1745641813.html", "title": "Football latest: Champions League last-16 build-up & your views on new eight-second timer law", "title_page": "Football latest: Champions League last-16 build-up & your views on new eight-second timer law - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Goodbye\nAnd this is where the bus stops for Monday's live page.\nThanks for your company, folks. Come back later on for live text and radio commentary of Nottingham Forest v Ipswich Town in the fifth round of the FA Cup.\nWe'll leave you with some of the stories making the headlines today:\nFulham condemn 'abhorrent' Bassey abuse\nRooney calls Amorim 'naive' for saying Man Utd want Premier League title\nArgentina call up Spurs' Romero for World Cup qualifiers\nBlatter and Platini back in court in Swiss Fifa fraud case\n'Ferguson already taking dreadful Rangers backwards'\nChasm between culture at Celtic and Rangers - Lennon\nSee you again bright and early on Tuesday.\n'Can we get a new name on the cup?'\nCharlie Austin\nFormer Southampton striker on 5 Live\nIf we look around at the teams that are still in - yes Manchester City are still in it - but ultimately, for the others, I'm like 'go on'. In any of those dressing rooms they have to be thinking we can win the FA Cup here; two or three games away from being in the final and that's what we needed. It's brilliant.\nBrighton have a massive chance. Fulham have a massive chance. These teams have massive chances and it's what I think football needed more than anything.\nThe big hitters are out. Yes, Manchester City are still in it, but can we get a new name on the cup.\nTeam news: Hutchinson unavailable for Ipswich\nNottingham Forest v Ipswich Town (Mon, 19:30 GMT)\nIpswich Town\nIpswich manager Keiran McKenna has recently confirmed in a news conference that Omari Hutchinson, who suffered a knee injury against Manchester United will not be available for tonight's game.\nIt is also not clear whether Kalvin Phillips will be playing some part in the game as he is \"progressing well\" but McKenna is \"not sure when he will be back\", saying the midfielder is a \"day-by-day case\".\nIt is however \"possible\" for goalkeeper Arijanet Muric to make a return.\n\"He's carrying a bit of an issue in his shoulder but he's managing\", said McKenna.\n\"I'll have to get some sort of judgments on that and see where he is from a medical point of view but it's certainly a possibility he will play.\"\n'We are going to need all the players' - Nuno\nNottingham Forest v Ipswich Town (19:30 GMT)\nNottingham Forest\nNottingham Forest boss Nuno Espirito Santo says he will need all of his squad between now and the end of the season if they are to qualify for Europe.\nForest are third in the Premier League but are being chased down by reigning champions Manchester City and Chelsea in fifth.\n\"We are going to need all of the players,\" said Nuno. \"Nobody should disconnect and we try to make sure that everybody is involved.\n\"There's no other way. Players must be patient, responsible and respectful for who's playing.\"\nThat includes Monday's FA Cup fifth-round tie at home against Ipswich Town, in which Matz Sels is expected to return to the line-up following Carlos Miguel's injury.\nExperienced goalkeeper Wayne Hennessey is not \"the best decision\" added Nuno.\n\"I think Matz should start again. It's very difficult for a goalkeeper to come into the team. Wayne [Hennessey] is doing a fantastic job but he got injured last season so it's about getting him back.\"\nFollowing Monday's game, Forest host City in a game which could have big consequences in the battle for Champions League qualification.\nCunha and Wolves face anxious FA wait\nBournemouth 1-1 Wolves (Bournemouth win 5-4 on pens)\nNick Mashiter\nBBC Sport football news reporter\nWolves' Matheus Cunha is facing an anxious wait to discover if he will be charged by the Football Association after his red card at Bournemouth - which could have a huge impact on the relegation battle.\nThe FA could now issue a further charge following Cunha's refusal to leave the field.\nIt has until the end of Wednesday to issue Wolves with a charge, with the club having a further three business days to respond.\nAnother three business days is given for the FA to reply with a hearing held no later than 10 business days after their final response.\nCunha is already suspended for Wolves' games against Everton, Southampton and West Ham. A one-game extension to the ban would see him miss the crucial trip to relegation rivals Ipswich on 5 April.\nWolves are 17th, five points above the third bottom Tractor Boys.\nCunha was suspended for two games in January after clashing with a member of Ipswich's security and grabbing his glasses from his face following the visitors' 2-1 win at Molineux in December.\nThat is not expected to be a mitigating factor in any further ban if the Brazil international is charged.\nSupercomputer predicts Liverpool to win Champions League\nWith the last-16 action in the Champions League slated to get under way this week, we take a look who the Opta supercomputer is predicting to win the competition this season.\nAfter simulating the remainder of the knockout stages 10,000 times to analyse each side’s probability of reaching each stage in the competition, it has predicted the Reds to emerge as the champions of Europe for the seventh time.\nOpta gives Arne Slot's side a 19.2% chance of winning the Champions League while Barcelona are second with a 14.8% chance. Inter are not too far behind in third and are 14% likely to secure the silverware.\nArsenal are fourth with a 11.6% chance with Real Madrid and PSG following suit at 9.8% and 9.5% respectively.\nAston Villa are placed 12th with only a 0.9% chance of repeating their 1981-82 feat.\nMings trains for Villa ahead of Brugge tie\nClub Brugge v Aston Villa (Tue, 17:45 GMT)\nAston Villa\nAfter missing their FA Cup win against Cardiff City, Tyrone Mings was spotted back in training today for Aston Villa ahead of their Champions League last-16 first leg against Club Brugge.\nIt will be a huge boost for Villa boss Unai Emery, who also had defenders Matty Cash and Pau Torres back training in Birmingham before they made the trip to Belgium.\nTorres has been out since suffering a metatarsal injury against Brighton in December while Cash also didn't make the squad for their FA Cup fifth-round victory.\nMidfielder Boubacar Kamara, who returned to the bench against the Bluebirds, could also feature against Brugge but Amadou Onana remains a doubt.\nEmery, who will be also without the unregistered Donyell Malen and Andres Garcia, is expected to speak to the media later today and provide more updates ahead of Tuesday's knockout tie.\n'Already foresee arguments about the consistency'\nAlistair Bruce-Ball\nCommentator on BBC Radio 5 Live\nOne thing’s for certain is that goalkeepers would be wise not to hang onto the ball against Arsenal next season given their prowess from corners.\nAnything that prevents players from time-wasting is obviously to be applauded but I can already foresee arguments about the consistency in the application of this law.\nI also wonder if it’s something the referees will be very hot on in the first couple of weeks before it gets forgotten, not deliberately but subconsciously, and the time allowed starts slipping.\nI’m not sure I would point the finger at any goalkeeper in particular who’s going to have to watch themselves, they are all pretty canny operators when they need to be, but I would also like to see the officials clamp down on the obvious time-wasting over goal kicks which goes hand-in-hand with this.\nGuardiola's ball criticism - what do the numbers say?\nHas Pep Guardiola got a point when it comes to his criticism of the ball used in the FA Cup?\nManchester City's three goals in Saturday's FA Cup game came from 29 shots, of which nine were on target.\nIn comparison, in their 4-0 Premier League win over Newcastle United on 15 February, Guardiola's side had seven shots on target from just 11 attempts.\nThey had 16 shots of which five were on target in their 2-0 defeat to Liverpool while they had the same number on target from 12 attempts in the 1-0 win at Tottenham last week.\nAlso, in the weekend's FA Cup action, several Premier League sides recorded a higher percentage of shots on target than in their previous league matches, including Aston Villa, Crystal Palace, Newcastle, Bournemouth, Wolves and Newcastle.\nWhat balls are used in different competitions?\nDifferent competitions in England have different official ball suppliers.\nNike has supplied the Premier League match ball since the 2000-2001 season, though Puma will take over from next season ending Nike's 25-year run.\nNike also has the Women's Super League contract.\nPuma provide the match ball for all EFL competitions - including the Championship and Carabao Cup - while Mitre do likewise for the FA Cup.\nUefa announced last year that Adidas would supply the Champions League match balls until at least 2027, extending a partnership that began back in 2001.\n'It's tricky as these balls fly a lot' - Arteta\nPep Guardiola is not the first manager to criticise the balls used in the cup competitions in England this season.\nArsenal boss Mikel Arteta had criticised the Puma ball used in the Carabao Cup after they were beaten 2-0 by Newcastle in the semi-final first leg last month.\nThe Gunners had 23 shots during that defeat but just three were on target.\n\"We kicked a lot of balls over the bar, and it's tricky that these balls fly a lot,\" he said.\nJust like the FA this week, the EFL had said at the time that the balls complied with Fifa's highest standards and were successfully used in other major European leagues, including Italy's Serie A and Spain's La Liga.\nHow did the FA respond to Guardiola's criticism?\nThe Football Association responded to Pep Guardiola's criticism saying that the balls used in the FA Cup meets the standards set by Fifa.\n\"Mitre's Ultimax Pro ball - used in the Emirates FA Cup and all other FA competitions - has been tested in accordance with Fifa testing,\" an FA spokesperson said.\n\"All footballs in the professional game are required to meet the Fifa Quality pro accreditation, and this ball delivers against all of the testing requirements.\n\"Alongside Mitre, we understand that preference is subjective, but we're confident that the ball performs well. With over 350 goals scored in the knockout competition so far, it provides an exciting element to such a competitive tournament.\"\nGuardiola criticises FA Cup ball after 20 shots off target\nMan City 3-1 Plymouth\nManchester City boss Pep Guardiola blamed the balls used in the FA Cup after his side came back from behind to beat Plymouth Argyle.\nCity had 20 shots off target in the match and only nine on target in their 3-1 win at Etihad Stadium.\nGuardiola said he was not happy with the Mitre balls used in the FA Cup.\n\"The ball in the Champions League is exceptional, the ball in the Premier League is exceptional, this one isn't,\" he said after the game.\n\"It's difficult to control. When you lose, it [sounds like] you're complaining, but the ball is not right. In many years it's happened in the FA Cup and Carabao Cup, I know it's a business and they come to agreements.\n\"You know how many shots went over? Look at other games. Normally the ball goes inside from these shots.\"\nWhat's happening in the Champions League this week?\nChampions League\nThree English clubs are in action in the Champions League as the last-16 first legs will be held across Europe on Tuesday and Wednesday.\nAston Villa will make a trip to Belgium to face Club Brugge tomorrow (kick-off at 17:45 GMT) followed by Arsenal taking on PSV in Eindhoven (20:00).\nLiverpool will also head across the Channel to face Paris St-Germain on Wednesday (20:00).\nElsewhere in Europe, Real Madrid and Atletico Madrid meet in a monumental clash at Santiago Bernabeu on Tuesday.\nTuesday, 4 March 2025\nClub Brugge v Aston Villa (17:45 GMT)\nBorussia Dortmund v Lille (20:00)\nPSV v Arsenal (20:00)\nReal Madrid v Atletico Madrid (20:00)\nWednesday, 5 March 2025\nFeyenoord v Inter Milan (17:45)\nBayern Munich v Bayer Leverkusen (20:00)\nBenfica v Barcelona (20:00)\nPSG v Liverpool (20:00)", "url": "https://www.bbc.co.uk/sport/football/live/c4g0e2jv827t"}