{"authors": ["Iain Carter", "www.facebook.com"], "date_download": "2025-05-21 06:16:26", "date_modify": "2025-05-21 06:16:26", "date_publish": "2025-03-31 09:17:58", "description": "Rory McIlroy and Scottie Scheffler are among the favourites to win the Masters but this week's LIV event in Miami could provide some pointers to who may challenge, writes Iain Carter.", "filename": "sport_golf_articles_c77nl26pp21o_1747808186.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d8d1/live/ac629c00-0e0e-11f0-90cb-6de76cd8d1c0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_golf_articles_c77nl26pp21o_1747808186.html", "title": "Are LIV dozen biggest threat to McIlroy's Augusta ambitions?", "title_page": "Are LIV dozen biggest threat to McIlroy's Augusta ambitions? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "How big is the threat posed to Rory McIlroy's quest for the career Grand Slam by the leading lights of the LIV Golf League?\nIf Scottie Scheffler does not win the upcoming Masters for the third time in four years, who else could deny the Northern Irishman the title he most craves?\nThere is an argument to say, if it is not another Scheffler success or Rory glory, then it could easily be LIV celebrating at Augusta. There will be 12 members of the breakaway tour competing at the first major of the year.\nScheffler demonstrated his finest golf of the year in Houston last week, where the world number one fired a second-round 62 en route to finishing second to Min Woo Lee at 19 under par.\nIn the same Texas tournament, McIlroy completed what have proven highly promising competitive preparations for the one major to elude him.\nHe did not add to his two PGA Tour wins in 2025, but collected a pair of weekend 64s to finish fifth.\nWith those four competitive rounds in Houston and another high finish banked, McIlroy looks well primed for what will be his 11th attempt at joining Tiger Woods, Jack Nicklaus, Gary Player, Ben Hogan and Gene Sarazen in achieving the 'Slam'.\nAs the 35-year-old now nurses a sore elbow and fine tunes preparations away from public eyes, LIV's top stars this week compete on the circuit's toughest course.\nAmong them is Bryson DeChambeau, who overhauled a stuttering McIlroy to win last June's US Open.\nThose LIV contenders, who also include Jon Rahm, Brooks Koepka, Tyrrell Hatton and Joaquin Niemann, will be desperate to disprove a widely held theory that the limited field 54-hole shotgun start team format played on LIV is detrimental to major chances.\nRahm was still a PGA Tour player when he won the 2023 Masters and believed his move to LIV could prove a catalyst for some form of reunification in men's professional golf.\nBut as that wait continues, the Spaniard needs to show he can still hit heights that brought him that second major crown two years ago.\nRahm, last year's LIV individual champion, has not won any of their four tournaments so far in 2025 but is second behind Niemann in the overall standings. The 30-year-old has finished top six in every event since being runner-up at February's season opener in Riyadh.\nBut he is frustrated and requires an improvement in his scoring shots. \"I have not played my best,\" he recently admitted. \"I haven't felt as comfortable as I would like and it's shown in my wedge game.\n\"If you want to contend and win and especially win majors, you need that part of your game.\"\nSo his accuracy from 150 yards and in will be worth noting when LIV play this week at Doral. Donald Trump's demanding and proven Miami test looks the sort of warm-up the breakaway circuit's Augusta candidates require.\n\"Basically all the things that make a golf course hard are right here,\" commented 2022 Open champion Cameron Smith, another potential LIV threat at Augusta.\nTwelve months ago DeChambeau finished seven under par at Doral to tie for seventh, before shooting 65-73 to share the halfway lead of the Masters. He went on to tie for sixth, his best Augusta performance to date.\nIt was a display that laid the foundations for taking runner-up spoils at the following month's US PGA Championship and then prevailing at Pinehurst to inflict McIlroy's most painful defeat.\nThis year, though, the big-hitting American has only posted one top 10 on LIV. This, therefore, becomes an important week for DeChambeau to find form.\nKoepka, who is the only other golfer to win a major while playing the LIV schedule - the 2023 US PGA - has long enjoyed a reputation for reserving his best form for grand slam events.\nThe five times major champion struggles for motivation in bog-standard tournaments. But there are signs that Koepka is stirring after finishing second at LIV's most recent tournament in Singapore.\nSurprisingly, he failed to crack the top 25 in last year's majors, but he held the 54-hole lead at Augusta in 2023 before shooting 75 to lose to Rahm by four shots. It would not be a surprise to see him contend again this year.\nAccording to three-time Augusta champion Phil Mickelson, Niemann is playing the best golf in the world at the moment. McIlroy, having won at Pebble Beach and last month's Players, should certainly beg to differ on that seemingly mischievous assertion.\nBut there is no doubting the Chilean's qualities. He won in Singapore by five shots and in Adelaide by three after celebrating victory at the Saudi International at the end of last year.\nThe 26-year-old was also third in another Asian Tour event in India in February. \"I feel like I've got an extra year of experience playing against the best players in the world,\" Niemann said.\n\"And I'm winning quite a lot in the last year. Yeah, I feel like a different player.\"\nThat he has never posted a major top 10 - his 16th place at the 2023 Masters is his best finish in the big four championships - looks increasingly illogical.\nHatton will be keen to rediscover excellent early season form in Florida this week because the Englishman has been largely off the boil since winning the Dubai Desert Classic in January.\nThere is an encouraging form line for Europeans who have won that prestigious tournament, with Danny Willett (2016) and Sergio Garcia (2017) both triumphing in the United Arab Emirates as a precursor to having the Green Jacket draped on their shoulders.\nBut Hatton has not featured at any LIV event in 2025 and looks in need of a confidence boost as he tries to better his finest Augusta result so far, which was a share of ninth last year.\nThe 33-year-old remains in the world's top 20, no mean feat while playing a circuit that does not receive world ranking points. And he undoubtedly possesses attributes to contend at Augusta, if he can keep his notorious temper in check.\nSo, the next step in finding form to take into the year's initial major is at Doral this week.\nAnd in the wider golfing context, this feels like LIV's most significant tournament of the year. Play well at Doral and top stars are entitled to feel they can compete anywhere - even if it is a considerably flatter layout than the home of the Masters.\nAn encouraging week would bolster credentials to be genuine threats when they arrive at Augusta National.\nYou do not have to be a LIV fan - and McIlroy certainly isn't one of those - to be interested in what happens when the Miami tournament begins on Friday.", "url": "https://www.bbc.com/sport/golf/articles/c77nl26pp21o"}