{"authors": ["Gareth Griffiths", "www.facebook.com"], "date_download": "2025-05-21 04:59:09", "date_modify": "2025-05-21 04:59:09", "date_publish": "2025-04-04 12:00:11", "description": "Ospreys gain revenge over local rivals Scarlets to set up a European Challenge Cup home quarter-final against Lyon next Saturday.", "filename": "sport_rugby-union_articles_cdxgvdj54v4o_1747803549.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a902/live/06cc7d60-130e-11f0-bb1f-752fc4c9ccf8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cdxgvdj54v4o_1747803549.html", "title": "European Challenge Cup: Ospreys beat Scarlets 36-14 to set up Lyon quarter-final", "title_page": "European Challenge Cup: Ospreys beat Scarlets 36-14 to set up Lyon quarter-final - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ospreys gained revenge over local rivals Scarlets to set up a European Challenge Cup home quarter-final against Lyon next Saturday.\nMark Jones' side lost 38-22 in Llanelli in the United Rugby Championship (URC) last weekend, but they avenged that defeat in the last 16 of Europe's second-tier tournament with a convincing six-try display in Swansea.\nWith half-backs Reuben-Morgan Williams and Dan Edwards orchestrating matters, tries from Adam Beard, Jac Morgan, Rhys Davies, Dewi Lake, Jack Walsh and Daniel Kasende overwhelmed Scarlets in this all-Welsh knockout affair.\nScarlets could only respond with tries from Wales duo Blair Murray and Eddie James, with Dwayne Peel's side now left to attempt to reach the URC play-offs.\nOspreys will face Lyon on Saturday, 12 April in Swansea for a place in a Challenge Cup semi-final against Racing 92 or Connacht.\nScarlets boss Dwayne Peel made two tweaks to his side as hooker Ryan Elias and lock Jac Price came in for Marnus van der Merwe and Alex Craig.\nIn contrast, Ospreys head coach Jones, who rested personnel last time out, rang the changes.\nFull-back Walsh, wings Kasende and Keelan Giles, centre Keiran Williams and scrum-half Morgan-Williams came in, while Wales hooker Lake returned to the Ospreys pack for his first start since mid December.\nProp Tom Botha and lock Davies were also promoted from the bench, with flanker Justin Tipuric returning after recovering from a back problem.\nThe overhaul appeared to have worked as Ospreys made a storming start with a second-minute try created by Morgan, Walsh and Davies and powerfully finished by Beard.\nEdwards converted and made a brilliant break to create the second score for captain Morgan.\nOspreys had led the Welsh derby 17-0 after 15 minutes in Llanelli, but on that occasion the home side stormed back with six tries to record their first win in this derby since January 2022.\nThis time Scarlets initially responded with captain Josh Macleod gaining a turnover penalty before fancy footwork from Macs Page created the opportunity for Murray to scamper over. Ioan Lloyd converted.\nHowever, Ospreys were not to make the same mistakes on consecutive weekends.\nThere had been some pre-match needle, with Ospreys prop Gareth Thomas admitting his side had been riled by comments made by Scarlets number eight Taine Plumtree who said Scarlets would show their rivals \"no respect\".\nTipuric and Vaea Fifita exchanged pleasantries before Henry Thomas and Morgan Morris squared up to each other.\nThe hosts were rampant. Wing Giles was denied on a couple of occasions before prop Thomas was held up by the Scarlets defence over the visitors' line.\nSuch incessant pressure told, with lock Davies charging over before Lake was driven over for Ospreys' fourth try as the home side led 26-7 at half-time.\nScarlets were looking for inspiration and made three forward changes at the interval with Van der Merwe, Craig and Sam Wainwright coming on.\nHooker Van der Merwe made an immediate impression with a trademark turnover before he was held up over the Ospreys line.\nThe home side weathered the storm and a breakaway was finished off by Walsh who slipped through two attempted tackles.\nThat took the wind out of Scarlets' sails and Kasende crossed for the sixth score. Scarlets gained a late consolation try through Wales centre James.\nOn an almost idyllic Sunday evening in Swansea, Ospreys lost influential Morgan-Williams to a head injury which means he could be a quarter-final doubt with the six-day turnaround, although Kieran Hardy could return.\nOspreys head coach Mark Jones: \"I was very pleased with how we put the learnings from last week into action this week in that first half. We were very good.\n\"But I'm disappointed with the second half. There was a lack of execution and intent and if we want to progress in this tournament and reach a semi-final, then we need to play for the full 80 minutes.\n\"The exciting thing is we have won and there is still plenty to work on.\"\nScarlets head coach Dwayne Peel: \"They deserved that victory. We're disappointed on our side, we thought we could put them under a bit of pressure but they started on fire scoring two early tries.\n\"The second-half I thought we needed to start strong early, but it wasn't to be. The positives for us is the way we kept battling.\n\"We've got the Dragons in two weeks, a lot of the players wouldn't have had a rest from the Six Nations, so it'll be nice to have a week to resettle before playing again.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/cdxgvdj54v4o"}