{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:30:00", "date_modify": "2025-05-21 06:30:00", "date_publish": "2025-01-31 11:13:06", "description": "Nottingham Forest podcast: Shut Up And Show More Football on end of transfer window", "filename": "sport_football_articles_c93lw874p5ko_1747809000.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1740/live/c6134cd0-dfab-11ef-a319-fb4e7360c4ec.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c93lw874p5ko_1747809000.html", "title": "Nottingham Forest podcast: Shut Up And Show More Football on end of transfer window", "title_page": "Nottingham Forest podcast: Shut Up And Show More Football on end of transfer window - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "BBC Radio Nottingham's Colin Fray expects a quiet end to the transfer window and, according to Nuno Espirito Santo, any player that joins needs to be \"special.\"\nSpeaking on the latest Shut Up And Show More Football podcast, Colin said the Forest boss would be content if there are no new arrivals at the City Ground:\n\"Nuno seems very happy with it being very quiet - he's been talking all window long about the priority being to keep his group together and to stave off bids. The new contracts have helped to do that during January.\n\"He's certainly publicly very calm about the situation. He wants it over, as all managers do at this stage. He's ready for the end of the window - and he's not publicly seeming desperate to add to the squad.\"\n\"They need to be 'special' players because they have to be the right character to not upset what's been a very good dressing room.\n\"They have to better than the levels already there so they can push the players. That then becomes expensive and there's potential PSR [profit and sustainability rule] issues going forward. I think that's why generally the window has been very quiet.\n\"I'm not expecting anything like the normal flurry towards the end of the window - but I am conscious we've said that before.. and it's turned into anything but.\"", "url": "https://www.bbc.com/sport/football/articles/c93lw874p5ko"}