{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:00:08", "date_modify": "2025-05-20 12:00:08", "date_publish": "2023-08-06 06:03:31", "description": "Four-time Olympic champion Simone Biles wins the US Classic as she makes a triumphant return to gymnastics after a two-year break.", "filename": "sport_gymnastics_66420361_1747742408.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/10FA1/production/_130673596_gettyimages-1596913408.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_gymnastics_66420361_1747742408.html", "title": "Simone Biles makes winning return in US Classic after two-year break", "title_page": "Simone Biles makes winning return in US Classic after two-year break - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Four-time Olympic champion Simone Biles has made a triumphant return to gymnastics after a two-year break.\nThe 26-year-old American thrilled the Chicago crowd with a stunning display to win the US Classic in her first event since the Tokyo Olympics.\nBiles announced in 2021 she was taking a break to work on her mental health.\n\"Everyone that was cheering - made posters, all of that in the crowd - it just made my heart melt that they still believe in me,\" Biles said.\n\"It means the world because after everything that transpired in Tokyo, I worked on myself a lot.\n\"I still do therapy weekly and it has just been so exciting to come out here and have the confidence I had before.\nBiles was given a rapturous reception at the Now Arena in Hoffman Estates, Illinois, and won with an all-around score of 59.100 points.\n\"Everything has fallen into place. I feel really good about where I am now mentally and physically,\" she said.\n\"I still think there are some things to work on in my routine but, for the first meet back, I would say it went pretty well. I'm very shocked and surprised. I'm very happy now that it is out of the way.\"\nShe began on the uneven bars, where her score of 14.000 points was the third-best overall before claiming the meet's top score on the balance beam with 14.800.\nBiles drew cheers during and after every tumbling run on the floor exercise, her flips and landings bringing roars that were rewarded with a top score of 14.900 points.\nShe finished on vault, soaring high to notch another leading mark of 15.400.\nLeanne Wong, 19, finished second, five points off the pace on 54.100, with 17-year-old Joscelyn Roberson third on 54.050.\nIt was Biles' first competition since pulling out of five of her six finals at the delayed Tokyo Games in 2021.\nShe later explained she had been suffering from the 'twisties' - a mental block where gymnasts can lose their sense of space in the air.\nBiles has yet to indicate whether she will aim to make next year's Olympics in Paris.\nShe has qualified for the US national championships, which start on 24 August, and is hoping to compete for a world title in Antwerp in October.\n\"I always kind of knew [I'd return] as soon as everything happened in Tokyo,\" she said. \"This time I'm doing it for me.\n\"I worked a lot on myself and I believe in myself a little bit more. It's just coming back out here and starting those first steps again.\"", "url": "https://www.bbc.com/sport/gymnastics/66420361"}