{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:51:27", "date_modify": "2025-05-21 06:51:27", "date_publish": "2025-03-29 21:57:09", "description": "George Horne becomes Glasgow Warriors' all-time top try-scorer as they reclaim second place in the URC with a 42-0 win over the visiting Lions.", "filename": "sport_rugby-union_articles_ce84d1544jyo_1747810287.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0098/live/59359a40-0ce3-11f0-ae5b-bf3834356f20.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_ce84d1544jyo_1747810287.html", "title": "Glasgow Warriors' George Horne creates try record in 42-0 win over Lions", "title_page": "Glasgow Warriors' George Horne creates try record in 42-0 win over Lions - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "George Horne became Glasgow Warriors' all-time top try-scorer as the hosts reclaimed second place in the United Rugby Championship with a six-try, bonus-point win over the Johannesburg Lions.\nThe 29-year-old scrum-half's 55th try, overtaking DTH van der Merwe, was one of six in a dominant first half at Scotstoun.\nThey failed to add to that, playing against the wind after the break as Lions left Scotland without a single point to remain third from the bottom of the table.\nGlasgow had been forced into a pre-match change when Jack Mann was withdrawn from the line-up, with Henco Venter stepping in at number eight.\nVenter was involved as Warriors moved in front after just five minutes, one of several willing carriers who took the ball close to the line before Nathan McBeth finally crossed.\nThe windy conditions made it difficult for both sides but Glasgow were clearly coping better and soon landed their second try.\nHorne was the creator with quick ball from the ruck, setting up Jamie Dobie, who dived over from close range.\nDobie thought he had scored again after taking a whipped pass from Adam Hastings and diving over in the corner but the Lions had men across to defend and the TMO's decision was no try.\nDobie would not be denied for long, however, as Warriors underlined their dominance with a third score.\nHastings played the pass but the rest was down to the Glasgow wing who stepped inside a gap, fended off two attempted tackles and sped over the line.\nIt was one-way traffic at this point and it was Horne who landed the bonus point with Glasgow's fourth try after taking a pass from Dobie, making history in the process.\nWarriors were soon celebrating a fifth try, Hastings throwing a dummy then easing through a gap to score.\nLions were then reduced to 14 men for 10 minutes when scrum-half Nico Steyn was shown a yellow card for a team offence and Glasgow took advantage when Grant Stewart burrowed over from close range.\nThe second half was a scoreless affair but the damage had all been done in the first half with Glasgow eight points behind Leinster and four clear of the Bulls in the race for play-off places.", "url": "https://www.bbc.com/sport/rugby-union/articles/ce84d1544jyo"}