{"authors": ["Brian McLauchlin", "www.facebook.com"], "date_download": "2025-05-21 05:37:32", "date_modify": "2025-05-21 05:37:32", "date_publish": "2025-01-31 16:35:55", "description": "Steinwender and Kartum available for Dundee game - Critchley", "filename": "sport_articles_cg5ym4pn44do_1747805852.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/03c5/live/e4480080-dfea-11ef-be6c-9f3ec92972af.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cg5ym4pn44do_1747805852.html", "title": "Steinwender and Kartum available for Dundee game", "title_page": "Steinwender and Kartum available for Dundee game - Critchley - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "New signings Michael Steinwender and Sander Kartum have already shown their quality in training and could make their Hearts debuts on Saturday despite a lack of recent action, says boss Neil Critchley.\nDefender Steinwender and midfielder Kartum, who both played in Scandinavia prior to arriving in Gorgie, finished their seasons before Christmas and haven't played competitively in a few weeks.\n\"They're closer [to playing], that's a decision I have to make this afternoon,\" the head coach said before Saturday's trip to face Dundee. \"They've trained all week, they look better every day.\n\"We've done some testing with them as well, physically, to see where they're at. It's now just getting that decision right or that balance right of, are they ready?\n\"Are they ready to start? Do they come in off the bench? And Michael's situation is probably different than Sander's, just because of positionally.\n\"I think they're going to make a big difference to us. I know we've not seen Michael and Sander yet, but you can see their quality in training.\n\"I'm confident that in time they'll prove they're good players for us. And we'll see what happens in the next 72 hours.\"\nSteinwender looks more likely to play, given the hamstring injury suffered by Craig Halkett that will rule the former Livingston defender out for the foreseeable.\nCritchley has more midfield options available, though, and Calem Nieuwenhof is seeking a return after 11 months out with injury.\n\"We had a game last week at the back here behind closed doors,\" Critchley said. \"He played for 70 minutes and did very well so Calem is in contention, yes.\n\"Obviously he's got to be very careful because he's been out for so long. He's been training now for a number of weeks, full training.\n\"He's proved his fitness in that. Psychologically, because of how long he has been out, it's been important for him to gain more confidence in his body. When we push him and put that little bit of extra demand on his body, he's not going to break down.\"", "url": "https://www.bbc.com/sport/articles/cg5ym4pn44do"}