{"authors": ["Emma Smith", "www.facebook.com"], "date_download": "2025-05-20 13:03:25", "date_modify": "2025-05-20 13:03:25", "date_publish": "2023-08-01 09:28:18", "description": "Brazil legend Marta is moved to tears in a news conference before what could be her 23rd and final Women's World Cup match.", "filename": "sport_football_66371581_1747746205.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/622A/production/_130603152_gettyimages-1568239713.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66371581_1747746205.html", "title": "Women's World Cup 2023: Brazil legend Marta tears up when discussing her legacy", "title_page": "Women's World Cup 2023: Brazil legend Marta tears up when discussing her legacy - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Brazil legend Marta was moved to tears in a news conference before what could be her 23rd and final Women's World Cup match.\nBrazil must beat Jamaica to guarantee they avoid elimination from Group F.\nThe 37-year-old was visibly emotional when asked about her legacy in the game, having already confirmed this will be her final World Cup.\n\"People stop me, parents say to me, 'My daughter adores you, she wants to be just like you',\" she said.\n\"You know what's good? When I started there were no idols in women's football,\" she said.\n\"How could there be if you didn't show women's football? How could I understand that I would reach the national team and become a reference point?\n\"Twenty years ago, nobody knew who Marta was at my first World Cup. Twenty years later, we have become a reference for many women all over the world, not only in football.\n\"We see many women journalists here today and we didn't see that before so we have opened doors for equality.\n\"I hope I answered your question after you made me cry.\"\nMarta is the all-time leading goal-scorer in World Cups, men's or women's, and if she adds to her tally of 17 she will be the first footballer in history to score at six World Cups.\nShe has come off the bench in Brazil's first two games in Australia - the opening 4-0 win over Panama, then the 2-1 loss to France in Brisbane.\nIt means Brazil sit third in Group F and will be eliminated if they do not beat Jamaica, who they trail by a point, unless France suffer a shock loss to Panama.\n\"We are going to do our best to keep focused and confident,\" Marta said at Melbourne Rectangular Stadium. \"Tomorrow's a decider and we don't want to go home.\"\nBrazil have never won the Women's World Cup, coming closest in 2007 when - featuring Marta - they reached the final but lost 2-0 to Germany.", "url": "https://www.bbc.com/sport/football/66371581"}