{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:59:47", "date_modify": "2025-05-20 13:59:47", "date_publish": "2023-07-31 07:08:56", "description": "Rangers midfielder Glen Kamara is training alone with transfer talks ongoing, Celtic target Tete to make decision, plus more.", "filename": "sport_football_66358193_1747749587.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/16A25/production/_130590729_-c44e5220-ec7c-4df6-b6b6-1316e34dcca1.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66358193_1747749587.html", "title": "Scottish gossip: Glen Kamara, Tete, Kieran Tierney, Jack Butland, Kyosuke Tagawa", "title_page": "Scottish gossip: Glen Kamara, Tete, Kieran Tierney, Jack Butland, Kyosuke Tagawa - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Rangers midfielder Glen Kamara is training alone with transfer talks ongoing as manager Michael Beale says \"it's best he's to the side of the group\". (Scottish Sun), external\nTete will make a decision on his future when he returns from his holiday, with Brendan Rodgers keen to bring the Brazilian free agent to Celtic but Fenerbahce leading the race for the winger. (Sabah via Daily Record), external\nChairman Dave Cormack has told Aberdeen fans to expect two new signings very soon - and admits Croatian forward Tonio Teklic was a key target before he signed for Trabzonspor. (Scottish Sun), external\nCeltic target Kieran Tierney is prepared to stay at Arsenal and fight for his place in the team after the Scotland defender had a heart-to-heart with Gunners boss Mikel Arteta. (Football Scotland), external\nJapan striker Kyosuke Tagawa has flown to Edinburgh to complete his move to Heart of Midlothian from FC Tokyo. (Edinburgh Evening News), external\nJack Butland says his eyes have been opened by the size of Rangers and the demands of the support since moving to Ibrox. (The Herald), external\nSt Johnstone manager Steven MacLean admits a catastrophic conclusion to the Viaplay Cup has opened his eyes about who he can count on for the beginning of the Premiership campaign. (Courier), external\nJohnstone Burgh boss Jamie McKim expects former Rangers and Kilmarnock striker Kyle Lafferty to stay at the West of Scotland league club for longer than the two years he has signed for. (Scottish Sun), external", "url": "https://www.bbc.com/sport/football/66358193"}