{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:50:51", "date_modify": "2025-05-20 11:50:51", "date_publish": "2023-07-24 22:00:19", "description": "Man Utd prepare Rasmus Hojlund bid, Inter Milan want Emiliano Martinez, Kylian Mbappe offered £172m salary by Al Hilal, plus more.", "filename": "sport_66267688_1747741851.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3688/production/_130506931_gossip_hojlund_getty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_66267688_1747741851.html", "title": "Tuesday's gossip: Hojlund, Mbappe, Amrabat, Martinez, Kolo Muani, Kudus, Kane, Toure", "title_page": "Tuesday's gossip: Hojlund, Mbappe, Amrabat, Martinez, Kolo Muani, Kudus, Kane, Toure - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester United will make an offer to Atalanta for 20-year-old Denmark striker Rasmus Hojlund this week. (Mail), external\nManchester United will not pay more than £60m for Hojlund, but Atalanta want £86m. (Times - subscription), external\nFiorentina's Morocco midfielder Sofyan Amrabat, 26, has reached an agreement to join Manchester United on a five-year deal. (Nicolo Schira), external\nInter Milan have offered Aston Villa 15m euros (£13m) for Argentina goalkeeper Emiliano Martinez, 30, following Andre Onana's move to Manchester United. (TyC Sports Argentina - in Spanish), external\nManchester United are looking at Eintracht Frankfurt's 24-year-old France striker Randal Kolo Muani, while manager Erik ten Hag is also interested in Ajax's 22-year-old Ghana forward Mohammed Kudus, who has been linked with Chelsea. (Mirror), external\nTen Hag is open to offers for several fringe Manchester United players with funds needed to launch a move for a marquee striker. (Football Insider), external\nTen Hag is looking to reinforce Manchester United's back-up goalkeeping options with the signing of Fenerbahce's 25-year-old Turkey international Altay Bayindir. (Goal), external\nChelsea, Manchester United and Tottenham will be part of a bidding frenzy for France striker Kylian Mbappe, 24, after Paris St-Germain received a world record £259m bid from Saudi Arabian side Al-Hilal.(Telegraph - subscription), external\nAl-Hilal plan to offer Mbappe a net salary worth 200m euros (£172m) a year while allowing him to keep 100% of his image rights (Fabrizio Romano), external.\nIf Mbappe joins Al-Hilal it could only be for a year, with PSG convinced that Real Madrid president Florentino Perez and the player have an agreement in place for him to move to La Liga next year. (Times - subscription), external\nBarcelona have distanced themselves from a move for Mbappe despite claims they held talks with PSG. (Marca - in Spanish), external", "url": "https://www.bbc.com/sport/66267688"}