{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:13:30", "date_modify": "2025-05-21 05:13:30", "date_publish": "2025-04-05 00:00:00", "description": "Ryan Hardie scores twice as Plymouth Argyle beat Norwich City 2-1 to close the Pilgrims' gap to Championship safety.", "filename": "sport_football_live_c5y5wg7qzvxt_1747804410.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e0d2/live/e80e0b10-1230-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c5y5wg7qzvxt_1747804410.html", "title": "Plymouth Argyle 2-1 Norwich City: Ryan Hardie double keeps Pilgrims survival hopes alive", "title_page": "Plymouth Argyle 2-1 Norwich City: Ryan Hardie double keeps Pilgrims survival hopes alive - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ryan Hardie scored twice as Plymouth Argyle beat Norwich City 2-1 to close the Pilgrims' gap to Championship safety.\nThe win - Argyle's second in nine games - saw bottom-of-the-table Plymouth four points from safety with six games to play, but dealt a blow to Norwich's outside hopes of making the play-offs.\nHardie gave the hosts the lead against the run of play as he coolly finished with his left foot past Angus Gunn.\nThe Scot doubled the lead three minutes later as he curled in from 10 yards after a loose ball fell to him in the box.\nJosh Sargent needed just 44 seconds of the second half to pull a goal back as he blasted past Conor Hazard.\nHardie should have completed his hat-trick, but he just failed to connect with an 86th-minute Mustapha Bundu cross from the left.\nBut the Canaries could not find an equaliser as they drop to 11th place, eight points off the final play-off spots.\nJosh Sargent narrowly failed to get on the end of a 12th-minute Ante Crnac pass from the by-line while the recalled Marcelino Nunez blasted straight at Hazard soon after as Norwich started confidently.\nBut with their first proper effort Argyle went ahead - Adam Randell lobbed the ball back towards the Norwich box and Hardie beat the offside trap, controlled well and deftly got his ninth goal of the season.\nIt got even better for Argyle soon after when Hardie put Mustapha Bundu through, the Sierra Leone striker was stopped by two Norwich defenders but the ball squirmed out to Hardie who curled into the bottom right corner.\nHazard had to be alert to palm a Nunez free kick over the bar as the half drew to a close, but he could do little to stop Sargent after the break.\nBorja Sainz cut in from the right, found Kellen Fisher whose floated ball from the left was well controlled by Sargent before the USA striker blasted home.\nNorwich began to take command of the possession, but it was Argyle that could have gone further ahead when Hardie was sent clear by Bundu's 65th-minute through-ball, but his effort was weak as he was forced away from goal.\nHardie should have made the game safe late on but failed to meet Bundu's cross from six yards out, but Norwich could not conjure up an equaliser as they lost for the thrid time in four games.\nPlymouth Argyle head coach Miron Muslic told BBC Radio Devon:\n\"The pressure was on anyway, we knew the importance of the game and we also knew our situation.\n\"We knew we just had to win, and I mentioned in my last speech in the locker room it's about the sacrifice and to give it all, and we have a chance.\n\"It was hard for us to find our way into the game in the first 10 or 15 minutes.\n\"But then you see what momentum means in football - that first goal that was a door-opener for us, that was a big relief, a massive confidence boost inside our team and the Green Army just jumped on this train and gave us this second wave of support.\n\"The first half, after the first goal, was brilliant, maybe one of the best performances in the last couple of weeks.\"\nNorwich City head coach Johannes Hoff Thorup told BBC Radio Norfolk:\n\"It sums up our weakness as a team - and that's to defend all those situations where the ball is brought into the box from the opposition, second ball situations, third ball situations we really, really struggle as a team to defend that.\n\"It tells a bit of a story because up until the first goal we have the control of the game exactly as we want, we created an amount of situations in the box and had a couple of crosses where were very close to getting a foot or head to it.\n\"Then it's probably the first situation around our goal and they score a goal, and that's been the story of the season.\n\"I'm tired that our defensive line cannot keep troubles away.\"", "url": "https://www.bbc.com/sport/football/live/c5y5wg7qzvxt"}