{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:03:00", "date_modify": "2025-05-20 12:03:00", "date_publish": "2023-08-05 13:03:49", "description": "Notts County suffer a chastening return to the English Football League with a drubbing at Sutton United.", "filename": "sport_football_66345831_1747742580.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/10E38/production/_130667196_shutterstock_editorial_14039952e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66345831_1747742580.html", "title": "Sutton United 5-1 Notts County: Magpies thrashed on EFL return", "title_page": "Sutton United 5-1 Notts County: Magpies thrashed on EFL return - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Notts County suffered a chastening return to the EFL with a 5-1 drubbing at Sutton United.\nThe visitors conceded twice and had goalkeeper Aidan Stone sent off inside the first quarter of the game.\nSutton struck the first goal of the League Two season as Joe Kizzi headed in former Magpie Rob Milsom's corner at the far post, and County's afternoon got worse as Scott Kashket pounced on a poor back pass and was brought down by Stone, who was immediately sent off by referee Sam Purkiss.\nMilsom's free-kick went just wide, but substitute goalkeeper Sam Slocombe was soon picking the ball out of his net as Omari Patrick rifled a shot home from Josh Coley's pass.\nU's might have had a third when Kashket's looping header hit the bar.\nHopes of a County comeback in the second half lasted only five minutes as Coley's superb cross was powered home by Patrick's header at the far post, and as Sutton continued to boss the game Craig Eastmond's low shot hit a post.\nJack Rose made one good save from Macaulay Langstaff, but the punishment for County was relentless as Harry Beautyman made it 4-0 from Aiden O'Brien's pass.\nCounty pulled one back when David McGoldrick scored from Langstaff's pass, but any prospect of a nervy end for Sutton fans was ended by Harry Smith's header from Kizzi's cross.", "url": "https://www.bbc.com/sport/football/66345831"}