{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:57:46", "date_modify": "2025-04-26 03:57:46", "date_publish": "2025-03-04 13:40:22", "description": "Cheltenham Town winger Ethan Williams says he is looking forward to playing in front of a big crowd when the Robins visit Bradford City.", "filename": "sport_football_articles_c4g98r8e789o_1745639866.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/eff7/live/ae3d1df0-f8fd-11ef-806b-d7666ddeb600.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c4g98r8e789o_1745639866.html", "title": "Ethan Williams: Cheltenham Town winger excited for Bradford game", "title_page": "Ethan Williams: Cheltenham Town winger excited for Bradford game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Cheltenham winger Ethan Williams says he is looking forward to playing in front of a big crowd when the Robins visit Bradford City on Tuesday.\nManchester United loanee Williams, 19, scored his second goal since arriving in January in Town's 1-1 draw with Grimsby on Saturday.\n\"They're in really good form, as are we, so it should be a really good game,\" Williams told BBC Radio Gloucestershire.\nWilliams is the nephew of former Manchester City goalkeeper Alex Williams and says the support of his family has helped his performances so far.\n\"All of my family and friends are coming to watch so you'll be able to hear them,\" he added.\n\"Obviously its a long journey down from Manchester but they have been coming to watch.\"\nWilliams is expected to start at Valley Parade, where the Bantams have averaged gates of 16,700 during their League Two campaign this season.\nThey have also won nine home games in a row to take them up to second in the table.\n\"It will be good to experience the fans, the crowd, the atmosphere - it is going to be loud. We're all really excited, we're in as good form as we've been in all season,\" he added.\n\"Hopefully we can make a statement, win, or get a point. They're a very good side, they're near the top for a reason, so we have to respect them but go there and play with no fear.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c4g98r8e789o"}