{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:10:20", "date_modify": "2025-05-19 15:10:20", "date_publish": "2015-02-20 18:19:01", "description": "Parma postpone Sunday's Serie A visit of Udinese on safety grounds as their financial problems continue.", "filename": "sport_football_31557813_1747667420.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81139000/jpg/_81139427_parma1_epa.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31557813_1747667420.html", "title": "Cash-strapped Parma \"running out of time\" as match postponed", "title_page": "Cash-strapped Parma \"running out of time\" as match postponed - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Parma have called off, external Sunday's Serie A visit of Udinese on safety grounds as their financial problems continue to threaten the club's future.\nPlayers and staff from the bottom-of-the-table club have not been paid all season and stewarding costs were unable to be met to stage the fixture.\nThe club asked to play the match behind closed doors but the Italian Football Federation has ordered a postponement.\nAlessandro Lucarelli said: \"Time is running out. We need facts, not words.\"\nTraining on Friday was also cancelled with cash levels reported to be below £29,700 at the Stadio Ennio Tardini.\n\"We've had a meeting with the president and what has emerged is the difficulty in bringing the money to Italy,\" captain Lucarelli continued.\n\"He has reiterated that he will try to give us some guarantees in the next 24 hours. But our patience has a limit. We are a united group and we have given the club an ultimatum.\"\nParma have changed hands twice in the last two months.\nDastraso Holdings, a Cyprus-based conglomerate, took control in December and named Ermir Kodra, a 29-year-old Albanian, as president. The club was sold again two weeks ago to Slovenian-based Mapi group.\nGiampietro Manenti, the latest president, said on taking over that he was confident of sorting out the problems.\nThey were deducted a point in December for failing to pay player wages dating back to November 2013. Club president Tommaso Ghirardi and director Pietro Leonardi were also fined £3,951 each.\nParma finished sixth in the table last year, but missed out on the Europa League for not meeting Uefa's club licensing criteria because of unpaid bills.\nThe two-time Uefa Cup winners, who have also won the Coppa Italia three times, are managed by former Italy midfielder Roberto Donadoni, who managed the national side between 2006-2008.", "url": "https://www.bbc.com/sport/football/31557813"}