{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:08:24", "date_modify": "2025-05-21 07:08:24", "date_publish": "2025-01-31 06:48:06", "description": "Declan Devine says his Glentoran side are a different animal to the team that flopped in last season's Irish Cup semi-final against Linfield.", "filename": "sport_football_articles_cp8k9exx5k8o_1747811304.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3887/live/e7b25f40-df27-11ef-bc33-634e87000473.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cp8k9exx5k8o_1747811304.html", "title": "Glentoran v Linfield: Declan Devine says Glens squad's 'DNA' will steel them", "title_page": "Glentoran v Linfield: Declan Devine says Glens squad's 'DNA' will steel them - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Glentoran boss Declan Devine isn't guaranteeing the club's fans victory in Friday's big Irish Cup tie against Linfield but is predicting there will be no repeat of last March's semi-final flop against the Blues.\nDevine's fury after last season's 3-1 defeat was evident but he says this Glens team some 10 months on is a totally different animal.\nHis view is borne out by his side's three wins and a draw in their four contests against Linfield this season even though the Blues are a seemingly out-of-sight 19 points clear at the top of the Irish Premiership table as the Glens sit in second spot.\nSince Glentoran beat Linfield 3-1 at Windsor Park on 4 October, the only other defeats for David Healy's side came at home to Cliftonville on 26 October and at The Oval in late November as the Blues have put together an otherwise superb Premiership run of 12 wins and a draw, with the latter the Boxing Day 0-0 stalemate at the Oval.\n\"Playing in a semi-final and you didn't work anywhere near hard enough to get to an Irish Cup final,\" Glens boss Devine shook his head when questioned about last year's semi-final defeat by his team's Big Two rivals.\n\"And with the possibility to qualifying for Europe so it treat it in the way it was treated last year is something I never want to experience again.\n\"It's all on the night but I have no doubt these players we have at the club will give everything of themselves because that's their DNA. They are working so hard and there are players going out of the team and the players who are coming into the team are giving everything.\"\nBut while Devine isn't shouting the odds about what's going to happen at The Oval on Friday night, he is making no attempt to play down the importance of the sixth-round tie.\nThe former Derry City and Bohemians boss experienced Irish Cup joy as a player for the Glens in the 1995-96 final as Glen Little's goal secured a 1-0 victory over Glenavon. Devine admits he still gets plenty of banter about the goalkeeping shirt he wore that day.\n\"It was a howler of a jersey. I don't know what the kit man at the time was thinking,\" laughed the Derry man.\n\"But massive memories.....incredible memories. I remember every single part of that day from the morning getting up to the excitement of going and playing in an Irish Cup Final.\n\"These players work so hard behind the scenes, that I would love nothing more than to see them create their own memories and there's nothing better than an Irish Cup.\"\nDevine says his players should make it their business to get on the honours roll that adorns The Oval's walls.\n\"Every Glentoran team that has won the Irish Cup is named on it. We spoke at the start of the season that we wanted to get our name on that wall.\n\"Look we're only in the sixth round. There's a lot of work to be done. No matter who wins the game on Friday night there still a long way to go before you can start talking about winning Irish Cups but come Saturday afternoon you certainly want to be in the hat.\"\nFirst things first, Devine is confident his players, in the best traditions of the east Belfast club, will embrace Friday's challenge as they aim to keep alive hopes of a 24th Irish Cup triumph, with Linfield having won the trophy on a record 44 occasions.\n\"This club has been built on success. Historically, it has had so much success over its history and we're now the present and we want to bring that back.\n\"There's a huge battle ahead on Friday night but you have to dream and put your thoughts into what can be achieved.\"", "url": "https://www.bbc.com/sport/football/articles/cp8k9exx5k8o"}