{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 08:12:49", "date_modify": "2025-04-26 08:12:49", "date_publish": "2025-02-26 11:43:52", "description": "A news conference to promote April's fight between Conor Benn and Chris Eubank Jr will go ahead on Thursday as planned.", "filename": "sport_boxing_articles_cp8yqrljylyo_1745655169.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8d39/live/aa1527b0-f432-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_boxing_articles_cp8yqrljylyo_1745655169.html", "title": "Eubank vs Benn: Fighters be 'kept apart' at Tottenham news conference on Thursday", "title_page": "Eubank vs Benn: Fighters be 'kept apart' at Tottenham news conference on Thursday - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Conor Benn and Chris Eubank Jr will be kept apart at Thursday news conference after a volatile face-off on Tuesday.\nEubank smashed an egg across the face of Benn, sparking a melee on stage and a furious reaction from Benn's father Nigel and promoter Eddie Hearn.\nBenn is due to fight Eubank on 26 April and the bitter rivals will meet again at another news conference on Thursday at Tottenham Hotspur Stadium, where the fight will take place.\nThirty-five-year-old Eubank will be favourite against 28-year-old Benn, who steps up from the welterweight limit of 10st 7lb (147lb) for the 11st 6lb (160lb) middleweight contest.\n\"It was always going to be a volatile build-up,\" Hearn told BBC Sport.\n\"All bets are off now and we've got to be careful moving forward, particularly on Thursday at Spurs. We need to make sure we keep them apart.\n\"These people, you don't forget that. It's not a case of sleep on it and calm down. We need to keep them apart because we won't get to April.\"\nWarring fighters have been separated at media events before. Tyson Fury and Deontay Wilder were confined to opposite ends of the stage at their final weigh-in before their trilogy fight in 2021.\n\"We'll limit the face-offs, the head-to-heads and if we do have them, we'll have security between the guys,\" Hearn added.\nHearn was filmed shoving Eubank's promoter Ben Shalom during the melee on Tuesday, but Shalom said he had no idea his fighter planned to slap Benn with an egg.\nSecurity rushed in to stop the situation from escalating further after a news conference that was full of insults about family rifts and failed drug tests.\nThe boxers continue their family rivalry after their fathers - Chris Eubank Sr and Nigel Benn - had two fights in the 1990s but a scheduled contest between the sons in October 2022 was called off after Benn failed a voluntary drugs test, prompting a two-year battle with anti-doping authorities, before his suspension was lifted in November.\nBenn denied intentionally doping, but a report from sanctioning body the WBC suggested an overconsumption of eggs could have caused Benn's two failed drug tests.\nThe British Boxing Board of Control said in a statement they were \"aware of the incident\" and \"are dealing with the matter in accordance with its regulations\".", "url": "https://www.bbc.co.uk/sport/boxing/articles/cp8yqrljylyo"}