{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:28:47", "date_modify": "2025-05-20 13:28:47", "date_publish": "2023-07-25 21:08:04", "description": "Swansea City sign Brighton goalkeeper Carl Rushworth on loan and bring in forward Mykola Kukharevych from French club Troyes.", "filename": "sport_football_66201749_1747747727.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1462B/production/_130599438_rushworth_mykola_swans.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66201749_1747747727.html", "title": "Swansea sign Brighton keeper Carl Rushworth and Ukrainian forward Mykola Kukharevych", "title_page": "Swansea sign Brighton keeper Carl Rushworth and Ukrainian forward Mykola Kukharevych - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Swansea City have signed Brighton goalkeeper Carl Rushworth on a season-long loan and have brought in forward Mykola Kukharevych from French club Troyes for an undisclosed fee.\nThey are also close to bringing in Newcastle right-back Harrison Ashby on loan for 2023-24.\nRushworth, 22, played 46 games during an impressive loan spell at League One Lincoln City last season.\nUkrainian Kukharevych, 22, has signed an initial three-year deal.\nThe former Ukraine Under-21s cap also has an option of a further year in west Wales after spending last season on loan at Scottish Premiership club Hibernian.\nRushworth spent the previous campaign on loan at League Two Walsall, where he was named players' player of the 2021-22 campaign.\n\"I think the Championship is the toughest it's been for a long time with the teams it's got in it, but I'm looking forward to it,\" said Rushworth.\n\"I'm expecting it to be tough. There's never an easy game, just like there isn't one in League One or League Two.\nAshby has yet to feature for Newcastle since they bought him from West Ham for £3m in January.\nThe 21-year-old scored the winning goal as Newcastle beat Rangers 2-1 in Allan McGregor's testimonial at Ibrox last week.", "url": "https://www.bbc.com/sport/football/66201749"}