{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:28:17", "date_modify": "2025-05-21 05:28:17", "date_publish": "2025-04-03 10:32:59", "description": "Wicketkeeper James Bracey signs a new three-year contract with Gloucestershire to keep him at the club until the end of 2028.", "filename": "sport_cricket_articles_cn8vlpq87gpo_1747805297.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0032/live/afbc1650-1076-11f0-8c6c-d990c1c0e96b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cn8vlpq87gpo_1747805297.html", "title": "James Bracey: Gloucestershire wicketkeeper signs new deal until 2028", "title_page": "James Bracey: Gloucestershire wicketkeeper signs new deal until 2028 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wicketkeeper James Bracey has signed a new three-year contract with Gloucestershire to keep him at the club until the end of 2028.\nThe 27-year-old vice captain has made 192 appearances across all formats since his debut for the county in 2016.\nIn 2024 he enjoyed one of his best campaigns, taking his dismissal total to 37 in T20 cricket to surpass Steve Adshead's Gloucestershire record, as the club secured the Blast title in September.\nA left-handed batter he also amassed almost 1,100 runs in the County Championship last season including two double centuries and scored a first-class best of 207 not out against Leicestershire in August.\n\"[I'm] really happy to sign a long-term deal where I can continue to try and really work on the project we've got going here, and start to bring some success across all formats of the game,\" Bracey told the club website., external\nBracey, who played two Test matches for England in 2021, is due to skipper the team for their County Championship Division Two opener away to Derbyshire when it begins on Friday, with captain Cameron Bancroft not due to join the team until next week.\n\"We are passionate about our cricket here, and James is the epitome of that,\" said head coach Mark Alleyne.\n\"His presence and commitment last year was exceptional, and his reward was a stellar season and a new contract.\"", "url": "https://www.bbc.com/sport/cricket/articles/cn8vlpq87gpo"}