{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:44:44", "date_modify": "2025-05-21 07:44:44", "date_publish": "2025-03-28 09:28:35", "description": "Crystal Palace news: Ben Chilwell on Jean-Philipe Mateta", "filename": "sport_football_articles_cy4l482j34jo_1747813484.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a836/live/4d3c3140-0bb2-11f0-8e25-91624fd3b00c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy4l482j34jo_1747813484.html", "title": "Crystal Palace news: Ben Chilwell on Jean-Philipe Mateta", "title_page": "Crystal Palace news: Ben Chilwell on Jean-Philipe Mateta - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Crystal Palace defender Ben Chilwell says players like Jean-Philipe Mateta are important to have in the dressing room.\nThe striker is in contention to play in Saturday's FA Cup match against Fulham, which could be his first match since suffering a head injury in the last round against Millwall.\n\"Before I came to Palace, I watched him on TV, we know how good of a footballer he is, and how prolific he is in front of goal,\" Chilwell told the club's website.\n\"On the other side of it, which I've been impressed by, is how he is around the building. He's the glue of the place, really. He's the loudest one in the changing room, the loudest one around here. You need a few of those.\n\"It's a long season, so you need those characters around the place who are always cracking jokes, making people laugh. In the small side games in training, they're the loudest ones when their team loses or their team wins.\n\"They're the most important figures in the changing room. You definitely notice when he's not in the building, put it that way, because he's just such a bubbly character.\n\"Then again, like I said, on the pitch, he's having a brilliant season and he's had a brilliant few seasons. Hopefully, having him back this weekend will be a massive boost, and hopefully he can help us out.\"", "url": "https://www.bbc.com/sport/football/articles/cy4l482j34jo"}