{"authors": ["Alex Brotherton", "www.facebook.com"], "date_download": "2025-05-21 07:55:49", "date_modify": "2025-05-21 07:55:49", "date_publish": "2025-03-27 14:28:11", "description": "Russian Paralympian Nikolay Polukhin is stripped of his medals for violating anti-doping rules at the 2014 Winter Paralympics in Sochi.", "filename": "sport_articles_ce34d5venwko_1747814149.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/febe/live/17ec84b0-0b24-11f0-97d3-37df2b293ed1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_ce34d5venwko_1747814149.html", "title": "Russian Paralympian stripped of medals 11 years after doping violation", "title_page": "Russian Paralympian stripped of medals 11 years after doping violation - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Russian Paralympian Nikolay Polukhin has been stripped of medals for violating anti-doping rules - 11 years after he won them at the 2014 Winter Paralympics in Sochi.\nThe International Paralympic Committee's (IPC) independent anti-doping tribunal found Para-biathlon athlete Polukhin provided urine samples that had been tampered with during the Games, an event overshadowed by Russian state-sponsored doping.\nDNA evidence showed that Polukhin provided 'clean' urine during the Games that could be 'swapped' with samples that would have tested positive for trimetazidine (TMZ).\nTMZ is a medication that increases blood flow to the heart and stimulates the metabolism of glucose, which can improve endurance.\nForensic analysis of the sample bottle showed \"scratches and marks and a urine residue tooth mark that could only have been caused by someone closing, then re-opening, then reclosing the sample bottle.\"\nThe tribunal said that analysis of the urine conducted in 2018 demonstrated that the composition of the urine had changed since the 2014 analysis by the Sochi laboratory.\nPolukhin, now 42, will forfeit his gold medal from the Men's Para-biathlon 15km Visually Impaired competition and silvers from the same event at 7.5km and 12.5km distances.\nThe tribunal found that the athlete's conduct during the Sochi 2014 Paralympic Winter Games was \"particularly egregious\" and \"significantly undermined the integrity of the event\".\nIt said that Polukhin did not provide \"any logical or plausible explanation\" for the evidence of sample swapping with his urine.\nPolukhin filed an appeal against the decision with the Court of Arbitration for Sport, but this was withdrawn earlier this month after he failed to pay the advance of costs.\nThe tribunal made its decision on 25 September, 2024, but under rules could not disclose the decision until the completion of the appeals process.\nThe IPC's head of anti-doping Jude Ellis said: \"The resolution of this case draws a line under what has been a long-running process into potential anti-doping rule violations by Russian athletes at the Sochi 2014 Paralympic Winter Games.\"\nThe IPC confirmed to BBC Sport that there are no further investigations relating to Sochi 2014.", "url": "https://www.bbc.com/sport/articles/ce34d5venwko"}