{"authors": ["Nick Hart", "www.facebook.com"], "date_download": "2025-05-21 05:35:44", "date_modify": "2025-05-21 05:35:44", "date_publish": "2025-04-01 08:57:58", "description": "Millwall fan writer Nick Hart says reaching the Championship play-offs is a \"big ask\" after the 1-0 loss at Sunderland.", "filename": "sport_football_articles_c230kek0dz0o_1747805744.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/758d/live/90267df0-0ed5-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c230kek0dz0o_1747805744.html", "title": "Millwall: 'Plenty of effort but very little effect'", "title_page": "Millwall: 'Plenty of effort but very little effect' - fan's voice - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It's a football cliche that the only statistic that matters is the final score.\nVery true of course, but any Millwall fan watching Saturday's toothless display will also have noticed the Lions had an unusual 54% of possession at Sunderland, while mustering just two shots on target across the game.\nOuch.\nIn truth, the Black Cats were good value for their 1-0 win, despite a few late game jitters once Millwall went with two strikers and actually started to look vaguely dangerous going forwards.\nThis was a long way to travel for the hardy 700+ away fans to see plenty of effort, but very little effect from the Lions.\nAnother football cliche that springs to mind is that we are a \"work in progress\" since the arrival of Alex Neil - though possibly this provides cover for just being \"not very good\".\nIn Millwall's defence right now, we do have more injuries than Sweeney Todd's pie shop.\nDespite all this, we remain just six tantalising points off West Bromwich Albion in the sixth play-off position.\nAmazingly, we are still outsiders for a shot at getting pounded each week in the Premier League.\nMy final cliche then is that this is a big ask...", "url": "https://www.bbc.com/sport/football/articles/c230kek0dz0o"}