{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:54:08", "date_modify": "2025-05-20 14:54:08", "date_publish": "2023-07-27 14:05:10", "description": "Your views on who Pochettino and Chelsea should let go", "filename": "sport_articles_c4nrw71zd01o_1747752848.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/18b7/live/18f5d2a0-2c85-11ee-b1d7-8fdc93c2782e.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c4nrw71zd01o_1747752848.html", "title": "Your views on who Pochettino and Chelsea should let go", "title_page": "Your views on who Pochettino and Chelsea should let go - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "After manager Mauricio Pochettino hinted he hopes to trim his options, we asked who you would keep and let go if you were in charge of the Chelsea squad.\nHere are some of your thoughts:\nSam: Chelsea have to keep the up and coming talent. Colwill is, and will be, a quality defender but traditionally they don’t bring through their young talent enough for them to really thrive. I’d tell Colwill to leave and get the regular football he deserves, but Chelsea need to convince the talent they have that they are willing to give them a chance.\nJoey: Chelsea should get Lukaku as far away from the club as possible. He's nothing like the player who dreamed of Chelsea when he was younger, and has a poor attitude. Ziyech has wanted to leave since the start of the window, so let him go. Again, nothing like the player he was at Ajax. We need to keep Gallagher as our midfield needs the boost that he offers.\nChris: We absolutely must sell, or give away, Kepa. We've already seen instances of him conceding goals he should save. Chelsea will continue to concede soft goals so long as he plays.\nTomas: Gallagher must stay, too much homegrown talent is leaving. In addition to this, Gallagher was one of the most hardworking players of the disappointing team last season. The same counts for Colwill. Chelsea have zero expectations for next season, give the boys a chance.\nSteve: I think we have more chance of getting Mickey, Donald and Pluto at this rate! It’s tough getting transfers done but come on, they knew Rice was leaving when he wouldn’t sign a new contract. The situation now is dire. Stop lowballing and get the quality in. Alvarez, Maguire and Ward-Prowse - leaders.\nJonny: Chelsea should look to move on Raheem and Cucurella. While I still think they have value, they are potentially blocking the pathway for someone who has a higher ceiling (ie Maatsen, Hall, Gabriel). Sterling is also the highest earner at the club while lacking the output that wage demands. Gallagher should stay unless we get a silly amount offered.", "url": "https://www.bbc.com/sport/articles/c4nrw71zd01o"}