{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:21:10", "date_modify": "2025-05-21 06:21:10", "date_publish": "2025-01-31 12:11:51", "description": "Manager Brendan Rodgers is keen to see the progress of his Celtic side as they are drawn against Bayern Munich in the Champions League play-off round.", "filename": "sport_football_articles_c98ynpyjm86o_1747808470.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c6dd/live/178d18a0-dfcc-11ef-976a-75f9ab68fe5f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c98ynpyjm86o_1747808470.html", "title": "Champions League: Celtic must beat Bayern Munich for first time to progress to last 16", "title_page": "Champions League: Celtic must beat Bayern Munich for first time to progress to last 16 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Celtic manager Brendan Rodgers is \"excited\" by the challenge of having to beat Bayern Munich for the first time ever if they are to progress further in the Champions League after being drawn against the six-time winners in the play-off round.\nBayern, who finished third in the Bundesliga last season, currently lead Germany's top flight by six points but finished 12th in the new first stage of the Champions League following five wins and three defeats.\nCeltic, who lead by 10 points in defence of their Scottish title, were unseeded in the draw after finishing 21st, having won three and losing two of their eight ties.\nThe winners will face either Bayern Leverkusen or Atletico Madrid in the last 16.\nCeltic have yet to defeat Bayern in four meetings, all previously in the group stage of the Champions League.\nBayern won the first of the 2003 meetings 2-1 in Germany, with the return in Glasgow finishing goalless.\nThe Munich side won both games in 2017 - 3-0 at home and 2-1 away - against a side led by Rodgers during his first spell as Celtic manager.\n\"We've played Bayern Munich before in my time and had a really good game at home, played very well and could have got something from the game,\" the Northern Irishman said.\nThis time, the first leg of the play-off will be at Celtic Park on 12 February, with the return at Allianz Arena on 18 February (both 20:00 GMT), when Celtic are likely to be without any travelling support as they await a possible ban from governing body Uefa over the use of pyrotechnics.\nRodgers pointed out that \"the ultimate objective for us was to qualify\" and Celtic were always likely to face top opposition in the play-off round.\nHowever, he thinks his side \"have improved\" since their earlier 7-1 thrashing away to another German side, Borussia Dortmund.\n\"The key thing we wanted to see was progress,\" he said. \"Over the course of the eight games, we've undoubtedly shown clear progression both in our football, our mentality and our attitude.\n\"To be successful at that level is not just about ability. It is about attitude and mentality and the players have shown that - and have to step that up again.\"\nThe new draw format meant that Rodgers' side would either be drawn against Bayern or reigning champions Real Madrid, who finished 11th in the league phase.\nThe 15-time winners were instead paired with Manchester City, the English champions having finished one place below Celtic.\nLeverkusen and Atletico await the winners having qualified directly to the last 16 after finishing in the top eight.\nAtletico currently trail city rivals Real by four points at the top of La Liga but finished fifth in the league stage.\nLeverkusen, who were two points behind in sixth, are second behind Bayern in the Bundesliga.", "url": "https://www.bbc.com/sport/football/articles/c98ynpyjm86o"}