{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:15:46", "date_modify": "2025-05-19 15:15:46", "date_publish": "2017-07-04 12:22:42", "description": "Wales lock Alun Wyn Jones urges the Lions to win the series against New Zealand by enjoying Saturday's deciding Test.", "filename": "sport_rugby-union_40492773_1747667746.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1854B/production/_96795699_awj_point_rex.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_rugby-union_40492773_1747667746.html", "title": "British and Irish Lions: 'Enjoy it to win it,' say Wales lock Alun Wyn Jones", "title_page": "British and Irish Lions: 'Enjoy it to win it,' say Wales lock Alun Wyn Jones - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wales lock Alun Wyn Jones says the British and Irish Lions can win the Test series by \"enjoying\" the decider against New Zealand on Saturday.\nThe teams are level 1-1 after the tourists' 24-21 victory in Wellington.\nThe 31-year-old Jones is set to play his ninth Test for the Lions at Eden Park, Auckland, the most by a player in the professional era.\nHe said: \"We've really got to make sure we enjoy it. We will get the best out of everyone if we do enjoy it.\"\nJones played in all three Tests against South Africa in 2009, when the Lions lost 2-1, and again when they beat Australia 2-1 in 2013.\nLegendary Ireland Lock Willie John McBride tops the Lions' Test appearance list with 17 in five tours from 1962 to 1974, when he led the only unbeaten team in the tourists' history.\nJones skippered the Lions in the third and deciding Test against Australia in 2013 when tour captain Sam Warburton was injured.\nHe played in the 2017 Lions' opening Test defeat and the leveller last weekend to leave him as one of 17 players with eight Lions caps. Others on eight include Sir Ian McGeechan, JPR Williams, Brian O'Driscoll and Jeremy Guscott.\nWales prop legend Graham Price appeared in 12 consecutive Lions Tests from 1977-1983. If Jones plays in the game at Eden Park he will have also have appeared in every Test on three successive Lions tours.\nJones says just as the Lions responded to their first Test defeat, the All Blacks will look to do likewise as they seek to ensure Warren Gatland's class of 2017 do not match the feat of the 1971 Lions, who won their four-match series 2-1 with the last game drawn.\nJones says he and his fellow forwards have responded to the challenges posed in New Zealand.\nHe said: \"If you look at the games we've played previously, probably the Crusaders game in particular (the Lions won 12-3 on 10 June), we showed elements of what we can do as a pack,\" Wales skipper Jones added.\n\"We had to answer questions again, and on the back of those comments (criticism of pack) last week, I felt we did that.\"", "url": "https://www.bbc.com/sport/rugby-union/40492773"}