{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:31:06", "date_modify": "2025-05-21 06:31:06", "date_publish": "2025-01-14 05:01:21", "description": "Cardiff City: Omer Riza hopes fans play part v Watford and Swansea City", "filename": "sport_football_articles_clyk2xpdd9ro_1747809066.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ca89/live/45cc7d10-d1c0-11ef-8a2a-b1f18b093115.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_clyk2xpdd9ro_1747809066.html", "title": "Cardiff City: Omer Riza hopes fans play part v Watford and Swansea City", "title_page": "Cardiff City: Omer Riza hopes fans play part v Watford and Swansea City - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Omer Riza hopes Cardiff City's fans will play a part in easing the pressure this week as the Bluebirds face home games against Watford and Swansea City.\nRiza's side take on Watford on Tuesday (19:45 GMT) before returning to the Cardiff City Stadium for the south Wales derby on Saturday.\nCardiff are second from bottom in the Championship having struggled on their own patch this season aside from a run of four straight home wins in October and early November.\nSince the last of those successes, against Norwich City, Riza's side have taken just one point from five games at the Cardiff City Stadium.\nOnly Hull City have claimed fewer home points than Cardiff this season, but Riza hopes his team – who are unbeaten in four games in all competitions – are primed to improve their record this week.\n\"We have had some disappointing performances [at home],\" said the Cardiff boss.\n\"I think the pressure of the [league] position, the fans at times - I think the players feel it a little bit.\n\"Hopefully the fans will keep getting behind the boys and we can all try to do it together.\"", "url": "https://www.bbc.com/sport/football/articles/clyk2xpdd9ro"}