{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:24:49", "date_modify": "2025-05-20 12:24:49", "date_publish": "2023-08-04 00:00:00", "description": "Chelsea complete deal for Monaco defender Axel Disasi, Josko Gvardiol close to Man City confirmation, Mikel Arteta and Pep Guardiola press conferences, plus transfer news and gossip.", "filename": "sport_live_football_66398119_1747743889.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/171E7/production/_130659649_gettyimages-1554257663.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_football_66398119_1747743889.html", "title": "Latest transfer news and Community Shield build-up: Gvardiol, Disasi & Arteta news conference", "title_page": "Latest transfer news and Community Shield build-up: Gvardiol, Disasi & Arteta news conference - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Goodbye!\nThank you for joining us today! We've updated you all on gossip and news, so let's have a recap of the biggest stories of the day:\nChelsea have signed Axel Disasi on a six-year deal\nManchester City manager Pep Guardiola says Josko Gvardiol is having a medical at the club\nArsenal boss Mikel Arteta says Bukayo Saka was in training today before the Community Shield match on Sunday\nEngland goalkeeper Mary Earps says the team does not \"fear anyone\" at the Women's World Cup\nBurnley forward Anass Zaroury has signed a five-year contract extension\nWe will be back tomorrow with more updates and also live coverage of the Women's World Cup, see you then!\n'We have to try and maintain performance level for fans'\nArsenal\nArteta was next asked if this is a start of a new era for Arsenal: \"This is what we want, fighting for every trophy. We have to prove that. What we did last year was not enough to win the big trophy and we have to be better.\"\nAnd on the last time they faced Man City: \"The game started in a way that we didn't want. They were better in every department, they deserved to win that game without a shadow of a doubt.\"\nOn the fans: Thank you, they have been absolutely incredible. In the US it was incredible the amount of support and love they are showing towards the team. We have to try and maintain the level and improve it for them.\nArsenal team news\nArsenal\nWhen asked about Gabriel Jesus, Arteta said: \"He is fine. He is disappointed as he was feeling good but this issue was there. No one expected a [medical] procedure but we made that decision, I'm sure he will be back soon.\nAnd on the rest of the squad he said: \"Bukayo [Saka] feels much better, I don't expect anyone else [to be out].\"\nThe manager was also asked about how he managed to convince Declan Rice to sign with Arsenal, answering: \"We just explained our thoughts to him - what role he would have in the club and the team. He bought into that.\"\n'Ramsdale was brave to share story' - Arteta\nArsenal\nThe manager was first asked about Aaron Ramsdale's article in The Players Tribune: \"I thought it was great - very open, very transparent. I think he was very brave to do it the way he did. We cannot forget the personal touch [as managers], we are dealing with human beings. We have a big responsibility there, we have to support and be close to them.\"\nAnd on Sunday: \"Very excited to pay a final to win a trophy, we are playing against the team to beat.\"\nSquad size: \"We are in the process [of squad building] We are working on a few things - there is still time to do that. We are happy with the squad we have for sure.\"\n'My injury is getting better' - Zinchenko\nArsenal defender Zinchenko told the club's website: \"It [my injury] is getting better now. Obviously, I have a little bit of time [left to wait] to feel completely better.\n\"The target at the moment is just to get as fit as possible as soon as I can, and then, of course, to stay fit throughout the season, which is most important.\"", "url": "https://www.bbc.com/sport/live/football/66398119"}