{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:27:52", "date_modify": "2025-04-26 06:27:52", "date_publish": "2025-02-28 18:28:45", "description": "Saints have perfect chance to 'go again' and lift themselves - Valakari", "filename": "sport_articles_cvgeq5gezplo_1745648872.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6405/live/4c19d6e0-f5f1-11ef-bd6e-cd71c2e1454a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cvgeq5gezplo_1745648872.html", "title": "Saints have perfect chance to 'go again' and lift themselves", "title_page": "Saints have perfect chance to 'go again' and lift themselves - Valakari - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Simo Valakari says there is no better occasion for his players to follow up their midweek win than in a Tayside derby against fellow strugglers Dundee.\nSt Johnstone have won three of their last five top-flight games and are three points adrift of Tony Docherty's 11th-place side.\nA win by two goals or more would move St Johnstone off the bottom for the first time since mid-December.\n\"You feel it, you feel a little bit, but you need to go again,\" Valakari said of potential fatigue in his side's third game in a week.\n\"And no better place to go than this game now, a local derby, a big, big game for many, many, many reasons. And I think it will be a great atmosphere.\"\nThe 51-year-old Finn's first game in charge was a dramatic late win at Dens Park, but at the start of 2025 his side were beaten 3-1 by the Dark Blues.\n\"It was one of the biggest things in my coaching career to feel that,\" Valakari added on his debut win.\n\"But at the same time, I felt it maybe most low as well in this one game we played them here in our own stadium, in front of our own fans, 3-0 after 15 minutes.\n\"So high and low. I felt both. And now again, it's a new occasion, a new game.\n\"They want to attack us, they want to put us under pressure, they want to hit us in counter-attacks and score early goals and make it very difficult for us. So we need to prepare ourselves mentally and physically.\n\"We need to be, first of all, ready for this occasion, we know it will be a high-intensive game, with a lot of duels, with a lot of second balls you need to win.\"", "url": "https://www.bbc.co.uk/sport/articles/cvgeq5gezplo"}