{"authors": ["Mark Jardine", "www.facebook.com"], "date_download": "2025-05-21 06:11:34", "date_modify": "2025-05-21 06:11:34", "date_publish": "2025-04-01 13:16:32", "description": "St Mirren fan voice: How 'electric' Buddies banished 'Premiership's harshest curse'", "filename": "sport_articles_c74n87z3l3po_1747807894.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0a72/live/4593c060-0ef6-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c74n87z3l3po_1747807894.html", "title": "How 'electric' Buddies banished 'Premiership's harshest curse'", "title_page": "St Mirren fan voice: How 'electric' Buddies banished 'Premiership's harshest curse' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Like the Curse of the Bambino, St Mirren's multi-club and multi-manager hopelessness when faced with Derek McInnes has loomed larger and larger the longer it has lasted.\nPaisley-born but Morton-raised, McInnes has had a stranglehold on the Buddies for more than 30 games.\nThere is one loss in there, but it certainly hasn't been in his time with Kilmarnock. Having turned a two-goal lead into a 5-2 defeat last season, Saints fans could be forgiven for losing all hope of shaking this particular boogeyman.\nThey needn't have worried.\nElectric from the first whistle, a fired-up Saints team piled forward in number and left a broken pile of previously untouchable opponents in their wake.\nMatty Kennedy, Lewis Mayo, Liam Donnelly and others have had much joy on many occasions against black and white in recent seasons. On this wet and blustery March afternoon, however, they couldn't believe what had hit them.\nCaolan Boyd-Munce had his finest hour in a Saints shirt, pulling strings and setting the tone for a comprehensive thrashing. Yes, two superb strikes deserve plenty of praise - but that tells a fraction of the story of his afternoon.\nDenied the chance to select top scorer Toyosi Olusanya by ludicrous suspension, and with Mika Mandron working back to fitness, Stephen Robinson was forced to improvise.\nJonah Ayunga led the line, looking every bit the electric presence that first arrived in Paisley in Robinson's first summer. He was joined in the frontline by Roland Idowu, the mercurial and creative Irishman who has sometimes looked like he doesn't quite fit the image of a Robinson player.\nForced to play through the lines and make the most of the duo's strengths, as opposed to focusing on the pace of Olusanya on the shoulder of the last man, St Mirren were unstoppable.\nIf Idowu and Ayunga's tussle with Mayo, Joe Wright and Corrie Ndaba was a boxing match, the ref would have waved it off after only a few rounds.\nIn truth, once six-yard sitters at the feet of Richard Taylor and other chances are accounted for, the final four-goal deficit could have been larger.\nThe fury from Zach Hemming and colleagues at conceding that late penalty to surrender their clean sheet gives some indication as to the standards being strived for.\nHad the first 10 minutes on Saturday happened on Fifa instead of the grass at the SMISA Stadium, Del would have quit to the main menu and launched his controller at his telly.\nFingers crossed this is a momentum shift and not a momentary respite from the Premiership's harshest curse.", "url": "https://www.bbc.com/sport/articles/c74n87z3l3po"}