{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:41:43", "date_modify": "2025-05-21 07:41:43", "date_publish": "2025-05-20 14:04:54", "description": "Sophie Ingle has been given a 50-50 chance of being fit for Euro 2025 by Wales manager Rhian Wilkinson.", "filename": "sport_football_articles_ced22l6j5ldo_1747813303.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a7c2/live/216cc2e0-357f-11f0-9b2c-138cad92aeb3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ced22l6j5ldo_1747813303.html", "title": "Euro 2025: Wales' Sophie Ingle 50-50 to be fit", "title_page": "Euro 2025: Wales' Sophie Ingle 50-50 to be fit  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Midfielder Sophie Ingle has been given a \"50-50\" chance of being fit for Euro 2025 by Wales manager Rhian Wilkinson.\nIngle, who will leave Chelsea this summer, is facing a race to be ready for Wales' tournament opener against the Netherlands in Lucerne, Switzerland, on 5 July due to an ACL injury sustained in a pre-season match in September.\nIngle, 33, has not been named as part of Wilkinson's 26-woman squad to face Denmark and Italy in the Nations League as she continues her recovery.\n\"I haven't seen her, so I'd have to say 50-50 [of being available for Euros] because she is ahead of schedule,\" said Wilkinson.\n\"ACLs are vastly different dependent on the athlete. I don't always think ahead of schedule is great if you skip steps. I trust Chelsea has done everything properly but I need to see her and have clear conversations with her before I make that decision.\n\"I do want her back but not at the risk of Sophie Ingle's knee.\"\nIngle will leave Chelsea at the end of her contract this summer, a club where she won five Women's Super League titles, three FA Cups, two League Cups, and the Community Shield.\n\"She's had fantastic reports from Chelsea in terms of how she's training,\" said Wilkinson.\n\"The problem is Chelsea are not training anymore so it's really important to get her back with the team for her own self and also for the team.\"\nWilkinson paid tribute to the Blues' work in helping Ingle in her recovery.\n\"Sophie is doing really well and a big thank you to Chelsea. Her return to play and recovery has been incredibly well managed by them\", she said.\n\"She's obviously leaving, so that commitment to their player has been really appreciated.\"\nWilkinson names her final squad for the tournament in Switzerland on 19 June.\nWith no pre-tournament friendly matches planned, the Nations League matches away to Denmark on 30 May and against Italy in Swansea four days later will be the final matches before Euro 2025.\n\"It's pretty easy [to keep players focused] because I haven't named my squad yet and they know that,\" said Wilkinson.\n\"There's a different intensity that will be a reality of this camp, no matter how much I try and take the air out of that moment.\n\"They know that some of them are potentially going to have dreams come true if they make the squad, whereas others who have given so much to this qualification journey might not be with us right at the end. It's going to be a tough camp for that.\n\"I think everyone knows that all our games leading up to this training camp have played a part in helping me make my decisions, but there are players that are right on the edge and we obviously have injuries - and injuries happen in football - so anything can happen.\"\nWilkinson said she was clear on around 20 of the squad places, while there are others than can \"go either way\".\n\"It is the hardest part of my job. It's terrible but also that is the job. I try really hard to be as clear as possible with players as early as possible without being cruel,\" she said.\n\"It's a fine line because these players, they're all in, they are fully committed and I'm one person and it's one person's opinion.\"", "url": "https://www.bbc.com/sport/football/articles/ced22l6j5ldo"}