{"authors": ["Andy Cryer", "www.facebook.com"], "date_download": "2025-05-21 04:15:01", "date_modify": "2025-05-21 04:15:01", "date_publish": "2025-04-05 20:15:04", "description": "With Aston Villa having won seven games in a row and challenging on three fronts, BBC Sport examines manager Unai Emery's impact on the club.", "filename": "sport_football_articles_crlnjwggk9jo_1747800901.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d2c9/live/118a5140-9b6e-11ef-bcb0-31fef28b1f9f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_crlnjwggk9jo_1747800901.html", "title": "Aston Villa 2-1 Nottingham Forest: How Unai Emery has transformed Villa", "title_page": "Aston Villa 2-1 Nottingham Forest: How Unai Emery has transformed Villa - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Unai Emery has always been a manager who dreams big.\n\"My dream is to win the Champions League,\" he told Aston Villa fans after guiding them back into Europe in 2023. The notion of Villa helping him achieve that would have, then, been almost laughable.\nNow, after his side beat third-placed Nottingham Forest 2-1 in the Premier League for a seventh consecutive win in all competitions, the Spanish manager has got the whole club dreaming big with him.\nThe victory moves Aston Villa level on points with fifth-placed Manchester City and in with a chance of qualifying for the Champions League - via their league position - for the second successive season.\nThey also have a Champions League quarter-final to look forward to against Ligue 1 champions Paris St-Germain on Wednesday, and are in the FA Cup semi-finals against Crystal Palace.\nBack in October 2022, Emery replaced Steven Gerrard as manager, with Villa only out of the Premier League relegation zone on goal difference.\nNow, as well as still challenging in Europe, they are just two wins from a first major domestic trophy for 29 years and their first FA Cup since 1957.\nBut just how good has Emery’s two-year reign been? What has he done to turn Villa's flagging fortunes around? And how good could things get?\nEmery's arrival at Villa Park in 2022 marked a new chapter for the club.\nHe brought with him six backroom staff, with many of the old guard departing, and then Monchi arrived as president of football operations in June 2023 - having previously worked with Emery at Sevilla, winning three Europa League titles together.\nEmery has certainly been backed in the transfer market, spending about £295m on 23 signings over the past four windows - including the impressive loan captures of Marcus Rashford and Marco Asensio.\nIt has not all been plain sailing though, with the club being held back by the Premier League's Profit and Sustainability Rules (PSR), having to raise funds in the summer by selling academy graduates Omari Kellyman and Tim Iroegbunam, as well as Douglas Luiz and Moussa Diaby for significant money.\nWith a net transfer spend of about £15m, the club's recruitment has been even more impressive.\nSpanish football expert and Emery biographer Guillem Balague explains how the Villa boss has stuck rigidly to his recruitment plan.\n\"He has always endeavoured to bring in and play the type of players that possessed the necessary characteristics and shared his vision as to how the game should be played,\" he said.\n\"He has sold his vision of this future Aston Villa to the fans and has had to educate them in his ideas, showing them that the success they can achieve should come along with the implementation of a cultured, measured passing game and not merely one that relies on the playing of a non-stop 100mph box-to-box game.\"\nBut what else has Emery brought, away from recruitment and the club's playing style?\nStories emerged of how he had compiled dossiers on each player before joining Villa, and how he can often be seen leaving the club's Bodymoor Heath training ground late into the night.\nBalague described how he is also very big on individual coaching, so his players all get clips on their direct opponent.\nHis attention to detail is a characteristic that is spoken about a lot, as is his tactical brain.\n\"What separates good managers from great managers is that he has a great way of playing, but his in-game management is so amazing as well,\" Villa defender Tyrone Mings told Ben Foster's Fozcast podcast.\nMidfielder John McGinn added to BBC Sport: \"No matter what happens until now and whenever he leaves - we hope it's never - he will certainly go down as one of our club's greatest managers.\"\nThere is no limit to the ambitions of Emery - a master of knockout football who has won 10 trophies as a manager, nine of them in cups.\n\"My dream is to be a winner as a coach in the Champions League. Hopefully with Aston Villa,\" he told Sky Sports. \"The Premier League is very difficult to win.\n\"But, here Leicester won. This is the reason in football it is not impossible.\"\nSo how good can this season become?\nVilla have proved over the past two years they can beat anyone on their day, seeing off Bayern Munich this campaign and beating Arsenal and Manchester City last season.\nSo what about Champions League success?\nEmery has already proved himself to be a European master, winning four Europa Leagues and managing six different clubs in the Champions League.\nPSG will prove a tough test for the Midlanders though and, with Real Madrid or Arsenal waiting in a semi-final, they will have to do it the hard way.\nVilla have also won the competition before - albeit back in 1982 - while Porto's 2004 success under Jose Mourinho shows it is possible to upset the giants of Europe.\nSeeing the likes of Tottenham and Borussia Dortmund reach the final in recent years should also give Villa reasons for encouragement.\nWinning the Champions League might prove a step too far but, going by their current results in Europe, nobody will fancy playing Emery's men in the latter stages of the competition.", "url": "https://www.bbc.com/sport/football/articles/crlnjwggk9jo"}