{"authors": ["Mark Jardine", "www.facebook.com"], "date_download": "2025-05-21 07:43:34", "date_modify": "2025-05-21 07:43:34", "date_publish": "2025-05-20 12:53:49", "description": "St Mirren fan voice: 'Defiant Buddies pushed until the very last'", "filename": "sport_articles_cy0kkdpp7dro_1747813414.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3480/live/1f880180-3578-11f0-8947-7d6241f9fce9.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cy0kkdpp7dro_1747813414.html", "title": "St Mirren fan voice: 'Defiant Buddies pushed until the very last'", "title_page": "St Mirren fan voice: 'Defiant Buddies pushed until the very last' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Others may have had more to celebrate by the final whistle on Saturday afternoon, but I'd defy them to feel the same level of pride as inspired by the Saints and their efforts.\nI love this football club and they give me every reason to.\nThe list of reasons why St Mirren should not have been challenging for Europe until the 95th minute of the final game of this campaign is long and familiar at this point, but I'll make no apologies for running through them once again.\nThe 2024-25 campaign started with the unfamiliar pressures of European qualification and the associated travel dramas. Desperate for some semblance of normality, the Buddies were instead unable to train in their usual home. Neilston Juniors, among others, came to the rescue.\nRarely do the Saints open their cheque book and go fishing in the pond of paid transfers. Conor McMenamin's signing from Glentoran was the exception last season, his versatility and directness becoming an integral component of Stephen Robinson's tactical thinking. Greg Kiltie, for many a player of the year pick in securing that historic fifth place, likewise.\nFor both to require significant medical intervention in pre-season was unfortunate, but the eventual length of their lay-offs was near unthinkable. There was no \"fine, we'll sign another couple of wingers\" button for Robinson to press and large-scale tactical changes then had to follow.\nThe further loss of a starting right-back, striker and cover at left-back for off-field reasons was unfathomable. There is no reason to doubt Robinson when he describes this period as perhaps the most challenging in his managerial career.\nAssistant Diarmuid O'Carroll's growing reputation was rewarded with a move to lead Newcastle United's growing second side. Brian Kerr, at the time the link between the Buddies academy in Ralston and the first team, was promoted and forced to forge a managerial partnership with Robinson at a time when the team were fighting to arrest challenging form.\nVAR is a tiresome and well-worn topic, but I'll include that for a second consecutive season the Saints find themselves at the top of the table for subsequently overturned or disputed decisions - and leave it there.\nIf you're still here, you'd be forgiven for consigning the beleaguered Buddies to the bottom half and hoping this season simply fizzled away into history.\nInstead, the defiant Paisley men went unbeaten post-split and pushed the city clubs until the very last. Home and away wins over Rangers, Hibs, Aberdeen and more.\nA point on the final day, so close to taking three and some of the gloss off Celtic's trophy day. A 5-1 rout of bogey side Kilmarnock at the moment it was most needed. A 98th-minute turnaround in Perth. Snatching late victory in the Dingwall sleet.\nSee you in July.", "url": "https://www.bbc.com/sport/articles/cy0kkdpp7dro"}