{"authors": ["Marc Higginson", "www.facebook.com"], "date_download": "2025-05-21 04:35:40", "date_modify": "2025-05-21 04:35:40", "date_publish": "2025-04-04 17:32:38", "description": "Man City news: Kevin de Bruyne is this generation's Colin Bell", "filename": "sport_football_articles_c62x7w11x8no_1747802140.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7bbc/live/604f7560-1163-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c62x7w11x8no_1747802140.html", "title": "Man City news: Kevin de Bruyne is this generation's Colin Bell", "title_page": "Man City news: Kevin de Bruyne is this generation's Colin Bell - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Kevin de Bruyne is, to a generation of City fans, their Colin Bell.\nA man who had it all – just, as we were told, Bell did in the last great City team of the 60s and 70s.\nWith Yaya Toure-like lung-busting runs from midfield, the vision and grace of David Silva, the leadership attributes of Vincent Kompany and the goalscoring nous of Erling Haaland, De Bruyne took the best of the club's modern-day legends and rolled them into one Rolls Royce of a player.\nWhich is quite incredible considering he was never the biggest, fastest or fittest midfielder. Just the best.\nThe spectacular long-range goals will live long in the memory, but so will those bulldozing runs through midfield when he effortlessly went through the gears, and the perfectly-timed runs into the box.\nOr those inch-perfect crosses – like the one against Newcastle to tee up Oscar Bobb last season. Only he could have seen it and then executed it.\nBecause he was a one-off. When City needed a goal in the Bernabeu, he would step up. Or when somebody was needed to take a title race by the scruff of the neck – as he did with four goals against Wolves in 2022 – he would take charge.\nDe Bruyne won everything at City – silverware and hearts. Simply ask any City fan to stay composed when watching Pep Guardiola, moments after winning the Champions League, gush: \"We did it, Kev\".\nYou showed this generation what Colin Bell was like. You touched it with greatness. You won every single piece of silverware City fans craved.\nYou did it, Kev.", "url": "https://www.bbc.com/sport/football/articles/c62x7w11x8no"}