{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:21:06", "date_modify": "2025-05-21 06:21:06", "date_publish": "2025-04-01 00:00:00", "description": "Birmingham City continue their dominance in League One with a 2-1 win at Bristol Rovers as Wrexham are held to a 2-2 draw at Cambridge United.", "filename": "sport_football_live_cx29yz0d8y3t_1747808466.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cx29yz0d8y3t_1747808466.html", "title": "EFL League One and League Two: Birmingham win at Bristol Rovers; Wrexham held by Cambridge", "title_page": "EFL League One and League Two: Birmingham win at Bristol Rovers; Wrexham held by Cambridge - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Two sides to the form book\n#bbcefl\nAnother week, another winless night for Walsall but there they are on top of the hill.\nLeague Two, what a bonkers league you are.\nThough in League One, it looks increasingly cut and dry for leading Birmingham City who snatch the win in Bristol to move themselves even closer to a return to the Championship.\nAs to who will join them in the second tier, well, that's a little more uncertain with Wrexham, Wycombe, Charlton and Stockport all in the mix.\nWant some more? Of course you do.\nYou won't have to wait long either as Notts County take on MK Dons tomorrow at 19:45 BST.\nHaving seen what today had in store, you know you don't want to miss it.\nCountdown on for Blues\nFT: Bristol Rovers 1-2 Birmingham\nTonight's win at Bristol Rovers means Birmingham marching on in what could end up being a historic season. They are on course to break the EFL record points tally of 106, held by both Lincoln and Reading.\nBut the most important thing is getting back to the Championship at the first time of asking. While that may be a foregone conclusion to some, it is important for the Blues to go up mathematically as soon as possible.\nWith two games in hand on second placed Wrexham and an existing nine-point gap, they could go up with as little as eight more points, meaning in three games.\nThey host Barnsley and Crawley either side of a league game against Peterborough and the EFL Trophy final against Posh at Wembley.\nThat means they could be popping the champagne as early as 18 April at St Andrew's against Crawley.\n'I think we did deserve to win the game'\nFT: Bristol Rovers 1-2 Birmingham\nBlues manager Chris Davies spoke to Sky Sports:\n\"I think it was a scrappy, ugly game, but I think tonight we did deserve to win the game.\n\"Both teams were trying to press each other, though they are usually a team that want to play a little bit more.\n\"From our point of view we used a strategy to eliminate their press and try and get in behind a little, I think that worked well, but credit to them.\n\"You can never look too far ahead, we can now look to Barnsley, but all season we have just been looking at one game at a time.\"\nJust who will win the League Two title?\n#bbcefl\nSaturday will be big day in the hunt for the League Two title.\nThe early kick-off sees Port Vale host current leaders Walsall and with the Valiants in form, could they take back the lead at the summit?\nDoncaster Rovers could catch up to the chasing pack at the same time as they visit Cheltenham Town.\nWhile should the Vale prevail, Bradford City will have yet another chance to take the lead themselves in their 15:00 BST kick off against Crewe Alexandra.\n'A very different game'\nFT: Bristol Rovers 1-2 Birmingham\nBirmingham's two goalscorers spoke to Sky Sports.\nKeshi Anderson: \"It was a very different game to that at home a few months ago, they gave us a very tough game.\n\"We dug deep. We have eight more games, we will be pushing for 24 more points.\"\nJay Stansfield: \"As a striker you want to be scoring goals, but when you go five games without scoring, it means even more.\n\"Penalties I practise a lot, so I was glad it went in, but to get three points here is massive and the most important thing.\"\nBlues procession enters final straight\n#bbcefl\nBirmingham's seemingly inexorable march to the title continues as they did what Wrexham and Wycombe could not do, and saw off a struggler to claim three points.\nThey have an 11-point lead, games in hand and would need a Devon Loch-esque disaster to not be playing Championship football next season.\nWrexham and Wycombe seem intent on dragging out their own promotion battle with Charlton and Stockport keeping their momentum going on their heels.\nBolton are the latest side to occupy the hot-seat of sixth-place after a derby win at Wigan, but keep an eye on Blackpool, who have found form at the right time, despite having played a game more than the Trotters.\nJust look at it...\n#bbcefl\nAfter 90 minutes at the Eco-Power Stadium the destiny of the League Two title was in Doncaster Rovers' hands.\nThen Danny Johnson popped up.\nThe team they call Drawsall might now be winless in an astonishing EIGHT games, but they have actually extended their lead at the summit, which they have held for four months, back to two points.\nDoncaster, who have a game in hand, could set-up one of the all-time great season finales if they can join Bradford and in-form Port Vale on level points, with similar goal differences too, after the Valiants outclassed the Bantams at Vale Park.\nAFC Wimbledon's defeat at Swindon might have them looking down rather than up, with Grimsby's defeat at Crewe also opening the door for the Railwaymen to join the fight for the play-off spots.\nWhat a division...\nFULL-TIME\nCambridge 2-2 Wrexham\nCambridge pick up a good point against a top side but will it prove to be two points too short?\nA good start to the second half saw Josh Stokes score from the spot to put Cambridge ahead but the lead was not to last after Sam Smith whistled a header in for an equaliser.\nWrexham found the net again at the close of play but the assistant referee's flag was raised for offside to see them denied the full amount of points.\nThankfully for them though, Wycombe haven't fared any better and their lead remains in tact.", "url": "https://www.bbc.com/sport/football/live/cx29yz0d8y3t"}