{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:51:27", "date_modify": "2025-05-21 05:51:27", "date_publish": "2025-01-31 15:50:22", "description": "Everton news: David Moyes 'really jealous' over transfer activity", "filename": "sport_football_articles_cn8xe9eey54o_1747806687.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9243/live/cd53f420-dfe9-11ef-a819-277e390a7a08.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cn8xe9eey54o_1747806687.html", "title": "Everton news: David Moyes 'really jealous' over transfer activity", "title_page": "Everton news: David Moyes 'really jealous' over transfer activity - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Everton manager David Moyes says he is \"jealous\" watching the transfer activity of other teams in the January market. He says the club is restricted by profit and sustainability rules [PSR], the extent to which he had not realised.\n\"I'm really jealous of watching a lot of teams who can maybe attempt to go for a lot of players at expensive prices,\" Moyes said. \"At the moment we're not in that buyers' market. We've still got a little bit of work to do [on PSR].\n\"What I really want to bring to Everton just now is not really what I can do. As a manager, you always want to sign the best players you possibly can.\n\"I want to sign people who I think the supporters will be excited by and just at the moment we're all just a little bit hindered with what's been left over.\"\nMoyes has won two of his first three games on his return to Goodison Park but will be without first-choice striker Dominic Calvert-Lewin through injury for a number of weeks.\nHe conceded Everton's limitations in the transfer market are difficult to take.\n\"I've got to say I've been really surprised in the way it's restricting the football club here,\" he said. Everton's a huge football club and it should be competing with many of the big clubs in the country and hopefully spending in a way where it's right and challenging for the big players that are out there and available.\"", "url": "https://www.bbc.com/sport/football/articles/cn8xe9eey54o"}