{"authors": ["Josh Lobley", "www.facebook.com"], "date_download": "2025-05-21 07:46:57", "date_modify": "2025-05-21 07:46:57", "date_publish": "2024-12-23 16:23:36", "description": "Ivan Juric press conference: Southampton vs West Ham preview", "filename": "sport_football_articles_c1d3zvg9prxo_1747813617.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5b1f/live/3f4dc750-c149-11ef-a2ca-e99d0c9a24e3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c1d3zvg9prxo_1747813617.html", "title": "Ivan Juric press conference: Southampton vs West Ham preview", "title_page": "Ivan Juric press conference: Southampton vs West Ham preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Juric revealed that he was first contacted by Southampton two years ago: \"It was the first time I started to think about Southampton. I was the coach at Torino at the time and stayed there, but I always liked thinking about Southampton. I know lots of players because of that. It was my wish to come here.\"\nHe gave his thoughts on the current squad: \"I saw some good things and some bad things. The team has potential and can do much better than they are doing. I'm very optimistic we can do better and start to get points.\"\nHe was asked what style he wants to bring: \"It's a high-pressure style, and I want our team to be competitive and solid. With time, I want to get better in possession and attacking - but the first thing is that we are competitive in every game.\"\nJuric added: \"\"What I really like to do is improve players. I am obsessed. If you give me the player whose value is five, after one year it's eight. I like to work and analyse. My satisfaction is individual players getting better and the team getting better.\"\nJuric said the Premier League is the \"best league in the world\" and one of his inspirations from the competition is former Leeds United manager Marcelo Bielsa: \"I was watching a lot of games from him. His style of football is not the same [as mine], but I like the way he thinks about football.\"\nHe was asked about potential activity in January's transfer window: \"We have time to understand the team and what we need. If it's possible to change something, then we will change.\"", "url": "https://www.bbc.com/sport/football/articles/c1d3zvg9prxo"}