{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:05:02", "date_modify": "2025-05-21 06:05:02", "date_publish": "2025-01-31 13:16:45", "description": "Match preview, team news and key stats as Scotland host Italy in the 2025 Men's Six Nations.", "filename": "sport_rugby-union_articles_cwy7wx711ndo_1747807502.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0e00/live/ce2e8a90-dfc6-11ef-a819-277e390a7a08.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cwy7wx711ndo_1747807502.html", "title": "Six Nations 2025: Scotland v Italy preview, kick-off time, team news, BBC coverage & match facts", "title_page": "Six Nations 2025: Scotland v Italy preview, kick-off time, team news, BBC coverage & match facts - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Scotland host Italy in their opening match of this year's championship seeking to establish their credentials for winning a first title of the Six Nations era.\nThe hosts are missing several key players because of injury, including captain Sione Tuipulotu, and first face an Italy side who upset them in Rome last year.\nItaly's 31-29 victory in 2024 ended a run of 26 defeats at home in the Six Nations and was a first triumph against Scotland in 13 meetings.\nThe visitors, who have beaten Scotland more than any other nation in this tournament, will now target a third successive Six Nations win for the first time since they joined the competition 25 years ago.\nScotland head coach Gregor Townsend: \"Getting to start at home is massive and it has been a good training week. Italy are a quality side and have shown that for two or three years.\n\"They have been a difficult opponent for us and other teams. They really upped their game in last year's Six Nations with two wins and a draw, and one of those victories was against us, so they will be confident.\n\"There is intelligence in how they play, when they look after the ball, when they move it. They are a quality side and play with a lot of passion.\"\nItaly captain Michele Lamaro: \"The most important thing for us is to keep improving, keep going in that direction.\n\"There is a lot of expectations on us. Now the other teams are looking at us differently.\"\nItaly welcome back Tommaso Allan after he left last year's tournament partway through citing issues with fatigue and time away from family.\nHe starts at full-back, with Ange Capuozzo moving onto the wing, where he plays regularly for Toulouse.\nThere are three changes to the starting XV that defeated Scotland in Rome in 2024, with Allan effectively replacing Louis Lynagh.\nLock Dino Lamb and number eight Lorenzo Cannone have been brought into the pack in place of Niccolo Cannone and Ross Vintcent, who both drop to the bench.\nItaly line-up: 15-Allan, 14-Capuozzo, 13-Brex, 12-Menoncello, 11-Ioane, 10-P Garbisi, 9-Page-Relo; 1-Fischetti, 2-Nicotera, 3-Ferrari, 4-Lamb, 5-Ruzza, 6-Negri, 7-Lamaro (capt), 8- l Cannone\nReplacements: 16-Lucchesi, 17-Rizzoli, 18-Riccioni, 19-N Cannone, 20-Zuliani, 21-Vintcent, 22-A Garbisi, 23-Gesi\nAndrew Cotter:\nThe loss of captain Sione Tuipulotu as well as a number of others will test the reserves of the Scotland squad, but this is in many ways the ideal start.\nThe Azzuri may have won a close and hectic encounter in Rome last year, but had lost the previous 13 meetings between the sides, and many of Scotland's strengths are still there in a back-line bristling with attacking skill.\nHowever, this is perhaps the most well-rounded Italian side we have seen in the championship and their own midfield pairing of Menoncello and Brex is a match for any in the game.\nScotland are still being given at heavy odds-on to win, but don't be surprised if the scoreline is close.", "url": "https://www.bbc.com/sport/rugby-union/articles/cwy7wx711ndo"}