{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:38:57", "date_modify": "2025-05-20 14:38:57", "date_publish": "2023-07-28 12:34:49", "description": "Sheffield United podcast: Paul Heckingbottom's transfer budget", "filename": "sport_articles_c0w1gdp6zd7o_1747751937.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7357/live/432cbdb0-2c9c-11ee-bef6-f542eb7db91e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c0w1gdp6zd7o_1747751937.html", "title": "Sheffield United podcast: Paul Heckingbottom's transfer budget", "title_page": "Sheffield United podcast: Paul Heckingbottom's transfer budget - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Sheffield United have made three signings so far in the summer transfer window as the club prepares to return to the Premier League, and former Blades striker Carl Asaba has been discussing the recent transfer activity on BBC Radio Sheffield's Blades Heaven podcast.\n\"I don't look at the speculation, I wait to hear who we've signed because the players the recruitment team sign, I love,\" said Asaba.\n\"So if they've been identified, they've got the attributes that this management team like. That means they've got good attacking flair, good energy, and they're positive players.\n\"We're signing players on a smaller budget. You're seeing Burnley signing £17m and £18m players, they will be more proven. But that's what we're given and you know that whatever level we're shopping at, this recruitment team are getting the best they can.\n\"Don't expect them to be a finished article. The new boys have got good attributes that the management team can work with. You've just got to look at James McAtee and Tommy Doyle - these are two young lads who have come to us and quadrupled in value.\n\"We've got great coaches so these players are going to come on. They may not come on immediately and be proven Premier League players straight away.\n\"I still think we're going to be really hard to beat but, if it doesn't go as well as we had hoped, we can't be having a go at Heckingbottom. He's dealing with a different budget.\"", "url": "https://www.bbc.com/sport/articles/c0w1gdp6zd7o"}