{"authors": ["Adam Millington", "www.facebook.com"], "date_download": "2025-04-26 04:37:40", "date_modify": "2025-04-26 04:37:40", "date_publish": "2025-02-28 11:07:10", "description": "Brighton's Fran Kirby says she is \"really excited\" to face her former club, who she won eight league titles in nine years with.", "filename": "sport_football_articles_cr422yyqqgwo_1745642260.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ed1/live/5d06a880-f5c3-11ef-97ab-abb74cabf06c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cr422yyqqgwo_1745642260.html", "title": "Brighton v Chelsea preview: Fran Kirby 'really excited' to face former club", "title_page": "Brighton v Chelsea preview: Fran Kirby 'really excited' to face former club - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Brighton's Fran Kirby says she is \"really excited\" to play against her former club when her side take on Chelsea in the Women's Super League on Sunday (15:00 GMT).\nThe 31-year-old won eight league titles in a nine-year stint with Chelsea and moved to Brighton after her contract expired in the summer.\nKirby made an 18-minute cameo from the bench in Brighton's previous match after recovering from a calf injury which had kept her out since November and is looking forward to this weekend's game.\n\"Ultimately they are the best team in the league,\" she said. \"For me, I had the luxury of training with them last year and seasons before. I know what they're all about.\n\"I'm always wanting to put myself against the best and I'm really excited for the game.\"\nWith leaders Chelsea being the only team in the division who are still unbeaten, Kirby said Brighton's players will need to be at their best and \"do a little more\".\nShe added: \"They've gone unbeaten and there's a reason for that. They get injuries and they can go and buy one of the world's most expensive defenders. They'll make these decisions, spend the money they have to spend.\n\"We'll go in with belief. The last game against Chelsea was probably one of the best performances of the season. Hopefully we can learn from that game. It's going to be a case of every player doing their job - and a half.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cr422yyqqgwo"}