{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:49:00", "date_modify": "2025-05-21 03:49:00", "date_publish": "2025-04-07 15:28:00", "description": "Celtic and Rangers fan woes as bottom sides' fans are given renewed hope", "filename": "sport_football_articles_clyqjvg73pvo_1747799340.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c037/live/6ec09d00-13c4-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_clyqjvg73pvo_1747799340.html", "title": "Celtic and Rangers fan woes as bottom sides' fans are given renewed hope", "title_page": "Celtic and Rangers fan woes as bottom sides' fans are given renewed hope - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "After Sunday's 1-0 defeat away to bottom-of-the-table St Johnstone, Celtic fans are becoming more concerned that their players have downed tools with the title all but already won.\nDavid: It was obvious from kick-off that the Celtic players were complacent and their opponents were much more motivated. Nicolas Kuhn has been woeful in a number of games and Celtic's style of play needs fully functioning wingers. Yang Hyun-Jun needs to start and Luke McCowan should be given a starting berth.\nMartin: An appalling attitude from the players overall. We seem unable to defend cross balls and our finishing was poor. Individuals can have a bad game occasionally, but we seem to have them in unison.\nStephen: That was awful to watch. Saints deserved their victory and I hope they can do enough to stay up. Far too many players not showing up at the moment. Bring on substitutions around 60 minutes, it's becoming boring and predictable, and I think it's time for change.\nMark: Celtic had enough chances to at least have had a draw. It wasn't a performance to set alarm bells ringing, it was just that we were up against a team that were fighting for their Premiership lives. The title is already won.\nGeorge: Well, we've lost at home to Bayern Munich, away to Hibs, at home to Rangers and away to St Johnstone, hardly quality stuff. Looks like some of the players have accepted it's over - definitely not good enough.\nIn contrast, St Johnstone fans see light at the end of what has been a dark tunnel this season.\nRobin: Safe to say many didn't see that one coming! The team showed that they can be direct and effective when they need to be. The main thing is we now have the chance to be within two points at the split and the rest of the bottom six will be very concerned if that happens.\nPaul: What a performance! I feel the manager deserved that. He's stayed true to his principles and tried getting the team to play good football. It's not always worked, but that was the complete performance and a thoroughly deserved victory.\nGordon: Incredible. It shows we have a team in there. Delighted for everyone at the club. Now, though, we have to replicate this effort six more times and maybe, just maybe, we can conjure up a great escape.\nSam: The great escape is well and truly on. I see another 11th place finish and relegation play-off. Regardless of if we stay up or go down, I really hope Simo Valakari gets the opportunity to build the squad up over the summer. He's the most optimistic I've felt about a Saints coach in a long while.\nRangers fans are in despair again after Saturday's 2-0 loss at home to Hibernian.\nAlex: We lost mainly because of [goalkeeper] Jack Butland's errors and Cyriel Dessers' misfiring up front. Imagine if Dessers had taken his chances and Butland stopped his errors then a big part of the problem is resolved.\nBilly: In a season where the only certainty has been uncertainty, the Rangers performance summed up the attitude of a number of poor performers. Another poor season peters out in disappointment.\nGerry: Same old, same old, that's the Barry Ferguson effect over. Not scared to make changes, he says. I hope he's got enough in reserve to do that because they all need changing. Sad demise of a once giant.\nWilliam: What is the solution? It is clear Rangers cannot play with any sort of confidence in front of their own supporters. Are the fans too toxic, as you can see the players hiding in their shells? Only league we have won recently was in front of empty stadiums because of Covid, so maybe that is an indication of the issue at Ibrox?\nRonnie: I said last week give Barry the job - I'm gutted for him after yet another shambles. He is blameless both in his team selection and tactics. These players still do not get it. We have lost five home games on the spin, that is totally unacceptable. So many failures in this team over the entire season. Whoever gets the job has a massive task. Will it be Barry? These results do not help the case. Hopefully the fans do not turn on him. He is one of us.\nDavid: How many managers will we go through before the board realise it's the same players making the same mistakes week in, week out. We could have the best manager in the world and still come second.\nHibs fans can scarcely believe the change in fortunes that make their side favourites to finish third.\nMaureen: What has happened to Rocky Bushiri? Has he been possessed by the spirit of Paolo Maldini? He's an absolute titan in the Hibs defence now. He neutralised Cyriel Dessers and imposed himself on the game, as he has so often this season. It gives us the base to attack teams with confidence. Loving it.\nDarren: If you told me at the start of the season that in David Gray's first season as permanent head coach, he would finish third, beat both Old Firm and win two Edinburgh derbies, I would say you were mad. I would have been delighted for any of those, but to have nearly all three? If Hibs stay third, Gray would be up for manager of the season.\nAlan: Great result for David Gray and the team and the remarkable turnaround continues. This confident Hibs side is a world away from the team at the start of the season - secure at the back and scoring goals.\nChris: It's a strange feeling going to Ibrox confident of winning - long may it continue! It starts with extending contracts for David Gray and Martin Boyle - and probably letting Joe Newell go. Don't need an injured captain coming back into the team to disrupt a working system.\nDavid: Hibs controlled most of the game. It was a professional and complete performance. The back three dealt with all that was thrown at them, great composure in midfield and the attack made a nuisance of themselves.\nSandy: Solid defensive performance and speed on the break by the gazelle like Martin Boyle, plus a classy midfield provided by Dylan Levitt and Nectar Triantis. Impeccable coaching by David Gray and his team have this Hibs squad delighting us fans.\nAberdeen fans are still demanding more but are just happy to keep pace with Hibs after a 1-0 win away to Ross County.\nChris: The game overall was robust and scrappy because of the County set-up to give them the best chance of disrupting our play. Great goal from Shayden Morris, Graeme Shinnie moving to left-back with finally a stable midfield paying dividends and Kevin Nisbet is playing well. But the table is tight and we need to keep winning to make it to Europe.\nAlan: Good three points but not a good performance. Too many long balls. Should be playing through our good players - Leighton Clarkson and Ante Palaversa. Dante Polvara needs to play, the improvement in Shayden Morris is a bonus as he is now adding the final ball to his undoubted pace. If only Pape Gueye could do the same.\nJohn: Mats Knoester has been the main reason behind the team's upturn in results in recent weeks. Brings a calmness and organisation to our defence, which gives the likes of Clarkson and Palaversa a platform to perform in midfield. Shinnie at left-back has been an added bonus.\nAndrew: Disappointing performance after last week and we had enough chances in the first half to have County dead and buried by half time, but nevertheless a good three points.\nFred: A good match but feel we should have scored more. However, Shayden Morris was excellent - his speed is such an asset to the team. Great to see us keeping a clean sheet, but our forwards need to perform better.\nDundee United fans are delighted to have clinched a top-six finish after a 1-0 win over 10-man Heart of Midlothian.\nDave: The good: another terrific three points on the road, top-six secured and hopefully the end of a tricky period for us. David Babunski getting some minutes - don't know why he's not been featuring of late. The bad: a referee that clearly doesn't understand the game. James Wilson's red card was marginal but probably right, but the yellow cards and non-fouls that were penalised on both sides were ridiculous.\nMat: A great result for the Terrors, but being honest, another poor performance against a Hearts team that didn't look that great either. Our players look mentally tired and have definitely lost that spark and sharpness from earlier in the season.\nKieran: The game had no real quality. That was until big Sam Dalby, our talisman, popped up with one of the best headed goals I have seen for a while. Another crucial three points and, although Hearts were by far the better side, this team has shown all season we can claim a result without playing particularly well.\nJim: Considering we had a couple of main defenders missing, a great result. Our passing at the back was very dodgy in the first half, gifting Hearts chances, but Wilson's sending off turned the game and Dalby's goal was a cracker.\nHearts are in pole position in a three-team race for the one remaining top-six place, but their fans are not optimistic.\nDavid: Yet again, when it really matters we can't get a result. Lack of concentration for the goal. The next two games are crucial for Neil Critchley. Our form doesn't deserve top six as it stands.\nSteven: Eat, sleep, repeat. You know what's going to happen with Hearts every time they play - create chances, play some neat stuff, don't score, concede, get beat. The style of play doesn't work in the Premiership. Everyone in the stands can see it, so why can't Critchley?\nGary: The doom and gloom merchants are out in force. We dominated the match but just couldn't score. As per usual, Nick Walsh was way too quick to issue a red card. Could he not have looked at the monitor? Hardly a James Tarkowski-esque challenge was it? This decision changed the game.\nDonald: United came to play for a draw as a minimum, playing for time from the kick-off. Hearts were again tactically inept, sideways or backwards passing. Team set-up has zero pace and no movement up front to give options. As it stands, it's a bottom-six finish, a relegation battle and a loss in the semi-final. Been a season ticket holder 40-plus years and a walk up decades before that, scunnered by the recent/current season performance.\nChris: We are so far off the required level, I don't know many fans who want a top six place. We will lose all five games.\nSt Mirren's 2-0 defeat away to Dundee was a blow to their hopes of a top-six finish.\nDerek: Unfortunately, our inconsistency will likely cost us dearly. The team can play absolutely superbly one week then get beaten, no matter how well we play, the next.\nDouglas: This result probably relegates us to the bottom six. Not that the possession or the quality of outfield play deserves that prediction, but we now really depend on others helping us get there. The manager is spot on - you can't doubt the effort, or at times the skill, but if you don't take your chances then you deserve to lose.\nJohn: We played well, but our goalkeeper's mistake for their second goal gave us a mountain to climb. Top six is probably gone now, but even so, we've done okay considering the multiple set-backs this season.\nHuey: I've followed Saints through good times and not so good times since 1977, but I can't remember such an inconsistent season. We undoubtedly have the squad to be a top-six team, but there's no way of predicting what version of St Mirren is going to turn up from week to week. I believe in Stephen Robinson, but this has been a frustrating season.\nKofi Balmer's controversial red card was the big talking point for Motherwell fans as they lost 2-0 away to Kilmarnock.\nGordon: It was always going to be tough on that unacceptable pitch, but not one of our players can claim to have had a decent game. Hoofing the ball aimlessly forward, midfield simply helping it on, ball in the air most of the time, poor first touch by anyone it actually reached and always last to second balls. Sending off is a limp excuse.\nDerek: We are suffering from the strategy and signing policy of Stuart Kettlewell. If you ask Well fans, he is up there with Harri Kampman as a total shocker. Michael Wimmer has no chance. It's fingers crossed time now.\nHarry: Referee was a joke. We played poorly, fair enough, but the first red is never a red! Kofi Balmer is clearing the ball, no malice in it. Dom Thompson is dragged down by Daniel Armstrong and only the Well player is punished, absolute joke.\nGrant: Really poor. The first couple of games when Wimmer came, we looked really good, full of energy and some lovely triangles. But we haven't looked a team the last two games. The sending off was never a sending off, but it wouldn't have made any difference if we had 11 men on the park. We are going to end in the play-offs.\nSaturday's win over Motherwell has given Kilmarnock fans renewed confidence their team will stay clear of relegation.\nAmy: As much as Derek McInnes deserved criticism last week, he deserves praise for this win. A brave decision - bringing Rory McKenzie back into the midfield was a masterstroke. Sending off similar to what Corrie Ndaba went for last season, so rules are rules. Would rather be in this fight with McInnes than nearly anyone else.\nPeter: Great all-round display from Killie. Stuart Findlay was superb and McKenzie was outstanding and set the tone.\nAnna: A much better performance and a much more solid defence than we've had. Midfield were decent enough and it was nice to see Bruce Anderson up front with Fraser Murray. And, with Kyle Vassell fit again, I feel we have a pretty good chance of avoiding the dreaded relegation play-offs.\nRobert: Much improved performance. More energy throughout the team and great to see Danny Armstrong more like himself. Never seen a referee stop a game to allow the goalkeeper to go to dressing room for new gloves? Are gloves compulsory? Not the only weird decision from ref.\nJames: A much better display from Killie. The team had good balance and the return of Findlay brought a solid look to the defence. Armstrong and Murray were great and the partnership of Anderson and Bobby Wales up front shows a lot of promise.\nCounty's defeat by Aberdeen has their fans concerned about their form and strategy.\nDavid: Definitely relegation form. Never looked like scoring. Team selection and substitutes yet again leaves me baffled. It's as if Don Cowie picks players to keep them all happy. Ronan Hale might get a start next week as he had two shots on goal at the end!\nAlistair: I am utterly fed up watching a team that appears to have no shape, no cohesion and has players that just punt and chase directionless long balls up the park. We have players who actually do have talent but don't seem to have any idea what is required of them and certainly don't look like they are going to drag themselves out of a self-inflicted mess that leads to relegation unless the brakes are applied.\nAnother home game where we have absolutely no effect in front of the opponent's goal. One shot in the 94th minute and it went wide. I don't know if I want to see much more of this. Cowie's assessment of games shows he and I watch different matches.\nJohn: First half was good barring the goal. Too long before Josh Nisbet and Hale got on the pitch.\nDundee's win over St Mirren is a welcome relief for fans who thought their side was destined for the relegation play-off spot.\nBoab: Certainly not our best performance but a massive three points. We're far too open in midfield and seem to give up possession too easily. However, we are certainly good up front.\nMark S: Excellent result. Dundee showed their fighting qualities. The win brings them back to Kilmarnock and Ross County.\nIain: It's a sad fact that this was our first home clean sheet in the league this season - 67 goals conceded and 23 points dropped from a winning position. We can do a whole lot better. Well done to Simon Murray, 21 goals, we'd be relegated already without him.\nMark D: Not the prettiest, but points are all that matter at this stage of the season. Money well spent to get Murray in.\nJefcal: We keep hearing about leaky defence, but we have no midfield balance. Mo Sylla wins lots but does not create or score. No midfielder can slow things down and make a pass to our strong front players. Hence defence put under pressure. Well done, but St Mirren deserved a point.", "url": "https://www.bbc.com/sport/football/articles/clyqjvg73pvo"}