{"authors": ["Chris Jones", "www.facebook.com"], "date_download": "2025-05-21 05:29:11", "date_modify": "2025-05-21 05:29:11", "date_publish": "2025-04-03 09:46:39", "description": "The head of European rugby dismisses concerns over Saracens resting a host of England stars for their Champions Cup last-16 tie at Toulon.", "filename": "sport_rugby-union_articles_cgkg1pjlggxo_1747805351.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cf1d/live/8cf39a20-106d-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cgkg1pjlggxo_1747805351.html", "title": "Investec Champions Cup: European CEO not concerned with Saracens resting England stars", "title_page": "Investec Champions Cup: European CEO not concerned with Saracens resting England stars - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The head of European rugby has dismissed concerns over Saracens resting a host of England stars for their Champions Cup last-16 tie at Toulon.\nMaro Itoje, Jamie George, Ben Earl, Tom Willis and Elliot Daly will all miss the trip to the south of France as Saracens prioritise their Premiership play-off push.\nBut European Professional Club Rugby chief executive Jacques Raynaud insists the Champions Cup remains the pinnacle for players and coaches.\n\"We do have one or two cases per season [of weakened teams], but it is more the exception, we shouldn't overplay it,\" Raynaud told BBC Sport.\n\"We are definitely living up to our promise to have the best players in the best matches.\"\nLast season South African side Bulls sent a weakened team to Northampton for their quarter-final, while earlier this campaign a much-changed Stormers side was well beaten by Harlequins in the pool stage. However, Raynaud says these are exceptions that prove the rule.\n\"Toulouse travelled down [to South Africa in January] with their best team to play the Sharks. And this was kind of a France versus South Africa remake,\" explained Raynaud.\n\"You saw Northampton going down to South Africa and winning [against Bulls in December] and taking their best team.\"\nUnder England rugby player welfare guidelines, players who featured throughout the Six Nations should have a weekend off on one of the three weekends following the Championship.\nWith Sarries boss Mark McCall opting to pick his England regulars for the Premiership matches against Harlequins and away at Leicester, he says it would now be \"unwise not to rest them\" against Toulon.\nEngland skipper Itoje, for example, has played 80 minutes in 14 successive matches for club and country.\n\"There are some specificities due to injuries, due to player welfare, due to rest periods, which we fully respect,\" added Raynaud.\n\"But overall, when you listen to coaches, when you listen to teams, they do use these [Champions Cup] weekends to shine at the very best level.\n\"We are increasingly seeing the teams wanting to go deep in Europe; this is the absolute measuring stick for them, this is what the players want, this is where the coaches want to shine and this is where the club branding is exposed to a global level.\n\"They are all chasing the star, they all want to add a star - or to have a star - and this is the beauty of the tournament.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/cgkg1pjlggxo"}