{"authors": ["Tyrone Smith", "www.facebook.com"], "date_download": "2025-05-21 03:46:09", "date_modify": "2025-05-21 03:46:09", "date_publish": "2025-01-23 17:12:45", "description": "'There is a real strengthening of the squad happening.' - Tony Docherty", "filename": "sport_articles_cy7gn6x2727o_1747799169.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a086/live/193c3340-d9ad-11ef-a6db-29ca006e3088.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cy7gn6x2727o_1747799169.html", "title": "'There is a real strengthening of the squad happening.'", "title_page": "'There is a real strengthening of the squad happening.' - Tony Docherty - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Dundee manager Tony Docherty has praised the club's owners for going \"over and above\" in developing ways to strengthen the squad.\nThe Dark Blues announced a strategic partnership with Mexican side CF Monterrey in November and have a similar arrangement with English Championship side Burnley.\nCurrent Monterrey midfielder Cesar Garza arrived on loan this month, as did their former midfielder Victor Lopez.\nDocherty said \"Credit to the club, to John (Nelms) and Tim (Keyes) for looking out further, over and above, looking at partnerships where we can strengthen the team. I think you can see now that we are getting the benefits from that.\n\"We are also getting benefits from the partnership we have with Burnley in terms of (Oluwaseun) Adewumi's level of performance at the moment, so huge credit to the club for making sure there is no stone unturned in our search to try and develop the team and improve the team.\"\nDespite being ravaged by injury and illness in recent weeks, Dundee travel to play champions Celtic on Saturday in excellent form.\nThey have lost just one of their past six games, a run which includes back-to-back draws with both the Old Firm and a Scottish Cup victory over neighbours United.\nDocherty said: \"It is a brand new group, we have been developing as a group, there are young players that are developing.\n\"And now that we have got incomings, the four are strong signings and the injuries – (Joe) Shaughnessy, (Antonio) Portales, (Ziyad) Larkeche, (Scott) Fraser - they are coming back into the fold at the right time.'\n\"So as well as the team are doing at the moment, there is a real strengthening of the squad happening and what that gives me is real healthy competition.\"", "url": "https://www.bbc.com/sport/articles/cy7gn6x2727o"}