{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:07:41", "date_modify": "2025-05-21 04:07:41", "date_publish": "2025-04-08 00:00:00", "description": "Republic of Ireland midfield Denise O'Sullivan says that it is \"important for other players to step up\" in the absence of suspended captain Katie McCabe.", "filename": "sport_football_live_c4g9lpp17j4t_1747800461.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c4g9lpp17j4t_1747800461.html", "title": "Republic of Ireland 2-1 Greece: Hosts hold on to win in Nations League", "title_page": "Republic of Ireland 2-1 Greece: Hosts hold on to win in Nations League - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The Republic had been tasked with getting over the line without Arsenal's McCabe, and they got off to a perfect start at a sun-soaked Tallaght Stadium.\nLiverpool forward Leanne Kiernan was brought down by Athanasia Moraitou and Barrett, who scored on her 50th cap in Greece on Friday, calmly dispatched the penalty.\nReplays seemed to suggest that Kiernan was brought down outside the area, but with no VAR in operation, the original decision by referee Franziska Wildfeuer stood.\nIoanna Papatheodorou dragged an effort wide from range as Greece looked for a response, before Lucy Quinn fired over and Patten headed wide at the other end as the Republic looked comfortable at the break.\nThere was the perfect start to the second half as Patten headed home Megan Campbell's corner just five minutes after the restart.\nIt was a third international goal for the Aston Villa defender, who has become a key player in the Irish set-up since making her debut last year.\nHowever, Greece refused to lie down and pressed for a route back into the game.\nSarri tested Everton team-mate Courtney Brosnan from outside of the area, but the midfielder pulled a goal back soon after.\nThe ball fell to Sarri on the edge of the area and she took a touch and fired an effort low into the bottom corner beyond the diving Brosnan.\nPapatheodorou stung the palms of the Irish goalkeeper as Greece pushed for an equaliser, but the Republic ended the game the stronger side and had chances for Quinn and substitute Saoirse Noonan, both from Megan Campbell deliveries.\nThe victory leaves Ward's side three points behind leaders Slovenia as they look for an immediate route back into League A, and they will be back in action at the end of May with a trip to Turkey and a home game against the Slovenians, who ran out 4-0 winners in the reverse fixture.", "url": "https://www.bbc.com/sport/football/live/c4g9lpp17j4t"}