{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:19:59", "date_modify": "2025-04-26 04:19:59", "date_publish": "2025-03-03 16:06:58", "description": "Newport County display 'not good enough' as Jardim sends warning", "filename": "sport_football_articles_c07z1y42585o_1745641199.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4e2c/live/c3c1b380-f848-11ef-b5bf-275f2ed479cc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c07z1y42585o_1745641199.html", "title": "Newport County display 'not good enough' as Jardim sends warning", "title_page": "Newport County display 'not good enough' as Jardim sends warning - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Newport County boss Nelson Jardim has warned his mis-firing players they are making decisions on their own futures with their performances.\nAnd he says whether they want to stay or leave the League Two club, they will need to be better than in recent weeks.\nCounty lost 3-0 for a second game in a row at the weekend, their defeat at Doncaster Rovers coming seven days after the same scoreline at home against Cheltenham Town.\nJardim called the former \"just not good enough\" and has demanded a response in Tuesday's home fixture with Gillingham.\nNewport had a large turnover of players last term and Jardim has previously stated he did not envisage a similar summer of change, but he warned: \"Any player not really focussed on here with us, we have to make decisions.\n\"We have been very, very clear with the players – they have to show. If they want to stay or even if they want to get a move then they have to perform at their best.\n\"At this level (of performance), both things can happen – they could not stay or not get a move.\n\"I want a reaction, show some desire, show some pride, because (Doncaster) wasn't good enough.\"\nNewport remain 14 points clear of the relegation places after a recent spell that saw them go six games unbeaten, but Jardim says it is defensive mistakes and not complacency that is costing them.\n\"The way that we conceded goals was just not good enough,\" he added.\n\"We conceded goals from individual mistakes and that is costing us - some of the goals we are conceding are unbelievable. You cannot have that level of performance.\n\"We have to analyse and make sure we are stronger on Tuesday because it's a massive game against Gillingham and we have to compete.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c07z1y42585o"}