{"authors": ["Ffion Wynne", "www.facebook.com"], "date_download": "2025-05-21 06:20:35", "date_modify": "2025-05-21 06:20:35", "date_publish": "2025-01-14 06:11:01", "description": "England are bowled out for 159, chasing only 181 to win, which gives Australia a 4-0 lead in the points-based series.", "filename": "sport_cricket_articles_cy9lj081vy9o_1747808435.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4b52/live/57344270-d23f-11ef-9fd6-0be88a764111.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cy9lj081vy9o_1747808435.html", "title": "Women's Ashes 2025: England collapse as Australia take 4-0 lead", "title_page": "Women's Ashes 2025: England collapse as Australia take 4-0 lead - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England wasted a golden opportunity to level the Women's Ashes as they failed to chase 181 for victory in a nail-biting finish at the Junction Oval in Melbourne.\nWith one wicket remaining, England needed 22 runs to win from the final two overs when Lauren Bell was bowled by Megan Schutt for one, completing a collapse from 68-2 and 120-5 to 159 all out.\nEngland were given a lifeline when Annabel Sutherland was taken out of the attack for bowling two no-balls in the 48th over, but Amy Jones - who was left unbeaten on 47 - failed to recognise that she should have run from the free hit which was the final ball of the over.\nThat left number eleven Bell with six balls of Schutt to face, and she perished to hand Australia a potentially series-defining win and inflict a morale-sapping defeat on England.\nIt was a gut-wrenching blow for England's bowlers who performed magnificently to bowl Australia out for 180 inside 45 overs, with spinner Sophie Ecclestone taking 4-35 and Alice Capsey 3-22.\nThe hosts suffered a similarly woeful collapse of their own, losing their last eight wickets for just 49 runs after Capsey removed Ellyse Perry for a sublime 60.\nBut England are unlikely to be given a better chance of getting back into the series against such a dominant side, and the lack of tactical awareness as soon as the pressure started to increase was particularly alarming.\nThe ODI series concludes in Hobart on 16 January, before three T20s which are also worth two points apiece and a one-off Test match which is worth four.\nWilting under pressure was already a worrying trend for Heather Knight's England, but after this latest shambolic display, Australia will be even more confident of retaining the Ashes sooner rather than later.\nGreat teams find a way to win from nowhere, as Australia have proven once again, but it was at times brainless cricket from England which handed it to them - the hosts successfully defending their lowest ODI total since 2006.\nAt 84-5, England were wobbling but they had more than 28 overs to eke out another 97 runs.\nInstead, Jones went into her shell alongside Capsey, who made 14 for 35 balls - and Australia, who need no second invitation to prey on any sniff of fragility, pounced.\nCapsey was trapped on the crease lbw by Kim Garth, who bowled a miserly spell of 3-37, Charlie Dean attempted an inexplicable ramp to be caught off King and next ball, Sophie Ecclestone edged behind off the same bowler.\nLauren Filer was run out after Darcie Brown's phenomenal swoop and throw from short third, and it took that final throw of the dice for Jones to start playing her shots but it came far too late, coupled with her inability to manage the strike with Bell.\nEven before the free hit error, Jones twice turned down singles on the fifth ball of an over only to fail to get the strike a ball later.\nIt twice exposed Bell to the start of the next over and she could only defend - the 46th over was a maiden by Ash Gardner - meaning the required run-rate spiralled.\nKing, meanwhile, was immense for her 4-25, having also claimed the huge scalps of Nat Sciver-Brunt for 35 and Danni Wyatt-Hodge for a golden duck earlier in her spell.\nEngland faced an uphill task even before the series began and few would have expected them to win the ODI series, which is comfortably Australia's strongest format, but they cannot make any excuses for failing to take away what would have been a precious two points from Melbourne.\nWhile Capsey struggled with the bat once again, she played a pivotal role with the ball which added to the confusion as to why she did not bowl in the series opener in Sydney.\nAustralia were cruising serenely at 92-1 when Ecclestone was finally introduced into the attack - another of Knight's questionable tactics in holding her back until the 18th over.\nOpener Phoebe Litchfield made a stuttering 29 and was trapped in front in Ecclestone's first over as the world's best made an immediate impact.\nShe then had Beth Mooney dismissed in the same fashion for 12 to leave the score 131-3, before Capsey's introduction changed the direction of the innings.\nAll-rounder Sutherland was dropped on one as Capsey missed a chance in her follow-through but she could not capitalise, eventually being caught by a diving Knight at cover for 11 before a lengthy review saw Perry given out lbw to end a previously serene innings where a fourth ODI century looked almost certain.\nAsh Gardner was bowled by a nicely-flighted delivery for two, Filer nipped one past Tahlia McGrath's defence and then Australia were on the ropes at 153-7.\nTheir lower order is so rarely needed and they were exposed, with Ecclestone adding King and Schutt to her tally.\nEngland can take confidence from this collapse, twinned with the fact Healy's side lost six wickets in chasing only 203 in the opener, but they need to win the series outright by getting 10 points on the board and from their batting displays so far, those points are going to be very difficult to attain.\nEngland captain Heather Knight: \"It's frustrating, I feel like it was there for the taking. Sophie [Ecclestone] and Alice [Capsey] bowled brilliantly. The wickets cost us. We need to be a bit braver with the bat.\n\"Amy was great at keeping us in the game. She was trying to face the majority of the balls and picking up boundaries when she could. It's obviously frustrating. Amy got us close but unfortunately just not close enough.\n\"We're really close. We just need to do a few things better in a few areas and need to be braver with the bat.\"\nAustralia skipper Alyssa Healy: \"A tremendous game of cricket. To take it as deep as we could was a serious effort from our girls.\n\"I think that was one of the best wins I've been a part of. I think I said I'd rather lose with them eight down in the 35th over trying to bowl them out than take it to the 49th over.\n\"We do [find a way to win no matter what] and we speak about just hanging in there and staying in the contest then creating opportunities as much as we can.\n\"We were able to do that today. We're still unbeaten at the Junction Oval which is awesome.\"", "url": "https://www.bbc.com/sport/cricket/articles/cy9lj081vy9o"}