{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:41:03", "date_modify": "2025-05-21 07:41:03", "date_publish": "2025-03-28 11:23:21", "description": "Kenya goalkeeper Patrick Matasi is provisionally suspended for 90 days amid an investigation into match manipulation in the East African country.", "filename": "sport_football_articles_ce8y8y37ynwo_1747813263.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b578/live/f2181910-0bbf-11f0-9ca8-c5035ea95420.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ce8y8y37ynwo_1747813263.html", "title": "Kenya keeper suspended amid match-fixing investigation", "title_page": "Patrick Matasi: Kenya keeper suspended amid match-fixing investigation - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Kenya goalkeeper Patrick Matasi has been provisionally suspended from all football activity in the country for 90 days amid an investigation into allegations of match manipulation.\nFootball Kenya Federation (FKF) took the decision on Thursday evening, hours after the governing body announced it had launched an investigation into the 37-year-old.\nThe case arose after a video posted online appeared to show the keeper agreeing a deal to influence the outcome of a game.\nThe BBC has not been able to verify the video, which is undated.\nMatasi plays for Kenyan Premier League club Kakamega Homeboyz and has won over 30 international caps.\nHe has not responded to multiple requests for comment.\nThe owner of Kakamega Homeboyz, Cleophas Shimanyula, said that Matasi denied the allegations.\n\"He was shocked at what he was seeing in the video and he told me he doesn't know about match-fixing,\" Shimanyula told BBC Sport Africa.\n\"Kakamega Homeboyz is against any form of match manipulation.\"\nMatasi's most recent appearance for Kenya came in a 2025 Africa Cup of Nations qualifier against Cameroon last October.\nThe Harambee Stars lost the game 4-1.\nThe FKF said it would work with world governing body Fifa, the Confederation of African Football and other \"relevant authorities\" during its investigation.", "url": "https://www.bbc.com/sport/football/articles/ce8y8y37ynwo"}