{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:54:43", "date_modify": "2025-04-26 07:54:43", "date_publish": "2025-02-25 00:00:00", "description": "Follow what Barry said as he talked to the media for the first time since being appointed interim manager at Rangers.", "filename": "sport_football_live_cn5wdzerqv1t_1745654083.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_cn5wdzerqv1t_1745654083.html", "title": "Rangers: Barry Ferguson speaks after being named as Philippe Clement's successor", "title_page": "Rangers: Barry Ferguson speaks after being named as Philippe Clement's successor - BBC Sport - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Bye for now\nBarry Ferguson cut an assured figure back at the club he knows so well.\nHe said he will be judged on results though, and that starts tomorrow at Kilmarnock.\nWe'll have live coverage of that game and four others in the Premiership, in addition to tonight's match between Celtic and Aberdeen.\nThanks for joining us, and make sure you subscribe to our dedicated Rangers page if you aren't already.\n'Cheap band aid' or 'one of best things in a long time'?\nSome of you have been sending in your thoughts on Barry Ferguson's appointment via our Rangers page...\nLeslie: Great to see Barry and Allan McGregor back, legends, true Rangers men.\nFraser: I had almost given up with Rangers after this disastrous season, but the appointment of these four legends could be one of the best things to happen to the club in a long time. Four naturally gifted players, three of whom played under Dick Advocaat. Barry has always been a class act. Neil McCann and Billy Dodds always give 100 per cent and McGregor was a top keeper!\nGordon: This is a band aid based on the fact that all are cheap and available, the problems run far deeper than the men on the touch line and are systemic and established over many years. The American investment cannot come quick enough but it will take many years to redress the current decline and get some silverware in the door.\nLex: Graeme Souness, Ally McCoist, Walter Smith, Steven Gerrard, none of them had a career as top managers and did okay. Ferguson, like all of them has limited experience but who cares, this is only an interim position so not having experience means nothing. Good luck to him and his staff.\nTom: This is further proof that the problems stem from the board and that the only hope is the American takeover. The managerial experience of Ferguson and McCann would not get them an interview let alone a job at any ambitious team.\nFerguson can be a 'lightning rod' for Rangers\nFormer Rangers defender Maurice Ross believes Ferguson, 47, can be a \"lightning rod\" and drive standards at a club languishing 13 points behind Premiership leaders Celtic but with a Europa League last-16 tie against Fenerbahce looming.\nSpeaking on the BBC's Scottish football podcast, Ross said of his former team-mate's appointment: \"It will give a bit of excitement, a bit of energy back into the building again.\n\"And it's something I did notice when I've been back at the club for the last three, four months. There was a lack of Rangers people in the building. There was a lot of suits.\n\"When you look at the appointment in isolation, Barry's going to be the kind of lightning rod, similar to the way that Steven Gerrard was.\n\"I also know Neil McCann is a very capable coach. It feels like they're going back to the people that were in the building when Rangers were successful. And that comes with behaviours, attitudes, certain standard setting.\"\nFerguson not thinking about long-term prospects\nThe new Rangers boss is emphatic when asked about the prospect of taking the job on a permanent basis should he succeed in interim charge.\n\"I've not even thought about that,\" he said, bluntly.\n\"My mindset is getting a result against Kilmarnock tomorrow. It's one game at a time. A lot of games coming up... no, my thoughts are, I'm here until the end of the season and I'm going to give it everything I've got to try and get results for this football club.\"\nFerguson sees promising signs at training\nOn Rangers' recent performances, Ferguson says he could see the players were \"low in confidence\" when watching them lose to St Mirren on Saturday.\n\"It's my job to get a response and I certainly got that in training today,\" he continues.\n\"They needed to give me a reaciton and certainly did. I couldn't have asked for any more.\n\"I an confident I will get a rise out of them.\"\n'This needs to be a different Rangers team'\nFerguson was asked what would constitute a success between now and the end of the season:\n\"We have to try to be positive and win every single game,\" he said. \"That's a big ask but I'm positive. We need positivity about the place.\n\"This needs to be a different Rangers team that turns up tomorrow night. My main objective is to start winning games on a consistent basis.\n\"This club is built on winning trophies. We're still in one trophy, but domestically we need to have a level of consistency. That's where it starts.\"\nMcInnes on Ferguson\nLewis Irons\nBBC Scotland presenter\nKilmarnock manager Derek McInnes has been speaking about Wednesday's visit of Rangers.\nI asked him about what he’ll expect from Barry Ferguson and his coaching team given how well he knows them, having been a former Ibrox player himself.\n“First and foremost I think it’s only right to touch on Philippe Clement,\" McInnes said. \"No manager likes to see another manager lose his job. He handled everything with class and dignity.\n“On Barry, what I do know from my time playing with him is he was fiercely competitive and and he’ll look to use that to pick up the players.”\nMcInnes was also asked about his name being linked with the Rangers job but insisted his focus is on doing the best for Kilmarnock, and that any outside noise is irrelevant.\n'I wouldn't be here if I didn't feel ready'\nFerguson last held a management role at part-time Alloa Athletic three years ago. The new Rangers boss was asked whether he felt ready to assume the top job at his boyhood club.\n\"I wouldn't be siting here if I didn't. I went down a different route, I came back and did a different role for the club as an ambassador.\n\"Did I want to get back into coaching and management? If I'm being brutally honest, I wasn't thinking about I, but when that phone call comes, there was no way I was going to turn it down.\n\"I am desperate to get started. I loved being out on the grass today with the players and can't wait to be on the touchline tomorrow.\"\nCoaching staff will 'get in amongst the boys'\nFerguson has selected former Rangers team-mates Neil McCann and Billy Dodds, and stalwart ex-goalkeeper Allan McGregor to assist him in his interim spell.\n\"Neil and Billy have got experience of managing at a good level,\" he said. \"Alongside Allan, they played with the club, know the demands and expectations, so that was important to me as well.\n\"They are bubbly about the place, big characters, like to get in amongst the boys and that's important because the last couple of weeks has been difficult for this group. It was important I got the right people in.\n\"They are not yes men.\"\n'Players gave me a reaction'\nFerguson was clear on the high standards he expects.\n\"I was straightforward with the players,\" he said. \"This is a brilliant place to be. You're lucky to be here. Look at the facilities, look at the stadium. I feel like it's going to be a good place to be.\n\"I felt a difference today and it's important for me to carry that on.\n\"I love being out on the grass and I can't wait to be on the touchline.\n\"I need to get a kick out of these guys and they certainly gave me a reaction this morning. I couldn't have asked more of them.\n'Judge me at the end of the season'\nFerguson is asked about critics of his appointment, some of whom suggest he does not have the requisite experience for such a big role.\n\"Judge me at the end of the three months,\" he replied. \"Everyone is entitled to their opinion. I have no issue with that.\n\"One thing they will get from me and my staff is I am not taking this lightly, I'm taking this seriously and that will start tomorrow night against Kilmarnock.\n\"I would rather be judged come the end of the season but I know I will be judged game by game. This is the nature of the beast here at Glasgow Rangers.\"\nTavernier will remain captain\nAsked whether James Tavernier would remain captain, Ferguson replied: \"Yes.\"\nWhen pushed on why keeping the armband with the Englishman, he said:\n\"I don't think there was any need to change. I had a good chat with James last night, he came in while we were in getting to know some of the staff and surroundings.\n\"It was good to get a good sit-down with him, spoke to him, looked him in the eyes and have no doubt he will give me 100% to lead this club until the end of the season.\"", "url": "https://www.bbc.co.uk/sport/football/live/cn5wdzerqv1t"}