{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:10:10", "date_modify": "2025-05-21 07:10:10", "date_publish": "2025-03-30 11:03:42", "description": "Hampshire draft in Brett Hampton for the first two months of the County Championship season after all-rounder Jack Edwards' injury.", "filename": "sport_cricket_articles_cvg7epppxnwo_1747811410.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/33f4/live/5eaa2160-0d53-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cvg7epppxnwo_1747811410.html", "title": "Brett Hampton: Hampshire sign all-rounder to replace Jack Edwards", "title_page": "Brett Hampton: Hampshire sign all-rounder to replace Jack Edwards - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Hampshire have drafted in New Zealander Brett Hampton for the first two months of the County Championship season after all-rounder Jack Edwards was ruled out through injury.\nAustralian Edwards had been signed as one of the county's overseas players, but sustained a knee injury playing for New South Wales in the Sheffield Shield and faces a minimum recovery period of six weeks.\nHe will be replaced by 33-year-old Hampton, a right-handed batter and medium-fast seamer who has played first-class cricket for Northern Districts for the past decade.\nIn this season's Plunket Shield, Hampton has scored 581 runs and taken 23 wickets, with his overall first-class averages standing at 30.66 and 27.70 respectively with bat and ball.\n\"I'm excited to come and play in the County Championship,\" Hampton told Hampshire's website, external.\n\"The team had a great campaign last year so hopefully I can help the club push for the title. I look forward to joining up with the rest of the squad in a few days' time.\"\nHampshire, who were runners-up in Division One last season, begin their new red-ball campaign at home to Yorkshire on Friday.", "url": "https://www.bbc.com/sport/cricket/articles/cvg7epppxnwo"}