{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:37:52", "date_modify": "2025-05-21 07:37:52", "date_publish": "2024-12-23 18:55:14", "description": "Manchester United manager Ruben Amorim questions the \"choices\" of people close to forward Marcus Rashford after he said he was ready for a \"new challenge\".", "filename": "sport_football_articles_c390p9n18mlo_1747813072.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5136/live/5775b440-c154-11ef-b200-e594162e2327.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c390p9n18mlo_1747813072.html", "title": "Marcus Rashford: Man Utd boss Ruben Amorim questions 'choices' of people surrounding forward", "title_page": "Marcus Rashford: Man Utd boss Ruben Amorim questions 'choices' of people surrounding forward - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester United manager Ruben Amorim has questioned the \"choices\" of people close to forward Marcus Rashford.\nRashford, 27, said he was \"ready for a new challenge\" in an interview after being dropped for the 2-1 win at Manchester City on 15 December.\nThe England international subsequently missed the 4-3 Carabao Cup quarter-final defeat by Tottenham and was also left out as United lost 3-0 to Bournemouth on Sunday, adding to speculation he could leave Old Trafford in January.\n\"It is a hard situation,\" Amorim told Sky Sports., external\n\"I understand these players have a lot of people around them, making choices that are not the first idea from the player.\n\"They chose to do the interview as it is not just Marcus.\"\nRashford has scored 138 goals in 426 appearances for the club since making his debut in 2016, having come through the United youth ranks.\nHowever, while he managed 30 goals in all competitions in 2022-23, he has struggled for form in three of the previous four seasons and attracted criticism from pundits and fans for a number of laboured displays during that time.\nAmorim said he can \"separate\" the decisions of those advising Rashford from his relationship with the player.\n\"At the moment I'm focused on improving Marcus,\" he added.\n\"We need a talented guy like Marcus. I forget the interview now and see what I see on the pitch.\"\nRegarding Rashford's future, the Portuguese boss said it is for him and the club \"to deal with that when the time comes\".\nSpeaking to the wider media before United face Wolverhampton Wanderers on Thursday, Amorim denied the talk around Rashford was a distraction, adding: \"Some guys have a big responsibility here because they have been here for a long time.\n\"If you have big talents, [we need] big performances, big responsibility, big engagement to push everybody forward in this moment. Like any other player, [we want him to be] the best he can be.\n\"This is maybe one of the lowest moments in our club. We have to face it and be strong.\"\nUnited's humbling defeat by the Cherries means they head into Christmas in 13th place in the Premier League, after Wolves they host Newcastle on 30 December.\nIt will be their lowest position in the table at this stage since they were 15th in 1986, just over two months into Sir Alex Ferguson's reign as manager.\nAmorim had to halt his post-match news conference on Sunday because of a leak in the ceiling of the press room.\nAsked later how he intended to reverse fortunes at Old Trafford, the former Sporting coach pointed to the ceiling and said: \"If I knew, I would solve all the problems of this club, even this.\n\"I know what I am going to do. That is so clear for me. I will not say I feel relaxed because I'm really frustrated. It's a very difficult moment but we will solve problems step by step and find answers for everything.\"", "url": "https://www.bbc.com/sport/football/articles/c390p9n18mlo"}