{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:35:54", "date_modify": "2025-04-26 03:35:54", "date_publish": "2025-03-08 00:00:00", "description": "Lorent Tolaj's stoppage-time penalty rescues a point for Port Vale away to fellow play-off hopefuls Fleetwood.", "filename": "sport_football_live_c234m33228xt_1745638554.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9a5c/live/37e33e90-f8ea-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_c234m33228xt_1745638554.html", "title": "Fleetwood Town 1-1 Port Vale", "title_page": "Fleetwood Town 1-1 Port Vale - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Lorent Tolaj's stoppage-time penalty rescued a point for Port Vale away to fellow play-off hopefuls Fleetwood.\nRyan Graydon's 81st-minute goal looked to have inflicted a first league defeat of 2025 on Vale, but midway through seven added-on minutes, Tolaj kept his cool to score from the spot.\nThe first-half chances all went Fleetwood's way, but they failed to capitalise. Graydon saw his effort saved by Ben Amos, while headers by Elliot Bonds and Mackenzie Hunt cleared the crossbar.\nFleetwood had a strong penalty shout when Amos spilled a ball in the box and Graydon nudged it clear, only to tangle with the keeper in the ensuing chase. Referee Bobby Madley waved away the appeals.\nFurther chances came and went for the hosts after the break, not least when Hunt met Ryan Broom's cross to the back post but missed the target again.\nDanny Mayor and Phoenix Patterson both fired over for Fleetwood, while Nathan Smith, George Byers and Mitch Clark all missed chances for Vale.\nFleetwood somehow survived a frantic goalmouth scramble and broke away in the 81st minute. Owen Devonport then slid in Graydon who finished coolly.\nBut, in the fourth minute of stoppage time, Madley spotted Patterson's foul on Ethan Chislett and Tolaj found the net from 12 yards.", "url": "https://www.bbc.co.uk/sport/football/live/c234m33228xt"}