{"authors": ["Francis Keogh", "www.facebook.com"], "date_download": "2025-05-21 04:15:46", "date_modify": "2025-05-21 04:15:46", "date_publish": "2025-04-05 18:41:07", "description": "Willie Mullins says he has reached the peak of his career as a trainer after his jockey son Patrick leads home an unprecedented 1-2-3 in the Grand National.", "filename": "sport_horse-racing_articles_cly1n5lg09no_1747800946.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/81da/live/c1ce3910-1240-11f0-b234-07dc7691c360.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_horse-racing_articles_cly1n5lg09no_1747800946.html", "title": "Grand National 2025: Willie Mullins savours Nick Rockett victory", "title_page": "Grand National 2025: Willie Mullins savours Nick Rockett victory - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tearful Willie Mullins said he had reached the peak of his record-breaking career as a trainer after his jockey son Patrick led home an unprecedented 1-2-3 in the Grand National.\nVictory confirmed the dominance of the Irish trainer, who saddled five of the first seven home, including winner Nick Rockett.\nHe is now odds-on to repeat his landmark success of last year by winning the British championship again.\n\"This is the summit for me, I don't think it can get any better than this. It's just huge. It's like something out of a Disney film,\" he said.\nNick Rockett won at Aintree from last year's winner I Am Maximus with fellow stablemate Grangeclare West in third.\nWillie is normally coolness personified, the even-tempered master of jump racing.\nLast year, when he became the first trainer to saddle one hundred career winners at the Cheltenham Festival, he gave a tip of his trilby and a wave to the crowd.\nBut this was different. This was family.\n\"I don't know if I gave him a cheer, I was just speechless. I just broke down completely. I did for about 20 minutes after. I just couldn't help it, I just completely lost it,\" the 68-year-old told BBC Sport.\nMullins, who plans to have runners at big meetings including Ayr and Sandown as he chases the trainers' title, said it was like being manager of a World Cup football team and your son getting the winning goal.\n\"It just doesn't get any better,\" he said.\nPatrick, 35, is an amateur rider as a sideline to being his father's assistant at a training establishment in County Carlow that stands head and shoulders ahead of its jump racing rivals.\nStanding at 6ft 1in tall, Patrick's height and weight of about 11st 7lb limit the rides he can take, but the rocket that is Nick Rockett proved the ideal conveyance.\n\"To have one horse run in the National, but then to have one your son can ride is millions, millions, millions-to-one what happened today,\" said Willie.\n\"It is just something else to be able to leg up your son in the greatest race of all time. You dream of winning it yourself but to dream of putting your son up - when he was born I said he couldn't be the jockey the size of him, but he's turned out to be a fantastic jockey.\"\nPatrick is a student of the game, and the big race itself - devouring books on the history of this unique contest.\n\"I know the names of people who won the National nearly 200 years ago so to join that list is mind-blowing,\" he said, after winning the 177th running.\nThe Jockey Club said both long-time leader Broadway Boy, a heavy faller on the second circuit, and Celebre D'Allen - who was pulled up - were walked on to horse ambulances after being assessed on course by vets and taken to the racecourse stables for further assessment.", "url": "https://www.bbc.com/sport/horse-racing/articles/cly1n5lg09no"}