{"authors": ["George O'Neill", "www.facebook.com"], "date_download": "2025-04-26 06:39:51", "date_modify": "2025-04-26 06:39:51", "date_publish": "2025-03-02 15:32:58", "description": "Hibs 2-1 Hearts: Analysis", "filename": "sport_articles_ce8y0963069o_1745649591.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d8b1/live/5e0aaa10-f77b-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_ce8y0963069o_1745649591.html", "title": "Hibs 2-1 Hearts: Analysis", "title_page": "Hibs 2-1 Hearts: Analysis - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The full-time scenes at Easter Road reflected the high everyone associated with Hibs are on just now.\nSunshine on Leith was belted out again with most home fans staying to celebrate with the players, who stood arm-in-arm, soaking it all in.\nDavid Gray's name was also chanted in unison - and little wonder given the scale of the turnaround he has orchestrated.\nFrom the foot of the Premiership to third - the form team in the country, who seem capable of positive results from any position.\nThey plan to take 7,000 fans to Celtic Park for next weekend's Scottish Cup quarter-final. The fanbase sense something special happening under Gray - and who can blame them?\nAgainst their city rivals, they were below-par in the opening 45 minutes. There were some shaky moments at the back and several passes failed to find their mark against a well-organised Hearts side.\nHowever, this team are not used to being second best and they went up a gear after the break.\nNicky Cadden's delivery from the left has been a feature of this long unbeaten run and he drove standards down that flank, creating two or three opportunities from nothing.\nHibs penned Hearts in their own half and, with just over 15 minutes remaining, they got their just rewards.\nJack Iredale will likely never score a better goal. It was a moment that will live long in the memory for both him and all Hibs fans.", "url": "https://www.bbc.co.uk/sport/articles/ce8y0963069o"}