{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:41:06", "date_modify": "2025-04-26 06:41:06", "date_publish": "2025-03-02 12:57:27", "description": "Limerick fighter Paddy Donovan says he has already requested a rematch after his controversial disqualification in his IBF world title eliminator against Lewis Crocker.", "filename": "sport_boxing_articles_cx2eq7y9273o_1745649666.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/49c1/live/9b603480-f75c-11ef-8fce-3183a71a7f8c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_boxing_articles_cx2eq7y9273o_1745649666.html", "title": "Lewis Crocker v Paddy Donovan: Paddy Donovan wants rematch after controversial disqualification", "title_page": "Lewis Crocker v Paddy Donovan: Paddy Donovan wants rematch after controversial disqualification - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Paddy Donovan says he has already requested a rematch after his controversial disqualification in an IBF world title eliminator against Lewis Crocker.\nReferee Marcus McDonnell called time on a thrilling contest in Belfast in the eighth round because Donovan hit Crocker after the bell.\nThe Limerick fighter earlier had points deducted in rounds six and eight for use of the elbow and head, and was critical of McDonnell.\n\"The referee was a disgrace, he has damaged my career, but I will be back,\" Donovan told BBC Sport NI.\n\"My manager has put in for an automatic rematch and we have put in an appeal with the IBF. Let's get the rematch back on the road.\"\nDonovan was visibly distraught in the ring after the dramatic end to a fight he seemed to have been edging before the frantic finish.\nThe 26-year-old initially thought he had secured the knockout before realising McDonnell had disqualified him for his first professional loss.\n\"It's hard to put it into words, I have worked very hard for this, it is an emotional time,\" added Donovan.\n\"I thought I had Lewis gone, I dropped him and went in for the finish. I landed the combination, didn't see the ref or hear the bell, continued with the combination and thought I knocked Lewis out.\n\"From start to finish I dominated, I felt strong and composed did everything I was supposed to do, it was unfortunate the way it ended.\"\nMatchroom boss Eddie Hearn said Donovan's disqualification was a result of a build-up of offences in the fight.\n\"I'm still trying to get my head around what has happened, and it is difficult for me because I represent both of them,\" he explained.\n\"Paddy has been saying to me, 'you need to back me I should never have been disqualified', and Lewis will be saying, 'he hit me after the bell you have to back me'.\n\"All I can do is be honest, Paddy landed the shot after the bell. If it's an isolated incident, I don't think he gets disqualified, I think the referee gives Lewis time to recover and the fight continues, but the headbutts and the points deductions are all mixed in.\"\nHearn believes Donovan will be \"kicking himself\" with the manner of the defeat, irrespective of the controversy.\n\"Ultimately, Paddy threw the fight away, he just dropped Lewis, he was on the way to victory, he was boxing really well,\" he added.\n\"The only rounds Lewis had on him were those that Paddy had a points deduction. I think Lewis can perform a lot better than that, but Paddy was exceptional.\"\nHearn also wanted to see a rematch, potentially at Windsor Park, given the fight sold out the SSE Arena.\nHe conceded, however, the IBF's decision will dictate what happens next and Northern Irishman Crocker could easily reject a rematch, given the 28-year-old now has a chance of a world title fight.\n\"I am going to talk to Lewis about a rematch, I would like to see it, but I also understand there is an opportunity for him to fight for a world title,\" Hearn added.\n\"I think it will come down to the IBF. If they order a rematch, the rematch is on. If not, maybe Lewis sits back and says, 'no I'm good thanks', and waits for his shot at the world title.\"", "url": "https://www.bbc.co.uk/sport/boxing/articles/cx2eq7y9273o"}