{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:23:32", "date_modify": "2025-05-21 05:23:32", "date_publish": "2025-04-03 15:23:26", "description": "After BBC Radio Lancashire's exclusive interview with senior figures at Blackburn Rovers, what did we learn about the club's fortunes on and off the pitch?", "filename": "sport_football_articles_c4g323w7yg7o_1747805012.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6022/live/f459e700-1086-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c4g323w7yg7o_1747805012.html", "title": "Blackburn Rovers: Five things we learned from BBC Radio Lancashire's interview with senior club staff", "title_page": "Blackburn Rovers: Five things we learned from BBC Radio Lancashire's interview with senior club staff - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Blackburn Rovers chief executive Steve Waggott, chief operating officer Suhail Pasha and head of football operations Rudy Gestede sat down with BBC Radio Lancashire earlier this week with plenty said during an extensive interview.\nThe interview, which lasted for over an hour, covered plenty of subjects relating to the club including Waggott and Pasha saying that owners Venky's do not want to sell the club and have not received any concrete offers.\nBut what else did we learn from BBC Radio Lancashire's interview with the trio?\nHere are five things we found out.\nOff the back of a torrid 2023-24 campaign which saw Blackburn battle to preserve their Championship status, the first half of this season was much brighter.\nUnder John Eustace, the club challenged in the top six in the lead up to Christmas and strung together six straight wins between November and December.\nDuring January the club brought in six players - centre forwards Augustus Kargbo, Cauley Woodrow and Emmanuel Dennis, midfielder Adam Forshaw, left-back Yuri Ribeiro and centre-back Dion Sanderson.\n\"We tried to back John Eustace's needs on the pitch,\" Gestede said.\n\"We brought in Dion Sanderson, Adam Forshaw and Augustus Kargbo who can bring some speed. Cauley Woodrow's got Premier League experience and all around the pitch football intelligence. So we think we did a good job to back John.\"\nEustace left the club, with Rovers fifth in the table and continuing to mount a push for the play-offs, to join relegation-threatened Derby County in February.\nIt was a move which raised eyebrows over why Eustace wanted to leave to join a club at the opposite end of the table.\nIn an interview with East Midlands Today, Eustace later said that despite managing Derby being a difficult job, he was attracted by the \"bigger picture\" of \"the next three or four years\" with the Rams.\nAsked whether the club would pursue players if Eustace had stated he did not want to sign them, Gestede said: \"He said no to some targets that we had.\"\nIn a follow-up question, when pressed on whether Eustace had said he did not want to sign any of the six players brought in, Gestede said: \"All the players that came, John Eustace didn't say no.\"\nA protracted court case in India by the Indian ministry of finance against the club's holding company has rattled on for 18 months.\nThe Court of Delhi has pushed back the hearing, external against VHPL, Venky's parent company six times since 2024.\nThe most recent hearing pushed the case back to 5 August, but in the mean time, the club must guarantee all income sent to the club.\nAsked whether the court case is making a difference to whether money can come into Blackburn Rovers from India, Pasha said: \"No, we will get the money. We have interim relief, we can get funding in from India.\n\"The court case is not against Blackburn Rovers, it's against the holding company which has been challenged and the court has given us interim relief where they have allowed us to spend money or send money overseas to Blackburn Rovers.\n\"Obviously there is some restriction in terms of every pound that the owners give us, they need to give a guarantee for a pound, but we're trying to work and see what best we can do. So even in spite of that, I think we've got in the last two years about £18m in terms of funding from the owners, which again is backed by a pound guarantee.\"\nWhen questioned on whether the owners are hopeful the court case will soon come to an end, Pasha added: \"I think they're trying. But if you ask me, it's a country of 1.4 billion people with four high courts, and it doesn't operate the way the UK High Courts operate, where the set times are there.\n\"I hope we can get it resolved. But even if it doesn't get resolved, we have interim relief. We can send money overseas.\"\nIn March, a collection of Blackburn Rovers supporters groups called upon Waggott, Pasha and Gestede to stay away from the side's remaining games this season.\nThe groups believe these figures have become a target for frustrations at how the club is being run and their absence could result in a more positive environment for the team to perform in.\nIt is the latest example of a strained relationship between the fans and the club's ownership, which has been the case for much of Venky's tenure at Rovers.\nIn response, the club welcomed the call for unity, but insisted the senior leadership team would continue to attend matches.\nBlackburn have slipped to 11th in the Championship but are just five points adrift of the play-off spots with seven games remaining.\n\"It's a historical thing. It was way before I came in the club. The early days of Venky's taking on the club is well documented and I don't need to go over that. But there seems to be an undercurrent that keeps moving along,\" Waggott said.\n\"But it's my job as chief executive and head of operations at the club to try and engage with the fanbase. I've got to have dialogue and I've got to try and retrieve the situation as much as I can possibly can. My door's open.\n\"I'm in dialogue with the Action Group and there are emails back and forward on different things. And my door's open to keep talking through the issues and try to level things off because it's for the benefit of the club.\"\nPasha highlighted the contrast between last season and this season.\n\"We're not in a relegation scrap this year,\" Pasha continued. \"We're in a much better position than we've been previously. Obviously we need the supporters to back the team right now, because there's a lot to play for with five points off the play-offs.\"\nThe club moved to appoint Valerien Ismael as replacement for Eustace, but having spent the majority of the season in the top six, since the Frenchman's arrival, the club have slid down the Championship table.\nIsmael himself acknowledges that there is a wedge between the club and its fanbase as he aims to turn their form around and sneak into the play-off places before the end of the season.\nBlackburn have won just three games out of their past 14 in all competitions, with Ismael yet to register a victory since his arrival on 25 February.\nOf his five games in charge, Blackburn have lost four in a row after drawing their first. However Gestede believes it will take time for Ismael to implement his strategy.\n\"He didn't come and just try to change everything that John did at the club. So it's trying to support the squad to its best and make sure going forward he can start to implement some ideas,\" Gestede said.\n\"The performance and the result of the team have not been that great for a few months now. We know it's going to be a process to change things and that's why we have to support Valerien in this change implementing these ideas.\n\"The summer coming up is going to be very exciting because that's the time we can really implement what we want to do as a club.\"\nDefender Yuri Ribeiro signed a two-year deal on Thursday having joined on deadline day in February.\nBut there has been concern amongst fans over a lack of deals given to existing players in recent times.\nPortuguese Ribeiro is the only player to sign a contract extension at Ewood Park since Adam Wharton left to join Crystal Palace in the 2024 January transfer window.\nIn recent years, Ben Brereton Diaz, Darragh Lenihan and Ryan Nyambe have left at the end of their contracts, drawing criticism that Rovers have been unable to keep hold of promising players.\n\"The decision is just not for the club, it has to be for the players. With some players now it becomes a trend to run out of your contract. So you've got more opportunity at the end of the season,\" Gestede added.\n\"We've got discussions ongoing and we'll make sure to we find the right agreements if it's the case with the players.\n\"But we need to also to make sure those players are going to be with us for the next journey going forward.\"", "url": "https://www.bbc.com/sport/football/articles/c4g323w7yg7o"}