{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:22:11", "date_modify": "2025-05-21 07:22:11", "date_publish": "2025-05-20 07:24:02", "description": "Brighton 3-2 Liverpool: Fan views on Premier League game", "filename": "sport_football_articles_cvgnn3rmn3mo_1747812131.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cvgnn3rmn3mo_1747812131.html", "title": "Brighton 3-2 Liverpool: Fan views on Premier League game", "title_page": "Brighton 3-2 Liverpool: Fan views on Premier League game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your thoughts after Monday's Premier League game between Brighton and Liverpool.\nHere are some of your comments:\nBrighton fans\nCallum: Huge performance! Everyone played their part. I think a really big shoutout should go to 17-year-old Harry Howell, who came on at a pretty nervy point of the game and held on remarkably, even nearly getting an assist. Fingers crossed results go our way for Europe.\nGlyn: Brajan Gruda grew into a special player. He will be immense next season.\nOli: So impressive from that young midfield three of Yasin Ayari, Simon Adingra and Gruda over the past few weeks. Adingra looks revitalised after having a tough season. I think we are all very eager to see what they can produce next season especially if, fingers crossed, it's in Europe!\nLiverpool fans\nIan: I know we wrapped up the league two weeks ago, but this is getting embarrassing. Slot should realise people pay their hard-earned cash to watch games. We should be sending a message to the other teams by putting out the strongest team and beating these sides. I just hope the performance on Sunday is a much-improved one. I don't want it to spoil the celebrations with another defeat.\nWayne: Below-par performance yet again, this is the worst team to have won the Premier League title. I would be very surprised if we even qualify for the Champions League next season.", "url": "https://www.bbc.com/sport/football/articles/cvgnn3rmn3mo"}