{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:23:58", "date_modify": "2025-05-19 15:23:58", "date_publish": "2015-02-08 18:35:40", "description": "Managers Jackie McNamara and Stevie Aitken react to Dundee United's 3-0 Scottish Cup win at Stranraer.", "filename": "sport_football_31255654_1747668238.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/80870000/jpg/_80870021_uniteddow.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31255654_1747668238.html", "title": "Stranraer 0-3 Dundee Utd: McNamara hails 'clinical' finishing", "title_page": "Stranraer 0-3 Dundee Utd: McNamara hails 'clinical' finishing - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manager Jackie McNamara was full of praise for the ruthless finishing that sent Dundee United into the quarter-finals of the Scottish Cup.\nThe Tannadice side fired three goals past Stranraer in 10 first-half minutes to secure a 3-0 victory at Stair Park.\nChris Erskine opened the scoring and Ryan Dow added two well-taken goals.\n\"I thought we were clinical in the first half,\" said McNamara.\n\"Second half was more scrappy and more kick and rush but you have to give Stranraer credit for that.\n\"Although it was not pretty the most important thing from our point of view is that we are in the draw tomorrow.\n\"I thought Ryan's two goals were excellent. His first one was clever to get inside and then the second was a great pass and then composure to go round the keeper and slot it. I think it settled us down.\"\nUnited, who reached the League Cup final last weekend, moved ahead 21 minutes when Erskine picked up on an errant pass to run through and squeeze a shot through the legs of goalkeeper David Mitchell.\nDow capitalised on a slip from Scott Rumsby to make it 2-0 with an cool, lofted finish before rounding the keeper three minutes later after a through-ball from Nadir Ciftci.\nStranraer had a header cleared off the line by Ryan McGowan before the break but rarely troubled United keeper Radoslaw Cierzniak.\nAnd United could have extended their lead in stoppage time but Charlie Telfer's free-kick was brilliantly saved by Mitchell.\nStranraer boss Stevie Aitken did not think his side deserved to lose by a three-goal margin.\nHe said: \"It was clinical, no doubt about that. They have been clinical all season. It's not just today, they done it against Premiership teams all season.\n\"I'm disappointed with the way we lost the goals, especially the first two, but I thought overall we competed well.\"", "url": "https://www.bbc.com/sport/football/31255654"}