{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:32:55", "date_modify": "2025-05-20 12:32:55", "date_publish": "2023-08-04 09:53:16", "description": "Arsenal: Can Arsenal stop Man City dominance?", "filename": "sport_articles_cpv7l0ekg3qo_1747744375.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ca5f/live/8f1f4d50-32a5-11ee-9217-27b202a39e56.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cpv7l0ekg3qo_1747744375.html", "title": "Can Arsenal stop Man City dominance?", "title_page": "Arsenal: Can Arsenal stop Man City dominance? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Harvey Downes, Opta\nArsenal will look back on 2022-23 as both a missed opportunity and a sign of significant progress under manager Mikel Arteta. Despite occupying top spot for a record number of days in a top-flight season without actually winning the title, the Gunners exceeded expectations, posting their highest points tally since the Invincibles in 2003-04.\nA combination of different factors led to the unravelling of Arsenal's title challenge last season, with William Saliba's untimely injury and a lack of quality depth outside of the favoured starting XI proving costly. As a result, Arteta and Arsenal sporting director Edu have attacked this summer's transfer window with real intent, getting the bulk of their business done early, addressing key positions with the impressive signings of Kai Havertz,Jurrien Timber and Declan Rice.\nThe importance of getting off to a fast start cannot be underestimated. The Gunners won nine of their first 10 games last season, laying the foundations for their title charge.\nUsing Opta's power rankings, we're able to assess the difficulty of each side's start to the campaign. The Gunners open the season with games against Nottingham Forest, Crystal Palace, Fulham, Manchester United and Everton, the fifth-easiest start with an average opponent ranking of 57.4 over the first five games, giving cause to be optimistic that they will start as well as last season.", "url": "https://www.bbc.com/sport/articles/cpv7l0ekg3qo"}