{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:45:23", "date_modify": "2025-05-20 13:45:23", "date_publish": "2023-07-25 13:02:06", "description": null, "filename": "sport_articles_cev8n2jy0ewo_1747748723.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d1ba/live/f48f2600-2aea-11ee-b1d7-8fdc93c2782e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cev8n2jy0ewo_1747748723.html", "title": "BBC Sport", "title_page": " - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked you for your thoughts on Rangers' potential Champions League qualifier opponents, and you provided a mixed bag.\nHere's what you had to say on the draw:\nTracey: I think we have a good chance of getting a result against either team and progress to the playoffs and get into CL group stages. It’s a different team to that of last year and I am looking forward to seeing the team do well.\nMarko: Genk will easily beat Servette and breeze past Glasgow Rangers. Joseph Paintsil will likely score against a poor Rangers defence.\nAllan: Before the draw was made, I looked at the teams we could draw and Genk and Servette were the best teams to play. I'm confident that with these two teams we'll get a result.\nDave: Rangers are starting to look like a team that could come away with some points in the group stages against better teams. Send it on.\nRobert: It’s obviously a test that will see if we’re equipped for Champions League competition. If we don’t get through then Europa League will more than suit us. Bring it on.\nFrazer: Confident with any of the teams that we could have drawn but still need to give either of these two respect. The pressure will be on and a lot of the new guys will feel it.\nBeale has been backed well by the board financially and will need to reward that.\nGerald: The tougher the opposition, the better we play. We should not take anyone for granted nor should we fear anyone.\nWith a new squad and what looks like a good squad, the manager will have to figure out his best 11 quickly as these matches come before any settling in time or any competitive matches under our belts.\nRonnie: To be honest after last seasons horror show in the group stages I would rather see us in the Europa League.\nHowever, it's all about the money. Europe is a cash cow. The only trophy I'm concentrating on is the league. Win that and I won't care about any cup competitions.\nJohn: There seems to be a feeling we have an easy draw, in my opinion there is no such thing in European football now.\nTechnically, they will be better than us and perhaps likely to be more street wise when a cool head is needed.", "url": "https://www.bbc.com/sport/articles/cev8n2jy0ewo"}