{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:19:01", "date_modify": "2025-04-26 04:19:01", "date_publish": "2025-03-04 00:00:00", "description": "All the latest football news and reaction to the FA Cup fifth-round tie as Nottingham Forest beat Ipswich plus build-up as the last-16 of the Champions League begins.", "filename": "sport_football_live_cn9vj42j1g7t_1745641141.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d252/live/7a261c60-f907-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_cn9vj42j1g7t_1745641141.html", "title": "FA publish written reasons for Slot ban & clubs set for Champions League last-16 - latest", "title_page": "FA publish written reasons for Slot ban & clubs set for Champions League last-16 - latest - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Catch up on today's news\nPlenty to unpack from today's news.\nTo look back on all that then click on the links below:\nFA publish written reasons for Slot's two-match ban\nChampions League last-16 ties begin: Opta predicts Liverpool win\nClub Brugge v Aston Villa (17:45 GMT): Emery's comments\nPSV v Arsenal (20:00 GMT): Arteta's comments\nFollow our Champions League live text from 16:45 GMT using this link.\nDortmund and Lille's journey so far\nBorussia Dortmund v Lille (20:00 GMT)\nBorussia Dortmund won five of their league phase games, finishing 10th on the table, they played Celtic in the knock-out round where they won 3-0 on aggregate.\nIn the Bundesliga, Dortmund are 10th, winning just 10 games out of the 24 played.\nLille's journey in the Champions League began with the qualifying and play-off rounds before the league stage. They have also won 5 games in the league stage, including a 1-0 win over Real Madrid.\nIn Ligue 1, Lille are currently fifth, winning 11 games out of 24.\nThe winner of the round of 16 will face either Benfica or Barcelona in the quarter-final.\nKylian to star again?\nReal Madrid v Atletico Madrid (20:00 GMT)\nKylian Mbappe's brilliant hat-trick inspired holders Real Madrid to a comfortable victory over Manchester City and place in the last 16.\nPep Guardiola's side were attempting to reverse a 3-2 deficit from the play-off first leg, but lost 3-0 at the Bernabeu.\nReal Madrid struggled in the league phase, losing three of their eight games, before kicking to gear in the knockout phase.\nAtletico Madrid finished fifth in the league phase after six wins to comfortably qualify for the last 16.\nThe story of Real Madrid's 'La Decima' win\nReal Madrid v Atletico Madrid (20:00 GMT)\nReal Madrid faced city rivals Atletico Madrid in the 2014 Champions League final.\nFor Real it was a chance to secure a long sought-after 10th European title, known to fans as 'La Decima' - but what really happened behind the scenes on one of the most famous nights in the club's history?\nA rerun of that classic happens later.\n'The first game will not determine who gets through'\nPSG v Liverpool (Wed, 20:00 GMT)\nParis St-Germain\nParis St-Germain\nParis St-Germain manager Luis Enrique on the importance of playing the first leg at home: \"The first game will not determine who gets through.\n\"If we were to lose at home and then win [and qualify] at Anfield, of course I would take that.\"\n'Liverpool have three fighter jets in attack' - Enrique\nPSG v Liverpool (Wed, 20:00 GMT)\nParis St-Germain\nParis St-Germain\nParis St-Germain manager Luis Enrique, speaking to the media ahead of his side's game against Liverpool: \"It will be intense. On paper, it is one of the best matches you can watch in Europe. They're one of the best teams in terms of counter attacking.\n\"We have to be careful that we don't suffer from their transitions. They have three fighter jets in attack, it's not easy to stop them if we don't impose our game on them.\"\n\"We will need the ball. Maybe we're not as tough physically but we are one of the best teams in possession in Europe.\"\nWhat has Slot said in the aftermath?\nSpeaking at a press conference last month, Liverpool manager Arne Slot said: “I think what happened was that the extra time, that additional five minutes that ended up being eight, a lot happened, and the emotions got the better of me.\n\"If I look back at it I would love to do it differently. I am hoping to do it differently next time as well.”\nWhen will Slot return to the touchline?\nFollowing the two-game touchline ban, Liverpool boss Arne Slot missed the league leaders' home game with Newcastle last Wednesday.\nHe will also not be on the touchline for the visit of Southampton on 8 March.\nSlot however will be in the technical area for the Champions League last-16 first-leg tie with Paris St-Germain tomorrow, as the ban is for domestic matches only.\nSlot's first domestic game back in the dugout will come after the international break when Liverpool face Newcastle in the Carabao Cup final on 16 March.\nAs for his Premier League return? That comes against Everton on 2 April at Anfield. Tasty.\nWhat did Hulshoff say?\nLiverpool's assistant manager Sipke Hulshoff has also been alleged to have entereed the field of play at full-time in an \"extremely aggressive manner.\"\nHulshoff was also alleged to have made comments to referee Michael Oliver, including that the referee was \"[expletive] [expletive]\", and \"gave them everything\" in relation to Everton and that was a \"[expletive] disgrace.\"\nHulshoff was later alleged to have followed Oliver, contuing to shout \"[expletive] [expletive]\" at Oliver before the referee sent him off.\nWhat is Slot alleged to have said?\nWhile shaking the hand of referee Michael Oliver, the report alleges that Slot used abusive words towards Oliver.\nSlot is alleged to have said to Oliver that he \"[expletive] gave them everything\" in relation to Everton. It also alleged that Slot said to Oliver that he hoped he was \"proud of that performance.\"\nSlot is also stated to have said \"if we don't win the league, I'll [expletive] blame you\" before shouting \"a [expletive] disgrace\" twice at Oliver.\nFA publish written reasons for Slot's two-match ban\nThe Football Association (FA) have published their written reasons for the two-match touchline ban and £70,000 fine Liverpool manager Arne Slot received following his red card at the end of Everton's 2-2 draw with Liverpool last month.\nThe report states that Slot's manner was \"confrontational and aggressive\" when approaching referee Michael Oliver.\nWe will bring you the details of what Slot allegedly said to Oliver next.\nFistbumps and American footballs at Forest\nNottingham Forest 1-1 Ipswich (Forest win 5-4 on penalties)\nNick Mashiter\nBBC Sport football news reporter\nThere is little point of whispering it quietly anymore. Nottingham Forest are on the brink of something extraordinary.\nThe spirit and unity was evident at the City Ground on Monday during the penalty shoot out, with Morgan Gibbs-White giving Matz Sels an encouraging fist bump after scoring Forest's second spot kick.\nThat is not for show. The togetherness has been evident all season.\nLast month at the training ground, when the players were set a social media task to spin an American football for as long as possible several, including Gibbs-White, hung around to play a game of catch with each other when he would have been easy to head home.\nIt was clear those close alliances helped Forest over the line against Ipswich and could produce something special in the final few weeks of the season.\nWho will the winner of Brugge and Villa face?\nClub Brugge v Aston Villa (17.45 GMT)\nThe winner of the round of 16 clash between Club Brugge and Aston Villa will face the victor of the tie between Paris St-Germain and Liverpool in the quarter-finals.\nShould Villa or Brugge get past their Paris or Liverpool-based quarter-final opponents, a meeting with one of PSV, Arsenal, Real Madrid or Atletico Madrid would await in the semi-finals.\nThe other side of the draw - where the other finalist will come from - consists of Benfica, Barcelona, Borussia Dortmund, Lille, Bayern Munich, Bayer Leverkusen, Feyenoord and Inter Milan.\nWho has been better since their last meeting?\nClub Brugge v Aston Villa (Tue, 17:45 GMT)\nIt has been almost four months since Club Brugge were 1-0 winners over Aston Villa in the Champions League league phase.\nBut how have the clubs fared since their last meeting?\nClub Brugge have played in 27 matches in the four months between meetings. Of those, they won 14, drew 10 and lost only three.\nMeanwhile, Villa have had 25 matches in that time. Unai Emery's side have won 11, drawn seven and lost seven.\nIf all of the two side's matches in that time were in league competitions, Brugge would have averaged 1.93 points per game, while Villa's average is significantly lower at 1.6.\nHow are Club Brugge doing?\nClub Brugge v Aston Villa (Tue, 17:45 GMT)\nClub Brugge head into tonight's meeting with Aston Villa second in the Belgian Pro League table, nine points behind leaders Genk.\nBrugge have not won any of their last three games in the league, but did recently beat Atalanta in both legs to progress into the round of 16.\nIn the Champions League's league phase, they finished 24th and claimed the final play-off spot prior to knocking out Atalanta.\nVilla's away struggles\nClub Brugge v Aston Villa (17.45 GMT)\nAston Villa\nAston Villa have won two away game in this year's Champions League, one of those away defeats came against tonight's opponents Club Brugge.\nFull results in Champions League:\nYoung Boys 0-3 Aston Villa\nAston Villa 1-0 Bayern Munich\nAston Villa 2-0 Bologna\nClub Brugge 1-0 Aston Villa\nAston Villa 0-0 Juventus\nRB Leipzig 2-3 Aston Villa\nMonaco 1-0 Aston Villa\nAston Villa 4-2 Celtic\nTheir form away from home does not improve in the Premier League.\nUnai Emery's side have lost their past three away games, with back-to-back away wins in the league last coming in August.", "url": "https://www.bbc.co.uk/sport/football/live/cn9vj42j1g7t"}