{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:48:47", "date_modify": "2025-05-21 06:48:47", "date_publish": "2025-03-28 21:06:13", "description": "Astwood Bank's ground, near Redditch, is to be renamed the Josh Baker Oval as a permanent tribute to the popular left-arm spinner.", "filename": "sport_cricket_articles_ce8v8076greo_1747810127.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1879/live/198688f0-0c11-11f0-a9ec-f38dd40b0146.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_ce8v8076greo_1747810127.html", "title": "Astwood Bank Cricket Club to rename ground after Josh Baker", "title_page": "Astwood Bank Cricket Club to rename ground after Josh Baker - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Worcestershire cricketer Josh Baker, who died at the age of 20 in May 2024, is to be honoured by the club where he first played his cricket.\nAstwood Bank's ground, near Redditch, is to be renamed the Josh Baker Oval as a permanent tribute to the popular left-arm spinner.\nThe former England Under-19 international passed away overnight almost 11 months ago, during a week in which he was playing for the Pears Second XI in a match against Somerset at Bromsgrove School.\nBaker's parents Paul and Lisa set up a charity called the JB33 Foundation, to support local cricket clubs.\n\"We are truly honoured and humbled by the club's offer to rename their ground,\" said the Bakers in a JB33 Foundation statement.\nWorcestershire retired his number 33 shirt at the end of last season in his memory.\nAs part of the tribute to Baker's legacy, a framed 'Baker 33' shirt will be on display in the Graeme Hick Pavilion at New Road - as \"a lasting reminder of his impact on the club, his team-mates, and the broader cricketing community\" - and both Paul and Lisa Baker were also awarded life memberships of Worcestershire.", "url": "https://www.bbc.com/sport/cricket/articles/ce8v8076greo"}