{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 08:05:55", "date_modify": "2025-04-26 08:05:55", "date_publish": "2025-02-26 15:17:52", "description": "Hull City boss Ruben Selles says both they need to \"feel the pain\" of the loss to relegation rivals Cardiff City.", "filename": "sport_football_articles_cr72ek7p432o_1745654755.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/eaf3/live/379f62b0-f453-11ef-9d52-1b1b29dc5f7f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cr72ek7p432o_1745654755.html", "title": "Hull City: We need to feel the pain of Cardiff defeat", "title_page": "Hull City: We need to feel the pain of Cardiff defeat - Ruben Selles - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Hull City boss Ruben Selles says he and his players need to \"feel the pain\" of the disappointing 1-0 loss to relegation rivals Cardiff City.\nThe Tigers fell to defeat in south Wales in a game between two sides fighting to avoid the drop, leaving them three points above the bottom three.\n\"I think today and tomorrow are some moments for everyone to reflect on how we can do things better and how disappointed we are because we, as a team, are very disappointed,\" Selles told BBC Radio Humberside.\n\"I will let that feeling be a little bit in the next couple of days. We will address it as a team and we will move forward trying to beat the next opponent - that's how we're going to do it.\"\nHull welcome 22nd-placed Plymouth Argyle next Tuesday for another encounter with a team embroiled in the scrap to stay up.\nBut they will be without Aston Villa loanee Louie Barry for much of the rest of the season after the 21-year-old returned to his parent club to undergo rehabilitation following a knee injury he picked up in the 1-0 win at Sunderland.\n\"Things happen in football, we are not the only team that's going to happen to,\" Selles added.\n\"But we brought in Louie with the idea to be a player that will make the difference for us, so it's a big blow. We will manage as we always do.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cr72ek7p432o"}