{"authors": ["Emma Sanders", "www.facebook.com"], "date_download": "2025-05-20 13:52:29", "date_modify": "2025-05-20 13:52:29", "date_publish": "2023-07-31 16:40:56", "description": "Sarina Wiegman says England are \"strong enough\" to navigate their way through the Women's World Cup despite losing midfielder Keira Walsh.", "filename": "sport_football_66354208_1747749149.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/13F4B/production/_130593718_gettyimages-1563066842.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66354208_1747749149.html", "title": "Women's World Cup: England still 'strong enough' without Keira Walsh, says Sarina Wiegman", "title_page": "Women's World Cup: England still 'strong enough' without Keira Walsh, says Sarina Wiegman - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manager Sarina Wiegman pledged England are \"strong enough\" to navigate their way through the Women's World Cup without midfielder Keira Walsh.\nBarcelona's Walsh, 26, was taken off on a stretcher in the 1-0 win over Denmark after suffering a knee injury.\nWiegman would not confirm if Walsh will play again in the tournament as England prepared to face China in their final Group D match on Tuesday.\n\"We have a strong enough team. We know she's not available,\" said Wiegman.\n\"We had a group of 23 so now we have a group of 22 [for the China game]. We have our solutions and we'll show that tomorrow. We're here to move on.\n\"It's part of sport and it's not nice, but you have to adapt to the new situation and find a way.\"\nThe Lionesses will tackle China at the 13,557-capacity Hindmarsh Stadium in Adelaide (12:00 BST) knowing a point or better will see them progress as Group D winners.\nEngland beat Haiti and Denmark 1-0 in their first two matches, while China, second in the group, have the same points, goal difference and number of goals scored as third-placed Denmark.\nMonday marked a year to the day since England won their first women's major trophy, triumphing at Euro 2022 on home soil, but only six of the unchanged starting XI in that tournament are available at present.\nInjuries to key players including captain Leah Williamson, top scorer Beth Mead, playmaker Fran Kirby and instrumental midfielder Walsh, as well as striker Ellen White's retirement, have complicated England's challenge of winning a first Women's World Cup.\nThey have still lost just once in 34 matches under manager Wiegman but were tested in their victories against lower-ranked Haiti and Denmark.\nHowever, Rachel Daly says the squad's resilience is \"special\". The 31-year-old Aston Villa player typifies it, having been selected as a striker but lined up at left-back last time out, ready to put in a shift in either role.\n\"There's going to be ups and downs. There's going be tough moments - that's the nature of a World Cup tournament,\" said Daly.\n\"Teams around us are getting better and better. It's great for the game to see other teams rising and doing so well.\n\"We've played two really difficult opponents so we're going to get tested. That's how we deal with it - with the resilience.\"\nChina must beat England and hope that Denmark, who they were beaten 1-0 by, do not better their result in the other Group D match against Haiti (12:00 BST kick-off) to make the last 16.\nManager Shui Qingxia says the match is \"critical\" and China will do \"all they can\" to beat England and boost their chances of qualifying.\n\"From the Euros until now, the [England] team is rather stable. They are equally as good in attack as they are in defence,\" said Shui.\n\"After the Euros they have had more young players on board, but they are still one of the best teams in Europe.\"\nWith Walsh missing, Shui said China \"might look at different scenarios\", though they will be without a key midfielder themselves in Zhang Rui, who was sent off in the 1-0 win over Haiti for a dangerous high tackle.\n\"She said what she did has brought some trouble to the team, but I know this player well and she wouldn't engage in anything malicious,\" said Shui.\n\"She is one of the core players. Her absence is going to have a huge impact. We will have to vary our tactics with a new player but the team [will] still find a way.\"\nFormer England goalkeeper Rachel Brown-Finnis is predicting the outcome of all 64 games in Australia and New Zealand:\nThis has been the group of 1-0 wins so far - all four results have ended up with that scoreline so I am backing that trend to continue.\nEngland only need one point to make it out of Group D but I think they will get all three, and then who joins them could come down to fair play points, and be decided by the number of yellow cards each team has received.\nWe want the Lionesses to stay clear of all of that, and I am confident they will get the job done.\nChina are capable of making things difficult for England, however, and seeing them toil with 10 men to beat Haiti in their last match was very impressive.", "url": "https://www.bbc.com/sport/football/66354208"}