{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:53:47", "date_modify": "2025-05-21 04:53:47", "date_publish": "2025-01-23 12:00:46", "description": "Ospreys continue their fine run under new head coach Mark Jones as they celebrate an emphatic bonus-point win against Benetton.", "filename": "sport_rugby-union_articles_c1we3l2rz0no_1747803227.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/23a0/live/4fb40320-da9e-11ef-bc01-8f2c83dad217.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c1we3l2rz0no_1747803227.html", "title": "Ospreys power to emphatic bonus-point URC win against Benetton", "title_page": "Ospreys power to emphatic bonus-point URC win against Benetton - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ospreys continued their fine run under new head coach Mark Jones as they celebrated an emphatic six-try, bonus-point win against Benetton in the United Rugby Championship (URC) in Swansea.\nTries from full-back Jack Walsh, wing Daniel Kasende and centre Keiran Williams gave Ospreys a 24-0 half-time lead.\nWalsh added a second try before replacements Morgan Morse and Kieran Hardy crossed with fly-half Owen Williams kicking 11 points.\nJones took over as head coach from Toby Booth in late December and remains unbeaten with four wins and a draw in five games.\nThe victory lifted Ospreys up six places to eighth in the URC table while Benetton stay seventh as the Italian side could not follow up a famous Champions Cup win against La Rochelle last weekend.\nThe disappointing aspect was this fluent Ospreys display was once more played out in front of a sparse crowd of only 2,832.\nIt was the lowest home attendance for an Ospreys league game at the Swansea.com Stadium and highlights why the organisation plans to move to the smaller St Helen's venue next season.\nSuch a powerful performance deserves to be played out in front of more fans.\nThe hard core home crowd that turned up saw flanker Justin Tipuric produce another player-of-the-match performance as he returned to captain the hosts after missing last weekend's impressive European victory in Pau.\nOspreys made six changes from the Challenge Cup win in France, with number eight Morgan Morris, wing Keelan Giles, full-back Walsh, centre Williams and scrum-half Morgan-Williams starting.\nOwen Williams switched from centre to fly-half with Dan Edwards unavailable after linking up with Wales' Six Nations training squad alongside Owen Watkin, Gareth Thomas, Sam Parry and captain Jac Morgan.\nBenetton were missing most of their Italian internationals, but wing Matt Gallagher and flanker Alessandro Izekor were released with prop Giosué Zilocchi and lock Riccardo Favretto among the replacements.\nBenetton were denied an early try for prop Thomas Gallo after he was adjudged to have lost the ball over the Ospreys line.\nOspreys proved clinical with a fine break from centre Evardi Boshoff releasing scrum-half Morgan-Williams with Walsh finishing the flowing move. Williams converted and added a penalty.\nOspreys are playing with an attacking freedom under Jones and that was typified by an outstanding move with Tipuric rolling back the years by providing the final pass to Kasende.\nHosts prop Tom Botha was not penalised for a ruck clearance on Benetton hooker Agustin Creevy and the hosts continued their first-half onslaught when centre Keiran Williams crashed over.\nOspreys hooker Lewis Lloyd denied Benetton flanker Izekor a late first-half try with a brilliant covering tackle, but injured himself and was replaced by Ethan Lewis.\nThere was no score in the third quarter in the Swansea rain before Ospreys secured the bonus-point try when Walsh cantered over for a personal double for a second successive home game.\nNumber eight Morse, who only turned 20 earlier this month, showed his promise with a powerful burst off the back of a scrum for the fifth try.\nScrum-half Hardy completed the scoring as Ospreys did not concede a point in a home league match in Swansea for the first time in almost four years.\nOspreys head coach Mark Jones: \"The boys were great. It was a pleasure to watch them out there.\n\"We were not expecting the scoreboard to get up as quickly as it did but it wasn't easy and we had to work for it.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/c1we3l2rz0no"}