{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:38:18", "date_modify": "2025-05-20 14:38:18", "date_publish": "2023-07-28 12:16:01", "description": "Rangers secure the signing of Brazilian striker Danilo from Dutch champions Feyenoord for an undisclosed fee.", "filename": "sport_football_66339617_1747751898.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3487/production/_130574431_danilo.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66339617_1747751898.html", "title": "Danilo: Rangers sign Brazilian striker from Feyenoord for undisclosed fee", "title_page": "Danilo: Rangers sign Brazilian striker from Feyenoord for undisclosed fee - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Rangers have signed \"exciting\" striker Danilo from Dutch champions Feyenoord for an undisclosed fee.\nThe 24-year-old, who has agreed a five-year contract, scored 14 goals in 48 appearances across all competitions as the Rotterdam club won the title for the first time since 2017.\nDanilo left Ajax to join Feyenoord on a four-year contract last summer.\nRangers manager Michael Beale says he \"had been aware of\" the Brazilian since he also won the title with Ajax.\n\"His goal per minute ratio is very good,\" he told Rangers' website. \"He is an exciting player who likes to create and score goals.\n\"The discussions were ongoing for some time. Danilo really wanted this move and has a strong belief in the plan that we have for him and for the team moving forward.\n\"This was key in the negotiations as he really pushed to join Rangers.\"\nDanilo says he is \"super happy\" to become Rangers' eighth signing of the summer, adding \"I am so in love already with the club\".\nFeyenoord head coach Arne Slot thinks \"we got a good transfer fee\" for a player who was not his first choice by the end of the season.\n\"This is a player who was playing less and less in the second half of the season,\" he told his club website.\n\"So then it is always a consideration whether that player can stay in that role for another season or whether he has a problem with that. If a club comes along then that's an interesting opportunity for him.\n\"For us, we were only going to be interested in selling him if there was a transfer fee that did justice to his qualities. And, of course, from my side, you then ask if you can reinvest that, because his contribution to the title was very big.''\nHe will travel to Germany with the squad on Friday as they prepare for Saturday's friendly with Hoffenheim.\nDanilo came through the youth system with Ajax and, after a loan spell with top-flight rivals Twente, played 14 times for his parent club as they won the title in 2020-21.", "url": "https://www.bbc.com/sport/football/66339617"}