{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:39:47", "date_modify": "2025-04-26 06:39:47", "date_publish": "2025-03-02 15:44:31", "description": "Shane Walsh scores a late two-pointer as Galway and Tyrone played out a dramatic 1-18 to 1-18 draw in Division One at St Jarlath's Park.", "filename": "sport_articles_c798e1nyprpo_1745649587.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/29d9/live/dd69c8f0-f770-11ef-841c-1f98008bd439.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_c798e1nyprpo_1745649587.html", "title": "Late Walsh two-pointer rescues Galway draw with Tyrone", "title_page": "Galway 1-18 Tyrone 1-18: Late Walsh two-pointer rescues Galway draw with Tyrone - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Shane Walsh scored a late two-pointer as Galway and Tyrone played out a dramatic 1-18 to 1-18 draw in Division One at St Jarlath's Park.\nThe sides were level at 0-11 to 1-8 after a lively first half as the influential Darragh Canavan, who finished with 1-5, scored Tyrone's goal.\nThey also had a Peter Harte penalty saved, which they were left to rue as Walsh's penalty in the second half had Galway level.\nA late Mattie Donnelly two-pointer looked to have secured the hard-fought victory, but Tyrone breached the three-up rule and Walsh nailed a two-pointer of his own with the last kick of the game.\nIt was frantic from the off in Tuam as a strong Tyrone side, who had Aodhan Donaghy, Mattie Donnelly, Canavan and Harte back in the team, came racing out of the traps.\nThe two sides exchanged early scores before Tyrone then moved ahead as Harte found Canavan, who rounded Connor Flaherty and fired home from a narrow angle.\nThey had a huge chance to extend their advantage from the penalty spot after Brian Kennedy was fouled by John Maher.\nHarte stepped up but he was denied by Flaherty, who dived to the right before Cillian McDaid then went up the other end and scored to cut the gap.\nTwo quickfire two-pointers from Rob Finnerty and Paul Conroy helped Galway to turn the game on its head, but Tyrone continued to look dangerous when they went forward.\nDonnolly finished a slick move and Canavan kicked two successive points to swing momentum back in the Red Hands' favour.\nIt was nip-and-tuck right up until the hooter with Galway's four two-pointers in the half proving useful as they did in the victory against Donegal last weekend.", "url": "https://www.bbc.co.uk/sport/articles/c798e1nyprpo"}