{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:24:07", "date_modify": "2025-05-21 05:24:07", "date_publish": "2025-04-03 14:58:56", "description": "Leicester Tigers appoint Fraser Goatcher as director of women's rugby and name Ross Bundy as head coach.", "filename": "sport_rugby-union_articles_c807ln4d24no_1747805047.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/29c2/live/3bf23300-1097-11f0-b6ff-f7b4e8c1b1b9.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c807ln4d24no_1747805047.html", "title": "Leicester Tigers: Premiership Women's Rugby side appoint new coaching team", "title_page": "Leicester Tigers: Premiership Women's Rugby side appoint new coaching team - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Leicester Tigers have appointed Fraser Goatcher as director of women's rugby and named Ross Bundy as head coach.\nThe duo make up the new coaching set-up after Tom Hudson left as head coach at the end of the Premiership Women's Rugby season.\nTigers finished second-from-bottom in the table for the second successive season last term, having won three of their 16 league games.\nGoatcher steps up into the role of director of women's rugby, having worked at the club as head of the women's pathway programme since 2023 while also coaching Lichfield in the lower leagues.\nBundy moves to Leicester after two years coaching at Dutch top-flight side Rotterdam while working as forwards and breakdown coach with Edinburgh Women.\n\"We are excited for what is to come for the women's programme at Leicester Tigers with Fraser at the helm in this new, vital role and Ross taking over as head coach,\" Tigers chief executive Andrea Pinchen told the club website., external\n\"Both are not only quality coaches with impressive resumes but also have a strong focus on developing players and improving the environments they are in, which is essential as we look to build on the work done in our first two seasons in Premiership Women's Rugby.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/c807ln4d24no"}