{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:31:43", "date_modify": "2025-05-20 12:31:43", "date_publish": "2023-08-04 10:59:17", "description": "Haverfordwest County manager Tony Pennock will be forced to play his under-19s side in Sunday's Nathaniel MG Cup tie against Cardiff City.", "filename": "sport_football_66406053_1747744303.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1141C/production/_130648607_230803_haverfordwestcountyvb36torshavn_116.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66406053_1747744303.html", "title": "Tony Pennock: Haverfordwest boss questions cup scheduling after Europe", "title_page": "Tony Pennock: Haverfordwest boss questions cup scheduling after Europe - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Haverfordwest County manager Tony Pennock says he will be forced to play his under-19s side in Sunday's Nathaniel MG Cup tie against Cardiff City under-21s.\nCounty bowed out of the Europa Conference League with defeat to B36 Torshavn.\nPennock has questioned the scheduling of the cup tie after a gruelling month.\n\"We've got a league cup game on Sunday but nobody who played tonight will be playing in that game,\" he said.\n\"It's impossible - we've had two weeks off in the summer.\n\"It's a problem that we want every year - if we got to have two weeks off to play in Europe then we'll take two weeks off.\n\"But to expect the boys to play again on Sunday, I just can't understand the reason behind it.\"\nJann Benjaminsen's extra-time penalty at Cardiff City Stadium saw the team from the Faroe Islands advance 3-2 on aggregate.\nCounty had lost 2-1 in the first leg of their Europa Conference League second qualifying round tie.\nBen Fawcett squared the tie in the return leg to force extra time but the forward was then penalised for handball and Benjaminsen scored from the spot.\n\"I can't be any more prouder than I am,\" Pennock told BBC Sport Wales.\n\"We've set the standards now and that's what we've got to do. We can't dwell on this too long.\n\"The league starts next week, that's our bread and butter, and after what they've experienced the last four weeks they've got to want more of that.\n\"But we know in our division there's 11 other teams that will want that as well and we've got to make sure we're one of the four (European qualifiers) next season.\"\nAfter the Nathaniel MG Cup second round tie against Cardiff's youngsters, Pennock's side begin the Cymru Premier season at home to Pontypridd United on Friday, 11 August.\nBut they will be without former Wales international Jazz Richards who suffered an ankle injury during the first half of the loss to Torshavn.\n\"I think Jazz will be a few weeks now,\" Pennock confirmed.\n\"He landed awkwardly and the lad landed on top of him, it's just one of those things.\n\"We'll see how he is over the next couple of days.\"", "url": "https://www.bbc.com/sport/football/66406053"}