{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:00:53", "date_modify": "2025-05-21 05:00:53", "date_publish": "2025-01-23 12:51:25", "description": "Larne defender Levi Ives signs for Coleraine, becoming the club's third January signing.", "filename": "sport_articles_cnv3ng4dy74o_1747803653.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3460/live/98f7a1c0-d988-11ef-9467-577a0b7c8ee7.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cnv3ng4dy74o_1747803653.html", "title": "Irish Premiership: Larne defender Levi Ives signs for Coleraine", "title_page": "Irish Premiership: Larne defender Levi Ives signs for Coleraine - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Coleraine have signed Larne defender Levi Ives on a \"multi-year deal\".\nIves, 27, becomes the club's third arrival this month after Patrick Burns and Ronan Doherty.\nBefore turning out for the Inver Reds, Ives played for Torquay United, before joining Cliftonville in 2015 and making 245 appearances for the Solitude club.\nHe joined Larne in June 2023 for an undisclosed fee and has been an important figure for the east Antrim club as they secured back-to-back Irish Premiership titles and advanced to the league stage of the Uefa Conference League.\n\"Levi is a big signing and defence was an area we were looking to strengthen in this window,\" said Coleraine head coach Dean Shiels.\n\"He brings a lot of experience and a lot of quality in the defensive area.\n\"He's a winner and he's won everything there is to win in this country. He is a young age and we are getting his prime years which is massive for us.\"\nColeraine are currently ninth in the Irish Premiership and face Dungannon Swifts at Stangmore Park in their next game on Saturday.\nLinfield winger Joel Cooper has been heavily linked to a move to Coleraine, with a pre-contract reportedly agreed for a summer switch to the Showgrounds.", "url": "https://www.bbc.com/sport/articles/cnv3ng4dy74o"}