{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:10:16", "date_modify": "2025-05-21 06:10:16", "date_publish": "2025-03-31 10:22:10", "description": "Northampton Town announce an overall loss of £2.03m for the year ending June 2024 despite a record turnover of £6.74m.", "filename": "sport_football_articles_c2kvjk5n8zzo_1747807816.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5a03/live/39d4f2f0-0e13-11f0-a9c9-194143bfd12c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c2kvjk5n8zzo_1747807816.html", "title": "Northampton Town announce £2m loss but record £6.74m turnover", "title_page": "Northampton Town announce £2m loss but record £6.74m turnover - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Northampton Town have announced an overall loss of £2.03m for the year ending June 2024.\nThe figure is almost £1m higher than that of 12 months earlier, when they were promoted from League Two, but the club also posted a record turnover of £6.74m.\nThe average attendance of 6,841 for games at Sixfields was their highest for 56 years.\nDespite the loss, chairman Kelvin Thomas described it as a \"successful period\" for the club.\n\"It is our wish to make the club financially sustainable in the medium to longer term, however the reality is that with the current financial pressures facing the game, this is very difficult to achieve while also maintaining a competitive playing budget to allow the club to be successful on the pitch,\" the annual financial report said, external.\n\"External influence will be needed to help us and many other clubs to achieve that and we hope the expected appointment of a football regulator will be a big step forward in this regard.\"\nThe turnover figure was 31% up on the previous year but the Cobblers only made a profit of £256,409 from their transfer activities compared to over £1.2m in 2022-23.\nThe club recently began a phased opening of the new East Stand - the total cost of which is expected to be over £5m - before the end of the season.\nThe project began in 2014 but was delayed by contractual disputes and work only resumed last summer.", "url": "https://www.bbc.com/sport/football/articles/c2kvjk5n8zzo"}