{"authors": ["Dazzling Dave", "www.facebook.com"], "date_download": "2025-04-26 03:58:20", "date_modify": "2025-04-26 03:58:20", "date_publish": "2025-03-04 13:11:40", "description": "Wolves news: Opinion - Matheus Cunha goes from hero to zero", "filename": "sport_football_articles_ceqjgwzvzgvo_1745639900.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e360/live/b7cd5770-b62f-11ee-bc2f-cb5579b90709.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_ceqjgwzvzgvo_1745639900.html", "title": "Opinion - Matheus Cunha goes from hero to zero - BBC Sport", "title_page": "Wolves news: Opinion - Matheus Cunha goes from hero to zero - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Two trips to Bournemouth in a week, two drastically different results. Last week brought three vital points; this week, an exit from the FA Cup on penalties.\nIn this game, Matheus Cunha went from hero to zero. His goal was a moment of sheer brilliance - reminiscent of Ruben Neves at his finest - but his headbutt was a moment of sheer madness.\nIt underlined the fine line between triumph and disaster. True, Cunha found himself persistently fouled, which is often the price a team's star player pays. But what exactly pushed him to lose control in those final moments? We may never know, but the red card he earned is a decision with real consequences.\nNow suspended for at least three critical fixtures, Cunha's absence could not come at a worse time. With the relegation battle heating up, every point matters. Combined with our growing injury list, this puts even more strain on an already stretched Wolves squad.\nIn a team that leans heavily on Cunha and his moments of brilliance, Vitor Pereira now has to make the team function effectively without our talisman.\nSo, who steps forward?\nAttacking options are thin. Jorgen Strand Larsen and Hwang Hee-chan are just returning from injuries and are out of form. Goncalo Guedes and Rodrigo Gomes are currently unavailable and, to make matters worse, Jean-Ricner Bellegarde has picked up a knock. Could this be the time for Tommy Doyle?\nUnder Pereira, Wolves favour narrow number 10s supporting the striker, a role Doyle filled against Liverpool and the boss has seemingly been working to push his former Manchester City midfielder further upfield.\nPereira has admitted concerns about Doyle's lack of physicality in deeper roles but believes pushing him higher up the pitch could unlock his potential.\nBournemouth deserved their win - you can't argue otherwise - but the fallout from this match stings. The path ahead is riddled with questions, and the answers will define our survival hopes.", "url": "https://www.bbc.co.uk/sport/football/articles/ceqjgwzvzgvo"}