{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:42:01", "date_modify": "2025-05-21 03:42:01", "date_publish": "2025-04-06 18:11:59", "description": "Worcestershire end day three on 280-5 in their second innings, still 236 behind, after Tom Banton's 371 sees Somerset to 670-7 declared at Taunton.", "filename": "sport_cricket_articles_cy8exr40re7o_1747798921.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8ca0/live/95b04a30-1308-11f0-b515-e35a0abdef6d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cy8exr40re7o_1747798921.html", "title": "County Championship: Worcestershire cling on after Tom Banton's 371", "title_page": "County Championship: Worcestershire cling on after Tom Banton's 371 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Somerset's Tom Banton registered the fifth highest score in the history of the County Championship when finally dismissed for 371 on the third day of the match with Worcestershire at Taunton.\nUnbeaten on 344 overnight, the 26-year-old extended his boundary count to 56 fours and two sixes, facing 403 balls before his wicket saw Somerset declare their first innings on 670-7, with a lead of 516.\nOnly Brian Lara (501 not out), Archie MacLaren (424), Sam Northeast (410 not out) and Graeme Hick (405) have produced bigger innings in Championship cricket.\nIn the face of such a daunting deficit, Worcestershire slipped to 116-4 in their second innings before a spirited recovery to 280-5, still 236 behind.\nFormer Somerset player Adam Hose led the fightback with 82, while Brett D'Oliveira made 71 not out and Kashif Ali 51. Jack Leach claimed 3-69.\nA day of cloudless skies began with the home side electing to extend their imposing first innings score of 637 for six and lead of 483, giving Banton the chance to build on what was already the highest individual score by a Somerset player.\nHe rode his luck with a couple of skiers that fell safe and moved to 350 with a single off Tom Hinley, having faced 392 balls.\nLewis Gregory, unbeaten on 30 overnight, was dropped at long-off, as he and Banton extended their seventh-wicket stand beyond the century mark.\nBanton then smacked Hinley for only the second six of his marathon innings, which had spanned eight hours and 42 minutes by the time he was caught behind off the same bowler attempting a cut shot.\nEvery Worcestershire player shook his hand as he left the pitch with the 21st highest score ever in first-class matches to his name.\nThere were a minimum of 88 overs left in the day and Worcestershire were soon in trouble as, with their total on 16, Gareth Roderick was pinned lbw by Craig Overton.\nLeach's left-arm spin was introduced as early as the eighth over, clearly viewed as Somerset's chief threat on a dry pitch.\nHe struck with the second ball of his sixth over with the score on 40, which squeezed past the inside edge of Jake Libby's bat to hit his back pad and led to another successful leg-before appeal.\nIt was 58-2 at lunch, with Kashif Ali and Ethan Brookes at the crease. Both batted positively and were looking well set when making elementary errors in the afternoon session.\nFirst Brookes, on 35, top-edged a sweep shot off Leach, then Kashif, untroubled in reaching an 85-ball half-century with eight fours, advanced down the pitch to the England spinner and drove in the air straight to Overton at mid-off.\nBut by tea, Worcestershire were 191-4, Hose having marked his return to Taunton with a fluent fifty off 68 balls, including eight fours and a six.\nHe continued in the same fashion after the interval, while D'Oliveira looked equally confident in moving to a half-century off 93 balls, with six fours.\nKeeping the ball on the ground, the pair had hardly played a false stroke when the second new ball became due with the score 257-4 after 80 overs and their partnership extended to 141.\nIt accounted for Hose, lbw to a Kasey Aldridge yorker having faced 151 balls and hit 12 fours and a six.", "url": "https://www.bbc.com/sport/cricket/articles/cy8exr40re7o"}