{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:48:14", "date_modify": "2025-05-21 04:48:14", "date_publish": "2025-01-14 23:27:48", "description": "West Ham 3-2 Fulham: 'It's a nice start but we can't get carried away' - Potter reacts to win", "filename": "sport_football_articles_ckg0vrdn952o_1747802894.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/febc/live/12a76c00-d2cf-11ef-a95c-5b151e1edf12.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ckg0vrdn952o_1747802894.html", "title": "'It's a nice start but we can't get carried away' - Potter", "title_page": "West Ham 3-2 Fulham: 'It's a nice start but we can't get carried away' - Potter reacts to win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "West Ham manager Graham Potter, speaking to BBC Match of the Day: \"It feels great. It's a big three points for us. It was hard-fought in a tough game, a London derby.\n\"Fulham started the game as a better team. We had some trouble trying to put pressure on them, but we changed that in the middle of the first half and were more aggressive. That helped us to put some pressure on them.\n\"We were disappointed to concede the goal early in the second half, but credit to the players, they stuck at it and stuck together.\n\"The start point is the foundation of togetherness and the foundation of a team. We were far from perfect. But in terms of application of the players and how they fought and suffered, they were really, really, good. We have to look at the context of what happened and it's been a tough week for the players and we have players missing, especially in the forward areas. But nevertheless, the team spirt, the team effort and willingness to try were fantastic.\"\nOn missing players due to injury: \"We don't really want to talk about the individuals that aren't there. It's about the team that's there. They did the best. The substitutes came on and did well. We need a good reaction from our substitutes and their reactions were really good today. The pressure got us another goal and that was the one that got us over the line.\n\"Danny Ings, Andy Irving, Ollie Scarles and Aaron Cresswell were all great. It's obviously nice to score three goals and long may that continue.\"\nOn Danny Ings: \"Danny had a massive game against Aston Villa. He hasn't played consistently for a while, so I just thought going from Friday to Tuesday was big for him and that he would be more useful towards the back end of the game and he has really helped us. It also means Mohammed Kudus is fresh and ready for another big game coming up for us.\"", "url": "https://www.bbc.com/sport/football/articles/ckg0vrdn952o"}