{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:10:20", "date_modify": "2025-05-21 04:10:20", "date_publish": "2024-12-29 00:00:00", "description": "Follow live text commentary, score updates and match stats from Preston North End v Sheffield Wednesday in the Championship", "filename": "sport_football_live_cm2vjp07l8yt_1747800620.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cm2vjp07l8yt_1747800620.html", "title": "Emil Riis' double helps Preston to post back-to-back wins in the Championship with a 3-1 win over Sheffield Wednesday at Deepdale.", "title_page": "Emil Riis' double helps Preston to post back-to-back wins in the Championship with a 3-1 win over Sheffield Wednesday at Deepdale. - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Emil Riis grabbed two goals as Preston beat Sheffield Wednesday 3-1 at Deepdale to deliver back-to-back wins for the first time in the Championship this season.\nTwo close range efforts for the Danish forward either side of a penalty from Sam Greenwood saw the Lilywhites emerge victorious.\nJosh Windass had briefly given hope for the visitors equalising Riis' first goal on 29 minutes with a 25-yard strike on the hour.\nBut Preston proved too strong in an energetic and entertaining game and two further goals condemned Wednesday to only a second defeat in their past nine league outings.\nVictory continued a decent uptick in form and results for Paul Heckingbottom's North End who have now won three of their past five games.\nThe Preston manager made four changes from the side which beat Hull City on Boxing Day and it was one of those, Riis, who delivered the goal which separated the two sides at half-time.\nHis opener was no thing of beauty, the Preston forward scuffing it in from three yards after a diagonal ball from Alistair McCann was nodded back into the danger zone by Jack Whatmough.\nHowever it was enough to give the hosts belief and the advantage at the break.\nThey so nearly built on it early in the second half with McCann seeing a shot deflected behind from eight yards after a brilliant drive and cutback by Sam Greenwood and then the latter rattling the crossbar from 20 yards with a superb strike on 56 minutes.\nPreston manager Paul Heckingbottom told BBC Radio Lancashire:\n\"I really liked the spirit and the heart we showed, which I thought increased as the game went on so, yeah, I loved that win.\n\"One thing that Wednesday do well is changing things and we were not aggressive enough in certain areas of the pitch and that was the message at half-time.\n\"You're always searching for better and looking to improve things up the top end of the pitch.\n\"We've got a good squad, I can make changes and it doesn't weaken the team - that's a good place to be and we have to use it.\"\nSheffield Wednesday head coach Danny Rohl told BBC Radio Sheffield:\n\"I think it was an unnecessary defeat. We had moments in the game but when you concede three goals it's not enough.\n\"Even after we went 2-1 down we had had big chances but that's football. We have to defend better.\n\"It's always the same players - they do the mistakes and they have to step up. It's about man-marking and look at the ball with the opponent in your view. You can defend as a group and this is what we have to improve.\n\"In the box, to take something, you have to be better.\"", "url": "https://www.bbc.com/sport/football/live/cm2vjp07l8yt"}