{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:25:06", "date_modify": "2025-05-21 06:25:06", "date_publish": "2025-03-31 12:17:45", "description": "Motherwell 0-3 Hibs: What the manager said", "filename": "sport_articles_c0el182w7r5o_1747808706.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5437/live/1659e210-0e2a-11f0-b851-29ea4ea8a4cd.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c0el182w7r5o_1747808706.html", "title": "Motherwell 0-3 Hibs: What the manager said", "title_page": "Motherwell 0-3 Hibs: What the manager said - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Hibernian head coach Grant Scott: \"I still think we've got a performance level to go, but Motherwell are a really good opponent for us, really difficult. They play some good stuff, so for us to come and get a clean sheet and the goals, delighted to win the match.\n\"People often say the timing of goals can change games, and that was massive for us. We know we're good at the back; apart from last week we don't really lose a lot of goals, so it gave us a real bounce of confidence to see this one through.\n\"I think when we get our noses in front, we are a good team.\n\"We're still dreaming a wee bit about where we are, and we're just taking it day by day. I think this period of the season you'll see all the top teams having to rotate their squads, we're heavily reliant on a set number of players in our squad, so to be able to give them a rest to today to freshen the others areas up, it was a real bonues, but we'll need them all.\n\"There will be talk, we'll just take it game by game.\"\nMotherwell head coach Paul Brownlie: \"It was a difficult one and a sore one [first goal] to take at that stage in the game, there probably wasn't much in the game.\n\"No, you don't get an explanation [on amount of first-half added time]. Very frustrating.\n\"I thought they players were good, even though we lost 3-0 against a good quality team who are sitting top of the league, there are a lot of positives to take.\"", "url": "https://www.bbc.com/sport/articles/c0el182w7r5o"}