{"authors": ["Bobbie Jackson", "www.facebook.com"], "date_download": "2025-05-21 05:35:23", "date_modify": "2025-05-21 05:35:23", "date_publish": "2025-02-09 06:46:05", "description": "Olympian Delicious Orie tells BBC Sport about his decision to turn down a career with the WWE to stick with boxing.", "filename": "sport_boxing_articles_crr0n25z9y9o_1747805723.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5cad/live/bc460910-e0df-11ef-ad41-cb4e11900c59.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_boxing_articles_crr0n25z9y9o_1747805723.html", "title": "Delicious Orie snubs WWE for heavyweight boxing", "title_page": "Delicious Orie snubs WWE for heavyweight boxing  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Heavyweight Delicious Orie has had more free dinners in the past seven months than most get in a lifetime.\nThe Team GB boxer was unable to bring home a medal from the Paris Olympics, despite being a big favourite heading into the Games, but he has not been left short of opportunities in the aftermath.\nDuring Orie's time in Paris, the WWE - the world's premier wrestling promotion - \"slid into his DMs\" to try to lure him away from boxing.\n\"I thought it was a scam, one of those spam DMs [direct messages],\" Orie told BBC Sport.\n\"I checked the account and it was legit, millions of followers and verified. It was real, it was very serious. They wanted me to go out to Florida and try out.\n\"It was a fantastic experience out there. They were selling me the package and I loved it. From the wrestling, to the acting to the showbusiness. I went out to see shows, sat on the front row and met some legends like Shawn Michaels and Booker T. It was like reliving my childhood again.\"\nOrie, 27, was still adjusting to Olympic heartbreak, feeling like he \"let everyone down\" and time away from pugilism was just the tonic.\n\"I don't think I will ever emotionally recover from it,\" Orie said.\n\"It went from I had lost and thought I would amount to nothing, no-one would care about me again in my career and I need to do something else, to now I've got some interest in a completely different sport and then it went to something else, which was what do I really want in my life? What to I want to achieve? Money aside, what do I want to get out of my life and my career?\n\"That's when boxing, after some time, came back and I remembered why I was doing it in the first place.\n\"I don't think you can replicate the boxing life in terms of hardship. I've always gone through hardship in my life so I think it was just the natural pick.\"\nOrie politely passed up on the opportunity to become the WWE's next superstar.\nHe returned to the United Kingdom, took a couple of weeks to consider his next step and began the same process with some of the top promoters in boxing.\n\"I spoke with all the promoters. Matchroom, Boxxer, Queensberry, Top Rank and Wasserman. I went to have dinner with all of them, it was a nice couple of weeks. I got wined and dined,\" Orie said.\nQueensberry Promotions were the first to sit down with Orie and chief executive George Warren was key to convincing him to chose Frank Warren's outfit.\n\"I'd never spent time with him [George Warren] before but I was so impressed,\" Orie said.\n\"I liked his image and how he spoke in building me as a fighter. I felt there was a connection and something we could build on for the future. He set the bar high from the beginning.\n\"I met a lot of other promoters and they know how to speak and how to sell themselves, but there was something special with Queensberry and I believed they would develop me well.\"\nOrie won gold at the 2022 Commonwealth Games and the European Championships in 2023.\nHe joins Warren's Queensberry stable of fighters, which represent a host of heavyweights including world champion Daniel Dubois and rising star Moses Itauma.", "url": "https://www.bbc.com/sport/boxing/articles/crr0n25z9y9o"}