{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:39:53", "date_modify": "2025-05-21 03:39:53", "date_publish": "2025-02-02 00:00:00", "description": "Follow live text updates from the Women's Super League as Man City host Arsenal, Brighton vs Crystal Palace, Everton vs Leicester, Liverpool vs West Ham, Aston Villa vs Chelsea & Tottenham vs Man Utd.", "filename": "sport_football_live_cq8kv1ev8z7t_1747798793.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cq8kv1ev8z7t_1747798793.html", "title": "WSL LIVE: Man City vs Arsenal, Brighton vs Crystal Palace, Everton vs Leicester, Liverpool vs West Ham, Aston Villa vs Chelsea & Tottenham vs Man Utd", "title_page": "WSL LIVE: Man City vs Arsenal, Brighton vs Crystal Palace, Everton vs Leicester, Liverpool vs West Ham, Aston Villa vs Chelsea & Tottenham vs Man Utd - scores, results & latest updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "'Something for us to look back on and work on'\nFT: Man City 3-4 Arsenal\nManchester City\nManchester City’s Mary Fowler speaking to Sky Sports: “A tough one - that’s football. Two good teams, sometimes you make mistakes and the other team did well to capitalise on that. I thought overall we played pretty decent, some good football.\n“I think we did have a slow start but it happens and it’s something for us to look back on and work on for the next game.\"\nOn regrouping after tough moments: “I think we showed in the first game against Manchester United and we didn't do too well, then bounced back a few days later. I think it’s just another opportunity to do that again.”\n'I've got the confidence of my team - that showed today'\nFT: Man City 3-4 Arsenal\nArsenal\nLotte Wubben-Moy, who scored Arsenal’s second goal, speaking to Sky Sports about the impact of the fans: “Going towards the fans is something we hold pretty highly and the cheer of their sound is quite contagious and gives you a lot of energy.\"\nOn this season: “I've had a tough time with injuries at the start of the season, it has not been smooth sailing - that's football. I hold myself highly in terms of resilience and I've got the confidence of my team - that showed today not just in my performance but everyone’s.\"\nOn dealing with tough moments: “I think adversity is an inevitable factor in football and in life as well. You have to take every day as it comes, grind and appreciate moments you get like today. They're the ones that outweigh the tough times. I’d say to a young person there's always light at the end of the tunnel - football and life.”\nMariona Caldentey also spoke to Sky Sports, she said: “We needed a win today after what happened last week. We want to be on the top and to try and win every game. Sometimes it doesn't work but today we gave everything and I’m happy to score of course but that’s about the team and I think we deserved it today.”\n'We bounce back - that's what we do'\nFT: Man City 3-4 Arsenal\nManchester City\nManchester City boss Gareth Taylor speaking to Sky Sports: “It was [close] but we make a poor start, to give away a simple action for us, a simple goal and we know when you come up against this team you don't need to give them a head start we did that.\n“We showed good character finding a way back and I thought the margins were quite tight. Too many duels we lost against a team like them, physicality, we need to be better in that sense. That always gave us an issue.\"\nOn conceding early goals: “Individual errors. It's not what we want of course and teams are gonna put us under pressure - that's part of the game, we have to deal with it.”\nOn whether concentration is a part of that: “Concentration is a big part of it of course it is. You're at your most vulnerable when you’ve just scored. I think that's throughout the game up and down the country you see that.”\nOn getting back to their best: “I think the team need a bit of help, support and we are trying hard on the training ground to improve that every time but we bounce back - that's what we do. I think the life of a footballer is tough, not always winning every week, we've done that a lot and we need to try to get back to that, the more we try to get players back and we start to find our confidence again and we get that by supporting each other and working hard on the training pitch.”\n'When you are not able to perform at 100% you always have to find a way to win'\nFT: Aston Villa 0-1 Chelsea\nChelsea\nMore from Chelsea boss Sonia Bompastor: “I told them at the end when you are not able to perform at 100 per cent you always have to find a way to win the game and I think this is what we did today.\n\"Not easy again but the best teams have the power to do that and I think this season we are really efficient and clinical in front of goal. We had not a lot of opportunities but the ones we created we were able at least to score once.\n'I want to win trophies and Chelsea match my ambition'\nFT: Aston Villa 0-1 Chelsea\nChelsea\nChelsea midfielder Keira Walsh, speaking to BBC Sport: \"I'm very happy to be back in England. It's such a competitive league, I think you could see it today. What brought me to Chelsea is they always find a way to win. I'm ambitious, I want to win trophies, and I think the club matches my ambition.\"\nOn working under Sonia Bompastor: \"I think she can still make me improve as a player, I'm still only 27 and I feel like I've got a lot to improve on. When I spoke to her I felt that she could do that and she gave me the confidence, just being a part of this team and being with those players. Seeing the game today, it's why I joined.\"\nOn what she sees in Chelsea that makes her think they could win the Champions League: \"I think it's the grit you've just seen, they've got world class players and can control games. Not many teams have what they've got, they always find a way to win no matter how the goals come, how the goals look, they always score. I think that's the exciting thing for me because we've got so many levels to go. Hopefully I can win the Champions League with an English team.\"\n'I think it was a lucky win'\nFT: Aston Villa 0-1 Chelsea\nChelsea\nChelsea boss Sonia Bompastor: “I would say again satisfied about the result but not about the performance. I think credit to Villa they were really well organised and they wanted more to have a good result today than us.\n“Sometimes it happens in football, you can not be any time 100 per cent but yeah we need to take this as a lesson and learn form that because today I think it was a lucky win.”\nOn what Chelsea could have done better: “For sure in possession of the ball, in the build-up we didn't have the movement enough, the availability from the players and I think they need to understand in this type of game when the opposition has a really good shape and are well organised you need to move and be smart in your movements.\n“I think also Villa just left us a lot of space behind them and we couldn't connect together to be able to make the right runs and be able to hurt them behind the back line. “\n'We were so, so close'\nFT: Aston Villa 0-1 Chelsea\nAston Villa\nAston Villa manager Natalia Arroyo, speaking to BBC Sport: \"We feel disappointed because we were so, so close. It's not a game where deserving or not deserving really makes the difference. I'm unhappy because the girls were pushing really hard and it's a strange goal.\n\"Quite cruel but that's probably the welcome to this league. I'm very proud of our performance, how we were able to stop the ball and also have the ball and find some gaps to make them suffer.\n\"Even when we didn't get the points, to get the feeling that the strongest team in the league struggled at Villa Park is good for us.\"\nOn the positives she can take from the performance: \"We wanted to to be consistent, solid, as aggressive as possible without the ball. I think we found the moments to really be aggressive and be a bit more vertical than in other games but we need time to work on it.\n\"I'm very proud of a lot of things, to start from here and show ourselves we can cause the best team problems.\n\"From there on play with this energy always and hopefully that means Villa Park will celebrate a lot of wins.\"\n'We dug in and scraped through'\nFT: Aston Villa 0-1 Chelsea\nChelsea\nChelsea goalkeeper Hannah Hampton, speaking to BBC Sport: \"I think you saw that the team dug in. It probably wasn't our best performance in the first half. We dug in, we came together as a team and we scraped through and got that goal.\"\nOn the save she made in the second half: \"To be honest I didn't think the cameras caught it! I try and do whatever I can for the team. I've done my bit, we work together.\"\nChelsea striker Mayra Ramirez added, on what it's like playing for Sonia Bompastor: \"It's hard work under her. I'm enjoying every moment but we're going to keep going.\"", "url": "https://www.bbc.com/sport/football/live/cq8kv1ev8z7t"}