{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 08:39:13", "date_modify": "2025-05-21 08:39:13", "date_publish": "2025-01-13 12:30:12", "description": "St Johnstone: 'Go down with a fight not a whimper'", "filename": "sport_articles_c805llr73pxo_1747816753.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0395/live/d42cd1c0-d1a9-11ef-94cb-5f844ceb9e30.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c805llr73pxo_1747816753.html", "title": "'Go down with a fight not a whimper'", "title_page": "St Johnstone: 'Go down with a fight not a whimper' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "St Johnstone fans, we asked for your views after Sunday's defeat to Rangers.\nHere's what some of you had to say:\nJimmy: The shape of the team is wrong, players out of their best positions, the set up looks \"makeshift\". The signing of Andy Fisher appears to be a good one, he is a better keeper but we still need a good defender, and a proven goal scorer. I still have confidence we can escape the relegation spot, but that gap is getting wider.\nStuart: Special round of applause for how our management team at the time believed no right back, two Championship goalkeepers, a 36-year-old playmaker and a relatively inexperienced defence was good enough to push for top six. Calling for Simo Valakari's head is absolutely bizarre when he can't fix the mess in this window. We need to back him and let him rebuild.\nDuncan: Not unexpected, perhaps more respectable than expected. But the same as last week. We clearly need more faces through the door to match the style of play, or at least break the cycle for some of the regular starters whose confidence is only going to get worse chasing so many games and so many damaging errors. Have patience. Stick with Simo!\nAlly: Simo Valakari says \"we are making too many mistakes\" I hope he's including himself in that statement. His starting teams leaves a lot to be desired, he has to stop playing people out of position. It's like he's still experimenting with players, meantime we're being cut adrift in the relegation spot. Come on Simo, round pegs for round holes.\nBryan: Relegation now a reality. Time to prepare for a Championship campaign.", "url": "https://www.bbc.com/sport/articles/c805llr73pxo"}