{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:54:08", "date_modify": "2025-05-21 07:54:08", "date_publish": "2025-05-20 06:14:42", "description": "Head coach Steve Clarke concedes the dearth of emerging goalkeepers is a concern for Scotland.", "filename": "sport_football_articles_c787jljz973o_1747814048.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b841/live/386fc270-34c7-11f0-aa60-d5869f4a84da.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c787jljz973o_1747814048.html", "title": "'Oversight' on goalkeepers catches Scotland short", "title_page": "'Oversight' on goalkeepers catches Scotland short - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Head coach Steve Clarke concedes the dearth of emerging goalkeepers is a concern and \"probably an oversight\" for Scotland.\nWith 42-year-old Craig Gordon missing, Angus Gunn returns for the June friendlies against Iceland and Liechtenstein.\nGunn, currently a free agent after leaving Norwich City, has 15 caps and was first choice at Euro 2024 before injury struck, allowing Gordon to reclaim his spot.\nUncapped duo Robby McCrorie and Cieran Slicker provide back-up, with the latter having played 10 minutes as a substitute for Ipswich Town all season.\nMcCrorie made 20 Premiership starts for Kilmarnock, while the vast majority of Scottish top-flight goalkeepers come from other countries.\n\"We just keep looking, Scottish grannies are in big demand,\" Clarke half-joked when the issue was raised at his squad announcement media conference.\n\"Since we had Craig, David Marshall and Allan McGregor, we haven't quite had the same quality coming through.\n\"It's something we should have picked up on a few years ago. It's probably an oversight. We had three goalkeepers of such quality all playing at the same time and you think 'that will never end'.\"\nGordon has 81 caps, having made his international debut in 2004, while Marshall played 47 times and McGregor bowed out after 42 appearances.\n\"We have a crop of younger ones and you don't know how they are going to progress,\" Clarke said.\n\"You can be saying 'we haven't got anything' then suddenly some 18, 19, 20-year-olds might get some minutes on the pitch and get a chance to play more regularly.\n\"In March, I said to the coaches of the 17s, 19s and 21s to try and pick four goalkeepers, so you're looking at more and putting them in against their peers. Then you're looking for the one that can step up and become the best in that age group.\"\nOf goalkeepers with recent Scotland Under-21 experience, Hearts' Liam McFarlane and Ruairidh Adams of Dundee United have been busy, each playing 39 games this season, on loan at East Fife and Kelty Hearts respectively.\nRangers' Lewis Budinauckas played four matches for Greenock Morton and eight with Partick Thistle before losing his place to 35-year-old David Mitchell.\nMurray Johnson of Hibernian got 13 games for Airdrieonians and was then limited to just one minute with Queen of the South in the second half of the term.\n\"The young ones need to play,\" Clarke added. \"A lot tend to be kept in squads to sit on the bench. They are working with good people and learning good habits but only in training.\n\"Maybe we can find a way to get these young goalkeepers out to clubs in League 1, League 2, the Championship at an earlier age where they play and do well.\n\"Obviously, if you're a manager and you take a young goalkeeper and he throws a couple into the net, you're going to put a more experienced goalkeeper back in.\n\"The boys need a chance and, when they get a chance, they need to take it. If they don't, the manager won't play them.\"", "url": "https://www.bbc.com/sport/football/articles/c787jljz973o"}