{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:09:39", "date_modify": "2025-05-21 04:09:39", "date_publish": "2025-04-06 12:46:17", "description": "Keith Dudgeon takes three wickets as Kent wrap up a 145-run victory over Northants on day three of their County Championship match.", "filename": "sport_cricket_articles_cyvq464z51no_1747800579.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/56e6/live/905d3250-12db-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cyvq464z51no_1747800579.html", "title": "County Championship: Kent wrap up win on day four against Northants", "title_page": "County Championship: Kent wrap up win on day four against Northants - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Kent seamer Keith Dudgeon produced career-best figures of 7-36 to wrap up his side's County Championship victory over Northamptonshire just half an hour into the third morning.\nThe 29-year-old South African, making his debut in English cricket, rattled through the last three Northamptonshire wickets to secure a 145-run success – only Kent's second red-ball win in their past 20 games.\nIt took Kent only seven overs to complete their win at Wantage Road, with the home side bowled out for 114 in their second innings as George Bartlett was left unbeaten on 60.\nResuming on 54 not out, Bartlett did his best to farm the strike and take the odd single, but he could not protect the tail for long and Dudgeon struck in his third over of the morning to take his tally of wickets to five.\nDom Leech, attempting to fend off a short delivery, could only send it looping into the gloves of Harry Finch – and Liam Guthrie departed in Dudgeon's next over, bowled off his pads for a duck.\nDudgeon completed Kent's victory – their third successive red-ball win over Northamptonshire – two balls later, uprooting Raphael Weatherall's off stump with a fizzing yorker.\nAfter the match, it was confirmed that Nottinghamshire leg-spinner Calvin Harrison will join Northants on loan ahead of their trip to Old Trafford to play Lancashire next week.\nECB Reporters Network supported by Rothesay\nNorthants head coach Darren Lehmann said:\n\"That was disappointing with the bat and the boys have got to take some accountability.\n\"It wasn't a two-and-a-half-day wicket, I thought the groundsman did a really good job – that for me was a nice four-day wicket, more of a 250 wicket in each innings.\n\"I think both sides batted badly, but Kent probably bowled a bit better than us. We should probably have limited them to 180 and dropped a few catches, but we fought back beautifully yesterday.\n\"I thought [Rob] Keogh was excellent first innings and [George] Bartlett was great today, that number three spot was up for grabs and he's really taken it.\n\"We've got some work to do with the bat but we've got to change our mindset and adapt to conditions better than we did.\n\"We had three blokes that let the ball go and didn't play a shot.\n\"Bats cost about 500 quid – you've got to start using them.\"\nKent head coach Adam Hollioake said:\n\"It's nice to get it done in what's effectively two days. It's a low-scoring shootout so there's always times in the game where there's a lot of pressure.\n\"When it's 200 plays 200 plays 140, or what have you, every run is hard fought for, so you have to show a lot of character. This is a young, inexperienced side, but the character they showed was really pleasing.\n\"[Keith Dudgeon] – he's a great signing we've got here at Kent. What an impact – it's a dream start to his Kent career.\n\"He's popular in the changing room already, he's a lovely guy, and you can just feel the enthusiasm and aggression coming off him. That's what we need.\"", "url": "https://www.bbc.com/sport/cricket/articles/cyvq464z51no"}