{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:23:06", "date_modify": "2025-05-20 14:23:06", "date_publish": "2023-07-29 07:14:05", "description": "Newcastle United: Eddie Howe says Magpies 'more united' after US tour", "filename": "sport_articles_c721r50ypn1o_1747750986.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b8a8/live/237bfff0-2ddf-11ee-94f6-79582dd10f90.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c721r50ypn1o_1747750986.html", "title": "Newcastle United: Eddie Howe says Magpies 'more united' after US tour", "title_page": "Newcastle United: Eddie Howe says Magpies 'more united' after US tour - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Newcastle United boss Eddie Howe says his squad will return from their tour of the United States \"a more united group\".\nThe Magpies came from behind to beat Brighton in the Premier League Summer Series in New Jersey, thanks to a late double from 20-year-old midfielder Elliot Anderson.\n\"It's been really good,\" Howe told Newcastle's official website, external when asked about the tour as a whole.\n\"It's been really hard work for the players, I've got to say. We've worked them every day.\n\"There's been a couple of team-building activities that will really help our spirit.\n\"I do think we go back a more united group. The new players will feel a lot more acclimatised to the group.\"\nAnd he reserved special praise for 20-year-old match-winner Anderson, who turned the game on its head in the final five minutes after Danny Welbeck had given Brighton the lead early in the second half.\n\"He was running right until the end. He came back the fittest players in all our tests and it's no surprise he's still the one running to score the winning goal,\" added Howe.\n\"He's always been a goalscorer and a goal creator. What pleased me today was that last part of the game for him. He started to show with his physicality, his endurance levels and, of course, his quality - the two goals were excellent finishes.\"", "url": "https://www.bbc.com/sport/articles/c721r50ypn1o"}