{"authors": ["Amelia Warren", "www.facebook.com"], "date_download": "2025-04-26 03:53:11", "date_modify": "2025-04-26 03:53:11", "date_publish": "2025-03-03 09:09:00", "description": "Derby County fans want answers from the Rams board as relegation fears mount, writes supporter Amelia Warren.", "filename": "sport_football_articles_c5y25vwq301o_1745639591.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/468e/live/b391a4d0-f80b-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c5y25vwq301o_1745639591.html", "title": "Derby County fan view: Questions for Rams board as relegation fears mount", "title_page": "Derby County fan view: Questions for Rams board as relegation fears mount - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "After last week's last-minute heartbreak against Millwall, Derby were unable to turn their terrible run of form around against Middlesbrough.\nOnce again, the Rams looked second best all afternoon and, other than an early shot from Ebou Adams which stung the palms of Mark Travers, there were very few other moments to get the respectable number of travelling Derby fans excited.\nThe 1-0 defeat at The Riverside was Derby's third defeat in as many games since John Eustace took charge, leaving many fans questioning owner David Clowes and chief executive Stephen Pearce.\nFans want to know why previous manager Paul Warne wasn't provided with better player recruitment during the summer and January transfer windows.\nAnd also why the decision to sack Warne came after the January window had ended, leaving new man Eustace to inherit a threadbare squad of players which many fans feel is simply not good enough to compete in the Championship, and doesn't suit his playing style.\nDespite now being rock-bottom of the Championship table, fans are finding it even tougher to take knowing that fixtures such as Plymouth Argyle at home, Millwall at home last weekend and Luton Town away have seen Derby drop several points from winning and drawing positions.\nGames you feel could've been seen out if we ultimately had better quality players on the pitch.\nA frustration which reared its head once again on Saturday as another individual error cost us a crucial point in the fight for survival.\nWithout injuries to crucial players like Curtis Nelson, Kane Wilson and David Ozoh, you do wonder whether the Rams may have been able to grind out a few more results to push them away from the drop.\nIt now feels like if midweek games go against us and we fail to win against Blackburn on Saturday, relegation is all but confirmed.", "url": "https://www.bbc.co.uk/sport/football/articles/c5y25vwq301o"}