{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:13:23", "date_modify": "2025-05-21 05:13:23", "date_publish": "2025-04-05 00:00:00", "description": "Follow live text commentary, score updates and match stats from West Bromwich Albion v Sunderland in the Championship", "filename": "sport_football_live_ce82d0xwwrgt_1747804403.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/49c5/live/5a556080-1225-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_ce82d0xwwrgt_1747804403.html", "title": "West Bromwich Albion v Sunderland: Championship stats & head-to-head", "title_page": "West Bromwich Albion v Sunderland: Championship stats & head-to-head - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Trai Hume hit the winning goal for the second consecutive game as Sunderland kept alive their slim hopes of automatic promotion from the Championship with a resolute victory against play-off chasing West Bromwich Albion.\nA strong Baggies start in glorious sunshine at The Hawthorns had the Black Cats on the backfoot, only for defender Hume's venomous inswinging 35th-minute free-kick to beat ill-prepared keeper Joe Wildsmith for pace.\nThe hosts, who have now not won in four games and remain outside the top six by two points, continued to have the bulk of possession with Mikey Johnston and Grady Diangana particularly threatening, but they were too often wayward in front of goal and sloppy with their final pass.\nJayson Molumby missed their best chance, somehow heading over from a well-worked short corner just before the interval, while Darnell Furlong also had a shot cleared off the line by the outstanding Chris Mepham.\nSunderland, in fourth and eight points off the top two, continued to keep the Baggies at arm's length on the resumption with the hosts ending with 21 attempts on goal but just three on target.\nTheir ninth away league win of the season was based on a masterful defensive display, epitomised by Mepham, who made several superb blocks and tackles, including the vital goalline clearance to deny Furlong.\nLuke O'Nien was equally influential, while Hume's quality also showed at the other end, his powerful free-kick flying past a bemused Wildsmith for the game's telling moment.\nThe Baggies could easily have been ahead before Hume followed up his winning goal against Millwall last week, but as well as Furlong's nearly moment, Johnston had a shot blocked as Albion wasted several promising situations.\nBut despite Johnston remaining a likely source of a goal, Tony Mowbray's side created very little after the resumption and stay in seventh spot after a fifth game in a row without a win against Sunderland.\nWest Brom head coach Tony Mowbray told BBC WM:\n\"Joe [Wildsmith] acknowledged he made a pretty bad mistake which cost us a goal, and ultimately the game.\n\"But that's the job as a goalkeeper. It's frustrating because that becomes the narrative. With the chances we had and the situations we got into, you have to put the ball in the net.\n\"We've been here before but I'll see what he's like in training and see how he reacts. It's very naive to think 'the goalie makes a mistake, so change the goalie'.\n\"If the goalie you put in makes a mistake in the next game, where do you go then? Change him again? I don't think so. I will rely on my experience to make the right decisions.\n\"But the responsibility of the team is to score some goals in a game we were on top of for most of it.\"\nSunderland head coach Regis Le Bris told BBC Radio Newcastle:\n\"We were really well connected and won many duels and our team spirit was impressive again.\n\"They put many bodies in the box and they tried different options to create situations but we defended well.\n\"Until the end we were on the edge but the mentality of the team is getting better – you can feel it now.\n\"Probably three or four months ago we would have lost that game and we've lost many points in these circumstances, so this was positive.\"", "url": "https://www.bbc.com/sport/football/live/ce82d0xwwrgt"}