{"authors": ["Ffion Wynne", "www.facebook.com"], "date_download": "2025-04-26 03:52:01", "date_modify": "2025-04-26 03:52:01", "date_publish": "2025-03-05 11:19:05", "description": "England captain Heather Knight criticises the widening gap between the top men's and women's salaries in the The Hundred.", "filename": "sport_cricket_articles_cq6ym34q28vo_1745639521.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/468e/live/42001770-f9af-11ef-b257-2b725ccbdd87.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_cricket_articles_cq6ym34q28vo_1745639521.html", "title": "The Hundred: England captain Heather Knight says gender pay gap 'looks bad'", "title_page": "The Hundred: England captain Heather Knight says gender pay gap 'looks bad' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "England captain Heather Knight has criticised the disparity between men's and women's salaries in The Hundred.\nThe gap in pay between the top men's and women's players has widened from £75,000 to £135,000 for this year's competition.\nTop level men's players will see their pay increase by 60% to £200,000, while leading women's salaries are rising 30% to £65,000, as part of an overall 25% rise across all salary bands.\nIn the lowest-earning category, men will be paid £31,000, up from £30,000 in 2024, while women will earn £10,000, up from £8,000.\n\"It's great to see the overall pot for the women has gone up but it looks bad when the disparity between the top men's and women's salaries continues to grow when it should be coming down,\" said Knight.\n\"There's a huge amount of money coming into the game so we want to see that the whole game is benefitting.\n\"You don't want that gap to widen, you want to continue to make progress.\"\nThe England and Wales Cricket Board (ECB) said both men's and women's salary pots were raised by around 25% in the latest increase and that women's salaries alone increased by £800,000 in 2023.\nAn ECB spokesperson added: \"In the men's game, the latest increase was weighted towards the top end in order to be competitive in the global market.\n\"In the women's game, the increase was spread across the salary bands because we need to make more progress across the board.\"", "url": "https://www.bbc.co.uk/sport/cricket/articles/cq6ym34q28vo"}