{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:27:28", "date_modify": "2025-05-21 07:27:28", "date_publish": "2025-03-28 13:37:37", "description": "Read the BBC Sport Online Voting Terms and Conditions.", "filename": "sport_articles_c5yryg2y2mno_1747812448.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c5yryg2y2mno_1747812448.html", "title": "BBC Sport Online Voting Terms and Conditions", "title_page": "BBC Sport Online Voting Terms and Conditions - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "You can take part by accessing the relevant web page. You will find the question and a list of alternative answers. You can register your vote by electronically selecting the option you wish to vote for.\nAny votes registered outside the announced voting times, which will be listed online and on-air, will not count.\nOnline voting may require you to log into the page with your BBC account, which you can do here. If you do not have a BBC account, you can register for one for free here. If you have any trouble registering or signing in, you can visit the help pages.\nThis is not a competition and there will be no prize for any option or anyone taking part. Where the vote result has a consequence, the BBC will endeavour to meet it but editorial requirements may lead to a change in schedule or a change in programme content. However, the vote result stands.\nThe number of times you can vote may be restricted. The presence of a cap to voting and what that limit is will be made clear for each vote. Some votes may be restricted geographically to within the UK only. If you are not in the right area, you will not see the vote.\nLive results may be displayed during the vote window. These should not be taken as an indicator of the final published results, but merely as a snapshot for interest. The BBC will announce the final result on-air and/or online (where applicable) when voting is closed and the actual result is known.\nThe BBC reserves the right to disqualify entries or suspend voting if it has reasonable grounds to suspect that fraudulent voting has occurred or if it considers there has been any attempt to rig the voting. The BBC has the right to substitute an alternative selection method at its absolute discretion. For the purposes of investigating possible voting irregularities when voting on BBC web pages using BBC account the BBC may use cookies, log IP addresses or analyse the information from your BBC account. The BBC will not publish this information or provide it to anyone without permission, except where required for enforcement of these terms. For more information please see: BBC Privacy Policy; how the BBC uses cookies and BBC online Terms of Use.\nIf, for any reason, the online voting system fails, the vote may be suspended or a contingency plan may be actioned.\nThe BBC reserves the right to change, cancel or suspend this vote at any time.\nThe BBC, its sub-contractors, subsidiaries and/or agencies cannot accept any responsibility whatsoever for any technical failure or malfunction or any other problem with any system, server, provider or otherwise which may result in any vote not being received by the BBC, not properly registered or recorded.\nPlease note that BBC, BBC Group or Telescope employees or anyone who is directly connected in any way with the associated BBC content or the vote is not eligible to vote.", "url": "https://www.bbc.com/sport/articles/c5yryg2y2mno"}