{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:41:35", "date_modify": "2025-04-26 06:41:35", "date_publish": "2025-03-02 12:34:08", "description": "Rangers fan reaction: 'Barry Ferguson is not a magician'", "filename": "sport_articles_cpwdx2vepk1o_1745649695.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ce4f/live/1680d390-f366-11ef-896e-d7e7fb1719a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cpwdx2vepk1o_1745649695.html", "title": "Rangers fan reaction: 'Barry Ferguson is not a magician'", "title_page": "Rangers fan reaction: 'Barry Ferguson is not a magician'  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "We asked for your views on Rangers' 2-1 defeat against Motherwell.\nHere's what some of you said:\nPaul: The end of the season can't come quick enough to clear out this underperforming Rangers team and start fresh. Give the managerial position to Barry Ferguson full time, then we will see a team of proven fighters, diehards and winners, with the manager setting the standards from his own successful playing career at the club.\nDuncan: The team are very lethargic, lacking in positivity. I don't see this pool of players being able to bring the result expectations of a Rangers team. New players are badly required.\nAlan: The team have no spirit, fight, determination and no leader on the park. Ferguson may regret taking this job on, but the team needs players who want to win. The current squad do not appear to have any desire to win.\nSue: We can see why Jack Butland was never quite good enough, a lot of loan periods in the league and a brief international career and never near good enough at Manchester United. Can we not just bring Allan McGregor back out of retirement as he is far superior than Butland will ever be, Butland is always a mistake waiting to happen.\nLennie: Absolutely disgraceful performance again, if we play James Tavernier and Robin Propper on Thursday night, we will get slaughtered. Ianis Hagi was awful, we send out young Leon King on loan, he is a better player than those who played in the defence. Ferguson is not a magician, give youth a chance, our season is over anyway.", "url": "https://www.bbc.co.uk/sport/articles/cpwdx2vepk1o"}