{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:32:43", "date_modify": "2025-05-19 14:32:43", "date_publish": "2017-08-04 15:38:35", "description": "Daniel Johnson's penalty gives Alex Neil a victory over Sheffield Wednesday in his first game as Preston manager.", "filename": "sport_football_40760788_1747665163.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4224/production/_97223961_rexfeatures_8983940l.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_40760788_1747665163.html", "title": "Preston North End 1-0 Sheffield Wednesday", "title_page": "Preston North End 1-0 Sheffield Wednesday - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Daniel Johnson's penalty gave Alex Neil a victory over Sheffield Wednesday in his first game as Preston manager.\nSean Maguire and Callum Robinson both tested Owls keeper Keiren Westwood as the hosts had the better chances.\nAfter substitute Ross Wallace fired over for the visitors, former Wednesday defender Tommy Spurr headed against the bar at the other end.\nJohnson scored the winner from the spot after Tom Lees brought down Jordan Hugill in the area.\nIn a summer of change at Deepdale, former Norwich boss Neil replaced Simon Grayson who left for Sunderland in June.\nThe 36-year-old is likely to have been impressed with the performance from his new team, as they beat a side which had reached the Championship play-offs in the past two seasons.\nAt the start of the Owls' 150th anniversary campaign, the visitors struggled to threaten with their best chances falling to Glenn Loovens, who tested Chris Maxwell early on, and Wallace.\nRobinson could have given the hosts the lead with a header which he directed straight at Westwood before curling a shot around the post.\nPreston manager Alex Neil:\n\"Our strength is that we have such a good team spirit, they work so hard for each other and we got what we deserved today.\n\"When you have that amount of pressure, you want what you deserve. We could and maybe should have scored more.\n\"That's three points on the board now. Notoriously in the last two seasons we've not started well so it's pleasing to get three points on the board.\"\nSheffield Wednesday boss Carlos Carvalhal:\n\"We deserved to lose the game. We were out of everything. We ran too much in the first half but with no brain.\n\"We didn't win too many second balls, Preston won all the second balls. We had one or two chances, Preston had more than us so congratulations to Preston.\n\"No excuses about us, we must do much better to win games in the Championship and we must analyse this game to do better in the future.\"", "url": "https://www.bbc.com/sport/football/40760788"}