{"authors": ["Frank Keogh", "www.facebook.com"], "date_download": "2025-05-21 03:37:55", "date_modify": "2025-05-21 03:37:55", "date_publish": "2025-02-11 15:02:14", "description": "Last year's winner I Am Maximus is allocated top weight for the Grand National, which takes place at Aintree on 5 April.", "filename": "sport_horse-racing_articles_c5y2edlpen7o_1747798675.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/32a4/live/2f07d420-e873-11ef-bd1b-d536627785f2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_horse-racing_articles_c5y2edlpen7o_1747798675.html", "title": "Grand National 2025: I Am Maximus heads weights for Aintree race", "title_page": "Grand National 2025: I Am Maximus heads weights for Aintree race - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Last year's winner I Am Maximus has been allocated top weight for the Grand National at Aintree on 5 April.\nThe Willie Mullins-trained horse, owned by JP McManus, triumphed by seven and a half lengths in the 2024 race from runner-up Delta Work, with Minella Indo third and Galvin fourth.\nMullins said it would be a big task to win the race for a second time, carrying 11st 12lb. No top weight has won the race since triple victor Red Rum in 1974.\n\"It's top weight and it's tough, but we had an idea that it would be tough,\" said Mullins, who also won the National with Hedgehunter in 2005.\n\"It was huge to win it last year for the second time. I felt very spoilt winning a second Grand National.\"\nRoyale Pagaille is second on the list at 11st 9lb, while his Venetia Williams stablemate L'Homme Presse is a pound lower alongside the Mullins pair of Grangeclare West and Nick Rockett, plus Envoi Allen for Henry de Bromhead.\nDespite his weight, I Am Maximus is joint favourite with bookmakers alongside Inothewayurthinkin (11st 5lb) for Gavin Cromwell.\nWith Iroko also prominent in the betting, McManus has three leading hopes of landing the National for a fourth time, and all nine of his entries are in the top 43.\nOf last year's other placed horses, Delta Work is on 11st 2lb, Minella Indo a pound higher and Galvin on 10st 13lb.\nThe National is a handicap chase with runners allocated different weights that they must carry according to their ratings.\nThere are currently 87 horses entered for the race. The maximum number of runners in the National was cut last year to 34 from 40 following a safety review and 32 runners went to post after two withdrawals.\nOfficial handicapper Martin Greenwood believes those at 59 or above in the current list will struggle to make the cut.\nMr Vango, winner of the Peter Marsh Chase at Haydock for Sara Bradstock, is at 65 on 10st 2lb and likely to miss out.\n\"It will break my heart if we get some soft ground and we can't run because he could win a National on soft ground. That was why I was so keen,\" said Bradstock, whose husband Mark – trainer of 2015 Cheltenham Gold Cup winner Coneygree – died last year.\n\"It does look like there's possibly rain this spring, but we're not going to get in are we?\"\nFormer football manager Harry Redknapp faces a wait to see if his horse Shakem Up'arry – number 58 in the list on 10st 4lb – will make the cut.\nBut trainer Paul Nicholls hopes to have five runners - Hitman, Bravemansgame, Threeunderthrufive, Kandoo Kid and Stay Away Fay.\nAs well as a reduction in runners, other safety measures introduced last year included a standing start for the race, which went off at the first time of asking, a reduction in height to one of the fences, and added foam and rubber toe boards on every fence.\nThere were no fallers and 21 horses completed the race - the highest number across the finish line since 1992 - with four horses unseating their riders and seven pulled up.", "url": "https://www.bbc.com/sport/horse-racing/articles/c5y2edlpen7o"}