{"authors": ["Steve Sutcliffe", "www.facebook.com"], "date_download": "2025-04-26 07:37:51", "date_modify": "2025-04-26 07:37:51", "date_publish": "2025-02-27 13:59:29", "description": "Manchester United's Andre Onana is in the spotlight as a result of his error against Ipswich - but how does he stack up against the man he replaced, David de Gea?", "filename": "sport_football_articles_c1lppd1p9mzo_1745653071.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1ca3/live/3f253ad0-f509-11ef-8a81-19610c927464.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c1lppd1p9mzo_1745653071.html", "title": "Manchester United: Andre Onana analysis after Ipswich error", "title_page": "Manchester United: Andre Onana analysis after Ipswich error - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Manchester United goalkeeper Andre Onana is in the spotlight again after his error led to Ipswich Town taking an early lead in their Premier League game on Wednesday evening.\nUnited rallied and eventually won the game 3-2 despite being down to 10 men, but the mistake has reignited the debate about the Cameroon international.\nThe 28-year-old endured a tough start to life at Old Trafford but appeared to have turned a corner earlier this season when he had the most clean sheets in England's top flight with six.\nHowever, four minutes in to the game against the Tractor Boys, he illustrated why United fans and pundits have persistent doubts about him.\nHe dashed to the edge of his penalty area as Patrick Dorgu ran towards him and, as the left wing-back nudged the ball towards where he expected Onana to be, it gifted Jaden Philogene with a tap-in.\nThe former Aston Villa winger later scored his second of the night from a deep cross that deceived Onana because of Liam Delap's run across him.\nSpeaking on TNT Sports, former Blackburn and Wales midfielder Robbie Savage said: \"I've got no idea why Onana is running out to that position [for the first goal].\n\"Dorgu has got it under control, no problem at all. He shouldn't come there.\n\"You should be talking, lay it back to him on his right foot and then he can clear it. I don't know why he's come.\"\nFormer United defender Rio Ferdinand added: \"It was a terrible start. Onana doesn't need to come. The full-back is in complete control and he can just hold his ground and let him play it back to him.\"\nOn BBC Radio 5 Live, former Celtic boss Neil Lennon added: \"I don't know where Andre Onana is going. It is a shambles.\"\nHe has a better shot save percentage than Onana - 72 compared to 65 - and has yet to make any big errors directly leading to goals, compared to three for Onana.\nIn mitigation, De Gea has faced fewer shots (90 to 111) and Onana has also had to contend with a switch in formation from 4-3-3 to 3-4-3 under a new manager in Ruben Amorim.\nThe Portuguese boss is also yet to name an unchanged starting XI in any of the 23 matches he has taken charge of and has had a habit of substituting one of his three central defenders after about an hour.\nThat can hardly help build relationships and understanding at the back and nor can Onana be blamed for some of the static defending in front of him.\nIt should also be noted Onana has at times made crucial saves this season.\nWhat's more, Fiorentina are in better form than United, challenging for a Champions League spot in Italy while United are a lowly 14th in the Premier League.\nHowever, a perhaps surprising statistic against Onana centres around passing accuracy, given he was brought in as the calatyst towards a possession-based style of play.\nDe Gea was not noted for his dexterity with his feet but trails Onana by just 1%, although he has made significantly fewer passes. His pass completion statistics in his final season at United (73%) were also higher than Onana's this year.\nFormer United goalkeeper Massimo Taibi, whose famous howler against Southampton in 1999 hastened his own departure from Old Trafford, believes Onana could be on borrowed time.\n\"I think subconsciously the United environment isn't ideal for him and when a marriage is showing cracks, it's pointless to continue,\" he told the Sun in December.\n\"I'd be straight to the point and tell him, 'Andre, you are one of the best keepers in Europe but in the Premier League, you are under-performing. Block out criticism, do some soul-searching, press the reset and go again. And if things don't change by June, move on'.\"\nOnana will perhaps be wondering if his latest error will lead to his exit from Old Trafford after just two seasons in Manchester.", "url": "https://www.bbc.co.uk/sport/football/articles/c1lppd1p9mzo"}