{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:31:30", "date_modify": "2025-04-26 06:31:30", "date_publish": "2025-02-27 08:46:46", "description": "Nottingham Forest 0-0 Arsenal: Fan views", "filename": "sport_football_articles_c4geeelmkm5o_1745649090.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c4geeelmkm5o_1745649090.html", "title": "Nottingham Forest 0-0 Arsenal: Fan views", "title_page": "Nottingham Forest 0-0 Arsenal: Fan views - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "We asked for your views on Nottingham Forest's Premier League match against Arsenal.\nHere are some of your comments:\nForest fans\nLuke: I think a few of the lads are off the boil compared to earlier in the season, which is understandable. So it's good to stop the rot and get another point on the board, especially with a clean sheet. Hoping that Nuno can get us back to our best for the run-in, and we can keep our fate in our own hands.\nDoug: A good game for Forest - it was very important not to lose. We were solid at the back, but a bit sloppy with our passes in transition going forward. Could have nicked it at the end. Well done you Reds.\nPip: Back to the solid defensive displays we've been seeing this season, after a few games where that seemed to have slipped. Ryan Yates and Danilo made a difference in midfield when they came on. We need to keep focused on the style of play that has got us this far if we want to be in Europe next season.\nArsenal fans\nJames: Great performance from Arsenal with loads of energy. Dominated possession, shots, corners etc. If just one forward was available, then they'd have won this game.\nDavid: Pathetic. A must-win game and Arsenal players barely get out of a walk. Turgid. No tempo. No chances created. Does Mikel Arteta think this is good enough? Top four at best now. Something is clearly wrong with recruitment at the club when everyone who follows football knows what is missing.", "url": "https://www.bbc.co.uk/sport/football/articles/c4geeelmkm5o"}