{"authors": ["Nigel Ringland", "www.facebook.com"], "date_download": "2025-05-20 13:28:55", "date_modify": "2025-05-20 13:28:55", "date_publish": "2023-07-25 07:21:48", "description": "Mona McSharry finishes fifth in the women's 100m breaststroke final at the World Swimming Championships, while Daniel Wiffen qualifies for the men's 800m freestyle final.", "filename": "sport_swimming_66292305_1747747735.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/C4FF/production/_130513405_monamcsharry.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_swimming_66292305_1747747735.html", "title": "World Swimming Championships: Mona McSharry fifth in 100m breaststroke final as Daniel Wiffen progresses", "title_page": "World Swimming Championships: Mona McSharry fifth in 100m breaststroke final as Daniel Wiffen progresses - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ireland's Mona McSharry finished fifth in the women's 100 metres breaststroke final at the World Swimming Championships in Fukuoka, Japan.\nMcSharry, 22, was in second place with five metres to go but her time of 1:06:07 saw her pipped for a medal.\nIf she had repeated the time she set in the heats, a new Irish record of 1:05:55, she would have taken silver behind Ruta Meilutyte of Lithuania.\nNI's Daniel Wiffen has reached the final of the men's 800m freestyle.\nThe Magheralin swimmer lowered his own Irish record as he was involved in a tough four-way battle throughout the 16 lengths of his heat.\nBut he edged out American Bobby Finke on the final stroke to win by six-hundredths of a second.\nWiffen's time of 7:43.81 was comfortably inside the qualification time for the Paris Olympics.\nHis mark was also just inside the previous national record of 7:44.45 as he moved into Wednesday's final as the fourth fastest swimmer behind Australia's Sam Short.\nShort, 19, who took gold in the 400m freestyle on the first day of the meet on Sunday, was impressive in winning his heat in 7:40.90.\nMcSharry was competing for silver going into the closing stages, before being caught by Tatjana Schoenmaker from South Africa and American pair Lydia Jacoby and Lilly King.\nShe missed out on bronze by just 0.13 seconds but will take confidence from the fact that she is competing with the best in the world - the four swimmers who finished ahead of her are all Olympic gold medal winners.\n\"I think looking at it, it's obviously a little painful, especially not swimming fastest in the final hurts, but it's all a learning experience and when I look at the people that came ahead of me, world champions, record holders, Olympic champions, so to be up there and racing against them and have it be such a close race is giving me a great confidence boost,\" said McSharry.\n\"I just have to carry on to the rest of the events this week and not let it take me down. I think it's great to be able to practice racing against those people for the Olympics next year because that's the main goal in my mind, it's just training and preparing for that.\"\nMcSharry returns to the pool on Thursday for the 200m breaststroke heats.\n\"It feels great, that's the number one job done which was to qualify for the Olympics and then to make my way through to the final, so I've done both and it was a great race,\" said Wiffen.\n\"My plan going in was to be as easy as possible. I was maybe hoping for a tiny bit faster, but it wasn't too taxing on the body. I didn't go to my legs at all, I just wanted to win the race, so I sped up a little but there's plenty more in the tank.\"\nWiffen joined McSharry and Ellen Walshe in qualifying for the Olympics next year and becomes only the fourth Irish swimmer to make a World Long Course Championship final.\nAlso in action for Ireland were Victoria Catterson and Darragh Greene.\nCatterson, who is concentrating on the 100m freestyle in Japan, was 31st in the 200m freestyle in a time of 2:00.82, just over a second outside her own Irish record of 1:59.86.\nGreene swam 27:54 in the 50m breaststroke to finish 22nd place overall.", "url": "https://www.bbc.com/sport/swimming/66292305"}