{"authors": ["Chris Collinson", "www.facebook.com"], "date_download": "2025-05-21 05:43:36", "date_modify": "2025-05-21 05:43:36", "date_publish": "2025-01-31 16:55:16", "description": "Tottenham news: Terrible form and Daniel Levy's reign", "filename": "sport_football_articles_cdxnezvezllo_1747806216.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f494/live/78214ff0-dfd2-11ef-a319-fb4e7360c4ec.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cdxnezvezllo_1747806216.html", "title": "Tottenham news: Terrible form and Daniel Levy's reign", "title_page": "Tottenham news: Terrible form and Daniel Levy's reign - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tottenham have taken just four points from their last 10 Premier League games – their worst form for almost 31 years.\nOnly once across their 1,251 Premier League games have they taken fewer points in a 10-game spell, when they took just three points between January and March 1994.\nGiven the club's struggles, chairman Daniel Levy's stewardship has come under scrutiny, having been in charge since March 2001.\nThe chart below shows how many points Tottenham have taken from any 38-game spell (i.e. a season's worth of games) across the entire Premier League era, giving us an idea of what kind of side Spurs have been at different times.\nAs you can see, when Levy became chairman back in 2001, Tottenham were mainly a mid-table side, taking around 50 points from 38 games.\nBut over the next 18 years, Tottenham were steadily transformed under Levy into a team that not only competed regularly for the top four, but also for a time the Premier League title.\nThe pinnacle of the Levy era (so far) came between 2016 and early 2019, when Spurs showed true title-challenging form by taking 88 points from 38 games on two separate occasions.\nHowever, the club have been unable to reach those heights in the six years since then, with their results in the Premier League falling off massively this season in particular.\nWhile their severe injury list should definitely be taken into account, Tottenham have taken just 46 points from their last 38 Premier League games – the fewest they've taken from a season's worth of games since April 2009.\nIt's also one point fewer than the club took in the 38 games before Levy was appointed chairman way back in March 2001.", "url": "https://www.bbc.com/sport/football/articles/cdxnezvezllo"}