{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:59:34", "date_modify": "2025-04-26 06:59:34", "date_publish": "2025-02-27 05:08:47", "description": "Cardiff City manager Omer Riza says their battle to avoid relegation has made it \"not possible\" for him to field a full-strength side in the fifth round of the FA Cup.", "filename": "sport_football_articles_cx2xk91p1pjo_1745650774.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/95fa/live/d677ed40-f466-11ef-aeb3-bb556fdec0fe.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cx2xk91p1pjo_1745650774.html", "title": "FA Cup fifth round: 'Not possible' for Cardiff to be at full strength against Aston Villa", "title_page": "FA Cup fifth round: 'Not possible' for Cardiff to be at full strength against Aston Villa - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Cardiff City manager Omer Riza says their battle to avoid relegation has made it \"not possible\" for him to field a full-strength side against Aston Villa in the FA Cup on Friday.\nThe Bluebirds are just three places and six points above the Championship's bottom three, with 12 league games remaining.\nCardiff, who are into the fifth round of the FA Cup for the first time in 11 years, face third-place Burnley and fourth-place Sunderland the week after their trip to Villa Park.\n\"It's the FA Cup, the fifth round and I'd like to put my strongest team out so you can have a real go at it,\" said Riza.\n\"We have just got too many far more important games coming up, which is about surviving and staying in the Championship.\n\"If we were 12th in the league now and not where we are I'd have no issues putting out our full strength.\n\"But we have a lot of things we need to deal with in the league, we're not in that position.\n\"We'll do our best and that's all we can do.\"\nRiza said if it were not for the fans, part of him would have preferred to have been knocked out in an earlier round.\n\"It's great for the fans, a good moment for them,\" said Riza.\n\"They're really happy about the fact we're in the fifth round and going to Villa. There's 6,000 fans going which we're really happy with.\n\"I want to win and get to the final, but are we really going to do that?\n\"Sometimes I think it would have been best if we went out in the third round, but then you look at it and say, 'Look what we've given the fans'.\n\"I speak to lots of them and they are so excited about this game, and that's why I'm disappointed we can't be at full strength and have a real go at it.\"\nDespite Riza's frustrations, spirits will be high in the Cardiff camp after a crucial midweek win over Hull City, which lifted them above the Tigers in the league.\nAston Villa meanwhile suffered a 4-1 loss at Crystal Palace on Tuesday, and are likely to rest some players before their Champions League last 16 match with Club Brugge.\nAnd while naming a full-strength team may not be possible, Riza said \"nothing was impossible\" when it comes to the result.\n\"It's going to be a very tough game, but nothing is impossible in football,\" said Riza.\n\"They will still have a full team of internationals on the pitch, that's the depth they've got.\n\"We have to manage the game accordingly and correctly. We have to approach it in a way where we're not easy to break down and use the ball diligently.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cx2xk91p1pjo"}