{"authors": ["Harry Poole", "www.facebook.com"], "date_download": "2025-05-20 13:47:39", "date_modify": "2025-05-20 13:47:39", "date_publish": "2023-07-31 13:05:14", "description": "Olympic champion Ryan Crouser's new 'Crouser Slide' technique has seen him set a world record in 2023 as he prepares to defend his World Championship title.", "filename": "sport_athletics_66312451_1747748859.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/008A/production/_130583100_gettyimages-1332421451.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_athletics_66312451_1747748859.html", "title": "Ryan Crouser: Record-breaking American reinventing the shot put with the 'Crouser Slide'", "title_page": "Ryan Crouser: Record-breaking American reinventing the shot put with the 'Crouser Slide' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "When Dick Fosbury leapt backwards over the bar to win high jump gold at the 1968 Mexico Olympics, it changed the discipline forever.\nFifty-five years later, another innovative American is tearing up tradition - this time in the shot put.\nSelf-coached and with an academic background in engineering and finance, Ryan Crouser was already the world record holder and reigning Olympic and world champion before modifying his technique this year.\nStanding over two metres tall and weighing 145kg, the 30-year-old has married curiosity with a scientific approach to develop his revolutionary style and edge further clear of the competition.\nThe result? The 'Crouser Slide'.\n\"It's something that is logical and follows the laws of physics,\" says Crouser, speaking on The Warm Up Track podcast.\n\"I've always been on the quantitative side of things and I think that reflects a lot in what I do and how I approach the sport.\n\"At the end of the day, it's looking at things logically, asking 'does this make sense?' and questioning why things are being done a certain way.\"\nCrouser's new approach involves a step-across method, beginning his sequence to the right of the throwing circle to include an initial lateral shift which the two-time Olympic champion calculates allows for close to 60 degrees of additional rotation.\nIt led to an improved world record throw of the 16-pound shot which, at 23.56 metres, almost cleared the entire pit in Los Angeles in May.\nIt was the first occasion Crouser had felt his new technique click in competition and added more than 20cm to the 23.37m mark he had previously set in ending compatriot Randy Barnes' 31-year hold on the record in 2021.\n\"There is not any one thing that makes me truly outstanding but I'd say technical proficiency is where I'm strongest,\" says Crouser.\n\"A large part of that is down to being a maths and science type. With my background in engineering, analytics and finance, I'm looking for numbers, patterns and repeatability.\n\"In re-working my technique, I've created a much wider rotation but the downside is a little bit more inconsistency.\n\"It's been a trade-off between increasing power at the expense of consistency and repeatability.\"\nThe Oregon-born athlete is today responsible for 10 of the 14 biggest throws in the history of the event - and eight of the 12 ratified by World Athletics to have exceeded the 23m mark.\nCrouser's consistency does not appear to have suffered too much either, with his average of 22.61m across six throws at the recent London Diamond League bettering the single best attempt of each of his competitors.\nHis furthest that day - 23.07m in the fifth round - ranks as the ninth biggest throw of all time as he prepares to defend his world title in Budapest.\nPrior to winning his first Olympic gold at the Rio Games in 2016, Crouser had come close to quitting the sport altogether.\nKeen to prioritise his academic interests, to the extent he ruled out American football due to concerns over head injuries, training alongside studying for a Masters degree took its toll.\n\"Rio was a really special one for me because I'd really been struggling that year in particular,\" Crouser says.\n\"I was lifting at 6am in the morning, studying all day and throwing on weekends when I could. I was really struggling and I almost walked away from the sport.\n\"I told my dad I was done with it but he told me to stick it out because it was an Olympic year.\"\nThe latest talented thrower of his family - his father was a discus alternate at the 1984 Olympics while his uncle and cousin have both made US teams in javelin - Crouser believes there is more to come as he continues to hone his technique.\nA 24m throw is not out of the question, he says. What is beyond any doubt is who the red-hot shot favourite will be when the World Championships begin on 19 August.\n\"People have a tendency to get carried away. As soon as I threw 23.37m, people said that 24m was the next logical step but it's such a big gap,\" says Crouser.\n\"There are so many variables that impact that truly optimal performance.\n\"Physical preparation, technique, sleep, recovery and nutrition on the day - trying to put together the perfect throw is a challenge.\n\"I think 24 metres is possible. Someone might come along and throw 25 metres. It's hard to really put a limit on the human body.\"", "url": "https://www.bbc.com/sport/athletics/66312451"}