{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:35:03", "date_modify": "2025-05-20 12:35:03", "date_publish": "2023-08-04 08:19:45", "description": "Chelsea youngsters 'definitely take opportunity'", "filename": "sport_articles_cw4gdk19v8po_1747744503.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ed2b/live/9415c0f0-31fb-11ee-8f52-fbf70e4bf742.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cw4gdk19v8po_1747744503.html", "title": "Chelsea youngsters 'definitely take opportunity'", "title_page": "Chelsea youngsters 'definitely take opportunity' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Alex Howell, BBC Sport\nPochettino challenged the younger players to take the opportunity to prove they should be part of his squad for next season and some of them have definitely done that.\nDefender Bashir Humphreys, 20, started three matches and looked very comfortable when called upon. Pochettino and his staff were aware of Humphreys and his potential and have watched clips of his performances while he was on loan at Paderborn in Bundesliga 2.\nDutch under-21 international Ian Maatsen and 19-year-old Brazilian midfielder Andrey Santos have been mentioned already but both of those players look like they could be in serious contention to be part of the first-team plans.\nItalian Cesare Casadei, fresh from the Under-20 World Cup, where he won the Golden Ball and Golden Boot as Italy lost in the final to Brazil, has also played a lot of minutes for the first team.\nThe 20-year-old looks physically ready to deal with Premier League football and has shown plenty of examples of powerful running from deep in midfield.\nHowever, when put under pressure by Fulham in the game in Washington, he was caught in possession in dangerous areas, so maybe he would benefit from a spell on loan away before competing in the Premier League.", "url": "https://www.bbc.com/sport/articles/cw4gdk19v8po"}