{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:16:38", "date_modify": "2025-05-21 06:16:38", "date_publish": "2025-03-31 08:55:08", "description": "A selection of fan responses after another action-packed weekend in the Scottish Premiership.", "filename": "sport_football_articles_czrvg5v3z13o_1747808198.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5596/live/1697d470-0e35-11f0-ac9f-c37d6fd89579.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_czrvg5v3z13o_1747808198.html", "title": "Sinisalo impresses, Ferguson's future & McInnes pressure - fan views", "title_page": "Sinisalo impresses, Ferguson's future & McInnes pressure - fan views - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Another action-packed weekend in the Scottish Premiership has raised plenty of questions for supporters as the top-six race and battle for the drop intensifies in the final stretch of the campaign.\nWe asked fans from each and every club to share their views on their team's performance at the weekend, plus their hopes and fears as the season hots up.\nHere are a selection of your responses.\nCeltic fans were happy with the performance of replacement goalkeeper Viljami Sinisalo in the 3-0 win over Hearts as well as hailing their top scorer again...\nScott: Kyogo who? Daizen Maeda doing what he does best, just a shame he spent nearly three years on the left. Decent showing too from the boy Viljami Sinisalo. Not the most taxing game but never looked flustered and can play with his feet. Eight more games like this would do nicely.\nRoddy: A shaky start, but once we got going we won at a canter. Sinisalo in goal and Maik Nawrocki in defence should be playing every game to finish the season now to give them confidence going into next season.\nShaun: I was frustrated with the passing around the defence again, but once we got going we had three great goals. I was very impressed with Sinisalo and to see him comfortable at corners and not panicking like Kasper Schmeichel was good, I want him to continue in goal as Kasper is past it.\nSome Rangers fans were less impressed with their goalkeeper's performance in the 4-3 win over Dundee, and there are mixed views on interim manager Barry Ferguson...\nWilliam: Difficult game to watch as a Rangers supporter, far too many errors, however what an exciting match! I feel Cyriel Dessers is unfairly criticised by Rangers fans as he gives 100% every game. Jack Butland has to go as he makes far too many errors for a Rangers goalie.\nMurray: Have to give credit to Barry Ferguson for making the changes but this team is a mess. I thought maybe Barry should get the job but not so sure now.\nRonnie: Incredible game, incredible result. Absolutely no way Rangers win that game under Philippe Clement. Barry rang the changes and the players rolled their sleeves up. Our three goals in the second half were brilliant. Yes defensively we were shocking and Dessers remains an enigma but we won the game and that's the main thing. Give Barry the job, he has us fighting for the jersey once again.\nSue: Rangers could easily have lost the game but somehow won it in a thrilling match. Butland proves yet again why he was never good enough at the top tier of football with a basic goalkeeping mistake plus he continues to slice the ball into touch when kicking out from his box. Ridvan Yilmaz's performance was laughable it was that bad. Credit to Dessers for his resilience but not the top striker that Rangers need.\nHibernian fans are in buoyant mood after securing a top-six place after they extended their unbeaten league run to 15 games with a 3-0 win over St Johnstone...\nTim: What a turnaround from the beginning of the season. Hibs look so assured and confident on the pitch. They look well drilled, disciplined and creative. With the right signings over the summer, we'll be a real threat to the Old Firm.\nCraig: Top six secure and now to wrap up European football for next season. Who'd have thought in November we'd be here? Junior Hoilett's goal was superb and he was defensively sound all game. It was good to see Alasana Manneh get some minutes, hope he continues to improve the more game time he gets. Anniversary year going well to date.\nMeanwhile optimism has returned in Aberdeen, who also confirmed their top-half place with a 4-1 win over Motherwell...\nJimibub: The absolute minimum goal has now been met, and what a way to achieve it. That had early season vibes to it. Now, get to the Cup final (or achieve a Cup win, better yet) and secure third.\nIt has been a rollercoaster, but as all have said so often, if we had gotten here without either run, no one would be complaining. At least Dave Cormack kept his cool for once and didn't sack Jimmy Thelin.\nFred: An excellent team performance and a well-deserved win. If the team can maintain this standard, third is a definite possibility. All the players performed today, no passengers.\nDundee United moved closer to the top-six with a hard-fought 1-0 win away at Ross County...\nMalcolm: Top six now looks on which is a great achievement hope we don't qualify for Europe it wrecked us last time . Significant rebuild required in summer with a number likely to be moving on.\nGeorge: Important victory which should guarantee top six finish. We started the season hoping to secure our league status, top six is a bonus. Jim has some tough decisions at the end of the season to ensure we push on next season.\nSome Hearts fans are harbouring doubts about head coach Neil Critchley after the limp loss at Celtic Park...\nBobster: Tame, gutless, unacceptable. Hearts rolled over again in a predictable 3-0 loss - no fight, no urgency, no pride. Neil Critchley must realise that he is on borrowed time. Fans deserve better than this spineless showing. Why should we accept it?\nPeter: Critchley was right to take the initiative and attack from the outset. In doing that, we must capitalise on the chances created, but we did not. Celtic were Celtic, fast at the counter attack, even when under pressure, and our defence is not at full strength.\nThis game was never likely to yield anything and we now focus on winning the next two games as that is all that matters. Results for Hibs and Aberdeen make it much less likely now to secure a European place, but that is not our immediate focus.\nMeanwhile Kilmarnock boss Derek McInnes is also in the firing line of some fans after a 5-1 thumping in Paisley...\nJames: I'm sorry, but this is the same team as last year and the manager still doesn't know his best XI. Tactically all over the place and outfought, not just today but the vast majority of the season. Time for Derek McInnes to go.\nNeil: Disappointed with the performance and the result obviously, but even more so with the manager's comments afterwards. If he thinks we were \"alright\" then we've got major problems and we'll find even the elusive 11th place out of our reach.\nAlan: I said before the game that five of the players in the starting XI were untrustworthy. Sorry to be critical of players but Robby McCrorie, Lewis Mayo, Liam Polworth, Liam Donnelly and Marley Watkins are not good enough. The midfield two continually get dropped then tried again, dropped again. The one criticism I have with the manager is he has never sorted the midfield since he came in and it is hitting us now.\nA few St Johnstone supporters believe there is no way back in their fight to avoid the drop after a sore defeat by Hibs...\nIan: That was as bad as it has been this season, it looks like we're going down with a whimper unless there is a dramatic turnaround. There was no purpose to our possession and passing, always going sideways and backwards from good positions. Passes don't win games, goals do. We need to remember that.\nGreg: It wasn't a game we expected to win but the performance was nothing short of shocking. Tensions ran high at the end, with harsh words exchanged between fans and the manager. At this point, relegation feels almost inevitable.\nMeanwhile Dundee fans fear their defensive issues could haunt them this season after losing 4-3 to Rangers despite holding a 3-1 lead with 16 minutes left...\nEddie: Same old story. Dreadful defending again and the bottom line is our entire defence are simply not good enough. Our management team should have addressed this months ago, but did nothing. A play off spot is all we can now hope for.\nGary: I wish the manager would take some accountability for his lack of game management. At the end of the first half, and for most of the second, Rangers were on top but still Docherty did nothing from the bench. All the hard work of the first half hour faded.\nRoss County should look to move on quickly after their home defeat by United, says one fan...\nAli: County players cannot be criticised for lack of effort they all gave 110%, but we struggled to compete with United physically, and with the finer black arts side of the game. Apart from Randall's closing down and ball winning our midfield was non existent. So heads up lads and onwards with the main task at hand, to stay in the league.", "url": "https://www.bbc.com/sport/football/articles/czrvg5v3z13o"}