{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:09:24", "date_modify": "2025-05-19 15:09:24", "date_publish": "2015-02-20 00:00:00", "description": "England slip to their joint heaviest ODI defeat as New Zealand chase 124 in 13 overs in the World Cup in Wellington.", "filename": "sport_live_cricket_31021064_1747667364.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_live_cricket_31021064_1747667364.html", "title": "Cricket World Cup 2015: New Zealand v England", "title_page": "Cricket World Cup 2015: New Zealand v England - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Goodbye\nSo, the time has come to close down this live text. Let's just say it's been emotional... from an England perspective at least.\nThanks, as ever, for your company and contributions. We'll be back later today at 22:00 GMT for Pakistan against West Indies. See you then.\nJoin the debate at #bbccricket\nNew Zealand batsman Ross Taylor tweets:, external Now that's a great win @BLACKCAPS . Big congrats to Tim and Baz. Amazing by both of them.\nIreland batsman Ed Joyce:, external One of the best spells of swing bowling you'll ever see from Southee #CWC15 and pretty handy from McCullum!\nEmail tms@bbc.co.uk\nChris: Hideously inclement weather here in this part of Queensland meant a short day at work. I picked up a few beers on the way home then settled down to watch England. I've seen some rubbish from them over the years but that was surely the mother of all nadirs. Embarrassing.\nThe new table\nHere's the updated standings in Pool A - and it makes grim reading for England.\nYou could call their match against Scotland on Sunday evening a real World Cup four-pointer.\n'We can still reach quarters'\nMore from England captain Eoin Morgan, speaking to Sky Sports: \"I think the basics of our plans and our thinking is there, it's just about having a good enough skill level to execute them.\n\"We intend to go about putting it right by getting a win in and putting in a performance against Scotland.\n\"Our first goal is to get to the quarter-finals and we can still do that.\"\n'No positives'\nEngland captain Eoin Morgan, speaking to Sky Sports: \"It's a very disappointing day. Considering we've lost our two opening games now, we did say they were going to be hard, but I'd have expected a bit more from us.\n\"We were outperformed. A lot of credit has to go to New Zealand - they bowled very well and again outperformed us.\n\"There are no positives to take from today, which is probably the most disappointing thing.\n\"But we have to go back to getting the basics right in order to get any momentum in this tournament.\"\nJoin the debate at #bbccricket\nAndrew Buckingham: How many runs would New Zealand have got if they had batted first? 400, 450 even? It could have been even worse for England.\nAnil Hanagud: Pakistan in 92 had a bad start too; don't worry; England might pick themselves up and then may go on to win the WC.\nPost\nTim Southee's 7-33 were the best one-day figures by a New Zealander. Then the real carnage began.\nBrendon McCullum walloped the fastest World Cup fifty in history - beating his own record with this 18-ball knock - on his way to recording 77 off 25 balls. Steven Finn copped the worst punishment with his two overs costing 49 runs. The end was never far away following that, as Geoffrey Boycott put it, \"murderous assault\".\nPost\nTo offer you a bit more information on the damning end result, England collapsed from 104-3 to 123 all out once captain Eoin Morgan (17) was dismissed by Adam Milne's superb catch at long-on.\nJoe Root, who top-scored with 46, could only watch on in sheer disbelief as the wicket tumbled at the other end. Tim Southee was bowling fast, full and straight. Throw in a hint of movement - just a hint - and England couldn't cope.\nJoin the debate at #bbccricket\nPaul Collins:, external NZ were brilliant but England will try to fully use that to excuse own performance. Got their head in the sand. Just rubbish\nMichael Gillon:, external England deserve what they get. Bring back KP as captain, Morgan out, Finn out, Ballance out, Hales in. Jordan in.\nKeith Lawton:, external Went to sleep at 53/3 wake up three hours later and we've lost! Pathetic and embarrassing.\nWhat's happening in the cricket?\nThe 6am alarm clock has just gone off. First job of the day... check in on the cricket.\nI'm sorry everyone, but I have bad news. There is no cricket. It's all over. Finished. Kaput.\nEngland were bowled out for 123. New Zealand knocked them off in 12.2 overs. Trounced.\nFull report here, if you dare read the grisly tale.", "url": "https://www.bbc.com/sport/live/cricket/31021064"}