{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:05:12", "date_modify": "2025-05-21 04:05:12", "date_publish": "2025-01-15 09:00:08", "description": "Brentford 2-2 Man City: Fan views on Premier League game", "filename": "sport_football_articles_cn4xe0m4yl4o_1747800312.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cn4xe0m4yl4o_1747800312.html", "title": "Brentford 2-2 Man City: Fan views on Premier League game", "title_page": "Brentford 2-2 Man City: Fan views on Premier League game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your thoughts after Tuesday's Premier League game between Brentford and Manchester City, where the Bees came from two goals down to secure a 2-2 draw late on.\nHere are some of your comments:\nBrentford fans\nTheo: A complete performance against one of the best clubs in the world. Very consistent in both halves, defended really well, looked dangerous going forward and battled for every ball. So much effort and pressing from the boys, and we never gave up! Couldn't be prouder of my team.\nMitch: I thought we were excellent, but if we'd been a little braver in the first half and played Kevin Schade from the start against a holding midfielder, we'd have won. I never felt we were overly threatened, and if we'd converted our chances... but what a fantastic game! Players were outstanding.\nRhys: Incredible night. Amazing performance. It should have been 5-2! Wonderful to watch and great to see Rico Lewis back in the Premier League.\nCliff: Super proud of our Brentford team. One of the best games at the Gtech this season and it felt like a win. I can't help but think that City should have completely closed the game down, though - and in previous seasons they would have I'm sure. Anyhow, Liverpool on Saturday!\nCity fans\nPat: Difficult one to take. For most of the game we were solid and controlled the midfield. We scored two very good goals and created numerous chances when we should have put the game to bed. Then we allow two soft goals in the last 10 minutes and drop two more points. But, for me, the game hinged on the decision to bring on Ilkay Gundogan for Mateo Kovacic. It felt wrong, looked wrong and ultimately changed the game.\nJosh: Much better performance all round but same defensive frailties visible. Nathan Ake can't do it all - Josko Gvardiol and Manuel Akanji are still liabilities defensively.\nColin: Frightening to see how low City are in confidence. The play on the edge of the opposition box shows that no-one will take a risk and either shoot or make a risky pass. All very safe and very boring - and won't lead to goals. A shadow of their former selves.", "url": "https://www.bbc.com/sport/football/articles/cn4xe0m4yl4o"}