{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:36:35", "date_modify": "2025-04-26 04:36:35", "date_publish": "2025-02-28 11:48:46", "description": "Carlisle United manager Mark Hughes challenges his side to build on their 1-0 win at local rivals Barrow on Thursday.", "filename": "sport_football_articles_c39vvgk2rryo_1745642195.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2cff/live/0436d700-f5c5-11ef-97ab-abb74cabf06c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c39vvgk2rryo_1745642195.html", "title": "Carlisle United: Mark Hughes wants to build on win over Barrow", "title_page": "Carlisle United: Mark Hughes wants to build on win over Barrow - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Carlisle United manager Mark Hughes has challenged his relegation-threatened side to build on their 1-0 win at local rivals Barrow on Thursday.\nMatthew Dennis' first-half goal was enough to secure a first win since Hughes' arrival earlier this month.\nThe Cumbrians remain bottom of League Two despite going three games unbeaten but Hughes says they need more victories.\n\"Three games is a decent run, we need to get back-to-back wins if we can,\" Hughes told BBC Radio Cumbria.\n\"Every game we have from now until the end of the season is important for us.\n\"The lads enjoyed the emotion of it, they haven't had that chance too much this season with the fans.\n\"I'm pleased for them. They need to remember the feeling and make sure we experience it again. [It was] a great result for us.\"\nCarlisle next host league leaders Walsall on Tuesday with the opportunity to climb out of the relegation zone with a win if results at the weekend go their way.\nThursday's victory moved Carlisle level on points with second-bottom Morecambe, who have a slightly superior goal difference, and within two points of safety.", "url": "https://www.bbc.co.uk/sport/football/articles/c39vvgk2rryo"}