{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:42:02", "date_modify": "2025-05-21 04:42:02", "date_publish": "2025-04-03 08:16:03", "description": "Southampton 1-1 Crystal Palace: Fan views", "filename": "sport_football_articles_c62k13y40kxo_1747802522.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c62k13y40kxo_1747802522.html", "title": "Southampton 1-1 Crystal Palace: Fan views", "title_page": "Southampton 1-1 Crystal Palace: Fan views - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your views on Southampton's draw with Crystal Palace in the Premier League.\nHere are some of your comments:\nSouthampton fans\nChris: Best performance we have seen this season. Balanced hard-working team who marked every Palace player and gave them no space. Brilliant.\nStuart: I am gutted for the lads. They actually played their hearts out for the fans. They just couldn't hold on! We need eight more performances like this. Just leave it all out on the pitch. I don't care about 11 points or anything. Play with heart and guts and I will be a happy Saints fan. Let's get back to a proper league and rebuild!\nBarry: Decent display. Might give the lads some much-needed confidence. Having a leader like Jack Stephens back in the line-up helped. Kyle Walker-Peters and Matheus Fernandes were superb and Flynn Downes played his best game for a long time.\nPalace fans\nGraham: An after-party hangover! A disappointing display and we struggled to get going after Jean-Philippe Mateta's early shot and we gave the Saints too much space.\nBeefus: Palace looked complacent from the off as if they thought they had a right to win. Their passing was very sloppy and general play showed no urgency. I think the measure of a poor side is how easily they give away possession. On this display, the Eagles looked like the relegation candidates.", "url": "https://www.bbc.com/sport/football/articles/c62k13y40kxo"}