{"authors": ["Brian McLauchlin", "www.facebook.com"], "date_download": "2025-05-21 05:35:00", "date_modify": "2025-05-21 05:35:00", "date_publish": "2025-04-02 15:08:31", "description": "After more than a decade of stability, league reconstruction is back on the agenda in Scottish football. But why now? And what happens next?", "filename": "sport_football_articles_cx2ydg7gp9ko_1747805700.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/fb8a/live/4e066250-0fd4-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cx2ydg7gp9ko_1747805700.html", "title": "Why are we talking about league reconstruction again?", "title_page": "Why are we talking about league reconstruction again? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It's been a while, but league reconstruction is now back on the agenda in Scottish football.\nThe blissful accord of the last decade of so has again been disrupted by talk of 10-team top flights, voting structures and money distribution.\nEarlier this month, the SPFL Competitions Working Group commissioned a review of restructuring options, from maintaining the status quo to altering the make-up of all four top-flight divisions.\nThe Working Group meets on 29 April to discuss those options, so why are they talking about this and what happens now?\nWhile the Scottish game has been reasonably stable in its set up for more than a decade, the same cannot be said about European football.\nRecent developments have led to more games in the Champions League and Europa League, plus the addition of the Conference League.\nThat has further crowded the fixture calendar and put more strain on squads, while also exacerbating the financial gulf between the top clubs and the rest.\nIn 2024, the SPFL announced a record sum of over £33m was being paid to the 42 clubs, but 80% went to the top 12 with the 30 teams below sharing the remainder.\nWhen you add in Uefa solidarity payments - paid to Premiership clubs not playing in Europe - and the gap widens even further between the top 12 and the rest.\nLower down the leagues, clubs are struggling. This season, League One clubs Inverness Caledonian Thistle and Dumbarton have been put into administration, with others having struggling to make ends meet.\nThere is also a growing number of teams wishing to join the pyramid set-up, with the current Highland/Lowland league format likely to change.\nIt could be there is are new East, West and Northern Leagues with the three winners playing a round-robin competition for the right to play the bottom club in League Two for a place in the SPFL.\nReducing the Premiership to 10 teams would mean clubs playing 36 games compared to the current 38, with each team meeting four times and no split.\nHowever, it's hard to envisage that gaining enough support from clubs, given they could be voting themselves out of the elite.\nA 14 or 16-team top flight are also possibilities, with a number of options regarding splits likely to be under consideration.\nHowever that would mark the most radical change in a generation and would need the majority of clubs to agree.\nIt would also need the support of the broadcast partners, who pour millions of pounds into the SPFL.\nIn the main, Sky Sports would be looking to ensure that four Old Firm fixtures remain part of the calendar. And that would be unlikely with a bigger top league.\nIt was previously thought unlikely that the SPFL would ask fans for their thoughts on reconstruction, but that stance has shifted.\nStuart Murphy, chief executive of the Scottish Football Supporters' Association told Good Morning Scotland that supporters will be involved in discussions.\n\"I've had a conversation this morning. Fans will be consulted, which is a sea change - one that we welcome.\n\"It's potentially a really big day in the Scottish football landscape. The Working Group will meet to float ideas and proposals which they will then take back to clubs.\n\"When we have done research at the SFSA, it is overwhelming that fans want bigger leagues.\"\nWhether the SPFL listen to those fans or not is another issue.\nThe voting structure within the SPFL can look quite complicated and could, of course, change. Although there would likely need to be a vote to force that...\nAs it stands, for anything to be voted through, a proposal needs the backing of:\n11 of the 12 Premiership clubs\n8 of the 10 in the Championship\n15 of the 20 in Leagues 1 and 2\nIf any of the above does not happen then, as things stand, no change to the current structure can be made.", "url": "https://www.bbc.com/sport/football/articles/cx2ydg7gp9ko"}