{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:03:17", "date_modify": "2025-05-20 12:03:17", "date_publish": "2023-08-05 12:58:27", "description": "Crewe fight back from two goals down to frustrate 10-man Mansfield who have to settle for a draw.", "filename": "sport_football_66345827_1747742597.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/15C36/production/_90724198_football_getty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66345827_1747742597.html", "title": "Crewe Alexandra 2-2 Mansfield Town", "title_page": "Crewe Alexandra 2-2 Mansfield Town - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Crewe fought back from two goals down to frustrate promotion hopefuls Mansfield who, down to 10 men, had to settle for a draw at Gresty Road.\nStags defender Calum MacDonald's 59th-minute sending off slowed down Mansfield's momentum after two first-half strikes from Davis Keillor-Dunn had put them in charge.\nMickey Demetriou hit back for Crewe before the break, and immediately after MacDonald's dismissal Rio Adebisi levelled the game.\nKeillor-Dunn drove a powerful low shot past Alex keeper Harvey Davies from the edge of the box to open the scoring in the 22ns minute.\nHe then doubled the lead soon after, showing a deft touch to take Stephen Quinn's pass before firing into the corner past Davies.\nDavies kept out efforts from Keillor-Dunn and Lucas Akins as the visitors piled on the pressure.\nBut Crewe halted the advance and cut the deficit in the 32nd minute when veteran debutant Demetriou reacted quickest at a corner to hook a close-range finish past Christy Pym.\nDavies was well positioned to beat away an angled drive from Rhys Oates, but Mansfield were fortunate when Chris Long's effort beat Pym but came back off the bar just before the break.\nKeillor-Dunn, chasing his hat-trick, skewed a shot against the outside of the post soon after the restart as Mansfield looked to restore their two-goal lead.\nHowever, MacDonald was handed a straight red card just before the hour for clattering into Long near to the halfway line, and Crewe were level immediately after.\nThe resulting free-kick went out wide from where it was driven across the box by Jack Powell for Adebisi to glance a header into the far corner.\nCrewe frontman Shilow Tracey wasted a great shooting chance when he blazed over wildly and, despite their numerical disadvantage, Mansfield still posed a threat with Akins and Oates going close.", "url": "https://www.bbc.com/sport/football/66345827"}