{"authors": ["Jack Herrall", "www.facebook.com"], "date_download": "2025-05-21 06:15:14", "date_modify": "2025-05-21 06:15:14", "date_publish": "2025-04-01 10:34:35", "description": "How important was return of influential Celtic captain Callum McGregor?", "filename": "sport_articles_cql6vkk2ygxo_1747808114.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5186/live/dd7cee90-0ee4-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cql6vkk2ygxo_1747808114.html", "title": "How important was return of influential Celtic captain Callum McGregor?", "title_page": "How important was return of influential Celtic captain Callum McGregor? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Callum McGregor returned to lead Celtic on Saturday as they cruised past Hearts and, once again, the skipper showed just how crucial he is to Brendan Rodgers' side.\nAfter Rangers' 3-2 triumph at Parkhead in the previous outing, much of the post-match analysis for Celtic was dominated by the absence of McGregor through injury.\nThe 31-year-old returned to action against Hearts and was running the show against a team who came to press just like Barry Ferguson's side, but Celtic were able to withstand the pressure and work well during the transition to hurt the visitors.\nWith 99% passing accuracy from 67 passes, one well-weighted assist for Daizen Maeda's crucial opener, and two chances created, McGregor was instrumental in Celtic's attacking play.\n\"People talked after the Old Firm defeat about how much McGregor was missed, I think you saw in the first 45 minutes at the weekend how he was missed,\" Sunday Mail chief football writer Scott McDermott told the Scottish Football Podcast.\n\"I'm convinced that Neil Critchley looked at the Rangers game and thought, 'We're going to go with that approach.' Five at the back, tried to press really high, play with intensity.\n\"McGregor was the guy that came up with the solutions to get Celtic out of that press - and that was proved in the first goal.\"\nWhen Hearts did venture forward, they were snuffed out by the midfielder, who won two duels, had a couple of interceptions, and recovered the ball on seven occasions for his side.\n\"That's what they couldn't really do against Rangers,\" McDermott said.\n\"It's not a slight against Arne Engels, who was playing in that position, but he's just not got the experience or the know-how of the fixture that Callum McGregor's got.\"", "url": "https://www.bbc.com/sport/articles/cql6vkk2ygxo"}