{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:37:24", "date_modify": "2025-05-21 04:37:24", "date_publish": "2025-04-04 16:29:19", "description": "Nottingham Forest news: Opinion - 'Just not losing is enough' at Villa Park", "filename": "sport_football_articles_c3wxq2vd6j0o_1747802244.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d635/live/a97973f0-6e9b-11ef-b02d-c5f3b724a1ea.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c3wxq2vd6j0o_1747802244.html", "title": "'Just not losing is enough' at Villa Park", "title_page": "Nottingham Forest news: Opinion - 'Just not losing is enough' at Villa Park - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "I would like to think Nottingham Forest are safe now from dropping out of a Champions League spot.\nI know they are taking it game by game, but they are very hard to beat.\nThey show a defensive resilience like no other team in the league and they have adopted a style that, again, no other team in the league has adapted to this year.\nI really like the way that they have played. As a neutral, they have been a breath of fresh air.\nWe are so used to teams risking the ball at the back - but Forest don't. They know what their strengths are and they look like they enjoy defending.\nTo get their players to be so gritty is brilliant. Who would have thought that the likes of Callum Hudson-Odoi - when he was at Chelsea, or even when he went to Germany - or Anthony Elanga when he was at Manchester United, had that side to their game?\nThey are exciting to watch in the transition and the speed they counter-attack at is phenomenal.\nThey play Aston Villa this weekend and I think that will be a difficult test. Villa are inconsistent but that is probably not helped by the amount of games they have played this season because juggling competitions is hard.\nThey had to strengthen in January and those players are really helping them as Marco Asensio and Marcus Rashford have found their form at a critical stage.\nI think this game will be good, exciting contest. Villa Park is always a difficult place to go too, but just not losing is enough for Forest.", "url": "https://www.bbc.com/sport/football/articles/c3wxq2vd6j0o"}