{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:13:07", "date_modify": "2025-05-20 13:13:07", "date_publish": "2023-08-01 07:38:49", "description": "Queens Park Rangers sign former Nottingham Forest midfielder Jack Colback on a two-year deal.", "filename": "sport_football_66370068_1747746787.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/CEAE/production/_130601925_jackcolbackrex2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66370068_1747746787.html", "title": "Jack Colback: Queens Park Rangers sign former Nottingham Forest midfielder", "title_page": "Jack Colback: Queens Park Rangers sign former Nottingham Forest midfielder - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Queens Park Rangers have signed former Nottingham Forest midfielder Jack Colback on a two-year deal.\nThe 33-year-old was a free agent having left the City Ground in the summer and has an option for a third year at QPR.\nThe experienced midfielder played 11 times in the Premier League last season having been a key part of the Forest side that won promotion in 2022.\nHe has played more than 400 games in a 15-year career that saw him spend six years at Newcastle United.\nHe began his career at the Magpies' rivals Sunderland with whom he reached the 2014 League Cup final and had two spells on loan at Ipswich Town.\nColback joined Newcastle in 2014 and helped the Magpies win the Championship in 2017 under Rafael Benitez after relegation the previous season.\n\"Success in this division takes a lot of work, you have to be ready to do the ugly side of the game,\" Colback told the QPR website.\n\"That's the difference between the two levels in terms of the Championship and the Premier League.\n\"There's a difference in terms of the tactics, too. In this division you will come up against teams who want to play football a lot, and you will come up against teams who will be in your face and more direct, which is something you don't get as much in the Premier League.\"\nHe is the fifth player to move to QPR during the summer as the R's aim to improve on their 20th placed finish in the Championship last season.\n\"He is a great player and he had one or two other suitors but he chose QPR because he wants to buy into what we are trying to do here, which is great,\" said Rangers boss Gareth Ainsworth.\n\"He will add energy and experience to us. He has got quality on the ball, but he has tenacity off it and a winning mentality, which will hopefully be contagious.\"", "url": "https://www.bbc.com/sport/football/66370068"}