{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:39:19", "date_modify": "2025-04-26 07:39:19", "date_publish": "2025-02-27 13:23:42", "description": "Hearts fan views on win over St Mirren", "filename": "sport_articles_cx2xkzk28vxo_1745653159.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2ab8/live/4ccac460-f451-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cx2xkzk28vxo_1745653159.html", "title": "Hearts fan views on win over St Mirren", "title_page": "Hearts fan views on win over St Mirren - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "We asked you for your thoughts on the 3-1 comeback win over St Mirren that sent Hearts into the top six.\nHere's what some of you said:\nIain: Not the best of games but a win nevertheless. In the first half Hearts barely passed a ball and defended poorly. The boos at half-time were justified. Second half started poorly and I was on the verge of screaming at Neil Critchley to get some subs on when James Wilson equalised. What a lift that gave our players.\nChris: Very fortunate, poor defending allowed us a way back into the game but we were poor all over for long spells. Not sure how we won that game 3-1. The officiating tonight was diabolical, we need full-time referees.\nWilliam: In the first half, Hearts looked all over the place and St Mirren deserved their half-time lead. But whatever the manager said to the players at half-time certainly worked, we worked the ball well, moving it more crisply, and we ran out worthy winners.\nAnon: Poor first half, defence rickety at times. New signings introduced and not fully match fit yet. Much better second half. Good and welcome result. Referee was weak and reactive. VAR poor and almost spoiled the match.\nJim: We need to start each match with more aggression, get on the front foot and keep the pressure on our opponents. Far too many misplaced passes, giving easy chances. Better up front now we have choices in attack but hope we have Cammy Devlin is back for Sunday's encounter.", "url": "https://www.bbc.co.uk/sport/articles/cx2xkzk28vxo"}