{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-05-20 14:08:29", "date_modify": "2025-05-20 14:08:29", "date_publish": "2023-07-29 18:43:08", "description": "Manchester United agree a £72m deal to sign Denmark international striker Rasmus Hojlund from Serie A side Atalanta.", "filename": "sport_football_66319320_1747750109.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/12E8C/production/_130525477_rasmushojlund.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66319320_1747750109.html", "title": "Rasmus Hojlund: Manchester United agree to sign Denmark striker from Atalanta in £72m deal", "title_page": "Rasmus Hojlund: Manchester United agree to sign Denmark striker from Atalanta in £72m deal - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester United have agreed a £72m deal to sign Denmark international striker Rasmus Hojlund from Serie A side Atalanta.\nThe 20-year-old will move to Old Trafford for a fee of £64m, plus a potential £8m in add-ons.\nHojlund joined Atalanta in August 2022 and scored 10 goals in 34 appearances last season.\nHis United contract will be for five years, with the option of an additional season.\nHojlund will be United manager Erik ten Hag's third signing of the summer after midfielder Mason Mount joined from Chelsea for £55m and Inter Milan goalkeeper Andre Onana was signed for £47.2m.\nAlthough United had been attempting to keep the fee below £60m, Hojlund was Ten Hag's first choice for the striking position.\nUnited had distanced themselves from a move for Tottenham forward Harry Kane, having decided a deal for the England skipper would be too expensive and difficult to complete.\nAlthough there is still some work to do to conclude the Hojlund transfer, it is not anticipated personal terms will be a problem.\nIt means Ten Hag gets his wish of having a forward in before the start of the season, with United feeling that in Mount, Onana and Hojlund, the bulk of their summer transfer business has been done.\nIt takes their overall spend to a minimum £166.2m, with the potential to rise to £180m.\nAsked about Hojlund in a news conference before his side's final tour game against Borussia Dortmund in Las Vegas, Ten Hag said: \"I can't talk about a player who is still under contract at another club.\"\nLigue 1 champions Paris St-Germain were also reportedly interested Hojlund as a potential replacement for France captain Kylian Mbappe, whose immediate future is unclear.\nThe Dane began his senior career at Copenhagen, making his Danish Superliga debut aged 17 in 2020, before switching to Austrian side Sturm Graz two years later.\nHojlund spent only six months in the Austrian Bundesliga after joining Sturm in January 2022, and scored a goal every other game, finding the net nine times in 17 starts.\nThat impressive form led to his move to Atalanta for a reported £15m, 10 times what Sturm Graz had paid for him six months earlier.\nHe made his international debut in 2022 and has scored six goals in six games, all in qualifying for Euro 2024.\nProviding the transfer is completed in time, Hojlund could come into contention for United's final pre-season friendlies against Ligue 1 side Lens next Saturday at Old Trafford and Athletic Bilbao in Dublin on Sunday.\nUnited face Wolverhampton Wanderers at home in their opening 2023-24 Premier League fixture on Monday, 14 August at 20:00 BST.", "url": "https://www.bbc.com/sport/football/66319320"}