{"authors": ["Iain Carter", "www.facebook.com"], "date_download": "2025-05-21 03:54:10", "date_modify": "2025-05-21 03:54:10", "date_publish": "2025-04-07 14:36:05", "description": "Peter McEvoy, the first British amateur golfer to make the cut at the Masters, dies at the age of 72", "filename": "sport_golf_articles_c3r8nqrny33o_1747799650.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f95b/live/06339ab0-13bc-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_golf_articles_c3r8nqrny33o_1747799650.html", "title": "Peter McEvoy - former amateur champion and Walker Cup captain dies, aged 72", "title_page": "Peter McEvoy - former amateur champion and Walker Cup captain dies, aged 72 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Peter McEvoy, the first British amateur golfer to make the cut at the Masters, has died aged 72.\nBorn in London, McEvoy was brought up near Turnberry on the Ayrshire coast. Despite a gentle Scottish burr, he represented England in a decorated career among the unpaid ranks.\n\"We have lost one of amateur golf's most respected figures,\" said R&A chief executive Mark Darbon.\n\"Peter was an outstanding amateur golfer and enjoyed an illustrious career. He also worked so hard to develop the game as an administrator and help provide opportunities for aspiring players.\n\"On behalf of The R&A and The Royal and Ancient Golf Club of St Andrews I would like to offer our deepest condolences to Peter's family at this sad time.\"\nAlthough regarded as talented enough to make his living playing the game, McEvoy preferred to remain a leading figure away from the professional circuits.\nHe won the Amateur Championship in both 1977 and 1978, the second of those victories coming in the same year as he made it to the weekend to finish 53rd at Augusta.\nLater in 1978 he was the lowest amateur at the Open, finishing in a share of 39th place. The following year at Lytham he was the leading unpaid finisher, coming tied 17th.\nMcEvoy was on the winning Walker Cup team - the amateur equivalent of the Ryder Cup - in 1989 at Peachtree Golf Club in Atlanta. He went unbeaten in each of the first three sessions as the visitors built a crucial 11-5 advantage over the United States.\nA decade later he led GB&I to a famous 15-9 victory at Nairn in Scotland. McEvoy captained a side that included current European Ryder Cup skipper Luke Donald, Paul Casey, Simon Dyson and Graeme Storm.\nDonald played again two years later at Sea Island in Georgia, as McEvoy inspired GB&I to another convincing win. The team also included tour winner Nick Dougherty and Northern Ireland's Graeme McDowell, who would go on to win the US Open.\nMcEvoy went on to become chairman of the R&A's selection committee while embarking on a career involving golf course design.\nHe was a hugely respected figure in every facet of the game, receiving an OBE in 2003 for his services to golf.", "url": "https://www.bbc.com/sport/golf/articles/c3r8nqrny33o"}