{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:26:48", "date_modify": "2025-05-20 14:26:48", "date_publish": "2023-07-29 11:38:59", "description": "Your views on Rangers' transfer business so far this summer", "filename": "sport_articles_c843r4jll3zo_1747751208.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/82da/live/cc4e9440-2d66-11ee-b1d7-8fdc93c2782e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c843r4jll3zo_1747751208.html", "title": "Your views on Rangers' transfer business so far this summer", "title_page": "Your views on Rangers' transfer business so far this summer - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your thoughts on how Rangers' transfer business is going this summer and what position they should still be looking to strengthen.\nHere's a flavour of your views:\nRoger: Hopefully some great players joining in forward positions, but I’m very concerned with the defence; early signs in pre-season don’t indicate a solid line here.\nRab: It's okay buying loads of new players, but it's going to take time to gel together. Hopefully it will happen and we'll see a whole new Rangers.\nAnon: I do think we need to improve our defence and we need more depth in our full-backs.\nMark: They are still abysmal at centre-back, with the full-backs slow to recover on transition. Against the stronger opponents, they may occasionally face, no amount of quality attacking options they possibly now have available can compensate for what is a clear and obvious weakness.\nDuncan: A fit John Souttar will make a fine lynchpin. Next to JS, we need mobile, skilled defenders to take care of quick breaks and to progress down the flanks. Two good men still required.\nAlexander: I am very pleased with the business so far, though I would still like to see a commanding centre-back brought in.\nDavid: A lot of what seem to be good signings have been made and there's possibly more to come, but we need a strong left-sided centre-back. The big but is - are all these signings going to blend together? Maybe through time, but by then we could a number of points behind in the league. Let's hope Beale can get them to gel quickly.\nJim: They've made some excellent buys, but I feel for the younger players being pushed aside by these signings. I'd be happy seeing some of the academy players being trusted more. The likes of Lowry, King, Rice, Bell, Lovelace, Devine and Ure are all showing huge potential, so let's use them more often.\nRichard: We need defenders, centre-backs in particular. If we have any injuries like last season, it can end the campaign before it gets going. Players such as Souttar already in that position still have to prove they are Rangers players and can cope in Europe.", "url": "https://www.bbc.com/sport/articles/c843r4jll3zo"}