{"authors": ["Colin Moffat", "www.facebook.com"], "date_download": "2025-05-20 14:32:41", "date_modify": "2025-05-20 14:32:41", "date_publish": "2023-07-28 18:26:39", "description": "With T20 World Cup places already secured for both sides, the Europe Qualifier event in Edinburgh ends with Scotland beating Ireland by eight runs.", "filename": "sport_cricket_66338224_1747751561.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/A1B5/production/_130579314_20801583.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66338224_1747751561.html", "title": "T20 World Cup Europe Qualifier: Scotland beat Ireland by eight runs to win group", "title_page": "T20 World Cup Europe Qualifier: Scotland beat Ireland by eight runs to win group - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Scotland beat Ireland by eight runs to protect their unbeaten record at the T20 World Cup qualifier event in Edinburgh.\nBrandon McMullen hit a rapid 68 and Richie Berrington made 54 as Scotland posted 213-6 at The Grange.\nIreland were reeling at 4-2 after the first over and 89-6 but Mark Adair's 72 gave them hope of an unlikely win.\nBrad Currie was the home hero, removing Adair in the 19th over for remarkable figures of 5-13.\nWith both teams already assured of places in the tournament in USA and West Indies next year, all that was left to settle was who would finish top of the standings.\nScotland had a wee wobble against Jersey, while Italy briefly threatened an upset against Ireland, but largely this tournament has been a canter for the overwhelming favourites.\nScottish openers George Munsey (20) and Oli Hairs (4) made hay against some of the lesser lights, trading record scores along the way, but both were gone inside the first four overs.\nIt didn't slow the hosts down though, with McMullen and Berrington in fine touch, forging a key partnership of 104. Crashing blow followed crashing blow, including one mighty crack destined for the Water of Leith from the skipper.\nBerrington was dropped from the next ball, with George Dockrell, facing the strong sun, spilling it near the rope.\nAdair did not have the same problem to contend with as he held on at the edge of boundary when Berrington went slightly too high with one straight down the ground.\nMcMullen cracked two consecutive sixes at the beginning of the 15th over, taking his tally of maximums to five, before holing out at mid-wicket, with Curtis Campher safely pouching a ball coming down with snow on it.\nMatthew Cross (30*) and Michael Leask (21) could not match the slick timing of the previous pair but kept the scoreboard ticking along at a fair rate of knots to take Scotland beyond 200.\nIreland's reply got off to a dreadful start as Andrew Balbirnie feathered behind from the third delivery he faced and Lorcan Tucker was also sent packing in Currie's first over.\nThere was almost another departure in the second over but Munsey carried over the rope when making a spectacular diving catch from Paul Stirling.\nBut left-arm quick Currie was celebrating a third wicket in the third over as Harry Tector trudged off after prodding one up in the air.\nIt was soon four as Stirling's spooned shot was gobbled up by a sliding Mark Watt and the captain was gone for 21.\nCurrie's day got better when he held on to a big slog from Campher (28) and a Munsey grab gave Leask his second wicket as Neil Rock (20) was a few paces short when aiming to clear the rope.\nDockrell (21) was next to go but Adair clobbered three sixes in the 14th over to the sound of nervous mumblings in the previously ebullient crowd. That flurry left Ireland needing 58 from the last five overs.\nThe exit of Barry McCarthy (17) raised home cheers but Adair was still there and still swatting shots to the boundary.\nTwenty was the target from the last two overs and Currie was called back into the attack where he made the big breakthrough, forcing Adair to mistime and claim a memorable five-for.\nA dropped catch from the final ball proved Currie was human, but he was soon smiling again along with the rest of his victorious team-mates.", "url": "https://www.bbc.com/sport/cricket/66338224"}