{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:38:31", "date_modify": "2025-05-21 07:38:31", "date_publish": "2025-03-28 12:10:41", "description": "Millwall have nothing to lose in their pursuit of a Championship play-off spot and will attack their remaining games, says head coach Alex Neil.", "filename": "sport_football_articles_c1eneg876eno_1747813111.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4e0e/live/ffc8bb90-0bca-11f0-af58-ad3b17745e6c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c1eneg876eno_1747813111.html", "title": "Alex Neil: Millwall have 'nothing to lose' in Championship play-off race", "title_page": "Alex Neil: Millwall have 'nothing to lose' in Championship play-off race - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Millwall have nothing to lose in their pursuit of a Championship play-off spot and will attack their remaining games, says head coach Alex Neil.\nFour teams and six points separate the Lions from sixth-placed West Bromwich Albion with eight matches remaining.\nThe Lions face fourth-placed Sunderland on Saturday and might have the likes of Ryan Leonard, Macaulay Langstaff and George Honeyman back on the substitutes' bench.\nFormer Black Cats manager Neil says his side will go to the Stadium of Light \"without fear\".\n\"I don't think we've got anything to lose and we certainly don't approach games in that manner anyway. I think every game that we've played, we approach it like we want to win it,\" he told BBC Radio London.\n\"I would genuinely take educated risks and try to win it rather than settling for a point.\n\"We'll attack the games. We'll hope that we can play as well as we can, try and get as many quick points as we can and then obviously with the remaining games see where we are.\n\"Hopefully, if we're still in the mix and still in with a shout we'll look forward to those games, because there should be great atmospheres.\"\nSunderland's automatic promotion hopes have faded with recent defeats against league leaders Leeds United, Hull City and Coventry City.\nRegis le Bris' side trail Leeds and second-placed Sheffield United by 11 points, but also have a 12-point cushion over Bristol City in seventh.\n\"They [Sunderland] are in a strange situation at the moment in the fact that they're not going to catch the top two, they're not going to drop out of the play-offs, certainly not from my perspective, and they'll want to build up towards the end of the season in a good manner and make sure they hit the play-offs in a good space,\" Neil said.\n\"We're going there with nothing to fear, just trying to attack the game and hope that we can go and win it.\"\nMidfielder Leonard completed 45 minutes for Millwall's under-21s this week, with Neil saying Honeyman and Langstaff were also back in first-team training.\nLeonard, 32, has not played since injuring his calf against Cardiff City in January.\n\"There's a few who I wouldn't say they're as far along as we'd like them to be but they're certainly making progress,\" he added.\n\"Most definitely [we could see them back] in the near-term, but if you're referring to this game - potentially, but not from the start.\"", "url": "https://www.bbc.com/sport/football/articles/c1eneg876eno"}