{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:51:23", "date_modify": "2025-05-20 11:51:23", "date_publish": "2023-07-26 07:07:28", "description": "Before the third season of The Hundred begins, get to know Welsh Fire and find out who their key players will be.", "filename": "sport_cricket_66228529_1747741883.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/D62E/production/_130503845_-fb5453f5-5fa5-449d-9322-a71f4c70cbdd.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66228529_1747741883.html", "title": "The Hundred 2023: Meet Welsh Fire as Tammy Beaumont & Tom Abell name players to watch", "title_page": "The Hundred 2023: Meet Welsh Fire as Tammy Beaumont & Tom Abell name players to watch - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "BBC Sport has worked with data analysts CricViz to look at the strengths and weaknesses of each side.\nMen's team\nFire added Stephen Eskinazi, Tom Abell and Glenn Phillips to their batting line-up during the draft, securing three high-quality batters who should be able to provide runs in the middle order, an area where they've severely lacked production over the past couple of years.\nThe engine room should have the cushion of fast starts from Jonny Bairstow and Joe Clarke at the top as well as hitting depth provided by the likes of David Willey, Shaheen Afridi and Roelof van der Merwe.\nThe lack of a high quality left-hander is perhaps their only major concern, particularly limiting their ability to exploit lopsided boundaries should the opportunity arise.\nThe draft also saw Fire add plenty of quality with the ball. Left-armers Shaheen and Willey should trouble batters with new ball movement, and a high-pace combination of Pakistan's Shaheen and compatriot Haris Rauf should see an improvement at the death.\nFire will be hoping their finger spinners, like left-armer van der Merwe and off-spinner Phillips, can make use of the square boundaries at Cardiff, although they could be hurt by the lack of a true frontline leg spinner who turns it both ways.\nWomen's team\nFire picked Sophia Dunkley with the first pick during the draft back in March. The England opener had plenty of success opening the batting for Southern Brave but will have to adapt to the challenge of batting at Sophia Gardens.\nFellow England opener Tammy Beaumont joins Dunkley, Hayley Matthews and Laura Harris to provide a power packed batting line-up that should perform better after struggling last year.\nThe fastest bowler in the world and two-time Hundred winner Shabnim Ismail moves across from Oval Invincibles to bring some heat to the Fire bowling.\nLeft-arm spinner Alex Hartley and off-spinner Hayley Matthews are both capable of bowling at the top of the innings and at the death and bring added flexibility to the Fire attack.\nThe likes of Freya Davies, Georgia Elwiss and Emily Windsor all provide valuable skills alongside the Fire's big names.\nBBC Sport spoke to a player from each men's and women's team and asked them to pick two key players to watch and about their chances this year.\nWelsh Fire captain Tom Abell: \"I'm going to go Stephen Eskinazi and Joe Clarke. Hopefully they will bring us good starts. I think both are quality T20 openers so there will be a lot of entertainment at the top of our order.\n\"There's obviously been a bit of an overhaul for this season but we've assembled a really strong squad and we've got all bases covered. I just see it as a fresh start and a huge opportunity for us to try and bring some success to Cardiff.\"\nWelsh Fire captain Tammy Beaumont: \"For me, overseas player Laura Harris. People probably don't know that much about her. I know she was at the Northern Superchargers a couple of years ago, but I think she's really kicked on and at Cardiff, the Sophia Gardens isn't going to be big enough for her, so she's one to watch, definitely.\n\"Freya Davies as well, she's a brilliant signing. I can't believe we've actually got her! On a wicket like Cardiff, she's going to be really key to getting the stumps in play, she's going to be a real key wicket-taker for us.\n\"Last year was really disappointing, but there were some positives to take away. We've recruited really well and we've got some brilliant people so I'm really excited to see how we go. Hopefully this year we won't be bottom, won't get the wooden spoon. I'm sick of getting wooden spoons in franchise tournaments.\"", "url": "https://www.bbc.com/sport/cricket/66228529"}