{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:27:43", "date_modify": "2025-05-21 05:27:43", "date_publish": "2025-04-03 11:00:13", "description": "Gung-ho the way to go for defensively frail Dundee?", "filename": "sport_articles_cvgpxzzv0zlo_1747805263.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5830/live/dfbfa3c0-1072-11f0-a161-1f18bc46c434.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cvgpxzzv0zlo_1747805263.html", "title": "Gung-ho the way to go for defensively frail Dundee?", "title_page": "Gung-ho the way to go for defensively frail Dundee? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Outscoring your opponent is the name of the game in football, but not in the way Dundee might need to go about doing it.\nOnly Celtic and Rangers have scored more league goals than Tony Docherty's men this term, but they still find themselves in the relegation play-off spot.\nThat is because they have conceded a whopping 67 goals, by far the most of any team in the division.\nIn fact, it is 10 more than bottom side St Johnstone, who have conceded the second most.\nWith just seven games of the top-flight season remaining, there is little to suggest anything drastic will change when it comes to the defensive side of Dundee's game, especially when you consider they have kept just one clean sheet all campaign.\nAs simple as it sounds, does that mean outscoring the opposition with a gung-ho approach is the best formula?\nDundee-based football writer George Cran, of The Courier and Evening Telegraph, says that is a hope to cling on to for Docherty and his team.\n\"What gives me hope is going forward they can outscore the opposition,\" he told the BBC's Scottish Football Podcast. \"I think that should see them safe in the end, but we'll have to see. It might be tough.\n\"It was an issue last season, they conceded too many goals even though they had a really good season and finished in the top six. A big issue is a lot of the players are learning their trade in terms of how to defend at this level.\n\"Also, we shouldn't forget, they lost Luke McCowan, who was their best player. The middle of the park has been an issue all season as well.\"", "url": "https://www.bbc.com/sport/articles/cvgpxzzv0zlo"}