{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:16:42", "date_modify": "2025-04-26 06:16:42", "date_publish": "2025-03-01 19:33:22", "description": "Edinburgh 18-60 Clovers: Report", "filename": "sport_articles_c70w5v4e7xro_1745648202.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ba32/live/203b7520-f6d1-11ef-b441-0f08798b3a21.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_c70w5v4e7xro_1745648202.html", "title": "Edinburgh 18-60 Clovers: Report", "title_page": "Edinburgh 18-60 Clovers: Report - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Clovers kept up the pressure on compatriots Wolfhounds at the top of the Celtic Challenge with an 10-try win over Edinburgh.\nEmily Lane got the scoring underway early at the Hive Stadium, although Lucia Scott's penalty quickly cut the deficit.\nHowever, the Clovers had their bonus point try within the first twenty minutes with quickfire scores from captain Amee Leigh Costigan, Shirley Bailey, and Lane.\nEdinburgh responded through vice-captain Hannah Walker, with the winger going over in the corner.\nClovers reasserted their dominance before half-time, getting their fifth and six tries before the break with winger Anna McGann getting both on either side of the pitch.\nAlthough they lead 36-8 at half-time, the Clovers did not rest on their laurels and continued their try-scoring in the second-half.\nSubstitute Enya Breen got their seventh, Jemima Adams Verling got the eighth and Saoirse Crowe got the ninth from short-range.\nHannah Ramsay did a consolation try for the hosts, but there was still time for McGann to wrap up her hat-trick with a breakaway intercept try.\nEdinburgh didn't go quietly, and Giselle Chicot scored in the final play from a move started by Scotland star Alex Stewart. However, they remain fourth in the table with just two wins from this year's tournament.\nEdinburgh: Scott, Bell, Brown, Chicot, Walker; Ramsay, Clarke; Wilson, Ronald, Poolman, Ferrie, Logan, Moody, Stewart (c), Gunderson.\nReplacements: Craig, Tawake, Brown, Russell, Sutherland, Benson, Denholm, Love.\nClovers: Finn, Costigan (c), Corey, Flannery, McGann; Fowley, Lane; Burke, Gavin, Barrett, Campbell, O'Flynn, Verling, Oviawe, Bailey.", "url": "https://www.bbc.co.uk/sport/articles/c70w5v4e7xro"}