{"authors": ["Andrew Benson", "www.facebook.com"], "date_download": "2025-05-20 14:37:03", "date_modify": "2025-05-20 14:37:03", "date_publish": "2023-07-28 14:06:52", "description": "Formula 1's governing body postpones a ban on tyre-warming blankets that was due to be introduced next season.", "filename": "sport_formula1_66340201_1747751823.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/DFA9/production/_130575275_blankets.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_formula1_66340201_1747751823.html", "title": "Belgian Grand Prix: FIA postpones ban on tyre-warming blankets", "title_page": "Belgian Grand Prix: FIA postpones ban on tyre-warming blankets - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Formula 1's governing body has postponed a ban on tyre-warming blankets that was due to be introduced next season.\nDrivers have expressed concerns in recent weeks that removing tyre blankets was a safety risk.\nThe decision by the FIA had been made on sustainability grounds.\nTesting on tyres that can generate grip sufficiently quickly from cold will continue and the issue will be reassessed next year.\nThe move came among a raft of decisions on F1 rules at a major meeting on Friday.\nF1 had wanted to ban tyre blankets to reduce emissions, not just because of the electricity that is used to heat the tyres but as a way of reducing carbon emissions through freight.\nBut the drivers believe that the lack of grip from unheated tyres when they come out of the pits could be a safety factor.\nWorld champion Max Verstappen said on Thursday: \"People probably don't know how difficult it is to drive a car with 1,000 horsepower out of the pits already, and especially when the track is also a bit slippery. It is not necessary.\n\"I don't think it actually generates a lot of energy, these tyre blankets. I think an AC generates more when you combine it through the whole paddock.\n\"With the tyres, yes, they probably can make it work, but then they need to drop the working range that much that once you're up to temperature, the tyre will just be like chewing gum, and the pressures will go through the roof.\n\"It will not make the racing better. I think anyway, on an out-lap when you're struggling so much in a car with just [to] warm the tyres, it will look so stupid.\n\"I think the racing now sometimes, out of the pits as well having hot tyres, is brilliant. I don't really see why we need to change that.\"\nHaas driver Kevin Magnussen, one of the drivers who have tested the Pirelli tyres aimed at being run without blankets, expressed his concerns that they were not ready for use in competition.\nThe Dane said: \"The tyres are what they are. When they're hot, it's OK, I guess but the warm-up phase and the out-laps are going to be super tricky. In a race situation, when you need a hurry-up on the out-lap, I don't think it's going to be that much fun. So unless they improve that I don't know if it's going to work.\"\nA statement from F1 and the FIA said the change \"can be implemented to the requested target specifications for 2024; however, it has been decided to postpone\" the introduction of blankets.\nIt did not give a reason for the delay.\nThe F1 Commission - a rule-making body that comprises governing body the FIA, commercial rights holder F1 and the 10 teams - also discussed power-unit equalisation, and various changes to the financial and sporting rules.\nAlpine has asked the FIA and the teams to consider methods for equalising engine performance after accepting that their engine has lost grounds on the rival units from Ferrari, Honda and Mercedes.\nAlpine is said to be as much 30bhp down on the other engines, which are all believed to be evenly matched.\nNo agreement was reached, but there was sympathy for Alpine and the matter will be discussed between the power unit manufacturers.\nThere were proposals to change the financial rules that cover capital expenditure to allow some of the less successful teams to build up their facilities to match those of the leading outfits.\nAnd stakeholders continued talks on methods of reducing the weight of cars for the new rules that are due to be introduced in 2026.\nOn both matters, no agreement was reached but discussions will continue in the coming months.\nIt was confirmed that pre-season testing next year will be held in Bahrain on 21-23 February. The season starts at the same venue on 29 February to 2 March.", "url": "https://www.bbc.com/sport/formula1/66340201"}