{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:11:30", "date_modify": "2025-05-21 06:11:30", "date_publish": "2025-04-01 13:18:31", "description": "The Football Association of Wales made a profit of £1.07m last year after posting record revenue for a non-qualification year.", "filename": "sport_football_articles_cpq7zwev7zjo_1747807890.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0812/live/60d1e7a0-0ef9-11f0-b65c-119a1680d4e5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cpq7zwev7zjo_1747807890.html", "title": "FAW makes profit in 2024 after record non-qualifying revenue", "title_page": "FAW makes profit in 2024 after record non-qualifying revenue - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The Football Association of Wales (FAW) made a profit of £1.07m last year after posting record revenue for a non-qualification year.\nDespite the men's national team's failure to qualify for Euro 2024, the FAW's revenue for the year ending June 2024 was £32.4m.\nThat represented a 40% increase on the previous high for a year that did not include qualification for a major tournament.\nThe association made an operating loss of £1.22m but benefitted from an additional £1.46m through investments.\nThe FAW says its post-tax profit of £1.07m - up from £173,432 in 2023 - was helped by \"higher interest rates, which helped to mitigate the impact of not participating in the men's Euro 2024 tournament\".\nQualifying would have secured a further boost of at least £8m, but Wales missed out after losing to Poland in their play-off final in March 2024.\nWales' women qualified for their first major tournament in December 2024, but the full financial benefits of their participation in Euro 2025 this summer will not be known until the accounts are published next year.\nAccording to the FAW, the key elements driving their 2024 revenue were \"increased attendances at home matches\", funding from Uefa and Fifa and \"further support from the Department of Culture Media and Sport to enable the Cymru Football Foundation to invest in community grassroots facilities across Wales\".\nCompared to the previous year that took in the World Cup, match income fell from £14.1m to £5.16m but maintained levels of revenue elsewhere while also benefitting from increased funding from government and sport governing bodies.\nThe statement added: \"The FAW also grew its revenue streams throughout its core business, which was helped further by the performance of its investment portfolio and treasury management at a time of higher interest rates.\n\"The FAW's balance sheet remains strong with reserves of £15.8m at the end of 2024.\"\nThe FAW's chief financial officer, John Young, said: \"The positive results reflect an association rooted in solid foundations, with good risk management but with the agility to be able to adjust where necessary.\n\"Not participating in the men's Euro 2024 or benefiting from the additional funding that would have been generated, did not hinder the organisation's ability to continue to progress both on and off the field.\n\"Supporting the women's national team to qualify for its first major tournament has been a feature of 2025 on the field. Off the field, a comprehensive review of systems and processes throughout the business has positioned us well to invest further in growing the game in Wales.\"\nThe FAW's chair of finance, audit and risk committee, Carol Bell, said: \"The strength of FAW's financial performance in a year when we did not benefit from participation in a major tournament reflects our resilience, access to diverse funding sources and the benefit of holding financial reserves at a time of higher interest rates.\n\"This has enabled FAW to continue investing in grassroots development to create a sustainable football association for everyone while supporting our international teams to perform.\"", "url": "https://www.bbc.com/sport/football/articles/cpq7zwev7zjo"}