{"authors": ["Alistair Watkins", "www.facebook.com"], "date_download": "2025-05-20 14:38:08", "date_modify": "2025-05-20 14:38:08", "date_publish": "2023-07-28 12:58:05", "description": "Great Britain's men win a thrilling 4x200m freestyle relay gold in Japan to add the world title to their Olympic crown.", "filename": "sport_swimming_66336225_1747751888.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/99B3/production/_130574393_gettyimages-1576243448.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_swimming_66336225_1747751888.html", "title": "World Aquatics Championships 2023: Great Britain men win 4x200m freestyle gold", "title_page": "World Aquatics Championships 2023: Great Britain men win 4x200m freestyle gold - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Great Britain's men won the 4x200m freestyle relay gold in Japan to add the world title to their Olympic crown.\nGB's quartet of Duncan Scott, Matt Richards, James Guy and Tom Dean edged out the United States to secure Britain's second gold of the World Aquatics Championships in Fukuoka.\nRichards, who won the individual 200m title on Tuesday, gave Britain the lead during the second leg.\nGuy then handed over to Olympic champion Dean, who held on to win.\nDean, 23, produced the fastest split of the group - one minute and 43.84 seconds - to hold off a spirited fightback from the American Kieran Smith.\nBritain won by 00.94 seconds in a time of six minutes 59.08, which was just outside the world record and their own European best time.\nBritain only managed sixth at last year's World Championships but were able to bring in 2015 world champion Guy and Olympic silver medallist Scott to restore the winning line-up from the Tokyo Olympics.\n\"I knew that when the four boys came together something special would happen like it did last time we were in Japan,\" said Dean after collecting his third medal of the championships.\n\"Winning was really, really nice,\" said Guy, who now has 11 world championship medals. \"This is our first time together since Tokyo and it shows that we're in a great place, which hopefully we can build on for Paris.\"\nMeanwhile, defending 50m freestyle champion Ben Proud finished second in his semi-final to qualify third fastest for Saturday's final.\nAmerican Jack Alexy won in 21.60secs, with 28-year-old Proud just behind in 21.61.\nAustralia's Cameron McEvoy clocked an impressive 21.25 to win the second semi-final.\n\"There's a clear favourite right now in Cam McEvoy, so coming up tomorrow night I'll be next to him and it'll be good to give him a good race,\" said Proud.\nBritish champion Katie Shanahan, who was disqualified from the 200m medley earlier in the week, qualified for the women's 200m backstroke final on Saturday by coming second in her semi-final.\n\"I'm really happy with that, to make my first World Championship final,\" said Shanahan, 19. \"Hopefully tomorrow night I can go a bit faster.\"\nBut Jacob Peters and Guy both failed to make the 100m butterfly final.", "url": "https://www.bbc.com/sport/swimming/66336225"}