{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:33:08", "date_modify": "2025-04-26 07:33:08", "date_publish": "2025-02-27 16:25:44", "description": "Olympic gold medallist Matty Lee announces his retirement from diving.", "filename": "sport_diving_articles_c0l11k4er46o_1745652788.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/666b/live/ce6a1af0-f525-11ef-ba6e-5dc164a31f2d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_diving_articles_c0l11k4er46o_1745652788.html", "title": "Matty Lee: Team GB Olympic champion retires from diving aged 26", "title_page": "Matty Lee: Team GB Olympic champion retires from diving aged 26 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Olympic gold medallist Matty Lee has announced his retirement from diving.\nThe 26-year-old won gold in the men's synchronised 10m platform at Tokyo 2020 alongside British team-mate Tom Daley.\nHe missed last summer's Games in Paris after having surgery on his spine earlier in 2024.\n\"After 20 years in the sport, it's time for me to step away from diving,\" Lee said on Instagram on Thursday.\n\"This decision hasn't been easy, but after losing my dad in 2022, I struggled to find the same passion I once had, he was my why.\n\"Then came injuries, surgeries, and the realization that I don't want to be a broken man moving forward.\"\nLee partnered with Noah Williams in recent years, winning Commonwealth gold and World Aquatics Championships silver together in 2022.\nWith Daley, who retired from the sport in August, Lee claimed World Cup and European gold in 2021, as well as a bronze at the 2019 World Championships.\n\"Diving has given me the world, literally. The people I've met, the places I've travelled, the memories I've made. That's what I'll cherish the most,\" he added.\nLeeds-born Lee thanked his family and coaching team while he also paid tribute to Daley, adding: \"What a journey, what a moment we shared. Olympic champions forever.\"\nLee won individual gold at the European Games, aged just 17, in 2015 and he made his World Championship debut later that year.\nAlongside Lois Toulson in the mixed synchronised 10m platform, he picked up silver medals at both the 2017 World Championships and 2018 European Championships.\n\"What's next? Honestly, I don't know. And that's both terrifying and exciting. But I do know this, there's more to life than diving, and I'm ready for it,\" Lee said.", "url": "https://www.bbc.co.uk/sport/diving/articles/c0l11k4er46o"}