{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:25:50", "date_modify": "2025-04-26 04:25:50", "date_publish": "2025-03-03 11:58:30", "description": "'Hopeless & embarrassing' - Your views on Edinburgh derby defeat", "filename": "sport_articles_cpvnjk8enedo_1745641550.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ad5c/live/e3452ad0-f775-11ef-896e-d7e7fb1719a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cpvnjk8enedo_1745641550.html", "title": "'Hopeless & embarrassing' - Your views on Edinburgh derby defeat", "title_page": "'Hopeless & embarrassing' - Your views on Edinburgh derby defeat - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "We asked for your views following Hearts' Edinburgh derby defeat to Hibs.\nHere's what some of you said:\nAlexander: We fell out of the game second half for some reason. At half-time I could only see one winner and that was us. Third is gone now, we need to concentrate on top six so we can get another derby. Can't go a whole season without beating Hibs once.\nDavid: Only one team wanted to win and that was not Hearts. That second half performance was embarrassing, they should all hang there heads in shame -absolutely no fight at all. Can't take anything away from the winning goal, at least they went for it.\nMax: I thought Hearts looked really tired in the second half and despite bringing the team together, I'm afraid Neil Critchley is not the long-term answer. There is utterly no point in having possession of a football if you cannot make quick incisive attacks. I hope in many ways I'm wrong, but history will show that I'm right.\nSteve: Touch and go whether we reach top six. Recent results show how poor the loss to Rangers was. Awful display in the second half against Hibs. I'm still to be convinced by Critchley.\nDidn't buy in to this eat humble pie nonsense from some Hearts fans after one decent display at Dundee. Recent excuses of poor surfaces and physical opponents don't wash with me.\nPeter: Two sloppy moments from Taylor and Shankland cost us dearly. Cannot excuse that in professional football, trying hard is the least we should expect, for 100% of the game.\nTo fall out of the match as we did, second half, has not been our recent modus operandi, so why this time? Hibs were the better side because they wanted it more, unfortunately.\nSteve: No surprise, we've not played well for many weeks despite the results. Most of the Hibs attack came from our right-hand side, yet the manager made no changes to our right-back.\nNeither side created much but couldn't string two passes together. Lots of aimless crosses. We will struggle to get into the top six, too much deadwood at Tynecastle.\nFinn: A completely toothless attack. Taylor at fault for the first goal. Shankland's work rate was truly awful. We really have a mountain to climb for a European place. A real eye-opener on how we really need to improve.", "url": "https://www.bbc.co.uk/sport/articles/cpvnjk8enedo"}