{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:31:39", "date_modify": "2025-05-19 14:31:39", "date_publish": "2017-08-13 17:43:21", "description": "A round-up of Sunday's T20 Blast action, including Aaron Finch scoring a century to maintain Surrey's quarter-final hopes.", "filename": "sport_cricket_40916801_1747665099.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/12611/production/_97318257_finch.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_cricket_40916801_1747665099.html", "title": "T20 Blast: Surrey win with Aaron Finch ton, Glamorgan go top, Hepburn makes history", "title_page": "T20 Blast: Surrey win with Aaron Finch ton, Glamorgan go top, Hepburn makes history - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Aaron Finch struck 114 from 64 balls to help keep Surrey alive in the T20 Blast with a 17-run win over Sussex.\nMarchant de Lange defended eight from the final over at Somerset as Glamorgan went top of the South Group.\nAnd Alex Hepburn produced the best figures by a Worcestershire bowler in T20 cricket, but could not prevent an 11-run defeat by Nottinghamshire.\nBirmingham Bears are on the cusp of qualifying after winning at Durham, while Essex beat Gloucestershire.\nFinch starred on a golden afternoon at The Oval with his third T20 century - his first in county cricket - and became just the second batsman to make a hundred for Surrey in the shortest format after Jason Roy.\nThe Australia international batsman exploded in the 18th over, taking 30 from the bowling of David Wiese with four sixes, and reached his century off 58 deliveries in the next over.\nIn total, he struck seven fours and seven sixes and lifted Surrey to 193-2.\n\"Between Jason and I we've got the team into some good positions but then probably let the middle order down by not being there at the end,\" Finch told BBC Radio London. \"So it was nice for one of us to go through.\n\"The middle of the innings was a bit frustrating and we just had to bide our time for one big over and thankfully it came.\"\nChris Nash responded with 53 for Sussex but the visitors were always behind the chase and will now have to win their final match to have a chance of reaching the quarter-finals.\nSurrey also need to win their final two games to qualify from a tightly-packed South Group, which is now headed by Glamorgan.\nNick Selman's 66 from 42 balls in just his fourth T20 appearance helped Glamorgan reached 183-6 at Taunton, before Johann Myburgh appeared to be steering Somerset home with 87 from 51 balls.\nBut Myburgh fell to De Lange, who then held his nerve to close out the game for Glamorgan.\nVictory over Middlesex in Cardiff on Friday would see Glamorgan finish top of the South Group, while Somerset's campaign was left hanging by a thread with one game to play.\nEssex could yet join Glamorgan in the last eight after Varun Chopra made 44 in 20 balls to help Essex win a low-scoring game at Bristol.\nVictory continued Essex's impressive revival after a slow start to the tournament, but they still need to win their final two games to guarantee a top-four place. Gloucestershire also need wins from the final two matches to go through.\nHepburn, 21, playing only his third T20 match, took a record 5-24 to rip through the Nottinghamshire middle and lower order as the visitors were bowled out for 145 at New Road.\nBut only Daryl Mitchell of the top five got into double figures for Worcestershire as they slumped to 108-7 and they could not get home when 15 runs were needed from the final over.\nNotts have secured a quarter-final spot and are now very likely to gain a home tie at Trent Bridge, even if they lose their final game at home to Leicestershire on Friday, because their net run-rate is far superior to that of Northamptonshire.\nThe Bears could grab the other home quarter-final as they moved second in the North Group with an easy eight-wicket win at bottom-club Durham.\nFifties from Ed Pollock and Dom Sibley saw them chase 146 with more than five overs to spare. Their final game is against Lancashire on Friday.", "url": "https://www.bbc.com/sport/cricket/40916801"}