{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:59:52", "date_modify": "2025-05-21 03:59:52", "date_publish": "2025-04-07 07:22:54", "description": "Everton 1-1 Arsenal: Fan views on Premier League game", "filename": "sport_football_articles_cnv5qjy697lo_1747799992.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cnv5qjy697lo_1747799992.html", "title": "Everton 1-1 Arsenal: Fan views on Premier League game", "title_page": "Everton 1-1 Arsenal: Fan views on Premier League game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your thoughts after Saturday's Premier League game between Everton and Arsenal.\nHere are some of your comments:\nEverton fans\nTerry: It was a poor game but we will take the point and move on. It's going to be a big summer because we need quality all over the pitch, but there's enough good players in the squad to give us a solid base. One more game ticked off. The countdown to the Southampton game is on, which is going to be so emotional.\nMike: An excellent performance from a team with increasing belief made this great result possible. David Moyes has once again built a side that looks greater than the sum of its parts.\nStephen: They battled bravely but the class gap could be seen. Hopefully we spend money in the closed season.\nChris: We have forgotten how to win again! Six games and counting. The early Moyes effect has worn off and we are back to be being an average team, with below average players! A massive rebuild is required in the summer and I'm doubting now if Moyes is the right man to take us forward.\nArsenal fans\nJim: Poor game again. Mikel Arteta's philosophy of not wanting to lose a game just stifles us in trying to win. We will get battered by Real Madrid. I do think his time is nearly up.\nOsato: I think Arsenal played well and probably should've won with more goals, but that Everton penalty was a very wrong decision in my opinion. I think the standard of refereeing in the Premier League has been lowered and VAR isn't helping like it is supposed to.\nRachel: It's clear that Arsenal are going to desperately miss Gabriel for the remainder of the season. He is the cheerleader of the team, the backbone, the motivator, the monster defender and the one we can least afford to lose out of everyone. I think we'll struggle to win another game without him. He is the beating heart of Arsenal and a massive loss.", "url": "https://www.bbc.com/sport/football/articles/cnv5qjy697lo"}