{"authors": ["Thomas Duncan", "www.facebook.com"], "date_download": "2025-05-21 04:08:03", "date_modify": "2025-05-21 04:08:03", "date_publish": "2025-01-24 00:19:51", "description": "Who plays in goals? Should Clement put faith in youth? And what about Cyriel Dessers' future? BBC Sport Scotland assesses three key issues for Rangers after late defeat by Man United.", "filename": "sport_football_articles_c1ez0zjn08jo_1747800483.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/51a1/live/53ca74d0-d9e5-11ef-87e5-f1aa7935f4d2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c1ez0zjn08jo_1747800483.html", "title": "Rangers: Three key questions after Man Utd loss", "title_page": "Rangers: Three key questions after Man Utd loss - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Rangers manager Philippe Clement says he was \"gutted\" but \"proud\" and keen to focus on the positives despite late Europa League heartbreak against Manchester United at Old Trafford.\nWith a depleted and young side pushing the Premier League giants right to the end, and almost snatching a point courtesy of Cyriel Dessers' 88th-minute strike, there is no question there is plenty for Rangers to build on.\nNot least confirmation from Uefa that they have done enough to be guaranteed place in the knock-out round before their final group game with Union Saint-Gilloise next Thursday.\nHowever, those positives also raise questions about how Clement moves forward for the rest of the season.\nWho does he pick in goals? Should he put faith in youth? And what about Dessers' future?\nJack Butland was between the sticks for Rangers for the first time in 2025 after a leg injury kept him out of the last five games.\nBut before that lay off there were grumbles about his form.\nA mistake against St Mirren lead to a penalty and defeat for Rangers last month, and then he was let off the hook when Motherwell caught him out for a corner, only for Tony Watt's goal to be ruled out at the end of December.\nThose were just two examples of Butland making errors he simply did not make last term.\nSo his own goal at Old Trafford - scored by punching a corner into his own net - will only have intensified scrutiny on his position as number one goalkeeper.\nEspecially as Liam Kelly deputised effectively in his absence.\nHowever, despite his mistake the former England goalkeeper also showed why he is Philippe Clement's first choice.\nHe made five saves, including a brilliant one to deny Amad Diallo in the first half.\nThe Rangers manager seems unlikely to drop him, but it will not stop conversations continuing over his role.\n\"It's a horrendous mistake and Butland knows it himself,\" former Rangers winger Neil McCann said on Sportsound.\n\"I don't think it's a real flaw in his game, he's maybe a wee bit rusty having been out injured.\n\"He'll hate himself tonight. Sitting in the dressing room, he'll blame himself.\n\"I don't think he could do anything about the winner, it was smashed straight through his legs.\"\nWith eight first team players unavailable and Leon Balogun and Connor Barron both forced off at half-time, 18-year-olds Bailey Rice and Findlay Curtis were thrown into the action at Old Trafford.\nIt was the first time since 2009 two players aged 18 or under appeared in the same game for Rangers in major European competition.\nDanny Wilson and John Fleck were the last pair to do so in the Champions League against Stuttgart.\nRice battled well as Man United took control, and also set up Dessers for a great chance which came back off a post.\nHad he got his body over the ball and stayed a little more composed, he might have had a goal too after getting into a great position to score just inside the box as well.\nRice was once a youth team-mate of Motherwell's Lennon Miller.\nBut while the latter has now played 63 first-team games and is the subject of interest from across Europe, Rice has played six senior matches.\nHad Rangers managed to defend their back post as Lisandro Martinez swung the ball into the box in the 92nd minute, Dessers \"would have been the hero\" as Clement put it.\nIt was a genuinely sensational moment from the much-maligned striker, whose touch on the turn and precise left-foot finish was something to behold.\nIt was also his 17th goal of the season, the most of any Rangers player.\nThere have been rumours of some interest from abroad in Dessers, and the question is whether Rangers should cash in.\nHis numbers are clear. The quality of some of his goals is unarguable. But the rate of missed chances and frustrating general play is an equally compelling case at times.\nDessers is on course of back-to-back 20-goal campaigns, a rare feat in recent Rangers teams, and his willingness to keep coming back despite the knocks shows his determination.\n\"It depends what type of offer they were getting,\" Thompson said on Sportsound. \"If they were offered at least what they spent on him then it might be worth it.\n\"But when you've got a player like he is just now, a hat-trick at the weekend, scoring at Old Trafford and on 17 goals for the season.\n\"You'd be tempted to hang on to him until the summer unless you're bringing in a replacement that is going to guarantee you goals.\"", "url": "https://www.bbc.com/sport/football/articles/c1ez0zjn08jo"}