{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:43:57", "date_modify": "2025-05-20 12:43:57", "date_publish": "2023-08-03 13:42:36", "description": "Pochettino's Chelsea: Defining the squad", "filename": "sport_articles_c6pnjg9n87wo_1747745037.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/686a/live/cdcd4170-31fa-11ee-8f52-fbf70e4bf742.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c6pnjg9n87wo_1747745037.html", "title": "Pochettino's Chelsea: Defining the squad", "title_page": "Pochettino's Chelsea: Defining the squad - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Alex Howell, BBC Sport\nChelsea came to the USA on their pre-season tour with a squad of 29 that was mainly made up of young players. This number went up to 30 after the signing of 19-year-old Lesley Ugochukwu from Rennes.\nSince the club's £4.25bn takeover by American businessman Todd Boehly's consortium and the US private equity firm Clearlake Capital, Chelsea have looked to sign up young talent with huge potential - but this also led to Pochettino calling for \"more experienced\" players to add to the squad.\nEnzo Fernandes and Conor Gallagher are the only two senior players that Pochettino has to call on in midfield. They have been pursuing Brighton midfielder Moises Caicedo but that deal doesn't seem close to being completed.\nHowever, all is not negative. Andrey Santos, the Brazilian midfielder signed from Vasco da Gama in January, has impressed at the heart of midfield and started three of the five matches in the USA and could be an option for the squad.\nPochettino has said that he will cut his squad down from its enlarged size when they return to Cobham. A number of the young players will be sent on loan and there's the possibility of some players, like Ugochukwu, being sent to Strasbourg, who have the same owners.\nIt's understood that Pochettino considers the ideal number of players in his squad to be 22 or 23, with young players from the academy stepping in to make up numbers and take their chances if and when needed.\nThat means with the club wanting as many as three new players - a defender, midfielder and attacker - there's going to be a lot of transfer activity at Chelsea before the window closes.", "url": "https://www.bbc.com/sport/articles/c6pnjg9n87wo"}