{"authors": ["Ben Ramsdale", "www.facebook.com"], "date_download": "2025-05-21 06:04:05", "date_modify": "2025-05-21 06:04:05", "date_publish": "2025-01-31 14:37:01", "description": "David Moyes press conference: Everton vs Leicester", "filename": "sport_football_articles_cy7gvm70j2vo_1747807445.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a963/live/8e719b70-d19f-11ef-94cb-5f844ceb9e30.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy7gvm70j2vo_1747807445.html", "title": "David Moyes press conference: Everton vs Leicester", "title_page": "David Moyes press conference: Everton vs Leicester - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "He explained the injury sustained by Dominic Calvert-Lewin in the victory over Brighton \"isn't as bad as first feared\" and is hopeful the striker will play some part before the end of the season.\nThe news is not as positive for on-loan midfielder Orel Mangala, however, with Moyes confirming that he will return to parent club Lyon to undergo surgery on the injury he picked up towards the end of that win.\nWinger Dwight McNeil has had a minor operation on a knee injury to fix an ongoing issue, while striker Youssef Chermiti returned to the grass today and should be available for selection in three to four weeks.\nMoyes did not rule out the possibility of Michael Keane being deployed as a centre-forward due to the number of injuries in that department. However, he said that it was \"not my first thought\" for a solution.\nWhen asked if he was confident Everton would be able to bring in new faces before the end of the January transfer window, he said: \"Confidence at the moment has become difficult because it's certainly not for the want of trying. I know behind the scenes and for all the Evertonians, we are really out there trying to find players we can bring in. Ultimately, we are still hampered by PSR [profit and sustainability rules].\"\nMore on the limits PSR is having on him and the club: \"I've got to say, I have been really surprised in the way it is restricting the football club. Everton is a huge football club and it should be competing with many of the big clubs in the country here, hopefully spending in a way that is right and challenging for the big players who are out there and available. We hope to bring in some players but maybe not the ones that, if we had the money, we would be trying to do.\"", "url": "https://www.bbc.com/sport/football/articles/cy7gvm70j2vo"}