{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:39:20", "date_modify": "2025-05-21 03:39:20", "date_publish": "2025-04-08 00:00:00", "description": "Haydon Roberts scores a 96th-minute winner for Bristol City as they beat play-off rivals West Bromwich Albion 2-1 in the race for the top six.", "filename": "sport_football_live_c1merll49e2t_1747798760.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6083/live/0ebd9230-14bb-11f0-b1b3-7358f8d35a35.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c1merll49e2t_1747798760.html", "title": "Bristol City 2-1 West Bromwich Albion: Haydon Roberts scores 96th-minute winner", "title_page": "Bristol City 2-1 West Bromwich Albion: Haydon Roberts scores 96th-minute winner - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Haydon Roberts scored a 96th-minute winner for Bristol City as they moved up to fifth in the Championship with a 2-1 win against play-off rivals West Brom at Ashton Gate.\nNahki Wells gave the Robins the lead early in the second-half, with a rocket of a shot from the edge of the area into the bottom-right corner.\nAlex Mowatt equalised for the Baggies six minutes later, pouncing on a mishap between City keeper Max O'Leary and Cameron Pring for an easy shot into an empty net behind them.\nThe Baggies then saw Jayson Molumby sent off for a late challenge on Joe Williams in the 89th minute and substitute Roberts clinched the winner with less than 90 seconds left on the clock in extra time.\nBristol City move six points clear of their opponents and above Middlesbrough - who lost to Leeds - while holding a four-point advantage on Coventry City in seventh who face Portsmouth on Wednesday.\nThe win extends Bristol City's remarkable run at home - with only one defeat in their past 13 matches at Ashton Gate - form that has helped them surge up the table through 2025.\nDefeat for West Brom is their third consecutive loss and leaves them without a win in their pat five matches.\nBaggies boss Tony Mowbray made a big call before kick-off, choosing to select Josh Griffiths in goal for his first Championship start in two years, ahead of Joe Wildsmith after he made another error during their loss against Sunderland on the weekend.\nIf the 23-year-old – who spent the first half of the season with the blue side of Bristol at League One Bristol Rovers - had any nerves given the weight of the match, he did not show it making two excellent first-half saves to deny the hosts taking the lead.\nMark Sykes pounced on a loose ball on the edge of the box, catching the Baggies napping and but Griffiths' diving one-handed save denied the Republic of Ireland international and then also Wells on the rebound.\nHe then parried away another effort after Wells' broke down the right and crossed into the box, where the ball was met by George Earthy who could not get his first-time effort past the Baggies stopper.\nWest Brom had a couple of half chances of their own at the other end, with Issac Price seeing a shot from the centre of the box go high and wide of the target, while Kyle Bartley saw a header comfortably into the arms of O'Leary.\nGriffiths could do nothing about Wells' effort however when the Robins took the lead early in the second half.\nThe 34-year-old, who has scored three in his past four games, shrugged off his defender on the edge of the 18-yard box before unleashing a shot into the bottom corner that Griffiths could get nowhere near.\nBristol City manager Liam Manning told BBC Radio Bristol:\n\"We've been on the other end of a few of those this season so to come away scoring so late and picking up three points in an important game is a great feeling and probably a memory that will stick with a few of the lads and fans I'm sure – a terrific evening.\n\"Top energy, top atmosphere and a top performance. Up to their goal I thought we were excellent. The bravery to play, the quality, the way we went through them at times and there was a real purpose to our play which I really enjoyed and credit to the lads for that.\n\"To let them back in against the run of play you just get a major momentum shift, you allow them back in through us and it flips and they get the momentum and go on top.\n\"We stuck at it, we kept believing, we kept fighting, we kept running, we kept being brave and we got the rewards at the end.\"\nWest Brom manager Tony Mowbray told BBC Radio WM:\n\"I can't keep repeating the same things. We have to find a way. I've just vented a bit of frustration, I feel as if it can't happen, they can't score in the 96th minute, even though we're a man down we've still got nine outfield players in that box.\n\"Somebody has to block it, somebody has to get their body there. It's a frustration because I think if anybody was going to win it before the sending off it was us.\n\"We were in the ascendancy, their crowd had gone quiet, we were dominating the ball, we had an amazing chance to score and win it with a couple of them in the last 15 minutes and to lose it.\n\"Is cruel the right word? It seems ridiculous to me but we have and we have to accept it and move on.\"", "url": "https://www.bbc.com/sport/football/live/c1merll49e2t"}