{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:15:36", "date_modify": "2025-05-21 04:15:36", "date_publish": "2025-04-05 19:03:55", "description": "Kent close in on victory against Northamptonshire as the hosts close on 107-7 needing 153 more for victory at The County Ground.", "filename": "sport_cricket_articles_cjdxn7x0lj1o_1747800936.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/336d/live/b66ee550-1250-11f0-a75c-b716eb718e3b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cjdxn7x0lj1o_1747800936.html", "title": "County Championship: Kent close in as Northamptonshire fold", "title_page": "County Championship: Kent close in as Northamptonshire fold - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Kent's South African paceman Keith Dudgeon took four wickets to all but shatter Northamptonshire's hopes of chasing 260 on day two of their County Championship match at Wantage Road.\nOn a day which encompassed parts of three innings and saw 20 wickets fall, Dudgeon claimed 4-32, including three in nine balls, as Northamptonshire stumbled to 107-7 at stumps, still requiring 153. Only George Bartlett's battling unbeaten 54 offers the hosts some faint hopes for tomorrow.\nEarlier young Northamptonshire quick Raphy Weatherall again spearheaded a spirited fightback, picking up three Kent wickets in 10 balls, including England opener Zak Crawley (31) who fell to another loose shot.\nCrawley and Ben Compton made batting look straightforward in a half-century stand before lunch, but Weatherall had his tail up after the interval and with the other bowlers keeping up the pressure, Kent lost seven for 49 and rued several careless shots which went straight to fielders. Joey Evison though mounted a determined fightback with 52.\nKent had made short work of the Northamptonshire tail first thing, taking the last three wickets and a first innings lead off 88 as the hosts were skittled for 143. Jas Singh who finished with career best figures of 4-35 ended Rob Keogh's valiant resistance on 64, caught low at second slip.\nSingh picked up his fourth when Dom Leech was trapped lbw, Grant Stewart wrapping up the innings when Liam Guthrie was caught down the legside.\nWith batting conditions easing, Crawley and Compton went into lunch with Kent 61 without loss and hopes of building a daunting target.\nCrawley looked fluent, playing a carefully controlled on drive off Luke Procter and taking advantage when Guthrie strayed, turning him off his legs and playing a silky drive through the covers. Compton meanwhile pulled Guthrie behind square and drove handsomely through extra cover.\nBut it was a more energised Northamptonshire that emerged after lunch, claiming three wickets in seven deliveries. Justin Broad struck first, removing Crawley who upper cut straight to Saif Zaib at cover.\nNext over Zaib took an even sharper catch at short midwicket when Daniel Bell-Drummond clipped Weatherall firmly off his legs, while Tawanda Muyeye, top scorer in Kent's first innings, advanced to the young quick, falling over slightly as he was adjudged lbw. Weatherall was denied the hat-trick when he drew the edge of Jack Leaning's bat, the ball running just wide of the slips.\nWeatherall soon had a third scalp. Bowling around the wicket he sent Compton's off-stump cartwheeling, doubling his first-class wicket tally in two days.\nThe succession of Kent wickets continued, Leaning turned Guthrie off his legs, the ball flying to sub fielder Tiaan Louw on the backward square-leg boundary.\nEvison played a classy on-drive to take Kent into three figures, but they lost a sixth wicket when a fired-up Leech snared Harry Finch lbw, followed by Stewart who hooked Procter to midwicket.\nEvison forged an enterprising 36-run partnership with Dudgeon to regain some momentum, before the South African was caught behind off an attempted cut against Zaib. The left-arm spinner then found some turn to trap Singh lbw. Evison finally holed out smiting Leech powerfully to Zaib on the deep-midwicket boundary.\nKent's bowlers made a perfect start as Vasconcelos left a Dudgeon delivery which jagged back and hit off-stump. Bartlett flashed Gilchrist over the slips for two boundaries and pulled Dudgeon over deep midwicket for six, but lived a charmed life, beaten outside off-stump and surviving several appeals and a nick through the slips.\nAt the other end, Stewart gave Kent a much-needed breakthrough when he drew the edge of Procter's bat before he bowled Sales shouldering arms.\nBartlett was settling into his work now, but Dudgeon was determined to get the bulk of the work done this evening picking up Zaib, Keogh and Lewis McManus, all caught by Leaning in the slips. To cap a terrible session for Northamptonshire, Broad was lbw to Gilchrist in the final over, the third batter to shoulder arms.", "url": "https://www.bbc.com/sport/cricket/articles/cjdxn7x0lj1o"}