{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:57:45", "date_modify": "2025-05-20 13:57:45", "date_publish": "2023-07-31 05:40:38", "description": "Chelsea: Pochettino press conference after Blues win Premier League Summer Series", "filename": "sport_articles_c4n55ennxevo_1747749465.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c4n55ennxevo_1747749465.html", "title": "Chelsea: Pochettino press conference after Blues win Premier League Summer Series", "title_page": "Chelsea: Pochettino press conference after Blues win Premier League Summer Series - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "How are you feeling to win a trophy?: \"Always it is good to win, I am so pleased again with the performance and the work of the players from the start. It is a busy time but I think we are doing a good job, the players and the staff. It has been a busy four games in a very short period of time and now we play in Chicago against Dortmund and we need to continue. We keep going and prepare the team to arrive in the best condition for the Premier League.\"\nThe potential signing of Lesley Ugochukwu: \"I cannot say anything. I have the information you have. My information is a player that is from France that maybe they sign with the idea to send on loan.\nOn the potential signing of centre-back Axel Disasi from Monaco: \"With Fofana's injury, I think it is obvious that maybe we need to reinforce this area.\"\nTrevoh Chalobah came off injured in the match: \"I hope it's not a big issue. We need to assess now. It doesn't mean it is big. It was a precaution but we need to assess him the next few days.\"\nHow many signings do you need to come in to have balance? \"I don't know because if I say numbers I can create a problem. For me, it's important the club is working really hard to improve all of the areas - the right profiles to make the squad strong.\"\nDo you see Ian Maatsen's future up the pitch or at left-back? \"He has the capacity to compete for different places on the pitch. He is a player you can use in different positions. I am so happy because his performance didn't change. That is what makes us really pleased because he is a player we see with enormous potential for the team.\"", "url": "https://www.bbc.com/sport/articles/c4n55ennxevo"}