{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:34:03", "date_modify": "2025-05-20 11:34:03", "date_publish": "2023-08-07 00:00:00", "description": "Follow live text and radio commentary as Manchester Originals face Birmingham Phoenix in the 2023 Men's Hundred.", "filename": "sport_live_cricket_66307679_1747740843.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/16C4/production/_130682850_gettyimages-1599290534.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_cricket_66307679_1747740843.html", "title": "The Hundred 2023: Manchester Originals vs Birmingham Phoenix in men's competition plus score, commentary, video highlights & updates", "title_page": "The Hundred 2023: Manchester Originals vs Birmingham Phoenix in men's competition plus score, commentary, video highlights & updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Post\nThank you for joining us for another day of Hundred action as Manchester Originals complete the double against Birmingham Phoenix.\nWe'll be back tomorrow as London Spirit take on Southern Brave - the women's game starting at 15:00 BST and the men's at 18:30.\nWe'll be bringing you live text commentary and clips of both those games.\nFor now, you can read Tom Mallows' match report on this game here.\nAnd we'll leave you with a bit of Moeen Ali brilliance as a treat!\nPost\nManchester Originals captain Jos Buttler on Sky Sports: \"Really good performance. Fielding could do with a bit of work! But we read the pitch well. It wasn't straightforward but we adapted well and that allowed us to finish strong.\n\"We thought anything more than 150 would be a good total.\n\"With the ball, we knew that bowling just back of a length would be important and Richard Gleeson started really well with some good pace and swing too.\n\"We've kept a lot of players from our squad last year and I feel like we've got a lot of bases covered. We've got so many all-rounders and that's a real positive for us.\"\nPost\nMatch Hero Usama Mir on Sky Sports: \"I am very happy with this performance. I have been working really hard on my batting so I was very happy to back myself and show everyone my skills today.\n\"It was quite tricky to bat on so I just knew I had to play proper shots and get myself in.\n\"With the ball, I tried to mix it up with some quicker and some slower. It was quite two-paced so that worked well to unsettle the batters.\n\"The rain has been annoying! So this is my first performance in The Hundred and it has been good fun. This is one of my favourite grounds so it's a very special feeling to be here.\"\nPhoenix 93-7\nTarget 161\nWow! A special, special effort in the field from Jamie Overton.\nBenny Howell smashes one straight down the ground, and times his jump on the boundary perfectly to retrieve the ball mid-air, and throw it to safety before he lands on the ground.\nHe's not able to complete the catch but it saves a certain six.\nUsama Mir finishes with 2-27 from his 20 balls.\nWICKET\nShadab c Little b Mir 4 (Phoenix 77-6)\nTrouble. Real trouble.\nShadab Khan slog sweeps into the leg side and Josh Little takes a smart running catch on the boundary.\nThe ball before, Shadab played an almost identical shot that calamitously landed between both Little and Phil Salt on the boundary - so Little gives his team-mate a wry smile as he takes this one cleanly!", "url": "https://www.bbc.com/sport/live/cricket/66307679"}