{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:25:46", "date_modify": "2025-05-21 05:25:46", "date_publish": "2025-02-12 00:00:00", "description": "Follow live text commentary, score updates and match stats from Sheffield United v Middlesbrough in the Championship.", "filename": "sport_football_live_cednpdjjg14t_1747805146.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cednpdjjg14t_1747805146.html", "title": "Sheffield United v Middlesbrough: Championship stats & head-to-head", "title_page": "Sheffield United v Middlesbrough: Championship stats & head-to-head - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Sheffield United sealed a deserved late win over Middlesbrough at Bramall Lane to move back within two points of Championship leaders Leeds United.\nThe Blades led when Boro defender Ryan Giles tangled with his own goalkeeper Mark Travers after challenging Callum O'Hare, gifting the ball to Jesurun Rak-Sakyi to fire in.\nThe visitors levelled before half-time against the run of play when Blades defender Jack Robinson was penalised for pulling down George Edmundson at a corner kick and Delano Burgzorg smashed home from the penalty spot.\nSydie Peck's defence-splitting pass sent Ben Brereton Diaz away to dink a finish over Travers to restore the lead, and Anel Ahmedhodzic then nodded a third into an empty net when the Boro keeper failed to collect Harrison Burrows' corner.\nA sixth win in seven league matches keeps United in second, three points ahead of third-placed Burnley, while four league defeats from five drops Middlesbrough down to ninth, three points outside the play-off places.\nChris Wilder had accused his side of arrogance in a lacklustre win over Portsmouth on Saturday, and a fired-up United were soon on the front foot and cranking up the pressure.\nTravers twice denied powerful first-half efforts from Rak-Sakyi, and the Boro stopper also did well to scramble across and punch Gustavo Hamer's inswinging near-post corner kick off his line.\nThe livewire Hamer curled a low 20-yard drive inches past the right-hand post and was the architect for Rak-Sakyi's second goal in as many games with a brilliant run and defence-splitting pass for O'Hare.\nIt took Boro 40 minutes to test home keeper Cooper as he turned away Hayden Hackney's low drive, but moments later the visitors did peg back the Blades.\nTempers flared after referee Matt Donohue's penalty award as Robinson argued Edmundson also had a firm hold on his shirt, but despite the delay Burgzorg coolly netted for the third successive match.\nBoro debutant Kelechi Iheanacho poked the ball into the net but was flagged for a clear offside in a disjointed start to the second half before the home side gradually upped the tempo.\nRav van den Berg pulled off a superb last-ditch challenge to deny O'Hare before Brereton's second goal since rejoining the Blades finally calmed home nerves.\nBurgzorg's fizzing strike forced a fingertip save from Cooper as Middlesbrough hunted a second equaliser in a frantic finale, in which Hamer limped off with a hamstring problem.\nCampbell then wasted a two-on-one chance when he shot straight at Travers instead of squaring to Brereton Diaz to walk the ball in, but Ahmedhodzic spared him any potential blushes.\nSheffield United boss Chris Wilder told BBC Radio Sheffield:\n\"We reviewed and reflected after the weekend and they've come roaring back, so I'm delighted.\n\"They've taken on board how we wanted to play. That was more us tonight, there was a real good feel about us.\n\"We had to regroup and reset after the ridiculous decision for the penalty. There'd be five or 10 penalties a game if that was the case.\n\"The decision rocked us a little bit for five minutes, but we reset in the changing room at half-time and we had to keep our cool and discipline and still play, and we did that, so I'm delighted.\"\nMiddlesbrough head coach Michael Carrick told BBC Radio Tees:\n\"We didn't start the game particularly great, we got back in the game well. I thought the second half was in the balance for a good spell but it got away from us in the end.\n\"They were not good goals to give away, moments that turn the game, and that was the story really.\n\"Credit to them, they've done things well enough to win the game. We could have done things better to stop the goals, that's pretty obvious, and they are the moments that have turned things in the wrong direction against us of late and we need to flip it back.\n\"There's always the next game, there's always the next result, there's always the next opportunity to do that, but we can't keep saying the same things.\"", "url": "https://www.bbc.com/sport/football/live/cednpdjjg14t"}