{"authors": ["Stephan Shemilt", "www.facebook.com"], "date_download": "2025-05-20 14:08:13", "date_modify": "2025-05-20 14:08:13", "date_publish": "2023-07-30 15:52:36", "description": "England are frustrated by Australia's strong start to a chase of 384 before rain wiped out half of the fourth day of the final Ashes Test at The Oval.", "filename": "sport_cricket_66351028_1747750093.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2E6F/production/_130578811_joerootandusmankhawaja.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66351028_1747750093.html", "title": "The Ashes 2023: Australia openers frustrate England before rain", "title_page": "The Ashes 2023: Australia openers frustrate England before rain - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England were frustrated by Australia's strong start to a chase of 384 before rain wiped out half of the fourth day of the final Ashes Test at The Oval.\nLooking to pull off their second-highest run chase in Test cricket and the best on this ground, Australia made untroubled progress to 135-0.\nUsman Khawaja is unbeaten on 69 and David Warner 58 not out, with the tourists needing another 249 runs to win.\nAfter announcing his retirement at the close on day three, Stuart Broad was given a guard of honour by the Australia players when he emerged to resume his innings on Sunday morning.\nHe pulled Mitchell Starc for six from what turned out to be the final delivery he will face in Test cricket, before last man James Anderson was lbw to give a fourth wicket to Todd Murphy and leave England 395 all out.\nBroad bowled the first over of Australia's innings to his old nemesis Warner, but England were off-colour with the new ball, not helped by a slow, lifeless pitch.\nThe rain arrived at around 14:40 BST, with a possible 48 overs still remaining in the day. The forecast is better for Monday, albeit with a chance of showers. There are 98 overs scheduled for what could be a grandstand finish to a superb series.\nAustralia have already retained the Ashes and avoiding defeat would give them a first series victory in this country since 2001. England are looking for the win that would level the score at 2-2.\nEngland remain favourites to take this match - on only seven occasions in the history of the game has a team made more than 384 to win a Test.\nBut given the tight nature of this series - the first three matches all ended with tense, nerve-shredding conclusions - it would be fitting if more drama is created on Monday.\nEngland are in a slight predicament of their own making. On Saturday they were 332-4, then lost their last six wickets for 63 runs. From 389-9 overnight, Broad's six was the only runs they added on Sunday morning.\nThe caution with which Australia have batted for most of the series served them well on Sunday, even if their task was made easier by the conditions.\nDespite the clouds, England struggled to find any movement and the energy has been gradually sapped from the surface. At times, it felt like the match was being played on a subcontinental pitch under a typically English sky.\nThe rain came at the right time for England, whose frustration was growing as Australia built momentum. The hosts have the opportunity to return refreshed on Monday to send Broad into retirement with a series-levelling win.\nBoth Australia openers are aged 36. Warner has already said this will be his final Ashes Test and it may also turn out to be the last for Khawaja.\nWhile Khawaja has enjoyed a magnificent series - this knock will ensure he will end as the leading run-scorer on either side - Warner is looking for the swansong that bucks the trend of his recent struggles in this country.\nBoth men were calm, composed and patient in compiling the highest opening stand by either team in an Ashes Test in this country since 2009 and, at 38 overs, the longest partnership by any pair in this series.\nKhawaja, with a preference for hanging on the back foot, deflected six boundaries to third man. Warner launched Anderson over mid-off but also had to fend off a freak chest-high beamer from the same bowler.\nIn the 10 overs before the rain arrived, Australia added 53 runs, building a head of steam to take a significant chunk out of the target.\nThough their progress has been stalled, Warner and Khawaja have batted the tourists into a position from where they can claim an unlikely win.", "url": "https://www.bbc.com/sport/cricket/66351028"}