{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:59:49", "date_modify": "2025-05-20 11:59:49", "date_publish": "2023-08-06 06:41:16", "description": "Dan Evans beats Grigor Dimitrov to become the first British player to reach the final in Washington since Andy Murray in 2006.", "filename": "sport_tennis_66420458_1747742389.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/720C/production/_130669192_gettyimages-1595391622.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_tennis_66420458_1747742389.html", "title": "Citi Open: GB's Dan Evans reaches first ATP 500 final with win over Grigor Dimitrov", "title_page": "Citi Open: GB's Dan Evans reaches first ATP 500 final with win over Grigor Dimitrov - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Dan Evans is through to his first ATP 500 final after a straight-set victory over Grigor Dimitrov in Washington DC.\nThe British number two beat the Bulgarian 6-3 7-6 (7-4) and will play Tallon Griekspoor of the Netherlands in the final.\nHe becomes the the first British player to reach the final in Washington since Andy Murray in 2006.\nThe 33-year-old will hope to claim a second career title to add to the ATP 250 title he won in Melbourne in 2021.\nEvans said he felt tired in his semi-final after playing twice on Friday, defeating Russia's Alexander Shevchenko after rain had cancelled their match on Thursday before knocking out home favourite and second seed Frances Tiafoe.\n\"It was so hard after yesterday putting in such a big effort,\" Evans said in his on-court interview.\n\"Coming back today, it was really important for me to not roll over and have a bad performance. The last few months, that is what has happened a little bit.\"\nDmitrov fired 24 winners to just nine from Evans, but the hard-hitting world number 20 came undone with 30 unforced errors.\nThe ninth seed has returned to form this week, after defeats in his opening matches at Queen's Club, Wimbledon and the Atlanta Open.\nMeanwhile, 12th seed Griekspoor, who is chasing a third title of the season, came from a set down to beat American top seed Taylor Fritz 3-6 6-3 6-2 for his first win over a player in the world top 10.", "url": "https://www.bbc.com/sport/tennis/66420458"}