{"authors": ["Emma Sanders", "www.facebook.com"], "date_download": "2025-05-21 07:48:10", "date_modify": "2025-05-21 07:48:10", "date_publish": "2025-05-18 18:32:32", "description": "After wrapping up a domestic treble with their Women's FA Cup win over Manchester United, can anyone stop Chelsea?", "filename": "sport_football_articles_cwy7n1534jko_1747813690.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/95f5/live/ed919a80-3417-11f0-96c3-cf669419a2b0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cwy7n1534jko_1747813690.html", "title": "Can anyone stop 'unrivalled' FA Cup champions Chelsea after treble win?", "title_page": "Can anyone stop 'unrivalled' FA Cup champions Chelsea after treble win? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "As Chelsea's players celebrated at Wembley, a treble complete and an unbeaten domestic season intact, they draped flags around their shoulders displaying the word \"unrivalled\".\nThey strolled up the steps to collect their winners' medals and lift the Women's FA Cup trophy aloft, dancing in front of new £20m investor Alexis Ohanian and waving to family members in the stands and on the pitch below.\nTheir mission was complete. Domestic dominance was achieved and they have indeed been unrivalled.\nFor manager Sonia Bompastor, her debut season at the club could not have gone much better.\nWords, she says, cannot describe her feelings, but she gave an indication of them when she threw her arms in the air and roared when Catarina Macario scored the second goal in their 3-0 victory over Manchester United.\nThe scary thing is that they are only likely to get better.\nThe gap was evident on Sunday as Chelsea outshone Manchester United in almost every department.\nDeeper squad depth, more experience, physicality in midfield and a ruthlessness in the key moments helped Chelsea stroll across the line to complete the treble.\nThey soaked up a period of United pressure early on, clearing away successive corner deliveries, before eventually imposing themselves.\nScotland midfielder Erin Cuthbert won almost every duel in midfield, Mayra Ramirez and Aggie Beever-Jones ran confidently at United's defence and Sandy Baltimore was calm and composed from the penalty spot to make it 1-0.\nUnited's response never came - Chelsea did not allow it - and as the substitutions rolled out, Bompastor's side only got stronger.\n\"Even if I have a lot of experience in my squad, sometimes you stress a little bit and it's OK to have the pressure, but when it's too high you don't start the way you want to,\" Bompastor said as she reflected on a difficult opening 10 minutes.\n\"But after that, we were confident enough to turn things around and we were the better team. We were stronger I think and deserved to win the game.\"\nChelsea's depth allowed them to switch things up. They set up with a less familiar back three and played Baltimore higher up the pitch.\nHaving tried it successfully against Liverpool in their final WSL match, Bompastor said they made small tweaks to improve it and had focused purely on the new system from Tuesday to Saturday, specifically on \"how they could hurt United\".\nUnited boss Marc Skinner said he changed his formation three times in the game to combat it but it was not enough - individually, Chelsea were better.\nBaltimore's cool penalty broke the deadlock, substitute Catarina Macario put the game to bed with her header late on and wounded United were punished in stoppage time by another Baltimore strike to cap things off.\nIt is Chelsea's second domestic treble but arguably their greatest season, given it was achieved having gone unbeaten.\nTheir last one came in 2021 under former manager Emma Hayes but, with the FA Cup final delayed a year because of Covid, two of the trophies were won the season before.\nAs well as stepping into the shoes of Hayes - who had been at the club for 12 years - Bompastor had to develop her English to aid communication, help her four children adapt to new schools and compete in a new league in a different country.\nFormer England striker Ellen White said many expected Chelsea \"to need a transition period\" for Bompastor to implement her style.\nThe style will come, but the results already have.\n\"What they've achieved this season is phenomenal. Everything's come together in Bompastor's first season,\" White told BBC One.\n\"Winning the treble and going unbeaten is extraordinary. Chelsea's mentality has been phenomenal. The squad depth is unrivalled. It's mind-blowing.\n\"It takes a special person to be able to manage those egos and have the communication.\n\"What's special about Bompastor is she has been a player, she knows how it works, she's a proven winner.\"\nChelsea became the first WSL club to go unbeaten in a 22-game campaign and the champions broke their record points tally to do it (60).\nTheir latest FA Cup win - their sixth in total - was the first under a manager that was not Hayes.\nBompastor is also the first non-British manager to win the Women's FA Cup since Arsenal's Spanish manager Pedro Martinez Losa in 2016 - when they beat Chelsea.\nFormer England midfielder Fara Williams said: \"I think the most impressive thing is to keep being able to motivate these players to go on and to continue to win.\n\"Big players want to play and they have got a massive squad. There's only one way you keep the squad depth together and that is with good management.\n\"That's what Bompastor's done. You have to buy in as a player. She's done an incredible job with this team.\"\nWhat it means for everyone else is a scary prospect - this is just the start of Chelsea under Bompastor.\nIt's a new era, there are new ambitions and there is new investment at Chelsea.\nHaving smashed the world record transfer fee to sign USA defender Naomi Girma in January, she is likely to become a mainstay in the team next season after recovering from injury and returning to full fitness.\nOhanian's investment could mean more spending in the summer, while Australia striker Sam Kerr is still to return following an anterior cruciate ligament (ACL) injury.\nThey are still chasing an elusive maiden Champions League trophy - having been humbled by Barcelona in the semi-finals this season - and that is what is driving them. So are Chelsea only going to get better?\n\"I mean, that's our ambition for sure. Maybe everyone is saying 'Chelsea will run away from the pack in England' but our goal is to compete against the best in Europe,\" said Bompastor.\nWhile Chelsea celebrated with their fans, FA Cup medals around their necks, Bompastor said some had pointed out the missing Champions League trophy.\n\"What sets them apart from everyone else is they don't stand still. They always want to move forward,\" said White.\n\"Everyone needs to look at their blueprint and be like 'how can we reach what they are and bridge that gap?' This team is phenomenal and they're going places.\"\nManchester United are one of those chasing.\nSunday's result was proof there is still work to do and manager Skinner knows they cannot compete financially - but what else can they do?\n\"We have to maximise what we have got. We have to come back fitter, stronger, more aggressive and concentrate more,\" he said.\n\"I still believe this - I think we have the best team spirit in the country. I think I have to go and find the other answers.\n\"We vastly and quite openly spend less than Chelsea. I won't rest over the summer. I have to find a way to close that gap but we need investment as well.\"\nSkinner's plea for more investment is supported by Bompastor, who said Chelsea will only improve on the European stage if they are pushed by others in England.\n\"If you have more competition you are able to perform better. This is what we want to be a better team,\" she added.\n\"We want to be at the top of the league and bring everyone with us. We need the other teams to still invest and come with us.\"", "url": "https://www.bbc.com/sport/football/articles/cwy7n1534jko"}