{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:18:22", "date_modify": "2025-05-20 13:18:22", "date_publish": "2023-08-02 12:28:41", "description": "Derbyshire fast bowler George Scrimshaw signs a three-year contract to play for Northamptonshire from the 2024 season.", "filename": "sport_cricket_66381306_1747747102.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/409D/production/_130614561_gettyimages-1491748450.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66381306_1747747102.html", "title": "George Scrimshaw: Northamptonshire sign Derbyshire fast bowler on three-year contract from 2024 season", "title_page": "George Scrimshaw: Northamptonshire sign Derbyshire fast bowler on three-year contract from 2024 season - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Northamptonshire have signed Derbyshire fast bowler George Scrimshaw on a three-year contract from next summer.\nThe England Lions paceman, 25, has taken 81 wickets in 59 matches across all formats having joined Derbyshire in March 2021 following a trial period after being released by Worcestershire.\nScrimshaw, who recovered from a career-threatening back injury, will play for Welsh Fire in this year's Hundred.\nThe 6ft 7ins seamer took 20 wickets in this season's T20 Blast.\n\"The main goal would be to win a T20 title and be challenging for Finals Day every year.\" said Scrimshaw, who made his T20 debut against Northants for Worcestershire in 2017.\n\"I also want to contribute with some performances in red ball cricket though and for the team to be ambitious on keeping Division One status.\n\"From an outsider playing against Northamptonshire you know the skill and the standard of the players is high. It's a ground I've always liked bowling at in the short form of the game and it's an exciting squad to be part of.\"\nScrimshaw took career-best figures of 5-49 as Derbyshire drew their latest County Championship match against Sussex.", "url": "https://www.bbc.com/sport/cricket/66381306"}