{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:51:47", "date_modify": "2025-05-21 05:51:47", "date_publish": "2025-02-01 00:00:00", "description": "Burnley lose ground on the top two as struggling Portsmouth maintain their strong home form with spirited draw.", "filename": "sport_football_live_c1dgqk3k9v6t_1747806707.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c1dgqk3k9v6t_1747806707.html", "title": "Portsmouth 0-0 Burnley: Clarets held by Pompey at Fratton Park", "title_page": "Portsmouth 0-0 Burnley: Clarets held by Pompey at Fratton Park - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Burnley kept an eighth consecutive clean sheet in the Championship but lost ground on the top two as struggling Portsmouth maintained their strong home form to secure a spirited draw in a nervy game.\nClarets keeper James Trafford made a couple of excellent saves as he recorded his 21st shut out this term, while his counterpart Nicolas Schmid made a fine first-half stop from Lyle Foster's header.\nBut both sides struggled to create clear chances in an increasingly edgy contest that provided reasonable entertainment but lacked creativity or quality in the final third.\nPompey, who have now picked all but seven of their 30 league points this season at Fratton Park, will be content with a point that leaves them two points clear of the bottom three.\nHowever, victories for pacesetters Leeds United and second-placed Sheffield United - against Pompey's fellow strugglers Derby County - means the Clarets slip five points behind the summit and three points adrift of the Blades.\nScott Parker's miserly side are now unbeaten in 17 Championship fixtures. have lost just twice in the entire campaign - conceding just nine goals in 30 games - and have gone a club-record 770 minutes without conceding a league goal.\nPompey came close to taking the goals against column into double figures in the first half, Zak Swanson shooting narrowly over and Matt Ritchie firing a shot into the side netting.\nAnd Trafford once again showed his value, most notably with a fine save to keep out Zak Swanson's header from Josh Murphy's cross.\nAt the other end, Austrian Schmid improvised brilliantly with his leg to block Foster's header at the back post following an inviting Jaidon Anthony's cross.\nNeither side could fashion much after the interval, although Conor Shaughnessy did force a great save from Trafford - an intervention which ensured that Watford's Kwadwo Baah remains the last Championship player to score against the Clarets on 21 December.\nBurnley boss Scott Parker told BBC Radio Lancashire:\n\"It's a difficult place to come as you can see from their results over the past few weeks.\n\"They are a different animal at home, an aggressive team who put you under pressure constantly with a real intent and we had to stand up to that.\n\"That's the one positive because this game could have looked a lot different if we didn't have that resilience about us.\n\"On the flip side, we weren't at our best. We lacked a little something.\n\"We knew what was coming and the way they play causes you problems. We couldn't really gain any control and that's down to them. They put us under a lot of pressure but it's a good point.\"", "url": "https://www.bbc.com/sport/football/live/c1dgqk3k9v6t"}