{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 08:00:44", "date_modify": "2025-05-21 08:00:44", "date_publish": "2025-01-03 15:38:22", "description": "The GAA says it will monitor the condition of playing surfaces over the weekend after weather warnings for snow and ice were issued on Friday.", "filename": "sport_articles_ce8e72ldqq2o_1747814444.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7e4c/live/567860a0-c9e8-11ef-b056-6f0ecb5a0ddb.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_ce8e72ldqq2o_1747814444.html", "title": "GAA to 'monitor pitches' amid weather warnings", "title_page": "All-Ireland Club: GAA to 'monitor pitches' amid weather warnings - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The GAA has said it will monitor the condition of playing surfaces over the weekend after weather warnings for snow and ice were issued on Friday.\nMet Eireann issued an orange warning for six counties, with significant snowfall expected over the weekend.\nThe warning is from 17:00 GMT on Saturday to 17:00 on Sunday for counties Carlow, Kilkenny, Wicklow, Clare, Limerick and Tipperary, with a yellow warning for Cork and Kerry from 13:00 on Saturday until 17:00 on Sunday.\nAll-Ireland club matches are scheduled for Saturday and Sunday in Cavan, Tullamore, Longford, Portlaoise and Roscommon.\nThe GAA said: \"Due to the current weather forecast, the GAA will monitor the pitches over the weekend, any changes will be notified as soon as possible.\n\"Updates will be available on the GAA's social media channels.\"\nUlster champions Errigal Ciaran are scheduled to face Kerry side Dr Crokes in the All-Ireland semi-finals at O'Moore Park in Portlaoise at 15:30 on Sunday. There will be a pitch inspection at O'Moore Park on Saturday evening and, if required, on Sunday morning.\nDerry club Ballinderry are also in semi-final action in the All-Ireland Intermediate series against Kerry's Austin Stacks on Saturday at Dublin's Parnell Park (14:00). The match was originally fixed for 13:00 in Tullamore but the GAA confirmed the time and venue change on Friday afternoon.\nA number of inter-county challenge matches - in which gaelic football's new rules will be used ahead of the National League - are also scheduled to take place over the weekend.", "url": "https://www.bbc.com/sport/articles/ce8e72ldqq2o"}