{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:39:31", "date_modify": "2025-05-21 06:39:31", "date_publish": "2024-12-24 09:57:25", "description": "Nottingham Forest news: Reds 'can't get carried away by thinking about the league table'", "filename": "sport_football_articles_cd0ek93pnjeo_1747809571.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e9ed/live/14ffd400-c141-11ef-b208-058c682ba73e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cd0ek93pnjeo_1747809571.html", "title": "Nottingham Forest news: Reds 'can't get carried away by thinking about the league table'", "title_page": "Nottingham Forest news: Reds 'can't get carried away by thinking about the league table' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Nottingham Forest's league position at Christmas is \"extraordinary\" but they still need to \"keep their feet on the floor\", says BBC Radio Nottingham's Colin Fray.\nTheir 2-0 victory over Brentford on Saturday, who had been unbeaten at home this season, took them to fourth in the table.\nThe Reds are now three points above Bournemouth in fifth and just two points behind Arsenal, who sit third.\nFray said: \"Who would have given you many odds on that [top four at Christmas] back in August? Nobody really.\n\"People weren't expecting this. People locally might have been thinking that 12th or something like that would have been a great improvement, but nobody was thinking this. Fourth at Christmas is an extraordinary improvement year on year.\n\"They finished last year with 32 points and earned 36 on the pitch. They have 31 already but Forest are not going to be going into the new year thinking: 'That's it, we have enough points now to stay safe.' Those objectives are revised now.\n\"They need to keep doing what they are doing. They need to strengthen again in January with sensible additions to make them even stronger, even better.\n\"Like any side, they will need a little bit of luck with injuries and want to avoid key players getting injured. And they need really to keep their feet on the floor.\n\"They can't get carried away by thinking about the league table and their position.\"", "url": "https://www.bbc.com/sport/football/articles/cd0ek93pnjeo"}