{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:15:44", "date_modify": "2025-05-21 05:15:44", "date_publish": "2025-04-03 17:43:10", "description": "Watford boss Tom Cleverley confirms that young striker Mamadou Doumbia will be in contention for selection against Bristol City following an injury lay-off.", "filename": "sport_football_articles_cql6rnx9lneo_1747804544.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b4cf/live/f50a7d10-10ac-11f0-a687-87f1851e5d51.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cql6rnx9lneo_1747804544.html", "title": "Mamadou Doumbia: Mali striker in contention for Watford return", "title_page": "Mamadou Doumbia: Mali striker in contention for Watford return - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Young striker Mamadou Doumbia has provided more good news for Watford boss Tom Cleverley by coming through a week of full training ahead of their trip to Bristol City on Saturday.\nThe 19-year-old from Mali, who is still waiting for his first senior goal for The Hornets, has not played since limping off with a hamstring injury against Millwall on 8 March.\nBut he will be in contention for a place at Ashton Gate and Cleverley also expects defender Kevin Keben back for the home game against Hull City on Tuesday.\nWatford are ninth in the Championship, four points outside the play-off places, following last weekend's disappointing goalless draw with Plymouth Argyle.\nKwadwo Baah returned from injury with a 30-minute run-out against Argyle, and Cleverley expects him to play an even bigger part against Bristol City.\n\"Has he got 90 in his legs? I'm not sure. But he's certainly got 60 or 70,\" he told BBC Three Counties Radio.\n\"We've recovered a lot in the last couple of weeks, and at the right time of the season.\"\nCleverley said facing Bristol City, the team immediately above them, was the type of game that \"makes you really hungry to be in football\".\nHe added: \"Beautiful stadium, two good teams, I'm really excited for the challenge that lies ahead and the weather is an added bonus.\n\"It's not over until it's mathematically over but this game is very significant for us, especially after not winning the last home game. It puts even more on this that we must go and win.\n\"The teams in and around us, we have a good record against. They look like a team who are very well coached, they problem-solve on the pitch and have been playing this 3-4-3 style very well.\"", "url": "https://www.bbc.com/sport/football/articles/cql6rnx9lneo"}