{"authors": ["Tom English", "www.facebook.com"], "date_download": "2025-05-19 15:18:48", "date_modify": "2025-05-19 15:18:48", "date_publish": "2017-08-05 10:00:24", "description": "Graham Dorrans' double sees Rangers launch their Scottish Premiership campaign with victory at Motherwell.", "filename": "sport_football_40766961_1747667928.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/EF08/production/_97229116_dorrans_cel2_sns.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_40766961_1747667928.html", "title": "Motherwell 1-2 Rangers", "title_page": "Motherwell 1-2 Rangers - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Graham Dorrans scored twice as Rangers began their Scottish Premiership campaign with victory at Motherwell.\nThe visitors made the perfect start when Dorrans' drive deflected in off Ben Heneghan in the fourth minute.\nThe impressive Josh Windass hit the post and bar, but Motherwell responded and Heneghan headed in at the far post.\nLouis Moult's careless elbow on Fabio Cardoso allowed Dorrans to convert the penalty, but Ryan Bowman and Alex Fisher missed chances to equalise.\nThe hosts remain without a league victory against Rangers since Boxing Day 2002, that sorry sequence now extending to 38 matches.\nIn what was an engrossing game, Rangers had a dream start when they scored after only four minutes. Bruno Alves crossed deftly for Kenny Miller, who headed it down for Dorrans, making his league debut for Pedro Caixinha's men, to drive home his first of the day.\nMotherwell were a calamity at the back last season, conceding more goals than any other team bar relegated Inverness. They had to hang on to avoid going another one behind in the early minutes at Fir Park.\nRangers were full of running, repeatedly got in behind their hosts and threatened every time they poured forward, which was often.\nWindass was terrific on the left. Motherwell didn't have a notion what to do about him. In the 20th minute he scampered free, beat a couple of men and curled a gorgeous shot on to Trevor Carson's post. Later, he saw another wonderful effort come slapping back off the crossbar.\nBy then, of course, Motherwell were level. This was a regular feature of Rangers' season last time around, an inability to force home their superiority and convert it into goals.\nThey had other chances but what they also had was a vulnerability down both flanks, particularly on their right where Lee Hodson toiled in the face of Elliott Frear.\nMotherwell weathered the Rangers storm and started building their confidence. Moult volleyed one over, then Craig Tanner slid a half-chance wide.\nThe equaliser came just before the break when Alves conceded a needless free-kick which Tanner put in the box.\nRangers were all over the place in trying to deal with it. Wes Foderingham stood rooted to his line. None of his defenders took charge either. It was Heneghan's desire and desperation to get to the ball that counted, the big defender getting enough on a diving header to beat Foderingham.\nIn the midst of all of this Motherwell had a shout for a penalty when a Frear cross looked to come off Hodson's arm.\nA penalty was awarded, but it didn't go to the hosts, it went to the visitors when Cardoso was elbowed in the side of the neck by Moult. Referee Bobby Madden was emphatic in pointing to the spot - and he was right. Dorrans took the penalty and he got it right, too.\nMotherwell were always in this, though. Rangers' slackness in possession and frailty in defence guaranteed it.\nFrom a Cadden delivery from the right, Bowman came painfully close to levelling it again. With four minutes left, Rangers had to scramble again when Fisher pounced on a loose ball just outside the six-yard box only to see his shot deflect away for a corner off Foderingham. It was a glorious chance.\nRangers saw it out for a hard-fought and desperately needed win. For Pedro Caixinha, relief that they didn't buckle in the end-game. For Stephen Robinson, frustration but also some optimism. Fine game, fine margin.", "url": "https://www.bbc.com/sport/football/40766961"}