{"authors": ["Sarah Rendell", "www.facebook.com"], "date_download": "2025-05-21 05:57:05", "date_modify": "2025-05-21 05:57:05", "date_publish": "2025-01-31 14:48:32", "description": "Ange Postecoglou press conference: Brentford vs Tottenham preview", "filename": "sport_football_articles_cgly65k62xpo_1747807025.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f21e/live/f7d58710-6de1-11ef-8c32-f3c2bc7494c6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cgly65k62xpo_1747807025.html", "title": "Ange Postecoglou press conference: Brentford vs Tottenham preview", "title_page": "Ange Postecoglou press conference: Brentford vs Tottenham preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Postecoglou says Djed Spence should be \"OK\" for Sunday while Sergio Reguilon has \"a chance\" to be back.\nThose are the only two who could return with the rest on Spurs' long injury list not available. Radu Dragusin is also not available this weekend after being substituted against Elfsborg on Thursday with a knee issue: \"We will let it settle down. There is always concern when it's a knee.\"\nOn the transfer deadline day: \"I was looking at the date. I was hoping it was all over today but it's extended until Monday. We will see what happens over the next couple of days.\"\nOn the potential signing of Mathys Tel from Bayern Munich: \"[I've not heard] a great deal. I usually find out at the tail end of this stuff what is going on. Obviously we're exploring some opportunities for the last couple of days of the window to see what we can do.\"\nOn Mickey van de Ven's return on Thursday evening and if he can play 90 minutes this weekend: \"Probably not 90 because of the short turnaround but he felt really good last night. It was great to have him out there. You know he is a good player but you don't realise how much of a good player he is until [he's not there]. I guess that is the case with all of our players who have been missing for quite a while. It's not just the impact they have individually but the impact they have on the group.\"", "url": "https://www.bbc.com/sport/football/articles/cgly65k62xpo"}