{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:06:06", "date_modify": "2025-05-21 07:06:06", "date_publish": "2025-03-29 00:00:00", "description": "Trai Hume's first-half strike sees Sunderland narrowly beat Millwall and move closer to guaranteeing a play-off spot.", "filename": "sport_football_live_crlxyxyz970t_1747811166.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ccdb/live/df056e40-0cbe-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_crlxyxyz970t_1747811166.html", "title": "Sunderland 1-0 Millwall - Hume grabs winning goal for Black Cats", "title_page": "Sunderland 1-0 Millwall - Hume grabs winning goal for Black Cats - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Sunderland moved closer to securing a Championship play-off spot with a narrow home win over mid-table Millwall.\nNorthern Ireland defender Trai Hume volleyed home the only goal after 20 minutes as the Black Cats secured a first win in three games.\nIn fourth place since the end of November, seven more points would be enough to guarantee a place in the top six.\nIt could and should have been more but for Lions goalkeeper Lukas Jensen, who saved Luke O'Nien's late penalty.\nThe visitors' best chance came when Josh Coburn headed straight at Anthony Patterson.\nThey drop to 13th, six points adrift of the play-off spots and needing a very strong run of results to get into contention.\nRegis Le Bris' men have been in and around the promotion places all season, but the 3-0 loss at Coventry a fortnight ago was their heaviest of the season and all but extinguished hopes of going up automatically.\nThey began as if they wanted to make amends for that result with Jensen called into action in the first minute as he saved from Wilson Isidor and Chris Rigg.\nThen Patrick Roberts brought another fine save out of Jensen with a dipping shot as he cut in from the right.\nBut the winger turned provider in Hume's goal as he played a short corner with Romaine Mundle before spotting the right-back's run to the back post and picked him out for Hume to volley low and hard past Jensen.\nMillwall had been second best but they grew into the game, although Luke Cundle's tame shot after a good move was the closest they came in the first half.\nSince Christmas, the Black Cats' top-two hopes have been hit by a number of costly home draws and a defeat in games they would have expected to win.\nThey pushed for the second and would have got it but for an exceptional save from Jensen as he somehow tipped over Isidor's close-range header.\nWhile they had a golden chance to seal the points when they were awarded a penalty as Mundle was tripped by Lions defender Japhet Tanganga.\nMundle wanted the spot-kick but needed to be ushered away by captain Dan Neil with long-serving defender O'Nien given the responsibility, only for his tame effort to be pushed clear by Jensen, diving to his left.\nThey held on for the win, but penalties remain a worry after Isidor missed two in the match at Burnley in January, a situation that must be rectified with the play-offs on the horizon.\nAs for Millwall, only Luton Town have scored fewer goals than their 37 and when they did fashion a good chance, Coburn could not find the net.\nThat lack of potency must change for Alex Neil's side if they are to fashion an improbable play-off charge.\nSunderland head coach Regis Le Bris talking to BBC Radio Newcastle about his side's penalty problems:\n\"It's tough. For the end of the game, the second goal would have been easier for us and we couldn't relax until the end.\n\"At the moment, our percentage of success is really low and we have to find a solution.\n\"This is the best situation to score and so far we only score one out of five.\n\"We'll talk about it next week because maybe we'll have a penalty shoot-out at the end of the season and if we work like that, the chances won't be high.\"\nMillwall head coach Alex Neil told BBC Radio London:\n\"It was a hard-fought game, I didn't think there was a lot in the game.\n\"The disappointing thing from our point of view is when you come to Sunderland, the last thing you should do is lose the game on a set-play.\n\"We're a big strong side and we didn't deal with it well enough, which cost us the match.\"", "url": "https://www.bbc.com/sport/football/live/crlxyxyz970t"}