{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:54:43", "date_modify": "2025-05-20 14:54:43", "date_publish": "2023-07-27 13:27:05", "description": "Ukrainian fencer Olga Kharlan is disqualified from the World Fencing Championships for refusing to shake hands with Russian Anna Smirnova.", "filename": "sport_fencing_66322668_1747752883.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/BB8F/production/_130551084_gettyimages-1556779307.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_fencing_66322668_1747752883.html", "title": "World Fencing Championships: Ukraine's Olga Kharlan disqualified for refusing Russian Anna Smirnov's handshake", "title_page": "World Fencing Championships: Ukraine's Olga Kharlan disqualified for refusing Russian Anna Smirnov's handshake - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ukrainian fencer Olga Kharlan has been disqualified for refusing to shake hands with Russian Anna Smirnova at the World Fencing Championships.\nKharlan, the first fencer to face a Russian or Belarusian since the former's full-scale invasion of her homeland, won 15-7 in Milan.\nThe 32-year-old rejected Smirnova's handshake afterwards, instead offering her sabre to tap blades.\nIt led to an appeal from Smirnova, who staged a 45-minute sit-down protest.\n\"My message today is that we Ukrainian athletes are ready to face Russians on the sports field but we will never shake hands with them,\" Kharlan said afterwards.\nSmirnova, competing under a neutral flag, remained standing on the piste following the first-round contest before being handed a chair as her protest continued.\nHer appeal looked to have been dismissed, with Kharlan still showing as through to the last 32 when Smirnova eventually walked off after being spoken to by an official, allowing the next bout to start.\nHowever, the results later showed that Kharlan, a four-time individual world champion and four-time Olympic medallist, had been disqualified from the women's sabre individual.\nKharlan claimed that Emmanuel Katsiadakis, the president of the International Fencing Federation (FIE), had assured her that it was \"possible\" not to shake hands and offer a touch of her blade instead.\n\"I thought I had his word, to be safe, but apparently, no,\" Kharlan added.\nThe International Olympic Committee (IOC) has called upon sports federations to handle Ukrainian athletes and Russians competing as neutrals with \"the necessary degree of sensitivity\" following Kharlan's disqualification, adding: \"We continue to stand in full solidarity with the Ukrainian athletes and the Olympic community of Ukraine.\"", "url": "https://www.bbc.com/sport/fencing/66322668"}