{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:18:18", "date_modify": "2025-05-20 13:18:18", "date_publish": "2023-08-02 11:53:06", "description": "DIGIONLY", "filename": "sport_football_66383595_1747747098.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66383595_1747747098.html", "title": "Grieving Kgatlana sends South Africa into last 16", "title_page": "Grieving Kgatlana sends South Africa into last 16 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "South Africa are into the last 16 after claiming their first Women's World Cup win with a thrilling 3-2 victory over Italy in Wellington.\nThembi Kgatlana's stoppage-time winner came after Italy fought back to level with an Arianna Caruso header.\nThe late drama completed an emotional fortnight for the South African goalscorer.\n\"Over the last two weeks, I've lost three family members. I could have gone home but I chose to stay with my girls,\" Kgatlana said.\n\"Because that's how much it means.\"\nSouth Africa will play Group E winners the Netherlands on Sunday.\nKnowing a win would guarantee their place in the knockout rounds, Italy got off to the perfect start when they were awarded a penalty as Karabo Dhlamini caught the heels of teenager Chiara Beccari and Caruso calmly converted to put her side in command of their World Cup future.\nHowever, South Africa were gifted a leveller as Benedetta Orsi, playing her first World Cup match, hit a no-look back pass to a surprised Francesca Durante and it rolled into her own net.\nEllis' side burst into the lead when Kgatlana slipped a clever ball through the Italy defence to put Hildah Magaia through on goal and she lifted it over Durante.\nVAR seemed like it may have come to South Africa's rescue when Caruso equalised from a corner, but after a lengthy delay the goal was given.\nA draw would have been enough to take Italy into the knockout rounds, but Magaia stepped through the defence and squared to Kgatlana, who found the net.", "url": "https://www.bbc.com/sport/football/66383595"}