{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:43:49", "date_modify": "2025-05-20 12:43:49", "date_publish": "2023-08-03 13:57:28", "description": "Cardiff appoint Matt Sherratt as head coach following the departure of director of rugby Dai Young.", "filename": "sport_rugby-union_66398260_1747745029.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/C3D5/production/_130633105_cdf_150123_cf_cardiff_v_newcastle_120.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-union_66398260_1747745029.html", "title": "Matt Sherratt: Backs coach appointed Cardiff head coach", "title_page": "Matt Sherratt: Backs coach appointed Cardiff head coach - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cardiff have appointed Matt Sherratt as head coach following the departure of director of rugby Dai Young.\nYoung left the club in July despite an investigation into bullying allegations finding \"insufficient evidence\".\nSherratt, 47, was previously Cardiff's backs and attack coach and has also had spells with Ospreys and Worcester Warriors.\n\"It is a club I feel emotionally attached to,\" said Sherratt.\n\"I have been part of the coaching staff in two different regimes.\n\"This club has done a huge amount for myself and my family and I feel it is time to stand up and repay the club by helping it rebuild through difficult times in rugby\"\n\"I feel like I have the respect and the support of the players and staff and it is vitally important that we stick together and move forward as a group.\n\"It is no secret it will be a challenging season with the financial constraints in Welsh rugby\n\"But we still have world class players, seasoned Internationals and young hungry home grown players who are desperate to wear the jersey.\"\nSherratt's coaching team has yet to be finalised although former Wales scrum-half Richie Rees will remain as part of the Arms Park staff.\nThe pair were the only remaining senior coaches remaining in the Cardiff set-up after Young was suspended in April.\nFormer Wales international Young had denied accusations of bullying and an independent investigation was launched. A barrister concluded there was insufficient evidence to support any allegations.\nHowever, Young and Cardiff agreed to his departure after relationships became \"strained\".", "url": "https://www.bbc.com/sport/rugby-union/66398260"}