{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:59:38", "date_modify": "2025-05-21 07:59:38", "date_publish": "2024-12-23 10:34:26", "description": "Hearts: 'Any win is welcome just now'", "filename": "sport_articles_c8dqynjmldlo_1747814378.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/96cc/live/c5c22ba0-c117-11ef-a0f2-fd81ae5962f4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c8dqynjmldlo_1747814378.html", "title": "'Any win is welcome just now'", "title_page": "Hearts: 'Any win is welcome just now' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Hearts fans, we asked for your views on Sunday's 2-1 win over St Johnstone.\nHere's what some of you had to say:\nDavid: Much better performance which hopefully will give the players and fans a lift. Feel for James Penrice who has shone throughout the season but giving away three penalties (rightly or wrongly) in three games is something that has to be addressed. The January transfer window dealings are crucial for the rest of the season.\nChris: I see Neil Critchley thinks we were excellent, is he trying to convince us or him? I think today's game was an improvement but is miles away from \"excellent\". Cammy Devlin, however, was excellent and Penrice too. Hibs have a lot of talent in the forward areas and should come to Tynecastle confident of a win. We need a little bit of luck.\nKuptin: Any win is welcome just now. The young guys, Adam Forrester and James Wilson, are the least nervous. But Hearts are full of contradictions just now. Devlin is great but only passes the ball sideways. Penrice is obviously the best newcomer but gives away too many penalties. Lawrence Shankland is still good at everything except scoring. It's a hard watch.\nJim: Beating St. Johnstone isn't something normally to crow about but it's a start. Hibs will be tougher but it doesn't hide the fact that we are struggling to score, January is a chance to start the process of building the team, offload players who don't have the right attitude and maybe we can avoid relegation, my hopes are not high.\nAnon: At present a win is greatly appreciated and listening on the radio I felt the crowd were behind the team. Let's hope his is the start of our climb away from the relegation zone especially as the noisy neighbours are at our place on Boxing Day.\nAnon: A last we played for each other, we played as a team. Let's hope this is a start after a disastrous end in Europe.", "url": "https://www.bbc.com/sport/articles/c8dqynjmldlo"}