{"authors": ["Stephan Shemilt", "www.facebook.com"], "date_download": "2025-05-19 14:41:17", "date_modify": "2025-05-19 14:41:17", "date_publish": "2017-07-23 16:50:35", "description": "Anya Shrubsole takes 6-46 as England win the Women's World Cup thanks to a nine-run win over India in a pulsating final at Lord's.", "filename": "sport_cricket_40698974_1747665677.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4411/production/_97052471_england_women_getty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_cricket_40698974_1747665677.html", "title": "Women's World Cup: England beat India by nine runs in thrilling final at Lord's", "title_page": "Women's World Cup: England beat India by nine runs in thrilling final at Lord's - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England completed a stunning fightback to beat India by nine runs and win the Women's World Cup at an ecstatic Lord's.\nChasing 229, India looked set for victory at 191-3, but Anya Shrubsole pinned Punam Raut lbw for 86 to spark a collapse of seven wickets for 28 runs.\nThe seamer finished with 6-46 - the best figures in a World Cup final - as India were bowled out for 219 with eight balls unused.\nEven as Shrubsole was in the middle of a stunning spell of 5-11 in 19 deliveries, India were within touching distance of the highest successful chase in a World Cup final and a first major trophy.\nFears that England may have missed their chance were raised when Jenny Gunn dropped a sitter at mid-off to reprieve Poonam Yadav.\nBut Shrubsole bowled Rajeshwari Gayakwad next ball to spark joyous scenes on the pitch and among the majority of fans in a sell-out crowd.\nNatalie Sciver made 51 and Sarah Taylor 45 in England's 228-7, which proved enough for a fourth World Cup crown.\nIt ended a wait for a global trophy that went back to 2009 and vindicated the approach of coach Mark Robinson, who dispensed with former captain Charlotte Edwards after defeat in the semi-finals of the 2016 World Twenty20.\nAfter losing the World T20 semi to Australia in India last year, Robinson criticised his team's fitness and set about making changes.\nEdwards was replaced as captain and retired, with new skipper Heather Knight leading a team of players that established themselves in the international arena.\nBatters Tammy Beaumont, Lauren Winfeld and Fran Wilson have all been integrated into the top order, Alex Hartley's left-arm spin has become integral to the attack and Sarah Taylor has returned from an anxiety-related issue.\nKnight's side were beaten by India in the first game of the tournament, but steadily improved to top the eight-team group, including beating defending champions Australia.\nTheir thrilling semi-final victory over South Africa was front-page news, but it was nothing compared to the drama of the final in the rain at a packed, partisan and raucous Lord's.\nBefore the final, Shrubsole's father shared a picture on Twitter of his daughter as a nine-year-old, who said she wanted to play in a World Cup final at Lord's.\nThe vice-captain had already hit the winning runs in the semi-final, and, in the final, lifted England when the World Cup looked to be slipping away.\n\"It worked wonders for my dad's media profile,\" Shrubsole told BBC Sport. \"He's not always the most sentimental.\n\"You maybe have a dream, but you never actually think these things are going to happen. For that dream to be a reality is just amazing.\"\nRaut, who should have been stumped by Taylor on 64, was trapped lbw before Sushma Verma was bowled by Hartley without scoring.\nIndia needed only 33 from 39 balls with five wickets in hand, but Shrubsole, charging in from the Pavilion End, was irresistible.\nShe removed the dangerous Veda Krishnamurthy, who top-edged a swipe to Sciver, bowled Jhulan Goswami and ran out Shikha Pandey from point.\nDeepti Sharma spooned to Sciver at mid-wicket as Shrubsole completed the first five-wicket haul in a World Cup final and, after Gunn's error, Shrubsole cleaned up Gayakwad to seal victory in style.\nEngland captain Heather Knight: \"I can't stop smiling. I am so proud of this group of girls. We made it hard for ourselves but I couldn't care less.\n\"India were batting brilliantly and put good partnerships together. We knew if we hung in and kept the rate at five or six then we would always be in the game.\n\"We held our nerve. Anya Shrubsole - what a hero.\"\nAnya Shrubsole, who took 6-46: \"I am lost for words. It is a dream. I never thought it would come true. To be back here as a World Cup winner is amazing.\n\"It is a fitting final of what was a brilliant World Cup. There was a huge amount of pressure.\n\"One of the great things about this team is we never give up. One defeat was never going to put us out of the World Cup but we showed a huge amount of fight and that was epitomised by today.\"\nIndia skipper Mithali Raj: \"It wasn't easy for England but credit to them - they kept their nerve.\n\"There was a time when the match was in the balance. We panicked and they came out victorious.\"", "url": "https://www.bbc.com/sport/cricket/40698974"}