{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:31:25", "date_modify": "2025-05-21 07:31:25", "date_publish": "2025-03-28 16:59:49", "description": "Chelsea look to be charging towards a sixth straight WSL title as they extend their lead at the top to six points - but when could they win it?", "filename": "sport_football_articles_cn8r39lx392o_1747812685.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b3f5/live/1154bf60-2383-11f0-9c65-a5c3dc449bf3.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cn8r39lx392o_1747812685.html", "title": "Women's Super League permutations: What's to play for as Chelsea close in on title?", "title_page": "Women's Super League permutations: What's to play for as Chelsea close in on title? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Chelsea could win their sixth successive Women's Super League title on Wednesday.\nThey lead Arsenal by six points and Manchester United by eight with three games remaining.\nThose three sides are well placed to qualify for Europe, but Manchester City are still in the mix after a win at Leicester on Sunday.\nThe other end of the table is sorted with Crystal Palace relegated on Sunday after their 7-1 thrashing by West Ham.\nHow are things shaping up for the remaining games? Who has the tougher run-in?\nThere have been no signs of teething problems for Chelsea this season under new boss Sonia Bompastor, as their league dominance - established under predecessor Emma Hayes - has continued.\nUnbeaten in the WSL this season, Chelsea have 51 points from a possible 57, although two draws in March allowed closest challengers Arsenal to get within three points at one stage and Manchester United within five.\nThe highest total Arsenal could finish with is 54 points, meaning Chelsea need four more points at most to guarantee the title.\nBecause of their recent Champions League semi-final participation, Chelsea's WSL game at Manchester United has been rearranged for 30 April.\nThey will clinch the title with victory over Manchester United (20:15 BST kick-off) should Arsenal drop points against Aston Villa earlier in the evening (18:00).\nYet if the Gunners win all of their fixtures, the earliest Chelsea could be crowned champions is in their penultimate game of the season away to Tottenham on 4 May.\nManchester City, who challenged Chelsea until the final day last season, are now mathematically out of the title race and only have slim hopes of achieving a Champions League spot.\nEven if City win all their remaining games - including against their neighbours - one win from United's other two matches would be enough for them to finish third.\nFrom next season, the Women's Champions League format is changing, with the number of teams earning direct qualification expanding from four teams to nine.\nThe winners of the WSL will directly qualify, along with the champions from the other five top-ranked national associations.\nThe runners-up of the two top-ranked associations - set to be France and Germany - will also be guaranteed direct qualification, along with the previous season's winners.\nAs it stands, the WSL champions will go directly into the league phase with the teams in second and third going into the qualifying rounds.\nIf Arsenal win the Champions League they would automatically qualify for the league phase as holders.\nCrystal Palace will make an instant return to the Championship after their relegation was confirmed by a home thrashing by West Ham.\nThey have won two games, drawn three but lost 15 in the first season in the top-flight.\nThey are the first team to be relegated in their debut season in the Women's Super League.\n\"Over a year in football, you get what you deserve and we have to acknowledge we have not been good enough,\" said Palace boss Leif Smerud.", "url": "https://www.bbc.com/sport/football/articles/cn8r39lx392o"}