{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:44:53", "date_modify": "2025-05-21 05:44:53", "date_publish": "2025-04-02 14:21:59", "description": "Wes Goosen extends Edinburgh stay until 2027", "filename": "sport_articles_c1drp4e1dlwo_1747806293.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/344f/live/73252200-0fc6-11f0-9f8d-f125b11f3e53.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c1drp4e1dlwo_1747806293.html", "title": "Goosen extends Edinburgh stay until 2027", "title_page": "Wes Goosen extends Edinburgh stay until 2027 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wes Goosen has signed on for another two years with Edinburgh, saying it would be \"stupid to leave\".\nThe 29-year-old South African-born full-back, who joined in 2022, is set for his 50th Edinburgh appearance on Friday night and has played every minute this season.\nAfter extending his deal to 2027, Goosen said: \"I've loved it here. I love the boys and playing under Sean [Everitt] and the coaching staff.\n\"It would just be stupid to leave. There's so much potential here. I think I've started to play some of my best rugby.\"\nShould Goosen see out his contract he will become eligible for Scotland and could follow Edinburgh team-mates Duhan van der Merwe and Pierre Schoeman, who also qualified through residency rules.\n\"It's definitely something I thought about,\" Goosen said. \"Watching Tom Jordan play in the Six Nations and how well he played was cool and the passion that he had straight away for Scotland and seeing a few of the South African boys, it's definitely something I thought about.\n\"It was more a case of I've really enjoyed it here, it'd be silly to move. But, yeah, keep playing good rugby and see what happens.\"\nEdinburgh head coach Sean Everitt said: \"Wes has already established himself as one of the best players in the URC and if he continues to develop to be in the mix with Scotland in 2027, I've got no doubt he has the potential to be an international level player.\"", "url": "https://www.bbc.com/sport/articles/c1drp4e1dlwo"}