{"authors": ["Mike Richards", "www.facebook.com"], "date_download": "2025-04-26 07:56:00", "date_modify": "2025-04-26 07:56:00", "date_publish": "2025-02-25 12:25:09", "description": "Everton news: Opinion - VAR is painful and not football", "filename": "sport_football_articles_c3rnqjww578o_1745654160.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b550/live/69581a40-b629-11ee-beb5-e1400df560f2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c3rnqjww578o_1745654160.html", "title": "Opinion - VAR is painful and not football - BBC Sport", "title_page": "Everton news: Opinion - VAR is painful and not football - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The unbeaten run rolls on, but it was certainly a question of what could have been when the full-time whistle blew at Goodison Park on Saturday.\nEverton can certainly be blamed for throwing away what seemed a comfortable 2-0 lead to Manchester United, but we found ourselves discussing head-scratching officiating once again.\nAs a football fan, I get bored of constantly having to scrutinise officials and the impact of VAR on the modern game.\nIn its current guise, it is evaporating the soul of the sport.\nEvery time the ball hits the back of the net, that spontaneous eruption of joy is tempered upon the realisation that VAR could soon intervene. You find yourself holding back and never truly letting yourself enjoy the moment.\nWe saw it with Beto's goal in the first half. A prolonged stoppage for a razor-thin offside review.\nIt is painful. It is not progress. It is not football.\nFast forward to the awarding of a stoppage-time penalty after a clear shirt pull on Ashley Young and VAR once again proved how it simply is not used correctly by those at Stockley Park.\nThe famous words \"clear and obvious\" should be written on the walls of every control room within the now infamous VAR headquarters.\nTo even send the referee to the screen was baffling and totally unjustified.\nIt was at that point that I sat back down in my seat, knowing Andy Madley would not have the courage of his convictions to stick with his original decision.\nThe fall back of technology has muddied the waters. It creates doubt when it should create clarity. It interferes when it should stay quiet. It feels like an orchestrated soap opera.\nThe Premier League is on a one-way trip to driving supporters away from stadiums.", "url": "https://www.bbc.co.uk/sport/football/articles/c3rnqjww578o"}