{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:34:16", "date_modify": "2025-05-21 05:34:16", "date_publish": "2025-01-31 19:02:50", "description": "St Johnstone breakout star Makenzie Kirk 'playing with a lot of confidence' in survival fight", "filename": "sport_articles_cew5jzzjw75o_1747805656.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3e36/live/925c93e0-dfda-11ef-a819-277e390a7a08.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cew5jzzjw75o_1747805656.html", "title": "St Johnstone breakout star Makenzie Kirk 'playing with a lot of confidence' in survival fight", "title_page": "St Johnstone breakout star Makenzie Kirk 'playing with a lot of confidence' in survival fight - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Makenzie Kirk is relishing his breakthrough season at St Johnstone despite the pressure of a relegation fight.\nThe 20-year-old forward has netted seven goals this term and insists the mood in the squad is upbeat after Saints backed up the Scottish Cup win over Motherwell with a league triumph - their first in 10 games - over the Steelmen last weekend.\nThat has narrowed the gap at the bottom to seven points before Saturday's trip to face St Mirren.\nKirk said: \"It's really good for me, I'm really enjoying my football and I'm playing with a lot of confidence.\n\"The most important thing for us as a team is to win games and score goals and stay tight at the back and keep clean sheets.\n\"It's been positive over the last couple of weeks, the mood around the place has been really good.\n\"We know ourselves that the thing is to move on to the next game and stay together, keep picking up points and hopefully by the time the split comes we've narrowed the gap and we're back in among it.\n\"The boys who were here last year were involved in it and they know what it takes to get out of it.\n\"We've got a good team spirit and a togetherness to go and show what it takes and go and fight until the last game.\"", "url": "https://www.bbc.com/sport/articles/cew5jzzjw75o"}