{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:26:10", "date_modify": "2025-04-26 04:26:10", "date_publish": "2025-03-03 11:37:05", "description": "Fulham news: 'It's been the most magic season'", "filename": "sport_football_articles_cy05jdwn874o_1745641570.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/bc0b/live/f5d37cc0-f81e-11ef-8dde-aff9d405c81c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cy05jdwn874o_1745641570.html", "title": "Fulham news: 'It's been the most magic season'", "title_page": "Fulham news: 'It's been the most magic season' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Fulham fan Sammy James says the club's FA Cup penalty success against Manchester United was another \"magic\" moment in what has been the \"most magic season to be a Fulham fan\".\nSpeaking about the victory on BBC Radio 5 Live Breakfast, the host of the Fulhamish podcast said: \"It was so stressful - I've got one of those watches which tracks your heart rate and I looked at it afterwards and it reached 155 [bpm] - I might need to go see the doctor.\n\"It was worth it, the whole game put me through the ringer in the away end. I'd fully resigned myself to the fact we've lost to Manchester United in a lot of different ways over the years and we were going to add a penalty shootout to the list.\n\"Sometimes we struggle to manage the occasion but overall Fulham were the better team. They are a better football team than Manchester United at the moment.\n\"It's just about getting over the line and the demons of throwing it away two years ago at United can't be understated. To come over that and get past it was a huge sense of achievement.\"\nSpeaking about the the possibility of Marco Silva's side going even further in the competition, James added: \"There are four teams that have never won the FA Cup. I'm really happy Fulham are in that mix.\n\"If you'd have offered me at the beginning of the season a last-eight tie at Crystal Palace for the chance of a trip to Wembley I'd have definitely taken that.\n\"It's exciting the fact that the usual big-hitters aren't there. There is a team like Fulham that are probably at least going to get to a final.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cy05jdwn874o"}