{"authors": ["Nick Mashiter", "www.facebook.com"], "date_download": "2025-05-21 04:16:10", "date_modify": "2025-05-21 04:16:10", "date_publish": "2025-04-05 18:26:52", "description": "Ipswich are teetering on the brink. With seven games remaining and 12 points adrift of safety, their relegation battle looks over.", "filename": "sport_football_articles_cd6j01723jzo_1747800970.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d725/live/fe1f8c60-1241-11f0-9d46-3377f28968f3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cd6j01723jzo_1747800970.html", "title": "Ipswich Town: Boss Kieran McKenna says club's Premier League future looks bleak", "title_page": "Ipswich Town: Boss Kieran McKenna says club's Premier League future looks bleak - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ipswich are teetering on the brink. With seven games left and 12 points to make up on fourth-bottom Wolves, the battle to stay up looks over.\nJorgen Strand Larsen's scrappy 84th-minute goal settled a tense encounter between the two relegation rivals after Pablo Sarabia had cancelled out a Town opener from Liam Delap.\nDefeat pushed the Tractor Boys closer to the drop in a game they simply had to win. Their fairytale rise from League One to the top flight in successive seasons looks certain to end with an immediate return to the Championship.\nWolves' comeback success at Portman Road crucially stretched them further clear of the bottom three and even Ipswich boss Kieran McKenna conceded their fight for survival looks bleak.\n\"I think it's certainly more than likely on the balance of probabilities,\" he said when asked about the prospect of relegation. \"Not that I don't think we can't finish the season strongly, but Wolves are a strong side and the chance of them losing all their games is really low.\n\"The likelihood is we'll fall short of our ultimate dream.\"\nWhen Ipswich won 2-1 at Wolves in December through Jack Taylor's last-gasp header - which ended Gary O'Neil's managerial reign at Molineux - they moved three points above Wolves.\nTown were still third bottom at the time, but just a point behind Crystal Palace, while second-bottom Wolves were four adrift of safety.\nFast forward five months and defeat at Portman Road leaves them needing one of the greatest of escapes.\nThe biggest deficit overcome by a side to stay up after 30 matches of a Premier League season was West Ham United in 2006-07.\nAt that stage, Alan Curbishley's men were eight points from safety, having been 10 behind a match earlier. Ipswich have a game less and a bigger gap.\nBradford City, in 1999-2000, and Fulham, in 2007-08, came from six points behind to survive with just five matches left, but it seems fanciful for the Tractor Boys to think of achieving that.\nJust seven of their 20 points have been won in Suffolk this season, a huge Achilles heel for a newly promoted side. Just one victory - 2-0 against Chelsea in December - has been celebrated at Portman Road and they have now lost six successive home league games for only the second time in their history, matching a wretched run in 1963 when they went on to be relegated too.\nLeicester have won nine points at home, while bottom club Southampton's sorry season is epitomised by the five points they have earned at St Mary's and they will be relegated if they fail to win at Tottenham on Sunday.\n\"You can look at different games, Liverpool, Fulham, [Aston] Villa we started really well, then came up short in terms of trying to break teams down, like the Crystal Palace game,\" reflected McKenna.\n\"We have had a few high energy games and the other teams have punished us. Today it was a spirited and committed performance but not enough to win. We are talking about small sample sizes.\n\"It's strange not to have more wins at home than away. I don't think there's one outstanding reason. If there was, we would have found it and sorted it.\"\nIn contrast, Wolves have earned 10 points from their seven home games since Vitor Pereira replaced O'Neil in December.\nUnder the Portuguese, Wolves have won more points than the three promoted sides put together - 23 from 15 games, scoring 19 goals and conceding 19.\nThe bottom three have won 16 points from a combined 43 games in that time (Ipswich eight, Southampton five and Leicester three).\nNo side has dropped more points from winning positions in the top flight this season than Ipswich (25) and they have simply not been competitive enough.\nThey have led against Fulham (twice), Manchester City, Aston Villa,(twice), Brentford, Leicester, Bournemouth, Manchester United and now Wolves and failed to win.\nEven Liam Delap's 12 goals have been unable to help them bridge the gap at this level. He has scored 38.71% of Ipswich's 31 this season - only Alexander Isak (41%), Mohamed Salah (39%) and Erling Haaland (36.8%) have higher figures in this campaign.\n\"There will be plenty of time to talk about it, analyse it and reflect on the positives and negatives,\" added McKenna.\n\"We knew coming into this nine-game block the balance of probabilities was really small, but we committed as a group to show the right values and show full commitment.\n\"We have Chelsea at Stamford Bridge, Arsenal here after that, Newcastle at St James' Park and Everton in one of the last games at Goodison.\n\"We have some fantastic fixtures coming up for a club who haven't been into the Premier League for 22 years.\n\"I know today is a big setback and it hurts, but I know the players and supporters and everyone are going to muster up the energy to compete as well as we can in the last few games.\"", "url": "https://www.bbc.com/sport/football/articles/cd6j01723jzo"}