{"authors": ["Adam Oxley", "www.facebook.com"], "date_download": "2025-05-21 05:25:53", "date_modify": "2025-05-21 05:25:53", "date_publish": "2025-04-03 11:53:02", "description": "BBC Radio Sheffield's Adam Oxley evaluates whether Rhian Brewster has done enough to extend his stay with the Blades.", "filename": "sport_football_articles_cgrg0kl72yjo_1747805153.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5066/live/834682e0-1080-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cgrg0kl72yjo_1747805153.html", "title": "BBC Radio Sheffield's Adam Oxley thinks Rhian Brewster should be given a new deal", "title_page": "BBC Radio Sheffield's Adam Oxley thinks Rhian Brewster should be given a new deal - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Scoring the winning goal in a Steel City derby guarantees anyone a place in Sheffield football folklore, and striker Rhian Brewster is the latest player to join that exclusive club.\nSheffield United's club-record signing followed his winner at Hillsborough with the clinching goal against in-form Coventry City to take the Blades top of the Championship after the international break, with just seven games left to play.\nIt was Brewster's first goal at Bramall Lane in over three years, and it took his tally in red and white to just nine goals since making a £23.5 million move from Liverpool in October 2020.\nA lot of pressure was heaped on the then 20-year-old's shoulders as Sheffield United sought a third season in the Premier League but Brewster failed to score in 27 league appearances and the club was relegated.\nWhat followed was a string of serious injuries, limiting the England youth international to few appearances over the next three seasons as the Blades yo-yoed between the second tier and the top flight, before last summer brought a fresh start for both club and player.\nBrewster has not been a regular starter this season but the Coventry City match was his 30th league appearance, the most he has managed in a single campaign during his near five-year stay at Bramall Lane.\nThe now 25-year-old has not just managed to stay fit for the majority of this season, but he's finally finding the back of the net and providing assists from an attacking-midfield role in the 4-2-3-1 formation introduced by manager Chris Wilder last summer.\nThe big question now surrounds Brewster's future, and opinions are split about a new deal with his current contract about to end.\nSlow burn is an understatement when describing Brewster's Sheffield United career, some have even described it as a disaster given the significant sum the club paid for his services, so has he finally, eventually done enough to extend his stay?\nIt would be easy for the Blades to cut their losses this summer, given the forward's injury record and poor goals return over time, but I'd be tempted to offer him at least another year at the club, either as a Premier League or a Championship player.\nBrewster is well liked in the United dressing room by players and staff, and having invested so much time, money and effort in his development, it could be a real kick in the teeth if he finally delivers on his enormous promise, but with another club.", "url": "https://www.bbc.com/sport/football/articles/cgrg0kl72yjo"}