{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:23:40", "date_modify": "2025-04-26 04:23:40", "date_publish": "2025-03-03 13:06:33", "description": "Fulham condemn the \"abhorrent\" racist and homophobic online abuse directed at defender Calvin Bassey following Sunday's FA Cup penalty shootout win at Manchester United.", "filename": "sport_football_articles_cq8y5wl0kw8o_1745641420.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ecf7/live/90ab6ad0-f82b-11ef-a8b4-b37546a32a57.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cq8y5wl0kw8o_1745641420.html", "title": "Fulham condemn 'abhorrent' Calvin Bassey racist and homophobic abuse", "title_page": "Fulham condemn 'abhorrent' Calvin Bassey racist and homophobic abuse - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Fulham have condemned the \"abhorrent\" racist and homophobic online abuse directed at defender Calvin Bassey following Sunday's FA Cup penalty shootout win at Manchester United.\nNigeria defender Bassey, who scored the opening goal at Old Trafford, shared some examples of the unsavoury abuse he had received on social media.\n\"We strongly condemn this abhorrent behaviour which has no place in football or society,\" Fulham said in a statement.\n\"Such actions are entirely unacceptable, and we stand in full support of Calvin Bassey, who will continue to receive our full backing.\n\"We will do everything in our power to work with the relevant authorities in identifying the perpetrators of these vile messages and taking the strongest form of action against them.\"\nIn a statement, the Premier League said that it is \"appalled by the abuse\" and that it will offer \"our full support to Calvin and the club\".\nIt added: \"We work with social media companies and authorities to help ensure any individuals found guilty of discrimination face the strongest possible consequences.\"\nBassey's online abuse follows recent cases involving Everton midfielder Abdoulaye Doucoure, England defender Kyle Walker, Newcastle United's Joe Willock and Manchester City's Khadija Shaw.\nIn a recent interview with BBC Sport, Samuel Okafor, chief executive of anti-discrimination body Kick It Out (KIO), said the level of abuse in English football had \"reached crisis point\".\nBassey's goal was cancelled out in the second half by Bruno Fernandes, with the game staying level at 1-1 at the end of 90 minutes and extra time.\nVictor Lindelof and Joshua Zirkzee missed for United in the shootout to send the Cottagers into the quarter-finals, where they will host Crystal Palace at Craven Cottage.", "url": "https://www.bbc.co.uk/sport/football/articles/cq8y5wl0kw8o"}