{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:16:41", "date_modify": "2025-05-21 07:16:41", "date_publish": "2025-05-20 10:32:12", "description": "Chinese schoolgirl Yu Zidi sets fastest time ever for a 12-year-old in the 200m individual medley.", "filename": "sport_swimming_articles_czell3enx0wo_1747811801.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/58b4/live/1b23c000-3557-11f0-b7a7-db7402bc2830.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_swimming_articles_czell3enx0wo_1747811801.html", "title": "Yu Zidi: Chinese schoolgirl, 12, sets 200m age record at China national championships", "title_page": "Yu Zidi: Chinese schoolgirl, 12, sets 200m age record at China national championships - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Chinese schoolgirl Yu Zidi has been hailed a \"sensation\" after setting the fastest time ever for a 12-year-old in the 200m individual medley at China's national championships.\nYu finished second in the event with a time of two minutes and 10.63 seconds, behind 2024 Olympic finalist Yu Yuting.\nThe time, if achieved in the heats at last year's Paris Olympics, would have resulted in the youngster reaching the semi-finals.\nGlobal governing body World Aquatics posted \"12-year-old sensation alert\" on its official X account.\nYu, who turns 13 in October, could earn a place in China's national squad for the World Championships in Singapore in July.\nThe performance of elite Chinese swimmers has been in the spotlight since before the Paris Olympics.\nChina selected 11 athletes for the Games in France from a group of 23 that had returned positive doping tests.\nAs a result of the positives, the International Testing Agency (ITA) committed to testing Chinese athletes eight times - twice as often as standard - between the start of 2024 and the Games in Paris.\nAfter finishing fourth in the 4x100m relay with Great Britain, Adam Peaty questioned China's victory, saying: \"There's no point winning if you're not winning fair.\"\nTwo of the four gold medallists, Qin Haiyang and Sun Jiajun, were among the 23 Chinese swimmers who returned positive doping tests prior to the Tokyo Olympics.\nThe China Anti-Doping Agency said the swimmers who failed tests before Paris 2024 had unintentionally ingested heart medication trimetazidine, and foreign ministry spokesman Lin Jian said the country \"consistently adhered to the firm stance of zero tolerance for doping\".", "url": "https://www.bbc.com/sport/swimming/articles/czell3enx0wo"}