{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:48:12", "date_modify": "2025-05-21 03:48:12", "date_publish": "2025-04-07 12:29:51", "description": "BBC Sport analyst Philly McMahon says Derry have a lot of questions to answer after they followed up their relegation from Football League Division One with a defeat by Donegal in their Ulster SFC preliminary round tie.", "filename": "sport_articles_c62zk3kygz9o_1747799292.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f44b/live/4270b470-1396-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c62zk3kygz9o_1747799292.html", "title": "Ulster Championship: 'A lot of questions to be answered' for Derry", "title_page": "Ulster Championship: 'A lot of questions to be answered' for Derry - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "BBC Sport NI analyst Philly McMahon says there are \"a lot of questions to be answered\" for Derry after their 1-25 to 1-15 defeat by Donegal in their opening Ulster SFC encounter at Ballybofey.\nThe eight-time All-Ireland winner with Dublin told the BBC's GAA Social podcast he believes the Oak Leafers' relatively late appointment of Paddy Tally as their new boss in November may have put them on the back foot.\nDerry were relegated from Division One last month after picking up just a single point from their seven Football League outings.\n\"They had a slow start to the season with being back so late with Paddy Tally and his management team so that's quite difficult for them to get going,\" said McMahon.\n\"That probably fed into their league campaign. I think they had shown good spells in the league. They could have got a couple more points on the board but that has bled into today's [Sunday's] game.\n\"There was one team that was showing confidence and another that is showing under-confidence, under-performance. How they get it together now over the next few weeks is going to be important for them.\n\"There are a lot of questions to be answered and they'll have time to build on things.\"\nMcMahon believes the fact that Brendan Rogers was Derry's standout player was both a positive and a negative.\n\"They're trying to get results and performances but sometimes that can be counter-productive because you do your own thing or you don't do what you should be doing.\n\"You look at [Brendan] Rogers and for me he was the only player who was giving it to Donegal as much as he could.\n\"That's a good thing and a bad thing. When you see someone standing out like that it's like 'what's their system, what's their structure?'\n\"The one thing I'd have questioned going away from today, 'Did they have a plan? If they stuck to that plan and they lost then their standards weren't high enough, but if they went out and didn't stick to their strategy or their gameplan then why did they not?\"", "url": "https://www.bbc.com/sport/articles/c62zk3kygz9o"}