{"authors": ["Michael Emons", "www.facebook.com"], "date_download": "2025-05-21 05:44:36", "date_modify": "2025-05-21 05:44:36", "date_publish": "2025-04-02 22:38:22", "description": "Ipswich Town finally secure their first league win of 2025, with boss Kieran McKenna rightly delighted with a superb team performance that sees them grind out a 2-1 victory at Bournemouth.", "filename": "sport_football_articles_cn0w1r5dj72o_1747806276.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/41b0/live/38e0c3d0-1014-11f0-992e-13a2fb1a4046.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cn0w1r5dj72o_1747806276.html", "title": "Bournemouth 1-2 Ipswich: Resilient Town get much-needed victory", "title_page": "Bournemouth 1-2 Ipswich: Resilient Town get much-needed victory - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ipswich Town finally secured their first league win of 2025, with boss Kieran McKenna rightly delighted with a fantastic team performance that saw them grind out a 2-1 victory at Bournemouth.\nTown had thrown away a 1-0 lead against the Cherries at Portman Road in December and at 2-1 with half an hour to go and Bournemouth pushing for an equaliser, Ipswich fans would have been fearing another late collapse.\nBut it did not happen as Ipswich, led by Dara O'Shea and superbly assisted by Cameron Burgess and Axel Tuanzebe, defended superbly to hold on to the three points.\n\"We have been waiting a while for a win and in this league that's what can happen,\" said McKenna. \"There's still belief, a lot of togetherness and you can see that as a team so it was a good night for us.\n\"We're coming into the last quarter of the season and we want to finish off the season well and make it our best quarter and get as many points as we can and where that leaves us, let's see.\"\n\"I'm really proud and there is a little bit of relief after the last 10 minutes. Really proud of the performance in terms of how hard we worked, the two goals we scored, the result and what we showed defensively.\"\nIpswich are nine points adrift of 17th-placed Wolves, who they entertain on Saturday, with the Town supporters having just a tiny bit of hope of a miraculous recovery.", "url": "https://www.bbc.com/sport/football/articles/cn0w1r5dj72o"}