{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:13:32", "date_modify": "2025-04-26 06:13:32", "date_publish": "2025-03-05 00:00:00", "description": "Chelsea move eight points clear at the top of the Women's Super League with a nervy victory over Leicester City at Kingsmeadow.", "filename": "sport_football_live_c2d4e42rprlt_1745648012.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f14a/live/5e160f30-fa01-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_c2d4e42rprlt_1745648012.html", "title": "Chelsea 3-1 Leicester: Blues move eight points clear of Manchester United at top of WSL", "title_page": "Chelsea 3-1 Leicester: Blues move eight points clear of Manchester United at top of WSL - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Chelsea moved eight points clear at the top of the Women's Super League with a nervy victory over Leicester City at Kingsmeadow.\nLeicester came into the game as one of only two sides, alongside Brighton last Sunday, to take points off Chelsea this season and again caused problems for Sonia Bompastor's team.\nChelsea went ahead early on when Catarina Macario's deflected free-kick looped over Janina Leitzig but from there they were restricted well by an organised Leicester.\nThat was in part due to the impressive tenacity of England midfielder Ruby Mace, but she was stretchered off late in the first half with a knee injury after overextending in a tackle.\nThe 21-year-old was seen on the pitch after the full-time whistle with crutches and a brace on her right knee.\nChelsea capitalised on Leicester having to reorganise and doubled their advantage early in the second half when England forward Aggie Beever-Jones latched on to a Mayra Ramirez backheel to slot past Leitzig from close range.\nHowever, Leicester responded four minutes later when Japan forward Nicole Momiki superbly dinked over the onrushing Hannah Hampton for her second WSL goal of the season.\nBompastor kicked a chair in anger after the goal and the former Lyon boss made three changes that brought an increased energy and tempo from her side.\nScotland midfielder Erin Cuthbert struck the bar from range but the Blues were also guilty of spurning a number of opportunities.\nThey were almost made to pay when Janice Cayman was put through on goal. but she was forced wide and Hampton was able to push away from effort.\nHowever, Cuthbert sealed the win late on when she curled round a defender and into the far corner from outside the area.\n\"This result means a lot,\" Bompastor told Sky Sports. \"When you just dropped points it's really important to win the game after and the reaction was good from my players, but I was expecting that.\"\nChelsea move eight points clear of Manchester United, albeit having played an extra game, and know that 14 points from their final six games would secure a sixth successive WSL title and their first under Bompastor.\nLeicester remain 10th, six points clear of Crystal Palace in the relegation spot.\nThe win continues Chelsea's march towards a quadruple but will act as a reminder of the significant hurdles they will face along the way.\nBompastor made five changes from Sunday's 2-2 draw at Brighton - with world record signing Naomi Girma missing out through injury.\nThey were disjointed for much of the first half, with Ramirez firing wide from inside the area their only real open-play chance of note.\nLeicester's goal seemed to be a wake-up call for the Blues and they were much improved after that with Japan's Maika Hamano firing wide with efforts from inside and outside the area.\nIn truth, it never really felt like Leicester were going to force an equaliser before Cuthbert superbly found the bottom corner for her third league goal of the campaign to further highlight the unrivalled strength in depth that Chelsea have at their disposal.\nBompastor admitted pre-match that the changes were with one eye on what is it to come in March for Chelsea as they host Crystal Palace in the FA Cup quarter-finals on Sunday, before four successive games against Manchester City in the League Cup final, Champions League last eight and WSL.\nWhile Manchester City are far from their fluent best at the moment, Chelsea will have to improve if they are to remain in the hunt for four trophies in three weeks' time.\n\"We have been rotating the squad a lot and sometimes we are less fluid than in the beginning of the season,\" Bompastor told Sky Sports.\n\"We've missed a little bit of chemistry at times in the team.\n\"I'm not too worried, I know the quality of my squad and the talent in my team.\"\nFor Leicester, this was an encouraging display, but their issues in front of goal remain a problem and they have picked up just two points on the road this season.\nThey have scored a league-low 10 goals in 16 games and while they were organised and restricted Chelsea for large parts of the games, they struggled to create many clear-cut opportunities.", "url": "https://www.bbc.co.uk/sport/football/live/c2d4e42rprlt"}