{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:39:22", "date_modify": "2025-04-26 07:39:22", "date_publish": "2025-02-27 13:16:11", "description": "Conor Murray says he will be \"sad, emotional and grateful\" when he brings the curtain down on his Ireland career after the Six Nations.", "filename": "sport_rugby-union_articles_cgj55g14512o_1745653162.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ca6a/live/f08fe6f0-f50c-11ef-a276-596f7e6218f8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_cgj55g14512o_1745653162.html", "title": "Irish Rugby: 'Sad, emotional, grateful'", "title_page": "Irish Rugby: 'Sad, emotional, grateful' - Conor Murray on Ireland retirement - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Conor Murray spoke to reporters on Thursday following confirmation that he will retire from Ireland duty at the end of the Six Nations.\nFive-time Six Nations winners Murray, Peter O'Mahony and Cian Healy will all end their Test careers after Ireland's game against Italy in Rome on 15 March.\n\"[It was] a very difficult decision,\" Murray told reporters on Thursday.\n\"Particularly to leave a group like this. The thing I'll be most jealous of is that this group will continue on and be successful, but personally, it's a hard decision to make. It's been in my head for a while and it just feels right.\n\"I've been lucky and grateful to be part of this Irish set-up. It's sad, it'll be emotional but I've seen so many players not get to end it on their terms, career cut short.\n\"The fact I get to do it on my own terms when I'm fit and healthy is something very few people get to do, so I'm very grateful.\"\nWhile O'Mahony and Healy will retire from rugby at the end of the season, Murray will continue his playing career abroad when his Munster deal expires this summer.\n\"Nothing,\" Murray smiled when asked what he could disclose about the move.\n\"We'll see in terms of playing, I'll play another year somewhere for my family, they've been incredible, my wife Joanna and my son Alfie, especially Joanna over the last few years, the sacrifices she's made.\n\"As a family, we'll go away and maybe do something for a year and enjoy ourselves for a lifestyle change. Body wise, I still feel great, I still feel I can play rugby at a high level.\n\"Nothing is set in stone yet but it'll be nice for us, let the dust settle on retiring in this country and go away and have an experience and come back to the real world then.\"", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/cgj55g14512o"}