{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:38:09", "date_modify": "2025-04-26 06:38:09", "date_publish": "2025-02-26 06:21:44", "description": "Cardiff City: Omer Riza happy to 'deflate' relegation rivals Hull", "filename": "sport_football_articles_c2ergneezpeo_1745649489.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/899a/live/7f52bb90-f3c5-11ef-9843-25877e801f1e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c2ergneezpeo_1745649489.html", "title": "Riza happy to 'deflate' relegation rivals Hull", "title_page": "Cardiff City: Omer Riza happy to 'deflate' relegation rivals Hull - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Cardiff City manager Omer Riza was glad to leave Hull City \"deflated\" after his team's crucial win over their Championship relegation rivals.\nCardiff ground out a 1-0 win on Tuesday to overtake their opponents and climb up to 19th place in the table, overtaking the Tigers to move six points clear of the bottom three.\nThe fact that Hull dropped down to 21st position – just three points above the drop zone – added to the Bluebirds' celebrations as they stole a march in the race for survival.\n\"The amount of psychological blows we've had against teams over the last couple of months and we've still managed to go to Middlesbrough and get a draw, go to Watford and win,\" said Riza.\n\"You could see how deflated they were when we scored the goal because they needed two to win the game.\n\"They still kept going, probing, but it's always hard when you're 1-0 down, it's deflating for them. I think that was a really good, really important three points for us.\"\nCardiff were not at their best against Hull but winning in those circumstances was pleasing in its own way for Riza, whose side have often failed to get the results that their better performances have warranted this season.\n\"I don't think we played well. We did what we needed to do, that's important, we showed that resilience and that togetherness,\" Riza added.\n\"They didn't cause too many problems, but I'm just happy to grind out a result and an important three points.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c2ergneezpeo"}