{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:31:32", "date_modify": "2025-04-26 06:31:32", "date_publish": "2025-02-27 00:00:00", "description": "Pakistan face Bangladesh in the Champions in Rawalpindi - follow live cricket scores, text updates, in-play video clips and radio commentary", "filename": "sport_cricket_live_c2l02jnl2eyt_1745649092.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9ec0/live/6dad4670-f4f2-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_cricket_live_c2l02jnl2eyt_1745649092.html", "title": "Champions Trophy LIVE: Pakistan vs Bangladesh, Rawalpindi", "title_page": "Champions Trophy LIVE: Pakistan vs Bangladesh, Rawalpindi – cricket score, radio commentary, video highlights & updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "That's all from us\nThat's it from us on a day where not a single ball was bowled and the 2025 Champions Trophy campaigns of Pakistan and Bangladesh ended without much to look back on.\nThank you for stopping by this morning.\nWe will be back tomorrow morning for live commentary of the final Group A match in a battle for top spot between India and New Zealand.\nGoodbye!\nMatch abandoned\nThere we have it. The match has been abandoned without a ball bowled.\nIt means Bangladesh and Pakistan have been given a point each, although both sides had already been eliminated from the Champions Trophy before today.\nPost\nWe would have loved to have given you an update that involved news of improved weather and a dry outfield.\nSadly, neither of those statements are true.\nThe rain is continuing at a heavy rate and there are large puddles on the outfield.\nA few minutes ago, some match officials went out for a wonder and every step was met with a puddle.\nI'd be baffled if this goes on for much longer without being abandoned.\nThe rain continues\nThe latest news from Rawalpindi is that is still raining quite heavily and we await an official update of some description.\nWe will be back every 15 minutes or so from here while we await any official news from Rawalpindi.\nPost\nAlex Hartley\nFormer England bowler on BBC Radio 5 Sports Extra\nThere's so many talented players, Jamie Smith, Jacob Bethell, maybe Dan Mousley could get a go. There are good players in England, there's just something going wrong in that dressing room, maybe it's the captain. I don't think that he's the right person to take this team forward.\nPost\nDaniel Norcross\nTest Match Special commentator on BBC Radio 5 Sports Extra\nIt isn't immediately clear to me how England can turn this around. The balance of the team isn't right. When Jamie Overton comes in at seven, he didn't even come in at seven for Surrey. There's a lot of inexperienced players on the side and a lack of experience at the top of the order. If we look at New Zealand or England, they are experienced teams.\nLatest from Rawalpindi\nCurrently, it is raining very heavily in Rawalpindi.\nThe chances of getting play at some point are fading with each passing minute.\nWe haven't seen any sign of an inspection or any match officials for a while now.\nStill, there are a group of around 50 supporters waving at the television cameras and keeping in good spirits.\nPost\nDaniel Norcross\nTest Match Special commentator on BBC Radio 5 Sports Extra\nThe England Test team are well set up, they are pretty much set for purpose. The ODI team aren't and they won't admit it. Instead of acknowledging that there are issues with the ODI side, they just make out that there isn't a problem. We're not stupid, we can see how other teams set up, so don't tell us it's a great team. There's good players, but it's not a good 11 that can compete against the best in the world.\nPost\nDaniel Norcross\nTest Match Special commentator on BBC Radio 5 Sports Extra\nI think it has to be Harry Brook because who else can it be. Other players are either too old or don't have a guaranteed spot on the team.\nPost\nAatif Nawaz\nBBC Test Match Special commentator on on BBC Radio 5 Sports Extra\nThere's so much pride amongst other countries. The players are proud to represent their country, they are proud to wear the crest on their chest. This is something that's really lacking in this team, there's a disconnect. Where's the pride? Where are the signs that we're devastated to lose? Don't smile, don't laugh, have some emotion that you've just lost the game.\nPost\nWe're yet to get an official update, but the latest pictures from Rawalpindi show plenty of rain, puddles on the covers and supporters in the stands sat under umbrellas.\nA couple of Pakistan's players are walking around with the umpires on the outfields in good spirits, but that is about as good as it gets right now.\nThere's also a group of fans sat under one big blanket, with only their trainers and a '6' banner poking out.\nWe will bring more updates as and when we get them.\nPost\nDaniel Norcross\nTest Match Special commentator on BBC Radio 5 Sports Extra\nThe other one that sent me around the bend was 'We're out here to make some memories with our friends'. You're not, you're a professional sports person and you're there making horrible memories for a large group of people.\nIt's a little bit condescending.\nPost\nAlex Hartley\nFormer England bowler on BBC Radio 5 Sports Extra\nThe arrogance of the England teams irritates me. They say we don't care about the result and we want to entertain but people don't want to come and watch you if you lose all the time.\nPost\nAatif Nawaz\nBBC Test Match Special commentator on on BBC Radio 5 Sports Extra\nMany times England were in a winning position but some of the shot selection was maddening. You were pulling your hair out because there was so many options and they settle for the worst stroke every time.\nThe weight of this captaincy is affecting Jos Buttler too much. We see him in the IPL hitting hundred after hundred but he can't perform for England.", "url": "https://www.bbc.co.uk/sport/cricket/live/c2l02jnl2eyt"}