{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:19:29", "date_modify": "2025-05-21 04:19:29", "date_publish": "2025-04-05 15:52:38", "description": "World number one Jannik Sinner says his three-month doping ban from tennis is \"unfair\" and maintained he is \"innocent\".", "filename": "sport_tennis_articles_ce3vl8nz9leo_1747801169.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/125c/live/dc8bf240-122e-11f0-a820-05f89b05038b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_tennis_articles_ce3vl8nz9leo_1747801169.html", "title": "Jannik Sinner: Italian says Wada doping ban is 'unfair' and maintains he is 'innocent'", "title_page": "Jannik Sinner: Italian says Wada doping ban is 'unfair' and maintains he is 'innocent' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "World number one Jannik Sinner says his three-month doping ban from tennis is \"unfair\" and maintained he is \"innocent\".\nThe 23-year-old Italian accepted a ban in February after reaching a settlement with the World Anti-Doping Agency (Wada) over his two positive drugs tests last year.\nWada acknowledged Sinner did not gain any competitive advantage from the banned substance, and that he bore no fault for an accidental contamination.\nSinner, who won the Australian Open earlier this year, was handed a suspension from 9 February until 4 May.\nHe will be eligible to play at the French Open - the next Grand Slam of the year - which starts on 19 May.\nIn an interview with Sky Sports on Saturday, Sinner said he accepted the ban, even though he \"wasn't really in agreement\" because he had to \"choose the least worst option\".\n\"What I've been through is a bit unfair but if we look at the situation it could have gone a lot worse,\" said Sinner, who was speaking in his first interview since the ban.\n\"After we made the decision it took me a bit of time to refind my feet. I know what happened and I know that I'm innocent.\"\nDespite being off the courts since he won the Australian Open earlier this year, Sinner is still top of the ATP Tour's world rankings with Carlos Alcaraz and Alexander Zverev unable to capitalise on his absence.\nThe three-time Grand Slam champion is set to make his competitive return on clay at the Rome Masters, which gets underway on 7 May.\nSinner said he \"cannot wait to start playing again\" but admitted there will be some trepidation about his comeback.\n\"I don't know what might happen,\" he added, when asked how he thought his fellow players will react to his return.\n\"It will be difficult making a comeback with so much attention on me.\n\"The people I have around me, not just my team but my family and friends, the people I'm closest to, have no doubts about what the truth is.\"", "url": "https://www.bbc.com/sport/tennis/articles/ce3vl8nz9leo"}