{"authors": ["Craig Nelson", "www.facebook.com"], "date_download": "2025-05-21 06:23:30", "date_modify": "2025-05-21 06:23:30", "date_publish": "2025-03-31 13:33:39", "description": "British freeride snowboarder Cody Bramwell on living life on the edge, winning Xtreme Verbier and his Olympic dream.", "filename": "sport_articles_cge1erdlexdo_1747808610.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/531a/live/299d1030-0cd2-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cge1erdlexdo_1747808610.html", "title": "Cody Bramwell: British freeride snowboarder on winning Xtreme Verbier", "title_page": "Cody Bramwell: British freeride snowboarder on winning Xtreme Verbier - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "As Cody Bramwell balanced on the summit of the Kakhiani mountain face in Georgia, it was not just the edge of his snowboard that was teetering over the precipice - his life's dream was too.\nThe 30-year-old feared this could be his last chance to make it back to the top of his chosen sport of freeriding, after a season out with injury and subsequent poor form had put the brakes on a promising career.\nWith plans taking shape to include the daredevil discipline in the Winter Olympics in 2030, he knew this would be the perfect time to make his mark in a sport that rewards those who take the biggest risks.\nUntil recently, Bramwell had been one of the rising stars of freeriding - which combines the thrills and spills of freestyle skiing and snowboarding with the freedom of off-piste riding, with competitors judged on the tricks they pull and the difficulty of the route they take down a sheer, rocky mountainside.\nBut for the Swedish-born snowboarder, who has an English father and has chosen to compete for Great Britain, his career now looked to be fading fast.\nAfter being given a wildcard to compete this season on the Freeride World Tour (FWT), Bramwell crashed out of the opening three events and was facing relegation from the top-tier as he prepared to \"drop in\" for his fourth run in Georgia.\n\"I was so down and disappointed and kind of thought 'oh well, my career is over I guess',\" he said.\n\"It was going to be so hard to make it back from last place. So I just decided to go in, have fun and enjoy it, as this might be one of my last competitions.\"\nBramwell was bottom of the overall standings with two events of the regular season remaining - only the top 60% of the field would make it through to the FWT final in the Swiss resort of Verbier and retain their pro licence for the 2025-26 season.\nHe claimed successive overall third-place finishes in 2021 and 2022, but had struggled since missing the 2023 campaign with a broken ankle and looked set to lose his place in the FWT top tier for what promises to be a transformative year for the sport.\nThe tour is joining forces with the International Ski and Snowboard Federation (FIS), which runs the World Cup programmes in alpine skiing, as well as freestyle skiing and snowboarding.\nDevelopments planned for 2026 include the first Freeriding World Championships, while an application will be submitted to the International Olympic Committee today (Monday, 31 March) to request inclusion in the 2030 Winter Games in France.\nBramwell faced the prospect of missing out on the wealth of opportunities about to open up to the top riders, but he still had one more chance to redeem himself - and this time his stars aligned.\nThrowing caution to the wind, he aced his run in Georgia to claim just the second win of his career and first in five years. A second-placed finish in the next event in Austria saw him jump to third place in the overall standings and qualify for the tour final.\nEven better was to come in the sport's spiritual home of Verbier, where Bramwell produced a jaw-dropping run to win FWT's blue-riband event.\n\"I guess I just earned so much confidence from that win in Georgia,\" he explained.\n\"Every time I am up at the start I am asking myself 'what am I doing here?'.\n\"Standing at the start gate is stressful, but as soon as you drop in I am like 'OK, this is what I love to do'.\n\"But for the final, I was the least nervous, I would say, because I had already saved my snowboarding career for at least another 12 months.\"\nWith the shackles off, Bramwell began his descent of Verbier's Bec des Rosses with an audacious backflip over an exposed rocky outcrop, then navigated a breakneck passage through a narrow gully, hurtling through a cascading shower of falling snow before ending with a soaring 360-degree jump.\nJudges score each competitor on the difficulty of the line they choose down the mountain, the fluidity, control and technique shown in their run and the style of their jumps, as well as the amount of time they spend in the air.\nBramwell claimed victory in Verbier with an impressive score of 92.67 out of 100, and moved from rock bottom after three events to finish the season in second place overall.\n\"Winning the whole tour would have been amazing, but at least now we have some more chances,\" added Bramwell. \"The Xtreme Verbier is the most legendary freeride competition, so to win that for the first time is the biggest dream ever.\"\nThe Briton is now looking forward to a much brighter future, and the potential to one day step on to an Olympic podium.\nThat possibility is by no means assured, but FIS told BBC Sport that it was finalising documents to put forward freeride as an Olympic discipline for the 2030 Winter Games, with the International Olympic Committee due to make a decision in December.\nFIS secretary general Michel Vion said: \"From FIS' standpoint, freeride clearly meets all the evaluation criteria, including a strong position on promoting sustainability and environmental responsibility. Freeride is ready to bring value to the Olympic movement.\"\nBramwell was born in Sweden and grew up in the mountain resort of Are with Swedish mother Anneli Stridsberg and English father Peter Bramwell, who was originally from Norwich.\nHe switched to represent Britain in 2021 and says he would love to one day compete in the Olympics in GB colours.\n\"To be an Olympian would be the craziest dream ever, that would be so cool,\" added Bramwell.\n\"My goal is the Olympics, but there is a lot going on in this sport and I just want to be along for the ride.\"", "url": "https://www.bbc.com/sport/articles/cge1erdlexdo"}