{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:41:11", "date_modify": "2025-05-21 04:41:11", "date_publish": "2025-01-23 14:59:14", "description": "Burnley midfielders Zian Flemming and Josh Laurent both score twice to help the Clarets thrash basement dwellers Plymouth Argyle 5-0.", "filename": "sport_football_articles_cjw4qj4qp7no_1747802471.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/bb60/live/84c989a0-d97b-11ef-a37f-eba91255dc3d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cjw4qj4qp7no_1747802471.html", "title": "Burnley: Zian Flemming and Josh Laurent on 5-0 win at Plymouth", "title_page": "Burnley: Zian Flemming and Josh Laurent on 5-0 win at Plymouth - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Burnley midfielders Zian Flemming and Josh Laurent both scored twice to help the Clarets to a thumping 5-0 thrashing of basement dwellers Plymouth Argyle.\nOf the top four Championship clubs, Burnley have the lowest tally of goals with 36, while league leaders Leeds United have scored the most with 53.\nBut the win over Argyle was the second time they have managed five goals in a match this season, having beaten Cardiff City by the same score in August.\n\"It's lovely to get so many goals on the scoresheet, that's something we've lacked a little bit this season,\" Flemming told BBC Radio Lancashire after the match.\n\"It's something that we knew that we can do but it's obviously nice that it happened tonight.\"\nLaurent's double also marked the 29-year-old's first goals for the club since arriving from Stoke City in August.\nFor the Englishman, it has been a long time coming.\n\"I just follow the patterns and trust my team-mates as always,\" Laurent said.\n\"I probably owed the boys, I've missed a few sitters so happy I got a few tonight.\"", "url": "https://www.bbc.com/sport/football/articles/cjw4qj4qp7no"}