{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:01:05", "date_modify": "2025-05-21 07:01:05", "date_publish": "2025-03-29 00:00:00", "description": "Follow live text commentary, score updates and match stats from Real Madrid vs Leganés in the Spanish La Liga", "filename": "sport_football_live_cm2ndndvdgmt_1747810865.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6c4e/live/bf4b6260-0ce8-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cm2ndndvdgmt_1747810865.html", "title": "Real Madrid vs Leganés: Spanish La Liga stats & head-to-head", "title_page": "Real Madrid vs Leganés: Spanish La Liga stats & head-to-head - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Kylian Mbappe hit the winner as Real Madrid fought back to beat Leganes and go level on points with rivals Barcelona at the top of La Liga.\nThe France striker gave an under-strength Madrid side a 32nd-minute lead with a 'Panenka' penalty past Marko Dmitrovic after Arda Guler was brought down in the area.\nDiego Garcia equalised for Leganes within a minute, tapping in at the back post after some lax defending from the hosts.\nDani Raba gave the visitors a shock lead at the Bernabeu before the break when he swept home Oscar Rodriguez's cutback past Andriy Lunin.\nEngland midfielder Jude Bellingham equalised within two minutes of the restart, following in from Brahim Diaz's effort for his eighth league goal of the season.\nMbappe's 33rd goal of the season - a well-worked free-kick through a gap in Leganes' wall 15 minutes from time - secured all three points for Real.\nThe hosts, who started without Vinicius Jr, Rodrygo and Federico Valverde after the international break, are now level on points with Barca having played a game more.\nHansi Flick's league leaders play their game in hand on Sunday against Girona (15:30 BST).", "url": "https://www.bbc.com/sport/football/live/cm2ndndvdgmt"}