{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:43:11", "date_modify": "2025-05-20 11:43:11", "date_publish": "2023-08-06 16:13:41", "description": "Hull FC boost their Super League play-off hopes and send Wakefield back to the foot of the table in Sunday's victory.", "filename": "sport_rugby-league_66397939_1747741391.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/CD1B/production/_130670525_hull_fc_v_wakefield_004.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-league_66397939_1747741391.html", "title": "Super League: Hull FC 42-4 Wakefield Trinity - Play-off hopes boosted as strugglers lose", "title_page": "Super League: Hull FC 42-4 Wakefield Trinity - Play-off hopes boosted as strugglers lose - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Hull FC kept their play-off hopes alive as they ran in seven tries in a dominant victory over a below-par Wakefield Trinity.\nThere was no sign of Hull's recent inconsistency as Adam Swift raced through and Carlos Tuimavave touched down for a 12-0 interval lead.\nQuick-fire tries by Cam Scott and Jordan Lane as good as sealed victory.\nWakefield replied through Innes Senior, but Darnell McIntosh's double and Joe Lovodua's score sent Trinity bottom.\nMark Applegarth's side started the day above Castleford Tigers but the heavy defeat means they are now propping up the Super League table on points difference.\nTrinity were seeking a fifth win in seven games after a much-improved recent spell but, despite a late rally, they were second best at the MKM Stadium in a performance characterised by missed opportunities and unforced errors.\nWakefield centre Samisoni Langi suffered what turned out to be a fracture in his shoulder during the first half, for which he was taken off on a stretcher.\nLangi was applauded by both sets of fans as he left the pitch following the incident, which was placed on report by referee Chris Kendall.\nA sluggish Wakefield start saw them under pressure from the outset and soon trailing when Australia-bound scrum-half Jake Clifford cleverly weaved his way through the away defence and found Swift who raced away for the opening score.\nThe hosts were constantly targeting Trinity's right-hand side and the approach worked after for a second time moments after Langi's injury when the Black and Whites doubled their lead.\nClifford was again involved, launching a fine pass to McIntosh who stormed away before finding Tuimavave for a simple finish. Clifford once again added the extras for 12-0 lead.\nThe score remained the same at the break despite Trinity's best moment of the half when Reece Lyne and David Fifita almost combined well.\nBut Trinity's regular failure to complete their sets and general sloppiness in possession was their downfall again just after the break as Hull FC ran in two tries in as many minutes.\nScott went over for the first and the second came when Danny Houghton danced through before offloading to Lane to touch down.\nSenior grabbed his fifth try in two games to ensure the visitors did not end the game pointless, but McIntosh capitalised on a sloppy pass to go over and Andre Savelio's audacious kick led to Lovodua rounding-off an emphatic Hull win.\nHull FC boss Tony Smith:\n\"I'm feeling good. It's our job as coaches to find some things wrong and it wasn't a perfect hit out, however, I thought we did a pretty good job.\n\"I felt like we were overplaying slightly at half-time and that's down to the opposition making it hard for us, but I wanted us to get a bit more composure.\n\"It's hard because I encourage them to play what they see and chance their arm, but I thought we did that a lot better in the second half and got the rewards for it.\n\"Our defence was good. Defensively, we defended our try-line well and it looked a lot more like when we've been travelling well.\"\nWakefield head coach Mark Applegarth:\n\"Their line speed rattled us all game and I think they were just the better team. I thought we were going to save up a better performance than that but credit to Hull.\n\"We've got some honest assessments to make after that and it's really important that we stick together. We were frustrated all game. We let a few things rattle us and we need to be better at staying composed in those situations.\n\"There were a couple of soft tries but I don't need to tell the players that, they know that and we'll work hard on fixing that.\"\nOn the injury to Samisoni Langi:\n\"He's got a fracture in his shoulder but it thankfully sounds like there's no damage to his neck. We're just happy that it's not his neck, the main thing for me is that Samisoni is alright.\"\nHull FC: Litten; Swift, Tuimavave, Scott, McIntosh; Trueman, Clifford; Fash, Houghton, Taylor, Lane, Savelio, Cator\nInterchanges: Brown, Dwyer, Lovodua, Satae [Gardiner]\nWakefield: Jowitt; Lineham, Lyne, Langi, Senior; Gale, Lino; Proctor, Hood, Bowden, Ashurst, Pitts, Kay\nInterchanges: Dagger, Fifita, Atoni, Battye [Croft]\nReferee: Chris Kendall.", "url": "https://www.bbc.com/sport/rugby-league/66397939"}