{"authors": ["Katie Stafford", "www.facebook.com"], "date_download": "2025-05-21 06:08:19", "date_modify": "2025-05-21 06:08:19", "date_publish": "2025-01-14 10:29:08", "description": "Mikel Arteta press conference: Arsenal vs Tottenham preview", "filename": "sport_football_articles_cq5g2yxdyj2o_1747807699.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/adba/live/e81c39a0-4842-11ef-96a8-e710c6bfc866.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cq5g2yxdyj2o_1747807699.html", "title": "Mikel Arteta press conference: Arsenal vs Tottenham preview", "title_page": "Mikel Arteta press conference: Arsenal vs Tottenham preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Gabriel Jesus' knee injury is \"not looking good at all\" and they are \"very worried\" before further medical tests later on Tuesday.\nOn whether there is a greater need to tap into the transfer market with Jesus' injury: \"We are actively looking into the market to improve the squad. We always have been. It would be naive not too. We are looking and we are trying, so let's see what we can do.\"\nIn response to needing a number nine: \"We have to believe that something will make us better. Not just in that position as we have other issues.\"\nJurrien Timber and Jorginho are \"fine\" and were just suffering with cramp at the end of Sunday's FA Cup extra time against Manchester United.\nRiccardo Calafiori \"needs another day or two\" but they will assess him further later on Tuesday.\nArteta said they \"have to embrace the challenge, get the best out of it and be creative\" after losing \"important players in crucial moments\".\nOn losing their home record: \"It was a long period and it was something that gave us so much confidence. The manner we lost those two games is painful.\"\nArteta said the north London derby \"is the nicest game of the season to watch and play because of the atmosphere and what it means to the people - us and everyone that is involved\".\nOn the abuse Kai Havertz and his wife have endured since Sunday's FA Cup defeat: \"It is incredible, honestly. We really have to do something about it because accepting it has terrible consequences. It is something we have to eradicate in the game. It is dependent on action.\"\nMore on the issue: \"On 27 December we win 1-0. Havertz scores a goal and the whole stadium is singing his song. That was just 20 days ago, so where is the perspective? We are all responsible for the narrative and we cannot look somewhere else. It is a really serious matter. The line has to be drawn. It cannot happen. That is what we should aim for.\"", "url": "https://www.bbc.com/sport/football/articles/cq5g2yxdyj2o"}