{"authors": ["Neil Johnston", "www.facebook.com"], "date_download": "2025-05-20 12:06:13", "date_modify": "2025-05-20 12:06:13", "date_publish": "2023-08-05 11:28:15", "description": "After losing 4-0 to Japan in their previous match, Spain show they have rediscovered the form that makes them Women's World Cup contenders with a classy win over Switzerland.", "filename": "sport_football_66414751_1747742773.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/A506/production/_130664224_classy.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66414751_1747742773.html", "title": "2023 Women's World Cup: Spain send out a powerful message with statement win", "title_page": "2023 Women's World Cup: Spain send out a powerful message with statement win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "\"No-one should lose hope. This defeat hurts, the players are angry and I'm convinced they will be much better in the next match,\" said Jorge Vilda.\nThe Spain boss had just seen his team outclassed and outfought by Japan in Wellington and the Spanish media wanted reassurances following La Roja's heaviest Women's World Cup defeat.\nFive days later, they got their answer in the form of a stunning 5-1 victory over Switzerland in Auckland.\nNot only did the win earn Spain a place in the quarter-finals for the first time, it showed the nation ranked number six in the world had rediscovered the form that makes them serious contenders at this World Cup.\n\"Mentally I think this is massive for Spain,\" former England captain Steph Houghton said on BBC One.\n\"It's a Spanish side that we've been watching and playing against for years, who we expected big things from, to get into the quarter-final now will give the girls a massive boost.\"\nVilda said: \"We have shown what we can do and without having the best version [of ourselves].\n\"So, in the end we have arrived, we have pressed well, we have made history. Today, yes, they are not words, they are deeds and we are happy, to be honest.\"\nVilda flexed his muscles on Saturday, showing that he is not been afraid to make big calls when needed.\nThere were gasps from the travelling Spanish media when the team sheet revealed first-choice goalkeeper Misa Rodriguez had been replaced by 22-year-old Cata Coll.\nAlexia Putellas, the two-time Ballon d'Or winner, was also back on the bench, having started the Japan debacle.\n\"Today, we showed that Spain is a team of 23 players,\" said Vilda, who has now started 18 different players in four games in New Zealand. \"We have 23 Ballons d'Or.\"\nFour players made their first starts at this World Cup against Switzerland - including Laia Codina, who recovered from scoring a spectacular own goal to score her side's fourth goal on the stroke of half-time.\nForward Alba Redondo scored one and made one in her first World Cup start.\nBut the standout performer was Aitana Bonmati, the Barcelona midfielder, who finished the game with two goals and two assists.\nShe now has three goals in this tournament and her influence has helped propel Spain to within one win of the semi-finals.\n\"Spain needed their big players today and she has certainly been that,\" added Houghton.\nBonmati said anger from the heavy Japan defeat helped the team produce a statement win against Switzerland.\n\"It wasn't easy to play today after what happened the other day,\" said Bonmati, reflecting on the team's two contrasting results.\n\"I am not a player who is used to losing like this.\n\"This will unite us more than ever. I am a player that in tough moments, my character shines through even more.\n\"And this is when you really see the personality of the team and the personality of the players. And I hope that we will be here for many days.\"", "url": "https://www.bbc.com/sport/football/66414751"}