{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:19:17", "date_modify": "2025-05-19 15:19:17", "date_publish": "2015-03-02 14:19:07", "description": "Scotland coach Stuart McCall is enjoying working with the national squad and plays down talk of a return to Rangers.", "filename": "sport_football_31697169_1747667957.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81344000/jpg/_81344611_strachan_mccall_sns.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31697169_1747667957.html", "title": "Stuart McCall: Scotland coach plays down Rangers link", "title_page": "Stuart McCall: Scotland coach plays down Rangers link - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Scotland coach Stuart McCall has played down talk of a return to Rangers, for whom he played for seven years in the 1990s.\nMcCall stepped down as Motherwell manager in November but is wary of taking up a position that would end his involvement with the national team.\nHe said: \"It's got to be something that would really make me want to go and do it. Obviously, Rangers is a huge club.\n\"But a team have got to want you to be involved and then you look into it.\"\nThe current Rangers manager, Kenny McDowall, is in the early days of his 12-month notice period, having said he wished to resign.\nMcCall, who starred in the Rangers midfield from 1991 to 1998, says he is enjoying working with Scotland manager Gordon Strachan and assistant Mark McGhee.\nSpeaking ahead of the Hampden friendly against Northern Ireland on 25 March, he added: \"Since I've been out of work, I've had a couple of opportunities both north and south of the border to go back into the game.\n\"I really enjoy what I do at Scotland and I was fortunate at Motherwell I could do both.\n\"I would imagine 90% of the opportunities I'll maybe have will mean that I can't do that.", "url": "https://www.bbc.com/sport/football/31697169"}