{"authors": ["Nick McPheat", "www.facebook.com"], "date_download": "2025-05-21 06:22:46", "date_modify": "2025-05-21 06:22:46", "date_publish": "2025-03-31 14:14:31", "description": "In numbers: Rangers striker Cyriel Dessers' rollercoaster night in Dundee", "filename": "sport_articles_czd311j4ll3o_1747808566.html", "image_url": "https://ichef.bbci.co.uk/ace/standard/1800/cpsprodpb/cd2e/live/9f427240-b8fe-11ee-beb5-e1400df560f2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_czd311j4ll3o_1747808566.html", "title": "In numbers: Rangers striker Cyriel Dessers' rollercoaster night in Dundee", "title_page": "In numbers: Rangers striker Cyriel Dessers' rollercoaster night in Dundee - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cyriel Dessers' 100th Rangers appearance epitomised his time at the club. In fact, the striker might just epitomise the entire team and their season.\nThe Nigerian is unpredictable, but his character is unquestionable. This was again evidenced in an extraordinary seven-goal thriller at Dens Park.\nRangers fans in the away end would have been pulling their hair out as the forward passed up chance after chance, but Dessers would eventually send the visiting support into raptures with a dramatic 93rd-minute winner.\nThe strike marked his 45th goal in 100 games for the club. Only Kris Boyd (68), Alfredo Morelos (57) and Shota Arveladze (48) have netted more goals in their first 100 Rangers matches this century.\nDessers' winning moment in Dundee, a deft finish over goalkeeper Trevor Carson, was one of 12 shots he had in the game.\nIn the five other Scottish Premiership fixtures over the weekend, seven teams had fewer than 12 shots.\nExcluding the strike he had ruled out for offside, nine of Dessers' efforts were on target, with all 12 of them coming from inside the box. Opta rated six of them as 'big chances'.\nAfter being denied on almost every occasion, Dessers saved his goal for stoppage time, sealing an incredible three points for Barry Ferguson's men.", "url": "https://www.bbc.com/sport/articles/czd311j4ll3o"}