{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:13:43", "date_modify": "2025-05-19 15:13:43", "date_publish": "2015-03-08 22:32:33", "description": "As Arsenal prepare to face Manchester United, Arsene Wenger admits to sacrificing the FA Cup in previous years.", "filename": "sport_football_31789393_1747667623.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81483000/jpg/_81483495_wenger_large_getty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31789393_1747667623.html", "title": "FA Cup: Arsene Wenger says he sacrificed potential past success", "title_page": "FA Cup: Arsene Wenger says he sacrificed potential past success - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Arsenal boss Arsene Wenger has admitted sacrificing his side's FA Cup chances in previous seasons to boost their prospects of European glory.\nOn Monday, the Gunners face Manchester United, where they lost 4-0 in 2008, external before a European tie with AC Milan.\n\"The FA Cup was badly positioned before the Champions League - you always had decisions to make,\" said Wenger.\n\"A player who was a bit on the edge - what do you sacrifice? It was always the FA Cup in the end.\"\nWenger added: \"Sometimes as well I did not sacrifice the FA Cup years before and we paid the price because we lost one or two important players two or three days before an important game.\"\nIn 2008, Wenger made four changes to his side between Arsenal's fifth-round FA Cup defeat at United and a 0-0 draw against Milan, which helped them reach the quarter-finals of the Champions League.\nThe Gunners are struggling to reach the last eight this time around after losing 3-1 to Monaco in the first leg of their last-16 tie at Emirates Stadium.\nThey do not play the second leg until 17 March, which may influence Wenger's team selection as they seek a first win at Old Trafford since September 2006.\nWenger believes the outcome of the FA Cup tie could also have a bearing on the race for a top-four finish in the Premier League, with Arsenal one point and one place above Louis van Gaal's United, who are fourth, after winning seven of their last eight league games.\nWenger said: \"Monday night is a big game, and every big win in a big game has an impact subconsciously in the belief of the team.\n\"Winning the FA Cup last season gave us energy because we had a few years without winning a trophy and on that front it was vital.\n\"This team has a good mentality because we had a slow start this season and every time when we lose a big game, you see how much the players are touched.\n\"I think the mentality is very healthy. They want to do well and we will be focused on Monday night.\"\nMonday's FA Cup quarter-final between Manchester United and Arsenal is live on BBC One from 19:30 GMT, and on BBC Radio 5 live from 19:45 GMT.", "url": "https://www.bbc.com/sport/football/31789393"}