{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:25:13", "date_modify": "2025-05-21 07:25:13", "date_publish": "2025-05-19 18:11:00", "description": "Alex Hales marks his return to Islamabad United with a blistering 88 as his side secures a top-two finish in the Pakistan Super League by beating Karachi Kings.", "filename": "sport_cricket_articles_c93ygx714ypo_1747812313.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3009/live/07ac7200-34cc-11f0-8ca3-49a2defac508.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c93ygx714ypo_1747812313.html", "title": "PSL 2025: Alex Hales hits 88 as Islamabad United secure top-two finish", "title_page": "PSL 2025: Alex Hales hits 88 as Islamabad United secure top-two finish  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Alex Hales marked his return to Islamabad United with a blistering 88 as his side secured a top-two finish in the Pakistan Super League by beating Karachi Kings by 79 runs.\nHales, who joined Islamabad following the PSL's resumption, hit eight sixes in his 35 balls as Islamabad piled up 251-5.\nHe put on a 153-run opening stand with Sahibzada Farhan, who made 73, before being bowled in the 17th over. Shadab Khan also added a 19-ball 42.\nKarachi reached 80-1 in response but crumbled after James Vince was caught at long-on for eight and were dismissed for 172 in 18.2 overs.\nHad Karachi reached 204 they would have held onto second place but, having been overtaken by Islamabad on net run-rate, they drop to third and must now play in the eliminator.\nThe play-offs begin on Wednesday with the first qualifier between Islamabad, who had lost four matches in a row after starting with five wins, and leaders Quetta Gladiators with the winner progressing directly to the final.\nThe eliminator between takes place a day later between Karachi and Lahore Qalandars.", "url": "https://www.bbc.com/sport/cricket/articles/c93ygx714ypo"}