{"authors": ["Nick Webb", "www.facebook.com"], "date_download": "2025-05-21 07:48:13", "date_modify": "2025-05-21 07:48:13", "date_publish": "2025-05-18 18:19:37", "description": "Glamorgan complete an eight-wicket win over a defiant Northants on day three after battling resistance from Luke Procter, Saif Zaib and Lewis McManus.", "filename": "sport_cricket_articles_cvgdp1ez1e9o_1747813693.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6868/live/2553c8c0-3419-11f0-aeb0-ff0102a45a96.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cvgdp1ez1e9o_1747813693.html", "title": "County Championship: Glamorgan complete three-day win v Northants", "title_page": "County Championship: Glamorgan complete three-day win v Northants - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Glamorgan completed a three-day win by eight wickets over Northants, taking the extra half-hour to seal the result after some dogged Northants defiance.\nSaif Zaib top-scored with 71 while there was lengthy resistance from Luke Procter (56) and Lewis McManus (66).\nAsitha Fernando and James Harris took three wickets apiece each as Northants were finally dismissed for 304, having been 239 behind.\nGlamorgan needed 66 to win in 12 overs of normal play, but Ben Sanderson claimed two quick wickets including Australian Test batter Marnus Labuschagne for just four.\nAsa Tribe and Sam Northeast steadied the ship and steered Glamorgan to a second successive victory after a poor start to the season while Northants were left to ponder their top-order struggles.\nNorthants fought hard throughout day three after starting 190 runs behind with three wickets already down.\nCaptain Procter again dug in, but it was James Sales who dominated the stand of 53 as he took three boundaries in an over off the usually economical Timm van der Gugten.\nSales, on 35, edged through to Chris Cooke in the Netherlands international's next over and Rob Keogh, in sketchy form, made a nervy start before edging Fernando behind for six to leave them 108-5.\nZaib started brightly, lofting a couple of leg-side sixes while Procter ground on conscientiously, but the skipper's vigil was ended by Fernando switching angles and giving Cooke his third catch of the day.\nAnother obdurate 50 stand followed between Zaib and Lewis McManus but Zaib edged James Harris to Sam Northeast at slip with the visitors still 17 in arrears, and Justin Broad chipped Van der Gugten's first delivery with the new ball to mid-wicket.\nMcManus, Ben Sanderson and Harry Conway added 74 for the last two wickets before Harris and Fernando finished them off, courtesy of fine catches from Kiran Carlson and Cooke again.\nA target of 66 looked modest but Sanderson had other ideas as he had Zain Ul Hassan caught behind for two.\nLabuschagne got off a pair first ball, clipped his second just short of mid-wicket and was close to lbw on his third, before Sanderson found a thick edge and the Australian was left to bemoan a rare double failure.\nTribe and Northeast calmly reduced the target to 26 by the end of the day's scheduled overs, and the umpires sensibly gave them the chance to finish it.\nGlamorgan have another home fixture to finish the Championship block against Middlesex on Friday 23 May, while Northants host Gloucestershire on the same day.\nGlamorgan's James Harris told BBC Sport Wales:\n\"We're really happy to back up last week's performance (in Kent) with another strong one. Two wins on the bounce is what we needed after a slower start to the season.\n\"Northants batted well today so we had to work hard for those wickets, all the bowlers deserve credit for the way they backed each other up and we got the result in the end.\n\"I've felt I've come back (after injury) and bowled quite nicely, it's nice to have the new ball. Asitha is a world-class bowler, he's got some big wickets at important times.\"\nGlamorgan coach Richard Dawson said:\n\"James Harris' spell before tea was outstanding and Asitha as well after lunch. We continued to build pressure and create chances.\n\"Asitha controlled the scoreboard and created chances, every bowler's doing their job. It's good to get 20 wickets at Cardiff because notoriously it gets a bit flatter so that's really pleasing.\n\"Marnus will be hungry for runs next week, but he's been brilliant around the changing-room and training, he brings energy and positivity so I'm sure he'll come good next week.\"\nNorthants coach Darren Lehmann told BBC Radio Northampton:\n\"Our batting's got to improve, everyone around the county and the whole of England knows that, so we've certainly got work to do and we'll look at the make-up of our side.\n\"We had a brilliant first session (of the game, batting), one for 100, and we were brilliant today, fought back really hard and got a lead, but the middle session on day two really cost us.\n\"Today was a lot better but again it's the lower order. The skipper was fantastic, Saif was brilliant again and Lewis is in good nick but we're leaving it to too few.\n\"There'll be changes on Friday. We'll have to look at our second-team performances and see who's knocking the door down.\"", "url": "https://www.bbc.com/sport/cricket/articles/cvgdp1ez1e9o"}