{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:41:17", "date_modify": "2025-05-20 13:41:17", "date_publish": "2023-08-01 14:33:14", "description": "Anticipation building ahead of Rodgers’ official return", "filename": "sport_articles_ceky48xnj8do_1747748477.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/818d/live/a8089400-3077-11ee-8f52-fbf70e4bf742.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_ceky48xnj8do_1747748477.html", "title": "Anticipation building ahead of Rodgers’ official return", "title_page": "Anticipation building ahead of Rodgers’ official return  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tino, The Celtic Exchange podcast, external\nIt’s been less than two months since Ange Postecoglou swapped life in Glasgow for the bright lights of London, completing a world record eight domestic treble as his final act.\nSuch is the pace of life at Celtic however, the Australian has already become yesterday’s man.\nWith five trophies from six during his two seasons at Parkhead, history will look more than kindly on his achievements, but as they say you’re only as good as your last game/trophy/treble and it’s time for the focus to now shift towards what lies ahead this season and beyond.\nThere was no time to dwell on Postecoglou’s exit with the Celtic board acting swiftly to sweep Brendan Rodgers back in to Paradise for a second spell in the hot-seat.\nIt’s not something I thought I’d find myself typing on the dawn of the new season, but here we are and I have to say I’ve been energised by his appointment and by what it may bring.\nThe vast majority of the fan base look to have also bought into his return and if he can pick up where he left off in terms of trophies, and can add some progress in Europe along the way, then all will be forgiven.\nThough his return was confirmed back on June 20, he’s yet to make his 'official' return to Celtic Park in a matchday capacity and though he’ll be given his first opportunity to do so on Tuesday night against Atletico Bilbao, that’s a night where all the adulation has rightly been reserved for Celtic’s one club man James Forrest.\nThe real stuff starts on Saturday however, as we take on Ross County in the season opener and despite some injury concerns – particularly across the defence – we should be more than ready for the challenge we’ll face from the Highlanders.\nHowever with trips to Pittodrie and Ibrox in the weeks ahead, as well as a Champions League campaign that kicks off in mid-September, there’s no doubt there are tougher tests in store.\nSo are Brendan Rodgers and his new look side ready for those challenges?\nAt this stage? Probably not.\nBut with a couple of key additions to join the five new Bhoys that are already in the door, then the hope is that we certainly will be.\nAnticipation is building nicely ahead of the new season as we all wait to see what Brendan Rodgers v2.0 brings to the table!\nPredicted Finish: Scottish Premiership Champions\nStandout Player Will Be: Reo Hatate", "url": "https://www.bbc.com/sport/articles/ceky48xnj8do"}