{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:09:48", "date_modify": "2025-05-21 05:09:48", "date_publish": "2025-02-01 00:04:26", "description": "Warren Gatland says Wales will not hide from the importance of a Six Nations trip to face Italy in Rome after they were demolished 43-0 by France.", "filename": "sport_rugby-union_articles_cly4deq0n29o_1747804188.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/027e/live/131e3f00-e08b-11ef-a319-fb4e7360c4ec.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cly4deq0n29o_1747804188.html", "title": "Six Nations: Wales boss Warren Gatland targets Italy game after France result", "title_page": "Six Nations: Wales boss Warren Gatland targets Italy game after France result - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Head coach Warren Gatland says Wales cannot hide from the importance of a Six Nations trip to face Italy in Rome after they were demolished 43-0 by France.\nWales suffered a record Six Nations loss against France, and it was the first time since the tournament expanded 25 years ago that Wales failed to score a point.\nIn a demoralising start for Wales, they also finished only one point short of equalling their all-time worst Six Nations defeat margin of 54-10 against Ireland 23 years ago.\nIt was also a 13th successive Test loss under Gatland which is an ongoing Welsh record.\nFormer Wales fly-half Dan Biggar says the match at the Stadio Olimpico is Wales' biggest for \"15-20 years\" with Gatland's side desperately needing a victory.\n\"It is an important game for Wales, it is not about where it ranks for me,\" said Gatland.\n\"Next week becomes pretty important for us. We can't hide away from that. We need to get the monkey off our back.\"\nWales will travel to Nice on Saturday to spend the week preparing for the Italian test.\n\"The players have worked hard over the last couple of weeks and the players are aware of how important next week is,\" said Gatland.\n\"We go to Nice tomorrow for the week and that's going to be important for this group.\"\nWales have also suffered notable injuries, losing number eight Aaron Wainwright and centre Owen Watkin in the first half.\nA bloodied Wainwright took a blow to his head, while Watkin suffered a suspected serious knee injury that will require further assessment.\n\"They are not looking great,\" said Gatland.\n\"Owen is in a brace with his knee, and it looks like it could be an ACL [anterior cruciate ligament] and Aaron needs another HIA [head injury assessment] and has quite a nasty gash in his face down through his lip.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/cly4deq0n29o"}