{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:05:26", "date_modify": "2025-05-20 13:05:26", "date_publish": "2023-08-02 16:59:54", "description": "League One newcomers Leyton Orient sign former Birmingham City forward Jordan Graham on a two-year deal.", "filename": "sport_football_66389182_1747746326.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/11937/production/_130619917_gettyimages-1246435928.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66389182_1747746326.html", "title": "Jordan Graham: Leyton Orient sign former Birmingham City forward on two-year deal", "title_page": "Jordan Graham: Leyton Orient sign former Birmingham City forward on two-year deal - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "League One newcomers Leyton Orient have signed former Birmingham City forward Jordan Graham on a two-year deal.\nThe 28-year-old was released by the Championship club at the end of last season after making 54 appearances over the course of two years with the Blues.\nA former Aston Villa trainee, Graham has had permanent spells at Wolves and Gillingham and loan stints with Ipswich, Bradford, Oxford and Fulham.\nHe becomes Orient's ninth signing of the summer transfer window.\nO's head coach Richie Wellens expects to strengthen his squad further after a couple of injuries to strikers in pre-season.\n\"We will probably get one more striker in because Aaron Drinan has picked up an injury and Dan Agyei has picked up an injury which will be long term,\" Wellens told BBC Sport.\n\"We've signed Joe Pigott who we expect a certain number of goals from.\n\"If everybody was fit then I'd be absolutely delighted with the squad.\"\nAgyei, who scored 16 goals in League Two for Crewe last season, could be missing for up to five months.\nOrient begin the League One campaign away to Charlton Athletic on Saturday (15:00 BST).", "url": "https://www.bbc.com/sport/football/66389182"}