{"authors": ["Amy Canavan", "www.facebook.com"], "date_download": "2025-04-26 08:03:58", "date_modify": "2025-04-26 08:03:58", "date_publish": "2025-02-26 16:16:52", "description": "'I've been eating dinner with idols' - Emma Lawton on first Scotland camp", "filename": "sport_articles_cyve4z2ngydo_1745654638.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/118f/live/ede9b620-f45c-11ef-9d52-1b1b29dc5f7f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cyve4z2ngydo_1745654638.html", "title": "'I've been eating dinner with idols'", "title_page": "'I've been eating dinner with idols' - Emma Lawton on first Scotland camp - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "When Emma Lawton received her first Scotland call up earlier this month, she didn't expected to start one never mind two Nations League games.\nGiven the \"surreal\" six months she's had, though, she probably should have had a wee bit more faith.\nThe Celtic full-back not only made her international debut in Austria, and followed it up with a second start on Tuesday against the Netherlands, she scored her first goal for her country too, giving the Scots a shock lead before the Dutch fought back for a 2-1 win at Hampden.\n\"I was just ready for any rebounds and I hit it,\" Lawton said of her first-half strike. \"Luckily it flew into the goal. I'm really pleased with it.\"\nSumming up an \"enjoyable but challenging\" time in camp, the goalscorer spoke of the \"crazy\" experience of having tea with some of her idols.\n\"I've watched a lot of these players for years,\" she told BBC Scotland.\n\"To be training and playing with them, and eating dinner with them, has been crazy. It is a really great group of girls.\n\"It's been really enjoyable, very challenging, but I am really happy to be here.\n\"I didn't think I'd play to be honest. To start both games, I'm proud to have done that, pleased with it.\n\"Knowing [interim head coach] Michael [McArdle] has been really good. The girls have really liked him. It has been a positive week for us. We have taken steps in the right way.\"", "url": "https://www.bbc.co.uk/sport/articles/cyve4z2ngydo"}