{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:31:31", "date_modify": "2025-04-26 06:31:31", "date_publish": "2025-02-27 08:44:54", "description": "Portadown and Linfield express \"extreme\" and \"deep\" disappointment after NIFL declines to compensate fans left out of pocket by late Storm Darragh call-offs.", "filename": "sport_football_articles_c3w111j38wlo_1745649091.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/eacb/live/3ecd92d0-f4e6-11ef-ae0a-4bca4f518eb0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c3w111j38wlo_1745649091.html", "title": "Storm Darragh: Portadown and Linfield upset as NIFL doesn't compensate fans for late call-offs", "title_page": "Storm Darragh: Portadown and Linfield upset as NIFL doesn't compensate fans for late call-offs - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Portadown and Linfield have expressed \"extreme\" and \"deep\" disappointment after the Northern Ireland Football League [NIFL] declined to offer compensation to supporters financially impacted by the late postponements of Irish Premiership games on 7 December.\nDespite an amber weather warning being issued the previous day because of the impending arrival of Storm Darragh, NIFL opted not to postpone any of the six scheduled fixtures at that stage but the games were then called off at short notice on the Saturday.\nPortadown's game at Coleraine was postponed an hour before the kick-off with Linfield's contest at Dungannon Swifts called off 70 minutes prior to the scheduled start.\nNIFL Chief executive Gerard Lawlor later said the league governing body would look at the option of reimbursing supporters but the Portadown and Linfield statements said that it instead had decided to make a donation to charity.\n\"Portadown FC had three supporters clubs buses as well as a team bus travel to Coleraine at a total cost of £2,010, with invoices submitted to NIFL as requested. Therefore, we were dismayed to learn that NIFL instead would look to make a donation to charity,\" said the club's statement.\n\"While charitable donations are of course always welcome, unfortunately this gesture does nothing to help our supporters clubs at a time when many are struggling to cover the price of hiring buses because of rising transport costs.\"\nThe Portadown statement added that it was \"unacceptable that our supporters clubs have been left substantially out of pocket for what was an unnecessary and needless journey, and also deeply let down that they will not be compensated as was publicly suggested\".\n\"We will now consider our options, but as a sign of appreciation to our supporters clubs who have travelled the width and breadth of the country all season, we will endeavour to make sure that we assist them financially, so that they do not have to fully burden the cost of decisions that were out of their control.\"\nLinfield's statement said: \"This outcome is deeply disappointing for the club and its supporters clubs as expectations were raised that a goodwill gesture would be forthcoming to compensate supporters clubs for the unnecessary travel.\"\nThe Belfast club added that it would cover 50% of the travel costs incurred by its supporters on 7 December and had accepted NIFL's offer to make a charitable donation, which will go to the club's main charity partner, the NI Children's Hospice.", "url": "https://www.bbc.co.uk/sport/football/articles/c3w111j38wlo"}