{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:24:28", "date_modify": "2025-05-21 05:24:28", "date_publish": "2025-04-03 14:20:57", "description": "Leeds United boss Daniel Farke confirms he will start Karl Darlow, not Illan Meslier, in goal for Saturday's Championship trip to Luton.", "filename": "sport_football_articles_cr5dm953rn3o_1747805068.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d903/live/0253b590-1094-11f0-83c2-2342c0bf03a1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cr5dm953rn3o_1747805068.html", "title": "Leeds United: Karl Darlow starts in place of Illan Meslier at Luton", "title_page": "Leeds United: Karl Darlow starts in place of Illan Meslier at Luton - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Leeds United boss Daniel Farke has confirmed he will start Karl Darlow in goal for Saturday's trip to Luton.\nNumber one Illan Meslier has been ever-present in the Championship this season but the 25-year-old's error gifted Swansea their first equaliser in last Saturday's 2-2 draw.\nIt was the latest in a series of costly mistakes from the Frenchman and led to calls from fans and pundits for Farke to make a change for the final seven games of the season as Leeds look to secure promotion back to the Premier League.\nDarlow, who joined Leeds from Newcastle in the summer of 2023, has not made a league appearance since 29 December that year.\n\"Big believer to have clarity on the goalkeeper position - I have taken my decision and spoke to the goalkeepers, Karl will play on Saturday, Illan will be on the bench,\" Farke said.\n\"We all know Illan's had a difficult season so far, you have to be honest. In general, your number one you're a bit more careful to change than an outfield player.\n\"If they [an outfield player] have one or two difficult games, you can rotate a bit. In the goalkeeper position it's important you don't change game-to-game, even after a few mistakes.\n\"I made it quite clear, the last time we spoke about this topic, it's professional football and you have to deliver good performances and perform well. [In the] Last weeks we felt he could have done better in a few situations. Right now, it was a decision I feel I had to make and to protect him a little bit.\n\"The camera and spotlight is on him, he's still a young man, the weight of the world is on his shoulders, and we have to protect him.\"\nSaturday's draw with the Swans meant Leeds stayed in second place, two points behind leaders Sheffield United and are level on points with third-placed Burnley but with a superior goal difference.", "url": "https://www.bbc.com/sport/football/articles/cr5dm953rn3o"}