{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:21:11", "date_modify": "2025-05-20 13:21:11", "date_publish": "2023-07-26 09:54:49", "description": "Jade Jones hopes to achieve \"mission impossible\" and become the first taekwondo athlete to win three Olympic gold medals when she competes in Paris next year.", "filename": "sport_taekwondo_66311472_1747747271.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/136E5/production/_130198597_gettyimages-1258586780.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_taekwondo_66311472_1747747271.html", "title": "Paris 2024 Olympics: Jade Jones aims to achieve 'mission impossible'", "title_page": "Paris 2024 Olympics: Jade Jones aims to achieve 'mission impossible' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jade Jones is hoping to achieve \"mission impossible\" and become the first taekwondo athlete to win three Olympic gold medals when she competes in Paris next year.\nJones will look to shrug off the painful memories of Tokyo in 2021.\nThe 30-year-old hopes to create history by emulating her success in London and Rio.\n\"I believe I can be the person to do it and I will leave everything out there,\" said Jones.\nWith a year to go until the Games start in France, Jones is among a number of athletes have won two Olympic gold medals in her sport.\n\"No-one has won three Olympic gold medals in taekwondo,\" said Jones.\n\"It's been mission impossible so far, and that's why no-one has managed to do it.\n\"Now that I'm older and after what happened in Tokyo, it's not expected of me so much. People are starting to write me off. Deep down that gives me more hunger because I feel like I have something to prove again.\"\nAfter winning at London 2012 as a teenager and defending her crown four years later in Brazil, Jones surrendered her title at the last-16 stage in Tokyo in 2021 with a shock loss to Refugee Team competitor Kimia Alizadeh.\nIt left Jones close to tears and threatened to prove her swansong on the Olympic stage, as she openly admitted to experiencing anxiety and not enjoying a Games sanitised by small crowds and lingering lockdown regulations.\n\"There was so much expectation on me in the build-up to Tokyo because everyone expected me to go out there and get the third gold, and I went to Tokyo feeling that I had everything to lose,\" added Jones.\n\"Everything was pressure. There was pressure on me as the athlete and there was all the pandemic stuff that meant I didn't enjoy it.\n\"I'd grown so used to being cheered on in my big competitions by friends and family, and to have no spectators there just made it a really strange experience.\n\"The whole thing just made it feel like it wasn't happening for me out there, and it wasn't meant to be.\"\nJones took an extended break from competition, returning to take bronze at the 2022 World Championships in Guadalajara.\nAfter falling in the quarter-finals of the 2023 World Championships to Taipei's Lo Chia-ling in Baku in May, Jones rebounded the following month, underscoring her commitment to the Paris process by winning her second European Games gold medal in Krakow.\nIt was a timely triumph for Jones, who must see off her domestic rival, the three-time world bronze medallist Aaliyah Powell, to secure the solitary -57kg squad on Great Britain's Olympic team, before she can even think about overcoming the weight of her sport's history.\n\"The hunger is fully back with me,\" said Jones.\n\"Tokyo didn't go well and I've since realised that my mind just wasn't right... I didn't want to leave my career like that - I wanted another shot at making sporting history.\"", "url": "https://www.bbc.com/sport/taekwondo/66311472"}