{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:08:54", "date_modify": "2025-05-21 06:08:54", "date_publish": "2025-01-26 00:00:00", "description": "West Ham show ruthless efficiency to overcome Everton and claim their first win in three Women's Super League games.", "filename": "sport_football_live_c78w7dx9q5qt_1747807734.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c78w7dx9q5qt_1747807734.html", "title": "West Ham United 2-0 Everton: Ruthless Hammers punish Toffees to claim first win in three WSL games", "title_page": "West Ham United 2-0 Everton: Ruthless Hammers punish Toffees to claim first win in three WSL games - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "West Ham showed ruthless efficiency to overcome Everton and claim their first win in three Women's Super League games.\nThe visitors had made the best of the early running, Kelly Gago and Katja Snoeijs failing to find the target with headed chances before Shekiera Martinez broke the deadlock on six minutes.\nThe West Ham forward showed the composure her counterparts had lacked to power home a corner inside the near post and claim her first WSL goal.\nHaving provided the corner for the opening goal, Viviane Asseyi turned scorer for the second on the stroke of half-time.\nThe France international stepped up to coolly convert a spot-kick after Seraina Piubel was brought down by Sara Holmgaard's sliding challenge in the box.\nAfter the break Everton's frustrations continued. Cross after cross was sent into the West Ham box but they could not deny the hosts a first clean sheet since November.\nThe victory moves Rehanne Skinner's side a point and two places above Everton in 10th place, six points clear of the relegation zone.\nIt is starting to seem as though Skinner has now steadied the ship at West Ham.\nAfter several key players opted to leave in the summer - the likes of captain and number one goalkeeper Mackenzie Arnold, defenders Risa Shimizu and Hawa Cissoko, and defensive midfielder Honoka Hayashi - many feared they would lack the experience and depth to survive another tricky relegation battle.\nIndeed, they suffered a rocky start to the season, losing three and drawing three of their opening six games.\nHowever, the Hammers have stabilised their form in the months since, and have also mastered a key facet of relegation fights - taking points from teams around them in the table.\nFrom their six games against teams currently in the bottom half of the table, West Ham have won three and drawn two, only failing to take any points from their trip to Aston Villa in December.\nIn terms of points, they have taken 11 from a possible 18.\nWest Ham rode their luck at times again on Sunday, with Everton dominating possession, shots on goal and expected goals metrics. However, they overcame early adversity and late pressure to run out comfortable winners.\nShould they continue to get the better of their bottom-half rivals, Skinner's side will not need to worry about the threat of relegation after all.", "url": "https://www.bbc.com/sport/football/live/c78w7dx9q5qt"}