{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:46:17", "date_modify": "2025-05-21 05:46:17", "date_publish": "2025-04-02 13:16:18", "description": "Glasgow Warriors primed to 'break through their glass ceiling', says Chris Paterson", "filename": "sport_articles_cy70dkvl5yxo_1747806377.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/bee2/live/f4d57850-0fc5-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cy70dkvl5yxo_1747806377.html", "title": "Glasgow Warriors primed to 'break through their glass ceiling', says Chris Paterson", "title_page": "Glasgow Warriors primed to 'break through their glass ceiling', says Chris Paterson - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Chris Paterson believes Glasgow Warriors are primed to \"break through their glass ceiling\", but the Scotland great says they will need luck along the way.\nFranco Smith's URC champions are aiming to retain their title this season, but they also have hopes of excelling in the Champions Cup, with a last-16 tie at home to Leicester Tigers looming on Saturday.\n\"It might not be in your hands whether you break though a glass ceiling or not,\" Paterson told the BBC's Scotland Rugby Podcast.\n\"The level you're competing at, you need a bit of luck. Glasgow are still missing key players, but hey have got the components to win every game they play. That's the desire, that's the aim.\n\"Franco said they are in a better place than last year, which I agree with, but the opposition teams are probably better.\"\nEdinburgh will also be in European action when they host Lions on Friday, and Paterson's former side go into the match on the back of a comfortable URC victory over Dragons.\nPaterson was keen to single out Scotland winger Darcy Graham's dazzling display in the 38-5 win.\n\"He's been the difference,\" Paterson added. \"He does it with a smile on his face. The way he battles to find space, wriggles, fights, gets to this feet, steals metres.\n\"That's just Darcy's natural game. And you look at his awareness for the first try... he's just brilliant.\"", "url": "https://www.bbc.com/sport/articles/cy70dkvl5yxo"}