{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:57:18", "date_modify": "2025-05-21 05:57:18", "date_publish": "2025-04-01 17:27:33", "description": "IPL 2025 results: PBKS take win against LSG", "filename": "sport_cricket_articles_c5yr3z88ep5o_1747807038.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ed10/live/4b8f8da0-0f1e-11f0-acc1-239a761fa7cf.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c5yr3z88ep5o_1747807038.html", "title": "IPL 2025 results: PBKS take win against LSG", "title_page": "IPL 2025 results: PBKS take win against LSG - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Punjab Kings made it two wins from two in the Indian Premier League by beating Lucknow Super Giants by eight wickets.\nPrabhsimran Singh struck 69 from 34 and captain Shreyas Iyer hit an unbeaten 52 off 30 as Kings chased down their target of 172 in the 17th over.\nHaving won the toss, Iyer put Super Giants into bat, reducing the home side to 35-3 in the fifth over with Mitchell Marsh dismissed for a golden duck, caught by Marco Jansen off the bowling of Arshdeep Singh.\nAyush Badoni anchored his side's rebuild, adding 54 with Nicholas Pooran, who top-scored with 44, then 30 with David Miller and 47 with Abdul Samad.\nBoth Badoni and Samad fell to Arshdeep within three balls in the final over, the seamer finishing with figures of 3-43 in Super Giants' innings of 171-7.\nKings lost Priyansh Arya for eight in their reply, but Prabhsimran struck nine fours and three sixes at a strike rate over 200 before being caught by Ravi Bishnoi with a smart relay catch on the boundary.\nThe wicket left the visitors 110-2 just after the halfway stage and Iyer pushed on alongside Nehal Wadhera (43 not out from 25) to secure the win, with his fourth six simultaneously ending the match and bringing up his half-century.\nKings move up to second in the table, while Lucknow slip three places to sixth after winning one of their three games.", "url": "https://www.bbc.com/sport/cricket/articles/c5yr3z88ep5o"}