{"authors": ["Harry Poole", "www.facebook.com"], "date_download": "2025-05-21 05:45:51", "date_modify": "2025-05-21 05:45:51", "date_publish": "2025-01-23 07:40:16", "description": "Britain's Henry Patten and Finnish team-mate Harri Heliovaara reach their second Grand Slam men's doubles final in six months with victory in the Australian Open last four.", "filename": "sport_tennis_articles_cj65r38p314o_1747806351.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/98f5/live/cd49c9d0-d979-11ef-bc01-8f2c83dad217.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_tennis_articles_cj65r38p314o_1747806351.html", "title": "Australian Open 2025 results: Britain's Henry Patten and Finn Harri Heliovaara reach men's doubles final", "title_page": "Australian Open 2025 results: Britain's Henry Patten and Finn Harri Heliovaara reach men's doubles final - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Britain's Henry Patten and Finnish team-mate Harri Heliovaara came through a match tie-break to reach their first Australian Open men's doubles final together.\nThe Wimbledon champions held their nerve to beat Germany's Kevin Krawietz and Tim Puetz 6-4 3-6 7-6 (10-7).\nIt is a second major final for Patten and Heliovaara in just their fourth Grand Slam together, having first joined forces in April 2024.\nThe sixth seeds will face Italian third seeds Simone Bolelli and Andrea Vavassori in Saturday's final.\nPatten, who had not gone beyond the third round at a Slam before partnering with Heliovaara, said: \"I'm just trying to ride the wave. I can't stop smiling at the moment which, for people who know me, is pretty unusual.\n\"Usually I'm a classic grumpy Brit. I'm just trying to enjoy every moment and taking it all in with Harri.\"\nHeliovaara stopped playing professionally between 2013 and 2017 because of an autoimmune disease that affects his spine, instead working in finance during that period.\nHeliovaara said: \"If you ask me five, six years ago if this was possible while I was making Powerpoints and Excel sheets in the office, I would have laughed.\n\"I haven't regretted a single day [of coming back].\"", "url": "https://www.bbc.com/sport/tennis/articles/cj65r38p314o"}