{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:50:17", "date_modify": "2025-05-21 05:50:17", "date_publish": "2025-04-02 10:26:29", "description": "In her latest BBC Sport column, Olivia Clark discusses Wales' start to their Nations League campaign, the Euros being on the horizon, her team-mates Mayzee Davies and Hayley Ladd and her hopes for 2025 with new club Leicester City.", "filename": "sport_football_articles_cx20nw74w51o_1747806617.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7d5a/live/08da8860-1046-11f0-ac9f-c37d6fd89579.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cx20nw74w51o_1747806617.html", "title": "Olivia Clark column: Euros preparation, Ladd and Nations League A", "title_page": "Olivia Clark column: Euros preparation, Ladd and Nations League A - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We are back on camp after our opening Nations League games and everyone is in good spirits.\nThe Sweden game was a great one to be involved with, we were disappointed not to win, but their ranking doesn't lie and it was great to get a result against a top-tier nation.\nI think we produced a good performance and that came off the back of the Italy game where we were disappointed to lose 1-0.\nCertainly, we come into these games targeting six points. We don't feel out of place in Nations League A.\nIndividually, we have players now who are playing in some of the biggest leagues in the world and I think that helps to give us belief as a squad that we can be competitive against anyone.\nWe have played a lot of top nations, like the USA and we've produced good performances but not got the results, but I think now the mindset change is that we believe we can compete with the best.\nRhian Wilkinson has helped with that but there is also a balance that we have perspective about what we've done in the past. We tend to always be better in the second game in the Nations League as well.\nWe are definitely becoming more comfortable with the ball. In one of our previous best draws, against England at St Mary's Stadium, which was before my time, England had a lot of shots.\nNow we are more comfortable and against Sweden I didn't really have a clear cut chance to save. We aren't just holding on for a point. We are competitive and we are trying to win games.\nThere were two momentous performances in the last camp, with Mayzee Davies winning her first start and Hayley Ladd winning her 100th cap.\nMayzee was great, she came in and did so well and she's a great character to have around as well, she takes everything in her stride.\nI asked her if she was ok and she was like \"yeah\", chilled as anything and she played like she's been around for years and you can tell she's been training with Man City's first team.\nHayley made her 100th appearance for Wales on the last camp and what an honour for her, a special player and person.\nHayley as a player is unbelievable, she's so underrated and under appreciated in the whole of the women's game, as her team-mates, we know how good she is.\nPeople don't talk about her as much as they should but she probably likes it like that, as she is so low key.\nShe's one of our greatest assets. She was unbelievable in midfield and when she plays in our defence it's great for me as a goalkeeper.\nAs a person she is probably one of the loveliest people you will ever meet and I get on with her really well. She's always interested in other people, she's great at guiding the younger players and she also has this calmness about her. But when something needs to be said? Hayley will say it. She's so respected by all of us.\nWe prepare now for what we know will be two tough games, starting with Denmark in Cardiff on Friday.\nDenmark will be hard, we know that. The last time they played us in Wales in the Nations League in 2023 they won 5-1, but that seems a while ago now, we've progressed a lot since then and we played a lot better in Denmark in the away tie.\nI don't expect the game to go like it did on that night when we lost 5-1, we know Denmark are a good side, but we feel that we are a good side and we have really developed how we play with the ball and in possession.\nIt is ideal preparation for Euro 2025. The Euros is becoming very real now, it's over four months since we qualified and it has absolutely flown by, it feels like yesterday.\nI think I watch the video of us qualifying for the Euros most days.\nThe FAW did a montage to Adwaith's song, Fel i Fod and that has become a mainstay on my playlist, I probably listen to that song every day as well, it has become the soundtrack to our success.\nThe emotions come flooding back so quickly. It's pretty surreal that Switzerland will come around so quickly. This is the last camp before our domestic season ends and then we will have just one more camp before the Euros begin.\nIn terms of my club football, I am really enjoying my time with Leicester City so far, everything has been absolutely spot-on and the only thing missing for me at the moment is game time, everything else is spot on.\nIt is such a good club to be at, I wake up in the mornings excited to go to training and I come home and feel productive. People don't see that, they just look at the teamsheet and say 'you didn't play' but there is a lot more to it than that, especially if you are a goalkeeper.\nI feel in a really good place at the minute. I was happy with my performances for Wales on the last camp.\nYou have to be so patient and wait for your chance. It happened to me at Bristol City, I got loaned out to Watford but ended up playing seven WSL (Women's Super League) games in a row.\nYou can't predict what is going to happen. But hopefully the game time will come.", "url": "https://www.bbc.com/sport/football/articles/cx20nw74w51o"}