{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:05:27", "date_modify": "2025-05-21 06:05:27", "date_publish": "2025-01-14 09:50:59", "description": "Arsenal news: Which striker could Gunners sign? Have your say", "filename": "sport_football_articles_crr09n87rzdo_1747807527.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3461/live/93658140-d259-11ef-9fd6-0be88a764111.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_crr09n87rzdo_1747807527.html", "title": "Arsenal news: Which striker could Gunners sign? Have your say", "title_page": "Arsenal news: Which striker could Gunners sign? Have your say - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "There has been a lot of talk about Arsenal's continued need for a goalscorer over the past few days after they against spurned numerous big chances in Sunday's FA Cup defeat by Manchester United.\nSpeaking on BBC Radio 5 Live's Monday Night Club, Rory Smith of The New York Times looked at possible additions and how they would fit into Mikel Arteta's side.\n\"Matheus Cunha will occupy different positions to Ollie Watkins, and he'll require a different type of service to Ollie Watkins,\" he said.\n\"Havertz can play as a nine. He's not a bad striker at all - he scored a winning goal in a Champions League final - but he does want to be involved in the play because he came through as a midfielder and that's the system he grew up with.\n\"That is very different to having Viktor Gyokeres up front, who is an on-the-shoulder, quick, complete striker. Gyokeres does not want to be dropping into midfield picking the ball up and linking play.\n\"All these players are different and would have different impacts on the team. They're also incredibly expensive.\n\"I think Alexander Isak is not possible really - Newcastle, I think, would want £120m.\n\"Gyokeres would be £100m. You're taking a massive gamble, and you're taking a massive gamble for huge amounts of money.\n\"You're asking a club to take a risk with the way they play, a way they've played which has served them really well throughout Arteta's reign, on a huge amount of money with very little absolute certainty it'll work.\n\"I can see why Arsenal have not been prepared to do that.\"", "url": "https://www.bbc.com/sport/football/articles/crr09n87rzdo"}