{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:49:42", "date_modify": "2025-05-21 05:49:42", "date_publish": "2025-01-31 16:02:41", "description": "Thomas Frank press conference: Brentford vs Tottenham preview", "filename": "sport_football_articles_ce8566k9k84o_1747806582.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a1f7/live/1ea09b30-4909-11ef-96a8-e710c6bfc866.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ce8566k9k84o_1747806582.html", "title": "Thomas Frank press conference: Brentford vs Tottenham preview", "title_page": "Thomas Frank press conference: Brentford vs Tottenham preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Christian Norgaard and Kevin Schade will be fit to feature after going off injured in last weekend's win at Crystal Palace.\nCentre-back Ethan Pinnock is also available for selection after recovering from a hamstring injury that has kept him out since 18 December, but a hamstring injury will keep left-back Rico Henry out of the Spurs match.\nJanuary signing Michael Kayode could make his debut for the Bees in Sunday's game. Frank said: \"He is a young man, full of optimism and power and willingness to play and run. I like his approach a lot.\"\nFrank said of Spurs' recent form: \"We were also hit very hard by injuries last year so, from that perspective, I understand the situation Ange [Postecoglou] is in now at Tottenham. When results are also not going your way, that's tough. They're things we need to deal with as managers and I'm convinced that Ange is doing that well and he will get through it.\"\nOn the departure of full-back Mads Roerslev on loan to Wolfsburg: \"His journey has been incredible, starting in the B team. Every single time we called upon him, he never let us down. He said a few things after the game against Palace and it got emotional. It gives me goosebumps now. He is a fantastic example of what our environment and culture means. He deserves a lot of praise.\"", "url": "https://www.bbc.com/sport/football/articles/ce8566k9k84o"}