{"authors": ["Ali Speechly", "www.facebook.com"], "date_download": "2025-05-21 08:02:08", "date_modify": "2025-05-21 08:02:08", "date_publish": "2025-05-19 16:02:56", "description": "Tottenham player of the season: Make your choice for 2024-25", "filename": "sport_football_articles_c78jz0jj7z7o_1747814528.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6ded/live/057404b0-2ca9-11f0-b26b-ab62c890638b.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c78jz0jj7z7o_1747814528.html", "title": "Tottenham player of the season: Make your choice for 2024-25", "title_page": "Tottenham player of the season: Make your choice for 2024-25 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Lucas Bergvall\nBergvall has more than lived up to the promise he showed in pre-season. Not only has he excelled on and off the ball, he has never stopped striving for the win. When more seasoned professionals around him have struggled to lead the team, this young player has risen to the challenge.\nDejan Kulusevski\nDeki had a particularly strong start to the campaign and is integral to our pressing style and ball retention. Don't let his time out with injury shorten your memory - the Swede's statistics speak volumes as to his dominance in a Spurs shirt this season.\nDjed Spence\nA breath of fresh air and a much-needed injection of hope, Spence's performances this season have demonstrated what it means to play without fear. He has been a joy to watch as he took on the opposition with courage and creativity, driving us up the pitch at home and in Europe.\nDominic Solanke\nThe engine of our team, Solanke simply never gives up. Even when heads behind him in midfield have dropped, he has kept running, kept pressing, kept trying. Some will criticise the number of goals scored, but no-one should underestimate the crucial work Solanke has done off the ball for us this season.\nHonourable mentions\nBrennan Johnson still receives a mixed reception from some of the Spurs faithful, but you can't argue with his impressive goal contributions this season – not only the number, but the significance of some of the goals too. As for Archie Gray, what an outstanding first season from him - and in an unfamiliar position. Thrown in at the deep end, at times he outperformed his more experienced peers. To dare is to do, indeed.\nPick your 2024-25 Tottenham player of the season from our shortlist here", "url": "https://www.bbc.com/sport/football/articles/c78jz0jj7z7o"}