{"authors": ["Matthew Henry", "www.facebook.com"], "date_download": "2025-04-26 03:39:27", "date_modify": "2025-04-26 03:39:27", "date_publish": "2025-03-04 20:27:09", "description": "Australia captain Steve Smith lauds Virat Kohli as \"arguably the best chaser\" in history but what do the statistics say and what makes the India great so good?", "filename": "sport_cricket_articles_c9wp1d1gkjeo_1745638767.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d961/live/45e230e0-f931-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_cricket_articles_c9wp1d1gkjeo_1745638767.html", "title": "Champions Trophy 2025: India's Virat Kohli 'best ODI chaser', says Australia's Steve Smith", "title_page": "Champions Trophy 2025: India's Virat Kohli 'best ODI chaser', says Australia's Steve Smith - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Steve Smith knows a thing or two about scoring runs and was quick to praise one of his great batting rivals.\nVirat Kohli may not have taken his team to the finish line but the India great once again controlled a run-chase to ensure they beat Australia in Dubai to reach the Champions Trophy final.\n\"He's arguably the best chaser the game has seen,\" Smith said afterwards.\nThere is no 'arguably' needed. The statistics show Kohli is a phenomenon in pursuits...\nTo put it simply, yes.\nKohli, who scored 84 in India's pursuit of 265, averages 64.50 in one-day international run-chases, almost eight runs more than South Africa batter AB de Villiers who sits second on the list.\nHe has also scored 28 of his record 51 ODI centuries in chases, which is 11 more than former India team-mate Sachin Tendulkar.\nUnsurprisingly, Kohli's average improves further when in chases India go on to complete. He averages a massive 89.50.\nHe clinches India victory over and over and over again.\nKohli has an uncanny ability to take the pressure of the game on to his shoulders and accumulate runs.\n\"This game is all about pressure, especially big games like semis and finals and if you go deep enough into the innings, and you have enough wickets in hand, the opposition usually gives in and then the game becomes easier,\" he said after Tuesday's knock.\nKohli's great skill is his ability to rotate the strike.\nHe has scored the most singles in ODI history, seemingly always able to find the gaps to deny the opponent's attempt to build pressure.\nIf you only count the singles Kohli has scored in his 50-over international career (5,870) he would be third on England's all-time ODI run-scoring list.\n\"It's very important to control your impulses while the game is going on,\" said the 36-year-old.\n\"For me it's about knowing how many overs are left and number of runs left.\n\"Even if it (the required run-rate) comes to six per over, I'm not bothered as long as we have six or seven wickets in hand because then you know, two set batters can turn the game around and the opposition can only come to the game with wickets.\"\nMany teams, England included, have had plans to dismiss him with a fifth-stump line and it has worked in recent times in Tests.\nBut in ODIs after the new-ball phase, Kohli averages more than 50 against balls in 'the channel' outside off stump against the white-ball.\nIf you don't get him early with that plan, give up.\nKohli was typically efficient when rotating the strike against Australia with his dot-ball percentage just 33%.\nIn comparison, New Zealand batter Kane Williamson's figure was 57.5% when the Black Caps were chasing 250 to beat India at the same ground on Sunday.\nEven without hitting boundaries, Kohli kept the score moving.\nHe also came into the match in a tricky run against leg-spin and against Australia's biggest threat Adam Zampa in particular, who had dismissed him five times in previous ODIs.\nZampa eventually made that six but not before Kohli had taken India within sight of victory.\nHe faced 24 balls from Australia's off-spinner and played 14 of those deliveries for singles or dot balls.\nThe only other two were the two shortest deliveries Kohli received from Zampa, which he latched on to and pulled for four.\nIn the end the only surprise was that he did not reach three figures.\n\"When you don't think of the milestones, they just happen along the way to victory,\" Kohli added.\n\"For me it's all about taking pride in the victory and doing what's best for the team and if I get to the three-figure mark then great, if not, nights like these you win, it's a happy dressing room.\n\"Those things don't matter anymore. It's about stepping up and hopefully doing the job for the team.\"", "url": "https://www.bbc.co.uk/sport/cricket/articles/c9wp1d1gkjeo"}