{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:51:22", "date_modify": "2025-05-21 06:51:22", "date_publish": "2025-03-29 22:27:26", "description": "World number one Aryna Sabalenka claims her second title of the year by beating Jessica Pegula 7-5 6-2 in the women's Miami Open final.", "filename": "sport_tennis_articles_cy8e49811l5o_1747810282.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3700/live/5c0ffbb0-0ce9-11f0-8e1d-3f217a341f2f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_tennis_articles_cy8e49811l5o_1747810282.html", "title": "Aryna Sabalenka powers to Miami Open final win against Jessica Pegula", "title_page": "Aryna Sabalenka powers to Miami Open final win against Jessica Pegula - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "World number one Aryna Sabalenka claimed her second title of the year by beating Jessica Pegula 7-5 6-2 in the Miami Open women's final.\nThere were seven breaks of serve in a hard-fought first set, which swung the way of both players, before the Belarusian won a game to love on Pegula's serve.\nSabalenka's power got her out of trouble on a number of occasions while Pegula's struggles to hold her own serve, along with her inability to deal with the force of her opponent's game, proved the world number four's downfall.\nHer frustration grew as Sabalenka took control of the second set. The 26-year-old broke Pegula at 5-2 up to win the tournament without dropping a set as she hit 31 winners in the match, compared to 12 from her rival.\nSabalenka won the Brisbane International in January but had gone into the Miami Open final having lost her previous two finals, with defeats by American Madison Keys at the Australian Open and Mirra Andreeva at Indian Wells two weeks ago.\n\"I'm speechless,\" said Sabalenka, who beat Pegula in last year's US Open final. \"The last couple of finals were really tough and tight and close ones for me, so going into this one I was so focused on myself.\n\"I was super focused and playing point by point. It feels super special and really happy with the title - the first in Miami.\n\"It was back and forth the whole match. I was fighting no matter what and, even after each game she broke, I was fighting back and breaking her back.\"\nMeanwhile, British duo Julian Cash and Lloyd Glasspool were in action in the men's doubles final but suffered a 7-6 (7-3) 6-3 defeat by top seeds Marcelo Arevalo-Gonzalez and Mate Pavic.", "url": "https://www.bbc.com/sport/tennis/articles/cy8e49811l5o"}