{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:39:16", "date_modify": "2025-05-19 15:39:16", "date_publish": "2017-08-17 18:24:41", "description": "Kris Meeke suffers another crash in this year's World Rally Championship after a first-stage mishap in Germany.", "filename": "sport_motorsport_40967648_1747669156.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/14106/production/_97128128_meeke_epa.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_motorsport_40967648_1747669156.html", "title": "Kris Meeke: Northern Irish driver crashes again on opening stage in Rally Germany", "title_page": "Kris Meeke: Northern Irish driver crashes again on opening stage in Rally Germany - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Kris Meeke has suffered another crash in this year's World Rally Championship after a first-stage mishap in Germany.\nThe Dungannon driver clipped the inside of the barrier on the first super special stage which resulted in him breaking his right front suspension.\nMeeke will resume action on Friday but a 10-minute penalty means he has no chance of a high finish this weekend.\nThe Northern Irishman has crashed out in Monte Carlo, Sweden, Argentina, Portugal and Italy this season.\nThose crashes, all from top-five positions, resulted in the 38-year-old being dropped for Rally Poland earlier this summer.\nHe returned to the cockpit of his Citroen for Rally Finland, where he trundled home in a low-key eighth place.\nHowever this latest crash will put more pressure on Meeke from his team, who had nine-time WRC champion Sebastien Loeb testing the C3 before the rally in a bid to improve the car's handling problems.\nMeeke did win Rally Mexico during the Spring but only after a dramatic finish as he somehow recovered from coming off the road in the closing kilometre.\nOtt Tanak set the fastest time around the Saarbrucken stage on Thursday with team-mate Sebastien Ogier going third fastest as Citroen's Irish driver Craig Breen split the M-Sport duo to lie second.", "url": "https://www.bbc.com/sport/motorsport/40967648"}