{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:48:40", "date_modify": "2025-05-20 11:48:40", "date_publish": "2023-08-07 10:15:37", "description": "Arsenal: Community Shield win will 'mean a lot'", "filename": "sport_articles_c512z2vdr78o_1747741720.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/336e/live/4afd2300-350b-11ee-a619-75b3fc5f3e46.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c512z2vdr78o_1747741720.html", "title": "Community Shield win will 'mean a lot'", "title_page": "  Arsenal: Community Shield win will 'mean a lot' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Winning the Community Shield against Premier League champions Manchester City will do a lot for Arsenal's mindset and belief, says former Leicester manager Craig Shakespeare.\nManager Mikel Arteta's joy was visible after both Leandro Trossard's late equaliser and Fabio Viera's winning penalty as the Gunners secured a psychological victory over a side who overtook them to claim the title last season.\n\"I think you could see (the reaction) from not only the coaching staff and the manager but the players and the fans,\" Shakespeare told BBC Radio 5 Live's Football Daily podcast.\n\"I think they had an intent to come here, put on a performance, and hopefully win the Community Shield. They won't mind how they've won it. As a mindset thing - what it does for their belief - that will be good.\n\"There wasn't a lot in the game, it wasn't a great game, but for Arsenal to come out as winners - that will mean a lot to the club.\"\nFormer Premier League striker Dion Dublin agreed, believing that the result will matter more to Arsenal than City.\n\"It's a bit of momentum,\" he added. \"You go into the training ground with a smile on your face.\n\"It's not of huge significance to City to lose that one, however for Arsenal to win means more.\"", "url": "https://www.bbc.com/sport/articles/c512z2vdr78o"}