{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:15:49", "date_modify": "2025-05-20 13:15:49", "date_publish": "2023-08-02 14:42:55", "description": "Livingston will 'give it a right good go', despite 'tough' summer", "filename": "sport_articles_cnk2gnzn9ppo_1747746949.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/69de/live/9c495c00-3142-11ee-8f52-fbf70e4bf742.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cnk2gnzn9ppo_1747746949.html", "title": "Livingston will 'give it a right good go', despite 'tough' summer", "title_page": "Livingston will 'give it a right good go', despite 'tough' summer - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "David Martindale says Livingston have enough to be competitive again in the Scottish Premiership, despite a challenging transfer window.\nThe West Lothian side have seen several first-team players depart, and operate on one of the Scottish Premiership's tightest budgets.\n“We’ve lost a lot of players, but I’m more than confident that with what we’ve got in the building that we’ll give it a right good go this season,\" Martindale said.\n“It’s been a hard slog this summer, but I always knew that was going to be the case.\n“I’ve spoken to six players from the Championship and Scottish Premiership that I would consider to be good players for us, and I’ve not been able to financially attract them to the club.\n“This year I’ve found it difficult to attract Scottish players from within the game in Scotland, maybe these players would tell you something different, but the money plays a huge part, players have got short careers.\n“I’d be a hypocrite to decry anybody for going and taking the money elsewhere.\n“This has been the toughest [summer], it’s been the first summer where we’ve sat down as a club and said that the budget needs cut.\n“The loan market [within Scotland] is one we’re forced to look into; bringing a player from England there’s relocation costs and accommodation on top of his wages. Bringing a player that doesn’t have a UK passport you’ve got all that again, plus work permit costs.\n“I think there’s enough there to be competitive, but would I like another couple of additions - of course I would.\n“I’m looking forward to the season, but I’m pragmatic and realistic enough to know it’s going to be a difficult season.”", "url": "https://www.bbc.com/sport/articles/cnk2gnzn9ppo"}