{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:01:38", "date_modify": "2025-04-26 04:01:38", "date_publish": "2025-03-07 00:00:00", "description": "Norwich City miss the chance to close within one point of the Championship play-off places as they are held at home by Oxford United.", "filename": "sport_football_live_cx2xj35282vt_1745640098.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d171/live/6e8a4190-fb98-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_cx2xj35282vt_1745640098.html", "title": "Championship: Norwich City 1-1 Oxford United", "title_page": "Championship: Norwich City 1-1 Oxford United - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "With Norwich boss Johannes Hoff Thorup making five changes to his starting line-up, including the loss of goalkeeper Angus Gunn to a hamstring injury and dropping captain Shane Duffy to the bench, the home side had an unfamiliar look to it.\nBut the Canaries came out of the blocks quickly to get their noses in front.\nFisher was set free down the right and his pinpoint cross arrived at the feet of Sargent, who made no mistake from barely six yards to register his eighth goal in eight matches.\nOxford almost struck back immediately but Harris and Ole Romeny both failed to get on the end of an inviting Ciaron Brown cross.\nNorwich failed to heed the warning, though.\nVaulks' long throw caused the hosts trouble all evening and his very first missile into the Canaries box led to the equaliser.\nJack Stacey headed the ball against the back of team-mate Anis Ben Slimane and Harris pounced to notch his sixth goal of the season but his first since 26 December.\nAnother Vaulks throw almost had Oxford in front midway through the first period with home defender Callum Doyle heading just past his own post.\nSargent then had what he thought was his second goal of the night chalked off for offside just before the interval as Norwich finished the first period strongly.\nThey dominated much of the second period but struggled to create clear-cut chances against a resolute and well-drilled visiting defence.\nAnte Crnac saw two efforts saved by Cumming before substitute Oscar Schwartau shot weakly straight at the goalkeeper.\nCumming saved his best for the the final minute as the Championship's joint-top scorer Sainz burst into the 18-yard box but, from a narrow angle, saw the left boot of the U's keeper deny him what would surely have been the winner.\nNorwich are three points short of the top six before Saturday's games while for Oxford it is now eight games without a win, but this could prove a precious point as they edge towards safety on their return to the second tier of English football.\nNorwich head coach Johannes Hoff Thorup speaking to the media after the game:\n\"I look at it where we can do better - we have to win nine out of 10 games like tonight and it seems not winning games like that happens too much to us.\n\"I'm pleased with a lot of things we did but there's a lack of killer instinct.\"\nOn the absence of captain Shane Duffy from the starting line-up:\n\"Shane was late for the team meeting. I set a culture for a football team and tell the players how we run things.\n\"It's unfortunate for Shane and he didn't do it on purpose but we've made it clear incidents like that cannot happen on game day.\n\"There is room for mistakes but in my view mistakes should be followed by consequences.\"\nOxford boss Gary Rowett told BBC Sport:\n\"Recently we haven't had the results to go with the performances.\n\"I felt we'd lost a bit of confidence and momentum and sometimes you need a performance like that and I thought we nullified a lot of what they did.\n\"After conceding so early we showed a lot of character - I'm really proud of the players.\"", "url": "https://www.bbc.co.uk/sport/football/live/cx2xj35282vt"}