{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:26:10", "date_modify": "2025-05-21 05:26:10", "date_publish": "2025-02-07 16:53:59", "description": "YouTuber-turned-boxer Jake Paul claims Saul 'Canelo' Alvarez \"ducked\" him after talks for a potential fight between the pair broke down.", "filename": "sport_boxing_articles_c4g9v34mgpro_1747805170.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1473/live/64c98bd0-e571-11ef-8b8c-73fc0bbdc30b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_boxing_articles_c4g9v34mgpro_1747805170.html", "title": "Jake Paul: Saul 'Canelo' Alvarez 'ducked me', says Youtuber-turned-boxer", "title_page": "Jake Paul: Saul 'Canelo' Alvarez 'ducked me', says Youtuber-turned-boxer - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "YouTuber-turned-boxer Jake Paul has claimed Saul 'Canelo' Alvarez \"ducked\" him after talks for a potential fight between the pair in May broke down.\nMexico's four-weight world champion Alvarez was reportedly in \"deep negotiations\" to face novice Paul on Cinco De Mayo weekend in Las Vegas, according to Most Valuable Promotions, Paul's promotional company.\nBut in a U-turn on Thursday, Alvarez, 34, instead agreed a four-fight deal with Saudi Arabia's Riyadh Season, to set up a super-fight with fellow boxing superstar Terence Crawford in September.\n\"Canelo Alvarez ducked me,\" American Paul said on Instagram.\nThe 28-year-old added: \"It's not surprising when his whole career he has done nothing for the sport of boxing outside the ring. I'm the new face of boxing.\"\nPaul, who found fame by posting prank videos on YouTube, has amassed a record of 11 wins and one career defeat, that came to Briton Tommy Fury in 2023.\nHis victories have mostly come against ex-UFC fighters, while in November he outpointed a 58-year-old Mike Tyson.\nThe win against the former heavyweight world champion was streamed to a huge global audience on streaming giant Netflix.\nAlvarez, meanwhile, is one of the sport's most accomplished active fighters and the current unified super-middleweight champion.\n\"You cannot have the biggest fight of 2025 without my name involved. When all of your events tank and lose money you will all realise who the king of the sport is,\" Paul said.\nMVP said it remained in discussions with \"multiple high-profile opponents\", adding: \"Jake Paul isn't going anywhere, and neither is MVP. We'll continue to disrupt boxing, on our terms.\"", "url": "https://www.bbc.com/sport/boxing/articles/c4g9v34mgpro"}