{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:22:48", "date_modify": "2025-05-21 04:22:48", "date_publish": "2025-02-09 10:46:25", "description": "Georgia Roche is set to make her first England appearance in 16 months after being named in a squad to face Australia that also includes uncapped pair Jas Bell and Jenna Foubister.", "filename": "sport_rugby-league_articles_c5ydzrj825lo_1747801368.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8412/live/8169c280-e6d1-11ef-a819-277e390a7a08.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-league_articles_c5ydzrj825lo_1747801368.html", "title": "England v Australia in Las Vegas: Georgia Roche returns, Jas Bell and Jenna Foubister called up", "title_page": "England v Australia in Las Vegas: Georgia Roche returns, Jas Bell and Jenna Foubister called up - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Georgia Roche is set to make her first England appearance in 16 months after being named in a squad to face Australia that also includes uncapped pair Jas Bell and Jenna Foubister.\nNewcastle Knights half-back Roche, 24, missed her country's two Tests in 2024 because of club commitments in Australia.\nEngland will play Australia on 1 March (02:00 GMT 2 March) as part of a programme of four rugby league matches being staged at Allegiant Stadium in Las Vegas.\nThere will also be a men's Super League match between Wigan Warriors and Warrington Wolves and two NRL fixtures - Canberra Raiders facing New Zealand Warriors and Penrith Panthers v Cronulla-Sutherland Sharks.\nProp Bell, 26, is called up to the 20-strong squad for the trip to Las Vegas after helping York Valkyrie retain the Women's Super League title with a Grand Final win over St Helens in October.\nFoubister, 18, is one of two Wigan players in the party, along with Anna Davies, who scored five tries when England recorded their biggest-ever win last November, beating Wales 82-0 at Headingley.\nGeorgie Dagger, another member of York's Grand Final-winning side, returns to the set-up.\nThe 27-year-old, formerly known as Georgie Hetherington, missed the win over Wales as it was the day she married her partner Will Dagger, who plays in the men's Championship for York Knights.\nHead coach Stu Barrow has cut 11 players from the 31-strong training squad he named in November.\nAmong the players to miss out are Huddersfield full-back Amelia Brown, who scored a hat-trick of tries on her debut against Wales in November, former England captain Emily Rudge and Wigan teenager Isabel Rowe, who made her first two international appearances last year.\nBarrow said: \"It's been a really difficult selection process because there is a lot of talent within the group, which means there are some very good players who will unfortunately miss out.\n\"Now we have to focus on the challenge that lies ahead which is a historic fixture against the world champions for the first time since 2017 and I'm very much looking forward to getting the group together for our final camp next weekend.\"\nOpponents Australia have been thrown into turmoil in the build-up to the match, with head coach Brad Donald resigning on Friday.\nDonald, who had been in charge since 2016 and led the Jillaroos to two World Cup final victories, is reportedly being investigated by the NRL after allegations he made a disparaging comment about a journalist in front of players.\nJess Skinner, who was Donald's assistant, will take interim charge of Australia for the Test in Las Vegas.", "url": "https://www.bbc.com/sport/rugby-league/articles/c5ydzrj825lo"}