{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:35:00", "date_modify": "2025-05-21 04:35:00", "date_publish": "2025-04-04 18:15:32", "description": "Jordan Cox scores the ninth first-class century of his career as Essex make county champions Surrey toil at Chelmsford.", "filename": "sport_cricket_articles_c0q1k7gl873o_1747802100.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a28e/live/ff3dd510-117a-11f0-bef7-27730fea7c1a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c0q1k7gl873o_1747802100.html", "title": "County Championship: Jordan Cox helps Essex dominate Surrey", "title_page": "County Championship: Jordan Cox helps Essex dominate Surrey - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jordan Cox made sure his name remained on the England selectors' radar with the ninth first-class century of his career, and fifth inside a year since joining Essex, as reigning champions Surrey toiled under bright Chelmsford skies.\nCox was on the cusp of an England debut in New Zealand last autumn before the 24-year-old suffered another injury setback.\nBut a swashbuckling 117 from 148 balls in the opening Rothesay County Championship match of the season can only have helped his cause ahead of a year in which England face first Zimbabwe and then India and Australia.\nHis powerful innings overshadowed an otherwise excellent 95 from makeshift opener Paul Walter. The 30-year-old left-hander, better known for his big-hitting exploits in T20 cricket, fell just short of what would have been only his third red-ball century.\nWalter's stands of 78 with rookie opener Charlie Allison and 100 with Cox, along with Cox's 92 with Matt Critchley, underpinned an Essex total of 356-4 on the first day against a Surrey pace attack devoid of the likes of Gus Atkinson, Dan Worrall and Tom Lawes. Kemar Roach added some respite with 2-54 from 18 overs.\nEssex had won the toss and elected to bat on a benign green-top in front of a bumper home crowd of 2,370.\nWalter set the tone by marching to his fifty from 58 balls when he turned James Taylor off his legs for a single.\nHe had dominated the first hour as Charlie Allison marked his first-class debut in look-and-learn mode.\nThe 20-year-old, replacing Dean Elgar at the top of the order while the South African becomes used to the idea of being a father of twins, took 38 balls before hitting his first boundary, a square drive off Matt Fisher that took his score into double figures.\nThe first-wicket stand ended when Dan Lawrence entered the Surrey attack and with his fourth delivery had Allison lbw for 25, playing down the wrong line, much to the delight of the former Essex man.\nWhere Walter had been dominant in the opening stand, he became becalmed in the fifties either side of lunch as Tom Westley briefly took centre stage. The Essex captain rolled his wrists to turn Taylor through midwicket for four and later thick-edged Lawrence past a despairing slip.\nWestley contributed 40 towards a 48-run second-wicket stand before turning Roach into short midwicket's hands. Walter added just five to his total in that 16-over partnership but then opened his shoulders and square-cut the first ball after Westley's departure for his 10th four.\nThere was greater equality between the third-wicket pair with Walter and Cox trading blows. Some of Cox's hitting was effortless with no discernible back-lift, most notably his ninth boundary, a drive that scorched past mid-off, and brought up his half-century from 77 balls.\nThe century partnership was reached with a single from Walter, but two balls later he gave Fisher his first Surrey wicket since the winter move from Yorkshire, when mis-hooking to Ben Foakes diving full-length down legside. Walter's innings had lasted 172 balls and included 14 fours.\nCox took up the cudgels immediately after tea, hitting Roach to three different parts of the boundary in an over. There was a strange incident just before Cox reached three-figures when he appeared to hit Foakes with his bat as the ball lobbed towards the wicketkeeper. No censure ensued and the century duly arrived with a straight drive off Lawrence for his 18th four.\nCox added three more boundaries before he was beaten for pace by Roach to end a stay of a tad over three hours.\nIt was just left to Critchley to confirm Essex's domination as the sun went down with three successive fours off the expensive James Taylor and reach the close on 45 not out.", "url": "https://www.bbc.com/sport/cricket/articles/c0q1k7gl873o"}