{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:43:42", "date_modify": "2025-05-21 03:43:42", "date_publish": "2025-01-05 10:46:38", "description": "Belfast featherweight boxer Michael Conlan says that \"the only reason\" he is still boxing is to win a world title.", "filename": "sport_boxing_articles_c5yvn2e9rl2o_1747799022.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b6b2/live/dad0ee40-cb81-11ef-87df-d575b9a434a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_boxing_articles_c5yvn2e9rl2o_1747799022.html", "title": "Michael Conlan: Belfast boxer aiming for March return with world title in mind", "title_page": "Michael Conlan: Belfast boxer aiming for March return with world title in mind - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Belfast featherweight Michael Conlan says \"the only reason\" he is still boxing is to win a world title.\nConlan last fought in December 2023 when he suffered a knockout defeat by Jordan Gill.\nThe 33-year-old’s seventh-round stoppage by Gill came after world title defeats by Leigh Wood and Luis Alberto Lopez.\nAnd after a year out of the ring when it looked like his career may be over, the Belfast native is targeting a return in 2025 as he looks to work his way back into world title contention.\n\"[Winning a world title] is the only reason I'm still boxing, I still want to be a world champion, and I still believe I have the ability to go and do that,\" he told BBC Sport NI.\n\"This is the trial to get back to that.\"\nConlan is aiming for a number of fights this year, starting with a bout in March, and believes he is ready to get back in the ring after a long absence.\n\"Most likely I'll be back out in March, a comeback style fight, 8-10 rounds, get that one done and probably fight another three times so four times in total this year,\" he added.\n\"It will be a busy one which I need after a nice break and now I'm back at it.\"\nThe Olympic bronze medallist says that there were \"ups and downs\" during his year off in 2024, but that the break was hugely beneficial.\n\"It wasn't the best year of my life, there was stuff that happened, that is life, but it was also very enjoyable to have some rest, and I think it's done me the world of good,\" Conlan said.\n\"It is the longest I've ever had off from boxing, the body has been rested, the mind has been rested and now I'm hungry to get back and get the job done.\"", "url": "https://www.bbc.com/sport/boxing/articles/c5yvn2e9rl2o"}