{"authors": ["Jonathan Sutherland", "www.facebook.com"], "date_download": "2025-05-21 05:37:50", "date_modify": "2025-05-21 05:37:50", "date_publish": "2025-04-01 07:06:31", "description": "Kris Doolan believes budget cuts and a failure by the club to strengthen in January were key factors that led to his sacking as Partick Thistle manager.", "filename": "sport_football_articles_cd7vx5jl3lwo_1747805870.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/35f5/live/13e68560-0e5c-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cd7vx5jl3lwo_1747805870.html", "title": "Partick Thistle: Kris Doolan puts exit down to lack of signings", "title_page": "Partick Thistle: Kris Doolan puts exit down to lack of signings - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Kris Doolan believes budget cuts and a failure by the club to strengthen in January were key factors that led to his sacking as Partick Thistle manager.\nSpeaking for the first time since leaving the club, Doolan, 38, indicated uncertainty behind the scenes also took a toll on the players.\nThe fans' favourite and assistant Peter MacDonald had their contracts terminated in February after a run of four matches without a win and the Jags sitting fourth in the Scottish Championship table.\nUnder interim management team Brian Graham and Mark Wilson, Thistle are still fourth and on course for the promotion play-offs after a six-game unbeaten run.\n\"We will move on but I am gutted, I wanted to get the club to the Premiership,\" Doolan told BBC Scotland.\n\"Decisions are made behind the scenes for whatever reason, whether that is financial reasons or other bits of decision making that go on in club boards.\n\"If you are in the play-off positions how many managers lose their jobs? But I also understand that if Partick Thistle slip out of the play-offs there are financial repercussions.\"\nDoolan took over from Ian McCall in 2023 and led the Firhill side to the Premiership play-off final, eventually losing out to Ross County on penalties.\nIn the following season Thistle reached the play-off semi-final, where they lost to Raith Rovers on spot-kicks.\nThe former Thistle striker was confident he would have guided the team to the play-offs again this season had he had remained in post.\n\"If the club had finished fifth, I would have walked away,\" Doolan said.\n\"I was told to make the play-offs. If we didn't make the play-offs I would have put my hands up and I would have been the one that walked away and saved the club money.\n\"Had we strengthened in January, those [last few] results I think would have been different.\n\"I know how to guide the team to the play-offs. Through good and bad, even with things going on in the background, decisions going on behind me - I still could keep my focus.\"\nDoolan voiced his belief at the turn of the year that Partick Thistle could still play a part in the title race.\n\"We moved eight or nine players in December/January time and didn't bring anybody in,\" he explained. \"It was just the club having to claw back money.\n\"You free up money on the playing side to bring in the players to make you stronger for the next half of the season. But when you free up that money and there is no money to spend you are running with eight players less.\n\"And we sell Harry Milne, who I think is probably one of the best left backs outside the top half of the Premiership. I think he will be brilliant at Hearts.\n\"The three above [Ayr United, Livingston and Falkirk] strengthened massively in January. The teams below strengthened in January.\n\"We didn't have the finances available to go and do it. To not strengthen in January I think was a big mistake for the club, and I explained that.\n\"Regardless of what is happening behind the scenes it is always the manager that will pay the price.\"", "url": "https://www.bbc.com/sport/football/articles/cd7vx5jl3lwo"}