{"authors": ["Marissa Thomas", "www.facebook.com"], "date_download": "2025-04-26 07:53:21", "date_modify": "2025-04-26 07:53:21", "date_publish": "2025-02-25 14:01:03", "description": "Ange Postecoglou press conference: Tottenham Hotspur vs Man City", "filename": "sport_football_articles_ce8y55pp443o_1745654001.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f21e/live/f7d58710-6de1-11ef-8c32-f3c2bc7494c6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_ce8y55pp443o_1745654001.html", "title": "Ange Postecoglou press conference: Tottenham Hotspur vs Man City", "title_page": "Ange Postecoglou press conference: Tottenham Hotspur vs Man City - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "First up, there was a team news update: \"Everyone who played [against Ipswich at the weekend] got through really well, and it will be a similar sort of squad for tomorrow.\"\nBen Davies won't be available for the game but Postecoglou provided a positive update on other members of the squad by saying that Richarlison, Cristian Romero, Dominic Solanke and Micky van de Ven are \"all tracking really well\" with returns targeted for the \"next seven to 10 days\".\nOn Manchester City: \"You're always looking forward to the challenge. Manchester City are an outstanding football club. Great manager, still got great footballers and still play really challenging football to any opponent.\"\nPostecoglou added: We've enjoyed our games against them, whether that was this year or last year. They're going to try and win, they're going to try and play expansively and we are going to try and do the same. It's going to be a good test for us.\"\nMidfielder Rodrigo Bentancur's contract expires at the end of next season so Postecoglou was asked about that and also how good he has been for Spurs: \"Rodri has been great. In terms of his contract situation, that is handled by other people. In this later period, he is really getting back to the levels he wants to be at. He just needs regular game time and he is getting up to speed. Really good guy around the group and he's experienced now. From our perspective, in this run-in, he's going to be really important.\"", "url": "https://www.bbc.co.uk/sport/football/articles/ce8y55pp443o"}