{"authors": ["Ged Scott at the CBS Arena", "www.facebook.com"], "date_download": "2025-05-21 05:48:47", "date_modify": "2025-05-21 05:48:47", "date_publish": "2025-02-08 19:36:27", "description": "Frank Lampard admits Coventry's squad has been \"stretched\" in recent weeks as they were knocked out of the FA Cup by Premier League Ipswich Town.", "filename": "sport_football_articles_cp8qr95pv6do_1747806527.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/57b7/live/a34ef090-e64b-11ef-9599-e17f838b4873.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cp8qr95pv6do_1747806527.html", "title": "Coventry City: Frank Lampard hopes to have missing men back soon", "title_page": "Coventry City: Frank Lampard hopes to have missing men back soon - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Coventry City boss Frank Lampard is looking to the return of certain key players to give his side much-needed impetus after the jolt of successive home defeats.\nAfter being beaten 2-0 by Championship leaders Leeds United on Wednesday night, City found a largely second-string Ipswich Town side too strong for them, winning 4-1 to end any interest in the FA Cup for last season's beaten semi-finalists.\nLampard felt the final scoreline was harsh on Coventry, who had more shots at goal. But he knows his side will benefit from the return of cup-tied new signing Matt Grimes at home to QPR this Tuesday night.\nHe will also have Milan van Ewijk back and possibly fellow full-back Jack Bidwell, but believes it is too soon for Haji Wright, Ephron Mason-Clark and Ben Sheaf.\n\"The squad is a bit stretched,\" he told BBC CWR. \"Haji, Ephron and Ben are coming back soon but not yet.\n\"Jake was still feeling his adductor, a problem he felt in the Leeds game. And Milan plays every game and pretty much every minute. He just felt a bit of fatigue and we need him fresh for QPR.\n\"We've been on a good run but this was always going to be a tough couple of games against Leeds, who are top of the Championship, and a Premier League side in Ipswich. And it was great to have 30,000 here watching it. The crowd were great.\n\"Ipswich have strengthened since they went up. They were fantastic last year. Then they recruit to compete in the Premier League, which is a gap.\n\"They have the squad to make those changes. And they didn't have midweek games either side of this game like we have.\n\"But we showed character to come back from that early penalty to level. They just took their chances. Sometimes things happen to influence games. They took advantage and we didn't. And we have to eradicate our errors.\n\"It was a competitive game. The scoreline doesn't really reflect the game. What I saw was not a team that wilted to a Premier League team.\"", "url": "https://www.bbc.com/sport/football/articles/cp8qr95pv6do"}