{"authors": ["Tom Mallows", "www.facebook.com"], "date_download": "2025-05-20 13:34:10", "date_modify": "2025-05-20 13:34:10", "date_publish": "2023-07-24 13:56:41", "description": "Why is there no reserve day for Ashes Tests? And what else can be done when it rains at the cricket?", "filename": "sport_cricket_66289926_1747748050.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/144FF/production/_130499138_gettyimages-1565362039.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66289926_1747748050.html", "title": "The Ashes: Why does rain stop cricket and what can be done?", "title_page": "The Ashes: Why does rain stop cricket and what can be done? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "After the fourth Ashes Test washout at Old Trafford ended England's hopes of winning the Ashes back from Australia, debate about how rain impacts Test cricket has rumbled on.\nAustralia will retain the urn even if England level the five-Test series at 2-2 with victory at The Oval. That is a hugely anticlimactic end to what has been a thrilling summer of Test cricket.\nIt left people asking the same questions: Why does rain stop cricket? Why was there not a reserve day? What can been done to speed up cricket?\nThis is not the first time rain has affected an Ashes series - England kept the urn courtesy of a soggy Old Trafford draw in 2013 - but it has once again sparked conversations about what cricket can do to try and avoid such scenarios in the future.\nECB chairman Richard Thompson says he wants a \"conversation\" about \"more flexible\" schedules, claiming England has \"elevated and reinvented the way Test cricket is played\" generating \"more excitement and interest\".\nThere are straightforward practical reasons for this: player safety is paramount.\nThe outfield would become slippery in the rain so it would be dangerous for players fielding the ball, bowlers running in to bowl and batters running between the wickets to score runs.\nThe ball, pitch and outfield would also be damaged by the rain, further ruining the spectacle.\nPlay can continue in light rain, but it is ultimately for the umpires to decide whether it is safe.\nCovers are moved onto the pitch and the bowlers' run-up area when it rains to protect them. The outfield remains uncovered but 'super soppers' and the excellent draining at most modern Test grounds mean it can dry quite quickly once it has stopped raining.\nThe World Test Championship final between Australia and India in June had a reserve day because it was a one-off match to determine the champion at the end of a two-year cycle.\nBut in a Test series the draw is a legitimate result, whether the match is hindered by weather or not. You do not just keep playing until one side wins.\nA reserve day would also mean players, coaches, officials, venues, security and catering staff would have to make themselves available. But the increasingly packed cricket schedule means there is unlikely to be enough time to effectively turn five-day Test matches into six-day ones.\nThis Ashes series is being played over a six-week period in June and July to free up August for the third edition of the Hundred, which begins the day after the schedule fifth day at The Oval.\nThere are also Twenty20 internationals, one-day internationals and other domestic competitions to consider when organising a schedule, as well as the additional cost of booking venues, security and catering for an extra day that may not even happen.\nDespite the frustration, England captain Ben Stokes is against the idea, telling Sky Sports:, external \"I probably wouldn't be on the side of saying there should be reserve days. Test cricket is five days.\"\nIt has long been suggested that cricket follows tennis by putting a roof over cricket grounds - and this has been experimented with in the UK., external But cricket grounds are considerably larger than other sports stadiums, meaning there are both design and cost issues that would make such an idea mostly unfeasible.\nCricket is also a sport that relies on outdoor conditions which would be lost if you made it an indoor game. That includes the grass on the pitch, which is carefully prepared by the ground staff and would not grow as well in artificial conditions.\nThen there is the question of what happens if a batter hits the roof with the ball. Six runs and out?\nWith the Manchester rain having been widely forecast, it has been suggested more play could have been tagged on to the first three days, either through earlier starts, late finishes or both.\nThere are supposed to be 90 overs bowled in a day of Test cricket. The scheduled hours of play for this series are 11:00-18:00 BST split into three sessions, with an extra half an hour allowed at the end of the day to try to reach that 90-over mark. Any overs not bowled are then lost to the match.\nThere are also two scheduled breaks, lunch at 13:00-13:40 and tea at 15:40-16:00. The match is also paused for a brief drinks break halfway through each session.\nIn theory, time could be added at each end of the day, particularly given the long daylight hours during a British summer, something suggested by England batter Joe Root on Sunday.\n\"It doesn't get dark here in England until 10pm in the summer, why can't we just play until we bowl the overs?\" Root told BBC Test Match Special. \"There are so many different ways of trying to find opportunities to get as much play in as possible.\"\nHowever, you can never be sure exactly how much play will be lost in the future, so you cannot accurately judge how many extra overs to play in the days beforehand.\nThen there is the physical toll that comes with players being asked to play extra-long days, particularly with an already packed summer schedule.\nThere are also the same practical issues involving broadcast scheduling, catering and security that would make it difficult to change the hours of play at short notice, not least for ticket holders for example, who may have pre-arranged transport or accommodation.\nHowever, some flexibility on this issue may be possible.\nDuring a brief window of dry weather on Sunday it was announced that the players would take lunch at 12:20 before resuming at 13:00, leaving former England international Phil Tufnell puzzled on Test Match Special.\nIf you cannot change the hours of play, you can make efforts to speed it up to make sure the allotted 90 overs are bowled.\nThat target was never reached during the first three days of the Old Trafford Test, and England and Australia were both fined for slow over rates during the first Ashes Test at Edgbaston.\nIt has been suggested that run penalties instead of fines for slow over rates would encourage teams to play as quickly as they can.\nFewer stoppages and shorter lunch and tea breaks have all been mooted to ensure that, when it is dry, we see as much play as possible.", "url": "https://www.bbc.com/sport/cricket/66289926"}