{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:32:15", "date_modify": "2025-05-20 13:32:15", "date_publish": "2023-08-01 19:02:50", "description": "Linfield sign Dungannon winger Darragh McBrien on a two-year contract, with Ethan Devine joining Swifts on a season-long loan deal.", "filename": "sport_football_66376394_1747747935.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1548C/production/_130608178_darraghmcbrien.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66376394_1747747935.html", "title": "Linfield: Winger Darragh McBrien signs from Dungannon as Ethan Devine joins Swifts on loan", "title_page": "Linfield: Winger Darragh McBrien signs from Dungannon as Ethan Devine joins Swifts on loan - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Linfield have signed highly-rated Dungannon Swifts winger Darragh McBrien on a two-year contract.\nThe 21-year-old Fermanagh native is fit again after recovering from a long-term injury.\nLinfield forward Ethan Devine has moved in the opposite direction, joining the Swifts on a season-long loan deal.\n\"Darragh is a forward I've admired for some time and who I'm looking forward to integrating within our squad,\" said Linfield manager David Healy.\n\"He will certainly strengthen the squad and increase the competition for places within the group,\" added Healy.\n\"He's had a tough year with injury but he's back to full fitness and looking forward to getting started with us, ahead of the new season.\n\"Darragh brings pace, power and goals and I've every confidence that he will make a significant contribution to the club over the duration of his contract.\"\nLinfield had already added Daniel Finlayson, Jack Scott, John Robertson and Matthew Fitzpatrick to their squad for the forthcoming Irish League season.\nDevine joins a lengthy list of arrivals at Swifts this summer, including Conor Mitchell, Niall Owens, Chris Hegarty, Kealan Dillon, Ryan Harpur and teenage winger Matt Lusty on loan from Larne.\nDungannon open their top flight campaign with a visit to champions Larne on Monday 7 August, while Linfield travel to Stangmore Park to face Dungannon in their first league fixture on Saturday 12 August.\nMeanwhile Coleraine have added two defenders to their squad prior to their first league match of the season at home to Ballymena United on Friday night.\nThe Bannsiders have snapped up ex-Rangers, Derry City and Glentoran centre-back Darren Cole and Portstewart teenager Jake Wallace, who was most recently at League One side Fleetwood Town.", "url": "https://www.bbc.com/sport/football/66376394"}