{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:46:04", "date_modify": "2025-05-21 04:46:04", "date_publish": "2025-01-23 13:38:14", "description": "Saracens winger Rotimi Segun is ruled out for 12 weeks after he sustained a calf injury against Castres Olympique.", "filename": "sport_rugby-union_articles_cn01gl41n44o_1747802764.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/579d/live/1aa853f0-d98d-11ef-9738-e521aedf78f0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cn01gl41n44o_1747802764.html", "title": "Rotimi Segun: Saracens winger out for 12 weeks with calf injury", "title_page": "Rotimi Segun: Saracens winger out for 12 weeks with calf injury - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Saracens winger Rotimi Segun has been ruled out for 12 weeks after he sustained a calf injury against Castres Olympique.\nSegun, who has scored two tries in 12 appearances this season, left the field in the 59th minute of the 34-24 European Champions Cup defeat on Sunday, on what was his 100th appearance for the club.\nFlanker Toby Knight, meanwhile, will have a consultation on a knee injury he picked against the Top 14 club at the StoneX Stadium.\nEngland hooker Jamie George will continue to be monitored for what's now been described as a \"minor\" hamstring injury, while second row Nick Isiekwe is being assessed for a rib injury.\nBoth players have been included in England's squad for the upcoming Six Nations.\nArgentina international centre Lucio Cinti has been sidelined for six weeks with a hamstring injury he sustained in his side's defeat at Munster.\nSaracens visit Exeter Chiefs on Saturday in their last Premiership match before the international break.\nThe north London club are third in the table, seven points behind leaders Bath, and are through to the last 16 of the Champions Cup.", "url": "https://www.bbc.com/sport/rugby-union/articles/cn01gl41n44o"}