{"authors": ["Drew Heatley", "www.facebook.com"], "date_download": "2025-05-21 06:21:35", "date_modify": "2025-05-21 06:21:35", "date_publish": "2025-03-31 15:06:40", "description": "Fulham news: Opinion - Fan writer on FA Cup exit", "filename": "sport_football_articles_cvgp52zz4y3o_1747808495.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0de9/live/3eb24d20-0e15-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cvgp52zz4y3o_1747808495.html", "title": "Opinion - Fan writer on FA Cup exit - BBC Sport", "title_page": "Fulham news: Opinion - Fan writer on FA Cup exit - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "\"At least you can concentrate on the league.\"\nThat has been the phrase of choice among those consoling me since our capitulation against Crystal Palace in what was by far the biggest game of our season.\nYes, European qualification is still in reach, but this was the FA Cup. This was a chance of Wembley. This was a shot at true glory. This was history.\nMoments like Saturday, when we simply failed to rise to the occasion, suck the air right out of you. We were convinced this was our year. We were so invested - then, just like that, we are out of the cup without so much as a whimper.\nIf the league is our focus now, then we will have to concentrate - hard. We travel to Arsenal on Tuesday before hosting Liverpool on Sunday.\nThe club cannot win, really. Because even if we somehow take six points from the Premier League's top two, fans will be even more annoyed that we threw away our best chance to win our first major trophy so easily.\nBut the funny thing is, I can see at least one decent result in those next two fixtures, such is our inconsistency this term. It has turned a campaign that looked at many points to be a history-maker into one that will be remembered with a \"what if?\"\nTactics play a role, sure. Marco Silva is not infallible, but he is still the second-best manager I have seen in 30 years supporting this club. But the real reason seems to be one of mentality. Chiefly, we struggle with the big occasions, and we take too long to get our heads in the game after a period of inactivity, which in many cases means the international break.\nSo, maybe we should have seen this result coming. But it does not make it hurt any less.\nYes, it is time to concentrate on the league - hopefully the boys' minds are sharp enough.", "url": "https://www.bbc.com/sport/football/articles/cvgp52zz4y3o"}