{"authors": ["Nat Hayward", "www.facebook.com"], "date_download": "2025-05-21 05:29:28", "date_modify": "2025-05-21 05:29:28", "date_publish": "2025-01-14 13:55:50", "description": "Vitor Pereira press conference: Newcastle vs Wolves", "filename": "sport_football_articles_c626lxlp4n9o_1747805368.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4488/live/8cfca750-be1a-11ef-aff0-072ce821b6ab.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c626lxlp4n9o_1747805368.html", "title": "Vitor Pereira press conference: Newcastle vs Wolves", "title_page": "Vitor Pereira press conference: Newcastle vs Wolves - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Pereira confirmed Nelson Semedo, Matheus Cunha and Craig Dawson are fit and ready for Wednesday: \"They are coming back from injury and we need to be careful with minutes, but we need players with their quality.\"\nPereira also confirmed Mario Lemina is available after recovering from illness.\nOn the midfielder's contract, which expires in the summer: \"It's an issue he must solve with the club. We know what he wants and we now have to solve the issue. I expect him to be professional.\"\nOn top scorer Cunha's return from a two-match ban: \"In the conversations that we have together, he is very comfortable. He's very happy with his role in the team. If he's happy, I'm happy. If he plays at a high level, I'm happy for him.\"\nHowever, Pereira was not drawn into talking about his striker's future: \"I don't know - you must ask the club. He's my player and I won't lose sleep thinking about it.\"\nPereira has been pleased with Rodrigo Gomes' attitude since arriving at Molineux: \"He's small, but he has a lot of energy. He is very happy as a person, smiling every time with good energy. If he starts on the bench, he's the same and helps the team. This is the personality I like.\"\nOn opponents Newcastle: \"A team that has eight wins in a row. They play with identity at a physical level, technical level and tactical level. They are a strong team, but I don't know any perfect teams. With our game and our qualities, we have the players. We can't allow them to play how they want to.\"", "url": "https://www.bbc.com/sport/football/articles/c626lxlp4n9o"}