{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:48:53", "date_modify": "2025-05-21 05:48:53", "date_publish": "2025-04-02 11:24:12", "description": "The Irish Rugby Football Union finalise Ireland interim head coach Paul O'Connell's coaching team for this summer's Test series.", "filename": "sport_rugby-union_articles_cdjl3dwwvydo_1747806533.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5b09/live/ad737400-0fb4-11f0-b775-419686450991.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cdjl3dwwvydo_1747806533.html", "title": "Ireland rugby: IRFU confirms Paul O'Connell's backroom team for Georgia and Portugal Tests", "title_page": "Ireland rugby: IRFU confirms Paul O'Connell's backroom team for Georgia and Portugal Tests - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Interim Ireland head coach Paul O'Connell will have Denis Leamy, Mike Prendergast and Colm Tucker as his coaching team for this summer's Tests in Georgia and Portugal.\nO'Connell was confirmed as interim boss last week, with Andy Farrell and Simon Easterby away with the Lions.\nFormer Ireland back row Leamy has been Munster defence coach since 2022, while Prendergast has been the province's attack coach for the past three seasons and led Ireland 'A' in February's defeat by England.\nTucker is Connacht's scrum coach and also led the team during last weekend's United Rugby Championship loss to Munster in Castlebar, with head coach Pete Wilkins on sick leave.\nAll three coaches will link up with Ireland at the end of the club season. The squad is due to be announced in mid-June.\nIreland face Georgia in Tbilisi on 5 July (18:00 BST) and Portugal in Lisbon on 12 July (time TBC).\nFormer Ireland and British and Irish Lions captain O'Connell took over as interim boss after Easterby was appointed as part of Lions head coach Farrell's backroom team.\nIreland scrum coach John Fogarty and attack coach Andrew Goodman are also on Farrell's Lions ticket.\nO'Connell said he was \"honoured\" to accept the position.\n\"With a busy schedule of international rugby this summer, these two Tests will provide us with further opportunities to assess and develop the competition levels within the squad,\" added O'Connell.\n\"I am excited to work with a coaching team who I know well individually and are hugely motivated to deliver success to Ireland and look forward to putting our plans in place over the coming weeks.\"\nIrish Rugby Football Union performance director David Humphreys says it will mark an \"important step\" in O'Connell's coaching career.\n\"He will be assisted by Denis, Mike and Cullie who have all been in Ireland camp at different points over the last number of months and their selections is another positive progression in their coaching careers and reasserts the IRFU's commitment to developing a pathway for Irish coaches,\" added Humphreys.", "url": "https://www.bbc.com/sport/rugby-union/articles/cdjl3dwwvydo"}