{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:42:48", "date_modify": "2025-05-21 05:42:48", "date_publish": "2025-01-23 06:15:57", "description": "It's the game everyone has been waiting for but can Buffalo final beat the Chiefs in the play-offs? Yes, says Phoebe Schecter, if they manage to keep Patrick Mahomes off the field.", "filename": "sport_american-football_articles_ckgrx7xr12xo_1747806168.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8e3a/live/b03e2090-d7ec-11ef-9fd6-0be88a764111.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_american-football_articles_ckgrx7xr12xo_1747806168.html", "title": "Bills at Chiefs prediction: Buffalo can win at Kansas City if they keep Patrick Mahomes off the field,says Phoebe Schecter", "title_page": "Bills at Chiefs prediction: Buffalo can win at Kansas City if they keep Patrick Mahomes off the field,says Phoebe Schecter - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The Kansas City Chiefs against the Buffalo Bills on Sunday is going to be pretty epic - this is a match-up that everybody looks forward to.\nThe NFL play-offs have reached the Conference Championships, the last stop on the road to the Super Bowl, and the Bills travel to the Chiefs again in the AFC Championship game.\nQuarterback Patrick Mahomes is aiming to lead the Chiefs to a third straight Super Bowl win while the Bills' Josh Allen is trying to reach his first, which would mean everything to Buffalo because they haven't been there for so long.\nThe two teams have had some great meetings over the past few years and, during the regular season, the Bills predominantly beat the Chiefs. The beautiful thing about the Chiefs is that they know how to be great in the post-season.\nFor some people, when the lights shine bright, that's when the stars come out. And this is the perfect stage for Travis Kelce, it doesn't matter what has happened in the regular season. That goes for the Chiefs as well.\nThey showed it again as they beat Houston last week. Kelce didn't do much through the regular season then he had the most receiving yards he's had all season - and more than all Kansas City's other receivers combined.\nThey've got that slight mix of running the ball on offence now, with two fast guys - Hollywood Brown and Xavier Worthy. They pull the top off a defence, which opens it up really nicely in the middle, and Kelce is one of the best tight ends in reading and settling in a zone defence. That's what he does so well, finding those spaces.\nHe has such a great feel for what a team's doing, and because of his bond with Mahomes, you can see how that comes to life. When you look at Mahomes, falling forwards to his knees, and he still makes a pass to Kelce for a touchdown - you think 'these are the plays that destroy a defence'.\nAgainst the Chiefs, I feel like it comes down to who has the ball last, and Buffalo and Baltimore have been showing us the formula - time of possession being the key one. On wildcard weekend, the Bills and Ravens had about 20 minutes more possession than the opposition. Your best defence is keeping your offence on, because then Mahomes is on the sideline.\nYou've also got to run the ball - like Buffalo did last week against Baltimore - and when you need those magic moments from Allen, he's got to step up. He didn't have to make any last week when they beat the Ravens, and I feel like we've seen his evolution.\nHe's not taking sacks, he's not throwing interceptions, he's protecting the ball. He's got to believe in that process, believe in the patience and just slowly chip away, which ultimately is what the Chiefs do. Basically beat them at their own game.\nPeople have said the Bills are too slow, too small, they don't have enough star talent, so I think that they not only want to do it for themselves but for the people of Buffalo. It would mean the absolute world.\nThey made it to the Super Bowl four times [in the 1990s] and never won, but this feels like the most real opportunity they've had [since then], in ultimately what was supposed to be a rebuild year. I think they have the team and the coaching staff. I think they're built to win now, so I do think they have a chance.\nIt's not going to be easy. The Chiefs have home-field advantage and Arrowhead is hostile territory. It's really hard to bet against the Chiefs and they're healthy right now.\nBut if I don't say the Bills and they get to the Super Bowl, they'll be like 'really Phoebe? You didn't stick with your gut?' I'm definitely torn.\nThis NFC Championship game going to be really interesting because the last time these teams met [on 22 December], the Washington Commanders won 36-33 right at the end, but the Philadelphia Eagles lost quarterback Jalen Hurts to a concussion.\nIt was almost a similar narrative for Washington when they won in Detroit last week. The Commanders have no pressure on them, they were not supposed to be here, so they're playing with house money right now, whereas the Eagles, they feel that pressure, they feel like they've got to win now. They lost in the Super Bowl two years ago, so how many times opportunities are you going to get?\nI think Washington quarterback Jayden Daniels can truly pick apart the Eagles' defence. He's been phenomenal. He doesn't play like a rookie, he plays like a seasoned veteran. He looks so comfortable, so poised, so assertive. He never seems fazed and shows such precision with the ball. You can add his athleticism - he's quick, he's evasive.\nThe Commanders had more turnovers last time they met, so they need to take care of the football on offence, and shut down the run on defence. The Eagles did a great job of marching the ball downfield in that game, with Saquon Barkley rushing for 150 yards and two touchdowns.\nHis breakaway speed, his vision, his physicality, his athleticism - there's so many different ways that Barkley can hurt you. But if you're going to say 'we're just not going to let this guy ruin our day', I think you have to sell out to stop the run.\nI'd send extra pressure or get more people to stack the box, more people on the line of scrimmage, and then hope that Hurts is forced to throw the ball, because what we've seen from him lately, he's not really been firing on all cylinders.\nDefensively, if the Commanders are fearless like they were against the Lions and can stop the run, I would say this is a Washington win, which is shocking really.\nLamar Jackson, a two-time Most Valuable Player, lost last week in his battle with this season's other leading MVP contender, Allen.\nThe talk around Jackson is that, when he gets to the play-offs, he can't do it. Baltimore lost again, but it wasn't necessarily that Jackson couldn't do it. He did have a couple of turnovers but ultimately it was a two-point game when Mark Andrews had that unfortunate drop at the end. That wasn't down to Jackson's decision making.\nI hear what people say about Jackson. It's frustrating that, again, you get to the play-offs and you're not successful, but he's still had an MVP-calibre year.\nI don't know if he needs to get more play-off wins or take Baltimore to a Super Bowl [to be considered an all-time great], but I think people would like to see him be successful.\nJackson is a big reason why the Ravens have been as good as they have, but it can't just be on one person. Plenty of quarterbacks have been MVP and never won a Super Bowl, and they are legends and have a legacy, like Dan Marino for example.\nPhoebe Schecter was speaking to BBC Sport's Ben Collins", "url": "https://www.bbc.com/sport/american-football/articles/ckgrx7xr12xo"}