{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:03:35", "date_modify": "2025-04-26 04:03:35", "date_publish": "2025-03-03 20:03:10", "description": "Glamorgan have signed 20-year-old batter Callum Nicholls on a one-year rookie contract.", "filename": "sport_cricket_articles_c62x6yreeddo_1745640215.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1576/live/3f6992c0-f86a-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_cricket_articles_c62x6yreeddo_1745640215.html", "title": "Glamorgan sign rookie batter Callum Nicholls", "title_page": "Glamorgan sign rookie batter Callum Nicholls - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Glamorgan have signed 20-year-old batter Callum Nicholls on a one-year rookie contract.\nNicholls has five years of experience playing for Glamorgan's second team and the Wales national counties sides, after making his debuts while still at school.\nHe was the top scorer in the South Wales Premier League in 2024 playing for St Fagans CC.\n\"I'm delighted to have signed my first rookie contract with Glamorgan,\" said Nicholls.\n\"I've grown up playing through the pathway system and was on the Glamorgan academy and it's always been my goal to play for the club.\"\nNicholls has been playing in the premier grade of the Northland Cricket Association during the British winter.\nHe was educated at Ysgol Gyfun Rhydfelin in Pontypridd and comes from a sporting family with his father Ryan Nicholls having played football for Cardiff City before spells in the Welsh Premier League.\nNicholls faces strong competition for Glamorgan first team opportunities with young batters Will Smale and Asa Tribe coming through in 2024.\nGlamorgan's director of cricket Mark Wallace added: \"It's always nice when a player comes through your academy and signs their first contract.\n\"Callum has always had the ability to score runs and again scored heavily last year in the Premier League for St Fagans CC.\"", "url": "https://www.bbc.co.uk/sport/cricket/articles/c62x6yreeddo"}