{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:48:29", "date_modify": "2025-05-21 03:48:29", "date_publish": "2025-02-01 17:36:58", "description": "Motherwell sign Crystal Palace forward Luke Plange on loan", "filename": "sport_articles_cx2yxq65dd9o_1747799309.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9396/live/634e2c40-e0d8-11ef-bd1b-d536627785f2.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cx2yxq65dd9o_1747799309.html", "title": "Motherwell sign Crystal Palace forward Luke Plange on loan", "title_page": "Motherwell sign Crystal Palace forward Luke Plange on loan - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Managerless Motherwell have signed strikers Luke Plange and Will Dickson from Crystal Palace and Manchester City respectively on loan deals until the end of the season.\nPlange, 22, is yet to make a senior appearance for Palace having signed from Derby County in 2022.\nThe England Under-20 cap has had five previous loan spells away from Selhurst Park, with the most recent at HJK Helsinki, where he scored seven goals in 36 appearances.\n\"I feel fit, ready and optimistic about the rest of this season,\" Plange said.\n\"This is a great chance for me to build on what has been a successful season so far. I feel I have played in different leagues and bring a bit of experience on that front.\n\"I can't wait to get started.\"\nThis is 20-year-old Dickson's first loan spell, and he says he is keen to impress at senior level.\n\"This is my first loan move, and I couldn't be more excited,\" Dickson said.\n\"I've shown what I can do at City through the levels, but this is the next big step for me. It's an ideal opportunity for me to showcase my talents, and I would love to see my game progress at Motherwell.\n\"It's an ideal place to be, and I can't wait to see all the fans.\"", "url": "https://www.bbc.com/sport/articles/cx2yxq65dd9o"}