{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:31:14", "date_modify": "2025-05-21 06:31:14", "date_publish": "2024-12-24 10:35:10", "description": "La Liga club Valencia make an official approach for West Bromwich Albion boss Carlos Corberan.", "filename": "sport_football_articles_cvgrn9w5kgyo_1747809074.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/841b/live/5f310700-c1d8-11ef-9e92-076070f32991.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cvgrn9w5kgyo_1747809074.html", "title": "Carlos Corberan: Valencia make approach for West Bromwich Albion boss", "title_page": "Carlos Corberan: Valencia make approach for West Bromwich Albion boss - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "La Liga strugglers Valencia have made an official approach for West Bromwich Albion head coach Carlos Corberan.\nTwo separate sources have told BBC Sport and BBC Radio WM that talks are ongoing between the clubs, although a deal is yet to be finalised.\nHowever, Valencia are said to be willing to pay the 41-year-old Spaniard's release clause at Championship club Albion, believed to be between £3-4m.\nThe Spanish club sacked head coach Ruben Baraja on Monday after just two wins in 17 league matches this season.\nFormer Huddersfield Town boss Corberan was appointed by the Baggies in October 2022, leading them to a ninth-placed finish in his first season and fifth last term, as they lost to Southampton in the play-off semi-finals.\nHe has guided Albion to seventh place in the Championship table this season, just outside the play-off places on goals scored, despite claiming his playing budget had been reduced by 30%.\nCorberan had been linked with the recent managerial vacancy at Premier League side Southampton, but Saints chose Ivan Juric to replace the sacked Russell Martin.\nValencia, Corberan's hometown club, are four points from safety, sitting second-bottom of La Liga.\nIn Baraja's final game as manager, they drew 2-2 with Alaves on Sunday to move off the bottom of the table on goal difference.\nThey face reigning champions Real Madrid in their next league game on 3 January.\nSteve Hermon, BBC Radio WM\nCarlos Corberan has been linked with multiple jobs at an increasing rate lately, which is the sign of a busy agent but also perhaps his own want for pastures new.\nValencia have been a big side in European football, winning La Liga and the Uefa Cup as recently as 2004, but the pull of this job might come more off the field.\nThe Spaniard grew up in the village of Cheste, just over 20 miles from Valencia's Mestalla stadium.\nHis parents still live in the region, he has a Spanish wife, Claudia (who he actually met in Leeds where she worked as an interpreter) and they have two young children together, boys Dario and Marcos.\nDespite being a workaholic who lives and breathes football, Corberan is also a proud family man. Perhaps a move closer to loved ones would help with that.\nHe's also an ambitious coach. He will have been stung by his 11-game spell at Greek top-flight side Olympiakos, which ended shortly before he arrived at The Hawthorns, so this is his first real opportunity to work at an elite level.\nLike all Spanish clubs, Valencia are on a winter break but his first game in charge would be a home match against Real Madrid on 3 January. A day later, Albion travel to Swansea in a 12:30 kick-off, so you can understand the pull.", "url": "https://www.bbc.com/sport/football/articles/cvgrn9w5kgyo"}