{"authors": ["Colin Moffat", "www.facebook.com"], "date_download": "2025-05-21 04:29:47", "date_modify": "2025-05-21 04:29:47", "date_publish": "2025-01-05 17:39:43", "description": "Hamza Igamane continues his impressive debut season at Rangers with a wonderful hat-trick in the 3-3 draw away to Hibernian.", "filename": "sport_football_articles_c1j039djdkxo_1747801787.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1e5c/live/f643b5e0-cb8b-11ef-94cb-5f844ceb9e30.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c1j039djdkxo_1747801787.html", "title": "Hibs 3-3 Rangers: 'Box of tricks' Igamane takes 'massive steps forward'", "title_page": "Hibs 3-3 Rangers: 'Box of tricks' Igamane takes 'massive steps forward' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Left foot, header, right foot. Hamza Igamane scored the \"perfect hat-trick\" at Easter Road - but was left frustrated as Rangers were held to a 3-3 draw by Hibernian.\nThe 22-year-old Moroccan now has 11 goals since his summer move from Rabat-based AS FAR, 10 of those coming since late November.\n\"He's a box of tricks but it's the basics that get him success,\" former Ibrox striker BIlly Dodds said on BBC Sportsound. \"He holds it, he links and he gets in the box.\"\nThat just about sums up each of Igamane's goals in Edinburgh.\nHe crashed in a first-time strike from Ianis Hagi's low cross for his first and did much the same for the third, with Vaclav Cerny the provider.\nIn between, he powered home a header from a Nedim Bajrami delivery when it looked like Rangers would run away with the game.\nThat 2-0 lead became 2-2 after a Martin Boyle double for Hibs and, on 89 minutes at 3-3, Igamane raced away from halfway only to clip the outside of the post with his shot.\nIgamane scored twice and set one up in an impressive win away to Nice in the Europa League, while he was also on target in the home draw with Tottenham in the same competition.\nBut this was his best performance yet for Rangers, full of lovely touches, strong running and those great finishes for the first Premiership treble since Ross County's Jordan White hit three against Dundee United in May 2023.\n\"He loves a nutmeg, he's a showboater at times,\" added Dodds. \"He's so positive, he works so hard and leads the line really well.\"\nRight now, Igamane is undoubtedly the first-choice striker at Ibrox, ahead of Danilo and Cyriel Dessers, who cost more than £10m in combined fees.\nAnd manager Philippe Clement believes there is still much more to come.\n\"I got a lot of questions early in the season about why we got a young guy from Morocco, so he's showing everybody the potential he has,\" the Ibrox manager told BBC Scotland.\n\"He has made massive steps forward in the past three or four months. Technically, tactically and, for sure, physically. He's a smart boy and he wants to learn.\"\nRangers, who were celebrating a thumping Old Firm derby victory on Thursday, have now failed to win in three successive away matches and taken just 12 points from their 10 games on the road.\nA depleted defence may be weakened further with Dujon Sterling hobbling off in the second half.\nClement felt a lack of \"freshness\" was a factor in failing to build on such strong start but was unsure if his squad will be bolstered with new arrivals this month.\n\"I think every manager feels that, and for sure in the situation we are for the moment with injuries and everything,\" he replied when asked if he needed reinforcements.\n\"But there's also the situation of the club. You need to pay it and I'm not the one who can pay that. I don't have that money.\n\"That's something that Patrick [Stewart, the recently-appointed chief executive] will address. He wants to give that explanation what is the plan for January.\"", "url": "https://www.bbc.com/sport/football/articles/c1j039djdkxo"}