{"authors": ["Peter Scrivener", "www.facebook.com"], "date_download": "2025-05-21 05:56:18", "date_modify": "2025-05-21 05:56:18", "date_publish": "2025-04-02 05:35:05", "description": "Lottie Woad will try to become the first player to defend the Augusta National Women's Amateur title when she tees it up at the home of the Masters this week.", "filename": "sport_golf_articles_c8d4dgzvz5ro_1747806978.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b812/live/7655c0e0-0df7-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_golf_articles_c8d4dgzvz5ro_1747806978.html", "title": "How Lottie Woad's win at Augusta started breakthrough year that ended as world number one", "title_page": "How Lottie Woad's win at Augusta started breakthrough year that ended as world number one - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It was while standing on the 12th tee at Augusta National that Lottie Woad had one of those 'pinch me' moments.\nThe English amateur, from Farnham in Surrey, was seven holes away from securing a career highlight win that would kick-start a stellar 2024.\nIt was a year that started with her becoming the first European to claim the Augusta National Women's Amateur (ANWA) title at the home of the Masters - a title she will try to become the first to defend this week when the three-round competition starts on Wednesday.\nIt was a year in which the England Golf women's squad member played in her first majors, finished as top Briton at the Women's Open, helped win the Curtis Cup, and ended it as the world's number-one-ranked amateur.\n\"It was definitely a breakthrough year,\" the 21-year-old tells BBC Sport. \"Winning at Augusta was the highlight and that kicked off the whole year.\"\nAnd it was on the back nine at Augusta - where so many Masters dreams have flourished and floundered - that Woad managed to keep her nerve.\nThe 12th was among the pivotal holes and she had to steady herself to tackle one of the most daunting par-threes in golf.\nDozens of rounds have been ruined on this most picturesque of holes. Tiger Woods hit three balls in Rae's Creek, the water that protects the front of the green, on his way to a 10 in 2020, the year after he won his fifth Green Jacket.\n\"You're standing on the tee and you're just like, 'I'm on hole 12',\" she says.\n\"You're nervous but then you're also going 'I'm playing the 12th at Augusta', so it's not too bad.\"\nWoad, who went into the final round of the 54-hole event - of which the first 36 are played at the nearby Champions Retreat Golf Club - with a two-shot lead, marked a three on her card to stay at six under.\nBut up ahead American Bailey Shoemaker was putting the finishing touches to the first bogey-free round at Augusta in the five-year history of the ANWA. A sensational 66 set a target of seven under.\nA bogey on the par-five 13th meant Woad dropped two behind, but she produced a magical finish with three birdies in her final four holes to snatch victory on the final green.\nThe putt on the 18th was an 18-footer, downhill.\n\"It didn't have much break but it was pretty quick,\" she says.\n\"Then it went in and I've won at Augusta and everyone kind of went crazy.\"\nWoad's season was about to get a little more crazy. The victory opened the door to play the majors, the Chevron Championship two weeks later being the first.\nShe spent a hectic week catching up with friends and college work at Florida State University, where she is in the penultimate year of a sports management degree, before heading to Texas.\n\"My parents and coaches were at Augusta and they wanted to go home, so I was left on my own at my first major,\" she says.\n\"I had to get a local caddie, but I had a lot of confidence from Augusta, made the cut and was in contention.\"\nWoad finished joint 23rd, alongside England's Georgia Hall and Charley Hull, two of her \"favourite players\" that she had \"looked up to\" since concentrating on the sport from about the age of 13.\nShe had taken her first lessons, aged seven, with Farnham pro Luke Bone, who remains her coach.\nProgression to the England Girls followed by the age of 15 and, while perhaps not seen as the most naturally gifted golfer, Woad's work ethic impressed as she took advantage of resources not previously available to her.\n\"I had a putting coach, a strength and conditioning coach and a psychologist,\" she says.\n\"I was always pretty good at the long game, but I had to work a lot harder on my short game and I learned how to practise more effectively.\"\nShe went on to win the prestigious Girls Amateur Championship at Carnoustie in 2022, a decade after Hall triumphed in the event.\nWoad was back in Scotland for last year's Women's Open, which was held over the Old Course in St Andrews.\nShe had missed the cut at the US Women's Open and Evian Championship but arrived in Fife in buoyant mood for her fourth major.\nWoad would be in contention all week and finish joint 10th to win the Smyth Salver as the highest-placed amateur, with another highlight being a 60-yard chip-in eagle two on the par-four last in round three.\n\"That got me back into the top 10 going into final day. It was a really cool moment with the grandstand full of cheering people,\" she says.\n\"Then at the prize-giving I get to stand next to the winner, Lydia Ko. To see her lift that trophy motivates you.\n\"It was a perfect week. Home of golf, first Open - I couldn't have dreamed it better.\"\nThere was little time for celebration, though. The Curtis Cup, which pits Great Britain and Ireland's top female amateurs against their American counterparts, was the following week.\nThe Americans were favourites to win a fourth successive title after domineering victories in the previous three editions of the biennial event.\nBut GB&I were boosted by having Europe's victorious Solheim Cup captain Catriona Matthew as their leader.\nAnd Woad, who grew up 40 minutes from the Sunningdale Old Course that hosted the event, contributed 2½ points in a nerve-shredding 10½-9½ triumph.\nBy that point, Woad had ascended to top of the amateur rankings, which earned her the Mark H McCormack medal. Ko won the prize three successive times from its inception in 2011, while Ireland's Leona Maguire and rising US star Rose Zhang are also three-time recipients.\nSo what does 2025 hold for Woad?\nThe 'P' word is unavoidable, even if Woad will \"only be making that decision when I get to it\".\nTurning professional would appear to be the next logical step and Woad is on an LPGA pathway that could help accelerate that process.\n\"You can get an LPGA card when you reach 20 points and I'm currently on 16,\" she says. \"I'm trying to get 20 points this year and then we'll have a decision to make.\n\"If you make a cut in a major you get a point. If you get a top-25 finish you get a point. If you win Augusta or NCAAs (National Collegiate Athletic Associations), you get two points.\n\"I'm trying to not think too much about it. But if I play well I'm going to get those points.\"\nThe NCAAs are the pinnacle of collegiate golf in the US, pitting teams and individuals against each other. Woad finished runner-up in the individual competition last year, while her university team were joint 11th.\nThis season, Woad has posted an impressive eight consecutive top-three finishes since September. But her Florida State team-mate, 19-year-old Malaysian Mirabel Ting, has eclipsed that, winning six events since last year's AWNA to lead the NCAA individual rankings.\nJasmine Koo is also in a field which boasts 49 of the top 50 in the world. Over the past 12 months the number two ranked player has had four wins and seven top-five finishes.\nAnd 16-year-old Asterisk Talley is tipped to feature again. She finished joint eighth last year and went on to beat Woad in the singles at the Curtis Cup as she also enjoyed a superb 2024.\nHowever, Woad goes into the week knowing that she has conquered Augusta National before and she will again have England Golf women's lead coach Steve Robinson on the bag.\n\"That's going to be nice, to have that familiarity,\" she says. \"I'm just really excited. It's going to be a fun week, and hopefully I can be the first to defend the title.\"", "url": "https://www.bbc.com/sport/golf/articles/c8d4dgzvz5ro"}