{"authors": ["Andy Cryer", "Sam Drury", "www.facebook.com"], "date_download": "2025-05-21 04:34:35", "date_modify": "2025-05-21 04:34:35", "date_publish": "2025-01-05 21:45:01", "description": "A disappointing display in Liverpool's 2-2 draw with Manchester United has prompted questions about whether Trent Alexander-Arnold has been affected by talk about his future, with his contract ending this summer and Real Madrid interested?", "filename": "sport_football_articles_cwydvn24qxvo_1747802075.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/bb96/live/ad252d50-cba2-11ef-9fd6-0be88a764111.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cwydvn24qxvo_1747802075.html", "title": "Trent Alexander-Arnold: 'Real Madrid? More like Tranmere'", "title_page": "Trent Alexander-Arnold: 'Real Madrid? More like Tranmere' - has speculation 'affected' Liverpool star? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Trent Alexander-Arnold has rarely been out of the headlines.\nIf it's not for Real Madrid's ongoing interest in the Liverpool full-back amid an uncertain future, it's for his creative brilliance - or his perceived defensive deficiencies.\nOn Sunday, it was undoubtedly the latter.\nThe 26-year-old had an afternoon to forget as leaders Liverpool were fortunate to escape Anfield with a 2-2 draw against 14th-placed Manchester United.\nAfter being given a torrid afternoon by Diogo Dalot and replaced by Conor Bradley in the 86th minute, he was heavily criticised on social media and by several pundits.\nFormer United captain Roy Keane told Sky Sports: \"There's talk about him going to Real Madrid, the way he's defending he's going to Tranmere Rovers after this. He's got to do better.\n\"We talk about how brilliant Trent is going forward, but Trent's defending today; my goodness it's like schoolboy stuff.\"\nLeague Two side Tranmere were quick to offer a witty response to Keane's jibe on social media, posting a picture of their full-back Cameron Norman on X under the message: \"Trent to Tranmere Roy? Nah, we're alright thanks.\"\nAlexander-Arnold has remained tight-lipped on his Liverpool future, with his contract coming to an end this summer, and it has been suggested the speculation may have \"unnerved\" him.\nReports have claimed Spanish giants Real Madrid want to sign him in January - or on a free transfer at the end of the season - while the Reds have made increased efforts to keep him on improved terms.\nGiven both United goals and the majority of the visitors' threat came down his side, it was not difficult to understand why Alexander-Arnold's performance was questioned.\nWith Bruno Fernandes drifting left and the pace of Dalot on that side too, it was a clear plan to try to hurt Liverpool down their right.\nMore than half of United's attacks - 54% to be precise – went on that side so he was dribbled past twice which, in itself, is not a huge indictment on Alexander-Arnold's performance.\nOpta also confirmed he recorded no errors leading to a shot, let alone a goal.\nThe big issue for Alexander-Arnold was that he lost all five of his duels in the match and, as such, failed to halt United's forays into Liverpool territory when he had the chance.\nMoreover, while he was only dribbled past twice, the fact Dalot was given the space to get balls into the box without beating Alexander-Arnold may also concern boss Arne Slot.\nOn the ball, it was much of what you would expect from the talented, attack-minded right-back. He completed 76.67% of his 60 passes – which was pretty much bang on with his average for the season and created a chance.\nThat took him to 37 for the campaign, with Ipswich left-back Leif Davis the only defender ahead of him in that category.\nAlexander-Arnold was prominent in the early stages of the match at Anfield, coming in off the touchline to find space before looking to pick out a telling pass.\nOnly Bukayo Saka, Cole Palmer and Mohamed Salah can better his 12 big chances created in the Premier League this season, although he did not add to his tally in this game.\nAlexander-Arnold remains among the elite creators in European football and while a difficult day in such a high-profile match brought his defending under scrutiny again, it was not so long ago that his improvement in that area - since Slot took charge - was lauded.\n\"We are talking about a player that won the Champions League and the league title so it's clear to me that he has been a good defender all his life,\" Slot said earlier in the season.\n\"I think, with him, it is not about if he is capable of doing things, it's more can his concentration rate constantly be in 100% focus? So this is what we talk about a lot.\"\nThis wasn't the first time Alexander-Arnold has been criticised for his defending.\nThroughout his incredibly successful career - in which he has helped Liverpool win every major trophy - his defensive qualities have been continually brought up as a potential weakness.\nAnd with the contract situation and possibility of losing 'one of their own' this month or in the summer, manager Arne Slot was asked if the speculation had affected Alexander-Arnold.\n\"I think nine out of 10 people will tell you that it affected him. I'm [the] one of the 10 that tells you that I don't think that affected him,\" said the Dutchman.\n\"What affected him is that he had to play against Bruno Fernandes and Diogo Dalot, two starters for Portugal, great, great players.\n\"I think that is more difficult for Trent to play against than the rumours that were there during the week.\"\nEx-Manchester United and England full-back Gary Neville was less convinced, though.\n\"The supposed bid from Real Madrid is bad timing for him,\" he said. \"I think that will have unnerved him - Real Madrid are such a powerful club.\n\"There are three reasons for that performance. He has played like this before, he just had a bad game, or his mind was affected by all the talk.\n\"It wasn't his defending, which we know he does sometimes, I thought his passing and forward play was the worst I've seen.\"\nFormer Liverpool defender Jamie Carragher said the match could not have gone worse for Alexander-Arnold, while Keane believed he should have been substituted earlier.\nBut another ex-Liverpool striker, Daniel Sturridge, put the display down to \"just one of those games\", while Premier League winner Chris Sutton told BBC Radio 5 Live: \"Where has this pile-on for Trent come from? Trent has been brilliant in a Liverpool jersey and all of a sudden, you want him out the door. Blimey.\".\nAlan Shearer added on BBC Match of the Day: \"Trent has had so many impressive games but today wasn't one of them. Dalot got the better of him 99% of the time.\"\nPaul: After Trent's performance today, Real can have him. His understudy is a better all-round player and Liverpool will save money.\nMark: Trent was an absolute disgrace in a Liverpool shirt. He was slow with no awareness of anyone around him and a total liability all match. He should sign off this last season but today was the worst performance I have seen by Liverpool player in a long time. He should have been substituted by about 30 minutes. Totally not acceptable.\nIan: Can I personally drive Trent in my campervan to Madrid? His shocking performance today tells me that he has already decided where is future is. Let's crack on.\nJames: Trent, either stay or go. Just let us know which it is so that everyone can move on. Stay and they may build you a statue, go and risk being another Michael Owen.\nSteven: Trent was completely off the pace today, but I'm not saying he wants to leave. He looks unsettled and certainly not his normal self. Whatever he decides is fine, as we would love him to stay if that's what he wants and we get the old Trent back, but if he wants to leave then he needs to be the reserve right-back now.\nGraham: I know Trent's head wasn't in the right place, but surely the club are responsible for letting the contract talks go on for so long.", "url": "https://www.bbc.com/sport/football/articles/cwydvn24qxvo"}