{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:08:31", "date_modify": "2025-05-21 06:08:31", "date_publish": "2025-01-04 22:06:57", "description": "Arsenal manager Mikel Arteta is left bemoaning a penalty decision he calls \"bizarre\" as his side's Premier League title challenge suffers a setback at Brighton.", "filename": "sport_football_articles_cgm90g9x3evo_1747807711.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/050d/live/8a816020-cae9-11ef-94cb-5f844ceb9e30.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cgm90g9x3evo_1747807711.html", "title": "Arsenal: Mikel Arteta has 'never seen' penalty like Brighton's after Joao Pedro and William Saliba incident", "title_page": "Arsenal: Mikel Arteta has 'never seen' penalty like Brighton's after Joao Pedro and William Saliba incident - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Arsenal manager Mikel Arteta bemoaned a penalty decision he called \"bizarre\" as his side's Premier League title challenge suffered a setback at Brighton.\nThe second-placed Gunners looked on course to claim a precious three points on the south coast following an early opener from 17-year-old Ethan Nwaneri.\nHowever, they had to settle for a point and a 1-1 draw after Joao Pedro equalised from the spot following a freak incident in which he was accidentally headbutted by visiting defender William Saliba.\n\"We are really disappointed with the decision that leads to the goal because I have never seen something like this in my life,\" Arteta told BBC Sport.\n\"He touches the ball as well. [It is] bizarre. That means we have probably never seen it before. I haven't in my career. I asked the boys if they have, and no-one has seen this before. So it is a new one.\n\"I checked and, after three seconds, they said they already checked VAR. It seems quick.\"\nWhile Spaniard Arteta was clearly frustrated by referee Anthony Taylor's decision to award the penalty to the hosts, Brighton boss Fabian Hurzeler felt it was the obvious outcome to the situation.\n\"It was a clear penalty. It is head to head, but if it is another piece of the body everybody would say it was a penalty,\" said the German.\n\"Joao Pedro places the ball with his head and Saliba comes too late.\"\nBrighton were searching for an equaliser just before the hour mark when Pedro flicked the ball up in the air in the Arsenal penalty area.\nAs the Brazil forward nodded it into his own path, trying to turn to his right, there was a clash of heads as Saliba attempted to clear.\nReferee Taylor took a few seconds to consider what had happened as Pedro fell to the ground.\nThe official then pointed to the spot and after the VAR check Pedro sent visiting goalkeeper David Raya the wrong way, finding the right corner as he levelled the scores.\nOn Match of the Day, the pundits were convinced a penalty should not have been awarded.\n\"It was clearly headed by Saliba,\" said presenter Gary Lineker. \"Never ever have we seen a penalty given for head clashes.\"\nDanny Murphy added: \"They both head the ball before they clash. They are genuinely going for it. It's a coming together.\"\nAlthough Arsenal considered it a contentious decision, pundits at the game made the case that Brighton merited their penalty.\nFormer Tottenham and England midfielder Jamie Redknapp suggested the Gunners only had themselves to blame.\n\"When you think about Gabriel and Saliba you think about calmness, but there was chaos in Arsenal's defending there,\" said Redknapp on Sky Sports.\n\"The defending was chaotic. Is it a penalty? Absolutely. You can see the contact. He heads him and he goes down; you can't afford to do that in the box.\n\"We have seen a lot worse penalties than that one. They were rash in their defending. I can see why people say it's soft, but he is hit on the head and goes down. It's a foul. Arteta is entitled to his opinion, but they didn't play well. That is the fact.\"\nEx-Fulham midfielder Steve Sidwell added: \"It was a genuine attempt to get the ball, but Pedro gets there first. I think it's a penalty. A clear penalty for me.\"\nSpeaking on BBC Radio 5 Live, former Arsenal defender Matt Upson added: \"A clash of heads. It's an interesting one. How often do you see a penalty given away for an accidental headbutt?\"\nMeanwhile, fan reaction on social media overwhelmingly endorsed the award of the penalty.\nDom: Not sure what the complaint is? Missed the ball and headbutted him. Same way if you miss the ball with your foot it's a foul. It wasn't a clash of heads, he missed the ball.\nMike: It's a stonewall penalty. Yes the clash of heads may have been accidental, but if it's a clash of legs that was accidental it's still a penalty\nNeil: Unusual penalty, but when a defender accidentally trips an attacker when trying to play the ball it's a foul. Guess this isn't that much different. Good call from the ref.\nChris: It wasn't a 'clash of heads' - Saliba head-butted Joao Pedro! If you can give a penalty away by kicking someone, what's the difference?\nNwaneri's goal in the first half was his second in the league this season.\nIt made him the sixth player to score multiple Premier League goals before turning 18 after Wayne Rooney (seven), Michael Owen (five), Danny Cadamarteri (three), James Milner (three) and Federico Macheda (two).\nHe was booked just before half-time for taking too long over a corner, and he was then replaced at the break by Gabriel Martinelli because of injury.\n\"Really bad news because I think we've lost him,\" said Arteta afterwards.\n\"We had to take him off at half-time with some muscular issues.\"\nThe England Under-19 international has been deputising for injury-hit Bukayo Saka on the right wing.\n\"What a good replacement Nwaneri is for Bukayo Saka. He fits the bill - the pace, body shape, and the lovely left foot he has got,\" said Upson on BBC Radio 5 Live after the teenager blasted Arsenal into the lead.\nArsenal's failure to collect maximum points means Liverpool have the chance to go eight points clear at the top on Sunday if they beat Manchester United.\n\"It's not the moment to think too much about the title,\" said Arsenal defender Riccardo Calafiori. \"We need to focus on ourselves.\"\nRedknapp added: \"If Liverpool win tomorrow it opens it up for them. I have said there will be twists and turns, but if Arsenal keep performing like this there won't be twists and turns.\n\"Arsenal have the same points as last season at this stage, but they are not playing well yet. They haven't got Saka and they struggle to open a team up at this moment. The game is hard for them at this moment.\"\nFrustrated to have come away with just a point, Arteta said: \"In the second half we didn't really grab the game or dominate enough to have certain moments and be more of a threat in their half.\n\"When you are playing every three days, or less than that, you cannot with the amount of injuries and situations maintain the level of performance and competitiveness. Today we lacked it in the second half.\n\"Today was not about fatigue. it was about the simple things that we have to do in ball possession to give chances and dominate the game in the right areas.\"", "url": "https://www.bbc.com/sport/football/articles/cgm90g9x3evo"}