{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:39:18", "date_modify": "2025-04-26 07:39:18", "date_publish": "2025-02-27 13:24:31", "description": "Arsenal: Questions 'have to be asked' of Mikel Arteta - fan view", "filename": "sport_football_articles_cgr2259g04ko_1745653158.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4b1b/live/d2ac03d0-f4f8-11ef-a2a8-e1b826ae43ce.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cgr2259g04ko_1745653158.html", "title": "Arsenal: Questions 'have to be asked' of Mikel Arteta", "title_page": "Arsenal: Questions 'have to be asked' of Mikel Arteta - fan view - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Arsenal have \"regressed\" and \"questions have to be asked\" if Mikel Arteta does not delivery a trophy this season, says fan Rakeem Noble.\nAfter a disappointing defeat by West Ham at the weekend, the Gunners stumbled again in their pursuit of Premier League leaders Liverpool after coming away with a 0-0 draw at Nottingham Forest on Wednesday night.\nHaving run Manchester City close in the past two campaigns, they now have an almighty task to claw back the 13 points they currently sit behind Liverpool.\nWith just the one FA Cup trophy in his five years in charge, some fans are starting to question boss Arteta's position.\n\"I do like Arteta and what he has done at the club and I would like him to continue as the manager but, I said at the start of the season, if he doesn't deliver this season then, it's not that he has to go, but questions have to be asked,\" Noble told BBC Radio 5 Live Breakfast.\n\"Two years ago we had a good run in with City, we did fumble it but players were inexperienced, didn't know what to do in that position and we fell short. Last season we came a couple of points short and I couldn't be angry at that. I was disappointed but there was massive progression.\n\"This season, we have fallen off by February. We have regressed, we have gone backwards. We are at the point now where conversations need to be had. I am not saying get rid of him in the summer, but a conversation definitely needs to be had about the direction, what we do next at the club, how we take the club to the next level, because we are coming up short of the line.\n\"We have gone backwards and we do not want to start going anymore further backwards and start to have to fight for top four. We want the title next season if we can get to that.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cgr2259g04ko"}