{"authors": ["Russell Fuller", "www.facebook.com"], "date_download": "2025-05-21 05:02:21", "date_modify": "2025-05-21 05:02:21", "date_publish": "2025-01-23 12:30:09", "description": "The Billie Jean King Cup Finals will be held in Shenzhen, China for the next three years.", "filename": "sport_tennis_articles_c24798l5ed6o_1747803741.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a03c/live/2ee922d0-d970-11ef-bc01-8f2c83dad217.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_tennis_articles_c24798l5ed6o_1747803741.html", "title": "BJK Cup Finals to be held in Shenzhen, China for next three years", "title_page": "BJK Cup Finals to be held in Shenzhen, China for next three years - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The Billie Jean King Cup Finals will be held in Shenzhen, China for the next three years.\nChina, reigning champions Italy and six qualifiers will contest the week-long Finals in 2025, with a date yet to be confirmed.\nThree venues in Shenzhen are being considered - including the 12,000 capacity Shenzhen Bay Sports Arena, which staged the WTA Finals in 2019.\nPrague, Glasgow, Seville and Malaga were chosen as hosts for the first four editions, but organisers say a global event of this nature cannot stay in Europe for too long.\n\"The announcement demonstrates our commitment to bringing the passion and excitement of nation v nation team tennis to markets around the world,\" Billie Jean King said.\nIn the tournament, formerly called the Fed Cup, 18 teams split into six groups of three in qualifying, with the group winners progressing to the Finals.\nGreat Britain have been drawn alongside Germany and the Netherlands in Group F for April's qualifying competition.\nCanada, who won the competition in 2023, meet Japan and Romania in Group A, with Brazil, the Czech Republic and Spain competing in Group B.\nSlovakia, USA and Denmark are in Group C, while fourth-seeded Australia take on Kazakhstan and Colombia in Group D.\nPoland, Switzerland and Ukraine make up Group E.", "url": "https://www.bbc.com/sport/tennis/articles/c24798l5ed6o"}