{"authors": ["Neil Johnston", "www.facebook.com"], "date_download": "2025-05-21 07:35:56", "date_modify": "2025-05-21 07:35:56", "date_publish": "2025-01-30 23:57:38", "description": "Ange Postecoglou says the 3-0 Europa League win over Elfsborg was \"made in Tottenham\" as youngsters Dane Scarlett, Damola Ajayi and Mikey Moore all score.", "filename": "sport_football_articles_cp9xk1ygkv0o_1747812956.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a928/live/022a4b50-df62-11ef-b9a5-b1e269fb5487.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cp9xk1ygkv0o_1747812956.html", "title": "Tottenham 3-0 Elfsborg: 'Play the kids' message as Mikey Moore record goal caps Europa League win", "title_page": "Tottenham 3-0 Elfsborg: 'Play the kids' message as Mikey Moore record goal caps Europa League win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "For more than an hour Tottenham were heading for another night of frustration.\nAfter no wins in seven in the Premier League, Ange Postecoglou's team struggled against Swedish qualifiers Elfsborg in the Europa League.\nThe loss of yet another player to injury did not help the mood inside Tottenham Hotspur Stadium as substitute Radu Dragusin joined the club's spiralling casualty list.\nThen 20-year-old Dane Scarlett headed Spurs ahead before 19-year-old Damola Ajayi - just three minutes and 39 seconds into his debut - produced a confident finish to make it 2-0.\nTottenham were already heading for a win and a place in the last 16 when Mikey Moore produced the finish of the night, a low shot after a clever run.\nIt was a lovely moment.\nAt 17 years and 172 days old, London-born Moore became the youngest English player to score in major men's European competition, breaking Jimmy Greaves' record (17 years 245 days), set in October 1957.\nGreaves, who became a Spurs legend, was a Chelsea player at the time of his goal.\nMoore has been with Spurs since the age of seven.\n\"A fan just said to me then - just play the kids, we don't need to buy anyone,\" former Tottenham striker Peter Crouch told TNT Sports.\nTottenham fans have not had too much to shout about recently, but the sight of Scarlett, Ajayi and Moore all scoring their first senior goals for the club lifted the atmosphere.\n\"I just said it was made in Tottenham tonight,\" said Spurs boss Postecoglou afterwards.\n\"It's brilliant for the club and I'm sure there are academy coaches and players who won't sleep tonight because they are pretty excited.\n\"We kind of knew we would have to rely on some young players tonight, and all the way through this campaign to be honest.\n\"I thought they stood up really well. The whole group played well but we were going to need some young boys to make an impact and not just the three goalscorers.\n\"We had a couple of 18-year-olds in there as well who continue to drive us on. So it is a great night for the club and something the whole academy should be proud of.\"", "url": "https://www.bbc.com/sport/football/articles/cp9xk1ygkv0o"}