{"authors": ["Dan George", "www.facebook.com"], "date_download": "2025-04-26 06:14:31", "date_modify": "2025-04-26 06:14:31", "date_publish": "2025-03-02 01:02:33", "description": "An inspired and determined Ryan Garner beats Salvador Jimenez to claim the vacant EBU European super-featherweight title.", "filename": "sport_boxing_articles_cyveq1j7lqpo_1745648071.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/303f/live/4dec9500-f6f7-11ef-95bf-a3827cb538d9.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_boxing_articles_cyveq1j7lqpo_1745648071.html", "title": "Ryan Garner v Salvador Jimenez: Garner claims European title", "title_page": "Ryan Garner v Salvador Jimenez: Garner claims European title - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An inspired and determined Ryan Garner outclassed opponent Salvador Jimenez to claim the vacant EBU European super-featherweight title.\nThe Southampton fighter was victorious in a packed and loud Bournemouth International Centre, and raised both hands in celebration as his unanimous decision victory was read out.\nHe outworked and out-fought his Spanish opponent on the way to retaining his WBC International belt and winning the new blue and gold European title.\nAfter the contest all three of the judges' scorecards read 120-108.\n\"It's the best feeling in the world,\" Garner told BBC Sport.\n\"I always said I want another title and this is a massive major title, I'm over the moon.\n\"I can't thank everyone enough, I told everyone to stick with me throughout my career and they did.\"\nThis win extends Garner's unbeaten record to 17 wins, nine years after he made his professional debut back in 2016.\nHe earned this opportunity to headline in Bournemouth after a points victory over Londoner Archie Sharp at the O2 Arena.\nPromoter Frank Warren said that if Garner was to be successful then a world title shot could come next.\nHe even teased that it might take place at Southampton's St Mary's Stadium - the football club Garner supports and for whom he played in the youth team.\nA packed-out arena welcomed Garner loudly as he made his way to the ring.\nHe was backed by a big contingent of Southampton fans singing his name throughout.\nJimenez walked to the ring to a loud chorus of boos from the supporters, while the home fighter's entrance was to the tune of the White Stripes' 'Seven Nation Army' and loud cheers.\n'The Piranha's' start to the contest matched the intensity of the occasion and atmosphere, throwing and landing more punches than Jimenez to both the body and head.\nJimenez could not deal with some of his speed early on, retreating and trying to counter-punch but on occasions the Spaniard's efforts resulted in wild swings missing the target.\nGarner's relentlessness continued and in the fourth round he pushed Jimenez back onto the ropes and hit him with a big left hook that stunned him momentarily.\nIn the sixth round Jimenez showboated a little, glancing outside the ring and smiling as he evaded one of Garner's shots.\nThat smile was then wiped off his face as Garner sunk a big left hook to the body.\nHe continued to be the aggressor into the later rounds, working both the head and body of Jimenez with no sign of letting up.\nAs Jimenez continued to take punishment he received warnings from the referee for punching in pauses to the fight and also pushing his opponent.\nHe pushed Garner to the floor in the 10th round, with fans booing his efforts to slow the contest down.\nGarner ran straight over to his corner as the final bell sounded, embracing his trainer Wayne Batten and roaring with arms raised.\nEarlier on in the card, British and Commonwealth light-heavyweight champion Lewis Edmondson defended his title.\nHe beat Nigerian Oluwatosin Kejawa by unanimous decision after a dominant performance.\nDuring the eighth round attention went from the ring to the stands as multiple fights were seen to break out and some in attendance were ejected from the arena.\nEdmondson, known as 'The Saint', moves to 11 victories, remains unbeaten and this win sets him up for a potential future fight with light-heavyweight rival Ezra Taylor.\nAt the fight week weigh-in the two clashed in an interview and both agreed that they would have to face each other next.\nThe were also filmed exchanging heated words backstage after Edmondson's victory.\nThe Nottingham-based Taylor is also undefeated with 10 victories, seven of those coming by knockout.", "url": "https://www.bbc.co.uk/sport/boxing/articles/cyveq1j7lqpo"}