{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:55:07", "date_modify": "2025-05-21 06:55:07", "date_publish": "2025-01-23 00:00:00", "description": "Watch live action from the World Indoor Bowls Championships at Potters Resort.", "filename": "sport_bowls_live_czjd0ee0m3jt_1747810507.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_bowls_live_czjd0ee0m3jt_1747810507.html", "title": "World Indoor Bowls Championships LIVE: Watch open singles and women's singles final live action from Potters Resort", "title_page": "World Indoor Bowls Championships LIVE: Watch open singles and women's singles final live action from Potters Resort - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "World Indoor Bowls Championships\nBBC Sport\nThe prestigious World Indoor Bowls Championships will be held at Potters Resorts, Hopton-on-Sea, Great Yarmouth, England, for the 27th year.\nPotters is to bowls what The Crucible Theatre is to snooker, and Ally Pally is to darts, with the best of the best coming to compete over 16 days of competition.\nThe favourite to win the open singles title this year is defending champion Stewart Anderson, who beat fellow Scot Alex Marshall in the final last January.\nHow to watch\nAll times are GMT and subject to change\nBBC iPlayer\nThe BBC will bring you live action from the final week of the World Indoor Bowls Championship from Potters Resort across TV, Red Button, BBC iPlayer, and the BBC Sport website and app. You will also be able to catch up on all the action for up to 30 days on BBC iPlayer.\nThursday, 23 January\n10:00 - 11:30 - BBC Red Button, BBC iPlayer, BBC Sport website & app\n13:00 - 17:15 - BBC Two, BBC iPlayer, BBC Sport website & app\n17:10 - 18:00 - BBC Red Button, BBC iPlayer, BBC Sport website & app\n19:30 - 21:30 - BBC Red Button, BBC iPlayer, BBC Sport website & app\nHow to get into bowls\nBBC Sport\nThere's Lawn Bowls, which you'll see in the Commonwealth Games and is played on a flat rectangular bowling green. The aim is simple - to get your bowls as close as possible to a smaller target ball called the 'jack'.\nCrown Green Bowls is similar, but is played on a square bowling green which is made of natural grass, with a larger jack. There is a raised area or 'crown' in the green that makes the ground uneven, making it a bit more difficult.\nIndoor Bowls again offers a different surface, played on a carpeted area.How do I start?\nCheck out Scottish Bowls, external or Bowls Scotland, external, Bowls Wales, external, Irish Bowling Association, external and Bowls England, external for clubs in your area.\nYou can also try the British Crown Green Bowling Association, external or the English, external, Scottish, external or Irish, external Indoor Bowls Associations.", "url": "https://www.bbc.com/sport/bowls/live/czjd0ee0m3jt"}