{"authors": ["Jonathan Bradley", "www.facebook.com"], "date_download": "2025-05-21 04:58:55", "date_modify": "2025-05-21 04:58:55", "date_publish": "2025-04-04 12:28:24", "description": "Bordeaux-Begles will host Munster in the quarter-finals of the Investec Champions Cup after a 43-31 victory over Ulster at the last-16 stage.", "filename": "sport_rugby-union_articles_cp8j32l6lddo_1747803535.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5771/live/0a665480-12e3-11f0-b182-81b971f8bd66.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cp8j32l6lddo_1747803535.html", "title": "Investec Champions Cup: Bordeaux-Begles 43-31 Ulster", "title_page": "Investec Champions Cup: Bordeaux-Begles 43-31 Ulster - Hosts set up quarter-final date with Munster after six-try victory over Richie Murphy's side - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ulster saw their Investec Champions Cup bid ended by Bordeaux in the last 16 as the French side set up a home quarter-final against Munster.\nThe hosts were playing without Six Nations player of the tournament Louis Bielle-Biarrey at the Stade Chaban Delmas, and started French international Mathieu Jalibert on the bench, but in a six-try performance the Top 14 side always seemed to have another gear when Ulster threatened.\nHaving led 21-0, they were pegged back to 21-14, but scored two tries either side of half-time to reassert their control, while Rohan Janse van Rensburg added a key score in the 70th minute after Ulster had cut their deficit to 36-24.\nUp against the top seeds from the pool stages, Ulster gave a good account of themselves as Richie Murphy's side scored five tries themselves and had a further two ruled out by the television match official.\nIn the absence of Bielle-Biarrey it was Bordeaux's other prolific France wing who opened the scoring.\nRomain Buros and Yoram Moefana combined well to get the ball into Damian Penaud's hands and the joint top try scorer in France's history burst beyond Ulster's Mike Lowry to score.\nFrom there, the platform for Bordeaux's early lead was set by their forward pack.\nA maul that travelled 20 metres preceded prop Ben Tameifuna crashing over before former Wallaby lock Adam Coleman stretched for the line following a strong carry by hooker Maxime Lamothe.\nWith Irish fly-half Joey Carbery converting all three scores, Ulster were 21-0 down after 21 minutes.\nThe northern province have made a habit of comeback victories in the United Rugby Championship in recent weeks but such a prospect would always be tougher against superior opposition.\nStill, they fought their way back into the contest with a pair of scores from close range.\nProp Tom O'Toole muscled over after Stuart McCloskey took a penalty for offside quickly, and the visitors were within a score after David McCann followed fellow back row Nick Timoney on to the ball and burrowed over the line.\nTo be behind by just seven at the break would have felt like a small victory for Ulster but, with the clock in the red at the end of the half, Bordeaux restored a two-try lead with a score of huge quality finished off by Romain Buros after a series of offloads.", "url": "https://www.bbc.com/sport/rugby-union/articles/cp8j32l6lddo"}