{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:47:51", "date_modify": "2025-04-26 03:47:51", "date_publish": "2025-03-05 15:28:55", "description": "Salford City boss Karl Robinson says he will do whatever it takes to make his side a success as they target a return to League Two promotion contention.", "filename": "sport_football_articles_cr42wyqwr5ro_1745639271.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/47f6/live/d3699400-f9c5-11ef-9f72-45b1d71715b1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cr42wyqwr5ro_1745639271.html", "title": "Karl Robinson: Salford City boss 'will do whatever it takes' to make club successful", "title_page": "Karl Robinson: Salford City boss 'will do whatever it takes' to make club successful - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Salford City boss Karl Robinson has said he will do whatever it takes to make his side a success as they target a return to League Two promotion contention.\nThe Ammies were third in the table in January, having won six consecutive games, but their form has tailed off since then.\nA humbling 8-0 defeat by Manchester City in the FA Cup preceded a run of just one win from 10 league games, which has seen them slip down to 11th in the table and six points off the play-off places.\n\"I will do whatever it takes for this football club to be successful - so will my players,\" Robinson told BBC Radio Manchester following Tuesday's 2-2 draw against Swindon Town.\n\"I'll work around the clock to give everything I've got. I want the staff to give more. The players to give more. Me to give more.\n\"We've got 11 or 12 games to go and we've moved from a points tally we've been stuck on for three weeks and it's been frustrating the life out of me seeing that.\"\nSalford have struggled with injuries over the winter period but have recently welcomed back midfielders Kelly N'Mai and Ben Woodburn for their end-of-season run-in.\nRobinson said there were reasons to be positive as they look to bridge the gap on the top seven.\n\"We've got some really positive news coming this week in the build-up to Saturday and I'm expecting three more back into the squad,\" he added.\n\"Hopefully we can get players back for this run in and I think we'll be a very good team.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cr42wyqwr5ro"}