{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:35:36", "date_modify": "2025-05-20 13:35:36", "date_publish": "2023-08-01 19:12:13", "description": "New England Revolution boss Bruce Arena has been placed on administrative leave pending a review into allegations of \"insensitive and inappropriate remarks\".", "filename": "sport_football_66377906_1747748136.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/DAC1/production/_130610065_gettyimages-1508014628-1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66377906_1747748136.html", "title": "Bruce Arena: New England Revolution boss investigated for 'insensitive and inappropriate remarks'", "title_page": "Bruce Arena: New England Revolution boss investigated for 'insensitive and inappropriate remarks' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "New England Revolution head coach Bruce Arena has been placed on administrative leave pending a Major League Soccer review into allegations of \"insensitive and inappropriate\" remarks.\nThe American, 71, joined the club in 2019 and is also the sporting director.\nArena has had two stints as United States manager and managed LA Galaxy, DC United and New York Red Bulls.\n\"The organization takes any allegations of workplace misconduct extremely seriously,\" the Revolution said.\nIn a statement the club added: \"The New England Revolution organization has placed Coach Arena on administrative leave as a result of an ongoing investigation being conducted by Major League Soccer into allegations of insensitive and inappropriate remarks.\"\nRevolution are also \"working closely with the League and fully co-operating with its investigation.\"\nBoth the league and club did not offer any further information on the allegations.\nArena led the US from 1998-2006 and again from 2016-17. He is a four-time MLS coach of the year and won five MLS Cups.", "url": "https://www.bbc.com/sport/football/66377906"}