{"authors": ["Sophie Hurcom", "www.facebook.com"], "date_download": "2025-05-21 07:29:54", "date_modify": "2025-05-21 07:29:54", "date_publish": "2025-05-20 16:59:43", "description": "Forest Green Rovers have been through a \"mini pre-season\" before their National League play-off against Southend, says boss Steve Cotterill.", "filename": "sport_football_articles_c3311zlj5vjo_1747812594.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f4c8/live/c5b774f0-3591-11f0-8f95-179a79186756.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c3311zlj5vjo_1747812594.html", "title": "Steve Cotterill: Forest Green have done 'everything' before play-offs", "title_page": "Steve Cotterill: Forest Green have done 'everything' before play-offs - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Forest Green Rovers have been through a \"mini pre-season\" as they prepare for their National League play-off against Southend, says manager Steve Cotterill.\nThe Gloucestershire club, who finished third in the table, have had a 16-day break between the final match of their campaign against Hartlepool on 5 May and their play-off semi-final at home on Wednesday night.\nA win against the Shrimpers would book Forest Green a place in the Wembley play-off final on 1 June against either Oldham or York.\n\"I think we've used it well, I think everybody's very happy with the outcome considering the game's tomorrow,\" Cotterill told BBC Radio Gloucestershire.\n\"We think we've done everything we could possibly do, hopefully that will stand us in good stead come kick-off.\"\nCotterill has brought some stability to Forest Green during his almost 18 months at the club.\nHe was appointed at the end of January 2024 amid a period of turbulence, as their third manager in just five months after David Horseman and Troy Deeney, and with the club rooted to the bottom of the fourth tier.\nWhile Cotterill was not able to save the club from going down at the end of last season, they have built steadily through 2024-25 as they aim to win promotion back to League Two at the first time of asking.\nThe 60-year-old credited the players who remained at the club following their relegation with being a big part of their progression.\n\"It's turned around very quick, but it's been a lot of hard work doing it, it hasn't just happened,\" Cotterill said.\n\"The 15 months since I've been here, I've had a go at it but the two seasons before were pretty difficult to turn around.\n\"It's very difficult when you get on that slippery slide - first you've got to stop the slide, then you've got to build on top of it and the new players that have come in have gelled well with the older players.\n\"They've got incredible spirit about them, they get on well together which is really important and it's a huge testament to them that we are where we are considering probably 50% of the players might have been involved in those 18 months before I got here.\"", "url": "https://www.bbc.com/sport/football/articles/c3311zlj5vjo"}