{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:21:53", "date_modify": "2025-05-20 14:21:53", "date_publish": "2023-07-29 08:34:50", "description": "Nottingham Forest podcast: Would Elanga beat Johnson in a race?", "filename": "sport_articles_clk34kyvlklo_1747750913.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c014/live/bcb766f0-2de9-11ee-9a65-45d5b11d79ed.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_clk34kyvlklo_1747750913.html", "title": "Would Elanga beat Johnson in a race?", "title_page": "Nottingham Forest podcast: Would Elanga beat Johnson in a race? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "BBC Radio Nottingham's David Jackson and Colin Fray have been discussing new signing Anthony Elanga on the Shut Up And Show More Football podcast: \"He looks excited to be a Forest player, and excited to get an opportunity where he might get to play regularly at Forest and sort of prove himself a bit,\" said Jackson.\n\"He's got this fantastic, frightening pace and clearly looks like a talent. He's played for Sweden and was played an awful lot by Manchester United, so they clearly see a lot in him.\n\"But is he faster than Brennan Johnson? If they were to race, one down the right wing and one down the left, is he even faster than Johnson?\"\nFray replied: \"I've got to say, that would be a really good race. I think that's going to be really close. Once Brennan Johnson gets fit - assuming he's not sold - I think that will be really interesting to see in training and in matches.\n\"He was absolutely lightning quick in the friendly against Leeds. He came off the bench and played for the last half an hour. He had to chase one ball down - which for all the world looked like it was going out - but he was just there and somehow he managed to keep the ball in play. It was extraordinary.\n\"If Forest are able to keep hold of Johnson this summer and he and Elanga are both in that team, then it's going to be an interesting challenge for opposition defences - especially if you've got Gibbs-White feeding them down both sides.\"", "url": "https://www.bbc.com/sport/articles/clk34kyvlklo"}