{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:10:17", "date_modify": "2025-05-21 07:10:17", "date_publish": "2025-03-30 10:52:07", "description": "RB Leipzig sack head coach Marco Rose after their Bundesliga defeat by Borussia Monchengladbach and appoint Zsolt Low as interim boss.", "filename": "sport_football_articles_cd7v3yd130zo_1747811417.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/90e6/live/7c270750-0d51-11f0-bc64-a767a4facb99.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cd7v3yd130zo_1747811417.html", "title": "RB Leipzig: Marco Rose sacked with Zsolt Low appointed as interim boss", "title_page": "RB Leipzig: Marco Rose sacked with Zsolt Low appointed as interim boss - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "RB Leipzig have sacked head coach Marco Rose after their 1-0 Bundesliga defeat by Borussia Monchengladbach and appointed Zsolt Low as interim boss.\nRose, 48, departs after two and a half years with Leipzig who are sixth in the Bundesliga table.\nLow, who worked as Thomas Tuchel's assistant manager at Chelsea, Bayern Munich and Paris St-Germain, replaces Rose until the end of the season.\nLeipzig have won three of their past 11 Bundesliga games but are only three points below the Champions League qualification places with seven matches remaining.\nThey also play in the semi-finals of the German Cup on Wednesday against Stuttgart.\nFormer Liverpool manager Jurgen Klopp currently works for the Red Bull group as their head of global soccer.\nSpeaking in January, Klopp said \"I will not be the coach of a Red Bull team,\" should an opportunity arise.\nMarcel Schafer, Leipzig's managing director for sport, said: \"We have believed in our co-operation with Marco and his team for a very long time and, up to now, tried everything to turn things around together.\n\"Given the development and the continued lack of results, we're all firmly convinced that we need new impetus for the remainder of the campaign in order to achieve our aims for the season.\"", "url": "https://www.bbc.com/sport/football/articles/cd7v3yd130zo"}