{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:25:03", "date_modify": "2025-05-21 06:25:03", "date_publish": "2025-04-02 00:00:00", "description": "Dunfermline Athletic take a huge step towards Scottish Championship survival and put a major dent in Livingston's title hopes with a narrow but deserved win at East End Park.", "filename": "sport_football_live_cvgegrr05v5t_1747808703.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cvgegrr05v5t_1747808703.html", "title": "Scottish Championship: Dunfermline Athletic boost survival hopes with narrow win over Livingston", "title_page": "Scottish Championship: Dunfermline Athletic boost survival hopes with narrow win over Livingston - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Dunfermline Athletic eased their relegation fears with a narrow but deserved first win under new manager Neil Lennon that left Livingston counterpart David Martindale conceding the Scottish Championship title to leaders Falkirk.\nEwan Otoo was the home hero, scoring the only goal of the game just before half-time as the hosts moved above Hamilton Academical into eighth place.\nRoared on by a good crowd for Lennon's first home game in charge, it was Dunfermline who started the game on top.\nChris Kane looked sharp and twice came close to opening the scoring against a Livingston side who looked leggy after Sunday's SPFL Trust Trophy final victory.\nDunfermline found the breakthrough on the brink of half-time as Otoo slammed home from a corner after Livingston failed to clear the initial delivery.\nLivingston manager David Martindale made two changes at the break, with Scott Pittman and Michael Nottingham introduced in place of Macauley Tait and Stevie May - and it had a positive impact.\nCristian Montano sent in a wonderful cross from the left-hand side that was met by the head of striker Teti Yengi. Pars goalkeeper Tobi Oluwayemi dived low to his right to keep the ball out and his clean sheet intact.\nThe win drops Hamilton into the relegation play-off spot, while Livingston remain eight points behind Falkirk with five games left to play.\nDunfermline Athletic manager Neil Lennon: \"I thought we dominated the first half and we knew Livi, being the team that they are and what they are fighting for, they would come back at us.\n\"I thought we carried a threat all evening and the players were magnificent. They did everything we asked them to do. We have a youngish squad who have a naievity about them, but there was nothing naive about them tonight.\"\nLivingston manager David Martindale: \"I thought the first 20 minutes we were bullied a bit and never got going. They were really direct and we stood up to that test.\n\"I thought the second half was mainly us as we were committing bodies. Teti Yengi is disappointed with his opportunity from six yards, it was a bit tame. But you have to credit Dunfermline.\n\"The league is done. I have been pretty vocal on that, but we now have to try to finish second - it's still in our hands. Ayr are above us on goal difference, but they are still to come to our place.\"", "url": "https://www.bbc.com/sport/football/live/cvgegrr05v5t"}