{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:42:35", "date_modify": "2025-05-21 06:42:35", "date_publish": "2025-03-28 23:52:43", "description": "Celtic 1-2 Glasgow City: What did the managers say?", "filename": "sport_articles_c7989x22nz5o_1747809755.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6292/live/a4078d80-0c2f-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c7989x22nz5o_1747809755.html", "title": "Celtic 1-2 Glasgow City: What did the managers say?", "title_page": "Celtic 1-2 Glasgow City: What did the managers say? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Glasgow City head coach Leanne Ross: \"The most pleasing part for me is that Celtic had pegged us back in the second half and we showed a bit of character.\n\"To make sure that when Celtic were on top within the game, that we've defended really well, we've limited their chances, and we've stayed in the game and then gave ourselves that platform to then go and score the winning goal.\n\"So that's probably the most pleasing thing for me because in seasons gone by, we've maybe come and performed like that and ended up dropping points.\n\"We know that Celtic are a good team, they've got good players, they're well prepared. We know that they're going to come out in that second half because they're behind and throw everything at us.\n\"So we spoke about it at half-time, we were ready for it. They've scored a good goal, we can probably defend better as you can any time that you can see the goal.\n\"I'm just really pleased that we've dug in and we've seen it out and come away with three points.\n\"It's going to be the same every game from here on in. They're going to be difficult, there's going to be points that are dropped everywhere. So we had to make sure that we came here and done our job tonight so that we can now sit back on Sunday and see what happens in the other games.\n\"That's probably the important thing, when you play first, you get the points so that you're not falling further behind when the other teams go and play.\n\"The top of the table is where we want to be. We were really disappointed with the result against Hibs. We thought we'd performed well enough to at least get a point in that game. We thought we were actually the better team in all honesty.\n\"We've learned our lessons from it and we've come here and put on the performance that we wanted to tonight to win the game.\"", "url": "https://www.bbc.com/sport/articles/c7989x22nz5o"}