{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:36:41", "date_modify": "2025-05-21 07:36:41", "date_publish": "2025-02-11 00:00:00", "description": "Follow live text commentary, score updates and match stats from Brest vs PSG in the UEFA Champions League", "filename": "sport_football_live_cgq0pnn8k71t_1747813001.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cgq0pnn8k71t_1747813001.html", "title": "Brest vs PSG: UEFA Champions League stats & head-to-head", "title_page": "Brest vs PSG: UEFA Champions League stats & head-to-head - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ousmane Dembele continued his remarkable scoring form as Paris St-Germain took control of their all-France Champions League knockout phase play-off with Brest.\nIn-form Dembele added another two goals to make it 18 in his last 11 appearances in all competitions.\nThe France forward had scored three in his previous European appearance against Stuttgart.\nOnly a select group of players have scored hat-tricks in back-to-back Champions League games including Lionel Messi for Barcelona in 2016 and Cristiano Ronaldo for Real Madrid in 2017.\nBut Dembele was denied the chance to join that list when he was replaced in the 82nd minute by Goncalo Ramos.\n\"Everyone is focused and playing really well and that helps me to score goals if I am in the right positions to finish the chances,\" said the 2018 World Cup winner when asked about his form after the game.\n\"The players, whether it's Bradley Barcola, Desire Doue or Kvara [Khvicha Kvaratskhelia], they give me great service, so all I have to do is put the ball in the net.\"\nDembele has 14 goals in Ligue 1 and the Champions League in 2025.\n\"He was already good in 2024 and in 2025 he is even better,\" said PSG boss Luis Enrique. \"It is a pleasure for me when you have so many players who are full of confidence.\"\nFormer Wolves loan signing Vitinha had opened the scoring from the penalty spot in the 21st minute after Pierre Lees-Melou had handled an attempt by Dembele.\nDembele then added the second in the 45th minute with a clinical finish before he made it 3-0, pouncing inside the penalty area in the 66th minute.\nShortly before Dembele's first goal, Brest - who are making their Champions League debut this season - were twice denied by the frame of the goal.\nThis was the first play-off match in the new Champions League format. The return leg takes place in Paris on 19 February.\nPSG, who have never won the Champions League, were heading out of the competition before back-to-back wins over Manchester City and Stuttgart in the league phase secured a play-off spot.\nThey will be strong favourites to advance from this position and face either Liverpool or Barcelona - Dembele's former club - in the last 16.", "url": "https://www.bbc.com/sport/football/live/cgq0pnn8k71t"}