{"authors": ["Dan George & Kevan James", "www.facebook.com"], "date_download": "2025-05-21 05:32:14", "date_modify": "2025-05-21 05:32:14", "date_publish": "2025-01-14 13:11:54", "description": "Hampshire batter James Vince is set to only feature in the Hawks' T20 campaign this upcoming season.", "filename": "sport_cricket_articles_cx2p4wj2wxwo_1747805534.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a570/live/1201fa50-d279-11ef-9377-192b32874917.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cx2p4wj2wxwo_1747805534.html", "title": "James Vince: Hampshire batter to miss county's red-ball cricket in 2025", "title_page": "James Vince: Hampshire batter to miss county's red-ball cricket in 2025 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Hampshire captain James Vince will not play red-ball cricket for the county this season and will instead focus on white-ball games, BBC Radio Solent reports., external\nThe 33-year-old has been the county's leading run-scorer in the Championship for the past four seasons.\nIn 2025, however, he is set to concentrate on the county's T20 Blast campaign, as well as featuring in The Hundred.\n\"I love Hampshire, it's been my club and home for 16 years, so I want to be able to maintain my best to keep delivering for Hampshire in T20 cricket, and hopefully even further our success in the competition,\" he said.\n\"I also need to understand what is best for my family, and combine that with the stage of my career I am at.\"\nThe new deal will allow him to explore other franchise cricket options abroad.\nVince opted to miss Hampshire's participation in the Global Super League in Guyana over the winter as he was contracted to play for Delhi Bulls in the Abu Dhabi T10 competition.\nHe was also retained by Karachi Kings in the Pakistan Super League, with that tournament expected to run from 8 April to 19 May. Hampshire will play six Championship games in that time.\n\"James has been at the heart of the club for the best part of 20-years, showing absolute commitment on and off the field as the team's leading batter and captain,\" said director of cricket Giles White.\n\"We recognise that this announcement will be tinged with disappointment for many fans but hope everyone will join us in celebrating what he has given to our club over many years and supporting him as he fulfils his commitment to continue leading the Hawks in the 2025 Vitality Blast.\"\nSince his debut in 2009, Vince has scored nearly 12,500 first-class runs for Hampshire at an average of over 41.\nHe played 13 Tests, 25 one-dayers and 17 Twenty20 internationals, but last appeared for England in March 2023.", "url": "https://www.bbc.com/sport/cricket/articles/cx2p4wj2wxwo"}