{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:15:49", "date_modify": "2025-05-21 07:15:49", "date_publish": "2025-05-20 10:42:47", "description": "Cardiff boss Matt Sherratt will resume as Wales' interim head coach for the two-Test tour of Japan in July.", "filename": "sport_rugby-union_articles_c0m9mgpv1mgo_1747811749.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5e4a/live/9c4eebf0-2b3e-11f0-bb67-13fec63813db.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c0m9mgpv1mgo_1747811749.html", "title": "Matt Sherratt: Wales caretaker coach confirmed for Japan tour", "title_page": "Matt Sherratt: Wales caretaker coach confirmed for Japan tour - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cardiff boss Matt Sherratt will resume as Wales' interim head coach for the two-Test tour of Japan in July.\nWales are searching for a permanent head coach following the departure of Warren Gatland in February.\nThat process is being led by new director of rugby Dave Reddin but the successor will not be in place for the summer programme, with Sherratt again taking the reins.\nSherratt will be joined in his backroom staff by his Cardiff defence coach Gethin Jenkins, Harlequins duo Danny Wilson (forwards) and Adam Jones (scrum) and Gloucester's Rhys Thomas.\nJonathan Humphreys, Mike Forshaw, Alex King and Rob Howley, who were part of Warren Gatland's backroom staff, will not be involved in Japan.\nWales are expected to add a kicking coach, with Leigh Halfpenny linked with the role Neil Jenkins has occupied.\nSherratt was put in charge of Wales after just two matches of the 2025 Six Nations following Gatland's departure but lost his three games at the helm against Ireland, Scotland and then England - a record 68-14 defeat in Cardiff.\nJenkins will return to the Wales defence coach role he held under Wayne Pivac before he was deemed surplus to requirements when Gatland returned in December 2022.\n\"I'm delighted to have the opportunity to return and coach Wales again this summer,\" said Sherratt.\n\"It's an exciting prospect to go to Japan for two matches in July. We are all looking forward to getting into camp and starting preparations for our summer campaign.\"\nWelsh Rugby Union (WRU) chief executive Abi Tierney says the governing body is grateful to Sherratt taking over the reins.\n\"The impact and positive difference he made to the squad in a very short period of time during the Six Nations was welcomed,\" said Tierney.\n\"It was a tough campaign but we know we are in safe hands whilst we complete the final stages of our recruitment process for a new permanent head coach.\"\nFormer Wales full-back Halfpenny would be involved for the first time as the kicking coach.\nThe 36-year-old former British and Irish Lion has left Harlequins and is expected to continue playing by joining French second division side Beziers next season.", "url": "https://www.bbc.com/sport/rugby-union/articles/c0m9mgpv1mgo"}