{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:23:14", "date_modify": "2025-05-21 07:23:14", "date_publish": "2025-05-20 07:11:44", "description": "BBC Sport F1 correspondent Andrew Benson answers your latest questions before the Monaco Grand Prix.", "filename": "sport_formula1_articles_c991pygp50mo_1747812194.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7ff9/live/d42302e0-34b3-11f0-8519-3b5a01ebe413.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_formula1_articles_c991pygp50mo_1747812194.html", "title": "F1 Q&A: Verstappen, Norris, Piastri, Newey, safety cars and rebuilds after accidents", "title_page": "F1 Q&A: Verstappen, Norris, Piastri, Newey, safety cars and rebuilds after accidents - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Why do people get so excited that Max Verstappen \"is winning in an inferior car\" when it's clearly not an inferior car? - Bob\nSeven races into the season, there is a decent sample from which to draw conclusions about the strengths and weaknesses of the various cars.\nOn pure qualifying pace, McLaren have four pole positions to Red Bull's three, and the McLaren is quicker on average by 0.138 seconds a lap, or 0.163%.\nIn race results, McLaren's Oscar Piastri has four wins, his team-mate Lando Norris one and Red Bull's Max Verstappen two.\nJust distilling it down to those raw statistics, it is clear to see why \"people\" would say the Red Bull was an \"inferior\" car, as you put it. Because, on balance, it is true that the McLaren is the better car over a wider range of circumstances.\nBut their relative performance changes depending on track characteristics.\nIn particular, the Red Bull is strong in high-speed corners. That's why its best tracks of the season have been Suzuka, Jeddah and Imola.\nThis was not as clear at the time of the Japanese Grand Prix as it is now, and that probably explains the reaction at the time to Verstappen's pole lap and win at Suzuka.\nThat's not to diminish the quality of his pole there. It was truly outstanding; the McLaren was slightly faster at Suzuka and either Piastri or Norris could have beaten it had they nailed their laps. But it is extra context.\nBy contrast, when rear-tyre degradation is a big issue, and/or or the corners are slower on balance, the McLaren is a stronger relative package, especially in races.\nThat's how they can go from humiliating Verstappen and Red Bull in Miami to being beaten fair and square in Imola - although had Piastri held on to the lead at the first corner on Sunday, he may well have been able to take a defensive win in a similar fashion to Verstappen's in Japan.\nAt the same time, the picture is never fixed, because F1 cars are prototypes, and Red Bull have introduced upgrades at the past two races, whereas McLaren have not, really.\nMcLaren team principal Andrea Stella put it like this on Sunday evening in Imola: \"Red Bull have improved. They've been developing their car over the last couple of races, and I think they have taken a step forward.\n\"And then, if you look at the speed of the corners, and we compare it with the speed in Miami, it's a completely different regime. The car operates in a completely different part of the aerodynamic maps.\n\"We know that our car is strong in track layouts like Miami, or Bahrain, or China. But when it comes to high-speed corners, like we have here in Imola, I don't think we enjoy any particular advantage.\n\"So, the track layout, the progress of Red Bull, I think they are the two factors that make that we didn't have much advantage today.\"\nWhile it was great to finally see a Lando Norris v Oscar Piastri on-track battle, McLaren also threw away the chance of a win by not applying team orders. Is it too early in the championship for this, or did they miss a trick by not letting Norris have a go at Max Verstappen after the safety car? - Tom\nThe different situations at the two teams contending for the drivers' championship certainly provide an interesting contrast.\nOn the one hand, Red Bull are very much focused on Max Verstappen, while McLaren are trying to be absolutely fair to both drivers.\nThis reflects a fundamental difference in approach from the two teams, but it also arises practically from circumstance.\nVerstappen is Red Bull's clear number one, but he is also their only driver consistently in the mix at the front.\nMcLaren can't impose team orders at this early stage of the season, as their drivers are closely matched, and it would undermine the philosophy with which they go racing, and the pledges they have made to both.\nHaving said that, there is no evidence at all to suggest McLaren \"threw away the chance of a win by not applying team orders\" on Sunday in Imola.\nPresumably the question is based on the final part of the race, after the safety-car restart, when Piastri on old tyres was second behind Verstappen, and Norris, on fresh rubber, was third.\nThe question implies that had McLaren ordered them to switch positions immediately, Norris would have beaten Verstappen to the win.\nBut why should anyone assume Norris would definitely have passed Verstappen had he been behind him at the restart?\nThey were on tyres of equal life and overtaking is difficult at Imola. And at no stage in the race did either McLaren driver look like they had the pace to challenge Verstappen once he was ahead.\nPiastri kept up with him in the first stint for a while, but began to drop back, and pitted early because his tyres were going off. And Norris made no ground on Verstappen once he was clear of George Russell's Mercedes.\nThe McLaren and Red Bull were very evenly matched in Imola - McLaren's chances of the win were effectively gone once Piastri had lost the lead at the first corner.\nStella said: \"We attempted to unlock various scenarios to try to beat Max, but at no stage I think we saw that we had enough race pace.\n\"Even with the final safety car, Lando could pass Oscar and try to push as much as possible. Pretty much Max was responding to Lando. So here to overtake you need [a performance advantage of] 0.7-0.8secs. So I think it is what it is. The main factor remains the swap of position and the outcome of lap one.\"\nAre we starting to see Adrian Newey's influence at Aston Martin with their latest upgrade packages? - Tim\nAston Martin have been keen to play down the idea of Newey having any involvement in the 2025 car since he joined at the beginning of March, emphasising that his priority is the new rules being introduced next year.\nBut in an interview published on the team's website leading up to Imola, Newey said he had been involved to some extent.\n\"Lawrence [Stroll - team owner] understandably wants us to do as well as we can in 2025, so there's a small team still working on this year's car from an aerodynamics point of view,\" Newey said.\n\"I've had a few lunchtime conversations with that small group, discussing the car and what we can do about it.\"\nSo, the short answer is, yes.\nAston Martin say the basis of the upgrade package introduced last weekend was laid out around the time of the Australian Grand Prix - shortly after Newey joined. There is no suggestion he was heavily involved in it.\nBut if Newey can see some low-hanging fruit and easy wins on the 2025 car, why would he not say so? He's in the factory, after all. And it seems that is what is happening, without distracting him too much from next year.\nHaving said that, it is important not to overstate the impact of the Imola upgrade.\nYes, the team had their best qualifying performance of the year so far, with Fernando Alonso fifth on the grid and Lance Stroll eighth.\nBut there were a number of factors in that. For one, they got their tyre strategy right, using both medium and soft tyres in qualifying in a way no other team did.\nIt would be wrong, though, to say their places were entirely down to using mediums for their final runs in Q2 and Q3 because, as Alonso said, they were quick on both types of tyres.\nBoth drivers nailed their laps, which has not always been the case this year.\nAnd Imola was a high-speed circuit, the type where the Aston Martin has been most at home this year.\nIn raw-pace terms, this was the closest they have been to pole in 2025, at 101.019%.\nBut it was only slightly better than Japan (101.051%) and Saudi Arabia (101.156%), at both of which Alonso qualified 13th.\nSo, it was encouraging, but - at least not yet - a completely new dawn.\nAlonso described the performance as \"definitely a step forward\" after the race, but he had also been cautious after qualifying, saying: \"We need to keep the feet on the ground, and maybe the track characteristics, it does help the Aston, so we'll need to see in Monaco and Barcelona.\"\nWhy a virtual safety car for Esteban Ocon's retirement and the full safety for Kimi Antonelli's when they stopped in the same place? - Darren\nOn the face of it, these two scenarios did seem to suggest the sort of inconsistency that drivers and teams are asking the FIA to avoid.\nIn fact, the different responses were a result of them stopping in the same place, the FIA says.\nBoth stopped on the grass on the left-hand side of the track on the run uphill from Tosa to Piratella. Ocon's Haas was rolled backwards down the hill to the nearest marshals' post, where it was placed out of danger behind a barrier.\nThis was a relatively easy job that could be done quickly - hence the virtual safety car.\nBut it meant that when Antonelli's Mercedes stopped in more or less the same place - actually a little further on - there was no space for it in the marshals' post behind it, because Ocon's car was already there.\nThat meant it needed to be pushed uphill to the next marshals' post, and that needed a recovery vehicle. And it took about five minutes for the recovery vehicle to get there.\nThe presence of the recovery vehicle, and the longer delay, meant it tipped the need over to a full safety car, in the race director's view.\nDuring Imola qualifying, both Yuki Tsunoda and Franco Colapinto completely trashed their respective cars. Less than 24hrs later, they start the race. Is it a totally new car? Complete/partial rebuild? Can they work on them overnight? Spare parts with the teams or bits flown in? What are the rules of the game? - Keith\nTsunoda's car required a new chassis, and Red Bull also fitted a new engine. But there were quite a few parts that were still able to be carried over, the team say, despite the violence of the accident.\nRed Bull were up until 2am fixing it. There is a curfew overnight, to ensure staff get sufficient rest, but if needed teams can break this - they have three exemptions throughout the year before receiving a penalty.\nIn this case, while Red Bull were at the track outside the curfew hours, they did not break it because they withdrew the car from what is known as parc ferme - a regulation that means changes cannot be made between qualifying and race. And if they are, the car starts from the pit lane.\nColapinto's crash was nowhere near as big, and Alpine did not change his chassis, nor did they fit a new engine. But they changed a fair number of parts, such as entirely new front (but not rear) suspension, and a bunch of other parts, which were listed on official documents.\nTeams are not allowed to take a fully assembled spare car, but they can take a spare chassis, and the parts needed to make a new car.", "url": "https://www.bbc.com/sport/formula1/articles/c991pygp50mo"}