{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:42:24", "date_modify": "2025-05-20 13:42:24", "date_publish": "2023-08-01 14:16:17", "description": "Livi living in 'golden period' with stability and summer strengthening", "filename": "sport_articles_c25gz13879wo_1747748544.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b2dc/live/ffe7e070-3074-11ee-8f52-fbf70e4bf742.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c25gz13879wo_1747748544.html", "title": "Livi living in 'golden period' with stability and summer strengthening", "title_page": "Livi living in 'golden period' with stability and summer strengthening - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Stuart Barrie, Livingston fan\nHere we go on an incredible sixth season in a row in the Premiership for Livi. There’s never a dull moment with the Lions but the recently stability on and off that park makes this a golden time for us. It’s very pleasing to see a return to the golden/amber traditional home top and a rather smart black away kits too... both are top notch.\nWe’ve strengthened in most areas with Sangare looking a physical presence in midfield to complement the miniature maestros we have in the engine room. We look like we are going to three at the back so there’s a welcome couple of recruits in that area with Mickey Devlin catching the eye with solid performances already. Full back Jamie Brandon has also impressed this pre-season after an injury hit league campaign last year.\nGoals are always going to be at a premium for Livi. If we can convert even half our penalties this season and break the terrible run of missing so many with almost every outfield player having a shot at pens and failing miserably, that'd be helpful...\nThere areloads of rumours around Joel Nouble being snapped up and Bruce Anderson has already turned down an offer from abroad so the attacking options upfront are probably an area boss Davie Martindale is keeping an eye on before the transfer window closes. There are rumours and even sightings of a South African winger signing for us so that could an exciting option if he ever gets to play...\nIt's early days but Stephen Kelly looks to be our main man going forward. He’s busy and creative with an eye for goal from a free kick. We offer more going forward with him in the team so keeping him fit and on form could be pivotal.\nPredicted finish: Heart says 8th and head says 11th\nStandout player will be: Stephen Kelly", "url": "https://www.bbc.com/sport/articles/c25gz13879wo"}