{"authors": ["Katie Stafford", "www.facebook.com"], "date_download": "2025-04-26 04:38:24", "date_modify": "2025-04-26 04:38:24", "date_publish": "2025-02-28 10:43:18", "description": "Eddie Howe press conference: Newcastle vs Brighton preview", "filename": "sport_football_articles_cpwddle01q8o_1745642304.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3e34/live/3814b960-4923-11ef-9e1c-3b4a473456a6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cpwddle01q8o_1745642304.html", "title": "Eddie Howe press conference: Newcastle vs Brighton preview", "title_page": "Eddie Howe press conference: Newcastle vs Brighton preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Howe says he will see how Alexander Isak is today but he doesn't think it's a long-term problem with his groin. He added: \"There was no risk taken on Wednesday and there can't be at the stage of the season we're in. If he is fit, he will play.\"\nFellow striker Callum Wilson \"took a cut to his eye but nothing more than that\" and is expected to be available.\nHowe said it is \"is a big day\" for Sven Botman and Joelinton because a decision on their fitness will be made based on whether they are able to train with the first team or not.\nHe was hesitant to confirm whether Nick Pope will keep his spot for Sunday's game and said: \"We take it on a game by game basis as we do with all team selections. We are always looking to pick our strongest team and it is up to the players to confirm their place or not.\"\nOn how cautious he has to be with Isak: \"It is pretty clear for me, if he is fit in any game leading up to the EFL Cup final then he will play and we have to have that mindset with all of our players. You can't save players as they will lose rhythm. The best thing for a player to stay in good form and to stay fit is to play them and that's what we will try to do with all of our players.\"\nHe said without their number nine \"it's still a team that can be successful but they will have to do it in a different way\" because they have \"moulded\" their team around Isak's \"qualities\".\nHe praised Wilson for doing \"a great job for the team in a change of system on Wednesday\" against Liverpool, but admitted they \"missed Alex\".\nOn suggestions they are a 'one-man team', Howe said: \"I don't think we are a one man team. I will never classify us in that bracket but Alex brings unique qualities in that centre-forward role, in that pivotal middle role that we need.\"\nOn Tino Livramento being linked with Manchester City: \"It is frustrating for us that we are constantly talking about players and rumours of them leaving. We want to go the other way and strengthen the group. We want to make our team and squad stronger for the future rather than lose our best players.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cpwddle01q8o"}