{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:54:19", "date_modify": "2025-05-21 06:54:19", "date_publish": "2025-03-29 17:30:48", "description": "United won't let season 'peter out', says Moult", "filename": "sport_articles_cy0d0r7ldkro_1747810459.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/103a/live/22eedc80-0ca2-11f0-b9c1-c72027c898f8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cy0d0r7ldkro_1747810459.html", "title": "United won't let season 'peter out', says Moult", "title_page": "United won't let season 'peter out', says Moult - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Louis Moult is adamant Dundee United won't let their season \"peter out\" as he urges his teammates to be \"aggressive\" at Dingwall on Sunday.\nJim Goodwin's side suffered their first home defeat against Dundee for 21 years when they lost 4-2 before the international break.\nHowever the Tangerines are still in the hunt for a top six spot with three games until the split.\n\"We have three massive games that can probably determine your season,\" the striker said.\n\"It would be such a shame to come this far and let the season peter out. That's why I mention a positive mindset, you need to stay focused until the very end of the season.\n\"We have a good bunch in there and the manager is always keeping us on our toes and that's exactly what we need.\"\n\"We have had to wait a little bit longer but that little bit of aggression, controlled aggression, needs to be on display on Sunday.\n\"We are going to rectify what went wrong against Dundee. We need to start fast on Sunday.\n\"Clean sheets are a big one. Where we are in the league has come from being solid at the back, because I always believe we will create chances and get goals. So it's probably going back to basics a bit.\n\"It's a tough place to go but we need to go there with a positive mindset and take our game to them.\"", "url": "https://www.bbc.com/sport/articles/cy0d0r7ldkro"}