{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:40:53", "date_modify": "2025-05-20 11:40:53", "date_publish": "2023-08-07 00:00:00", "description": "Watch, listen and follow text updates as Australia beat Denmark in the last 16 of the Women's World Cup.", "filename": "sport_live_football_66183989_1747741253.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/93F5/production/_130677873_gettyimages-1598532040.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_football_66183989_1747741253.html", "title": "Australia 2-0 Denmark LIVE: Fifa Women's World Cup", "title_page": "Australia 2-0 Denmark LIVE: Fifa Women's World Cup - score, commentary & updates from last-16 game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Quarter final line-up almost complete\nThat's all from us. The final two quarter-finals take place tomorrow, and we'll have live commentary on both. Here's what's coming up:\nColombia v Jamaica (09:00 BST)\nFrance v Morocco (12:00 BST).\nSee you later!\nPost\nThe quarter-finals are taking shape with just England and Australia now waiting to find out who they will next face.\nIt will be either France or Morocco against the hosts, with those two sides playing their last-16 tie tomorrow.\n'Efficiency the difference between the sides'\nFT: Australia 2-0 Denmark\nFara Williams\nFormer England midfielder on BBC Two\nI thought these teams cancelled each other out a bit.\nBut the difference? Australia's quality in the final third.\nThe chances they created in the final third, four on target, two goals, much more efficient than Denmark.\n'Kerr's smile what football is all about'\nFT: Australia 2-0 Denmark\nFara Williams\nFormer England midfielder on BBC Two\nWhen Sam Kerr came on, that was the moment when I got excited.\nThe poster girl of the tournament coming on for her first appearance, the smile on her face when she runs on.\nThis is what football is all about.\nMatildas lap of honour\nFT: Australia 2-0 Denmark\nAnna Thompson\nBBC Sport at Stadium Australia in Sydney\nPlenty of fans have stuck around after the final whistle as the Matildas make their way around the stadium for a lap of honour.\nThe beaten Denmark team had a huddle in the middle of the pitch before a mini walkabout to show their appreciation too as they bow out of the tournament.\n'An exceptional team performance'\nFT: Australia 2-0 Denmark\nAlex Scott\nFormer England and Arsenal defender on BBC One\nAustralia have the momentum, and there are plenty of positive to take from that game.\nMain one, poster girl Sam Kerr gets minutes ahead of the next game.\nHow defensively disciplined they were in stopping a world class player in Pernille Harder.\nOverall, a real exceptional team performance.\n'Convincing win for the Aussies'\nFT: Australia 2-0 Denmark\nSue Smith\nFormer England international on BBC One\nA convincing performance.\nGreat performances from Raso and Foord, they brought the quality when Australia needed it.\nAustralia moving on. Brilliant from them, poor from Denmark.\nFULL-TIME\nAustralia 2-0 Denmark\nAll over as Australia march on!\nIt was ultimately a comfortable win for the hosts, despite an encouraging start by Denmark.\nFrance or Morocco await in the quarter-finals.\nSUBSTITUTION\nAustralia 2-0 Denmark\nTameka Yallop is on for her first appearance at this tournament.\nShe replaces Caitlin Foord, who gets a deserved ovation after a fantastic performance.\nYallop is going to have about five seconds of action.\nPost\nAustralia 2-0 Denmark\nSam Kerr falls awkwardly as she looks to get to a ball after a shot is deflected to her. A moment of concern for the Australia fans but she is okay.\nThere's five minutes of stoppage time.\n'That's what the home fans want to see'\nAustralia 2-0 Denmark\nSue Smith\nFormer England international on BBC One\nThat's what the crowd want to see.\nThey know what Sam Kerr is capable of and you can hear them cheering when she gets the ball.\nPost\nAustralia 2-0 Denmark\nExquisite touch by Pernille Harder as she flicks the ball over a defender. Sanne Troelsgaard picks the ball up as Harder makes a run into the box but Troelsgaard is forced wide and the chance is gone.\n'Denmark seem to have run out of ideas'\nAustralia 2-0 Denmark\nSue Smith\nFormer England international on BBC One\nYou feel if Denmark can just get a goal back then it would make the last few minutes interesting.\nBut it just doesn't look like happening.\nThey seem to have run out of ideas and haven't really tested that Australia back line.", "url": "https://www.bbc.com/sport/live/football/66183989"}