{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:05:33", "date_modify": "2025-05-20 13:05:33", "date_publish": "2023-08-02 16:44:43", "description": "Robson says Dons are ‘desperate’ to start Premiership campaign", "filename": "sport_articles_crge46wj2g0o_1747746333.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8e57/live/f8a2c440-3152-11ee-8f52-fbf70e4bf742.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_crge46wj2g0o_1747746333.html", "title": "Robson says Dons are ‘desperate’ to start Premiership campaign", "title_page": "Robson says Dons are ‘desperate’ to start Premiership campaign - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Aberdeen manager Barry Robson believes that his players are \"desperate to get going\" after a \"tactically heavy\" end to pre-season.\nThe Dons boss is still looking for potential recruitment options but is happy with the business done so far, highlighting that lots of the summer recruits have potential that they are yet to reach.\n“The players have come back from their breaks in good shape and we’ve changed some habits in them that we would like to see on the football pitch and tactically we’ve started to get heavy as the weeks have progressed,\" Robson said.\n“The boys are desperate to get on the pitch to get going and we’re really looking forward to it, we will try and attack, bring speed and energy into the game.\n“We’ve had a good pre-season, we’ve recruited well and a lot of the players know how we want to do things.\n“The first thing we tell players when they want to sign for Aberdeen is that we want to win games and then after that we want the fans to enjoy it, we have to bring excitement which is not always easy.\n“When you see the recruitment that we have done you will see that there are a lot of players that haven’t reached their ceiling, which we hope to do with them.\n“There’s still a long way to go in the window, we know exactly what we want, we want to strengthen to give the boys a hand with the number of games coming up.\"", "url": "https://www.bbc.com/sport/articles/crge46wj2g0o"}