{"authors": ["Phil McNulty", "www.facebook.com"], "date_download": "2025-05-21 05:22:04", "date_modify": "2025-05-21 05:22:04", "date_publish": "2025-04-03 12:01:28", "description": "From low block to high press - are these new phrases or rebadged jargon? Phil McNulty speaks to Pat Nevin and Chris Sutton to find out.", "filename": "sport_football_articles_cq80vkyxqqdo_1747804924.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d4f6/live/3b43abe0-1089-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cq80vkyxqqdo_1747804924.html", "title": "Football's new phrasebook - modern language or just jargon?", "title_page": "Football's new phrasebook - modern language or just jargon? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Is it simply the modern language of football? Or just \"jargon\" dressing up the game's time-honoured glossary of terms in fancy new clothes?\nFrom a \"low block\" to a \"high press\", football's phrasebook has gained many new entries in recent years that have become part of the conversations before, during and after games.\nThese words alone spark debate from supporters to players past and present, from the cynics who dismiss them, to the newer generation who embrace them as an integral part of the football experience.\nBBC Sport pundits Pat Nevin and Chris Sutton, who have to decide which to use or avoid, have outspoken views on the subject.\nFormer Scotland forward Nevin says: \"I think it's just jargon used in every industry. It is showing someone you're in a little cosy club. You are saying 'we know about these things' and it makes you sound a bit cleverer.\n\"It is saying 'we're in the club, we're in the know - you're not'. I never use them, or if I do I immediately apologise or flag it up.\n\"For instance, I might say a team is defending really deep, then add 'or as they say in the modern parlance, a low block'.\"\nSutton said: \"It's just the evolution of the game. They're just different words aren't they? I'm not one who gets too stuck in the past - but there might be one I take real umbrage with.\"\nSo what are these modern terms? And what do they really mean?\nThe official description, according to statisticians Opta and data firm Second Spectrum, is when \"a defensive team has recently lost the ball and has not had time to re-organise its defensive shape. [The team] is out of position, and is either pressing or actively moving to get back into a stable defensive position\".\nNevin: \"The gold standard of the new jargon. It says you probably don't know what you're talking about, but you want people to think you are.\n\"I have never used it, other than facetiously. There should be a ban on it. Let's invoke a three-strike-and-out transitions law.\n\"Use it once as a co-commentator and you get a stern look, twice a yellow card, then three times you're on your way.\n\"What does it mean? You've given the ball away again. That's it.\n\"When coaches say they have to work on transitions, they should just not give the ball away and be better.\"\nSutton: \"I've always thought transition is when you win the ball back. It's a change isn't it? It's what the word means. Change from defending to attacking.\"\nA \"low block\", as defined by Opta, is the starting position of your team from your own goal.\nInterestingly, Nottingham Forest - third in the Premier League and heading towards the Champions League - are currently second-lowest with a starting position of 39.6 metres, sandwiched in between Southampton (39.8 metres) and Ipswich Town (39.4 metres) who are both almost certainly heading back to the Championship.\nNevin: \"Nottingham Forest suggests an exception and a successful strategy, but my overall definition is it means you're not good enough as a team, you can't get the ball out, so you defend deep.\n\"There you go - it's defending deep. It's just easier to say 'we're playing in a low block' rather than admit you're not good enough to play out so we have to sit back and play on the break.\n\"It's a fairly modern, generational thing. You can spot it a mile away. You can't wear a big sticker saying 'I've got my coaching badges' but this is almost telling people you've read the manuals and you've got your badges.\"\nSutton: \"It's the new phrase for defending your own box or defending deeply. I don't know where some of these phrases come from.\"\nThis is a defensive tactic where a team places its defenders higher up the pitch. Much focus has been placed on the \"high line\" Ange Postecoglou employs at Tottenham Hotspur, but the current highest line in the top flight is Manchester City at 45.9 metres.\nNevin: \"This is the one I'm absolutely fine with, because it is descriptive and perfectly explains what is happening to someone who may not know football very well.\n\"It's probably much older than the rest of the cliches and I would say it would have been used when I played.\"\nSutton: \"Fine by me. Making sure the distance between defenders and midfield isn't too great, teams can't play through out and you look to catch careless forwards offside.\n\"If you use this phrase, listeners or viewers will understand exactly what you mean.\"\nThis means defending high up the pitch to force the opposition into mistakes.\nNevin: \"New jargon. Been done for years. It's not a new Pep Guardiola thing. 'The Crazy Gang' at Wimbledon used to do it when I played and were brilliant at it.\n\"The old phrase was 'closing down'. You close the opposition down and get right in their faces high up the pitch. It's been rebranded as some new concept but every team used to do it.\n\"The recent great Barcelona sides were the high watermark, but it started in the 1970s when Johan Cruyff used to do it with Ajax. I did it for the first time in under-15s football at Celtic Boys Club.\n\"When I played, we usually did with a sign, which could be anything, but the favourite sign was 'when you see that big useless centre-back get the ball, all go in to try and make him give the ball away'.\"\nSutton: \"If someone talked to me about a 'high press' when I was playing, I would have thought they were telling me to iron my shirt.\n\"It's closing down and I suspect Herbert Chapman's great Arsenal side in the 1930s was doing this.\n\"It's a classic from people who think football didn't exist before 2010 and the '60s, '70s and '80s never happened. Do they think players of that era just stood around in a rigid 4-4-2 and didn't run or close down?\"\nSpurs boss Postecoglou called this \"the most useless statistic in world football. Seriously, it could fall off your backside, fall to somebody on the halfway line who scores and it's an assist. It doesn't impress me\".\nThe Opta definition is simple - the player who passes the ball to the player who scores.\nNevin: \"I like assists because I got far more assists than goals in my playing career, but Ange makes a great point. I used to keep a record of them. I agree with Ange, but as a phrase people do know what it means.\n\"I was always a bit miffed on the other side of that argument when I beat seven men, drew the keeper and passed it to John Aldridge to tap in at Tranmere.\"\nSutton: \"I take Ange's point. There could be a proper assist but what if the ball hits you on the backside? Is that really an assist?\n\"And what about when a player lets the ball run through his legs, or draws a defender out of position. That's one for the nerds and laptop crunchers.\"\nTypically a striker (often wearing number nine) dropping deeper into midfield to link play, disturb the opponents' defence and make space for others, rather than playing in the traditional forward's role.\nNevin: \"I'm absolutely OK with this. The first time it was used to me was in 1982 at the European Under-18s Championship when I was with Scotland. We won it in Finland and I was player of the tournament. We beat Czechoslovakia in the final so I was very happy with it.\n\"The coaches were Andy Roxburgh and Walter Smith. Andy ended up becoming Uefa's first technical director. He used a phrase 'unreal nine' or 'false nine'. It simply means no-one playing as as a traditional centre forward. It is a false striker.\n\"We rotated it with Scotland between myself, Ally Dick of Spurs and Gary Mackay of Hearts. We had two wide attackers and a false nine but all three of us could do all three jobs.\"\nSutton: \"What is the difference between a 'false nine' and 'number 10'? Think of Roberto Firmino at Liverpool. Someone who is essentially a forward who drops deep to show for the ball and link everything.\n\"At Blackburn when we won the title, we played 4-4-2 but a striker would drop deep when the opposition had the ball to attach themselves to a midfielder. Is that the same thing?\"\nThree phrases for the price of one. Effectively a defensive midfielder - or two - used by some teams to act as a shield for defence and link the whole side together. As the word means, \"a central point\".\nNevin: \"It's just a new name for the deep-lying central midfield player. In South America they would call that a 'five'. It is trying to pigeonhole all of them into one simple term.\n\"Chelsea play with two pivots, two 'sixes'. It's 4-3-3 with two deep-lying midfield players. It was used with Scotland when I played. Graeme Souness could do that easily and brilliantly.\n\"Chelsea do it all the time with Moises Caicedo and they have Enzo Fernandez, Romeo Lavia and are asking Reece James to do it as well.\"\nSutton: \"I don't know where this 'pivot' thing came from. It was a defensive midfielder, then a holding midfielder - and now we've got pivot.\n\"The 'pivots' I played with were Neil Lennon at Celtic and David Batty at Blackburn. Strong defensive holding midfield players.\"\nThis is taken to mean the spaces between the edge of the penalty box towards the 'D' on either side of the area.\nNevin: \"Instantly droppable. Nonsensical. It only exists when a little gap opens up, basically just looking for a space between the striker and the midfielder. I don't think it's a very helpful phrase and is pretty meaningless.\"\nSutton: \"An absolute no-no. It's simply wrong. What a load of nonsense.\n\"How can you have a half-space? A space is a space is a space. If I dig a hole it's a hole. It is not a half-hole.\nThis phrase is believed to have originated in American football to describe an area of the field that forms around the quarterback on passing plays.\nNevin: \"Pockets of space is telling people to find space, It's just new words for the same thing.\"\nSutton: \"I get this a bit more. I think that's allowed. You can also call it a zone.\n\"I think this is the space in between the opposition defence and midfield, in the wider channels when teams play with three forwards and the highest forward will drop into spaces.\n\"As a description people will understand what you're talking about.\"\nThis is used to describe spaces between lines line of forwards and midfield players or midfield players and defenders.\nNevin: \"Teams never stand in straight lines, which is the silliness of all of this. If the formation has what you might call 'lines', you're trying to find the gaps and spaces between those lines.\n\"The last thing you do is go there between the line. You have to arrive when the ball arrives in there. That's the skill Cole Palmer is the best at it in the Premier League. Never stand there - always arrive there.\"\nSutton: \"I don't know who thought of this. Teams don't just line up in straight lines in a 4-3-3 or 4-4-2.\n\"The term itself presumably means you try to play through these so-called 'lines', mainly between the midfield and attack.\"\nAnd one to watch out for...", "url": "https://www.bbc.com/sport/football/articles/cq80vkyxqqdo"}