{"authors": ["Emma Smith", "www.facebook.com"], "date_download": "2025-05-21 07:49:13", "date_modify": "2025-05-21 07:49:13", "date_publish": "2025-05-18 17:39:23", "description": "Nottingham Forest's win at West Ham was high on drama, with some great goals, jaw-dropping errors and even the odd scrap. But unfortunately it is the officials and the technology which makes the headlines again.", "filename": "sport_football_articles_c93yg8x3335o_1747813753.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3390/live/8c9db0a0-3409-11f0-96c3-cf669419a2b0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c93yg8x3335o_1747813753.html", "title": "Nottingham Forest: Nuno's men survive 112 minutes and VAR fiasco to boost Champions League dream", "title_page": "Nottingham Forest: Nuno's men survive 112 minutes and VAR fiasco to boost Champions League dream - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Another game, another bad day for VAR.\nNottingham Forest's win at West Ham was high on drama, with some great goals, jaw-dropping errors and even the odd scrap. But it is the officials and the technology in the spotlight again.\nThe problem for the video assistant referee this time came after Nikola Milenkovic flicked Anthony Elanga's free-kick past Alphonse Areola to put Forest 2-0 ahead in the second half.\nIt looked like there may have been a marginal offside, so VAR was called on for a quick check.\nThat quick check turned into an excruciating six-minute delay as the semi-automated offside technology was not working, and neither was the communications system between on-pitch referee Sam Barrott and the VAR.\nThe Premier League Match Centre said in a statement on X, external: \"The referee's call of goal was checked and confirmed by VAR – with Milenkovic in an onside position and Nicolas Dominguez in an offside position, but deemed not to be impacting on play.\n\"The semi-automated offside technology was not available to the VAR in this incident. There were also issues with the VAR communications to the on-field officials.\"\nIt resulted in the video assistant having to make a subjective decision, while poor Barrott – barracked by boos and whistles from all corners of London Stadium – had to explain the issues to players and managers.\nAs West Ham boss Graham Potter wryly put it: \"They were drawing lines, and I think they ran out of ink.\n\"It happens, there is nothing we can do. It is not ideal for me, [Forest head coach] Nuno, the ref, the people in stadium - they think VAR are taking a long time deciding what to do, but it's the tech.\"\nThe delay played a large part in this becoming the second longest game in the Premier League this season - it lasted for 112 minutes and 55 seconds.\nWith his side having survived 16 minutes of second-half stoppage time - Matz Sels made a crucial last-gasp stop from Niclas Fullkrug - Forest boss Nuno Espirito Santo could afford to make light of the situation.\n\"I was hoping for the game to end!\" he joked in his post-match media conference.\n\"The ref explained there was a problem with the connection. We don't want this to happen, but when it is it is about keeping composure to the end.\"\nFor Forest, it is critical they kept their nerve and held on to a win which means their Champions League dream can still become a reality.\nThis was only their second win in seven Premier League games, with the dip in form resulting in Forest falling from the top-five berth they have occupied for most of the season.\nBut Forest seem to bring their best when they are under the cosh, rather then in the matches they are expected to win – such as their previous game at home to relegated Leicester, when they drew 2-2.\nForest's win - dug out from under a deluge of late West Ham attacks, born from a succession of late blocks – was their 10th away league victory of 2024-25.\nIt is twice the number they have won on the road in their last two league seasons combined, their joint most in the Premier League era alongside 1994-95 – when Forest finished third – and most have come in games where they had a minority of possession and played under pressure.\nAt West Ham, Forest had 39.5% of the ball.\nThat is not to say they are lucky. This game also showed Forest's great virtue of hard work. Morgan Gibbs-White anticipated the 11th-minute rick by West Ham keeper Alphonse Areola, nipping in to intercept a weak pass and slam into the empty goal. It was the 17th goal Forest have scored from opposition errors this league season.\nThey also have quality, as shown by Elanga's devilish set-piece which Milenkovic turned in to spark the VAR chaos.\nIt was Swedish forward Elanga's 11th league assist of 2024-25 – level with the Forest record in the Premier League, alongside Bryan Roy in 1994-95.\nVictory means they take the battle to the last game next Sunday, when they host Chelsea – one of their rivals for a Champions League spot.\nForest must beat the Blues, and hope at least one result from the games involving fellow contenders Newcastle, Aston Villa and Manchester City goes in their favour.\nNot bad for the side who finished fourth-bottom last season.\nPotter said Forest's rebirth was \"aspirational\" for West Ham, while when asked if he would have taken this scenario if offered it in August, Nuno said: \"I will sign it!\n\"Sunday will be a special game, we have to enjoy the moment. Since the beginning of the season we wanted to be in this fight. We are in the last game and the City Ground will be huge.\"", "url": "https://www.bbc.com/sport/football/articles/c93yg8x3335o"}