{"authors": ["Stephan Shemilt", "www.facebook.com"], "date_download": "2025-05-20 13:27:25", "date_modify": "2025-05-20 13:27:25", "date_publish": "2023-07-26 10:29:19", "description": "Captain Ben Stokes backs James Anderson as the \"greatest fast bowler to play the game\" as he was named in an unchanged England team for the final Ashes Test against Australia.", "filename": "sport_cricket_66313864_1747747645.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/15C7C/production/_130521298_gettyimages-1569416371.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66313864_1747747645.html", "title": "The Ashes 2023: James Anderson retains place as England name unchanged team for fifth Test", "title_page": "The Ashes 2023: James Anderson retains place as England name unchanged team for fifth Test - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Captain Ben Stokes backed James Anderson as the \"greatest fast bowler to play the game\" as he was named in an unchanged England team for the final Ashes Test against Australia.\nAnderson, who turns 41 on Saturday, has taken only four wickets in the series.\nWriting in his column for the Telegraph,, external Lancashire's Anderson said he had no plans to retire.\n\"Although he's not had the impact he would have liked to in this series, he's a quality bowler,\" said Stokes.\n\"It's very hard for anyone to sit here and say he's not. Jimmy's come under a bit of flak for that but if Joe Root hadn't scored the runs he would have liked, you wouldn't be questioning him staying in the team as a batter.\n\"James Anderson is the greatest fast bowler to play the game and he's still looking as good as he was two years ago.\"\nWith 689 scalps, Anderson is England's all-time leading wicket-taker in Test cricket.\nHowever, a quirk in a glittering career is his recent record against Australia - he has not been involved in a Test win against England's oldest rivals since 2015.\nIn this series, the tourists have continued to employ a tactic of seeing off Anderson, which has been successful in Ashes series in Australia.\nAcross the four Tests so far, Anderson's economy 2.69 in the best of any bowler in the series, but his strike-rate of 171 is also the worst.\nWhen Anderson takes the new ball in the fifth Test starting on Thursday, he will be the oldest England bowler to do so in an Ashes Test since Johnny Douglas in 1925.\nAfter this match, the next time Anderson could play for England is on the tour of India in January.\nAddressing speculation about his future, Anderson wrote: \"I love playing Test cricket as much as I ever have and this is my favourite period as an England cricketer.\n\"Just being around this group, the way we play and how we enjoy ourselves on the field. There are no thoughts about retirement.\"\nWith England looking to level the series at 2-2, they have retained the same XI that was denied the opportunity to push for victory in the fourth Test by the Manchester rain.\nThat means Anderson's long-time new-ball partner Stuart Broad will play in every one of England's home Tests this summer at the age of 37.\nBroad's 18 victims makes him the leading wicket-taker in the Ashes series so far.\n\"It's been incredible,\" said Stokes. \"We said before we started it would be very difficult for a bowler to play in all five, but he's been awesome.\n\"It's very hard to look past someone like that who has had such a big impact at important times. You have to give him huge credit for stringing five games in a row together. That's testament to all the hard work he puts in off the field.\"\nAlthough England cannot win the Ashes, they are looking to deny Australia a first series win in this country since 2001.\nSpeaking to BBC Sport, Stokes said: \"Australia want to come here and win the Ashes, we want to win this game because we don't want Australia to be able to say they have won this series.\n\"We have been very clear about that even before the series started. We want to win this game. If things don't go our way and we don't end up being on the right side of the result, we will not stop.\n\"We will not be hampered by the result of this series and that will not dictate how we go about things in series to come.\"\nAustralia have not confirmed their XI, with a decision to be made on a recall for off-spinner Todd Murphy, probably in place of all-rounders Mitchell Marsh or Cameron Green.\nRegardless of the result, Australia will keep the Ashes they have held since 2017-18, but captain Past Cummins wants to improve on their 2-2 draw here four years ago.\n\"The good thing is it is a really similar group to 2019,\" he said. \"This group is really motivated to win the series.\n\"We know it wasn't our best week last week and at the end of the game it was a pat on the back and well done but really it feels like the job is not done.\"", "url": "https://www.bbc.com/sport/cricket/66313864"}