{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:52:15", "date_modify": "2025-05-21 05:52:15", "date_publish": "2025-02-01 00:00:00", "description": "Follow live text coverage from 23 League One and Two games including Birmingham City v Rotherham.", "filename": "sport_football_live_c5ydyzyy2xvt_1747806735.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c5ydyzyy2xvt_1747806735.html", "title": "League One and League Two LIVE: Action from 23 games", "title_page": "League One and League Two LIVE: Action from 23 games - follow live text & score updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Phew! That's all from us\n#bbcefl\nThank you for tuning in for our League One and Two EFL coverage today.\nSo much action and late drama again and that is why we love it so much.\nDo join us tomorrow, we'll have full live text commentary of Bristol Rovers v Peterborough United (15:00 kick-off) in League One.\nOn Monday, we will also be bringing you all the drama as it unfolds in the Championship clash between Middlesbrough and Sunderland (20:00 ko).\nUntil next time, take care!\nCarlisle go bottom after crushing Swindon defeat\n#bbcefl\nCarlisle dropped to the foot of League Two courtesy of a 5-1 thumping at home against Swindon and victory for Morecambe, who beat local rivals Fleetwood 4-2.\nDespite a much-needed win Morecambe remain in the second relegation slot, three points from safety and Tranmere, who were beaten 3-1 at home by Colchester.\nNewport and Harrogate climbed away from the drop zone, the former beating Barrow and the latter drawing with Crewe.\nAccrington dropped two places after they were beaten 2-1 by Port Vale. But Stanley do have three games in hand on Harrogate and one in hand of all the teams below them.\nDoncaster close gap on Walsall\n#bbcefl\nDoncaster Rovers regained second place from lunchtime victors Notts County and closed the gap on runaway leaders Walsall to seven points albeit having played one game more.\nWalsall were heading for a third straight defeat only for Danny Johnson to rescue a point against Salford City.\nNotts County further strengthened their hold on the third automatic place with a win over Gillingham while AFC Wimbledon moved up to fourth with a narrow but convincing win over Bradford, the Yorkshire outfit dropping to seventh place.\nChesterfield swapped places with Grimsby, winners against Bromley, slipping to tenth place while Port Vale were the other upwardly mobile outfit in the top 10, moving to sixth at the Bantams' expense.\nShrewsbury off the bottom\n#bbcefl\nWith 10-men, Shrewsbury came from behind the beat Mansfield and swap places with Cambridge United who drew with Wycombe.\nCrawley thought they'd grabbed a 90th-minute point against Wrexham only to lose in injury time and they're third from bottom,\nIt's four games unbeaten for Burton who drew at Barnsley at lunchtime and they're four points behind Bristol Rovers who have a massive game at home to Peterborough tomorrow.\nBirmingham go four points clear\n#bbcefl\nBirmingham's win over Rotherham and Wycombe's draw at Cambridge United means Blues are now four points clear the top with two games in hand.\nWrexham have moved within four points of second place with their late, late win at Crawley.\nStockport ended Leyton Orient's 11 game unbeaten run to go fourth, moving above Huddersfield who lost at Northampton.\nOrient stay sixth but look at Charlton now - after yet another win they're up to seventh place.\nJohnson double helps Walsall salvage late point\nFT: Walsall 2-2 Salford\nAdam Cottier\nBBC Final Score reporter at Poundland Bescot Stadium\nAt 2-0 down to Salford here Walsall looked to have lost their way, facing a third straight defeat.\nTheir goalkeeper Tommy Simkin had made a quite brilliant save to stop Cole Stockton scoring his second before Hakeeb Adelakun did manage to beat him.\nAt that point another looked inevitable for the league leaders.\nBut you don’t get to the top of the league without having desire and a positive attitude built within and Walsall exuded it from that point to salvage perhaps one of their most important points of the season.\nAnd credit too to Danny Johnson, on as a sub at the break having missed a penalty last week.\nHe stepped up here, and some.\n'Two points lost or one point gained?'\nFT: Cambridge 1-1 Wycombe\nMark Johnson\nBBC Radio Cambridgeshire commentator\nIt was a brave fight back from the U's having fallen behind 10 minutes before the end of the first half.\nThe U's were up against a 10-men team and they did test the keeper, but in the end time just ran out for them.\nTwo points lost or one point gained? That will be debated for a while.\n'Blues completely dominated the second half'\nFT: Birmingham 2-1 Rotherham\nDarren Carter\nEx-Birmingham midfielder on BBC Radio WM\nThey completely dominated the second half, Rotherham didn't really a sight of Blues goal and they didn't really get into the Blues defensive end, blues camped territory wise and you could sense a goal was coming.\nJay Stansfield stepped up like he has so many times this season and gets the equalising goal, and who else do you want to take a pressure penalty it is that man again.\nBut I think it was a fantastic display and this was as impressive result as any this season.\nLeague One full-time round up\n#BBCEFL\nRight then let's bring you the final scores from around the other grounds in League One today.\nBlackpool came from two goals down to draw 2-2 at home to Charlton, Sam Silvera and Niall Ennis scored in the final 20 minutes to earn them a point.\nCrawley Town scored to level the game 1-1 with Wrexham in the 90th minute but Elliot Lee scored a 95th-minute goal to win them the game, cue heartbreak for the home side.\nShrewsbury came from a goal down and having a man sent-off to beat Mansfield Town 2-1 at home, scoring twice in the second half.\nReading beat Bolton, Harvey Knibbs slotted home from the penalty spot late on to win them a big three points.\nNorthampton Town held on as Huddersfield scored twice late but weren't able to get anything out of the game as the Cobblers won 3-2.\nAnd Lincoln City scored an 88th-minute equaliser away to Wigan Athletic to earn a point at The Brick Community Stadium.\nLeague Two full-time round-up\n#bbcefl\nDanny Johnson has broken Salford hearts with a late equaliser for Walsall, his second of the match, with it finishing 2-2.\nPaul Glatzel and Will Wright have added two stoppage time goals to make it 5-1 for in-form Swindon against Carlisle.\nGrimsby have won 2-0 at Bromley, Doncaster have held firm to win 2-1 against MK Dons and retake second spot in the table.\nThere are also wins for Morecambe over Fleetwood, Port Vale, who have beaten Accrington and Colchester who have prevailed against Tranmere.\nHarrogate and Crewe have shared the points after a 1-1 draw while Newport have edged a tight encounter against Barrow 1-0.\nFULL-TIME\nBirmingham 2-1 Rotherham\nBirmingham extend their lead at the top but they were made to work hard for it.\nSam Nombe headed Rotherham into a half-time lead against the run of play.\nWe expected a Blues reaction and while it wasn't quite a case of laying siege to the visitors' goal they did enough.\nFirst Jay Stansfield converted from close range nine minutes after the restart and he then fired home a penalty six minutes before the end after Taylor Gardner-Hickman had been fouled.\nBirmingham go four points clear at the top with two games in hand on their pursuers.\nFULL-TIME\nCambridge United 1-1 Wycombe\nWith Birmingham losing and Wycombe winning at one point this afternoon the Chairboys were going top of League One.\nBut they've been held at the Abbey Stadium by struggling Cambridge United.\nCameron Humphreys gave the visitors the lead before it all kicked-off in the second period.\nSonny Bradley was sent-off for a foul on Michael Morrison but Jordan Stokes saw the resultant penalty saved by Wycombe goalkeeper Franco Ravizzoli.\nStokes made up for the miss with a leveller six minutes from the end.\nQuite a game.\nPost\nAFC Wimbledon 1-0 Bradford\nIt is looking increasingly likely the Dons are going to hold firm against Bradford who are huffing and puffing without looking like break the door down.\nThere should be a few minutes extras on account of the injury to Ciaran Kelly but if you were a betting man money would be going on a second for Wimbledon rather than an equaliser.\nLatest in League One\n#bbcefl\nWell Northampton Town looked to be cruising to victory in their game against Huddersfield but in the past ten minutes the visitors have got two goals back to make it 3-2 with just over five minutes remaining.\nHerbie Kane and Jonathan Hogg have scored the two goals in quick succession. They couldn't, could they?\nReading have taken the lead against Bolton, Harvey Knibbs firing them into the lead with a penalty at the SCL Stadium.\nBlackpool have come from two down to level their game with Charlton at 2-2! Sam Silvera and Niall Ennis with the goals.\nAnd Crawley Town have scored in the 90th minute to level the game at 1-1 against Wrexham, Bradley Ibrahim has scored late.", "url": "https://www.bbc.com/sport/football/live/c5ydyzyy2xvt"}