{"authors": ["Piers Newbery & Chris Bevan", "www.facebook.com"], "date_download": "2025-05-19 14:57:30", "date_modify": "2025-05-19 14:57:30", "date_publish": "2017-07-04 12:52:13", "description": "Kyle Edmund beats Briton Alex Ward to claim his first Wimbledon win while Katie Boulter, James Ward and Brydan Klein all lose.", "filename": "sport_tennis_40496750_1747666650.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/AF63/production/_96799844_040404393.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_tennis_40496750_1747666650.html", "title": "Wimbledon 2017: Kyle Edmund beats Alex Ward in all-British contest", "title_page": "Wimbledon 2017: Kyle Edmund beats Alex Ward in all-British contest - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Kyle Edmund fought back to claim his first Wimbledon win and end the hopes of fellow Briton and world number 869 Alex Ward.\nEdmund, ranked 50th, won 4-6 6-3 6-2 6-1 on court three to reach the second round for the first time - at the fifth time of asking.\nBritish wildcard Katie Boulter, making her Grand Slam debut, lost 3-6 7-5 6-3 to world number 60 Christina McHale.\nBrydan Klein and James Ward also bowed out, both men losing in straight sets.\nJames Ward, 30, lost 6-4 6-4 6-3 to Marcos Baghdatis, faring marginally better than Klein, 27, who won only nine games as he was beaten 7-6 (7-5) 6-3 6-0 by Japan's Yuichi Sugita.\nAlex Ward, 27, had come through qualifying to take his place in the main draw.\nEdmund, 22, goes on to face French 15th seed Gael Monfils, who beat Daniel Brands of Germany 6-3 7-5 6-4.\nAndy Murray, Aljaz Bedene, Johanna Konta and Heather Watson all won on Monday.\nThe British number two appeared the more nervous, dropping serve in the first game and failing to get the deficit back as a confident Ward took the set.\nA shock was a realistic possibility until midway through the second set, when Edmund rose to the challenge and showed the class which has taken him to the world's top 50.\nThe Yorkshireman dropped just six games in three sets to secure his second-round place.\n\"It's nice to get the win,\" he said. \"It's a home Grand Slam and one of those dreams you have as a kid. It's not been a good tournament for me in recent years but it's good to get the win now.\"\nWard, who missed six months through injury last year, leaves the All England Club with £35,000 in prize money and his ranking projected to rise around 300 places.\n\"It's been tough starting again this year from a low ranking. But experiences like this make the sacrifices all worthwhile,\" said Ward.\n\"And today's my mum's 60th birthday, so playing that match was a nice present for her.\"\nFormer British number one John Lloyd on BBC Two\nA very fine performance by Kyle Edmund after a dodgy start. He was on a hiding to nothing going up against a fellow Brit. He started badly, a set down but had faith in his ability to come back.\nHis game improved, he was aggressive in the right way and his serve got better. This will do him the power of good. Ward ran out of gas. He looked fatigued, but has made a bit of money and hopefully now he can push his ranking up.\nMcHale took advantage when Boulter's serve dipped at the end of the second set and the 25-year-old American won nine straight points in the decider on her way to wrapping up the match in two hours and four minutes.\n\"I'm completely devastated in this one moment,\" Boulter said. \"I'm sure in the next couple of days I will reflect on it a little bit more.\n\"Of course I'm proud to represent my country and to give my all.\"\nFormer British number one Jo Durie said: \"McHale gradually broke Boulter down until it was like a torrent coming down towards her in the final set.\n\"But, overall, Boulter was not too far off the pace and can be pleased with her performance.\n\"That is what you want to do when you come on court for a match like this - believe you can win, and work for it, and I think Boulter did all of that.\"\nHe was handed a wildcard into the main draw but his hopes of a repeat of his performance here two years ago, when he reached the third round, were quickly ended on court 18.\nBaghdatis, who reached the semi-finals at SW19 in 2006, did not face a single break point and completed a dominant victory in one hour and 40 minutes.\n\"I have come a long road. There were times I never knew if I was going to play tennis again. I was in the gym every day rehabbing with a physio and it was tough, because you just don't know when it's going to get better.\n\"You see very small improvements. Sometimes you go backwards. And then now I'm at a stage where I'm not completely 100% pain-free, but I don't know if I ever will be. So that's what I maybe have to live with.\"\nOver on court 16, Klein, the world number 232, started strongly against Sugita and forced a first-set tie-break against a player ranked 188 places higher.\nBut Klein, 27, never recovered after falling awkwardly while 5-2 down in the second set and, after lengthy treatment, won only one more game as his Japanese opponent triumphed in two hours and six minutes.\n\"The knee was a bit sore and I was losing my balance a bit, but not much,\" said the British number six.\n\"When I lost a few points my mind was maybe on my knee when it should have been elsewhere, but I was already a set and 5-2 down.\n\"He played well in the third and I didn't so it was disappointing. But even if I looked angry I was enjoying every second of it.\"", "url": "https://www.bbc.com/sport/tennis/40496750"}