{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:26:54", "date_modify": "2025-05-21 05:26:54", "date_publish": "2025-02-05 16:17:10", "description": "Eddie Hearn says Anthony Joshua has not started talks with any potential opponent for his next fight.", "filename": "sport_boxing_articles_czepxj99lnko_1747805214.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5749/live/0f8e5810-e3d9-11ef-b564-41750c4ba94b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_boxing_articles_czepxj99lnko_1747805214.html", "title": "Anthony Joshua: Eddie Hearn denies Deontay Wilder or Martin Bakole fights agreed", "title_page": "Anthony Joshua: Eddie Hearn denies Deontay Wilder or Martin Bakole fights agreed - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Eddie Hearn has denied Anthony Joshua has agreed his next fight, saying the heavyweight is yet to begin talks with any opponent.\nSpeculation on social media had suggested Joshua could fight Martin Bakole or Deontay Wilder next.\nWith Joshua, 35, coming off a knockout loss to IBF champion Daniel Dubois in an all-British clash, Matchroom promoter Hearn says no concrete plans are in place.\n\"If you look at Twitter [X], he's signed and agreed to fight Martin Bakole. Today it's all signed for Wilder against Joshua on June 7th. [But with] both of those fights there hasn't been one discussion yet,\" Hearn said on the 5 Live Boxing with Steve Bunce podcast.\nCongolese heavyweight Bakole has talked up a fight with Joshua in recent weeks, even suggesting he hurt the two-time heavyweight world champion in a sparring session.\nBut Hearn, who has promoted Joshua for the entirety of his professional career, laughed off the story, saying he has never witnessed Bakole \"rock\" Joshua in sparring.\n\"I think Martin Bakole is a very good fighter, but don't get carried away that this is the new George Foreman,\" Hearn said.\n\"The problem with Bakole is, he is a handful, but he doesn't really bring the dollars for the fight.\"\nJoshua's return to the summit of the heavyweight scene was halted by Dubois at Wembley last September as he suffered the fourth defeat of his career and second via stoppage.\nHe was expected to fight Dubois again, but opted out of talks for a rematch and Dubois will face Joseph Parker on 22 February instead.\nBefore Tyson Fury's shock retirement announcement last month, anticipation had been building the Gypsy King might face Joshua.\nBut while that fight seems unlikely again, Hearn says Fury remains at the top of Joshua's wishlist.\n\"It's always been the two – Tyson Fury – who is retired at the moment, we'll see how long that lasts, and the winner of Dubois-Parker,\" Hearn said of Joshua's ideal next opponent.\nJoshua has history with both Dubois and Parker having stripped Parker of his WBO title in their 2018 unification fight.\nHearn is not confident Dubois will retain his IBF title, with Parker on a five-fight winning streak, including wins over Wilder and Zhilei Zhang.\n\"The first four, five rounds of that fight will be so important,\" Hearn said of Dubois-Parker.\n\"If Parker can get through those rounds, you've got to put question marks back in Dubois' head because right now I think he thinks he's invincible.\n\"He's buying into the hype. Which might be good for him. Dubois is a handful.\n\"I think he's beatable and I think Parker is the guy to do it. Right now, a confident Daniel Dubois is a dangerous man.\"", "url": "https://www.bbc.com/sport/boxing/articles/czepxj99lnko"}