{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:54:02", "date_modify": "2025-05-21 04:54:02", "date_publish": "2025-01-23 11:55:45", "description": "Leicester news: Opinion - Fara WIlliams on challenge for Van Nistelrooy", "filename": "sport_football_articles_c3vp556g6kvo_1747803242.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d635/live/a97973f0-6e9b-11ef-b02d-c5f3b724a1ea.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c3vp556g6kvo_1747803242.html", "title": "Opinion - Fara WIlliams on challenge for Van Nistelrooy - BBC Sport", "title_page": "Leicester news: Opinion - Fara WIlliams on challenge for Van Nistelrooy - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "I thought Leicester were harsh in getting rid of Steve Cooper, but the fans turned against him and we know what comes next when that happens.\nBut he had Premier League experience and knew how to fight at the bottom of the table. That is important when you need results.\nRuud van Nistelrooy has not been in that position in any of the clubs he's been involved with previously, so it is a big job for him now at Leicester. I do not think he knew the task at hand.\nThe promoted clubs from the Championship are usually down at the bottom and fighting to sty up. Many people believed at the beginning of the season that the three who came up would also go back down.\nHaving a manager who has the knowhow of staying in the Premier League is something money cannot buy and Cooper had that after his time at Nottingham Forest.\nBut I also think the Leicester squad is not good enough to compete in the way he might want them too at this level.\nThey are still reliant on Jamie Vardy, who of course has been a fantastic finisher and servant over the years. However, to rely on him now in every game does mean they are in a bit of trouble.\nStephy Mavididi has been their only bright spark of the season, but if you look around that is it.\nI think Van Nistelrooy is going to find it difficult to keep them up, but then any manager who had gone in at this point probably would have as well.", "url": "https://www.bbc.com/sport/football/articles/c3vp556g6kvo"}