{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:57:11", "date_modify": "2025-04-26 03:57:11", "date_publish": "2025-03-04 14:20:06", "description": "Somerset all-rounder Roelof van der Merwe is released by the club by mutual consent ahead of the start of the 2025 season.", "filename": "sport_cricket_articles_cd65g226e9jo_1745639831.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b560/live/b0d059b0-f902-11ef-b5c1-27f306935cb2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_cricket_articles_cd65g226e9jo_1745639831.html", "title": "Roelof van der Merwe: All-rounder to leave Somerset to 'put family first'", "title_page": "Roelof van der Merwe: All-rounder to leave Somerset to 'put family first'  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Somerset all-rounder Roelof van der Merwe has been released by the club by mutual consent ahead of the start of the 2025 season.\nThe Netherlands international's deal was due to expire at the end of this upcoming campaign.\nThe 40-year old first played for the county in 2011 and returned for a second spell in 2016, before signing a white-ball only contract in 2023.\n\"My family is based in South Africa. With the English white ball season now running from May until September, that's a long time to be away from my wife and children,\" Van der Merwe said.\n\"At this stage of my career, I feel that it's time to put my family first whilst still looking to pursue my international career.\"\nVan der Merwe featured in 12 matches for Somerset last season in the T20 Blast, taking six wickets and scoring 28 runs.\nHe was part of the side that won the One-Day Cup in 2019 and the T20 Blast title in 2023.\n\"We totally respect and understand him wanting to spend time with his family and further his opportunities to play international cricket,\" said Somerset director of cricket Andy Hurry.\n\"To say that he has been a tremendous servant to the club would be something of an understatement. To put it simply, he is the absolute personification of the model professional.\n\"During his time with Somerset, he has put in countless match-winning contributions with the bat, the ball and in the field.\"", "url": "https://www.bbc.co.uk/sport/cricket/articles/cd65g226e9jo"}