{"authors": ["Andrew Benson", "www.facebook.com"], "date_download": "2025-05-21 04:43:11", "date_modify": "2025-05-21 04:43:11", "date_publish": "2025-04-03 07:22:43", "description": "Max Verstappen says it \"was not a mistake\" that he liked a comment on social media criticising Red Bull's decision to demote Liam Lawson.", "filename": "sport_formula1_articles_cwy71rz7663o_1747802591.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ac3e/live/74ce65f0-105a-11f0-adf5-fbcecb53ee89.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_formula1_articles_cwy71rz7663o_1747802591.html", "title": "Japanese Grand Prix: Max Verstappen says his social media response to Liam Lawson demotion 'speaks for itself'", "title_page": "Japanese Grand Prix: Max Verstappen says his social media response to Liam Lawson demotion 'speaks for itself' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Max Verstappen says it \"was not a mistake\" that he liked a comment on social media describing Red Bull's decision to demote Liam Lawson as \"a panic move\" and \"close to bullying\".\nThe remarks were made by Dutch former Formula 1 driver Giedo van der Garde, a friend of the Verstappen family, on Instagram, external after Red Bull moved New Zealander Lawson down to their second team Racing Bulls in a swap with Japan's Yuki Tsunoda just two races into the season.\nRed Bull's Verstappen said: \"I liked the comment, the text, so I guess that speaks for itself, right?\"\nThe four-time champion refused to expand in public on his feelings about the decision, but added: \"Everything has been shared with the team, how I think about everything.\n\"Sometimes it's not necessary, you know, to always share and say everything in public. I think it's better [not to].\"\nFellow F1 drivers Oscar Piastri, Pierre Gasly - himself the victim of a mid-season driver swap by Red Bull - and Nico Hulkenberg also liked the post.\nRed Bull's decision to drop Lawson was a U-turn after they preferred him over Tsunoda last winter when they paid off Sergio Perez two years before the end of his contract.\nThat was despite Lawson having raced in only 11 grands prix over two seasons compared with Tsunoda's four years of experience.\nFerrari driver Lewis Hamilton described the dropping of Lawson as \"pretty harsh\".\nVerstappen said Red Bull had to \"take a good look at ourselves and just keep on working and keep on improving the car\".\nLawson struggled to come to terms with the wayward handling of the Red Bull car.\nHe qualified 18th for the season-opening Australian Grand Prix, and last for both the sprint and main grand prix in China, and failed to make significant progress in any of the races.\nRed Bull demoted him because they felt he was in a spiral from which he could not recover.\nVerstappen explained the characteristics that had led Lawson to struggle.\n\"It's hard because, I mean, for me, this is the only car that I know, right?\" Verstappen said.\n\"But I think from what I see out there, it is a little bit more nervous, a little bit more, I would say, unstable in different corner phases, maybe. Well, maybe [than] some other of my team-mates have been used to before.\n\"Some bits, of course, are clearly faster than where they came from, but to just piece it all together probably is a bit harder.\"\nLawson, meanwhile, said the news he had been relegated was \"tough to hear\" but he is determined to \"prove that I belong here in Formula 1\" now he is back with his former team.\nLawson said that after receiving the call from Red Bull team principal Christian Horner saying he had been demoted he \"had one or two days to think about it\" but since then had been full into preparations with Racing Bulls.\n\"For me the main thing is being in a car,\" he said. \"I want to prove I belong here. In terms of where my future is, I don't know, and the only way I can control that is by driving fast.\"\nLawson suffered from a number of car issues during pre-season testing and in the first race of the season that denied him track time.\nHe said: \"In F1, we have issues, it is part of it. I had maybe hoped that would be taken into consideration more.\n\"That's why it was important to me to come to a track I knew. But it's motorsport and the decision was not mine but I will make the most of this one.\"\nAnd he insisted he felt it was not a mistake to give him the Red Bull drive in the first place.\n\"It doesn't change how I view it,\" he said. \"I felt I was ready. Although the weekends were tough, that doesn't change.\"", "url": "https://www.bbc.com/sport/formula1/articles/cwy71rz7663o"}