{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:59:50", "date_modify": "2025-05-21 07:59:50", "date_publish": "2025-02-07 19:10:31", "description": "Former Derby County captain Curtis Davies says he does not like the timing of the sacking of head coach Paul Warne.", "filename": "sport_football_articles_c17e214rv0xo_1747814390.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e402/live/df440510-e586-11ef-b7d0-470c326756cb.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c17e214rv0xo_1747814390.html", "title": "Curtis Davies: Ex-Derby captain criticises timing of Paul Warne sacking", "title_page": "Curtis Davies: Ex-Derby captain criticises timing of Paul Warne sacking - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Derby County captain Curtis Davies is uncomfortable with how the club dealt with the dismissal of boss Paul Warne.\nHe was sacked on Friday with the Rams in the Championship relegation zone but barely 24 hours before facing Norwich City.\n\"To have allowed Paul Warne and his staff to take training, and then sack him, I don't like that at all,\" Davies told BBC Radio Derby.\n\"If they know he's not going to have the job then it's a meeting in the morning. On a human level you can't allow a man to take training and be preparing for a game.\n\"If it's the right decision or not it's not the way I would like my football club in terms of Derby County to conduct themselves.\"\nFirst-team coach Matt Hamshaw will be in charge for the game at Carrow Road on Saturday and Davies thinks whoever is appointed will have a tough job on their hands.\n\"I think in isolation if you look at a record of eight losses in a row and 12 in 15 it's hard to defend.\n\"With a transfer window having just gone if you're trying to lure a manager of better quality than Paul Warne who can potentially keep them up he's going to have to do it with the squad they've already got and that's a bit of a worry.\"", "url": "https://www.bbc.com/sport/football/articles/c17e214rv0xo"}