{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:09:53", "date_modify": "2025-05-20 14:09:53", "date_publish": "2023-07-30 11:52:49", "description": "England finish top of their Netball World Cup pool with a perfect record as they beat Scotland 62-37, with both teams already through to the next phase.", "filename": "sport_netball_66354256_1747750193.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/14B34/production/_130588748_gettyimages-1565410581.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_netball_66354256_1747750193.html", "title": "Netball World Cup 2023 results: England beat Scotland 62-37 to finish top of Pool B", "title_page": "Netball World Cup 2023 results: England beat Scotland 62-37 to finish top of Pool B - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England finished top of their Netball World Cup pool with a perfect record by beating Scotland 62-37, with both teams already through to the next phase.\nThe scoreline, however, was closer than many might have expected as Scotland had more possession in Cape Town.\nEngland struggled again in mid-court and will need to feed their shooters better if they are to challenge for a first World Cup title.\nThe next group stage starts on Monday, with both teams heading into Pool F.\nScotland had started the day with their campaign in the balance but a victory for Malawi over Barbados in the morning meant they faced England knowing they would be one of the three teams to advance from Pool B.\nResults from the first group stage carry through to the second stage, so there was an incentive to keep goal difference as tight as possible as it could prove key later in the week.\nScotland seemed to have this in mind as they frustrated England at times but their shooting accuracy - just 72% in the first two quarters - prevented them from doing more damage.\nEngland will have been pleased to have won all four quarters but their tally was not as high as they might have hoped, with title rivals New Zealand and Australia laying down big scores in their matches earlier on Sunday.\nMid-courter Imogen Allison picked up what appeared to be a shoulder knock in the second quarter but her team-mate Layla Guscoth confirmed after the match it was nothing serious.\nEarlier on Sunday, Wales beat Sri Lanka 68-56 in a must-win match to advance to the next pool stage.\nAll the World Cup matches from Monday onwards will be available to watch across BBC TV, iPlayer and the BBC Sport website and app.\nEngland will take confidence that they have done what was expected of them at this World Cup so far by comfortably winning all three of their Pool B matches.\nThe Roses are yet to lose a quarter at the tournament, while also rotating their squad, and co-captain Guscoth said that can only be a positive as they progress and face more different styles.\n\"Every game we have managed to get all 12 players on court and seen so many different combinations of people playing in different positions - that can only hold us in good stead going into the next week,\" she said.\n\"We need that versatility to see us through to the end.\"\nHead coach Jess Thirlby will be keen for her side to not get ahead of themselves as they face Tonga in their first Pool F match on Monday (17:00 BST).\nBut a mouth-watering fixture against Australia on Thursday is difficult to ignore and will provide England with a gauge as to where they are at before the semi-finals, where they will hope to be come Saturday.", "url": "https://www.bbc.com/sport/netball/66354256"}