{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:24:17", "date_modify": "2025-05-21 07:24:17", "date_publish": "2025-05-19 21:03:10", "description": "Arthur Ashe Stadium - the US Open's showcase court - is set to be expanded as part of an $800m renovation project at Flushing Meadows, the United States Tennis Association has announced.", "filename": "sport_tennis_articles_c8e6p3rlr1go_1747812257.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0fcb/live/b4ffdaa0-34ef-11f0-8519-3b5a01ebe413.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_tennis_articles_c8e6p3rlr1go_1747812257.html", "title": "US Open: Arthur Ashe Stadium to get revamp as part of $800m renovation plan", "title_page": "US Open: Arthur Ashe Stadium to get revamp as part of $800m renovation plan - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Arthur Ashe Stadium - the US Open's showcase court - is set to be expanded as part of an $800m renovation project at Flushing Meadows, the United States Tennis Association has announced.\nThe USTA has described the proposed work at the Billie Jean King National Tennis Centre as the \"largest single investment in US Open history\".\nIt includes a plan to increase by about 2,000 the capacity of Arthur Ashe Stadium - which currently holds 23,771, and is the largest tennis arena in the world.\nThe stadium is set to get a new main entrance, with facilities inside for fans to be modernised.\nFurther plans include a new player performance centre at Flushing Meadows, with expanded indoor and outdoor warm-up areas for players.\nThe USTA intends to fund the renovation project itself - with work to be done in phases between tournaments to minimise disruption - and hopes to get it completed by 2027.\nLew Sherr, CEO and executive director of the USTA, said: \"This project enables us to maintain the greatest stage in tennis - Arthur Ashe Stadium - which was constructed more than 25 years ago, and modernize it in a way that will set it up for the next 25 years.\"", "url": "https://www.bbc.com/sport/tennis/articles/c8e6p3rlr1go"}