{"authors": ["Nicola Pearson", "www.facebook.com"], "date_download": "2025-05-21 04:57:31", "date_modify": "2025-05-21 04:57:31", "date_publish": "2025-04-04 13:17:13", "description": "Ruben Amorim press conference: Man Utd vs Man City preview", "filename": "sport_football_articles_cz95gk7y59no_1747803451.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/eec5/live/993cf210-a90a-11ef-a4fe-a3e9a6c5d640.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cz95gk7y59no_1747803451.html", "title": "Ruben Amorim press conference: Man Utd vs Man City preview", "title_page": "Ruben Amorim press conference: Man Utd vs Man City preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Kobbie Mainoo is returning to training but Amorim confirmed the midfielder \"cannot play a full game\" and they will need to assess him. Matthijs de Ligt also has an \"issue\" that will need to be assessed before the match.\nMason Mount \"can start\" on Sunday but they will \"have to manage his minutes still\".\nOn whether this latest injury return will be the making of Mount: \"For the team, it is not to speak about that too much - let Mason Mount train a lot of times, getting the load in his body and forget about that because the mind sometimes is more important than the body.\"\nOn the form of Alejandro Garnacho: \"I think he is doing the right things. Like any player in our team, he has to choose better, especially in the last third. All the players have to improve, maybe Bruno [Fernandes] is the one who can do something - assist, score easily - but Garnacho is improving the way he [passes] defenders, the way he runs. He needs more goals and assists, that is clear. He wants to improve and is improving, but is not in a great moment.\"\nThe United boss said Kevin de Bruyne, who confirmed he will be leaving Manchester City at the end of the season, was \"one of the best midfielders in the Premier League\" and he had \"improved the league\". He also joked the Belgian \"was on the wrong side of Manchester\" but he wished him luck for the future.\nOn City's form this season: \"I am more focused on our problems. I think we have bigger problems than Manchester City. They had that run in that moment - but they improved. They can play in different ways, it is really hard to think how they can face us. They have maybe the best coach in the world. They have top players but I am so focused on my team.\"\nAmorim said United \"need a lot to catch them [City and other teams] and they will improve again next season\" but he just wants to \"focus on our strengths and bring one or two players, big players\" in over the summer.\nHe added: \"We need to focus. We are doing all the stuff to be so much better next season. I cannot manage this thing of 'in four years we will try something'. We need to be so much better. This is a massive club.\"", "url": "https://www.bbc.com/sport/football/articles/cz95gk7y59no"}