{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:47:58", "date_modify": "2025-05-21 06:47:58", "date_publish": "2025-01-31 09:00:14", "description": "Big Bash League: Beau Webster signs for champions Hobart Hurricanes", "filename": "sport_cricket_articles_c4gx9w1r2zno_1747810078.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/123a/live/56908f40-dfaf-11ef-88d3-dd7c96a87c10.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c4gx9w1r2zno_1747810078.html", "title": "Big Bash League: Beau Webster signs for champions Hobart Hurricanes", "title_page": "Big Bash League: Beau Webster signs for champions Hobart Hurricanes - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Australia all-rounder Beau Webster has signed for Big Bash League (BBL) champions Hobart Hurricanes.\nThe 31-year-old, who made his international debut in January's Sydney Test against India, played five games for the Hurricanes in 2016-17 and returns on a three-year deal.\nWebster has spent the past eight BBL campaigns in Melbourne, enjoying four seasons with the Renegades before moving to the Stars for another four-year stint.\n\"I am pumped to return to Hobart next summer for the BBL and get the opportunity to play on a packed Ninja Stadium in front of our fans, my friends and family,\" the Tasmanian said.\nThe right-hander averages 28.67 with the bat, with a strike-rate of 120.38, across 83 Big Bash games, while he has taken 19 wickets at 36.52 with the ball.\n\"We have seen over the past eighteen months just how special of a player Beau is, and to have him re-join the Hurricanes is something that will make all Tasmanians proud to hear,\" Hurricanes general manager Salliann Beams said.\n\"Beau's skill set in the short form of the game is up there with some of the best in the country, and he can take the game away from the opposition with the bat while also providing another wicket-taking option with the ball.\"", "url": "https://www.bbc.com/sport/cricket/articles/c4gx9w1r2zno"}