{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:58:11", "date_modify": "2025-05-21 04:58:11", "date_publish": "2025-01-23 09:22:33", "description": "The New York Jets appoint former player Aaron Glenn as their new head coach.", "filename": "sport_american-football_articles_c5yvg7vn5gjo_1747803491.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e927/live/009d0730-d965-11ef-91ba-f9b50d923955.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_american-football_articles_c5yvg7vn5gjo_1747803491.html", "title": "Aaron Glenn: New York Jets appoint former player as new head coach", "title_page": "Aaron Glenn: New York Jets appoint former player as new head coach - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The New York Jets have appointed their former player Aaron Glenn as the side's new head coach.\nThe 52-year-old, who has transformed the Detroit Lions' defence over the past four years as the team's defensive co-ordinator, spent eight seasons with the Jets between 1994 and 2001.\nAfter finishing his playing career in 2010, Glenn rejoined the Jets for two seasons as a personnel scout before moving into coaching.\n\"Aaron earned this opportunity through almost three decades of NFL experience – 10 with us as a player and a scout,\" said Jets chairman Robert Wood Johnson.\n\"He brings tremendous leadership skills and the vision this organisation needs to be successful. I am thrilled to see him lead this team.\"\nGlenn, who has had stints with the Lions, New Orleans Saints and Cleveland Browns, has never been a head coach.\n\"This place is special for me,\" said Glenn.\n\"From the time I was drafted and practiced on Long Island, to the time I came back as a scout in New Jersey, this organisation has always felt like home.\"\nGlenn succeeds Robert Saleh, who became the first coach in owner Johnson's 25-year tenure to be sacked by the Jets in October.\nThe Jets last qualified for the post-season in 2010.", "url": "https://www.bbc.com/sport/american-football/articles/c5yvg7vn5gjo"}