{"authors": ["Ali Speechly", "www.facebook.com"], "date_download": "2025-05-21 05:51:15", "date_modify": "2025-05-21 05:51:15", "date_publish": "2025-04-02 09:46:09", "description": "Tottenham news: Opinion - Fan writer on combining European form with Premier League poorness", "filename": "sport_football_articles_cn05e2jy5pwo_1747806675.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a33b/live/307e0f30-b62f-11ee-bc2f-cb5579b90709.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cn05e2jy5pwo_1747806675.html", "title": "Opinion - Fan writer on combining European form with Premier League poorness - BBC Sport", "title_page": "Tottenham news: Opinion - Fan writer on combining European form with Premier League poorness - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "I would not be surprised if the international break was met with a sigh of relief from everyone involved at Spurs - including fans.\nThe loss to Fulham a couple of weeks ago had me checking our fixture list to see how much more of this season there was left to endure.\nAs we prepare to return to action in the Premier League against Chelsea on Thursday, I am increasingly convinced that Ange Postecoglou needs to do more than win the Europa League to secure his job.\nEven if winning it were to be enough, I think he must improve his side's performance in the domestic league in order to have a chance of winning the Europa League anyway.\nI appreciate that cup competitions are unique and that anything can happen. Indeed, some teams have been known to win a cup and get relegated from the league in the same season.\nBut I also think it is naive to assume that we can be so desperately poor in the Premier League and then suddenly turn it on in Europe.\nWe need to build momentum every time we play, not just in one competition. Of course, injuries and fatigue need to be carefully managed, but players also need consistent opportunities to gain and maintain confidence - which, as we know, has a direct correlation with high performance.\nAnge needs to prove that he knows how to manage this team because, as wonderful as it would be to win the Europa League, there would still be concerns about how his style of play and player management has resulted in such a poor position in the Premier League table.\nThe old cliche of every game feeling like a cup final seems more pertinent to Postecoglou and Spurs than ever before.", "url": "https://www.bbc.com/sport/football/articles/cn05e2jy5pwo"}