{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:36:25", "date_modify": "2025-05-21 07:36:25", "date_publish": "2025-05-20 15:25:23", "description": "Sunderland Til I Die priest Father Marc Lyden-Smith has spoken about the Championship play-off final against Sheffield United.", "filename": "sport_football_articles_c04ee5qr93do_1747812985.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e00e/live/ff37a080-358a-11f0-8519-3b5a01ebe413.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c04ee5qr93do_1747812985.html", "title": "'There's been extra candles lit'", "title_page": "'There's been extra candles lit' - Sunderland Til I Die priest - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Father Marc Lyden-Smith, the priest from Netflix show Sunderland 'Til I Die, says \"There's a few extra candles been lit\" in his church ahead of Saturday's Championship play-off final.\nThe Black Cats face Sheffield United at Wembley after beating Coventry City in the semi-final over two legs.\nFr Marc told BBC Radio Newcastle: \"I'm feeling confident, actually.\n\"Last week, the match wasn't a great match but you don't remember all the nerves being shot and the anxiety and the worry because the last minute was so magical and now we're through to the final - all to play for and about time we returned to the big time.\"\nFans have quipped that Dan Ballard's extra-time winner was 'typical Sunderland' and that the club never do things the easy way.\nBut the Catholic parish priest of Seaham and Houghton-le-Spring isn't bothered how they win promotion to the Premier League so long as they do.\n\"I don't care as long as we pass that line,\" he said.\n\"It's been such a long time coming and I think most neutral people that watched Sunderland Til I Die, our fans throughout the world, we've got a great fanbase throughout the globe actually.\n\"People in the north east want the derby to be back. I'm sure there will be Newcastle fans hoping we get up, you never know. Lots of people are behind Sunderland on Saturday.\n\"I don't care how we get there as long as we cross that line and get back to where this club belongs, which is in the Premier League.\"\nReligious or not, plenty of Sunderland fans will be praying for a win on Saturday.\nFr Marc said: \"There's a few extra candles been lit, I've noticed. Lots of Sunderland fans have been popping and lighting candles and why not?\n\"And we have a new Pope. Sunderland are now unbeaten under Pope Leo, so that's exciting. The last Pope was a Sunderland fan, why can't we not claim this one as well, eh?\"", "url": "https://www.bbc.com/sport/football/articles/c04ee5qr93do"}