{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:58:47", "date_modify": "2025-05-19 14:58:47", "date_publish": "2017-07-04 11:06:54", "description": "St Helens scrum-half Matty Smith has a second surgery on the ripped eyelid he sustained against Leeds on Friday.", "filename": "sport_rugby-league_40494198_1747666727.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/178E9/production/_96798469_sw12_casvsaints.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_rugby-league_40494198_1747666727.html", "title": "Matty Smith: St Helens scrum-half has second surgery on eyelid", "title_page": "Matty Smith: St Helens scrum-half has second surgery on eyelid - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "St Helens scrum-half Matty Smith has required a second surgery on the eyelid injury he suffered against Leeds Rhinos on Friday.\nThe 29-year-old left the field after six minutes with his eyelid ripped open and underwent immediate surgery.\nHe had a second surgery on Monday and St Helens coach Justin Holbrook has given no indication of a return.\n\"He was cleared of any major damage but then had some other issues with it and has had more surgery,\" he said.\n\"I don't know any timeframe for his return; it's purely on how his eye responds to the surgery he's had.\"\nSmith suffered the eye injury in the narrow 24-22 defeat at Headingley after an accidental clash in a tackle with Saints captain Jon Wilkin.\n\"He couldn't get it stitched on the field on Friday because his eyelid was ripped,\" said Holbrook.\n\"But hopefully it will be sorted quickly and he'll be back very soon.\"\nIt is Smith's second setback of the season after suffering a broken leg before the start of the current campaign.\nHe has scored two tries in 16 appearances this season since his recovery but given there is no indication of a quick return, Holbrook has a replacement in mind.\n\"We should get a clearer indication on Matty in the next day or two,\" he told BBC Radio Merseyside.\n\"I've definitely thought about it (a replacement). We've got a young Danny Richardson at the club.\n\"He's had strong performances in our reserves and has had a few run outs with Sheffield at the Championship level, so it's more than likely he'll come straight in.\"", "url": "https://www.bbc.com/sport/rugby-league/40494198"}