{"authors": ["Dan George", "www.facebook.com"], "date_download": "2025-05-21 05:24:19", "date_modify": "2025-05-21 05:24:19", "date_publish": "2025-04-03 14:41:36", "description": "Fast bowler Sonny Baker says he makes \"no apologies\" for being ambitious as he prepares to kick-start his Hampshire career.", "filename": "sport_cricket_articles_cg72gmrvem7o_1747805059.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1782/live/fc757c40-1088-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cg72gmrvem7o_1747805059.html", "title": "Sonny Baker: Hampshire fast bowler wants to make an impact in first season", "title_page": "Sonny Baker: Hampshire fast bowler wants to make an impact in first season - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Hampshire fast bowler Sonny Baker says he makes \"no apologies\" for being ambitious as he prepares to kick-start his county career.\nThe 22-year-old joined at the end of last season from Somerset and featured for his new club over the winter in the Guyana Global Super League.\nBaker has only played one first-class game to date and is hoping that the move to the Utilita Bowl will help him reach another level.\n\"Skill is now the main progression for me,\" Baker told BBC Sport.\n\"I want to keep my ball speed up and gradually develop the skills I can learn with guys like Kyle Abbott and Keith Barker around.\n\"One of my main reasons for moving here was a learning point of view, I want to progress my own game and this season should be good fun.\"\nHampshire get their 2025 County Championship campaign under way on Friday when they host Yorkshire.\nLast season the south coast county finished runners up to Surrey. They last won the County Championship title in 1973.\nBaker is yet to play in the competition and has only made one appearance in the T20 Blast, for Somerset last summer.\nBut he has already caught the eye of the England set-up and in February was awarded an England men's development contract.\nHe toured with England Lions in Australia in January.\n\"Who doesn't want to play for England?\" Baker added.\n\"I'm a very ambitious guy and I make no apologies for that, selection is not in my hands and it's not really for me to say.\n\"All I can do is control what I do, get through the Championship games and hopefully impress, we'll go from there.\n\"I'm trying to take it one step at a time, I want to stay in the moment, perform for Hampshire and then whatever comes after that then fantastic.\"", "url": "https://www.bbc.com/sport/cricket/articles/cg72gmrvem7o"}