{"authors": ["Andy Gray", "www.facebook.com"], "date_download": "2025-05-21 06:55:00", "date_modify": "2025-05-21 06:55:00", "date_publish": "2024-12-24 08:15:37", "description": "BBC Sport NI catches up with four Glentoran players who are celebrating Christmas away from home as they prepare for Boxing Day's derby against Linfield.", "filename": "sport_football_articles_c89x1x42j4do_1747810500.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9d64/live/9a4f2cc0-bf00-11ef-aff0-072ce821b6ab.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c89x1x42j4do_1747810500.html", "title": "What's it like to be a footballer away from home at Christmas?", "title_page": "What's it like to be a footballer away from home at Christmas? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Frozen Christmas dinners, secret Santa and the biggest game of the season - the festive period can be strange for footballers spending it away from home.\nAs professionalism grows in the Irish Premiership, so too has the number of players from outside of Northern Ireland coming into the league.\nAs well as dealing with Christmas away from home, players also have to prepare for the annual Boxing Day derby fixtures - the biggest round of fixtures in the Irish League.\nBBC Sport NI catches up with four Glentoran players who will be celebrating the festivities in Northern Ireland.\nHungarian goalkeeper Daniel Gyollai has spent the majority of the past 10 seasons away from home as his career took him to clubs like Stoke City, Peterborough United, Maidenhead United and now Glentoran.\n\"It's tough but you have to get used to it pretty quickly,\" said the 27-year-old, who scored in Glentoran's win over Cliftonville last weekend.\n\"Especially in the UK and Northern Ireland you play through it, so not seeing family is tough and missing out on the Christmas dinner is tough, but that's what the job requires so you quickly get used to it.\"\nIn contrast, English defender Frankie Hvid, who is Gyollai's house-mate, will be spending his first Christmas away from England after moving to Belfast in the summer.\n\"This is my first time being away from home for the whole period, really,\" said the 20-year-old.\n\"I've got some of my family coming over for Christmas so hopefully it won't be too much of a big deal.\n\"It's difficult getting used to it and not being able to see family whenever I want, but I have nine coming over and it will be good to have them here.\n\"I've got my mum, dad, two brothers, nan and grandad, my aunt and then two cousins so it should be a good one. We've booked a hotel for Christmas dinner so it should be nice.\"\nGyollai will spend Christmas with his girlfriend and he says the two of them will \"make the most of it\".\nHe adds his Christmas dinner is a blend of his traditional Hungarian roots and dinners in the UK from his time playing football.\n\"The food is different at Christmas, so when my family come around Christmas time they sometimes bring me some Christmas dinner with them, just frozen in boxes, so I still get a little taste of it.\n\"I'm used to the Christmas dinner from England, but I still miss my Christmas dinner from home.\n\"It's totally different and every family has their own little traditions. For me, it's the lentil soup, stuffed cabbage and my grandma's freshly baked dessert.\n\"I try to dabble in a bit of each but with games coming thick and fast you have to be careful with what you eat. It's all in moderation, pigs in blankets have to be kept to a minimum.\"\nDavid Fisher is in his second season in the Irish Premiership and says that being away for Christmas is \"just part of the job\".\nLike Hvid, Fisher, who was born in England but has a mother from the Czech Republic, had family across for his first Christmas in Belfast.\n\"You just think of it as your job. Last Christmas I had my dad come over, which was quite nice, but this year I told him to stay at home.\n\"It gives me a little bit of time to focus on the games ahead.\"\nFinley Thorndike, who is Fisher's house-mate in Belfast, was on the books of Aston Villa and Birmingham City and says every year was \"a pretty normal Christmas\" in England.\n\"Back home it was kind of the same every time,\" said the 22-year-old, who will be spending his first Christmas away from home.\n\"Me and David are going round to one of the lads' house for food. I actually done my Christmas last weekend.\n\"I went home and my whole family came around, so I don't feel like I am missing out as much.\"\nFisher, who admitted he's \"not really a fan\" of turkey while Thorndike could eat \"as many pigs in blankets as possible\", says the club are a doing a secret Santa to get into the festive spirit.\n\"We've got that at the club but I'll get Fin something too,\" Fisher added about his house-mate.\nIn one of the Irish League's biggest traditions, local derbies are played on 26 December every year\nFor many Irish League fans, it is as big, if not even bigger, than Christmas Day itself.\nGlentoran's rivalry with Linfield is as fierce as any in the Irish Premiership, and they will meet for their latest festive firecracker at the Oval.\nWhile Linfield sit top of the league, Glentoran have won all three meetings between the sides this season (two in the league and one in the cup).\n\"I've played in a number of derbies and I knew it was going to be a crazy atmosphere,\" added Gyollai.\n\"I've been told the Boxing Day game is the biggest one. We're yet to see that one but we're really looking forward to it.\"\nWhile the others have played in derby matches before, Fisher is the only one of the quartet to feature in a Boxing Day derby.\nFisher added that while he knew it was a \"massive rivalry\", he didn't realise how big it was until he featured in one.\n\"I knew they were big, I just didn't think that they were this big,\" Fisher recalled of playing Linfield for the first time.\n\"I didn't realise the size of it until I was playing and I was thinking, 'oh my days, this is actually massive'.\n\"It was loud, I remember that last year. We know the fans will be here in full voice so hopefully that can help us over the line.\"\nFor the players and supporters, three points over your rivals on Boxing Day are the biggest Christmas present you can get.", "url": "https://www.bbc.com/sport/football/articles/c89x1x42j4do"}