{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:47:17", "date_modify": "2025-05-21 07:47:17", "date_publish": "2025-05-18 19:51:45", "description": "PSL 2025 results: Lahore secure play-off spot with Peshawar win", "filename": "sport_cricket_articles_c20nxknl5wno_1747813637.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c552/live/4c588480-3421-11f0-8aba-d70614ebb2d5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c20nxknl5wno_1747813637.html", "title": "PSL 2025 results: Lahore secure play-off spot with Peshawar win", "title_page": "PSL 2025 results: Lahore secure play-off spot with Peshawar win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Lahore Qalandars secured a place in the Pakistan Super League play-offs at the expense of opponents Peshawar Zalmi with a 26-run win in Rawalpindi.\nPeshawar were the only side that could supplant Lahore in the four-team knockout stage but failed to chase down 150, finishing on 123-8 in a match that was shortened to 13 overs a side because of rain.\nOpener Fakhar Zaman anchored the Lahore innings, hitting 60 from 36 balls before he was bowled by Daniel Sams in the penultimate over.\nMohammad Naeem (22), Kusal Perera (17) and Asif Ali (18) all added swift runs as Lahore closed on 149-8.\nPeshawar had chosen to chase at the toss, but failed to get going in their reply, with Sams and Mohammad Ali's unbroken ninth-wicket partnership of 32 their highest.\nAustralian Sams top-scored with 26, but five batters were dismissed for single figures, with left-arm seamer Salman Mirza taking 4-31.\nLahore move up one place to third, while Peshawar finish their season in fifth.\nThere is one remaining match in the season's league phase, with the already-qualified Karachi Kings and Islamabad United facing each other on Monday.", "url": "https://www.bbc.com/sport/cricket/articles/c20nxknl5wno"}