{"authors": ["Ray Hunt", "www.facebook.com"], "date_download": "2025-05-21 06:05:21", "date_modify": "2025-05-21 06:05:21", "date_publish": "2024-12-24 15:39:12", "description": "Southampton news: Opinion - fan's moment of the year", "filename": "sport_football_articles_c9vkjdpyyy8o_1747807521.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/57d7/live/2bcb00b0-b62a-11ee-8f07-bbfdfa890097.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c9vkjdpyyy8o_1747807521.html", "title": "Opinion - fan's moment of the year - BBC Sport", "title_page": "Southampton news: Opinion - fan's moment of the year - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "This year has been full of ups and downs - quite literally. We have seen positive and negative records broken.\nJanuary to May was a period for the club that no fan will ever forget. Russell Martin took a forlorn, hapless and relegated squad and flipped them into Championship contenders, culminating in a day out at Wembley and, ultimately, promotion.\nWe set a club record 25-game unbeaten streak in all competitions, a record which had previously stood for 103 years.\nTurn the page to part two - and you can see the huge gulf. It has been a period to forget.\nOnly one win this season, countless errors made, two consecutive home games conceding five goals and we are already onto our third manager of the campaign.\nWe knew it would be tough, but we didn't quite expect this did we?\nWe are desperately trying to avoid Derby County's 11-point total from 2007-08.\nThe moment of the year is undoubtedly the day out at Wembley. It is not too often that we Saints fans make the trip to the famous arch.\nWe had the heartbreak of the 2017 League Cup final, the memorable League Trophy win over Carlisle United in 2010, but the 2024 play-off final tops the lot.\nTo be among the 35,000 travelling Saints fans and witness the trophy lift was a special moment. For me, that triumph outweighs the negatives of this year.\nOne thing is certain: it is never dull.\nHere's hoping for a positive turnaround in 2025 under Ivan Juric.", "url": "https://www.bbc.com/sport/football/articles/c9vkjdpyyy8o"}