{"authors": ["Richard Petrie", "www.facebook.com"], "date_download": "2025-05-21 07:28:35", "date_modify": "2025-05-21 07:28:35", "date_publish": "2025-01-13 14:47:34", "description": "BBC Sport NI assesses the contenders for the Irish Motorcyclist of the Year award, with the winner to be announced at the annual gala awards event in Belfast on Friday night.", "filename": "sport_motorsport_articles_ce8591kjrexo_1747812515.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d002/live/6c698b40-d1a5-11ef-a14b-8f7223b7d1ef.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_motorsport_articles_ce8591kjrexo_1747812515.html", "title": "Irish Motorcyclist of the Year: Who will win this year's accolade?", "title_page": "Irish Motorcyclist of the Year: Who will win this year's accolade? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The Joey Dunlop Trophy, awarded annually to the Irish Motorcyclist of the Year, has become the most coveted piece of silverware which can be collected by exponents of two-wheel motorsport sport away from the racetracks.\nThe January gala ceremony in Belfast is a highlight of the motorcycling calendar which brings together top competitors, teams and race organisers from across Ireland and beyond to celebrate the achievements of the past 12 months.\nA variety of different awards are up for grabs, but the highlight of the evening will as always be the crowning of the Irish Motorcyclist of the Year.\nWith the big night looming, BBC Sport NI assesses the six nominees for the main prize.\nThe frontrunner for the top accolade is Michael Dunlop, who clinched a remarkable fourth Isle of Man TT four-timer of his career to become the most successful rider in the history of the event with 29 wins.\nThe 35-year-old took victory in both Supersport races and the two Supertwins events in June 2024 to surpass the previous record tally of 26 accumulated by his revered late uncle Joey.\nThe Ballymoney rider has won six Supersport races in a row and a record 13 in total.\nDunlop also set a new lap record for the Superbike class, lapping the 37.73-mile Mountain Course at 135.970mph.\nDunlop was previously named Irish Motorcyclist of the Year in January 2015 after a successful 2024 season.\nGlenn Irwin became the most successful Superbike rider ever at the North West 200 as his hat-trick of wins in May 2024 saw him make it 11big bikes wins in a row over the Triangle circuit.\nRiding his PBM Ducati, the Carrickfergus rider overtook the former benchmark of nine Superbike successes, held jointly by Michael Rutter and the late Joey Dunlop.\nHaving been edged out by Tommy Bridewell by half a point in the 2023 British Superbike series, Irwin finished third in the championship last year, taking eight individual race wins in the process.\nThe 34-year-old's victories included a treble at the Oulton Park round in May and a double at Snetterton in July.\nIrwin was named Irish Motorcyclist of the Year in each of the last two years.\nEugene McManus ended the highly competitive British Supersport season in a very creditable fourth position.\nThe Randalstown rider earned three rostrum finishes in his first season on a Ducati.\nMcManus was third in race two at Oulton Park in July and also occupied the final podium spot at Cadwell Park and in the final race of the campaign at Brands Hatch GP.", "url": "https://www.bbc.com/sport/motorsport/articles/ce8591kjrexo"}