{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:40:54", "date_modify": "2025-04-26 06:40:54", "date_publish": "2025-03-02 13:21:21", "description": "Ospreys boss Mark Jones hopes they can \"harness\" the progress that brought them a stunning United Rugby Championship win at Glasgow Warriors.", "filename": "sport_rugby-union_articles_c9849eqln3go_1745649654.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/93dd/live/8a830500-f763-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_c9849eqln3go_1745649654.html", "title": "Ospreys must 'harness growth' that stunned Glasgow", "title_page": "Ospreys must 'harness growth' that stunned Glasgow - Mark Jones - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Ospreys head coach Mark Jones hopes they can \"harness\" the progress that brought them a stunning United Rugby Championship win at Glasgow Warriors.\nFull-back Jack Walsh kicked a stoppage-time penalty in a bonus-point win to beat the reigning champions on their own ground.\nThe kick sparked memorable celebrations for the visitors and despair for Franco Smith's side.\n\"We've had some tough results this year as well, and we don't always get the wins. We did incredibly well against Leinster at home and we couldn't quite get the job done,\" Jones told Ospreys' website.\n\"And to show that little bit of growth, tonight's maturity when the pressure was really on, I think it's good growth for us as a group and we should harness that and use it moving forward because there'll be a lot of tight games to come.\"\nThe win sent Ospreys up to 11th in the table, three spots from the play-offs, but with three points separating them from sixth-placed Cardiff.\nJones added: \"I'm just so proud of the boys. What a performance. You know, it wasn't a perfect, polished performance for a full 80 minutes, but there was bit of everything in there.\n\"There was a some class attack, there was some really nuggety defence, some awesome set piece tries. And then there was that mentality at the end there, never say die, and you ask for one more shot, because that's all you can ask for.\"\nJones also praised Walsh and the effort to win the last penalty from a restart after Glasgow had taken the lead through Nathan McBeth's try and Duncan Weir's conversion.\nVeteran captain Justin Tipuric followed up Walsh's restart to win the crucial turnover penalty that the full-back then slotted for the angled winner.\n\"Walshy huge, huge for the group, that pressure on him and for him to step up and bang it over, I'm so pleased for him,\" said Jones.\n\"I've only been in the environment a very short period of time, relatively, really. And the one thing that hits you in the face is the mentality of the boys. It's great to work with those types of people, when you come through the door in the morning and there's people in there, they just want to get better every day.\"\nFormer Warratahs and Exeter Chiefs back Walsh said: \"We would have liked to be more comfortable finishing our game out, but if it comes down to a kick, then it comes down to a kick.\"\nHe also praised 35-year-old former Wales and British and Irish Lions flanker Tipuric for his stoppage-time impact, along with wing Daniel Kasende.\n\"I put the restart too long, but I've got Tips (Tipuric), who's a freak, and Dan Kasende chasing after it to get a turnover,\" added Walsh.\n\"I can't remember the last time they've been beaten at home, actually, so that was a different driver for us... that we could come up and really make a statement.\"", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/c9849eqln3go"}