{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:14:01", "date_modify": "2025-05-20 12:14:01", "date_publish": "2023-08-04 16:57:24", "description": "Zdravkovski rejected offers elsewhere for fresh challenge with Well", "filename": "sport_articles_cp97py9d0z1o_1747743241.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d770/live/90b0bcc0-32e7-11ee-9217-27b202a39e56.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cp97py9d0z1o_1747743241.html", "title": "Zdravkovski rejected offers elsewhere for fresh challenge with Well", "title_page": "Zdravkovski rejected offers elsewhere for fresh challenge with Well - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Davor Zdravkovski aims to again thrive out of his comfort zone after taking the “huge career step” to join Motherwell this summer.\nThe Macedonian midfielder, 25, left his home country at the age of 19 to sign for AEL Limassol in Cyrpus and has arrived at Fir Park with over 150 games under his belt.\nZdravkovski, who is set to make his Premiership debut at Dundee on Saturday, said: \"I have been following up a lot on the Scottish league in general.\n\"Motherwell is known as a club which has been a bounce for young players in recent years so I know, if I can help the club first of all, the club can help me too.\n\"It's a huge challenge but this is what I wanted because I have been so many years in Cyprus. I had some offers from countries around Cyprus but I wanted something out of my comfort zone and I saw the Scottish Premiership as a challenge for me.”\nOn his early move to Cyprus, he said: \"It helped me a lot in all kinds of ways, first of all in me maturing as a person.\n\"All the beginnings are very difficult but those difficult moments helped me develop, realising it's quite difficult to be alone at that age outside of your country when you don't have much help.\n\"But these things make you stronger and once you overcame those obstacles in your life, I think you improve as a person and a football player.\"", "url": "https://www.bbc.com/sport/articles/cp97py9d0z1o"}