{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:34:02", "date_modify": "2025-05-21 04:34:02", "date_publish": "2025-04-05 00:00:00", "description": "Watch live BBC One coverage, listen to BBC local radio commentary and read live text commentary as Hull FC host Hull KR in the Challenge Cup.", "filename": "sport_rugby-league_live_c5y91512k40t_1747802042.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-league_live_c5y91512k40t_1747802042.html", "title": "Challenge Cup LIVE: Hull FC v Hull KR", "title_page": "Challenge Cup LIVE: Hull FC v Hull KR - text, watch & listen - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Bye... for now\nFT: Hull FC 16-32 Hull KR\nHull KR's ruthless derby victory against Hull FC sees them advance to the last four of the Challenge Cup, where they join Leigh Leopards and Catalans Dragons.\nTomorrow we find out who will complete the semi-final line-up as Warrington Wolves host St Helens.\nWe will be bringing you comprehensive coverage of that one with it being broadcast on BBC Two, iPlayer and here on the BBC Sport website where you can also follow live text coverage and listen to BBC radio commentary.\nFor now it's goodbye. But before heading off, you can read the full match report from today's Hull derby here.\nPeters joy in imperfect victory\nFT: Hull FC 16-32 Hull KR\nHull KR boss Willie Peters told BBC Sport:\n\"Overall we're really happy with the performance. It was 1 v 2 in the table and we knew it would be a difficult game.\n\"We had some adversity to deal with,. Micky McIlorum has averaged 30 minutes but he played the full game.\n\"Jez getting man of the match, he trained in the halves if he needs to. He did a great job. It was never perfect but it was never going to be.\"\n'We blew it' - Hull FC boss Cartwright\nFT: Hull FC 16-32 Hull KR\nHull FC boss John Cartwright told BBC Sport:\n\"I thought we were competing really well in the arm wrestle stuff. We got some decent possession but fumbled around and made some mistakes and they got the ball and scored some tries.\n\"We had a bit of momentum. I thought the penalty against us when we had that momentum was a bit unlucky.\n\"They were better than us on the day. I thought we blew it today. I don't know whether we didn't handle the occasion or just some uncharacteristic things from players. But that's the way it went. It's a knockout tournament and that's the way it went today.\"\nPost\nFT: Hull FC 16-32 Hull KR\nHull KR Micky McIlorum was both equal meausures of exhausted and elated after the win.\n\"When Jez (Litten) came on I went to half-back and that was my rest gone, so I knew it would be a tough game,\" McIlorum told BBC Sport.\n\"It's a knockout competition and we're in the semis so we're very happy.\"\nInjured Lewis gives nothing away\nFT: Hull FC 16-32 Hull KR\nLet's start with Hull KR half-back Mikey Lewis, who was forced off with a leg injury in the first half.\nThe 2024 Man of Steel wouldn't be drawn too much on the knock, simply say \"it feels alright\".\n\"We'll assess it on Monday and see where we go from there,\" he added in quick chat with BBC Sport on the pitch.\n\"I'm very proud. That second half was a bit scrappy but we play for the badge and the boys did that today.\"\nPost\nFT: Hull FC 16-32 Hull KR\nThere was a 39-year wait for these Hull rivals to face one another in the Challenge Cup, and the quarter-final tie certainly delivered.\nHull KR were merciless with the way they claimed three first-half tries to set themselves up for the win.\nIt was only when the margin was blown out to 30 points that Hull FC came back with a response.\nBut two quick tries from Lewis Martin and Herman Ese-ese in the second half turned the tension right up.\nPost\nHull FC 12-32 Hull KR\nRobbie Hunter-Paul\nFormer New Zealand international on BBC One\nEveryone is joined up. Often you see FC moving the ball out to an edge and it seems like KR have more defenders out there.\nThey're mapping from aside to side and there's a lot of communication, you can see they enjoy that side of the game.\nThe biggest issue for FC at this point of time is the clock on the scoreboard.\nPost\nHull FC 12-32 Hull KR\nA shanked kick from Will Pryce actually comes off rather nice Hull FC.\nThe hosts gather the ball on the left and try test the Robins on the edge, but they are eventually nullified.\nInterestingly, Pryce momentarily went to ground to stretch out some cramp.\nIt is worth remembering that he only arrived back in England three days ago after completing his move from NRL side Newcastle Knights.", "url": "https://www.bbc.com/sport/rugby-league/live/c5y91512k40t"}