{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:09:22", "date_modify": "2025-05-21 05:09:22", "date_publish": "2025-04-05 00:00:00", "description": "Sam Hoskins scores a first-half double as Northampton ease their League One relegation fears and hammer 10-man Peterborough 4-0.", "filename": "sport_football_live_cly8lg7v32zt_1747804162.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/efa9/live/4826e910-1090-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cly8lg7v32zt_1747804162.html", "title": "Peterborough United 0-4 Northampton Town", "title_page": "Peterborough United 0-4 Northampton Town - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Sam Hoskins scored a first-half double as Northampton returned to winning ways to ease their League One relegation fears as they hammered 10-man Peterborough 4-0.\nIt was a first-half assault from the Cobblers after Tayo Edun received his second red card in a month.\nThe Cobblers, who went close early on when Cameron McGeehan's effort was cleared off the line, broke the deadlock as Hoskins fired home his first in the 15th minute.\nEdun was shown red just before the half-hour mark for lashing out at McGeehan, while Hoskins hit his 88th league goal for the club with a 33rd-minute penalty.\nIt was three when McGeehan intercepted James Dornelly's attempted clearance and slipped in Dara Costello to slot home before the break.\nAfter the restart, McGeehan's strike was spilled by Jed Steer before Costello's effort was scrambled off the line.\nSteer did well to keep out Tom Eaves' effort before Tariq Fosu failed to bundle the rebound home as the visitors pushed for more.\nThe fourth came at the death as Tom Eaves headed home his fifth goal of the season.\nThe result means Kevin Nolan's side opened up a welcome seven-point cushion after their first win in five, while Posh are two points further ahead in 15th.", "url": "https://www.bbc.com/sport/football/live/cly8lg7v32zt"}