{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:48:58", "date_modify": "2025-05-21 07:48:58", "date_publish": "2025-05-19 00:00:00", "description": "Lucknow Super Giants face Sunrisers Hyderabad in the IPL - follow live scores and radio commentary.", "filename": "sport_cricket_live_cx2emp90mgnt_1747813738.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/69ee/live/4d28b4b0-31cf-11f0-8519-3b5a01ebe413.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_live_cx2emp90mgnt_1747813738.html", "title": "IPL 2025 LIVE: LSG vs SRH", "title_page": "IPL 2025 LIVE: LSG vs SRH - cricket score & radio commentary - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Sunrisers end Lucknow's play-off hopes\nLucknow Super Giants' slim play-off hopes are over after Sunrisers Hyderabad chased 206 for a consolation six-wicket win in the Indian Premier League.\nLucknow had to win all three of their remaining matches to have any chance of qualifying but their fate was sealed by a fourth consecutive defeat.\nThey were guilty of not making the most of being 115-0 inside 11 overs in posting 205-7 and then failed to recover from Abhishek Sharma's brutal early assault.\nOpener Abhishek raced to an 18-ball fifty, including four consecutive sixes off Ravi Bishnoi, and when he was caught at deep extra cover for 59 from 20 balls Sunrisers were already 99-2 after 7.3 overs.\nIndia international Ishan Kishan hit 35 and South Africa batter Heinrich Klaasen 47, meaning Sunrisers eased to victory with 10 balls to spare even with Sri Lanka's Kamindu Mendis retiring hurt on 32 with an apparent hamstring injury.\nLucknow under pressure as Sunrisers start chase well\nLucknow Super Giants are teetering on the brink.\nSunrisers Hyderabad are 120-2 in pursuit of 206. If Lucknow do not stop Sunrisers in this chase they will be knocked out.\nMost of the damage has been done by Abhishek Sharma. The left-handed opener hit an 18-ball fifty, including four consecutive sixes, before being caught at deep cover in the eighth over.\nHe was dismissed by spinner Digvesh Rathi and bowler and batter exchanged words afterwards after a send off from Digvesh.\n86 from 60 balls with Ishan Kishan and Heinrich Klaasen at the crease.\nLucknow set Sunrisers 206 to win\nLucknow Super Giants have got runs on the board but might be slightly disappointed with their 205-7.\nThey were 115-0 after 10.2 overs but were not able to kick on afterwards.\nAustralian Mitchell Marsh caught to backward point off spinner Harsh Dubey for 65.\nRishabh Pant's struggles continued as he was caught and bowled for seven by Eshan Malinga and Nicholas Pooran was run out for 45 in the final over.\nA six off the final ball by Akash Deep ensured LSG, who are eliminated unless they win, got beyond 200 which could yet prove crucial.\nLSG start well in must-win match\nLucknow Super Giants are playing like a side who know this game is must win.\nOpeners Aiden Markram and Mitchell Marsh have powered them to 108-0 after 10 overs.\nMarsh has been the more destructive. He has 65 not out from 38 balls while Markram is unbeaten on 40.\nLSG have some luck, however. South Africa's Markram could have been stumped on six and was dropped on 38.\nA tough chance to dismiss Marsh - wicketkeeper Ishan Kishan leaping to his right - also went down when the Australian was on 57.\nThe TV umpire also sided with the batter for a very tight caught and bowled catch when Harshal Patel clutched the ball low to the ground.", "url": "https://www.bbc.com/sport/cricket/live/cx2emp90mgnt"}