{"authors": ["Bobbie Jackson", "www.facebook.com"], "date_download": "2025-05-20 14:35:34", "date_modify": "2025-05-20 14:35:34", "date_publish": "2023-07-28 15:46:11", "description": "Patricky Freire says it is a 'dream come true' to be fighting on the same card as brother Patricio Freire for the first time at Bellator v Rizin 2 in Japan on Saturday.", "filename": "sport_mixed-martial-arts_66341538_1747751734.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/D6B5/production/_127656945_pitbullsplit.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_mixed-martial-arts_66341538_1747751734.html", "title": "Bellator v Rizin 2: Patricky & Patricio Freire will make 'dream come true' in Japan", "title_page": "Bellator v Rizin 2: Patricky & Patricio Freire will make 'dream come true' in Japan - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Patricky and Patricio Freire made history in 2021 when they became the first siblings to hold titles simultaneously in a major MMA promotion.\nOn Saturday, the 'Pitbull brothers' fight on the same card for the first time in their mixed martial arts careers when Bellator and Rizin join up for a cross-promotion event in Japan.\nThe two organisations hosted a hugely successful show on 31 December and just seven months later they are set to do it all over again at Saitama Super Arena.\n\"The Pitbull brothers will be fighting on the same card for the first time,\" Patricky said.\n\"I thought there would be a lot of pressure but it has been really calm. We've been wanting to do it for a long time and finally on Saturday that dream comes true.\"\nPatricky, 37, headlines against Roberto 'Satoshi' de Souza in a Bellator lightweight grand prix quarter-final, while Patricio, 36, was a late addition to the card and will take on Japan's Chihiro Suzuki in a 154lb bout just five weeks after losing to Sergio Pettis at Bellator 297.\nFormer Bellator featherweight champion AJ McKee was set to be Patricky's opponent but the American was forced to withdraw from the competition due to a staph infection in his left knee.\nRizin lightweight champion De Souza, who was born in Brazil, agreed to step in on late notice and the contest will take place at a 161lb catchweight.\nThe 33-year-old has spent most of his MMA career in Japan and signed with Rizin in 2019.\nHe has lost just twice in 17 fights, including a defeat to McKee on the Bellator v Rizin card in December, and by accepting the call to join the lightweight tournament he is now eligible to win $1million.\n\"I was told about the 73 kilos weight last Sunday when I was having a barbeque, and I was 82 kilos,\" De Souza said.\n\"I probably could have got down to 71 kilos if I really wanted to but cutting 10 kilos in a week is very dangerous. The 73 kilos contract helped me and I'm nearly there so I should be ready for the fight.\n\"I haven't thought about it [winning $1million] but I will probably spend it on my family [if I win] and we can carry on the barbeque that we were having when I got the call.\"", "url": "https://www.bbc.com/sport/mixed-martial-arts/66341538"}