{"authors": ["Pat Riddell", "www.facebook.com"], "date_download": "2025-04-26 03:56:55", "date_modify": "2025-04-26 03:56:55", "date_publish": "2025-03-04 14:37:19", "description": "Nottingham Forest news: Opinion - 'Sels having the season of his life'", "filename": "sport_football_articles_cq8yz00vv58o_1745639815.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2992/live/78122530-b62e-11ee-8f07-bbfdfa890097.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cq8yz00vv58o_1745639815.html", "title": "'Sels having the season of his life'", "title_page": "Nottingham Forest news: Opinion - 'Sels having the season of his life' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A Nottingham Forest goalkeeping legend was anointed three years ago when Brice Samba sent the Reds through to the Championship play-off final in a penalty shootout.\nThat mantle is now passed to Matz Sels, who saw Forest into the FA Cup quarter-finals on Monday with the winning penalty save against Ipswich Town.\nAdmittedly, it is not the actual FA Cup final. But there is just one game separating the remaining eight clubs and a semi-final at Wembley. It is another remarkable step in the Reds' incredible journey this year - their eyes now on the business end of the campaign.\nSels has been all-important to Nuno Espirito Santo's team this season. The Belgian keeper appeared to be a stop-gap replacement just over a year ago when he arrived from Strasbourg, but he has been at the heart of the club's success ever since.\nWith 11 clean sheets in the Premier League - more than any other keeper - he, like most of this Forest side, is having the season of his life. His save percentage, goals prevented and almost every stat going is in the top three in the division, only bettered by Alisson and David Raya at the top two clubs.\nNuno, a former keeper himself, has been able to build on the foundations that already existed on Trentside, but taken them to a level few imagined.\nNobody wanted another FA Cup tie with extra time and penalties but the euphoria a cup run brings is worth the momentum alone.\nForest's last FA Cup quarter-final was in that same promotion-winning season, ending in a narrow 1-0 defeat by Liverpool. Can the Reds go one step further?\nAnother raucous atmosphere at the City Ground on Saturday against Manchester City could lift them even higher, with the bond between players, manager and fans clearly evident in Monday's post-match celebrations.", "url": "https://www.bbc.co.uk/sport/football/articles/cq8yz00vv58o"}