{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:14:21", "date_modify": "2025-05-21 06:14:21", "date_publish": "2025-04-01 10:55:56", "description": "West Bromwich Albion boss Tony Mowbray is still confident the Baggies will finish in a Championship play-off spot.", "filename": "sport_football_articles_c8epl9eg5edo_1747808061.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4ba8/live/180f2cc0-0ee6-11f0-bb66-1953ea6c7fa4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c8epl9eg5edo_1747808061.html", "title": "West Bromwich Albion: We willl define our own season", "title_page": "West Bromwich Albion: We willl define our own season - Mowbray - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "West Bromwich Albion boss Tony Mowbray is confident his side will finish in a play-off spot despite suffering a \"cruel\" last-minute defeat at Norwich City on Saturday.\nThe Baggies are sixth in the Championship and level on points with both Middlesbrough and Bristol City directly below them but ahead only on goal difference.\n\"We're not looking at any teams below us, we're looking at the teams above us,\" Mowbray told BBC Radio WM following the loss at Carrow Road which means Albion are still two points behind Coventry in fifth.\n\"I think if that's the performance level of our team [against Norwich], we will win enough games to get where we want to be.\n\"We've got some really interesting games and games against teams in and around us, the likes of Bristol City and Coventry.\n\"We will define our own season by the results and the performance levels against those teams.\"\nSunderland, who sit comfortably in fourth, are the visitors to The Hawthorns for Albion's next game on Saturday lunchtime (12:30 BST).\n\"We have to perform at the level every week but it's difficult because sometimes at home, teams come and have a huge block behind the ball,\" Mowbray said ahead of the clash with the Black Cats.\n\"I don't think that will be the case next week. Sunderland will come and play their football, I'm pretty sure.\n\"It will be a good game and a real challenge for us against a team who have shown they are one of the best four teams in the division.\"", "url": "https://www.bbc.com/sport/football/articles/c8epl9eg5edo"}