{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:27:04", "date_modify": "2025-05-21 05:27:04", "date_publish": "2025-04-03 11:23:08", "description": "Man City news: What do you make of the protest over ticket prices?", "filename": "sport_football_articles_c3v9l24vl6zo_1747805224.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/edfa/live/824f40b0-1077-11f0-8c6c-d990c1c0e96b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c3v9l24vl6zo_1747805224.html", "title": "Man City news: What do you make of the protest over ticket prices?", "title_page": "Man City news: What do you make of the protest over ticket prices? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "When Jack Grealish scored in the second minute to give Manchester City the lead two minutes into Wednesday's 2-0 win over Leicester, far fewer supporters than usual in the Etihad Stadium were in their seats to see it.\nMany City fans remained in the stadium's concourses for the first nine minutes to protest the club's new partnership with third-party ticket resale platform Viagogo - the ninth company they have now agreed resale agreements with.\nPrior to the protest, a joint statement from City supporter groups 1894, Trade Union Blues and MCFC Fans Foodbank said it was to demonstrate that \"football without fans is nothing\".\nIt follows an open letter sent to chairman Khaldoon al-Mubarak in February by seven prominent fans groups complaining about ticket price rises and the prospect of local fans being frozen out.\nRepresentatives of the club's fan advisory board City Matters went on strike for several weeks because the club did not engage in discussions about season ticket prices.\nAn extraordinary meeting has now been scheduled for today - Thursday, 3 April.\n\"To sign a ninth partnership with a ticket resale platform is incredibly tone deaf given the strength of concern,\" City Matters chair Alex Howell told BBC Sport.\nWhat did you make of the protest?\nHow do you feel about the reasons behind it and do you think it will have had the desired effect?\nLet us know here", "url": "https://www.bbc.com/sport/football/articles/c3v9l24vl6zo"}