{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:58:21", "date_modify": "2025-05-21 04:58:21", "date_publish": "2025-04-04 12:48:34", "description": "St Mirren: Robinson on top six, league reconstruction & Dundee threat", "filename": "sport_articles_ce8gx1pmy27o_1747803501.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9334/live/993f5bc0-1144-11f0-bf77-53586c0d950e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_ce8gx1pmy27o_1747803501.html", "title": "Robinson on top six, league reconstruction & Dundee threat", "title_page": "St Mirren: Robinson on top six, league reconstruction & Dundee threat - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "After the 5-1 trouncing of Kilmarnock last week, the squad is in a good place and the \"icing on the cake is getting the emphatic results\".\nRobinson and his staff try to relieve pressure on the players by \"making it a little bit more light-hearted around the training ground\".\nOn potentially getting a top-six spot for the third consecutive season, Robinson says: \"I personally don't think the players have had enough credit for it.\"\nWith Premiership reconstruction back on the agenda, the Buddies boss says the Premiership \"needs to be bigger to allow development\".\nHe adds: \"I'm not Scottish but developing young Scottish players is at the forefront of a lot of people's minds. That's easier to do when you're not looking over your shoulder every game thinking you could get relegated, which is a catastrophe for the football club.\"\nReflected on hitting milestones, with beating Rangers twice and getting a European place, he says \"we're still aiming to grow the football club from the foundations up\".\nRobinson is glad to have Toyosi Olusanya back from suspension as he provides a \"real option\" up front. This weekend is too soon for Mikael Mandron, Conor McMenamin, Evan Mooney and Alex Gogic, but they will provide a \"big boost\" in the coming weeks.\nRobinson compliments his chief scout Martin Foyle: \"He produces miracles every year. The vast majority, we've got a lot of it right and a lot of it's down to him.\"", "url": "https://www.bbc.com/sport/articles/ce8gx1pmy27o"}