{"authors": ["Paul Battison", "www.facebook.com"], "date_download": "2025-05-21 04:22:52", "date_modify": "2025-05-21 04:22:52", "date_publish": "2025-04-06 05:31:07", "description": "Britain's Lerone Murphy remains unbeaten as he outclasses Josh Emmett to win by unanimous decision at the UFC Apex in Las Vegas.", "filename": "sport_mixed-martial-arts_articles_c3v9p5wg74qo_1747801372.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/95e5/live/3a12df90-12a3-11f0-9e3a-a7030e688097.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_mixed-martial-arts_articles_c3v9p5wg74qo_1747801372.html", "title": "UFC: Lerone Murphy outclasses Josh Emmett to remain unbeaten", "title_page": "UFC: Lerone Murphy outclasses Josh Emmett to remain unbeaten - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Britain's Lerone Murphy remained unbeaten as he outclassed Josh Emmett to win by unanimous decision at the UFC Apex in Las Vegas.\nMurphy, 33, was the busier and more accomplished striker as he triumphed over the American 48-47 48-47 49-46 on the judges' scorecards.\nThe win is English fighter Murphy's 16th in a row and eighth in the UFC, meaning he has the joint-longest win streak in the featherweight division, alongside Russia's Movsar Evloev.\n\"I want the title but give me anyone in that top five, top three. Lets go,\" said Murphy.\n\"I want to keep this train going and I want to get to the championship and stay active. I want two more fights this year.\"\nMurphy followed up a dominant performance against Edson Barboza last May with a gritty win over Dan Ige five months later, but in Emmett was facing the biggest test of his career.\nThe 40-year-old is eighth in the UFC featherweight rankings - two places above Murphy - and is a former interim title challenger.\nHis 12 knockdowns heading into the fight is a UFC featherweight record but he was unable to land any significant blows on Murphy across the contest.\nMurphy used his footwork well throughout, circling Emmett and avoiding many of his big shots while attacking with a selection of punches, elbows and kicks.\nThe first exchange saw an accidental clash of heads between the pair followed by an elbow from Murphy, as Emmett had blood pouring from his forehead.\nAs Murphy peppered Emmett with leg kicks, the American opted to wrestle, and while he landed one huge slam, the Manchester fighter was consistently able to regain his footing quickly when the action went to the ground.\nOn the feet is where Murphy did his best work, keeping Emmett at bay with side kicks, body kicks and continuing to attack the calves.\nWith Emmett growing frustrated at not being able to land any game-changing shots, Murphy safely navigated the final stages of the fight, showboating as he displayed his confidence in victory.\nDuring his post-fight interview, Murphy goaded a pocket of fans in the crowd who started to boo him.\n\"16-0, easy work,\" responded Murphy.\n\"I just had to fight my game, he's a dangerous fighter. Everyone knows he has one-punch knockout power. I had to fight a certain fight, it's as simple as that.\"", "url": "https://www.bbc.com/sport/mixed-martial-arts/articles/c3v9p5wg74qo"}