{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:05:04", "date_modify": "2025-05-21 06:05:04", "date_publish": "2025-02-08 17:35:21", "description": "Wigan 1-2 Fulham: What Marco Silva said", "filename": "sport_football_articles_c04nyewzq5no_1747807504.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ae98/live/e4d34c10-e636-11ef-ae1c-bf3b4f9afb5c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c04nyewzq5no_1747807504.html", "title": "Wigan 1-2 Fulham: What Marco Silva said", "title_page": "Wigan 1-2 Fulham: What Marco Silva said - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Marco Silva spoke to BBC Match of the Day after Fulham's victory against Wigan: \"It was a tough game. As I said before the match, you get nothing as a guarantee at this level. We were the favourites and I think we showed that throughout the game but the last 15 minutes we showed them they could fight for something. I don't remember one shot from them in the first 45 minutes. We had two or three chances to kill the game and we didn't and of course when the game is 1-0, anything can happen and they have belief.\n\"It was a great strike for the equaliser but a good reaction from us. When it was the moment to keep more of the ball in the last 15 minutes, we should have kept it a lot more. It was open and we didn't want that because we gave them belief. It was a tough one but I think we deserved the win and deserve to be in the next stage.\"\nOn the battle for a starting spot between Rodrigo Muniz and Raul Jimenez: \"It has been a great fight between him and Raul Jimenez, great competition, healthy competition. Every single day they are trying to help each other but they know the most important thing is the team. Both are in a great moment. The last game against Newcastle is a good example. It is a good situation for us so let's keep working hard with them and it's up to me who starts the next game.\"\nOn youngsters Martial Godo and Josh King: \"They are players we believe and trust. We have to give them this experience for them to grow. Martial has had some senior football last season already and it made him grow in a good way. Josh is a top talent we have on our hands that we have to keep giving these experiences too. I think he showed his quality, his bravery and the way he can play between the lines.\"", "url": "https://www.bbc.com/sport/football/articles/c04nyewzq5no"}