{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:40:12", "date_modify": "2025-05-20 11:40:12", "date_publish": "2023-08-06 19:39:50", "description": "Manchester City boss Pep Guardiola says \"the big brains\" never consulted people in the game with the new injury-time rules.", "filename": "sport_football_66423028_1747741212.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1607D/production/_130673209_gettyimages-1581038899.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66423028_1747741212.html", "title": "Manchester City boss Pep Guardiola says injury-time 'big brains' never consulted them", "title_page": "Manchester City boss Pep Guardiola says injury-time 'big brains' never consulted them - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester City boss Pep Guardiola says \"the big brains\" never consulted people in the game with the new injury-time rules, after his side conceded in the 101st minute of the Community Shield.\nCole Palmer gave City a 77th-minute lead but Leandro Trossard levelled late and Arsenal won on penalties.\nEnglish games will have more injury time this season to accurately reflect stoppages in play.\n\"It's a question for big brain guys who decide these things,\" said Guardiola.\nThe Spaniard added: \"It's a lot of games and every time you add eight or 10 minutes it's a… but listen, they never consult our opinions, the people in world football, managers or players.\"\nFootball's lawmakers - the International Football Association Board (Ifab) - announced its wish to \"create fairer conditions for both teams in terms of the amount of time available in a match\" at the start of the year.\nEight minutes were added on at Wembley, with City leading 1-0. But there was a five-minute delay in stoppage time - while Kyle Walker and Thomas Partey had treatment after a clash of heads - which was then added on at the end.\nMany games in the opening weekend of the EFL had similar amounts of injury time.\nGuardiola had spoken about the issue in the build-up to the Community Shield meeting too.\n\"Now, every game we're going to play for 100 minutes. Wasting time, from my point of view, it is not going to be solved by extending 10 more minutes,\" he said.\n\"It's more tiring for the players. It's too much.\"\nAnother new rule also caused a stir with Arsenal in the game.\nManagers and coaches \"must not confront, invade the personal space of, or make physical contact with the match officials\".\nAnd yellow cards will be issued to players delaying the restart of play or not retreating the necessary distance at a free-kick.\nArsenal's Partey and City's Julian Alvarez were both booked for kicking the ball away after the whistle was blown for a free-kick, while Arteta was shown a yellow card after asking for Rodri to be booked.\n\"We are going to get used to it,\" Arteta told BBC Radio 5 Live.\n\"It's very difficult to change habits straight away but that's the demands they are putting on us. We are going to have to train for it and be ready for it because, if not, we will be playing without 11 players and a manager on the touchline very often.\"", "url": "https://www.bbc.com/sport/football/66423028"}