{"authors": ["Emma Smith", "www.facebook.com"], "date_download": "2025-05-20 13:26:09", "date_modify": "2025-05-20 13:26:09", "date_publish": "2023-08-02 06:37:26", "description": "France manager Herve Renard warns his players \"not to take anything for granted\" as they survive a scare to beat Panama and finish top of Group F at the Women's World Cup.", "filename": "sport_football_66380377_1747747569.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/38CD/production/_130614541_gettyimages-1587209845.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66380377_1747747569.html", "title": "Panama 3-6 France: Herve Renard criticises French attitude despite topping World Cup group", "title_page": "Panama 3-6 France: Herve Renard criticises French attitude despite topping World Cup group - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "France manager Herve Renard warned his players \"not to take anything for granted\" as they survived a scare to beat Panama and finish top of Group F at the Women's World Cup.\nAfter Panama led through Marta Cox's superb free-kick, France took control in Sydney with Kadi Diani scoring a hat-trick.\nBut Panama pulled two goals back, and Renard was unhappy his side eased off.\n\"I just think they were looking for the easy way out tonight,\" he said.\n\"We were 5-1 up, with the game in the bag... you see this often in football. It was poor attitude from the girls for a few minutes.\n\"The devil is in the detail in games like this, and this shows the younger girls not to take anything for granted.\"\nRenard rested captain Wendie Renard and all-time top scorer Eugenie le Sommer among five changes from the 2-1 win over Brazil, and he felt some of the incoming players had failed to impress.\n\"We rested a lot of players, and it shows those who want to be part of the XI need to pull their socks up, as it wasn't good enough at times tonight,\" he said.\nFrance will face the runners up in Group H - possibly Germany - in the last 16.\nMeanwhile, debutants Panama, already eliminated from the tournament before this game, have lost all three matches at their first World Cup.\nThe route to the last 16 has not been smooth for France at this World Cup - they were held by Jamaica in their opener, needed a late winner against Brazil and were shell-shocked by Cox's brilliance here.\nBut they reacted well to the early scare and quickly established dominance, and when Deysire Salazar sliced Maelle Lakrar's header into her own net, it came after a sustained spell of France pressure.\nVicki Becho was just the latest France player to open up Panama out wide and she pulled it back for Diani, who almost scored with a backheel before she lifted the rebound over covering defender Wendy Natis on the line and in via the crossbar.\nThe three points and top spot were sealed when Pinzon handled in the box, allowing Diani to stroke home the penalty, and it was four before half-time when Lea Le Garrec's deep cross evaded everyone including keeper Yenith Bailey to nestle in the top corner.\nStand-in captain Diani, who had surgery on her collarbone in April and looked half-fit against Jamaica, is a growing threat and completed her hat-trick from the spot after the break following Natis' handball.\nIn the 10th minute of stoppage time, 19-year-old Becho flicked home her first senior international goal to conclude a nine-goal thriller.\nAfter a couple of false starts France look set to be a real threat in the knockout stages.\nWith no chance of progressing to the last 16, Panama have struggled to make a mark on this tournament.\nEnter Cox, their inspirational captain who made her international debut aged 14. She drove forwards straight from kick-off, earning a foul and free-kick, which she struck perfectly into the top corner from 30 yards.\nPanama manager Ignacio Quintana said the free-kick should be considered for Fifa's award for the best goal of the year.\n\"This will be a moment we will always remember,\" Quintana said. \"It was like qualifying for the World Cup, that's how we lived it.\n\"It is a Puskas Award candidate. And it will be motivating for many players. That is our philosophy - every player being proud to be representing Panama.\"\nUltimately, Panama were well beaten by a superior side, and there were recriminations after falling 4-1 down before half-time with the players holding a fractious and impromptu meeting on the pitch before going down the tunnel.\nBut this is a young side - 11 of their 23-player squad are aged 23 and under - and they will have learned plenty from this experience.\nAnd they created some more magic moments when Yomira Pinzon slammed in from the spot - retaken after her first was ruled out for a stuttering run-up - before Lineth Cedeno headed in after a deep free-kick, misjudged by keeper Pauline Peyraud-Magnin, bounced back off the bar.", "url": "https://www.bbc.com/sport/football/66380377"}