{"authors": ["Nat Hayward", "www.facebook.com"], "date_download": "2025-05-21 06:09:59", "date_modify": "2025-05-21 06:09:59", "date_publish": "2025-03-31 10:39:15", "description": "Mikel Arteta press conference: Arsenal vs Fulham", "filename": "sport_football_articles_c89gw98333wo_1747807799.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/adba/live/e81c39a0-4842-11ef-96a8-e710c6bfc866.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c89gw98333wo_1747807799.html", "title": "Mikel Arteta press conference: Arsenal vs Fulham", "title_page": "Mikel Arteta press conference: Arsenal vs Fulham - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Arteta confirmed Bukayo Saka has returned from injury, is \"ready to go\" and in contention to start on Tuesday: \"All the careful things are already done so now it's about putting him in the grass in the right moments. We worked to all the deadlines. He is really pushing - we had to hold him back.\"\nHe added that Riccardo Califiori suffered a \"really unfortunate\" knee injury while playing for Italy. He added the injury \"could have been much worse\" and will be \"hopefully a matter of weeks\" but Arsenal will \"have to see how the injury evolves\".\nMeanwhile, Jurrien Timber has suffered \"quite badly\" with an illness but \"has felt much better in the last few days\" and is available.\nOn what Saka's return promises for Arsenal: \"Bukayo is a massive weapon that we have. We know the impact he has in the team and how important his role and contribution is to our success. It's great to have him back again.\"\nOn the arrival of Andrea Berta as sporting director: \"Big addition to the club. It's about building now that chemistry and belief. We are all very excited to have him. He is a very honest and straightforward person. He has a very clear vision of what he wants to do. He was so willing to join us, which is positive. He had many other possibilities but has chosen to come to us\"\nOn returning from the international break: \"We had a good time to reflect and put ourselves in a really good position to go for the most exciting part of the season. The preparation is to be better than Fulham and beat them. If we do that, we will start to build a momentum that will help us in both competitions.\"", "url": "https://www.bbc.com/sport/football/articles/c89gw98333wo"}