{"authors": ["Jordan Chamberlain", "www.facebook.com"], "date_download": "2025-05-21 07:46:18", "date_modify": "2025-05-21 07:46:18", "date_publish": "2025-05-20 11:36:25", "description": "Liverpool news: Opinion - Arne Slot and 'transition' of champions", "filename": "sport_football_articles_cy8nn7kl9x5o_1747813578.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2b81/live/3beedc30-b62c-11ee-8f07-bbfdfa890097.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy8nn7kl9x5o_1747813578.html", "title": "Opinion - Arne Slot and 'transition' of champions - BBC Sport", "title_page": "Liverpool news: Opinion - Arne Slot and 'transition' of champions - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Arne Slot is already making tactical changes and trying things out ahead of the next campaign. These past three matches have been pre-season fixtures for the Dutchman, basically.\nRyan Gravenberch has been dropping very deep, sometimes even between the centre-backs, allowing the full-backs to stand much further up the pitch. Liverpool have already reportedly bought Jeremie Frimpong at right-back, and are looking to add another flyer in Milos Kerkez.\nWhile Trent Alexander-Arnold was a deep-lying playmaker at right-back, Frimpong will overlap Mo Salah and provide the team width, with Kerkez likely to do the same on the other side.\nSlot also used Dominik Szoboszlai as an eight versus Brighton, instead of his usual 10 position. Perhaps he's freeing up space in that role for Florian Wirtz, who Liverpool have confirmed interest in, given Szoboszlai's lack of creativity in the hole?\nThe tactic mirrors that of Paris St. Germain, who Slot has been so complimentary about this season. Flying, aggressive full-backs, technically adept midfielders and hard-working attackers.\nIt's so exciting to think that Liverpool have won the title and are still about to go into transition in an attempt to get even better.\nThe results don't matter. Don't be disappointed. If we needed to win them, we would have.", "url": "https://www.bbc.com/sport/football/articles/cy8nn7kl9x5o"}