{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:57:42", "date_modify": "2025-05-21 05:57:42", "date_publish": "2025-01-04 18:33:35", "description": "Leeds United head coach Daniel Farke says individual errors in their 3-3 draw with Hull City show they are not the finished product.", "filename": "sport_football_articles_cr4rv41k509o_1747807062.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5135/live/300dd740-cacb-11ef-bb47-87a9dea68aa1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cr4rv41k509o_1747807062.html", "title": "Daniel Farke: Leeds United can't cruise through the Championship", "title_page": "Daniel Farke: Leeds United can't cruise through the Championship - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Leeds United head coach Daniel Farke says he will not criticise individual players after their 3-3 draw at Championship strugglers Hull City.\nThe leaders were 3-1 up with nine minutes to go before conceding twice, with goalkeeper Illan Meslier being criticised for Hull's first two goals.\n\"I would be a poor leader if straight away after a game I punished individual mistakes by my players in public – I'm not willing to do it,\" Farke told BBC Radio Leeds.\n\"The players involved in the goals can't hide that they should have done better in those situations.\"\nLeeds are one point clear at the top of the table having lost just one of their past 12 league games.\n\"Overall you have to say it's a sign of what we are - we are not the finished product which cruises through this league,\" added Farke.\n\"We are one of the youngest sides in the league and we don't play without making mistakes.\n\"A more experienced side at 3-1 up would have kept the ball and maybe scored a fourth goal but we allowed ourselves to not be switched on.\"\nLeeds host Harrogate Town in the FA Cup third round next Saturday before returning to Championship action at home to Sheffield Wednesday the following Sunday.", "url": "https://www.bbc.com/sport/football/articles/cr4rv41k509o"}