{"authors": ["Ian Westbrook", "www.facebook.com"], "date_download": "2025-05-21 06:13:42", "date_modify": "2025-05-21 06:13:42", "date_publish": "2025-04-01 11:48:05", "description": "Brentford news: Opinion - Christian Norgaard 'the glue that holds the side together'", "filename": "sport_football_articles_cqj4r05xl24o_1747808022.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3eee/live/caf4a690-f0d7-11ee-b0e1-b9dd5ac46984.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cqj4r05xl24o_1747808022.html", "title": "Norgaard 'the glue that holds the side together'", "title_page": "Brentford news: Opinion - Christian Norgaard 'the glue that holds the side together' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It was a big weekend for Brentford - even though we were not playing - with the announcement of the tremendous news that captain Christian Norgaard has signed a new two-year contract.\nI have mentioned before in this column that tying down Norgaard to a new deal was vital. His contract was due to run out in the summer, and although the club had an option for another year, the fact there had been no news on what was happening was alarming for us fans.\nNorgaard has played a vital role in his almost six years at the club, making nearly 200 appearances in all competitions and being named captain in the summer of 2023.\nHis importance to the side can be shown by the fact that we have failed to win any of the four Premier League games he has missed this season, and only won two of the seven in which he was absent in the last campaign.\nHe is the glue that holds the side together in his defensive midfield role, protecting the defence, winning tackles and setting up attacks. This season he has also become a more regular goalscorer - with his five in all competitions (four in the Premier League) almost a third of his entire total of 17 for the club. We are a much weaker team without him.\nIt is also clear what a close relationship he has with Thomas Frank, who he previously worked with for both Brondby and youth level national sides for Denmark.\nNorgaard joins compatriot Mikkel Damsgaard, Keane Lewis-Potter and Aaron Hickey in signing new contracts in 2025.", "url": "https://www.bbc.com/sport/football/articles/cqj4r05xl24o"}