{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:49:25", "date_modify": "2025-04-26 06:49:25", "date_publish": "2025-03-01 10:03:52", "description": "Spain's six-time former MotoGP champion Marc Marquez wins the season's opening sprint race in Thailand with new team Ducati.", "filename": "sport_motorsport_articles_cp3y1q2v0k3o_1745650165.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/98b8/live/cd8c7390-f682-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_motorsport_articles_cp3y1q2v0k3o_1745650165.html", "title": "MotoGP: Marc Marquez wins season-opening sprint race in Thailand", "title_page": "MotoGP: Marc Marquez wins season-opening sprint race in Thailand - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Spain's Marc Marquez made the \"perfect\" start to life with Ducati as he led from lap one to claim victory in the opening sprint race of the MotoGP season.\nThe 32-year-old six-time former champion, who made the switch from Gresini Racing at the end of last season, claimed victory at Thailand's Buriram International Circuit.\nDucati filled the podium, with Marquez's younger brother Alex, 28, taking second place and Italy's Francesco Bagnaia, who won the title in 2022 and 2023, finishing third.\n\"It was a perfect Saturday,\" said Marc Marquez, who will be on pole for Sunday's grand prix and tops the standings for the first time since his last title in 2019.\n\"The feeling is great with the bike. I got out and I was consistent, and then I saw that the gap was already there, and then I tried to manage.\n\"Happy to start my new journey with Ducati Lenovo in this way.\"\nAprilla's defending champion, Spaniard Jorge Martin, will miss the start of the 22-race season after undergoing surgery on fractures to his right hand and left foot, sustained during a crash in testing.", "url": "https://www.bbc.co.uk/sport/motorsport/articles/cp3y1q2v0k3o"}