{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:53:53", "date_modify": "2025-04-26 03:53:53", "date_publish": "2025-03-03 07:33:57", "description": "Crystal Palace news: Ben Chilwell 'pleasantly surprised' with Eagles ambition", "filename": "sport_football_articles_c70wnnyz90eo_1745639633.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b73b/live/bd6c3450-f7ae-11ef-be2c-711e32e8d039.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c70wnnyz90eo_1745639633.html", "title": "Crystal Palace news: Ben Chilwell 'pleasantly surprised' with Eagles ambition", "title_page": "Crystal Palace news: Ben Chilwell 'pleasantly surprised' with Eagles ambition - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Crystal Palace defender Ben Chilwell says it was \"great to be back\" on the football pitch after being handed his first start in over a year by Oliver Glasner, after moving to Selhurst Park on loan from Chelsea in search of more minutes.\nSpeaking to BBC Radio 5 Live after the Eagles sealed their spot in the FA Cup quarter-finals, Chilwell said: \"A few of the boys asked me how long it had been after the game and I think it's been roughly a year, so it was great to be out there. I felt fit and I felt good.\n\"You train hard in training but there is nothing like a match, so you always wonder how you're going to feel. I felt great the whole game and it was good to get a full 90 minutes.\n\"I've gone into Chelsea for the past six months and trained hard every day, waiting for the opportunity but not knowing if it was going to come. This was the day that it came and I just had to make sure I was ready.\"\nThe England international has already played in two FA Cup finals with Chelsea and he revealed his loan club have set their sights on reaching Wembley this season.\n\"It's definitely something that is spoken about in the changing room,\" Chilwell said. \"We aren't going to hide from the fact that we want to win the cup. It's every game at a time but there are definitely talks that we want to go far in it.\n\"I've played two FA Cup finals and had two losses, so hopefully it could be third time lucky. I've been pleasantly surprised how ambitious this squad is in the Premier League and in the FA Cup.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c70wnnyz90eo"}