{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:34:04", "date_modify": "2025-05-20 11:34:04", "date_publish": "2023-08-07 00:00:00", "description": "Follow live text and radio commentary as Manchester Originals face Birmingham Phoenix in the 2023 Women's Hundred.", "filename": "sport_live_cricket_66307675_1747740844.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8A50/production/_130680453_gettyimages-1598955229.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_cricket_66307675_1747740844.html", "title": "The Hundred 2023: Manchester Originals vs Birmingham Phoenix in women's competition plus score, commentary, video highlights & updates", "title_page": "The Hundred 2023: Manchester Originals vs Birmingham Phoenix in women's competition plus score, commentary, video highlights & updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Goodbye\nThat's all from this live page. Make sure you check out my colleague Ffion Wynne's match report from a rather chaotic victory for Manchester Originals.\nWill the men make it a Manchester double?\nWe will be live from 18:15 BST as they take on Birmingham Phoenix with the second game of yet another busy day of Hundred action.\nSee you over there.\nPost\nManchester Originals captain Sophie Ecclestone, speaking to Sky Sports: \"There were a lot of nerves going out to bat as we have not played for a while. We just got over the line but we will learn from that.\n\"Fi bowled so well, she deserves everything she gets. She is a great player and works so hard for it.\n\"We have 60 balls of world-class spin and Mahika Gaur was great up front so long may that continue. I'm absolutely buzzing for her.\"\nPost\nMatch Hero, Manchester Originals spinner Fi Morris, who took 5-7: \"The surface was a bit slow and low, not a batter's paradise. We know how to play here and we just stuck to our strengths, bowled a lot of spin and it paid off.\n\"Sophie Ecclestone is the best bowler in the world and to have her bowling at the other end makes my job a lot easier.\n\"We bowled really well and fielded brilliantly so they were definitely under par. We made hard work of it at the end but to get over the line was brilliant.\"\nOriginals 75-4\nIt is all going on now.\nNew batter Sophie Ecclestone pushes her first ball into the off side and declines the run, but Deandra Dottin was halfway down the pitch.\nThe throw is good but a scrambling Dottin JUST gets her bat back into her crease before the bails are dislodged.\nOriginals 74-2\n14 runs needed\nIt doesn't get any easier for Phoenix as Deandra Dottin comes out to the middle. She can hit the ball very, very hard.\nAfter giving herself a sighter she duly looks to smash the next delivery out of the ground, gets nothing on it, but the ball still runs away for four byes.\nWhen your luck is in.", "url": "https://www.bbc.com/sport/live/cricket/66307675"}