{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 15:03:11", "date_modify": "2025-05-20 15:03:11", "date_publish": "2023-07-27 00:00:00", "description": "Follow reaction as Hibernian lose their Europa Conference League opener in Andorra against Inter d'Escaldes.", "filename": "sport_live_football_66190908_1747753391.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_football_66190908_1747753391.html", "title": "Hibs lose in Andorra in Europa Conference League - reaction", "title_page": "Hibs lose in Andorra in Europa Conference League - reaction - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cheerio\nFT: Inter Club d'Escaldes 2-1 Hibernian\nThat's all from us tonight.\nYou'll get reaction from the Hibs camp on their dedicated BBC Sport news page.\nThanks for joining us.\nBBC to show second leg in Leith\nFT: Inter Club d'Escaldes 2-1 Hibernian\nHibs fans, I appreciate the last thing you want to think about right now is watching your team again.\nBut here's a gentle reminder that we will be showing next Thursday's second leg at Easter Road.\nYou'll be raring to go by then, eh?\nPost\nFT: Inter Club d'Escaldes 2-1 Hibernian\nAside from that late, late free-kick from Joe Newell, the only positive thing you can say about that for Hibs is that they have another 90 minutes to put that right.\nAt Easter Road, you surely have to think they can't replicate that level of performance.\nPost\nInter Club d'Escaldes 2-1 Hibernian\nCan't disagree with any of that from Rory.\nJoe Newell has easily been Hibs' best player. But, my days, it's not been hard.\nPost\nInter Club d'Escaldes 2-1 Hibernian\nRory Loy\nFormer Dundee & St Mirren forward on BBC Scotland\nIn terms of pass marks, I maybe should have mentioned Joe Newell.\nYou have to say the goalkeeper should do better but Hibs will not care a jot because that is a massive goal in this tie.\nSince he's come on you have to say Newell has made a difference.\nPost\nInter Club d'Escaldes 2-1 Hibernian\nThere was a guy lying on the ground behind the wall and that still found a way through.\nCan't work out how tbh.\nPost\nInter Club d'Escaldes 2-0 Hibernian\nRory Loy\nFormer Dundee & St Mirren forward on BBC Scotland\nIn fairness to Elie Youan, he never hides.\nHe makes mistake after mistake at times but he's never stopped looking for the ball.\nThat's the reason he's stayed on the pitch, he still looks like Hibs most likely goalscorer.\nPost\nInter Club d'Escaldes 2-0 Hibernian\nA diagonal ball to the back post from Joe Newell is met by Christian Doidge, who tries to knock down to Adam Le Fondre.\nThe Hibs striker can't get on the end of it though.\nPost\nInter Club d'Escaldes 2-0 Hibernian\nFor minute it looks like Inter are away to add a third.\nBut the attack breaks down with a poor pass before Jean-Luc blasts over.\nHibs need to be careful. Very, very careful.", "url": "https://www.bbc.com/sport/live/football/66190908"}