{"authors": ["Sam Drury", "www.facebook.com"], "date_download": "2025-05-20 12:58:33", "date_modify": "2025-05-20 12:58:33", "date_publish": "2023-08-02 17:29:49", "description": "Debutant Shaheen Afridi takes wickets with his first two balls in The Hundred as Welsh Fire beat Manchester Originals in a rain-shortened game.", "filename": "sport_cricket_66388107_1747745913.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3716/production/_130620141_gettyimages-1587887543.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66388107_1747745913.html", "title": "The Hundred 2023: Debutant Shaheen Afridi shines as Welsh Fire beat Manchester Originals in rain-hit match", "title_page": "The Hundred 2023: Debutant Shaheen Afridi shines as Welsh Fire beat Manchester Originals in rain-hit match - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Published\n2 August 2023\nWhat else do you need to know?\nWelsh Fire won their first match of The Hundred in 2023 after losing all eight of their games in 2022.\nWells hit the first legal ball of the match - after a wide from Josh Tongue - for four and went on to hit another six boundaries and three sixes.\nAfter taking wickets with his first two balls, Shaheen saw four of his last five deliveries hit for four by Max Holden.\nEngland white-ball captain Jos Buttler hit an unbeaten 37 from 18 balls, including three sixes, but the onslaught came too late for the Originals.\n'I was getting used to the rules!' - what they said\nMatch Hero Wells talking to Sky Sports: \"The decision came pretty last minute when we knew the match was going to be reduced. We were keen to have a left-right combination to take advantage of any short boundaries and thankfully it paid off.\n\"It probably helped not having too much time to think about it. I didn't have a clue what was going on half the time. I was getting used to the rules! It was good fun. I just went with it and it came off.\"\nThe Hundred 2023: London Spirit v Oval Invincibles washed out in women's competition\nThe Hundred 2023: Welsh Fire v Manchester Originals washed out in women's competition\nYou can watch Hundred matches on BBC Two and BBC iPlayer every Wednesday and Saturday throughout the competition, alongside both finals on Sunday, 27 August.\nGoodness Gracious Me: A '90s comedy classic that made TV history\nThe face you know, the story you don't: The life and legacy of Marilyn Monroe from a modern perspective\nRelated topics", "url": "https://www.bbc.com/sport/cricket/66388107"}