{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:23:59", "date_modify": "2025-05-20 14:23:59", "date_publish": "2023-07-25 18:14:42", "description": "Ben Slater's first century of the summer helps Nottinghamshire to 275-5 on the first day against Kent.", "filename": "sport_cricket_66300275_1747751039.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1133D/production/_130516407_gettyimages-1501890093.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66300275_1747751039.html", "title": "County Championship: Nottinghamshire set good platform against Kent", "title_page": "County Championship: Nottinghamshire set good platform against Kent - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Nottinghamshire opener Ben Slater completed his first County Championship hundred since April last year to lay the foundation for a solid opening day against Kent at Trent Bridge.\nThe left-hander, who has had a lean year by the standards he has set in recent seasons, made exactly 100, with wicketkeeper Tom Moores finishing unbeaten on 72 as Nottinghamshire closed on 275-5.\nKent's bowling lacked consistency. Matt Quinn and Arshdeep Singh kept to a little over two runs an over but Jas Singh's two wickets came at a cost of 11 fours and a six in 12 overs.\nBeset by injuries and other non-availabilities, Kent were forced to sign two on-loan batters ahead of this fixture but might have expected more from their seam attack on a pitch that looked green enough to have tempted Nottinghamshire to bowl first had they won the toss.\nUnder an overcast morning sky, batting looked hazardous when the stumps were under threat but Kent's bowlers were too often wide of that mark in the opening session, conceding boundaries in 12 consecutive overs across one expansive passage of play.\nJoey Evison, a talented all-rounder who left Trent Bridge last year because of a lack of opportunities, inflicted the only wound to the Nottinghamshire top order when Haseeb Hameed, who was beginning to find his timing after a slow start, played all round a delivery that hit the knee roll of his front pad.\nThe exception among the Kent seamers was Arshdeep Singh, the Indian white-ball international left-armer who is playing in the last of his five first-class matches in England this summer.\nUnlucky at times from the pavilion end as Nottinghamshire reached 116-1 at lunch, he was rewarded for switching ends shortly afterwards as New Zealander Will Young, another at the end of a short-term contract, pushed forward to a ball that found the edge.\nNonetheless, the day was still unfolding nicely for Nottinghamshire until just over an hour into the afternoon session, when they lost Joe Clarke and then Slater within four overs.\nClarke, who had steered his first ball for four to the short boundary on the Bridgford Road side, looked in ominously good touch as he drove and pulled two more boundaries and then hoisted Jas Singh over the longer boundary for six.\nYet he was stopped in his tracks on 22 when pinned in front by a swinging delivery from Quinn. Minutes later, after running three from a straight drive to complete his hundred from 150 balls, Slater was squared up a touch by a ball from Jas Singh that found the thinnest of edges, giving Harry Finch - continuing as stand-in wicketkeper with Jordan Cox injured and Sam Billings taking time away from the game - a second catch.\nIt left Steven Mullaney and Tom Moores with a rebuilding job at 169-4, not helped by a stoppage of 108 minutes after a burst of heavy rain followed by a lengthy mopping-up operation.\nThe delay cost 15 overs and, seemingly, Kent's hopes of building any momentum on the back of those two important wickets as the fifth-wicket partners added 83 before there was another breakthrough, Mullaney falling leg before as Jas Singh hurried one through.\nKent had missed two chances along the way, with Mullaney dropped inexplicably by Ben Compton at first slip on 16 off Arshdeep Singh, and Moores given a life moments after his eighth four had taken him to a 77-ball half-century as Jas Singh shelled a difficult caught-and-bowled.", "url": "https://www.bbc.com/sport/cricket/66300275"}