{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:50:41", "date_modify": "2025-05-21 07:50:41", "date_publish": "2025-01-13 10:20:17", "description": "Luton Town assistant coach Paul Trollope says he's loved working for a \"special\" and \"unique\" club.", "filename": "sport_football_articles_c74elj922jno_1747813841.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3e8c/live/737260b0-d196-11ef-a14b-8f7223b7d1ef.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c74elj922jno_1747813841.html", "title": "Luton Town: This is a special and unique club", "title_page": "Luton Town: This is a special and unique club - Paul Trollope - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Luton Town joint interim boss Paul Trollope says he's loved working for a \"special\" and \"unique\" club.\nThe 52-year-old took charge, along with Richie Kyle, for the 2-0 defeat at Nottingham Forest in the FA Cup third round on Saturday following the departure of manager Rob Edwards.\n\"A lot of positives and a lot of pride to take from the performance after a difficult couple of days,\" Trollope told BBC Three Counties Radio after the game.\n\"(I'm) Proud of the players. I don't think they could have given any more.\"\nTrollope said he has \"no idea\" how this week will pan out or if a new boss will be appointed before the Championship clash with Preston at the weekend.\n\"Our remit was the two days training and take the game [on Saturday], which we've done. It's been a long three days if I'm totally honest.\n\"(It's) Just massive mixed emotions. The adrenaline of a game and pride in the performance, disappointed in losing and that's not even going into the two days previous.\"\nOn whether he will be staying at the club, Trollope added: \"I don't know. I've loved my time here, I've loved working with Rob.\n\"It's a special place, it's a special club, a unique club - and one that I've found a big connection to, so we will see what happens.\"", "url": "https://www.bbc.com/sport/football/articles/c74elj922jno"}