{"authors": ["Nick Mashiter", "www.facebook.com"], "date_download": "2025-05-21 06:01:32", "date_modify": "2025-05-21 06:01:32", "date_publish": "2025-04-01 22:49:44", "description": "Anthony Elanga had left Manchester United in his past. On Tuesday, they trailed in his wake - to Nottingham Forest's benefit.", "filename": "sport_football_articles_c5y4jrlp78wo_1747807292.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1421/live/379179d0-0f4b-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c5y4jrlp78wo_1747807292.html", "title": "Nottingham Forest: 'A special player'", "title_page": "Nottingham Forest: 'A special player' - resurgent Anthony Elanga leads Forest's Champions League push - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Anthony Elanga had left Manchester United in the past. On Tuesday, they trailed in his wake.\nAlejandro Garnacho and Patrick Dorgu could not keep up with the 22-year-old as he burst from the edge of his own area on to Ryan Yates' defensive header, collected the ball and ran 70 yards.\nThe Sweden winger still had the composure to find the bottom corner from 18 yards.\nA special moment - but he refused to celebrate against the club he joined as a 12-year-old.\nA 1-0 win maintained Forest's relentless quest to reach the Champions League and left them third in the Premier League, with a 10-point lead over Newcastle in sixth.\nBoss Nuno Espirito Santo admitted he had never seen a goal like it, while Forest captain Yates labelled his team-mate a \"midfielder's dream\".\n\"It is about attacking the space and getting to the opposite goal as quick as I can. I saw the space and I believe I'm one of the fastest players in the league,\" Elanga told TNT Sports while holding his man-of-the-match award.\n\"The finish is something I have been trying to work on. Left foot or right foot, I am quite comfortable with both feet this season.\n\"All you want to do is keep on improving. Coming here is about playing and developing. I appreciate Manchester United so much as I learned a lot there.\n\"I am enjoying my football and I want to keep on going.\"\nHis £15m move to Nottingham Forest in 2023 was meant to bring that enjoyment back into his game.\nHe made 55 appearances, scoring four goals, for United but was jettisoned by Erik ten Hag, who felt the winger wasn't going to make the grade. That came after just five Premier League starts in 2022-23.\nSince joining Forest, Elanga has 27 goal contributions in the league. In that same period United's Alejandro Garnacho has 16, Marcus Rashford has 14, Amad Diallo 14 and Antony just two.\nInterestingly, though, current United boss Ruben Amorim played down the fact that Elanga was allowed to leave.\nHe said: \"We are talking about a lot of players who were at Manchester United who are doing right, but they had the chance here. At United, you don't have the time. I will not have the time. We have to get it right fast.\n\"They were here and here the pressure is too big sometimes. Sometimes you don't have time and you should have time for these kids to develop.\n\"For that you need a strong base. If you don't have it, we are not going to help our kids. They had their chances and sometimes the pressure playing for Manchester United is really big.\"\nThere are clearly no regrets from Elanga, though, whose six-goal return is a season's best.\n\"I made the right decision, 100%,\" Elanga told the Athletic in December. \"I have not really spoken about this, but at the time at United, I was very young and I was coming into a team that was struggling.\n\"Yes, there was the thought that 'I am playing for Manchester United'. But I also never felt as though I was improving. I was playing for the sake of playing when I did get the odd opportunity off the bench.\n\"Coming to Forest was so big for me, because suddenly I was regularly playing 90 minutes, while having the opportunity to improve. When I played, I felt like I had purpose; like I was playing and improving in the process. That was the biggest change for me.\n\"I feel as though I know the league inside-out now, because I have had the chance to learn. I have no regrets, because I am enjoying playing fantastic football with this team. We are in a really good place at the moment.\"\nThat place has only got better after a deserved win over United pushed them closer to a fairytale finale this season, with an FA Cup semi final against Manchester City part of it.\nWith eight games remaining, they are closing in on the Champions League.\nElanga has played his part with his goals and eight assists, for which he is joint-seventh in the Premier League standings. And he's quick: Before Tuesday's game, the stats showed he had spent 1.17% of his time on the pitch this season sprinting - a Premier League high.\nAfter Tuesday's goal, that figure will undoubtedly have improved.\nAs Nuno said of his matchwinner: \"He did it by himself. There is no better counter-attack. He is a special player.\"", "url": "https://www.bbc.com/sport/football/articles/c5y4jrlp78wo"}