{"authors": ["Ben Marvell", "www.facebook.com"], "date_download": "2025-04-26 06:17:04", "date_modify": "2025-04-26 06:17:04", "date_publish": "2025-03-01 18:43:58", "description": "Ealing and Exeter Chiefs will meet in the semi-final of the Premiership Cup after wins over Northampton Saints and Sale respectively in the last-eight.", "filename": "sport_rugby-union_articles_ckgzzr92yzvo_1745648224.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/80ad/live/f569a470-f6cb-11ef-a811-cd286d96b2f6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_ckgzzr92yzvo_1745648224.html", "title": "Ealing and Exeter to meet in Premiership Cup semi-finals", "title_page": "Ealing and Exeter to meet in Premiership Cup semi-finals - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Exeter Chiefs will host Championship leaders Ealing Trailfinders in the semi-final of the Premiership Rugby Cup after both sides came through their last-eight ties.\nThe Chiefs demolished Sale 50-14 at Sandy Park, scoring four first-half tries through Josh Hodge, Paul Brown-Bampoe and two from Tom Wyatt.\nSale responded through Arron Reed's effort before further tries from Brown-Bampoe, Greg Fisilau and Jacques Vermuelen put the match beyond the visitors.\nEaling shocked the Saints, who made six changes for the match, to win 43-26 in an exciting game at Franklin's Gardens.\nIn a breathless first half, the teams exchanged scores before efforts from George Davis and Reuben Bird-Tulloch put the visitors up by 10 points at the break.\nFollowing Iakopo Mapu's red card, Ealing scored further tries through Tom Collins and Angus Kernohan before James Ramm grabbed a consolation score for the Saints by completing his hat-trick.\nFollowing their respective victories over Gloucester and Harlequins on Friday night, Newcastle will host Bath in the other semi-final on Friday 7, March, with Exeter playing Ealing the following day.\nEaling started full of purpose against their more illustrious opponents, scoring two early tries.\nAfter repeated phases, Lefty Zigiriadis powered over from close range before Tobi Wilson broke down the wing to release the former Saints player Collins to dot down.\nNorthampton responded quickly, with Rory Hutchinson feeding the rampaging George Hendy, who shrugged off Ealing defenders to reach out and plant the ball over the line.\nFollowing Bird-Tulloch's yellow card for a deliberate knock-on, Saints struck again with Hendy once again in the action before offloading to Ramm to go over for the Saints' second score.", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/ckgzzr92yzvo"}