{"authors": ["Tom Jordan", "www.facebook.com"], "date_download": "2025-04-26 04:12:20", "date_modify": "2025-04-26 04:12:20", "date_publish": "2025-03-04 12:25:05", "description": "Bournemouth news: Opinion - 'Magic of FA cup is alive and kicking!'", "filename": "sport_football_articles_c2d45k3l0j8o_1745640740.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cc65/live/63c552c0-b627-11ee-bc2f-cb5579b90709.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c2d45k3l0j8o_1745640740.html", "title": "Opinion - 'Magic of FA cup is alive and kicking!' - BBC Sport", "title_page": "Bournemouth news: Opinion - 'Magic of FA cup is alive and kicking!' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Bournemouth made it to the quarter finals of the FA Cup this weekend for just the third time. Cherries have overcome some tricky cup ties to get to this stage - beating West Brom with relative ease, professionally dispatching Everton at Goodison and now deservedly getting past Wolves via a penalty shootout.\nTheir 'reward' for this is now arguably the trickiest fixture, as we host reigning Premier League champions Manchester City, with a place at Wembley and the semi-finals up for grabs.\nIdeally, Bournemouth would have hoped to have avoided the now favourites for the competition, but would City have wanted Bournemouth away? I very much doubt it, not least because it was the Cherries that started Pep Guardiola's poor run of Premier League results back in November, with Andoni Iraola's side victorious over the blue side of Manchester for the first time in the top flight.\nWhile City smashed Salford in the third round, they have found both Leyton Orient and Plymouth a slog in the past two rounds, therefore a trip to the south coast will not be easy for Pep's giants.\nDespite a host of injuries, the Cherries have not let up this season, giving every opponent an intense battle, so this quarter-final could well be an explosive spectacle.\nWhile VAR threatened to suck the life out of what was an absorbing match on Saturday, the atmosphere was pivotal to our success, so home advantage is key.\nCity will remain the favourites for this one, but how many times have they failed to win when considered pre-match favourites this season? They certainly were the last time they visited Bournemouth.\nThe magic of the cup is alive and kicking!", "url": "https://www.bbc.co.uk/sport/football/articles/c2d45k3l0j8o"}