{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:06:14", "date_modify": "2025-04-26 04:06:14", "date_publish": "2025-03-03 17:00:03", "description": "Millwall have condemned \"disgusting\" abuse aimed at goalkeeper Liam Roberts after his red card for a head high tackle on Crystal Palace's Jean-Philippe Mateta.", "filename": "sport_football_articles_c3e45k1zqq1o_1745640374.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/82b3/live/9c73f1c0-f849-11ef-b5bf-275f2ed479cc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c3e45k1zqq1o_1745640374.html", "title": "Millwall: Lions condemn online abuse aimed at Liam Roberts", "title_page": "Millwall: Lions condemn online abuse aimed at Liam Roberts - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Millwall have condemned \"disgusting\" abuse aimed at goalkeeper Liam Roberts, who was sent off for kicking Crystal Palace forward Jean-Philippe Mateta in a head-high tackle in Saturday's 3-1 FA Cup fifth round defeat at Selhurst Park.\nMateta had to be stretchered off the field of play after receiving eight minutes of treatment following the incident, and later needed 25 stitches for a severe laceration to his left ear.\nMillwall said Roberts, 30, had contacted Mateta that evening \"with an apology which was accepted immediately\".\nIn a statement released on Monday, the Lions said the reporting of the incident had \"contributed to an unwarranted character assassination\" and \"fuelled abhorrent\" online abuse towards Roberts.\n\"The club are disgusted by abuse directed towards goalkeeper Liam Roberts following Saturday's unfortunate collision with Jean-Philippe Mateta,\" the Championship club said.\n\"The reporting on the matter, as well as disgraceful suggestions made by certain news organisations and high-profile figures within the sport that Liam intended to harm Jean-Philippe, has contributed to the unwarranted character assassination of Liam and fuelled abhorrent online abuse towards him.\"\nCrystal Palace's chairman Steve Parish, told BBC Sport that Roberts had \"endangered a fellow professional and maybe his life\", while Palace manager Oliver Glasner said the foul \"could have been the end of JP's career\".\nParish told BBC One at half-time in the live broadcast of the game: \"In all the time I've watched football, I've not seen a challenge like it. That is the most reckless challenge on a football pitch I think I've ever seen, and I think he [Roberts] needs to have a long, hard look at himself.\nFormer Arsenal defender Martin Keown said on Match of the Day: \"It is like a kung-fu kick. It is unbelievable how he has got his foot that high. Terrible, horrific challenge.\"\nSome Millwall fans chanted \"let him die\" towards Mateta while he was receiving treatment on the pitch, including oxygen, before being stretchered off. and taken straight to hospital.\nThe Football Association has condemned those chants but said they do not breach its regulations.\nHowever, the FA will investigate homophobic chants aimed towards Ben Chilwell, on loan at Palace from Chelsea, from some Millwall supporters.", "url": "https://www.bbc.co.uk/sport/football/articles/c3e45k1zqq1o"}