{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:56:33", "date_modify": "2025-05-21 03:56:33", "date_publish": "2025-04-07 13:04:51", "description": "Tottenham news: Ange Postecoglou on Brennan Johnson", "filename": "sport_football_articles_cy8q7ng8vzvo_1747799793.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c3cf/live/0dbcf980-13a7-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy8q7ng8vzvo_1747799793.html", "title": "Tottenham news: Ange Postecoglou on Brennan Johnson", "title_page": "Tottenham news: Ange Postecoglou on Brennan Johnson - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tottenham manager Ange Postecoglou has said Brennan Johnson is a \"constant goal threat\" after he scored twice in Spurs' 3-1 win over Southampton on Sunday.\nJohnson, 23, has now scored 16 times for Spurs this season, although Sunday's double were his first home goals in 2025.\n\"I was really pleased for him, not just goals but his general [play] was really good,\" said Postecoglou. \"He's important for us. As a wide player, there aren't many around that are a constant goal threat like he is.\n\"With Brennan, he's always in the areas we need him to be. He's probably one of the most disciplined players we have in terms of making sure he's always in the right positions and that's why he gets his goals.\"\nHe has made 28 Premier League appearances this season and is currently Tottenham's leading goalscorer in the league with 11.\nIn all competitions, Johnson has netted 16 goals.\n\"There have been times this season when his form has suffered because of the team more than anything else,\" added Postecoglou.\n\"I think like we played in the first half, Brennan becomes a really important player for us as we're a constant threat, breaking lines [and] making half-space runs. We were getting balls into the box in the areas we need to and every time we went forward we looked like scoring.\"", "url": "https://www.bbc.com/sport/football/articles/cy8q7ng8vzvo"}