{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:55:15", "date_modify": "2025-04-26 06:55:15", "date_publish": "2025-02-28 15:35:52", "description": "Armagh host Dublin for the first time since 2011 on Saturday while Tyrone and Derry are on the hunt for much-needed points in this weekend's Allianz Football League action.", "filename": "sport_articles_c17qq42j90vo_1745650515.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f933/live/52bae270-f5e5-11ef-a452-97c9e2e951dd.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_c17qq42j90vo_1745650515.html", "title": "Allianz Football League: Dublin make rare Armagh trip as Tyrone and Derry face vital away games", "title_page": "Allianz Football League: Dublin make rare Armagh trip as Tyrone and Derry face vital away games - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Interestingly, in 11 seasons at the Armagh helm, Kieran McGeeney has faced Dublin just once.\nThat was the 2022 Division One encounter at Croke Park, which Armagh won 2-15 to 1-13.\nRemarkably, that is the only time Armagh have locked horns with the Dubs during McGeeney's tenure.\nThe two most recent All-Ireland winners have not met in the championship since 2010, and while Saturday may not be a championship tussle, it is an important outing for Sam Maguire holders Armagh.\nWith a win, two defeats and a draw from four games, the Orchard men are not safe yet. Fifth in Division One, McGeeney's side may find themselves sucked into the relegation mire should they lose on Saturday.\nHaving squandered a nine-point lead to draw with Mayo last week, Armagh hope to lean on home comforts when Dublin visit the Athletic Grounds for the first time since 2011.\nRecent results suggest they may need more than the Athletic Grounds roar, though. Dublin have won three out of four and blasted past Derry in impressive fashion at Croke Park last week.\nDublin, however, may be without Sean Bugler - arguably the league's outstanding player this year - after he took a heavy knock to his calf in the Derry game.\nWith just three games remaining, Derry and Tyrone need to get a move on.\nHolders Derry have just one point from four games. Life under Paddy Tally has been a struggle so far and they face a tall order against Donegal in Ballyshannon on Sunday.\nWhile the Ulster champions fell to Galway last week, they have looked slick in the early rounds and comfortably dispatched Armagh in their last home game.\nAnd having rested Michael Murphy against Galway, Jim McGuinness may be tempted to afford the 2012 All-Ireland winner more minutes on Sunday.\nThis is, of course, the counties' first meeting since last year's Ulster Championship quarter-final at Celtic Park when Donegal ran riot with four goals to end Derry's reign as provincial kingpins.\nWhile Derry are bottom, Tyrone are in similar bother near the foot of the table. Malachy O'Rourke's side beat Derry in their opener but have lost three on the spin since and face a daunting trip to pacesetters Galway on Sunday.\nBut while they were undone by David Clifford's three-goal blitz last week, Tyrone were buoyed by the return of their Errigal Ciaran contingent, with Darragh Canavan coming off the bench to hit 1-4.\nIn Division Two, Monaghan will hope to strengthen their place at the top when they travel to Louth, while there's a big all-Ulster clash at Breffni Park between Cavan and Down.\nCavan are coming off back-to-back wins over Louth and Westmeath, but Down need a result after picking up just two points from their first four outings.\nMeanwhile in Division Three, Fermanagh hope to build on last week's win over Offaly while Antrim travel to Laois on the back of a thumping win over Leitrim.", "url": "https://www.bbc.co.uk/sport/articles/c17qq42j90vo"}