{"authors": ["Charlotte Robson", "www.facebook.com"], "date_download": "2025-05-21 06:15:30", "date_modify": "2025-05-21 06:15:30", "date_publish": "2025-01-14 09:00:42", "description": "Newcastle news: Opinion - 'Will Osula's goal a glimmer of what might be to come'", "filename": "sport_football_articles_cn57ww9rve5o_1747808130.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e2e4/live/2c881250-b62e-11ee-bc2f-cb5579b90709.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cn57ww9rve5o_1747808130.html", "title": "'Will Osula's goal a glimmer of what might be to come'", "title_page": "Newcastle news: Opinion - 'Will  Osula's goal a glimmer of what might be to come' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Another day, another win. Is this what life is like for fans of good clubs? Great clubs?\nThe win may have been over League Two Bromley, but who really cares? Tamworth held Tottenham to 0-0 for 90 minutes.\nI will take whatever wins we can get - and progress in another cup. Salad days for Newcastle fans.\nEddie Howe made nine changes for Sunday's FA Cup fixture, with only Martin Dubravka and Joelinton from our regular XI keeping their places.\nThis meant it was a good time to showcase some of our younger players, and lesser-seen players, providing the game was put to bed.\nUnfortunately, by half-time, it was not, so Anthony Gordon and Bruno Guimaraes came on to fix that. They did their job very effectively, and their presence on the pitch elevated our game such that we were able to see other players shine.\nWill Osula, a summer signing from Sheffield United, finally got his first goal for the team. Newcastle United have a dearth of strikers - Callum Wilson, unfortunately, is injured almost all of the time (though good when he is fit!), which basically just leaves Alexander Isak.\nFans have been keen to see the development of Osula under Eddie Howe, who has a track record of really honing player ability over a long period of time - assessing the natural skill and working on it.\nHe does not throw players in if he does not think they are ready. Lewis Hall, for example, said he was not fit enough last season to play Howe's style of football - and now he's arguably England's best left-back.\nOsula's goal certainly showed a glimmer of what might be to come. It is very early to say, but it was a real showcase of skill. It wasn't a scuffle in front of goal, or a flukey pass. It was a beautiful, left-footed strike from just inside the box.\nHopefully much more to come from this player for Newcastle.", "url": "https://www.bbc.com/sport/football/articles/cn57ww9rve5o"}