{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:34:51", "date_modify": "2025-05-21 07:34:51", "date_publish": "2025-01-13 17:18:53", "description": "Fulham news: 'It's been a great run' - Marco Silva", "filename": "sport_football_articles_cqjv0v2d4kgo_1747812891.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1d40/live/21124100-d1cd-11ef-858a-3ffeee956fe5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cqjv0v2d4kgo_1747812891.html", "title": "Fulham news: 'It's been a great run'", "title_page": "Fulham news: 'It's been a great run' - Marco Silva - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Marco Silva thinks his Fulham side have been \"really, really good,\" but should have picked up more points from their games.\nSince losing to Wolves in their last game of November, Fulham have remained unbeaten in all competitions, picking up 12 points from their eight Premier League fixtures and qualifying for the fourth round of the FA Cup.\nSpeaking to the club's official website about their form, Silva said: \"It's been a great run for us. We should have taken more points because we deserve it the way we have been playing in some of those games, but it's been really, really good.\n\"We showed the resilience, showed the quality, showed that we have been able to be competitive in any stadium in this country against any team and we want to repeat again against West Ham tomorrow.\n\"The teams when they play against us, they know what they're going to face and what type of game they're going to play. The players, they are confident that they can do a good job and we collectively are a strong side.\"\nSilva's side sit ninth in the league table and although he would like to make some improvements to the team, he is not expecting a busy January window.\n\"It's going to be very quiet for us. Of course, we have one or two positions that we'd like to strengthen. We have the confidence in our players, we are really pleased with them.\n\"If we can add extra quality and someone that can have an impact like we did last summer, we're going to do it.\n\"If not, we keep the same group of players and we go until the end of the season because we have trust in them.\"", "url": "https://www.bbc.com/sport/football/articles/cqjv0v2d4kgo"}