{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-05-20 13:07:51", "date_modify": "2025-05-20 13:07:51", "date_publish": "2023-08-02 14:13:55", "description": "Manchester City agree a £77m deal with German club RB Leipzig for 21-year-old Croatia defender Josko Gvardiol.", "filename": "sport_football_66386222_1747746471.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/E27D/production/_130618975_josko.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66386222_1747746471.html", "title": "Josko Gvardiol: Manchester City agree £77m fee with RB Leipzig for defender", "title_page": "Josko Gvardiol: Manchester City agree £77m fee with RB Leipzig for defender - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester City have agreed a 90m euro fee (£77m) with RB Leipzig for Croatia defender Josko Gvardiol.\nThe deal for the 21-year-old does not include add-ons, meaning the £80m Manchester United paid Leicester City for Harry Maguire in 2019 remains the British record for a defender.\nHe has been a key player for Leipzig in the 87 games he played for them since signing from Dynamo Zagreb in 2021.\nIt is expected Gvardiol will fly to England for a medical later this week\nThe deal looked unlikely to be agreed last week when Leipzig insisted they would not sell for less than €100m (£86m).\nManager Pep Guardiola believes Gvardiol will strengthen the left side of his central defence and, with Ruben Dias, Manuel Akanji and Nathan Ake also able to fill that position, his arrival may put the future of Aymeric Laporte at Etihad Stadium under the microscope.\nGvardiol, who is also able to play left-back, becomes City's second major signing of the summer following the arrival of fellow Croatian Mateo Kovacic from Chelsea in June for an initial £25m.\nKovacic will effectively replace Ilkay Gundogan in City's midfield after last season's captain joined Barcelona on a free transfer, while winger Riyad Mahrez moved to Saudi Arabia's Al-Ahli last week in a £30m deal.\nGvardiol, who has scored twice in his 21 caps for Croatia, helped his country finish third at the 2022 World Cup as well as runners-up to Spain in this year's Nations League.\nHe won back-to-back titles with Zagreb, signing off with a league and cup double before making his move to the Bundesliga.\nLeipzig also twice qualified for the Champions League during Gvardiol's time in Germany as a result of their fourth and third-placed finishes in the Bundesliga.\nThe club that has sold him were effectively knocked out of the Champions League twice in the past two seasons by the club he has now joined.\nLeipzig finished third in a group topped by City in 2021-22 and lost 8-1 over two legs in the round of 16 last season, including a 7-0 defeat at the Etihad.", "url": "https://www.bbc.com/sport/football/66386222"}