{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:02:19", "date_modify": "2025-05-21 04:02:19", "date_publish": "2025-04-07 00:00:00", "description": "All the latest reaction as Ivan Juric is to leave Southampton after their relegation from the Premier League.", "filename": "sport_football_live_c0kx52837xxt_1747800139.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7cce/live/280fbf10-1399-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c0kx52837xxt_1747800139.html", "title": "Reaction as Juric leaves Southampton after relegation from Premier League", "title_page": "Reaction as Juric leaves Southampton after relegation from Premier League - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "That's all from us\nA big thank you to everyone who has followed this live page throughout the day where Ivan Juric's departure from Southampton was confirmed.\nHead over to our other live page here where we are about to bring you live updates from Arsenla's open training session ahead of facing Real Madrid in the Champions League.\nWe will also have another live text commentary this evening for tonight's Premier League match between Leicester City and Newcastle United.\nWe will be back at 07:00 BST tomorrow. Until then, goodbye.\nget involved\nGet Involved\n#bbcfootball, WhatsApp 03301231826, text 81111 (UK only, standard rates apply)\nWhen complaining about their small budget for the past few years has anyone considered that Southampton have decided that they’d rather be a good stable Championship team, rather than busting their budget and going into freefall like so many other teams that have been in the Premier League in recent times? How many of those have gone on a freefall through the divisions? Spending big brings in big players yes, but it also brings huge wages and longer contracts which hasn’t stopped other teams getting instantly relegated and stuck with players on huge salaries. And no, it doesn’t guarantee they instantly bounce back up. Of course everyone wants to be a mid-top table Premier League team but it just isn’t sustainable for 99% of clubs.\nJay\n'I'm filled with trepidation'\nSouthampton\nIt's interesting reading back the views of Southampton fans at Wembley after their team won promotion by beating Leeds United in the Championship play-off final 11 months ago.\n\"It's absolutely brilliant we're up but I'm filled with trepidation as well,\" Roger Lacey, who has supported the Saints for 50 years, told BBC Sport.\n\"I feel we will beat some teams but I also think we'll be ripped apart by others.\"\nSaints fan Ed Robinson, who was at Wembley with his brother Ben, added: \"We are in a much better place as a club than we were two years ago.\"\nRead: 'Bring it on!' - fans react to Southampton's promotion.\nFive permanent managers since November 2022\nSouthampton\nIt’s already difficult enough to stay in the Premier League as a newly promoted club. Before this season, 50% of all clubs promoted to the Premier League over the last decade have gone straight back down.\nYet under Russell Martin, Southampton – along with champions Leicester last season – were part of just 37% of clubs relegated from the Premier League to bounce straight back, in the same 10-year period.\nAnd they really should have known better…\nLast time they were relegated from the Premier League - 2022-23 - was also the last time a Premier League club had three permanent managers in one season.\nBoth Southampton and Leeds tried it… and both went down.\nSaints replaced Ralph Hasenhuttl (0.86 points per game) with Nathan Jones (0.38 PPG) who lasted just eight matches, then replaced him with Ruben Selles (0.63 PPG).\nAnd relegated alongside them were three-manager Leeds – with Jesse Marsch (0.9 PPG), followed by Javier Gracia (1.0 PPG), then replaced by Sam Allardyce (0.25 PPG).\nget involved\nGet Involved\n#bbcfootball, WhatsApp 03301231826, text 81111 (UK only, standard rates apply)\nIvan Juric was clearly out of his depth taking over a Premier League team under threat of relegation, and was obviously a knee-jerk appointment once the Saints board panicked and sacked Russell Martin in December. With the squad available, it's unlikely anyone could have kept them up, frankly. Sometimes, a managerial change can spark a revival, but this was merely a case of trying to get better results from a squad that wasn't Premier League standard in the first place. Kieran McKenna will likely get relegated with Ipswich, but at least he has tried to play decent football and has enhanced his managerial reputation. Southampton, by comparison, have been abysmal, and the club hierarchy need to look at themselves when surveying the dreadful season they've overseen.\nJon\n'We owe it to our fans'\nSouthampton\nSouthampton, who have 10 points with seven matches of the season left, are trying to avoid being the worst team in Premier League history by bettering Derby's current record-low total of 11 points from 2007-08.\nAfter Southampton's relegation was confirmed on Sunday, Ivan Juric said: \"The goal has to be that, to avoid being the worst team in Premier League history.\n\"I am manager of Southampton and it is easy to say, 'now I want to go' - we have to keep working. We owe that to our fans and this is our goal.\n\"It is really good to be a coach in the Premier League and if I took the long way to come back here, I am ready.\"\nget involved\nGet Involved\n#bbcfootball, WhatsApp 03301231826, text 81111 (UK only, standard rates apply)\nSouthampton should have either sacked Russell after the Leicester game and gone for a David Moyes type manager, or stuck with him until the end of the season. They did neither. Poor decision after poor decision from the owners. Ivan Juric will go down as, in my opinion, the poorest manager in Premier League history. Now Southampton are back to square one looking for another Russell Martin to get them back out of the Championship. A royal mess all round.\nLauren\nget involved\nGet Involved\n#bbcfootball, WhatsApp 03301231826, text 81111 (UK only, standard rates apply)\nRe Anon at 11:51: I totally agree. The manager shouldn't be the one sacked. The players are the ones who either perform or not and they should be the ones held accountable. They should be dropped for the younger players if they don't perform, or sold. Players have to start being punished for underperforming!\nSteve, Fife", "url": "https://www.bbc.com/sport/football/live/c0kx52837xxt"}