{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:40:15", "date_modify": "2025-05-21 06:40:15", "date_publish": "2025-01-04 13:09:19", "description": "Clovers make it back-to-back victories in the Celtic Challenge as they pick up a bonus-point win against Gwalia Lightning at Kingspan Stadium.", "filename": "sport_articles_cvgxyv2d8k3o_1747809615.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/220a/live/94c15970-ca92-11ef-8aa7-690308ce7831.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cvgxyv2d8k3o_1747809615.html", "title": "Celtic Challenge: Clovers beat Gwalia at Kingspan Stadium", "title_page": "Celtic Challenge: Clovers beat Gwalia at Kingspan Stadium - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Clovers made it back-to-back victories in the Celtic Challenge as they picked up a bonus-point win against Gwalia Lightning at Kingspan Stadium.\nDenis Fogarty's side started brightly in Belfast and went ahead on seven minutes as Emily Lane raced through to score the opening try, with Nicole Fowley converting.\nAnna McGann, playing her first 15-a-side game in two years after injury, launched a swift counter-attack, and fed Alanna McInerney, who crossed for their second try soon after.\nClovers continued to dominate and registered their third try of the half when Hannah Clarke bustled her way through before touching down with Fowley unable to add the extras.\nGwalia were much improved after the break and Molly Reardon restored hope for the Welsh, side getting their first try soon after the restart after patient build-up play.\nParis Hughes reduced the deficit further by nailing the conversion.\nClovers swiftly responded by clinching the bonus-point as Lane dotted down again.\nReplacement Sophie Barrett then got their fifth try after good work from the maul as they saw out a comfortable win.\nClovers: Deely; McInerney, McGann, Breen, Clarke; Fowley, Lane; McCarthy, Buttimer, McGrath, Campbell, Neill; McMahon, Nic a Bháird, Kiripati.\nReplacements: Gavin, Burke, Barrett, Oviawe, Adams, Moran, Finn, Costigan.\nGwalia Lightning: Greenway; Lewis, Williams-Morris, Anderson-Thomas, Davies, Hughes, Bevans; Davies, Reardon, Scoble, Terry, Pyrs, Baverstock, P Jones, Hopkins.", "url": "https://www.bbc.com/sport/articles/cvgxyv2d8k3o"}