{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:43:39", "date_modify": "2025-05-21 07:43:39", "date_publish": "2025-05-20 12:33:45", "description": "Former Burnley, Celtic, Hull and Barnsley striker Andy Payton talks to BBC Radio Lancashire about his dementia diagnosis at the age of 57.", "filename": "sport_football_articles_cn055x9jw5lo_1747813419.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5331/live/22e66530-356c-11f0-8b28-6f0e47ba60fe.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cn055x9jw5lo_1747813419.html", "title": "Andy Payton: Ex-Burnley and Celtic striker talks about his dementia diagnosis at 57", "title_page": "Andy Payton: Ex-Burnley and Celtic striker talks about his dementia diagnosis at 57 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "\"I still love the game. All ex-footballers do. We all love the game, but I just want this sorting out if possible and for anybody who has got this diagnosis to get help.\"\nEarlier this year, at the age of just 57, Andy Payton was diagnosed with dementia.\nThe former Burnley, Celtic, Barnsley, Hull City, Huddersfield and Middlesbrough striker scored over 200 goals in well over 500 appearances during his career in football.\nHe has now been told that his career is the cause of his diagnosis.\nIn a candid interview with BBC Radio Lancashire, Payton talked about being told he had dementia, his thoughts on the game's attitude to heading the ball, and where he goes from here.\nPayton's initial symptoms gave the impression something was wrong.\nWhen fellow former Hull City trainee Dean Windass came out earlier this year to say he had received a diagnosis of dementia at the age of 56, Payton felt encouraged to get checked himself.\n\"I was having symptoms such as bad headaches, forgetfulness, but for someone in their mid-50s probably a bit too much,\" he said.\n\"The headaches were an issue and still are a little bit, but I knew that something didn't feel right. When I knew Deano had been diagnosed I thought I'd go and get checked out. I could either get told 'you're OK' or that 'there's a problem here'.\"\nAfter a brain scan, Payton received the news he had been diagnosed with early-onset dementia.\nThe scale of the damage to his brain and what the future might hold were particularly concerning to hear.\n\"It's hard to put into words,\" he said. \"Things that were on the tip of your tongue just would not come out.\n\"Going off what they've said, out of the 60 tracts in my brain, 27 were damaged. You lose connection, as it were. I'm OK now, but it's for further down the line the fear comes in a little bit.\"\nWould he have got tested were it not for Windass going public? Payton does not think so.\n\"I wouldn't, I don't think, because I didn't know that you could potentially have tests,\" he said.\n\"Me and Deano were 16-year-olds at Hull City together so I knew him. I thought it made sense to get tested.\"\nPayton was told his career in football and the frequency with which he headed the ball was the cause of his diagnosis.\nIn his playing days, Payton was a prolific striker, scoring 81 goals for Burnley as well as having impressive records in front of goal for Hull, Barnsley and Celtic.\nTo reach the level he did, however, came with hard work in training which decades after his retirement have had their effect.\n\"I was in a bit of shock to begin with. Dementia and being 57 don't go hand in hand,\" he said.\n\"They explained it was from the impact of heading the ball. I knew that the position I played in and the training sessions we did, I was heading the ball 200 times in a session.\n\"From 16 years old, [there was] non-stop repetition, session after session, and that's where it's come from.\"\nOff the back of the diagnosis, Payton's impression on how heading the ball is handled has changed.\n\"If you were to say to me now 'should kids head the ball?' I'd say no. I think they've stopped it at under-11s and even in training now they're limiting it. I agree with that.\n\"Because it's not about now, it's about what it could potentially develop into.\"\nFootball has changed in the period between Payton's retirement and his diagnosis, and there is more awareness in 2025 of the possible dangers of heading the ball.\nAsked whether he was told about the risks when he was playing, Payton said: \"Not at all.\n\"I loved my career and I wouldn't want to change much about it. Playing for Burnley and Celtic and especially my hometown club... but I'd be thinking twice because this is where I am in life now. If it could have been limited, if we could have known - but we do know now and things have got to be done.\"\nAwareness is one thing. But can the football industry do more to support former players who are now receiving diagnoses similar to Windass and Payton?\nThe Football Families for Justice (FFJ) campaign, led by John Stiles, the son of England World Cup winner Nobby Stiles, is a voluntary organisation dedicated to championing the rights and wellbeing of former players with neuro-degenerative diseases.\nFormer Manchester United midfielder Stiles, who died in 2020, had prostate cancer and advanced dementia.\nHis brain was diagnosed as having chronic traumatic encephalopathy (CTE) - a form of degenerative disease dementia believed to be caused by repeated blows.\nAsked how much responsibility the football industry should take for the health of former players, Payton said: \"It's massive. I think they certainly should do more.\n\"Jimmy Robson, who used to be my coach at Burnley, he passed through dementia. John Stiles' dad was a World Cup winner and you can't get higher than that in football. And he wasn't looked after properly. That should come into it.\n\"Football and the billions of pounds around it... They should look after players that have got this because it's come through football and nothing else.\"\nThe BBC Action Line offers resources and advice on dementia.", "url": "https://www.bbc.com/sport/football/articles/cn055x9jw5lo"}