{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:49:18", "date_modify": "2025-04-26 07:49:18", "date_publish": "2025-02-26 22:41:45", "description": "Wrexham 'throw away Wembley chance' - Phil Parkinson", "filename": "sport_football_articles_c30mm3z0y3ro_1745653758.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1bf8/live/0d0102a0-f491-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c30mm3z0y3ro_1745653758.html", "title": "Wrexham 'throw away Wembley chance'", "title_page": "Wrexham 'throw away Wembley chance' - Phil Parkinson - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Phil Parkinson says Wrexham have no one to blame but themselves for failing to capitalise on a 2-0 lead as they were dumped out of the EFL Trophy at the semi-final stage by Peterborough United.\nFirst half goals from Mo Faal and George Dobson appeared destined to have booked the Red Dragons a place in the Wembley final against Birmingham City in April.\nBut Malik Mothersille and Bradley Ihionvien netted in the second half for Posh - the latter in the first minute of added time - to send the tie to a penalty shootout which Darren Ferguson's side won 4-2 at the Stok Racecourse.\n\"We've thrown away a chance to go to Wembley as far as I'm concerned,\" Parkinson said.\n\"We were comfortable in the game, 2-0 up and made a lot of changes, I thought the lads did well.\n\"Two really poor goals to concede. Moments in the game of concentration and seeing the game through, particularly the second one.\n\"From a game which looked so comfortable for us, to end up not going to Wembley is very difficult to take for us all, but we've got no one else to blame but ourselves.\"\nDespite the significant setback, Wrexham remain well placed to challenge for a third successive promotion.\nThey currently sit third in League One and are just three points adrift of the play-off places ahead of Saturday's fixture with Parkinson's former side Bolton Wanderers in north Wales (12:30 GMT kick-off).\n\"We've said before every round that the league is our number one priority, and it always has been, but when you get so close, we want to finish the job off,\" he added.\n\"We've done well in this tournament throughout this season, but now we've got to focus on the league and learn from tonight.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c30mm3z0y3ro"}