{"authors": ["Emma Middleton", "www.facebook.com"], "date_download": "2025-05-21 05:38:32", "date_modify": "2025-05-21 05:38:32", "date_publish": "2024-12-24 19:23:39", "description": "BBC Sport answers your top darts questions: what height is a dartboard? And what weight darts do professionals use?", "filename": "sport_darts_articles_cgl98669d4do_1747805912.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c070/live/719b3e80-c226-11ef-8f37-8d8e53f2cb82.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_darts_articles_cgl98669d4do_1747805912.html", "title": "What height is a dartboard?", "title_page": "What height is a dartboard? What weight darts do players use? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "\"You don't have to be good at maths to be good at darts,\" Luke Littler told BBC Sport.\nThe teenager became a household name at the start of the year by reaching the World Championship final aged just 16 years and 347 days.\nAnd with the help of Luke 'the Nuke', we've wrapped up some more of your top darts questions.\nWe typically see players use darts weighing between 18-26 grams.\nBut there are always outliers. Ryan 'Heavy Metal' Searle is known to use much heavier darts that weigh 32 grams.\nPlayers don't always stick to the same weight either. Two-time world champion Peter Wright sometimes changes his darts, even within the same tournament.\nSo, choosing the weight is largely a matter of personal preference - with some restrictions.\nThe PDC World Championship is governed by the Darts Regulation Authority (DRA). The DRA sets out the rule book., external\nThis says that darts cannot be longer than 200mm or weigh more than 40 grams.\nThe point (or tip) of the dart cannot have any grooves or ridges within 15mm of the point end, and cannot be wider than 2.5mm.\nLuke Littler - who made the PDC World Championship final on his first attempt in January - told us he plays with a 23 gram dart. He says he's tried weights above and below this, but they feel slightly too light or too heavy.\nHis 'Luke Littler Gen 1 Darts' were produced exclusively for him by manufacturer Target Darts.\nLittler told us that players pick the weight largely based on what feels most comfortable.\nFor professional tournaments, the dartboard is fixed at 1.73m (5ft 8in) - measured from the floor to the centre of the bullseye.\nThe 20 segment is always at the top of the dartboard.\nThe oche (the line behind which a player must throw from) should be 2.37m (7ft 9.25in) from the board.\nThe DRA rule book says players cannot consume alcoholic drinks, external \"outside the designated practice area\".\nBut that hasn't always been the case. Before 1989, drinking alcohol on the stage was allowed.\nThe current rule book doesn't stop players drinking before the event.\nMany studies have shown that even low levels of alcohol can impair motor skills and spatial reasoning. Despite this, some people claim that small amounts can help with tournament nerves.\nLittler isn't one for doing it, but you may have spotted other pros licking their fingers before taking a throw.\nAnd it's more than a superstition.\nAdding moisture to your fingers - by either licking them or blowing air on to them - increases friction with the surface, and could help provide extra grip.\nA total prize pot of £2.5 million is up for grabs at the PDC World Championship.\nA first-round appearance earns a player £7,500, with the money going up incrementally per round. The winner will take home £500,000, and the runner-up £200,000.\nPlayers that hit an elusive 'nine darter' - finishing a leg using the minimum number of nine darts - get an extra £60,000.\nNo. Both men and women can play at the PDC World Championship.\nPlayers qualify via the 'Order of Merit' - the official rankings,, external which are calculated based on the amount of prize money won over a two-year period in ranking tournaments.\nThe top two players from the Women's Series Order of Merit qualify for the PDC World Championship.\nFor the 2024/25 tournament, Beau Greaves topped the women's Order of Merit. However, Greaves chose to play in the WDF Women's World Championship instead, looking to defend her title.\nPlayers that take part in the WDF Championship are then ineligible to play in the PDC World Championship.\nThree-time WDF champion Beau Greaves has called it \"stupid\" that women are not able to play in both, and has called for a separate PDC World Championship for women.\nPDC chief executive Matt Porter said: \"At present we do not plan to introduce a separate women's World Championship; the Paddy Power World Darts Championship is open to all players and is a reward for successful players on the PDC Women's Series and the Women's World Matchplay winner.\n\"Our ProTour, Challenge Tour and Development Tour remain open to all players, and from 2025, players from the PDC Women's Series will also get the chance to qualify for the Winmau World Masters and also compete in the Mr Vegas Grand Slam of Darts in addition to free entry places on offer at the PDC Qualifying Schools.\"\nGreaves' withdrawal meant Noa-Lynn van Leuven and Fallon Sherrock, ranked second and third respectively, qualified.\nFallon Sherrock made history in 2019 when she became the first woman to win a match at the PDC World Championship.\nThe Netherlands' Van Leuven was the first transgender player to compete at the tournament.", "url": "https://www.bbc.com/sport/darts/articles/cgl98669d4do"}