{"authors": ["Harry Poole", "www.facebook.com"], "date_download": "2025-05-21 05:42:34", "date_modify": "2025-05-21 05:42:34", "date_publish": "2025-01-14 12:53:36", "description": "Getting the call-up as an Australian Open lucky loser means a second chance for tennis players but it can often prove a stressful experience.", "filename": "sport_tennis_articles_c87dx58qj23o_1747806154.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9a53/live/5eba86a0-d26f-11ef-8926-89a9332957ee.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_tennis_articles_c87dx58qj23o_1747806154.html", "title": "Australian Open 2025: Lucky losers", "title_page": "Australian Open 2025: Lucky losers - panic and low expectations at Melbourne Park - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Getting the call-up as a lucky loser means a second chance for tennis players - but it can often prove a stressful experience.\nLucky losers are players who lose in qualifying at a tournament but receive a place in the main draw if another player withdraws through injury or illness.\nFour players have received lucky loser entries into the men's and women's singles draws at the Australian Open.\nThree of them, including Britain's Harriet Dart, claimed first-round wins and German Eva Lys is into round four.\nBut being told you are in the draw, sometimes only minutes before you are due on court, is far from ideal.\n\"You never really know what's going to happen with being the first lucky loser,\" said British number four Dart, who was given one hour's notice before her three-set win.\nDart, who battled cramp and saved match points in her victory, said: \"I got here pretty early, practised, and was fortunate enough to be able to play.\n\"When you get a chance, you really want to take it, and I was really happy to get over the line.\"\nLys was lying on a physio table receiving treatment when she was summoned for her first-round match.\nThe world number 128, who was given 10 minutes' notice, beat Australian number one Kimberly Birrel 6-2 6-2, but admitted she was \"panicking\" over the lack of preparation.\n\"I actually had my flight back booked for tomorrow morning,\" said the 23-year-old, who went on to beat Varvara Gracheva 6-2 3-6 6-4 in the second round.\n\"I didn't really prepare my drinks, I didn't have match clothes on. I went to the locker room, got changed straight away, and then they called my name.\n\"So no warm-up, no anything. Maybe that's the key for next match.\"\nOn the lucky loser experience, she added: \"If you are a lucky loser, you don't expect much. Your tournament is kind of over.\n\"But a lot of people gave me hope that there was a possibility for me to get in. That's why I was here the whole day, from 9am until 11pm, because you never know if someone is going to pull out.\n\"I went out and had no expectations. I was definitely the lucky one.\"", "url": "https://www.bbc.com/sport/tennis/articles/c87dx58qj23o"}