{"authors": ["George Booth", "www.facebook.com"], "date_download": "2025-05-20 11:42:07", "date_modify": "2025-05-20 11:42:07", "date_publish": "2023-08-06 17:46:11", "description": "Great Britain claim four gold and two silver medals in track cycling evening session on day four of the UCI Cycling World Championships in Glasgow.", "filename": "sport_cycling_66422867_1747741327.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/88DD/production/_130673053_kadeenacox.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cycling_66422867_1747741327.html", "title": "Cycling World Championships 2023: Gold rush for GB in evening track events on day four", "title_page": "Cycling World Championships 2023: Gold rush for GB in evening track events on day four - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Great Britain claimed five Para-cycling gold medals in the evening track session on day four of the UCI Cycling World Championships in Glasgow.\nWorld record holder Kadeena Cox dominated as she won the women's C4 500m time trial.\nFrances Brown recorded a world record in the C1 individual pursuit, beating China's Qian Wangwei to gold.\nAnd 19-year-old Archie Atkinson fought off New Zealand's Benjamin Westenberg to win the men's C4 scratch race.\nAtkinson told BBC Sport afterwards: \"Unreal, I had my first camp this time last year. I have done two or three scratch races before and it is the first one I have won.\"\nAtkinson went on to dedicate his win to fellow cyclist Magnus White who died in a training accident aged 17.\nSophie Unwin and Jenny Holl added a third gold medal to their collection at these championships, as they beat Australian pair Jessica Gallagher and Caitlin Ward in the women's B sprint.\nDuring the three heats, the riders came shoulder to shoulder as they fought for the title - each pair trying to psych the other out on the track before the final heat.\n\"I really wanted this and it means so much to win here in Scotland.\" Scotswoman Holl told BBC Sport.\n\"I did not expect to win three jerseys this weekend!\"", "url": "https://www.bbc.com/sport/cycling/66422867"}