{"authors": ["Nick Mashiter", "www.facebook.com"], "date_download": "2025-05-21 06:12:48", "date_modify": "2025-05-21 06:12:48", "date_publish": "2025-01-14 07:55:23", "description": null, "filename": "sport_football_articles_ce8yd1zrzgeo_1747807968.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9166/live/39480da0-d1f9-11ef-a02c-b1a25ba77fd5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ce8yd1zrzgeo_1747807968.html", "title": "Nottingham Forest news: 'Going under the radar will help players'", "title_page": "Nottingham Forest news: 'Going under the radar will help players' - Wes Morgan - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Leicester's title-winning captain Wes Morgan believes the Premier League big boys should underestimate Nottingham Forest at their peril.\nThe defender, who made 403 appearances for Forest before joining the Foxes in 2012, insists it could play into their hands in any title race.\nMorgan lifted the Premier League trophy after Leicester's 5,000-1 title win in 2016 and Forest will move to within three points of leaders Liverpool if they beat Arne Slot's side at The City Ground on Tuesday.\nLeicester eventually won the league by 10 points, ahead of Arsenal, and Morgan knows exactly what Forest - who are third behind the Gunners Arsenal on goal difference - are going through.\n\"That's probably where it's quite similar with Forest and Leicester. No-one expects you to sustain that push at the top. So you are not really taken seriously,\" said Morgan, now back with the Reds as a national scout for the emerging talent recruitment team.\n\"You go under the radar a little bit, which is great for the players because they've not got that pressure.\n\"You can do your work without that expectation. Everyone wants that punchline, that headline: Can you win the league? Can you do this?\n\"They perform better when they haven't got that pressure; when that expectation is much lower.\n\"So you're achieving more and you can just be free in your play and what you want to do.\"", "url": "https://www.bbc.com/sport/football/articles/ce8yd1zrzgeo"}