{"authors": ["Mike Richards", "www.facebook.com"], "date_download": "2025-05-21 06:16:20", "date_modify": "2025-05-21 06:16:20", "date_publish": "2025-01-14 09:14:18", "description": "Everton news: Opinion - Is Moyes a 'steady pair of hands'?", "filename": "sport_football_articles_c05lzg4y9mmo_1747808180.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b550/live/69581a40-b629-11ee-beb5-e1400df560f2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c05lzg4y9mmo_1747808180.html", "title": "Opinion - Is Moyes a 'steady pair of hands'? - BBC Sport", "title_page": "Everton news: Opinion - Is Moyes a 'steady pair of hands'? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It is hard to think that some 11 and a half years after he last sat in the home dugout at Goodison Park, David Moyes is on the eve of doing it all again.\nPart of me believes it was always destined to happen, with it almost being poetic that he should be the man to manage our last match at Goodison Park and the first at Everton Stadium.\nA steady pair of hands was certainly the order of the day once Sean Dyche's departure was confirmed, and Moyes ticks that box.\nSince the relative stability of Moyes' Everton, the club has been in a steady state of decline. Countless managers, hundreds of millions of pounds wasted on sub-standard players and financial turmoil have been the overarching headlines.\nThe version of Everton that Moyes has inherited has a lot more similarities to the one he took over in 2002, than the one he left in 2013.\nEmbroiled in a relegation battle and craving on-field stability, the parallels are striking.\nIn a question of who needs who the most, you could make a case for them both needing each other.\nSince leaving the club, Moyes has been on his own managerial rollercoaster. The lows of Manchester United, Real Sociedad and Sunderland and the highs of West Ham and winning their first trophy since 1980. It's certainly been an eventful career, post-Everton.\nSome may say it is a typical romantic appointment and nothing has changed, even under new ownership.\nIt is a valid observation, but the appointment smacks of common sense.\nThe general feeling within the fanbase appears to be one of satisfaction. There is a palpable sense of relief, despite some dissenting voices.\nThe managerial appointment was never going to please everyone, but we all deal in the currency of wins.\nEvery Evertonian can get on board with that.", "url": "https://www.bbc.com/sport/football/articles/c05lzg4y9mmo"}