{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:33:12", "date_modify": "2025-05-20 14:33:12", "date_publish": "2023-07-28 19:56:53", "description": "Haverfordwest County manager Tony Pennock accuses Europa Conference League opponents B36 Torshavn of gamesmanship.", "filename": "sport_football_66343833_1747751592.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/13A71/production/_130579408_2023-07-20haverfordwestcountyvkfshkndija-100.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66343833_1747751592.html", "title": "Europa Conference League: Haverfordwest County boss blasts 'laughable' Torshavn stunts", "title_page": "Europa Conference League: Haverfordwest County boss blasts 'laughable' Torshavn stunts - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Haverfordwest County manager Tony Pennock has accused Europa Conference League opponents B36 Torshavn of gamesmanship.\nThe Cymru Premier side lost 2-1 in the first leg of their second qualifying round first leg in the Faroe Islands.\nPennock said they had to wait five minutes at half-time for their dressing room to be unlocked and claimed Torshavn backroom staff posed as security guards to watch County train.\n\"It was laughable,\" Pennock said.\n\"When we got back to the dressing room at half-time, five yards from the pitch, the door was locked and nobody could find anyone with the key.\n\"There was nobody coming forward with the key.\n\"The referee has said he's putting it in his report. He delayed the kick-off for the second half for an extra two minutes but it was a lot longer than two minutes we were stood outside in the corridor waiting to get into the dressing room.\n\"At that time as well they had been well on top and we needed to get down and regroup and have a chat about things. When you're stood waiting for five minutes for someone with the key, it didn't put me in the best of moods.\"\nPennock and officials of the Pembrokeshire club were also unhappy with the conduct of the hosts at the previous evening's training session at the Gundadalur Stadium.\n\"There were 25 people stood at the side of the pitch and two of them took part in the warm-up,\" Pennock told BBC Radio Wales Sport.\n\"Georgina Nicholas, our chief executive, let them know what she thought and they soon dispersed in the training session.\n\"At the end of the day I'm not going to do anything in the training session that's going to show the opposition, I'm not that stupid to not imagine that there's not someone watching from somewhere.\n\"But the fact they blatantly abused what they were doing and pretended to be security guards, I just don't get it, especially for a team as good as they are.\n\"Why they need to resort to that is just poor.\"\nPennock also claimed Torshavn had refused their request to water the pitch ahead of their training session the previous evening.\nHe also said that the balls the hosts provided for them \"were like bricks\".\nBBC Sport Wales has asked Uefa for a comment.\n\"Maybe it's our naivety - it's the first time we've been in Europe for 19 years and the first time I've done it as a manager,\" he said.\n\"Maybe it's something that goes on all the time.\n\"But us as a club would never do some of the things that happened last night and the night before.\"\nPennock, a former first-team coach with Hull City who was appointed County boss in 2022, said the Welsh club would not resort to similar gamesmanship in next Thursday's second leg at Cardiff City Stadium.\n\"As far as I'm concerned it's done now and we move on to next week,\" Pennock added.\n\"We know the way we conduct ourselves and we're not going to be childish enough to retaliate in any way.\n\"They'll come to the Cardiff City Stadium and compared to where we were they will be treated like kings.\n\"We've made our comments, we've told people what happened and all we can do is prepare for next Thursday.\"\nMartell Taylor-Crossdale's late goal kept County's Europa Conference League hopes alive despite a 2-1 defeat.\nCounty will hope for a repeat of the previous round when they overturned a 1-0 first-leg defeat against North Macedonia's Shkendija to win the second leg on penalties at the home of Cardiff City.\n\"We're massive underdogs again for the second leg based on B36 and the record they've got in Europe,\" Pennock said.\n\"But as we've done for the last few games and the play-offs last year the boys will always battle for us.\"\nPennock said County captain, former Wales international Jazz Richards, was \"touch and go\" for the second leg.\nRichards, who has played a pivotal role in County's European campaign so far, was substituted at half-time against Torshavn.\n\"Jazz knows his body better than anybody,\" Pennock said.\n\"He is always honest and will let us know whether he can contribute to the team or not.\n\"We knew before the game he was struggling and at half-time he was honest to say he felt he wouldn't do the best for us or the team if he stayed on the pitch.\"", "url": "https://www.bbc.com/sport/football/66343833"}