{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:31:47", "date_modify": "2025-05-19 14:31:47", "date_publish": "2017-08-06 17:08:27", "description": "Graham Dorrans is praised by manager Pedro Caixinha, who has a warning for Josh Windass after Rangers' win at Motherwell.", "filename": "sport_football_40844489_1747665107.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/B02F/production/_97230154_dorranscel3_sns.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_40844489_1747665107.html", "title": "Motherwell 1-2 Rangers: Graham Dorrans revels in 'dream' competitive debut", "title_page": "Motherwell 1-2 Rangers: Graham Dorrans revels in 'dream' competitive debut - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Graham Dorrans hailed a \"dream\" start to his Rangers career after marking his competitive debut with a brace of goals in their 2-1 win at Motherwell.\nThe 30-year-old midfielder, who arrived at Ibrox from Norwich last month, scored in the fourth minute and then dispatched a second-half penalty.\n\"It was great for me personally, it's something I've always dreamed off since I was a kid,\" he told Rangers TV., external\n\"The goals were nice but it was more important to get the three points.\"\nDorrans revealed that Josh Windass, who impressed with several surging runs forward and twice hit the woodwork, wanted to take the second-half penalty awarded after Louis Moult elbowed Fabio Cardoso in the neck.\n\"Josh wanted to take it, but [Rangers assistant coach] Helder (Baptista) spoke to me before the game and said I was to take it, so I wasn't going to let him have it,\" he added.\n\"It was a difficult game for us but we managed to hang on in the end. We controlled the game in the first half, we played some good stuff.\n\"We spoke before the game that it was important to get off to a good start. I thought we did that in the game as well. We played really well in the first half without finding that killer pass in the final third. But we're a new team, I'm sure that'll come.\"\nRangers boss Pedro Caixinha praised Dorrans, a boyhood fan of the club, for the start to his Ibrox career.\n\"I am really happy for him,\" said the Portuguese. \"He is really a Rangers supporter and is really passionate about the club, so I'm really happy that his debut could give us the two goals that lead us to take three points back home.\"\nDespite Windass' lively forays down the left flank, Caixinha warned the former Accrington Stanley playmaker that he must not neglect his defensive responsibilities.\n\"Normally people only see the game on the brighter side,\" Caixinha said. \"Did you see who didn't get on the wall when we conceded the equaliser? Did you see who lost the ball in the second half and we almost got caught on transition?\n\"Josh is a player who needs to have more confidence - and they all have that - but he needs to learn with the process. It is not only about the bright things. You have to be switched on all the time.\"\nThose reservations aside, Caixinha said his main objective had been met.\n\"Winning was the only goal coming here and the boys did it so I need to be happy with that,\" he added. \"Now we have just 37 more finals.\"", "url": "https://www.bbc.com/sport/football/40844489"}