{"authors": ["Adonis Storr", "www.facebook.com"], "date_download": "2025-05-21 03:53:29", "date_modify": "2025-05-21 03:53:29", "date_publish": "2025-04-07 09:00:55", "description": "Leeds United fan writer Adonis Storr discusses how the families of Christopher Loftus and Kevin Speight keep their memory alive, 25 years since their deaths.", "filename": "sport_football_articles_c24q1p2pn0vo_1747799609.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f0b4/live/af00bbb0-138e-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c24q1p2pn0vo_1747799609.html", "title": "Opinion - Chris and Kev's memory kept alive, 25 years on - BBC Sport", "title_page": "Leeds United: Opinion - Chris and Kev's memory kept alive, 25 years on - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Last weekend marked a milestone in the memories of Christopher Loftus and Kevin Speight. It has been 25 years since they left to watch Leeds United in the Uefa Cup semi-final first-leg against Galatasaray in Istanbul, and never came home.\nThe banners unfurled at Leeds' last two games bore the words \"25 years\" and \"Never forgotten\".\nBoth family and friends of Chris and Kev attended a memorial last Thursday to mark the occasion, and spoke movingly. They have always maintained that the rumours that Leeds fans had been the cause of the violence, were completely false.\nChris' brother Andy Loftus told The Daily Telegraph, external: \"People don't really understand what happened that night – they always believe the lies that we did something wrong.\"\nIn 2004, West Yorkshire coroner David Hinchliff returned verdicts of unlawful killing and found the local police had been \"not in control of the situation and ill-prepared\" and that the attack had been \"pre-planned and orchestrated\".\nThe details of that horrific night, as told by witnesses, never get easier to hear. It is a moment in time that for Leeds fans you just cannot \"move on\" from.\nSome amount of justice was eventually found when four men were sentenced over the killings in 2010. And family, friends and the fanbase have found catharsis in charity fundraisers.\nTo mark the 10th anniversary, £140,000 was raised for children's cancer charity, the Candlelighters Trust.\nThe families of Chris and Kev have brought the football community together again to raise a further £25,000 this year – a thousand pounds for each year that has passed.\nIn a joint statement to mark the occasion the families said: \"We cannot change history but what we have done is to keep their memories alive, do good things for great charities in their name and make sure that both Chris and Kev are never forgotten.\"", "url": "https://www.bbc.com/sport/football/articles/c24q1p2pn0vo"}