{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:21:23", "date_modify": "2025-05-21 07:21:23", "date_publish": "2025-04-01 00:00:00", "description": "Jorgen Strand Larsen makes it three goals in two games as Wolverhampton Wanderers beat West Ham United to move further away from the relegation zone.", "filename": "sport_football_live_cn0j028w1j5t_1747812083.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/30cd/live/97808890-0f32-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cn0j028w1j5t_1747812083.html", "title": "Wolves 1-0 West Ham: Jorgen Strand Larsen strike earns Wolves win", "title_page": "Wolves 1-0 West Ham: Jorgen Strand Larsen strike earns Wolves win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jorgen Strand Larsen made it three goals in two games as Wolverhampton Wanderers beat West Ham United to move further away from the relegation zone.\nThe Norway striker sat out the international break with a fractured hand, but returned to record a 10th Premier League strike this season.\nWith Wolves talisman Matheus Cunha still suspended, the 25-year-old Strand Larsen converted just inside the penalty area in the 21st minute following a mazy run from Joao Gomes, albeit with the help of a slight deflection off West Ham's former Wolves defender Max Kilman.\nThe hosts came close to doubling their lead five minutes later following another Gomes surge and run from Strand Larsen, but Marshall Munetsi's snatched effort crashed off the crossbar.\nWest Ham never really got going in the first half, although Evan Ferguson - making his first start for the club since his January loan move from Brighton - should have converted Jarrod Bowen's cut-back at the far post 13 minutes in.\nBoss Graham Potter made three changes at half-time with Carlos Soler, Niclas Fullkrug and Edson Alvarez all introduced, and the visitors immediately offered more of an attacking threat.\nGerman forward Fullkrug - returning from a hamstring injury that had kept him out since early January - almost made an instant impact, but sliced his finish horribly off target after finding himself behind the Wolves backline.\nThe Hammers continued to probe and dominate possession, forcing the home side to play on the break, and Strand Larsen fired narrowly wide from a Matt Doherty pull-back after a fast counter-attack.\nWest Ham thought they deserved a penalty when Doherty appeared to catch Fullkrug in the face with a high boot, but a video assistant referee (VAR) check upheld referee Tony Harrington's on-field decision.\nThey went agonisingly close again when Fullkrug hit the bar with a towering header, although the offside flag would have ruled it out.\nMidfielder Tomas Soucek should have levelled when played through on goal in the 90th minute, but he dragged his effort wide with only keeper Jose Sa to beat.\nWolves had a chance to wrap up the success on the break, but Munetsi prodded wide after Strand Larsen played him in.\nA fourth home victory of the season moved Vitor Pereira's side 12 points clear of the relegation zone, although they remain 17th in the table and five points behind West Ham.\nThe Hammers missed the opportunity to move above Everton and Tottenham Hotspur for the night.\nWhat did you make of Wolves' performance?\nHow do you think West Ham played?\nWest Ham have certainly improved under boss Potter, but this was another limp performance and characteristic of a team with little left to play for this term.\nThe Hammers have won four of their 10 league games since he replaced Julen Lopetegui, but more concerning has been their struggle in front of goal.\nSince Potter's first game in charge, no side has averaged fewer shots-per-game in the Premier League than West Ham (9.3), while only Leicester (2) and Ipswich (8) have scored fewer goals than the Hammers (9).\nThe injury absences of Michail Antonio, Crysencio Summerville and Fullkrug certainly haven't helped, so the return of the latter was good news for Potter.\nThe German striker made a significant impact after three months out, hitting the woodwork and providing an outlet for his side's balls forward.\nWest Ham looked far more dangerous with him on the pitch but, after two lengthy spells on the sidelines this season, the challenge will be to keep the 32-year-old fit to see if he can help address their problems up front.", "url": "https://www.bbc.com/sport/football/live/cn0j028w1j5t"}