{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:57:57", "date_modify": "2025-05-21 05:57:57", "date_publish": "2025-01-31 13:42:38", "description": "Everton vs Leicester: Ruud van Nistelrooy on how to build off win at Spurs", "filename": "sport_football_articles_c75zve4l3ero_1747807077.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5912/live/ff903150-dfd6-11ef-a819-277e390a7a08.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c75zve4l3ero_1747807077.html", "title": "Everton vs Leicester: Ruud van Nistelrooy on how to build off win at Spurs", "title_page": "Everton vs Leicester: Ruud van Nistelrooy on how to build off win at Spurs - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ruud van Nistelrooy hopes Leicester can build on the foundations laid last weekend as they travel to Everton on Saturday.\nThe Foxes beat Tottenham on Sunday to move one point outside the relegation zone. Victory at Goodison Park would also bring the Toffees back within a win of Leicester and Van Nistelrooy is keen to carry on where they left off at Spurs.\n\"I think one thing was our defensive shape and organisation - the way we worked together to stop Tottenham playing,\" he said. \"On that foundation we built a result and we were capable to score our goals and make the difference.\n\"Against Spurs, you saw a very well-organised team that defended well, was very compact and also on the ball we showed what we can do away from home against a team like that.\n\"Of course, momentum is when you celebrate a deserved win. [It was also] three points that we can add to our total, which [gives] the energy, confidence and momentum we want to keep going.\n\"We're in the middle of that progression, of that development. Results and performances have been talked about a lot and rightly so.\"", "url": "https://www.bbc.com/sport/football/articles/c75zve4l3ero"}