{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:08:51", "date_modify": "2025-05-21 07:08:51", "date_publish": "2025-03-30 12:28:07", "description": "Slovenia's Primoz Roglic seals his second Volta a Catalunya title in three years with victory in the seventh and final stage in Barcelona.", "filename": "sport_cycling_articles_czd3p0zp0evo_1747811331.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0b21/live/de3af210-0d5d-11f0-8cb6-ef080be5aa48.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cycling_articles_czd3p0zp0evo_1747811331.html", "title": "Volta a Catalunya: Primoz Roglic wins second title on final stage in Barcelona", "title_page": "Volta a Catalunya: Primoz Roglic wins second title on final stage in Barcelona - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Slovenia's Primoz Roglic sealed his second Volta a Catalunya title in three years with victory in the seventh and final stage in Barcelona.\nRoglic, who won the Volta in 2023, finished 14 seconds clear of Belgian duo Laurens de Plus and Lennert van Eetvelt over the 88km route.\nThe 35-year-old Red-Bull-Bora-Hansgrohe rider started the final stage one second behind Juan Ayuso in the general classification, but finished the race 28 seconds ahead of the Spaniard.\n\"Beautiful - I had great fun here,\" said Roglic.\n\"I figured it out, I'm ready, the legs are ready so I was pretty much enjoying this week.\n\"A bit of holidays and then slowly start to build up towards the Giro [d'Italia].\"\nBritain's Simon Yates finished eighth in the final stage, 19 seconds behind Roglic, and ninth in the general classification, one minute 46 seconds adrift.\nBritish teenager Matthew Brennan, 19, lit up the early part of the week-long race, sprinting to his first World Tour victory in the opening stage before following up with his second win in another sprint finish on stage five.\nElsewhere, Netherlands' Lorena Wiebes defended her Gent-Wevelgem title, winning the women's race in Belgium for her 100th career victory.\nDenmark's Mads Pedersen, who won the men's race, also successfully defended his Flanders Field crown from last year.", "url": "https://www.bbc.com/sport/cycling/articles/czd3p0zp0evo"}