{"authors": ["Chris Wise", "www.facebook.com"], "date_download": "2025-05-21 07:17:44", "date_modify": "2025-05-21 07:17:44", "date_publish": "2025-05-20 09:56:15", "description": "Brighton news: Fabian Hurzeler hands debut to Harry Howell", "filename": "sport_football_articles_ckgxx12wgklo_1747811864.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/af69/live/0cf7dc90-3558-11f0-b7a7-db7402bc2830.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ckgxx12wgklo_1747811864.html", "title": "Brighton news: Fabian Hurzeler hands debut to Harry Howell", "title_page": "Brighton news: Fabian Hurzeler hands debut to Harry Howell - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Amongst the chaos of a win over the champions on Monday night, Brighton handed a debut to their youngest ever Premier League player.\nStep forward 17 year old Harry Howell. And what trust Fabian Hurzeler must have in Howell to put him into a situation like that. I asked Hurzeler about him afterwards, and he called the teenager a \"special\" player, who had really impressed in training. For the Brighton manager, age is no barrier.\nThis has been a meticulous, well-thought out plan by Brighton to get Howell some Premier League minutes before the end of the season. It might be a new name to anyone outside the walls of the Amex Stadium, but Howell has been training with the first-team for a couple of months now. Internally, they feel like he is destined for a very bright future.\nWhen Howell came off the bench with his cousin Jack Hinshelwood, it was 2-2. A minute later, Howell was almost stood next to Hinshelwood when he popped in the winning goal. Maybe it was purely coincidental, but Hurzeler's decision to send Howell on with Hinshelwood felt deliberate to me. A familiar face to settle the nerves perhaps?\nHowell reminded me a bit of when Tyler Dibling burst onto the scene at the start of the season for Southampton. There are similarities in style and self-belief.\nHe's been in tremendous form for the Brighton Under-21s this season, and has an excellent grounding in his dad, Jamie. He was a youngster with Arsenal and part of their team that won the FA Youth Cup in 1994.\nBrighton's reputation for developing players means the teenager is in very good hands.", "url": "https://www.bbc.com/sport/football/articles/ckgxx12wgklo"}