{"authors": ["Sami Mokbel", "www.facebook.com"], "date_download": "2025-05-21 05:57:29", "date_modify": "2025-05-21 05:57:29", "date_publish": "2025-04-01 17:11:03", "description": "Two Queens Park Rangers academy players accused of voyeurism are no longer under investigation, police confirm.", "filename": "sport_football_articles_c9qwv3dyvleo_1747807049.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1e67/live/fb68b9c0-0f20-11f0-acc1-239a761fa7cf.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c9qwv3dyvleo_1747807049.html", "title": "QPR: Two academy players no longer being investigated for voyeurism, say police", "title_page": "QPR: Two academy players no longer being investigated for voyeurism, say police - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Two Queens Park Rangers academy players accused of voyeurism are no longer under investigation, police have confirmed.\nIn a statement issued to BBC Sport, a spokesman for the Championship club said the players \"maintained their innocence throughout\" and were looking forward to \"continuing to focus on their careers\".\nThe footballers, both in their late teens, were detained following a report of a crime at a nightclub in Kingston, south west London, on 5 February.\nAt the time, the Metropolitan Police confirmed the pair's arrest while QPR also verified that they were aware of the allegations.\nPolice officers arrested the two players at the club's training ground in Hounslow on 27 February.\nA Metropolitan Police statement read: \"On Thursday 27 February, police arrested two men in their late teens on suspicion of voyeurism.\n\"This follows a report of an incident which took place at a nightclub in Kingston on Wednesday 5 February.\n\"Both suspects were taken to a police station and were subsequently bailed pending further enquiries.\n\"Following a thorough investigation, both men have been informed that no further action will be taken.\n\"The victim has been informed.\"\nA QPR statement read: \"Queens Park Rangers Football Club can confirm the Metropolitan Police have concluded their investigation into this matter and have confirmed there is no action to be taken.\n\"The club expresses its gratitude to the Metropolitan Police for their thorough approach to the process.\n\"The academy players, who maintained their innocence throughout, look forward to putting this behind them and continuing to focus on their careers.\"", "url": "https://www.bbc.com/sport/football/articles/c9qwv3dyvleo"}