{"authors": ["Aled Williams", "www.facebook.com"], "date_download": "2025-05-20 11:58:30", "date_modify": "2025-05-20 11:58:30", "date_publish": "2023-08-06 09:51:08", "description": "Wrexham's first game back in the EFL for 15 years ends in disappointment but the future is bright.", "filename": "sport_football_66419121_1747742310.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3062/production/_130668321_gettyimages-1578446979.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66419121_1747742310.html", "title": "Welcome to Wrexham, welcome to League Two: Dons defeat dents Dragons' return", "title_page": "Welcome to Wrexham, welcome to League Two: Dons defeat dents Dragons' return - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It was a miserable, wet day that heralded Wrexham's long awaited return to the Football League - not the weather you would expect for the opening day of the season in August.\nMaybe it was a forewarning of what was to come.\nBut pre-match, as the fans hurriedly made their way down Mold Road and along Crispin Lane towards the Stok Racecourse, nothing was going to dampen their spirits.\nTheir mood was in contrast to that of supporters arriving at the famous old ground the last time it hosted a Football League game in April 2008.\nThere was a funerial atmosphere that day, with the fans having already accepted their fate as their team fell to defeat to Accrington Stanley and left contemplating life in English football's fifth tier.\nNo one could have predicted how long they would have to wait to return.\nSaturday, 5 August 2023 is a day supporters of the north Wales club had been waiting 15 years for, a day many had feared would never come given the club's trials and tribulations in non-league football.\nThe financial worries, multiple play-off heartache and even flirting with relegation will not be forgotten - but now Wrexham can move on.\nWrexham's first game back in the EFL would have been a sell-out even without the added storyline of the Hollywood owners Ryan Reynolds and Rob McElhenney and the Disney+ documentary.\nFor the co-owners, like many North America sports fans, the concept of promotion and relegation is as Reynolds described it \"like nothing else\".\nPromotion and relegation had brought Wrexham and MK Dons together on the opening day of the League Two season.\nWrexham won last season's National League title in record-breaking style and with it promotion, while at the same time MK Dons suffered relegation from League One.\nThe sides had last met during the 2007-2008 season, at the end of which Wrexham suffered the relegation that would cast a shadow over them for so long.\nDons won the League Two title that campaign and reached the heights of the Championship for a season - Wrexham's co-chairmen have ambitions to go even higher than that.\nThey have already experienced plenty of highs and lows during their time at the club and Saturday's game was a reminder once again that they are in for another rollercoaster season.\nWelcome to League Two, Wrexham.\nWrexham's performance was laboured against a slick and organised MK Dons outfit and the atmosphere felt flat at times, even though there were brief moments to excite the sell-out crowd.\nManager Phil Parkinson described the defeat as a \"reality check\" and with fellow promoted side Notts County also losing, it was a stark reminder of the new challenges that await over the course of the season.\nThere may have been dark clouds overhead after this opening defeat, but the dark clouds which troubled this historic club for so many years have finally lifted.", "url": "https://www.bbc.com/sport/football/66419121"}