{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:27:33", "date_modify": "2025-05-19 15:27:33", "date_publish": "2017-08-19 08:50:11", "description": "World champion Elise Christie wants to make amends for her Sochi disqualification by winning at the Winter Olympics in Pyeongchang.", "filename": "sport_winter-sports_40980896_1747668453.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/127E/production/_97443740_gettyimages-835012002.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_winter-sports_40980896_1747668453.html", "title": "World champion speed skater Elise Christie chases Olympic redemption", "title_page": "World champion speed skater Elise Christie chases Olympic redemption - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Triple world champion Elise Christie says she wants to make amends at the 2018 Winter Olympics in Pyeongchang.\nThe short-track speed skater was disqualified from each of her three events at the Sochi 2014 Olympics.\nAnd the Scot, 27, who in March became the first British woman to win a world speed skating title, is out to put that behind her in South Korea.\n\"Part of me does need it, with what happened in Sochi and to get redemption for the mistakes I made,\" she said.\n\"I definitely want it more than anything else.\n\"I still have a few things I need to work on to perfect things going into the Games, but it mainly is just about the Olympics.\n\"I don't want to give everything I've got at the qualifiers. I want to save something so they can't analyse my performance and they don't know exactly how strong I am right now.\n\"I want to get a really good ranking of course, but for me it's about a really good performance at the Games, and to give them something they've not seen before.\"\nChristie became triple world champion at the World Short Track Speed Skating Championships in Rotterdam earlier this year.\nBut she revealed winning the overall European Championship short-track speed skating title in the same venue as her Sochi disappointment was the initial hurdle to get over.\n\"The first thing was being European Champion in Sochi [in January 2016], which tackled it head on,\" Christie added. \"And to have that little bit of success at the new Olympic venue [at the ISU World Cup event at Gangneung, South Korea] was a total restart for me.\n\"I was against the favourite, Choi Min-jeong - the previous world champion - and I managed to beat her in her home ground.\n\"I've got the upper hand in a way, it felt really good. I'm just so excited to get back out there.\"", "url": "https://www.bbc.com/sport/winter-sports/40980896"}