{"authors": ["Emma Sanders", "www.facebook.com"], "date_download": "2025-05-20 12:08:56", "date_modify": "2025-05-20 12:08:56", "date_publish": "2023-08-05 11:01:48", "description": "Manchester United captain Katie Zelem thought her \"World Cup dream was over\" in April when she was not called up for England.", "filename": "sport_football_66414093_1747742936.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/B122/production/_130664354_gettyimages-1585110146.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66414093_1747742936.html", "title": "Women's World Cup 2023: Katie Zelem thought dream with England was over", "title_page": "Women's World Cup 2023: Katie Zelem thought dream with England was over - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester United captain Katie Zelem thought her World Cup dream was over in April when she was not called up for England's final pre-tournament camp.\nZelem, 27, made her first start for England in her ninth appearance as they beat China 6-1 in their final group game in Adelaide on Tuesday.\nShe was one of six midfielders named in the 23-player squad on 31 May.\n\"That was one of the hardest moments to take, especially following the Euros when I wasn't selected,\" said Zelem.\n\"When I found out I wasn't picked for the April camp I actually thought was my World Cup dream was over. There was not another camp before the selection.\n\"For a couple of days I really thought that I'd worked so hard all season and it was just not meant to be.\n\"We had some really important games at Manchester United, fighting for the league title and the FA Cup final, and I think that really helped shift my focus to just being the best I could for my club.\"\nZelem, who missed out on selection for Euro 2022 despite being named in the preliminary squad, said \"it just feels world's apart\" in Australia.\n\"The girls were talking a few days ago about how it was a year to the day since winning the Euros,\" added Zelem.\n\"That was a year to the day of me sat watching them win the Euros. Football can change so quickly and in my case it really has.\"\nEngland take on Nigeria in the last 16 on Monday having picked up three wins in the group stages against Haiti, Denmark and China.\nTwo-time champions Germany, Olympic champions Canada and South American champions Brazil were all knocked out in the group stages.\n\"We certainly don't want go home next week. I think we all know what our end goal is and [being here for] three more weeks is our aim,\" added Zelem.\nWhile Zelem remains focused on matters on the pitch, the Lionesses have been keeping themselves entertained off it.\nThe DJ-ing responsibility has fallen on Zelem's shoulders and she revealed on Saturday that a few members of the squad have formed a girl band called the 'Meringue-tangs'.\n\"No wonder I wasn't that nervous [on Tuesday], it's harder being on the bus picking the songs!\" joked Zelem.\n\"There's a lot of people to keep happy. Everyone's chirping in. But I think, 'you know what girls, I'm the DJ, don't tell the DJ what to do'.\n\"We have some singers - Rachel Daly and Millie Bright - who tell us we've formed a girl band. It's Daly, Bright, Keira [Walsh] and me - and we're called the 'Meringue-tangs'.\n\"I'm not sure why - but I think we just had meringues for dessert one night! You don't want to hear us because we're a little tone deaf.\"\nAmong the Meringue-tangs' playlist is Sister Sledge's classic 'We Are Family', Natasha Bedingfield's 'Unwritten' and some of Whitney Houston's greatest hits.\n\"We've opened the auditions up to the rest of the bus but we're yet to receive any [applications],\" said captain Bright.\n\"We're trying to get Georgia [Stanway] in but, you know, we're not Beyonces. We can't really sing! But we have a laugh. To be fair, every day on the way to training, we always put a sing-song on.\n\"We like to think we hit a few decent notes. We all bring a different variety so it's good.\n\"There's not actually a reason why it was 'Meringue-tangs' but it just came up at one of the meals. From that day it stuck so you might see us on Britain's Got Talent one day - or you might not.\"", "url": "https://www.bbc.com/sport/football/66414093"}