{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:12:57", "date_modify": "2025-05-21 07:12:57", "date_publish": "2025-02-08 09:00:26", "description": "Celtic aim to land Danish striker for next season, with Rangers encouraged to go after Hearts centre forward.", "filename": "sport_football_articles_cq6g12dzdgmo_1747811577.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4f80/live/cdcbb980-e5fa-11ef-a819-277e390a7a08.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cq6g12dzdgmo_1747811577.html", "title": "Celtic start work on summer move for Kvistgaarden - gossip", "title_page": "Celtic start work on summer move for Kvistgaarden - gossip - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Celtic have begun working on a deal to sign Brondby striker Mathias Kvistgaarden in the summer. (Football Insider), external\nThe decision to sell Kyogo Furuhashi without a replacement striker lined up was an \"unnecessary risk\" and \"a major disappointment\", says former Celtic player and pundit Chris Sutton. (Daily Record), external\nDavid Strelec, linked with Celtic last month, was given \"permission to transfer for a while\", says Slovan Bratislava manager Vladimir Weiss, before adding: \"then it stopped and then it didn't happen.\" (Scottish Sun) , external\nFormer Ibrox favourite Derek Ferguson has a \"sneaky feeling\" Rangers will rekindle interest in Hearts striker Lawrence Shankland, arguing a freedom of contract move makes sense. (Go Radio via Daily Record, external)\nManager Simo Valakari, says there is no end in sight for Uche Ikpeazu's injury nightmare at St Johnstone as the striker, who is yet to play for the Perth club, has a third operation since joining in June. (The Courier), external\nA deadline day move from Aberdeen to Nottingham Forrest for 16-year-old defender Lewis Carrol collapsed due to administrative issues as the Premier League club failed to secure the necessary Fifa clearance. (Press & Journal), external", "url": "https://www.bbc.com/sport/football/articles/cq6g12dzdgmo"}