{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:48:09", "date_modify": "2025-05-20 13:48:09", "date_publish": "2023-08-01 00:00:00", "description": "Watch live coverage and follow text and radio commentary as defending champions Trent Rockets host Southern Brave in the opening game of the 2023 Men's Hundred.", "filename": "sport_live_cricket_66305876_1747748889.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/16121/production/_130610409_gettyimages-1585890743.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_cricket_66305876_1747748889.html", "title": "The Hundred 2023 LIVE: Watch Trent Rockets vs Southern Brave in men's competition plus score, commentary, video highlights & updates", "title_page": "The Hundred 2023 LIVE: Watch Trent Rockets vs Southern Brave in men's competition plus score, commentary, video highlights & updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Join us on Wednesday...\nThat was a cracking start to The Hundred - and the good news is there is a veritable feast of matches to gorge yourself on tomorrow with a double helping of double headers.\nWelsh Fire face Manchester Originals men's and women's sides in Cardiff while their counterparts at London Spirit and Oval Invincibles also do battle at Lord's.\nOur live-text commentary of the matches begins at 11:15 BST on Wednesday.\nThere is also live television coverage of London Spirit vs Oval Invincibles men's match at 18:15 on BBC Two for your viewing pleasure.\n'It was frustrating to lose'\nSouthern Brave bowler Tymal Mills to BBC Two: \"It was a frustrating one, it's always tough to lose, especially a tight game. Credit to them, they bowled well in the powerplay. CJ almost bought us home, but a really frustrating one to lose.\"\nOn the tight contest: \"It wasn't one of those games where it was raining fours and sixes, but when you see tight games and close pressure, those are great to watch.\"\nBeing back at The Hundred after missing most of last season: \"Pretty gutted to miss it last year after enjoying the first year. Fit and firing tonight, we will dust ourselves down for the next one.\"\n'Hain was fantastic'\nTrent Rockets captain Lewis Gregory on BBC Two: \"The boys were fantastic and what a game to start The Hundred. The crowd was rocking and that really helped us. Thankfully we got over the line.\n\"We've had amazing support over the past couple of years and that was no different. The crowd makes a difference in close games like that.\n\"As bowlers we knew we just had to hit the pitch as hard as we could because there was some nice movement out there and it wasn't the easiest to start your innings on.\n\"I just backed my instincts when I was bowling but I thought we were a bit under par with the bat.\n\"Sam Hain played fantastically to get us up to a total that we felt we could defend.\n\"It's the first time we've had to bring the fielder in at the end, so I'd rather not have to do that again! Hopefully we can get round a bit quicker next time.\"\nPost\nMichael Vaughan\nFormer England captain on BBC Two\nWhen you win a game even when you're not at your best, and you get over the line when you're not favourites, that gives you a lot of confidence as a side.\nLewis Gregory has led them brilliantly tonight and his bowlers have backed him up.\nSouthern Brave will be disappointed. Their batting should have enough in the tank to be able to chase that score.", "url": "https://www.bbc.com/sport/live/cricket/66305876"}