{"authors": ["Nick Mashiter", "www.facebook.com"], "date_download": "2025-05-21 07:43:26", "date_modify": "2025-05-21 07:43:26", "date_publish": "2025-01-13 17:01:59", "description": null, "filename": "sport_football_articles_cvge7m25yn5o_1747813406.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b4cd/live/60ffa7d0-d1c3-11ef-9f8b-6138f0924d77.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cvge7m25yn5o_1747813406.html", "title": "Nottingham Forest news: Wayne Hennessey signs short-term contract", "title_page": "Nottingham Forest news: Wayne Hennessey signs short-term contract - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wayne Hennessey has signed a short-term deal to keep him at Nottingham Forest until the end of the season.\nThe goalkeeper's contract initially expired last summer but he has stayed on at the club while he recovers from a serious Achilles injury.\nHennessey, 37, made nine appearances for Forest after joining on a free transfer from Burnley in 2022 and could be included in the 25-man Premier League squad, with third-choice Aaron Bott sidelined by a knee injury.\nBoss Nuno Espirito Santo said: \"He has signed a contract. He is with us and it is a pleasure to have him around. He has experience and, with the way he goes about things... he is a really good person to have around. I am very happy.\n\"Wayne had a serious injury at the end of last season, to his Achilles. It was a tough moment for everyone but he is a big part of things for us, within the small group that is our goalkeeper community.\n\"He helps Matz Sels, [Carlos] Miguel and Aaron with their work. Aaron, unfortunately, is going to be out for two or three months with a knee injury.\n\"I call the small group of goalkeepers the 'society'. Wayne is a big part of that community.\n\"We have to finish the end of the transfer window. We might need him. We will see if there is a place in the 25 for him.\"", "url": "https://www.bbc.com/sport/football/articles/cvge7m25yn5o"}