{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:05:20", "date_modify": "2025-05-21 05:05:20", "date_publish": "2025-01-14 21:10:44", "description": "Chelsea set price for Christopher Nkunku, Arsenal chase Martin Zubimendi, and Marcus Rashford favours a move to Barcelona.", "filename": "sport_football_articles_c360pyw7143o_1747803920.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d6aa/live/5f8f58a0-d2b8-11ef-94cb-5f844ceb9e30.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c360pyw7143o_1747803920.html", "title": "Football gossip: Nkunku, Zubimendi, Muani, Rashford, Garnacho, Mainoo, Messi", "title_page": "Football gossip: Nkunku, Zubimendi, Muani, Rashford, Garnacho, Mainoo, Messi - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Chelsea set price for Christopher Nkunku, Arsenal are chasing Martin Zubimendi, and Marcus Rashford favours a move to Barcelona...\nChelsea will want a £65m fee for striker Christopher Nkunku, 27, amid interest from Bayern Munich, with the France international reportedly unhappy at Stamford Bridge. (Athletic), external\nArsenal are in advanced talks to sign Real Sociedad and Spain midfielder Martin Zubimendi, 25, in a £51m summer deal. (Mail), external\nMarcus Rashford, 27, would prefer a move to Barcelona ahead of other options this month should the forward leave Manchester United. (Sport - in Spanish, external)\nManchester United's rivals are waiting to pounce on January deals for England duo Rashford and Kobbie Mainoo, 19, and Argentina forward Alejandro Garnacho, 20, as they anticipate co-owner Sir Jim Ratcliffe wanting to avoid frantic profit and sustainability rules sales on 30 June to stay within financial rules. (Telegraph), external\nJuventus are closing in on a loan deal for 26-year-old Paris St-Germain and France forward Randal Kolo Muani. (Gazzetta dello Sport - in Italian), external\nArgentina forward Lionel Messi, 37, could rejoin Barcelona on loan during the Major League Soccer off-season once he signs a new contract with Inter Miami. (El Nacional - in Spanish), external\nLiverpool have rejected a £70m bid from Saudi Arabian club Al-Hilal for Uruguay striker Darwin Nunez, 25. (Anfield Watch), external\nWest Ham are interested in signing Portugal striker Andre Silva, 29, on loan from RB Leipzig for the remainder of the season. (Guardian), external\nAston Villa have rejected a bid in the region of £40m from West Ham for 21-year-old Colombia striker Jhon Duran. (Talksport), external\nLiverpool are keen on Nurnberg striker Stefanos Tzimas, 19, with the Greek forward potentially available for about £20m and also attracting interest from Chelsea, Brighton and Aston Villa. (Sky - in German), external\nManchester United are among the clubs considering £40m-rated Japan and Parma goalkeeper Zion Suzuki, 22. (Talksport), external\nArsenal and Italy midfielder Jorginho, 33, whose contract expires in the summer, is a target for Brazilian club Flamengo. (Sky Sports), external\nFrance centre-back Axel Disasi, 26, is the latest player who could be heading out of Chelsea due to a lack of game time. (Mirror), external\nNewcastle have been looking at 27-year-old England and AC Milan centre-back Fikayo Tomori. (Football Insider), external\nCeltic are one of several clubs interested in signing Aston Villa's English striker Louie Barry, 21, on loan, but the Premier League side are assessing their options. (Sky Sports), external\nWest Ham are in talks with Marseille over a deal for 22-year-old French forward Elye Wahi. (ESPN), external\nThe Hammers have also added Nurnberg's Finn Jeltsch, 18, to their wishlist for the summer but face competition from Premier League and Bundesliga clubs for the German defender. (Florian Plettenberg), external\nSaudi Pro League chief executive Omar Mugharbel says it is a \"matter of time\" before a club from the league signs Real Madrid and Brazil forward Vinicius Junior, 24. (Marca - in Spanish), external\nFormer Manchester United and Spain midfielder Ander Herrera, 35, is set to join Argentine club Boca Juniors from La Liga side Athletic Bilbao. (Fabrizio Romano), external", "url": "https://www.bbc.com/sport/football/articles/c360pyw7143o"}