{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:27:52", "date_modify": "2025-05-21 05:27:52", "date_publish": "2025-04-03 10:45:20", "description": "Jim Goodwin deserves 'enormous credit' for 'jack of all trades' Dundee United", "filename": "sport_articles_c17502p5780o_1747805272.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/50c4/live/afddd350-106f-11f0-b72e-6314f702e779.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c17502p5780o_1747805272.html", "title": "Jim Goodwin deserves 'enormous credit' for 'jack of all trades' Dundee United", "title_page": "Jim Goodwin deserves 'enormous credit' for 'jack of all trades' Dundee United  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Dundee United's \"jack of all trades\" nature has made for a \"really successful recipe\" in their return to the Scottish Premiership, says BBC Scotland pundit Rory Loy.\nAfter winning the second-tier title last term, manager Jim Goodwin has almost certainly led United to a top-six finish following Sunday's win at Ross County.\nFormer Dundee and St Mirren forward Loy hailed Goodwin's summer recruitment, which he feels made the Tannadice side ready-made for the top flight.\nWith a place in the top half all but secured, Loy feels United should now be targeting a European place.\nSpeaking on the BBC's Scottish Football Podcast, he said: \"Goodwin has managed to make really good signings in Sam Dalby, Luca Stephenson and Will Ferry, as well as having the likes of Ross Graham, Craig Sibbald and Ross Docherty in the team.\n\"They've built a really good squad. I've always described them this season as a kind of jack of all trades, master of none.\n\"I look at them and don't go, they're brilliant at that. But I also really struggle to look at them and think, well you're really poor at that.\n\"And that's made for a really successful recipe. I think Goodwin and the club, given where they were at, deserve enormous credit. There's absolutely no reason why they can't nick a European place.\"", "url": "https://www.bbc.com/sport/articles/c17502p5780o"}