{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:05:08", "date_modify": "2025-05-21 07:05:08", "date_publish": "2025-01-22 13:14:14", "description": "Blackburn midfielder Sondre Trondstad faces six weeks on the sidelines with a hamstring injury.", "filename": "sport_football_articles_cvg4v9vjz8po_1747811108.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/149f/live/75758050-d8c0-11ef-a303-a344a2a81285.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cvg4v9vjz8po_1747811108.html", "title": "Sondre Trondstad: Blackburn midfielder Sondre Trondstad out for six weeks", "title_page": "Sondre Trondstad: Blackburn midfielder Sondre Trondstad out for six weeks - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Blackburn boss John Eustace confirmed influential midfielder Sondre Tronstad is facing up to six weeks on the sidelines as the club battle a growing injury crisis.\nEustace could be without five first-choice players for the trip to face Bristol City this weekend with Tronstad out and Callum Brittain, Danny Batth, Aynsley Pears and Joe Rankin-Costello all doubtful.\nYet it is the absence of Tronstad which is worrying Eustace the most with the Norwegian midfielder sustaining a significant hamstring injury in last weekend's defeat against Oxford.\n\"We have had Sonny [Tronstad] scanned and he's going to be out for six weeks, unfortunately. He has been a magnificent performer for us and he'll be a big miss,\" Eustace told the club website, external.\nThe Rovers boss confirmed goalkeeper Pears has been battling illness while defenders Brittain and Batth sustained hamstring and thigh injuries, respectively, both limping out of Tuesday's 2-0 loss to Coventry.\nRankin-Costello completed 90 minutes against Frank Lampard's side but is now struggling with an ankle injury.\n\"It's challenging for the group, of course it is, but we all have to step up,\" said Eustace. \"There are lots of players who moan when they're not playing and now they have to step up, start and be the man in this competitive group.\n\"To have this many injuries isn't great, but they give opportunities to others.\"", "url": "https://www.bbc.com/sport/football/articles/cvg4v9vjz8po"}