{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:52:45", "date_modify": "2025-05-21 05:52:45", "date_publish": "2025-04-02 08:48:27", "description": "Rangers linked with Red Star's Ebenezer Annan - gossip", "filename": "sport_articles_c98geeq2r9go_1747806765.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c605/live/2d76c320-0f9f-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c98geeq2r9go_1747806765.html", "title": "Rangers linked with Red Star's Ebenezer Annan", "title_page": "Rangers linked with Red Star's Ebenezer Annan - gossip - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Rangers have been scouting left-sided Ghana defender Ebenezer Annan, but several other European clubs have been eyeing the 22-year-old who is under contract to Red Star Belgrade until the summer of 2027. (MaxBet Sport), external\nMontpellier centre-half Boubacar Kouyate, Liverpool left-back Owen Beck, Leeds United forward Joe Gelhardt and Ipswich Town striker Ali Al-Hamadi would be dream additions to Rangers' squad for next season along with an extended stay for winger Vaclav Cerny, according to AI tool Grok. (The Scotsman), external\nRangers will be in pole position to sign Vaclav Cerny permanently if and when their takeover by 49ers Enterprises is completed, but Wolfsburg could auction the 27-year-old Czech international if the Ibrox club do not take up their £5.5m option in time. (Football Insider), external\nAt £6.3m, fringe striker Danilo is the most valuable member of Rangers' squad, just ahead of new Belgium international midfielder Nicolas Raskin. (The Scotsman), external\nFormer Scotland forward Johnny Russell says his Rangers-supporting father would never have forgiven him if he had signed for Celtic before Derby County outbid the Glasgow club to take him from Dundee United. (Scottish Sun), external\nFormer Scotland midfielder James McArthur has revealed he is a lifelong supporter of Rangers but is relieved he never played for the Glasgow club for the sake of his family. (PLZ Soccer), external\nFormer Rangers winger Ryan Kent's football exile has ended having agreed to a short-term deal with MLS club Seattle Sounders after being released by Fenerbahce five months ago. (TalkSport), external\nRangers will struggle to lure highly-rated German head coach Marco Rose, who was sacked by RB Leipzig on Sunday, to the Ibrox club this summer. (Football Insider), external\nFormer Rangers manager Steven Gerrard is the bookmakers favourite to be their new manager this summer, just ahead of interim head coach Barry Ferguson and former Ibrox defender Russell Martin, with sacked RB Leipzig boss Marco Rose straight in at number four. (The Scotsman), external\nFormer Rangers manager Giovanni van Bronckhorst could be set to be the new technical director of former club Feyenoord. (Glasgow Times), external\nSan Francisco 49ers chief executive Jed York, talking amid 17-player exodus at the NFL club, has stressed that the process of acquiring Rangers is still in the early stages despite a deal being agreed in principle last month. (Glasgow Times), external\nSan Francisco 49ers chief executive Jed York's coy update has minimal bearing on consortium leader Andrew Cavenagh's plan to wrap up the deal to purchase Rangers this month. (Daily Record), external", "url": "https://www.bbc.com/sport/articles/c98geeq2r9go"}