{"authors": ["Ceri Coleman-Phillips", "www.facebook.com"], "date_download": "2025-05-21 06:21:33", "date_modify": "2025-05-21 06:21:33", "date_publish": "2025-03-31 15:06:48", "description": "A post-match TikTok dance involving England's Sarah Bern and Wales' Jasmine Joyce-Butchers has divided opinion.", "filename": "sport_rugby-union_articles_cly8ll0jry8o_1747808493.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c9df/live/37139b20-0e36-11f0-bfea-d170975f1d6a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cly8ll0jry8o_1747808493.html", "title": "Joyce-Butchers defends TikTok dance after heavy defeat", "title_page": "Women's Six Nations: Joyce-Butchers defends TikTok dance after heavy defeat - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jasmine Joyce-Butchers has defended her involvement in a post-match TikTok dance after Wales' heavy Six Nations defeat by England.\nThe Red Roses ran in 11 tries in front of a record Principality Stadium crowd of over 21,000 on Saturday.\nEngland prop Sarah Bern and Wales full-back Joyce-Butchers joined BBC Sport pundits for a live post-match interview and together performed a routine.\nBern had done something similar with England fans after last weekend's win against Italy in York which went viral.\nBut Joyce-Butchers' participation sparked backlash on social media after Wales had just lost by 55 points to their arch-rivals on home turf, with some calling it embarrassing and questioning the player's professionalism.\nBut the three-time Olympian was quick to defend her actions.\n\"If we don't love what we do, then why do it?\" she said on her Instagram.\n\"Yes I am upset, gutted, sad and disappointed with the result, but that doesn't mean I can't be happy, excited and smiling to see such an amazing crowd supporting us.\n\"Remember to be kind people and put your energy and effort into people who want and accept you for who you are.\"\nJoyce-Butchers' club Bristol Bears posted a message on Instagram in support of the player.\n\"As a club, we believe in empowering our players to express themselves authentically, both on and off the pitch,\" the statement said.\n\"Jasmine embodies the creativity, passion, and flair that makes Bears a special club.\n\"We are committed to growing rugby by encouraging players to show their personalities and celebrate their contributions to our sport.\"\nFormer Wales captain Siwan Lillicrap was involved in the dance and said she did not have a problem with it as it was more about celebrating the occasion.\n\"We've got to let people be themselves and be the personalities they are,\" she told the Scrum V podcast.\n\"I feel for Jaz, I think some of the abuse that she's getting is not very nice and not really called for.\n\"She doesn't need to sit in a dark room. We're seeing a personality, she's obviously friends with Sarah Bern, they play in Bristol together.\n\"Everyone is entitled to their opinion. What we've always got to remember is women are different to men first and foremost and everyone processes their emotions differently and reacts in different ways.\"\nRachel Taylor, another former Wales captain, said the dance was a \"difficult one\" to assess.\n\"It's just a bit of a strange response after a loss, but I just think their group mentality was to enjoy the day at the Principality and that's the sort of mood that they were in, but it's probably a strange one for some rugby fans,\" Taylor told BBC Radio Wales.\n\"The women's fans of the game are quite unique and quite different at times because of that relationship they have with the players, so it's probably a little bit more unusual from how the men's and women's rugby engage their fans.\n\"In the women's game the players have a unique opportunity to engage with the fans a lot closer and they really do share everything, they are so open on social media in terms of their personal lives and how they work.\"\nAnother former Wales captain, Ellis Jenkins, also weighed in on the discussion on Scrum V.\n\"My first thought was 'I'm not sure how I feel about that' because it's not something I would have done when I was playing,\" he said.\n\"You've just lost an international game, but I am also a big believer that rugby in general almost struggles to grow because it hangs on to these old school 'values'.\n\"If rugby in general is going to grow as a sport you have to celebrate these individuals... you look at Marcus Smith, Finn Russell, Louis Rees-Zammit and they all come with loads of haters.\"\nJenkins cited Ilona Maher's impact during her three-month stint at Bristol Bears, with one game having to move to Ashton Gate to accommodate demand for tickets to see the American superstar.\n\"She's probably not amongst the best players in the world either, but her profile is what grows the game,\" Jenkins said.\n\"The women's game and the men's game is different.\n\"When I actually thought about it [the dance], it doesn't change the outcome of the game. As long as all the players are going hammer and tongs in the game and are taking it seriously.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/cly8ll0jry8o"}