{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:28:12", "date_modify": "2025-05-21 07:28:12", "date_publish": "2025-03-28 13:17:17", "description": "Watford boss Tom Cleverley says goalkeeper Daniel Bachmann will have to \"be patient\" after returning following an ankle injury.", "filename": "sport_football_articles_c62k2zq4n07o_1747812492.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c7f2/live/4f33b880-0bd3-11f0-af58-ad3b17745e6c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c62k2zq4n07o_1747812492.html", "title": "Daniel Bachmann: Watford keeper must wait for chance after return from injury", "title_page": "Daniel Bachmann: Watford keeper must wait for chance after return from injury - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Watford boss Tom Cleverley says goalkeeper Daniel Bachmann will have to \"be patient\" after returning to fitness following an ankle ligament injury.\nThe Austrian was first-choice for Watford, making 22 appearances this season before suffering the injury near the end of their 2-1 defeat by Sheffield United on 4 January.\nIt prompted the Hornets to sign Norway's Egil Selvik from Udinese at the end of the transfer window and he has made a good impression with four clean sheets in eight games so far.\n\"Selvik's been fantastic since he came to the club, hand in hand with our defensive record improving a lot with James Abankwah and the change to a back four,\" Cleverley told BBC Three Counties Radio.\n\"I'm really pleased with what Selvik's done and the other two, Bachmann and (Jonathan) Bond, will have to be patient.\"\nWatford are five points outside the play-off places going into Saturday's lunchtime kick-off home game against Plymouth Argyle, with Abankwah suspended following his red card in the 1-0 defeat at Oxford United.\nCleverley is pleased there are no fitness issues affecting those players who have been away on international duty.\n\"We've had eight or nine away and it's unusual really because normally we have seven or eight playing all the games and all the minutes for their countries, but that wasn't the case this time,\" he said.\n\"Physically, it wasn't as demanding for the guys - there was a lot of long travels but they've all come back in good spirits, so I can uncross my fingers now.\"", "url": "https://www.bbc.com/sport/football/articles/c62k2zq4n07o"}