{"authors": ["Tyrone Smith", "www.facebook.com"], "date_download": "2025-04-26 03:39:40", "date_modify": "2025-04-26 03:39:40", "date_publish": "2025-03-05 11:09:41", "description": "Why Dundee United's enforced break comes at perfect time", "filename": "sport_articles_cjrylvrxzwgo_1745638780.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e8f1/live/d08ff3b0-f9b0-11ef-9e61-71ee71f26eb1.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cjrylvrxzwgo_1745638780.html", "title": "Why Dundee United's enforced break comes at perfect time", "title_page": "Why Dundee United's enforced break comes at perfect time - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "While Dundee United would love to be contesting the Scottish Cup quarter-finals this weekend, the enforced break has come at the perfect time.\nThey appeared a team running on empty in the later stages of their weekend draw with Aberdeen, throwing away a two-goal lead to draw 2-2.\nManager Jim Goodwin's post-match comments were telling. Three games in eight days \"took its toll on the players\" and they looked \"dead on their feet\".\nUnited are fifth in the table – just two points off third – a great achievement, and one that is even more impressive given they have had injuries to key players for large portions of the campaign.\nWill Ferry, Ross Docherty and Louis Moult are currently sidelined while Declan Gallagher went off during the first half at Pittodrie.\nGoodwin admitted influential midfielder Craig Sibbald – who recently returned from injury – was rushed back to make his first start in five months.\nThe stretched squad has been creaking lately and that is reflected in their recent form, just two wins in nine Premiership games.\nSo when you factor all this in, the hiatus is a chance for United to regroup – and more importantly recharge – before the business end of the campaign.", "url": "https://www.bbc.co.uk/sport/articles/cjrylvrxzwgo"}