{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:19:48", "date_modify": "2025-05-19 15:19:48", "date_publish": "2015-02-18 07:09:10", "description": "John Collins hails signing of Craig Gordon, Scots fans suffer ticket blow...", "filename": "sport_football_31515215_1747667988.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/75814000/jpg/_75814058_gossip_promo_sportfootball(2).jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31515215_1747667988.html", "title": "Wednesday's Scottish gossip", "title_page": "Wednesday's Scottish gossip - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Celtic assistant manager John Collins believes goalkeeper Craig Gordon - a free capture in the summer - will go on to be considered as good a signing for the club as icons Lubomir Moravcik and Henrik Larsson. (Various)\nRoberto Mancini, whose Inter Milan outfit face Celtic in the Europa League last 32 on Thursday night, is determined to lead his side to glory in the competition and the Champions League place that comes with it. (Daily Express)\nCeltic legend Tommy Gemmell cannot wait to catch up with some of the Inter players his side beat in the 1967 European Cup final, who will travel with the Italians for the Europa League match in Glasgow. (Daily Express)\nCeltic captain Scott Brown will miss the return leg of the Europa League tie if he picks up a booking in Thursday's first leg. (Various)\nFormer Hearts midfielder Pasquale Bruno says Inter Milan, and clubs in his Italian homeland in general, are so boring they put him to sleep. (Daily Record), external\nFormer Inter Milan star Benito Carbone wishes the Celtic-Inter match was the Europa League final. (Scottish Sun)\nPSV Eindhoven winger Zakaria Bakkali will cost Celtic £200,000 if they want to sign him in the summer, as the Dutch side are due a compensation fee even though the Belgian will be out of contract. (Daily Express)\nThe Rangers Fans Board expect to be \"disbanded and blacklisted\" by the club after revealing the minutes of a meeting they held with club chief executive Derek Llambias and director Barry Leach. (Daily Record), external\nDundee United assistant manager Simon Donnelly has refused to blame goalkeeper Radoslaw Cierzniak for the weekend defeat to Kilmarnock, despite his error in the 3-2 loss. (Daily Record)\nInverness Caley Thistle have taken striker Prince Rajcomar on trial as they search for a replacement for Billy McKay. (Daily Express)\nHamilton Academical have been given international clearance for new signing Nigel Hasselbaink. (Daily Record)\nSt Johnstone midfielder Murray Davidson admits his parents are scared to watch him in case he picks up another long-term injury. (Scottish Sun)\nKevin McHattie's return to action for Hearts has been put on hold after he was forced to pull out of an under-20s match as a precaution. (Daily Record)\nHibernian manager Alan Stubbs says giving midfielder Scott Robertson licence to attack has paid huge dividends for the club this season. (Scottish Sun)\nScotland fans will be handed just 3,500 tickets for the European Championship qualifying match against Republic of Ireland in Dublin in June. (Daily Record)", "url": "https://www.bbc.com/sport/football/31515215"}