{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:52:23", "date_modify": "2025-05-21 03:52:23", "date_publish": "2025-02-01 08:38:31", "description": "Antrim's Allianz Hurling League Division 1B home game with Westmeath on Sunday could prove crucial to their hopes of avoiding the drop to Division Two.", "filename": "sport_articles_cgq0zkx9de4o_1747799543.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2aa5/live/045f0890-e005-11ef-9fd1-4bb2cc41d064.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cgq0zkx9de4o_1747799543.html", "title": "Allianz Hurling League: Antrim's home contest with Westmeath live on BBC iPlayer", "title_page": "Allianz Hurling League: Antrim's home contest with Westmeath live on BBC iPlayer - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Antrim's Allianz Hurling League Division 1B home contest with Westmeath on Sunday, which will be live on the BBC iPlayer, could prove crucial to both sides' hopes of avoiding the drop to Division Two at the end of the campaign.\nLast weekend's defeat by Dublin was not a surprise in what was Davy Fitzgerald's first competitive game in charge of the Saffrons.\nHowever, the manner of the loss was a concern as Antrim suffered what selector Pat Bennett described as a 1-25 to 0-14 \"hiding\" at Croke Park.\nAntrim's performance indicated that the squad are having some difficulty in putting into practice Fitzgerald's preferred direct playing method which is marked different to the short-passing style favoured by previous boss Darren Gleeson.\nBennett had to undertake the media duties last weekend given that Fitzgerald was serving a one-match game for his contretemps during his final match change in charge of Waterford last summer.\nHowever, Fitzgerald will be back on the sideline at Corrigan Park as the Saffrons continue their long-standing rivalry with the Lake County.\nUnder previous boss, Antrim's most recent meetings saw the Saffrons maintain their Liam McCarthy Cup status in May 2023 as they earned a 4-24 to 1-19 Leinster Championship victory in Mullingar in what was Neil McManus final appearance for the county.\nHowever, Westmeath beat Antrim 2-18 to 1-15 in last year's League as the Saffrons lost all five of their Division 1 games.\nThe latest rejig to the league format meant the Saffrons maintained Division 1 status despite their losing run but there is genuine jeopardy in this year's Division 1B with the bottom two at season's end dropping to Division Two.\nAnd that makes Antrim's contests over the next two weekend particularly important as they then face Offaly away on 8 February before the two-week break prior to the home game Waterford, who will be huge favourites despite Fitzgerald's inside knowledge on the Deise men.\nAntrim's hopes of maintaining Division 1 hurling will surely go down to the final two fixtures as they play in Carlow on 2 March and host Laois a week later before sitting out the final round in the seven-team division as the other six sides are in action.\nWestmeath are under new management with Seoirse Bulfin having taken over from Joe Fortune this season but gauging their form is not easy after their scheduled home opener against Laois was postponed.", "url": "https://www.bbc.com/sport/articles/cgq0zkx9de4o"}