{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:45:39", "date_modify": "2025-05-21 06:45:39", "date_publish": "2025-03-30 16:42:42", "description": "Preston boss Paul Heckingbottom says the Lilywhites' run to the FA Cup quarter-finals should \"whet their appetite\" to improve further.", "filename": "sport_football_articles_cp31d4pzep3o_1747809939.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5647/live/838019a0-0d84-11f0-a1c5-cd0d1898b025.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cp31d4pzep3o_1747809939.html", "title": "Preston 0-3 Aston Villa: Paul Heckingbottom reaction after FA Cup exit", "title_page": "Preston 0-3 Aston Villa: Paul Heckingbottom reaction after FA Cup exit - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Lilywhites boss Paul Heckingbottom gave his reaction to BBC Radio 5 Live after Preston's 3-0 FA Cup quarter-final defeat by Premier League side Aston Villa:\n\"We would have found that a difficult game (if we) were at full strength - we were never going to win it with 11 so we needed the full squad to get any sort of game.\n\"We limited them in the first half and performed really, really well. We had the best chance in the first half, we started the second half in the same fashion and then within five minutes the game was gone from us - that's the difference between the Championship and Premier League.\n\"I felt today with what we had, we needed the first goal. We're all disappointed but proud of the performance - I think the fans enjoyed it, but we would have loved a different outcome.\n\"We were ready to make the changes when we were 1-0 down but then within a blink of an eye they got the second and it became a difficult afternoon then.\"\nOn the atmosphere at Deepdale: \"Fantastic - it was a great day for the fans. We've had some really good cup days and nights this season and it's the players that have earned that for the fans.\n\"We now want the fans back in the last few league games. It's been a good season in terms of cup competitions and we've been really consistent in the league.\n\"We know where we need to improve but from where we were and the negativity at the start of the season, I think we're in a good place - but this should whet the appetite to do better next season.\"", "url": "https://www.bbc.com/sport/football/articles/cp31d4pzep3o"}