{"authors": ["Alasdair Lamont", "www.facebook.com"], "date_download": "2025-04-26 08:10:03", "date_modify": "2025-04-26 08:10:03", "date_publish": "2025-02-26 12:31:01", "description": "'Deep thinkers' McCann and Dodds will be crucial to Ferguson", "filename": "sport_articles_c8rk52617vmo_1745655003.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/dc45/live/7c0b38a0-f43c-11ef-896e-d7e7fb1719a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_c8rk52617vmo_1745655003.html", "title": "'Deep thinkers' McCann and Dodds will be crucial to Ferguson", "title_page": "'Deep thinkers' McCann and Dodds will be crucial to Ferguson - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Phew! Even by Rangers' standards, this has been quite the week.\nAfter months of speculation, Philippe Clement was finally relieved of his duties following the meek performance that allowed St Mirren to claim a first victory at Ibrox in over 33 years and less than 24 hours later, former captain Barry Ferguson was installed as interim manager until the end of the season.\nFerguson spoke to the media for the first time on Tuesday and now on Wednesday evening takes charge of his first game along with his trusted lieutenants Allan McGregor, Neil McCann and Billy Dodds as they make the short trip down to Rugby Park to play Kilmarnock, managed by a man who has been regularly linked to the Rangers job in Derek McInnes.\nFerguson's appointment has been met with a mixed reaction, ridiculed in parts, welcomed in others, with the man himself asking to be judged at the end of the season, while stressing he has given no thought to taking the job on longer term.\nHis task, of turning this team into a winning machine, is not an easy one and he has had little time to implement changes before this first game in charge.\nBut it will be fascinating to see what tweaks he makes to the starting line-up and perhaps more importantly what psychological impact he has been able to make on a group of players so lacking in belief and resilience.\nOn a personal level, I am pleased to see McCann and Dodds being given this opportunity, called upon for their managerial experience and coaching know-how.\nI have come to know both pretty well over the years they have been involved as BBC pundits and have always found them to be among the most interesting to listen to in terms of their tactical insight into games.\nBoth are deep thinkers about the game and their acumen will be hugely important to Ferguson, whose own coaching credentials pale in significance next to his figurehead status as a top-class player for the club.\nWhile his appointment has not been universally popular among supporters, every single one will hope he can make a success of this stint in charge, perhaps clawing back a few points on Celtic, giving the fans a style of football they can get behind and, who knows, maybe put himself in contention for the job on a full-time basis.\nWith takeover talks continuing in the background, a period of transition is under way once more.", "url": "https://www.bbc.co.uk/sport/articles/c8rk52617vmo"}