{"authors": ["Ben Miller", "www.facebook.com"], "date_download": "2025-05-20 12:06:17", "date_modify": "2025-05-20 12:06:17", "date_publish": "2023-08-05 11:22:05", "description": "Preston begin the Championship season with a point against the Robins, courtesy of Will Keane's late strike.", "filename": "sport_football_66345310_1747742777.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/D788/production/_130667155_118bbcae99e6f5876cb752b12badce82a42523c0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66345310_1747742777.html", "title": "Bristol City 1-1 Preston North End: Will Keane earns visitors late draw", "title_page": "Bristol City 1-1 Preston North End: Will Keane earns visitors late draw - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Summer signing Will Keane's 86th-minute strike earned Preston North End a share of the points at Bristol City in their opening game of the Championship season.\nForward Keane, who joined Preston in July after leaving Wigan Athletic, marked his second spell at the club he played for on loan in 2015 by turning to fire in their equaliser with four minutes remaining.\nSam Bell's close-range 47th-minute opener had put the Robins on course for victory after an uneventful first half between two sides lacking early cohesion.\nHighly-rated 21-year-old Bell atoned for missing the best chance of the opening period by pouncing to stab in the rebound after Nahki Wells shot against a post in the 47th minute.\nBell should have scored when Wells found him unmarked at the far post with a cross from the right, only to see goalkeeper Freddie Woodman rescue the visitors by blocking his shot at full stretch.\nEngland Under-20 midfielder Alex Scott, who has been the subject of several transfer bids and is valued at £25m by Robins manager Nigel Pearson, did not feature because of injury.\nCity captain Andreas Weimann hobbled off injured early as both sides struggled to make openings, although North End newcomer Mads Frokjaer-Jensen tested Max O'Leary in the City goal and Brad Potts shot over the target from long range.\nPreston enjoyed more possession and had 11 shots at goal to Bristol City's five, with Zak Vyner thwarting Keane, and Potts spurning further chances during the second half as the away side's wait for a first win since 10 April went on.\nKian Best, 17, made his debut after coming through the youth ranks and Preston have not won their opening league match in five seasons.\nThe result means Bristol City have not won on the opening day for four seasons but they did extend their dominant run in the fixture to one defeat in 10.\nBristol City forward Sam Bell told BBC Radio Bristol:\n\"That whole 90 minutes sums the Championship up. We played well but the league is relentless. There were warning signs before the goal and we have to recognise the dangers. The lads are saying it was a blatant handball in the build-up to their goal but the [officials'] positions meant they probably didn't have a great view of it.\n\"We can't use that as an excuse - we've got to be stronger. The games come thick and fast and we didn't lose, we got a point and we'll take that. We needed to recognise where we could hurt them, and that was out wide. The conditions being windy made it more difficult to get out in the first half.\n\"It was easier in the second half but we didn't exploit that enough. A lot of their players were going down with cramp and none of ours did, which shows how much work we put in during the off-season.\n\"It's always a good personal landmark to get my first goal on the first day. I should have scored in the first half but that's the life of a forward - you have to put it behind you and take the next one. I want to hit at least double figures.\"\nPreston manager Ryan Lowe told BBC Radio Lancashire:\n\"We were excellent. The goal jolted us but we stuck to the gameplan and were unlucky not to take three points. We were fantastic from start to finish. With them being the home team, we felt they'd come out a little bit more. Once they got the goal, it sort of backfired on them. We got our backsides in gear more, passed and ran forward and were on the front foot. We had opportunities and had them on the ropes.\n\"We could potentially have won it but you'll take a point at Bristol City - they've got some good players, you can see that.\n\"The gameplan in the first half was spot on. In the second half, we changed shape because we felt we could get more bodies up the pitch. It worked to an extent.\n\"I don't want to put too much pressure on Will [Keane] in terms of goals because we didn't score as many as we wanted last season. He adds another 14, potentially. When Ched [Evans] and Emil [Riis Jakobsen] are back, we'll get one more through the door and then if the midfielders can chip in, it will help. I had ultimate faith when I signed Will that he would score goals. It was a fantastic finish.\"", "url": "https://www.bbc.com/sport/football/66345310"}