{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:20:37", "date_modify": "2025-05-21 07:20:37", "date_publish": "2025-05-20 08:17:00", "description": "Man City vs Bournemouth predictions: Chris Sutton on Premier League game", "filename": "sport_football_articles_cdr5gje3n1vo_1747812037.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/561d/live/fbee38e0-d1d4-11ef-87df-d575b9a434a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cdr5gje3n1vo_1747812037.html", "title": "Man City vs Bournemouth predictions: Chris Sutton on Premier League game", "title_page": "Man City vs Bournemouth predictions: Chris Sutton on Premier League game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "This is not a must-win game for Manchester City's top-five hopes but they could really do with a victory here.\nFour points from their past two games against Bournemouth and Fulham will almost certainly see City finish in the Champions League places because of their goal difference, but their home form is much better than their results on the road and they certainly will not want to go to Craven Cottage on the final day needing a win.\nMind you, this game will not be straightforward for City either. Bournemouth have already beaten them once this season and ran them close in the FA Cup quarter-finals too, so we know they can cause them problems.\nCity's home form has been much more reliable of late, however, with four wins at Etihad Stadium in a row, and that is the main reason I am backing them here.\nIt is Kevin de Bruyne's final match at the Etihad, but City are going to have to play well to give him the send-off he deserves, and they need him to perform too.\nDe Bruyne has been a phenomenal player for City and it would be fitting if he can say farewell with a goal or one of his trademark assists.\nSutton's prediction: 3-1", "url": "https://www.bbc.com/sport/football/articles/cdr5gje3n1vo"}