{"authors": ["Bobbie Jackson", "www.facebook.com"], "date_download": "2025-05-21 03:44:01", "date_modify": "2025-05-21 03:44:01", "date_publish": "2025-04-06 15:59:39", "description": "British Judo coach Jamie Johnson has been temporarily suspended pending an independent investigation into historic bullying allegations.", "filename": "sport_judo_articles_cn4wm07v0z2o_1747799041.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5a53/live/f580bf50-12ed-11f0-8bc5-d317b6dd5c85.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_judo_articles_cn4wm07v0z2o_1747799041.html", "title": "British Judo temporarily suspends coach Jamie Johnson after bullying allegations", "title_page": "British Judo temporarily suspends coach Jamie Johnson after bullying allegations - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "British Judo coach Jamie Johnson has been temporarily suspended pending the results of an independent investigation into bullying allegations.\nJohnson, who is a five-time national champion, oversaw the women's team at the 2024 Olympics in Paris.\n\"British Judo takes any allegations of any form of inappropriate behaviour extremely seriously,\" British Judo chief executive Andrew Scoular said.\n\"All of our athletes are encouraged to report any safeguarding concerns, including any instances of bullying via our internal teams, which are then fully investigated using external independent investigators.\"\nHe added: \"We will not be commenting on any ongoing independent investigations.\"\nJohnson previously faced an allegation of bullying from former British judoka Lubjana Piovesana, but the 52-year-old said he was cleared of any misconduct.\n\"The historical investigation was upheld five years ago and no wrongdoing was found,\" Johnson said in a statement.\n\"The recent allegations are ongoing, so I am unable to comment at this time, but one thing I will say is, there are two sides to every story.\"", "url": "https://www.bbc.com/sport/judo/articles/cn4wm07v0z2o"}