{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:38:48", "date_modify": "2025-05-21 03:38:48", "date_publish": "2025-04-08 00:00:00", "description": "Blackburn Rovers produce second-half comeback to deny Sheffield Wednesday victory at Ewood Park.", "filename": "sport_football_live_cx26v44d5njt_1747798728.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cx26v44d5njt_1747798728.html", "title": "Blackburn 2-2 Sheffield Wednesday: Rovers produce second-half fightback", "title_page": "Blackburn 2-2 Sheffield Wednesday: Rovers produce second-half fightback - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Blackburn Rovers produced a spirited second-half fightback to force a 2-2 draw against Sheffield Wednesday and pick up a second point for manager Valerien Ismael.\nA dismal first-half effort from Rovers saw them go in two goals down with Yan Valery and Djeidi Gassama on the scoresheet and booed off with a sixth straight loss looming.\nBut they emerged unrecognisable from their first-half performance, piling on the pressure to first halve the deficit through Tyrhys Dolan's clever header.\nWith five minutes of normal time remaining Rovers pulled level, Yuki Ohashi getting on the end of a whipped cross from Todd Cantwell to poke the ball home.\nA draw provided a timely release for pressure building on new boss Ismael after a draw and five defeats since taking over the Ewood Park dugout.\nBut a point did neither Rovers nor Wednesday much good with regard to fading hopes for either making the play offs.\nIt has been a disappointing year to date for Rovers who, up until the third week of January, were very much part of the play-off picture hovering in sixth spot in the table.\nBut the surprise departure of John Eustace to Derby County and an injury list that has kept the Rovers physios on call this spring has seen them slump to mid-table.\nIsmael's appointment had not produced the hoped for bounce with one point from 18 but on the second half display here, there is at least a degree of optimism for a strong finish to the season.\nOwls boss Danny Rohl was understandably furious when the late equaliser went in after a first-half performance that had boosted hopes of a late charge for the play offs.\nThis draw appeared to scupper that hope for both of these sides who straddle the halfway point of the table, separated by goal difference with Rovers just top half in 12th and Wednesday bottom half in 13th.\nBlackburn Rovers manager Valerien Ismael speaking to BBC Radio Lancashire:\n\"We showed a great mentality and we learned from the previous weeks. From two nil down to come back from behind we stopped the bleeding and we take more positives from negatives from that game.\n\"We said we have to stay calm, but that we had to stay on the front foot and be active and we have to be the first to score the next goal. We got the second. It is a little step but at the moment we take what we can get. We stop the bleeding first and it was a great second half.\n\"I was not unpleased with what I saw in the first half. We were still in the game and if I tell them to stay calm I have to be the guy who first leads by example. This is what I said to the players to fight our way back.\"\n\"It gives you the confidence that this will be our way in the future. We need to get positivity back on the pitch. We took a first step and the next step is to win a game.\"\nOwls manager Danny Rohl speaking to BBC Radio Sheffield:\n\"Of course it is disappointing when you saw the first half because except from the first chance they had I think we controlled the game with some really good football.\n\"But two-nil is always dangerous with one moment from the home team. When you take all of this game maybe this was the mirror of all season. Maybe we have this and [then] this. But I must say the attitude was there and the mentality.\n\"We have made a very solid season. When was the last season with this club that you can say there has been no trouble and we have spent most of the season looking up? These are all positives things that we should take.\n\"As a group we have good performances but individually everyone could step up. But again we have achieved 53 points and that was achieved on the final match day last season. This season we have still five more games to go so let's try to have a good end of the season.\"", "url": "https://www.bbc.com/sport/football/live/cx26v44d5njt"}