{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:44:44", "date_modify": "2025-05-21 05:44:44", "date_publish": "2025-04-02 22:26:21", "description": "Liverpool 1-0 Everton: Arne Slot reacts to win and Tarkowski challenge", "filename": "sport_football_articles_cr5dm8e00q6o_1747806284.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8285/live/292fef70-1054-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cr5dm8e00q6o_1747806284.html", "title": "Liverpool 1-0 Everton: Arne Slot reacts to win and Tarkowski challenge", "title_page": "Liverpool 1-0 Everton: Arne Slot reacts to win and Tarkowski challenge - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Liverpool boss Arne Slot, speaking to Sky Sports: \"A very, very difficult team to play against because of their playing style. That's not only for us, but for every team because they were nine games unbeaten.\n\"A very good manager has brought them back to life. The amount of shots they blocked, the effort they put in to defend inside their own box, and then the threat they had on the counter-attack - so difficult to play against. But our boys showed immense character, I think we created more than in the away game, and in the end we scored a good goal and kept a clean sheet.\n\"I liked much more what I saw here than the away game. I could feel that we were getting closer, but there's a reason they hardly ever concede a goal or a chance. They bring so many bodies back, and they have players who are so good at blocking shots. We knew if we wanted to win this game we had to keep a clean sheet. To score more than one goal would have been very hard.\"\nOn the James Tarkowski VAR decision: \"Alexis [Mac Allister] is OK because he kept on playing. He's used to something because he's from South America.\n\"I think everybody has said something about it, so why should I add to it. It's so obvious that it's not necessary for me to comment. I'd prefer to talk about the goal or Curtis Jones' performance or something else.\"\nOn Diogo Jota's goal: \"It's not easy to score against them. Great goal, according to the rules it was a goal so no one can complain about that. There is always question marks, but the good thing is we've got rules. At least they just showed on TV that it's a clear goal.\n\"I would be frustrated if I concede that goal, but then I'm frustrated about the rule and not the execution of the rule. The rule itself is frustrating because I think you always have to help, in my opinion, the offensive team.\"", "url": "https://www.bbc.com/sport/football/articles/cr5dm8e00q6o"}