{"authors": ["Mark Jardine", "www.facebook.com"], "date_download": "2025-05-21 06:26:08", "date_modify": "2025-05-21 06:26:08", "date_publish": "2024-12-24 11:45:00", "description": "St Mirren fan voice: 'Smyth emerges from shadows to spark festive delirium'", "filename": "sport_articles_c62zv6e2ndpo_1747808768.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/341d/live/c1de15c0-c1ea-11ef-aff0-072ce821b6ab.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c62zv6e2ndpo_1747808768.html", "title": "'Smyth emerges from shadows to spark festive delirium'", "title_page": "St Mirren fan voice: 'Smyth emerges from shadows to spark festive delirium' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "'Twas the game before Christmas...\nFor a second week in a row, late heroics were required to bring three points back down the road to Paisley. Granted, the 89th minute in Dingwall is not quite the 99th minute in Perth, but the road home was longer and so I'm counting it as just as sweet.\nSaturday's contest in Dingwall was not one for the purists, though certainly wasn't short on drama.\nI'm conscious of these post-weekend pieces falling into the same 'X happened, Y didn't, VAR missed Z' formula, so I'll limit myself to this next sentence regarding the decisions made and not made: I think there was a reasonable case for at least three penalties between the hosts and visitors on Saturday, and it's mind-boggling that the officials felt there were none.\nOne key decision it's hard to protest is the red card for Scott Tanser. For a second time on the road this season, the Saints left-back was shown a second yellow.\nWhile in Motherwell this felt like an injustice, the signs were all there in Dingwall that this was coming. Given what came afterwards, I'm confident he'll have bought an especially fancy selection box for Oisin Smyth.\nSmyth, limited to mostly substitute appearances since joining the Saints this summer, was promoted to midfield starting duty in the absence of Mark O'Hara.\nThe Northern Irishman opted for Paisley in an attempt to kickstart his career on this side of the Irish Sea, but has required patience. Prior to Saturday, his key contribution had been two goals from the bench in Paisley on the opening day.\nOn this occasion, his moment arrived late in the day in the form of a free-kick. I'm not going to lose the run of myself and start comparing this to Beckham v Greece or Carlos v France, but it meant more to the good people of Paisley than either.\nDriven at speed with real quality, Smyth found the corner of Jack Hamilton's net and brought on chaos in the away end.\nAll notions of being soaked through, battered by icy wind and facing a four-hour bus journey home were forgotten for a few minutes of festive delirium.", "url": "https://www.bbc.com/sport/articles/c62zv6e2ndpo"}