{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:18:40", "date_modify": "2025-05-21 04:18:40", "date_publish": "2025-04-05 16:27:57", "description": "Ipswich 1-2 Wolves: What Jorgen Strand Larsen said", "filename": "sport_football_articles_cde29nkrjn3o_1747801120.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cf2e/live/dec215b0-123a-11f0-afc6-d1fc00c8c982.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cde29nkrjn3o_1747801120.html", "title": "Ipswich 1-2 Wolves: What Jorgen Strand Larsen said", "title_page": "Ipswich 1-2 Wolves: What Jorgen Strand Larsen said - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wolves forward Jorgen Strand Larsen has been speaking to BBC Sport about the result: \"A lot of thoughts in my head, good thoughts because it was an amazing comeback. We looked like two different teams today, and it is nice to see that we can come back after a pretty bad first half.\n\"I've scored many goals already, and many important ones, but this is the best one. Not the prettiest one, probably the ugliest, I was just onside but it was a massive goal at the end of the game.\n\"It's no secret, I am always working hard. I had a few tough months, having been injured, with a few tough moments not scoring goals. That's the way it is. Your form goes up and down, especially where we have been this season. I haven't changed a thing, just kept being myself, positive and smiling all the time.\"\nOn his broken hand and whether he was worried about it in the celebrations: \"I couldn't care less about that. The doctor will say: 'you have to be careful'! We went nuts celebrating with the fans, it was amazing.\n\"Ipswich did well in the first half. They have strong defenders who don't give a lot of time, good crosses and set pieces. We made a few changes at half-time and we got back in the game.\"\nOn whether Wolves are safe from relegation: \"No, not really. We still have to be in every game because you see how strong Ipswich were today.\n\"This league is brutal and you never know what will happen. We have a few tough games to play, but we are not afraid of anyone so hopefully we can take three points in next game too.\"", "url": "https://www.bbc.com/sport/football/articles/cde29nkrjn3o"}