{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:10:36", "date_modify": "2025-05-21 06:10:36", "date_publish": "2025-01-31 12:46:27", "description": "Republic of Ireland attacker Julie-Ann Russell will retire from football after 66 caps for her country.", "filename": "sport_football_articles_c2egp1e4rpzo_1747807836.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b2d6/live/173ceae0-dfce-11ef-976a-75f9ab68fe5f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c2egp1e4rpzo_1747807836.html", "title": "Julie-Ann Russell: Galway United attacker retires after 15-year Republic of Ireland career", "title_page": "Julie-Ann Russell: Galway United attacker retires after 15-year Republic of Ireland career - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Republic of Ireland attacker Julie-Ann Russell has retired from football after 66 caps for her country.\nThe Galway United player made her international debut in a World Cup qualifier away to Kazakhstan in October 2009 and scored seven goals for the side.\nShe would miss four years of international football between 2020 and 2024 but returned to the squad last year, scoring three goals in six games including finding the net in a memorable win over France.\nIn her club career, the 33-year-old was twice voted SSE Airtricity Women's Premier Division player of the year, with the awards coming 10 years apart in 2014 and 2024, while also enjoying spells in America, England and Australia.\n\"After 24 incredible years, the time has come to step away from football,\" she said.\n\"The game has been a central part of my life, providing unforgettable memories and opportunities that I will never forget.\n\"While it's bittersweet to say goodbye, I'm excited for the next chapter and will forever cherish the memories football has given me.\"\nRussell is the third experienced player to retire from Republic of Ireland duty since the side's failure to qualify for Euro 2025.\nShe joins Niamh Fahey and Diane Caldwell in hanging up her boots before new boss Carla Ward's first game in charge against Turkey next month.\nFAI chief football officer Marc Canham said: \"Julie-Ann is a special player who will be remembered for her excellent performances, goals and assists in the SSE Airtricity Women's Premier Division and for Ireland, where she will rightly be remembered as one of our finest players.\n\"We thank her for everything that she has done for Irish football.\"", "url": "https://www.bbc.com/sport/football/articles/c2egp1e4rpzo"}