{"authors": ["Emma Smith", "www.facebook.com"], "date_download": "2025-05-20 13:40:32", "date_modify": "2025-05-20 13:40:32", "date_publish": "2023-07-24 23:18:31", "description": "Colombia get their Women's World Cup off to the perfect start with victory over South Korea, while Casey Phair becomes the youngest-ever player at a Women's World Cup.", "filename": "sport_football_66290020_1747748432.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2440/production/_130508290_gettyimages-1552582533.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66290020_1747748432.html", "title": "Colombia 2-0 South Korea: South Americans capitalise on mistakes as Casey Phair makes World Cup history", "title_page": "Colombia 2-0 South Korea: South Americans capitalise on mistakes as Casey Phair makes World Cup history - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Colombia got their 2023 Fifa Women's World Cup off to the perfect start with victory over South Korea in Sydney.\nCatalina Usme put the South Americans ahead from the penalty spot, before teenager Linda Caicedo, 18, doubled the lead thanks to an error from Korean keeper Yoon Young-geul.\nThat was enough to give Colombia their second ever win at the tournament.\nFor South Korea, history was made as Casey Phair became the youngest-ever player at a Women's World Cup.\nThe forward, aged just 16 years and 26 days, was introduced as a 77th-minute substitute.\nThe Asian nation, who have now lost all four of their Women's World Cup opening matches, next face Morocco on 30 July in a must-win Group H match, before Colombia play Germany.\nThis could have been Colombia's World Cup - they bid to host the 2023 tournament and were only narrowly beaten by Australia and New Zealand.\nWhile they might not be at home, a very loud army of fans made up the majority of the 24,323 crowd at Sydney Football Stadium - and were rewarded.\nSouth Korea did their best to make the Colombians feel comfortable, handing them a two-goal first-half lead through a duo of defensive errors.\nOn 28 minutes, a frantic passage of play with several deflections and mis-hit shots ended when Shim Seo-yeon blocked a goalbound effort with her arm.\nUsme calmly rolled home the result spot-kick, sparking wild celebrations among the yellow-shirted fans.\nThe worst was yet to come for South Korea, as Caicedo doubled the Colombian lead in a horrible moment for keeper Yoon.\nReal Madrid winger Caicedo was allowed too much time and space to run at the defence down the left, she cut inside and her tame curled effort should have been saved but Yoon mistimed her jump and the ball slipped through her gloves and into the net.\nYet Caicedo's drive, skill and foresight demonstrated why, at only 18, she is one of the most hotly-tipped young stars of the tournament.\nHer goal made her the second-youngest player to score at a Women's World Cup, after Brazil's Marta, who did so aged 17 in 2003.\nColombia came close to extending their lead after half-time when Mayra Ramirez headed just wide.\nThe victory boosts their chances of qualifying from Group H, moving them level on points with favourites Germany.", "url": "https://www.bbc.com/sport/football/66290020"}