{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:59:34", "date_modify": "2025-04-26 06:59:34", "date_publish": "2025-02-27 04:55:55", "description": "Wrexham: Elliot Lee early return a 'bonus' for Wrexham", "filename": "sport_football_articles_c3e4494k27yo_1745650774.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6610/live/62349230-f49d-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c3e4494k27yo_1745650774.html", "title": "Lee early return a 'bonus' for Wrexham", "title_page": "Wrexham: Elliot Lee early return a 'bonus' for Wrexham - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Phil Parkinson admits Elliot Lee's early return to action has been a \"bonus\" given the recent injury blow to Andy Cannon.\nThe 30-year-old was not included in Wrexham's matchday squads for the recent League One fixtures with Northampton Town, Leyton Orient and Mansfield Town, after he was involved in a road traffic collision following his side's 1-0 win over Bolton Wanderers in the EFL Trophy on 11 February.\nLee, however, was a substitute in the semi-final contest with Peterborough United on Wednesday night, replacing goal scorer George Dobson in the second half against the Posh as Parkinson's men were beaten 4-2 in a penalty shootout following a 2-2 draw in regular time.\nAnd Parkinson was particularly pleased to have Lee back in his squad following the news that midfielder Cannon is set for a lengthy spell on the sidelines after suffering an ACL injury,\n\"I'm frustrated for Andy, I really feel for Andy Cannon because he's a great lad,\" said Parkinson.\n\"But Elliot coming back is a bonus because that is probably a little bit earlier than we anticipated so now we'll look to pick the team for the weekend which is ready to go and get us another win.\"\nWrexham face Parkinson's former side Bolton Wanderers at the Stok Racecourse on Saturday lunchtime (12:30 GMT).", "url": "https://www.bbc.co.uk/sport/football/articles/c3e4494k27yo"}