{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:04:35", "date_modify": "2025-05-21 06:04:35", "date_publish": "2025-04-02 00:00:00", "description": "Follow live BBC Radio 5 live commentary plus live text and score updates from across the Premier League.", "filename": "sport_football_live_c778z0v267vt_1747807475.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/695e/live/352866d0-1000-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c778z0v267vt_1747807475.html", "title": "Premier League LIVE: Liverpool vs Everton plus five more fixtures", "title_page": "Premier League LIVE: Liverpool vs Everton plus five more fixtures - score, radio & updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "'There's still belief'\nFT: Bournemouth 1-2 Ipswich Town\nIpswich Town\nIpswich Town manager Kieran McKenna, speaking to Sky Sports: \"I'm really proud and there is a little bit of relief after the last 10 minutes. Really proud of the performance in terms of how hard we worked, the two goals we scored, the result and what we showed defensively.\n\"We have been waiting a while for a win and in this league that's what can happen. There's still belief, a lot of togetherness and you can see that as a team so it was a good night for us.\n\"We're coming into the last quarter of the season and we want to finish off the season well and make it our best quarter and get as many points as we can and where that leaves us, let's see.\n\"The second goal was a fantastic move and for me the best goal anyone has scored here this year as they are really hard to play through.\"\nOn Saturday's home match against Wolves: \"It's a big game, no doubt about it. It's a big game to look forward to, a big game, a pressure game so let's attack it. We try to enjoy every game at Portman Road.\"\n'We had to fight really hard'\nFT: Liverpool 1-0 Everton\nLiverpool\nFinally from Liverpool boss Arne Slot, speaking to BBC MOTD: \"I felt we played much better than the away game.\n\"We were so many times in the final third than the away game, but Everton is in a great momentum at the moment.\n\"It is a strong team with a very good manager who has brought that completely back to life.\n\"It is even harder to create a chance against this team as they have so many bodies inside their own 18-yard box.\"\nOn the title race: \"Everton showed us how difficult it is to get your points and get your wins. We had to fight really hard for it.\"\nOn Curtis Jones playing full-back: \"He told me earlier in the season when I was planning to use him in that position that he had played that position with Jurgen [Klopp].\n\"Curtis showed today that he can play there very well in a game like this.\"\n'Execution of the rule was done perfectly'\nFT: Liverpool 1-0 Everton\nLiverpool\nLiverpool boss Arne Slot, speaking to BBC MOTD about James Tarkowski avoiding a red card: \"So many people gave their opinion and a lot of people who are not in favour of Liverpool were so clear about it.\n\"I would prefer to talk about Diogo's goal or Curtis Jones' performance at right full-back.\"\nOn the goal which Everton felt should have been disallowed for offside: \"I have just seen on television the rules and the rules have been executed perfectly.\n\"No intention to play the ball, can I feel frustration about the rule? Yes, I can.\n\"I am a manager who likes to press high which Everton doesn't do.\n\"If you go all the way up to the halfway line and someone is in an offside position but has no intention to play the ball.\n\"We were not lucky; the rule is what it is. I would love to change the rule because it is in favour of the offensive team.\n\"Execution of the rule was done perfectly by the referee, but I feel the frustration about the rule.\"\n'I'm not a referee and I wouldn't want to be'\nFT: Liverpool 1-0 Everton\nEverton\nEverton keeper Jordan Pickford speaking to Sky Sports on the James Tarkowski VAR decision: \"You've seen at the end he apologised, it's probably a bit of a high foot but he's done what he's done and he's apologised after the game. The VAR says it's not a red card so that's the decision. It's a game of football as well.\"\nOn Diogo Jota goal: \"In the moment I can't see what's happening, but Jarrad said it was a stonewall offside straight away. But I'm not a referee and I wouldn't want to be. It's a big debate and we'll see what the referees come out and say. As a team we thought it was offside but that's football. We're disappointed with that decision but it can't be perfect always.\"\n'It's so obvious that it's not necessary to comment'\nFT: Liverpool 1-0 Everton\nLiverpool\nLiverpool boss Arne Slot speaking to Sky Sports: \"A very, very difficult team to play against because of their playing style. That's not only for us, but for every team because they were nine games unbeaten. A very good manager has brought them back to life. The amount of shots they blocked, the effort they put in to defend inside their own box, and then the threat they had on the counter-attack. So difficult to play against. But our boys showed immense character, I think we created more then in the away game, and in the end we scored a good goal and kept a clean sheet.\n\"I liked much more what I saw here then the away game. I could feel that we were getting closer, but there's a reason they hardly ever concede a goal or a chance. They bring so many bodies back, and they've players who are so good at blocking shots. We knew if we wanted to win this game we had to keep a clean sheet. To score more than one goal would have been very hard.\"\nOn the James Tarkowski VAR decision: \"Alexis is OK because he kept on playing. He's used to something because he's from South America. I think everybody has said something about it, so why should I add to it. It's so obvious that it's not necessary for me to comment. I'd prefer to talk about the goal or Curtis Jones' performance or something else.\"\nOn Diogo Jota's goal: \"It's not easy to score against them. Great goal, according to the rules it was a goal so no one can complain about that. There is always question marks, but the good thing is we've got rules. At least they just showed on TV that it's a clear goal. I would be frustrated if I concede that goal, but then I'm frustrated about the rule and not the execution of the rule. The rule itself is frustrating because I think you always have to help, in my opinion, the offensive team.\"\n'We are in a bad moment'\nFT: Bournemouth 1-2 Ipswich Town\nBournemouth\nBournemouth manager Andoni Iraola, speaking to Match of the Day, said: \"We are in a bad period. They scored two goals with two shots on target, that was the worst part as we controlled the game. We had chances one minute before the 1-0 when the defender [Dara O'Shea] cleared off the line and those are the small margins when you are in a bad moment and everything is against you.\n\"It's a bad result for us, but we need to stay together and focus on the things we can improve. We had all the ball in the opposition half, but when they [Ipswich] arrived [in the penalty area] they punished us. We had chances to score more and it is costing us a lot.\n\"We finished very strongly and physically we were in a good place. Our offensive players were not in the form they have been for most of the season and we have to keep believing in them. We need to improve defensively and not make any mistakes or concede chances so we don't have to get three or four goals to win a game.\"\n'I'm a lad who studies the game a lot'\nFT: Liverpool 1-0 Everton\nLiverpool\nLiverpool right-back Curtis Jones, speaking to BBC MOTD: \"We understand how important all the games are now. If we can win all the games then great. Of course, there's teams out there that are fighting for different things. First game back after the break, it's an important win. I'm happy with that.\n\"It's their style of play. They like to play a first pass and then they go long all the time. The lads up top who are bigger, stronger, fast. It was hard out there. But we came away with the win and that's the important thing.\"\nOn playing right-back: \"I see myself as a 10 or an eight, but at the end of the day I'm a footballer. If I'm playing as a 10 or as an eight, or if I'm playing off the left, as a defender, I'll go out there. I'm a lad who studies the game a lot, I take it all in. I played in an important game and I think I was alright.\"\n'It was very easy to give offside'\nFT: Liverpool 1-0 Everton\nEverton\nEverton boss David Moyes, speaking to BBC MOTD: \"Liverpool had a lot of possession and I thought Liverpool played better in this game than the other one.\n\"The moments we had to make the difference didn't quite count. I said to the players 'in those big games you need to take them'.\"\nOn Diogo Jota's goal: \"Look, the other part of it is the goal was offside. I don't know if it can be any clearer.\n\"It was very easy to give offside and put the flag up.\n\"I have looked at it and it looks an obvious decision.\"\nOn Everton's form: \"We were nine games unbeaten up until tonight and now we have a group of teams who are at a level above us and higher in the league, so it is a challenge.\n\"Tonight, we didn't play well enough with the ball when we got it. But the resilience to try keep a clean sheet was very good.\"\n'We deserved to win' - Juric\nSouthampton 1-1 Crystal Palace\nSouthampton\nSouthampton manager Ivan Juric speaking to BBC Match of the Day: \"I think we did a very good performance, we control the game, didn't risk anything, they score on one set-piece. It's frustrating because I think the guys deserved a victory.\n\"When you work with the guys for three months you know them, today we really did a good game. I think in some moments we can play better, technically we missed some really easy passes.\"\nOn Paul Onuachu's performance: \"He was really good, when he is full of energy he can be really good, he did good work.\"\nOn whether Southampton will beat Derby County's record low Premier League points tally of 11: \"Tonight I'm disappointed because we deserved to win the game. The guys must train and prepare for every game like we did today. Then the points will arrive.\"\n'A really strong performance'\nFT: Bournemouth 1-2 Ipswich Town\nIpswich Town\nIpswich Town manager Kieran McKenna, speaking to Match of the Day, said: \"Really proud. A really strong performance and we scored two excellent goals - the second was as good a goal as any team has scored here for a long time.\n\"I'm very proud of how the group stuck together and you could see tonight that we are all working every day for the club. We took both goals really well and you need to do so when coming away from home in the Premier League. We got a two-goal margin which was really key and that gave us a much better chance.\n\"They were fantastic the whole team defensively.\"\nOn Saturday's match at home against Wolves, McKenna added: \"It's a big, big game. We have to recover well and give it everything we have got.\"\n'Offside goal' is the 'difference' - Moyes\nFT: Liverpool 1-0 Everton\nEverton\nEverton boss David Moyes, speaking to Sky Sports: \"I think we are a lot closer to them tonight than possibly when I came to the club than what I expected.\n\"Over the two games we have given them a good game. Tonight was really tight. An offside goal which they get and that's the difference in the game tonight.\"\nOn thinking Jota's goal should not stand: \"The players behind Jarrad interfere with him clearing it. It is an easy decision to give. I cannot understand any reason why that wasn't given offside.\"\nOn James Tarkowski VAR decision: \"First thought it was a brilliant tackle for a derby game. A tackle we would have seen a few years ago.\n\"I understand nowadays things are slightly different with follow-throughs. We might have got a bit lucky, don't put that with the goal because the goal was a different incident that won Liverpool the game.\"\nOn the game: \"Liverpool were the better team and that's why they're top of the league, but we showed great resilience and we stuck at it.\n\"A bit gut-wrenching when you feel the end result has come from something which wasn't deserved.\n\"We have been on a great run, the players have been doing brilliantly well. First defeat in 10 games.\n\"I thought we tried to close that gap from their levels to our levels tonight. At the moment they're the best team in the league.\n\"Tonight, we have done a lot of things not as well as we should have done.\"\n'We were not at our best level' - Glasner\nSouthampton 1-1 Crystal Palace\nCrystal Palace\nCrystal Palace boss Oliver Glasner speaking to Sky Sports: “It was a very difficult game, we were not on our top level, especially with focus and mentality, it looked like we were mentally tired. But it was nothing to do with our attitude. We fought until the last second to get the equaliser,\n\"It’s important to keep going and keep believing, we kept going and even after scoring we wanted to win the game.\n\"The points is from the character of the team, we know we can play better but sometimes it’s not to perform at the best level but to fight and keep going until the last minute. It’s a very import ant point.\n\"We were missing the accuracy in the final third, the final pass or cross wass sloppy\nOn Matheus Franca scoring his first Premier League goal: \"His first goal for Palace. His first game in one and a half years, injured for 10 months, he also had his birthday this week. It was a great win for him.\"\nRashford 'is getting better and feeling confident'\nFT: Brighton 0-3 Aston Villa\nAston Villa\nAston Villa boss Unai Emery, speaking to BBC Match of the Day: \"Good evening. We compete very well. We are trying to reduce conceding goals because our numbers haven't been very good this year. We achieved a clean sheet and today is fantastic for how we competed against a very good team. We had the chances to score in 90 minutes and were clinical. This is very important for us to try to reduce the distances in the table.\nOn Rashford: \"This is the challenge he has. He is getting better and feeling confident, understanding our demands. We are trying to get the best out of the players. His qualities and experience are very important in our squad. Each match he plays for us is very important.\n\"We are trying to get stronger than we did during the season in the Premier League. We have to try to get balance now.\n\"The players were committed to the demands we have and we can feel proud of how the players work today.\"\n'Everyone wants to be in our position'\nFT: Liverpool 1-0 Everton\nLiverpool\nLiverpool's captain Virgil van Dijk, speaking to Sky Sports: \"They make it very difficult for you.\n\"They have a certain way of playing and you have to be ready for all the aspects. First half was not our greatest.\n\"Jota made a fantastic goal and we kept a clean sheet overall.\"\nOn the draw at Goodison: \"We didn't watch many clips of that game. We know this game was always going to be tough. They're very direct and on the break they can punish you.\n\"We stayed in the game and a well deserved three points.\"\nOn the James Tarkowski VAR decision: \"It is what it is. The referee and VAR make decisions and we all have to deal with it.\"\nOn the title race: \"Everyone wants to be in our position. Now we have to keep going and keep the same mentality as we have been doing all season.\n\"We have to keep going. We have a tough one again in London on Sunday [against Fulham].\"\n'If we keep performing like this, we will be in a good position'\nFT: Newcastle 2-1 Brentford\nBrentford\nBrentford manager Thomas Frank speaking to Sky Sports: \"Proud of the performance, happy with the players' performance and I think besides the first moment and the last minute, I felt we kept them quiet first half.\n\"Ethan went close to scoring and unfortunately, Tonali scores from a cross. That is one in a million and then in the end we had good chances. We performed well and then the fine margins didn't go our way. Even game, could have gone either way but unfortunately we didn't.\n\"The last one I don't think it was a penalty but the first one I think it was.\"\nOn Bryan Mbeumo scoring again: \"First with Ivan [Toney] I said we had the best penalty taker in the world and with Bryan if not the best, we have the second best.\n\"If we keep performing like this, I think we will be in a good position at the end of the season. Hopefully we get five straight home wins now.\"\n'The big moments didn't go our way'\nFT: Newcastle 2-1 Brentford\nBrentford\nBrentford manager Thomas Frank speaking to BBC Match of the Day: \"I do think the first one with Damsgaard was a penalty so that is a foul anywhere else on the pitch. You can't just run through a player.\n\"That said, I think we played a very good game and it is a very difficult place. Apart from the first minute and the last minute of the first half, we defended well.\n\"The big moments that you need to go our way, didn't go our way. We hit the post with Ethan and then with Damsgaard. Ethan if he heads that any other day, he scores. Today we just didn't have the fine margins.", "url": "https://www.bbc.com/sport/football/live/c778z0v267vt"}