{"authors": ["Nick McPheat", "www.facebook.com"], "date_download": "2025-05-20 12:51:11", "date_modify": "2025-05-20 12:51:11", "date_publish": "2023-08-03 12:50:14", "description": "It's been a summer of transition for Hearts' management team but Steven Naismith is keen to stress that the only thing that's changed at Tynecastle is job titles.", "filename": "sport_football_66371395_1747745471.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/D9A8/production/_130602755_-e5fbee8a-e915-4363-8c77-fe4e231a993a.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66371395_1747745471.html", "title": "Hearts: Who's in charge at Tynecastle and what does it mean?", "title_page": "Hearts: Who's in charge at Tynecastle and what does it mean? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The more things change, the more they stay the same.\nIt's been a summer of transition for Hearts' management team but Steven Naismith is keen to stress the only alterations at Tynecastle are in the job titles.\nThe Edinburgh side ended last term with their former striker in interim charge for seven matches as they held on to fourth place.\nThe board were impressed enough to stick with the 36-year-old. But, with Naismith not yet having a Uefa pro licence - a prerequisite for managing in Europe - assistant Frankie McAvoy was instead promoted to head coach in June.\nFor the time being, Naismith will take the role of technical director - but what does it all mean and who's actually in charge?\nThe trio of Naismith, McAvoy and Gordon Forrest, entering his fourth season at Hearts, were announced as a collective \"coaching team\" two months ago.\nSporting director Joe Savage singled out Naismith by stating the former Everton and Rangers forward has \"worked towards this for a long time\" and has a \"style and identity\" he admires.\nThat would suggest Naismith is still the main man. The ex-Scotland international backed this up by saying the new structure is \"not any different to what it was\".\nWhere that statement may become slightly contradictory is when it comes to team selection.\n\"Frankie is the head coach and he'll make those calls,\" added Naismith.\nSpeaking to Sky Sports last week, McAvoy - whose only job in senior management was a nine-month spell at Preston North End in 2021 - explained: \"When it comes to differences of opinion and who we should start, then I'll make that decision.\"\nAssuming Naismith, as interim manager, was the man making matchday selections last term, that would indicate things are perhaps going to be working a little differently at Tynecastle for now.\nThe concern for Hearts fans will be whether a shift in authority results in a rift within the management team but Naismith insists \"there's never been a stand-off\" with the decision-making and that all three men are \"on the same page\".\nWith the competitive action starting with a Premiership opener at St Johnstone on Saturday, tougher calls that could test the current structure are surely in the post.\nThis month's Europa Conference League qualifier against either Rosenborg or Crusaders could also pose a problem, as Uefa won't be shy in dishing out a hefty fine if there's any suspicion that Naismith is calling the shots from the dugout.\n\"The big issue with the support is the optics of it,\" Hearts fan and A View from the Terrace panellist Joel Sked told the Scottish Football Podcast.\n\"It's a bit convoluted from the outside. It's just a wee bit unusual. But as long as there's a clear message getting put across to the players, that's the main thing.\n\"For me, it's pretty clear that Naismith is head honcho. It seems like the three of them work well together as a management team, so I don't think there's too much of a change.\"\nDespite picking up just two wins from a tough run of seven league fixtures last term, many Hearts fans were buoyed by the vibrant nature of the their side's performances under Naismith.\nWith 15,500 season tickets snapped up for the new season and a further 7,000 waiting patiently on a standby list, there's certainly a feelgood factor at Tynecastle.\nNaismith and co have played their part in that. Now it's time for them to build on it.", "url": "https://www.bbc.com/sport/football/66371395"}