{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:02:04", "date_modify": "2025-05-21 04:02:04", "date_publish": "2025-01-15 09:37:45", "description": "Peterborough boss Darren Ferguson hails an \"outstanding\" display by Gustav Lindgren after the Swede's brace against Walsall.", "filename": "sport_football_articles_cjex99g31leo_1747800124.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/130f/live/4d1723e0-d319-11ef-844c-a7207455ca97.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cjex99g31leo_1747800124.html", "title": "Gustav Lindgren: Swede's brace impresses Peterborough boss Ferguson", "title_page": "Gustav Lindgren: Swede's brace impresses Peterborough boss Ferguson - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Peterborough United boss Darren Ferguson hailed an \"outstanding\" display from two-goal Gustav Lindgren as the EFL Trophy holders booked their place in the quarter-finals of this season's competition.\nThe Swede agreed to join Posh from Degerfors - in what owner Darragh MacAnthony said was a \"transfer package worth over £500,000\" - in September but was unable to finalise the deal until this month's transfer window opened.\nHe made his debut as a substitute in their FA Cup defeat at Everton but scored twice in the first half as Posh beat leaders Walsall 4-2 on Tuesday, their first win of any kind since 17 December.\n\"We got a little glimpse of what we hope he can do,\" Ferguson told BBC Radio Cambridgeshire.\n\"He's been with us a while now, played a half at Everton where his movement was outstanding against top Premiership defenders. He's not just one that can run in behind, he can link (play), he can press.\n\"When we analysed him and watched him, I was absolutely certain he could be a really good player for us, he's a player with real potential.\"\nLindgren scored his first early in the game and then ran onto a Malik Mothersille header to fire his second just after the half-hour, but his chances of a third goal ended when he was taken off after 65 minutes.\n\"He was never getting any more than that. It's a shame because he was on his hat-trick but you've got to remember he's played a full season (in Sweden) so I've got to be careful,\" said Ferguson.\n\"We've had some great strikers at this club, real top-notch strikers, and the boy did himself no harm, it was a great start for him.\"\nFerguson was less thrilled with some of his side's defensive work and is still hoping that a couple of reinforcements can be signed this month.\nDefence has been Peterborough's weakness this season and they have conceded 46 goals in 24 games in League One, more than any other team in the division.\nGoalkeeper Nicholas Bilokapic made a string of saves against League Two leaders Walsall, who also hit the woodwork twice.\n\"We started the game ever so well, but typical us, we just gave a goal away from nothing,\" said Ferguson.\n\"At 3-1, it's about managing the game and the players taking responsibility of the pitch but in the last minute of the first half, we almost tried to give another goal away.\"\nMothersille's second of the night made it 4-1 to Posh, but they conceded another in stoppage time - which Ferguson described as \"a bit of a mess\" after the ball ended up in the net after a Bilokapic clearance was charged down.\n\"He made too many saves, they had far too many shots at goal. If he makes all those saves, just don't make the mistake at the end because that's all anyone is going to talk about,\" Ferguson added.", "url": "https://www.bbc.com/sport/football/articles/cjex99g31leo"}