{"authors": ["Laura Scott", "Mike Henson", "www.facebook.com"], "date_download": "2025-05-21 04:21:23", "date_modify": "2025-05-21 04:21:23", "date_publish": "2025-01-23 18:00:50", "description": "Under-fire RFU chief executive Bill Sweeney says he has never contemplated leaving his post despite a grassroots rebellion demanding his sacking.", "filename": "sport_rugby-union_articles_cpqlnzdl2pjo_1747801283.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a8fd/live/0f299e10-d9ad-11ef-a37f-eba91255dc3d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cpqlnzdl2pjo_1747801283.html", "title": "Bill Sweeney: RFU chief never considered resignation", "title_page": "Bill Sweeney: RFU chief never considered resignation - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Embattled Rugby Football Union chief executive Bill Sweeney says that he has never contemplated resigning, saying it would be \"the cowardly way out\".\nSweeney will face a vote of no confidence in a showdown meeting between the RFU hierarchy and its critics on 27 March.\nThe chief executive has been criticised for overseeing record RFU losses and a new round of job cuts in the same year that a bonus scheme pushed his pay to £1.1m.\nHis opponents have also cited the botched roll-out of new rules around tackle height in 2023, the money spent in compensation to fired England coaches and a loss of support for the game's leadership among grassroots volunteers as reasons that Sweeney should be dismissed \"as soon as practicably possible\".\nThe crisis prompted chairman Tom Ilube to resign in December, with Ilube saying that \"recent events have become a distraction from the game\".\nHowever Sweeney, who was hired by the RFU from the British Olympic Association in 2019, says he has no intention of standing down.\n\"No, never, not once,\" he replied when asked by BBC Sport if he had considered leaving the RFU. \"I do believe we are doing the right things.\n\"I feel as strongly about the role as when I first came in, I have the same energy as I did.\n\"This conversation, it is not pleasant, I would be lying if I said it was a nice experience, but the easiest thing to do would be to pack it all in and go on holiday for a while.\n\"I think that is a cowardly way out.\"\nSweeney also denied speculation that he was planning to ride out the furore in the hope of stepping down in the wake of a successful Women's Rugby World Cup later this year.\nThe tournament is being hosted in England, has already brought in record ticket sales, and the Red Roses are hot favourites to win the World Cup for the first time since 2014.\n\"I saw something a while back saying I have some specific bonus linked to a women's World Cup win - that is not the case, that is not true,\" Sweeney said.\n\"If I was in a mind to step down, I would have done it now and I wouldn't wait until after a women's World Cup.\n\"I still have some unfinished business here until the end of 2027. [England men's head coach] Steve Borthwick is a great coach and we have a great squad of men's players as well as women's.\n\"There is a buzz and a good atmosphere around the place and I would like to see that through.\"\nSweeney has said that, contrary to criticisms of his time in charge, he is proud of the RFU's finances in the wake of the Covid pandemic.\nThe chief executive said record losses in the past financial year were down to the four-year cycle around the men's Rugby World Cup, in which tournament years add extra expenses while wiping money-spinning autumn internationals off the fixture list, and a steep rise in utility and business costs.\nHe also defended his own pay, which was made up of £742,000 and a bonus of £358,000 last year.\nSweeney said that, while he had unsuccessfully explored the possibility of deferring his bonus payment, it was the result of a scheme intended to retain senior leaders through the pandemic and benchmark their performance against specific goals.\n\"When you are the recipient of something like an LTIP [long-term incentive plan], you don't request it, you don't design it, you don't set the criteria for its payment,\" he said.\n\"The payment was against very clear criteria of which 77% were hit, so part of me says that was put in place to deliver something to a level which we delivered.\n\"I don't feel we need to apologise for that scheme.\"\nSweeney and other RFU officials are embarking on a tour of grassroots clubs over the next few months to put forward their case before a special general meeting on his future.\nRob Sigley, the founder of the Community Clubs Union, believes it is already too late for Sweeney to win over many in the sport who feel that too much money has been focused on the elite game.\n\"We have openly called for his head and for him to resign,\" said Sigley of Sweeney.\n\"He sits there at the top and is part of these decision-making processes and he's accountable for it.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/cpqlnzdl2pjo"}