{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:40:28", "date_modify": "2025-05-21 03:40:28", "date_publish": "2025-02-01 18:12:41", "description": "Hibernian 2-0 Aberdeen: What the manager said", "filename": "sport_articles_cqx9y85xr0lo_1747798828.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3aba/live/de6641b0-e0c4-11ef-80f0-273d2cd9a9c9.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cqx9y85xr0lo_1747798828.html", "title": "Hibernian 2-0 Aberdeen: What the manager said", "title_page": "Hibernian 2-0 Aberdeen: What the manager said - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Aberdeen manager Jimmy Thelin: \"I have a really strong feeling before the game, we have gone through the other games we are losing now, how we lose the games, and what competing is all about.\n\"It doesn't matter the system, the way your philosophy is about the basic, the 50-50 duels, how much you run for each other, how you challenge in their box, how they defend your box, all these kinds of things.\n\"We have a strong feeling before the game, [it was] the only thing we have focused on before this game and when the game starts, it's still the same situations that we get hurt from.\n\"First of all is again responsibility when you are a player or a manager.\n\"I take responsibility but I also demand more responsibility from everyone in the collective on the pitch because we have to take, when you sign this contract to represent Aberdeen Football Club you have to understand it's about we have high ambitions in this club and it's not easy to get these ambitions.\n\"You have to give everything you can, every minute of the game, every game, every week in training and do more.\n\"And right now we need to push up this to reach that target otherwise we're going to keep losing and we're going to get in trouble. So, we have to understand that it's an important situation we're in right now.\n\"We have to change and understand that it's an important time for everybody now to look in the mirror and go out in the next game and show much more to our supporters, yourself, myself, everything that you can be proud of yourself.\n\"I'm the manager, so I take responsibility for this. But everybody has to look at themselves in the mirror now, because the fans are travelling to every away game in a challenging time to here to support us and they need to feel more from us when we are out on the pitch, how we are in every duel, how we are catching up in the running, how we sacrifice ourselves in both boxes to give them something back at this moment.\n\"Because that's the basic and that's what's great, the passion, how you compete, how you are competitive, it's not so much about the system or how you play, that's the starting point, then you can build other things, but right now we're missing that and it has happened quick.\"", "url": "https://www.bbc.com/sport/articles/cqx9y85xr0lo"}