{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:53:13", "date_modify": "2025-05-21 04:53:13", "date_publish": "2025-01-15 00:00:00", "description": "Watch live coverage and follow live text as the first round concludes at the Masters Snooker at Alexandra Palace.", "filename": "sport_snooker_live_c9dplqgydl8t_1747803193.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_snooker_live_c9dplqgydl8t_1747803193.html", "title": "Masters Snooker LIVE: Luca Brecel takes on Chris Wakelin, Kyren Wilson beats Zhang Andain first-round action", "title_page": "Masters Snooker LIVE: Luca Brecel takes on Chris Wakelin, Kyren Wilson beats Zhang Andain first-round action - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Brecel advances past Wakelin\nBrecel 6-3 Wakelin\nChris Wakelin fouls as he goes to play a pot on a red with the rest.\nThe Englishman immediately acknowledges his error and know that could be the end for him.\nLuca Brecel does not look under any pressure at all and knocks in a break of 73 to advance.\nBrecel closes in on victory\nBrecel 5-3 Wakelin\nDoes anybody want to win the eighth frame? Luca Brecel and Chris Wakelin both spurn opportunities before the 'Belgian Bullet' knocks in three unbelievable pots on the brown, blue and pink.\nWhen he plays like this. Wow.\nPost\nBrecel 4-3 Wakelin\nTalk about drama. Chris Wakelin is 54 points to the good when he screws back into the left middle pocket as he pots a red into the bottomr right corner.\nJust when you fancy Luca Brecel to clear up though he misses a tough green and we get one of those twitchy frames that'll be decided by whoever knocks it in.\nThe 2023 world champion rolls up behind the blue and manages to get eight points in fouls out of Wakelin, who then gets four back and a free ball. That could well be the frame and it is.\nWakelin responds\nBrecel 3-2 Wakelin\nLuca Brecel is going through his repertoire of shots as he reaches 43 but he can't feather a red into the left middle and Chris Wakelin gets to the table.\nThe Englishman is under a fair bit of pressure but enjoys a run of 67, which pretty much secures the frame for him.\n'What a talent'\nStephen Hendry\nSeven-time world champion on BBC Four\nThis is as good as I have seen Luca Brecel play for a long time. It is great to see. What a talent.\nHe will not want the interval. He is flying at the moment. He does not want to get of the table.\nBrecel back in front\nBrecel 2-1 Wakelin\nChris Wakelin constructs a 47-10 lead but when he misses a red to the left corner it disappears in a flash.\nLuca Brecel can't get a decent position on the final red though and leaves Chris Wakelin snookered on the yellow, which is hanging over the left middle pocket.\nThe Englishman goes round the angles and knocks it in and then plays a couple of great pots on the green and brown. Absolutely brilliant from wakelin, who lets himself down with his attempt to roll the pink into the top left corner.\nBrecel wins that battle on the pink before knocking in a superb long black to take the spoils.\nWakelin takes second frame\nBrecel 1-1 Wakelin\nLuca Brecel gets in first but its a rather messy table and he misses a tricky pot to the left corner.\nChris Wakelin is out of his seat like a shot and gets a frame on the board himself with a break of 69.\nBrilliant Brecel takes the opener\nBrecel 1-0 Wakelin\nLuca Brecel has not really done a great deal since winning the World Championship in 2023 and has only ever won one match at the Masters.\nChris Wakelin, who reached the final of the International Championship and semi-finals of the English Open, is enjoying the better season of the two players.\nThis really could be anyone's match although Brecel lives up to his nickname of the 'Belgian Bullet' with a sensational pot on the brown to get position on the blue and leave Wakelin needing snookers in the opener.\nPost\nWilson 5-4 Zhang\nKyren Wilson wins a nervy ninth frame.\nHe got away with one there, breaking down on 52 and allowing Zhang the chance to steal the frame.\nThe world number 10 misses the black after getting to 26, with the frame seemingly at his mercy and Wilson moves within one of victory.\nZhang levels with century break\nWilson 4-4 Zhang\nMagnificent. Zhang Anda compiles the highest break of the Masters this year with a 141 to get back to all square again.\nKyren Wilson leave him a look at a long red to the green pocket and its frame over.\nThe Chinese player has knocked in considerably more balls than the world champion and will fancy his chances now.\nWilson back in front\nWilson 4-3 Zhang\nA moment of misfortune costs Zhang Anda dearly as he goes in off after potting a red into the middle when looking set for a big score.\nKyren Wilson, who has not potted a ball since the interval responds with a break of 69 to regain the advantage.\nZhang goes through the gears to level\nWilson 3-3 Zhang\nZhang Anda knocks in six red and five blacks before missing a back off its spot to the left corner.\nWas he thinking about that £147,000 bonus for making a maximum?\nIt matters not. He gets back to the table and compiles a break of 83. He is level and has now scored 238 unanswered points.", "url": "https://www.bbc.com/sport/snooker/live/c9dplqgydl8t"}