{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:52:18", "date_modify": "2025-05-21 05:52:18", "date_publish": "2025-01-04 21:08:54", "description": "Annagh United manager Ciaran McGurgan praises his side's clinical finishing in their 3-2 win over Premiership opponents Portadown in the fifth round of the Irish Cup.", "filename": "sport_articles_c4gz155ke9no_1747806738.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9198/live/ca6996d0-cadf-11ef-83a9-0d4de290200e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c4gz155ke9no_1747806738.html", "title": "'We were clinical' - Annagh boss McGurgan on win over Ports", "title_page": "Irish Cup: 'We were clinical' - Annagh boss McGurgan on win over Ports - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Annagh United manager Ciaran McGurgan said his side produced a \"clinical\" display in their \"deserved\" 3-2 Irish Cup fifth-round win over near neighbours Portadown at the BMG Arena on Saturday.\nJames Teelan gave the Premiership side an early lead but goals from Ryan Swan and Jack Evans saw their Championship opponents go in a goal to the good at half-time.\nStephen Murray extended Annagh's lead before Steven McCullough pulled one back for the visitors.\n\"The boys are obviously buzzing after it and overall I thought we deserved it,\" McGurgan told BBC Sport NI.\n\"I thought we were clinical, I thought we worked hard in the first half.\n\"Second half we knew Portadown were probably going to come out and have more possession and come at us but our centre-halves were unbelievable.\"\nThe Annagh boss added that the two-goal cushion afforded to them by ex-Ports striker Murray early in the second half gave them some breathing space.\n\"When our chances came we took them and 3-1 gave us that wee bit of a buffer and we naturally dropped back.\n\"The third goal was massive. It just gives you that wee extra goal. We knew it was going to be an onslaught and we were disappointed with the next goal we conceded.\n\"They did have a lot of possession in those last 10 minutes but our defence was absolutely outstanding, as were our midfielders and forwards holding the ball up as well.\"", "url": "https://www.bbc.com/sport/articles/c4gz155ke9no"}