{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:26:52", "date_modify": "2025-05-20 13:26:52", "date_publish": "2023-08-02 06:31:12", "description": "Fluminense's ex-Real Madrid star Marcelo leaves the pitch in tears after being sent off for a challenge which left Luciano Sanchez with a dislocated knee.", "filename": "sport_football_66380566_1747747612.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/934F/production/_130611773_gettyimages-1586125381.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66380566_1747747612.html", "title": "Marcelo: Tearful Fluminense player sent off after Argentinos' Luciano Sanchez dislocates knee", "title_page": "Marcelo: Tearful Fluminense player sent off after Argentinos' Luciano Sanchez dislocates knee - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Fluminense's former Real Madrid defender Marcelo left the pitch in tears after being sent off for a challenge in which an opponent suffered a horrific injury.\nArgentinos Juniors defender Luciano Sanchez dislocated his left knee when his leg buckled underneath him after Marcelo stood on his shin.\nConcerned players from both teams surrounded Sanchez, 29.\n\"Today I had a very difficult moment on the pitch,\" Marcelo later said.\n\"I unintentionally injured a fellow player. I want to wish him the best possible recovery. All the strength in the world,\" the 35-year-old Brazilian posted on social media., external\nHis club added in a statement: \"Fluminense FC expresses its solidarity and wishes a speedy recovery to Argentinos Juniors defender Luciano Sanchez, who was injured in an accidental move in tonight's match.\"\nArgentinos Juniors thanked the Brazilian club and the player for their messages of concern, saying: \"We are rivals, not enemies.\"\nMarcelo had been dribbling past Sanchez when his leading foot caught the Argentine defender, who had been attempting to make a tackle, high on the shin.\nLocal media, citing doctors at the Sanatorio Finochietto hospital, said Argentine Sanchez would have a likely recovery time of eight to 12 months.\nThe last-16 Copa Libertadores match at the Diego Armando Maradona stadium in Buenos Aires ended in a 1-1 draw.\nAfter the game, Fluminense coach Fernando Diniz - who is also Brazil's national team coach - told a news conference that it was \"an unfortunate event\" and said Marcelo did not deserve to be sent off.", "url": "https://www.bbc.com/sport/football/66380566"}