{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:10:10", "date_modify": "2025-05-21 06:10:10", "date_publish": "2025-03-31 10:24:51", "description": "Man City: Nico O'Reilly's impressive performance against Bournemouth", "filename": "sport_football_articles_cly5wdgw16do_1747807810.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/581e/live/108e0e60-0e16-11f0-8331-61229d24cb73.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cly5wdgw16do_1747807810.html", "title": "Man City: Nico O'Reilly's impressive performance against Bournemouth", "title_page": "Man City: Nico O'Reilly's impressive performance against Bournemouth - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "After his two assists off the bench against Bournemouth, Manchester City's Nico O'Reily has been directly involved in five goals in four FA Cup appearances this season (three goals, two assists) - only bettered by Exeter's Josh Magennis.\nIllustrating his impact on the quarter-final, the 20-year-old also became the first City substitute to assist two goals in a game since Ilkay Gundogan against Leeds in December 2021.\n\"My instructions were to just get involved as much as I can in the attacking phase and make sure I'm secure in the defensive phase,\" O'Reilly told BBC Radio Manchester.\n\"It was good to get the contributions with the two assists so I'm just buzzing.\"\nNaturally a forward-thinking midfielder, O'Reilly's physicality and attacking instinct is shown in his touch map - but his defensive solidity was particularly impressive for a player not used to filling the left-back berth.\nHe was bought on at half-time and the Cherries did not have a shot in the entire second period.\n\"Towards the start it was a bit challenging because I've not really played there but I know what I need to do there and I'm just buzzing I can play,\" O'Reilly added.\n\"I'm just grateful for the opportunities I get from the manager and to play with the players who are out there.\"", "url": "https://www.bbc.com/sport/football/articles/cly5wdgw16do"}