{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:24:36", "date_modify": "2025-05-21 07:24:36", "date_publish": "2025-03-28 15:23:11", "description": "London Irish remain on course for a 2026 return despite the death of former Formula 1 team owner Eddie Jordan, his son says.", "filename": "sport_articles_c04z4en4dv1o_1747812276.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/fd28/live/b9be5b60-0be2-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c04z4en4dv1o_1747812276.html", "title": "London Irish: 2026 return on course despite death of Eddie Jordan", "title_page": "London Irish: 2026 return on course despite death of Eddie Jordan - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "London Irish remain on course for a 2026 return despite the death of former Formula 1 team owner Eddie Jordan, his son says.\nThe Exiles were bought out of administration by a consortium led by Jordan last month.\nJordan, who also worked as a TV pundit, died in Cape Town, South Africa, on Thursday 20 March, having had aggressive prostate cancer. He was 76.\n\"Our strategy remains firmly in place. We're on track to return to competitive rugby by September 2026 and nothing has changed in that pursuit,\" said interim London Irish chief executive officer Kyle Jordan, son of Eddie Jordan.\nLondon Irish set out their plan to return under a fan ownership model in 2026 six days prior to Jordan's death.\nThe Jordan Group said their core aims were to secure a league for the club to compete in, as well as a home ground in west London, and to establish a women's team and academy, before handing over to fan ownership.\n\"London Irish was never about one person. Our mission is, and will always be, to build something lasting - something rooted in Irish identity, global ambition and community,\" Kyle said in a statement, external on LinkedIn.\n\"While Dad was a huge inspiration behind this journey, our plans were always built to move with him in the background.\"\nJordan's Formula 1 team won four grands prix in its 15 years and gave seven-time world champion Michael Schumacher his debut in 1991.\nTributes came in from across the motor racing world in the wake of the Irishman's death and his son described his \"huge\" loss.\n\"He was my mentor, my hero, and the person who helped shape how I see the world - through competition, culture and relentless belief,\" Kyle added.\n\"His passing leaves a huge void in my life and in the spirit of the sporting world we both loved.\"", "url": "https://www.bbc.com/sport/articles/c04z4en4dv1o"}