{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:08:22", "date_modify": "2025-05-21 06:08:22", "date_publish": "2025-01-14 10:32:50", "description": "Chelsea vs Bournemouth predictions: Chris Sutton on Premier League game", "filename": "sport_football_articles_c14nlnk04deo_1747807702.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9ff1/live/e10ab7f0-d1d5-11ef-87df-d575b9a434a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c14nlnk04deo_1747807702.html", "title": "Chelsea vs Bournemouth predictions: Chris Sutton on Premier League game", "title_page": "Chelsea vs Bournemouth predictions: Chris Sutton on Premier League game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "This is going to be another close game. Chelsea really need to win it, after going four league games without a win.\nIt feels like the busy festive period has taken its toll on their young squad but they are not just going to give up on their title hopes, no matter how slim they are.\nBournemouth, who have gone eight league games unbeaten, are in much better form and I feel like I have doubted them too often when I have made my predictions this season.\nThe Cherries always create chances and score goals. I don't think that will change much even with Evanilson and Enes Unal both out injured, but will they be quite as ruthless? I am not sure - but that could just be me being too cautious about backing them, again.\nThe other part of my thinking here is that Chelsea are going to return to winning ways at some point. They are at home, and they should have beaten Crystal Palace in their last league game, so they could click again here.\nI just know that whichever way I go with this game, I am going to get it wrong. I suppose the safe bet is a draw, but I am not very confident about it.\nSutton's prediction: 1-1", "url": "https://www.bbc.com/sport/football/articles/c14nlnk04deo"}