{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:09:09", "date_modify": "2025-05-20 13:09:09", "date_publish": "2023-08-02 13:35:04", "description": "Derry City manager Ruaidhri Higgins is confident his side can progress to the third qualifying round of the Europa Conference League with a positive result against KuPS in Finland on Thursday.", "filename": "sport_northern-ireland_66383528_1747746549.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1EAB/production/_130615870_inpho_02299287.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_northern-ireland_66383528_1747746549.html", "title": "Europa Conference League: Derry City boss Ruaidhri Higgins hopeful for 'special' result against KuPS", "title_page": "Europa Conference League: Derry City boss Ruaidhri Higgins hopeful for 'special' result against KuPS - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Derry City boss Ruaidhri Higgins says his side can \"get a special result\" against KuPS in Thursday's Europa Conference League second qualifying round second leg in Finland.\nSecond-half goals from Will Patching and Cian Kavanagh helped the Candystripes come from behind to win 2-1 in the first leg at the Brandywell.\nDerry face a challenging away leg in Kuopio after last week's victory.\n\"It would be absolutely amazing,\" said Higgins said of possible progression.\nThe Derry manager added: \"They are a proper team. A really, really good team who are ranked 222 places above us\" (218 places above according to UEFA Club Coefficients, external).\n\"They've got real experience in Europe but we know if we replicate our performance in the Brandywell then we can go over there and get a special result.\"\nDerry City exited the competition in the first qualifying round during last summer's campaign, losing 2-0 in both legs against Latvian side Riga FC.\nA win, a draw or a draw against KuPS will see Higgins' side reach the third qualifying round of the competition for the first time.\nThe League of Ireland side have only conceded one goal in the club's European campaign so far this year, a first-half penalty against KuPS in the first leg last week.\n\"I think our defensive record is really, really good and we take pride in it, the players take pride in it,\" explained Higgins.\n\"We know that we've got players who can win matches in an instance. If we don't have to score, great. If we do have to score then we've got the talent within our group to do that.\n\"If we are going to go there and get a result then we know that we are going to need to be defensively really good as well.\n\"Everyone knows what is expected of them, it's been a real team effort in that sense.\"\nElsewhere, in the second legs of the second qualifying round, Crusaders travel to Norway still with a chance of qualifying for the third round after a well deserved 2-2 draw against Rosenborg at Seaview.\nGoals from Philip Lowry and BJ Burns kept Stephen Baxter's side well in contention heading into the return match in Trondheim.\nBaxter says that he is under \"no illusions\" of the challenge that their opposition will present.\n\"They will be very confident and very happy leaving here [the first leg] 2-2,\" said Baxter.\n\"We were probably trying to make sure that we stay in the tie and keep this whole thing alive and not lose heavily in our home fixture and then we'd have nothing to play for on Thursday, so I think we accomplished that and more.\n\"We had that wonderful opportunity [in past years] to go and play Wolves and we also played FC Basel, so we were playing two very high standard teams and we learned a lot from those games.\n\"We don't underestimate how difficult this will be against Rosenborg but it's something that we are looking forward to, the challenge.\"\nLarne and Linfield both face difficult tasks as they go into their second legs with heavy deficits.\nLarne trail Kosovo champions Ballkani 3-0 as they prepare for the second leg of their tie at Solitude.\nLinfield also trail by three goals following a tough night at Windsor Park, losing 5-2 to Pogon Szczecin in Belfast.\nThe Blues travel to Szczecin in Poland facing an uphill challenge against the Ekstraklasa club.", "url": "https://www.bbc.com/sport/northern-ireland/66383528"}