{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:37:34", "date_modify": "2025-05-21 06:37:34", "date_publish": "2025-04-01 00:00:00", "description": "Chesterfield seal win as first-half dismissal costs Carlisle", "filename": "sport_football_live_cwyny54393yt_1747809454.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/aba2/live/d74997c0-0ed6-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cwyny54393yt_1747809454.html", "title": "Chesterfield 2-1 Carlisle United", "title_page": "Chesterfield 2-1 Carlisle United: League Two - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Chesterfield eased to a win over the EFL's bottom club Carlisle, who had first-half substitute Elliot Embleton sent off before the break.\nLiam Mandeville and Paddy Madden scored the goals which lifted the Spireites within four points of the League Two play-off places and left their opponents nine points from safety at the bottom.\nThe visitors scored a late consolation through Joe Hugill.\nChesterfield's Michael Olakigbe tried a shot which took a deflection wide early on while Jenson Metcalfe saw his 25-yard effort go just over.\nOllie Banks tested Gabriel Breeze with an effort which the keeper did well to turn over.\nEmbleton, a 29th-minute replacement for the injured Sean Fusire, was sent off five minutes before the break after catching Armando Dobra with his studs.\nDobra saw a fierce shot tipped over by Breeze with the keeper also keeping out efforts from the midfielder and Olakigbe soon afterwards.\nChesterfield's dominance finally paid off in the 73rd minute when Mandeville fired in from close range, following up after Metcalfe's shot had been blocked.\nThe second goal came when Dobra's shot thumped against the bar and Madden headed in the rebound.\nSubstitute Hugill reduced the arrears, capitalising on an error from Jamie Grimes, but it was little consolation for United.", "url": "https://www.bbc.com/sport/football/live/cwyny54393yt"}