{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 08:04:38", "date_modify": "2025-04-26 08:04:38", "date_publish": "2025-02-26 15:40:39", "description": "Fabian Edwards will make his return to action in the 2025 PFL middleweight tournament.", "filename": "sport_mixed-martial-arts_articles_crrd0421dd7o_1745654678.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6622/live/9075ca10-f916-11ef-8c03-7dfdbeeb2526.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_mixed-martial-arts_articles_crrd0421dd7o_1745654678.html", "title": "MMA: Fabian Edwards and Jake Hadley among seven Britons to fight in PFL 2025 tournament", "title_page": "MMA: Fabian Edwards and Jake Hadley among seven Britons to fight in PFL 2025 tournament - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Fabian Edwards and Simeon Powell will fight in the PFL's 2025 tournaments which will see the eventual champions win £395,000 ($500,000) of prize money.\nPowell and Edwards are two of seven British contenders across the middleweight, light-heavyweight, bantamweight, heavyweight and lightweight divisions.\nIn the lightweight tournament, England's Alfie Davis and Marc Diakiese will compete.\nFormer UFC fighter Jake Hadley will fight in the bantamweight tournament, which will also includes Irishman Ciaran Clarke.\nIn the middleweight tournament, Edwards is joined by Mike Shipman, while in the light-heavyweight tournament Powell is joined by Northern Ireland's Karl Moore.\nMilton Keynes fighter Linton Vassell will fight in the heavyweight tournament.\nThe first-round fight nights will take place on 3 April, 11 April, 18 April and 1 May, and contrary to previous years, the bouts will be knockout from the start.\nThe new-look 2025 tournaments were part of sweeping changes the PFL made to its format this year, with the likes of 2025 PFL champion Dakota Ditcheva not part of the new set-up and instead competing on the PFL's new 'PFL Champions Series'.\nOpponents are yet to be announced, but the middleweight tournament will also include former PFL champions Impa Kasanganay (light-heavyweight) and Sadibou Sy (welterweight).\nEdwards, 32, was one of a limited number of Bellator's biggest stars to fight regularly in 2024 and competed for the now defunct Bellator middleweight title last October.\nJohnny Eblen beat Edwards in that bout and the Birmingham fighter will now face a new list of contenders.\nEdwards will be among the favourites to win the tournament, having already beaten Shipman and Canadian contender Aaron Jeffery.\nHadley left the UFC last year after a run of three wins and four losses in the promotion but will be among the favourites in the bantamweight tournament, as will PFL Europe finalist Powell and former Bellator title challenger Moore at light-heavyweight.", "url": "https://www.bbc.co.uk/sport/mixed-martial-arts/articles/crrd0421dd7o"}