{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:32:04", "date_modify": "2025-04-26 06:32:04", "date_publish": "2025-02-27 08:38:05", "description": "Tottenham 0-1 Man City: Fan views", "filename": "sport_football_articles_c4gdddxwpkwo_1745649124.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c4gdddxwpkwo_1745649124.html", "title": "Tottenham 0-1 Man City: Fan views", "title_page": "Tottenham 0-1 Man City: Fan views - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "We asked for your thoughts after Wednesday's Premier League game between Tottenham and Manchester City.\nHere are some of your comments:\nTottenham fans\nPhil: As injuries ease and first-choice players return we will see that Spurs remain limited by Ange's one-dimensional tactics. We will still be wide open at the back, still be vulnerable to any half decent transition and still have very few ideas in the final third beyond get it wide and fire it in low. That was the story against Manchester City and it will continue to be the story with this coach at the helm.\nWilliam: Ultimately a disappointing performance and result, especially given the momentum we seemed to have been building from the last couple of results. We seemed to lack a cutting edge going forward and rather unusually for us seemed a bit timid in the first half. However, the second half performance was more like it and we should benefit from the return of Dominic Solanke and Richarlison to provide a focal point to our attacks.\nMo: Dominated by City in the first half. Feared a little better in the second half. Bringing on Timo Werner who has offered little this season was perplexing. Fourteen losses and counting is unsustainable and unacceptable.\nSteve: Spurs lost it in the first half. Dreadful, passive performance. The team selection and lack of proper tactics were very poor. You have to control midfield against this tired City - the game was winnable for Spurs but Ange got it wrong.\nMichelle: To lose 1-0 to City is progress. It goes to show how we have missed the injured players these past months. We just have to believe.\nManchester City fans\nRigs: Both Savinho and Jeremy Doku have brilliant speed and skill, but it's the final pass which lets them down.\nDaniel: Another 10 minutes and it would have been two dropped points. Struggling to put games to bed as usual. When is Pep Guardiola going to realise that slow build ups, playing it back, or playing it anywhere other than going direct isn't working anymore?\nLee: City played really well first half and should have scored more goals. We always knew the second half was going to be hard and you need luck in this game and we had a lot of it second half. Tottenham never had their shooting boots on.", "url": "https://www.bbc.co.uk/sport/football/articles/c4gdddxwpkwo"}