{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:56:52", "date_modify": "2025-05-21 07:56:52", "date_publish": "2025-01-13 14:56:40", "description": "'I'll certainly be first to put myself forward' - Tanser keen to take penalties", "filename": "sport_articles_cr7envllkr3o_1747814212.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4634/live/70c49ea0-d1be-11ef-8a2a-b1f18b093115.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cr7envllkr3o_1747814212.html", "title": "'I'll certainly be first to put myself forward'", "title_page": "'I'll certainly be first to put myself forward' - Tanser keen to take penalties - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "\"Confident\" Scott Tanser has revealed he will \"put himself forward\" for the challenge, and pressure, of taking penalties for St Mirren, should he be asked.\nThe Buddies missed a fourth penalty of the season on Saturday when Toyosi Olusanya saw his spot-kick saved in the 1-0 defeat to Dundee United and now the full-back has thrown his hat into the ring.\n\"I put myself forward when I was at St Johnstone where I took penalties and so I'm happy to step forward on that aspect if I'm called upon,\" the 30-year-old said following the defeat in Paisley.\n\"I back myself and I'm confident but at the end of the day, it's a team decision and we'll reassess and see who takes the next one.\n\"I've not asked but if I get asked, I'll certainly be first to put myself forward.\n\"It's whoever feels confident. Obviously people have missed, but they are confident penalty takers.\n\"Toyosi was confident enough to take it, he did, he's missed and there's nothing else to say about it.\n\"People practice penalties. You can hit so many penalties on the training pitch but, when it comes to the game, there is the added pressure that you have to score.\n\"Sometimes it goes either way. Their keeper has pulled off a good save and they've reacted quickest to put the ball out of play.\n\"Everyone misses penalties. It's a part of the game and we just move on.\"", "url": "https://www.bbc.com/sport/articles/cr7envllkr3o"}