{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:30:32", "date_modify": "2025-05-21 04:30:32", "date_publish": "2025-01-23 15:14:01", "description": "Manchester City news: Fan views on January transfer business", "filename": "sport_football_articles_cly51p7gmz2o_1747801832.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cly51p7gmz2o_1747801832.html", "title": "Manchester City news: Fan views on January transfer business", "title_page": "Manchester City news: Fan views on January transfer business - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The past seven days has shown clear signs of a rebuild underway at Etihad Stadium after an uncharacteristically poor first half of the season from Pep Guardiola's side.\nWe asked for your thoughts of City's activity in the January transfer market and whether they can change the club's trajectory.\nHere are some of your comments:\nCraig: Khusanov, Reis and Marmoush are a solid start to a necessary rebuild that should have started last summer, but the most important piece is still missing - City desperately need a proper back-up for Rodri. Gundogan is finished and should never have been brought back in, and Kovacic is too much of an eight to fill the six role properly. Going in for Zubimendi, Ederson or Douglas Luiz is essential for us to secure a place in the top four. I think we also need a new goalkeeper but that can probably wait until the end of the season.\nYusuf: Despite the signings, I don't think it's the players. I think it's Pep Guardiola. He has had some incredible years at City but he's gotten older and a lot younger managers have been coming in. The tiki taka method he has done for a while seems to not be working due to new tactics being developed. Pep has a hard year and I feel it's getting to him personally, making him more stressed and not able to function as a manager anymore.\nDavid: I wish Omar Marmoush all the luck in the world at City. But, what great business by Frankfurt - signed him on a free and 46 games later, he's worth £59m?!\nJohn: These signings will not solve our problems.\nAndrew: Keep signing exceptional talent in the under-21 bracket, combine with the stars from the academy and all will be well. Pep's team improves talent plus the examples set by the existing world-class experienced players create the perfect framework for the highest potential youngsters to become the superstars of tomorrow.\nBrian: Man City have played a wise hand in a very challenging transfer market. Summer transfers take a long time and often frustrate both players and clubs. Moving strategically in the January transfer window allows for targeted transfers and in the case of Man City fills gaps. A holding midfielder is now essential to support Rodri and build confidence.", "url": "https://www.bbc.com/sport/football/articles/cly51p7gmz2o"}