{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:07:45", "date_modify": "2025-05-21 06:07:45", "date_publish": "2025-01-31 15:12:44", "description": "Truro City extend the loan of defender Christian Oxlade-Chamberlain until the end of the season.", "filename": "sport_football_articles_cx2m39r3711o_1747807665.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/31b2/live/e9e0d190-dfe3-11ef-980d-87f49f932b9b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cx2m39r3711o_1747807665.html", "title": "Oxlade-Chamberlain extends Truro City loan deal", "title_page": "Christian Oxlade-Chamberlain extends Truro City loan deal until end of season - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Truro City have extended the loan of defender Christian Oxlade-Chamberlain until the end of the season.\nThe 26-year-old has played in 27 of the Tinners' 28 National League South games since joining from Kidderminster Harriers in August on a three-month deal, which was extended until the end of this month.\nThe brother of former England and Liverpool player Alex Oxlade-Chamberlain and the son of former England winger Mark Chamberlain has scored one goal this season.\n\"I just wanted to play football and that was the biggest factor in coming here,\" he told the club website.\n\"The gaffer called me the Wednesday before the season started and I said I wanted to play. Nothing has changed and it has felt like a real community, with the fans appreciating everything everyone does.\n\"Where we are at the moment, play-offs is a minimum and anything above that would be pretty good. But we are just trying to win every game we play in and see where that takes us.\"\nTruro City boss John Askey added: \"Christian has been vital to us and it is really pleasing to have him until the end of the season and get (the deal) over the line.\n'It was a worry that someone else would come along and pinch him, but I think he has enjoyed his time at Truro so far, he has been playing week in week out, which is always nice as a player.\"", "url": "https://www.bbc.com/sport/football/articles/cx2m39r3711o"}