{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:37:40", "date_modify": "2025-05-21 05:37:40", "date_publish": "2025-01-31 16:20:42", "description": "Luton Town sign midfielder Josh Bowler on loan from Nottingham Forest for the rest of the season.", "filename": "sport_football_articles_cvgp14269r1o_1747805860.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a8f9/live/1f11b780-dfee-11ef-be6c-9f3ec92972af.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cvgp14269r1o_1747805860.html", "title": "Josh Bowler: Nottingham Forest midfielder joins Luton Town on loan", "title_page": "Josh Bowler: Nottingham Forest midfielder joins Luton Town on loan - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Luton Town have signed midfielder Josh Bowler on loan from Nottingham Forest for the rest of the season.\nThe 25-year-old has moved to Kenilworth Road following the ending of a loan spell at Preston, where he made 13 appearances this season.\nIt is his fifth loan move away from Forest, who he joined from Blackpool in 2022 following earlier spells at QPR and Everton.\n\"Josh is someone with vast Championship experience at a number of different clubs,\" manager Matt Bloomfield told the Luton website.\n\"He's a real creative spark at the top of the pitch, making chances for others and he can finish too. He's got a point to prove and wants to play in a formation that we are looking to use.\"\nBowler's arrival follows the signings of Thelo Aasgaard and Millenic Alli from Wigan Athletic and Exeter City respectively.\n\"I've experienced playing at Kenilworth Road a few times and it's always been one of those grounds that I've found tough to go to,\" he said.\n\"To be able to play there week in, week out with those fans on my side is something I'm really looking forward to.\"", "url": "https://www.bbc.com/sport/football/articles/cvgp14269r1o"}