{"authors": ["Charlotte Cohen", "www.facebook.com"], "date_download": "2025-05-21 04:55:11", "date_modify": "2025-05-21 04:55:11", "date_publish": "2025-04-04 14:49:23", "description": "Celtic: Brendan Rodgers on Schmeichel's injury, league reconstruction & 'remarkable' Maeda", "filename": "sport_articles_c62g3nz0zl6o_1747803311.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5d02/live/4594aef0-1160-11f0-ba60-99b08c2860b3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c62g3nz0zl6o_1747803311.html", "title": "Celtic: Brendan Rodgers on Schmeichel's injury, league reconstruction & 'remarkable' Maeda", "title_page": "Celtic: Brendan Rodgers on Schmeichel's injury, league reconstruction & 'remarkable' Maeda  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "After Kasper Schmeichel was pictured, external back in training this morning despite being ruled out for up to six weeks with a should problem, Rodgers says the goalkeeper \"feels good\", has \"some mobility\" and could be \"back sooner\" but stresses they'll \"have to be careful with the blade and his shoulders\".\nHe adds: \"He can do other things so he's out on the training field and working on the technical side of his game.\"\nOn potential league reconstruction, Rodgers says the division \"doesn't need to get smaller\" but admits he would be happy to see a bigger top flight and thinks it would help \"from a football perspective\".\nRodgers was pleased with the response from his players in last weekend's 3-0 victory over Hearts following the disappointing derby loss.\nHe is urging Celtic to \"be really intense\" and show their \"authority\" against bottom club St Johnstone on Sunday.\nOn Daizen Maeda picking up another player of the month award, Rodgers hailed the forward's \"remarkable season\" as well as the improvement in his technical ability.", "url": "https://www.bbc.com/sport/articles/c62g3nz0zl6o"}