{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:59:17", "date_modify": "2025-05-21 07:59:17", "date_publish": "2025-03-27 17:44:22", "description": "Cardiff City: Riza confident Bluebirds will avoid relegation", "filename": "sport_football_articles_cgr2evjnk9zo_1747814357.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5d54/live/de1e6690-0b32-11f0-b1de-e342f84c59e9.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cgr2evjnk9zo_1747814357.html", "title": "Cardiff City: Riza confident Bluebirds will avoid relegation", "title_page": "Cardiff City: Riza confident Bluebirds will avoid relegation - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cardiff City boss Omer Riza says he firmly believe the club can avoid relegation from the Championship.\nUnder Riza, Cardiff's points-per-game tally would put them 14th in the Championship, but after a record-bad start under previous boss Erol Bulut, the Bluebirds are one point and one place outside of the drop zone.\nRiza faced severe scrutiny before a 2-1 win over Blackburn just before the international break, but the Bluebirds boss says he is sure his side will survive their relegation battle ahead of Saturday's visit from play-off chasing Sheffield Wednesday.\n\"I think we are in a very good place. I feel definitely, yes, we will survive,\" he said. \"The boys know what is being asked of them.\n\"We've lost games everyone expects us to win, but then we go and do something and pick ourselves up again. I feel we are in that moment again now.\n\"We had one point at the start of the season, so where we've come from to where we are now… all we can do is try and win games. Stay positive and win games.\"\nRiza feels confident that his side can pick up the points they need, speculating that around 50 points is likely to be the total needed for safety.\n\"It's in our hands,\" he said. \"At the moment we are above that (relegation) line.\n\"We are one point above the relegation zone. We are focused. We have to take points and avoid relegation.\n\"We need to be in survival mode. We have to do what we have to do.\"", "url": "https://www.bbc.com/sport/football/articles/cgr2evjnk9zo"}