{"authors": ["Chris Forryan", "www.facebook.com"], "date_download": "2025-04-26 04:23:32", "date_modify": "2025-04-26 04:23:32", "date_publish": "2025-03-03 13:10:27", "description": "Leicester news: Opinion - Fan on what is not working at Foxes", "filename": "sport_football_articles_c9vygxng8y4o_1745641412.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4487/live/4f936c40-b629-11ee-bc2f-cb5579b90709.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c9vygxng8y4o_1745641412.html", "title": "Opinion - Fan on what is not working at Foxes - BBC Sport", "title_page": "Leicester news: Opinion - Fan on what is not working at Foxes - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Eat. Sleep. Watch Leicester City play. Write how awful they were. Repeat. Just read my last blog because nothing changes.\nWe still have a manager who does not seem to have a clue. We are still relying on a pensioner up front who gets no service from the rest of the team. We are still playing a system that none of our players can play. We are still picking the same personnel who are losing week in, week out. We are still picking players, none of whom are fit to wear the shirt.\nHow did Ruud van Nistelrooy get the manager's job? On the basis of two wins over a Steve Cooper Leicester side? Was Top so unable to see past appointing a 'famous' ex-player as manager? I mean, he might just appoint Wayne Rooney next!\nThe fans can see what is not working - why can't the manager and board? Do they have a post-match meeting where Van Nistelrooy has to explain himself? Does he turn up or just send in a tape of the previous meeting and say: \"Same as last time\" as the board doff their hats and say: \"Thank you kindly, Mr Van Nistelrooy\"?\nThe manager said we could do another great escape. More rubbish. Last time we survived we had a manager in Nigel Pearson that the players would walk on glass to perform for. A manager who had the nouse to know when things were not working.\nThings need to change, from The Top down. Maybe no-one should turn up to the next home game, and we hit the club where it hurts: in their pockets.", "url": "https://www.bbc.co.uk/sport/football/articles/c9vygxng8y4o"}