{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:06:17", "date_modify": "2025-05-21 06:06:17", "date_publish": "2024-12-24 15:25:21", "description": "Fleetwood Town appoint former Oldham Athletic, Halifax Town and Barrow manager Pete Wild as their head coach.", "filename": "sport_football_articles_cd9xeklevx1o_1747807577.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/de8e/live/955e63a0-c209-11ef-8a89-27b3f287e995.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cd9xeklevx1o_1747807577.html", "title": "Pete Wild: Fleetwood Town appoint ex-Oldham and Barrow boss as head coach", "title_page": "Pete Wild: Fleetwood Town appoint ex-Oldham and Barrow boss as head coach - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Fleetwood Town have appointed former Oldham Athletic, Halifax Town and Barrow manager Pete Wild as their head coach.\nThe 40-year-old has agreed a deal of undisclosed length with the League Two club following Charlie Adam's exit at the weekend.\nWild will take over on 27 December with current first-team coach Matt Lawlor in charge for the Boxing Day visit of Chesterfield.\n\"I am really excited to have the opportunity to manage such a progressive football club,\" Wild told the club website., external\n\"Although discussions have moved quickly, both myself and [assistant boss] Adam [Temple] feel like there is a clear direction from everyone at the football club and we really feel we can support that journey.\n\"We can't wait to meet everyone and get fans, staff and players moving in a forward direction.\"\nFleetwood sacked Adam after just under a year in the job following a run of one win in 11 league games.\nThe Cod Army lost 2-0 at Barrow on Saturday, their fifth defeat in a run which also included five draws, and were knocked out of the FA Cup round by Reading at the first-round stage.", "url": "https://www.bbc.com/sport/football/articles/cd9xeklevx1o"}