{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:31:01", "date_modify": "2025-05-21 05:31:01", "date_publish": "2025-01-14 13:20:22", "description": "Shrewsbury Town midfielder Harrison Biggins returns to the League One strugglers following speculation over Tom Bloxham's future.", "filename": "sport_football_articles_cm29mr81wwwo_1747805461.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ecf4/live/9b03bc40-d273-11ef-87df-d575b9a434a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cm29mr81wwwo_1747805461.html", "title": "Shrewsbury Town: Harrison Biggins returns following Tom Bloxham talk", "title_page": "Shrewsbury Town: Harrison Biggins returns following Tom Bloxham talk - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Shrewsbury Town have brought back Harrison Biggins from his loan with League Two side Carlisle United following speculation over the future of fellow midfielder Tom Bloxham.\nTown's League One rivals Blackpool are the side most strongly linked with 21-year-old Bloxham, who has made 126 appearances - with almost half of those from the bench - since making his debut at the age of 16 in September 2020.\n\"It's probably not just Blackpool who are interested in him,\" Town boss Gareth Ainsworth told BBC Radio Shropshire.\n\"Although that's the reports coming out at the moment and we'll see where that one goes.\n\"But there's a board here. It would be a group decision as to what it would take to get Tom out of here or to get him to stay.\n\"If people weren't interested in Tom Bloxham, then I'd be surprised. He's a threat, a quick player, a ball carrier. He's done well in his time here.\"\nTown also face the threat of losing another midfielder in the window - 31-year-old once-capped Northern Ireland international Carl Winchester, who has been linked with a return home.", "url": "https://www.bbc.com/sport/football/articles/cm29mr81wwwo"}