{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:58:41", "date_modify": "2025-05-21 05:58:41", "date_publish": "2025-01-04 18:29:48", "description": "Celtic: 'Huge statement of intent' or 'massive risk' - your views on potential Tierney return", "filename": "sport_articles_clygry9pgwro_1747807121.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b67f/live/d6631670-cac9-11ef-9fd6-0be88a764111.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_clygry9pgwro_1747807121.html", "title": "'Huge statement of intent' or 'massive risk' - your views on potential Tierney return", "title_page": "Celtic: 'Huge statement of intent' or 'massive risk' - your views on potential Tierney return - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your thoughts on Kieran Tierney's potential return to Celtic after the Parkhead club held talks with the Arsenal defender.\nHere's the best of what you had to say:\nDanny: I think it's a great move. Super experienced player and with Alex Valle and Greg Taylor potentially on way out it could be a class signing. Would love to have him back.\nAnon: Tierney is a massive risk because he has been injury prone for three years. Why would we sign a player with that fitness history and pay him all that money?\nBrian: Getting Tierney on loan till end of season with the option to buy would be best idea. He could then prove if he could stay fit.\nPeter: Very good player when he played at Celtic. Unfortunately injuries and time have taken their toll. Not the same player. Would not add to what we already have. Players coming back seldom work out for the player or the team. Better to spend money on a quality goal scorer.\nMichael: I wouldn't sign Tierney. There is no denying he's a great player but his injury history is brutal. The board took the £25m for him knowing he was injury prone. They were 100% correct. He's hardly kicked a ball since he left.\nStephen: Left-backs are the rarest footballers. A fully-fit Tierney is a world-class performer. On that basis alone, a Celtic fan who has every attribute necessary at 27-years old is a no-brainer.", "url": "https://www.bbc.com/sport/articles/clygry9pgwro"}