{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:08:54", "date_modify": "2025-05-21 07:08:54", "date_publish": "2025-03-30 12:20:46", "description": "Rotherham United sack manager Steve Evans following their run of seven defeats in 11 League One games.", "filename": "sport_football_articles_c62jrzj83ejo_1747811334.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e93d/live/bf0b72c0-0d62-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c62jrzj83ejo_1747811334.html", "title": "Steve Evans: Rotherham United sack manager after Crawley defeat", "title_page": "Steve Evans: Rotherham United sack manager after Crawley defeat - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Rotherham United have sacked manager Steve Evans following their run of seven defeats in 11 League One games.\nThe 62-year-old Scot, who was in his second spell as Millers boss, had come under fire from fans after Saturday's 4-0 hammering at home by relegation-threatened Crawley Town, which pushed Rotherham down to 16th place in the table.\nThe club confirmed in a statement, external on Sunday they had parted company with Evans, along with his backroom staff Paul Raynor, Gary Mills and Ian Pledger.\nFormer Rotherham coach Matt Hamshaw, who served as caretaker boss of Derby County last month, has been appointed to take temporary charge until the end of the season, assisted by Andy Warrington.\nSaturday's defeat by Crawley, a club Evans guided into the Football League earlier in his managerial career, was the Millers' heaviest of the season and prompted some supporters at New York Stadium to call for his dismissal.\nSpeaking to BBC Radio Sheffield after the game, Evans said: \"There's no hiding place when you have a performance like that. The performance was limp, way off the minimum standards we expect.\n\"Everything that my teams have been famous for was not deployed. I think this is as low as it's been in 31 years as a manager.\n\"Maybe my credit's run out. I've had fantastic times at this club and, if the decision is made to remove me, I'll be back in the future as a fan.\"\nDuring his initial three-and-a-half-year stint as Rotherham boss from 2012 to 2015, the Glaswegian oversaw successive promotions and kept the club in the Championship.\nAfter leaving in September 2015, he took over at Leeds United a month later but departed Elland Road at the end of that season after eight months at the helm.\nHe subsequently took charge at Mansfield Town, Peterborough United and Gillingham, as well as leading Stevenage to promotion from League Two in 2023.\nEvans rejoined the Millers in April 2024, when their relegation back to the third tier had been confirmed – but they have failed to mount a promotion challenge this term and he leaves with the club nine points above the bottom four.\nAnalysis - Rob Staton, BBC Radio Sheffield\nThe boos started in the 15th minute against Crawley. When Rotherham conceded their second goal just after half-time, many of the crowd, already feeling lower than usual, headed for the exits.\nAt one point an angry fan came up to me in the press box demanding I get answers from Steve Evans and [owner] Tony Stewart as to why things were so bad.\n\"We want Evans out\" and \"You're not fit to wear the shirt\" were the calls at the end of the game. This was how toxic things had become on Saturday.\nStewart wanted to recapture the magic of the past when Evans led the Millers to back-to-back promotions.\nFor a number of reasons it didn't work out. The manner of the performance against Crawley meant the writing was on the wall, and I think the manager knew that when he spoke to us after the game.\nThe problem is Rotherham are now going through managers and there doesn't seem to be any stability. The identity, culture and DNA of the Paul Warne era suddenly feels like a long time ago.\nThus, Matt Hamshaw is an inspired appointment until the end of the season. He knows the club inside out and was a big part of Warne's staff. We're talking about a coach who is highly rated within English football circles.\nThis is an ideal opportunity for the club and the new boss to see, over the remaining eight games, whether this is a fit for the long term.", "url": "https://www.bbc.com/sport/football/articles/c62jrzj83ejo"}