{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:37:06", "date_modify": "2025-05-20 14:37:06", "date_publish": "2023-07-28 14:24:56", "description": "Sweden play Italy, France take on Brazil and Panama face Jamaica on day 10 of the Fifa Women's World Cup.", "filename": "sport_football_66335671_1747751826.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/14863/production/_130576048_gettyimages-1566696721.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66335671_1747751826.html", "title": "Fifa Women's World Cup day 10: Sweden v Italy, France v Brazil, Panama v Jamaica", "title_page": "Fifa Women's World Cup day 10: Sweden v Italy, France v Brazil, Panama v Jamaica - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A France and Brazil showdown - live on the BBC - headlines day 10 of the 2023 Fifa World Cup in Australia and New Zealand.\nHerve Renard's France side could be without their captain and centre-back Wendie Renard as they hope to hold off a Brazilian team that put four past Panama in their opening group game.\nSweden play Italy (08:30 BST) in Wellington, followed by France v Brazil (11:00 BST) in Brisbane, with Panama v Jamaica (13:30 BST) in Perth the last game of day 10.\nHere is what to look out for.\nGroup G | Wellington | 08:30 BST | BBC\nSweden and Italy crept through their opening Group G games by the skin of their teeth with wins thanks to late goals against South Africa and Argentina respectively.\nCristiana Girelli's 87th-minute winner meant Italy have already bettered their performance at last summer's European Championships, when they failed to win a game after a humiliating 5-1 defeat by France.\nItaly manager Milena Bertolini believes her side can use that momentum to carry them forward.\n\"In that first [Euro 2022] match we made a lot of mistakes, we suffered a very heavy loss that then impacted our excitement, our confidence for the rest of the tournament,\" Bertolini said\nHowever, third-ranked Sweden are \"the whole package\", according to Bertolini, and have their own momentum after Amanda Ilestedt's last-minute winner against South Africa.\nSweden midfielder Kosovare Asllani plays her club football in Italy at AC Milan and knows what to expect against Bertolini's side.\n\"I'm quite used to that type of football. It's very focused on man-marking and we know that there will be tough situations,\" she said.\nBBC Sport football expert Rachel Brown-Finnis' prediction: Sweden did not make things easy for themselves against South Africa, but just about got away with it in the end.\nI don't think they will have as much trouble putting Italy away, and they should book their place in the last 16 here. 2-0.\nKey stat: Italy have never beaten a fellow European nation at the World Cup, losing three of their four games against such opposition.\nGroup F | Brisbane | 11:00 BST | BBC\nSaturday's showdown between France and Brazil is a repeat of the of the last-16 game from the 2019 tournament, which hosts France won 2-1.\nThe Brazilians got their 2023 tournament off to a great start, cruising to a 4-0 victory over Panama but, despite the big scoreline, manager Pia Sundhage says her side need to be more clinical in front of goal.\n\"Sometimes they are out there and they try to be too fancy,\" Sundhage said.\n\"When they are fancy and it works it is beautiful. But sometimes I have to remind them that scoring goals is also pretty cool.\"\nBrazil's ability to be more clinical may be influenced by the availability of France captain and centre-back Wendie Renard, who has been struggling with a calf injury since the opening 0-0 draw against Jamaica.\n\"We hope everything goes well, we need her. We are not 100% tonight [sure if she will be fit], will know tomorrow,\" France manager Herve Renard said on Friday.\n\"She will make the decision [if she plays], it's not up to me, she knows her body and has experience at a high level. We need her, but we need this type of player as we advance in this competition. She has great charisma and can hold this team together.\"\nFrance full-back Sakina Karchaoui added: \"She's our captain, a very strong element in the team. We just hope for the best for her, it's always complicated when you have a [injury] problem during a competition.\"\nBrown-Finnis' prediction: This is a really tasty one - France were frustrated by Jamaica in their first game but Brazil's attack was up and running straightaway against Panama.\nI see France as being similar to England, really, in that they are going to get better as this tournament continues.\nBrazil will go at France, too, which might make things easier for them and I can see them edging this - with both teams still making it through to the last 16 in the end. 2-1.\nKey stat: Brazil are unbeaten in their past eight group stage matches against European opposition at the World Cup.\nGroup F | Perth | 13:30 BST | ITV\nHistory could be made in the final Group F fixture on Saturday, with both Panama and Jamaica never having won a World Cup match.\nDebutants Panama are searching for their first goal in the competition, following the heavy 4-0 defeat to Brazil in their inaugural fixture, while Jamaica enter the match without their captain Khadija 'Bunny' Shaw.\nThe Manchester City striker was sent off in the 0-0 draw with France on Sunday.\nJamaica defender Allyson Swaby, 26, believes that while clinching a first World Cup victory would aid her nation's chances of progress in the 2023 competition, the impact of such a landmark will be massive back home.\n\"The message that we want to send has always been the same - that women's football is legitimate,\" she said.\n\"We're here to compete, this is our livelihood, it's the thing that brings us joy, it's our passion.\n\"Ultimately, how we perform in this tournament is just more credibility for us moving forward, fighting for the things that we want to see changed.\"\nBrown-Finnis' prediction: It's a blow for Jamaica that Shaw is suspended, but they should still win this game without her.\nI can actually see Jamaica keeping another clean sheet too, unless Panama improve a lot on their poor performance against Brazil. 0-1.\nKey stat: Only fellow Concacaf team Costa Rica (74) completed fewer passes than Panama (119) and Jamaica (99) during the first gameday of this World Cup.", "url": "https://www.bbc.com/sport/football/66335671"}