{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:55:12", "date_modify": "2025-05-21 03:55:12", "date_publish": "2025-04-07 13:58:15", "description": "Bristol Bears Women head coach Dave Ward is leaving the club after four years in the role.", "filename": "sport_rugby-union_articles_cvgn1pnzw27o_1747799712.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4bd3/live/32bc1d10-13b6-11f0-92ad-eb42d450dc76.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cvgn1pnzw27o_1747799712.html", "title": "Dave Ward: Bristol Bears Women head coach to leave club", "title_page": "Dave Ward: Bristol Bears Women head coach to leave club - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Bristol Bears head coach Dave Ward is leaving the Premiership Women's Rugby club after four years in the role.\nFormer Harlequins forward Ward has led the side to four successive PWR semi-finals and one final during his time in charge.\nThe Bears were beaten by eventual winners Gloucester-Hartpury in this year's semi-final in what has proved to be his last game at the helm.\nIn a statement,, external the club said Ward was leaving to pursue a \"new opportunity\".\n\"I would like to thank Bristol Bears for the opportunity to coach the women's programme for the last four years – an opportunity that I've absolutely loved and one that I will hold very close for many years to come,\" Ward told the club's website.\nWard, 39, had spells with Bath, Northampton Saints and Sale Sharks before establishing himself with Cornish Pirates.\nHe joined Quins in 2012, on the back of the club's first ever Premiership title win, and made 155 appearances in the quarters, scoring 10 tries.\nThe highlight of his time in charge of the Bears came in 2023-24, when Bristol faced Gloucester-Hartpury in the final at Sandy Park.\nBut it was their west country rivals who emerged victorious with a 36-24 win, claiming their second of three consecutive PWR titles.\n\"I've always known the people of Bristol are special, but the support that the women have had over the years that I have been here has been much more than I could have ever hoped for,\" Ward added.\n\"Lastly, and most importantly, I would like to thank the players. Their dedication, skill and commitment on a week-to-week basis, to not only keep improving as a rugby player, but to inspire the next generation has left a massive imprint on me and the city as well.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/cvgn1pnzw27o"}