{"authors": ["Matt Lloyd", "www.facebook.com"], "date_download": "2025-05-21 05:51:36", "date_modify": "2025-05-21 05:51:36", "date_publish": "2025-02-08 18:51:31", "description": "Wales slump to their 14th consecutive defeat with the latest loss to Italy in Rome.", "filename": "sport_rugby-union_articles_cd9q57n93jno_1747806696.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1fbb/live/8dc831d0-e634-11ef-a00c-b940b4c70dcc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cd9q57n93jno_1747806696.html", "title": "Six Nations: Warren Gatland vows to carry on as Wales head coach", "title_page": "Six Nations: Warren Gatland vows to carry on as Wales head coach - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Warren Gatland has vowed to carry on as Wales head coach despite their record losing run hitting a new low.\nWales are now down to 12th in the world rankings - their lowest ever position - following the 22-15 loss to Italy.\nIt was their 14th straight defeat, a first in Rome for 18 years and equalled their worst series of results in championship history.\nBut Gatland insists he is seeing enough progress and spirit in his team to remain in the firing line.\n\"It's not the easiest position to be in but you have to be strong,\" he replied, when asked whether he wanted to continue.\n\"There's no doubt it's challenging. You do question yourself in terms of [being able to turn things round].\n\"We talked [after the game] about continuing to work hard and staying tight as a group.\n\"Everyone is pretty frustrated, the players, staff and coaches. There's no-one more disappointed than we are.\n\"We will review and highlight areas where we can still get better, and for me personally.\"\nGatland's position was under threat in December following a winless 2024 and was challenged to show improvements in this Six Nations campaign.\nBut after the 43-0 drubbing in Paris last week, Gatland highlighted Wales' handling errors and indiscipline in a sloppy performance at Stadio Olimpico as well as missed opportunities.\nThe record 14 successive wins in his first stint in charge of Wales has now been matched by the number of back-to-back Test losses in his second spell.\nWales are at home for two of their remaining three Six Nations games, starting with defending champions Ireland in two weeks.\n\"I've been clear and said before that I understand about professional sport and [Test] rugby is about performance and winning,\" said Gatland.\n\"We have to focus on the next three games which are are important.\n\"We knew today was pretty vital for us and we're disappointed and frustrated with aspects of our performance.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/cd9q57n93jno"}