{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:02:37", "date_modify": "2025-05-20 14:02:37", "date_publish": "2023-07-30 14:55:22", "description": "Great Britain finish behind France to claim silver in the mixed relay at the World Triathlon Series in Sunderland.", "filename": "sport_triathlon_66355129_1747749757.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/B6BA/production/_130587764_gettyimages-1580782213.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_triathlon_66355129_1747749757.html", "title": "World Triathlon Series: Great Britain claim mixed relay silver in Sunderland", "title_page": "World Triathlon Series: Great Britain claim mixed relay silver in Sunderland - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Great Britain won silver in the mixed relay at the World Triathlon Championship Series in Sunderland.\nThey finished 23 seconds behind favourites France, who won gold with a time of one hour 26 minutes 53 seconds.\nWith Olivia Mathias ruled out with illness, Jessica Fullagar came in as a late replacement to join Barclay Izzard, Beth Potter and Max Stapley.\nFullagar crossed the line 11 seconds ahead of Norway, who took the bronze medal.\n\"I was worried about Liv but I was chuffed, I was like 'let's do this',\" Fullagar told BBC Sport.\n\"It was a big opportunity and these guys are mega. They have achieved so much already, so to be part of their team is such a delight.\"\nFrance's winning team was made up of Pierre le Corre and Cassandre Beaugrand, who won gold in the men's and women's individual sprint events on Saturday, plus women's silver medallist Emma Lombardi and Tom Richard.\nBriton Potter remains the women's series leader, ahead of Beaugrand, despite not racing on Saturday, while Hayden Wilde of New Zealand, who finished third in the individual sprint, tops the men's rankings.", "url": "https://www.bbc.com/sport/triathlon/66355129"}