{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:55:08", "date_modify": "2025-05-21 06:55:08", "date_publish": "2025-01-31 09:29:07", "description": "Bournemouth vs Liverpool: Arne Slot set to bring back rested first-team regulars", "filename": "sport_football_articles_c0qw5pwkzx5o_1747810508.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e3b3/live/b1658e50-dfa7-11ef-88d3-dd7c96a87c10.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c0qw5pwkzx5o_1747810508.html", "title": "Bournemouth vs Liverpool: Arne Slot set to bring back rested first-team regulars", "title_page": "Bournemouth vs Liverpool: Arne Slot set to bring back rested first-team regulars - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It will be the Richard Hughes derby this weekend when Premier League leaders Liverpool play Bournemouth on Saturday.\nHughes left his role as technical director of the Cherries to become Liverpool's sporting director last summer and will be familiar with plenty of the south coast club's players.\nHe was heavily involved in assembling the vast majority of the Bournemouth team that thrashed Nottingham Forest 5-0 last week and a side who look set to provide the Reds with a tough test.\nLiverpool manager Arne Slot will be talking to the media at about 11:00 GMT on Friday in the build-up to the trip to face a side that has not lost in 11 games.\nWith the Reds already guaranteed to go through to the last 16 of the Champions League before playing at PSV Eindhoven on Wednesday, Slot chose to rest nine of his first-team regulars prior to Saturday's game.\nTrent Alexander-Arnold, Alisson Becker, Luis Diaz, Vigil van Dijk, Ryan Gravenberch, Ibrahima Konate, Alexis Mac Allister, Dominik Szoboszlai and Mohamed Salah did not travel to the Netherlands and should be back.\nJoe Gomez, who is back in training after a hamstring issue, and the injured Curtis Jones and Diogo Jota were also left behind.\nWe will find out what Slot makes of the challenge Bournemouth will pose and any updates on the injured players when the Dutchman speaks later on.", "url": "https://www.bbc.com/sport/football/articles/c0qw5pwkzx5o"}