{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:53:25", "date_modify": "2025-04-26 03:53:25", "date_publish": "2025-03-03 08:31:27", "description": "Man Utd 1-1 Fulham AET (3-4 on penalties): Fan views on FA Cup game", "filename": "sport_football_articles_cx2geegpvego_1745639605.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cx2geegpvego_1745639605.html", "title": "Man Utd 1-1 Fulham AET (3-4 on penalties): Fan views on FA Cup game", "title_page": "Man Utd 1-1 Fulham AET (3-4 on penalties): Fan views on FA Cup game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "We asked for your views on the FA Cup fifth-round tie between Manchester United and Fulham.\nHere are some of your comments:\nWill: What an incredible team performance. Neither side played overly well over the 120 minutes, but we held our nerve from the spot and through to the quarter-finals we go. The draw could have been better but it definitely could have been worse. We have the chance to do something very special.\nHelen: An awful first half and then a great goal! Alan Shearer didn't have much to say! A great second half, extra time and penalties. I couldn't watch the penalties (coward!), but what a brilliant result. Bring on Crystal Palace!\nClive: At long last we have put our jinx to bed. Now let's go on to the final!\nJim: For once we were fortunate to get the better of the very lucky Manchester United. I can't say that was a good performance from Fulham, but at least we got the result.\nJoshie: Four former Arsenal players have been revelations at Fulham, which is a credit to the great coaching at Craven Cottage. It shows what can be achieved with diamonds in the rough. Marco Silva's credentials are growing - I can see Chelsea, Tottenham, Manchester United and Manchester City eyeing him up as a potential future head coach.", "url": "https://www.bbc.co.uk/sport/football/articles/cx2geegpvego"}