{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:35:07", "date_modify": "2025-05-21 04:35:07", "date_publish": "2025-04-04 17:54:31", "description": "Kasey Aldridge takes five wickets, then Tom Banton bats Somerset into a first-innings lead over Worcestershire at Taunton.", "filename": "sport_cricket_articles_ckgz5y429yjo_1747802107.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7697/live/a0542a60-117d-11f0-bef7-27730fea7c1a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_ckgz5y429yjo_1747802107.html", "title": "County Championship: Somerset on top against Worcestershire at Taunton", "title_page": "County Championship: Somerset on top against Worcestershire at Taunton - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Somerset all-rounder Kasey Aldridge claimed five wickets in a dramatic Worcestershire batting collapse on the opening day of the new season at Taunton.\nAfter losing the toss, the Pears slipped from an encouraging 102-1 to 154 all out.\nSomerset then stumbled to 39-3 before Tom Banton (84 not out) and Tom Abell (52) then shared a century fourth-wicket stand to help the hosts close on 187-4.\nIt took England left-arm spinner Jack Leach to make the Somerset breakthrough on 70, when Jake Libby pushed forward to a ball that straightened from around the wicket and edged to slip where skipper Lewis Gregory took a smart low catch.\nBut Roderick looked untroubled in moving to a composed fifty and, when the 100 came up in the 26th over, Worcestershire still looked to be laying the foundations for a big score. But everything changed when Aldridge bowled Kashif Ali with a ball that hurried through and clipped the top of leg stump.\nThree balls later Ethan Brookes edged a catch to second slip and when former Somerset player Adam Hose was bowled by the inspired Aldridge, lunch was taken with the Pears on 110-4.\nThe procession continued when Roderick, having hit eight fours off his 98 balls, fended to second slip off Aldridge, who then bowled visiting skipper Brett D'Oliveira shouldering arms.\nOverton then helped finish it all off as Tom Taylor was pinned lbw pushing forward, Ben Allison was bowled on the back foot and Tom Hinley edged the same bowler to second slip. And Adam Finch fell leg before to Gregory to leave Matthew Waite stranded on 32.\nSomerset were in trouble themselves when Archie Vaughan nicked Taylor to wicketkeeper Roderick and Tom Lammonby edged a loose drive to second slip before Sean Dickson was bowled for 11.\nBut, in an evening session played in warm sunshine, Banton and Abell built a confident partnership to put Somerset firmly in control.\nThe pair had added 101 crucial runs when, immediately after reaching his half-century Abell worked a ball from Finch off his hip straight to Taylor at mid-wicket. But Banton went on to delight home fans in a first day crowd of over 2,000 with more meaty boundaries as he and James Rew (17 not out) cemented Somerset's position.", "url": "https://www.bbc.com/sport/cricket/articles/ckgz5y429yjo"}