{"authors": ["Kal Sajad", "www.facebook.com"], "date_download": "2025-05-21 04:58:22", "date_modify": "2025-05-21 04:58:22", "date_publish": "2025-04-04 12:47:14", "description": "Olympian Delcious Orie, who makes his heavyweight debut on Saturday, speaks to BBC Sport about his transition from amateur to professional boxing.", "filename": "sport_boxing_articles_cy4vgz2xvz9o_1747803502.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/52c1/live/9f91a3b0-113b-11f0-8874-0979deb646d0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_boxing_articles_cy4vgz2xvz9o_1747803502.html", "title": "Delicious Orie: British Olympian on his transition from amateur to pro boxing", "title_page": "Delicious Orie: British Olympian on his transition from amateur to pro boxing - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "British heavyweight Delicious Orie was warned about the \"sharks\" in professional boxing, but the wise Olympian refused to be the bait.\nOrie will make his professional debut on Saturday, eight months after an early exit from the Olympics in Paris.\nThe 27-year-old spoke about his transition into the paid ranks as he visited the BBC in Salford.\n\"It's a cut-throat business. Not like in the amateurs where you get protected from all the outside noise,\" said Orie, who makes his pro debut in Manchester on Saturday.\n\"You hear a lot of stories about it being a rough transition. You hear about the sharks that are coming for you.\"\nBut Orie - who in 2020 graduated with a first class honours degree in economics and management - would not succumb to the \"dirty\" side of boxing.\nAfter snubbing an offer from WWE, he assembled a trusted backroom team and signed with Frank Warren's Queensberry Promotions.\n\"We're not going to take the mick with the progression,\" Orie added. \"It will be slow enough so I can improve but not too fast that the wheels fall off within two years.\"\nOrie will kick off his pro journey against Bosnian journeyman Milos Veletic.\nHe looked remarkably at ease with the spotlight as he shared his fascinating story on BBC Radio 5 Live and BBC One Breakfast.\nHe opened up on the struggles of not being able to speak a word of English when he moved from Russia to England aged seven, and how he was inspired to take up boxing by Anthony Joshua.\n\"I've always felt I'm inferior. That I've got more to prove. That I'm not good enough and always have to push myself to get to the next level,\" he later told BBC Sport.\nOrie was equally engaging during light-hearted filming for social media, where in a play on his unique name he revealed why he thinks pineapple on pizza is not 'delicious'.\nWhen conversation turned to his early exit in Paris, however, it was clear his Olympic disappointment still cuts deep.\n\"I always wanted to get at tattoo of the Olympic rings it but I don't feel worthy of one. What have I got to celebrate? I didn't win any medals,\" he said.\nOrie's parents tell him he will one day change his mind, that to even reach the pinnacle of the amateur code should be celebrated.\nHe is not convinced, but nor is he wallowing in misery.\n\"It's life and life sometimes doesn't give you what you want - and that's OK,\" he added.", "url": "https://www.bbc.com/sport/boxing/articles/cy4vgz2xvz9o"}