{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:22:26", "date_modify": "2025-05-21 07:22:26", "date_publish": "2025-04-01 00:00:00", "description": "Follow live text commentary, score updates and match stats from Arsenal vs Fulham in the Premier League", "filename": "sport_football_live_ckg8g5n0xy4t_1747812146.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/495b/live/4dad05b0-0f3a-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_ckg8g5n0xy4t_1747812146.html", "title": "Arsenal 2-1 Fulham: Bukayo Saka scores seven minutes into return from injury in Gunners win", "title_page": "Arsenal 2-1 Fulham: Bukayo Saka scores seven minutes into return from injury in Gunners win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Bukayo Saka scored just seven minutes into his return after 101 days out injured to help Arsenal beat Fulham at Emirates Stadium.\nThe England forward came off the bench in the second half, with the score at 1-0, and showed Arsenal what they have missed during his absence, heading in Gabriel Martinelli's flick at the far post on 73 minutes.\nMikel Merino had given the Gunners the lead in the 37th minute when his shot was deflected into the corner after Ethan Nwaneri's cut-back.\nRodrigo Muniz pulled a goal back for Fulham in stoppage time when his shot was deflected by William Saliba and wrong-footed goalkeeper David Raya.\nThe win moved Arsenal to within nine points of runaway leaders Liverpool.\nIt was a mixed night for the Gunners though who, despite the positive of having Saka back from his serious hamstring injury, lost centre-back Gabriel early in the first half, which is a worry for manager Mikel Arteta with a Champions League quarter-final against Real Madrid next week.\nFulham defended deep throughout the match but should have pulled one back much earlier when substitute Muniz headed wide from six yards out with the goal gaping.\nArsenal take on Everton on Saturday in the Premier League before preparing for the first leg of their quarter-final against Real at home on Tuesday.\nFulham came to the Emirates with a very clear gameplan to defend deep and restrict Arsenal to limited chances.\nManager Marco Silva made five changes to the team that lost 3-0 in the FA Cup quarter-final to Crystal Palace and changed formation to play with five at the back.\nThe plan almost worked as Arsenal, as they have all season with their injuries, struggled to create clear openings before Merino's deflected shot gave them the breakthrough.\nFulham had good opportunities of their own as Raul Jimenez forced a good save from Raya and Muniz somehow missed before he eventually pulled one back\nSilva cut a frustrated figure in his technical area and will be hoping that these two results do not derail the good work that Fulham have done up to this point.", "url": "https://www.bbc.com/sport/football/live/ckg8g5n0xy4t"}