{"authors": ["Tim Vickery", "www.facebook.com"], "date_download": "2025-05-21 06:19:17", "date_modify": "2025-05-21 06:19:17", "date_publish": "2025-04-01 05:41:24", "description": "From the \"next Neymar\" to a 43-year-old former Premier League veteran, BBC Sport explains what to look out for in this year's Copa Libertadores.", "filename": "sport_football_articles_c5yl5rle7pko_1747808357.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0637/live/316e8650-0e43-11f0-ba12-8d27eb561761.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c5yl5rle7pko_1747808357.html", "title": "Copa Libertadores: What to look out for as competition gets under way", "title_page": "Copa Libertadores: What to look out for as competition gets under way - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The 66th edition of the Copa Libertadores, South America's Champions League, kicks off on Tuesday with the start of the group phase.\nOver the next two months, 32 teams will be whittled down to the last 16, with the knockout phase coming to a close with a one-off final on 29 November. The venue is yet to be decided, but it is likely to be either Brasilia, capital of Brazil, or the Uruguayan capital of Montevideo.\nWith the European Champions League reaching the business stage, it is easy to overlook the Libertadores - but the South American competition is full of a fascination all of its own.\nAs fans all over the continent are fond of chanting, the Copa Libertadores is an obsession, so here are a few things to look out for as, from Argentina to Venezuela, the action gets under way.\nIn the early years of the competition Uruguay were the leading force, and then came decades of Argentine dominance.\nBut the recent years have belonged exclusively to Brazil.\nThe past six editions have been won by Brazilian clubs, with the country providing both of the finalists in four of those years. This level of domination is unprecedented.\nThe financial gap between Brazil and the rest of the continent is growing, and the clubs are using it to snap up players from elsewhere around the continent. Big hitters such as Flamengo and Palmeiras might well field as many as five foreigners in their starting line-up.\nAnd here is an extra reason for Argentina to worry: their clubs have won the title 25 times, while Brazil have now pulled up to 24. This, then, is the year when Brazil are likely to pull level.\nCan they be stopped? At least the field looks tougher than in recent years.\nAs well as four-time champions River Plate, Argentina has Racing and Estudiantes, who look strong, plus the rising force of Talleres from Cordoba.\nColombia's Atletico Nacional look better than any time since they last won the trophy in 2016, and the two countries who have been punching highest above their weight are also well represented - Paraguay with the traditional trio of Olimpia, Cerro Porteno and Libertad, and Ecuador with LDU (or Liga de Quito), Barcelona (who eliminated Brazilian giants Corinthians in the qualifying round) and the ever-fascinating Independiente del Valle.\nSo perhaps there are grounds for thinking that this year might prove more competitive, especially because of a new factor...\nFifa's new competition is not considered an inconvenience in South America. Instead, doing well in the Club World Cup is a priority.\nBrazil has even changed its calendar to accommodate the new tournament. And for those teams taking part, there is prestige and money to win - but there is also a price to pay.\nThe South American calendar - and in Brazil more than anywhere else - is already very cluttered. Now River Plate of Argentina plus the current big three from Brazil - Flamengo, Palmeiras, Botafogo - will be pushing themselves to the limit in the intense heat of the North American summer during June and July. Meanwhile, their rivals will be enjoying some much-needed rest.\nThis is bound to have some effect. Those taking part in the Club World Cup will be fighting on so many fronts that it will not be easy to administer their efforts - offering a glimmer of hope that this year's Libertadores might be harder to predict.\nIt was early in the group stages of last year's Libertadores that Palmeiras gave a first start to a teenage winger called Estevao.\nHe was off to a flyer, scoring against Liverpool of Uruguay - and making it very clear that he had the talent to be taking on a much bigger club of the same name. And soon that will be happening, as after the Club World Cup he joins Chelsea.\nThese are the last few months for South American crowds to appreciate the most talented Brazilian prospect since Neymar.\nThe Libertadores gave him a stage to move within a few months from promise to reality, a senior Brazil international on his way to the Premier League. Can anyone make a similar impression in 2025?\nEcuador's Independiente del Valle are always worth watching. The club, from the outskirts of Quito, have made a name for themselves in the past 15 years as specialists in youth development.\nChelsea's Moises Caicedo is one of their graduates - and he will soon be joined at Stamford Bridge by playmaker Kendry Paez, a type of Ecuadorian Phil Foden. These are his last few months in South America, and it will be fascinating to see his progress.\nA first-team player at 15, a senior international at 16, Paez has endured a difficult few months as he struggles with the new demands. But the potential is undeniable.\nLast week, Ecuador gave a start to 17-year-old Darwin Guagua in World Cup qualification - before he had even made his debut for Independiente del Valle. He, and many other youngsters, will be striving to catch the eye over the next few months.", "url": "https://www.bbc.com/sport/football/articles/c5yl5rle7pko"}