{"authors": ["Mike Blair", "www.facebook.com"], "date_download": "2025-05-19 15:06:06", "date_modify": "2025-05-19 15:06:06", "date_publish": "2015-02-13 15:00:00", "description": "Scotland must work hard and play smart to stop Welsh carriers getting up a head of steam, says former scrum-half Mike Blair.", "filename": "sport_rugby-union_31458857_1747667166.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/80992000/jpg/_80992107_scotfrance.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_rugby-union_31458857_1747667166.html", "title": "Six Nations: Scots need discipline to tame Welsh - Mike Blair", "title_page": "Six Nations: Scots need discipline to tame Welsh - Mike Blair - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "I'm not that old but things have certainly changed in the game since I began my professional career in 2002.\nOne of the biggest changes has been in analysis - post-training, pre-game, during the game and post-game - that has taken detail to a level close to NFL standards.\nThe morning after a game you can nip down to the computer room and see a breakdown of every aspect of the 80 minutes. One click and you can see all your own involvements in the game, or see all the line-out attacks, or the kicks or the missed tackles - it's impressive stuff. The VHS machine is no longer required.\nThe Scottish analysis team will have been working hard over the past couple of months looking for trends as well as strengths and weaknesses in the Welsh game from the November Tests - and there was nothing from last Friday night's 21-16 loss to England that will change the feedback.\nWales have a settled team and settled attack and defence systems.\nWarren Gatland has come in for criticism for a lack of plan B when the physical, confrontational attacking style hasn't produced the goods but this is a game plan that only occasionally comes unstuck and only against certain opposition.\nI see no reason why Wales will change their attack structure against Scotland, relying on Jamie Roberts, Jonathan Davies and Taulupe Faletau winning the gain-line, Dan Biggar making the Scots play from deep with his kicking and Rhys Webb providing the spark around the breakdown.\nTheir attack is about eliminating defensive numbers to create mis-matches: an Alex Cuthbert against a Geoff Cross or a Leigh Halfpenny against a Ross Ford.\nTo combat this, numbers on feet in the defensive line is key for Scotland. They must not over commit to breakdowns, and must set their line and close down the space to prevent the Welsh carriers getting up a head of steam.\nThey need to tackle low to counter the leg drive and have one player making a mess of the breakdown - just one. Players must not compromise the integrity and numbers of the defensive line by poking their head in a breakdown.\nThe Welsh defensive system, built by Shaun Edwards, is what they pride themselves on. Offensive defence is their mantra.\nEngland were swallowed up whenever they played through George Ford on anything other than lightning quick ball. Wales spread the field and came up hard, competed ferociously at the breakdown and forced errors through this pressure.\nWhen Ben Youngs started running with the ball, probing the second and third defenders out from the ruck, it was a different story. There was confusion in the Welsh defence, they sat on their heels a bit and holes opened up.\nScotland scrum-half Greig Laidlaw must do this, like he did against Argentina in the autumn.\nWales position scrum-half Webb in the defensive line. He doesn't sit in behind the forwards as a safety net and organiser as is the norm in many teams. Edwards likes numbers in his line - but this has consequences.\nIf Scotland can get any momentum into their tight game then spaces will be created around the breakdown and without Webb there to fill in the gaps there could be some mileage here.\nHalfpenny will sweep behind the front line watching for kicks, but in and around half way it's a difficult job as he must be deep enough to cover the corners and take high balls too.\nEdwards believes that if the opposition can execute the chip and chase to perfection then so be it - you need it to be perfect though, and if it's not, you lose possession. He is saying 'toss the coin and let's see if you're brave enough'.\nEngland had obviously identified this as a weakness and chipped and gathered once. The other problem is if Halfpenny has to take the last man it means there is no-one sweeping in behind for the short kick in behind - as happened with Anthony Watson's try last week.\nSo, a couple of areas to look out for are Wales trying to bully the Scots in the contact area much like in previous years, while Scotland will try to dampen the fire by looking at kicking options and not giving easy targets.\nIt should be an interesting match in what is a crucial fixture for both sides in the context of the championship.", "url": "https://www.bbc.com/sport/rugby-union/31458857"}