{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:06:09", "date_modify": "2025-05-20 13:06:09", "date_publish": "2023-08-02 16:01:57", "description": "The Football Association of Ireland will review the Republic of Ireland's Women's World Cup campaign as uncertainty remains over manager Vera Pauw's future.", "filename": "sport_football_66386650_1747746369.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/17B9D/production/_130618179_gettyimages-1582688751.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66386650_1747746369.html", "title": "Women's World Cup: Vera Pauw future in doubt as FAI review tournament", "title_page": "Women's World Cup: Vera Pauw future in doubt as FAI review tournament - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The Football Association of Ireland will review the Republic of Ireland's Women's World Cup campaign as uncertainty remains over manager Vera Pauw's future.\nThe Republic suffered a group-stage exit in their debut in the tournament in Australia.\nPauw's contract will expire this month.\nThe Dutch coach also ignored Katie McCabe's request for substitutions during the Republic's final group game against Nigeria on Monday.\nSpeaking before the Nigeria game, Pauw said both she and her players deserve clarity regarding her future.\nPauw - who was appointed Republic boss in 2019 - has previously expressed a desire to remain in charge.\nIn a statement on Wednesday, the FAI said: \"The Football Association of Ireland would like to congratulate the players, management and staff of the Ireland Women's National Team on their performance at the Fifa Women's World Cup 2023 and to thank all Irish fans both at home, around the world and in Australia for their magnificent support.\n\"We look forward to celebrating the team with fans at the homecoming event on O'Connell Street in Dublin tomorrow evening.\n\"With our World Cup journey at an end, the FAI will now undertake a full and comprehensive review of the campaign and tournament, as is our standard practice, and this will be discussed at the next FAI Board Meeting in the coming weeks.\"", "url": "https://www.bbc.com/sport/football/66386650"}