{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:36:54", "date_modify": "2025-05-21 03:36:54", "date_publish": "2025-04-08 00:00:00", "description": "Scotland concede six second-half goals after taking the lead against Germany, staying rooted to the bottom of their Nations League group.", "filename": "sport_football_live_c5y5drrn5npt_1747798614.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0306/live/6ed621f0-14a2-11f0-a455-cf1d5f751d2f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c5y5drrn5npt_1747798614.html", "title": "Germany vs Scotland LIVE: Watch Women's Nations League plus score & updates", "title_page": "Germany vs Scotland LIVE: Watch Women's Nations League plus score & updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Soft Scotland conceded six second-half goals in a 25-minute period as ruthless Germany came from behind to deliver a second devastating defeat in four days in Group A1 of the Nations League.\nCaptain Caroline Weir nonchalantly slotted the visitors ahead five minutes before the break in Wolfsburg, following an impressive first-half showing, but it soon turned sour.\nA rejuvenated, and perhaps angered Germany, burst out in the second half and showed exactly why they are ranked third in the world - as they did in the 4-0 thumping on Friday night in Dundee.\nSelina Cerci hauled the hosts level with what proved to be the first of her hat-trick, nodding home with ease from a corner.\nFive minutes later, she smashed in her second. From there, Scotland were spooked.\nSubstitute Giovanna Hoffmann grabbed two in quick succession - the second straight from kick-off - before Laura Freigang outrageously backheeled in a fifth in a frightening 15 minute spell.\nIt really was about how many the group leaders wanted to rack up against a rocked Scotland, who remain without a point at the bottom of the table.\nFittingly, Cerci wrapped up the scoring in sensational style with a screamer for the sixth, and her third.\nIt‘s a result which leaves many questions over this Scotland side, who for the fourth - and perhaps final - game were led by interim head coach Michael McArdle.\nWhoever does come in has an almighty task on their hands, including overtaking Austria to avoid relegation to Group B.\nThe Austrians, who visit Scotland next on 30 May, are three points better off than the Scots, who finish away to the Dutch on 3 June.\nGermany and the Netherlands have 10 points at the top of Group A1, with the Germans boasting the superior goal difference helped in no small part by their 10 goals against Scotland.\nWhen Weir sent Scotland ahead, the Wolfsburg ground was stunned.\nThe arena, which had been a cacophony of cheers, drums and songs sharply fell silent in almost a split-second.\nScotland collapsed in the second half at the same sort of speed.\nMcArdle's side matched, and trumped, their first-half dominance from Tannadice and were well-deserving of their half-time lead.\nFew folks so that coming. The same way few saw the team crumbling as they did.\nFrom confident and assured against a top class team to looking lost at sea and unaware at what day of the week their defeat was being handed to them.\nIt was an utterly menacing second-half showing from Germany, and like four days ago, they taught Scotland a tough lesson.\nThis one is of a different kind, though. One which will ring for a while in this already beaten squad.\nMcArdle was initially appointed on an interim basis for two games. He's taken charge of four.\nWhoever, eventually, is announced as a permanent successor to Pedro Martinez Losa has a long list of issues - from mentality to clinical edge - to address, and fast.\nScotland interim head coach Mick McArdle: \"We were disappointed at half-time only being one nil up. We felt that with the chances we forced in the game plan, that we were on top, we were the most threatening team.\n\"We knew what was coming at us, we predicted a few things that happened in the second half but unfortunately, we didn't manage them correctly.\n\"The first moment that gives away the corner, that leads to the first goal, I think unnerves us slightly, starts to affect mentality and focus, which then leads to a period that we're all very disappointed with and I'm sure we'll be angry about it and that will continue for a period of time.\n\"The players have just got to keep self belief. We're playing in Germany against the third in the world and we dominated for a period of time, pretty much the whole first half. We don't hide from that score line either. We're very disappointed. It's unacceptable to have that as the final score line as well.\"", "url": "https://www.bbc.com/sport/football/live/c5y5drrn5npt"}