{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:47:51", "date_modify": "2025-05-21 07:47:51", "date_publish": "2024-12-23 15:57:23", "description": "Coventry boss Frank Lampard is relishing the Boxing Day tussle against Plymouth Argyle counterpart Wayne Rooney.", "filename": "sport_football_articles_cly7d02vngpo_1747813671.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/26ae/live/3a257080-c13e-11ef-a8c2-37ad53d91ed7.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cly7d02vngpo_1747813671.html", "title": "Frank Lampard relishing match-up against Wayne Rooney in Championship", "title_page": "Frank Lampard relishing match-up against Wayne Rooney in Championship - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Coventry City boss Frank Lampard is relishing the prospect of a Boxing Day contest with Plymouth Argyle counterpart and former international team-mate Wayne Rooney - one of \"England's greatest players\".\nLampard's side host Rooney's Pilgrims on the bank holiday, but the circumstances are a far cry from their stellar playing careers with England , with Coventry six points and seven places above the Championship's basement club.\n\"I have known Wayne well for many years now, have full respect for him, and I look forward to seeing him,\" Lampard said.\n\"It was an absolute pleasure to play with him for England - and to play against him. He was a Premier League and England great, and his numbers and performances should never be understated. The level of player he was, was incredible.\n\"To see the work ethic behind it that he had as a player and see the impact he had on team-mates, being at camps with him where you see what the person is as well as the player, he is amazing.\"\nRooney told BBC Radio Devon: \"I played with him for a long time with England, so I'm good friends with Frank.\n\"It's the first time coming up against Frank as a coach, so I'm looking forward to it.\"\nEx-Chelsea midfielder Lampard said there is no danger of underestimating Argyle, despite their lowly league position.\n\"You look at the weekend and they trade with Middlesbrough who are a really good team, and they draw 3-3 and possibly feel like they might have won the game,\" he said.\n\"We have to respect them and give our best and have our confidence because we're at home and we are a good team, and we need to show it.\"\nAnd Lampard is also expecting a big response after Coventry's humbling 4-1 defeat against Portsmouth - a performance he described as \"not good enough\".\n\"When you find a hard moment and you don't compete, then the result will look after itself.\n\"Heads were dropping in the second half and they now have to realise that can't be the way. We can lose a game of football but you can't lose the confidence and the desire to do something about it.\n\"They were too aggressive for us in the second half and we weren't aggressive enough, and when you get that wrong in the Championship then you lose.\"\nRooney and Lampard are among a number of the so-called 'golden generation' of England players from the 2000s to move into management, joining the likes of Steven Gerrard and Michael Carrick.\nRooney said they are all well-versed to the extra scrutiny placed upon them due to their time as high-profile players.\n\"We've all had our playing careers and are used to a lot of media praise, scrutiny and pressure.\n\"For all us ex-players who played for England and had careers at the highest level it's something that we're used to.\n\"It doesn't make a big difference from my point of view, I'm sure it's the same for the others.\"", "url": "https://www.bbc.com/sport/football/articles/cly7d02vngpo"}