{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:25:02", "date_modify": "2025-05-20 12:25:02", "date_publish": "2023-08-04 11:45:33", "description": "England batter and T20 World Cup winner Alex Hales announces his retirement from international cricket.", "filename": "sport_cricket_66406178_1747743902.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/17705/production/_130650069_gettyimages-1440480802.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66406178_1747743902.html", "title": "Alex Hales: England batter announces retirement from international cricket", "title_page": "Alex Hales: England batter announces retirement from international cricket - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England batter Alex Hales has retired from international cricket.\nHales, 34, made 156 appearances for England across three formats, scoring 5,066 runs and lifting the men's T20 World Cup in November.\nHe last played for his country in the five-wicket win against Pakistan in that final in Melbourne.\nHales, who will continue to play for Nottinghamshire and in T20 franchises, said it had been \"an absolute privilege\" to represent England.\n\"I've made some memories and some friendships to last a lifetime and I feel that now is the right time to move on,\" he wrote on Instagram.\nHales is currently playing for Trent Rockets in The Hundred, and is expected to continue being a regular in T20 leagues such as Australia's Big Bash League and the Pakistan Super League.\nA short-form specialist, Hales was a key member of England's one-day international side, hitting a six against Australia at Trent Bridge as they broke the record for the highest ODI total in 2018.\nHe scored 2,419 runs in 70 one-day internationals and 573 in 11 Tests between 2015 and 2016.\nHowever, his time with England has not been without controversy.\nIn 2017, Hales was involved with team-mate Ben Stokes in an incident outside a Bristol nightclub that led to him being charged by the England and Wales Cricket Board and subsequently suspended.\nTwo years later, he served a 21-day ban for reportedly failing a recreational drugs test which led to him being dropped from England's World Cup squad.\nHis three-year exile ended in September 2022 after he was called up as a replacement for the injured Jonny Bairstow.\nReflecting on his career, he added: \"Throughout my time in an England shirt, I've experienced some of the highest highs as well as some of the lowest lows.\n\"It's been an incredible journey and I feel very content that my last game for England was winning a World Cup final.\n\"Throughout the ups and downs I've always felt a huge amount of support from my friends, family and undoubtedly the best fans in world cricket.\n\"I look forward to continuing to play for Notts and experiencing more franchise cricket around the world.\"\nEngland next play a T20 series against New Zealand from 30 August, before they defend their World Cup title in West Indies and the USA next June.\nHales' retirement is likely to give an opportunity for Phil Salt to open the batting - the Lancashire opener has played 16 T20s and 14 ODIs and was also part of the side who won the World Cup last year.", "url": "https://www.bbc.com/sport/cricket/66406178"}