{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:19:02", "date_modify": "2025-05-19 15:19:02", "date_publish": "2015-03-07 21:47:09", "description": "Real Madrid boss Carlo Ancelotti laments his side's attacking problems after losing 1-0 to Athletic Bilbao.", "filename": "sport_football_31784607_1747667942.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81475000/jpg/_81475044_carlo_ancelotti_reuters.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31784607_1747667942.html", "title": "Real Madrid: Carlo Ancelotti 'confused' by attacking problems", "title_page": "Real Madrid: Carlo Ancelotti 'confused' by attacking problems - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Real Madrid boss Carlo Ancelotti says he is \"confused\" by his strikers' problems in attack, after watching his side's La Liga title challenge suffer a blow with defeat at Athletic Bilbao.\nAritz Aduriz scored as Real lost 1-0 at San Mames, meaning Barcelona can go top if they beat Rayo Vallecano on Sunday.\n\"There is no connection, there is too much individual play,\" said Ancelotti.\n\"It's strange to say Madrid have a problem up front when we have scored so many goals but I think it's the truth.\"\nAncelotti's side came close to levelling against Athletic when Gareth Bale struck the post with an outrageous long-range lob, while Cristiano Ronaldo, Karim Benzema were also denied.\n\"The front three didn't play well, but it is not just their fault,\" Ancelotti added.\n\"We need to attack as a team. It is quite confusing what we are doing when we are attacking at the moment.\"\nAfter ending 2014 on a record-breaking 22-match winning run, Real's league form has dipped, allowing Barcelona to make up valuable ground in the race for the title.\nReal are two points ahead of Barca but have now picked up just one point from their last two games, having also drawn 1-1 at home to Villarreal last Sunday.", "url": "https://www.bbc.com/sport/football/31784607"}