{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-05-21 06:57:40", "date_modify": "2025-05-21 06:57:40", "date_publish": "2025-01-22 15:24:20", "description": "Ruben Amorim steps back from his description of his team as possibly the worst in Manchester United history but says they have major problems.", "filename": "sport_football_articles_cn4zq7qlk5go_1747810660.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2fff/live/969662d0-d8d0-11ef-86b5-b74cbf3823dc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cn4zq7qlk5go_1747810660.html", "title": "Manchester United: Ruben Amorim not 'deluded' about problems", "title_page": "Manchester United: Ruben Amorim not 'deluded' about problems - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester United head coach Ruben Amorim has stepped back from his description of his team as \"maybe\" the worst side in the club's history but said it would be \"delusional\" to think they do not have major problems.\nAmorim said he made a mistake by ripping into his players immediately after the 3-1 home defeat against Brighton on Sunday, which he felt then led to his press conference outburst afterwards.\nAsked about the storm his comments created before United's Europa League game against Rangers, Amorim said he was talking more about himself than his players.\nBut he also accepted results since he took over in November – 11 points and six defeats from 11 Premier League games – were not good enough.\n\"I was talking more for myself than for my players,\" he said. \"But sometimes it is really hard to hide my frustration in that moment.\n\"The good thing is I said the same things in a different way in the dressing room five minutes before. The response was quite normal because I'm really blunt with my players.\n\"Normally I don't talk (to the players) after a game. After this game, I needed to talk. Maybe it was a mistake because then I got more nervous, went to the press conference really nervous and said things I shouldn't say.\"\nHowever, Amorim did not say he regretted the general observation that his team is in major trouble.\nWhile three successive victories have put United in a good position to secure a top-eight berth and direct entry to the Europa League's last 16, they are out of the League Cup and are 13th in the Premier League.\nAmorim believes it would be unhelpful to try to disguise the fact there are significant issues that must be resolved.\n\"I am not taking the responsibility from the players,\" he said. \"I am saying, and I am really direct in these things, at this moment we are performing really badly and our results are really bad.\n\"I'm saying the obvious. If you want, I can be delusional and say different things. But I say it as I saw it.\n\"I think it is a good thing to be really honest. You saw one thing, I saw one thing. If you are in the stadium you can understand it. So let's face it and work on it.\"\nHowever, Amorim and defender Harry Maguire have different explanations as to why United have been so poor - particularly at Old Trafford, where they have lost four of their last five league games.\nUnited's six defeats in their opening 12 home league games is their worst performance since 1893-94.\nAmorim focused on the anxiety that ripples through his team when they play on home soil.\n\"It's clear,\" he said. \"We are more nervous playing at home than away and it's getting harder.\"\nHowever England defender Maguire pointed to United going behind in all of their last five league games - including in three of them conceding within five minutes.\n\"If I could explain it, we'd change it straightaway,\" said Maguire. \"We have players who have won lots of trophies in club football but we are not playing well enough as a team.\n\"We gave Brighton a goal. We had spoken about it pre-match. The first goal against Nottingham Forest was a set play – and against Bournemouth.\n\"These aren't things that are tactically a problem. You have to be mentally ready to win a match. At the moment we are not getting the small margins because we are not mentally focused.\"\nCentral defender Victor Lindelof has returned to training after missing the previous seven matches while striker Marcus Rashford also took part in the main session despite not featuring since being axed for last month's Manchester derby.\nAntony and Alejandro Garnacho are also expected to be involved despite being linked with transfer window moves away from the club.", "url": "https://www.bbc.com/sport/football/articles/cn4zq7qlk5go"}