{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:58:27", "date_modify": "2025-05-20 14:58:27", "date_publish": "2023-07-27 06:48:03", "description": "Chelsea: 'We cannot have a massive squad'", "filename": "sport_articles_cl7n42ppr94o_1747753107.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0db6/live/0421de60-2c48-11ee-b1d7-8fdc93c2782e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cl7n42ppr94o_1747753107.html", "title": "'We cannot have a massive squad'", "title_page": "Chelsea: 'We cannot have a massive squad' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Nat Hayward, BBC Sport\nMauricio Pochettino says he needs to \"define\" the \"massive\" squad of players he is currently working with on Chelsea's pre-season tour of the USA.\n\"What we cannot have is a massive squad, players not be involved and then it's going to create a mess in the squad,\" he said after Wednesday night's 1-1 draw with Newcastle in Atlanta.\n\"Maybe less is more and more is less, it is not mathematic.\n\"That is why I need to make clear we don't need a big squad. We need 22, 23, 24 players with some younger and that's it.\n\"I am so sorry because maybe the decision will be tough but we need to build a good and a balanced team who want to compete for things.\n\"First of all I think we need to define the squad as I think we are 29 players here and it is massive, the squad. At the moment the dynamic is very good, really good guys and they are sharing the time together.\n\"It is difficult because sometimes in every game three, four, five players cannot play and that is difficult because the mood is difficult.\"\nDespite a mass exodus of players from Stamford Bridge already this summer, the Argentine believes more outgoings are needed to maintain harmony within the squad.\n\"If players are not happy because they believe they are not going to play, we are going to find a solution with the club and fix the situation,\" he added.\n\"Maybe some players for our team that are playing well and we are so pleased and so happy, but maybe they are thinking of leaving Chelsea for different circumstances.\n\"That is not a big issue, that happens always, it happened in the past and will in the future also. Players that will be here next season need to be happy - play or not play.\n\"If they believe they need to be in the starting XI and they are not going to accept being on the bench because of the coach - Chelsea pay me to choose 11 players - it is better they talk from now.\n\"That is why always it is important to have the right players, the right balance and then accept what is going on.\"", "url": "https://www.bbc.com/sport/articles/cl7n42ppr94o"}