{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:22:33", "date_modify": "2025-05-21 05:22:33", "date_publish": "2025-01-31 19:29:43", "description": "Aston Villa news: Fan views on Rashford, Duran and Watkins", "filename": "sport_football_articles_ce856kkp0rdo_1747804953.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ce856kkp0rdo_1747804953.html", "title": "Aston Villa news: Fan views on Rashford, Duran and Watkins", "title_page": "Aston Villa news: Fan views on Rashford, Duran and Watkins - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your views on Aston Villa's attacking options given Jhon Duran has moved to Al-Nassr and the club are now linked with Marcus Rashford.\nHere are some of your replies:\nGary: Not sure Saudi is the right move at Duran's age. Turning his back on Champions League. Good move for Villa if they invest wisely.\nRob: Duran clearly didn't want to play for us, while we were unable to move Ollie to the bench more often. The club have done well in getting an excellent profit on his investment. Now use the money wisely to get a world class striker, as Ollie needs to be more clinical in his finishing.\nRichard: There is better value perhaps in signing Cunha and Felix over taking Rashford on loan with his high salary (unless Man Utd subsidise).\nKev: Joao Felix would be perfect.\nIvan: Olly is getting back to scoring goals for us and should be in the England squad. Rashford is looking for game time to get himself back in form and also to be considered by Tuchel. He won't get the opportunity to regular play at Villa so I doubt he'll come. Best wishes to Duran.\nSteve: Good business on the Duran deal, he was a disruptive character and Watkins will be better for it without him around. Rashford wouldn't come the Villa and to be honest I wouldn't want him.", "url": "https://www.bbc.com/sport/football/articles/ce856kkp0rdo"}