{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:51:01", "date_modify": "2025-05-21 05:51:01", "date_publish": "2025-02-09 00:00:00", "description": "Reaction to six games in the Women's FA Cup as Arsenal, Chelsea, Crystal Palace, Liverpool Manchester City, Sunderland and all reach the quarter-finals.", "filename": "sport_football_live_cn4z2jezj9pt_1747806661.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cn4z2jezj9pt_1747806661.html", "title": "Women’s FA Cup: Khadija Shaw scores as Man City progress, Chelsea, Arsenal & Liverpool also through", "title_page": "Women’s FA Cup: Khadija Shaw scores as Man City progress, Chelsea, Arsenal & Liverpool also through - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Post\nThat's the end of this live text now.\nThanks for joining us for another goal-filled afternoon of FA Cup action.\nWe'll bring you the results of Tuesday's quarter-final draw in full over on the BBC Sport Women's Football page - so keep your eyes peeled for updates.\nBye for now.\nPost\nNext weekend we return to WSL action with Everton coming back to Kingsmeadow to face runaway leaders Chelsea.\nThere's also the small matter of the north London derby at the Emirates and Man City hosting Liverpool in the late kick off.\nWe'll bring you live reporting and reaction from all six fixtures here on the BBC Sport website.\n'We were disciplined and professional'\nFT: Rugby Borough 0-2 Liverpool\nLiverpool\nLiverpool manager Matthew Beard: \"Lee Burch and Rugby Borough deserve congratulations. They had a fantastic performance and they made it difficult for us. I felt the game was comfortable. They could have caused some problems for us in the first half when the game was 0-0 but once we had the first goal, we opened up more and then the second goal killed the game off.\n\"This is why the FA Cup is so important, to see the run that Rugby Borough have been on and the attendance here today, that’s what this competition is all about.\n\"We didn’t create enough in the first half which is why we changed the system at half-time. We wanted ball-carriers like Leanne Kiernan and Lucy Parry as well as Mia Enderby to cause more problems for them - and that’s what we did. We had some missed chances, but we know [Marie] Hobinger can strike the ball and it was a fantastic finish from her.\n\"These are always tricky ties especially coming away from home and playing on a surface that we aren’t used to. We have said all week that it wasn’t going to be an easy game and we were disciplined and professional. We know we can do better but the conditions were tough today, cold and windy. It was about getting through to the next round and I’m pleased we did that.\"", "url": "https://www.bbc.com/sport/football/live/cn4z2jezj9pt"}