{"authors": ["Holly Bacon", "www.facebook.com"], "date_download": "2025-05-21 04:56:02", "date_modify": "2025-05-21 04:56:02", "date_publish": "2025-04-04 14:05:16", "description": "Ivan Juric press conference: Tottenham vs Southampton", "filename": "sport_football_articles_cvgp7nl124go_1747803362.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5a33/live/a2f7f080-c9bb-11ef-94cb-5f844ceb9e30.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cvgp7nl124go_1747803362.html", "title": "Ivan Juric press conference: Tottenham vs Southampton", "title_page": "Ivan Juric press conference: Tottenham vs Southampton - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Juric said Paul Onuachu has missed training with an \"ankle problem\" but added: \"[Ryan] Manning is OK, Lesley [Ugochukwu] is OK. I think Will Smallbone will come back into training tomorrow.\"\nOn the progress of Cameron Archer: \"I think he's a really emotional guy, a really quiet guy and in the past few weeks and months, he's been completely different and very good in training. If he plays, I think he will be really good.\"\nJuric was also asked how he thinks Tyler Dibling has been playing since his injury: \"I think that he is a really young guy. They start to know him, what he's doing - he's not like a new player where nobody knows him. It became a little bit more difficult for him but I have to say he is working really hard and getting better.\"\nOn the prospect of being relegated this weekend if results go against them: \"I don't think about that anymore. Our goal has to be not be the worst team.\"\nOn whether he thinks he will keep his job if they are relegated: \"At this moment I don't know. I have to speak with the club and see. Every coach has his vision and I think the club has to do everything they can to agree with the coach and then they go the same way.\"\nOn his game plan for the trip to Spurs: \"It will be different because they play completely different [to Crystal Palace]. It's 4-3-3 and it's different but I want to work on this principle now - the moment of high pressure [and] the moment we are low and we defend lower. I think this will be our way until the end of the season.\"\nHe was also complimentary of Ange Postecoglou's side: \"I have a feeling they are like last year now, much more compact and I think some players are crucial for them like [Cristian] Romero and they are really good again.\"", "url": "https://www.bbc.com/sport/football/articles/cvgp7nl124go"}