{"authors": ["Richard Petrie", "www.facebook.com"], "date_download": "2025-05-21 05:28:47", "date_modify": "2025-05-21 05:28:47", "date_publish": "2025-01-23 08:19:30", "description": "Cliftonville manager Jim Magilton recalls the harrowing moment when he informed his players of the death of their team-mate Michael Newberry.", "filename": "sport_articles_cqld2zrz2q3o_1747805327.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d870/live/19276ea0-d8f0-11ef-a7d8-1f358fa230b5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cqld2zrz2q3o_1747805327.html", "title": "Jim Magilton: Informing squad of Newberry's death 'will live with me for the rest of my days'", "title_page": "Jim Magilton: Informing squad of Newberry's death 'will live with me for the rest of my days' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cliftonville manager Jim Magilton has reflected on the harrowing moment he told his players of the death of their team-mate Michael Newberry at the end of December.\nNewberry's sudden passing had a profound impact on everyone across the Irish League family and Magilton says informing his squad of the devastating news was among the most difficult experiences of his life.\n\"I had a really tough experience, my father had a massive heart attack in front of me and I couldn't save his life. I had to try to resuscitate him and it didn't happen. The paramedics then spent 45 minutes trying to resuscitate him and couldn't,\" explained Magilton.\n\"That was the lowest I've ever been in my life up until I got a phone call from Mr Newberry [Michael's father] on that morning.\n\"There were no coaching manuals helped me to deal with that. Nothing prepares you for standing in front of a group of men, playing colleagues, and telling them that they've lost one of their colleagues. That will live with me for the rest of my days.\"\nThe Reds boss admits it has been \"a huge challenge\" for his players to concentrate on football matches in the aftermath of the loss of their team-mate.\n\"Michael is a huge loss to everybody connected with the football club – to the players, to the staff, relationships he had built up both at Cliftonville and at Linfield.\n\"The turnout for his funeral was magnificent and David Burke, our club chaplain, spoke so eloquently about him.\n\"Michael had a massive impact on so many people's lives, the outpouring of emotion for Michael was so visible. It was a very sad occasion but life goes on and we have to turn up for games, we have to prepare ourselves mentally for the games.\"\nMagilton went on to allude to Newberry's exceptional passion for the game and said that his memory will be kept alive at Solitude.\n\"We have to try and continue to do him justice.\n\"Michael turned up for every training session with this unbelievable enthusiasm to want to play. The game and being around his team-mates meant so much to him. He was first on the pitch, last off.\n\"We'll always remember him, we'll never forget the impact he had on our life.\"\nSaturday's Premiership meeting with Linfield, the other Irish Premiership side Newberry played for, will bring the sense of loss felt by personnel of both clubs into sharp focus once again.\nMagilton's charges ran out 2-1 winners in their previous meeting with David Healy's men at Windsor Park in October.\n\"That's probably as well as we played in any game this season and a repeat of that would be wonderful,\" said the former Northern Ireland international midfielder.\n\"We've got to go there with the same mentality and the same positive approach and play our brand of football.\n\"It's a wonderful game to play in and players seem to raise their levels when they go there and rightly so. They're league leaders, they're having a fantastic season, so we have to stand up and be counted.\"\nMagilton describes some criticism levelled at his former international team-mate Healy as \"unbelievable\" given Linfield's lofty position 15 points clear at the top of the league.\n\"It's amazing that some people think they aren't doing particularly well when they are 15 points clear. David uses that as motivational fuel for his players and that will continue from now until the end of the season.\n\"For a manager with his track record, the teams he has produced, the games he has won, the way he has conducted himself. I think he has done a magnificent job. I think he deserves a lot of credit, he's taken a lot of heat and that goes with the territory.\n\"When you're the Linfield manager the expectation is to finish first and be competitive in every competition, and he has embraced that.\"", "url": "https://www.bbc.com/sport/articles/cqld2zrz2q3o"}