{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:12:40", "date_modify": "2025-05-20 12:12:40", "date_publish": "2023-08-04 18:36:50", "description": "Fabio Silva: Wolves striker in confident mood", "filename": "sport_articles_c87m8dz103no_1747743160.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c87m8dz103no_1747743160.html", "title": "Fabio Silva: Wolves striker in confident mood", "title_page": "Fabio Silva: Wolves striker in confident mood - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Fabio Silva says he is in confident move going into the new season because of the \"love\" he feels from Wolves fanbase.\nThe 21-year-old has featured during pre-season and said: “My confidence is more than 100 per cent because I feel happy, I feel the love from the fans and I feel the love from everyone with me in the training ground – the people that work on the kitchen, the people that work on everything, they show me love, they show me they want me here.\n“Today the fans sing for me and this is the most important for me. The fans are always with me, I love them, so I’m going to give 100 per cent for them and for this club.\"\nSilva, signed for around £35m in 2020, spent last season on loan at Anderlecht and PSV Eindhoven, scoring 16 goals in all competitions across both spells.\nHe feels the moves have been beneficial in his development and duly feels Wolves could have a \"great season\" if the team can deliver what Julen Lopetegui asks of them.\nOn spending a season away from the club, Silva added: “It's been good. For me, having a season away was good because I needed this for the start of my career. I feel happy and this time I need to play, I need to feel important, to score goals and get some assists.\n“Last season I got the chance to go to some other places and feel this, and it was amazing, both teams I played for were amazing and it felt very good, and I was very proud, so I’ve tried to continue my work every day, try to learn because I am only 21-years-old so I still have lots of things to learn, but it’s what I choose to do every day.”", "url": "https://www.bbc.com/sport/articles/c87m8dz103no"}