{"authors": ["Nicola Pearson", "www.facebook.com"], "date_download": "2025-05-21 06:22:09", "date_modify": "2025-05-21 06:22:09", "date_publish": "2025-01-31 12:03:45", "description": "Arne Slot press conference: Bournemouth vs Liverpool", "filename": "sport_football_articles_cg5ymmn7nmlo_1747808529.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a528/live/b7d03a00-4921-11ef-9e1c-3b4a473456a6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cg5ymmn7nmlo_1747808529.html", "title": "Arne Slot press conference: Bournemouth vs Liverpool", "title_page": "Arne Slot press conference: Bournemouth vs Liverpool - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Slot confirmed that Diogo Jota, Joe Gomez and Curtis Jones all trained on Friday but could not say if they will be ready for Saturday as the Reds have to \"make the smartest decision for them and for winning the game\".\nOn advice he would have for Mohamed Salah after comments made by Saudi Arabia sports minister about wanting the Egypt forward to play in the country: \"He has been doing so well for so many years that everyone probably wants him. He has done so well without my advice for a long time so he can probably keep doing what is best for his career without my advice. But, my advice would be different than the one you mentioned [from Saudi Arabia minister].\"\nSlot accepts Salah will make the choice about his future that is best for him with his contract expiring in the summer: \"Everyone wants him, including us. We want him to extend of course as well, that is clear. He is old enough and wise enough and has done enough in his career to make the right decision for himself and hopefully for us too.\"\nThe boss said that his reason for resting players against PSV on Wednesday was not with Bournemouth specifically in mind but to try and keep players \"fresh\" and help in the \"long term\".\nOn comments made by Dominik Szoboszlai last summer about the Hungary midfielder setting \"the bar too high\" in his first season at the club: \"If he said what you said, I will speak to him today or tomorrow and tell him you can never set the bar too high because that is impossible. The bar at this club is at the highest standards and this is what you have to get to.\"\nHe added: \"We are talking about consistency. He has been very consistent this season in work rate. He is a player who should set his standards high because he can definitely reach those standards.\"\nSlot said he has spoken about Bournemouth with sporting director Richard Hughes, who previously worked with the Cherries.\nHowever, he said that is natural because he speaks with Hughes \"almost on a daily basis\" as his relationship with him is \"very good\" and \"what you can expect when you win a lot of games\".", "url": "https://www.bbc.com/sport/football/articles/cg5ymmn7nmlo"}