{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:56:38", "date_modify": "2025-04-26 06:56:38", "date_publish": "2025-02-28 14:40:13", "description": "England prop Ellis Genge says he has been dumbfounded by criticism of the team's style in the wake of their one-point win over Scotland last weekend.", "filename": "sport_rugby-union_articles_cy0550dz8qqo_1745650598.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c6da/live/09ef6210-f5df-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_cy0550dz8qqo_1745650598.html", "title": "Six Nations: Ellis Genge hits back at England's critics", "title_page": "Six Nations: Ellis Genge hits back at England's critics - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Ellis Genge says he has been shocked by criticism of England's style of play after their 16-15 win over Scotland last Saturday.\nThe victory kept alive England's hopes of a Six Nations title, inflicted a first defeat since 2020 on their oldest rivals and continued an improvement in results after five straight losses in late 2024.\nHowever, England scored one try to Scotland's three and were grateful for Finn Russell missing a conversion that would have put their opponents ahead with only 10 seconds left on the clock.\n\"We won the game and people are still upset about it,\" said vice-captain Genge.\n\"It blew my mind to be honest.\"\nGenge conceded that some of the near 82,000-strong crowd were frustrated by England's kick-heavy tactics during the match, but said he was more stung by post-game analysis in the media.\n\"There is a feeling there, let's not be naive,\" he added.\n\"You can feel it that people were booing when we were playing. I love the fans, I think they're brilliant, I go round clapping them after every game.\n\"But post-game the ex-players, recently retired and long retired, and people from years and years ago... I just can't believe how out of touch they are.\n\"The spiel that I'm reading from people saying how off it we are. We won two games on the bounce and you're upset about it, I don't get it.\"\nWorld Cup-winning centre Will Greenwood was one of those to attack England's style, describing their performance as a \"tough watch\" and \"infuriating\", while claiming the team are playing \"so much within themselves\".\n\"For all of that the England players can say 'stuff off old geezer, we are two from three, we are up to 10 points and Ireland are only on 14',\" he added presciently., external\nFormer Ireland and British and Irish Lions captain Brian O'Driscoll was also unimpressed.\n\"I just don't get it, I don't know why there isn't a cohesion,\" he told ITV Sport., external\n\"It is stodgy, it is kick tennis, it is quite negative and it is fine to eke out one-point victories, but when those games go against you - which they will at times - you are going to get huge negative feedback.\"\nScotland were ahead of England in a raft of attacking stats, such as metres made and line breaks, while France, who also lost by a point at Allianz Stadium in the previous round, butchered several try-scoring chances.\nHowever, Genge insists England should be judged by results that leave them in touch with the top of the table with two games to play.\n\"It's like you're damned if you do, damned if you don't,\" he added.\n\"In the last 18 months, every time we've lost by a point we've been slandered, and on the weekend we win by a point and it's the same old story.\n\"Do you want to be part of a team that wins every single game by one point?\n\"Or would you rather be part of a team that loses every single week, 40 points to 39?\n\"I know what type of team I want to be.\"\nEngland take on Italy next on Sunday, 9 March. They have beaten the Azzurri in all 31 of the teams' previous meetings, but the visitors were only three points better in Rome last year.\nGenge says he and his team-mates are preparing for another tough encounter, despite Italy conceding 11 tries in a 73-24 defeat by France last time out.\n\"They beat Wales in Wales, they took a few scalps, so I don't think they're a team that people think is a guaranteed win anymore,\" said the Bristol prop.", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/cy0550dz8qqo"}