{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:47:19", "date_modify": "2025-05-21 03:47:19", "date_publish": "2025-04-07 17:09:18", "description": "Dom Sibley's patient innings of 66 helps defending county champions Surrey to a draw at Essex.", "filename": "sport_cricket_articles_cp31yddpzp1o_1747799239.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e360/live/80fc8ca0-13d2-11f0-8735-97934b501932.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cp31yddpzp1o_1747799239.html", "title": "Sibley guides Surrey to draw at Essex", "title_page": "County Championship: Dom Sibley guides Surrey to draw at Essex - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Dom Sibley remained immovable for 77 overs to underpin Surrey's successful fight to salvage a draw in their opening match in the defence of the County Championship title.\nSurrey had started the final day with a target of 217 to avoid an innings defeat and Sibley appeared determined to make sure the reigning champions batted throughout to save both the game and their faces after a chastening four days at Chelmsford.\nThe former England opener put on 101 in 41 overs in a decisive fourth-wicket stand with Ben Foakes before he departed for 66 after a four-and-a-half hour, 221-ball vigil.\nFoakes reprised his first-innings stubbornness with a second half-century of the match before Ryan Patel and Jordan Clark saw them sneak over the line at 219-6 and handshakes on the draw.\nTwo wickets in seven balls early on day four gave Essex a brief scent of a victory that had looked highly probable when they asked Surrey to follow-on, but apart from three late wickets the match meandered towards the inevitable draw. They used eight bowlers in the innings in an effort to change the narrative, but to no avail.\nSurrey might have lost Sibley to the first ball of the day but his edge to Jamie Porter fell short of slip. Sibley was in stereotypical obdurate mode and took 26 balls to get off the mark, an angled shot down to third man off Porter.\nThe openers set the tone for the day in the first 49 minutes, trundling along at a rate of around two an over. By then Simon Harmer had arrived in the attack. He required just 13 balls of niggling and probing before Rory Burns went back to a fuller ball and was trapped lbw on his stumps.\nThen in the next over, Ollie Pope slashed wildly at a widish delivery from Shane Snater and, for once on a slow pitch, the ball carried through to the wicketkeeper. The England man's cameo lasted four balls for a solitary run.\nThe strike-rate increased significantly for a spell when Paul Walter was introduced. Jamie Smith went after him, taking 23 runs off eight balls faced, including a pulled six and four fours. Not surprisingly the left-arm seamer was immediately retired with figures of 2-0-25-0.\nHowever, Smith's stay proved brief as he was involved in a run-out of ridiculous proportions with Sibley. Smith decided there was a second run, Sibley did not, both men finding themselves at the same end.\nDespite an initial miss-take by Michael Pepper from Snater's throw to the wicketkeeper, the ball was eventually transferred to the non-striker's end where Critchley was able to effect the dismissal.\nWith spin at both ends, Essex wheeled through the overs at a rate of knots – indeed the official over-rate was showing at plus 13 – with Sibley and Foakes content to thrust their legs down the wicket to negate any turn.\nSo it was something of a jolt to the system when Sibley punished a wayward delivery from Critchley through midwicket for only his fourth four and then immediately drove straight for his fifth. He also executed a well-timed cover drive off Harmer for another boundary.\nDespite those occasional flurries it still took Sibley 181 balls to reach his fifty, achieved midway through the afternoon session having started his innings the previous evening. To emphasise the pace of his innings, he added 21 runs in 94 balls pre-lunch and 38 from 103 between lunch and tea.\nHowever, the seemingly immovable force lasted just nine balls into the final session when he had a rush of blood produced a wild top-edge swing at Noah Thain and he was walking before the square-leg boundary fielder took the catch.\nFoakes had hung around for 134 balls and 50 runs before he was cleaned out by Jamie Porter's third delivery with the new-ball, his middle-stump left at 45 degrees.\nWith overs running out and two runs shy of their target, Dan Lawrence fell to a slip catch by Jordan Cox for the second time in the match.", "url": "https://www.bbc.com/sport/cricket/articles/cp31yddpzp1o"}