{"authors": ["Joe Rindl", "www.facebook.com"], "date_download": "2025-05-20 11:43:28", "date_modify": "2025-05-20 11:43:28", "date_publish": "2023-08-06 14:43:12", "description": "Co-hosts Australia reach the Women's World Cup quarter-finals with an impressive win over Denmark in the last 16 in Sydney.", "filename": "sport_football_66420244_1747741408.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/068D/production/_130677610_gettyimages-1598406329.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66420244_1747741408.html", "title": "Australia 2-0 Denmark: Women's World Cup co-hosts reach quarter-finals", "title_page": "Australia 2-0 Denmark: Women's World Cup co-hosts reach quarter-finals - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Co-hosts Australia reached the Women's World Cup quarter-finals with a clinical win over Denmark in the last 16 at a packed Stadium Australia.\nCaitlin Foord put the Matildas ahead in the 29th minute, finishing from a tight angle following a great pass from Mary Fowler.\nHayley Raso added a second in the 70th minute with a driven finish after good work from Emily van Egmond.\nAustralia will face either France or Morocco in the last eight on Saturday.\nAustralia had only ever reached the last eight at the World Cup once before, in 2015, losing their four other knockout matches across the years.\nThey started slowly against Denmark but Stadium Australia in Sydney erupted after Fowler's great turn and pass set up Foord's opener on the break.\nEncouraged by their goal the Matildas dominated the rest of the half with another Foord effort deflecting off Denmark defender Rikke Sevecke and dropping narrowly wide.\nAs the Danes pushed after the restart Foord broke down the left and played the ball to Van Egmond, who teed up Real Madrid's Raso to calmly slot home her third goal of the tournament.\nWith the game seemingly wrapped up Australia head coach Tony Gustavsson brought on captain Sam Kerr who was given a standing ovation when she replaced Raso with just over 10 minutes remaining.\nThe Matildas' record scorer played her first minutes of the tournament having picked up a calf injury in training on the eve of the competition.\nAnd she shone in the closing moments, driving down the right and thundering a shot over the bar.", "url": "https://www.bbc.com/sport/football/66420244"}