{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:12:26", "date_modify": "2025-05-21 06:12:26", "date_publish": "2025-04-01 12:30:15", "description": "France Louis Bielle-Biarrey wins Six Nations player of the tournament award with 65% share of vote.", "filename": "sport_rugby-union_articles_c985ygyx301o_1747807946.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/10a6/live/c68f1530-0f0e-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c985ygyx301o_1747807946.html", "title": "Six Nations: France winger Louis Bielle-Biarrey named player of tournament", "title_page": "Six Nations: France winger Louis Bielle-Biarrey named player of tournament  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "France winger Louis Bielle-Biarrey has been named player of the tournament for the 2025 Six Nations in recognition of his record-breaking campaign.\nThe 21-year-old scored eight tries - a record in a single championship - as France lifted the title for a 19th time.\nBielle-Biarrey saw off competition from England back Tommy Freeman, Scotland full-back Blair Kinghorn and Italy centre Tommaso Menoncello to win the individual award with a 65% share of the fans' vote.\n\"I'm very happy to have won this trophy and that the fans voted for me,\" said Bielle-Biarrey.\n\"My parents signed me up for rugby when I was five years old. Straight away, I really liked it, it is a childhood dream today to be able to live my passion.\n\"This trophy is also a great reward for all the hard work from the French team and it is the conclusion of a very good tournament for us.\"\nThe Bordeaux Begles winger also won the Try of the Championship prize for his second score in a crucial victory over defending champions Ireland in Dublin on 8 March.\nThe following week France claimed their first title since 2022 with a 35-16 win against Scotland.", "url": "https://www.bbc.com/sport/rugby-union/articles/c985ygyx301o"}