{"authors": ["Henry Brownsey", "www.facebook.com"], "date_download": "2025-05-21 05:38:25", "date_modify": "2025-05-21 05:38:25", "date_publish": "2025-01-31 16:29:34", "description": "Oliver Glasner press conference: Manchester United vs Crystal Palace preview", "filename": "sport_football_articles_cy08p1ynr7eo_1747805905.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8249/live/031e5ce0-6de3-11ef-b970-9f202720b57a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy08p1ynr7eo_1747805905.html", "title": "Oliver Glasner press conference: Manchester United vs Crystal Palace preview", "title_page": "Oliver Glasner press conference: Manchester United vs Crystal Palace preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Glasner spoke of two significant injury blows: \"Unfortunately, we had several pieces of bad news at the beginning of the week - Cheick [Doucoure] needs surgery on his knee, and Chadi [Riad] has ruptured his ACL - we have lost both for the rest of the season – and Chadi even longer. We hope Cheick will return for pre-season next season – so it's two long-term injuries.\"\nEberechi Eze will also miss the weekend's game, with Glasner stating: \"He's struggled the last weeks and months. He got a knock in the cup [against Arsenal] and since then he's always had pain, training and not training, playing and then taking him off - we want to get him pain free.\"\nMore positively, Glasner hopes Adam Wharton and Matheus Franca will be in the squad: \"Adam and Franca trained the whole week without any issues, and we're thinking both will be in the squad. It will also lift their confidence and mood after being out for several weeks.\"\nWharton, who hasn't played since October, \"looks stronger than before\" and Glasner said: \"We are all looking forward to him staying now and training with us. We still have up to 20 games until the end of the season and we know he's a great player in midfield.\"\nOn transfers: \"We planned two signings - one was Romain Esse. We are still working on the second one. I'm pretty confident we will get this deal done.\" The club may look for a centre-back but they \"don't need it immediately\" and will only get one if something good comes up.\nOn Manchester United: \"I can see them making progress. I know Ruben Amorim from his time at Sporting and played them with Frankfurt. I have a lot of respect and admiration for how he managed the first weeks at Man Utd - it wasn't easy but he went his way and now you can see how he wants to play.\"\nPalace went six games unbeaten before losing to Brentford and speaking about responding to defeat, Glasner said: \"The whole week we talked about it, training looked good - but the evidence has to be there on Sunday at 2pm. We learned great from the 5-1 defeat against Arsenal - we defended our box terribly and I mentioned it, since then we've done it much better.\"\nOn the club's supporters: \"We know we can count on our fans, everywhere. I hope they can go to Manchester because I know the trains are striking. We want to give back the passion and belief, we can promise we will do everything to win.\"\nRomain Esse scored on his debut and speaking about the 19-year-old he said: \"Let's stay calm - he was in the right position with the right finish. He did well and he's doing well in training. I could see him quite often be exhausted and he has to get used to it. It's a good start but I don't expect to see him now score with his first touch.\"", "url": "https://www.bbc.com/sport/football/articles/cy08p1ynr7eo"}