{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:25:31", "date_modify": "2025-05-21 07:25:31", "date_publish": "2025-03-28 14:46:11", "description": "Charlotte Bankes wins silver in the women's snowboard cross as Great Britain earned their first podium at the Freestyle Ski and Snowboard World Championships in Switzerland.", "filename": "sport_articles_crmjmk23z2no_1747812331.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/59a5/live/8e4cf380-0bd6-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_crmjmk23z2no_1747812331.html", "title": "Great Britain's Charlotte Bankes wins silver at Freestyle Ski and Snowboard World Championships", "title_page": "Great Britain's Charlotte Bankes wins silver at Freestyle Ski and Snowboard World Championships - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Charlotte Bankes won silver in the women's snowboard cross as Great Britain earned their first podium at the Freestyle Ski and Snowboard World Championships in Switzerland.\nBankes recovered from an early setback in the final to challenge Michela Moioli, but settled for a second place after being overhauled by the Italian in a photo finish.\nFrance's Julia Pereira de Sousa took third place in the event in Engadin.\nIt is the 29-year-old's first individual World Championships medal since a 2021 gold and adds to the silver she won in Utah in 2019 and the team gold with Huw Nightingale in Bakuriani in 2023.\n\"We knew our tactics today, we knew bank three was important to generate the speed for the bottom, and that I had to be patient and focus on myself,\" said Bankes, who finished first in her quarter-final and semi-final.\n\"Unfortunately, in the final, I'm a bit frustrated with my start, but I didn't panic, focused on building speed, came back afterwards and was happy to be in the fight until the finish.\n\"That was a strong final, Michela really deserves it, and I'm happy that I pushed her to the finish.\"\nBankes will next be action in the team snowboard cross competition with Nightingale on Saturday.\nLater on Friday, Britain's Mia Brookes placed fifth in the women's big air competition.\nJapan's Kokomo Murase was crowned world champion, with compatriots Reira Iwabuchi and Mari Fukada completing a podium sweep.", "url": "https://www.bbc.com/sport/articles/crmjmk23z2no"}