{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:46:21", "date_modify": "2025-05-20 14:46:21", "date_publish": "2023-07-27 17:01:29", "description": "Wales uncapped squad lock Teddy Williams signs a new contract to stay with Cardiff.", "filename": "sport_rugby-union_66331412_1747752381.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/B0BD/production/_130554254_bristol_v_cardiff_051.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-union_66331412_1747752381.html", "title": "Teddy Williams: Wales uncapped squad lock agrees new Cardiff contract", "title_page": "Teddy Williams: Wales uncapped squad lock agrees new Cardiff contract - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wales uncapped squad lock Teddy Williams has signed a new contract to stay with Cardiff.\nWilliams, 22, was linked with a move to Exeter but he would have been unavailable for international selection because he has already been involved in a Wales squad.\nWilliams is a member of the World Cup extended party in Turkey on a pre-tournament training camp.\nHe was also part of the 2023 Six Nations squad.\nWilliams has made 26 appearances for Cardiff, with more than half of those matches coming during the 2022-23 season.\n\"I've really enjoyed this past season, getting more opportunities in the first team, and now I'm looking forward to building on that in the future,\" he said.\n\"I love playing here at the Arms Park and we've enjoyed some memorable wins. Hopefully we can get more of those moving forward.\n\"There's a lot of change here with some influential players moving on but it's an opportunity for a lot of the younger boys to step up now and try to take the club forward.\n\"It's definitely an exciting challenge for us as a group. There will be some ups-and-down along the way, but hopefully the younger group can come through and grab the bull by the horns.\n\"I've got a lot of close friends here and coming to training each day is enjoyable.\"\nWilliams follows Theo Cabango and Ben Thomas in agreeing new deals, while Cardiff have also announced the signing of prop Rhys Litterick from Harlequins.", "url": "https://www.bbc.com/sport/rugby-union/66331412"}