{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:16:14", "date_modify": "2025-05-19 15:16:14", "date_publish": "2015-02-17 10:37:33", "description": "Cardiff Blues back row Rory Watts-Jones says he is devastated after having to retire following a concussion-related injury.", "filename": "sport_rugby-union_31502445_1747667774.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81056000/jpg/_81056017_cdf_281114_cf_blues_v_treviso_35.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_rugby-union_31502445_1747667774.html", "title": "Cardiff Blues flanker Rory Watts-Jones 'devastated' by retirement", "title_page": "Cardiff Blues flanker Rory Watts-Jones 'devastated' by retirement - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cardiff Blues flanker Rory Watts-Jones has been forced to retire on medical grounds after a concussion-related injury.\nThe 26-year-old made his Blues debut against Connacht in September 2012 and appeared 31 times for the region.\nWatts-Jones was advised to retire after suffering an injury in November.\n\"I am obviously devastated. Having put in so much to have my career cut short before I had reached my full potential is hard to take,\" he said.\n\"Although it will take time to come to terms with my retirement, I take consolation in the fact that I was able to fulfil my childhood dream and represent my home region.\n\"If I could offer one piece of advice it would be to make the most of every minute in the game as you never know when it will be over.\"\nWatts-Jones had suffered a number of \"concussive events\" during his career.\nBut after his latest knock last November prompted behavioural changes, he was advised to retire.\n\"His behaviour, both his family and his girlfriend had noticed, was different from previous episodes,\" said Blues sports physician Dr Gareth Jones.\n\"We took him through the usual graduated return-to-play protocol, but he was fairly slow going through that process.\"\nConcussion injuries have made headlines in rugby union in recent weeks after Wales wing George North remained on the field following two blows to the head in the 21-16 loss to England.\nThe sport's governing body, World Rugby, investigated the incident but accepted the Welsh Rugby Union's explanation that their medical staff had not seen the second incident.\nFor its part, the WRU said North would not have been allowed to carry on had the second incident been spotted.\nNorth was subsequently rested for Wales' 26-23 Six Nations win over Scotland.\nWorld Rugby will now introduce video replays to aid medical staff monitoring injuries during major international matches.\nBlues director of rugby Mark Hammett said the region were \"sad\" to see Watts-Jones having to retire.\n\"But I know Rory has made the right decision for his future,\" he said.\n\"The medical team have worked closely with Rory and his long-term health has always been our utmost priority.\n\"Rory has been an important and popular member of the squad at Cardiff Blues over the last three seasons. He has always worked tirelessly and put his body on the line for the cause.\n\"We will continue to support him during this transitional period.\n\"I know everyone connected with Cardiff Blues - players, staff and supporters alike - will join me in thanking him for his services to the region and wish him every success for the future.\"", "url": "https://www.bbc.com/sport/rugby-union/31502445"}