{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:26:37", "date_modify": "2025-05-21 04:26:37", "date_publish": "2025-01-23 19:18:00", "description": "Nottingham Forest news: Chris Wood signs new deal - have your say", "filename": "sport_football_articles_c1wepjegelvo_1747801597.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0124/live/c23c6ab0-0914-11ef-82e8-cd354766a224.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c1wepjegelvo_1747801597.html", "title": "Nottingham Forest news: Chris Wood signs new deal", "title_page": "Nottingham Forest news: Chris Wood signs new deal - have your say - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Nottingham Forest striker Chris Wood says he is \"excited for the future\" after signing a new deal with the club.\nWood, who has scored 14 goals in 23 games this season, has signed a two-year contract to keep him at the club until 2027.\nOn extending his stay, the 33-year-old said: \"I'm very excited and very happy to have it completed and done, and I'm looking forward to the next couple of years, at least.\n\"I saw the ambition when I first arrived. When I spoke to the owner and his family and saw where they want to be and where they see this club to be - it was clear they have high ambitions and big dreams. He has backed the club for years, even before promotion to the Premier League, which is fantastic, and the team is pushing in the right direction.\n\"I'm excited for the future. This club has a lot of potential to continue to grow and build, and that is what I want to be a part of. I can't thank the fans enough, they always come in voice and they're always behind the team and myself, it's a pleasure playing in front of them. Here's to a few more years together.\"\nForest owner Evangelos Marinakis said of Wood: \"He has performed exceptionally well with us. More than just his goals, he epitomises everything that it means to wear the Garibaldi Red – hard work, a fighting and wining spirit, and the attitude to never give up.\n\"He is a winner and a role model to inspire all of us, and we reward his dedication with ours.\"\nWhat does this mean, Forest fans? Do the Reds need another striker or will Wood lead the line for years to come?", "url": "https://www.bbc.com/sport/football/articles/c1wepjegelvo"}