{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:10:47", "date_modify": "2025-05-21 07:10:47", "date_publish": "2025-03-30 10:01:10", "description": "Preston vs Aston Villa predictions: Chris Sutton on FA Cup tie", "filename": "sport_football_articles_c3w1w8dpy78o_1747811447.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/561d/live/fbee38e0-d1d4-11ef-87df-d575b9a434a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c3w1w8dpy78o_1747811447.html", "title": "Preston vs Aston Villa predictions: Chris Sutton on FA Cup tie", "title_page": "Preston vs Aston Villa predictions: Chris Sutton on FA Cup tie - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Preston are hard to beat at home and have not lost at Deepdale since 2 November, a run of 15 games.\nI have seen quite a bit of Paul Heckingbottom's team this season and they will defend deep, set up in a 3-5-2 shape and make themselves hard to break down.\nIt is an old football cliche, but in this case it is very true that the first goal will be extremely important.\nAston Villa have got some brilliant attacking players, but I also always feel like teams can score against them.\nIf they go behind, they could have problems but I do feel their quality should see them through - depending on Unai Emery's team selection of course, with a big league game coming up at Brighton on Wednesday.\nVilla have got their eyes on numerous prizes and there probably hasn't been excitement levels like this at the club since Martin O'Neill signed me in 2006.\nI'm still backing them here, but it is going to be a cagey game, and they might have to wait to make the breakthrough before a couple of late goals get the job done.\nI'm going for Emi Martinez to keep a clean sheet, too. His keepie-uppie antics,, external to wind up Brazil while playing for Argentina this week were another reminder of why he is the best goalkeeper in the world. Anyone who can produce moments like that in a game of that magnitude deserves all the accolades you can get.\nSutton's prediction: 0-2", "url": "https://www.bbc.com/sport/football/articles/c3w1w8dpy78o"}