{"authors": ["Michael Emons", "www.facebook.com"], "date_download": "2025-05-21 05:00:19", "date_modify": "2025-05-21 05:00:19", "date_publish": "2025-01-14 22:42:37", "description": "It proved to be another thrilling night for Brentford fans at the Gtech Community Stadium and a proud one for striker Yoane Wissa.", "filename": "sport_football_articles_c5yvr1g7wjyo_1747803619.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d40f/live/25e3c130-d2c8-11ef-af5d-07f6a75d4237.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c5yvr1g7wjyo_1747803619.html", "title": "Brentford 2-2 Man City: A proud night for Wissa as he sparks memorable fightback", "title_page": "Brentford 2-2 Man City: A proud night for Wissa as he sparks memorable fightback - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It proved to be another thrilling night for Brentford fans at the Gtech Community Stadium and a proud one for striker Yoane Wissa.\nManchester City, the English champions in each of the past four seasons, held a two-goal lead with 82 minutes on the clock, only for the Bees to produce a superb fightback to snatch a 2-2 draw.\nCaptain Christian Norgaard's powerful header provided a dramatic finale, but Brentford's first goal secured a moment of club history.\nWissa had space to shoot home from six yards out as he grabbed his 37th goal for the club in the top flight and moved above Ivan Toney as the Bees top scorer in the Premier League.\nBrentford boss Thomas Frank called the achievement \"extremely impressive\" for a player that cost only £8.5m when he joined the Bees from French club Lorient in August 2021.\n\"I'm very pleased on Wissa's behalf,\" added Frank. \"He probably should have scored two if I'm a little bit after him.\n\"But he has been very good for us and the way he has taken over from Ivan, not only him but Bryan [Mbeumo] as well, the partnership between the two of them is quite unique. We are just Brentford. Extremely proud.\"", "url": "https://www.bbc.com/sport/football/articles/c5yvr1g7wjyo"}