{"authors": ["Emily Salley", "www.facebook.com"], "date_download": "2025-05-21 05:23:13", "date_modify": "2025-05-21 05:23:13", "date_publish": "2025-01-14 15:24:21", "description": "Carlos Alcaraz says Joao Fonseca will be on the \"list of the best players in the world\" after the teenager knocked out ninth seed Andrey Rublev at the Australian Open.", "filename": "sport_tennis_articles_c75zl9x99zqo_1747804993.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1198/live/4671b4e0-d30c-11ef-978a-a79a9a297789.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_tennis_articles_c75zl9x99zqo_1747804993.html", "title": "Australian Open 2025 results: Carlos Alcaraz says Joao Fonseca will be on 'list of best players very soon'\"", "title_page": "Australian Open 2025 results: Carlos Alcaraz says Joao Fonseca will be on 'list of best players very soon'\" - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Carlos Alcaraz believes Joao Fonseca's name will be on the \"list of the best players in the world\" after the teenager knocked out ninth seed Andrey Rublev in the first round of the Australian Open.\nFonseca, 18, had a Grand Slam debut to remember with a 7-6 (7-1) 6-3 7-6 (7-5) victory against Rublev on Tuesday.\nThe Brazilian was playing in his first main-draw match at a major, having come through three rounds of qualifying without dropping a set in Melbourne last week.\nThe victory extended his winning streak to 14 matches and four-time major winner Alcaraz said it was \"fantastic\" how Fonseca, ranked 112th, handled everything.\n\"What can I say about it? Just incredible,\" Alcaraz said.\n\"The way he played his first Grand Slam match against his first top-10 player, it's unbelievable.\n\"It's just the beginning of the year, just one win in a Grand Slam, but he's going to be there.\n\"We're going to put Joao Fonseca's name on the list of the best players in the world really soon.\"\nFonseca was ranked 730th in the world at the start of 2024, but by the end of the year he had surged up the rankings into the top 150.\nHe captured tennis fans' attention with quarter-final runs at the ATP 500 event in his home city of Rio de Janeiro and at the ATP 250 in Bucharest.\nThe teenager truly established himself as one of the best newcomers by winning December's Next Gen ATP Finals - an event for the best male players aged 21 and under.\nCurrent world number one Jannik Sinner, who won the tournament in 2019, is the only player to have lifted the title at a younger age than Fonseca.\nIn fact, it was Sinner who convinced Fonseca to turn professional when he was a hitting partner for the Italian at the 2023 ATP Finals.\nFonseca's showing against Rublev proved his potential, as he took charge with his powerful forehand and fired home 51 winners to the Russian's 33.\n\"I just enjoyed every moment on this amazing court, it's my first time playing in a huge stadium,\" Fonseca said.\nFonseca is just the second teenager since 1973 to beat a top-10 opponent at their maiden Grand Slam, after Mario Ancic beat Roger Federer at Wimbledon in 2002.\nAsked in his on-court interview how much money it would cost to have his talent, Fonseca referenced 20-time major winner Federer, replying: \"Like Roger said, talent is not enough without hard work.\n\"My idol was always Roger, I grew up watching Roger. Everyone wanted to play like him and I even tried when I was younger the one-handed [backhand] for one week.\"\nFonseca will meet Italy's Lorenzo Sonego, who is ranked 57 places higher, in the second round on Thursday.\n\"Of course my expectations are bigger now,\" Fonseca said. \"I want more and more, I think that is the mentality of champions.\"", "url": "https://www.bbc.com/sport/tennis/articles/c75zl9x99zqo"}