{"authors": ["Ged Scott", "www.facebook.com"], "date_download": "2025-05-20 13:40:29", "date_modify": "2025-05-20 13:40:29", "date_publish": "2023-07-25 18:49:17", "description": "Ethan Bamber helps skittle Warwickshire for 60 before Middlesex are bowled out for 199 as 22 wickets fall on day one in Birmingham.", "filename": "sport_cricket_66300315_1747748429.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8E4F/production/_130513463_bamber.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66300315_1747748429.html", "title": "County Championship: 22 wickets go down at Edgbaston on day one in Warwickshire-Middx game", "title_page": "County Championship: 22 wickets go down at Edgbaston on day one in Warwickshire-Middx game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Warwickshire were bowled out for just 60, their lowest County Championship score in 41 years, as wickets tumbled on day one against Division One strugglers Middlesex.\nThe visitors were then dismissed for 199 - a lead of 139 - before the Bears lost two more in their second innings as a staggering 22 wickets fell in the day.\nMiddlesex won the toss and had the best of the conditions, but they still had to bowl well in skittling the Bears in 22.5 overs.\nToby Roland-Jones started the rot with two wickets in his first over, Alex Davies and home skipper Will Rhodes, before Bamber snapped up Sam Hain at second slip to make it 11-3.\nRoland-Jones then persuaded Rob Yates to edge to second slip, before Bamber clean bowled both Dan Mousley and Jacob Bethell in successive overs.\nAn innings-best stand of 16 between Ed Barnard and Michael Burgess followed. But that ended when Bamber again rearranged the stumps twice in as many overs, bowling first Burgess, then Barnard.\nRyan Higgins nipped in to claim the last two, Henry Brookes and Mir Hamza, as the Bears posted their lowest score since being rolled over in their second innings for 43, also at Edgbaston, way back in 1982.\nMiddlesex then had a go and found it just as tricky as they were quickly reduced to 11-3.\nOliver Hannon-Dalby induced edges from both Sam Robson and Stephen Eskinazi for ducks, and Hamza trapped Mark Stoneman lbw, then bowled Max Holden to make it 31-4.\nJack Davies and John Simpson added a priceless 28 to get Middlesex within of the Bears score. But although Henry Brookes ended that stand by having Davies taken at slip and Hamza had Simpson caught behind off a perceived inside edge, conditions then eased.\nRyan Higgins (53) and Josh De Caires (37) shared a key seventh-wicket stand of 71 - and even the last three wickets added a further 51 runs.\nEd Barnard took two of the final three scalps to match Hannon-Dalby and Hamza with three wickets each as the visitors were finally removed for 199.\nThe last of them was a big talking point as Roland-Jones cleared the rope with a six, which was signalled by umpire Rob Bailey before it was realised that his bat had swung back down onto his stumps - and the decision was rescinded to hit-wicket, but perhaps wrongly so.\nThat gave Warwickshire 16 overs to face before the close - and they had immediate alarms when Davies went cheaply for the second time in the day, first ball, a sixth scalp for Bamber.\nRhodes then edged Tom Helm behind, but there were no further alarms as Rob Yates (26) and Sam Hain (6) saw their side close on 53-2, reducing the deficit to 86.", "url": "https://www.bbc.com/sport/cricket/66300315"}