{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:57:01", "date_modify": "2025-05-21 05:57:01", "date_publish": "2025-02-09 00:00:00", "description": "Follow reaction from the FA Cup fourth round including Aston Villa 2-1 Tottenham after Blackburn 0-2 Wolves and Plymouth Argyle 1-0 Liverpool", "filename": "sport_football_live_cx2pr4r59g9t_1747807021.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cx2pr4r59g9t_1747807021.html", "title": "FA Cup LIVE: Watch reaction after Aston Villa 2-1 Tottenham", "title_page": "FA Cup LIVE: Watch reaction after Aston Villa 2-1 Tottenham - scores, radio & updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Thanks and goodbye\nThat is your lot for tonight. You don't have to wait long for more FA Cup action as Doncaster entertain Crystal Palace tomorrow.\nThanks for joining us and for your comments.\nEnjoy the rest of your night. See you next time.\nVilla sink Spurs as pressure mounts on Postecoglou\nFT: Aston Villa 2-1 Tottenham\nCharlotte Coates\nBBC Sport\nAn impressive Aston Villa booked their spot in the FA Cup fifth round for the first time in a decade as the pressure increased on Tottenham manager Ange Postecoglou.\nVilla took the lead after 57 seconds with Jacob Ramsey firing through the hands of Spurs goalkeeper Antonin Kinsky, who should have kept out the shot.\nMorgan Rogers sealed Villa's passage into the last 16 with his 11th goal of the season, when he pounced on a loose ball in the box to prod high into the roof of the net in the 64th minute.\nA minute later, Marcus Rashford was introduced from the bench for his Villa debut after his loan move from Manchester United on the penultimate day of the winter transfer window.\nIt is two cup defeats within four days for Tottenham, who lost 4-0 in the second leg of the Carabao Cup semi-final against Liverpool at Anfield on Thursday. They have also fallen to 14th in the Premier League.\nVilla will find out who they will face in the fifth round when the draw is made on BBC One at about 19:10 GMT on Monday.\n'We are now part of Argyle history'\nFT: Plymouth 1-0 Liverpool\nPlymouth Argyle\nMore quotes from Plymouth boss Plymouth boss Miron Muslic, speaking to ITV: \"Speechless. Normally, they tell me I'm eloquent. It is a proud moment. It is a big day.\n\"Showing this performance, the desire to defend, and it is Liverpool - they will be on you. The lads did fantastic. I wanted to structure this team to feel this organisation with intensity and be competitive and hard to beat - we showed that this afternoon.\n\"A big moment and I think I will realise this when I leave the stadium and go to my apartment. The game we love and those moments as coaches we miss.”\nOn his tactical changes: \"First of all, we structured them better, we got them more tight and then it is easier to defend. We then filled it with intensity and with desire and heart. In the end you need a bit of luck to get out of it.\n\"It is a magical day for us. I told the lads to enjoy it, and we are now part of Argyle history. It is a big day for all of us, somehow I feel we deserve this day. It means a lot to us and this togetherness we have here at Home Park. This togetherness will be important.\"\nOn who he wants in the next round: \"I don't care. They [Manchester United] are more than welcome here.\"\n'Rashford, Asensio are versatile players'\nFT: Aston Villa 2-1 Tottenham\nAston Villa\nMore from Aston Villa manager Unai Emery speaking to BBC One, on Morgan Rogers: \"Morgan is performing fantastic. His commitment to do his task every day from the first minute to 90 is great. We did a lot of positive things today.\n\"It will be very demanding for us in this competition, so we will need to improve and increase our level. We are with the motivation to get something in this competition as well as the Premier League and Champions League. We still have a lot of work to do.\"\nOn Rashford's debut: \"We have to protect every player and try to adapt them into our structure and use their skills. Asensio, Rashford and Malen are versatile players in the attacking third. We can feel confident to have them.\n\"We are very demanding in our way because we want to be in the top six or top five in the Premier League as well as in the Champions League, where we are in the last 16.\"\n'We still have a lot of work to do'\nFT: Aston Villa 2-1 Tottenham\nAston Villa\nAston Villa manager Unai Emery speaking to BBC One: \"I am very happy. It was a fantastic match against a very good team, Tottenham, and we played really well. After a long time, we are in the fifth round of the FA Cup.\n\"I know how much this competition means for our supporters and us, and I am happy for the fans. We are playing more or less as we planned. We dominated and played with confidence and personality - everything we did today was more or less very good.\"\nOn Jacob Ramsey: \"He played really well. We are happy when the player is scoring. He had more chances. Of course, we need his best performances from Ramsey. He is getting better and being consistent without injuries. We will need players who are physically good for the rest of the season.\n\"There are players coming back in the coming weeks. We also have players like Donyell Malen, Andres Garcia, Marco Asensio and Marcus Rashford and hopefully, we can build the team in the structure we want to create.\"\n'Europa League is a different animal'\nFT: Aston Villa 2-1 Tottenham\nJoe Hart\nFormer Manchester City goalkeeper on BBC One\nOn the Europa League being important to Tottenham...\n100%. No getting away from it now.\nThat has got to be the narrative of the season. That's where the focus of Tottenham has to come to light and unite.\nIt looks like they will bodge their way through the Premier League season.\nThe Premier League smells Tottenham - they know how to play against Tottenham.\nThe Europa League is a different animal. That's where you can create those special nights.\n'No options'\nFT: Aston Villa 2-1 Tottenham\nDion Dublin\nFormer Aston Villa striker on BBC One\nThere are no options [for Tottenham to change style and go long] because the players who should be giving options don't have the confidence to have the ball in positions where they should receive it as they don't back themselves.\nWe used to call it hiding, going into a position where you can't receive it.\nSon, he is their best player, he is going through that phase.\nThe squeeze was so poor. They go as individuals and not as a team.", "url": "https://www.bbc.com/sport/football/live/cx2pr4r59g9t"}