{"authors": ["Alex Bysouth", "www.facebook.com"], "date_download": "2025-05-19 14:30:33", "date_modify": "2025-05-19 14:30:33", "date_publish": "2017-08-11 10:59:47", "description": "Wayne Rooney says it was a \"special moment\" to mark his top-flight return to Everton by scoring the winner against Stoke.", "filename": "sport_football_40835425_1747665033.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/B0F5/production/_97310354_rooney_reuters.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_40835425_1747665033.html", "title": "Everton 1-0 Stoke: Special moment to score winner, says Wayne Rooney", "title_page": "Everton 1-0 Stoke: Special moment to score winner, says Wayne Rooney - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wayne Rooney says it was a \"special moment\" to score the winning goal on his top-flight return to Everton after 13 years and one he has been looking forward to for a long time.\nThe 31-year-old, who left the club for Manchester United in 2004, headed in his 199th Premier League goal as the Toffees beat Stoke 1-0 at Goodison Park.\nRooney said a lot of \"relief and emotion\" came out as he celebrated what proved to be the decider before half-time.\n\"On a personal note, I'm absolutely delighted to score the winning goal at Goodison Park,\" he told BBC Sport.\n\"It was a special moment for me. There was a lot of relief and a lot of emotion. It was an important goal just before half-time.\n\"I've felt at home since I first stepped in the training ground. I've been looking forward to this moment for a long time.\"\nRooney found space in the area to head a Dominic Calvert-Lewin cross past Stoke goalkeeper Jack Butland in what was the Toffees' best move of the match - one the former England captain was twice involved in before adding the finishing touch.\nCalvert-Lewin also went close for the home side as Stoke struggled to break Everton down on the opening day.\nXherdan Shaqiri's long-range effort did force new Toffees goalkeeper Jordan Pickford into a fine save in stoppage-time, with the 23-year-old leaping across his line to tip wide.\nRooney scored the first of his Premier League goals for Everton with a sublime strike against Arsenal as a 16-year-old in 2002. His 199th in the English top flight 15 years later wasn't quite as dramatic, but it will have meant just as much to the boyhood Blues fan.\nSir Alex Ferguson moved to snap up the teenager after some flashes of genius in an Everton shirt and Rooney returned to Goodison Park as England and Manchester United's all-time leading goalscorer.\nHe helped start the move that resulted in the winning goal with some neat link-up play with Idrissa Gueye and Sandro Ramirez, before showing all that experience to peel away in the area and guide a free header into the opposite corner.\nThe forward started tenaciously and could have found himself in the book for a late tackle on former United team-mate Darren Fletcher, but Rooney's desire to track back and help his side defensively also proved invaluable against a direct Stoke threat.\nThis season could go a long way to deciding his legacy among the Everton faithful, but the former England captain will also be hoping to play his way back into Gareth Southgate's plans with a World Cup looming next summer.\nThe winning goal on his Goodison Park homecoming proved a perfect start.\nEverton boss Ronald Koeman said: \"The points are really welcome because you don't know what to expect on the first day. It wasn't the performance we like. The team looked nervous on the ball - that's the reason I changed the system at half-time. We need to improve a lot.\"\nOn Wayne Rooney scoring the winner: \"Wayne showed he is still one of the best in his position. He was very comfortable on the ball and made good decisions on the ball and scored a great goal.\"", "url": "https://www.bbc.com/sport/football/40835425"}