{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:20:54", "date_modify": "2025-05-20 12:20:54", "date_publish": "2023-08-04 20:56:10", "description": "Sam Halsall scores three tries as Huddersfield Giants win 24-0 to send Castleford Tigers bottom of Super League.", "filename": "sport_rugby-league_66397936_1747743654.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8FDA/production/_130662863_shutterstock_editorial_13883957ay.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-league_66397936_1747743654.html", "title": "Super League: Castleford 0-28 Huddersfield - Sam Halsall hat-trick as Giants win fourth in a row", "title_page": "Super League: Castleford 0-28 Huddersfield - Sam Halsall hat-trick as Giants win fourth in a row - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Huddersfield Giants continued their late push for the play-offs as they sent Castleford Tigers to the bottom of Super League.\nThe resurgent Giants recorded a fourth consecutive victory and now sit four points outside of the top six.\nBut Tigers, who suffered a fifth defeat on the spin, slipped below Wakefield Trinity on points difference.\nSam Halsall scored a hat-trick of tries, with Leroy Cudjoe, Chris McQueen and Adam Milner also touching down.\nCastleford had three players making their home debuts in Charbel Tasipale, Billy Tsikrikas and Liam Horne, with another new arrival, Blake Austin, in the stands following his loan move from Leeds Rhinos.\nBut any hopes of a revival as they try to avoid relegation for the first time since 2006 were quickly extinguished as Jake Connor fired out a pass to Halsall to dive in at the corner.\nVeteran Giants man Cudjoe then burst through the home side's defensive line from Ollie Russell's short pass to put his side 10-0 up with less than a quarter of the game played.\nAnd when McQueen powered his way over just before the interval, the Tigers had a mountain to climb at 14-0 down.\nHuddersfield survived some home pressure early in the second half before a carbon copy of their first try, with Connor again setting up Halsall, effectively wrapped up the two points.\nThe winger collected his hat-trick before the Tigers' misery was completed as old boy Milner grabbed the final try of the evening with coach Andy Last sacked after the match following their dreadful run of results.\nWith a break because of the Challenge Cup final next Saturday, Castleford face a big fortnight to prepare for their next league match away to Wakefield on Friday, 18 August.\nThat game promises to be huge in the battle to avoid relegation.\nHuddersfield Giants coach Ian Watson told BBC Radio Leeds:\n\"I'm really pleased. We showed great character. We spoke about coming here really fresh and starting well as we knew the motivation Castleford would have.\n\"We wanted to take the pressure away and we did that. The defensive mentality was awesome - the way the boys worked for each other was class.\n\"I always had confidence in the players, but we look a hell of a lot more like us in the last four games and hopefully that can continue.\"\nCastleford: Widdop; Wallis, Tasipale, Mellor, Eden; Broadbent, Miller; Matagi, Johnstone, Lawler, Edwards, Foster, Westerman.\nInterchanges: Massey, Hall, Tsikrikas, Horne.\nHuddersfield: Connor; Halsall, Bibby, Marsters, Golding; Russell, Lolohea; Hill, Milner, Wilson, Cudjoe, McQueen, English.\nInterchanges: Peats, Greenwood, Hewitt, Ikahihifo.\nReferee: Tom Grant.", "url": "https://www.bbc.com/sport/rugby-league/66397936"}