{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:03:31", "date_modify": "2025-04-26 07:03:31", "date_publish": "2025-02-28 08:09:40", "description": "Réiteoir!, a new documentary which shines a light on the abuse directed at Gaelic football referees, will be broadcast on the BBC this weekend.", "filename": "sport_articles_czje3ewgpl1o_1745651011.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b27b/live/3a7ffe60-f398-11ef-b06c-594e3d22afd3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_czje3ewgpl1o_1745651011.html", "title": "New documentary shines light on GAA referee abuse", "title_page": "New documentary shines light on GAA referee abuse - watch on BBC - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A new documentary which shines a light on the abuse directed at Gaelic football referees will be broadcast on the BBC this weekend.\nRéiteoir!, produced by Macha Media for BBC Gaeilge and RTE with support from Northern Ireland Screen’s Irish Language Broadcast Fund, will be shown on BBC Two NI and the BBC iPlayer on Sunday at 22:00 GMT.\nIn the hour-long documentary, broadcaster Gráinne McElwain explores the challenges that come with being a modern GAA referee by following officials David Gough, Siobhán Coyle and Eoghan Ó Muircheartaigh throughout the 2024 season.\nThe documentary considers the emotional toll of the abuse on referees and reveals findings from a recent Ulster University study, led by Dr Noel Brick.\nAs part of Dr Brick's study, 96% of referees said they had received verbal abuse at some point during their career, with 20% claiming they had received physical abuse.\nIn a follow-up study focused on the 2022-23 season, 88% of referees said they had experienced verbal abuse, a statistic Dr Brick said was \"shockingly high\".\nGough, who took charge of the 2019 and 2023 All-Ireland Football finals, forms a big part of the documentary's focus.\nHaving refereed for nearly 20 years, Gough is used to the verbal abuse that is directed at officials, but he admits the mistakes he has made have lived with him.\nIn the 2016 All-Ireland football semi-final, Gough missed an obvious foul by Dublin's Kevin McManamon on Kerry's Peter Crowley, allowing Dublin to go up the other end of the field and score.\nGough's line of sight was blocked by Dublin's Michael Fitzsimons, and after Dublin won the match by two points, the referee faced a torrent of abuse from Kerry fans.\n\"After 2016, I think it really affected my mental health. It took me a long time to come back to refereeing after that game,\" reflected Gough.\n\"It was terrible walking from the pitch that day. There were programmes and bottles being thrown from the Cusack Stand and it was very difficult to come back after that game.\n\"I was worried about going on to the pitch. I knew I had made a huge mistake and maybe people didn't have the same confidence in my refereeing any longer and that was very difficult for me.\"", "url": "https://www.bbc.co.uk/sport/articles/czje3ewgpl1o"}