{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:34:52", "date_modify": "2025-05-21 06:34:52", "date_publish": "2025-03-31 00:00:00", "description": "All the latest football news and Premier League build-up as Arsenal manager Mikel Arteta confirms Bukayo Saka is available to return on Tuesday against Fulham.", "filename": "sport_football_live_clyw3gwd820t_1747809292.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/09cc/live/653b9980-0e2c-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_clyw3gwd820t_1747809292.html", "title": "Premier League LIVE build-up: Team news as Bukayo Saka and Harry Maguire return for Arsenal & Man Utd respectively", "title_page": "Premier League LIVE build-up: Team news as Bukayo Saka and Harry Maguire return for Arsenal & Man Utd respectively - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Thank you and goodbye!\nIt has been a busy day - we had all the reaction to the weekend's FA Cup action, and heard plenty from the managers as the Premier League returns from a 16-day hiatus tomorrow.\nHere's a brief recap from today:\nMikel Arteta said Bukayo Saka is 'ready to go' following a three-month injury absence\nHarry Maguire and Leny Yoro are in contention to return for Manchester United at Nottingham Forest\nNiclas Fullkrug is likely to be in West Ham's squad, said Graham Potter\nWe also covered Fulham's Marco Silva, Leicester's Ruud van Nistelrooy, Wolves' Vitor Pereira and Nottingham Forest's Nuno Espirito Santo.\nAnd now it's time for us to bid farewell - but we will back tomorrow with build-up to Tuesday's three Premier League games, and we will hear from managers including Liverpool's Arne Slot and Everton boss David Moyes ahead of Wednesday's Merseyside derby.\nThanks for tuning in, we hope to see you again tomorrow!\nTeam news\nNottingham Forest v Man Utd (Tue, 20:00 BST)\nNottingham Forest\nNottingham Forest boss Nuno Espirito Santo when asked if his side have any new injury concerns after the weekend: \"Of course we have. After we played extra time, we have to assess them all. We are recovering well. The joy and happiness of getting through and playing at Wembley will for sure give us extra run for tomorrow.\"\n'It's normal that Cunha has ambition'\nWolves v West Ham (Tue, 19:45 BST)\nWolves\nWolves boss Vitor Pereira on comments made by Matheus Cunha that he needs 'to take the next step' in his career: \"He knows his potential, he is a top player. It is normal that he has the ambition to fight for titles, it’s natural. It happens with other players. But the most important thing is to be committed and help the team to achieve our targets.\n\"At the end of the season we will see. Next season I don't know, I don't know if I'm alive tomorrow. It's better to wait. The focus is the next game and the team.\"\nOn if he will continue to use Cunha this season: \"If training gives me the confidence to play with Cunha, I will play with him because he has the quality to help us. With goals, with assists, in this moment if he has the right mentality to be focused and be with us it’s very easy to manage. If not, I'm here to decide.\"\nVitor Pereira news conference\nWolves v West Ham (Tue, 19:45 BST)\nWolves\nWolves sit just one position above the relegation zone, but are still nine points clear of the drop.\nBefore the international break they hit a solid run of form with seven points from their last four games, and they'll be looking to extend that against West Ham tomorrow.\nLet's hear what Vitor Pereira had to say this afternoon...\nHow have Man Utd loanees performed this season?\nNottingham Forest v Man Utd (Tue, 20:00 BST)\nRuben Amorim shrugged off a question earlier regarding Marcus Rashford, who scored twice in Aston Villa's FA Cup win against Preston yesterday, saying he is only focused on his team and his players.\nSo let's take a look at how three of United's biggest loan stars have performed this season.\nAfter scoring just one goal for United in the first half of the season, Antony has four goals and four assists for Real Betis in just 12 games in Spain since his January move while Marcus Rashford moved to Aston Villa after bagging seven goals and three assists for Amorim this season.\nMarcus Rashford (on loan at Aston Villa until 30 June)\nGames played: 10\nGoals: 2\nAssists: 4\nJadon Sancho (on loan at Chelsea until 30 June)\nGames played: 28\nGoals: 2\nAssists: 7\nAntony (on loan at Real Betis until 30 June)\nGames played: 12\nGoals: 4\nAssists: 4\n'It's a long time without games'\nNottingham Forest v Man Utd (Tue, 20:00 GMT)\nManchester United\nManchester United boss Ruben Amorim on whether having more time to prepare will help his side: \"I don’t know, Nuno will say it was better to have more time to prepare the game and I can say it was a long time in a good moment without games.\n\"But they play that FA Cup stage, they won and that is really important to recover players so the environment will be really nice. But we want to continue winning games.\"\n'Not surprised by Nuno and Forest'\nNottingham Forest v Man Utd (Tue, 20:00 BST)\nManchester United\nManchester United boss Ruben Amorim on Nottingham Forest manager Nuno Espirito Santo: \"First of all, I am not surprised [by Forest's strong season]. Because I know the work he did in Portugal, in Spain, I know he did really well here with Wolves. He went to Tottenham, started really well and things happen.\n\"I know he is a top manager, and you feel it in the team - the environment they have, when you see his team play, you can see the energy. They are so happy, they have mobility. I am not surprised.\"\nChido's Youth Cup engagement\nNottm Forest v Man Utd (Tues, 20:00 BST)\nSimon Stone\nBBC Sport's chief football news reporter\nManchester United striker Chido Obi will not be involved at the City Ground tomorrow.\nThe 17-year-old has made four substitute appearances for United - two in February and two in March - as head coach Ruben Amorim tries to find an answer to his team's scoring woes.\nHowever, it has been decided to prioritise tonight's FA Youth Cup semi-final at Aston Villa. Chido is a key man in Adam Lawrence''s squad and scored a hat-trick against Chelsea in the fifth round.\n\"He is going to play today because we try to imagine the next game, and if you look before he was on the bench and played against just 10 minutes at the end of the game against Fulham,\" said Amorim.\n\"It is also really important for our young kids to feel the energy of the game.\n\"We are trying to win that competition and trying to build something with the youth, so we are helping the team and the player.\"\n'Really important for all players to fight'\nNottingham Forest v Man Utd (Tue, 20:00 BST)\nManchester United\nManchester United boss Ruben Amorim on the busy schedule: \"I think it is also really exciting because they are really tough matches, but we already have that kind of schedule in recent weeks with less players.\n\"So it is really important for us to have all the players to fight and rotate during the matches. Different characteristics give us different opportunities to win matches.\n\"I know we have at least three matches in Premier League now that are really tough but the team are ready to face those games and the Europa League is also a key focus for us at this stage.\"\n'We are looking up'\nNottingham Forest v Man Utd (Tue, 20:00 BST)\nManchester United\nManchester United boss Ruben Amorim on his side's targets for the remainder of the season: \"You can say I am really confident. I feel the players are more confident, the energy is different. But I also know that can change with results.\n\"We are focused on maintaining the energy and we are working on some things we can improve a lot. Even winning the games, we can acknowledge that we have a lot to improve. But we are in a different moment, more confident and we are ready for the final two months of the season.\n\"I don’t know which place we are going to finish but we are looking up and we want to win games.\"", "url": "https://www.bbc.com/sport/football/live/clyw3gwd820t"}