{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:13:41", "date_modify": "2025-04-26 06:13:41", "date_publish": "2025-03-05 00:00:00", "description": "Raphinha scores as Barcelona secure a narrow win over Benfica in the first leg of their Champions League last-16 tie, despite going down to 10 men.", "filename": "sport_football_live_ce9828pdjxkt_1745648021.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/051b/live/af2b4770-fa0e-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_ce9828pdjxkt_1745648021.html", "title": "Benfica 0-1 Barcelona: Ten-man Barcelona secure narrow win over Benfica", "title_page": "Benfica 0-1 Barcelona: Ten-man Barcelona secure narrow win over Benfica - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Raphinha was once again Barcelona's hero as they claimed a narrow win over Benfica in the first leg of their Champions League last-16 tie, despite going down to 10 men.\nThe Brazilian capitalised on a defensive error to drive forward and slot in the bottom corner in the 61st minute, notching his 25th goal of the season and ninth in the Champions League campaign.\nRaphinha also came to the rescue for five-time winners Barca in January when the two sides met in the league group phase, scoring a 96th-minute winner in a nine-goal thriller.\nMeeting again at this knockout stage of the competition, Barcelona had to play with 10 men from the 22nd minute after teenager Pau Cubarsi brought down Benfica striker Vangelis Pavlidis on the edge of the penalty box but, as the last man, received a straight red card.\nThe Portuguese hosts thought they had a penalty in the 82nd minute after the otherwise faultless Wojciech Szczesny brought down Andrea Belotti, but the spot-kick was overturned for offside in the build-up.\nBarcelona held on to take a narrow lead to the Camp Nou for the second leg on Tuesday 11 March (17:45 GMT).\nIt was a frantic, dramatic encounter back in January when the two sides last met in Lisbon and Raphinha's winner settled the outcome at 5-4.\nThe opening period showed promise of a similar enthralling tie as Kerem Akturkoglu's drilled shot forced Szczesny into an early save, before Dani Olmo went close at the other end.\nAnatoliy Trubin made a brilliant triple save, denying both Robert Lewandowski and Lamine Yamal before catching the final attempt.\nBut Benfica had chances up against Barcelona's high defensive line, which ultimately resulted in Cubarsi's last-ditch challenge on Pavlidis and the 18-year-old's early dismissal.\nThe red card turned the tie into a scrappy affair with neither side able to make their shots count as the first half concluded under a cloud of smoke from the home fans' pyrotechnics.\nPavlidis, who scored a hat-trick in that 5-4 defeat and has scored 10 goals in his last seven appearances in all competitions, should have put Benfica ahead early in the second half.\nBut he scooped over the bar from Alvaro Carreras' cutback, before Barca keeper Szczesny made a brilliant reaction save moments later to deny the Greek forward.\nThe home side were dominant in the second half and recorded 15 shots with five on target, but it was forward Raphinha who struck the decisive blow to give Barcelona a slim advantage with their only second-half effort on target.\nA late flurry of corners for the hosts made for a tense finale and Szczesny produced another fine save from Renato Sanches, a stark difference from his horror show in January where he was at fault for two of Benfica's four goals.\nThe Polish stopper was fortunate the late penalty award was overturned by the offside decision and it left Benfica with a tough task in the return.\nFor La Liga leaders Barca, an assured and professional performance extended their unbeaten run to 16 in all competitions.", "url": "https://www.bbc.co.uk/sport/football/live/ce9828pdjxkt"}