{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:37:46", "date_modify": "2025-05-21 05:37:46", "date_publish": "2025-02-08 19:59:52", "description": "Clement vows to learn from previous cup mistakes", "filename": "sport_articles_c5ydzv7lq2yo_1747805866.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6436/live/123437d0-e657-11ef-a046-5b66c18424ca.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c5ydzv7lq2yo_1747805866.html", "title": "Clement vows to learn from previous cup mistakes", "title_page": "Clement vows to learn from previous cup mistakes - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Rangers manager Philippe Clement is aware of the dangers posed by playing lower league opposition in the cup.\nThe former Monaco manager was on the wrong end of a cup shock back in 2023, losing on penalties in the Coupe de France to Ligue 2 Rodez after losing a two-goal lead.\nCurrent side Rangers host Championship side Queen's Park and Clement insists he's learned his lessons from his time in France.\n\"I put too many young guys in to give them a chance on that day and the senior guys didn't perform as they should have done to help the young guys,\" the Belgian said.\n\"On that day the other team was 100 per cent efficient and had the day of their lives.\n\"So, cup competitions are always something dangerous. You need to balance things really well.\n\"I had a lot of cup games in a different way in Monaco and with other teams, but it's something that happens every season in every league.\n\"We are very ambitious for this game on Sunday, and we respect Queen's Park.\n\"We will have the same preparation that we had against Manchester United or Tottenham [in the Europa League].\n\"I read that they're not going to park the bus and they're going to go full into the fight to get results. So that's what I expect, but it can also be the bus so we will see.\n\"It's a team that can do good offensive actions. They have also really interesting set-pieces that they clearly work on a lot.\n\"They're going to count on the counter-attacks and the set-pieces in this game. We need to be very focused on that.\"", "url": "https://www.bbc.com/sport/articles/c5ydzv7lq2yo"}