{"authors": ["Eshlin Vedan", "www.facebook.com"], "date_download": "2025-05-21 06:25:08", "date_modify": "2025-05-21 06:25:08", "date_publish": "2024-12-24 12:00:19", "description": "Once associated with South African gangsters, spinning has transcended its origins and become a source of hope and entertainment for working class people.", "filename": "sport_motorsport_articles_c5y853peeejo_1747808708.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8d99/live/996d7070-be1d-11ef-bb99-316fff425d8e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_motorsport_articles_c5y853peeejo_1747808708.html", "title": "Car spinning: South African motorsport set for boost with government backing", "title_page": "Car spinning: South African motorsport set for boost with government backing - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Spinning's unique combination of stunts, acrobatics and burning rubber has made this Southern African motorsport an addictive experience for the likes of teenager Violet Chabaku.\nSince originating in townships during the Apartheid era, when criminals showed off stolen cars and celebrated the lives of the recently deceased, it has evolved into a thriving sub-culture.\nFamilies are drawn to regular meetings where noise, smoke and precision driving thrill the crowds, often in the thousands, and create stars of those who leave their seat behind the wheel to clamber upon the chassis of a vehicle - or even exit it entirely.\n\"I really enjoy the adrenaline,\" Chabaku told BBC Sport Africa.\n\"When I started I was super-excited to know everything. I wanted to do the stunts immediately.\"\nAs with most high-speed motorsports, spinning comes with inherent risks. A mechanical glitch or mistimed stunt while balancing yourself on the bonnet, sunroof or a door handle can result in serious injury.\nAccording to Samkeliso Thubane, a top South African spinner nicknamed Sam Sam, the secret is knowing how to calculate your vehicle's movement.\n\"You are controlling a car that's not in control,\" he said.\n\"We know how to avoid anything that can go bad. Because we practice we are able to perform perfectly.\"\nChabaku's own worries diminished as she learnt the art near her home in the Free State Province.\n\"A lot of people fear it's too dangerous or something might happen to them,\" the 19-year-old explained.\n\"When I bumped the car for the first time I think my life flashed before my eyes.\n\"It was scary at first because you make a lot of mistakes. But once I got the hang of it, the fear is not there anymore.\"\nOrganised spinning events typically take place at designated areas on racetracks and tend to draw a working class following, while the more informal events on streets are usually illegal.\nYet what was a sub-culture could enter the mainstream in South Africa thanks to support from sports minister Gayton McKenzie, a former gangster who spent a decade in prison and was a spinner in his youth.\nHis ministry announced a sum of 5m rand ($272,000, £216,500) will be spent on promoting a discipline that McKenzie believes could become one of the biggest sports in the country.\n\"I've been to empty rugby and cricket games. I've not been to empty spinning events,\" he told BBC Sport Africa.\n\"It interests our children, attracts all ages and, as government, we should do what our people love. I'm going to make sure spinning takes its rightful place like rugby and football.\"\nMcKenzie thinks the joy brought to communities by car tricks even has the potential to reduce crime rates - albeit temporarily - in a nation which has one of the highest murder rates in the world.\n\"In Mitchells Plain (in Cape Town), for example, there are shootings every day. When there's a spinning event, the shooting subsides or stops.\"\nRecognised as an official code by Motorsport South Africa in 2014, spinning has grown in leaps and bounds and shed the negative stereotypes associating it with the criminal underworld.\nChabaku was even introduced to the sport by her father Debby, a policeman.\n\"The concept that a lot of people have when they look at spinning is gangsterism,\" Debby explained.\n\"It's the mentality of people who do not come. This has nothing to do with illegal activities. This is a pure motorsports show [now].\"\nThe ride of choice for most spinners is a BMW because the manufacturer's E30 model released in the 1980s was favoured by the sport's pioneers in townships.\nKnown in South Africa as a gusheshe, its durability helped cement its status among the spinning community.\n\"It's a car that can handle all the punishment that we take it through,\" Thubane added.\n\"When we're spinning, the car is always on the limiter. The engine, suspension and entire car goes through a lot.\"\nThubane's skills have seen him draw sponsorship from major companies, welcome backing for a costly sport which can entail engine fixes, waiting for spare parts and replacing burnt-out tyres, alongside travel costs.\nThe 32-year-old hopes to \"go international\" but sees a bright future for spinning in his homeland.\n\"Gayton McKenzie is going to fight and make spinning a recognised, official sport,\" he said.\n\"From where it started off to where it's going, a lot has changed. I don't know anyone in spinning who is a gangster. It unites all types of people.\"", "url": "https://www.bbc.com/sport/motorsport/articles/c5y853peeejo"}