{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:20:44", "date_modify": "2025-05-21 05:20:44", "date_publish": "2025-04-03 12:59:44", "description": "West Ham news: Fan views on an issue no-one is talking about", "filename": "sport_football_articles_c9djl8e510po_1747804844.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c9djl8e510po_1747804844.html", "title": "West Ham news: Fan views on an issue no-one is talking about", "title_page": "West Ham news: Fan views on an issue no-one is talking about  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked you to tell us one thing that no-one is talking about at West Ham\nHere are some of your comments:\nFraser: A lot of West Ham fans who were showering abuse on David Moyes this time last year owe him a big apology. We've gone backwards since turning our back on West Ham's best manager of the Premier League era. However, Potter has what it takes to rebuild the team. He deserves the support and patience that Moyes didn't get for much of his last two years.\nSimon: Is Graham Potter really the tactical genius we were led to believe at Brighton? Put simply, no. Another defensive manager whose answer to stop shipping goals is just to have everyone behind the ball all the time. We wait till we are losing, then the second half is better, but the damage is done. I think he'll relegate us if he stays.\nJoe: Should West Ham sell players like Paqueta and Kudus to give Potter the funds to build the team he wants? You can tell he isn't confident with the whole squad but needs some serious money to make a team able to compete at the level we want to be\nNicolas: The club splashed the cash last summer and brought in a lot of players, but we may need to do the same again. We have players whose contracts are running out and we also have some players who want to move away, not to mention our loan players who look likely to return to their parent clubs after this campaign. We may need another mini rebuild this summer.", "url": "https://www.bbc.com/sport/football/articles/c9djl8e510po"}