{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:25:27", "date_modify": "2025-05-21 06:25:27", "date_publish": "2025-03-31 12:11:16", "description": "Fulham news: Marco Silva on Emile Smith Rowe's first season with club", "filename": "sport_football_articles_c39jk9e07d9o_1747808727.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ae3c/live/f106f0d0-0e28-11f0-b851-29ea4ea8a4cd.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c39jk9e07d9o_1747808727.html", "title": "Fulham news: Marco Silva on Emile Smith Rowe's first season with club", "title_page": "Fulham news: Marco Silva on Emile Smith Rowe's first season with club - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Fulham's Premier League game against Arsenal on Tuesday could see midfielder Emile Smith Rowe make his first appearance at Emirates Stadium since he left the Gunners at the start of this season.\nFulham boss Marco Silva said there have been \"some ups and downs\" during the 24-year-old's first season at Craven Cottage, adding: \"This doesn't surprise us for a player who was not playing enough football for the past two seasons.\n\"He had a very good impact in the first few months, but after the second international break he was down - December was a difficult month for him. He needs to find the right consistency in his game to perform at a very good level and this is the main thing for us.\"\nSmith Rowe has five goals and two assists in 32 appearances for the Whites, showing flashes of the ability that won him England recognition three seasons ago.\n\"I don't doubt his talent and quality, but the Premier League demands so many things from you and you always have to be in very good shape and top level physically,\" Silva said. \"This is something we have been working on with Emile.\n\"It is not going to be because the game is against Arsenal that he is going to have more hunger or not. The season so far from Emile is not about the hunger - it is many aspects.\n\"I can take many positives from him so far - he has probably played more than 20- 25 games and we have seen an impact in half of them. For a player like him, we are working with him to have more impact in a consistent way.\"", "url": "https://www.bbc.com/sport/football/articles/c39jk9e07d9o"}