{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:46:42", "date_modify": "2025-04-26 06:46:42", "date_publish": "2025-03-01 13:15:00", "description": "'This type of performance has to be the standard from now on' - Your views on Edinburgh win", "filename": "sport_articles_c2ljzvg1vjdo_1745650002.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/00e5/live/916f7080-f69e-11ef-896e-d7e7fb1719a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_c2ljzvg1vjdo_1745650002.html", "title": "'This type of performance has to be the standard from now on'", "title_page": "'This type of performance has to be the standard from now on' - Your views on Edinburgh win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Edinburgh fans, we asked for your opinions on the surprise 34-28 win over Munster in Cork.\nHere's a taste of what you had to say:\nAlan: Been here before. I'll believe Edinburgh have turned a corner when they put in three or four decent performances in a row.\nRoss: Where has this attack and power been all season? Munster may have had a poor night out but Edinburgh dominated everything. Imagine the amount of tries Duhan and Darcy would score for fun if the scrum performed that well week in, week out.\nDavid: A remarkable turnaround which makes the Zebre game even more annoying. But, typical of Edinburgh to dampen it all by letting Munster take two losing bonus points. That rather took the shine off that win.\nSteve: Good and unexpected result, so fair play to the lads. However, there still appears to be a lack of intelligence in respect of game management. Why, when we already had the try bonus point, kick for the corner from a penalty? Munster were 13 points behind and the penalty was kickable. It's basic stuff still not being done well enough.\nArran: That was a lot better from Edinburgh. Yes, they were playing an inexperienced Munster side that gifted them two tries, but you take what you can get in rugby. Magnus Bradbury and Ben Muncaster were excellent, same with Ben Vellacott and Matt Currie. This type of performance has to be the standard from now on if we want to make the play-offs.", "url": "https://www.bbc.co.uk/sport/articles/c2ljzvg1vjdo"}