{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:42:42", "date_modify": "2025-04-26 06:42:42", "date_publish": "2025-03-02 11:08:43", "description": "Portadown manager Niall Currie says his side's display in their 2-0 defeat by Cleraine was the \"poorest performance\" they have had all season.", "filename": "sport_articles_c4gmr463542o_1745649762.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e7a5/live/a4433210-f756-11ef-b0ec-f990ca2ebe14.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_c4gmr463542o_1745649762.html", "title": "Currie critical of 'unacceptable' Ports display in defeat", "title_page": "Irish Premiership: Currie critical of 'unacceptable' Ports display in defeat - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Portadown manager Niall Currie said his side's display in their 2-0 defeat by Coleraine was the \"poorest performance\" they have had all season.\nA deflected effort from Ronan Doherty in the first half and a second-half goal from Jamie Glackin secured the win for the Bannsiders, who are now just a point behind the Ports.\nAnd Currie was frustrated by the manner of their second successive league loss, when they had the chance to further strengthen their push for a top six place.\n\"I'm infuriated because of the magnitude of the game, we could have created a good situation to put Coleraine out of the mix for top six,\" he told BBC Sport NI.\nI'm hugely disappointed that is the poorest performance we have had all season. I think we just need to get back to basics, they wanted it more and had real hunger and we were the opposite.\"\nCurrie was particularly frustrated by his side's perceived lack of effort to get back in the game in the second half.\n\"I'm speechless, I think that second half was like something you watch in a pre-season game when a Championship club comes up against a Premiership club.\n\"We had no urgency about us, and it was unacceptable, we didn't show up.\"", "url": "https://www.bbc.co.uk/sport/articles/c4gmr463542o"}