{"authors": ["Michael Beardmore", "www.facebook.com"], "date_download": "2025-05-21 07:43:32", "date_modify": "2025-05-21 07:43:32", "date_publish": "2025-05-20 13:02:47", "description": "Walsall legend David Kelly says \"immortality\" awaits any Saddlers player who can score the goal to get them promoted at Wembley next week.", "filename": "sport_football_articles_ckg4486kr38o_1747813412.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7462/live/171dd3e0-3572-11f0-a288-d583f745f4b6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ckg4486kr38o_1747813412.html", "title": "David Kelly: Walsall 'immortality' awaits play-off final hero", "title_page": "David Kelly: Walsall 'immortality' awaits play-off final hero - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Walsall legend David Kelly says \"immortality\" awaits any Saddlers player who can score the goal to get them promoted at Wembley next week.\nThe Saddlers face AFC Wimbledon in the League Two play-off final on Bank Holiday Monday (26 May), bidding to end a six-year absence from the third tier.\nIt is only the third time Walsall have reached a play-off showpiece game - and they won both of the previous two.\nThe Saddlers beat Reading at the Millennium Stadium in 2001 and Bristol City back in 1988, winning promotion to the second tier on both occasions.\nKelly, now 59, scored a hat-trick in the 4-0 'third leg' replay win over the Robins 37 years ago, back when the play-off finals were decided over two legs, home and away.\nThat is a day still treasured by players and fans all these years later and Kelly told BBC Radio WM: \"It's immortality for whichever player scores that winning goal.\"\nWhile Kelly's Saddlers treble did not come at the national stadium, he did score there for Tranmere Rovers in their EFL Cup final defeat by Leicester City towards the end of his playing career in 2000.\nWalsall, meanwhile, somewhat staggeringly for a club founded in 1888, have only ever played at Wembley once, losing the 2015 EFL Trophy final 2-0 to Bristol City.\nSo, should any Saddlers player find the net on Monday, they would write their name in Walsall folklore as the club's first ever Wembley goalscorer.\n\"It's a fabulous opportunity,\" former Republic of Ireland striker Kelly added.\n\"The build-up to a Wembley game is so very, very different. It's nerve-wracking, that's for sure.\n\"It's the home of football. It will be a very, very big crowd. It's something to look forward to and embrace.\n\"You very, very rarely get to play in the best stadium in world football – Wembley is the most iconic stadium out there. It's a big, big privilege to play there.\"", "url": "https://www.bbc.com/sport/football/articles/ckg4486kr38o"}