{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:38:59", "date_modify": "2025-05-19 15:38:59", "date_publish": "2017-08-13 14:38:31", "description": "Britain's Tom Bosworth is disqualified in the men's 20km walk at the World Championships in London, as Eider Arevalo wins gold.", "filename": "sport_athletics_40917589_1747669139.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2FEF/production/_97317221_bosworth_getty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_athletics_40917589_1747669139.html", "title": "World Championships 2017: Tom Bosworth disqualified as Eider Arevalo wins gold", "title_page": "World Championships 2017: Tom Bosworth disqualified as Eider Arevalo wins gold - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Britain's Tom Bosworth was disqualified in the men's 20km walk at the World Championships, as Colombia's Eider Arevalo won gold.\nBosworth, 27, collapsed to the road in tears after being shown three red cards for technique infractions.\nHe finished sixth at the 2016 Rio Olympics and it was hoped he would compete for a medal in London. He was leading when he was disqualified.\n\"I'm gutted, but this is part of race walking,\" he told BBC Sport.\n\"I was just getting going and usually I'm really technically efficient. I'm definitely going to learn from this and get better, because it's clear that physically I can compete with the lead guys.\" he added.\n\"I was feeling pretty comfortable, so for two of [the red cards] to come in one lap was a real shock, hence my reaction of devastation.\"\nArevalo's time of one hour, 18 minutes and 53 seconds secured Colombia's first gold of the Worlds. Russian Sergei Shirobokov, competing as a neutral athlete, took silver and Brazil's Caio Bonfim won bronze.\nBritain's world junior champion Callum Wilkinson, 20, finished 41st.\nHe told BBC Sport: \"I'm just pleased to get round, it was a really tough race, so thanks to the fans who pulled me through it.\n\"I wanted to get up amongst it, but these guys put on an absolute show, it was an insane time, it killed me. I was just trying to cling on to what was left.\n\"I'm gutted for Tom, race walking is brutal.\"\nEarlier, China's Jiayu Yang won gold in the women's 20km walk, with Maria Gonzalez of Mexico taking silver and Italian Antonella Palmisano bronze.\nThe women's 50km walk was won by Portugal's Ines Henriques, with Hang Yin of China in second and countrywoman Shuqing Yang in third.\nFrance's Yohann Diniz won the men's 50km walk, with Japan's Hirooki Arai taking silver and countryman Kai Kobayashi bronze.\nGreat Britain's Dominic King was disqualified from that race - also at about the halfway stage.", "url": "https://www.bbc.com/sport/athletics/40917589"}