{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:47:42", "date_modify": "2025-04-26 03:47:42", "date_publish": "2025-03-04 17:59:34", "description": "New York Jets linebacker Quincy Williams says the franchise must share responsibility for the end of quarterback Aaron Rodgers' time with the team.", "filename": "sport_american-football_articles_cjw2n6nwy8eo_1745639262.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ff3b/live/c5c43930-f917-11ef-becb-07cbf84d799c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_american-football_articles_cjw2n6nwy8eo_1745639262.html", "title": "Aaron Rodgers: New York Jets 'failed as a team' during quarterback's stint", "title_page": "Aaron Rodgers: New York Jets 'failed as a team' during quarterback's stint - Quincy Williams - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "New York Jets linebacker Quincy Williams says the franchise must share responsibility for the end of quarterback Aaron Rodgers' time with the team.\nThe 41-year-old spent two seasons in New York but the Jets twice finished third in the AFC East and announced last month that he would not be returning next season.\nThe four-time MVP, who won his sole Super Bowl as a Green Bay Packer after the 2010 season, missed all but one game of the 2022 campaign because of an Achilles tendon injury and they finished a disappointing 5-12 last year upon his return.\nDespite winning just six of Rodgers 18 starts with the team, Williams stressed the entire roster \"had something to do with the losses\" during a spell that also saw head coach Robert Saleh and general manager Joe Douglas lose their jobs.\n\"Aaron didn't fail. The Jets failed as a team,\" Williams told BBC Sport NI at the launch of the Jets NFL Girls Flag league in Dublin.\n\"I play defence, they score points on me. You can't put it that it didn't succeed for Aaron alone.\n\"No, it didn't succeed for the Jets as a whole.\"", "url": "https://www.bbc.co.uk/sport/american-football/articles/cjw2n6nwy8eo"}