{"authors": ["Gareth Vincent", "www.facebook.com"], "date_download": "2025-05-21 06:25:48", "date_modify": "2025-05-21 06:25:48", "date_publish": "2025-03-31 11:49:42", "description": "Swansea City: Leeds United draw a lift as Alan Sheehan's side seek final push", "filename": "sport_football_articles_cz6dwx02wy6o_1747808748.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1967/live/fc036310-0e23-11f0-9a68-1b75bf032378.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cz6dwx02wy6o_1747808748.html", "title": "Swansea City: Leeds United draw a lift as Alan Sheehan's side seek final push", "title_page": "Swansea City: Leeds United draw a lift as Alan Sheehan's side seek final push - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Played 19 games, won 15 and lost only one, having scored a whopping 47 goals and conceded just nine along the way.\nLeeds United's home record in this Championship campaign before the weekend meant Swansea City travelled to Elland Road with hope rather than any great expectation.\nYet Alan Sheehan's squad made the long trip home from Yorkshire with a point in their pocket and wind in their sails.\nA 96th-minute equaliser guarantees a psychological boost, as does avoiding defeat when facing one of the best sides in the division on their ground.\nSo Saturday's 2-2 draw at Leeds – and the manner in which it was achieved – should be a fillip for Swansea as they attempt to finish another turbulent season in positive fashion.\nThe gap to the bottom three now stands at seven points, though that could be cut to five should Derby County beat Preston North End on Wednesday.\nEven if the Rams lose, there is work to do before Swansea can begin planning with certainty for another season in the second tier.\nDerby, who are 22nd, come to the Swansea.com Stadium this Saturday, before bottom-club Plymouth Argyle follow four days later.", "url": "https://www.bbc.com/sport/football/articles/cz6dwx02wy6o"}