{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:56:34", "date_modify": "2025-04-26 06:56:34", "date_publish": "2025-02-28 14:45:02", "description": "St Helens forward Morgan Knowles will leave the club at the end of the 2025 Super League season to join NRL side The Dolphins.", "filename": "sport_rugby-league_articles_cj6776zjrewo_1745650594.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ba1/live/52138a70-f5db-11ef-a452-97c9e2e951dd.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-league_articles_cj6776zjrewo_1745650594.html", "title": "Morgan Knowles: St Helens forward to leave after 2025 season", "title_page": "Morgan Knowles: St Helens forward to leave after 2025 season - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Forward Morgan Knowles will leave St Helens at the end of the 2025 Super League season to join National Rugby League side The Dolphins in Australia.\nThe 28-year-old has played 220 games over a 10-year spell for St Helens, scoring 32 tries and winning multiple honours including four Super League titles.\nThe England loose forward joined Saints through the club's scholarship programme when he was 14 years old and made his first team debut in 2015.\nHe will join up with former Saints boss Kristian Woolf on a two-year deal at The Dolphins, which only formed professionally in 2023.\n\"St Helens is my club, I was welcomed with open arms as a kid, and I've gone from being a young lad to the man I am now and that's because of all the people involved at the club,\" Knowles told the club website., external\n\"I'll forever be grateful to the club for everything they've given me and my family.\n\"My decision to move on is not something I took lightly. When the opportunity came up, I did not wish to regret anything when the time comes to retire.\n\"I didn't want any ifs, buts, or maybes in my mind, and it's an opportunity for my family to experience a different way of life too.\n\"However, it is really hard because I believe in this group we have at Saints and that this year, and in the years ahead, we are going to continue competing for trophies.\n\"I know there is success on the horizon. To step away from all my friends and such a good place to play, it is extremely hard.\"\nKnowles said he is \"driven\" and \"more motivated than ever\" to deliver success for St Helens in his final season.\n\"I'll be doing everything I can,\" he added. \"I am 'all in' this year to give everything for the playing group who I owe so much to, and to our fans as well to repay all the love I have been given since joining Saints.\"", "url": "https://www.bbc.co.uk/sport/rugby-league/articles/cj6776zjrewo"}