{"authors": ["Jordan Chamberlain", "www.facebook.com"], "date_download": "2025-05-21 05:48:40", "date_modify": "2025-05-21 05:48:40", "date_publish": "2025-01-14 11:56:37", "description": "Liverpool news: Opinion - Time for Jayden Danns over Darwin Nunez", "filename": "sport_football_articles_cwy1lyy1rg2o_1747806520.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2b81/live/3beedc30-b62c-11ee-8f07-bbfdfa890097.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cwy1lyy1rg2o_1747806520.html", "title": "Opinion - Time for Jayden Danns over Darwin Nunez - BBC Sport", "title_page": "Liverpool news: Opinion - Time for Jayden Danns over Darwin Nunez - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jayden Danns has played about 100 minutes of professional football for Liverpool. In that time, he has scored three goals.\nThe Scouser came off the bench against Accrington Stanley on Saturday and did more in 20 minutes than Darwin Nunez did in 90.\nIt is about time Arne Slot seriously considers selecting Danns ahead of Nunez, who has had enough chances to prove himself as a proper Liverpool number nine.\nHe misses chances. His head goes down. He makes bad decisions and you never, ever trust him in big moments.\nNunez is the only player to noticeably regress under Slot. With Jurgen Klopp in charge, Nunez was inconsistent and chaotic, but he still scored 18 goals last season. Halfway through this term, he only has two.\nDanns is confident, composed and just looks a much better finisher than the Uruguayan.\nReally, Liverpool need a new number nine and to sell Nunez to the highest bidder - but until then, Danns deserves opportunities. He can also hold the ball up and press, and has physical traits which belie his 18 years.\nIf Slot is not going to use Danns, then a Championship loan should be sanctioned.\nIdeally, though, he will stay and start the FA Cup fourth-round tie at Plymouth and hopefully the two Champions League dead rubbers coming up at the end of this month.\nWhat do you think, Liverpool fans? Has Danns done enough to deserve selection ahead of Nunez?", "url": "https://www.bbc.com/sport/football/articles/cwy1lyy1rg2o"}