{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 08:27:57", "date_modify": "2025-05-21 08:27:57", "date_publish": "2025-05-16 21:28:23", "description": "Wigan Warriors move top of the Super League table with a brilliant win over Leigh Leopards.", "filename": "sport_rugby-league_articles_c79edeq439wo_1747816077.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c49e/live/9a49f000-3298-11f0-ad3b-edeadc839b81.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-league_articles_c79edeq439wo_1747816077.html", "title": "Super League: Wigan 36-28 Leigh Leopards", "title_page": "Super League: Wigan 36-28 Leigh Leopards - Warriors win thriller to go top - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wigan Warriors moved above Hull KR to the top of the Super League table with a pulsating 36-28 victory over Leigh Leopards at the Brick Community Stadium.\nWhen these two met in the opening round of fixtures in February, all manner of records were broken in a 1-0 golden-point win for Leigh, the lowest-scoring Super League game.\nHere they served up the polar opposite with a 12-try thriller on a night when the scoreboard rarely stopped turning over.\nVictory moved Matty Peet's side to the top of the table on points difference over Hull KR, who have a chance to reclaim top spot against Huddersfield Giants on Saturday.\nIf Wigan and Leigh's single-point season opener had been entertaining in its own way, this was rugby league for the neutral with some scintillating attacking play.\nWigan were the first to fire as they raced into a 12-0 lead with converted tries from Liam Marshall and Jake Wardle inside nine minutes.\nYet Leigh gained a foothold in the contest when Owen Trout forced Jai Field into a fumble under a high ball on 19 minutes, and Tesi Niu bulldozed over close to the posts.\nBevan French was as ever at the heart of most of Wigan's play-making and it was the brilliant Australian whose pass put in Adam Keighran for Wigan's third try.\nJunior Nsemba made it four after a high ball bounced fortunately for Jake Wardle to gather and assist. And Kaide Ellis made it five when quick thinking allowed him to ground the ball when he was being held up on the line.", "url": "https://www.bbc.com/sport/rugby-league/articles/c79edeq439wo"}