{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:59:48", "date_modify": "2025-04-26 06:59:48", "date_publish": "2025-03-02 00:00:00", "description": "Follow live text commentary, score updates and match stats from Manchester United vs Leicester City in the Women's Super League", "filename": "sport_football_live_cjd3e01x2z1t_1745650788.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/665d/live/e73aac20-f76e-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_cjd3e01x2z1t_1745650788.html", "title": "Women's Super League", "title_page": "Manchester United vs Leicester City: Women's Super League stats & head-to-head - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Manchester United kept up the pressure on Women's Super League leaders Chelsea as they beat Leicester City on Sunday to secure their seventh consecutive league win.\nFirst-half goals from Melvine Malard and Leah Galton were enough for the home side to continue their 100% start to 2025.\nUnited dominated the opening stages without creating any clear-cut chances, passing up the opportunity to become the first team to score inside the opening 10 minutes in four consecutive WSL games.\nParity lasted 19 minutes until France forward Malard ran on to Ella Toone's through ball, sent Leicester goalkeeper Janina Leitzig to the ground with a drop of the shoulder and slotted into the empty goal.\nA few minutes later United wanted a penalty when Sam Tierney appeared to handle in the box but referee Phoebe Cross waved play on.\nMalard, making just her second WSL start of the season, continued to impress and set up Galton to double United's lead with a close-range finish in first-half injury time.\nVictory for United means have already beaten last season's WSL points total with seven points to spare.\n\"I felt we might fall off a little bit second half because we have only had two days to prepare from international duty,\" said boss Marc Skinner.\n\"Winners find a way to win and we have done that.\"\nLeicester were much-improved following the half-time introduction of Nicole Momiki, with the Japan attacker forcing Phallon Tullis-Joyce into a routine stop with a low strike.\nTullis-Joyce was almost caught out when a sliced cross from Catherine Bott struck the crossbar, and was fortunate that both Sam Tierney and Asmita Ale blazed over when presented with good chances unmarked.\n\"We didn't do enough in the first half clearly,\" said boss Amandine Miquel after the game. \"We were better in the second half but it wasn't enough. We gave ourselves troubles alone. We were late, we didn't move as a block and we opened up options for them which made it easier for them to score.\"\nUnited failed to really gain control but claimed a 10th clean sheet of the season, one more than Chelsea.\nVictory moves United within five points of league leaders Chelsea, who drew at Brighton later on Sunday as they dropped points for only the second time this season.\nLeicester remain 10th in the table and are now winless in their last 13 WSL away games. Amandine Miquel's side face the daunting prospect of a trip to London to face Chelsea on Wednesday.\nSkinner's side have not dropped points since a 1-0 defeat by Chelsea at the end of November, putting together a run of seven consecutive wins.\nElisabeth Terland has played a key role in United's season, scoring seven goals in 13 league games since joining the club from Brighton last summer.\nThe striker was unavailable on Sunday after picking up a knock playing for Norway during the international break, and Malard, 24, made the most of the chance afforded to her.\nLeicester's defence was unable to contain the 24-year-old in the first half, as she showed supreme composure to finish past Leitzig before showing her creative side with a cute pass for Galton to finish.\n\"A great headache,\" I am so pleased for Mel today, she deserved that. She worked tirelessly.\"\nMalard added that she would like to play alongside Terland in a front two, though Skinner tends to deploy a lone striker in his system.\nAsked by BBC Sport if she hopes to start more games before the end of the season, Malard replied: \"Yes. It's a good game for me today, I needed that. I need to play and score.\"\nShe will hope to keep her place in the XI when United face Sunderland in the Women's FA Cup quarter-finals next weekend.", "url": "https://www.bbc.co.uk/sport/football/live/cjd3e01x2z1t"}