{"authors": ["Andy Gray", "www.facebook.com"], "date_download": "2025-05-21 04:00:49", "date_modify": "2025-05-21 04:00:49", "date_publish": "2025-04-07 06:28:58", "description": "Former British and Irish Lions winger Tommy Seymour believes Ireland back row Caelan Doris will get the nod to lead the summer's tour to Australia.", "filename": "sport_rugby-union_articles_cwyn71e3lz7o_1747800049.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/69b0/live/569f0f60-130e-11f0-bb1f-752fc4c9ccf8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cwyn71e3lz7o_1747800049.html", "title": "British and Irish Lions: Caelan Doris has edge over Maro Itoje", "title_page": "British and Irish Lions: Caelan Doris has edge over Maro Itoje - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former British and Irish Lions winger Tommy Seymour believes Ireland back row Caelan Doris will get the nod to lead the summer's tour to Australia.\nDoris and England lock Maro Itoje have been tipped as contenders to captain the Lions.\nHowever, Seymour believes the existing connection Doris and head coach Andy Farrell have built during their time together with Ireland will sway the decision in the Leinster skipper's favour.\n\"What I think it will come down to, if I'm a coach it's so critical, from a messaging point of view, that you get that across as early as possible,\" 2017 tourist Seymour said on BBC Radio Ulster.\n\"There's a finite amount of time you have from a preparation point of view and bringing a squad together.\n\"That's how squads are made up, in terms of personalities and who is going to gel the best.\"\nFarrell will name his captain and squad for the tour of Australia at a live event in London on 8 May.\nThe tour takes place over seven weeks, with the Test matches against Joe Schmidt's Australia being played from on 19 July, 26 July and 2 August.\nSeymour said that Itoje's form while leading England to second place - above Ireland - in the Six Nations has brought him into the conversation about leading the Lions in the summer.\n\"Prior to the Six Nations, I think Maro Itoje was fighting for a starting spot,\" the former Scotland wing added.\n\"It's testament to how he has played that we're no longer talking about him being a potential start, but for the captaincy.\n\"He [Farrell] will be thinking, 'what does my captain know about me to tell other players how I like to see things and how I like to do things?'.\n\"That's where I feel that Doris has the edge, but I do think Itoje has done a wonderful job at bringing himself into that conversation.\"\nSquad selection for the Lions always stirs up debate and fly-half is set to be a hotly-contested position.\nEngland duo Fin Smith and Marcus Smith, Scotland's Finn Russell and the Ireland pair of Sam Prendergast and Jack Crowley will be under consideration to wear the 10 jersey.\nFormer Ulster fly-half Ian Humphreys believes England fly-half Fin Smith could be named in the squad at the expense of England team-mate Marcus Smith, with Russell and Prendergast also included.\n\"I think Prendergast will go and will start the first Test,\" said Humphreys.\n\"Marcus Smith could miss out because he didn't play there much in the Six Nations, so I think it will be Fin Smith, Prendergast and Russell.\nSeymour disagreed and said Marcus Smith's versatility and credit in the bank before the Six Nations means he is still in a strong position to get the nod.\n\"I feel like Marcus Smith was in a really strong position before the Six Nations,\" said Seymour.\n\"Through performance and selection he's maybe not as clear-cut now, and Fin Smith has been a wonderful player for England.\n\"Marcus Smith's ability to play 15 as well might provide him with a little bit of a leverage on Fin Smith.\"\nAn outside contender is Owen Farrell, son of head coach Andy, who has recently returned from injury for Racing 92, but has not played Test rugby since the 2023 World Cup.\n\"He's missed a lot of the season, but if he can get back to playing well - you talk about multiple positions,\" added Humphreys.\n\"In a good way, I don't think he [Andy Farrell] cares what anyone else thinks.\n\"If he can go out there and do a job, which no doubt he probably can, then it's not beyond the realms of possibility.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/cwyn71e3lz7o"}