{"authors": ["Andrew Petrie", "www.facebook.com"], "date_download": "2025-04-26 06:28:48", "date_modify": "2025-04-26 06:28:48", "date_publish": "2025-02-27 11:30:45", "description": "St Mirren 'dogfight' prepares Hearts perfectly for 'exciting' derby", "filename": "sport_articles_cedll261g8jo_1745648928.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ba8b/live/32dc0d00-f4fd-11ef-9808-4d9b058d1a40.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cedll261g8jo_1745648928.html", "title": "St Mirren 'dogfight' prepares Hearts perfectly for 'exciting' derby", "title_page": "St Mirren 'dogfight' prepares Hearts perfectly for 'exciting' derby - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "\"It's always a tough game against St Mirren home or away, they always make it physical, they always make it a dogfight.\"\nThe words of Jamie McCart, sporting a proper shiner on his left eye, having been on the receiving end of a Mikael Mandron elbow and a Killian Phillips shoulder charge on a bruising night where Hearts' second-half comeback propelled them to a 3-1 win and top-six place.\nBoth St Mirren players saw yellow for their troubles, in fact Phillips briefly saw red before it was downgraded after a VAR intervention - not that Hearts boss Neil Critchley agreed.\n\"Having seen it back, I'm not sure he looks at the ball and he's jumped straight into the man, so I think that could be classed as dangerous play,\" said Critchley. \"I'm not sure why the referee overturned it.\"\nDespite that head knock, no Hearts player competed in more duels than defender McCart's tally of 21 and no player on the pitch won more than him (14), while he also led the way for Hearts with 13 clearances and four fouls won.\nHe wasn't the only Hearts player on the receiving end of some tasty challenges. St Mirren conceded 16 fouls, up on their average of 13 per match. Hearts only conceded eight.\nStephen Robinson's side were also shown four yellow cards and their total of 68 in the league so far is only bettered, if you can call it that, by Aberdeen.\nAll this tells us that McCart was right, it truly was a dogfight, but perhaps all that scrapping makes the perfect preparation before the game in every Hearts' fan's calendar - the Edinburgh derby.\nLooking ahead to the huge game on Sunday, Critchley said: \"We're in good form, but so are they. It's certainly going to be a different type of situation than I faced the first time I went to Easter Road back in late October. Both teams are in a different situation.\n\"They're in form, we're in form, so it's got the makings of a really exciting game. We look forward to it. We can go there in good confidence, but so are they. I think both teams will be looking forward to what should be a really good game.\"", "url": "https://www.bbc.co.uk/sport/articles/cedll261g8jo"}