{"authors": ["Kelvin Kimathi", "www.facebook.com"], "date_download": "2025-05-21 07:16:52", "date_modify": "2025-05-21 07:16:52", "date_publish": "2025-05-20 10:14:57", "description": "Videos of mud-covered wrestling fights from a Ugandan town have racked up over 500 million hits on social media.", "filename": "sport_articles_c98p36y373ko_1747811812.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4bd0/live/a6916400-323f-11f0-8947-7d6241f9fce9.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c98p36y373ko_1747811812.html", "title": "Soft Ground Wrestling: The Ugandans who became a global social media sensation", "title_page": "Soft Ground Wrestling: The Ugandans who became a global social media sensation - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "In a quiet town on the outskirts of Uganda's capital, a group of young men and women are redefining professional wrestling and have become an unlikely global sensation.\nThey do not perform in a grand arena or have flashing lights, a jumbo screen or even canvas laid over wood in their ring.\nInstead, bamboo sticks and two faded yellow lines mark out a square of thick, sticky mud which forms the stage for Soft Ground Wrestling, popularly known as SGW.\n\"We didn't have the money to buy a real wrestling ring,\" Daniel Bumba, the man behind the homegrown spectacle, explained to BBC Sport Africa.\n\"So we improvised using bamboo from the forest nearby. And instead of canvas, we use the natural clay and the mud to soften the impact.\n\"That's what makes us unique.\"\nFrom its modest beginnings, SGW has racked up over 500 million views across TikTok, Instagram, X, Facebook and YouTube and draws passionate fans to its regular events in Mukono.\n\"They are our people. We love what they do,\" said one female supporter.\nDespite the hype on social media, SGW is not all glamour and adulation.\nThe wrestlers, predominantly either orphans or raised by single parents, receive no salary and rely on donations to get by.\nThey train under rain and blazing sun, cook basic meals of porridge outdoors, and sleep in rented dormitories.\nAged 23, Jordan Loverine has emerged as one of SGW's brightest stars and is a symbol of what the sport can mean to those with nowhere else to turn.\n\"Wrestling has given me hope after dropping out of school,\" he told BBC Sport Africa.\n\"I was almost giving up in life.\n\"But SGW has given me a new family and new dreams too - to become a great wrestler, to gain fame and success and to help others.\"\nMore than 100 young Ugandans, all aged 25 and under, now make up the SGW roster.\nAmong the standout talents is Lamono Evelyn from Northern Uganda, whose stage name is Zampi.\nRaised by her mother after losing her father as a baby, she never completed high school because of financial hardship.\nBut, through wrestling, the 20-year-old has found discipline, purpose and renewed hope.\n\"Before SGW, I had anger issues. I was arrogant,\" she told BBC Sport Africa.\n\"Wrestling helped me control my anger. Now it's my entire life. It has changed me mentally and physically.\"\nBumba, nicknamed Bumbash, is a lifelong wrestling enthusiast who grew up mimicking WWE (World Wrestling Entertainment) commentators.\n\"My mum used to beat me for loving professional wrestling,\" Bumbash, 37, said.\n\"But I was so passionate about it I started imitating the commentators, and eventually I was translating WWE matches into Luganda for local TV.\"\nBy 2023, Bumbash realised there was a hungry audience for the sport but no local infrastructure. So he took a bold step, training youngsters and building his own version from scratch.\nWhen he shared their first muddy matches online, the response was immediate. Professionals from WWE and AEW (All Elite Wrestling) even reached out to offer their support.\nSocial media continues to play a crucial role, with some fighters even recruited through TikTok.\nDespite the popularity of SGW online, Bumbash only recently started monetising their videos and brings in less than $1000 per month.\nThat covers just a small part of their operational costs, and Bumbash dips into his modest earnings as a local TV host to fund accommodation, meals and other expenses.\n\"Most of my salary goes to these young fighters. I don't even save anything,\" he said.\n\"They call me Papa. I'm always there for them. I feed them, house them and keep them close.\"\nSafety remains a pressing concern for SGW.\nAlthough bouts are scripted and choreographed, injuries from broken bones to neck strains still occur.\n\"We're trying so hard to get first aid kits, medicine and protective gear,\" Bumbash said. \"But money is always the issue.\"\nIt is not unusual to see a career-ending injury at least once a month.\n\"Sometimes it's a backache or a neck injury,\" Bumbash added. \"Sometimes a young fighter breaks a bone.\n\"We try to respond quickly, but it's tough without proper equipment.\"\nDespite the risks, passion remains undimmed among the wrestlers.\n\"It takes sacrifice,\" said Loverine.\n\"You have to leave many things behind - friends who discourage you, work opportunities - and focus on wrestling.\"\nZampi added: \"Fighting in the mud is very hard. But if you really want something, you can do it.\"\nSGW eventually caught the eye of WWE star Cody Rhodes, who donated a game-changing professional ring to the group earlier this year.\n\"We can now compete at an international level,\" said Bumbash.\n\"But we will still maintain our mud fights. That's our identity.\"\nEven with the professional ring, SGW's fighters remain fiercely proud of their roots.\n\"I like the ring, but I prefer the mud,\" Zampi said with a smile.\n\"It defines the African way.\"\nWith fame growing, Bumbash hopes to build an even bigger future for SGW, starting with securing their home.\nThe field used for training is rented, and SGW risks losing its base unless it can raise $40,000 to buy it.\n\"If we can buy this land we can build dormitories, a gym, a proper medical facility,\" said Bumbash.\n\"We want to create Africa's first world-class wrestling promotion, exporting talent to the global stage.\"\nAs they continue to wrestle in the mud, train in the rain and dream of the world stage, Uganda's soft ground wrestlers are proving that sometimes, greatness really does rise from the dirt.", "url": "https://www.bbc.com/sport/articles/c98p36y373ko"}