{"authors": ["Greg Playfair", "www.facebook.com"], "date_download": "2025-04-26 04:14:23", "date_modify": "2025-04-26 04:14:23", "date_publish": "2025-03-04 11:09:31", "description": "Hearts fan voice: 'Critchley has made us poorer in big games'", "filename": "sport_articles_c62zgz396d8o_1745640863.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8d74/live/25bd4090-f8df-11ef-896e-d7e7fb1719a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_c62zgz396d8o_1745640863.html", "title": "'Critchley has made us poorer in big games'", "title_page": "Hearts fan voice: 'Critchley has made us poorer in big games' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Third place now looks beyond Hearts after a second successive Edinburgh derby defeat.\nTo be fair, it's important not to get carried away and rewrite the past as when Neil Critchley took over, we were relegation fodder. He has improved the team and only three sides have picked up more points than us with Critchley at the helm.\nHe's been able to get victories home and away against sides we are expected to beat, which is easier said than done with a lot of teams content to sit in a low block.\nBut comparatively to Steven Naismith's Hearts, it feels like Critchley has made us a poorer side in the 'big games' against the Old Firm, Hibs and Aberdeen. Whereas the record shows Naismith was able to pick up victories – although came up short against the others, unlike Critchley.\nOur current head coach has picked up just three points from 24 in those big games and then add in the Petrocub result, which doesn't do him any favours.\nHis in-game management is also questionable at times and there were plenty of examples at Easter Road. After Hearts dominated the first half, Critchley tweaked his gameplan to 'take control' of a midfield battle our side was clearly winning, which then left Gerard Taylor exposed to Hibs' best attacking weapon Nicky Cadden and his deliveries.\nEvery Jambo in the Dunbar end was screaming out the obvious that we needed to change something but I don't know what Critchley was thinking.\nBut we lost because Hibs players simply wanted to win the game more and that's absolutely damning of everyone involved at Hearts.\nSander Kartum and captain Shankland showed a lack of urgency in the lead-up to Hibs' winner and we never threatened Jordan Smith's goal once in the second half.\nI don't agree with outlandish and reactionary shouts of getting rid of Critchley. He didn't assemble the majority of this side and the squad needs overhauled.\nFriday's Scottish Cup quarter-final against Dundee is now our biggest game of the season to date. Cup glory would absolutely change the season narrative into a success, so can the players bounce back and get us to Hampden?", "url": "https://www.bbc.co.uk/sport/articles/c62zgz396d8o"}