{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:38:34", "date_modify": "2025-04-26 04:38:34", "date_publish": "2025-02-28 10:20:18", "description": "Leicester news: 'The xG shows you a lot about West Ham defeat'", "filename": "sport_football_articles_c20llw6j9e0o_1745642314.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/aafe/live/14d6a1a0-f5b9-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c20llw6j9e0o_1745642314.html", "title": "Leicester news: 'The xG shows you a lot about West Ham defeat'", "title_page": "Leicester news: 'The xG shows you a lot about West Ham defeat' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Former Leicester defender Michael Morrison says \"willingness to run and fight\" was lacking from the Foxes' performance in Thursday's limp 2-0 defeat at West Ham.\nRuud van Nistelrooy's side have now suffered 11 defeats from the past 12 Premier League games and any hopes of survival this season seems to be fading rapidly.\n\"Tactically it was OK, it is OK to be in a low block, but it's that willingness to run and to fight,\" Morrison told the When You're Smiling podcast.\n\"Sometimes you don't realise you're not doing that as a player and you sit in your shape and you're comfortable. The reason why these deflected goals go in or it bounces of somebody and runs free is because you've been under that pressure for that long.\n\"As a fan you travel down from Leicester and you want to see your team fight, especially in the position you're in.\n\"There was too much respect shown and being a yard off their man.\"\nLeicester had 10 shots on goal but five were from outside the penalty area, five were blocked, and only two were on target. Their 0.38 Expected goals was far below their opponents' 1.68.\n\"There wasn't any chances,\" Morrison added.\n\"If you looked at the xG it would show you a lot about the game. West Ham won at a canter. Leicester didn't carry enough threat with their defensive block which is why the West Ham fans stayed onside with their team.\n\"If they could have caused the home team some problems by nicking the ball a few times they might have got on their back but it was a defensive block and not a defensive press by getting out to people, blocking crosses and laying a glove on them. West Ham just had possession the whole time in the first half.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c20llw6j9e0o"}