{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:50:21", "date_modify": "2025-05-21 03:50:21", "date_publish": "2025-04-07 11:17:00", "description": "Southampton news: Saints confirm Ivan Juric departure", "filename": "sport_football_articles_cy8e39r9pnlo_1747799421.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3d49/live/4fb70b20-139b-11f0-b054-11b99aeb4b3e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy8e39r9pnlo_1747799421.html", "title": "Southampton news: Saints confirm Ivan Juric departure", "title_page": "Southampton news: Saints confirm Ivan Juric departure - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Southampton manager Ivan Juric has left the club after 108 days in charge following Sunday's confirmation of the Saints' relegation to the Championship.\nAssistant Simon Rusk will take charge on an interim basis for the second time this season.\nIn a statement, the club said: \"We can confirm that we have today reached an agreement with our men's first team manager, Ivan Juric, to end his spell at the club.\n\"Ivan came to Southampton at a tough time and was tasked with trying to improve a squad in a difficult situation. Unfortunately, we haven't seen performances progress the way we had hoped, but we would like to thank Ivan and his staff for their honesty and hard work as they fought against the odds to try and keep us up.\n\"With relegation to the Championship now confirmed, we believe it is important to give fans, players and staff some clarity on the future as we head into a very important summer.\n\"The process of finding a new manager to lead us as we look to secure an immediate return to the Premier League has now begun and is being led by group technical director Johannes Spors.\n\"In the meantime, Simon Rusk has agreed to take charge of the team as interim manager for the remaining seven fixtures of this season and will be assisted by Adam Lallana.\n\"We remain incredibly grateful for the ongoing support of our fans. Their continued dedication and passion, despite what has been a very tough season, is remarkable and is appreciated by everyone at the club.\n\"Despite the challenges that relegation will bring, our goal is to restore a sense of pride for them in their team and club once again.\"", "url": "https://www.bbc.com/sport/football/articles/cy8e39r9pnlo"}