{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:28:05", "date_modify": "2025-05-20 14:28:05", "date_publish": "2023-07-29 10:34:56", "description": "Manchester City: Pep Guardiola confirms no direct replacement for Riyad Mahrez", "filename": "sport_articles_c3g4pzmmzwgo_1747751285.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3a73/live/6477d440-2dfb-11ee-a763-fbf7944b3d65.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c3g4pzmmzwgo_1747751285.html", "title": "Manchester City: Pep Guardiola confirms no direct replacement for Riyad Mahrez", "title_page": "Manchester City: Pep Guardiola confirms no direct replacement for Riyad Mahrez - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester City manager Pep Guardiola has said \"Saudi Arabia has changed the market\" and confirmed the club will not be looking to sign a direct replacement for Riyad Mahrez.\nForward Mahrez joined Al-Ahli on Friday in a deal worth up to £30m, with the 32-year-old Algerian becoming the latest big-name recruit for the Saudi Pro League.\nSpeaking at a news conference during City's pre-season tour of South Korea on Saturday, Guardiola said: \"We are not looking for a replacement of Riyad in terms of skill because every player is different.\n\"We will see what happens with loan players and which players stay here. A few things are going to happen.\n\"Saudi Arabia has changed the market. A few months ago when Cristiano (Ronaldo) was the only one to go, no-one thought this many top, top players would play in the Saudi league.\n\"In the future there will be more, and that's why clubs need to be aware of what is happening.\n\"Riyad got an incredible offer and that's why we could not say don't do it.\"\nCity will continue their preparations for the 2023-24 season when they face La Liga side Atletico Madrid in Seoul on Sunday (12:00 BST kick-off).", "url": "https://www.bbc.com/sport/articles/c3g4pzmmzwgo"}