{"authors": ["Jamie Lyall", "www.facebook.com"], "date_download": "2025-04-26 07:50:36", "date_modify": "2025-04-26 07:50:36", "date_publish": "2025-02-25 15:41:19", "description": "Barry Ferguson speaks about his expectations, coaching staff and route to the job at his first media conference as interim Rangers manager.", "filename": "sport_football_articles_cwyded90k1lo_1745653836.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/60e1/live/90a53860-f38d-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cwyded90k1lo_1745653836.html", "title": "Barry Ferguson: What did we learn from Rangers unveiling?", "title_page": "Barry Ferguson: What did we learn from Rangers unveiling? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Rangers icon Barry Ferguson talked at length after being officially unveiled as the club's new interim manager.\nFerguson, who won 15 trophies across two glittering spells in the Rangers midfield, spoke passionately about his boyhood club, the demands he will place on his players and newly appointed staff, and his left-field route to a coveted managerial post.\nHe also gave an insight into his first 36 hours in the role and a few indications about what might be in store for Rangers and their fans over the next few months.\nHere are some of the noteworthy bits...\nFerguson has selected former Rangers team-mates Neil McCann, Billy Dodds and Allan McGregor as his lieutenants and was relieved by how quickly all three agreed to join him.\nAll three coaches have been part of vastly successful Rangers squads as players and represented Scotland, with 43-year-old goalkeeper McGregor only retiring at the end of the 2022-23 campaign.\nMcCann has managed Dundee, while Dodds took charge of Inverness Caledonian Thistle having been an assistant at Ross County between 2014 and 2017. Both have been working in the media, primarily for the BBC.\n\"Neil and Billy have got experience of managing at a good level,\" Ferguson said. \"Alongside Allan, they played with the club, know the demands and expectations, so that was important to me as well.\n\"They are bubbly about the place, big characters, like to get in amongst the boys and that's important because the last couple of weeks has been difficult.\n\"It was important I got the right people in. They are not yes men.\"\nIt is almost exactly three years since Ferguson resigned from his last managerial position with League 1 Alloa Athletic.\nHe had been in charge for nine months and left the club eighth in the third-tier table. Prior to that he had spells in the fourth tier with Clyde and Kelty Hearts.\nSince then, Ferguson said he had been enjoying the \"quiet life\", working with Rangers as a club ambassador, and harboured no immediate plans to return to the dugout until this opportunity arose.\nWhen asked if he felt ready to embrace the challenge of such a huge job, Ferguson's response was robust and emphatic.\n\"I wouldn't be siting here if I didn't,\" he said.\nHe added: \"I went down a different route as an ambassador.\n\"Did I want to get back into coaching and management? If I'm being brutally honest, I wasn't thinking about it. But when that phone call comes, there was no way I was going to turn it down.\n\"I am desperate to get started. I loved being out on the grass today with the players and can't wait to be on the touchline tomorrow.\"\nLong-time captain James Tavernier has not escaped fan criticism during Rangers' underwhelming league campaign to date.\nThe most prolific defender in British football history, the 33-year-old has had the armband since 2018.\nDuring a five-hour visit to Rangers' training ground on Monday evening with his coaches, Ferguson talked to Tavernier and remains convinced he is the right man.\n\"I don't think there was any need to change,\" he said. \"I had a good chat with James last night; he came in while we were in getting to know some of the staff.\n\"I spoke to him, looked him in the eyes and have no doubt he will give me 100% to lead this club until the end of the season.\"\nEighteen-year-olds Bailey Rice and Findlay Curtis were namechecked by the new boss as he discussed developing talent from the Rangers academy.\nFerguson - who forced his way into Dick Advocaat's Rangers team at the age of 18 - stressed the importance of bringing through home-grown players and suggested he would be willing to give youth its chance.\n\"If they're good enough, I will have no issue with playing them,\" he said.\n\"The door is open for young players and it is important as a club you always produce your own. I will do a lot of work to try and progress these guys as footballers.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cwyded90k1lo"}