{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:10:06", "date_modify": "2025-05-21 04:10:06", "date_publish": "2024-12-29 00:00:00", "description": "Oxford United score twice to comfortably beat Plymouth in the Championship and pile more pressure on Argyle boss Wayne Rooney.", "filename": "sport_football_live_c6230d170dyt_1747800606.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c6230d170dyt_1747800606.html", "title": "Oxford United 2-0 Plymouth Argyle: Wayne Rooney's side beaten by U's", "title_page": "Oxford United 2-0 Plymouth Argyle: Wayne Rooney's side beaten by U's - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Oxford United scored twice to comfortably beat Plymouth in the Championship and pile more pressure on Argyle boss Wayne Rooney.\nBoth sets of fans directed chants towards Rooney during the game, with his bottom-of-the-table Plymouth side now having failed to win any of their past nine matches.\nThe hosts opened the scoring in the first half through a diving header by U's defender Ciaron Brown at the back post.\nPrzemyslaw Placheta doubled the Oxford lead just after the hour, setting himself to score his second Championship goal of the season after being played in behind.\nOxford have now won both of their opening two games with new boss Gary Rowett at the helm, with this result following an impressive win against Cardiff City on Boxing Day.\nThe U's are now three points clear of the relegation zone, while Argyle are four points from safety, albeit with a game in hand on fourth-from-bottom Hull City.\nInside a fairly quiet opening 10 minutes, the loudest cheer came from a moment where the ball was smashed into Rooney on the sidelines.\nTwo players launched into a challenge close to the touchline and the ball came flying out, smacking right into the former England captain and Manchester United player.\nMinutes later that cheer was topped as the U's took the lead through the head of Brown.\nTyler Goodrham picked up the ball just outside the box and whipped it in for Brown to leap and nod into the back of the net for his third Championship goal of the season.\nPlacheta remained one of Oxford's main threats in the first half, his pace and trickery down the right-hand side caused the Argyle defenders all kinds of headaches.\nThe Polish winger came close to scoring himself a number of times in the first half, running through on goal before having a shot blocked on the counter attack, and then later firing a shot across the face of the goal that was palmed away by Plymouth keeper Conor Hazard.\nArgyle started the second half brightly and appealed for a penalty when it looked as if Darko Gyabi was pushed over in the box but referee David Webb waved away those claims.\nRooney and his assistant Mike Phelan remained locked in animated conversations with the fourth official after the incident, frustrated as to why they had not been awarded a spot-kick.\nOxford then doubled their lead through the boot and pace of Placheta who was rewarded for his offensive efforts.\nRuben Rodrigues played the ball in behind to the winger, who cut back and then set himself before twisting and sending the ball into the net with his left foot.\nChants from the home supporters, suggesting Rooney's time at Plymouth might be nearing an end, had earlier followed the first goal and then increased after Placeta's strike.\nThe visitors had another late claim for a penalty waved away by referee Webb before the full-time whistle was blown, with the Argyle supporters loudly booing Rooney and his side as they went over to applaud the travelling fans.\nOxford United boss Gary Rowett speaking to BBC Radio Oxford:\n\"I thought we moved the ball really well and had long periods of control.\n\"We defended a lot better and didn't have that nervous ending like we did last time. We kept our shape nice and tight and the work rate was great, so I'm really pleased with the two games so far.\n\"In the Championship you have to be a complete side and that's why I'm so pleased about today. When I came into the building I told the players I want them to work as hard as they can and show us the quality they have got.\n\"I also asked them to show us spirit off the ball and you have to do that in this league if you want to put in performances and take points off other sides.\"\nPlymouth Argyle boss Wayne Rooney speaking to BBC Radio Devon:\n\"We didn't create enough chances and didn't do enough to stop them scoring their goals.\n\"With the first one, it comes from a cross and it's disappointing because we've been putting in work to stop crosses and get tighter to the man to stop it.\n\"The second goal comes from when they break out, we didn't do well enough one-on-one defensively and it has cost us.\n\"I expected a bit more today and we didn't get it but that's football, and unfortunately we come away with the defeat.\"", "url": "https://www.bbc.com/sport/football/live/c6230d170dyt"}