{"authors": ["Nigel Ringland", "www.facebook.com"], "date_download": "2025-05-20 14:10:31", "date_modify": "2025-05-20 14:10:31", "date_publish": "2023-07-30 12:03:00", "description": "Northern Ireland swimmer Daniel Wiffen agonisingly misses out on a World Championship medal as he finishes fourth in the final of the men's 1500m freestyle in Fukuoka.", "filename": "sport_swimming_66354730_1747750231.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/116D2/production/_130587317_muffindex.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_swimming_66354730_1747750231.html", "title": "World Swimming Championships: NI's Wiffen finishes fourth in Fukuoka final", "title_page": "World Swimming Championships: NI's Wiffen finishes fourth in Fukuoka final - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Daniel Wiffen agonisingly missed out on a World Championship medal as he finished fourth in the final of the men's 1500m freestyle in Fukuoka.\nThe 22-year-old couldn't stay with the pace of winner Ahmed Hafnaoui, who edged out Olympic and defending world 1500m champion Bobby Finke.\nWiffen didn't have the strength to catch early leader Sam Short from Australia, who held on for bronze.\nThe Magheralin swimmer clocked a time of 14:43.01 in the final.\nThat was slightly faster than he swam in the heats but not as quick as his Irish record of 14:34.91. However, Hafnaoui (14:31.54) and Finke (14:31.59) swam the second and third best times ever and that's the benchmark Wiffen must reach ahead of the Paris Olympics next year.\nMatching his fourth-place finish in the 800m freestyle earlier in the week, Wiffen has the two best performances ever by an Irish swimmer at a Long Course World Championships but the wait for a first ever medal for the country continues.\n\"There is bitter disappointment at going into the final with the fastest time and finishing fourth but that's sport I guess, I'll just have to go away and train harder and get faster,\" said Wiffen.\nShort took the race out under world record time and just after the 400m mark Wiffen began to fall off the pace. It took until 1000m for Hafnaoui and Finke to catch the Australian and move ahead and it looked like Wiffen would catch the tiring Short. Hafnaoui out-sprinted Finke for gold and completed the 800m/1500m double at the World Championships and Short impressively held on for third place.\nWiffen added: \"I had an idea about how the race was going to work out but on the day, I just wasn't good enough to keep up with the pace. I wanted to win that race and I didn't, I came fourth. I'll go home, I have the European under-23s in Dublin to look forward to and I'm going to focus on that, and I want to post some fast times there and then next season just go for that gold in Paris.\"\nIreland's Women's and Men's 4x100m medley relays both finished in 13th position in the morning's heats, provisionally placing them within the 16 relay spots available for Paris 2024. Fukuoka was the first opportunity for relays to qualify for the Games, with a second and final opportunity at the Doha 2024 World Championships where relays can be moved up or down the rankings.\nThe women's team of Danielle Hill (backstroke), Mona McSharry (breaststroke), Ellen Walshe (butterfly) and Victoria Catterson (freestyle) set a new Irish record when they combined for a time of 4:01.25. The quartet had held the previous standard of 4:02.93 from the 2021 European Championships.\n\"It was nice to get out there with the girls, I think it's only maybe the second time we raced together so I think the more we do it, the more we're going to learn, and that's what we've got to take from this, thirteenth is a nice place to be, but we would like more,\" Hill said after the race.\nCatterson said: \"It's always a privilege to be included and to be able to race with these girls, it was us exact four who held the record, so to show we're coming on in such big amounts only shows what's to come. Thirteenth is a decent place to be but we're always going to be looking for higher, we're not satisfied with being comfortable in thirteenth we want to solidify our place and get to Paris.\"\nIreland's Men's team of Conor Ferguson (backstroke), Darragh Greene (breaststroke), Max McCusker (butterfly) and Shane Ryan (freestyle) came home in 3:35.03 to win their heat, just 0.41 outside of the Irish record of 3:34.62 set in 2021.\nFerguson led out the team in the first leg in his second fastest time ever in the 100m backstroke clocking 54.14. \"I'm absolutely delighted with that, I'm even more delighted to be able to lead that relay off for the boys, it's been a phenomenal trip, and camp,\" said the Larne swimmer.\nEllen Walshe was also in action in the 400m Individual medley and swam her fourth fastest time ever in the event of 4:43.24 to finish in sixteenth place overall. At the end of the World Championships Ireland have three qualified swimmers for the Paris Olympics - Daniel Wiffen, Mona McSharry and Ellen Walshe.\nWiffen had two fourth place finishes in the 800/1500m freestyle while McSharry was fifth in the 100m breaststroke and Walshe ninth in the 200m individual medley. Larne's Hill and Ferguson both made semi-finals at their first World Championships and Ireland have three relays in provisional qualification places for the Olympics.\nIt's the best ever set of results for Ireland at a World Championships.", "url": "https://www.bbc.com/sport/swimming/66354730"}