{"authors": ["Nick McPheat", "www.facebook.com"], "date_download": "2025-05-21 04:38:08", "date_modify": "2025-05-21 04:38:08", "date_publish": "2025-04-04 16:18:39", "description": "Motherwell: Why Callum Slattery is key to potential top-six finish", "filename": "sport_articles_c1melelrkx4o_1747802288.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/bd2c/live/56724830-0fdb-11f0-ba12-8d27eb561761.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c1melelrkx4o_1747802288.html", "title": "Motherwell: Why Callum Slattery is key to potential top-six finish", "title_page": "Motherwell: Why Callum Slattery is key to potential top-six finish - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "By January, Callum Slattery still hadn't played a minute of Motherwell's season. Nine games later, the midfielder is one goal off being the club's joint top scorer for the campaign.\nPerhaps that says more about a lack of goalscorers in the Fir Park side, but in just five starts this term after returning from a serious year-long knee injury, Slattery has highlighted what the Lanarkshire club have been missing.\nWhile teenager Lennon Miller has deservedly received plenty of plaudits for his ability to dictate play and create from midfield, Motherwell have lacked the drive, energy and quality Slattery provides higher up the pitch.\nFollowing the appointment of manager Michael Wimmer, the 26-year-old has been deployed in one of the two advanced positions in a box midfield.\nFrom there, Slattery has been able to press the game high while having the freedom to receive the ball in dangerous positions.\nIn four starts under German coach Wimmer, the all-action midfielder has scored three goals and provided one assist. He has never scored more than four goals in a Premiership season since his arrival from Southampton in 2021.\nSlattery's underlying numbers also catch the eye. Out of all the Motherwell squad, and on a per-90-minutes basis, he ranks top for successful passes in the opposition half, top for fouls won, second for shots attempted, third for chances created and third for duels won.\nHe also ranks in the top five for touches, dribbles attempted and possession won in final third. Those stats become more impressive when you take into consideration the fact he will still be working his way back to full fitness.\nAnd that is now the key for Wimmer, to make sure his star man is able to reach peak fitness while maintaining the performance level he is showing.\nMotherwell have endured an injury nightmare for much of this season, but if they want to snatch a top-six spot, it is imperative the manager has his key men to rely on - and Slattery certainly falls into that category.", "url": "https://www.bbc.com/sport/articles/c1melelrkx4o"}