{"authors": ["Ged Scott and Mark Elliott", "www.facebook.com"], "date_download": "2025-05-20 14:11:50", "date_modify": "2025-05-20 14:11:50", "date_publish": "2023-07-30 08:27:09", "description": "Telford's European super-bantamweight champion Liam Davies is edging towards a world title shot after his first-round stoppage of Jason Cunningham.", "filename": "sport_boxing_66353077_1747750310.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1E4E/production/_130585770_liamd.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_boxing_66353077_1747750310.html", "title": "Liam Davies: Telford boxer eyeing world shot after first-round stoppage", "title_page": "Liam Davies: Telford boxer eyeing world shot after first-round stoppage - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "European super-bantamweight champion Liam Davies knows he is edging towards a world title shot following his first-round destruction of Jason Cunningham in Telford on Saturday night.\nDavies, 27, took just two minutes and 46 seconds before forcing referee Victor Loughlin to call a halt to his meeting with Yorkshireman Cunningham.\nHe was already ranked in the world top 10 - and will now move higher.\n\"I'm 27 and into my prime. All I want to do is fight,\" he told BBC Sport.\n\"I don't really care who's next, other than 'how much',\" joked Davies, who is also the British champion and holder of the WBC International and WBO International super-bantamweight belts.\n\"I just want it to be soon. And there are talks about October.\"\nAfter making it 14 straight wins from 14 fights, in his first contest of 2023, Davies wants to be kept busier as he homes in on his dream of becoming the first world champion produced by his trainer, Black Country Boxing's Errol Johnson - and Shropshire's first since Richie Woodhall in 1998.\n\"I can't be Telford's first world champion,\" he told BBC Radio Shropshire. \"But I can be Errol Johnson's first BCB world champion.\"\nGoing into the fight with 33-year-old Cunningham at the Telford International Centre, his first since becoming European champion in November 2022, Davies believed the strength from all his gym work would prove key against the 'Iceman' from Doncaster.\n\"The first time I caught him I knew I'd hurt him, and I feel the referee made the right decision,\" he said.\n\"I'm filling out. Everyone who works with me in the gym knows I'm strong.\n\"I've been more dedicated in the gym and I feel like my strength showed. That and showing the cleverness to move and find him again.\n\"I've trained so hard. I've given everything to this sport and it's paying off now. And I will carry on doing so on until the wheels on the rollercoaster come off.\n\"I'm the first in the gym and the last out. My coaches keep telling me to have a day off. But, even when we got married in April, I trained on my honeymoon.\n\"I'm racing off now down to the caravan for a week off but I'm sure halfway through the week the running shoes will come out again.\"", "url": "https://www.bbc.com/sport/boxing/66353077"}