{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:31:37", "date_modify": "2025-05-19 14:31:37", "date_publish": "2017-08-13 18:16:36", "description": "Anthony Crolla says he will have to be at his best to beat Ricky Burns in their lightweight fight at the Manchester Arena in October.", "filename": "sport_boxing_40917801_1747665097.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/106D1/production/_97318276_hi040988271.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_boxing_40917801_1747665097.html", "title": "Anthony Crolla 'can't wait' for Ricky Burns fight at Manchester Arena", "title_page": "Anthony Crolla 'can't wait' for Ricky Burns fight at Manchester Arena - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Anthony Crolla says the build-up to his lightweight fight against Ricky Burns is devoid of \"trash-talking\" because of their respect for one other.\nCrolla, who faces Burns at the Manchester Arena on 7 October, told BBC Scotland: \"I can't wait for the fight.\n\"There will be a great travelling support from Scotland and I'll be in front of my beloved Manchester crowd.\n\"I've got a lot of respect for Ricky as a fighter and a person. I'll have to be at my best to beat him.\"\nCrolla lost his WBA lightweight title to Jorge Linares in September 2016 and the Englishman, from Manchester, was also beaten by the Venezuelan in a March rematch.\nBurns' last outing saw the Scot lose his WBA super-lightweight title to Julius Indongo in April.\n\"Everyone who knows boxing, Ricky's not the type to be trash-talking and neither am I,\" Crolla told BBC Radio Scotland's Sportsound.\n\"Everyone who knows boxing knows that this is a fight that doesn't need that to sell. Come 7 October in that arena, there's going to be an amazing atmosphere.\n\"It's going to be some night. They [the preparations] have been going very well and I'm in a very good place, physically and mentally. I'm just looking forward to the fight and believe I could be ready sooner.\n\"We can't wait for it and the winner, I'm sure, will go on to fight for a world title again. I know that I've got to be at my best to beat him but I'm very confident that's what I will be.\"", "url": "https://www.bbc.com/sport/boxing/40917801"}