{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:10:23", "date_modify": "2025-05-19 15:10:23", "date_publish": "2015-02-12 17:41:24", "description": "Antrim skipper Neil McManus is convinced the current Saffron squad is on the verge of making a major breakthrough.", "filename": "sport_gaelic-games_31447088_1747667423.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/80972000/jpg/_80972664_mcmanusleechin.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_gaelic-games_31447088_1747667423.html", "title": "Hurling League: Neil McManus predicts Antrim breakthrough", "title_page": "Hurling League: Neil McManus predicts Antrim breakthrough - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Antrim hurling captain Neil McManus says he is convinced that the current Saffron squad is on the verge of making a major breakthrough.\nKevin Ryan's side open their Division 1B Hurling League campaign away to Wexford on Sunday and McManus says the squad will head south in buoyant mood.\n\"The set-up we have has gone way beyond anything I've been involved with,\" Cushendall man McManus told BBC Sport.\n\"I think we are going to see more consistent performances from Antrim.\"\nMcManus says that the Saffron squad will head into this year's League far better prepared than any previous Antrim panel he has worked with.\nThe county has not played a competitive game since snatching a 2-17 to 2-16 victory over Derry in the Ulster Final in mid July but the captain insists that the long gap has allowed the squad to put in \"a lot of hard work\".\n\"It was tough going at times in pre-season but now we're earmarking the Allianz League and we can't wait to get at it on Sunday against Wexford.\"\nMcManus is still only 26 despite having been involved with the Antrim squad for nine years but he is now one of the more senior members of the panel along with the likes of Eddie McCloskey and Shane McNaughton who is nearing a return to full fitness after hip surgery.\n\"The group of guys such as myself who are 26, 27 are now the oldest players we have.\n\"There's a young crop in and around 18, 19, 20 and some of them have been in the panel for a couple of years and there's a real stability and togetherness in the team at the minute.\"\nIn terms of the younger crop, McManus lists Daniel McKernan, Ciaran Johnson, Jackson McGreevy, Niall McKenna, Michael Bradley and Eoghan Campbell as players who can help the Saffrons finally make their long-awaited breakthrough at national level.\nMcKernan, Bradley and Johnson have all been named in the Antrim team for Sunday's opener with McManus selected at midfield.\n\"Those younger boys have been giving big commitment and matching the kind of effort that the rest of us have been putting in for the last couple of years,\" added the Antrim captain.\n\"More than anything, that gives me the belief that better things are around the corner for Antrim hurling.\n\"Several of the young lads did get some game time in the League last year but they will be more of a permanent fixture this year because of the way that they have been pushing.\n\"The only way for Antrim is up. The breakthrough may take a couple of years because so many of our players are so young but when some momentum starts to build, who knows what could happen.\"\nMcManus adds that the sense of professionalism demanded by Waterford man Ryan has led to a sea change in terms of the squad's organisation.\n\"Each player will benefit from the approach that Kevin Ryan has brought to the set-up and I think that we've only started to see the benefit of that in the last few months.\n\"And that in turn givens everyone an extra level of confidence that maybe Antrim didn't have before.\"\nIn terms of Antrim's League task, McManus acknowledges that the Saffrons are going to have to produce excellent hurling even to be competitive in Division 1B.\nFor starters, they will be facing a Wexford team that hammered them 5-19 to 0-21 in the Leinster Championship last summer and then went on to beat then All-Ireland champions Clare and Waterford in the qualifiers.\nAnd it won't get much easier for the Saffrons during the remainder of the division with All-Ireland semi-finalists Limerick and Waterford also among their opposition.\n\"I don't think the gap between ourselves and Wexford in the game last summer was particularly representative and most games between us and usually extremely tight,\" adds McManus.\n\"We really want to perform to the best of our ability on Sunday and we feel the game will definitely be an opportunity to get two points on the board.\"\nAntrim: C O'Connell; R McCambridge, N McAuley, A Graffin; T McCann, C McKinley, M Bradley; N McManus, C Johnson; P Shiels, D McKernan, C McCann; C Clarke, PJ O'Connell, E McCloskey. Subs: S McToal, O McFadden, T O'Ciarain, S McCrory, J McShane, E Campbell, J McGreevy, C Carson, M Donnelly, S McAfee, D Hamill.\nWexford: M Fanning; E Moore, T Waters (capt), C Kenny; P Foley, L Chin, D Redmond; P Morris, G Sinnott; I Byrne, D Waters, D O'Keeffe; K Foley, J Guiney, L Og McGovern. Subs: N Breen, L Ryan, R Kehoe, E Conroy, E Martin, H Kehoe, J Kelly, W Devereux, S Tomkins, P Doran, C Devitt.", "url": "https://www.bbc.com/sport/gaelic-games/31447088"}