{"authors": ["Amelia Warren", "www.facebook.com"], "date_download": "2025-05-21 05:03:44", "date_modify": "2025-05-21 05:03:44", "date_publish": "2025-04-04 08:39:22", "description": "Derby fan Amelia Warren writes about the Rams' latest win and how boss John Eustace is working wonders in their fight to avoid relegation.", "filename": "sport_football_articles_cpdzne54xnxo_1747803824.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e14e/live/093fb950-1137-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cpdzne54xnxo_1747803824.html", "title": "Derby County: Rams revival to avoid relegation 'nothing short of remarkable'", "title_page": "Derby County: Rams revival to avoid relegation 'nothing short of remarkable' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The first half against Preston North End proved to be typical post-international break display - very stop-start, plenty of sloppy play from both sides.\nThis set up a pretty bleak atmosphere inside Pride Park, with neither set of supporters having much to really get excited about.\nThe half-time whistle blew and the collective yawns in the stands just about summed it up. John Eustace's half-time team talk no doubt focused on trying to break down Preston's rigid low block, with more energy and attacking intent.\nWhatever was said, it definitely helped.\nWith only three minutes of the second half played, Mr Derby County himself, Craig Forsyth, slotted home beautifully in the box following a corner that was headed down into his path by Nat Phillips. A goal from the veteran left-back, taken like a striker in his prime.\nThe South Stand bounced, chants of \"the Rams are staying up\" rang out all around Pride Park and, before they knew it, Derby had a second just four minutes later.\nAnother goal created by the head of Phillips, this time bundled in by Jerry Yates five yards out, pretty much killed the game off - which is something we haven't been able to say many times this season.\nDerby had struggled for so long under Paul Warne to take the lead and double it, often finding themselves caught out by being too negative after going ahead.\nHowever, since the arrival of Eustace the Rams have become much better at smelling blood and getting the insurance goal to end the contest.\nThe new boss is getting the best out of this group of players, increasing their confidence and performance levels as the weeks go on.", "url": "https://www.bbc.com/sport/football/articles/cpdzne54xnxo"}