{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:14:02", "date_modify": "2025-05-19 15:14:02", "date_publish": "2015-03-02 00:32:52", "description": "Fifa president Sepp Blatter says he is concerned by a report on racism in Russian football ahead of the 2018 World Cup.", "filename": "sport_football_31688474_1747667642.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81329000/jpg/_81329277_blatter_getty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31688474_1747667642.html", "title": "Fifa's Sepp Blatter 'concerned' by Russia racism report", "title_page": "Fifa's Sepp Blatter 'concerned' by Russia racism report - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Fifa president Sepp Blatter says he is concerned by the findings of a study into the scale of racism in Russia before it hosts the 2018 World Cup.\nA report by the Fare network and Sova Center highlights more than 200 cases of discriminatory behaviour linked to Russian football over two seasons.\n\"I am aware of the report - sure we are concerned, definitely,\" Blatter told Associated Press.\nIn 2014, he asked Russian President Vladimir Putin to tackle racism.\nThe Fare network is an organisation which works to combat racism in the game for European football's governing body Uefa, while the Moscow-based Sova Center conducts research on nationalism and racism.\nFare executive director Piara Powar told Associated Press that the research, conducted between May 2012 and May 2014 and published on Friday, \"shows a really quite gruesome picture of a domestic league which is full of aspects of racism, xenophobia\".\nBlatter spoke last July to Putin about the need to prioritise the tackling of racism, but there have been more cases, including in Champions League matches.\nIn October, Manchester City played their Champions League group game at CSKA Moscow behind closed doors because the Russian club was being punished for a series of offences, including racist chanting.\n\"Racism is one of the items which is on my agenda on the very top, every day. If it does not stop then there must be some sanctions,\" Blatter said.\n\"We have started a big education program with them. They are aware of the situation.\"", "url": "https://www.bbc.com/sport/football/31688474"}