{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:03:52", "date_modify": "2025-05-21 05:03:52", "date_publish": "2025-04-04 08:20:17", "description": "Bournemouth news: Max Aarons on 'loving' Valencia loan", "filename": "sport_football_articles_c5y5dx2w9dxo_1747803832.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7a70/live/56a88700-1126-11f0-8950-c1ec4174f99f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c5y5dx2w9dxo_1747803832.html", "title": "Bournemouth news: Max Aarons on 'loving' Valencia loan", "title_page": "Bournemouth news: Max Aarons on 'loving' Valencia loan - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Bournemouth loanee Max Aarons says he is \"loving\" his time in Spain after moving to Valencia in January.\nThe 25-year-old has made two appearances since the move, both against Barcelona - the team he was close to joining five years ago.\n\"From a young age it was always a dream of mine to play in Spain,\" Aarons told BBC Radio 5 Live's Euro Leagues podcast.\n\"In 2020 it nearly happened with Barcelona. Ever since then, I've said it doesn't matter which team, as long as it's in La Liga I would love to be there and the opportunity happened in January.\n\"You do have to be a certain kind of character to do that, especially as an English player. It doesn't happen a lot and I can understand for some players why it wouldn't be the right thing.\n\"But, for some, especially myself, it's something you always want to do and if you're to do it you have to immerse yourself in the culture and be all in. You can't expect to come in and it be England - you have to jump in and be ready.\n\"Learning the language, trying the food - everything. It's an experience and I have to say I'm loving it.\"\nValencia's Mestalla stadium holds 49,000 compared to the Vitality Stadium's 11,000 capacity and Aarons is enjoying the change in setting.\n\"I knew the Mestalla stadium was incredible before coming here,\" he added. \"One of my Bournemouth team-mates Justin Kluivert played here and told me 'you're going to be blown away'.\n\"The first game I couldn't believe it, it's crazy. It's no disrespect for where I came from in Bournemouth but going from there to here in January... you have to get used to the difference in the stadium and atmosphere.\"", "url": "https://www.bbc.com/sport/football/articles/c5y5dx2w9dxo"}