{"authors": ["Phil McNulty", "www.facebook.com"], "date_download": "2025-05-21 06:17:25", "date_modify": "2025-05-21 06:17:25", "date_publish": "2025-03-31 08:13:49", "description": "Man City news: Phil McNulty on Bournemouth win", "filename": "sport_football_articles_ceqr54xlr5go_1747808245.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d12b/live/405f0d60-0e02-11f0-a2ea-79c6fcf84b83.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ceqr54xlr5go_1747808245.html", "title": "Man City news: Phil McNulty on Bournemouth win", "title_page": "Man City news: Phil McNulty on Bournemouth win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "At the heart of Manchester City's win at Bournemouth was Guardiola - excitable, animated and showing with every action just how important the FA Cup is to him and City.\nEven by his own standards, Guardiola has rarely looked as engaged and involved as this.\nHe has a huge rebuild on his hands, and some cracks were still visible here, with an ageing squad containing the players he described as \"legendary\" called into action such as Ederson, Bernardo Silva, Ilkay Gundogan and Kevin de Bruyne.\nThis might be the last shot at glory as City players for some.\nAnd the use of Matheus Nunes at right-back, a position even his greatest admirers would not suggest he has the qualities for, showed how Guardiola has had an air of desperation about some resources he has juggled this season.\nThis was, however, about the here and now - not the future. The old trophy-winning muscle memory of Guardiola and his players kicked in when it mattered.\nIt looked like it was all Guardiola could do to stop himself entering the action at some points, mixing applause for his players with furious expressions of discontent at moments of carelessness.\nAnd at the final whistle Guardiola's elation overflowed in front of City fans basking in the glorious sunshine.\nHe marched at pace around every player, wrapping them in fierce bear hugs and even planting kisses on some.\nIf the FA Cup really is struggling to count as a consolation prize for Guardiola and City this season, you could have fooled everyone inside this ground who watched him.\nWinning the cup would not disguise the scale of the renewal Guardiola must oversee to restore City to their former eminence, but the great old prize will certainly be something to be going on with.", "url": "https://www.bbc.com/sport/football/articles/ceqr54xlr5go"}