{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:40:09", "date_modify": "2025-05-21 07:40:09", "date_publish": "2025-02-11 00:00:00", "description": "Coventry defender Bobby Thomas heads a late winner as the Sky Blues beat QPR 1-0 in the Championship.", "filename": "sport_football_live_cz6p200ww0et_1747813209.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cz6p200ww0et_1747813209.html", "title": "Coventry City 1-0 QPR: Bobby Thomas heads a late winner for Coventry", "title_page": "Coventry City 1-0 QPR: Bobby Thomas heads a late winner for Coventry - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Bobby Thomas' stoppage time header boosted Coventry's hopes of gatecrashing the Championship play-off race with a win over QPR, on a night when goalkeepers were on top at the CBS Arena.\nDefender Thomas rose to head home his third goal of the season from Jack Rudoni's 95th minute corner with QPR barely having time to restart the game before the final whistle sounded.\nVisiting goalkeeper Paul Nardi had kept the visitors in the game with a string of saves, including a superb double effort to deny Matt Grimes and Ellis Simms inside the opening 10 minutes.\nAt the other end Coventry's Oliver Dovin saved from Paul Smyth and kept out Michael Frey from close-range, as the game appeared to be heading towards a stalemate until Thomas produced his decisive moment.\nWith both sides starting the evening four points outside the division's top six there was an opportunity for them to close the gap, but the respective goalkeepers were in top form.\nKoki Saito fired an early shot over the Coventry bar before Nardi pulled off the first of his heroics.\nMatt Grimes - making his first league start for the home side since moving from Swansea in January - lined-up a shot from just outside the box which the Rangers custodian saved at full-stretch, before scrambling to block Ellis Simms' follow-up.\nThe Frenchman then saved from Jack Rudoni after he had been picked out by Victor Torp's cut-back, before Dovin was forced to save from Paul Smyth at full-stretch at the other end.\nMichael Frey should have given QPR the lead seven minutes into the second period as Kenneth Paal's pass found him with only Dovin to beat from six-yards, but he could not find his way past the Swede.\nNardi then did well to readjust his feet and save after Luis Binks deflected Torp's shot towards the bottom corner.\nTatsuhiro Sakamoto did have the ball in the net for Coventry only for the effort to be ruled out for offside, before both sides had late appeals for penalties turned down by referee Will Finnie.\nThomas ended-up having his shirt pulled off him by visiting captain Steve Cook and then Alfie Lloyd went down under a challenge from Binks with the official unmoved on both occasions.\nIn a frantic finish Nardi had to save at the feet of substitute Ephron Mason-Clark. But he was finally beaten as he was left stranded by a deep Rudoni corner to the far post where Thomas was left to climb above everyone and head into an empty net.\nCoventry move up to eighth place in the table and are now just one point outside the play-off places.\nCoventry head coach Frank Lampard told BBC CWR:\n\"It was a great feeling for everybody in the stadium - it was a tough night and looked like it was going to be 0-0.\n\"It's been a challenging week with the tough games we've had but we kept going and we got a win I think we deserved, not necessarily on the play because it was a close enough game.\n\"But in terms of the week we've been through it would have been easy to lose momentum tonight but we've been able to keep hold of it to a degree with the late winner.\"\nQPR boss Marti Cifuentes told BBC Radio London:\n\"We have been on the other side celebrating late goals but today is the opposite and we have to learn from it and move on.\n\"The whole changing room was angry and disappointed which is how I want to see my players when we lose a game like this. Most importantly, good teams react strongly after defeats and understand what is needed to change the dynamic.\n\"We are a young team as you can see from the players we had on at the end and usually you grow a lot through pain and it's something we'll learn quite well this season.\"", "url": "https://www.bbc.com/sport/football/live/cz6p200ww0et"}