{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:14:47", "date_modify": "2025-05-21 06:14:47", "date_publish": "2025-02-08 16:43:25", "description": "Switzerland's Belinda Bencic beats USA's Ashlyn Krueger in the Abu Dhabi Open final for her first WTA title since becoming a mother.", "filename": "sport_tennis_articles_c5yez72wnyeo_1747808087.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/79d0/live/552acc80-e638-11ef-a819-277e390a7a08.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_tennis_articles_c5yez72wnyeo_1747808087.html", "title": "Abu Dhabi Open: Belinda Bencic beats Ashlyn Krueger to win ninth title", "title_page": "Abu Dhabi Open: Belinda Bencic beats Ashlyn Krueger to win ninth title - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Switzerland's Belinda Bencic celebrated with baby daughter Bella in her arms after beating American Ashlyn Krueger in the Abu Dhabi Open final to claim a ninth WTA title and first since becoming a mother.\nThe former Olympic champion, 27, battled back from a set down to overcome 20-year-old Krueger 4-6 6-1 6-1.\nBencic's victory came just 10 months after the arrival of her first child and less than four months since her return from more than a year out on maternity leave.\n\"It's been a while,\" she said, greeting an appreciative crowd at the Zayed Sports City International Tennis Centre.\nThe former world number four's last WTA title came at the Abu Dhabi Open in February 2023.\n\"I am super happy to be back here in Abu Dhabi. I didn't imagine this. I am also getting a little bit emotional,\" she added, after the courtside presenter broke down in tears when presenting her award.\n\"I was working really hard to even play, coming back. So to also win a title in front of my family, it's really special.\n\"To my husband and my daughter Bella, I love you so much. It was a big dream for me to come back and play in front of her and to win a tournament.\"\nWhen Bencic returned to the sport in October her world ranking had dropped to 1,213, but she reached the fourth round of the Australian Open on her Grand Slam return and her run in the Abu Dhabi Open has helped her break back into the top 100.\nVictory means she will now move as high as 65th when the rankings are next updated.\nWorld number 51 Krueger, who has moved quickly up the rankings herself in recent months, looked capable of completing an upset to claim what would have been her second title and first at WTA 500 level.\nBencic was broken four times in losing the opening set but quickly regained the form that helped her claim an upset of her own by beating top seed Elena Rybakina in the semi-finals.\nA clearly disappointed Krueger was gracious in defeat, saying in her courtside interview: \"It is so impressive you coming back and being a mother, it's really inspirational, so congrats and good luck.\"", "url": "https://www.bbc.com/sport/tennis/articles/c5yez72wnyeo"}