{"authors": ["Emma Smith", "www.facebook.com"], "date_download": "2025-05-20 14:30:50", "date_modify": "2025-05-20 14:30:50", "date_publish": "2023-07-29 03:19:53", "description": "Captain Wendie Renard scores a late headed winner as France beat Brazil in a thrilling Group F game in Brisbane at the 2023 Fifa Women's World Cup.", "filename": "sport_football_66347063_1747751450.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1CA0/production/_130582370_gettyimages-1578338356.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66347063_1747751450.html", "title": "France 2-1 Brazil: Captain Wendie Renard scores winner in Women's World Cup thriller", "title_page": "France 2-1 Brazil: Captain Wendie Renard scores winner in Women's World Cup thriller - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Captain Wendie Renard headed a late winner as France beat Brazil in a thrilling game in Brisbane at the 2023 Fifa Women's World Cup.\nEugenie le Sommer put the French ahead after 17 minutes, before Debinha pulled Brazil level in the second half.\nThere was end to end action as two of the pre-tournament favourites delivered a game which lived up to expectations.\nBut it was Renard - who had been an injury doubt - who headed in the decisive goal with seven minutes to go.\n\"She is the leader of the team,\" France manager Herve Renard said of his captain. \"If she was not able to play today then it wouldn't be the same. We were lucky to have her today.\"\nBrazil would have qualified for the last 16 with victory but instead must wait until the final matchday to try to book a knockout spot.\nPia Sundhage's side meet Jamaica in their final group match, while France take on Panama. Both games will be played on 2 August, kicking off at 11.00 BST.\nFollowing a disappointing draw in their opening game against Jamaica and fitness concerns for key players - in particular Renard, who started having been touch and go with a calf problem - this was a make or break game for France.\nThe stakes were further heightened by a frenetic atmosphere in Brisbane, where the overwhelming majority of fans were in the yellow shirts of Brazil. When the Brazilian anthem was sung, you could have closed your eyes and imagined you were in the Maracana.\nBut France rose to the challenge, as their two on-pitch leaders - Renard, and all-time top scorer Le Sommer - took charge.\nTheir first goal was excellent. Sakina Karchaoui started the move with a left-footed cross from deep, Kadidiatou Diani kept it alive and Le Sommer was there with a perfectly cushioned header to steer the ball past Brazil keeper Leticia..\nIt was her 90th goal in 181 caps, and calms concerns about the French attack following the blunt showing versus Jamaica - which had led to recriminations among the squad, Le Sommer revealed.\n\"I think the turning point came from Jamaica,\" she said. \"Things got heated in the dressing room.\n\"Today we were up to scratch. We hope we can use this to improve even more so but it's three points in the bag and we showed what we were made of.\"\nThe celebrations after Le Sommer's goal were telling. Goalkeeper Pauline Peyraud-Magnin ran to the bench and jumped into a scrum of about 10 celebrating substitutes. Manager Renard joined in too, high-fiving everyone.\nThen, as it appeared they would have to settle for one point, captain Renard arrived at the back post unmarked to head in Selma Bacha's deep corner.\n\"I told you I trusted my girls,\" manager Herve Renard said. \"I was fully confident they were going to pull it out of the bag.\n\"Sometimes, it is good to get off to a shaky start as that sets the alarm bells ringing and then you can get back on your feet. We knew not to make any mistakes.\"\nIn their opening demolition of Panama, Brazil looked like the most cohesive attacking unit at the whole tournament. They were not allowed to be that by France.\nThe midfield became a battlefield, tough challenges aplenty. Brazil's Luana and France's Sandie Toletti were especially combative, both picking up first-half bookings for aggressive tackles.\nAs a result, Brazil's quick and skilful forwards were often starved of service in a below-part first half which Sundhage bemoaned as the main reason for defeat, rather than the failure to mark Renard for the winner.\n\"I don't believe in individual mistakes, it is about the team,\" she said.\n\"It is team work and I'm more concerned, not about the goals, but about the first half where we were not connected and could not see that many combinations. I apologise for that, it should be better than that.\"\nBrazil improved after the break and earned a slice of luck for their equaliser on 58 minutes.\nKerolin's pass took a deflection to fall perfectly for Debinha, and the Brazilian number nine calmly finished past Peyraud-Magnin.\nUltimately though they were outfought by France, and not even the introduction of the iconic Marta for her 22nd World Cup appearance could inspire another equaliser.", "url": "https://www.bbc.com/sport/football/66347063"}