{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:40:54", "date_modify": "2025-05-20 11:40:54", "date_publish": "2023-08-06 19:00:40", "description": "Newcastle United: Eddie Howe on 'determination' to end trophy drought", "filename": "sport_articles_cnlyv1g485zo_1747741254.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c53b/live/562f4120-348b-11ee-a158-bf7a432b945e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cnlyv1g485zo_1747741254.html", "title": "Newcastle United: Eddie Howe on 'determination' to end trophy drought", "title_page": "Newcastle United: Eddie Howe on 'determination' to end trophy drought - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Harry De Cosemo, BBC Sport at St James' Park\nNewcastle manager Eddie Howe says victory in the Sela Cup has whetted his appetite to end the Magpies' long wait for a trophy.\nHowe's side ran out 4-0 winners over Villarreal on Sunday, topping a group with Fiorentina and Nice to win the inaugural tournament at St James' Park.\nAlthough keen to stress it was only pre-season, Howe admitted winning a trophy is high on his agenda as soon as possible.\nNewcastle, who have not lifted any silverware since 1969, reached the Carabao Cup final last season but lost to Manchester United.\n\"On a very minor scale, yes [it has given us a taste of success],\" Howe told reporters after the Villarreal victory.\n\"It is only pre-season. It is nice to win a trophy but it is not the one we want.\n\"We are determined to win something, we are searching for that success. You dream of winning things, of lifting silverware. I want this place to be the same.\"\nSummer signing Harvey Barnes scored twice on his home debut and Howe was impressed with his integration into the team - but believes there is more to come from the former Leicester winger.\n\"When you sign a player with the attributes you want, you are not asking them to do anything they are not comfortable with,\" said Howe. \"Harvey looked good in the team. He performed really well; I was delighted with the two goals and the two finishes. Physically, he looked good as well.\n\"Every player is different and Harvey will have experienced Callum [Wilson] and Joelinton today. It is really good to see relationships blossoming. They will get stronger over time. It takes time to gel.\"", "url": "https://www.bbc.com/sport/articles/cnlyv1g485zo"}