{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:54:03", "date_modify": "2025-05-21 06:54:03", "date_publish": "2025-01-31 09:15:19", "description": "Everton news: Fan views on how to cope without Calvert-Lewin", "filename": "sport_football_articles_cwy7wp2ldz0o_1747810443.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cwy7wp2ldz0o_1747810443.html", "title": "Everton news: Fan views on how to cope without Calvert-Lewin", "title_page": "Everton news: Fan views on how to cope without Calvert-Lewin - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your views on how Everton will cope without Dominic Calvert-Lewin and where the goals might come from.\nHere are some of your comments:\nDon: Everton have Michael Keane who can score with his head and he is a good shooter. Why not use him until the end of season as a centre-forward? That's what they did way back. Remember Fred Pickering? He used to be a full-back. He was big and strong had a shot on him like a mule. Keane has scored some cracking goals for us.\nSteve: Just a thought, but how about giving Keane a run upfront? He's scored a few before and could help Beto score a few.\nDan: Like every team we need someone who can put the ball in the back of the net. We might as well cancel Armando Broja's loan if possible and try someone else. I just hope we can find another Kevin Campbell from somewhere! With 12 players out of contract this summer, I don't know how we are going to be able to afford to rebuild this squad under profit and sustainability restrictions. We have got to hope we have some academy graduates who suddenly develop into Wayne Rooney.\nBarry: David Moyes will have to be backed in the transfer market for attacking reinforcements. Central midfield is looking better with James Garner and Tim Iroegbunam coming back, but our creative options upfront and immediately behind are scarce. Beto and Abdoulaye Doucoure will likely be first choice but after that the cupboard is distinctly bare. If there are no other incomings, Keane might become a makeshift forward. It also begs the question, will anyone take a chance on DCL with his injury record, even on a free?\nPete: DCL is not a big loss. He's looked low on confidence, fitness, desire and has scored just three goals and made one assist this season. His latest goal against Tottenham was his first in 4 months. Dominic has appeared 22 times this season for Everton but yet only played 90 minutes eight times - you can't score if you're not on the pitch. I always think it's worth a punt on getting a cheap young enthusiastic player on loan - you never know how well it could work out.", "url": "https://www.bbc.com/sport/football/articles/cwy7wp2ldz0o"}