{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:10:35", "date_modify": "2025-05-21 07:10:35", "date_publish": "2025-01-22 14:42:35", "description": "Watford boss Tom Cleverley says his team won't be successful unless they can find more consistency in their performances.", "filename": "sport_football_articles_cq6g984vr32o_1747811435.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0826/live/b469d490-d8cb-11ef-bf89-cf1be2bb19ea.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cq6g984vr32o_1747811435.html", "title": "Tom Cleverley: No future in Watford being a team of mavericks", "title_page": "Tom Cleverley: No future in Watford being a team of mavericks - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Watford need more players who can do the basics well, says head coach Tom Cleverley.\nThe Hornets followed Saturday's 2-0 Championship win at Derby by being beaten 2-1 at home by mid-table Preston on Tuesday night.\n\"I've been promoted from this division and there is no future in giving a nine-out-of-10 performance on the Saturday and a two-out-of-10 on the Tuesday - you are better hitting seven every single game,\" Cleverley told BBC Three Counties Radio.\n\"The season we were promoted, we were a better than average team but our lowest performance was an average of six or seven out of 10 and we never went below that and that's by doing the basics.\"\nWatford have so far signed defender James Abankwah on loan from Italian Serie A club Udinese during the transfer window and Cleverley is looking for more new recruits.\n\"There's no future in being a team of mavericks in this division so we need more players who play percentage football and do the basics well.\"\nWatford are one point outside the Championship play-off places and visit Coventry City on Saturday.", "url": "https://www.bbc.com/sport/football/articles/cq6g984vr32o"}