{"authors": ["Nick Webb", "www.facebook.com"], "date_download": "2025-05-21 06:25:56", "date_modify": "2025-05-21 06:25:56", "date_publish": "2025-03-30 05:05:47", "description": "Glamorgan's new coach Richard Dawson says he is coming into a team with \"high potential players\" as the Welsh County prepare to start the new Championship season on Friday, 4 April.", "filename": "sport_cricket_articles_c5y014kre01o_1747808756.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7197/live/b69a5330-0ade-11f0-94d4-6f954f5dcfa3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c5y014kre01o_1747808756.html", "title": "Richard Dawson: Glamorgan offer 'a lot of potential', says new coach", "title_page": "Richard Dawson: Glamorgan offer 'a lot of potential', says new coach - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Glamorgan's new coach Richard Dawson says he is coming into a team with \"high-potential players\".\nThe Welsh county ramp up preparations for the new campaign with a three-day game against Cardiff UCCE starting Sunday, before beginning the County Championship season on Friday, 4 April.\n\"It's an amazing county with a rich history, and I've coached Welsh Fire so I know the city,\" said Dawson, who was appointed in February to succeed sacked Grant Bradburn as Glamorgan coach.\n\"It's a squad with two recent trophy wins [in the One Day Cup] and a lot of potential, so I'm looking forward to getting started.\n\"We've got the squad to be able to get into the T20 Blast knockout stages.\"\nEngland off-spinner Shoaib Bashir (on loan from Somerset) and Sri Lankan paceman Asitha Fernando are set to make official debuts against Leicestershire in the opening Championship Division Two match.\nBut seamer James Harris (calf) and all-rounder Dan Douthwaite (pectoral muscle) have joined leg-spinner Mason Crane (shoulder) on the injury list.\nDoncaster-born Dawson, 44, coached Gloucestershire for five years before various roles with England and was recruited at short notice following the shock departure of Bradburn.\n\"We're really lucky to have Richard, he's coming straight off a spell with England but he's got brilliant experience coaching Gloucestershire and the England pathway so he'll be perfect for us this year,\" said director of cricket Mark Wallace.\n\"He's a coach who makes players better and he's got a good idea of what the squad looks like. We're also going to have some involvement with [former Glamorgan and England coach] Matthew Mott who'll help in developing our coaches, doing some work on the male and female game.\"\nAfter Glamorgan finished a disappointing sixth in Division Two in 2024, Dawson is keen to emphasise progression of his players, both junior and senior, rather than setting targets for the number of wins.\n\"What we're looking for is progression in how we play cricket, how we play at home and being able to take [20] wickets is going to contribute to that,\" he reflected.\n\"If you can get to half-way and keep players fit, then it's about how you can push through September. Hopefully the wins will come if we do those other things.\"\nChampionship captain Sam Northeast has worked with Dawson in the England Lions set-up.\n\"He's pretty blunt, he's a straight talker but there's support with that, he'll put an arm round the shoulder at the right times. He's worked with a similar club to Glamorgan at Gloucestershire, so we've got to use his experience,\" said Northeast.\n\"Promotion is always the aim, we need a good start, we got it last year but the back-end didn't go as planned though we had an eye on the 50 overs and playing a few younger players.\"\nBashir is likely to be the only British newcomer in early season, filling in for Crane on a three-match loan stint, albeit when pitches are traditionally least likely to be spin-friendly.\n\"Once we heard Mason was injured, it was a question of reaching out to Somerset and the ECB to see if there was the potential to get Shoaib in. I worked with him in Brisbane on the England Lions tour, he's hungry to learn and wants to play,\" Dawson explained.\nAs far as overseas players are concerned, Glamorgan will have veteran South African batter Colin Ingram available throughout the season while Australian star Marnus Labuschagne may make a fleeting appearance in May.\nSri Lankan opening bowler Fernando has signed up for the first two months with the possibility of more, though the county could look for a different T20 bowling option.\n\"Asitha is a similar bowler to Michael Neser, he swings it and attacks the stumps so he'll be a really good addition. Hopefully he fits in well and we'll get him back at some stage later,\" said Northeast.\nThe captain started last season with a ground record 335 not out at Lord's and passed 1,000 first-class runs, mostly scored away from home.\n\"I haven't set any personal targets because I want the squad to do well and keep the younger players growing. But my game feels in a good place and it's just about having good mental vibes.\"\nGlamorgan's limited-overs form has shown a sharp divide between the One Day Cup, which they have won twice in four years with a relatively full-strength squad, and the T20 Blast where they have not progressed out of the group stage since 2017.\n\"The 50 over comp last year was great, we really enjoyed it as a squad, so it's about trying to take that momentum and some of the good stuff we did, and use it to our advantage,\" said white-ball captain Kiran Carlson.\n\"We weren't far off in T20, we had a few bad losses, a few good wins and it's about finding that sweet spot, peaking at the right time.\n\"Getting the balance of a team is still something I'm learning about, it's about trying to get match-winners out there,\" Carlson added.\n\"It's massive to win [the One Day Cup], it gives the club a boost and it's the icing on the cake for players after a long hard season.\"\nAfter begining their Championship season at home to Leicestershire on Friday Glamorgan face visits to Bristol and Lord's.", "url": "https://www.bbc.com/sport/cricket/articles/c5y014kre01o"}