{"authors": ["Andy Burke", "www.facebook.com"], "date_download": "2025-05-21 08:39:17", "date_modify": "2025-05-21 08:39:17", "date_publish": "2025-01-13 12:22:33", "description": "Glasgow 29-19 Racing 92: Three things we learned", "filename": "sport_articles_c9w5kjzjlyzo_1747816757.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8451/live/cffdea90-d1a8-11ef-ac26-952c1df216b6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c9w5kjzjlyzo_1747816757.html", "title": "Glasgow 29-19 Racing 92: Three things we learned", "title_page": "Glasgow 29-19 Racing 92: Three things we learned - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Sensational Sione continues to shine\nIt's becoming difficult to come up with anything original to say about Sione Tuipulotu. The centre has been playing at such a high level for such a long time and influencing just about every game he plays in.\nHe set the tone inside 30 seconds against Racing, bursting through a tackle and breaking from deep to get Glasgow immediately on the front foot.\nTuipulotu said after the match he was determined to be better this year than he was in 2024. If he accomplishes that then we will see something very special.\nThe Scotland captain is in outstanding form heading into the Six Nations and his midfield partner Huw Jones looked razor sharp in attack too.\nUs Scots are reluctant to build up anybody too much, but with Tuipulotu playing the way he is, you can't help but hop aboard the hype train.\nHorne makes history\nGeorge Horne was not on the pitch for long – he failed to reappear after departing for a head injury assessment - but he still managed to create a bit of history during his limited appearance.\nHis opening try saw him move out on his own as Glasgow's all-time top try-scorer in European competition.\nHorne's strike-rate has been astonishing for a long time now. He has redefined the art of the scrum-half support line and his anticipation of when a chance might present itself is second to none.\nHis try took him onto 51 for Warriors, three shy of DTH van der Merwe's club record. Surely it's only a matter of time…\nCancelliere – Glasgow's Mr Dependable\nWhen you watch Glasgow, the eye is perhaps drawn to the explosiveness of Sione Tuipulotu or the guile of Huw Jones, but the consistent excellence of Sebastian Cancelliere is no less impressive.\nThe Argentine winger is one of Warriors greatest ever foreign signings. He always seems to be in the right place at the right time and has that happy knack of coming up with big tries in big games, as he did against Racing.\nHe popped up with crucial tries against the Stormers in the quarter-final and Munster in the semi-final as Warriors swept to the URC title last season.\nOther stars may grab the headlines, but Glasgow would not be the force they are without the dependable Cancelliere.", "url": "https://www.bbc.com/sport/articles/c9w5kjzjlyzo"}