{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:19:27", "date_modify": "2025-05-20 12:19:27", "date_publish": "2023-08-04 22:01:16", "description": "Bath City striker Alex Fletcher is cleared to play again, nine months after suffering a serious head injury when he collided with a concrete wall.", "filename": "sport_football_66412558_1747743567.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/B7BC/production/_130663074_f2tfnfzxaaazekl.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66412558_1747743567.html", "title": "Alex Fletcher: Bath City striker 'delighted' to return to club after head injury", "title_page": "Alex Fletcher: Bath City striker 'delighted' to return to club after head injury - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Bath City striker Alex Fletcher has been cleared to play again, nine months after suffering a serious head injury when he collided with a concrete wall.\nThe 24-year-old needed surgery and was in a coma for five days following the accident during a match against Dulwich Hamlet in November last year.\nFletcher has also been given a new contract by Bath.\n\"Nobody will ever understand how many times I've played out the scenarios in my mind,\" he said.\n\"The next time stepping back on to Twerton Park with the number seven on my back, my next goal, my next win as a Roman. It's truthfully what's been keeping me going throughout my entire recovery.\"\nIt represents a remarkable recovery for Fletcher, who told BBC Sport in April that his family had been given stark warnings about the possible extent of his injury.\n\"My surgeon gave them the news that if I made it through the surgery, which was a slim chance as it was, I might not be the same person,\" Fletcher said. \"I might not have use of my legs. I might not even remember my family because of where the impact was.\"", "url": "https://www.bbc.com/sport/football/66412558"}