{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:22:08", "date_modify": "2025-05-21 05:22:08", "date_publish": "2025-04-03 16:12:58", "description": "Man City protest: Fan views on ticket prices", "filename": "sport_football_articles_cx2ydvzgj32o_1747804928.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/fca3/live/e8bb80b0-1091-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cx2ydvzgj32o_1747804928.html", "title": "Man City protest: Fan views on ticket prices", "title_page": "Man City protest: Fan views on ticket prices - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your views on the protest against Manchester City's new partnership with third-party ticket resale platform Viagogo and you replied in swathes.\nThere was only one theme to the replies - and no-one arguing the opposite:\nWendy: I remained on the concourse for nine minutes. I think Leicester fans also did. We have to do something and show that we are unhappy with the current situation. It's happening at all clubs and we have to stand together.\nJohn: I took part in the protest because I know fans from the old Maine Road days that are now struggling to keep up with their season tickets due to the ever increasing cost. We moved to the cheapest seats several seasons ago in order to make match attendance more manageable but now even these seats are moving out of our price range. The club need to listen to the fans as I felt a real sense of determination during the protest last night so this is not going away.\nJack: Man City are culpable in seemingly putting finances over fans. In my view, City are showing flagrant disregard for their fanbase who will stop going by being priced out of the game. City have become too big, too quickly.\nMark: Any football team not listening to their true supporters' needs and opinions are on a slippery slope.\nGary: As a season ticket holder myself, I totally agree with the protest and its grievances against the club. No new season tickets issued for many years now and no guarantee that new season tickets will be available when the new extension to the stand is completed. It would appear that they would rather sell tickets to tourists not stalwart fans.", "url": "https://www.bbc.com/sport/football/articles/cx2ydvzgj32o"}