{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:05:30", "date_modify": "2025-05-21 06:05:30", "date_publish": "2025-02-08 17:38:02", "description": "Ross Whyte believes his rink should be representing Scotland at the world curling championships this year after successfully defending their national title.", "filename": "sport_articles_cdxedl4pqq7o_1747807530.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2597/live/9997b070-e6bc-11ef-a914-23d95b53fcf9.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cdxedl4pqq7o_1747807530.html", "title": "Whyte wants Worlds spot after beating Mouat to defend Scottish title", "title_page": "Whyte wants Worlds spot after beating Mouat to defend Scottish title - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ross Whyte believes his rink should be representing Scotland at the world curling championships this year after successfully defending their national title.\nWhyte and his team-mates beat Bruce Mouat's Olympic medallists 8-3 in Saturday's final in Dumfries.\nTeam Mouat were world champions in 2023 and runners-up at the 2022 Olympics.\nThe vastly experienced Mouat, 30, also has world silver and bronze in his collection, along with four European golds.\n\"Hopefully get selected for the world championships, that would be brilliant,\" said Whyte, when asked about ambitions for 2025.\n\"We feel like we've put ourselves in a great position.\n\"We are showing consistency and feel like we should definitely be putting those Scotland jerseys on.\"\nWhyte, 26, was an alternative in Team Mouat for the 2019 and 2021 world championships, with this year's event taking place in Moose Jaw, Canada, at the end of March.\nTeam Mouat led 3-1 after six cagey ends in Dumfries but Whyte, Robin Brydone, Duncan McFadzean and Euan Kyle avenged their only round-robin loss of the week by storming straight back to claim three.\nMouat was then forced to give up a pair of two-shot steals and the contest was over before the final end.\n\"It wasn't just in Scotland people were talking about this game - they were talking about it around the world,\" Whyte added.\n\"So we knew we were going to have to come out and play well to beat the number one team in the world and that's what we did and we felt we deserved it this week.\n\"We know we're a top-three, top-five team in the world. We really believe in ourselves, the results are starting to come our way and it just feels amazing.\"", "url": "https://www.bbc.com/sport/articles/cdxedl4pqq7o"}