{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:24:47", "date_modify": "2025-04-26 04:24:47", "date_publish": "2025-03-03 12:31:29", "description": "Newcastle news: Bruno Guimaraes tells fans to 'blame me' after FA Cup exit", "filename": "sport_football_articles_cn48q3ng0ygo_1745641487.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f463/live/40371000-f82a-11ef-92bb-03e8a8ae1fee.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cn48q3ng0ygo_1745641487.html", "title": "Newcastle news: Bruno Guimaraes tells fans to 'blame me' after FA Cup exit", "title_page": "Newcastle news: Bruno Guimaraes tells fans to 'blame me' after FA Cup exit - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Newcastle captain Bruno Guimaraes has told fans to \"blame me\" after the side were knocked out of the FA Cup by Brighton, and issued a rallying cry to fans before the Carabao Cup final later this month.\nThe Magpies took the lead on 22 minutes through an Alexander Isak penalty before Yankuba Minteh equalised for the visitors on the stroke of half-time.\nSubstitute Danny Welbeck then struck in extra time to send Brighton through to the quarter-finals.\nIn a post on X, Guimaraes wrote: \"Disappointed not to progress in the FA Cup, as it was clearly one of our goals. Moments like this are when we need to stick together the most.\n\"I know that when eliminations like this happen, it's hard to accept, and we always look for someone to blame. If you need to find one, you can blame me.\"\nUp next for Newcastle is a trip to West Ham in the Premier League next Monday, before the Carabao Cup final against Liverpool at Wembley on 16 March.\n\"We have two weeks before one of the most important games for the club in recent years, and we must be ready for this great opportunity,\" added Guimaraes.\n\"My only request is that, in this moment, we stay united as one and go after the best for the club because we still have great things ahead.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cn48q3ng0ygo"}