{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 15:00:35", "date_modify": "2025-05-20 15:00:35", "date_publish": "2023-07-27 13:25:37", "description": "No play is possible on the third day between Yorkshire and Durham, with the visitors waiting to resume their first innings on 106-1.", "filename": "sport_cricket_66319928_1747753235.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/04E5/production/_130535210_shutterstock_editorial_14023981h.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66319928_1747753235.html", "title": "County Championship: Rain prevent play on day three at Scarborough", "title_page": "County Championship: Rain prevent play on day three at Scarborough - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Yorkshire and Durham were frustrated by the weather at Scarborough as day three of their County Championship clash was abandoned due to a wet outfield.\nHeavy overnight rain in the East Coast town forced a delayed start and then an early lunch at 12.30pm.\nWith umpire Steve O'Shaughnessy having reported sick, a decision on the prospects of play was left to his partner Surendiran Shanmugam and match referee James Whitaker.\nPlay was abandoned for the day at 2:10pm, by which time it was raining heavily.\nDivision Two leaders Durham were due to start on 106-1 in their first-innings reply to Yorkshire's 340 all out, with in-form opener Alex Lees unbeaten on 65 and chasing a fifth hundred in six Championship innings.\nThe match is now heading for a draw, which would be the first Championship stalemate at North Marine Road since the 2013 season, unless the two camps get together and engineer a contrived finish during the fourth day.\nWith Durham holding a pre-game lead of 54 points at the top of Division Two, it is likely that mid-table Yorkshire would be the keener of the two counties to set up a result.\nYorkshire were 22 points behind second-placed Sussex with a game in hand before thr match began on Tuesday. They have now lost 1,425 overs due to weather in this season's Championship.", "url": "https://www.bbc.com/sport/cricket/66319928"}