{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:55:07", "date_modify": "2025-05-21 07:55:07", "date_publish": "2025-01-22 09:17:50", "description": "Manchester City travel to Paris St-Germain on Wednesday with both sides battling to stay in the new-look Champions League - BBC Sport looks at what both teams need and what an early exit could mean.", "filename": "sport_football_articles_c9vkv2v9gw7o_1747814107.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/edbc/live/2c7fcbb0-d746-11ef-94cb-5f844ceb9e30.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c9vkv2v9gw7o_1747814107.html", "title": "Champions League permutations: What Man City & PSG need to qualify", "title_page": "Champions League permutations: What Man City & PSG need to qualify - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The new Champions League format was designed to be more exciting with increased jeopardy on every match.\nBut no one could foresee that two of Europe's biggest teams may not even make it past the league phase.\nManchester City, in 24th, and Paris St-Germain, in 26th, are staring down that very real possibility.\nThe two meet on Wednesday and a draw or defeat for either side would see them facing the prospect of needing to play a two-legged play-off match to reach the last 16, if they do not miss out all together.\nTeams who finish inside the top eight qualify automatically for the next round.\nThose who finish in ninth to 24th go into the play-offs and the bottom 12 teams - from 25th to 36th - will be eliminated with no access to the Europa League.\nSo could City or PSG really miss out on a place in the knockouts? And what would that mean?\nManchester City's surprising poor form has spanned across all competitions.\nIt began with Tottenham knocking them out of the EFL Cup in October and Pep Guardiola's side have since won just five of their 17 matches in all competitions.\nWhen it comes to the Champions League, City took seven points from their opening three games, but then suffered losses to Sporting and Juventus and squandered a three-goal lead against Feyenoord to draw 3-3 at Etihad Stadium.\nCity have looked to strengthen their squad in the January transfer window, although new additions will not be able to play in the league phase.\n\"Of course it is a really important game for us and for PSG, but we still have another game against Bruges at home,\" said Guardiola.\n\"I don't know how many points we will need. Six points will be mathematically [sure], but maybe four, maybe three.\n\"But if we don't qualify we have to accept we were not good enough.\"\nMeanwhile, PSG are yet to lose in the French top flight but have failed to replicate that form in Europe - earning a measly seven points from six matches with three losses, one draw and two wins.\nIn the table, they are the lowest of Europe's so-called 'big clubs' and currently sit in an elimination spot.\nLuis Enrique's side have suffered defeats by Bayern Munich, Arsenal and Atletico Madrid, as well as a home draw against PSV.\n\"The reality is we should have won the games against PSV and Atletico,\" said Enrique. \"With those [extra] five points we would already be qualifying for the next round.\n\"But I am very optimistic and confident. Is it a must-win game? The obligation is all the players give 100%, and I take the same attitude every day.\n\"You can lose games, and that's life. The most important thing is to be committed.\"\nRealistically, for both sides, the chances of automatically qualifying for the last 16, by finishing in the top eight, are now slim.\nCity are five points off eighth and there are 13 teams in play-off slots above them so they need a lot of things to go their way.\nPSG are six points off and even more unlikely to qualify via the top eight.\nTwo wins would ensure that City qualify for the play-offs, but one win is likely to be enough.\nIf City lose in Paris, PSG will leapfrog them in the table and City would need to beat Club Brugge at Etihad Stadium in their final league phase match, as well as potentially needing other results to go their way.\nPSG travel to Stuttgart on the final day and could need two wins to ensure their safety.\nCity currently have a 84% chance of reaching the play-offs according to Opta, and PSG's chances stand at 64%.\nTeams finishing ninth to 16th in the league phase are seeded in the play-offs and play at home in the second legs.\nThat means if you finish ninth or 10th, you play one of the teams in 23rd or 24th (a draw will be done to decide) and 11th and 12th play 21st or 22nd.\nQualifying via the play-offs means you face a team from first to eighth in the last 16 and play away in the second leg.\nOpta estimate that City have a 57% chance of reaching the last 16 and PSG 41%.\nFifteen-time European champions Real Madrid could also be at risk, they sit 20th after three wins and three losses. Opta say they have a 97% chance of making the play-offs with games against Red Bull Salzburg and Brest to come.", "url": "https://www.bbc.com/sport/football/articles/c9vkv2v9gw7o"}