{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:35:52", "date_modify": "2025-04-26 04:35:52", "date_publish": "2025-02-28 12:08:02", "description": "Alan O'Connor's 79th-minute try proves crucial as Ulster edge past Scarlets for a 30-28 win at Kingspan Stadium.", "filename": "sport_rugby-union_articles_c7577qg5p04o_1745642152.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6588/live/3c31c4a0-f6db-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_c7577qg5p04o_1745642152.html", "title": "Last-gasp Ulster back to winning ways against Scarlets", "title_page": "United Rugby Championship: Ulster 30-28 Scarlets - Last-gasp Ulster back to winning ways against Scarlets - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Alan O'Connor's 79th-minute try proved crucial as Ulster edged past Scarlets for a 30-28 win at Kingspan Stadium.\nThe Irish province, who had fallen to 15th in the United Rugby Championship (URC) prior to kick-off, were 28-23 behind in the closing stages but O'Connor's close-range score and Nathan Doak's subsequent conversion saw them narrowly avoid a third league loss in succession.\nIn a back and forth game, Scarlets had led 12-0 early on and 15-13 at half-time but were left to rue having to settle for just three points rather than a try during their final attack of the game when Ulster went up the other end and snatched victory.\nThe win lifts Ulster only up to 14th in the table but just two points off the top eight and the play-off places.\nIn what had been called a \"must-win\" game by their head coach Richie Murphy, Ulster made a disastrous start and conceded twice in the opening 11 minutes.\nThere were only five minutes on the clock when Scarlets first took the lead.\nWith scrum-half Gareth Davies alert to a lack of backfield cover, his kick over the top of the ruck was gathered by wing Macs Page for a simple opening score.\nFinding and exploiting plenty of space in the Ulster defence, Page then got around Jacob Stockdale on the outside and fed Ioan Nicholas for Scarlets' second try five minutes later.\nUlster got on the board after Scarlets were pinged for infringing at the ruck. The hosts went to the corner from the penalty and Timoney dotted down at the tail of a powerful maul.\nBuoyed by the score, Ulster enjoyed a spell of pressure but when next awarded a penalty, opted to go for the posts and reduce the deficit rather than try their maul again.\nIt was the same policy only minutes before half-time when, only a metre into Scarlets' half, Jack Murphy again called for the tee and his lengthy effort just crept over the crossbar to put his side ahead for the first time.\nUlster could not carry their advantage into the turn, however, with Ioan Lloyd kicking his side back in front after an offside penalty in the final passage of the half.", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/c7577qg5p04o"}