{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:11:19", "date_modify": "2025-05-21 04:11:19", "date_publish": "2024-12-29 00:00:00", "description": "Jordan White's 99th-minute tap-in rescues a draw for Ross County as they score twice in two injury-time minutes against relegation-troubled Hearts.", "filename": "sport_football_live_cx2y01kjd51t_1747800679.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cx2y01kjd51t_1747800679.html", "title": "Ross County vs Hearts: Scottish Premiership report, reaction & stats", "title_page": "Ross County vs Hearts: Scottish Premiership report, reaction & stats - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Despite missing captain Lawrence Shankland with a calf strain, it took Hearts just 79 seconds to open the scoring as Wilson was put clean through by Liam Boyce - Shankland's replacement - with the teenager firing under the keeper.\nIt took them a little longer to find the back of the net in the second half - 126 seconds to be precise. This time, James Penrice flew down the left and hung up a cross which Wilson glanced home.\nThe striker thought he had a chance to become the first 17-year-old to score a top-flight hat-trick when Hearts were awarded a penalty and he snatched the ball.\nHowever, VAR intervened and asked referee Ross Hardie to have another look at Michee Efete's foul on Penrice, which was adjudged to have started outside the area.\nVAR would help rule out a third Hearts' goal with 10 minutes left.\nBlair Spittal curled a free-kick off the crossbar and Boyce tapped in, but he was a yard offside when the set piece was taken.\nThen County delivered their double blow to leave both sides were they started the day in the table - County 10th and Hearts 11th.\nIf you hadn't followed Hearts this season, you'd have thought with 95 minutes gone and the Gorgie side 2-0 up, they'd probably comfortably see it out.\nAs soon as County showed any attacking intent - which amounted to throwing bodies forward - Hearts looked capable of collapse.\nCollapse they did, calamitously. When Nisbet scored, there was a feeling County would get another and it was Gordon who would gift them the goal.\nThis was all despite a decent performance for 95 minutes. Jorge Grant impressed on a rare start, as did Boyce. Wilson was unlucky not to score three.\nGordon had rarely been troubled, with a makeshift defence in front of him that had repelled everything thrown at it. Beni Baningime kept things ticking nicely in midfield and James Penrice gave his usual strong performance.\nBut the nervous capitulation had an inevitability about it that has fans genuinely fearful of relegation.\nNeil Critchley has an enormous job on his hands to stop Hearts hurtling towards the trap door and to convince fans - and his superiors - that he is the man for the job.\nIt might be no surprise to see a club with the budget the size of County's down the bottom of the Premiership, but it should also come as no surprise that they're showing the grit required to survive.\nThey've been in this position before and they know they've got another fight on their hands, but it's points like this that might just save them.\nThey were down and out in the 95th minute, but they sensed weakness and, after Nisbet's goal, smelled blood.\nMoments like these provide timely reminders that they won't say die, they can pull something from nothing, and take points off those around them.", "url": "https://www.bbc.com/sport/football/live/cx2y01kjd51t"}