{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:19:41", "date_modify": "2025-05-21 07:19:41", "date_publish": "2025-03-30 00:00:00", "description": "Manchester City come from behind to beat Bournemouth and set up an FA Cup semi-final against Nottingham Forest", "filename": "sport_football_live_c07z3l1g2p4t_1747811981.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2193/live/15af8ad0-0d86-11f0-ba12-8d27eb561761.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c07z3l1g2p4t_1747811981.html", "title": "AFC Bournemouth 1-2 Man City: Erling Haaland and Omar Marmoush put visitors into FA Cup semi-final", "title_page": "AFC Bournemouth 1-2 Man City: Erling Haaland and Omar Marmoush put visitors into FA Cup semi-final - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Goodnight\nThat's the end of this live text now, thanks for joining us today.\nA reminder of the FA Cup semi-final ties:\nNottingham Forest v Manchester City, Crystal Palace v Aston Villa.\nBoth at Wembley on the weekend of 26 April.\nI'll leave you with the highlights of today's games.\nWe'll be back on Tuesday for the return of the Premier League.\n'It will be difficult for anyone to do what these legendary players have'\nFT: Bournemouth 1-2 Man City\nManchester City\nMan City boss Pep Guardiola, speaking to BBC Sport: \"It was more hard for them [Bournemouth]. We played an outstanding game and had incredible chances, missed a penalty. We conceded with one chance we gave away. Our approach was magnificent. Seven times in a row semi-final in the FA Cup, no team has done it and it will be difficult for any other to do what these legendary players, the new ones and the old ones, will have done.\"\nOn seven semi-finals in a row: \"It is unbelievable. The way we competed today compared to the way we played in the first game here [in the Premier League]. I was not good enough to overcome that situation then. We were sloppy for many games and I was not able to let them realise is what they have done today. For example Brighton was a difficult game, we didn't play our best but we fought. This is what had to happen\".\nOn Nico O'Reilly: \"He is an attacking midfielder. He is physical, he is strong. He is really, really good.\"\nOn what he changed at half-time: \"The first half we played with the same intensity as the second. The difference was that we played better with the ball with more composure - we were more calm. I said at half-time, we have the game in our hands.\"\nOn whether they will appoint a new penalty taker after Haaland's miss: \"Absolutely not. Against Brighton he scored.\"\nOn facing Nuno Espirito Santo's Nottingham Forest in the semi-final: \"Sometimes we've lost when we've performed well. In the home game we won 3-0 so when we lose one game it looks like a disaster. It's not true. They are third in the table, they are a very good team and we are pleased to play against them in Wembley with our fans.\"\nOn how he would sum up the campaign if the FA Cup is the one title his side win this season: \"We won one title already. We won the Community Shield, we won it. This season has been poor, nothing is going to change. It has not been good, that is not going to change. Last year we played in a final and could not win it. We have an incredible target to qualify for the Champions League next season and that is what we are going to try to do.\"\n'We have not been the team we wanted to be'\nFT: Bournemouth 1-2 Man City\nBournemouth\nBournemouth boss Andoni Iraola, speaking to BBC Sport: \"I think the game is quite clear to analyse - the first half was good from us.\n\"We played the game we needed to play, but we couldn't keep it for the second half.\n\"Then we have not been the team we wanted to be.\n\"The players have started to lack the same energy and we have not improved much.\n\"Today we have had suspensions, the injuries from past games and in the end the depth of the squad is always very important.\n\"Unluckily for us we couldn't kept the same level that we showed in the first half.\n\"We have to change and play in three days. We will try to recover the energy and we play against Ipswich here and we need those three points.\"\nOn James Tavernier's injury: \"He had issues around the ankle and I think he is going to be out this week.\"\n'We were not able to play at the same level in the second half'\nFT: Bournemouth 1-2 Man City\nBournemouth\nBournemouth manager Andoni Iraola speaking to ITV1: \"I think the game first half we played very well but second half the game was for them. We couldn't keep the same intensity level, we were not as aggressive and we were a lot more passive.\n\"Even with the changes, we were lacking energy, especially up front. We were not able to play at the same level we did in the first half.\"\nOn whether Kepa should have saved Omar Marmoush's goal: \"Yes probably. There is a chance but overall I don't think we lost because of this. Overall I think we were better in the first half, we played the game we wanted to play but second half they were better and we couldn't affect the long possessions. We were not dangerous enough.\"\nOn whether the injuries/suspensions in the side had a negative impact on the side today: \"Yes. It isn't just the starting eleven. It gives you good options from the bench to give us the same level. I felt David Brooks, Evanilson, after 50 minutes or something - they can play but they don't play at the same intensity level, the press is not the same as before. We couldn't maintain that level.\"\nOn the goals for the team for the remainder of the season: \"We need to recover quickly because we are playing in three days against Ipswich and try and win. We need to go again with the three points and improve our position.\"", "url": "https://www.bbc.com/sport/football/live/c07z3l1g2p4t"}