{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:27:27", "date_modify": "2025-05-20 13:27:27", "date_publish": "2023-07-25 08:40:19", "description": "Emma Raducanu's approach of regularly changing coaches is \"probably going to be like that for the rest of her career\", says her agent.", "filename": "sport_tennis_66298536_1747747647.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1446/production/_130509150_gettyimages-1473622480.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_tennis_66298536_1747747647.html", "title": "Emma Raducanu's agent defends coaching turnover", "title_page": "Emma Raducanu's agent defends coaching turnover - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Emma Raducanu's agent has defended the player's approach after criticism of her turnover of coaches.\nThe 20-year-old, who won the US Open aged 18 in 2021, has worked with five coaches in the past two years.\nIMG senior vice-president Max Eisenbud told The Tennis Podcast, external that the approach has worked for Raducanu and her father Ian.\n\"It's probably going to be like that for the rest of her career. That's what's comfortable for them,\" he said.\n\"I'm not saying it is right or wrong, but that is the way they have done it, and I think it is fine to do things differently.\"\nRaducanu started her career with Nigel Sears, who left shortly after she reached the fourth round of Wimbledon in 2021, before Andrew Richardson guided her to her famous victory at Flushing Meadows.\nTorben Beltz was appointed in November 2021 but left in April 2022. He was replaced by Dimitri Tursunov, who warned of \"red flags\" and potential problems if Raducanu continued to listen to too many voices.\nLast month she parted company with Sebastian Sachs.\nRaducanu had surgery in May on both wrists and an ankle and is not expected to play again until later this year.\nEisenbud said changing coaches has been a successful method for Raducanu from her junior career.\n\"Her dad and Emma control all the coaching stuff,\" he said.\n\"All the way up through the juniors, they never had coaches a long time, so, for them, that's calm waters - having a coach for four to five months and then going on to someone else.\n\"Emma and her dad have their own philosophy. Richard Williams (father of Venus and Serena) had his own philosophy, which was different, and Yuri Sharapova (father of Maria) had his.\n\"We are not sitting in a sport that has a plethora of great coaches - maybe eight, nine or 10 great coaches.\n\"Most of the great, great coaches don't want to travel for 35 or 40 weeks a year and leave their families, so you have a small pool that are willing to travel and charge very little money, so they keep getting recycled and recycled. That is why you see coaches hopping around.\"\nEisenbud acknowledged that Raducanu may struggle to replace Sachs.\n\"There are coaches who might be afraid to take the shot because they've seen the track record,\" he said.\n\"I understand it is uncomfortable and doesn't fit in the box that everyone wants, but if Emma Raducanu's biggest issue is that she is changing coaches every couple of months, I will sign up for that.\"", "url": "https://www.bbc.com/sport/tennis/66298536"}