{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:16:24", "date_modify": "2025-05-21 06:16:24", "date_publish": "2025-03-31 09:21:28", "description": "BBC Sport NI takes a look at the state of play in the bottom six of the Irish Premiership ahead of the beginning of the post-regular season split.", "filename": "sport_articles_c8epr05jypyo_1747808184.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/73cc/live/64d37d20-0e11-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c8epr05jypyo_1747808184.html", "title": "What's at stake in the top half of the split?", "title_page": "Irish Premiership: What's at stake in the top half of the split? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The Irish Premiership split begins on Tuesday night and there is a tight race for European football with five matches to play.\nLinfield have already been crowned champions and will lift the Gibson Cup for a record-extending 57th time against rivals Glentoran on Saturday, 5 April.\nBehind that, the race for a second place and automatic European qualification is tight, with just five points separating the remaining five teams in the top half of the table.\nLarne, whose two-year title run was halted by Linfield, and Glentoran are in a strong position to contend for second place.\nBoth are level on points and Larne only hold the advantage by just two goals.\nIf either slip up, then Dungannon Swifts and Crusaders are poised to pounce with a late charge.\nJust four points off second, the Swifts and Crues are level on 50 points. Not only do the Swifts have a small goal difference advantage, but Rodney McAree's side are also in the Irish Cup final and can secure automatic European qualification if they beat Cliftonville in the Windsor Park decider.\nColeraine are also in the mix after a recent upturn in form. The Bannsiders are an outside bet for the automatic spot, but know their run of six matches undefeated has guaranteed them a play-off place no matter what happens above them.", "url": "https://www.bbc.com/sport/articles/c8epr05jypyo"}