{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:34:10", "date_modify": "2025-05-21 05:34:10", "date_publish": "2025-01-31 19:00:52", "description": "Bournemouth vs Liverpool: Richard Hughes praised by Arne Slot", "filename": "sport_football_articles_c14nvr28g3no_1747805650.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4684/live/810cf5b0-dff0-11ef-ba4f-b100425dc741.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c14nvr28g3no_1747805650.html", "title": "Bournemouth vs Liverpool: Richard Hughes praised by Arne Slot", "title_page": "Bournemouth vs Liverpool: Richard Hughes praised by Arne Slot - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Bournemouth technical director Richard Hughes \"deserves a lot of credit\" for bringing Justin Kluivert and Andoni Iraola to the Cherries, says Liverpool boss Arne Slot.\nHughes moved from a playing to a recruitment capacity with Bournemouth in 2013 and remained with them until joining Liverpool as sporting director at the end of last season.\nHe helped in their rise through the leagues, setting them up to be in a position to now be challenging for Europe as they sit seventh in the Premier League.\nSlot is expecting a tough challenge when he takes his league leaders to Vitality stadium on Saturday.\n\"They have beaten so many strong teams and have a lot of quality.\n\"Richard as sporting director, he hired fantastic manager as well. He [Iraola] has a clear plan and the players work incredibly hard.\n\"They deserve to be where they are [in the table], if not maybe a bit higher than where they are.\"\nOne player who the Reds will be wary of on Saturday is winger Justin Kluivert, who has had a breakout season with the Cherries having scored 12 goals and provided five assists in 24 games.\n\"He is one of many examples where Richard [Hughes] deserves a lot of credit, but also the manager too after working with him,\" said Dutchman Slot.\n\"The team makes individuals better. You need quality and Richard brought that here.\n\"It is nice for us [from Netherlands] to see Justin doing so well because he left Holland nice and early.\n\"He was bit criticised for that because in Holland they tend to think you need extra years before going abroad, but he has shown success going abroad early and going to new clubs.\n\"To be only 24 and at this level already, he will be a big talent. With him against [Ryan] Gravenberch, it will be interesting match up tomorrow.\"", "url": "https://www.bbc.com/sport/football/articles/c14nvr28g3no"}