{"authors": ["Nizaar Kinsella", "www.facebook.com"], "date_download": "2025-05-21 05:05:16", "date_modify": "2025-05-21 05:05:16", "date_publish": "2025-04-04 07:05:00", "description": "Tottenham analysis: Postecoglou 'looking more isolated than ever'", "filename": "sport_football_articles_crkx0nz4dkjo_1747803916.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/17fb/live/8f9f7e00-1122-11f0-b9d8-bd74da7b5dce.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_crkx0nz4dkjo_1747803916.html", "title": "Postecoglou 'looking more isolated than ever'", "title_page": "Tottenham analysis: Postecoglou 'looking more isolated than ever' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tottenham head coach Ange Postecoglou is looking more isolated than ever.\nThe Australian directed a brief clap towards the furious travelling away fans from near the halfway line following his side's 1-0 loss at Chelsea but, by then, it could be argued the damage had already been done.\nChants of \"you don't know what you're doing\" came from the away end after midfielder Lucas Bergvall was replaced by Pape Sarr in the 65th minute.\nRemarkably, Sarr found the net with an excellent long-range strike just four minutes later, leading Postecoglou to cup his ear and turn to the away end, only for VAR to then rule out the goal for a foul on Moises Caicedo.\nReports suggest Postecoglou is under severe pressure. Bournemouth's Andoni Iraola, Fulham's Marco Silva and Brentford's Thomas Frank have all been linked with his job.\nThe 56-year-old, who became Spurs boss in June 2023 and is contracted to the club until 2027, even suggested in midweek, external there were plenty of outstanding candidates, to replace him.\nHowever, Spurs are expected to at least wait until the culmination of the Europa League campaign - a chance not only to win a first trophy in 17 years, but also to qualify for next season's Champions League.\nJamie Redknapp, speaking to Sky Sports, said after the match: \"I think for Ange Postecoglou, it feels like he's going to make history or be history.\n\"When you lose 16 games in a season as Tottenham manager, still having great players at your disposal, it's not going to wash with the fans.\"\nLike Postecoglou, chairman and co-owner Daniel Levy has faced criticism from the fans.\nBut Levy has given the head coach resources to shape a squad - Postecoglou has spent £214.8m.\nThat extra spend was an attempt to salvage the season while alive in three cup competitions, but after elimination from the domestic cups, it is Europa League or bust.\nWith little to play for in the Premier League, a end to the Spurs trophy drought would end the season on a high.", "url": "https://www.bbc.com/sport/football/articles/crkx0nz4dkjo"}