{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:56:09", "date_modify": "2025-05-21 07:56:09", "date_publish": "2025-01-30 23:03:27", "description": "With the final round of Europa League group-phase games finished, we finally know who has reached the knockout stage.", "filename": "sport_football_articles_cj91y18xynko_1747814169.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1e5c/live/2fb4b4b0-df59-11ef-88f5-9fd60bc5cfdc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cj91y18xynko_1747814169.html", "title": "Europa League: Who qualified to knockouts", "title_page": "Europa League: Who qualified to knockouts - and who could play who next? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "With the final round of Europa League group-phase games finished, we finally know who has reached the knockout stage.\nManchester United's 2-0 win at FCSB means they are the only club to come through the group matches with an unbeaten record and they go straight to the last 16.\nAn injury-hit Tottenham beat Elfsborg 3-0 and Rangers saw off Union Saint-Gilloise 2-1 to also avoid extra games in the knockout play-offs.\nThese are the teams through to each stage:\nLast 16: Lazio, Athletic Bilbao, Manchester United, Tottenham, Eintracht Frankfurt, Lyon, Olympiakos, Rangers.\nKnockout phase play-offs: Bodo/Glimt, Anderlecht, FCSB, Ajax, Real Sociedad, Galatasaray, Roma, Ferencvaros, Viktoria Plzen, Porto, Midtjylland, Union Saint-Gilloise, AZ Alkmaar, PAOK, Twente, Fenerbahce.\nEliminated: Braga, Elfsborg, Hoffenheim, Besiktas, Maccabi Tel Aviv, Slavia Prague, Malmo, Rigas FC, Ludogorets, Dynamo Kyiv, Nice, Qarabag.\nThe teams who finished between ninth and 24th play two-legged play-off ties on 13 and 20 February to decide who goes through to the last 16.\nThe draw will take place on Friday, 31 January at 12:00 GMT... but teams already know which sides they have a 50-50 chance of meeting because of their final positions in the league phase.\nNone of the three British sides in the competition are involved in this stage.\nTeams also know the two possible clubs they could face in the last 16 if they progress through the play-off.\nFenerbahce or Twente will face either Bodo/Glimt or Anderlecht, with Ferencvaros or Porto set to meet Roma or Viktoria Plzen.\nUnion Saint-Gilloise or PAOK take on FCSB or Ajax and AZ Alkmaar or Midtjylland can be drawn against Real Sociedad or Galatasaray.", "url": "https://www.bbc.com/sport/football/articles/cj91y18xynko"}