{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:38:28", "date_modify": "2025-04-26 03:38:28", "date_publish": "2025-03-04 22:59:19", "description": "Bristol City manager Liam Manning says he was badgering Zak Vyner about his lack of goals before the centre-back opened the scoring at Millwall.", "filename": "sport_football_articles_cgr2x4e79ewo_1745638708.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d100/live/9743ec60-f947-11ef-ab6a-cb409d79bd4e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cgr2x4e79ewo_1745638708.html", "title": "Liam Manning: Bristol City manager reacts to Zak Vyner goal", "title_page": "Liam Manning: Bristol City manager reacts to Zak Vyner goal - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Bristol City manager Liam Manning said he had been badgering Zak Vyner about his lack of goals before the centre-back scored the opener in the 2-0 win at Millwall, his first for nearly two years.\nManning told BBC Radio Bristol: \"It was long overdue from Zak, right! I've been giving him a lot of stick about it. He gets credit for the job he does but you need everyone to chip in so I'm delighted he got the goal.\"\nThe manager was pleased with a performance that puts the Robins level with sixth-placed West Bromwich Albion on points, adding: \"Credit to the lads. When you look at their attitude, their desire to defend, and the way they found a way to win, the maturity … there were so many positives to take out of it.\n\"The first 35 minutes we controlled the game, dampened the noise and managed the game how we wanted it. We spoke about how hard it is to come here and that we'd need to earn the right to make the game look like how we want and we did it right for 35 minutes.\n\"The last 10 minutes of the first half we became a little bit passive, and the second half was a battle, won by a set piece and a moment of quality.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cgr2x4e79ewo"}