{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:52:38", "date_modify": "2025-05-21 03:52:38", "date_publish": "2025-04-07 09:58:46", "description": "Llanelli Town are confident their promotion to the JD Cymru Premier will be rubberstamped this week when the FAW Tier 1 Licences are announced.", "filename": "sport_football_articles_c9veyppm20go_1747799558.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d69e/live/d62318f0-1393-11f0-b054-11b99aeb4b3e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c9veyppm20go_1747799558.html", "title": "Llanelli wait on Tier 1 Licence decision for promotion green light", "title_page": "Llanelli wait on Tier 1 Licence decision for promotion green light - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Llanelli Town are confident their promotion to the JD Cymru Premier will be rubberstamped this week when the Football Association of Wales Tier 1 Licences are announced.\nThe Reds secured the JD Cymru South title last Friday with a 1-1 draw at Cambrian United while title rivals Trethomas Bluebirds lost.\nThe club are now waiting on being granted a FAW Tier 1 Licence – required to play in the top flight – which will be announced on Tuesday.\n\"It's been a long season, a stressful season, but we've secured that Championship win,\" chairman Wayne Stephens said.\n\"We're waiting for Tuesday and the Tier 1 licence outcome.\n\"The licence is broken down into several categories, so you've got the financial aspect, legal, structure of the club and how the club is run.\n\"It's quite complex but I'm happy we've submitted it and we'll see the outcome on Tuesday.\"\nLlanelli won the Welsh Premier title in 2008 and were runners-up on three occasions.\nShould Llanelli be granted a Tier 1 Licence they will return to Welsh football's top-flight for the first time since the 2018-19 season.\n\"Llanelli's a rugby town and we're fighting the battle to get football on the map,\" Stephens told the BBC Radio Wales Sport Phone In.\n\"It's going to be massive if we do it and we've got to stay up and stay there with the restructuring going on within the Cymru Leagues in 2026-27.\n\"We're all volunteers – none of us are employed – and we work really hard behind the scenes to get everything right structurally within the club.\n\"We're trying to make that day out – it's not just about going to watch a football match.\n\"It's getting to the ground, what are you doing when you get there, what's available and what's happening after.\n\"It's the whole experience and the build-up on social media now, which is so big.\n\"It's building that event up and carrying it on after.\n\"We do all the work off the field which allows the management, in Lee John and his players, to get on the field and try and do the business.\"", "url": "https://www.bbc.com/sport/football/articles/c9veyppm20go"}