{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:13:26", "date_modify": "2025-05-21 06:13:26", "date_publish": "2025-01-31 13:11:59", "description": "Your views on Scotland's side to face Italy in Six Nations", "filename": "sport_articles_cz0lnpg0vkpo_1747808006.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5195/live/e5565450-dfcb-11ef-a819-277e390a7a08.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cz0lnpg0vkpo_1747808006.html", "title": "Your views on Scotland's side to face Italy in Six Nations", "title_page": "Your views on Scotland's side to face Italy in Six Nations - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your thoughts after Scotland named their team to face Italy in the first round of the Six Nations on Saturday.\nHere's the best of what you had to say:\nNathan: For many years Scotland have struggled to compete with the big teams in the front five. While we have a decent group starting, we lack depth at hooker, tight-head and second row. Could be a long Six Nations!\nSteven: As strong a side that Scotland can put out, looking to get the campaign off to as good a start as possible. Dave Cherry might be seen as a surprise inclusion but for my money he's the best lineout thrower we have and might be in there to try and get our set-piece ticking over. The physicality that Ewan Ashman brings might not be needed for this game.\nPaul: It's not our optimal side, but Gregor Townsend has striven to build depth and strengthen the mental fragility that was clear in the close shave against Wales and the loss to Italy. Big strides have been made if the performances in the autumn are anything to go by. If the coaches believe the players are fit they should have the skill and mental capacity to win.\nAndy: A similar situation at hooker to the days where John Allan and Kenny Milne shared the position. Milne was for me the better all round player but Allan seemed to be an SRU favourite. Ashman and Cherry have the nod ahead of Johnny Mathews and I'm dumbfounded why.\nStuart: Townsend seems determined to throw a curve ball every time Scotland play. Ali Price in the autumn series and now Cherry in the Six Nations. The trouble is history shows he invariably gets it wrong. He has had perhaps the strongest squad Scotland have had in many years but has failed to take them to the next level. This must be his swan song.", "url": "https://www.bbc.com/sport/articles/cz0lnpg0vkpo"}