{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:16:08", "date_modify": "2025-04-26 06:16:08", "date_publish": "2025-03-01 20:17:54", "description": "St Mirren 2-5 Celtic: What Rodgers said", "filename": "sport_articles_c99npl19x4ro_1745648168.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/63a7/live/2d8355a0-f6da-11ef-ba69-c78ed0ab1046.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_c99npl19x4ro_1745648168.html", "title": "St Mirren 2-5 Celtic: What Rodgers said", "title_page": "St Mirren 2-5 Celtic: What Rodgers said - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Celtic manager Brendan Rodgers: \"I think it's one of my favourite results of the season coming to St Mirren who have had some really good performances against other teams.\n\"It's a brilliant three points for us. I think our attacking paly was really strong. We were so good on a difficult surface, the players were technically very strong.\n\"We need to get the freshness back in our defending We have got a week before the cup game now which gives us a chance to recover that and get the freshness back.\n\"Yang's [Hyun-jun] girlfriend is here at the moment so he's in a great feeling. I said to her interpreter to try and make sure she stays. He's a young player, he's growing and developing which is why it's about more than just performances and results, it's about the development of young players.\n\"We have a big cup game next week but what we can do now is reset and build into that cup game. we've put so much work into the season, so much consistency and mentality. We have a lot of work to do but we're in a really good place.\n\"Callum [McGregor] had felt his calf. He should be fine but we don't want to take any risks with him.\n\"Auston [Trusty] got a bang in the head and had to get five stitches. He should recover but Liam Scales came in and did really well.\"", "url": "https://www.bbc.co.uk/sport/articles/c99npl19x4ro"}