{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:18:10", "date_modify": "2025-05-21 04:18:10", "date_publish": "2025-02-09 12:50:24", "description": "Is Maeda one of Celtic's best signings?", "filename": "sport_articles_ckgx4w4wqxpo_1747801090.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b462/live/92e105c0-e6e3-11ef-a819-277e390a7a08.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_ckgx4w4wqxpo_1747801090.html", "title": "Is Maeda one of Celtic's best signings?", "title_page": "Is Maeda one of Celtic's best signings? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Celtic fans, we asked for your views on Saturday's Scottish Cup win over Raith Rovers.\nHere's what some of you had to say:\nJohn: We were expected to take this tie with ease and duly did so. I like the look of Dane Murray, there's something about him. Looks like he has a touch of class about him.\nMichael: Another great performance. Raith had decent spells in defending but the Celtic train was too much for them. I think Bayern Munich are in for a shock when they come to Parkhead, I can't see anything but a Celtic win.\nBear: The first time a \"second string\" has showed up well when given an opportunity. I always felt Daizen Maeda was a better player than Kyogo Furuhashi, but lived in his shadow, now we are seeing the real him. A wonderful player and maybe the people berating the club for not replacing Kyogo should take note, the answer was there all along, 20-plus goals and counting.\nGordy: Daizen is possibly one of our best signings in recent years. His commitment to the team and professionalism is second to none. Another fine performance from him and the team as a whole, no let up in the quest for another treble. Hopefully we can get something against Bayern and show we have grown in Europe, well played tonight\nPatrick: Decent use of the squad and everyone performed well, I expect a totally different squad midweek. Thrilled for Maeda to be scoring so freely and nice for Viljami Sinisalo to have a chance in goal. Hoping for a nice draw for the next round.", "url": "https://www.bbc.com/sport/articles/ckgx4w4wqxpo"}