{"authors": ["Andy Gray", "www.facebook.com"], "date_download": "2025-05-20 14:57:11", "date_modify": "2025-05-20 14:57:11", "date_publish": "2023-07-27 07:09:16", "description": "Republic of Ireland manager Vera Pauw and captain Katie McCabe reflect on the country's early exit from their first World Cup in Australia.", "filename": "sport_football_66313128_1747753031.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/129D2/production/_130524267_gettyimages-1556625617.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66313128_1747753031.html", "title": "Women's World Cup: 'Group stage exit hurts but Republic will be back'", "title_page": "Women's World Cup: 'Group stage exit hurts but Republic will be back' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It started with a party in the stands, but it ended with tears on the pitch.\nThe Republic of Ireland's first World Cup comes to an end in the group stages, but it certainly wasn't without a fight.\nKatie McCabe's superb opener had the Irish supporters, who dominated the Perth Rectangular Stadium, in dreamland before everyone was brought back down to earth.\nMegan Connolly was unfortunate to touch the ball into her own net in the soaking conditions before Adriana Leon poked home the winner for the Olympic champions.\nVera Pauw's side pressed for the goal that would have kept their hopes of progressing alive, but ultimately the team fell short and will be eliminated in the group stage.\nJust like in their opener against Australia, it was fine margins that were the difference at the highest level.\n\"I'm obviously very, very disappointed,\" Pauw said, as the torrential rain reflected the mood in the Irish camp.\n\"I am so proud of what we showed. If you can dominate for the majority of the first half, and the way we have played, with the guts to go and conquer a half with the Olympic champions... I'm so proud of the players.\n\"Everyone was thinking, 'it is nice that Ireland were here, let's see if they can cope'. I think we have shown that in the fact that we are so disappointed.\n\"Who would have thought that? We are sportspeople and we hate losing. At that moment it just hurts, but we matched them, if not better, and that is something that is tremendous.\"\nIt started so well for the underdogs when McCabe's perfectly-placed corner evaded Kailen Sheridan and flew into the net.\nThe roar, and the scenes in the stands, are something that everyone in attendance will remember for a long time.\nIt just had to be McCabe with Ireland's historic first goal on the world stage. She is the leader of the team and the face of football in Ireland.\nDespite the moment of joy, and the legacy that it will leave long after the dust has settled on this game, McCabe, with tears in her eyes, was struggling to look past the heartbreak.\n\"I was obviously delighted to see it hit the back of the net. You're kind of in disbelief, 'I've just scored the first goal', but at this level it is all about results.\n\"Of course, it is a nice moment but I'm absolutely heartbroken with the result and where it has left us in the group.\n\"We gave it everything. It wasn't to be and there is almost a numb feeling. I'm heartbroken and I feel this team deserved so much more.\n\"It's not been an easy journey to get here, as you know.\n\"For how the girls have held themselves throughout this whole few weeks, starting with Australia and tonight as well, I was just so proud of them.\"\nCanada manager Bev Priestman, who before the game had described Ireland as \"a horrible team to play against\", was full of praise for Pauw's side.\n\"Credit to the Republic of Ireland, they took us right to the wire and they should be very proud,\" she said.\n\"I knew what we were coming up against and we had to fight to get the three points. I have massive respect for them and they showed that against Australia.\n\"The early goal is not the way you want to start, it rocked us a bit and it was like playing an away game.\n\"The atmosphere was electric and it was a great experience to move forward from.\"\nPriestman was right. Despite being on the other side of the world, it was like Ireland were playing in Dublin with the superb support that has followed them to Sydney, to Perth and now likely Brisbane.\nMcCabe added the support gave her \"goosebumps\" and was the \"stuff of dreams\". You'd be hard pressed to disagree.\nWhile progression is now off the table, the Irish still have their final Group B game to come against Nigeria, where the pressure will be off and they can aim to go out on a high.\n\"This is our first ever major tournament. I know for a fact, given those performances we put in, it won't be our last,\" a defiant McCabe added.\n\"I want young girls and young boys in Ireland to dream and look up to us. It could be them one day, playing and representing their country.\n\"I'm honestly so proud and honoured to lead the team. For us, it was about creating history by getting here, but it is also about leaving a legacy behind.\n\"We have given those young girls and boys a chance to dream and be like us one day. I hope we've done them proud and I hope we've done the nation proud.\n\"For us, it is about regrouping, keeping the positives and make sure we give the nation something to be really proud of. Hopefully we can end this tournament with a win for them.\"", "url": "https://www.bbc.com/sport/football/66313128"}