{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:36:31", "date_modify": "2025-05-21 04:36:31", "date_publish": "2025-01-18 00:00:00", "description": "Zeno Ibsen Rossi's last-minute own goal earn lucky Bolton a League One draw with Cambridge at the Toughsheet Community Stadium.", "filename": "sport_football_live_c77r468j80lt_1747802191.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c77r468j80lt_1747802191.html", "title": "Bolton Wanderers 2-2 Cambridge United", "title_page": "Bolton Wanderers 2-2 Cambridge United - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Zeno Ibsen Rossi's last-minute own goal earned lucky Bolton a 2-2 League One draw with Cambridge at the Toughsheet Community Stadium.\nDespite rescuing a point Wanderers' fans still chanted for the dismissal of manager Ian Evatt at the final whistle.\nUntil Rossi deflected skipper George Thomason's cross beyond goalkeeper Marko Marosi, Bolton old boy Elias Kachunga looked to be the visitors' hero.\nKachunga set up on-loan Bristol City midfielder Josh Stokes to register his first league goal for Garry Monk's strugglers after four minutes.\nWanderers levelled against the run of play half an hour later, when Szabolcs Schon crossed from the left and John McAtee slid in for the equaliser.\nAlmost immediately Cambridge restored their lead thanks initially to James Brophy's industry down the home right. When the ball was played into the area Kachunga nipped in ahead of Ricardo Santos to net his fifth goal in eight games.\nCambridge, who at least ended a five-game losing run, were heading for a first win in Bolton since 1981, especially when Marosi saved from home debutant Joel Randall and Aaron Collins.\nHowever, Rossi's misfortune denied them the victory.", "url": "https://www.bbc.com/sport/football/live/c77r468j80lt"}