{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:59:25", "date_modify": "2025-05-21 05:59:25", "date_publish": "2025-04-05 00:00:00", "description": "Evanilson's double rescues a draw for Bournemouth at West Ham as the Cherries' winless run in the Premier League stretches to six matches.", "filename": "sport_football_live_cly153j6g6zt_1747807165.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1e80/live/e580e8d0-1236-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cly153j6g6zt_1747807165.html", "title": "West Ham 2-2 Bournemouth: Evanilson rescues Premier League draw at London Stadium", "title_page": "West Ham 2-2 Bournemouth: Evanilson rescues Premier League draw at London Stadium - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Evanilson's double rescued a draw for Bournemouth at West Ham as the Cherries' winless run in the Premier League stretched to six games.\nThe Brazilian had scored for the third game running to find the breakthrough from close range in the first half after Alphonse Areola spilled a low effort from Antoine Semenyo.\nSubstitute Niclas Fullkrug and Jarrod Bowen then scored in the space of seven minutes as the Hammers' second-half resurgence gained them the upper hand at a sunny London Stadium.\nBut Bournemouth rescued a point late on as Evanilson tapped home his second goal after Dean Huijsen flicked a quickly taken free-kick towards the far post.\nIt was the striker's sixth goal in as many games for Bournemouth, who were once again without their 12-goal top scorer Justin Kluivert.\nEvanilson had gone close only two minutes in when his header from a Dango Ouattara cross sailed inches wide, before he bagged his first of the game.\nGraham Potter's side were lucky to go into the break only one goal down as Illia Zabarnyi's header from Lewis Cook's corner rattled the crossbar.\nBut Germany striker Fullkrug's introduction in the 61st minute turned the game on its head.\nHis header from James Ward-Prowse's cross to equalise was West Ham's first shot on target, and seven minutes later Potter's men were ahead.\nMohammed Kudus beat substitute James Hill on the left wing and crossed in for the Hammers captain to head home and make it 2-1, only for Bournemouth to equalise with 11 minutes left.\nThe result moves Bournemouth to ninth with 45 points, while West Ham are 15th with 35 points.\nFullkrug's West Ham career has yet to take off since joining from Borussia Dortmund for £27m last summer.\nAfter only making substitute appearances in the opening three games of the season, the striker sustained an Achilles injury that kept him on the sidelines for three months.\nHe scored twice on his return before suffering a hamstring injury just 15 minutes into Potter's first game in charge - an FA Cup defeat by Aston Villa in January.\nHaving returned from another long lay-off at the weekend, the goal against Bournemouth will have helped him shake of any rustiness.\nWest Ham were desperately searching for some inspiration when Fullkrug and Carlos Soler were introduced in place of Edson Alvarez and Tomas Soucek.\nThe striker's hold-up play helped the Hammers more into the game before he equalised seven minutes after coming on.\nPotter will also have been pleased to see Bowen end a five-game run without a goal or assist on home soil, as he broke the barren spell with a fine header.", "url": "https://www.bbc.com/sport/football/live/cly153j6g6zt"}