{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:42:04", "date_modify": "2025-05-19 14:42:04", "date_publish": "2017-08-24 19:23:29", "description": "Wales back-rower Ross Moriarty is unsure if he will return from injury in time for their four autumn Tests.", "filename": "sport_rugby-union_41042515_1747665724.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3536/production/_97522631_ross_moriarty_getty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_rugby-union_41042515_1747665724.html", "title": "Ross Moriarty: Autumn Tests doubt for injured Wales back-rower", "title_page": "Ross Moriarty: Autumn Tests doubt for injured Wales back-rower - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wales back-rower Ross Moriarty is unsure if he will return from injury to challenge for a place in their autumn Tests.\nThe Gloucester player left the British and Irish Lions tour to New Zealand early because of a back injury.\nMoriarty was injured in his only Lions appearance, the 13-7 win against New Zealand Provincial Barbarians.\n\"I don't have a time scale or date when I expect to be back to play,\" said the 23-year-old.\nWales face Australia, Georgia, New Zealand and South Africa in November.\n\"I am not sure when I will be back,\" said Moriarty, who will also be absent when Gloucester's season begins at home against Exeter on Friday, 1 September.\n\"I will take my time and hopefully the physios will be doing their best to get me back to full fitness soon.\"\nMoriarty made the Lions tour after winning 17 caps for Wales, but was unable to press for a Test place because of the injury.\n\"I was disappointed to leave the tour early, but it was a great experience to be involved with that first game,\" he said.\n\"I just felt as if I could have offered the team a little more.\"\nMoriarty says he underwent two scans to discover the nature of the injury and medical treatment failed to clear it up, forcing him to return home.", "url": "https://www.bbc.com/sport/rugby-union/41042515"}