{"authors": ["Andrew Aloia", "www.facebook.com"], "date_download": "2025-05-21 07:17:25", "date_modify": "2025-05-21 07:17:25", "date_publish": "2025-01-22 12:16:46", "description": "Wilson Isidor appeared to have scored a second goal for Sunderland at Derby only for it to be disallowed - amid much confusion.", "filename": "sport_football_articles_ckgr44p7ykmo_1747811845.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/dc63/live/ef8da660-d8b6-11ef-89b6-372b2b3acad8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ckgr44p7ykmo_1747811845.html", "title": "Why Sunderland striker Isidor's 'ghost goal' at Derby didn't count", "title_page": "Why Sunderland striker Isidor's 'ghost goal' at Derby didn't count - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Derby County's Pride Park witnessed a curious case of a 'ghost goal' on Tuesday that had many in the ground and watching from afar wondering what was going on.\nSunderland's Jobe Bellingham lifted a sumptuous ball over the top of the Rams defence for Enzo Le Fee to run onto.\nWas there a hint of an offside at this point? Sure. Any flag raised? No.\nLe Fee then managed to work the ball to Wilson Isidor, who was picking himself up off the ground after colliding with a defender.\nThe forward kept his cool, and slammed his effort home off the underside of the crossbar. A great finish that had appeared to put the promotion-chasing visitors' win beyond doubt.\nInitially, it appeared as if referee Sam Allison was thinking the same thing.\nThis is where things got fuzzy. And even when players and managers were talking to media afterwards, no-one seemed completely sure of what to say.\nWhile the Championship doesn't make use of a video assistant referee (VAR), it doesn't mean the officials aren't connected to one another and constantly talking over the radio.\nIt is understood that the two assistant referees were talking Allison through what unfolded and why the goal shouldn't count.\nIt wasn't a VAR-length review or debate - the sort that leaves some people cursing technology's encroachment on the game - but it went on long enough for almost everyone to think Sunderland were 2-0 ahead.\nIsidor, it was decided, had been offside when the initial ball was played over the top and while he wasn't the first to the ball, he impacted how Derby dealt with the danger, with his run tripping up Ebou Adams as he tried to reach Le Fee.\nThere are still images taken from television cameras showing where players were stood, but anything anyone says at this point will be debated as right or wrong.\nIn the end, it was a 'ghost goal' of no consequence as Sunderland hung on for a 1-0 victory to move up to third in the table.\nStill, a goal that seems to be a goal, then is not given as a goal and has people scratching their heads, gives us all something to talk about.", "url": "https://www.bbc.com/sport/football/articles/ckgr44p7ykmo"}