{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:44:55", "date_modify": "2025-05-20 14:44:55", "date_publish": "2023-07-27 19:02:03", "description": "South Africa's Paula Reto has a two-stroke lead after the first round of the Evian Championship - the fourth major of the women's season.", "filename": "sport_golf_66332313_1747752295.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/A7B7/production/_130553924_paulareto.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_golf_66332313_1747752295.html", "title": "Evian Championship: Paula Reto leads after first round of major, Lydia Ko in contention", "title_page": "Evian Championship: Paula Reto leads after first round of major, Lydia Ko in contention - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "South Africa's Paula Reto shot a seven-under-par 64 to take a two-stroke lead after the first round of the Evian Championship - the fourth major of the women's season.\nReto bogeyed the second but then hit eight birdies without dropping a shot.\nFormer champion Lydia Ko carded a bogey-free 66 to ensure she is well placed before round two in France.\nKo is alongside American Alison Lee, Thailand's Wichanee Meechai and Frenchwoman Celine Boutier.\nWorld number three Ko became the youngest winner of a women's major when she clinched the Evian Championship aged 18 in 2015.\n\"It certainly wasn't easy today,\" said the 26-year-old from New Zealand.\n\"I was scrambling to make pars on the front nine, but I was good at getting out of trouble.\n\"Sometime par saves are the momentum to start making some birdies and it was nice to make a few on the back nine and finish off with one at the last.\n\"Hopefully, it will not be such a shaky start tomorrow.\"\nReto's only win on the LPGA Tour came at last year's Canadian Open and the 33-year-old was delighted with her start at this tournament.\n\"I had so much fun out there,\" she said. \"It's just awesome to be here.\"\nEngland's Jodi Ewart Shadoff and Stephanie Meadow of Northern Ireland both shot two-under opening rounds of 69, while US Open Champion Allisen Corpuz began her bid for a second major of the year with a level-par 71.", "url": "https://www.bbc.com/sport/golf/66332313"}