{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:48:22", "date_modify": "2025-05-21 04:48:22", "date_publish": "2025-01-23 13:44:51", "description": "Man City: 'Next week is like a final for us' - Grealish", "filename": "sport_football_articles_c203x572xl8o_1747802902.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4dba/live/f85671e0-d984-11ef-ba6a-b744abd00a0a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c203x572xl8o_1747802902.html", "title": "Man City: 'Next week is like a final for us'", "title_page": "Man City: 'Next week is like a final for us' - Grealish - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jack Grealish believes Manchester City have been questioned many times since he's been at the club, but thinks they \"have always come up\" with an answer.\nWith City facing a decisive Champions League tie against Club Brugge next Wednesday, Grealish isn't understating the importance of it.\n\"Next week is like a final for us. We have to win,\" he said. \"But since I've been here there's been so many moments when people have questioned us as a team and we've always come up. Hopefully we can do that next week and get through to the next round.\"\nThe 29-year-old was introduced as a half-time substitute in Wednesday's defeat at Paris St-Germain and scored the first goal, with Erling Haaland adding a second only three minutes later.\nThen City conceded four.\n\"It's usually perfect for us if we come to these grounds and go two goals up,\" Grealish said.\n\"I think that's when we're at our best (in terms of) managing the game, keeping the ball, a lot of passes and stuff.\n\"Unfortunately, too many times this season we've been a couple of goals up and then we end up losing it.\n\"I'm not sure why that is, whether it's a confidence thing or not. I'm not too sure at the moment. We had the momentum and then it just switched all of a sudden.\n\"Credit to them. In the end they deserved to win the game and it's down to us now to try and win the game next week.\"\nDespite the setback against PSG, Grealish thinks City are in a good position to qualify: \"It's in our hands, which is lucky. We don't have to rely on anyone else, it's down to us.\n\"So we're going to need the Etihad rocking, like it is on Champions League nights. We all know it's a must-win game and hopefully we can go and get it.\"", "url": "https://www.bbc.com/sport/football/articles/c203x572xl8o"}