{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:42:27", "date_modify": "2025-05-20 14:42:27", "date_publish": "2023-07-28 08:36:25", "description": "Liverpool: 'It's up to Henderson to answer those questions'", "filename": "sport_articles_ckvyk4nnxgyo_1747752147.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f991/live/b2bd18f0-2d1e-11ee-b1d7-8fdc93c2782e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_ckvyk4nnxgyo_1747752147.html", "title": "Liverpool: 'It's up to Henderson to answer those questions'", "title_page": "Liverpool: 'It's up to Henderson to answer those questions' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Katie Falkingham, BBC Sport\nJordan Henderson has long been seen as one of the more socially conscious footballers, notably leading talks between Premier League captains on giving money to charities during the Covid-19 pandemic.\nIn 2021, the same year he was shortlisted for a football ally honour at the British LGBT Awards, Henderson wrote those programme notes before Liverpool's Premier League match against Southampton.\n\"Before I'm a footballer, I'm a parent, a husband, a son, a brother and a friend to the people in my life who matter so much to me,\" he wrote.\n\"The idea that any of them would feel excluded from playing or attending a football match, simply for being and identifying as who they are, blows my mind.\"\nThe father of two daughters, should Henderson's young family accompany him to Saudi Arabia he will be bringing his children up in a nation with a distinct lack of women's rights - not until 2018 were women allowed to drive, while Saudi women still experience significant discrimination and unequal treatment.\nThere is further criticism of Henderson's move, with former Aston Villa midfielder Thomas Hitzlsperger saying \"silly me\" after believing his support for the LGBTQ+ community was \"genuine\".\nAfter Henderson's departure from the Reds on Wednesday, Liverpool's LGBTQ+ fan group Kop Outs urged him to \"stand by your words as a professed ally & champion of #LGBT+ rights, of women's rights and of basic human dignity\".\nPride in Football, a network of LGBTQ+ fan groups, said in a statement: \"When you see someone who has been an ally so publicly transfer to a club in a country where LGBT+ people are attacked and imprisoned, it is disappointing.\n\"Good luck in Saudi Arabia Jordan, but you have lost the respect of so many people who valued you, and trusted you.\"\nTo date, Henderson has not addressed any of the criticism he is facing. Should that moment come, many will be keen to hear what his latest words will be.\n\"I'd be interested to hear what Jordan Henderson has to say,\" said Liverpool fan Keith Spooner.\n\"Have his values changed? What does he think about the fact his rainbow armband is now blacked out?\n\"There is huge hypocrisy - but it's up to Jordan to answer those questions.\"", "url": "https://www.bbc.com/sport/articles/ckvyk4nnxgyo"}