{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:44:45", "date_modify": "2025-05-20 14:44:45", "date_publish": "2023-07-27 18:46:56", "description": "Worcestershire rally to a first-innings total of 406 before Gloucestershire close on 212-4", "filename": "sport_cricket_66323928_1747752285.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/D18D/production/_130554635_chel.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66323928_1747752285.html", "title": "County Championship: Price brothers hit back for Gloucestershire after Worcestershire make 406", "title_page": "County Championship: Price brothers hit back for Gloucestershire after Worcestershire make 406 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Joe Phillips and Ollie Price combined to keep Gloucestershire afloat on day two against Worcestershire at the Cheltenham Festival.\nBoth hit valuable half centuries as the hosts recovered to close on 212-4 in reply to Worcestershire's first innings 406.\nPlaying only his second senior game, 19-year-old Phillips made 80, his maiden half-century, while Price finished on 75 not out, staging a successful 92-run final session stand with elder brother Tom, who joined him on 120-4 and batted for 34 overs to make an unbeaten 41.\nJoe Leach claimed three wickets in 16 balls to give Worcestershire the edge, but Gloucestershire now trail by only 194 and still have it within their power to at least claim parity when they resume in the morning.\nBrett D'Oliveira had earlier top-scored with 90 and Josh Baker made a career-best 75 as the hosts were made to toil, Worcestershire's last three wickets realising a bountiful 224 runs, having recovered well from 119-5 on day one.\nJust a week after making his debut on this same ground in the drawn game against Glamorgan, Phillips could have been out on 24 when he had his off stump unceremoniously uprooted by Adam Finch, only for the Worcestershire bowler to be no-balled.\nOllie Price then proved the perfect foil in a second-wicket stand that yielded exactly 100 from 171 balls before Phillips prodding at a ball outside off stump from Leach and was caught at first slip.\nThat was the start of a burst of three wickets in 16 balls as Miles Hammond and James Bracey departed in quick succession after tea.\nBut Ollie Price continued to go about his work in unobtrusive fashion, grafting his way to a 128-ball 50 in partnership with brother Tom.\nResuming on 265-7, Worcestershire added a further 141 in the morning session, thanks in large part to the continued obduracy of skipper D'Oliveira. Having helped add 83 for the sixth wicket with Matthew Waite on the opening day, he orchestrated further profitable stands of 141 and 49 with Baker and Finch for the eighth and ninth wickets respectively.", "url": "https://www.bbc.com/sport/cricket/66323928"}