{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:05:10", "date_modify": "2025-05-21 04:05:10", "date_publish": "2025-01-09 00:00:00", "description": "Cardiff City are into FA Cup fourth round after beating Sheffield United 1-0 with a Cian Ashford strike.", "filename": "sport_football_live_ckgzkzyyn3xt_1747800310.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_ckgzkzyyn3xt_1747800310.html", "title": "Sheffield United 0-1 Cardiff City: Visitors win in tight third-round tie", "title_page": "Sheffield United 0-1 Cardiff City: Visitors win in tight third-round tie - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "'It would be a free hit' for Moyes\nFT: Everton 2-0 Peterborough\nIzzy Christiansen\nFormer England midfielder on BBC Radio 5 Live\nI was listening to David Moyes on New Years Eve on BBC Radio 5 Live and he mentioned how much it took it out of him at West Ham playing European football alongside domestic cup competitions and the Premier League.\nHe got a Europa Conference League trophy to show for his efforts.\nBased off that information would a six months contract be beneficial for Moyes? It would be a free hit.\n'A unique day' - Baines\nFT: Everton 2-0 Peterborough\nEverton\nEverton caretaker manager Leighton Baines, speaking to Match of the Day: \"It was a unique day in a lot of ways but a nice moment for myself and Seamus and the players as well.\n\"It being a winning one is definitely a nice moment. The management side is not something I have been striving for but the opportunity arrived today to help out in the situation where the club needed someone and I was more than happy to help out.\n\"The outcome of winning a game is always a positive one. The lads get to stay in the draw in a cup competition we are all desperate to stay part of.\n\"The lads played well you could see the commitment. They wanted to dive the stadium and fans something they would enjoy watching. For the most part the performance was positive.\n\"It has not been that difficult. This is what we do. Players play football and coaches coach. It was just a little different today. It is never nice when a manager loses his job but then everyone had to get on with their jobs as well.\n\"I am not too sure about that [what is next for the club] right now. Things moved so quickly today. I have definitely not had time to think about what comes next.\"\n'A great competition, but strange to be playing on a Thursday night'\nFT: Fulham 4-1 Watford\nFulham\nFulham manager Marco Silva said: \"The most important thing was to play in the next round and we knew this was a game we needed to win. It's a special competition and it does not matter if they are in the Championship, League One or the Premier League. Every team has a dream and wants to shine in this competition.\n\"The players did really well and it was a really well deserved win from the first minute and we took control of the game. They did a great strike [to equalise] but we had to keep the calmness then we took control of the game. We then scored three goals and deserved to be in the next round.\n\"It [the FA Cup] is really important for us. It does not make any difference from one competition to the other. It's a great competition, the only strange thing is to be playing on a Thursday night.\n\"We will embrace the challenge and each game is for us to try to win. We want to do well. All the teams have the dream to be in the last game of the season in the final. It's a long way to go and we have to really fight hard. The ambition is really big but we have to go game by game.\"\n'We have given them a game'\nFT: Everton 2-0 Peterborough\nPeterborough\nPeterborough manager Darren Ferguson, speaking to Match of the Day: \"I thought we did very well. I asked the players to do themselves justice and they did more than that. The two big chances we have at 0-0, their first goal was the turning point in the game.\n\"We have given them a game. It wasn't until the last seconds they managed to wrap it up. We are disappointed that we are out of the Cup, we didn't come for a night out but the boys acquitted themselves well.\n\"Like everyone else we were surprised by Sean's departure and sorry to see him go because he's a good man. It was done on the day of the game, I have never had that before, it was an unusual situation.\"\n'Their quality was unforgiving'\nFT: Fulham 4-1 Watford\nWatford\nWatford manager Tom Cleverley said: \"I thought it was an excellent first half, we were competitive and we knew we would have to soak up pressure and try to hit hem.\n\"In the second half we conceded at a key moment and could not get a foothold and their quality was unforgiving.\n\"I'm a little bit disappointed in how we conceded three goals in the second half as that's something we have to address. I saw a group of players for 70 minutes, while the game was in the balance, that were willing to sacrifice for the team.\n\"It has been a nice break from the league, our fans showed real unity and they were absolutely fantastic and as staff and players we have to show the same unity to get through this.\"\n'Their fringe players beat our fringe players' - Wilder\nFT: Sheffield United 0-1 Cardiff City\nSheffield United\nSheffield United manager Chris Wilder after defeat by Cardiff: \"Their fringe players beat our fringe players. Their young players played better than our young players. It's as simple as that.\n\"It is really frustrating for me because we are brought up to win but I can't risk any of those senior players out there. People will say 'why put them on the bench?', I had to put them on the bench because I would have had even more young kids on the bench.\n\"I had to put a bit of perspective on it in terms of the experience. I didn't want to put Jack Robinson on but I had to. Some boys had vital minutes, some boys can be disappointed with their performance because they have not really asked the question of me. They can't say in that game I played really well which is disappointing. The players have pushed in training but when it comes to a game is when you need to step up.\n\"We have nine or 10 senior players out. I am disappointed. If they were back earlier we would have been able to put stronger side out but I can't risk it We are stretched as it is. It would have been suicidal. We have to take our medicine, get some players back and look forward to the last 20 games of the season. That is our ultimate aim. We have worked so hard to get ourselves in our position. We can't throw it away because we make some wrong decisions. I have to take that responsibility.\"", "url": "https://www.bbc.com/sport/football/live/ckgzkzyyn3xt"}