{"authors": ["Katie Stafford", "www.facebook.com"], "date_download": "2025-05-21 05:35:50", "date_modify": "2025-05-21 05:35:50", "date_publish": "2025-04-01 08:49:32", "description": "Arne Slot press conference: Liverpool vs Everton preview", "filename": "sport_football_articles_c2ewkm2pydjo_1747805750.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a528/live/b7d03a00-4921-11ef-9e1c-3b4a473456a6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c2ewkm2pydjo_1747805750.html", "title": "Arne Slot press conference: Liverpool vs Everton preview", "title_page": "Arne Slot press conference: Liverpool vs Everton preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Goalkeeper Alisson and midfielder Ryan Gravenberch are likely to be available but will be assessed after Tuesday's training session.\nMeanwhile, defender Conor Bradley has been training with the squad as he returns from injury but whether he plays will have to be \"a smart decision\" because of how long he has been sidelined.\nOn Trent Alexander-Arnold, who continues to be linked with a move to Real Madrid: \"His situation is that he's injured, so we are focused on recovery. We are helping him to be back as soon as he can. We have never been focused on those talks.\"\nSlot denied the contract speculation of Alexander-Arnold, Virgil van Dijk and Mohamed Salah has impacted the team, adding: \"The three players have performed well under the circumstances.\"\nHe said \"the players are disappointed\" to have lost the Carabao Cup final, as is he, but they \"were outworked\" on the day by Newcastle.\nOn the international break coming after that defeat and being ready to get back out there now: \"I definitely am, but many of our players played a week ago in important international games. We are all looking forward to the upcoming nine games. The players are refreshed.\"\nHe said the break allowed him to \"reflect\" on their Champions League exit and Wembley defeat and added: \"It was far from ideal, but if I have to go out then I prefer to go out to Paris St-Germain. It's an embarrassment and disaster if you lose to Plymouth Argyle because they are not PSG or Newcastle quality.\"\nOn the Merseyside derby: \"Football-wise I expect the same. It would be a surprise if Everton do something different. And we are top of the league, so it would be strange if we were to try something different as well.\"\nIn response to controlling emotions this time around, after receiving a red card in the 2-2 draw at Goodison Park: \"I would be so surprised if I ever experienced eight minutes of so many controversial decisions at our disadvantage again. If it happens, I hope I act differently - but I can't promise.\"", "url": "https://www.bbc.com/sport/football/articles/c2ewkm2pydjo"}