{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:40:46", "date_modify": "2025-05-20 14:40:46", "date_publish": "2023-07-28 10:01:12", "description": "Mary Waldron says she is \"very proud\" of what she has achieved with the Ireland women's cricket team after announcing her retirement.", "filename": "sport_cricket_66329690_1747752046.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ED0D/production/_130558606_img_7724.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66329690_1747752046.html", "title": "Mary Waldron: Ireland's most-capped women's cricketer retires", "title_page": "Mary Waldron: Ireland's most-capped women's cricketer retires - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Mary Waldron says she is \"very proud\" of what she has achieved with the Ireland women's cricket team after announcing her retirement.\nWaldron made her Ireland debut in 2010 and went on to make a record 184 appearances.\nThe 39-year-old had intended to retire after the third ODI against Australia on Friday, but injury ruled her out.\n\"It's obviously a very emotional time but I'm very proud of what I have achieved,\" said Waldron.\n\"I want to say a huge thank you to staff and coaches at Cricket Ireland for the opportunity to represent my country, and to Pembroke and Malahide for shaping my journey and supporting me all the way.\"\nDublin-born Waldron was a Republic of Ireland footballer before committing to cricket, establishing herself as Ireland's number one wicketkeeper.\nShe played in 56 one-day internationals and 88 T20 matches, and captained the women's senior side 10 times.\nEd Joyce, Ireland women's head coach, said Waldron was a player \"you always wanted in your squad\" and a \"born leader both on and off the field\".\n\"Being someone who came relatively late to cricket, it's incredible how she learned quickly, and how insightful and incisive she became,\" said Joyce.\n\"Not only did she lead the side on 10 occasions, but her on-field support for the captain from behind the stumps became increasingly important. Her ability to read the game, quickly analyse a situation or to spot a fielding change was welcomed by successive captains.\"", "url": "https://www.bbc.com/sport/cricket/66329690"}