{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:42:06", "date_modify": "2025-05-20 12:42:06", "date_publish": "2023-08-03 15:08:54", "description": "Bali Mumba and Morgan Whittaker say their decisions to return to Plymouth Argyle were easy ones after the \"love\" shown to them.", "filename": "sport_football_66394437_1747744926.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4A1D/production/_130637981_morganwhittakertqypreseasonrex3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66394437_1747744926.html", "title": "Bali Mumba and Morgan Whittaker: Plymouth Argyle 'love' helped pair decide to join", "title_page": "Bali Mumba and Morgan Whittaker: Plymouth Argyle 'love' helped pair decide to join - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Bali Mumba and Morgan Whittaker say their decisions to return to Plymouth Argyle were easy ones.\nBoth were signed for club-record deals of more than £1m after successful loan spells last season.\nThey helped Argyle win the League One title and return to the Championship for the first time in 13 years.\n\"Where we're both appreciated and loved, you feel that and I think that makes our decision easier for us when it comes to us signing,\" Mumba said.\nThe 21-year-old was named League One's Young Player of the Year and was also named in the EFL's League One Team of the Season after an impressive campaign that saw him score six goals in 41 league appearances.\nMumba's move from Norwich City came soon after Argyle broke their transfer record when making Whittaker their first-ever £1m player.\n\"I went back with good intentions to play and get an opportunity,\" Mumba told BBC Radio Devon of his return to Carrow Road at the end of last season.\n\"But going back it was difficult for me, things didn't quite seem right, I wasn't exactly the same player as I was, that's what I thought.\n\"For me it's a thing in football, as in life, where you're comfortable and where you're happy, that's where you play your best football.\n\"This season's a massive season for me and the rest of the lads, so coming to a place where I'm loved and appreciated and I feel comfortable, I felt like this was the place I belong and the right decision to come because I feel like that's where you get the best out of me.\"", "url": "https://www.bbc.com/sport/football/66394437"}