{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:39:00", "date_modify": "2025-05-21 03:39:00", "date_publish": "2025-04-08 00:00:00", "description": "Luton Town substitute Millenic Alli's injury-time equaliser earns the Hatters a draw at fellow Championship strugglers Stoke City.", "filename": "sport_football_live_cgjl67792gvt_1747798740.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a51d/live/678b4f90-14b3-11f0-8a1e-3ff815141b98.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cgjl67792gvt_1747798740.html", "title": "Stoke City 1-1 Luton Town: Millenic Alli nets injury-time Hatters leveller", "title_page": "Stoke City 1-1 Luton Town: Millenic Alli nets injury-time Hatters leveller - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Luton Town substitute Millenic Alli rescued his side with an injury-time equaliser at Stoke City to give the Hatters even more hope in their late bid to beat the drop in the Championship.\nLewis Baker's cruelly deflected 74th-minute free-kick for Mark Robins' Potters looked to have been enough to beat their fellow strugglers.\nBut Alli materialised in space at the far post a minute into added time to stretch improving Luton's unbeaten to five games.\nWith just five games left, Matt Bloomfield's side remain two points adrift of safety, and four points behind Robins' 20th-placed Stoke.\nAfter a tense but poor first half in which Sam Gallagher's on-target header for Stoke and Theo Aasgaard volley's for Luton were the only moments worthy of mention, it quickly livened up after the break.\nBig Luton striker Carlton Morris's crude block on Stoke defender Ashley Phillips got the home fans angry - and things started to get a more heated on the pitch too.\nMark McGuinness headed just wide for Luton, followed by Stoke defender Ben Wilmot's head testing Thomas Kaminski. And the Luton keeper was then nearly caught in no man's land when the Hatters found themselves short-handed down their left side and Gallagher was fed by Million Manhoef.\nBut, although the Stoke striker shot early, it was not powerful or accurate enough and it trickled just wide of the left upright - and, although ungainly, Kaminski then did just enough the block the shot when Baker had a pot at goal from long range.\nThe game then finally got a goal when Lamine Fanne wrestled Gallagher to the deck and Luton-born Baker took full advantage.\nHe struck a powerful right-foot free-kick which took a big deflection off Reece Burke on the end of the wall to wrongfoot Kaminski and settle in the right corner - and stun the 1,191 away fans in a below-par crowd of 21,226 into silence.\nBut Luton have finally found a bit of their missing spirit in the past few weeks.\nStoke keeper Viktor Johansson was called on to deny an 83rd-minute effort from Alli which sparked a scramble, before fellow substitute Lasse Nordas prodded a low cross just wide.\nBut, from Isaiah Jones' right-wing cross, Jordan Clark's attempted overhead kick foxed the Stoke defence and Alli controlled the ball in the box, beat his man and beat Johansson at his near post form a tight angle.\nStoke City boss Mark Robins told BBC Radio Stoke:\n\"We're disappointed and, at the end of the day, Luton are celebrating as they haven't lost.\n\"But we should still have seen them off. We'd dealt with everything, we'd scored and we should have got it done.\n\"There's still a long way to go and we now have to be ready to go again.\"\nLuton Town boss Matt Bloomfield told BBC Three Counties Radio:\n\"That was the best away performance we've put in since I became Luton Town manager.\n\"It would have been very unfair if we had been beaten by a deflected goal. A draw was the very least we deserved.\n\"It was a great strike from Milly. We knew from his time at Exeter that he can shoot with both feet.\"", "url": "https://www.bbc.com/sport/football/live/cgjl67792gvt"}