{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:05:53", "date_modify": "2025-05-21 06:05:53", "date_publish": "2025-04-01 14:19:05", "description": "Ulster wing Robert Baloucoune requires a scan to determine the extent of his latest hamstring injury.", "filename": "sport_articles_cpvr2xm7743o_1747807553.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/edd9/live/d629b6c0-0f00-11f0-9021-b1661f716c64.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cpvr2xm7743o_1747807553.html", "title": "Ulster Rugby: Province wait for scan of Robert Baloucoune injury sustained against Stormers", "title_page": "Ulster Rugby: Province wait for scan of Robert Baloucoune injury sustained against Stormers - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ulster wing Robert Baloucoune requires a scan to determine the extent of his latest hamstring injury.\nThe 27-year-old, who has won four caps for Ireland, made his comeback from 11 months out in the province's United Rugby Championship (URC) win over Stormers at Kingspan Stadium on Friday night.\nHe scored his side's first try in the comeback victory but was replaced after 47 minutes.\nCentre Ben Carson also failed to finish that fixture due to a back complaint and an Ulster statement said that both players \"will have scans early this week to further assess the extent of their respective injuries\".\nRichie Murphy's side travel to face Top 14 side Bordeaux-Begles in the last-16 of the Investec Champions Cup on Sunday.\nCentre James Hume will be \"monitored through training\" in the build-up to that trip after missing the win over Stormers through illness.\nForwards coach Jimmy Duffy saying playing a team of the calibre of Bordeaux, who finished the pool stages as top seeds, \"raises your game\".\nBordeaux have the Six Nations' top try scorer Louis Bielle-Biarrey in their ranks, along with his fellow France internationals Damian Penaud and Yoram Moefana.\n\"They have world-class talents in the forwards or the backline,\" said Duffy.\n\"They are household names in most quarters. They have a brilliant stadium and a brilliant fan base.\n\"We're going there to compete and it's going to be a big challenge.\"", "url": "https://www.bbc.com/sport/articles/cpvr2xm7743o"}