{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:24:02", "date_modify": "2025-05-19 15:24:02", "date_publish": "2015-02-09 11:21:17", "description": "Exeter boss Paul Tisdale says not awarding a late foul on David Wheeler at Bury was a \"shocking decision for football\".", "filename": "sport_football_31299257_1747668242.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/80880000/jpg/_80880417_paul_tisdale_getty15.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31299257_1747668242.html", "title": "Exeter City manager Paul Tisdale incensed by 'shocking decision'", "title_page": "Exeter City manager Paul Tisdale incensed by 'shocking decision' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Exeter manager Paul Tisdale says the decision not to give a foul on Grecians winger David Wheeler late in Saturday's 1-1 draw against Bury was \"shocking\".\nJim McNulty appeared to clip Wheeler when through in the final five minutes.\n\"Do we have to send players hurtling to the floor to have a foul? Do we have to tell our players to dive in order to get a decision?\" said Tisdale.\n\"It incenses me, it wasn't just a bad decision in the game, it was a shocking decision for football.\"\nExeter drew after taking the lead through Arron Davies's early goal, with former City striker Daniel Nardiello equalising just before half-time.\nBut it was the decision by the officials not to award anything for the coming together between Wheeler and McNulty which irked Tisdale.\n\"I'm really lost as to what to say to the players. It's a sending off if it's outside the box and it's a penalty if it's in the box, and to get neither with five minutes to go is a travesty,\" he told BBC Radio Devon.\n\"It can turn someone's view of working in the industry, as simple as that.\n\"The officials have an ally in me and they're gradually turning me off them. I ask the players to play to the whistle, play to the rules, be honest and the officials are gradually undermining that.\"", "url": "https://www.bbc.com/sport/football/31299257"}