{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:51:37", "date_modify": "2025-05-20 12:51:37", "date_publish": "2023-08-03 13:00:05", "description": "Sheffield United sign Auston Trusty from Arsenal for \"significant undisclosed fee.\"", "filename": "sport_football_66392858_1747745497.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/13BC0/production/_130623808_gettyimages-1556010523.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66392858_1747745497.html", "title": "Auston Trusty: Sheffield United sign Arsenal defender", "title_page": "Auston Trusty: Sheffield United sign Arsenal defender - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Sheffield United have announced the signing of Auston Trusty from Arsenal for a \"significant undisclosed fee\".\nThe central defender has signed a four-year contract with the Blades after spending last season on loan at Birmingham City.\nTrusty, 24, is a USA international and was named Birmingham's Player of the Year last term.\nTrusty said he was \"looking forward to playing in the Premier League and showing my ability\".\n\"I am more than excited,\" said Trusty. \"The opportunity to be here at this historic club, and an opportunity to play in the Premier League and show my ability, is everything I could have ever dreamed of growing up as a kid.\"\n\"In Pennsylvania, this was a dream - almost an impossible dream but I believed in myself and the opportunity has come around. It is everything that I dreamed [of].\"\nManager Paul Heckingbottom added: \"I'm delighted we've managed to get this one over the line. It is one of the positions we've been looking to fill and it is with one of our own, a permanent transfer rather than a loan.\"\nTrusty failed to make a single competitive appearance for Arsenal, having signed for the Gunners in 2022 following his departure from Colorado Rapids.\nHe is the Blades' fourth summer singing, following the arrivals of Anis Slimane, Yasser Larouci and Benie Traore.", "url": "https://www.bbc.com/sport/football/66392858"}