{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:10:18", "date_modify": "2025-05-21 07:10:18", "date_publish": "2025-03-30 10:50:06", "description": "'A perfect execution of the manager's tactics'", "filename": "sport_articles_c4g8zjw2lk6o_1747811418.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0df2/live/aed935d0-0d54-11f0-ba12-8d27eb561761.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c4g8zjw2lk6o_1747811418.html", "title": "'A perfect execution of the manager's tactics'", "title_page": "'A perfect execution of the manager's tactics' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Aberdeen fans, we asked for your opinions on the 4-1 win over Motherwell that secured your top six status for this season. Here's a taste of what you had to say...\nJimibub: The absolute minimum goal has now been met, and what a way to achieve it. That had early season vibes to it. Now, get to the Cup final (or achieve a Cup win, better yet) and secure third.\nIt has been a rollercoaster, but as all have said so often, if we had gotten here without either run, no one would be complaining. At least Dave Cormack kept his cool for once and didn't sack Jimmy Thelin.\nDick: A crisp, decisive display from an Aberdeen team who had Motherwell chasing shadows in the first half. Leighton Clarkson was back in his best position, distributing the ball from in front of the back two.\nMotherwell adjusted their strategy after the break but the addition of Shayden Morris provided width to sort that out. A European slot is next stop.\nFred: An excellent team performance and a well-deserved win. If the team can maintain this standard, third is a definite possibility. All the players performed today, no passengers.\nAndrew: One of the best attacking displays we've produced this season. So much more emphasis on moving the ball forward instead of back. Clarkson had a brilliant game and Kevin Nisbet has been a different animal in the last couple of months.\nChris: That was a perfect execution of the manager's tactics. Really good, clever, quick football. However, Motherwell were dreadful. Ponderous, always losing loose balls and no leadership. The Dons were good, but they were not playing a side with quality.", "url": "https://www.bbc.com/sport/articles/c4g8zjw2lk6o"}