{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:41:35", "date_modify": "2025-05-19 14:41:35", "date_publish": "2017-08-05 11:15:01", "description": "Wayde van Niekerk reaches the 400m semi-finals at the World Championships, as Britain's Sophie Hitchon makes the women's hammer final.", "filename": "sport_athletics_40836572_1747665695.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/F3A3/production/_97217326_van_niekerk_pa.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_athletics_40836572_1747665695.html", "title": "World Championships 2017: Wayde van Niekerk cruises into 400m semi-finals", "title_page": "World Championships 2017: Wayde van Niekerk cruises into 400m semi-finals - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Olympic champion Wayde van Niekerk won his heat to reach the 400m semi-finals at the World Championships.\nThe 25-year-old South African clocked 45.28 seconds in London on Saturday.\nBritain's Dwayne Cowan and Matthew Hudson-Smith also progressed, but Martyn Rooney was eliminated.\nElsewhere, Briton Sophie Hitchon went through to the women's hammer final, while compatriots Asha Philip, Daryll Neita and Desiree Henry went through to the women's 100m semi-finals.\nElliot Giles and Guy Learmonth automatically qualified for the men's 800m semi-finals, while fellow Briton Kyle Langford went through as a fastest loser.\nIn the 400m heats, Van Niekerk, who broke the world record to win gold at Rio 2016 in 43.03, had to produce a kick down the home straight to secure victory.\nThe other heat winners were American Fred Kerley (44.92), Steve Gardiner of the Bahamas (44.75) and Botswanan duo Baboloki Thebe (44.82) and Isaac Makwala (44.55).\nFor Britain, Cowan qualified automatically by finishing in the top three of his heat in 45.39 and, although Hudson-Smith ran a faster time of 45.31, he was fifth in his race and went through as a fastest loser.\nCowan said he was \"a bit rusty\" after a few weeks off, adding: \"Hopefully I'll get a personal best in the semi-finals.\"\nHudson-Smith was in a good position down final straight but faded towards the end and said he \"just couldn't find that extra gear\".\nRooney said he was \"disappointed\" with how he ran after finishing sixth in 45.75, missing out on a fastest loser spot.\nFour-time Olympic champion Michael Johnson on BBC One\nIt wasn't good race management [by Van Niekerk] and this is going to be important for him because he is doubling in the 400m and 200m.\nHe's very relaxed but he didn't pay attention to a guy on the outside and then he had to react, which takes more energy.\nBut he is a fantastic athlete and he can afford to get away with that.\nHitchon, who claimed Olympic bronze at Rio 2016, managed a distance of 73.05 metres with her opener in qualifying to secure progress to Monday's final.\n\"It's nice to make it in one throw but you have just got to make it,\" she said.\n\"I'm not going to lie, it [competing in front of a home crowd] does make you really nervous. I feel like you have your own pressure on yourself and then everyone else is here to support you - so you want to perform well but the crowd is amazing.\n\"Once the final comes, I will just try to execute my technique and do nothing fancy.\"", "url": "https://www.bbc.com/sport/athletics/40836572"}