{"authors": ["Emma Sanders", "www.facebook.com"], "date_download": "2025-05-20 12:46:06", "date_modify": "2025-05-20 12:46:06", "date_publish": "2023-08-03 08:16:08", "description": "Germany are knocked out of the Women's World Cup at the group stage thanks to a draw with South Korea.", "filename": "sport_football_66391732_1747745166.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/A02B/production/_130630014_gettyimages-1589652665.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66391732_1747745166.html", "title": "South Korea 1-1 Germany: Germany knocked out of Women's World Cup", "title_page": "South Korea 1-1 Germany: Germany knocked out of Women's World Cup - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Two-time champions Germany were sent crashing out of the Women's World Cup group stages in the biggest shock of the tournament thanks to a draw with South Korea.\nIt is the first time in Germany's history they have failed to reach the knockout stages.\nOne of the pre-tournament favourites, Germany knew they needed to better Morocco's result against Colombia to progress in Group H, but that match finished 1-0 to Morocco.\nAn early goal by South Korea's Cho So-hyun shook the Euro 2022 finalists in Brisbane, but captain Alexandra Popp netted her fourth goal in three matches to equalise shortly before half-time.\nGermany were heading through as group runners-up as they went off the pitch for the break, but Morocco stunned Colombia to score minutes later in Perth, meaning Martina Voss-Tecklenburg's side had to win.\nPopp was their best hope of scoring again and she almost did, thumping a header off the crossbar minutes after she had bundled it over the line, only for the video assistant referee to confirm it was offside.\nThe Wolfsburg striker came close again later when she sent a free header wide of the post, roaring in frustration as the minutes ticked away for Germany.\nDuring stoppage time Germany sent countless crosses into South Korea's box to no avail as substitute Sydney Lohmann struck wide and sent another effort inches over the bar.\nGermany's players fell to the ground at full-time and were in tears as they were consoled by staff members.\nSouth Korea finish bottom of the group, having lost their first two matches.\nColombia face Jamaica on Tuesday at 09:00 BST in the last 16, while Morocco take on France at 12:00.\nThis has already been a World Cup full of surprises, but very few would have predicted Germany to exit after only three games in Australia and New Zealand.\nRanked second in the world, they have topped their group in eight of their nine tournament appearances and won back-to-back titles in 2003 and 2007.\nHowever, cracks had shown during the tournament as, despite opening with a 6-0 victory over Morocco, they looked shaky at the back and were making too many mistakes in possession.\nThey were punished in their second match by Colombia, losing 2-1, and were at risk of exit as they prepared for their final showdown with South Korea.\nSouth Korea's 16-year-old Casey Phair had an early strike pushed on to a post by goalkeeper Merle Frohms.\nBut Germany did not learn from their error as South Korea once again broke in behind Germany's backline, and this time Cho did not miss.\nSouth Korea had a disappointing tournament but at least end on a high, avoiding defeat for only the third time in 13 matches in the competition.\nCho, who left Tottenham at the end of the Women's Super League season, became the first South Korea player to score more than one goal at the Women's World Cup, having netted against Spain in 2015.\nHer goal, though it did little to change South Korea's outcome, could have a significant impact on the rest of the tournament given the draw is now wide open thanks to Germany's shocking exit.\nVoss-Tecklenburg's side would have been on course to meet England in the quarter-finals or semi-finals had both reached that stage.\nBut there is now an opportunity for Morocco, who pipped Germany to a place in the last 16, to mirror the achievements of their male counter-parts, who shocked the world to reach the last four in Qatar in December.\n\"Everybody would have thought that was it when Popp scored, but we kept fighting and kept playing,\" said South Korea manager Colin Bell.\n\"I didn't know that Germany would be out. I only found out four or five minutes after the match. I lived there and played football there. I am surprised and also sad that they didn't get into the last 16.\n\"They tried everything so you have to credit them for that.\"", "url": "https://www.bbc.com/sport/football/66391732"}