{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:10:44", "date_modify": "2025-05-21 04:10:44", "date_publish": "2025-01-15 08:54:52", "description": "Nottingham Forest 1-1 Liverpool: Fan views on Premier League game", "filename": "sport_football_articles_cgkxl8g43llo_1747800644.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cgkxl8g43llo_1747800644.html", "title": "Nottingham Forest 1-1 Liverpool: Fan views on Premier League game", "title_page": "Nottingham Forest 1-1 Liverpool: Fan views on Premier League game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your thoughts after Tuesday's Premier League game between Nottingham Forest and Liverpool.\nHere are some of your comments:\nForest fans\nPeter: Superb in the first half, wilted in the second versus a relentless Liverpool team. Shame it was such a soft goal to concede but a draw is certainly decent. Superb atmosphere as well.\nJohn: Outstanding organisation, effort and flair in attack. There are so many key players all playing for each other. Elliot Anderson is a bit of an unsung hero. Don't know why Newcastle let him go but thank you!\nDoug: A good result for both teams. In a strange way, as a Forest fan, it is a new era feeling a bit disappointed not coming away with the win. Well done, you Reds.\nLiverpool fans\nKen: Slot has done very little wrong since taking the helm, but while he prefers a more measured approach, it is repeatedly throwing up these tepid first halves. The tempo is woefully slow and the passing laborious. It allows the opposition to stay compact. Credit for the eventual changes in the second half, which paid instant dividends and completely changed the flow of the game.\nYusuf: It was a game that was a tactical battle in the first half and an absolute cracker in the second. We knew that it would be difficult to score, but our build-up play was good. Wasn't to be Mohamed Salah or Luis Diaz's day, but a step in the right direction. Being able to not get beaten, even if it is a draw, has set Liverpool apart from others this season, particularly against the teams near us at the top. A well-deserved draw for both teams in the end.", "url": "https://www.bbc.com/sport/football/articles/cgkxl8g43llo"}