{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:53:32", "date_modify": "2025-05-21 05:53:32", "date_publish": "2024-12-24 20:11:13", "description": "BBC Sportsound analyst Darren Murphy offers his thoughts and predictions for the outcomes of Thursday's traditional Boxing Day Irish Premiership matches.", "filename": "sport_articles_c390443xy8go_1747806812.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b284/live/84c1b960-c22d-11ef-a2ca-e99d0c9a24e3.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c390443xy8go_1747806812.html", "title": "Irish Premiership: Darren Murphy's Boxing Day predictions", "title_page": "Irish Premiership: Darren Murphy's Boxing Day predictions - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Coleraine v Ballymena Utd, 15:00 GMT, coverage on Sportsound on BBC Sounds and BBC Radio Ulster\nWith the announcement of Joel Cooper signing a pre-contract with the club and speculation about other possible new arrivals at Coleraine, it's an exciting time at the club.\nI didn't really appreciate how big a game this was until I was involved as a player at Ballymena and while Ballymena are coming off a win, they're without Josh Carson and Ben Kennedy through suspension. Coleraine need to start winning if they have aspirations of making the top six so I'm going to say they'll go all out to win the game.\nPrediction: 2-1\nCrusaders v Cliftonville, 15:00 GMT, coverage on Sportsound on BBC Sounds and BBC Radio Ulster\nThe past few weeks have been tough for the Crues, they have been on a poor run of form, while Cliftonville are coming off the back of a disappointing defeat by Glentoran.\nAgain, a very tough one to call but Cliftonville need to get back on track so I'm going for them to win.\nPrediction: 1-2\nDungannon Swifts v Loughgall, 15:00 GMT, coverage on Sportsound on BBC Sounds and BBC Radio Ulster\nDungannon and Loughgall are two teams who have worked very hard to get where they are but I just think that Swifts have got that wee bit more quality so I'm predicting that they will win.\nBoth managers will be looking for a response after defeats but Rodney [McAree] will still be pleased with how his team performed in the 1-0 defeats to Linfield and Larne. They were very, very competitive in both games.\nPrediction: 2-0\nGlenavon v Portadown, 15:00 GMT, coverage on Sportsound on BBC Sounds and BBC Radio Ulster\nPaddy McLaughlin got his first home win under his belt as Glenavon manager against Crusaders and has his side playing well but Portadown are flying at the moment and I can't see anything other than a win for Niall Currie's side.\nPrediction: 1-2\nGlentoran v Linfield, 15:00 GMT, coverage on Sportsound on BBC Sounds and BBC Radio Ulster\nGlentoran against Linfield at the Oval is always a special occasion and the Boxing Day Big Two encounter is, without doubt, one of the highlights of the season. I was fortunate to be involved in some of them as a player and a coach at Linfield.\nGlentoran are in fantastic form and Linfield have lost all three games between the teams this season, which is unheard of. I think Linfield will go there and try to make a point and they won't lose this one.\nPrediction: 2-2\nLarne v Carrick Rangers, 15:00 GMT, 15:00 GMT, coverage on Sportsound on BBC Sounds and BBC Radio Ulster\nYou have to give Larne a lot of credit in that they beat Gent and then went on and defeated Dungannon on Monday night.\nNow that their European adventure is over they can concentrate on trying to clinch that third league title in a row and qualifying for Europe again. I'm going for a Larne victory.\nPrediction: 2-0", "url": "https://www.bbc.com/sport/articles/c390443xy8go"}