{"authors": ["Rob Schofield", "www.facebook.com"], "date_download": "2025-05-21 07:49:38", "date_modify": "2025-05-21 07:49:38", "date_publish": "2025-01-13 14:06:13", "description": "Nottingham Forest vs Liverpool: Arne Sloton historical rivalry", "filename": "sport_football_articles_cpwxrrv2pwyo_1747813778.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ac19/live/be490aa0-d1ad-11ef-bbe0-eb255759a6ac.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cpwxrrv2pwyo_1747813778.html", "title": "Nottingham Forest vs Liverpool: Arne Sloton historical rivalry", "title_page": "Nottingham Forest vs Liverpool: Arne Sloton historical rivalry - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "With Nottingham Forest and Liverpool separated by six points at the top of the Premier League table, their meeting at The City Ground on Tuesday has a throwback feel to it.\nIn the late 1970s and early 1980s the two clubs were locked in a tussle for all the major honours, with Brian Clough and Bob Paisley establishing a fierce rivalry.\nArne Slot joked that his press officer had briefed him 10 minutes before his press conference, admitting he \"didn't know the exact years\" but was aware Forest had been a big force in English football for a long period of time\".\nIt is perhaps understandable considering the Dutchman was born merely months after Forest beat Liverpool to the old First Division title back in 1978, before going on to lift back-to-back European Cups.\nThe Liverpool manager explained how he is under no illusions of the threat this week's opponents pose now though, having recently watched back September's 1-0 defeat at Anfield – Liverpool's only loss in the Premier League this season – to assess what they could do differently.\nHe did not however miss the opportunity to point out that for as impressive as Forest have been, they have splashed the cash to be in title contention.\n\"Nuno is doing an incredible job,\" he said with a smile. \"But if you look at the amount of money they've spent, its not a complete surprise how well they're doing this season.\"\nForest were deducted four points last season for breaching profit and sustainability rules. The club spent £142.8m when promoted in 2022 and had a modest off-season the following year, before an £88m outlay in the most recent summer.", "url": "https://www.bbc.com/sport/football/articles/cpwxrrv2pwyo"}