{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:27:39", "date_modify": "2025-05-21 07:27:39", "date_publish": "2025-01-22 13:10:15", "description": "West Brom forward Grady Diangana says he is more concerned about staying fit than his contract expiring at the end of the season.", "filename": "sport_football_articles_cgq03733pevo_1747812459.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b953/live/4e146500-d8be-11ef-a303-a344a2a81285.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cgq03733pevo_1747812459.html", "title": "Grady Diangana: West Brom forward focusing on fitness over future", "title_page": "Grady Diangana: West Brom forward focusing on fitness over future - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "West Bromwich Albion forward Grady Diangana says he's more concerned with his fitness than his immediate future.\nThe 26-year-old, who joined the Baggies permanently from West Ham in September 2020 after a loan spell, is out of contract in the summer.\nHe has been limited to only seven starts in the Championship so far this season because of injuries and admits returning to full fitness is his priority.\n\"I've just been trying to get back fit, that's my main focus, that's all I've been working towards and hopefully getting more goals,\" he said.\n\"(My future) depends on the club and how they see me, if they need me, so it's day by day.\"\nDiangana has scored two league goals but has been dogged by shoulder and calf muscle injuries.\n\"It is irritating because as a player you want to be in the rhythm of games but you always have to be positive - I'm breathing and I'm healthy.\n\"It's the past now and I've just got to keep improving day by day and hopefully I'll be in the team.\"\nThe DR Congo international was in the starting line-up for new boss Tony Mowbray's first game in charge as West Brom lost 2-0 at Middlesbrough on Tuesday.\nThe Baggies host Portsmouth on Saturday.", "url": "https://www.bbc.com/sport/football/articles/cgq03733pevo"}