{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:32:57", "date_modify": "2025-05-19 14:32:57", "date_publish": "2017-08-03 15:14:56", "description": "Rikki Clarke's move from Warwickshire to Surrey and Dom Sibley's switch in the opposite direction will take place this season.", "filename": "sport_cricket_40818038_1747665177.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6CDD/production/_97196872_gettyimages-671817152.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_cricket_40818038_1747665177.html", "title": "Rikki Clarke & Dom Sibley: Pair to move to Surrey and Warwickshire immediately", "title_page": "Rikki Clarke & Dom Sibley: Pair to move to Surrey and Warwickshire immediately - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Veteran all-rounder Rikki Clarke's planned move from Warwickshire to Surrey and batsman Dom Sibley's switch in the opposite direction have been brought forward to this season.\nClarke, 35, and Sibley, 21, were due to join their new clubs in 2018, but the deals will now take place immediately.\nIt means both are available for Friday's T20 Blast matches.\n\"This loan for the rest of the season makes perfect sense,\" Alec Stewart, Surrey director of cricket, said.\nThe former England captain continued: \"Adding Rikki to our squad will add quality and valuable experience.\"\nComing on top of Olly Stone's delayed debut last month following his winter arrival from Northants, Sibley follows the signings of fellow young hopefuls Will Rhodes (Yorkshire) and Adam Hose (Somerset) as the Bears' fourth new arrival from another first-class county in 12 months.\n\"I have spoken about our need to undergo a transformation process,\" said Warwickshire sport director Ashley Giles. \"And we're very happy to reach this loan agreement.\n\"Dom's addition is a key part of achieving this, along with the previous signings of Adam Hose and Will Rhodes. All three are excellent prospects and, with several home-grown young players also showing great promise, we will have fantastic competition for places in all formats.\"\nSibley, who came through Surrey's academy, turned down a new three-year contract to move to Edgbaston, while Clarke signed a two-year deal at The Oval last week.\n\"Despite my huge disappointment with Dom leaving us, I do accept his reasons but it doesn't make it any easier,\" Stewart added.\n\"He's been a Surrey player as a boy and man and is very popular with everybody in and out of the dressing room.\n\"With a very heavy heart, we wish him all the very best and hope perhaps one day he may return.\"", "url": "https://www.bbc.com/sport/cricket/40818038"}