{"authors": ["Ged Scott", "www.facebook.com"], "date_download": "2025-05-20 14:33:26", "date_modify": "2025-05-20 14:33:26", "date_publish": "2023-07-28 18:18:30", "description": "Centurion Ollie Price improves his career-best for a second time in four games but Worcestershire grow lead over Gloucestershire.", "filename": "sport_cricket_66335949_1747751606.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/263B/production/_130578790_oprice.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66335949_1747751606.html", "title": "County Championship: Ollie Price hits 115 before Worcestershire grow lead over Gloucestershire", "title_page": "County Championship: Ollie Price hits 115 before Worcestershire grow lead over Gloucestershire - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Worcestershire go into the final day of their M5 derby meeting with Gloucestershire in control after quickly growing their lead at Cheltenham College.\nDespite Ollie Price hitting a career-best 115, the hosts fell short of what they had they hoped to score as they were bowled out for 301, trailing by 105 on first innings.\nWorcestershire vice-captain Jake Libby then hit his third first-class century of the summer as the Pears rapidly progressed to 316-8, to build a potentially match-winning lead of 421.\nIt looked set up for the two Price brothers when Gloucestershire resumed on their overnight score of 212-4.\nBut Dillon Pennington took wickets with both his first two deliveries.\nTom Price, on 46, went for a cover drive to reach his half-century in style but got an inside edge onto his stumps - and Jack Taylor then went lbw next ball.\nZafar Gohar hung around long enough to put on a further 36 with Ollie Price, who went to his century.\nBut Price gave a catch to short mid-on off Matthew Waite, before Adam Finch finished off the innings.\nHe removed Zafar and Paul Van Meekeren in the space of three deliveries before also bagging a limping Matt Taylor, the ball after he had hit him for six to bring up the Gloucestershire 300 and earn a second batting bonus point.\nAfter Tom Price removed Gloucestershire old boy Gareth Roderick, Van Meekeren then struck twice to get Azhar Ali and Kashif Ali in successive overs - en-route to claiming his first 'five-fer'.\nAdam Hose put on 58 with Libby before chopping on to Zafar and Libby then shared a further 114-run stand with skipper Brett D'Oliveira (46), before some late plunder from Waite.\nOn the 50th anniversary of the great Garry Sobers doing it one over, he hit six sixes - and just two fours - to gets to his 50 from only 22 balls.\nThat stretched the visitors' lead beyond 400 as they chose further run accumulation over the temptation of sticking in the hosts to face a few testing overs before the close.", "url": "https://www.bbc.com/sport/cricket/66335949"}