{"authors": ["Marissa Thomas", "www.facebook.com"], "date_download": "2025-04-26 06:55:34", "date_modify": "2025-04-26 06:55:34", "date_publish": "2025-02-28 15:21:43", "description": "Oliver Glasner press conference: Crystal Palace vs Millwall", "filename": "sport_football_articles_cwyjjrgdx02o_1745650534.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8249/live/031e5ce0-6de3-11ef-b970-9f202720b57a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cwyjjrgdx02o_1745650534.html", "title": "Oliver Glasner press conference: Crystal Palace vs Millwall", "title_page": "Oliver Glasner press conference: Crystal Palace vs Millwall - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "On team news: \"All players are fit and available. Marc Guehi is OK [after the win over Aston Villa]. It helped that we had one more day between these two games. The only change is Matheus Franca will be in the squad, and Caleb Kporha won't be, but all others are ready.\"\nGlasner said he has \"not decided\" whether midfielder Adam Wharton, who made his first Premier League start since October on Tuesday after recovering from a long-term groin injury, will play: \"We have to be smart and not say 'he had a great game, so he'll play again three days later.' He was injured for a very long time, then had 10 minutes at Fulham, and 80 minutes against Villa. It's the third game in seven days – so let's see. We have one more day.\"\nOn if Palace can win the FA Cup: \"We have to show it tomorrow. That's why I don't talk about winning the FA Cup now when we are at the round of 16. We are facing a good Millwall side and they will try to take their chances. It makes no sense talking about winning a trophy when you are in the round of 16.\"\nOn preparing for their Championship visitors: \"We will play with the best available team, with who's ready and fit. It's not about giving someone a gift – 'now you get some minutes because it's an FA Cup game' – this is disrespectful to Millwall. They can expect that we will play with our best team because this is what they deserve. They won at Leeds [in the fourth round], so that shows that they are able to win away against a good team. We have to be very focused and concentrated.\"\nGlasner continued: \"I'm expecting a great game in a great environment. A sold-out Selhurst Park and lovely weather is predicted. I think that's why we all love football. The FA Cup, it's Saturday, high noon, so it is everything that we want.\"\nOn teenage winger Romain Esse, who joined Palace from Millwall last month, Glasner said: \"Every player wants to play the whole time. Of course, I know that maybe it's a special game for Romain, but I never promise any player that he plays. It's all about how the game is going. I have definitely in my mind that he will get some minutes.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cwyjjrgdx02o"}