{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:38:54", "date_modify": "2025-05-20 14:38:54", "date_publish": "2023-07-28 12:35:55", "description": "Bournemouth: 'If we want to play high, we need high intensity from the players' - Iraola", "filename": "sport_articles_ck5l16wj97wo_1747751934.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cb70/live/276d02c0-2d3b-11ee-b1d7-8fdc93c2782e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_ck5l16wj97wo_1747751934.html", "title": "'If we want to play high, we need high intensity from the players' - Iraola", "title_page": "Bournemouth: 'If we want to play high, we need high intensity from the players' - Iraola - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "New Bournemouth manager Andoni Iraola say he will utilise his substitutes next season in order to maintain the high intensity pressing he hopes to implement at the club.\nDuring his time in Spain, Iraola's Rayo Vallecano side had a reputation for being one of the most effective pressing teams in the division, playing with a high block and forcing teams into errors in dangerous areas.\nAsked by BBC Radio Solent if prioritising fitness levels in pre-season was key to achieve his ideal style of football,, Iraola replied: \"Yes. If we want to play high, we want to press and we want to recover the balls [high], we need high intensity from the players - there's no other way.\n\"Sometimes it's difficult to maintain it for 90 minutes - that's why, for me, players who don't start are very important because - especially in the forward positions - we will need the subs to maintain this high intensity level.\n\"It's much better if one player can play 55 to 60 minutes at a top level and then another player comes and plays the same way for the rest of the minutes. Much better than one player not pushing because it's going to be hard for 90 minutes.\"\nBournemouth have made five signings and seen 10 players leave the club already this summer, but Iraola is anticipating more activity before the window closes on 1 September.\n\"I have my idea, but here the ideas change day to day,\" he added when asked if he knew his line-up for the Cherries' opening Premier League match against West Ham United.\n\"You see some things in training. You start analysing. It's not so far, but it's far.\n\"The market is open. We know already there will probably be some changes, so we will think exactly about the starting XI after we've played against Lorient [final pre-season friendly].\"", "url": "https://www.bbc.com/sport/articles/ck5l16wj97wo"}