{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:29:31", "date_modify": "2025-05-21 04:29:31", "date_publish": "2025-01-05 17:47:08", "description": "DU: Dundee Utd v Hearts: What the manager said", "filename": "sport_articles_c5ygn3dgyeeo_1747801771.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/936f/live/43e195f0-cb7e-11ef-b454-0d3064afa545.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c5ygn3dgyeeo_1747801771.html", "title": "DU: Dundee Utd v Hearts: What the manager said", "title_page": "DU: Dundee Utd v Hearts: What the manager said - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Dundee United manager Jim Goodwin: \"It was a scrappy game, which didn't surprise me really, it was difficult for both sets of players with the quick turnaround from Thursday evening.\n\"We just weren't at the races today unfortunately. In possession we caused ourselves a lot of problems early on through sloppiness.\n\"In the second half we were better and had a bit more control without creating anything clear cut. We tried to make changes throughout the game and just before Hearts score but then we find ourselves behind.\n\"We've been very good at defending our box but we don't do well enough in a one-versus-one and it's a fantastic finish from Penrice. It was the type of game when one goal was going to be enough but unfortunately Hearts were the ones who got it.\n\"Every squad is in the same boat but we struggle because of the size of the squad, we lack real strength in depth and some of the guys are running on fumes at the moment.\n\"We've got another difficult week next week with a trip to Parkhead midweek and only two days to recover before a massive game in Paisley on Saturday.\n\"I've got to take it on the chin that the changes I made that didn't quite work. In recent games I've been positive with changes and we've got the results.\n\"But today is on me, not the players, the effort was there for everybody to see we just lacked quality.\"", "url": "https://www.bbc.com/sport/articles/c5ygn3dgyeeo"}