{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:00:30", "date_modify": "2025-05-21 06:00:30", "date_publish": "2024-12-24 14:12:39", "description": "Ruben Amorim press conference: Wolves vs Man Utd preview", "filename": "sport_football_articles_cpq94rzjr5wo_1747807230.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/eec5/live/993cf210-a90a-11ef-a4fe-a3e9a6c5d640.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cpq94rzjr5wo_1747807230.html", "title": "Ruben Amorim press conference: Wolves vs Man Utd preview", "title_page": "Ruben Amorim press conference: Wolves vs Man Utd preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "He was asked about Wolves boss Vitor Pereira, a fellow Portuguese, and said: \"He did a great job at Porto. He is a very good coach who will understand us.\"\nHe was asked again about Marcus Rashford being left out and said: \"When I feel that it is the right moment to change something [I will], until then I will continue to think what is the best for the team. I speak to him every day but not about the interview, about the performance.\"\nWhen asked if the situation with Rashford could become a distraction, Amorim told reporters: \"I don't think so. Everybody in Carrington knows what I'm talking about and what I want from Marcus and everybody else. So it's not a distraction for us, maybe it's for the media but that is not my concern.\"\nHe says he \"doesn't want anything from the fans\" during this tough period, adding: \"It's just from us. I cannot say better things for the fans. I understand as a coach, I understand the moment, I understand the frustration, the disappointment. I understand and we will improve, it will take time. So it's just from us, they need our help, not the other way around. They are doing everything right.\"\nAmorim is not concerned with managing matches around the festive period, something he is not used to in Portugal, stating: \"I don't care about Christmas and nothing. I'm just focused on - we need to win the next match. That's the only thing. It's very good for the fans. We are privileged. So we can play on Boxing Day to give some happiness to the fans and we want to win another game.\"", "url": "https://www.bbc.com/sport/football/articles/cpq94rzjr5wo"}