{"authors": ["Elizabeth Hudson", "www.facebook.com"], "date_download": "2025-05-20 12:38:01", "date_modify": "2025-05-20 12:38:01", "date_publish": "2023-08-03 21:18:53", "description": "Ellie Challis wins her second Para Swimming World Championships gold while there is also relay joy for Great Britain.", "filename": "sport_disability-sport_66400791_1747744681.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/EBB8/production/_130644306_80dd48e9e7e558f0968b0b6c220377f1c9ce061f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_disability-sport_66400791_1747744681.html", "title": "Para Swimming World Championships: Ellie Challis and Jessica-Jane Applegate win second golds", "title_page": "Para Swimming World Championships: Ellie Challis and Jessica-Jane Applegate win second golds - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Britain's Ellie Challis says an afternoon sleep helped her win a second gold medal at the Para Swimming World Championships in Manchester.\nThe 19-year-old was the fastest qualifier from the S3 50m backstroke morning heats and went on to set a new personal best in the evening final.\n\"I had a two-and-a-half-hour nap between sessions,\" she told BBC Sport.\n\"I hadn't set a backstroke PB since Tokyo which was really frustrating, but I'm over the moon now.\"\nIt was one of two gold medals on the fourth night of action for the home nation with the S14 4x100m freestyle relay team of William Ellard, Jessica-Jane Applegate, Poppy Maskill and Jordan Catchpole also triumphing.\nChallis, who developed meningitis when she was 16 months old and had both legs amputated below the knee and both arms below the elbow, is one of the busiest members of the GB team in Manchester with six individual events which had already yielded breaststroke gold and medley bronze.\nShe finished Thursday's final in 54.90 seconds - almost six and a half seconds clear of Brazil's Edenia Nogueira Garcia, beating her 55.11 time from Tokyo.\n\"My backstroke split in my medley swim on Tuesday was my fastest time all year so it gave me confidence but I didn't know I was going to go that fast,\" she said.\n\"Going into Paris next year it is less about the medal and more about the time. You don't know who is going to turn up next year and who is going to improve.\"\nThe relay quartet were thrilled as Britain claimed a third consecutive win in the event with Applegate, who won 200m freestyle gold earlier in the week, part of all three victories, while it was a second win for Catchpole and a maiden world title for teenagers Ellard and Maskill.\nThe team were dominant throughout with Ellard giving them a lead of 1.36secs on the first leg before Applegate and Maskill kept them in control and Catchpole maintained the lead as they finished clear of Australia and Brazil.\n\"I know what I am capable of, so I was confident we could get gold,\" said Catchpole who, like Applegate, won Paralympic gold in the event in Tokyo.\n\"I knew Ben Hance of Australia and Gabriel Bandeira of Brazil were coming up behind me, but I knew we had it.\"\nApplegate added: \"It's great to be part of such an epic team and it has been a phenomenal week so far.\n\"I was petrified about going second because it is usually a boy's leg but I gave it everything.\n\"I think I was bit too excited and went out too quick because the last 15 metres were tough, but we carried each other and Jordan did a great leg to hold on.\"\nElsewhere, Maisie Summers-Newton put in a storming final 50m to get past Austrian Nora Meister and take silver in the S6 400m freestyle and add to her medley gold from Wednesday while Alice Tai also won her second medal with S8 100m freestyle bronze to go with her 100m backstroke gold.\nAnd there was a first gold medal for Ireland when 18-year-old Roisin Ni Riain won a thrilling S13 100m backstroke final by 0.09secs.\nNi Riain was third at halfway behind Italy's Carlotta Gilli and Katia Dedekind of Australia but finished strongly.", "url": "https://www.bbc.com/sport/disability-sport/66400791"}