{"authors": ["Tasnim Chowdhury", "www.facebook.com"], "date_download": "2025-05-21 06:03:43", "date_modify": "2025-05-21 06:03:43", "date_publish": "2025-04-01 15:53:48", "description": "Oliver Glasner press conference: Southampton vs Crystal Palace preview", "filename": "sport_football_articles_czjn9102vlro_1747807423.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8249/live/031e5ce0-6de3-11ef-b970-9f202720b57a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_czjn9102vlro_1747807423.html", "title": "Oliver Glasner press conference: Southampton vs Crystal Palace preview", "title_page": "Oliver Glasner press conference: Southampton vs Crystal Palace preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Chris Richards will miss Wednesday's match, \"He is struggling a bit with his calf. It doesn't look very serious, so we expect him [to return] against Brighton at the weekend. But tomorrow is a little bit early.\" Glasner said Jean-Philippe Mateta is \"fine\", adding: \"It looks like he's getting back into his rhythm and that's very positive.\"\nOn Adam Wharton: \"It wasn't his best performance [against Fulham]. I think Adam can play better than he did. But yes, he has a lot of potential. We could see it last year. But we also can see when you have just a very short time to recover - not just physically, but also mentally. He struggled for six, seven, eight months with several injuries.\"\nOn Palace's FA Cup journey: \"The most important thing is that we find the switch from the cup game and are not talking about Aston Villa and thinking about Aston Villa. We need to be really in the game tomorrow, and then I think it's possible to celebrate the seventh consecutive away win.\"\nOn six away wins without conceding a goal: \"It's something I never did before. But it's also [because of] the belief of the players that we can win everywhere. What I liked in the Fulham game is we didn't get nervous after really struggling at the beginning. We relied on our quality, on our system, on what we were planning.\"\nGlasner added: \"We know when there are moments in a game when we have to fight for each other, then we fight for each other. There are moments when we have to play together, then we play together. And I think this has really developed over the past months.\"\nOn Wednesday's match: \"I don't expect a very tactical game because they are playing, especially when we have the ball, more or less a man-to-man defence. I expect many duels. It's about winning your duels.\"\nOn Southampton: \"They're playing very aggressive. They're very physical. They always get pressure on the ball. You always get pressure on the attacking players. But on the other side, if you lose a duel, you can have very quickly an underload, and so that means always risk and chance.\"", "url": "https://www.bbc.com/sport/football/articles/czjn9102vlro"}