{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:43:49", "date_modify": "2025-04-26 03:43:49", "date_publish": "2025-03-05 08:11:47", "description": "Truro City manager John Askey says his side should focus on automatic promotion after beating rivals Boreham Wood 2-1.", "filename": "sport_football_articles_cx2enw7zzllo_1745639029.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/440e/live/e4d5eb50-f996-11ef-ae5c-2f8723cb2041.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cx2enw7zzllo_1745639029.html", "title": "Truro City boss John Askey focuses on promotion after key Boreham Wood win", "title_page": "Truro City boss John Askey focuses on promotion after key Boreham Wood win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Truro City manager John Askey says his side should focus on securing automatic promotion after beating fellow National League South high-fliers Boreham Wood 2-1.\nThe win moved the Tinners into third place in the table, just two points behind leaders Dorking Wanderers, ahead of a run of five games against sides in the bottom half of the table.\nTruro had two strong penalty claims waved away in a goalless first half before Luke Jephcott gave them a 64th-minute lead.\nThe Newport County loanee finished well after good work by Dominic Johnson-Fisher for his second goal in as many games.\nThe Wood upped the pressure and Jaze Kabia's crucial second goal came with six minutes left, only for Chris Bush to pull one back two minutes later.\nBut City held on despite seven minutes of stoppage time to seal a crucial win.\nAskey's side have now gone eight games unbeaten, including four wins from their last five, and have leapfrogged Boreham Wood, who drop to fifth place.\n\"Before the game we were looking at it and thinking it's great if we can win, then you stop worrying about getting in the play-offs, you start thinking more about trying to get automatic promotion, and I think that's what players have got to do,\" Askey told BBC Radio Cornwall.\n\"I thought the first goal that we scored was a fantastic finish, a well-worked goal and then we get a second you think 'we've got to see out'.\n\"With them getting the result they got on Saturday - coming back from two goals down to draw 2-2 - then you think 'the same thing's not going to happen tonight', because I thought up to them getting that goal we dominated the second half, they had a lot of the ball, but rarely troubled us.\n\"It was just what we needed after the result on Saturday [a 4-1 win at Chesham]. To follow it up with another win, especially at home, it was perfect.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cx2enw7zzllo"}