{"authors": ["Ged Scott", "www.facebook.com"], "date_download": "2025-05-21 06:26:30", "date_modify": "2025-05-21 06:26:30", "date_publish": "2025-04-01 09:54:06", "description": "Trainer Olly Murphy says nobody can begrudge Sean Bowen the title of champion jockey after last season's injury mishap.", "filename": "sport_horse-racing_articles_c99p094mlelo_1747808790.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9c69/live/975d7310-0e28-11f0-b851-29ea4ea8a4cd.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_horse-racing_articles_c99p094mlelo_1747808790.html", "title": "Sean Bowen: Nobody can begrudge Welshman jockeys' title", "title_page": "Sean Bowen: Nobody can begrudge Welshman jockeys' title - Olly Murphy - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Sean Bowen's anticipated crowning as this season's champion jump jockey would be entirely deserved after the Welshman's cruel luck with injury a year ago, says his main trainer Olly Murphy.\nEntering the final month of the 2024-25 season, and heading into Grand National week, Bowen holds a lead of 31 wins, external over his nearest challenger Harry Skelton.\nBowen, the stable jockey at Midlands-based Murphy's Warren Chase stables in Warwickshire, was leading the race to be champion jockey last season, only to suffer a fall on Boxing Day which ruled him out of action for two months.\nIn that time, his nearest rival and friend Harry Cobden overtook Bowen and built a big enough lead to win his first title.\nAlthough Bowen's current lead now looks safe, Murphy is praying his jockey will get the job done safely by the time the prize is presented at Sandown Park on Saturday 26 April.\n\"I don't think anyone would now begrudge Sean his first title after what he went through last season,\" Murphy told BBC Sport. \"It was gut-wrenching for him, being so far clear and then getting injured.\"\nMurphy does not have an entry for Saturday's National at Aintree, so Bowen has picked up a spare ride on 20/1 shot Three Card Brag for Irish trainer Gordon Elliott, Murphy's former boss.\nSpeaking at Stratford-upon-Avon after Bowen rode his 162nd winner of the season on Tropical Speed in Saturday's last race, Murphy said: \"I just want to keep him in one piece.\n\"He's done as well as he has for plenty of reasons. He's had the support of a lot of people, my horses have been very consistent all year and he's had very good jockeys chasing him down in the championship to keep him honest and hungry. But he fully deserves to be where he is.\n\"His dedication is not in doubt. And he's been riding out of his skin.\"\nWhile Bowen leads the jockeys title race, the ever improving Murphy is fifth in the trainers list, external (which is based on prize money not winners) - but only his Warwickshire neighbour Dan Skelton (158) has sent out more winners than his own season's best of 125.\nIn a campaign when the Welshman has also passed 1,000 career winners, he is grateful for the role Bowen has played.\n\"He's been a big part of my rise as a trainer over the last couple of years,\" added Murphy. \"His work ethic is second to none - and his feedback on a day-to-basis is fantastic.\n\"You have to have a good working relationship with a jockey - and it's particularly important having a good stable jockey.\n\"I believe Sean brings the best out of me and I bring out the best of him. We work very closely together. He's very much involved in everything that goes on at Warren Chase.\"\nWhile Murphy does not have a runner in this Saturday's National, he has Bowen on board Strong Leader at Aintree in the race before, defending their Liverpool Hurdle crown from a year ago.\n\"I love Aintree,\" said Murphy. \"If we didn't have another winner this season, I'd take it if we could have another one at Liverpool. It was my first festival winner.\"\nAnd he hopes there is a lot more still more to come from his growing yard, just outside Stratford.\n\"There are a lot of good trainers in England and it's a ruthless sport. We just need that little step up to where Nicky Henderson, Paul Nicholls and Dan Skelton are.\n\"I'm still making mistakes but, with a little more experience under my belt, I still believe in doing things in a better manner. I'm delighted with how things are going. We're fifth in the trainers table, have the best strike rate of any of the top 50 and only Dan has trained more winners than me.\n\"But I want to get better and climb that table again. We want to get more horses, even better horses and to improve on this next year. Come Sandown on 26 April, we're all back to zero and then it will be time to get rock'n'rolling again.\"", "url": "https://www.bbc.com/sport/horse-racing/articles/c99p094mlelo"}