{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 08:06:15", "date_modify": "2025-04-26 08:06:15", "date_publish": "2025-02-26 15:02:45", "description": "Welsh Rugby Union (WRU) interim performance director Huw Bevan says he believes changes made by the governing body can help Wales return to the world's elite.", "filename": "sport_rugby-union_articles_c1kjmnxg4gxo_1745654775.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d1b1/live/11c02f70-f430-11ef-90ba-27e0e506a6c8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_c1kjmnxg4gxo_1745654775.html", "title": "Welsh Rugby Union boss hopes for world elite return", "title_page": "Welsh Rugby Union boss hopes for world elite return - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Welsh Rugby Union (WRU) interim performance director Huw Bevan says he believes changes made by the governing body can help Wales return to the world's elite.\nThe Wales men's team are at a statistical all-time low with a record 15 Test match defeats seeing them slip to 12th in the world rankings with Bevan saying the WRU has previously taken its \"eye off the ball\" in its succession planning.\nA WRU initial strategy was launched in June 2024 where it says Wales want to be back in the world's top five by 2029.\n\"There is no silver bullet for where we want to be and it's going to be a gradual process,\" said Bevan.\n\"I believe what we have done and changes we have made in the pathway and the collective collaboration between the regions and the Union will turn the ship around and get us back in a position where we are competitive and then successful.\n\"It is the aim by 2029 to be consistently back in that top five of world rugby, that 's what the 'One Wales' strategy is about.\n\"I believe the strategy we have for the pathway is going to get us there.\"\nWales won four Grand Slams, six Six Nations titles and reached two World Cup semi-finals between 2005 and 2021 before the slump of the past 18 months.\nBevan admitted mistakes were made in this period and can not be repeated.\n\"With some of the things that have challenged us, we didn't look after the succession plan when we were successful,\" said Bevan.\n\"I think we took our eye off the ball a little bit and we are suffering the consequences for that.\n\"So we need to make sure we deliver what we say we will deliver in the pathway.\"\nBevan believes it is important players are continually developed and fed into an existing strong squad.\n\"We must manage our succession plan better than we have done previously and don't get to a stage where we lose the collective experience all in one go,\" said Bevan.\n\"We need to blood the younger players and bring them into an environment where there is a balance between experience and the emerging developing prospects.\"\nBevan has pointed to a range of measures implemented by the pathway that he believes have improved the system.\nThere has been the implementation of the Super Rygbi Cymru competition, a revamp of the academy system and plans for a new Centre of Excellence, the creation of a new group of \"national interest\" male players to help boost the depth of Welsh talent and what Bevan says is an improved alignment between the senior squad and national age grade set-up.\nWelsh rugby is closing in on a long-awaited new funding agreement that the WRU says will \"safeguard the future\" of the professional game in the country.\nAfter a year of wrangling, the WRU and its four regional sides have confirmed they have agreed in principle a five-year deal, although it is yet to be officially signed.\nThe Professional Rugby Agreement (PRA) will try to maintain four regions but also ensure extra funding for Cardiff, Dragons, Ospreys and Scarlets.\nThe aim is to provide enough talent to keep four professional sides in Wales with the squad's salaries rising from £4.5m to £5.1m next season with the goal of increasing towards £6.8m in a few years.\n\"The basis of the strategy is about producing more and better players,\" said Bevan.\n\"It's to ensure we have a talent pool big enough to support four successful regions and a successful national team.\"\nBevan hopes players who are currently in England and France will return to Wales and the number of non-Welsh qualified individuals in the squads will be reduced.\nHe insists there is still room for high-class foreign imports.\n\"If you look back to some of the high-quality overseas players we had in the system and the benefits they brought, that's the standard we are aspiring to get back towards,\" said Bevan.\n\"Those sorts of characters like Justin Marshall, Filo Tiatia and Xavier Rush, who were outstanding players and had a positive influence on the environment and youngsters coming through.\n\"There's going to be a gradual process over a number of years but I'm confident we will get to a stage where we can get back to that.\n\"We want the majority of our squads to be Welsh-qualified players eligible to play for the national team that are benefiting from some high quality overseas players, who are supporting their development and adding value to the environment in addition to the quality they bring on the field.\"\nFormer executive director of rugby Nigel Walker resigned in December 2024 with his successor expected to be appointed next month.\nBevan has temporarily taken over Walker's responsibility for the elite game.\n\"It has been busy but enjoyable,\" said Bevan.\n\"There are challenges most days but we are making progress and need to remind ourselves of the positive things we have done.\"", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/c1kjmnxg4gxo"}