{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:05:53", "date_modify": "2025-05-19 15:05:53", "date_publish": "2015-02-24 14:45:14", "description": "Midfielder Ryan Taylor aims to secure his Newcastle United future and prove his value on his return from a knee injury.", "filename": "sport_football_31605858_1747667153.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81208000/jpg/_81208460_458054392.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31605858_1747667153.html", "title": "Ryan Taylor keen to secure Newcastle United future", "title_page": "Ryan Taylor keen to secure Newcastle United future - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Versatile defender Ryan Taylor is keen to secure his Newcastle United future and prove his value on his return from a niggling knee injury.\nTaylor, 30, came on as a substitute in Saturday's 5-0 defeat by Manchester City, only his fourth outing this term.\nRepeat knee injuries, including a setback during rehabilitation, have limited his first-team opportunities.\n\"I've got to try to earn a new contract which is always in the back of my mind,\" Taylor told BBC Newcastle.\n\"I'm 30 years old now and I just want to enjoy my football again.\"\nTaylor, who has been with the Magpies for five years since his move from Wigan, remains a popular player with supporters - as signified by the chant that celebrates his free-kick winner against Sunderland in August 2011.\nHis return after 26 months out at the end of October 2014 began with a famous Capital One Cup win at Manchester City, but lasted just four games.\nThe comeback was brought to a premature end after a challenge in a game against Queens Park Rangers led to the utility player being withdrawn after 30 minutes.\nTaylor continued: \"With my history it was like 'not again, I've worked too hard for this'.\n\"We've looked at the incident and the little knock I get off Sandro was enough to put just too much pressure on.\n\"The physios and the doctors said it could have happened to anyone, but it happened to me.\n\"It was a niggle, I've had to rest it but I'm keen and feel as good as ever.\"\nRyan Taylor was speaking to BBC Newcastle's Mick Lowes.", "url": "https://www.bbc.com/sport/football/31605858"}