{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:40:22", "date_modify": "2025-05-19 14:40:22", "date_publish": "2017-07-22 08:45:29", "description": "Bowler Anya Shrubsole says England are aiming to produce the \"perfect game\" in the Women's World Cup final against India on Sunday.", "filename": "sport_cricket_40668028_1747665622.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/E301/production/_97031185_shrubsole_pa.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_cricket_40668028_1747665622.html", "title": "Women's World Cup final: England want 'perfect game' against India", "title_page": "Women's World Cup final: England want 'perfect game' against India - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Seamer Anya Shrubsole says England are aiming to produce the \"perfect game\" when they face India in the Women's World Cup final at Lord's on Sunday.\nEngland have won six straight matches since losing the opening game to India.\n\"It gave us many lessons to learn,\" Shrubsole, 25, told BBC World Service's Stumped.\n\"Since then we've moved forward. The exciting thing is we feel like we've yet to put a perfect game together. Fingers crossed it happens on Sunday.\"\nEngland captain Heather Knight has confirmed that her side will be unchanged for the final.\nIt is a sell-out at Lord's, where women could not enter the Long Room as members until 1999, with more than 26,500 expected to attend.\nThe ground last hosted the showpiece in 1993, when England beat New Zealand by 67 runs.\nEngland trained at Lord's this summer, and Shrubsole said they are as prepared as they could be for the final.\n\"We ensured that if we got to the World Cup final there weren't too many surprises,\" she added.\n\"We knew the surroundings really well. We knew what to expect. It was always a 'just in case' but also to inspire us. All that will stand us in good stead now that we've made the final.\"\nIndia, who finished third in the group, stunned 2013 champions Australia in the last four to reach their first final since 2005.\n\"If we pull it off it's a big thing back in India,\" said captain Mithali Raj. \"Everybody has always emphasised that we need to win ICC tournaments.\n\"This is the stage and this is the platform.\"\nThe International Cricket Council (ICC) increased prize money for this tournament from $200,000 (£153,750) in 2013 to $2m (£1,537,500) this year, while every match was broadcast live, external for the first time.\nHolly Colvin, a member of the England side who won the World Cup in 2009 and now ICC women's cricket officer, said: \"In just four years the global game has exploded.\n\"Prize money is 10 times what it was and we've had every ball being televised. Chamari Atapattu's 178 not out for Sri Lanka would have been lost otherwise.\"\nAccording to the ICC, average ticket sales - almost 1,700 per game - have been the highest in World Cup history.\nColvin added: \"We're seeing that crowd attendances are not made up of just family and friends. It's of people who want to see women's cricket.\n\"There's been support all around the country - 50% of attendance was made up of women and girls, and 30% of them were under 16. That's been an exciting part.\"", "url": "https://www.bbc.com/sport/cricket/40668028"}