{"authors": ["Mantej Mann", "www.facebook.com"], "date_download": "2025-05-21 04:37:25", "date_modify": "2025-05-21 04:37:25", "date_publish": "2025-04-04 16:30:44", "description": "Sale Sharks show spirit but fall short of a famous European win as defending champions Toulouse win a Champions Cup tie that was delayed in bizarre circumstances.", "filename": "sport_rugby-union_articles_cn8052xkxx7o_1747802245.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/aa0a/live/596212e0-1301-11f0-baa6-cf6d1e060075.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cn8052xkxx7o_1747802245.html", "title": "Toulouse 38-15 Sale Sharks: After parachute drama, hosts step up Champions Cup title defence", "title_page": "Toulouse 38-15 Sale Sharks: After parachute drama, hosts step up Champions Cup title defence - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Sale Sharks produced a spirited display but fell short of a famous European win as defending champions Toulouse won an Investec Champions Cup last-16 tie that was delayed in bizarre circumstances.\nThe game started almost 40 minutes late as one of three parachutists, tasked with pre-match entertainment and delivering the match ball, became stuck on the roof of Stadium de Toulouse.\nWhen play eventually began after he was safely rescued by the local fire service, Toulouse showed no sign of distraction as Jack Willis powered over from close range for the opening try.\nThe hosts racked up 33 tries in the pool stage and their vociferous home support may have expected another procession in their pursuit of a record-extending seventh title, but Sharks hit back almost immediately through Luke James.\nIt was a sign of Mancunian confidence, which was heightened further by a George Ford penalty before Jonny Hill's outstretched arm grounded a second try to hand the visitors a 15-7 lead.\nThomas Ramos reduced the deficit from the tee before Sale were millimetres short of a third try as Tom Roebuck was adjudged to have been in touch before diving over.\nThe inevitable Toulouse recovery arrived after the interval, though, as Francois Cros registered their second try from a driving maul before Ramos added the conversion to edge them two points in front.\nSale struggled to carve out the opportunities they were able to create in the first half, but they remained within striking distance until a moment of quality by Romain Ntamack, who fired a delicate 50:22 kick.\nHome captain Julien Marchand reached out to ground the ball from close range after another dominant rolling maul and the game seemed to be slipping away from the Premiership side.\nJoel Merkler's finish was chalked off, with Ange Capuozzo adjudged to have been the wrong side of the touchline.\nHowever, Italian flyer Capuozzo made amends soon after with a stunning solo finish, showing deft footwork and blistering speed to score under the posts.\nIt proved to be the wing's final act as he was carried off following Tom O'Flaherty's tackle in a blow for the hosts, but Toulouse were not finished. Guillaume Cramont added gloss to the scoreline with another powerful surge.\nToulouse face a trip to rivals Toulon in the quarter-finals next weekend.\nSale arrived in the south of France knowing that to dethrone Toulouse they would need to be clinical and seize on any good fortune that might come their way.\nPerhaps the slight misjudgement by a paratrooper could have knocked Toulouse's focus, with post protectors and a children's bouncy castle placed underneath the stand in case a soft emergency landing was required.\nThat will be remembered as a freak incident rather than anything more serious, but it was an early indication that it might not be a day for the script.\nToulouse were still fast starters as Willis, who is tipped for British and Irish Lions selection despite being overlooked by England, struck an early blow on Sale and their Curry twins.\nThe England stars would land the next shot, though, as a charging Ben Curry forced Willis to take a seat on his backside in the build-up to James' finish.\nTom Curry then demonstrated why he too is favoured for a Lions role in Australia this summer with an excellent turnover, which would cost him further involvement in the game, as he emerged from the melee with an injured arm.\nReplacement Sam Dugdale entered the fray to win a turnover from his first involvement at the breakdown.\nThe visitors were growing in belief and Hill scored their second try before Roebuck thought he had added a third.\nIt was not to be and Toulouse regrouped. It was not long before they took control, surging on the scoreboard and limiting their visitors to just a couple of tame drop-goal attempts by Ford.\nSale head home with their heads held high, but ultimately they were found wanting. They were not alone in that respect among English teams, on a weekend when four of the five Premiership clubs went out at the first knockout stage.", "url": "https://www.bbc.com/sport/rugby-union/articles/cn8052xkxx7o"}