{"authors": ["Laura Kirk-Francis", "www.facebook.com"], "date_download": "2025-05-21 06:06:16", "date_modify": "2025-05-21 06:06:16", "date_publish": "2024-12-24 15:35:42", "description": "Arsenal news: Opinion - Fan's moment of the year", "filename": "sport_football_articles_c205ge4pvw7o_1747807576.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/fbf6/live/712e8270-b626-11ee-beb5-e1400df560f2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c205ge4pvw7o_1747807576.html", "title": "Opinion - Fan's moment of the year - BBC Sport", "title_page": "Arsenal news: Opinion - Fan's moment of the year - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The North London Derby is the first date I look for when the fixtures are released ahead of the new season. It is a day of terror, where the stakes are so high that it makes for genuinely unpleasant viewing. The April 2024 edition proved no different.\nArsenal were in the middle of a difficult run of fixtures, of which the away trip to Tottenham was perhaps the hardest. With the right result, Spurs had a genuine chance of stopping Mikel Arteta's side from winning the league, a scenario which was simply unthinkable for Arsenal fans.\nBut after 38 minutes, with Kai Havertz heading home to complete another set piece masterclass, Arsenal were 3-0 up. Three, at their biggest rivals, before half time. This was one of the moments I thought the title was headed to North London. Spurs had been so keen to spoil Arsenal's party, and yet when the half time whistle was blown, boos could be heard from the home fans. They had been embarrassed. We were giddy with happiness.\nFast forward to the 88th minute, and as Son Heung-Min stepped up to take the penalty that would bring the scoreline to 3-2, I turned the TV off, and walked down to the end of my garden. I sat on an upturned plant pot, and genuinely wondered what life was about to be like if Arsenal squandered their three goal lead. I couldn't bear it.\nFive minutes after the game my mum came to get me, gently informing me of the result, and slightly concerned for my welfare.\nThat game encompasses so well what it's been like watching Arsenal in 2024. Utterly ruthless, totally frustrating, but brilliantly entertaining all at the same time. Long may it continue into 2025.", "url": "https://www.bbc.com/sport/football/articles/c205ge4pvw7o"}