{"authors": ["Gareth Griffiths", "www.facebook.com"], "date_download": "2025-05-20 12:15:27", "date_modify": "2025-05-20 12:15:27", "date_publish": "2023-08-04 15:54:27", "description": "It has been a long wait for Leigh Halfpenny but the full-back is finally set to join Wales' illustrious 100-cap club this weekend.", "filename": "sport_rugby-union_66327759_1747743327.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/13ABB/production/_130617508_leighhalfpennyonlinegraphic.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-union_66327759_1747743327.html", "title": "Leigh Halfpenny: The unassuming Swansea boy who became a world rugby star", "title_page": "Leigh Halfpenny: The unassuming Swansea boy who became a world rugby star - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "\"Nobody deserves 100 Wales caps more than Leigh Halfpenny. He is the ultimate professional.\"\nNot a quote that can be attributed to just one individual when talking about Wales' popular full-back ahead of his magical milestone this weekend.\nIt is what everybody espouses when asked for their recollections of the 34-year-old who has battled to defy the odds.\nIt has been a long wait but Halfpenny will join Wales' illustrious 100-cap club on Saturday when he takes to the field against England in Cardiff.\nThe recognisable scrum cap and unerring boot have become Halfpenny trademarks and also defining images of Wales' success for more than a decade.\nHe is a man who does his talking on the field. A quiet demeanour but fearless nature has seen Warren Gatland calling him the best defensive full-back in the world. Once deemed too small for professional rugby, Halfpenny has continually proved his doubters wrong.\nHalfpenny started rugby life as a wing and burst on to the international scene when he made his debut as a teenager in 2008 against South Africa.\nGorseinon RFC, in a small Swansea suburb, is where it started. The 'Leigh Halfpenny pavilion' now stands proudly there and the clubhouse has a shrine of caps and jerseys dedicated to one of the village's most famous sons.\nGrandfather Malcolm was one of the driving forces in his early career, picking Halfpenny up from Penyrheol School to take him to goal-kicking practice.\nThere are stories of Christmas Day sessions, also driving around west Wales in early summer looking for a rugby field where the goalposts had not yet been taken down.\nThese are not myth though - this was his reality with mother Estelle spending many hours driving her son to games and training.\n\"If you are counting Christmas Days and Boxing Days he came down to kick with his grandfather, I wouldn't be able to work out the countless hours, but it would be a lifetime for other people,\" said Gorseinon chairman Ian Murphy.\n\"He loved his rugby and was always passionate and hard-working.\"\nHalfpenny was involved in the same Gorseinon junior side as Wales fly-half Dan Biggar.\n\"It was evident from a young age Leigh was quite special,\" Murphy recalls.\n\"Rob Steele was the coach and Dan played in the same special side and they won many championships.\n\"Leigh was spectacular from the start, fast and skilful which he worked hard to develop.\"\nInside the two future internationals was scrum-half and Halfpenny's lifelong friend Tim O'Kelly.\n\"My job was easy with Dan and Leigh outside me, so we won a few trophies with those two in our team,\" said O'Kelly.\n\"We had a decent side but we had those two stars also, so we have great memories growing up.\"\nSo it will be two Gorseinon junior players who will have reached the 100-cap Wales mark, with Biggar on the replacements bench for Halfpenny's special day this Saturday.\n\"When Leigh got named this weekend, we noted we have 207 caps between us and I said we hadn't done badly for two boys who played for Gorseinon Under-13s together,\" said Biggar.\n\"It is incredible only nine players will have played 100 internationals for Wales and two of them have come from one small club in Swansea.\n\"We had a great age-grade system and Gorseinon should be proud of Leigh.\"\nHalfpenny's obsessive strive for perfection has always been evident on and off the field. Scarlets and Wales team-mate Rhys Patchell was Halfpenny's regular room-mate, while Mike Phillips tells a story of sharing with Halfpenny on a Lions tour and taken aback by his team-mate doing his breathing exercises.\n\"He is a complicated and complex guy and puts a lot of pressure on himself,\" said Biggar.\n\"He wants every team, performance, training or gym session to be perfect. That has probably got him to where he is today. He is as level-headed, hard-working and dedicated as anybody you will find.\n\"I don't think anybody deserves 100 caps more for his sheer commitment to not give in. He would have probably been well past that mark without the amount of serious injuries.\n\"When the squad was announced, the overriding emotion from the squad is probably relief, because we know how much of a stress it has been recently for Leigh trying to achieve this.\n\"He has had to pull out of games recently with tweaks. His mentality of being absolutely desperate to get to 100 caps has driven him and we are over the moon.\"\nBiggar and Halfpenny were team-mates in the Ospreys academy where Halfpenny suffered his first setback.\nOspreys said they could not offer Halfpenny a contract thinking he was too small and he was devastated.\nThat story later came out in the press and then academy manager Gethin Watts was identified publicly as the man who had let Halfpenny go.\nSoon after Halfpenny conducted another interview to mark his 2009 Lions selection. At the end of the conversation, Halfpenny asked the journalist not to criticise anyone at Ospreys for letting him go.\nHe said Watts had sent a letter to him congratulating him on what he had done and admitted the Ospreys had made a mistake.\nHalfpenny commented it took a man to write a letter like that. It also took a man, who had only just turned 20, to make such a request.\nHe initially continued his education and started studying dentistry at Cardiff University.\nCardiff Blues offered Halfpenny a place in their academy and he played for the Cardiff club side in the Welsh Premiership.\nHe made his regional debut against Ulster in May 2008. After starring for Wales Under-20s in the 2008 Junior World Championships and impressing for his region in the early season, Halfpenny was selected by Gatland for his senior Wales debut aged 19 in the 2008 autumn series.\nThe big day came against the Springboks where Halfpenny faced a baptism of fire against World Cup-winning wing Bryan Habana.\nIn 1994, Halfpenny was just five when he went to Cardiff to watch Wales play South Africa with his auntie. He went to see his idol Neil Jenkins, the former Wales fly-half who is now their skills coach, and told his auntie there and then \"he was going to play for Wales one day and kick the ball through the posts just like Neil\".\nFourteen years later that became a reality and the buses came up from Gorseinon to see Halfpenny, just as they will this weekend.\n\"We remember his first cap, we were all there as we went up on the buses,\" said club chairman Murphy.\n\"It seems a long time ago but now we can go and see his 100th Wales international.\"\nIt was a day Wales prop Adam Jones was celebrating his 50th cap.\n\"Leigh does not look a lot older now but he looked about 15 then,\" said Jones.\n\"His body has developed since into this little ball of muscle. He is a great kid, really quiet but great fun when he has a few beers in him, which is very rare. I am chuffed to bits for him now.\"\nThat debut kicked off a glittering career which has included the 2012 Grand Slam, three Six Nations titles and being a part of a team that reached two World Cup semi-finals.\nBiggar added: \"Leigh's relationship with Neil is special. You can hear across the pitch sometimes the odd expletive coming from Leigh's mouth if he has missed a couple of kicks and Jenks trying to calm him down.\n\"Jenks does not panic and that gives Leigh confidence if he gets worked up, he has Neil as a leveller.\n\"So Neil is as important for Leigh mentally as he is tactically and technically. He is good at calming him down because if Leigh misses one out of 30 kicks in training, he won't sleep at night.\n\"There is not a huge amount of chat from Neil but - similar to myself - Leigh would say without Jenks, he would not have had the career he has had.\"\nIf all goes to plan this weekend, Gorseinon are planning a celebration party down the club on Sunday.\n\"He's got the freedom of Gorseinon, he can probably go and rob the bar keys and just get a slap on the wrist if he gets caught,\" joked Biggar.\nGorseinon chairman Murphy added: \"We are incredibly proud of Leigh.\n\"He is a treasure to us. He has had setbacks with his injuries, been a hero in his recovery. He is an ambassador to our club, community, family and Wales.\n\"He spends every spare moment he can down the club to either practice, or if there are events with the juniors he is here for hours having his photograph taken and signing autographs.\n\"The young players aspire to be like Leigh. Why wouldn't they? He is very humble, has kept his feet on the ground and still comes here with his friends he grew up with.\"\nOne of those friends says Halfpenny remains a \"Gorseinon boy\".\n\"I have known Leigh since I was three and am still very close now,\" said O'Kelly.\n\"He has never forgotten where he has come from with his old Gorseinon friends. He is a gentleman, a big family man with his fiancee Jess and daughters Lily and Nora and always has time for everybody.\n\"There are almost two different people. Your close friend Leigh Halfpenny and the superstar who plays rugby. It is incredible he remains the same whatever.\n\"He deserves all the accolades. It has been awesome watching his career, we have had some great days out following him around and next will be his 100th Wales cap. It is emotional just thinking about it.\"\nBiggar will ensure there will be a little bit of Gorseinon in that Welsh dressing room on Saturday.\n\"We have been lucky our careers have been in sync and most of our 100 caps we have been a part of together,\" said Biggar.\n\"I am glad to be involved on Saturday and be part of his day. We get to share the moment with the amount we have shared on the field already.\n\"Leigh is one of the greats of Welsh and northern hemisphere rugby. Nobody is more deserving of this accolade.\"", "url": "https://www.bbc.com/sport/rugby-union/66327759"}