{"authors": ["Luke Reddy", "www.facebook.com"], "date_download": "2025-04-26 07:38:04", "date_modify": "2025-04-26 07:38:04", "date_publish": "2025-02-27 13:44:52", "description": "Liverpool news: How Dominik Szoboszlai has helped Reds' title push", "filename": "sport_football_articles_cy055w98g02o_1745653084.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/af18/live/4d6a8060-f50d-11ef-a276-596f7e6218f8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cy055w98g02o_1745653084.html", "title": "Liverpool news: How Dominik Szoboszlai has helped Reds' title push", "title_page": "Liverpool news: How Dominik Szoboszlai has helped Reds' title push - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Dominik Szobozslai won possession back eight times for Liverpool in Wednesday's 2-0 win over Newcastle - a high for his team - as well as winning eight of his 10 duels. His coverage of the Anfield turf was comprehensive - tracking 10.9km, which was the furthest clocked by any player on the night.\nHis endeavour in recent weeks has been obvious. Said to have contracted and been hampered by a virus late in 2024, this year, he has found his legs, his touch and the confidence that comes with such improvements.\nNot a Liverpool fan? Find and follow your club here\nAway from the gutsy effort, Szobozslai has added a finishing flourish to his game at the most critical of times.\nOn this page on 17 January, we posted the graph below showing he was the only player in Liverpool's attacking arsenal to be significantly underperforming his expected goals. The powerhouse midfielder should have applied the finish to 4.31 goals and was floundering on just two, with two assists.\nFor clarity, Szobozslai had recorded two goals and two assists in 18 Premier League outings at this point, with the Reds coming off a draw at Nottingham Forest.\nIn the eight league games since, he has scored three times and added a further assist. He also scored in the Carabao Cup semi-final win against Tottenham.\nHe is still underperforming his current xG of 6.6 but the differential has narrowed, with him now on five league goals in total.\nFurthermore, his return to form and presence are key in a critical triangle in Arne Slot's team. On the graphic below, the thicker the line, the more passes a player plays or receives from a team-mate.\nMuch has been made of Trent Alexander-Arnold's superb relationship with Mohamed Salah. Against Newcastle, the pair shared 22 passes.\nWhat perhaps goes underappreciated is how Szobozslai is the third cog in the system. In Wednesday's win, he shared 14 passes with Salah and the same number with Alexander-Arnold, making himself an integral link between two of Liverpool's most creative forces.\nFrom harassing opponents, winning the ball back (only Gravenberch, Alexander-Arnold and Mac Allister have won possession more for Liverpool this season) and adding goals in recent weeks, there can be no doubting Szobozslai's significance.\nThe Kop has already started serenading the league title. Salah will rightly take the plaudits but the marauding Szobozslai has proven a driving force at a pivotal moment.", "url": "https://www.bbc.co.uk/sport/football/articles/cy055w98g02o"}