{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:41:37", "date_modify": "2025-05-21 03:41:37", "date_publish": "2025-02-01 18:08:15", "description": "Ipswich 1-2 Southampton: What Ivan Juric said", "filename": "sport_football_articles_cm21y1v8p1do_1747798897.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0f14/live/b2c0a210-e0c6-11ef-80f0-273d2cd9a9c9.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cm21y1v8p1do_1747798897.html", "title": "Ipswich 1-2 Southampton: What Ivan Juric said", "title_page": "Ipswich 1-2 Southampton: What Ivan Juric said - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Southampton boss Ivan Juric has been speaking to BBC Match of the Day about getting his first win as a Premier League manager: \"It's a great feeling. The guys deserved it because they worked a lot. They played some good games where we lost, but today we won. The character is always there. We will enjoy tonight, that's for sure.\"\nOn holding onto their lead: \"It was really tough because Ipswich played really good but, with the changes and with the pace of Kamaldeen Sulemana, we did some really good things. He is a player that we need, he is direct.\n\"Now we are just waiting for [Tyler] Dibling, and then we will be even better than today.\"\nOn Paul Onuachu's goal: \"I'm sure he can score lots of goals. He has the characteristics and he is really working hard. A great man.\"\nOn whether exceeding Derby's 11-point record is a motivation for his side: \"No, it's a bad motivation. We have won today and I think the team can improve themselves, play good matches and we can do something really special. That is our idea, we have to have good character and improve every game.\"\nOn whether he thinks Southampton can stay up: \"I don't know what will happen. We will see. We will play with heart and passion, that's what I want.\"\nOn Welington and Albert Gronbaek making their debuts: \"I think they gave us a hand. Welington had a really good game, he was very tired because he hadn't played for six months. Albert had some opportunities in the first half with his technique. I think they will give us a big hand.\"", "url": "https://www.bbc.com/sport/football/articles/cm21y1v8p1do"}