{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:28:25", "date_modify": "2025-04-26 07:28:25", "date_publish": "2025-02-27 18:51:41", "description": "Nottingham Forest podcast: Shut Up and Show More Football", "filename": "sport_football_articles_c1lppqqjelgo_1745652505.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5fcb/live/0f046ad0-3aa4-11ef-bbe0-29f79e992ddd.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c1lppqqjelgo_1745652505.html", "title": "Nottingham Forest podcast: Shut Up and Show More Football", "title_page": "Nottingham Forest podcast: Shut Up and Show More Football - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "\"Consistency is going to be key\" for Nottingham Forest securing European football next season, says BBC Radio Nottingham's Colin Fray.\nSpeaking on the latest episode of Shut Up And Show More Football about the tightening race for the European football spots, Fray said: \"Inconsistency is why things are bunching up. It is why Forest are among those teams as well.\n\"They are very inconsistent at the moment and that is why you now have this situation where there are six points between third and 10th. That is going to be a monumental scrap for European places.\n\"Forest have put themselves into a very good place and if they can find some consistency over the remaining 11 games they have got then they may well get European football. But, if they have consistency in the other direction, then they may well miss out on European football because things are so tight.\n\"There are 10 teams there. Now, how many places there are going to be for European football remains to be seen, there might be seven or eight next season, and even if that is the case then there are going to be a couple of teams who miss out.\n\"From Nuno [Espirito Santo] and Nottingham Forest's perspective, consistency starts with keeping clean sheets and that is why Nuno was so happy with getting back to basics and keeping a clean sheet against an injury depleted, but still dangerous, Arsenal.\n\"If they can get some consistency then Europe is still there for them.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c1lppqqjelgo"}