{"authors": ["Nizaar Kinsella", "www.facebook.com"], "date_download": "2025-04-26 06:17:39", "date_modify": "2025-04-26 06:17:39", "date_publish": "2025-03-01 18:25:22", "description": "The Football Association says the record eight-minute VAR stoppage during Bournemouth's FA Cup win against Wolves was caused by a congested penalty area.", "filename": "sport_football_articles_c7vznjl7l4do_1745648259.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/710d/live/a9c2d510-f6bb-11ef-84d4-499fadd0dc53.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c7vznjl7l4do_1745648259.html", "title": "Bournemouth v Wolves: FA Cup VAR check takes record eight minutes", "title_page": "Bournemouth v Wolves: FA Cup VAR check takes record eight minutes - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The Football Association has said the record eight-minute VAR stoppage during Bournemouth's FA Cup fifth-round win against Wolves was caused by a congested penalty area.\nIt came during the first weekend of the semi-automated offside system being trialled in English football, which is supposed to reduce the decision time by 30 seconds in close offside calls.\nThe officials were unable to rely on that technology during the check, and needed to revert to manually drawn lines before disallowing Bournemouth defender Milos Kerkez's 35th-minute goal.\nFellow defender Dean Huijsen was adjudged to have been in an offside position as Kerkez's effort brushed his shoulder.\nBut the stoppage was also extended as the video assistant referee (VAR) pairing Timothy Wood and Darren England made two different checks for handball - including against Huijsen - prior to the tight offside call.\nWolves supporters did not celebrate the decision that benefited their team, and allied with the home supporters by chanting \"it's not football any more\" and \"this is embarrassing\" during the unprecedented stoppage.\nDuring the break in play, referee Sam Barrott explained what was happening to the managers and players, while some on the pitch opted to re-do their warm-up routines.\nThe previous longest VAR check was believed to be five minutes 37 seconds in the Premier League match between West Ham and Aston Villa in March 2024.\nThe FA's explainer of semi-automated offsides said: \"Most offside decisions will be quicker, but VAR will still have the option to draw crosshairs as a back-up if required.\n\"This process may be necessary in 'edge cases' where several players block the view of the ball or other players for the system's cameras. This may occasionally result in the length of check we have seen previously in specific scenarios with VAR checking close offsides.\n\"The length of certain VAR checks may also remain where decisions need to consider multiple offside checks or other offenses such as fouls or handballs in the attacking possession phase.\"\nEx-Arsenal defender Martin Keown said on BBC Match of the Day: \"Clear and obvious? Not at all.\n\"It's outrageous how long it has taken - ridiculous. It's just not on at all.\"\nSemi-automated offsides were meant to have been introduced in the Premier League last year, but that was delayed.\nFriday's FA Cup game between Aston Villa and Cardiff was the first time it was used in English football - and that passed without problem.\nIt is only being used in seven of the eight FA Cup fifth-round ties, because Championship club Preston do not have the correct technology.\nThe Premier League said this week: \"Following successful live operation in the FA Cup, the Premier League will look to implement the system later this season.\"\nSemi-automated offsides are already used in the Champions League, La Liga and Serie A - and were used in the 2022 World Cup.", "url": "https://www.bbc.co.uk/sport/football/articles/c7vznjl7l4do"}