{"authors": ["Kal Sajad", "www.facebook.com"], "date_download": "2025-05-21 05:26:12", "date_modify": "2025-05-21 05:26:12", "date_publish": "2025-01-25 20:58:48", "description": "Briton Ellie Scotney outpoints a tougher-than-expected Mea Motu in a stylish defence of her IBF, WBO and Ring Magazine super-bantamweight titles.", "filename": "sport_boxing_articles_cm271789nepo_1747805172.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/23e0/live/9d003950-db57-11ef-8efb-c79f077c6d5d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_boxing_articles_cm271789nepo_1747805172.html", "title": "Ellie Scotney battles through cut to retain world titles against Mea Motu", "title_page": "Ellie Scotney battles through cut to retain world titles against Mea Motu - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Briton Ellie Scotney outpointed a tougher-than-expected Mea Motu in a stylish defence of her IBF, WBO and Ring Magazine super-bantamweight titles at Nottingham's Motorpoint Arena.\nScotney, 27, was made to work against the New Zealander, who continued to come forward throughout the 10 rounds, but the Londoner's superior skills prevailed.\nThe champion, who suffered a cut after a clash of heads in the first round, won by unanimous decision with all three judges scoring it 99-91.\n\"I'm not too happy with my performance. I feel like I hurt her at times, but she was a tough fighter,\" Scotney said.\nShe extends her unbeaten record to 10 wins, as New Zealander Motu, 35, was defeated for the first time in 21 professional bouts.\nIn the main event, Sheffield light-welterweight Dalton Smith made short work of Walid Ouizza to defend his European title.\nSmith floored the Frenchman twice before the fight was stopped in the final second of the first round.\nThe unbeaten 27-year-old, who is ranked second with the WBC, edged closer to a maiden world-title shot with a 17th straight win.\nIt was far from an easy day at the office, but Scotney proved her worth against a game challenger.\nThe home fighter started well, landing a crunching left hook and a jab to the body in round one, before the head clash in a clinch caused blood to pour down from her left eye.\nScotney's corner went to work on the cut between rounds. Earlier this month, her stablemate Caroline Dubois' world-title defence ended in a technical draw after an accidental clash of heads.\nMotu took the centre of ring and showed strong fundamentals and a willingness to trade, landing an impressive combination in the fourth.\nBut Scotney began to control the contest with her quick feet. The Catford fighter switched attacks from to head and body, before expertly moving out of range.\nTwo body shots, an uppercut and three clean rights landed flush on Motu in the fifth.\n\"Shane, shall I go forward?\", Scotney asker her trainer, Shane McGuigan, before the seventh.\nMotu, vying to become New Zealand's first unified world champion, did not alter her gameplan but Scotney was wise to it.\nShe continued to pick Motu apart in the closing rounds as the two fighters embraced at the final bell.\nPromoters Matchroom are confident Scotney can unify the division the year with wins over WBA champion Nazarena Romero and WBC title-holder Yamileth Mercado. An undisputed title tag will help catapult her to stardom.\nA move up to featherweight to challenge for a world title is Scotney's longer-term plan.\n\"I want to be undisputed, but people have to be willing to fight and people have to be willing to pay,\" she said.\n\"I also know that names is what you need, so I'm looking at featherweight and I'm looking at Skye Nicolson.\"", "url": "https://www.bbc.com/sport/boxing/articles/cm271789nepo"}