{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:53:37", "date_modify": "2025-05-21 05:53:37", "date_publish": "2025-01-23 05:34:19", "description": "Cardiff City: Omer Riza needs more signings - Nathan Blake", "filename": "sport_football_articles_c391xdzrw39o_1747806817.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/69ba/live/f1207530-d8d3-11ef-825e-1905d0cc2231.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c391xdzrw39o_1747806817.html", "title": "Cardiff City: Omer Riza needs more signings", "title_page": "Cardiff City: Omer Riza needs more signings - Nathan Blake - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cardiff City need more new signings to help them move away from the Championship relegation zone, according to former Bluebirds striker Nathan Blake.\nCity's only recruit so far this month is Danish striker Yousef Salech, who scored his first goal for the club on Tuesday to secure a 2-2 draw at Millwall.\nBoss Omer Riza hopes Salech, who signed last week for more than £3m, will help propel Cardiff to Championship safety.\nBut Blake believes more new faces are needed with the club just two points above the relegation zone.\n\"Yes, I think so, I do,\" Blake told Radio Wales Sport.\n\"The Championship is such a long season and such a hard season.\n\"It only takes two or three injures and all of a sudden the subs' bench is looking really bare, and people are saying 'our squad isn't strong enough'.\n\"Don't get me wrong, I don't think you need 30-odd players, but if you've got 25 quality first-team players right from one to 25, I think it's a huge help in a 46-game season.\"\nRiza said earlier this month he wanted to sign \"three or four\" players to improve Cardiff's attack and add more pace before the transfer window closes on 3 February.\nRegardless of whether Cardiff manage to get any more deals done, Blake believes Riza has the ability to guide his team up the table.\nThey are currently 19th after six Championship games without defeat.\n\"I do like the way he's adjusted,\" said Blake.\n\"He's not just decided to play a certain way which is ingrained in him and said 'regardless of results, I'm not going to change, I'll keep going the same way'.\n\"That's a match-up for disaster. You've got to be adaptable, to be able to change.\n\"Leave him to his own devices. Let him do what he's doing. He's got the ability to take them to a higher level. Not the top level, but a higher one than they are at.\"", "url": "https://www.bbc.com/sport/football/articles/c391xdzrw39o"}