{"authors": ["Dan George", "www.facebook.com"], "date_download": "2025-05-21 04:41:32", "date_modify": "2025-05-21 04:41:32", "date_publish": "2025-04-03 08:25:29", "description": "Southampton 1-1 Crystal Palace: Taylor Harwood-Bellis on avoiding Derby's record", "filename": "sport_football_articles_c1jxrz0plydo_1747802492.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0626/live/4b6385a0-1010-11f0-992e-13a2fb1a4046.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c1jxrz0plydo_1747802492.html", "title": "Southampton 1-1 Crystal Palace: Taylor Harwood-Bellis on avoiding Derby's record", "title_page": "Southampton 1-1 Crystal Palace: Taylor Harwood-Bellis on avoiding Derby's record - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Southampton defender Taylor Harwood-Bellis says that talk of trying to not be the worst Premier League side ever is \"embarrassing.\"\nDerby County hold the record for the lowest tally in Premier League history, finishing bottom on 11 points in 2007-08.\nOn Wednesday night, the Saints edged closer to getting over that unwanted record with a draw against Crystal Palace, that takes their total for the season to 10 points.\n\"We just wanna get over it,\" Harwood-Bellis told BBC Radio Solent. \"It pains us to even say that is the case. It's not somewhere we expected to be and it's embarrassing - we're not gonna shy away from that.\n\"We will look to rack up the points and try to put an uplift going into next season, that has to be the main focus.\n\"That's down to our mentality and we'll see who the real characters are going into the final games of the season.\"\nSupporters found plenty to be encouraged about at St Mary's on Wednesday night. Despite the late equaliser by Palace, at the full-time whistle most fans were on their feet applauding the team for their efforts.\nSaints produced some moments of quality in the match and a brilliant move to take the lead in the first half.\nIvan Juric's side will hope to build on this and carry elements of the performance into their final eight league matches.", "url": "https://www.bbc.com/sport/football/articles/c1jxrz0plydo"}