{"authors": ["Jamie Currie", "www.facebook.com"], "date_download": "2025-05-21 06:30:29", "date_modify": "2025-05-21 06:30:29", "date_publish": "2024-12-24 11:00:12", "description": "Rangers fan voice: 'Positive signs as chances flow'", "filename": "sport_articles_c9dp9d7n6ndo_1747809029.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/da43/live/b15c3a00-c15f-11ef-a2ca-e99d0c9a24e3.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c9dp9d7n6ndo_1747809029.html", "title": "'Positive signs as chances flow'", "title_page": "Rangers fan voice: 'Positive signs as chances flow' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The game against Dundee marked 125 years of our magnificent stadium and it was all about how the team responded to last week's cup final debacle.\nI was pleased to hear Nedim Bajrami and Philippe Clement address the non-penalty in their post-match press conferences. This is an issue that shouldn't be overlooked or dismissed as 'white noise.'\nDespite Vaclav Cerny's winner against a stubborn Dundee team - in a game where the VAR protocols were correctly followed - we were quite wasteful in front of goal.\nThat said, we are starting to play some decent football and create chances. In the earlier part of the season, it felt like we struggled to make many opportunities throughout a match.\nIt could have been five or six, especially when we hit the bar four times. It's positive signs and you have to hope the reprehensible cup final decision will light a fire in these players and possibly help the manager to cultivate a siege mentality going forward.\nThings are looking far better when you consider how we looked domestically prior to that Kilmarnock game at the start of the month.\nIt's great to have Hamza Igamane and Danilo along with Cerny, Bajrami and Ianis Hagi and now we will have Oscar Cortes and Rabbi Matondo back on the wings. It makes a marked difference to our attacking play.\nWe will need all those players to be firing over the next four games as we enter a challenging period of the season. However, we have moved into second and clawed back two points on Celtic too.\nSo all in all, it was a decent week for us. Let's hope it continues over the coming games.", "url": "https://www.bbc.com/sport/articles/c9dp9d7n6ndo"}