{"authors": ["Paul Battison", "www.facebook.com"], "date_download": "2025-05-21 04:22:36", "date_modify": "2025-05-21 04:22:36", "date_publish": "2025-02-01 08:25:26", "description": "With Islam Makhachev breaking his close friend, mentor and coach Khabib Nurmagomedov's record for most UFC lightweight title defences, BBC Sport analyses how the pair compare statistically.", "filename": "sport_mixed-martial-arts_articles_czxk0e44q13o_1747801356.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/516f/live/bbb4bcd0-de32-11ef-ac5a-93e8b29ec95c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_mixed-martial-arts_articles_czxk0e44q13o_1747801356.html", "title": "UFC: Khabib Nurmagomedov v Islam Makhachev in stats", "title_page": "UFC: Khabib Nurmagomedov v Islam Makhachev in stats - who will go down as the greatest? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "When Islam Makhachev retained his lightweight title in dominant fashion in January, UFC president Dana White declared him the number one pound-for-pound fighter in the organisation.\nThe 33-year-old's impressive win at UFC 311 over Renato Moicano was his fourth title defence, breaking the record of his close friend, mentor and coach, Khabib Nurmagomedov.\nFormer UFC lightweight champion Nurmagomedov retired undefeated in 2020 with a spotless resume, having won all 29 of his fights.\nThe 36-year-old is considered by many as one of the greatest MMA fighters in history, but is it time Makhachev is considered in the same bracket?\nBBC Sport investigates how the Dagestan pair compare and where their paths differ.\nNurmagomedov was famed for his aggressive wrestling style, taking opponents down before dominating them on the ground.\nHe was so confident when grappling that he would often taunt opponents, with Conor McGregor and Michael Johnson among those feeling the wrath of his words.\nSuch was his dominance on the canvas, just over 85% of Nurmagomedov's total significant strikes targeted the head during his career, with most of them coming from the top position on the ground.\nHis impressive ground game was what set him apart.\nHe is third on the list of most takedowns landed in UFC lightweight history. In addition, he boasts a 48% takedown accuracy.\nMakhachev's takedown accuracy is 54% - but he attempted far fewer takedowns (69) than Nurmagomedov's 129.\nHe outstruck Poirier in their contest, knocked out Alexander Volkanovski with a head kick in 2023 and dropped Charles Oliveira with a right hand the year before.\nWhile Nurmagomedov leaned heavily on his grappling to defeat opponents, Makhachev has more tools to choose from.\nHe heavily favours the head and 57% of his strikes come from a standing position, compared to just 42% of Nurmagomedov's. Just 24% of Makhachev's strikes come from a grounded position - while 54% of Nurmagomedov's are while he is grounded.\nMakhachev has faced criticism from parts of the MMA world for the calibre of opponents he has faced during his title defences.\nAlthough Volkanovski is world class, he moved up from featherweight for both bouts, while Moicano was a last-minute replacement for the injured Arman Tsarukyan and was 10th in the UFC lightweight rankings.\nHe does hold victories over former champion Oliveira and Poirier, however.\nFor Nurmagomedov, the combined record of his opponents at the time of fighting them is 81 wins, 13 losses, one draw and one no-contest, while Makhachev's rivals had 109 wins, 23 losses and two no-contests between them.\nNurmagomedov, meanwhile, has title defences against McGregor, Poirier and Justin Gaethje, but it is the manner in which he won those fights that is impressive.\nHe largely dominated all three before finishing them, while against Gaethje he pre-planned to win via a triangle choke because he wanted to put the American to sleep rather than make him submit, out of respect.\nMakhachev has also said he wants to win a title in another weight class - something Nurmagomedov never did - even suggesting he could become the first triple champion in UFC history.\nIt's up for debate whether Makhachev has already surpassed Nurmagomedov's accomplishments.\nBut while his mentor's MMA career ended at aged 32, Makhachev seems still some way off his final chapter.", "url": "https://www.bbc.com/sport/mixed-martial-arts/articles/czxk0e44q13o"}