{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:59:24", "date_modify": "2025-05-21 03:59:24", "date_publish": "2025-04-07 07:27:15", "description": "Tottenham 3-1 Southampton: Jo Tessem on Southampton's relegation", "filename": "sport_football_articles_cqx49p97qn7o_1747799964.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f568/live/e69db580-131d-11f0-baa2-ad4c14bc23bc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cqx49p97qn7o_1747799964.html", "title": "Tottenham 3-1 Southampton: Jo Tessem on Southampton's relegation", "title_page": "Tottenham 3-1 Southampton: Jo Tessem on Southampton's relegation - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Southampton player Jo Tessem says the fans have been \"incredible\" during a \"really poor season\" which has seen the club set another damning record of suffering the earliest relegation in Premier League history.\nHe praised them for \"still coming and cheering\" despite watching their team lose 25 Premier League games so far this season, with the latest defeat coming against Tottenham.\nSpeaking on BBC Radio Solent's Goin' Home With Adam And Jo podcast, Tessem said: \"They have turned up in every game this season. They have supported and done everything they can to help the team.\n\"It is not down to them that the club has been relegated. If the players had shown the effort the supporters have shown, it probably would have been a different story this season. We could have been in the Champions League next season!\n\"The most difficult problem we have is that we haven't got players good enough for the Premier League. We have to be that honest now, and I think the players need to be that honest with themselves.\n\"The reason we are in this situation is because we aren't good enough to play the football that would allow us to compete in the Premier League - and that is purely down to the players.\n\"We have proven that this season. After sacking Russell Martin, we got Ivan Juric in and the same problem has continued. The problem is the players are not good enough.\"", "url": "https://www.bbc.com/sport/football/articles/cqx49p97qn7o"}