{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:18:07", "date_modify": "2025-05-21 04:18:07", "date_publish": "2025-01-05 19:36:50", "description": "Liverpool 2-2 Man Utd: What Ruben Amorim said", "filename": "sport_football_articles_cy5369w4er0o_1747801087.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a0dd/live/9e82c2b0-cb95-11ef-b5cd-c347d92cca11.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy5369w4er0o_1747801087.html", "title": "Liverpool 2-2 Man Utd: What Ruben Amorim said", "title_page": "Liverpool 2-2 Man Utd: What Ruben Amorim said - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester United manager Ruben Amorim has been speaking to Match of the Day about the result: \"That should be a big issue for our players that even one person thinks you have the ability but not the character. We have to fight that and change that.\n\"I think it is really clear. When we are focused, when we fight for every ball, when we suffer and when we are tired when the game is finished, we are a good team.\n\"If we don't do that all the time, then we are going to lose games. That is clear to everybody.\n\"We controlled the tempo of the game very well. Every time Liverpool had a chance, we controlled and had the ball for a moment. That makes a difference.\n\"You could see in the game that we were not suffering all the time because we controlled the ball, sometimes winning some fouls and controlling the transitions. It was a good game.\"\nOn United's left-hand side: \"They have the players with qualities, and you have to do it how you should do it every game. Dalot is really fast and Bruno is really smart, so we can use them.\"\nOn Harry Maguire: \"For me, missing chances or playing badly with the ball is not the big issue. For me, the big issue is that Harry gave everything on the pitch. That is the most important thing.\"", "url": "https://www.bbc.com/sport/football/articles/cy5369w4er0o"}