{"authors": ["Jack Herrall", "www.facebook.com"], "date_download": "2025-05-21 05:46:59", "date_modify": "2025-05-21 05:46:59", "date_publish": "2025-04-02 12:57:19", "description": "Can Rangers still rely on Jack Butland?", "filename": "sport_articles_c5y4jq1vn7no_1747806419.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/17e2/live/868cf400-0fbf-11f0-a97f-df826be7b03d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c5y4jq1vn7no_1747806419.html", "title": "Can Rangers still rely on Jack Butland?", "title_page": "Can Rangers still rely on Jack Butland? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "After the weekend win over Dundee, Rangers fans on this page voiced discontent with goalkeeper Jack Butland following his latest blunder.\n\"Butland has to go as he makes far too many errors\" and \"Butland proves yet again why he was never good enough\" reflect the sentiment after he gifted Dundee their second goal in Rangers' chaotic 4-3 win.\nJust over a year ago the 32-year-old was in contention for an England recall in recognition of his stellar club displays.\nHowever, Butland's consistency has faltered in his second season at Ibrox and he has developed a propensity for a clanger.\nAgainst Manchester United in January, he inexplicably punched the ball into his own net. In early March, he fumbled it into the path of Motherwell forward Luke Armstrong, then repeated the error against Dundee at the weekend to allow Joe Shaughnessy to profit.\nHis mistakes, though, cannot be highlighted without context. Rangers have struggled domestically this season and even though Barry Ferguson has taken interim charge they have fallen two goals behind in five of their past seven games, amplifying glaring defensive frailties.\nThat does not make Butland immune from criticism. Opta stats show that he has made the joint most errors (four) leading to a goal in the Premiership this season.\nHe ranks just fifth in save percentage (67.9) and while he is second for clean sheets (10), Celtic's Kasper Schmeichel has almost double that tally with 19.\nButland concedes a top-flight goal every 86.5 minutes this campaign, while Schmeichel only lets one in every 135.\nMight Rangers, who are set for new ownership and new management this summer, be on the lookout for a new goalkeeper too?\nOr perhaps should Scotland cap Liam Kelly, who is waiting for a chance to impress, be handed the chance to prove he can step up from understudy?", "url": "https://www.bbc.com/sport/articles/c5y4jq1vn7no"}