{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:45:12", "date_modify": "2025-05-20 13:45:12", "date_publish": "2023-07-25 18:40:38", "description": "Manchester United: 'It's about making a stand for something we love'", "filename": "sport_articles_cz4yrvpn807o_1747748712.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c2e2/live/c5e104b0-2b15-11ee-b1d7-8fdc93c2782e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cz4yrvpn807o_1747748712.html", "title": "'It's about making a stand for something we love'", "title_page": "Manchester United: 'It's about making a stand for something we love' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "On the latest episode of the How To Buy A Football Club podcast, two anonymous representatives from Manchester United supporter group The 1958 discuss why they want the Glazer family out: \"We won't stand back and watch the club we love rot away to nothing.\n\"[The Glazers] have had their time, they've had 18 years. They took a club that was cash rich and ladened it with debt. That debt is still the same after 18 years after taking dividends from that club, after paying extortionate amounts of interest on those loans and we've gone from having some of the best facilities in the world of football – the stadium and training facilities – to probably struggling to be in the top 10 now.\n\"It's about making a stand for something we love, for the family, friends and memories that come flooding back when we head into that ground. It's personal and real for us in The 1958 and for many United fans, it's community, it's family, it's friendships and they're not just betraying the club we love, they're also betraying those memories of past generations who instilled the club into us.\"\nAsked about their preference for the outcome of the sale process, the group just hope to have no Glazer involvement: \"United are a big club, we deserve to be treated as such as well.\n\"Our preference is the Glazers go. We're not naive enough to think that we can influence a multi-billion pound deal for who buys the club. Anyone who thinks they can are living on a different planet. We will deal with whatever comes next, whoever the next owners will be.\n\"We don't want to protest, we'd rather just go back to supporting the club.\"", "url": "https://www.bbc.com/sport/articles/cz4yrvpn807o"}