{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 08:00:06", "date_modify": "2025-05-21 08:00:06", "date_publish": "2025-05-19 17:45:44", "description": "Durham chase a small target of 91 to beat leaders Nottinghamshire by seven wickets in Division One of the County Championship.", "filename": "sport_cricket_articles_c23m01d218zo_1747814406.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c0cf/live/142bab50-34d5-11f0-a7d6-116e90b77ae3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c23m01d218zo_1747814406.html", "title": "County Championship: Durham chase 91 to beat Nottinghamshire", "title_page": "County Championship: Durham chase 91 to beat Nottinghamshire - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "An excellent team bowling effort and a vital fifty from Colin Ackermann helped Durham pick up a seven-wicket win against Nottinghamshire in the County Championship, despite a brilliant century from Joe Clarke.\nIt was Durham's morning as the hosts picked up three of the nine wickets they needed including the vital scalp of Ben Slater, who made 74, which was his second half-century of the match.\nHowever, Clarke counter-attacked either side of lunch and managed to take his side into the lead before notching up his first hundred of the season.\nThere was a late twist though as Durham's bowling attack, led excellently by Ben Raine, roared back after tea and picked up five wickets to bowl Nottinghamshire out for 347.\nDurham had 18 overs to get the 91 runs needed for the win and the chase got off to a dramatic start as the hosts lost two wickets at the hands of Mohammad Abbas, but the experienced head of Ackermann saw them home.\nThe win sees Durham move up to fourth in Division One and are just 16 points behind their opponents at the top of a congested table, while Surrey are now breathing down Nottinghamshire's neck, as the gap at the top is just three points heading into the final game of the current block of fixtures.\nSlater and nightwatcher Rob Lord resumed on 67-1, still 190 behind Durham, and their aim was to bat out the day in order to keep their unbeaten record intact.\nDurham got their much-needed ealy wicket as they got Lord for 15 as he edged a James Minto ball straight to Ben McKinney in the slips. The hosts got their third soon after as Brydon Carse bowled Freddie McCann for six with one that clipped the off-stump.\nSlater remained at the crease and he passed fifty for the second time in the match from 69 balls. He then utilised the pace of Carse as he carved one to the boundary.\nThe Nottinghamshire opener continued to play nicely, but he was the next man to fall as he was caught behind from a Codi Yusuf delivery for a well-made 74.\nClarke was joined in the middle by Jack Haynes and the former looked good as he smashed a Raine delivery to the offside boundary.\nClarke then continued to take chunks out of the hosts' lead with a lovely shot for four past third man region just before lunch.\nClarke and Haynes combined for a fifty partnership and the former passed fifty for the first time this season from a rapid 58 balls.\nHaynes was very much a foil for Clarke's aggression, but he departed for 24 as George Drissell got him lbw to leave Clarke needing a bit of a hand. He was very nearly out himself as a short ball from Carse was hooked towards fine leg, but Yusuf failed to take the catch with the Nottinghamshire man on 61.\nSouth Africa wicketkeeper Kyle Verreynne produced a delightful drive through the covers for four, which took his side into the lead.\nDurham's chances of a win were seemingly slipping away as Verryenne continued to be positive, while Clarke looked composed.\nHowever they got a much-needed breakthrough, as Verreynne, who had looked comfortable, was then caught behind from the first ball after tea as Drissell coaxed an edge from the South African who had to depart for 38.\nClarke then reached his 25th first-class century from 140 balls, but another wicket fell as Lyndon James was caught behind off the bowling of Ackermann for a duck.\nDurham's excellent session continued as Raine bowled Liam Patterson-White for three and he then struck again to bowl Brett Hutton for a duck.\nClarke's excellent knock of 119 ended as he chopped on from a Yusuf delivery, setting Durham a target of 91 from 18 overs.\nThere was more drama though, as McKinney was bowled by Abbas for a first ball duck and Emilio Gay was caught behind from the same bowler. Hutton built the pressure with a series of dots, but Ackermann plundered an Abbas ball to the boundary.\nThe Netherlands international then clubbed an Abbas ball to the boundary to take his side within 50 and he followed that up with a lovely cover drive for four from a Patterson-White ball.\nAckermann, who passed fifty, took Durham to their target, with Carse hitting the winning runs with 10 balls to spare.", "url": "https://www.bbc.com/sport/cricket/articles/c23m01d218zo"}