{"authors": ["Scott McCarthy", "www.facebook.com"], "date_download": "2025-05-21 06:06:25", "date_modify": "2025-05-21 06:06:25", "date_publish": "2024-12-24 15:36:30", "description": "Brighton news: Opinion - fan's moment of the year", "filename": "sport_football_articles_cn8g326dnxvo_1747807585.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8a79/live/45186dc0-b628-11ee-8f07-bbfdfa890097.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cn8g326dnxvo_1747807585.html", "title": "Opinion - fan's moment of the year - BBC Sport", "title_page": "Brighton news: Opinion - fan's moment of the year - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It has been a weird 2024 for Brighton. The year began with Albion fans wondering where Roberto de Zerbi might lead the club in Premier League, FA Cup and Europa League. A first major piece of silverware did not seem out of the question. De Zerbi dared us to dream.\nBut then it all went sour. Tony Bloom divorced De Zerbi. Bloom soon got over it by spending £193m in a single transfer window. All those shiny new toys were given to a 31-year-old from Germany, who used them to defeat Manchester United, Spurs and Manchester City but failed to beat Ipswich, Wolves, Southampton, Leicester and Crystal Palace.\nAnd it is Palace who provide my Brighton highlight of 2024 from their visit to the Amex back in February which, admittedly, now feels like a lifetime ago.\nAlbion fans had long been saying that Seagulls were light years ahead of Eagles in every department - stadium, training ground, vision, manager, owner and ultimately reaching Europe before Palace. Have you ever seen the Palace in the 'Dam? No you have not.\nTo really prove it though, Brighton needed to beat their rivals convincingly on the pitch. De Zerbi delivered with a thumping 4-1 victory, the biggest the Albion have managed over their rivals in my lifetime.\nThe game was done inside 45 minutes. Brighton led 3-0 going into the break, sparking the glorious scene of Palace fans walking out to leave a half-empty away end with another half of football still to be played.\nThose Eagles who remained until the bitter end then got in a heated argument with their players at full time while Albion fans partied. Some way to celebrate Dry January being over, let me tell you.\nIt was the perfect day. Just don't mention the fact Palace ended the season above us. Or what happened the other week on their return to the Amex.", "url": "https://www.bbc.com/sport/football/articles/cn8g326dnxvo"}