{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:50:51", "date_modify": "2025-05-20 14:50:51", "date_publish": "2023-07-25 18:12:12", "description": "Jersey beat Germany by 51 runs after having their hopes of reaching the men's 2024 T20 World Cup ended earlier on Tuesday.", "filename": "sport_cricket_66302931_1747752651.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/BFA5/production/_130516094_t20qual_ger-v-jer_ij230725_018.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66302931_1747752651.html", "title": "T20 World Cup Europe Qualifier: Jersey beat Germany but 2024 T20 World Cup hopes over", "title_page": "T20 World Cup Europe Qualifier: Jersey beat Germany but 2024 T20 World Cup hopes over - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jersey beat Germany by 51 runs after having their hopes of reaching the men's 2024 T20 World Cup ended earlier on Tuesday by Scotland's victory.\nOpener Nick Greenwood hit an unbeaten 86 off 56 balls to become Jersey's top run-scorer in the format and help his side post 190-5 from their 20 overs.\nJonty Jenner added 46 off 24 balls in what was the islanders' highest-ever score in a T20 International.\nGermany were restricted to 139-8 as Julius Sumerauer took 4-22.\nScotland's win over Austria meant Jersey went into the game in Edinburgh knowing that they were unable to finish in the top two in the Europe Qualifier and reach next year's final tournament, which will be held in the West Indies and the United States.\nGermany bowled after winning the toss and, following an opening stand of 36 with Harrison Carlyon, Greenwood helped put on 76 runs for the second wicket before Jenner sent an attempted reverse sweep straight to point.\nGreenwood guided Jersey to a hugely competitive total, with his knock including 10 fours and a six. The 23-year-old's score was the second highest in Jersey's T20I history.\nGermany were 29-3 at the end of the Powerplay and continued to drop behind the required rate while losing wickets at regular intervals, and Jersey comfortably wrapped up their second win of the competition in Scotland.\nJersey's first victory had come in their opener against Austria, but that result was followed by defeats by hosts Scotland, Italy and Ireland.\nThe islanders finish off their campaign against Denmark on Friday.", "url": "https://www.bbc.com/sport/cricket/66302931"}