{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:34:53", "date_modify": "2025-05-20 14:34:53", "date_publish": "2023-07-26 09:34:21", "description": "St Mirren sell Declan Gallagher to Dundee United and replace him with former Plymouth Argyle defender James Bolton.", "filename": "sport_football_66312299_1747751693.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/345A/production/_130520431_gallagher.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66312299_1747751693.html", "title": "St Mirren: Declan Gallagher sold to Dundee United and replaced with James Bolton", "title_page": "St Mirren: Declan Gallagher sold to Dundee United and replaced with James Bolton - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "St Mirren have sold Scotland capped centre-half Declan Gallagher to Dundee United and replaced him with former Plymouth Argyle defender James Bolton.\nThe Paisley club agreed \"a conditional fee\" for 32-year-old Gallagher, who played 32 times for the Premiership side last season.\nSt Mirren manager Stephen Robinson said he could not guarantee the former Dundee player a starting place.\nHe said 28-year-old Bolton's versatility would be an asset.\nStaffordshire-born Bolton, who can also play right-back and joined Plymouth from Portsmouth in 2021, was freed by Argyle after only making eight appearances last season for the side that won the League One title.\n\"I've known him from down in England in his time at Shrewsbury, Portsmouth and Plymouth,\" Robinson told his club website. \"He'll bring a vast amount of experience and he's a very good defender.\n\"He gives us another option in there and adds to our numbers with Declan leaving. This was the reason we allowed this to happen because we knew we had someone else coming in.\"\nGallagher, capped nine times for Scotland, joined St Mirren from Aberdeen last summer.\nHe started their opening Viaplay Cup defeat by Montrose this season, was a substitute in their win over Arbroath but was not involved on Tuesday against Cowdenbeath.\n\"Declan had an opportunity arise to move to Dundee United and he's from Dundee, so it's something that works well for him,\" Robinson said.\n\"He hasn't played as much as he wanted to since the World Cup and we couldn't guarantee him those minutes. I've worked with Declan for a long time and I couldn't deny him the opportunity to move closer to home with his family and the chance to get more game time.\"\nGoodwin said strengthening the right side of his defence was a priority and described Gallagher's arrival as \"a great coup\" for the club relegated to the Championship.\n\"When we heard about Declan's availability, it was a no-brainer,\" he told his club website.\n\"He's a very experienced defender who has played the majority of his career in the top flight and was involved with the national team recently.\"", "url": "https://www.bbc.com/sport/football/66312299"}