{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:50:24", "date_modify": "2025-05-21 05:50:24", "date_publish": "2025-04-02 10:19:38", "description": "How should SPFL go about shaking up Scottish Premiership?", "filename": "sport_articles_c2lz9djnn99o_1747806624.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2e0f/live/759affa0-0fa8-11f0-ba4a-e504e2ac19f8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c2lz9djnn99o_1747806624.html", "title": "How should SPFL go about shaking up Scottish Premiership?", "title_page": "How should SPFL go about shaking up Scottish Premiership? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Is the Scottish Premiership in need of a shake-up? If so, how do you go about it?\nNews emerged on Tuesday that the SPFL is considering changing Scotland's top flight to a 10, 14 or 16-team division in an attempt to help reduce fixture congestion.\nIn its current 12-team form, the clubs split into a top and bottom six after 33 rounds of matches, with 38 rounds played altogether.\nThat format has been in place since 2000-01 and retaining that model is also an option, but reports have also suggested the split could be scrapped.\nFor any fresh structure to pass, it needs the backing of 11 of the 12 Premiership clubs, and eight out of 10 from the Championship plus 75% of League One and League Two combined.\nAnd judging by the fan reaction to the mere thought of reducing the league to a 10-team division, you would have to assume that idea is already unlikely.\nSpeaking on the BBC's Scottish Football Podcast, former Premiership players Cammy Bell and Cillian Sheridan provided their views on a potential restructure.\nExpansion is the only option for former Rangers and Kilmarnock goalkeeper Bell, while ex-Celtic striker Sheridan would like to see the split retained.\n\"I think we need a little bit of freshness about our game,\" Bell said. \"So, if we can expand that league, then absolutely do it. We've got big enough clubs now that can generate good crowds.\n\"We're at a time just now where we've got the potential of trying to change it and certainly for me it's got to be expansion.\"\n\"The split works now,\" Sheridan added. \"When I first came over and saw the whole split thing, I just never really got it. But in the past few years it has been quite interesting.\n\"If the league is wrapped up, if relegation is wrapped up, it does add a little bit of excitement to things in terms of teams getting into the top six and having to get European football.\"", "url": "https://www.bbc.com/sport/articles/c2lz9djnn99o"}