{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:33:41", "date_modify": "2025-05-21 07:33:41", "date_publish": "2024-12-23 21:24:32", "description": "The agent of Chelsea forward Christopher Nkunku has offered the Frenchman to Barcelona, Ruben Amorim is under no pressure to pick Marcus Rashford for Manchester United, plus more.", "filename": "sport_football_articles_cdek68z2wy3o_1747812821.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9906/live/4fabc2a0-c16c-11ef-a2ca-e99d0c9a24e3.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cdek68z2wy3o_1747812821.html", "title": "Football gossip: Nkunku, Rashford, Tonali, Gittens, Retegui", "title_page": "Football gossip: Nkunku, Rashford, Tonali, Gittens, Retegui - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Chelsea forward Christopher Nkunku has been offered to Barcelona by his agent, Ruben Amorim is under no pressure to pick Marcus Rashford for Manchester United, Newcastle could be forced to accept summer offers for Sandro Tonali.\nThe agent of Chelsea forward Christopher Nkunku has offered the services of the 22-year-old Frenchman to Spanish giants Barcelona. (Sport - in Spanish), external\nManchester United's Portuguese boss Ruben Amorim is under no pressure to pick England forward Marcus Rashford, 27, even if his continued absence could weaken their negotiating position over a January sale. (ESPN), external\nManchester United are interested in bringing in 25-year-old Nigeria striker Victor Osimhen, who is on loan at Galatasaray from Napoli, to the club in January. (Sky Sports Switzerland, via Manchester Evening News), external\nNewcastle United could reluctantly consider offers for Italy midfielder Sandro Tonali, 24, next summer to meet profit and sustainability rules, with Juventus interested. (Football Insider), external\nBayern Munich are considering a shock Bundesliga move for Borussia Dortmund's 20-year-old English winger Jamie Gittens. (Sky Germany), external", "url": "https://www.bbc.com/sport/football/articles/cdek68z2wy3o"}