{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:45:30", "date_modify": "2025-04-26 06:45:30", "date_publish": "2025-03-01 15:23:27", "description": "A goalkeeper holding the ball for more than eight seconds will be punished with a corner for the opposition from this summer.", "filename": "sport_football_articles_ceqjr1n27dgo_1745649930.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2e5d/live/11a21090-f6d7-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_ceqjr1n27dgo_1745649930.html", "title": "Eight-second law: New law to tackle goalkeeper time-wasting introduced", "title_page": "Eight-second law: New law to tackle goalkeeper time-wasting introduced  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A goalkeeper holding the ball for more than eight seconds will be punished with a corner for the opposition from this summer.\nThe new law was unanimously approved by the International Football Association Board (Ifab) at its annual general meeting in Northern Ireland on Saturday, and will be in place at Fifa's Club World Cup, which takes place in the USA from 15 June to 13 July.\nUnder the current law keepers should be punished if they hold the ball for more than six seconds, with the opposition being awarded an indirect free-kick.\nBut the CEO of the Football Association of Wales (FAW) Noel Mooney said implementation of the six-second rule had \"dissolved over time\" and it is hoped that the new law will lead to a reduction in time wasting.\nAlready trialled in over 400 games in three different competitions, including the Premier League 2, referees will also warn the goalkeepers with a five-second countdown before they are penalised.\nFifa secretary general Mattias Grafstrom said: \"We had the test and the test was very successful. The referees didn't have to signal for a corner [often].\"\nThe Ifab also voted to continue offside trials in which the attacker will be ruled onside if his torso is level with the second to last defender.", "url": "https://www.bbc.co.uk/sport/football/articles/ceqjr1n27dgo"}