{"authors": ["Sean Kearns", "www.facebook.com"], "date_download": "2025-05-21 06:12:59", "date_modify": "2025-05-21 06:12:59", "date_publish": "2025-04-01 12:20:19", "description": "Red Bull team principal Christian Horner tasks Yuki Tsunoda with \"getting as close as possible\" to Max Verstappen.", "filename": "sport_formula1_articles_c62x5dnvlzdo_1747807979.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d5dd/live/41411790-0f84-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_formula1_articles_c62x5dnvlzdo_1747807979.html", "title": "Yuki Tsunoda asked to 'get as close as possible' to Max Verstappen by Red Bull", "title_page": "Yuki Tsunoda asked to 'get as close as possible' to Max Verstappen by Red Bull - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Red Bull team principal Christian Horner has set Yuki Tsunoda one simple target - get as \"close as possible\" to Max Verstappen.\nThe 24-year-old was announced as Liam Lawson's replacement last week, after the New Zealander was dropped just two races into the season.\nTsunoda partners four-time world champion Verstappen for the first time this weekend, when the Japanese driver races in front of a home crowd at Suzuka.\nWith Red Bull third in the constructors' championship after two races, Tsunoda says Horner has tasked him with finishing as close as possible to Dutchman Verstappen to aid the team's cause.\nVerstappen is second in the drivers' championship, eight points behind leader Lando Norris of McLaren.\n\"In the end Red Bull Racing are focused on Max scoring a drivers' championship,\" Tsunoda told BBC Radio 5 Live.\n\"He has proven himself to have good potential to be a world champion - even though Red Bull seems to be struggling a little now.\n\"Performance-wise [Horner] wants me to be as close to Max as possible.\n\"In some races I can help with the strategy but he also promised me in some situations that if I'm able to be in front of Max that he wouldn't necessarily ask me to swap positions and make Max win.\"\nLawson was promoted from Red Bull's second team for the 2025 season but has been sent back to Racing Bulls after struggling in the Australian and Chinese Grands Prix.\nLawson qualified 18th at the season-opening event in Melbourne and crashed out of the race. In China, he qualified last for both the sprint and the main grand prix, finishing 14th and 12th.\nVerstappen appeared to disagree with Lawson's demotion by 'liking' an Instagram post, external from former F1 driver Giedo van der Garde that described it as a \"panic move\".\nTsunoda, who had previously been with Red Bull's second team since making his F1 debut in 2021, said he was yet to speak to Verstappen since replacing Lawson.\n\"I mentioned in the past quite a while ago but he's a bit different from how he behaves in the car and outside of the car,\" said Tsunoda.\n\"I'm not really worrying about the relationship we're going to have in both sides. I know what I want to do and probably how he drives and how he thinks.\"\nLooking ahead to his home grand prix on Sunday, Tsunoda said he will be satisfied if he can finish in the top 10.\n\"Obviously I want to say points or a podium or whatever,\" said Tsunoda.\n\"But at the same time, realistically, you think about jumping into the new car straight away with limited sessions, that's pretty tough.\n\"I think what I can say for now is if I can score points - top 10 - I'll be happy.\"\nThe full Tsunoda interview will air on 5 Live Formula 1 on Thursday at 20:00 BST", "url": "https://www.bbc.com/sport/formula1/articles/c62x5dnvlzdo"}