{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:54:49", "date_modify": "2025-05-20 12:54:49", "date_publish": "2023-08-01 12:19:51", "description": "Cambridge United boost their forward options by signing Elias Kachunga, following his release by Bolton.", "filename": "sport_football_66371776_1747745689.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/128E/production/_130605740_kachunga5-2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66371776_1747745689.html", "title": "Elias Kachunga: Cambridge United sign former Bolton Wanderers forward", "title_page": "Elias Kachunga: Cambridge United sign former Bolton Wanderers forward - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cambridge United have signed forward Elias Kachunga on a one-year contract following his release by Bolton.\nThe 31-year-old is the sixth summer signing by the U's, who staved off relegation to League Two on the final day of last season.\nKachunga scored four goals in 50 games for Bolton in 2022-23, including one in their EFL Trophy final triumph.\n\"He is a player of excellent pedigree who has played a lot of football at a higher level,\" said boss Mark Bonner.\n\"He will complement our existing options in the attacking area of the pitch and can play anywhere across the front line.\n\"We have received nothing but positive character references in our work to sign Elias and once we get him up to speed, I have no doubt he will play a big role in helping us achieve our objectives this season.\"\nKachunga was born in Germany and began his career at Borussia Monchengladbach.\nHe first came to England in 2016 to join Huddersfield Town, initially on loan, and spent two seasons in the Premier League with the Yorkshire club.\nThe former Germany youth international was called up by the Democratic Republic of Congo in 2017, winning his sole senior cap in a friendly against Kenya that March.", "url": "https://www.bbc.com/sport/football/66371776"}