{"authors": ["Gary Rose", "www.facebook.com"], "date_download": "2025-05-20 12:01:52", "date_modify": "2025-05-20 12:01:52", "date_publish": "2023-08-05 14:46:52", "description": "Arsenal give their hopes of beating Manchester City to the Premier League title a psychological boost by winning the Community Shield on penalties.", "filename": "sport_football_66352143_1747742512.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/AB97/production/_130672934_arsenalwincommunityshield.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66352143_1747742512.html", "title": "Arsenal 1-1 Manchester City (4-1 on pens): Gunners win shootout to secure Community Shield", "title_page": "Arsenal 1-1 Manchester City (4-1 on pens): Gunners win shootout to secure Community Shield - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Arsenal gave their hopes of beating Manchester City to the Premier League title a psychological boost as they defeated Pep Guardiola's side on penalties to win the Community Shield.\nAfter a largely forgettable 70 minutes in the season curtain-raiser, Cole Palmer looked to have won it for City when the substitute curled home a stunning strike.\nBut Leandro Trossard equalised in the 101st minute when his shot deflected into the back of the net.\nThat took the game to spot-kicks, where substitute Kevin de Bruyne struck the crossbar before Rodri saw his effort saved and then Fabio Vieira converted to secure the silverware for Arsenal.\nArsenal led the Premier League for 248 days last season but their challenge fell apart in the closing stages as City overtook them to claim the title as part of a Treble, along with the Champions League and FA Cup.\nGunners boss Mikel Arteta admitted in the build-up to this game that the end of last season still hurt, and was clearly desperate to get one over City, who beat his side home and away last season.\nArsenal's big summer signings Declan Rice, Kai Havertz and Jurrien Timber were all handed their competitive debuts at Wembley, but it looked like it was going to be a familiar story as Havertz failed to convert two big opportunities in the first half, before Palmer's stunner put City ahead.\nBut Arteta's side showed impressive spirit to battle to the end and got their reward when substitute Trossard struck before keeping their cool to come out on top in the shootout.\nFew people put great stock in a Community Shield win and history tells us that it does not often lead to a Premier League title win - only once since 2011 has the winning side gone on to secure the league title.\nBut that will not concern Arsenal for now as they revel in a positive result after such a disappointing end to last season.\nGuardiola said in the build up to this game that Arsenal's transfer business in the summer has moved them to another level, and while neither Rice or Havertz particularly excelled, there is little doubt their arrival has strengthened the core of Arteta's team.\nThe Gunners lost 4-1 and 3-1 in the Premier League to City last season but this was a much closer affair with Arsenal having the better chances of a cagey first half, but Havertz was twice denied from close range by Stefan Ortega.\nWhile the pressure of a title race is nowhere near the same of a Community Shield match, it will still have been encouraging for Arteta to see his side battle back after going behind, particularly after the manner of their capitulation towards the end of last season.", "url": "https://www.bbc.com/sport/football/66352143"}