{"authors": ["Matthew Henry", "www.facebook.com"], "date_download": "2025-05-20 14:45:29", "date_modify": "2025-05-20 14:45:29", "date_publish": "2023-07-27 19:19:57", "description": "Harry Brook could have a similar impact for England as Kevin Pietersen, says former captain Michael Vaughan.", "filename": "sport_cricket_66315377_1747752329.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/B8FB/production/_130555374_brook.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66315377_1747752329.html", "title": "Ashes 2023: Harry Brook could have same impact as Kevin Pietersen - Michael Vaughan", "title_page": "Ashes 2023: Harry Brook could have same impact as Kevin Pietersen - Michael Vaughan - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Harry Brook could have a similar impact for England as Kevin Pietersen, says former captain Michael Vaughan.\nBrook, who made his Test debut less than 12 months ago, scored 85 on day one of the fifth Ashes Test to help England to 283 against Australia.\nThe 24-year-old's attacking style has often been compared to Pietersen, who scored 23 hundreds in 104 Tests between 2005 and 2014.\n\"He's a real talent, he's right up there,\" Vaughan said.\n\"He's just got that ability to put really good bowlers under pressure.\"\nAustralia, who have already retained the Ashes, reached 61-1 in reply to England to take the better of the opening day, as the tourists look to seal a 3-1 series victory at The Oval.\nBrook came in at 73-3 and was dropped on five by wicketkeeper Alex Carey, but went on to hit 11 fours and two sixes in his 91 balls - his fourth half-century in his debut Ashes series.\nIn a stunning start to his Test career, the Yorkshireman, also part of the England squad that won the T20 World Cup last autumn, had scored more runs after nine innings than any player in Test history, and he has now scored 1,174 runs after 19 knocks.\n\"Pietersen, for me, was England's best in the middle of the innings against all of the quality bowlers around the world,\" said Vaughan, who was captain when Pietersen made his Test debut in the 2005 Ashes.\n\"Around the generation I played, Glenn [McGrath], Warney [Shane Warne], Murali [Muttiah Muralitharan], Dale Steyn, Harbhajan Singh, Anil Kumble, all of the quality bowlers of that era, Kevin Pietersen dealt with.\n\"At times they got him as well, but he dealt with them, and I'm looking at Harry Brook in a similar kind of way.\n\"He's just a very straightforward lad. He just sees the ball and tries to score off it. I don't think he over-complicates life.\n\"He's a great guy to have in the dressing room. I think he's very humorous and I believe he comes out with some gems.\"", "url": "https://www.bbc.com/sport/cricket/66315377"}