{"authors": ["Emma Sanders", "www.facebook.com"], "date_download": "2025-05-21 04:04:13", "date_modify": "2025-05-21 04:04:13", "date_publish": "2025-04-04 06:00:24", "description": "A number of high-profile injuries have occurred in women's football in recent years. BBC Sport looks at whether the type of pitches they play on could be a contributing factor.", "filename": "sport_football_articles_c5yg3y0v17jo_1747800253.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/84e7/live/af5154b0-10c5-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c5yg3y0v17jo_1747800253.html", "title": "Football injuries: Do pitch surfaces contribute to female footballer injuries?", "title_page": "Football injuries: Do pitch surfaces contribute to female footballer injuries? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A number of high-profile injuries have occurred in women's football in recent years - but could the type of pitches they play on be a contributing factor?\nThat is a question Brighton chief executive officer Paul Barber asked last week and he welcomed research into his theory.\nThe Seagulls hope to build a new purpose-built stadium for the women's team by 2027-28 and are exploring all scientific research to make facilities the best.\nThat includes finding out whether pitch surfaces designed for male athletes are adequate for females. If not, what is the best solution?\nMost top-tier football pitches are now hybrid, which means they are essentially a synthetic mat through which real grass can grow.\nThese pitches feel like natural grass but can be regrown each year. They are also hard-wearing, which means they can be drained and recovered to play football on.\nHowever, most of these pitches - which are used predominantly in the men's Premier League - are made up of 95% sand and 4-5% polyethylene fibres to help reduce waterlogging.\nWomen's Super League teams use a variety of grounds across the season but all pitches meet the minimum elite standards required by the league licence.\nBrighton's Broadfield Stadium is one of the only natural grass surfaces in the WSL, with most clubs playing on a hybrid pitch.\nArsenal, Aston Villa and Leicester City use their male counterparts' stadiums as their main home pitch, as well as occasionally playing at secondary grounds.\nWest Ham were the only WSL club not to play a match at their men's team stadium last season.\nThe Bescot Stadium - home of League Two Walsall FC - is used for Villa's matches in the Women's League Cup and FA Cup and was recently renovated.\nCrystal Palace, who earned promotion from the Women's Championship, play the majority of their matches on the VBS Community Stadium and the pitch was replaced with a new hybrid surface this season.\nAnd Leicester City's second pitch - Burton Albion's Pirelli Stadium - is an artificial grass pitch and is only used when there are scheduling clashes.\nWhile little research has been carried out regarding pitches for female athletes specifically, plenty of data has been gathered in football generally.\nEverything from traction, the hardness of the surface, how high the ball bounces, how far the ball rolls and shock absorption have been looked into.\nNeil Rodger, the principal consultant at STRI Group - a company working in the development of sports surfaces - admitted more research was needed to see if there was any link to increased injury risk in female footballers and certain pitches.\n\"It's never been broken down into men's football and women's football. We've always just designed football pitches,\" he told BBC Sport.\n\"When you think about injuries in the men's or women's game, there are so many factors that contribute - the training load, sleep, physiology, hormones...\n\"The pitch is a factor, it's in the mix. Historically, in the women's and men's game, there have been unsafe pitches. In the modern game, that's not really the case.\n\"Particularly in the Premier League, the pitch quality is exceptional and the grounds teams are very good. There's more research needed to see if there is any link.\"\nRodger said it was unknown if there was \"a very subtle difference between what is optimal for the men's game and what is for the women's game\", but the volume of matches played in shared stadiums was no doubt a contributing factor in reducing the quality of surfaces.\n\"Arsenal Women play a lot of matches at the Emirates and the grounds team will prepare the pitch to the exact same high standard as they would for the men,\" he added.\n\"But whether it's men's or women's, the more games you play on a pitch, the more wear and tear it takes and the more the quality of the pitch is going to be impacted.\n\"More usage means more maintenance needed. That is a factor.\"\nHaving coached in the Women's Super League and on the international stage, West Ham boss Rehanne Skinner has experienced a number of pitch surfaces.\nBut she believed it was not the type of surface, but how you manage the quality of the pitches which was the most important factor to consider.\n\"It's got to be about investment into the quality of the pitch or how you manage stadiums independently to reduce the volume of games on them,\" added Skinner.\n\"We groundshare in a lot of instances and that means the pitches take a lot - TV masks some of it. When you're actually standing on them, they look very different.\n\"I think the bottom line is, it is down to the volume of games on the pitch. That definitely needs to be something that's addressed.\"\nFormer Chelsea and England defender Claire Rafferty suffered anterior cruciate ligament (ACL) injuries in her career - and believed the pitch was a contributing factor.\nWhile the 36-year-old admitted it was not something she thought about while playing, Rafferty said the idea that the pitches male players currently play on may not be optimal for women was an \"interesting concept\".\n\"The only limitation is we're trying to improve the standard of the game in general, so do we increase barriers to entry if we have women-only pitches?\" Rafferty told BBC Sport.\n\"When we're looking at grassroots, are we limiting access? Yes, there needs to be research, but there is that argument too.\n\"My ideal pitch would be a grass pitch. If we get into the details of the grass length, that can have an impact as well.\n\"If the grass is too long, then you're at risk of the boots getting stuck and non-contact injuries. But if it's too short and dry then you don't have that balance there.\"\nFormer Scotland and Arsenal defender Jen Beattie said there were \"so many different factors\" that could contribute to injury, but playing surfaces should not be the primary focus.\nThree major names, Vivianne Miedema, Beth Mead and Leah Williamson, suffered ACL injuries while playing for the Gunners, and Chelsea striker Sam Kerr is not expected back until April 2025 after being sidelined since January 2024.\n\"It's hard to pinpoint one thing and I think separating men and women and playing on different pitches just makes the games go even further apart rather than looking at other things that I think are more important,\" Beattie told BBC Radio 5 Live.\n\"If we're talking about ACLs, that comes from more conditioning and physicality. There needs to be more research into women's health because we are just different.\n\"That's a proven fact. The priority needs to be looking at that rather than playing on different pitches. I've no idea how logistically that would work.\"\nA number of clubs now track players' menstrual cycles following recent studies linking periods to ACL injuries.\nThere has also been research carried out by organisations such as the European Club Association (ECA) on how varying footwear can contribute to injury risk.\n\"I think there needs to be more research specifically for women,\" said ex-England striker Ellen White, who suffered an ACL injury during her career.\n\"Women are built slightly differently with childbearing hips, or you are on your period, so your ligaments are slightly looser.\n\"But I feel there needs to be more research into exactly why certain movements happen or more strength and conditioning to help with the muscles in and around the knee.\n\"I was unlucky, I went for a couple of challenges and my knee just gave out. I don't think there was an overarching reason why. It was just luck of the draw.\"", "url": "https://www.bbc.com/sport/football/articles/c5yg3y0v17jo"}