{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:14:27", "date_modify": "2025-04-26 04:14:27", "date_publish": "2025-03-04 11:08:48", "description": "Swindon Town boss Ian Holloway says he will consider draws a failure from now on after his side won at League Two table-toppers Walsall.", "filename": "sport_football_articles_cp9y0ynm1r4o_1745640867.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/92d0/live/8c1c8710-f8df-11ef-9628-add78e51db09.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cp9y0ynm1r4o_1745640867.html", "title": "Ian Holloway: Swindon Town boss considers draws a 'failure'", "title_page": "Ian Holloway: Swindon Town boss considers draws a 'failure' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Swindon Town boss Ian Holloway has said he will consider draws a failure until the end of the season after his side won at League Two table-toppers Walsall.\nBefore the Robins' visit of Salford on Tuesday, Holloway said he is proud of the progress his players have made since his appointment in October, a spell which has seen Town rise from 22nd to 14th in the table.\n\"I'm more than quite pleased,\" Holloway told BBC Radio Wiltshire.\n\"The way they are going about their work - they've got different values now and I think the senior lads I've added have made a huge difference.\n\"We've got 20 points out of 27. Each and every single game is more important than the last one because of the bad start we've had.\n\"We cannot fail in any way and a draw is a failure from now until the end of the season.\"\nCaptain Ollie Clarke misses Tuesday's match against the Ammies after picking up his 10th booking of the season but Holloway does not believe his absence will make much of a difference to his side's overall performance.\n\"Saturday, Tuesday, Saturday, Tuesday - we haven't had that for a few weeks but our form is as good as anyone's in the league,\" he added.\n\"I am a lucky man at the moment. I think I can make five or six changes if I wanted to and I don't think I would disrupt our momentum.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cp9y0ynm1r4o"}