{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:40:09", "date_modify": "2025-05-21 04:40:09", "date_publish": "2025-01-18 00:00:00", "description": "Harrison Burrows scores twice to send Sheffield United back to the top of the Championship as they beat Norwich City at Bramall Lane.", "filename": "sport_football_live_c897v0yxyvzt_1747802409.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c897v0yxyvzt_1747802409.html", "title": "Sheffield United 2-0 Norwich City: Harrison Burrows double sends Blades top", "title_page": "Sheffield United 2-0 Norwich City: Harrison Burrows double sends Blades top - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Harrison Burrows scored twice to send Sheffield United back to the top of the Championship as they beat Norwich City at Bramall Lane.\nThe Blades hit the front when full-back Burrows chested down a loose clearance and fired in a shot which hit both posts before finding the net.\nAnd the 23-year-old slammed a second-half penalty into the bottom corner of the net after Sam McCallum drew a clumsy challenge from Ben Chrisene.\nA 10th home win of the season sent Chris Wilder's side above Burnley - who drew with top-four rivals Sunderland on Friday - and two points clear of Leeds, who host Sheffield Wednesday on Sunday.\nThe injury-hit Canaries were down to 15 fit first-team players for the trip to South Yorkshire and fell to their first defeat in five league matches to stay 11th, five points outside the play-off spots.\nSheffield United manager Chris Wilder told BBC Radio Sheffield:\n\"I thought the team was excellent from start to finish against dangerous opposition.\n\"At our absolute weakest, we produced that. We got a couple back today and lost a couple. I thought we controlled the game, created some really good chances, a couple of great goals and opportunities.\n\"We were never really in danger, did the out of possession stuff really well, coped with that against dangerous opposition, and in possession I thought we were bright, sharp and created some good opportunities, so a fabulous day.\n\"I said to the players we have to embrace it. The reward for getting three points today was going back to the top of the division and we've done that.\"\nNorwich City boss Johannes Hoff Thorup told BBC Radio Norfolk:\n\"We expected to be more on the ball because that's the way they approach the game so it's not that important for me.\n\"I expected us to dominate but I also expected us to be able to take better care of the chances that we got into.\n\"We had many situations in the box and around the box and offensive transitions, but the quality of decisions in the final third was below standard.\n\"I'm frustrated and disappointed about that because I think there was something for us in this game tonight and the goals we conceded are down to our own sloppiness in two vital moments.\"", "url": "https://www.bbc.com/sport/football/live/c897v0yxyvzt"}