{"authors": ["Adwaidh Rajan", "www.facebook.com"], "date_download": "2025-05-21 04:17:02", "date_modify": "2025-05-21 04:17:02", "date_publish": "2025-04-05 17:40:32", "description": "After a 2-2 draw at West Ham, Bournemouth have an uphill task to secure European football for the very first in their history.", "filename": "sport_football_articles_cd7vdx989p0o_1747801022.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b0ab/live/6294c0b0-1243-11f0-9d46-3377f28968f3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cd7vdx989p0o_1747801022.html", "title": "West Ham 2-2 Bournemouth: Cherries' European hopes dealt another blow after draw", "title_page": "West Ham 2-2 Bournemouth: Cherries' European hopes dealt another blow after draw - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Only a few weeks ago, Bournemouth were firmly on course to secure European football for the first time in their history.\nThey were fifth in the Premier League having beaten Southampton 3-1 in February, but following the 2-2 draw at West Ham on Saturday, they now have an uphill task to make it to Europe next season.\nAndoni Iraola's side are now without a win in six league games, losing four of those and are now six points behind fifth-placed Manchester City and five behind Newcastle, who are seventh and have two games in hand.\nThey have conceded twice in each of their past five league outings while also lacked the firepower up front, with 12-goal top scorer Justin Kluivert once again out injured for the trip to London.\nHowever, Evanilson's purple patch in attack will give them some hope as they look to make a strong finish to the season.\nThe Brazilian has struck in three straight league games and has six goals in as many matches across all competitions.\nIn their remaining games in April, they will face Fulham and Crystal Palace, two sides who also have European ambitions, before hosting Manchester United on 27 April.", "url": "https://www.bbc.com/sport/football/articles/cd7vdx989p0o"}