{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:00:03", "date_modify": "2025-05-21 05:00:03", "date_publish": "2025-04-04 11:28:07", "description": "Man City news: De Bruyne's leaving announcement in full", "filename": "sport_football_articles_ce920vempevo_1747803603.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/77c2/live/6be95790-1147-11f0-bf77-53586c0d950e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ce920vempevo_1747803603.html", "title": "De Bruyne's leaving announcement in full", "title_page": "Man City news: De Bruyne's leaving announcement in full - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Kevin de Bruyne penned an emotional farewell to Manchester City today as he confirmed he will leave after a decade at the club.\nHere is his announcement in full:\nDear Manchester,\nSeeing this, you probably realise where this is heading. So I'll get straight to it and let you all know that these will be my final months as a Manchester City player.\nNothing about this is easy to write, but as football players, we all know this day eventually comes. That day is here - and you deserve to hear it from me first.\nFootball led me to all of you - and to this city. Chasing my dream, not knowing this period would change my life. This city. This club. These people... gave me EVERYTHING. I had no choice but to give EVERYTHING back! And guess what - we won EVERYTHING.\nWhether we like it or not, it's time to say goodbye. Suri, Rome, Mason, Michele, and I are beyond grateful for what this place has meant to our family.\n\"Manchester\" will forever be on our kids' passports— and more importantly, in each of our hearts.\nThis will always be our HOME.\nWe cannot thank the city, club, staff, team-mates, friends, and family enough for this 10-year ride.\nEvery story comes to an end, but this has definitely been the best chapter.\nLet's enjoy these last moments together!\nMuch love,\nKDB", "url": "https://www.bbc.com/sport/football/articles/ce920vempevo"}