{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:40:43", "date_modify": "2025-05-20 14:40:43", "date_publish": "2023-07-28 10:29:29", "description": "AFC Bournemouth: Former chairman Jeff Mostyn steps away", "filename": "sport_articles_cw0n7rj8xwno_1747752043.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0f62/live/2590e630-2d2f-11ee-81a6-8f7e7ff66d52.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cw0n7rj8xwno_1747752043.html", "title": "AFC Bournemouth: Former chairman Jeff Mostyn steps away", "title_page": "AFC Bournemouth: Former chairman Jeff Mostyn steps away - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Bournemouth chairman Jeff Mostyn has officially announced his departure from the club, after 16 years of service.\nThe club have recognised Mostyn as a \"key figure\" in the Cherries' recent success, after he led the club's takeover in 2007 and served as chairman during Bournemouth's ascent to top-flight football.\nMostyn stepped down from his role as chairman last year following Bill Foley's takeover of the club from Maxim Demin. He then took up a new role as club ambassador for the Cherries in December 2022.\nExplaining his decision, Mostyn said: \"I have enjoyed every moment of my time as your chairman and most recently club ambassador with this remarkable football club, but feel that the time is now right for me to look forward to the next chapter and focus on other projects.\n\"It has been a pleasure to work in my ambassadorial role since last season's takeover, and I am confident that the vision and investment being made by Bill Foley will lead to great things and continued success in the coming years.\"\nBournemouth's chief executive Neill Blake said: \"Jeff has had an impact on the football club that is hard to put into words and it is right that we use this opportunity to thank him for his many years of dedicated service.\n\"He’ll always be welcome back at Vitality Stadium and I’m sure he’ll continue to show his support for the club, which he loves very dearly.\"", "url": "https://www.bbc.com/sport/articles/cw0n7rj8xwno"}