{"authors": ["Ged Scott", "www.facebook.com"], "date_download": "2025-05-21 03:48:17", "date_modify": "2025-05-21 03:48:17", "date_publish": "2025-04-07 12:27:18", "description": "The New Saints of Oswestry owner Mike Harris admits he made an offer to buy League One club Shrewsbury Town in September.", "filename": "sport_football_articles_cp34yw87329o_1747799297.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/98ee/live/e2775200-1399-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cp34yw87329o_1747799297.html", "title": "Shrewsbury Town: TNS owner reveals offer to buy League One club", "title_page": "Shrewsbury Town: TNS owner reveals offer to buy League One club  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The New Saints of Oswestry owner Mike Harris has confirmed on social media he made a bid to buy Shrewsbury Town last September and is still interested in exploring a takeover of the League One club.\nThe two clubs - based just 18 miles apart - were already in negotiations over Saints' rental of Shrewsbury's Croud Meadow home to stage their three European Conference home ties.\nTown's 83-year-old owner Roland Wycherley then announced his continued intention to sell the League One club.\nA deal for a new multi-millionaire American owner to take over has been on the table since then, which included a six-month exclusivity period.\nThat deal collapsed last week, allowing Shrewsbury the chance to explore other options, but Wycherley has warned that any other potential new buyers are unlikely to be local.\nPosting on X, Welshpool-born businessman Harris, who was behind the rise of telecom specialists Total Network Solutions in the late 1980s and is a boyhood Salop fan, says he wants to \"engage with fans or a group of potential investors\" and return the club to its \"glory days\".\nThe Shropshire club, who have spent the last 10 seasons in the third tier, are the longest-serving members of League One, having even more impressively spent a decade in the second tier from 1979 to 1989.\nBut, following their home defeat by Cambridge United on Saturday, they will be relegated back to League Two this Saturday if they lose their next two games.\nOswestry-based TNS last month clinched their fourth straight Cymru Premier title - their 17th in the 33 seasons since the formation of a Welsh national league.", "url": "https://www.bbc.com/sport/football/articles/cp34yw87329o"}