{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:53:31", "date_modify": "2025-04-26 03:53:31", "date_publish": "2025-03-03 08:19:35", "description": "Newcastle news: Anthony Gordon red card 'looked straightforward'", "filename": "sport_football_articles_cy9d00z0q55o_1745639611.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/dda0/live/22c4b1d0-f7b2-11ef-a82a-7d6833b7d913.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cy9d00z0q55o_1745639611.html", "title": "Newcastle news: Anthony Gordon red card 'looked straightforward'", "title_page": "Newcastle news: Anthony Gordon red card 'looked straightforward' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Former Newcastle United defender John Anderson says \"poor decision-making\" cost Eddie Howe's side as they were knocked out of the FA Cup by Premier League rivals Brighton.\nSpeaking on BBC Radio Newcastle, Anderson said: \"It wasn't a good performance. It was really patchy and they couldn't keep the ball.\n\"Brighton came with a possession-based game that was slow and methodical. We just couldn't get into it. We couldn't get a goal and we didn't work their goalkeeper enough.\n\"It is bitterly disappointing because we came here with expectations.\n\"We have said it in many games recently that our decision-making has been poor. We get into good areas but we need to put our heads up and pick somebody out. That final ball was really disappointing yet again, even when we were in really good areas.\nAnderson also raised his concerns about the Magpies heading into the Carabao Cup final without Anthony Gordon, who picked up a straight red card for a foul on Brighton defender Jan Paul van Hecke.\n\"It is bitterly disappointing,\" he said. \"He is one of our big players, one of the influential players, one that can make things happen. Not having him there is going to be a big, big blow.\n\"They have got to appeal the red card. I don't see them winning it. It seemed pretty straightforward to me.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cy9d00z0q55o"}