{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:24:08", "date_modify": "2025-05-20 14:24:08", "date_publish": "2023-07-25 10:39:29", "description": "Hampshire chairman Rod Bransgrove announces he will step down at the end of the 2023 season.", "filename": "sport_cricket_66299156_1747751048.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/C40E/production/_130509105_gettyimages-85972871.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66299156_1747751048.html", "title": "Rod Bransgrove: Hampshire chairman to step down at the end of the season", "title_page": "Rod Bransgrove: Hampshire chairman to step down at the end of the season - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Hampshire chairman Rod Bransgrove will step down from his role at the end of the 2023 season.\nHe was elected as chair in 2000 and has overseen the most successful period in the club's 160-year history.\n\"Being chair of Hampshire has been a huge honour and one of the greatest experiences of my life,\" he told the club website, external.\n\"I am so proud of all the players and coaches who have entertained and inspired us all during my tenure.\"\nBransgrove was the driving force behind Hampshire's move from the County Ground to the Ageas Bowl, which has brought international cricket to the county on a regular basis.\nDuring his tenure, the men's team transformed into one of the most competitive in the domestic game, winning three T20 titles and four one-day cups.\nHe also oversaw the launch of the Southern Vipers women's team, who have become one of the most dominant regional sides in limited-overs cricket, winning a pair of 50-over titles and three T20 competitions, including back-to-back Charlotte Edwards Cups.\nOne of Bransgrove's main ambitions was achieved earlier this summer when the English and Wales Cricket Board announced the Ageas Bowl would host two Ashes Tests - a men's Test in 2027 and a women's Test in 2031.\n\"Off the field, my dream has long been to host an Ashes Test at our fabulous venue,\" he said.\n\"With confirmation from the ECB that this will now happen in 2027, I believe my work within the sport is nearing its completion.\n\"Our club has a long and rich history, I am honoured to have played a part in its story and look forward to attending as a supporter for many years to come.\"\nHampshire chief executive David Mann said: \"Rod helped save the club and secured its long-term future, while overseeing a period of unprecedented success on the pitch.\n\"His passion for the game and commitment to cricket is inspiring.\n\"His legacy won't just be in the success we have enjoyed on the pitch, or in bringing international cricket to Hampshire, but also in growing the game and securing Hampshire's future for future generations to enjoy.\"\nBransgrove will continue in his roles as chair of Hampshire Sport & Leisure Holdings Group, chair of Southern Vipers and also as a trustee of the Hampshire Cricket Foundation.", "url": "https://www.bbc.com/sport/cricket/66299156"}