{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:33:24", "date_modify": "2025-05-21 04:33:24", "date_publish": "2025-04-04 21:16:27", "description": "London Mavericks edge past Birmingham Panthers after wins for Nottingham Forest and Manchester Thunder on Saturday.", "filename": "sport_netball_articles_c87p8rjxgypo_1747802004.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2e12/live/8e2f3550-1308-11f0-b515-e35a0abdef6d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_netball_articles_c87p8rjxgypo_1747802004.html", "title": "Netball Super League: London Mavericks edge past Birmingham Panthers in thriller", "title_page": "Netball Super League: London Mavericks edge past Birmingham Panthers in thriller - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "London Mavericks edged past Netball Super League newcomers Birmingham Panthers with a dramatic 69-68 win in Brighton.\nThere was little to separate the teams throughout, with Mavericks holding on to their one-point lead from 36-35 at half-time.\nGoal-shooter Emily Andrew scored 13 goals for Mavericks, including the winning shot to take the lead in the final seconds of the game.\n\"The girls up front really stepped up, we showed so much fight to come back,\" Mavericks goalkeeper and player of the match Razia Quashie told BBC Sport.\n\"Three of our players had operations on injuries this week. Although the scoreline is minimal, we know that we are building and we are getting towards the end product.\"\nIt is Mavericks' third win of the Super League which moves them up to third in the table behind London Pulse and Manchester Thunder, but Panthers remain winless alongside the Cardiff Dragons.\nOn Saturday, the competition's other newcomers Nottingham Forest stunned defending champions Loughborough Lightning 73-71 in front of a crowd of more than 2,500 at Motorpoint Arena.\nThe hosts led by three points at half-time in Nottingham but trailed by a point going into the final quarter.\nHowever, South Africa international Rolene Streutker's 38 goals led Forest to a tense victory in the NSL's first East Midlands derby, with Lightning's Ella Clark missing a late chance to force extra time.", "url": "https://www.bbc.com/sport/netball/articles/c87p8rjxgypo"}