{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:17:05", "date_modify": "2025-05-20 12:17:05", "date_publish": "2023-08-05 07:14:00", "description": "New Zealand stage a dramatic comeback to beat Australia 23-20 and maintain their winning run before the Rugby World Cup.", "filename": "sport_rugby-union_66414340_1747743425.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/16AEA/production/_130660929_bled.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-union_66414340_1747743425.html", "title": "New Zealand 23-20 Australia: All Blacks fight back for dramatic win", "title_page": "New Zealand 23-20 Australia: All Blacks fight back for dramatic win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "New Zealand staged a dramatic comeback to beat Australia 23-20 in their final home Test before the Rugby World Cup.\nBehind 17-3 at half-time in Dunedin, the hosts sealed victory with a 79th-minute penalty from Richie Mo'unga after two second-half tries.\nNew Zealand beat the Wallabies in Melbourne 38-7 last week to win their third Rugby Championship in a row.\nFormer England head coach Eddie Jones has still to win a game since taking charge of Australia.\nThe All Blacks' 22-year winning streak against the Wallabies on home soil was in peril after the visitors dominated early at Forsyth Barr Stadium.\nBut tries for debutants Shaun Stevenson and Samipeni Finau enabled New Zealand to storm back into the game, before Mo'unga sealed a 2-0 Bledisloe Cup series win with a well-taken kick from a tight angle.\nIt was an agonising finish for Australia, coming after they were comprehensively beaten by the All Blacks a week ago.\n\"Yeah, absolutely gutted,\" said Australia captain Tate McDermott. \"Obviously not happy with it, but from where we were last week to where we are now a massive step up. A huge improvement.\"\nNew Zealand captain Sam Cane conceded the All Blacks had been pushed to the limit.\n\"That was a proper Test match,\" he said. \"They were firing all the shots in the first half, to be fair, we were just hanging in there. They took it to us in a big way.\"\nThe visitors made a flying start, scoring two tries in the first seven minutes to take a 14-0 lead.\nQuick hands put Marika Koroibete across in the third minute and Tom Hooper barged over at the same left corner after flattening Damian McKenzie in a thunderous run.\nBoth teams had early casualties and Queensland Reds hooker Matt Faessler made his Test debut for Australia when Dave Porecki came off for a head injury assessment.\nNew Zealand lost Brodie Retallick with an apparent knee problem in the 26th minute, but their old guard stepped up in his absence, with Sam Whitelock and Ardie Savea combining to save a try when stand-in captain McDermott made a dart for the right corner.\nThe hosts fought back with Stevenson going over at the right corner four minutes after the restart.\nA Mo'unga penalty trimmed the deficit to four points, before Finau's try put the All Blacks ahead.\nAustralia's Quade Cooper drilled a long-range penalty to level the score at 20-20.\nBut with three minutes left, Cooper knocked the ball on to give New Zealand a scrum.\nThey dominated the set-piece to win a penalty advantage, allowing Mo'unga the chance for his winning kick.\nNew Zealand have now won all four of their Tests this season - against Argentina, South Africa and Australia (twice).\nThe Wallabies, who appointed former England head coach Jones in January, have lost all four against the same teams but will take some heart from their performance on Saturday.\nThe Rugby World Cup starts on 8 September when hosts France face New Zealand.", "url": "https://www.bbc.com/sport/rugby-union/66414340"}