{"authors": ["Andrew Christie", "www.facebook.com"], "date_download": "2025-05-21 06:08:32", "date_modify": "2025-05-21 06:08:32", "date_publish": "2025-01-14 10:48:13", "description": "St Mirren fan column: 'Concerns are mounting for blunt Buddies'", "filename": "sport_articles_clyev9v7neko_1747807712.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4d7d/live/aedc8610-d24c-11ef-94cb-5f844ceb9e30.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_clyev9v7neko_1747807712.html", "title": "'Concerns are mounting for blunt Buddies'", "title_page": "St Mirren fan column: 'Concerns are mounting for blunt Buddies' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Another afternoon at the SMISA that leaves us pondering the fine margins of football.\nFor the fourth time this season, nothing separated St Mirren and Dundee United in general play. Yet also for a fourth time this season, Jim Goodwin's men found themselves celebrating another victory, this time thanks to Louis Moult's acrobatic 88th-minute finish.\nWhile these sides have made a habit of cancelling each other out, Saturday offered a more open affair. Despite the familiar outcome, both teams traded blows in what, at times, was an end-to-end contest where both created genuine chances.\nThere was Richard Taylor's header cleared off the line, Mikael Mandron rattling of the underside of the bar, but it was Toyosi Olusanya's afternoon that will keep the Paisley faithful awake for the foreseeable.\nFirst, sent clean through by a lovely lifted Mandron ball, he could only find United keeper Jack Walton's feet when the bottom corner beckoned. Then, after Moult's overhead kick seemed to have settled matters, redemption presented itself in the form of a stoppage-time penalty. The script was written, but Walton hadn't read it, diving left to push away an admittedly tame effort and preserve United's lead.\nWith the greatest of respect to Dundee United, they personify the distinction between a good team and an effective one. Goodwin's men have mastered the art of making fine margins fall in their favour. Whether it's Moult's moment of magic or Walton's penalty heroics, they consistently find ways to position themselves on the right side of decisive moments.\nFor Saints, the concerns are mounting. Four defeats on the bounce, three games without scoring, and a drop out of the top six paint a worrying picture. Since that Boxing Day high against Rangers, we've struggled to capture anything approaching a clinical edge.\nThe frustrating thing is, we looked more ourselves for long periods at the weekend. The pressing was better, the movement was sharper and we created the types of chances that usually end up in the back of the net. Saints recorded an expected goals (xG) tally of 2.19 on Saturday without finding the net.\nFootball of course, isn't played on spreadsheets, but if it was, Saturday was Jim Goodwin dressing up as the Microsoft paperclip and kicking your head in in front of all your mates.\nSo I'll grit my teeth and concede - United are reaping the rewards of shrewd summer recruitment and excellent coaching. They've built a squad of Premiership stalwarts supplemented by exciting additions, and Goodwin has them playing with a ruthless efficiency that's carrying them towards European football.\nThe January transfer window could prove crucial in turning our fortunes around. The arrival of Owen Oseni from Gateshead has already added fresh firepower to our attacking options, while the imminent loan signing of Crystal Palace's promising young winger Franco Umeh could provide that spark of creativity we've been missing in recent weeks.\nFor Robinson and his team, the challenge now is clear. We need to find that clinical edge again, to start tipping those crucial moments our way... the foundations are there, but until we develop that killer instinct, we'll continue to fall short of our true potential.\nNext week's Scottish Cup trip to League One outfit Queen of the South could provide the perfect opportunity to rediscover our scoring touch and build some much-needed momentum.", "url": "https://www.bbc.com/sport/articles/clyev9v7neko"}