{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:25:37", "date_modify": "2025-04-26 06:25:37", "date_publish": "2025-02-28 21:56:25", "description": "Arsenal want to sign Joshua Kimmich, Aston Villa have joined the race for Dusan Vlahovic, and Liverpool are willing to listen to offers for Luis Diaz.", "filename": "sport_football_articles_c5ymmy1y3qqo_1745648737.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9db2/live/9a881af0-f612-11ef-9e61-71ee71f26eb1.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c5ymmy1y3qqo_1745648737.html", "title": "Football gossip: Kimmich, Vlahovic, Diaz, Sesko, Livramento, Casemiro", "title_page": "Football gossip: Kimmich, Vlahovic, Diaz, Sesko, Livramento, Casemiro - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Arsenal want to sign Joshua Kimmich, Aston Villa have joined the race for Dusan Vlahovic, and Liverpool are willing to listen to offers for Luis Diaz.\nArsenal want to sign Bayern Munich and Germany midfielder Joshua Kimmich, 30, on a free transfer this summer. (Sky Sports), external\nThe Gunners have registered concrete interest in signing Kimmich, with a deal to sign Spain midfielder Martin Zubimendi, 26, from Real Sociedad understood to be close. (Metro), external\nLiverpool and Barcelona are among the other clubs interested in Kimmich. (Sun), external\nAston Villa have joined Arsenal in the race to sign Serbia striker Dusan Vlahovic, 25, who is increasingly likely to leave Juventus in the summer. (TeamTalk), external\nLiverpool are planning to sign a new centre-back and a right-back in the summer transfer window, regardless of the future of Netherlands' defender Virgil van Dijk, 33, and with England international Trent Alexander-Arnold, 26, expected to leave for Real Madrid. (Football Insider), external\nLiverpool could be open to letting Colombia winger Luis Diaz leave for around 70m euro (£57.7m) in the summer, with Atletico Madrid keen on the 28-year-old. (Fichajes - in Spanish), external\nChelsea are not planning to sign a goalkeeper during the summer transfer window, despite recent scrutiny of Spaniard Robert Sanchez, 27, and Danish keeper Filip Jorgensen, 22. (Times - subscription required), external", "url": "https://www.bbc.co.uk/sport/football/articles/c5ymmy1y3qqo"}