{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:34:14", "date_modify": "2025-05-21 04:34:14", "date_publish": "2025-04-05 00:00:00", "description": "Follow live BBC Radio commentary, live text and score updates as Nottingham Forest lose to Aston Villa in Premier League", "filename": "sport_live_cddyrv59rgrt_1747802054.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/10a4/live/272d9ac0-124c-11f0-b234-07dc7691c360.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_live_cddyrv59rgrt_1747802054.html", "title": "Premier League LIVE: Aston Villa beat Nottingham Forest after Arsenal, Wolves and Crystal Palace win- scores, radio & updates", "title_page": "Premier League LIVE: Aston Villa beat Nottingham Forest after Arsenal, Wolves and Crystal Palace win- scores, radio & updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Goodbye!\nThat's all from us today. Thanks for joining us for a sunny Premier League Saturday.\nWe'll be back to do it all over again tomorrow, with eight teams in action - including a certain two from Manchester.\nHere's what you can look forward to...\nTottenham v Southampton (14:00 BST)\nBrentford v Chelsea (14:00 BST)\nFulham v Liverpool (14:00 BST)\nMan Utd v Man City (16:30 BST)\nSee you then!\n'PSG are favourites but we'll try to compete'\nFT: Aston Villa 2-1 Nottingham Forest\nAston Villa\nAston Villa manager Unai Emery speaking to BBC Match of the Day: \"Good to win today but there's still work to do. We have got all nine points from the past three matches and it's very important that we are reducing the distance to the team in front. It's still very difficult to achieve as our objective is to get Europe again through the Premier League. We enjoy competing in the Champions League and the FA Cup, but the Premier League is the most important because it is through the league that we can reach our objective for the next season.\n\"The players are focused in every match - be it FA Cup, Champions League or Premier League. We have to manage the players intelligently to get the best out of them. Sometimes they might not start and sometimes we can get an impact from them as substitutes. This is most important - to see how we can be stronger as a team in each match.\"\nOn how his team performed with rotations: \"We played fantastic in the first half hour. We dominated and had the chances. In the second half, we tried to keep possession and we still had chances to score. But they scored once but we have to try to be demanding on how we want to dominate and impose our stature tactically.\"\nOn Nottingham Forest: \"Nottingham were competing very well today. They are favourites to get top five in the league. We are going to focus every match to try to get the best out of each match we are playing. We need to enjoy what we are doing.\"\nOn facing his former club Paris St-Germain in the Champions League next: \"For the club, for the players and for me as a coach, it's a huge challenge. We are very excited and motivated. They are favourites but we are going to try to prepare as best as possible to compete against a very good team, very good players and a very good coach. We will try to enjoy the first leg in Paris and the second leg here.\"\n'Probably going to fall short of what we wanted'\nFT: Ipswich 1-2 Wolves\nIpswich Town\nIpswich boss Kieran McKenna speaking to BBC Sport:\n\"Sad dressing room, sad stadium. Players put everything into the game and across the season. Big effort to go again after Wednesday, found that in the first half but second half we didn't find same energy level. Players gave everything, just couldn't get result we wanted.\n\"Different games across the course of the season but a lot where we have been really competitive. More often lost by tight margins. A lot have been late in the game, when teams bring on top subs and find the big moments late in the game. Not an atypical game, a lot of positives in how we've competed across the game, the week, the season. Just not been able to get the results we wanted.\n\"It's not about this season but over the last three seasons. From the middle of League One to the Premier League has been a hell of an assent. We've tackled the season in the best way we thought we could. Everyone's given a lot of work, we'll go right to the end. We're probably going to fall short of what we wanted but so many things to be proud of and a bright future for the club.\n\"It's not about belief in the table because we know the large probability is we'll fall short but Wolves are a strong team. There's belief in the work, that we can compete with the big teams on any given day. Results is the challenge but we have big games coming up and we can be competitive.\n\"We believe there's a lot of growth in the group. We have some older and younger players but we have a fantastic culture in the group and the club. A great work ethic, top senior players, talented players and the club is in a position to go from strength the strength in a lot of areas. Today is a setback and there might be another coming at the end of the season but the journey isn't always in a straight upward line. We're in a great position to push on again.\"\n'This victory is very important'\nFT: Aston Villa 2-1 Nottingham Forest\nAston Villa\nAston Villa boss Unai Emery speaking to Sky Sports: \"Yes, big win.\"\nOn first-half performance: \"We started dominating. They were playing tactically, a medium-low block and we started dominating because they were not pressing high, not getting out. We were creating chances and we scored goals.\n\"The second half, I am not happy. They were changing their tactics and taking more duels aggressively, pressing higher and we were not dominating like we have to.\n\"This victory is very important. Very happy with the victory. Very demanding of myself to improve things within... I am happy because we have three points more.\"\nOn playing in the Champions League: \"We are going to play two matches, the first in Paris and then coming back here. Of course we are going to prepare for two matches, but it is completely different from the game we played today.\"\nOn rotating and squad depth: \"We did it in Preston as well. It is very important to manage the players we have, we are more less with the players available. Leon Bailey hopefully can be available for Paris.\"\n'We cannot start a game like we did today'\nFT: Aston Villa 2-1 Nottingham Forest\nNottingham Forest\nNottingham Forest manager Nuno Espirito Santo speaking to BBC Match of the Day: \"The fight was there. We controlled the game in the second half and created a lot of chances. We reacted well to the first half. The final pass and the finishing was not there, but it will come. We started very bad. We didn't have the control and they had the chances. It was very disappointing.\"\nOn whether Ola Aina's absence affected the team: \"We had some absences. It's all about finding the balance and still being able to perform.\"\nOn what his team can take away from the defeat: \"We know each other very well inside the team. We know we always start really well and the big lesson was that we can't start a game as bad as we did today.\"\n'The final games are huge for us'\nFT: Aston Villa 2-1 Nottingham Forest\nNottingham Forest\nNottingham Forest defender Neco Williams speaking to Sky Sports: \"First half let us down, weren't good enough first 15 minutes especially. They created way more chances and dominated. We came in and things had to change. Second half, we created many chances but it's the goals you need and unfortunately we just couldn't get them today\n\"Frustrating. We created many chances, we just couldn't get it over the line but the positives are there.\n\"That's [first-half performance] what let us down. We are usually so compact and strong in the first 15 mins because that's when teams can get at you. That's what killed us. The reaction we showed was positive. Just not enough.\n\"We will be straight back in to do our recovery and back on the grass to work towards Everton, another massive game. The final games are huge for us.\"\n'January signings have been massive for us'\nFT: Aston Villa 2-1 Nottingham Forest\nAston Villa\nAston Villa's Morgan Rogers speaking to Sky Sports: \"It's a nice moment. We knew it was a big game. [Nottingham Forest] are doing really well in the league and they are a difficult team to play. We knew we had to start fast and we knew it was a must win if we want to get where we wanted to get in the Premier League. We were outstanding and deservedly got in front. We knew they will come back into it. They have got that quality but withstanding that pressure is massive for us.\"\nOn the impact of January signings: \"That's what football is all about. The January signings have proved massive for us. We knew it was going to be important if we want to compete in the second half of the season in the three competitions. We have made changes but we all know our jobs. We were fully foucssed and the players who have come in have been outstanding. It was a good performance all around.\"\nOn his goal: \"I aw Morato not looking and once Youri Tielemans go the ball, I had to make the move. He has the quality to pick me out from anywhere. I knew I had to make sure the first touch was right to get hte opportunity. It fell perfectly and I am happy to put it away. You can hear the crowd when the ball was coming over the top, so I had to be calm and composed.\"\nOn facing Paris St-Germain: \"It's going to be a massive game. It's surreal to be in that game. We will go there with confidence because we are playing well at the moment. They are one the best teams in the world, there is no denying that. We are in the quarter-finals for a reason. We will go there and try to win the game as always and see where it takes us. Looking forward to it.\"\n'We created the most chances'\nFT: Aston Villa 2-1 Nottingham Forest\nNottingham Forest\nNottingham Forest manager Nuno Espirito Santo speaking to Sky Sports: \"We didn't start well, Villa controlled chances. Second half was different, we had the chances but we couldn't score. First half was not good, we were not organised.\nOn changes at half-time: \"We tried to find solutions. The boys showed a better game.\n\"This is the game. It was one of the matches that we created the most but didn't take anything from the game.\n\"When you lose you don't recover so well, the miles come to your mind. It's always easy when you are in a good moment, Now is not so good, requires a bit of patience.\"\nOn missing players: \"I don't know [when they'll be back]. It's going to be day to day. He [Taiwo Awoniyi] felt something in his hamstring.\"", "url": "https://www.bbc.com/sport/live/cddyrv59rgrt"}