{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:12:48", "date_modify": "2025-05-19 15:12:48", "date_publish": "2015-02-28 00:00:00", "description": "Updates, punditry, analysis, reaction and social media debate on a busy day of Premier League and Football League action.", "filename": "sport_live_football_31523058_1747667568.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_live_football_31523058_1747667568.html", "title": "Saturday football: Text, TV and radio", "title_page": "Saturday football: Text, TV and radio - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Post\nAnd that's a wrap for today. But what a cracker of a football day we have ahead of us on Sunday.\nTwo stonking Premier League matches - Liverpool v Manchester City & Arsenal v Everton - kick things off.\nThen, we have the not-so-small matter of the League Cup final. Chelsea. Tottenham. Wembley. The first silverware of the English season.\nIf cheap Danish lagers did football scheduling... See you all tomorrow!\nCatch up on today's action\nWes Brown's incorrect sending off is the day's major talking point on a day not packed full of major talking points. Want to see what all the fuss is about? Then you know where you can watch it.\nMatch of the Day will be flashing on to your screens at 22:30 GMT on BBC One.\nPlayer reaction\nManchester United winger Ashley Young on the sending off of Sunderland defender Wes Brown - who appeared to be a victim of mistaken identity: \"It's down the referee. It's a tough decision to make. I couldn't see what happened. He sent someone off because it was a goalscoring opportunity. He had to send someone off.\n\"We needed to get back to winning ways after last week. For the first 10-15 minutes, we didn't play as well as we wanted to, but we composed ourselves and were unlucky not to be in front at half-time. We got the goal in the second half and built from there.\"\nPost\nFormer Arsenal defender Martin Keown\nFinal Score\n\"Aston Villa were unlucky today but there is something to build on. They have to believe. Aston Villa need the points but it's in the performances and they have to grow from the positive signs they showed today. I was in a Villa team that was relegated, and there is no divine right for them to stay up, even though they're a big club.\"\nPlayer reaction on Twitter\nStoke forward Bojan Krkic:, external Great win Potters! How important is the team spirit and the top quality of Mr Peter Crouch.\nWest Ham goalkeeper Adrian:, external Disappointed with our result today at home with a little bad luck... we have to continue working and think on the next at Wednesday!\nWest Brom goalkeeper Ben Foster:, external Great start to a BIG week! Also Blues and Watford winning too. Enjoy your Saturday night everyone.\nManager reaction\nManchester United manager Louis van Gaal on restlessness from the Old Trafford crowd during the first half: \"I didn't hear that. Maybe your hearing is better than mine.\n\"We started the match badly. It was not good. But after that, we had more composure on the ball and that improved our game in the second half.\n\"We are on our way and we have been in the top four for more than 10 or 12 weeks. I think we are a stable team in the top four. I hope at the end of the season, we are still there.\"\nManager reaction\nManchester United manager Louis van Gaal, speaking to BBC Sport about the decision to send off Wes Brown rather than John O'Shea: \"I think you can see it much better than I could see from the bench. The players protested more because they felt the wrong player was sent off.\n\"That's a mistake. You make mistakes as well and so do I. It can happen.\"\nLeague Two round-up\nThe top three all dropped points as leaders Burton lost 1-0 to Newport. Second placed Shrewsbury went down 2-1 to Northampton while Wycombe's Fred Onyedinma scored twice to salvage a 2-2 draw at home to Stevenage.\nLuton are now just two points from the automatic promotion places after a 2-0 win against Accrington.\nNewport's win saw them move into the play-off places at the expense of Plymouth who lost 2-0 to Bury.\nBottom placed side Hartlepool kept their survival hopes alive with a 1-0 win over Wimbledon.\nCarlisle are in the relegation zone on goal difference after a 2-0 defeat by Southend while York stay just above the drop zone after a 0-0 draw with Exeter.\nMistake identity at Old Trafford\nRight, let's clear this one up.\nBBC Sport pundit Martin Keown (and Chris from Hertfordshire) rightly point out that Arsenal pair Kieran Gibbs and Alex Oxlade-Chamberlain both avoided a ban after their 'own mistaken' identity case.\nBUT, that was because Arsenal successfully argued Oxlade-Chamberlain had not stopped a goalscoring chance and the red card was rescinded.\nSo Sunderland may hope that it is rescinded - but we'd suggest that is highly unlikely because it was a clear red card offence.\nTherefore, if it is mistaken identity the red card will be transferred to John O'Shea so he will serve the ban instead of Brown. Clear?\nText us on 81111\nChris, Hertfordshire: Re: Wes Brown sending off, am I right in thinking that mistaken identity can be an advantage for the team in question because an appeal would likely overturn the red card, with no resulting ban?\nGet in touch using #bbcfootball, external on Twitter or drop us a line on the BBC Sport Facebook, external or Google+ page., external\nYou can also text us on 81111 in the UK only - but please don't forget to add your name and location.\nManager reaction\nMore from West Brom's Tony Pulis: \"They changed it after 25 minutes as we were having so much joy and that made it difficult for us in the second half.\n\"We have a weakness up front in terms of numbers. The last 15 or 20 minutes we have had to play Sessegnon up there. Brown and Saido were both carrying knocks even before the game.\n\"Saido had an injection before the game and maybe he should have one before every game, scoring goals like that.\n\"Forty points will be safe this year without a question. Some people take their foot off the peddle and this game is relentless so if you do that you get a kick up the backside.\"\nManager reaction\nWest Brom manager Tony Pulis:\n\"It was a goal that top, top class players score and Saido Berahino could be a top, top class player. Since I came into club there has be no doubt about his ability, he just needs direction.\n\"He put himself in good positions. He has that ability to play someone in or score.\n\"We looked at the highlights and we probably had some of the best chances of the game.\n\"But they have got some very, very good players and in second-half we had to defend for our lives.\"\nMistaken identity at Old Trafford\nFormer Arsenal defender Martin Keown\nFinal Score\n\"It was the right decision to give the penalty (see 16:20) but the referee sent the wrong man off. There has been a lot of talk about the standard of refereeing going downhill, and this is another classic example. When he sees it afterwards he will be as disappointed as we are, because it's hard to believe he has got that wrong. The players are trying to tell him that he got it wrong too, but the referees will not listen, and that makes it worse. Manchester United got out of jail after a poor first-half performance, and went on to dominate play.\"\nManager reaction\nSunderland manager Gus Poyet says the penalty which led to Manchester United's opener, and Wes Brown being sent off in a case of mistaken identity, changed the game \"completely\".\n\"It was difficult to see what happened - we're trying to get a video. It's between two players. We have to analyse. It didn't look an easy decision to make,\" says the Uruguayan.\n\"The referee said that Wes Brown was the one who fouled Falcao first. That's what he told the players.\n\"You need to ask the referee [about the decision]. We will analyse it and make a decision.\"\nPLAYER REACTION\nNewcastle defender Jonas Gutierrez was part of the squad for the first time since being treated for testicular cancer. He told BBC Sport: \"I'm really happy to be back. It was my first time back since my illness.\n\"In football you never know what's going to happen. You start to think about life in a different way, things are more important than football.\n\"The chemotherapy was a big step, a big point in my life and I'm enjoying being back\n\"I'm strong and fit. After my illness, you need to get games. It's going to be tough. I'm going to fight for my place and when I have the opportunity I'll do my best.\n\"I have to say thanks. The fans give me a lot of power to work through my illness. Not just Newcastle fans, but football fans. They sent me a lot of love and a lot of messages.\"", "url": "https://www.bbc.com/sport/live/football/31523058"}