{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:05:29", "date_modify": "2025-05-20 13:05:29", "date_publish": "2023-08-02 16:53:56", "description": "Nigeria have a 'weapon' to give themselves an even chance of beating England in Brisbane, says former Women's World Cup keeper Racheal Ayegba.", "filename": "sport_africa_66374488_1747746329.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4A93/production/_130619091_rachael.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_africa_66374488_1747746329.html", "title": "Women's World Cup 2023: Nigeria v England is '50/50', says ex-Super Falcon", "title_page": "Women's World Cup 2023: Nigeria v England is '50/50', says ex-Super Falcon - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The goalkeeper, who represented Nigeria between 2001 and 2010 and was called up to their 2007 Women's World Cup squad, talks to BBC Sport Africa about the Group B qualifiers' campaign so far and their chances against England in the last 16.\nI have been really impressed with the Super Falcons' performances. They have exceeded my expectations.\nCompared to four years ago at the World Cup in France, our game has really changed with the way we are attacking opponents. Playing against the Olympic champions Canada or the co-host nation, when 99.9% of the people in the stadium were supporting Australia, we are not scared of anyone.\nThere is a lot of improvement because we have Asisat Oshoala playing for Barcelona, Rasheedat Ajibade at Atletico Madrid - most of the players are now professional, so they are not scared of anyone. The more we expose these African players, the more we get better results from this kind of competition.\nThe coach, Randy Waldrum, has done really well - I have to give him that. The best form of defence is attack, as you keep more of the ball.\nEven so, against the Republic of Ireland you could see the nervousness. They did not want to concede and their opponents had nothing to lose, so that was an extra battle.\nYou could see there was some fear. It was not our best game but we got the result and that is all that matters.\nAs a former goalkeeper, I always concentrate on what the keepers are doing. You can see how they are going to perform from the body language.\nI've been watching Nigeria's Chiamaka Nnadozie, who plays for Paris FC. She has this self-belief which I'm really excited about. If she stays fit then the country has a goalkeeper for the next 10 years.\nHer penalty save against Canada was so important, as was the fact that we kept a clean sheet.\nI'm so proud of the team defensively and the goalkeeper. The fact that people in Nigeria were comparing her to the men's goalkeepers is really interesting and good to see.\nThe other players who have also stepped up their game and impressed me are defender Osinachi Ohale - she's been everywhere - and Ajibade in midfield. That's the engine room and if you can control the midfield, it gives you a better chance.\nAnd then we come to the Super Falcons' star name: Oshoala. Whenever the five-time African Footballer of the Year has the ball, you see two or three players trying to chase her. This is really good for us because it creates more space for others.\nOshoala's speed is her main weapon. As a forward, she just wants to just drop the ball between the defenders and she is gone.\nBut when it comes to the clinical aspect, she can do better. We all know what she is capable of doing.\nThe key to beating England in the next round is not allowing them to play their own game. Everybody has a plan and if you let your opponents put that plan into action then you are going to be in trouble.\nLikewise, every team has a weak point and England currently have some injuries.\nWhen Nigeria beat Australia, the hosts actually played well but we over-powered them with our strength and power. That's our weapon that we have to use. If we can do that, then the game is 50/50.\nSarina Wiegman is an advantage for England. She is the best coach in the world - by far. What she has done with this England team, such as winning Euro 2022, is impressive. She knows what it takes to get the best out of the players and she has the tactical ability as well.\nWhen things are not going well, she has this boldness to take players out of the game and that is how you tell when someone is among the best in the world.\nI think it could end 1-1, with Nigeria winning it in extra time.\nIt will also allow the young girls in Nigeria to believe in what they can achieve, as well as bringing the publicity the women's game needs.\nHopefully that will help more players from Nigeria's local leagues to have an opportunity to play in other countries such as in Europe.\nIf the Super Falcons can beat England and reach the quarter-finals, it will mean everything. I'm sure the president will fly to Australia!\nIn terms of TV and radio, it will knock all other news out. Everyone will be talking about them.\nRachael Ayegba was speaking to BBC Sport Africa's Ian Williams.", "url": "https://www.bbc.com/sport/africa/66374488"}