{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:11:40", "date_modify": "2025-05-21 05:11:40", "date_publish": "2025-04-05 00:00:00", "description": "Manager Luis Enrique says Paris St-Germain are \"motivated to try to finish the season unbeaten\" after clinching a fourth straight Ligue 1 title.", "filename": "sport_football_live_c7vn674q55lt_1747804300.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/19e2/live/58695e40-1241-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c7vn674q55lt_1747804300.html", "title": "Paris St-Germain 1-0 Angers: Desire Doue scores as hosts clinch Ligue 1 title with six games left", "title_page": "Paris St-Germain 1-0 Angers: Desire Doue scores as hosts clinch Ligue 1 title with six games left - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manager Luis Enrique says Paris St-Germain are \"motivated to try to finish the season unbeaten\" after clinching a fourth straight Ligue 1 title.\nHis team needed only a draw at home to Angers to claim an unassailable lead over second-placed Monaco.\nBut teenage winger Desire Doue's 55th-minute volley from Khvicha Kvaratskhelia's cross secured all three points at the Parc des Princes against his hometown club.\nIf they avoid defeat in their remaining six matches, PSG would become only the seventh side from Europe's top five leagues to go an entire league season unbeaten - emulating Bayer Leverkusen in 2024, Juventus in 2012, Arsenal in 2004, AC Milan in 1992, Perugia in 1979 and Preston North End in 1889.\nLuis Enrique's side are closing in on Nantes' Ligue 1 record of 32 unbeaten games from the start of the 1994-95 season – but the Spaniard is determined to go the distance.\n\"Nobody has done that in France before, so that's something that we want to achieve,\" he said. \"That would help us in the Champions League and the Coupe de France.\n\"Celebrating a title in early April shows that we've reached a very high level this season. We've achieved this target, but we have more games to play.\"\nThe French side face Aston Villa for a place in the Champions League semi-finals after overcoming Liverpool in the last 16, while they also have a Coupe de France final against Reims at the end of May.\nGoncalo Ramos and Vitinha both went close as PSG dominated the first half against Angers, before Doue's first-time finish clinched their 11th title in the past 13 seasons – and 13th top-flight crown overall.\n\"It's crazy, I'm very happy,\" captain Marquinhos told beIN Sports. \"The titles will remain in history. We have the ambition to win everything. When we don't win the French championship, it hurts. That has happened to me twice.\n\"The team deserves to win. It's in our DNA to give everything on the field, to have an aggressive philosophy, to sweat for the jersey in every match, no matter the opponent. It's nice to see the supporters happy.\"\nWith a 26-point lead over Monaco, this is only the third time a team has won Ligue 1 with so many matches left to play. Laurent Blanc's PSG side triumphed with eight to go in 2016 and Lyon achieved the same with six games remaining in 2007.\nBlanc's PSG team won the league in mid-March nine years ago, making them the only outfit to clinch the title earlier in the calendar year than Enrique's current vintage.\nPSG may have lost major names such as Lionel Messi, Neymar and Kylian Mbappe in recent seasons, but a more measured approach in the transfer market – which has seen them bring in Doue, Willian Pacho, Joao Neves and former Napoli winger Kvaratskhelia – appears to be bearing fruit domestically and in Europe.\nHaving already beaten Monaco in the French Supercup in early January, they could end the season with four trophies.\nFrance international Ousmane Dembele – a second-half substitute against Angers – has been in particularly remarkable form this season, scoring 32 goals in 40 appearances across all competition.\nAngers-born Doue, meanwhile, has now registered 11 goals and as many assists in his debut season in Paris, having joined the club from Ligue 1 rivals Rennes in the summer.\nPSG host Villa in the first leg of their Champions League quarter-final on Wednesday, kicking off at 20:00 BST.", "url": "https://www.bbc.com/sport/football/live/c7vn674q55lt"}