{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 15:00:31", "date_modify": "2025-05-20 15:00:31", "date_publish": "2023-07-27 12:49:59", "description": "Nauman Ali took 7-70 as Pakistan thrashed Sri Lanka by an innings and 222 runs in the second Test in Colombo.", "filename": "sport_cricket_66326363_1747753231.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/F681/production/_130550136_gettyimages-1541246728.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66326363_1747753231.html", "title": "Pakistan beat Sri Lanka in second Test as Nauman Ali claims 7-70", "title_page": "Pakistan beat Sri Lanka in second Test as Nauman Ali claims 7-70 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Nauman Ali took seven second-innings wickets as Pakistan thrashed Sri Lanka by an innings and 222 runs in the second Test in Colombo.\nThe veteran left-arm spinner finished with a career-best 7-70 as Pakistan wrapped up a 2-0 series victory.\nPakistan added 13 runs to their overnight score as Mohammad Rizwan reached an eighth Test half-century.\nNauman removed all of Sri Lanka's top seven batters before Naseem Shah (3-44) blew away the home side's tail.\nAngelo Mathews was the only Sri Lanka batter to show any resistance at the Sinhalese Sports Club as he finished unbeaten on 63 from 127 balls.\nPakistan captain Babar Azam praised his side's aggressive approach in the match, with the team having scored at a run rate of 4.39 in their innings compared to Sri Lanka's 3.09 across both innings.\nHe said: \"Being aggressive was part of the plan, it's something we had discussed before coming here. We wanted to play positive cricket, so all the credit to the boys. It's not easy to play spin here but they played very well.\n\"Everyone stepped up and showed hunger to win this series. The way our bowlers bowled here was good because there wasn't much in the pitch, especially today, to put pressure on them.\"", "url": "https://www.bbc.com/sport/cricket/66326363"}