{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:13:12", "date_modify": "2025-05-21 05:13:12", "date_publish": "2025-04-05 00:00:00", "description": "Follow live text commentary, score updates and match stats from Coleraine vs Dungannon Swifts in the Irish Premiership", "filename": "sport_football_live_ce3vw90g0w5t_1747804392.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d14d/live/f5ecdba0-114d-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_ce3vw90g0w5t_1747804392.html", "title": "Irish Premiership highlights: Coleraine edge out Dungannon with late winner", "title_page": "Irish Premiership highlights: Coleraine edge out Dungannon with late winner - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Final whistle\nThat is all from us after another goal fest in the Irish Premiership's six games.\nChampions Linfield got their hands on the Gibson Cup after a 2-1 victory against Glentoran in the early kick-off at Windsor Park.\nYou can read about that game and get some reaction from the title celebrations here.\nElsewhere, Larne missed the chance to leapfrog the Glens into second place as they drew 2-2 with Crusaders at Seaview.\nColeraine may mount a late surge for second after a dramatic 3-2 home win over Dungannon Swifts.\nCliftonville have all but secured seventh spot and a potential European play-off place after a thumping 5-0 win against Ballymena United at Solitude.\nCarrick Rangers picked up a rare win as they beat Portadown 4-1 whilst Loughgall also got three points, edging past Glenavon.\nYou can read our round-up report from those five games here.\nWe will have highlights and reaction to follow on the BBC Sport website.\nThanks for joining us - goodnight.\n'Good individual goal from McLaughlin'\nFT: Glenavon 0-1 Loughgall\nLoughgall boss Darren Murphy speaking on Sportsound:\nOn Loughgall being all but relegated: \"I need more than a miracle to swing 21 goals [Loughgall have a far inferior goal difference than Carrick Rangers], but all I said to the boys today was look there are four games to go, just try and finish the season on a positive note and if you go down on goal difference at least you go down fighting.\"\nOn the victory: \"To be fair to them, the game wasn't the prettiest, but they did something they haven't done enough of this year, defend their box really well and be clinical with their chance. There were questions about Kirk [McLaughlin] being offside, but he still had plenty of work to do when he got the ball, but it was a very good individual goal.\"\nOn building for next year: \"The last few games, it gives me the chance to have conversations with players see who is up for the fight in the Championship and have a clearer picture of where the club is going to be.\"\nFULL-TIME\nColeraine 3-2 Dungannon Swifts\nAll over at the Showgrounds where Jamie Glackin's late strike sees the hosts earn a dramatic 3-2 win over the Irish Cup finalists.\nThe Bannsiders were out of the traps quick and early goals from Jack Scott and Dean Jarvis had them in a commanding position after just 10 minutes.\nHowever, John McGovern's spectacular strike midway through the opening half reduced the home side's advantage before Adam Glenny's header levelled matters just after the hour.\nThe game seemed destined to finish all square but up stepped Glackin to curl a 25 yard right effort out of the reach of Declan Dunne and seal a famous victory.", "url": "https://www.bbc.com/sport/football/live/ce3vw90g0w5t"}