{"authors": ["Jonathan Bradley", "www.facebook.com"], "date_download": "2025-05-21 04:13:25", "date_modify": "2025-05-21 04:13:25", "date_publish": "2025-04-06 09:12:22", "description": "La Rochelle head coach Ronan O'Gara says his side are lacking \"confidence and belief\" following their Champions Cup exit at the last-16 stage.", "filename": "sport_rugby-union_articles_cy5rk007k5xo_1747800805.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2ad0/live/1ab2f0b0-12c4-11f0-b894-896877884887.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cy5rk007k5xo_1747800805.html", "title": "Champions Cup: La Rochelle in 'freefall' after Munster defeat in last-16 says Ronan O'Gara", "title_page": "Champions Cup: La Rochelle in 'freefall' after Munster defeat in last-16 says Ronan O'Gara - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ireland great Ronan O'Gara said his La Rochelle side are lacking \"confidence and belief\" following their Champions Cup exit at the last-16 stage.\nThe two-time winners of the competition were beaten 25-24 at home by O'Gara's old side Munster on Saturday and are without a win in all competitions since beating an understrength Toulouse on 4 January.\nWith eight defeats and a draw from their past nine games, they are 10th in the Top 14, four points off the play-off places but just eight above a potential relegation spot.\nSet to face Bayonne and then Bordeaux-Begles upon their return to domestic action, head coach O'Gara said his side \"quickly\" need to find a solution.\n\"We're in freefall, so for Top 14, it's the same standard if not better with the teams coming. The opposition isn't going to get any weaker,\" he said.\n\"We're missing a key ingredient which is confidence and belief but we have to find that quickly.\n\"I was hoping [the Munster game] would turn our season but we have to go back to the drawing board and see what can be resurrected.\"\nO'Gara appreciated there was an \"ironic\" element to his side's latest reverse.\nHaving represented Munster 240 times, and played a huge part in Heineken Cup successes of 2006 and '08, he became known as a player who delivered in the big moments.\nJack Crowley's 70th-minute drop-goal ultimately proved the difference on Saturday with the Irish fly-half delivering a kick that the would have sat comfortably in the highlights reel of the man in the opposing coaching box.\n\"I'm obviously gutted but I think you've got to compliment and congratulate Munster on how they constructed their victory,\" O'Gara said.\n\"It was pretty ironic how they won it, getting it out to eight points with a peach of a drop-goal.\n\"I've seen a lot of good drop-goals but that's a top-class one.\"\nFor a man who represented Munster with such distinction, and who had a knack for delivering such dramatic moments himself, it was an odd feeling for O'Gara.\n\"For a second I thought Jack Crowley was with me then you're like, 'that's the wrong team',\" he added.", "url": "https://www.bbc.com/sport/rugby-union/articles/cy5rk007k5xo"}