{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:09:49", "date_modify": "2025-05-21 05:09:49", "date_publish": "2025-01-14 19:02:19", "description": "'I'm not a quitter' - Rangers boss Philippe Clement", "filename": "sport_articles_cqldrxrdpzxo_1747804189.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/66df/live/1e5e4050-d298-11ef-b526-d36fb212fcf8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cqldrxrdpzxo_1747804189.html", "title": "'I'm not a quitter'", "title_page": "'I'm not a quitter' - Rangers boss Philippe Clement - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manager Philippe Clement says he will not quit Rangers regardless of how tough his job could get in the coming weeks.\nThe Ibrox side sit 18 points behind Scottish Premiership leaders Celtic with some challenging fixtures over the next month to come.\nClement's men welcome Aberdeen on Wednesday and face trips to Manchester United, Dundee United, Hearts and Kilmarnock before the end of February.\n\"I'm not a quitter,\" the Rangers boss said before the midweek visit of the Dons. \"I'm somebody who knows what he wants and we're going to get it together.\"\nThe Belgian dragged his team into a title race following his arrival last term, but his side's poor away form has severely impacted their current campaign.\nHe has also had to deal with huge upheaval across the club's board and playing staff since he joined the club.\nAsked if the challenge has proven to be bigger than he anticipated, he replied: \"It's totally different. So now I expect different things. But it's also not a problem.\n\"Things were clearer in June, but of course there are also other circumstances about selling players and for how much you sell them and how much money you can use in the transfer market.\n\"So there are a lot of circumstances. That's always the case, it's finding solutions.\"", "url": "https://www.bbc.com/sport/articles/cqldrxrdpzxo"}