{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:52:58", "date_modify": "2025-05-21 05:52:58", "date_publish": "2025-04-02 08:28:51", "description": "Liverpool vs Everton: Arne Slot and David Moyes on Merseyside derby", "filename": "sport_football_articles_c99pv2nvzz0o_1747806778.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3c29/live/ec219390-0f27-11f0-ac9f-c37d6fd89579.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c99pv2nvzz0o_1747806778.html", "title": "Liverpool vs Everton: Arne Slot and David Moyes on Merseyside derby", "title_page": "Liverpool vs Everton: Arne Slot and David Moyes on Merseyside derby - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Liverpool head coach Arne Slot is not expecting anything different from the previous Merseyside derby this season, while Everton boss David Moyes is hoping to turn around his Anfield form.\nIn their delayed February meeting, the Toffees scored late on to rescue a controversial 2-2 draw, with Slot one of four people to receive a red card after the full-time whistle.\n\"Football-wise, I expect the same,\" said the Dutchman.\n\"It would be a surprise if they are going to do anything different, and we are top of the league so it would be strange if we were going to change something as well.\n\"In the final stages of the season, every game matters.\"\nThe Reds have lost just one of their past 24 top-flight home matches against Everton, while Moyes has yet to win at Anfield as manager in 21 attempts.\n\"I'd be lying if I said I look forward to going to it [Anfield] all the time,\" the former Manchester United and West Ham manager said.\n\"We might be further away from Liverpool than we ever have been at the moment.\n\"I want to win and I want to make sure we get rid of [this record] at Anfield.\"", "url": "https://www.bbc.com/sport/football/articles/c99pv2nvzz0o"}