{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:54:26", "date_modify": "2025-05-21 04:54:26", "date_publish": "2025-04-04 15:08:03", "description": "Nottingham Forest news: 'Supporters have waited a long time'- Nigel Clough", "filename": "sport_football_articles_c1drpwlk6wgo_1747803266.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f7e6/live/f3129d50-10af-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c1drpwlk6wgo_1747803266.html", "title": "Nottingham Forest news: 'Supporters have waited a long time'- Nigel Clough", "title_page": "Nottingham Forest news: 'Supporters have waited a long time'- Nigel Clough - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Nottingham Forest striker Nigel Clough says the current side have \"got every chance\" of beating Manchester City in the FA Cup semi-finals at Wembley later this month.\nClough was part of the Reds team that lost to Tottenham in the 1991 final and believes the group Nuno Espirito Santo has assembled can go one better this campaign.\n\"It just reinforces the season they're having,\" Clough told BBC Radio Nottingham's Shut Up And Show More Football podcast.\n\"Going down to Brighton and getting a 0-0 after 120 minutes - you then fancied them on penalties. You talk about confidence having done so well in the penalty shootouts they've had so far, so I think once it goes to penalties, they think they're going to win.\n\"They get the chance now to have a go at Manchester City in the semis, which I think is a brilliant time for everybody connected with Forest.\n\"You're not playing the City that you were a couple of seasons ago. They just beat them at the City Ground a couple of weeks back so they've got every chance.\n\"What they've done so far is an incredible achievement. It's how far can they extend it now.\"\nAs the son of Forest's legendary manager Brian Clough, current Mansfield boss Nigel appreciates what success means to the people of Nottingham.\n\"Supporters have waited a long time at Forest from the glory days so I think it's great that they've got fresh memories for the new generation,\" he said.\n\"I bet all their parents and grandparents tell them: 'I remember the '70s and the '80s when Forest did that.'\n\"For them to get their own memories now is absolutely brilliant.\"", "url": "https://www.bbc.com/sport/football/articles/c1drpwlk6wgo"}