{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:42:55", "date_modify": "2025-05-20 14:42:55", "date_publish": "2023-07-25 07:08:00", "description": "Crystal Palace: 'Thanks for the memories, Wilfried Zaha'", "filename": "sport_articles_clm141x24l0o_1747752175.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/da38/live/a0edff50-310a-11ee-8f52-fbf70e4bf742.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_clm141x24l0o_1747752175.html", "title": "Crystal Palace: 'Thanks for the memories, Wilfried Zaha'", "title_page": "Crystal Palace: 'Thanks for the memories, Wilfried Zaha' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Alex Pewter, Five Year Plan podcast, external\nIt feels strange to finally be eulogising the end of Wilfried Zaha's Crystal Palace career. Any realist expected this outcome several summers ago, yet even management appeared to hold hopes he would stay for the 2023-24 season.\nZaha had long secured his place as Palace's greatest-ever player. There is an argument others had more talent or showed more potential, but his story and legacy are unrivalled.\nFrom scoring the first goal of the \"CPFC2010\" ownership era at Selhurst Park, aged only 17, he has been intrinsic to the success in the following 13 years.\nSupporters are long removed from the downtrodden state of that administration, but Zaha, as part of Dougie Freedman's initial rebuild, offered hope, belief and iconic victories.\nThis is where his journey separates from the lineage of homegrown stars who came before him. As with many clubs, those individual stars Palace fans grew attached to always peaked elsewhere.\nIan Wright, or more recently Victor Moses, became synonymous with somewhere else and collected accolades in different shirts, despite their formative south London days.\nZaha too seemed destined to tread that route, and his emotional Wembley farewell, after securing promotion to the Premier League, was a storied end - but his detour to Manchester United was brief.\nBringing Zaha back a year later is the key decision of the past decade.\nTruthfully, sustained mid-table finishes and Premier League safety may be an achievement, but watching another 300 matches of Zaha on the left wing will be a lasting memory. Through the lean years, Zaha remained the club's not-so-secret weapon.\nIt might have been fair to allow him to make a high-priced move in past summers. Still, Palace continued to value their players higher than any team would reasonably offer, leaving the expiry of his contract a logical end.\nWith the prolonged exit, the final chapter has been frustrating, but it has not left any bitterness. For many, we are not just Crystal Palace fans but Wilfried Zaha fans at heart.\nOf course, the biggest regret will be that both the FA Cup and European qualification eluded the club in his time here.\nBut all the best, Wilf. Thanks for the memories.", "url": "https://www.bbc.com/sport/articles/clm141x24l0o"}