{"authors": ["Simon Stone at Old Trafford", "www.facebook.com"], "date_download": "2025-04-26 04:07:50", "date_modify": "2025-04-26 04:07:50", "date_publish": "2025-03-02 21:35:45", "description": "Ruben Amorim is called \"naive\" by Wayne Rooney after the Portuguese said Manchester United want to win the Premier League title.", "filename": "sport_football_articles_cx2xjj8dnmdo_1745640470.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/457f/live/6f617490-f7af-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cx2xjj8dnmdo_1745640470.html", "title": "Man Utd manager Amorim called 'naive' by Rooney over Premier League title ambition", "title_page": "Man Utd manager Amorim called 'naive' by Rooney over Premier League title ambition - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Manchester United head coach Ruben Amorim has defended himself after being called \"naive\" by former captain Wayne Rooney for suggesting the club's goal is to win the Premier League.\nUnited had lost nine of their 23 games under Amorim before being knocked out of the FA Cup on penalties by Fulham in the fifth round.\nIt leaves winning the Europa League as the only realistic avenue back into European competition next season.\nYet, initially speaking to BBC Sport after the game and then in his wider post-match news conference, Amorim spoke of United's desire to win the Premier League for the first time since Sir Alex Ferguson retired in 2013.\n\"The goal is to win the Premier League,\" said the Portuguese. \"I know we are losing games but the goal is to win the Premier League again. I don't know how long it will take. We have a goal and we continue forward no matter what.\"\nWorking as a pundit for Match of the Day, Rooney's reaction to those comments was that Amorim should focus more on short-term aims that might keep him in his job.\n\"I think it's a little naive to say they're looking to win the Premier League because from where they are now, they're a long way off that,\" he said.\n\"I think he'll get time but it's not a free hit because he'll expect more from Manchester United than what we're seeing since he's been in. He says winning the Premier League, how can they compete? To get further up the table, I think that's the next step for them.\"\nRooney's comments about United carry huge weight given his achievements at the club.\nHe remains United's record goalscorer and won five league titles and the Champions League during a stellar period in which he was a central figure in Ferguson's last great side.\nHowever, he has a chequered record as a manager, initially doing well in a difficult situation at Derby, moving to Major League Soccer with DC United, but then lasting just 15 and 25 games in ill-fated spells at Birmingham and Plymouth.\nAmorim did not mention this when he responded to Rooney's comments. But, from personal experience, he knows talking about a team and managing one is two entirely different things.\n\"That (winning the Premier League) is the goal,\" said Amorim. \"To be naive is to think we are going to do it this season or be the best contender next season.\n\"I know in this moment, everybody knows everything. I was a pundit when I finished my [playing] career. I know it's really easy.\n\"Maybe it is not with me but our goal, as a club, is to win the Premier League like we did in the past with all the great glories and legends of this club.\n\"We are in a difficult moment. And I'm not naive, that's why I'm here, at 40 years old, coaching Manchester United.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cx2xjj8dnmdo"}