{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:24:58", "date_modify": "2025-05-21 05:24:58", "date_publish": "2025-01-05 09:24:12", "description": "World number one Aryna Sabalenka warms up for her Australian Open title defence by winning the Brisbane International.", "filename": "sport_tennis_articles_cz6l53z974zo_1747805098.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1e89/live/c2fd19c0-cb3f-11ef-a0df-e188392942e5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_tennis_articles_cz6l53z974zo_1747805098.html", "title": "Brisbane International: World number one Aryna Sabalenka claims title, Naomi Osaka injury worry", "title_page": "Brisbane International: World number one Aryna Sabalenka claims title, Naomi Osaka injury worry - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "World number one Aryna Sabalenka geared up for her Australian Open title defence with victory over Russian qualifier Polina Kudermetova in the final of the Brisbane International.\nThe 26-year-old from Belarus recovered from dropping her serve twice on her way to losing the opening set to come through 4-6 6-3 6-2 against the world number 107.\nSabalenka lost in last year's Brisbane final to Elena Rybakina before going on to triumph in the Australian Open for the second time in a row.\nThe opening Grand Slam of the year begins at Melbourne Park on Sunday, 12 January.\nAfter a less than impressive opening set, Sabalenka began the second set strongly and Kudermetova had to save break points in her opening service game.\nThe pressure eventually told, with a drop shot giving Sabalenka the break and a 3-2 lead and she dominated the remainder of the set to force the decider.\nA break early in the third set left her in control and on the way to her first title of the year.\nMeanwhile, Naomi Osaka retired from the final of the Auckland Classic with an abdominal injury.\nThe four-time Grand Slam winner, who was playing in her first WTA final for three years after taking a 15-month break and giving birth to her first child midway through 2023, took the opening set 6-4 against Denmark's Clara Tauson.\nBut the 27-year-old called for the physio at the changeover and stood and performed a series of stretches during a medical timeout.\nAfter consulting with the trainer she shook the hand of Tauson, who picked up a third career title and her first since 2021.\nIn a statement, the WTA said Osaka retired \"due to an abdominal injury\".\n\"I just want to thank everyone for welcoming me to such a beautiful city and I had a lot of fun playing here and I'm really sorry about how it ended,\" she said.\n\"I hope you did enjoy the tennis that we did play and I'm just really grateful to be here.\"", "url": "https://www.bbc.com/sport/tennis/articles/cz6l53z974zo"}