{"authors": ["Kenny Crawford", "www.facebook.com"], "date_download": "2025-05-20 12:08:06", "date_modify": "2025-05-20 12:08:06", "date_publish": "2023-08-05 10:28:54", "description": "Morton come from behind to open their Scottish Championship campaign with victory at home to Ayr United.", "filename": "sport_football_66194523_1747742886.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/17044/production/_130667249_20700796.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66194523_1747742886.html", "title": "Greenock Morton 3-1 Ayr United: Hosts battle back for opening win", "title_page": "Greenock Morton 3-1 Ayr United: Hosts battle back for opening win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Morton came from behind to open their Scottish Championship campaign with victory at home to Ayr United.\nAyr took the lead when Oliver Pendlebury side-footed Jamie Murphy's centre into the bottom corner.\nBut the tireless Robbie Crawford equalised with a lovely curling shot into the top corner before Robbie Muirhead added a second from the spot.\nJack Bearne set up Steven Boyd for a deft finish to put the icing on the cake for the Greenock men.\nDougie Imrie's first-team squad of 17 is stretched as it is without injuries and suspensions to some key players, which meant they could only name three players on the bench.\nBut despite going behind, and driven on by the engine of Crawford, Morton had the character to roar back.\nGeorge Oakley did well to draw a foul from Sean McGinty which gave the hosts the penalty in between the Crawford and Boyd strikes.\nMorton manager Dougie Imrie: \"It was important to get off to a good start against a team we only picked up two points from four games last season.\n\"I'm so happy to have Robbie Crawford here and his energy levels are fantastic - he drives the team forward.\"\nAyr manager Lee Bullen: \"We got what we deserved. Morton were the better team. They were more physically up for the battle than we were.\n\"That's maybe the wake up call we needed. It's a shame it's come on the first day of the season.\"", "url": "https://www.bbc.com/sport/football/66194523"}