{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:15:34", "date_modify": "2025-05-19 15:15:34", "date_publish": "2015-02-17 06:31:09", "description": "Leicester Tigers' former England lock Louis Deacon ends his career because of injury after 15 years with the club.", "filename": "sport_rugby-union_31493583_1747667734.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81052000/jpg/_81052114_482921201.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_rugby-union_31493583_1747667734.html", "title": "Louis Deacon: Leicester Tigers & ex-England lock retires", "title_page": "Louis Deacon: Leicester Tigers & ex-England lock retires - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Leicester Tigers' former England lock Louis Deacon has retired because of injury after 15 years with the club.\nThe 34-year-old played 274 times during a one-team career, helping Tigers win the Heineken Cup and Anglo-Welsh Cup twice, as well as six Premierships.\nHe won 29 international caps and was part of Martin Johnson's squad at the 2011 Rugby World Cup in New Zealand.\nDeacon, who has not played this season, is coaching part-time with Spain for the European Championships.\n\"I have said many times that all I ever wanted to do was play one game for the Leicester Tigers,\" said Deacon.\n\"So to have the opportunity to do that more than 270 times, in massive games all over Europe and alongside so many great players, has been a huge honour.\"\nDirector of rugby Richard Cockerill added: \"Deacs is the epitome of the Leicester lad who came through at his hometown club to play at the very highest level of the game.\n\"He has been a central part of what makes this club tick for a long time.\"\nDeacon's retirement is another blow to Leicester's second row stocks, England's Geoff Parling having agreed to join Exeter Chiefs at the end of the season.", "url": "https://www.bbc.com/sport/rugby-union/31493583"}