{"authors": ["Bobbie Jackson", "www.facebook.com"], "date_download": "2025-04-26 08:15:31", "date_modify": "2025-04-26 08:15:31", "date_publish": "2025-02-26 10:43:39", "description": "Liverpool manager Arne Slot is banned for the second time this season following his red card against Everton this month.", "filename": "sport_football_articles_cx2gj4qvjelo_1745655331.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/fce3/live/a2e26470-f433-11ef-8241-abbb923a0925.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cx2gj4qvjelo_1745655331.html", "title": "Arne Slot ban: Liverpool manager gets two-game touchline ban for Everton red card", "title_page": "Arne Slot ban: Liverpool manager gets two-game touchline ban for Everton red card - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Liverpool manager Arne Slot has been given a two-game touchline ban for his red card against Everton.\nHe was dismissed for approaching referee Michael Oliver on the pitch after the 2-2 Premier League draw at Goodison Park on 12 February.\nSlot will miss the league leaders' home game with Newcastle on Wednesday and the visit of Southampton on 8 March.\nHe can be on the touchline for the Champions League last-16 first-leg tie with Paris St-Germain on 5 March.\nSlot was also fined £70,000 by an independent Football Association commission after accepting the charge.\nLiverpool assistant coach Sipke Hulshoff was banned for two games and fined £7,000, while Liverpool and Everton were fined £65,000 and £50,000 respectively for failing to control their players.\nJames Tarkowski's 98th-minute equaliser sparked chaotic scenes, with Everton fans entering the field to celebrate.\nLiverpool thought Tarkowski's goal, which was checked by the video assistant referee (VAR), should have been ruled out for a push on defender Ibrahima Konate in the build-up.\nSlot exchanged words with one of the assistant referees before shaking hands with Oliver, who immediately showed him a red card. Hulshoff was also sent off.\nSlot, who was unable to speak to the media after the match because of his red card, later voiced his frustration over the amount of stoppage time played, after five minutes were initially signalled.\nIn a news conference two days after the game, Slot said \"emotions got the better of me\".", "url": "https://www.bbc.co.uk/sport/football/articles/cx2gj4qvjelo"}