{"authors": ["Katie Stafford", "www.facebook.com"], "date_download": "2025-05-21 07:07:59", "date_modify": "2025-05-21 07:07:59", "date_publish": "2025-01-22 15:12:25", "description": "Tottenham news: Is Ange Postecoglou style too demanding?", "filename": "sport_football_articles_cq8k017l4wlo_1747811279.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a09d/live/311ec9d0-d7f7-11ef-b838-1f1681f9d23f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cq8k017l4wlo_1747811279.html", "title": "Tottenham news: Is Ange Postecoglou style too demanding?", "title_page": "Tottenham news: Is Ange Postecoglou style too demanding? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Running, sprinting and harrying the opposition are features of a team that are often praised by pundits and fans.\nTottenham have been the best pressing side in the Premier League this season, winning the most high turnovers and restricting their opponents to the fewest passes before they try to win the ball back.\nBut in Tottenham's case, is the physical cost too high?\nIt has been another injury-laden season for Ange Postecoglou's men, with players from all over the pitch affected, but no more so than their backline.\nSpurs' high line has made them one of the most entertaining teams to watch in the Premier League and it probably comes as no surprise their players have covered the most distance in the league this season - with their rapid attacks and then racing back as teams counter against them.\nTo date, Postecoglou's men have covered 2,470.4km, which is approximately 1,535 miles. They have also made the most sprints in the Premier League this season with 3,915, which averages at just under 178 per game [based on the 22 played].\nBournemouth are second for both distance covered and sprints.\nThe physical demand of recreating these numbers cannot be overestimated. It starts in training and transfers to matchdays, meaning players are consistently playing front-footed football.\nThis season alone, seven players have suffered a hamstring injury, with some experiencing the injury more than once.\nOf those seven, three are defenders and four are forwards. Wilson Odobert, who has had surgery, Timo Werner, Micky van de Ven and Destiny Udogie remain sidelined.\nIn addition to hamstring injuries, Cristian Romero has suffered a quadriceps strain, Djed Spence and Werner have had adductor strains and Yves Bissouma pulled up with a tight groin.\nAccording to the NHS website, tired muscles are more likely to strain and this aligns with Tottenham's tight fixture schedule, which has seen them play every three days for most of the season.\nBut fatigue also increases the risk of injury during explosive movements like sprinting and in Postecoglou's high-risk style, his players are sprinting more than any other in the top flight.", "url": "https://www.bbc.com/sport/football/articles/cq8k017l4wlo"}