{"authors": ["Ffion Wynne", "www.facebook.com"], "date_download": "2025-05-21 04:21:35", "date_modify": "2025-05-21 04:21:35", "date_publish": "2025-01-17 09:25:24", "description": "Ash Gardner leads Australia's dominant day with her maiden international hundred and the 'catch of the century', all in a day's work.", "filename": "sport_cricket_articles_cgq003y4qv3o_1747801295.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/88d3/live/b6da69e0-d4ae-11ef-9fd6-0be88a764111.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cgq003y4qv3o_1747801295.html", "title": "Women's Ashes 2025: Ash Gardner plays 'one of the best Ashes innings' and takes 'the catch of the century'", "title_page": "Women's Ashes 2025: Ash Gardner plays 'one of the best Ashes innings' and takes 'the catch of the century' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "When Ash Gardner's maiden one-day international century, which was described as \"one of the best Ashes innings\", is not even her most memorable achievement of the day, you know you have witnessed something spectacular.\nThe all-rounder rescued Australia from 59-4 with a flawless run-a-ball 102, which helped them post 308-8 and consequently set up a thumping 86-run win to ensure that England remain winless on the tour so far.\nAt the third time of asking in this ODI series, Australia put together a complete performance to edge closer to retaining the Women's Ashes at the earliest possible opportunity.\nAustralia now hold a 6-0 lead in the points-based multi-format series and England must win all three T20s (worth two points each) and the Test match (worth four points) in order to regain the Ashes, as a drawn series would see them retained by the holders.\nGardner was supported by 50 from a patient Beth Mooney, Tahlia McGrath bludgeoned 55 from 45 balls and then Georgia Wareham's 12-ball 38 took the game away from England, who had absolutely no answers to the world champions.\n\"It was a really special innings,\" said former England batter Ebony Rainford-Brent on TNT Sports.\n\"Ash Gardner is leading the way in the women's global game. I would argue that's one of the best Ashes innings I've seen.\n\"It stands out for me because it was a slow surface and Australia were struggling at 59-4. You would think that most teams would scratch around to make 160, 180 or whatever is possible.\"\nGardner is known for her explosive capabilities with the bat, and is one of the most powerful strikers of a ball in the women's game, but in Hobart she demonstrated her versatility in leading the recovery from losing four early wickets in a partnership of 95 with Mooney which relied more on strike rotation and skill, than brute strength and risk-taking.\nThat then allowed the lower order to accelerate past 300 at the end of the innings, pinned England firmly to the ropes, and yet the best was still to come.\nThe match may have been slipping away from England, a 3-0 ODI series sweep in Australia's sights.\nBut a team of such extraordinary greatness refuse to take their foot off the gas and in the 41st over, with the ball seemingly sailing for six from the middle of Sophie Ecclestone's bat, Gardner primed herself for even more magic.\nShe could have been forgiven for being emotionally and physically drained from the century, but instead she plucked the ball from the air with one hand, let it go as her momentum took her over the rope, and managed to stay on her feet to retrieve it just inches off the ground.\nThe Ricky Ponting stand behind her went silent in suspense at her scarcely believable display of athleticism, before erupting with delight when the replay was shown on the big screen.\nBBC Test Match Special's Henry Moeran described it as \"a moment of Women's Ashes history,\" former England spinner Alex Hartley said it was \"the best catch ever in the women's game\" while Rainford-Brent went a step further in her glowing assessment.\n\"That was the catch of the century,\" she said. \"That will be shown for many years to come and just shows the difference with Australia and their fielding.\"\nSpare a thought for 21-year-old Phoebe Litchfield, who had taken a screamer of her own just a few overs earlier, but her back-tracking, full-stretch dive to dismiss Danni Wyatt-Hodge was almost completely overshadowed.\nIt was a dominant performance from Australia, who were absolutely ruthless in showing England why they should have punished them when they had the chance in the second ODI.\nEngland did show some more fight but, somehow, they have got to find another gear to win all of the remaining matches if they are to regain the Ashes for the first time in more than a decade.\nThe series moves on to Sydney with the first of three T20s starting on Monday, but until then, Hobart will be remembered for Gardner and her grand day out.", "url": "https://www.bbc.com/sport/cricket/articles/cgq003y4qv3o"}