{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:10:16", "date_modify": "2025-05-20 13:10:16", "date_publish": "2023-07-25 13:04:40", "description": "Pep Guardiola says Manchester City will \"fight\" for defender Kyle Walker amid interest from Bayern Munich.", "filename": "sport_football_66303972_1747746616.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/17265/production/_130512849_gettyimages-1567244571.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66303972_1747746616.html", "title": "Manchester City ready to fight to keep Kyle Walker, says Pep Guardiola", "title_page": "Manchester City ready to fight to keep Kyle Walker, says Pep Guardiola - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester City boss Pep Guardiola says the Premier League champions will not let England defender Kyle Walker leave this summer without a fight.\nWalker said he was hurt after losing his spot in Guardiola's starting XI towards the end of 2022-23.\nThe right-back, 33, was on the bench for the Champions League final win against Inter Milan and Bayern Munich are keen to sign him.\n\"We will fight for him, like I'm pretty sure Bayern [will],\" said Guardiola.\n\"I don't know how it is going to finish.\"\nCity are preparing to face Bundesliga champions Bayern in a pre-season friendly at Japan National Stadium in Tokyo on Wednesday.\nWalker will be involved for the Premier League champions, who completed a historic Treble last season, with Guardiola insisting he is an integral part of the squad.\n\"He is an incredibly important player for us. He has very specific qualities that are so difficult to find worldwide,\" Guardiola added.\n\"His specific qualities are irreplaceable. We want him here but at the end I don't know what is going to happen.\n\"We need our best players out there against Bayern and we hope he is going to stay with us next season, so why should he not play?\"\nCity signed Walker from Premier League rivals Tottenham in July 2017 for £45m plus a further £5m in potential add-ons.\nThe England international has made 254 appearances for the Citizens, winning five Premier League titles, four EFL Cups, two FA Cups and the Champions League.", "url": "https://www.bbc.com/sport/football/66303972"}