{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:25:29", "date_modify": "2025-05-21 05:25:29", "date_publish": "2025-02-12 00:00:00", "description": "Ryan Hardie scores twice as Plymouth Argyle back up their FA Cup victory over Liverpool with an impressive 5-1 win over Millwall.", "filename": "sport_football_live_c99yl988pm4t_1747805129.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c99yl988pm4t_1747805129.html", "title": "Plymouth Argyle 5-1 Millwall: Ryan Hardie scores twice in Pilgrims' biggest win of the season", "title_page": "Plymouth Argyle 5-1 Millwall: Ryan Hardie scores twice in Pilgrims' biggest win of the season - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Plymouth Argyle backed up their FA Cup win over Liverpool with a 5-1 victory over Millwall that lifted them off the foot of the Championship.\nThe Pilgrims were two goals up inside the first 10 minutes, the first thanks to an unfortunate own goal by Joe Bryan before Ryan Hardie blasted home from the penalty spot.\nThe hosts scored two goals in quick succession in the second half to seal victory - Mustapha Bundu turned well before firing home and then Hardie got on the end of a poor backpass before coolly finishing.\nBryan got a consolation for the Londoners as he converted at the back post, but Nikola Katic stabbed the ball home after a goalmouth scramble for the hosts' fifth.\nThe win, Argyle's biggest since a 6-2 victory over Norwich in September 2023, moves them off the bottom of the table at the expense of Luton Town after the Hatters' defeat at Sunderland.\nArgyle are a point from safety while Millwall remain in 14th place after their heaviest defeat of the season.\nRiding high from that historic win over the Premier League leaders, Argyle started where they had left off as they began the game superbly.\nBryan turned the ball into his own net after Callum Wright's low cross was missed by Hardie, leaving the former Plymouth loanee wrong-footed as the ball came off his standing leg and squirmed past Lukas Jensen.\nSoon after the lead was doubled. Casper De Norre's high foot hit Pilgrims skipper Adam Randell in the face to concede a penalty kick, and Hardie – the goalscoring hero of Sunday – blasted in from 12 yards in similar vein to the spot-kick he converted against Liverpool.\nMillwall had chances but Mihailo Ivanovic headed wide, while record signing Camiel Neghli – making his first Championship start since joining last month – had a powerful 20-yard drive acrobatically tipped over the bar by Conor Hazard.\nHowever, Alex Neil's side looked a shadow of the team that were unbeaten in five, and had won their past four games in all competitions, as they struggled to create chances against a well-disciplined Argyle side.\nHardie almost had a second goal shortly before half-time but he curled wide from the edge of the box.\nSeven minutes after the break the Pilgrims scored their third.\nConor Hazard punted a free-kick midway inside the Argyle half towards centre-back Victor Palsson – who had occupied a spot on the right wing – and the Icelandic defender headed on to Bundu who fired home after good close control.\nThe home crowd did not have time to calm down before the fourth. A midfield mix-up ended with George Saville weakly passing back to his goalkeeper, and Hardie nipped in and dinked the ball past the onrushing Jensen.\nBryan made amends for his own goal when he side-footed in Femi Azeez's pass, but there was still time for Katic to touch in Plymouth's fifth from a few inches after Millwall failed to deal with an inswinging corner kick.\nPlymouth Argyle head coach Miron Muslic told BBC Sport:\n\"I knew it was going to be difficult because everything was so emotional on Sunday.\n\"I think we as staff found the right balance to support the lads to enjoy this great achievement, a historical moment, but also on the other side not to forget that the daily bread is this competition, and we have to collect points and we have to win games.\n\"That's why I'm pleased and proud of the performance and the win.\n\"The plan was to use this energy, to use this confidence from Liverpool from the first whistle - if we could manage to do this we knew then that we can also create some troubled moments for Millwall, knowing that Millwall is just defensively solid.\n\"We knew if we could put this structure back on the pitch, this intensity, we can create chances and we took advantage of it.\"\nMillwall head coach Alex Neil told BBC Sport:\n\"I'm bitterly disappointed, it couldn't have gone much worse.\n\"The goals we conceded, I didn't think Plymouth needed to do much to score them.\n\"It's just been a catalogue of errors throughout the match.\n\"We didn't penetrate, we struggled to get in behind them, and that was largely due to how I set us up, so from that perspective that's my responsibility.\n\"If you look back over the last decade in the Championship it's very rare that my teams would ever lose five goals, so from that perspective that is as bitterly disappointing for me as it is for the players.\n\"But whether we lose 1-0 or 5-1 - I know it's very different - it's three points gone. We need to focus on what the next game looks like.\"", "url": "https://www.bbc.com/sport/football/live/c99yl988pm4t"}