{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:27:26", "date_modify": "2025-05-21 05:27:26", "date_publish": "2025-02-01 09:03:22", "description": "Anto Cacace says Leigh Wood is a potential opponent after the Belfast boxer vacated his IBF world super-featherweight title on Friday.", "filename": "sport_boxing_articles_cq8k4vy7q4xo_1747805246.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8a2d/live/f2915f20-e07a-11ef-8f13-079709d48905.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_boxing_articles_cq8k4vy7q4xo_1747805246.html", "title": "Anto Cacace: Belfast boxer says Leigh Wood is potential opponent", "title_page": "Anto Cacace: Belfast boxer says Leigh Wood is potential opponent - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Anto Cacace has said Leigh Wood is a potential opponent after the Belfast boxer vacated his IBF world super-featherweight title on Friday.\nThe 35-year-old beat Joe Cordina to become world champion in Saudia Arabia in May 2024 before winning a non-title fight against Josh Warrington at Wembley Stadium four months ago.\nCacace was due to face his mandatory challenger for the IBF title, Eduardo 'Sugar' Nunez, in his next bout but will now be free to face any opponent after relinquishing his championship belt.\n\"It doesn't seem to be much of a secret but there's a couple of names in the mix,\" Cacace said when questioned by BBC Sport NI about links to a bout with Wood.\n\"I feel like it's a better decision to vacate for my family's future and for my future to create a legacy in this sport, and for my name to be remembered for big fights - so I think it's the correct choice.\n\"Leigh's a two-time world champion, he faced Josh Warrington, another two-time world champion. I just can't believe I'm in this position and fighting these type of guys so I'm just very appreciative and humble of the whole situation.\"\nCacace stunned the boxing world when he knocked out Cordina in the eighth round on the undercard of Tyson Fury and Oleksandr Usyk's first undisputed heavyweight showdown in Riyadh.\nThe underdog going into the fight, the Belfast man delivered a brutal performance to hand the Welshman his first professional defeat and claim the world title.\nHis first defence of that belt was due to be against former world champion Josh Warrington, before the IBF refused to sanction the fight as a world title contest because of the Leeds fighter's inactivity at super-featherweight.\nWithout the title on the line, Cacace claimed a unanimous points win over Warrington to complete a memorable 2024.\nNottingham fighter Wood is a former featherweight world champion who has wins over Michael Conlan and Josh Warrington but has not fought since beating Warrington in October 2023.", "url": "https://www.bbc.com/sport/boxing/articles/cq8k4vy7q4xo"}