{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 08:15:32", "date_modify": "2025-04-26 08:15:32", "date_publish": "2025-02-26 10:43:27", "description": "The shirt worn by Duncan Forbes the night Norwich City gained promotion to English football's top flight for the first time goes on display.", "filename": "sport_football_articles_c1enz2nn7j7o_1745655332.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3b38/live/6b771120-f424-11ef-9822-d3d66c578726.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c1enz2nn7j7o_1745655332.html", "title": "Norwich City: Promotion shirt worn by Duncan Forbes goes on display", "title_page": "Norwich City: Promotion shirt worn by Duncan Forbes goes on display - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The shirt worn by Norwich City captain Duncan Forbes the night the club won promotion to the top flight of English football for the first time has gone on display at Carrow Road.\nThe Canaries drew 1-1 at Watford in their final game of the 1971/72 season to secure the old Second Division title with the players throwing their shirts to supporters at full-time.\nForbes' jersey ended up in the hands of young fan Glenn Stuart who has now donated it to Norwich City's Historical Trust.\n\"It was a privilege to have the shirt but I've never considered it my property and felt I was keeping it for posterity,\" Mr Stuart told BBC Radio Norfolk.\n\"It's been in my mind to donate it to the trust - I kept it at home in a drawer so it's great other people will get to see it.\"\nForbes joined Norwich from Colchester United in 1968 and went on to make 295 appearances during his 13 years with the Norfolk club.\nFormer Norwich manager Dave Stringer was a team-mate of the Scotsman when they won the Second Division title.\n\"Duncan was a winner and wanted the best out of himself and the players around him - he would always make sure everyone did what was expected of them,\" he said.", "url": "https://www.bbc.co.uk/sport/football/articles/c1enz2nn7j7o"}