{"authors": ["Nick Webb", "www.facebook.com"], "date_download": "2025-05-20 13:51:44", "date_modify": "2025-05-20 13:51:44", "date_publish": "2023-07-31 15:34:42", "description": "New Welsh Fire men's coach Mike Hussey says the new-look franchise starts with a clean slate - but is unsure when Jonny Bairstow will appear.", "filename": "sport_cricket_66360349_1747749104.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/E983/production/_130597795_gettyimages-1334898590.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66360349_1747749104.html", "title": "The Hundred: 'Clean slate' for much-changed Welsh Fire men's squad", "title_page": "The Hundred: 'Clean slate' for much-changed Welsh Fire men's squad - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Welsh Fire coach Mike Hussey says the franchise will be starting with a clean slate after two unsuccessful years.\nEx-Australia batter Hussey and most of the squad are new recruits to the Cardiff-based squad.\n\"We see it as a clean slate, we've got a great opportunity to build something we can all be proud of,\" said Hussey.\nBut there is no certainty when England wicketkeeper Jonny Bairstow will play for the franchise.\n\"I was involved with Sydney Thunder at the Big Bash when the team was low on reputation, and it takes everyone working together from the ground up, it's so rewarding,\" said Hussey.\nBairstow has only played twice for Welsh Fire, starring in two wins in 2021 but pulling out of the 2022 event because of his heavy workload.\n\"Jonny's had a reasonably important series going on, so we're not 100 percent sure, but we're hoping to see him at some stage. The Ashes is a huge series, he's got a new baby in his life and a World Cup coming up so we're totally respectful of that,\" explained Hussey.\n\"If and when I do get my chance it's a really exciting prospect to be playing for Welsh Fire at my home ground, it's going to be a fun month. I refer to myself as an adopted Welshman and it's good to be back at a ground where I know the conditions and I've been relatively successful,\" Douthwaite told BBC Sport Wales.\n\"Mike Hussey is definitely towards the top end of the long list of coaches I've worked with, he's a world-renowned coach, I'm really looking forward to learning as much as I can off him, pestering him and picking his brains.\"\nThe new man charged with bringing it all together on the field is Somerset's Championship captain Tom Abell, recently part of Somerset's T20 Blast winning side and a previous Hundred player with Birmingham Phoenix.\n\"The focus of the last couple of days has been trying to gel and create that team environment, everyone's chomping at the bit to get going in that first game against Manchester,\" said Abell, who was targeted as a top signing and leader after earning England ODI selection early in 2023- although he missed out on a cap through injury.\n\"It's a completely different format (from leading a four-day side) and I'll be learning on the job but I've got a great group around me. We've been trying to establish roles and get clarity on how we're going to look to play.\n\"We've also been chatting about sporting culture in Wales and what it means to people, so we'll be looking to do the best we can for the people of Wales.\"\nWelsh Fire men take on Manchester Originals at Sophia Gardens at 15:00 BST on Wednesday, 2 August.", "url": "https://www.bbc.com/sport/cricket/66360349"}