{"authors": ["Brent Pilnick", "www.facebook.com"], "date_download": "2025-05-21 06:24:28", "date_modify": "2025-05-21 06:24:28", "date_publish": "2025-01-14 07:19:11", "description": "Miron Muslic says he has not had any time to think about Plymouth Argyle's forthcoming FA Cup tie against Premier League leaders Liverpool.", "filename": "sport_football_articles_cvg9kdylg62o_1747808668.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8454/live/80a7e120-d1e0-11ef-80e5-9f0b215d3fef.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cvg9kdylg62o_1747808668.html", "title": "Miron Muslic: New Plymouth Argyle boss not focusing on Liverpool FA Cup tie", "title_page": "Miron Muslic: New Plymouth Argyle boss not focusing on Liverpool FA Cup tie - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Miron Muslic says he has not had any time to think about Plymouth Argyle's forthcoming FA Cup tie against Premier League leaders Liverpool.\nThe Pilgrims will face the six times champions of Europe early next month after beating Brentford in the third round on Saturday.\nMuslic, who was appointed late on Friday night, was in the stands for the victory and takes charge of his first game on Tuesday night when Argyle host fellow Championship strugglers Oxford United.\nThe Pilgrims are bottom of the second tier and parted company with head coach Wayne Rooney on 31 December.\nThe Liverpool tie will be Muslic's sixth game in charge, five of which are at Home Park.\n\"I'm not thinking about stuff like this,\" Muslic told BBC Sport when asked about Liverpool's visit.\n\"The last 72 hours has been so much for me and I've tried to maximize my attention towards the team.\n\"I tried maximise my attention towards the things I can immediately impact, and this is my team and Oxford and QPR next Saturday.\n\"Liverpool is far, far away. So when Liverpool is in front of us two days before I will jump in on Arne Slot and Liverpool for sure, but not before.\"", "url": "https://www.bbc.com/sport/football/articles/cvg9kdylg62o"}