{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:24:00", "date_modify": "2025-05-21 04:24:00", "date_publish": "2025-01-23 16:08:13", "description": "Ulster hooker Tom Stewart backs the \"brilliant\" Simon Easterby to \"get Ireland firing\" in the Six Nations.", "filename": "sport_articles_c99y1gnvnk3o_1747801440.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a9aa/live/f76b3670-d9a3-11ef-941c-57ca5bda0a5e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c99y1gnvnk3o_1747801440.html", "title": "Six Nations 2025: 'Brilliant' Simon Easterby will 'get Ireland firing'", "title_page": "Six Nations 2025: 'Brilliant' Simon Easterby will 'get Ireland firing' - Tom Stewart - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ulster hooker Tom Stewart has backed the \"brilliant\" Simon Easterby to \"get Ireland firing\" in the Six Nations.\nEasterby has stepped up as interim head coach to lead Ireland's bid for a third successive title, with Andy Farrell on British and Irish Lions duty.\nStewart was coached by Easterby on the 2022 Emerging Ireland tour before working with the former flanker in the senior team set-up.\n\"I worked with Si and he was kind of my first introduction into the Irish setup, he was my head coach for the Emerging Ireland tour and I thought he was brilliant,\" said Stewart, who won his two Ireland caps during the 2023 Rugby World Cup warm-up games.\n\"Obviously he's worked closely with Andy Farrell for a number of years now and he's taken a lot from him and I have no doubt that he has what it takes to get that Ireland team firing.\"\nStewart did not make the Six Nations squad amid an injury-wrecked season that has restricted him to just two substitute appearances for Ulster.\nBut having returned from a two-month lay-off in last week's Investec Champions Cup win over Exeter Chiefs, Stewart is targeting a run of games with the province.\n\"It's was brilliant,\" Stewart said of his return.\n\"On Saturday I was more than delighted to come through the game and get the result we did and to be back playing at home it was pretty special.\"\nThe 24-year-old added: \"I think the big thing for me was to just get through the minutes and a big thing coming back from injury is not trying to think about it and thinking about getting your game ready out on the pitch.\n\"Now it's about getting minutes under the belt and trying to build up a bit of form.\"", "url": "https://www.bbc.com/sport/articles/c99y1gnvnk3o"}