{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:28:00", "date_modify": "2025-04-26 06:28:00", "date_publish": "2025-02-27 11:50:21", "description": "Hibs fan views on 3-1 win at Dundee United", "filename": "sport_articles_c9wp545l8llo_1745648880.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8db2/live/fa9a9350-f450-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_c9wp545l8llo_1745648880.html", "title": "Hibs fan views on 3-1 win at Dundee United", "title_page": "Hibs fan views on 3-1 win at Dundee United - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "We asked for your thoughts on the 3-1 win over Dundee United that sent Hibs fourth in the Premiership.\nHere's what some of you said:\nKenny: Was scrappy at times but we defended well again. David Gray got the subs on at the right time and that lifted the team again, and it was no surprise when we scored. A great goal from Kieron Bowie and then another from Junior Hoilett to seal it. Another great result.\nFM: Good to see Bowie showing his class, but got to wonder about the 16 points we've lost from winning positions throughout the season. Would've had a real chance for a top-two finish.\nJohn: Fantastic result and will admit I didn't see it coming the way we were playing. All I can say is thank you Hibernian for proving me wrong. The derby on Sunday should be a cracker as both teams are on form at the moment.\nAndy: What a finish. Admittedly, we have benefitted from VAR decisions in the last two games, both of which have resulted in wins. However, the fight and resilience in this team is amazing. I love watching them. Being in the away end with the last-minute winner was electric, and we can now head into the derby full of confidence.\nSandy: There are new Hibs heroes born every match these days. Tonight it was the turn of Bowie and Hoilett. This win was a hard-won 3-1, but gives us a much-deserved fourth place. There's a climate change at Easter Road - the new Tornadoes perhaps?", "url": "https://www.bbc.co.uk/sport/articles/c9wp545l8llo"}