{"authors": ["Matthew Henry", "www.facebook.com"], "date_download": "2025-05-20 13:02:51", "date_modify": "2025-05-20 13:02:51", "date_publish": "2023-08-01 11:02:13", "description": "England coach Brendon McCullum reiterates his wish for his side to stick to their attacking style after the drawn Ashes.", "filename": "sport_cricket_66370732_1747746171.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5C58/production/_130604632_gettyimages-1569350135.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66370732_1747746171.html", "title": "The Ashes 2023: Brendon McCullum praises England's 'refined' style", "title_page": "The Ashes 2023: Brendon McCullum praises England's 'refined' style - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Coach Brendon McCullum reiterated his wish for England to stick to their attacking style after the drawn Ashes but said they have \"refined\" their approach through the series.\nEngland beat Australia by 49 runs in the fifth Test to tie the series 2-2.\nThe hosts stuck to the style used since McCullum and captain Ben Stokes took charge last year, even after they fell 2-0 behind after two Tests.\n\"For us that is our best chance of winning,\" said McCullum.\n\"From our point of view the most pleasing aspect is when we were under the most pressure at 2-0 down we stayed true to that and were able to manufacture some results that allowed us to walk away at 2-2.\"\nAustralia, who retain the urn as holders after the draw, won a dramatic series opener at Edgbaston by two wickets - a Test that included a bold England declaration on day one and the steady loss of wickets in the second innings as the hosts looked to press the game on.\nThe biggest criticism of their style came in the first innings of the second Test when Ollie Pope, Joe Root and Ben Duckett were all out attacking short balls in a 43-run defeat.\nBut England hit back in a tight three-wicket win at Headingley before dominating with a superb, attacking performance in Manchester, only for rain to mean they had to settle for a draw.\nAt The Oval on Monday they completed another nervy win as Stuart Broad bowled England to victory to deny Australia in pursuit of 384.\n\"What we are trying to do is allow ourselves to get in a space in our own minds where it allows your talent to come out,\" said McCullum.\n\"If you're weighed down by fear of failure or by external noise all you're doing is suffocating that talent. So it's as simple as that.\n\"Sometimes we'll get the balance wrong with the style we play but you've got teams good enough to stand up to you and make you pay when the time comes and Australia did that in the first couple of Test matches.\n\"But we refined it slightly as the series wore on.\"\nMonday's finale marked the end of Broad's career, while Moeen Ali, who took a crucial 3-76 while battling a groin injury, confirmed his Test retirement, having returned to replace injured spinner Jack Leach in the series.\n\"We'll miss them, but they have left a huge imprint on the side,\" said New Zealander McCullum, whose record now stands at 13 wins from 18 Tests after being appointed in May last year.\n\"It's been great to have them around and I'm sure their legacies will carry on to the next generation.\"\nMcCullum also praised openers Zak Crawley and Ben Duckett, who impressed with 480 and 321 runs respectively in the series.\n\"Ben Duckett's turned into a really serious player at the top of the order for us,\" said McCullum.\n\"He's had a great series and touching on Zak, coming into the series he was under quite a lot of pressure.\n\"Then 480 runs at a strike rate of nearly 90 against the best bowling attack in the world, against the Dukes ball in an Ashes series, people don't do that, you know?\n\"We've seen someone really grow and mature over the last six weeks or so.\"\nEngland's next red-ball assignment is not until January, when their 'Bazball' approach will be given another tough examination with a five-Test series in India.\n\"There'll be different challenges for each member of the squad and the coaching staff over the next little while,\" added McCullum.\n\"What will be really important for the time India comes will be trying to dial back into what we've achieved in the last 14-15 months and to try and make sure the team turns up with the same clarity of thought when we go about things.\n\"Until then I'm sure the boys will have a good time, they'll score some runs, take some wickets and we'll all make some birdies.\"\nEngland bowler Chris Woakes was named player of the series for his 19 wickets in three Tests, having only come into the series for the third match.\nHe took a brilliant 4-50 on the final day, including the crucial wickets of openers David Warner and Usman Khawaja, plus Steve Smith who fell as part of a collapse of 5-30 to Woakes and Moeen in the afternoon.\nWoakes revealed he was a doubt in the run-up to the series finale because of a minor quad tear.\n\"It was one of those where I bowled the day before and didn't feel it,\" he said. \"The day before that I was feeling it.\n\"I felt it in over 10 and I was a bit worried because it was the first innings and I thought, 'Oh, no, it could be going' but then I ended up bowling 25 in the first innings and it disappeared.\"\nWoakes had not played under Stokes and McCullum before this series after various injury issues in 2022.\n\"I wasn't sure if I was going to play cricket again,\" he said.\n\"At no point did I think I'd be stood here now with with what I've achieved.\"", "url": "https://www.bbc.com/sport/cricket/66370732"}