{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:43:28", "date_modify": "2025-04-26 03:43:28", "date_publish": "2025-03-05 08:53:32", "description": "PSV Eindhoven 1-7 Arsenal: Fan views", "filename": "sport_football_articles_cz7vllg780eo_1745639008.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cz7vllg780eo_1745639008.html", "title": "PSV Eindhoven 1-7 Arsenal: Fan views", "title_page": "PSV Eindhoven 1-7 Arsenal: Fan views - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "We asked for your thoughts after Arsenal thrashed PSV Eindhoven in the Champions League.\nHere are some of your comments:\nSam: Our best performance in a long time! When teams don't sit back and it is end to end, Arsenal are a very strong outfit and it showed. Martin Odegaard being back to his best as well is a massive confidence boost.\nNigel: Simply seven-sational. Hopefully this will provide that rocket we need in the league. Seven goals and seven well-worked plays.\nMike: Fantastic all around. Great to see the team not sitting back. Just need everyone to not expect Arsenal to come out and beat Manchester United like that. If the players take that into the weekend, they will have a great chance.\nNaz: Great result away at a tough venue, but have we used up all of our goalscoring \"luck\" for the next few matches?\nSteve: Can't mask the fact that we are missing a lethal striker, but it's a massive testimony to character and resilience to go to PSV and hit seven with six different scorers.\nRehan: That was one of the best performances I've ever seen from Arsenal - a great way to get back after their depressing performance in the Premier League. People who thought Arsenal didn't have a chance of winning the Champions League should start doubting themselves now, as Arsenal have shown great enthusiasm in this tournament and came third in the table.", "url": "https://www.bbc.co.uk/sport/football/articles/cz7vllg780eo"}