{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:38:14", "date_modify": "2025-05-21 03:38:14", "date_publish": "2025-02-10 13:51:34", "description": "Josh Taylor to make debut at heavier weight in Glasgow", "filename": "sport_boxing_articles_cx2m7xmw340o_1747798694.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1338/live/11e5e2b0-e7b5-11ef-ae7d-97b156abf29f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_boxing_articles_cx2m7xmw340o_1747798694.html", "title": "Taylor to make debut at heavier weight in Glasgow", "title_page": "Josh Taylor to make debut at heavier weight in Glasgow - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former undisputed light-welterweight world champion Josh Taylor has decided to move up a weight and will make his welterweight debut to challenge WBO European champion Ekow Essuman in Glasgow on 17 May.\nThe 34-year-old \"Tartan Tornado\" has signed with promoter Frank Warren's stable for his first fight since losing a rematch to Jack Catterall in May 2024.\nTaylor took time out after back-to-back defeats by Teofimo Lopez and Catterall but returns at the heavier 67kg weight at a yet-to-be-announced venue.\nThe Prestonpans fighter has signed for Queensberry Promotions in what he previously called the \"final chapter\" of this career.\nWarren said: \"I am so much looking forward to returning to Scotland with the nation's biggest star and our latest signing, Josh Taylor, headlining and rebooting his career at welterweight, where I believe he can again do big things.\n\"But he will be up against it with Ekow Essuman in the opposite corner.\n\"What a good fight that is, that is a quality fight. Two really quality fighters. Esso is a real, real quality operator. He comes to fight and Josh is going to have his hands full.\"\nBotswana-born Essuman - the 35-year-old nicknamed The Engine - has won 21 and lost one in his professional career after outpointing the previously undefeated Ben Vaughan in November and is the former British and Commonwealth welterweight champion.\nTaylor, meanwhile, is 19-2 (13 KOs) in his previous division.\nOn the undercard, fellow Scots Lee McGregor and Nathaniel Collins will fight at featherweight.\nMeanwhile, East Kilbride's David Jamieson will take on London's Aloys Youmbi in a heavyweight contest.", "url": "https://www.bbc.com/sport/boxing/articles/cx2m7xmw340o"}