{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:15:03", "date_modify": "2025-05-20 14:15:03", "date_publish": "2023-07-29 17:26:05", "description": "South Africa produce a strong defensive performance to beat a dominant Argentina and finish Rugby Championship runners-up.", "filename": "sport_rugby-union_66350321_1747750503.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1546C/production/_130584178_gettyimages-1562893979.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-union_66350321_1747750503.html", "title": "South Africa 22-21 Argentina: Springboks edge impressive Pumas by single point", "title_page": "South Africa 22-21 Argentina: Springboks edge impressive Pumas by single point - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "South Africa faced a stern test of their World Cup credentials as they edged an impressive Argentina to finish runners-up in the Rugby Championship.\nSantiago Carreras put the Pumas 6-0 up before Eben Etzebeth and Damien de Allende gave the hosts a 15-9 lead.\nArgentina dominated the second half but Marnie Libbok's breakaway try with 12 minutes left proved crucial.\nMateo Carreras and Gonzalo Bertranou scored late tries but South Africa held on for the win in Johannesburg.\nThe result could have been different if Gloucester fly-half Santiago Carreras had not missed two second-half penalties as Argentina fell agonisingly short of a first win over the Springboks since 2018.\nIt would also have given them back-to-back wins following their victory over Australia two weeks ago.\nSouth Africa's win came after New Zealand cruised past Australia, scoring six tries in a 38-7 win, to claim their third Rugby Championship in as many years and retain the Bledisloe Cup for the 21st year in a row.\nThe Springboks play the All Blacks on 25 August in a warm-up game before the start of the defence of the World Cup, with both sides looking to become the first team to win the trophy four times.\nThere was a lengthy delay seconds after kick-off at Ellis Park when South Africa scrum-half Grant Williams was caught by a high challenge from Juan Cruz Mallia as the Argentina full-back looked to charge down his kick.\nWilliams' first international start lasted only 16 seconds as he appeared to be knocked unconscious when the jumping Mallia's hip struck his head, while referee Andrew Brace took no action against the full-back, saying the contact was unavoidable.", "url": "https://www.bbc.com/sport/rugby-union/66350321"}