{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:35:51", "date_modify": "2025-04-26 07:35:51", "date_publish": "2025-02-27 15:04:24", "description": "Rangers fans have their say on Barry Ferguson's first game in charge", "filename": "sport_articles_c1jpp5e56z1o_1745652951.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f30c/live/e7d71790-f51b-11ef-8c03-7dfdbeeb2526.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_c1jpp5e56z1o_1745652951.html", "title": "Rangers fans have their say on Barry Ferguson's first game in charge", "title_page": "Rangers fans have their say on Barry Ferguson's first game in charge - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "We asked for your thoughts on the 4-2 comeback win over Kilmarnock in Barry Ferguson's first game in charge of Rangers.\nHere's what some of you said:\nDougie: Great fightback. Some leadership at last. In the 74th minute I actually saw the management team talking tactics and formations. In the 90th minute, I again saw the manager shouting orders - been a long time since I saw that.\nBill: The difference between this game and the weekend was at 2-0, Philippe Clement's team would have capitulated. Ferguson saw the young centre-back was being bullied and outmuscled and made a change. This was the catalyst for the revival. With a strong defence, the team could go forward with confidence. The previous manager would have persevered and failed.\nAlexander: I was dreading the rest of the game after Killie's blistering start, enabled by our non-existent defending. The spirit and character came after the substitution and the first goal. A much-improved performance and really good comeback result is to be applauded, however, the defence still worries me a lot. There are hard games to come but a good start.\nJames: What a difference a new manager makes. Early days but after a shaky start it's the best game I have seen since the derby. With Ferguson at the helm, and the new takeover, the good old days are just around the corner.\nRalph: Given the amount of time Ferguson has had with the players, it would have been harsh to blame him had they lost. I honestly believe Rangers would have lost this match under Clement, so already the new manager has made a difference. The defence is a nightmare and must be a priority moving forward.", "url": "https://www.bbc.co.uk/sport/articles/c1jpp5e56z1o"}