{"authors": ["Dan Roan", "www.facebook.com"], "date_download": "2025-04-26 07:28:00", "date_modify": "2025-04-26 07:28:00", "date_publish": "2025-02-27 19:39:58", "description": "Premier League chief executive Richard Masters insists \"there's no civil war\" between clubs over financial regulations.", "filename": "sport_football_articles_c7899z2vgmdo_1745652480.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7e6d/live/d26f35c0-f5a4-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c7899z2vgmdo_1745652480.html", "title": "Richard Masters: Premier League chief says there is 'no civil war' between clubs over financial regulations", "title_page": "Richard Masters: Premier League chief says there is 'no civil war' between clubs over financial regulations  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Premier League chief executive Richard Masters insists there is no \"civil war\" between clubs over financial regulations.\nEarlier this month, plans to replace controversial profit and sustainability (PSR) rules were delayed amid legal challenges.\nClubs had been expected to adopt the new squad cost ratio (SCR) system for the 2025-26 campaign, but a trial is now set to continue.\n\"There's no civil war - that would not be the way that I would put it,\" said Masters, who was speaking at the Financial Times Business of Football Summit.\n\"Alignment among Premier League clubs has never been easy. Maybe it's a little bit more difficult at the moment.\n\"But to change to a new system, particularly with what's at stake, is a big decision. If clubs need more time to do it, then that's OK. We will carry on that path.\n\"We've agreed in all probability on PSR in 2025-26 and then we'll look again during the course of that season at whether we'll make the move to SCR.\"\nEverton and Nottingham Forest were both docked points last season for breaching PSR, which was introduced a decade ago and allows clubs to post maximum losses of £105m over a three-year reporting cycle.\nSCR is similar to Uefa's existing financial sustainability rules, allowing clubs to spend up to 85% of their total revenues on squad-related costs, with any sanctions applied 'in-season', rather than at a later stage.\nOne of the factors behind the decision to delay the switch was the uncertainty surrounding a fresh legal challenge by Manchester City against the Premier League over new rules governing sponsorship deals.\nEarlier this month the Associated Party Transaction rules between 2021 and 2024 were deemed unlawful by a tribunal panel, with a second determination on the updated rules pending.\nThe Premier League is also awaiting the outcome of the hearing into City's 115 charges of alleged financial rule breaches. The club denies wrongdoing.\nWhen asked when there may be an outcome, Masters refused to be drawn on a date: \"You won't be surprised to learn I won't be talking about this. I can't.\n\"The disciplinary panel has heard the case and they must be left alone now to consider their decision, and given the time and space to be able to do that. And that's pretty much as far as I can go.\"\nMasters also shrugged off an earlier claim by Crystal Palace chairman Steve Parish that the prospect of an independent regulator in English club football has \"paralysed the game and driven it into the courts\".\n\"The league has wind in its sails, rather than [being] paralysed,\" said Masters. \"I would reject that.\n\"We'll function well next season under whatever financial system. We've got really strong fundamentals. If we were stalling in all areas I would be concerned, but we're not.\"\nHowever, Masters did say he had \"concerns\" about the football governance bill, which will establish a regulator and is still passing through parliament.\n\"We are talking to the government at the moment about what sensible amendments can be made to the bill to help assuage those concerns some of our clubs have about it.\n\"The general concern is about 'mission creep'. There are very few regulators over time that end up with the same brief they were written on day one, and I worry about that as well.\n\"So if we can keep it light touch, and we can keep it growth-focused, then maybe it can help the game in the way that the people who put this together intended.\n\"By the end of year we'll have a better view as to what 'personality' this regulator is going to have. If it wants to tighten financial regulation in future there's a danger it will go too far and stop the virtuous circle that the Premier League and the EFL have created, and that's our principle concern.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c7899z2vgmdo"}