{"authors": ["George Lakin", "www.facebook.com"], "date_download": "2025-04-26 07:57:26", "date_modify": "2025-04-26 07:57:26", "date_publish": "2025-02-25 12:22:34", "description": "Wolves news: Opinion - Club cannot afford to lose Nelson Semedo", "filename": "sport_football_articles_ckg8zlr7j21o_1745654246.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e360/live/b7cd5770-b62f-11ee-bc2f-cb5579b90709.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_ckg8zlr7j21o_1745654246.html", "title": "Opinion - Club cannot afford to lose Nelson Semedo - BBC Sport", "title_page": "Wolves news: Opinion - Club cannot afford to lose Nelson Semedo - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Wolves face the very real prospect of losing their third captain in three seasons this summer. Nelson Semedo is out of contract at the end of the campaign and already free to negotiate with other clubs.\nThe club have felt the effects of losing example-setters Ruben Neves and Max Kilman in recent years, and Semedo has set that same precedent having taken over the armband from Mario Lemina in December. Cool heads and model professionals such as these are few and far between.\nWolves have already triggered a two-year extension on his original deal, but further talks have stalled. Age seems a sticking point, but 31-year-old Semedo's professionalism, fitness and consistency largely circumvents this issue.\nMake no mistake, if he is allowed to leave he will be hard to replace. Semedo's athleticism - key to manager Vitor Pereira's high-energy, wing-back-driven system - has been vital since the new manager arrived.\nHe has led by example, displaying discipline in his role on and off the pitch, embodying Wolves' recent turnaround. Losing him would leave a huge gap, especially with other veterans like Jose Sa, Craig Dawson and Pablo Sarabia also likely to depart.\nYoung prospect Pedro Lima has been touted as a successor, but he lacks Semedo's experience. He still has a lot to learn, and who better to mentor him further than Semedo? Too much too soon can break a player, and Wolves know a squad short on know-how is a risk. With a full rebuild looming, Semedo could be the bridge to a new era, setting the tone for a generational shift.\nFrom a business perspective, replacing him with an upgrade would cost a small fortune - far more than bending the wage structure for a proven asset.\nSince Pereira's arrival, the club's hierarchy has made smart calls, and with relegation fears fading, focus turns to next season. The situation with Semedo is their next critical juncture.\nHis departure would mark another loss of leadership; his retention could steady Wolves through transition.\nFor most fans it is an absolute no-brainer: Semedo must stay.", "url": "https://www.bbc.co.uk/sport/football/articles/ckg8zlr7j21o"}