{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:24:21", "date_modify": "2025-05-21 07:24:21", "date_publish": "2025-03-28 15:40:24", "description": "Luton boss Matt Bloomfield promises to \"be careful\" with Reece Burke as the centre-back looks for minutes on the pitch.", "filename": "sport_football_articles_ce8m8301e7vo_1747812261.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5bb7/live/cf2e9c00-0be5-11f0-8ae9-2975efdc7f47.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ce8m8301e7vo_1747812261.html", "title": "Reece Burke: Luton will handle defender's return from injury with care", "title_page": "Reece Burke: Luton will handle defender's return from injury with care - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Luton boss Matt Bloomfield has promised to \"be careful\" with Reece Burke as the centre-back looks for minutes on the pitch following a lengthy injury lay-off.\nBurke returned as an 87th minute substitute in the 2-1 win at Cardiff City on 11 March, his first game back after suffering a quad injury in November, but was unused against Middlesbrough before the international break.\nHe will be hoping for another opportunity against former club Hull City on Saturday, when fellow defender Kal Naismith will also be hoping to get onto the pitch having recently served a one-match ban following his red card at Burnley.\n\"[They have] great experience, fantastic knowhow - obviously Burkey's been out for a while, so we have to be careful with him, we can't over-expose him to too many minutes but he's been a key player for this football club and we expect him to be so again,\" Bloomfield told BBC Three Counties Radio.\n\"Kal was unfortunate he lost his place because of the sending off, but he's chomping at the bit and he's ready to go.\"\nThere is also promising news about Teden Mengi, who had surgery on a knee injury suffered in training in December.\n\"Teden is now starting to join in a little bit with the group. He's not ready to take in games just yet, he's not in full training yet, but he's done a little bit,\" Bloomfield added.\nMidfielder Tahith Chong is back in full training though and could make his first appearance since early January against Hull.", "url": "https://www.bbc.com/sport/football/articles/ce8m8301e7vo"}