{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:00:19", "date_modify": "2025-05-20 13:00:19", "date_publish": "2023-08-01 12:23:02", "description": "Stuart Broad's finale was a fitting finish to an incredible Ashes series. I'll admit 2-2 is a fair result, writes Glenn McGrath.", "filename": "sport_cricket_66367005_1747746019.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/F33F/production/_130217226_mcgrath.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66367005_1747746019.html", "title": "The Ashes 2023: Glenn McGrath pays tribute to Stuart Broad but questions ball change", "title_page": "The Ashes 2023: Glenn McGrath pays tribute to Stuart Broad but questions ball change - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England are not going to be the only ones who will miss the retiring Stuart Broad.\nAustralia may have always cast him as the villain but that is only because we respect him.\nTaking the final two wickets of the fifth Ashes Test to draw an incredible series is a fitting end for a bowler I cannot speak highly enough about.\nHis phenomenal statistics - 604 wickets in 167 Tests - speak for themselves. They are a testament to his mental desire, skill and longevity.\nIn terms of us fast bowlers there is only his team-mate James Anderson ahead of him and no-one else is going to get close.\nBroad played his part of the final day but we should not forget Chris Woakes - another England player I have always admired.\nHe is a quality cricketer with bat and ball.\nI don't think he bowled a bad ball in the three Tests he played and those performances were capped by his four wickets to break Australia's resistance.\nOf course, Australia will be disappointed to lose.\nThey will have been in the dressing room on Monday night feeling flat because they came here to win the urn not just to retain it.\nWe know David Warner will not be back and there will be doubts about whether Steve Smith or any of the bowlers will play another away Ashes too.\nA chase of 384 would have been Australia's second-highest in Test history so it was always going to be tough.\nThey stuck at it impressively, especially given the momentum England had built over the previous days.\nI must say - and it is not the reason England won - the fact the umpires changed a 37-over-old ball on day four - the original was knocked out of shape when Mark Wood hit Usman Khawaja on the helmet - for one that looked like it had been used for no more than 15 overs has to be looked into to.\nThat should not happen.\nBut, ultimately, the wait for a first Ashes series win in the UK since 2001 goes on another four years.\nThis summer will be a great learning experience for Australia captain Pat Cummins.\nSome have called for him to step aside but he should carry on.\nUntil now he has been excellent as captain and Australia still leave England as world Test champions, remember.\nThis is the first time Cummins the captain has been really challenged. You learn the most from those situations.\nHe will be able to look back on the fall-out from Alex Carey's stumping of Jonny Bairstow at Lord's or Zak Crawley's whirlwind innings at Old Trafford and think what he can do differently.\nIt is not going to get much tougher than facing this aggressive England side with the crowd so revved up behind them. Cummins can only get better as a result of this series.\nAnd Australia should still be proud for playing their part in what has been an incredible summer.\nIt has captured the imagination of the public in England and Australia, just like the 2005 series I played in did.\nIn that series we had two teams with relatively similar styles but what has made this one so special is England and Australia have played in completely opposing ways.\nEngland have had their attacking style and Australia stuck to their more traditional way of playing.\nI still insist there is room for both in Test cricket. We have seen you cannot 'Bazball' all of the time.\nBut, having watched England up close throughout this series, I am still a massive fan of what Ben Stokes is doing.\nI love the concept of backing yourself to take the positive option and play on the front foot.\nAfter the second Test I said England had been too casual, that it was causing them to make mistakes, but since then they have certainly improved.\nAt Old Trafford they played the perfect game until the rain came.\nI just wish occasionally England would be more honest with the messaging.\nWe have seen them come out and up ultra-positive, like at Lord's when Ben Duckett said England's attack of Australia short balls that cost them three wickets was the right ploy.\nSugarcoating everything does not work. People see right through it.\nBut over the coming years it will be natural that Australia take on some of what they have seen from England.\nIf nothing else, it is simply the way the game is moving. That is also how the young batters in Australia are playing the game.\nWe have to protect Test cricket and series like these are the ones that will do it.\nBoth teams have played their part in that because without Australia digging in as they have we would have not had the thrilling finishes we did.\nThe fact we had four close Tests - Manchester was the only time one team really got on top - means both teams will feel they could have won.\nEqually, England and Australia will know they could have lost as well.\nSince Headingley I have copped a lot of stick from the crowds, with England fans asking me what happened to my 5-0 prediction at the start of the summer.\nI am always going to be positive and back Australia but I'll admit 2-2 is a fitting result to the series.\nBoth teams were on the ropes at times but managed to hang in there.\nWe'll have to see how things are but in two-and-a-half years time I bet I'll be making the same prediction again.\nEngland have lost 4-0, 4-0 and 5-0 in their last three trips down under.\nWinning in Australia will be Bazball's next frontier.\nGlenn McGrath was speaking to BBC Sport's Matthew Henry", "url": "https://www.bbc.com/sport/cricket/66367005"}