{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:32:49", "date_modify": "2025-05-20 13:32:49", "date_publish": "2023-08-01 18:02:25", "description": "Declan McManus scores twice from the spot, but it was not enough for The New Saints as Luxembourg's Swift Hesperange ended their Europa Conference League.", "filename": "sport_football_66289604_1747747969.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/67D4/production/_130608562_2023-07-25thenewsaintsvsfcswifthesperange129.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66289604_1747747969.html", "title": "Europa Conference League: Swift Hesperange 3-2 The New Saints (4-3 agg) - visitors out of Europe", "title_page": "Europa Conference League: Swift Hesperange 3-2 The New Saints (4-3 agg) - visitors out of Europe - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Declan McManus struck twice from the spot, but it was not enough for The New Saints as Luxembourg's Swift Hesperange ended their Europa Conference League campaign.\nThe Cymru Premier champions fell behind early in the second qualifying round second leg as Dominik Stolz hit home.\nMcManus levelled from the spot as Saints showed their battling qualities.\nAfter Rachid Alioui and Simao Martins struck for the hosts, McManus added his second.\nThe visitors had fought back in the first leg to give them hope as they travelled to Stade de Luxembourg.\nBut Craig Harrison saw his side gift the hosts the ball in poor fashion early on and captain Stolz ruthlessly took advantage as he slipped the ball between Connor Roberts' legs.\nHaving equalised late on to ensure Saints went into the rematch level at 1-1 at Park Hall, Ryan Holding had a great chance to do so again.\nBut after Stoltz's opener, Holden and Ryan Brobbel hit the same woodwork as Saints sought a rapid response in vain.\nThey had to wait until the 22nd minute to hit back as Declan McManus struck from the penalty spot after Holden's run was unceremoniously and illegally ended by Martins.\nMcManus smashed his shot into the middle of the net, giving Geordan Duprie no chance to block it.\nMorocco international Rachid Alioui broke the deadlock after the break as he squeezed the ball home and when Martins added the hosts, it seemed a long way back for Saints.\nBut McManus was given another chance from the spot and again capitalised to give his side renewed hope.", "url": "https://www.bbc.com/sport/football/66289604"}