{"authors": ["Tom Rostance", "www.facebook.com"], "date_download": "2025-05-21 07:49:09", "date_modify": "2025-05-21 07:49:09", "date_publish": "2025-05-18 17:47:32", "description": "Carlos Alcaraz ends world number one Jannik Sinner's 26-match winning streak with a 7-6 6-1 win in the Italian Open final.", "filename": "sport_tennis_articles_c5y6g49le80o_1747813749.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e9a5/live/da0025a0-340c-11f0-8944-2b1dd2bd7018.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_tennis_articles_c5y6g49le80o_1747813749.html", "title": "Italian Open results: Carlos Alcaraz beats Jannik Sinner in straight sets to win title", "title_page": "Italian Open results: Carlos Alcaraz beats Jannik Sinner in straight sets to win title - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Carlos Alcaraz ended world number one Jannik Sinner's 26-match winning streak with a 7-6 (7-5) 6-1 win in the Italian Open final.\nSinner, playing in his first tournament since a three-month doping ban, was hoping to become the first Italian men's singles winner at the tournament since Adriano Panatta in 1976.\nBut after edging a tense tie-break, four-time Grand Slam champion Alcaraz was a class above in the second set.\nSinner had two set points in the first set but hit a backhand return wide to let reigning French Open champion Alcaraz off the hook.\nThe 22-year-old Spaniard took full advantage with some masterful play in the second set, sealing the title with a cross-court volley at the net.\n\"I'm just really happy to get my first Rome [title], hopefully it's not going to be the last one,\" said Alcaraz.\n\"The first thing I want to say is that I'm just really happy to see Jannik back at this amazing level.\n\"I'm sure it wasn't easy for him coming back after three months and making the final is something insane, so I have to congratulate him.\n\"I'm proud of myself, with the way I approached the match mentally. Tactically, I think I played pretty well from the first point until the last one.\"\nSinner's winning run stretched back to October - when Alcaraz beat him in the China Open final.\n\"There have been a few months that weren't easy,\" Sinner said.\n\"It's been a great result just to be here in the final. I tried today, but that's all I had. It was a good test.\"", "url": "https://www.bbc.com/sport/tennis/articles/c5y6g49le80o"}