{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:52:19", "date_modify": "2025-05-20 14:52:19", "date_publish": "2023-07-27 15:00:20", "description": "As Africa prepares to host for the first time, BBC Sport Africa examines the chances of the continent's four participants: South Africa, Malawi, Uganda and Zimbabwe.", "filename": "sport_netball_66301465_1747752739.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/14281/production/_130516528_gettyimages-1411816804.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_netball_66301465_1747752739.html", "title": "Netball World Cup 2023: South Africa, Malawi, Uganda and Zimbabwe aim high", "title_page": "Netball World Cup 2023: South Africa, Malawi, Uganda and Zimbabwe aim high - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The Netball World Cup will be held in Africa for the first time when the quadrennial tournament takes place in South Africa from 28 July to 6 August.\nOne African team will compete in each of the initial four-team pools, with Malawi, Uganda and Zimbabwe joining the hosts in hoping to become the first champions from the continent.\nAll of the matches during the 16th edition of the finals will be played at the Cape Town International Convention Centre.\nThe opening day features Zimbabwe, in only their second World Cup, facing an Australia side who are hot favourites to become champions. Uganda's match against holders New Zealand and Malawi's meeting with England are also among the early highlights.\nBBC Sport Africa takes a look at each of Africa's four representatives, starting with the hosts.\nPool C | World ranking: 5th\nWith home advantage, the hosts are hoping to go one game further than their fourth-placed finish in 2019.\nTheir meeting with Jamaica looks the most intriguing of their early games, being a rematch of an encounter won by the Spar Proteas by two points during the first pool stage in 2019. Ahead of that game, former Australia international Norma Plummer's side will hope to have beaten Wales and Sri Lanka.\nCoach: Hugely experienced Plummer is a World Cup winner as both player and coach, having first tasted victory on the court with Australia in 1975 and from the sideline as coach of her country in 2007.\nShe also coached Australian team West Coast Fever before a first spell at South Africa's helm from 2016 to 2019.\nPlummer had targeted a glorious career swansong at the 2019 tournament and stepped down after its conclusion. Now 78, the revered veteran returned to the role in 2022 and has another chance to see her dream of victory with a second nation realised to further underline her status as one of the greatest coaches in netball history.\nStar player: One player who has lauded Plummer's abilities is Karla Pretorius. The defender was named most valuable player at the 2019 World Cup, rewarding a second successive exceptional tournament after she made the most interceptions at the previous edition.\nPretorius played with current international team-mate Lenize Potgieter at Team Bath in the UK's Netball Super League (NSL) in 2016 before becoming the first South African to feature in the Australian Super Netball League when she joined Sunshine Coast Lightning, where her dazzling performances have contributed to a succession of trophies.\nFirst appearance (1963): South Africa came sixth when they appeared at the inaugural tournament in England in 1963. Despite victories over Scotland, West Indies, Wales and Ceylon (the old name for Sri Lanka), it remains their lowest ever finish.\nTotal appearances - 16\nBest performance (runners-up, 1995): After 28 years away due to the apartheid sporting ban, South Africa returned in style with a flawless performance across pools containing New Zealand and England as they reached the final in 1995 before defeat to Australia.\nAhead of this tournament, governing body Netball South Africa and their partners have invested significantly in a bid to ensure a podium finish on home soil.\nKey stat: 12 years after making her international debut, Bongiwe Msomi is South Africa's record caps holder with 158 international appearances.\nPool stage one fixtures: Wales (28 July), Sri Lanka (29 July), Jamaica (30 July)\nPool B | World ranking: 6th\nAfter sixth-placed finishes at the past three tournaments, Malawi are aiming to go further following a 2019 edition in which they had the misfortune of being matched with Australia and New Zealand in the second pool stage, finishing third behind both to miss out on a place in the semi-finals.\nAt this World Cup, England await in Malawi's second game, as well as less daunting opponents in Scotland and Barbados. The Queens should be full of confidence, having only been beaten by South Africa in qualifying, but will be without captain Caroline Mtukule through injury.\nCoach: Having been technical director since May 2020, Sam Kanyenda provided continuity when he was appointed interim coach in place of Peace Chawinga-Kaluwa in June, and has said he will not greatly alter the team's approach.\nStar player: Strathclyde Sirens' Towera Vinkhumbo is one of four Malawi internationals who play club netball outside their homeland and the defender is approaching her fourth consecutive World Cup after an outstanding campaign in the NSL.\nFirst appearance (1995): Malawi made their debut at the World Cup in England in 1995.\nDefeats to the hosts, South Africa and Trinidad and Tobago meant they finished fourth behind those teams in the second pool stage, but an overall record of four victories from their eight games saw the newcomers finish eighth out of a record 27 teams at the tournament.\nTotal appearances - 6\nBest performance (5th, 2007): On their third appearance at the finals in New Zealand in 2007, Malawi recovered from a thrashing in their opener against the hosts to beat Botswana and Wales on their way to a heavy quarter-final loss to England.\nA narrow victory over South Africa was a memorable way to clinch their best ever finish at the World Cup, taking fifth ahead of their African rivals.\nKey stat: Mwai Kumwenda was the first African to finish a World Cup as top scorer, with 321 goals in 2015.\nPool stage one fixtures: Scotland (28 July), England (29 July), Barbados (30 July)\nPool D | World ranking: 8th\nDespite being one of the teams with the least World Cup experience, Uganda coach Fred Mugerwa says fans can expect his players to impress again four years after they finished seventh in England.\nMugerwa suffered a major blow when the prolific Peace Proscovia - the top scorer in the NSL at the time - was ruled out of the finals with a medical issue in May, but his team will be confident of beating Trinidad and Tobago and Singapore in a group where reigning champions New Zealand look certain to provide their toughest challenge.\nThe She Cranes coach believes strongly in his squad but has told them to take the tournament one step at a time - advice he is wisely adopting personally, too, after his excitement for the 2015 World Cup was extinguished when he was sacked shortly before it began.\nStar player: Goal shooter Mary Cholhok Nuba has top-scored three times in the NSL, including the most recent season when 41 of her 808 goals came in Loughborough Lightning's Grand Final victory over London Pulse.\nStar player: Felisitus Kwangwa earned her first senior cap as a 19-year-old, becoming captain four years later and winning player of the match three times at the 2019 World Cup.\nThose performances caught the eye of Surrey Storm who made Kwangwa the first Zimbabwean to play in the NSL. Now 28, the goal defence says her country can win the tournament.\nFirst appearance (2019): Zimbabwe made their World Cup bow in England in 2019, beating Sri Lanka 79-49 on their debut before a loss to Australia and a thrilling two-point victory over Northern Ireland - a set of results which saw them finish second in their opening pool.\nThey lost every quarter to New Zealand and Malawi during the second pool stage but also beat Barbados comfortably as part of a highly respectable first appearance that established them on the world stage.\nTotal appearances - 2\nBest performance (8th, 2019): Zimbabwe were rightfully proud to finish eighth in England, despite losing an all-African match-up for seventh against Uganda.\nDriven on by their drumming fans, they showed ample spirit as they chased a comeback before dancing off court.\nKey stat: Veteran goal attack or defence Joice Takaidza was the third-highest African scorer in 2019, amassing 198 points across seven matches.\nPool stage one fixtures: Australia (28 July), Fiji (29 July), Tonga (30 July)\nNetball South Africa chief executive Blanche de la Guerre says early high demand for high-profile matches is likely to be replicated once fixtures for the latter stages of the tournament are known.\n\"All the South Africa matches are sold out,\" De La Guerre told Cape Talk, external. \"Australia, New Zealand, England and Jamaica are very popular. In one venue, you can see the top 16 countries in the world.\"\nThe remaining tickets are available from the Netball World Cup official website, external.", "url": "https://www.bbc.com/sport/netball/66301465"}