{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:44:56", "date_modify": "2025-05-20 12:44:56", "date_publish": "2023-08-03 13:00:13", "description": "Wales head coach Warren Gatland says his side will do something special at the 2023 Rugby World Cup in France.", "filename": "sport_rugby-union_66396725_1747745096.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4B03/production/_130630291_cdf_280723_cf_wales_rugby_training_050.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-union_66396725_1747745096.html", "title": "World Cup 2023: Warren Gatland says Wales will do 'something special' at France tournament", "title_page": "World Cup 2023: Warren Gatland says Wales will do 'something special' at France tournament - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wales head coach Warren Gatland says his side will do something special at the 2023 Rugby World Cup in France.\nWales begin their preparation with a warm-up game against England on Saturday at the Principality Stadium before the tournament opener against Fiji on 10 September.\nWales only finished fifth in the Six Nations with one win.\n\"This group is in a good place and I promise you now we will surprise a few people at the World Cup,\" said Gatland.\n\"I am excited and I am telling you now that this team will do something special. I love Wales being written off and people can keep doing that because it just makes us stronger.\"\nGatland returned for his second stint as Wales head coach when he replaced Wayne Pivac in December 2022.\nWales only managed to defeat Italy during the Six Nations and have slipped to ninth in the world rankings.\nThere were off-the-field controversies during the tournament with the players threatening to strike ahead of the home game against England because of contractual issues before that threat was averted.\nWales have lost Alun Wyn Jones, Justin Tipuric and Rhys Webb to international retirement, while Six Nations captain Ken Owens will miss at least the World Cup pool stages because of a back injury.", "url": "https://www.bbc.com/sport/rugby-union/66396725"}