{"authors": ["Andy Burke", "www.facebook.com"], "date_download": "2025-05-21 05:31:10", "date_modify": "2025-05-21 05:31:10", "date_publish": "2025-01-31 17:33:57", "description": "Six Nations: Scotland will be out for revenge against Italy - Negri", "filename": "sport_articles_cpvmdp2kg1eo_1747805470.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d50f/live/d2f093c0-dff8-11ef-b0ce-4196690a3761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cpvmdp2kg1eo_1747805470.html", "title": "Six Nations: Scotland will be out for revenge against Italy", "title_page": "Six Nations: Scotland will be out for revenge against Italy - Negri - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Italy back-row Sebastian Negri believes Scotland will be out to avenge their loss to the Azzurri in Rome last year when they begin their Six Nations campaign at Murrayfield on Saturday.\nA 31-29 loss at the Stadio Olimpico ended Scotland's title hopes in the 2024 tournament and Negri believes that will fuel Gregor Townsend's side.\n\"We know Scotland will be hurting from that,\" Negri said.\n\"We know they've talked about putting things right and a bit of revenge, so we've got to expect that.\"\nAs well as beating the Scots, Italy drew with France and beat Wales in last season's championship and there is a feeling that after years of consistently being the weakest side in the tournament, Gonzalo Quesada's team are now ready to compete.\n\"I feel like we're in a really good cycle at the moment,\" Negri added.\n\"Obviously, we've been through ups and downs as a team. But I feel like this is a really good Italian team to be a part of. We can't shy away from that.\n\"And it's a different challenge for us now. With the cycle and where we are as a team, we've got to put in some performances and get some results. That's an exciting thing to be a part of.\n\"We're under no illusions. We know it's going to be a tough game. I looked at their team yesterday. I just see a really quality team there. Full of depth.\n\"You say that maybe Italy are probably in one of their better cycles, that we're a really good team. I look at Scotland and I can say exactly the same.\"", "url": "https://www.bbc.com/sport/articles/cpvmdp2kg1eo"}