{"authors": ["www.facebook.com"], "date_download": "2025-04-26 04:00:30", "date_modify": "2025-04-26 04:00:30", "date_publish": "2025-03-07 00:00:00", "description": "Derry City sit in the Premier Division basement place after drawing 1-1 with Galway United at the Brandywell.", "filename": "sport_football_live_c5y08p9ypr4t_1745640030.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b3b7/live/0e6e70c0-fba1-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_c5y08p9ypr4t_1745640030.html", "title": "Derry slip to bottom spot after home draw with Galway", "title_page": "Derry slip to bottom spot after home draw with Galway - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Derry City sit in the Premier Division basement place after drawing 1-1 with Galway United at the Brandywell.\nMichael Duffy's second half penalty for City cancelled out Moses Dyer's goal on the stroke of half time.\nThe result ends the Candystripes' losing streak at three but Tiernan Lynch has now won just one of his opening five games as manager.\nShamrock Rovers' first domestic win of the season over St. Pat's means that Derry are now propping up the table.\nThe hosts had the first chance when Liam Boyce found Dom Thomas on just three minutes but the Scottish forward poked wide.\nWhile clear-cut chances were hard to come by in the first half, any that did arrive came the way of Derry. Duffy was probing as always and his square ball was tantalisingly out of the reach of a sliding Boyce.\nThomas went close again 10 minutes before the break but saw his effort parried by Evan Watts in the Galway goal before Duffy blazed the rebound over.\nJust as it looked as though we would head into the break goalless, the home side's defensive frailties were laid bare by the visitors' only meaningful attack in the opening period.\nEd McCarthy launched a long throw into the box that was flicked on and slid home at the back post by Dyer. A simple set-piece goal that the Candytsripes failed to deal with.\nAfter their first-half impotence, Derry were gifted a way back into proceedings on 52 minutes. Sadou Diallo's drilled shot from the edge of the box was inexplicably blocked by the outstretched elbow of Patrick Hickey.\nIt gave Duffy the chance to equalise from 12 yards - he duly accepted as he blasted an emphatic spot-kick into the roof of the bet.\nThe home crowd were urging their side on for more but they did not immediately kick on.\nGalway substitute David Hurley almost caught them cold with a mazy run and shot that Brian Maher repelled on 70 minutes before Ronan Boyce also decided to go it alone immediately after with some fancy footwork of his own but his effort went wide.\nIt wasn't quite the Alamo but the Candystripes did have a couple of chances to grab all three points, most notably when substitute Pat Hoban connected with Ben Doherty's deep cross but his header landed on the roof of the net.\nThere were Derry hearts in mouths in stoppage time when Kevin Holt's mistimed clearing header was seized upon by Jimmy Keohane but Maher kept him out as both sides had to settle for a point apiece.\nDerry are back on their travels next Saturday evening as they travel to the Showgrounds to take on Sligo Rovers.", "url": "https://www.bbc.co.uk/sport/football/live/c5y08p9ypr4t"}