{"authors": ["Matt Gault", "www.facebook.com"], "date_download": "2025-05-20 12:01:09", "date_modify": "2025-05-20 12:01:09", "date_publish": "2023-07-26 07:06:17", "description": "Ireland lock Ryan Baird on why he loves fishing, idolising Rafael Nadal, meeting Paul O'Connell and keeping an eye on South Africa.", "filename": "sport_rugby-union_66299211_1747742469.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/108C4/production/_130508776_gettyimages-1248512474.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-union_66299211_1747742469.html", "title": "Ryan Baird: Ireland lock on fishing, Rafael Nadal, Paul O'Connell and the Springboks", "title_page": "Ryan Baird: Ireland lock on fishing, Rafael Nadal, Paul O'Connell and the Springboks - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "When it comes to pre-arranged 10-minute interview slots with elite athletes, it is easy to come away thinking you didn't really get to know them.\nTime is limited and the interviewee, as is their right, often opts to stick to the script.\nBut there was no sense of that with Ireland lock Ryan Baird.\nWith Ireland's preparations for the Rugby World Cup in full swing, Baird recently held court with reporters during a media day at the Irish Rugby Football Union's High Performance Centre in Dublin.\nWhile the time spent with the Leinster second row was brief, it proved a fascinating discussion, with rugby forming only a small part of the chat.\nThere was, however, plenty of time to talk about Baird's interests outside of how he makes a living.\n\"I love fishing. I haven't actually done it in a while, just with holidays and all that stuff, but I do love fishing,\" he says, still shivering from the ice bath he had taken before fulfilling his media duties.\n\"We were playing yesterday in Carton and the river that flows through there, you can see fish in and I was thinking I'd love to get a rod out and try to catch some.\"\nBaird, who turns 24 on Wednesday, was introduced to fishing by his father. It was his 12th birthday and he enjoyed catching mackerel, pollock and cod off Kilmore Quay in Wexford.\nHe says it took him a long time to pick it back up again but, having rediscovered his love for it, fishing - as well as the odd bit of golf - offers him a welcome sense of solitude away from the intensity of Test-level rugby.\n\"It's very therapeutic, fishing, because you're out there and you don't know when you're going to get a hit and you might not get a hit, so it teaches you a great level of discipline and patience.\n\"Then if it's a good day, it's calm, you can hear the birds around you and just chill out. It's very nice.\n\"A lot of the time I'd just go by myself. It's very relaxing. I feel very present when I'm there.\"\nBaird is part of a 42-man Ireland squad being put through their paces before the World Cup warm-up matches begin with a home Test against Italy on 5 August in Dublin.\nWith 11 caps to his name, he is one of the more inexperienced members of the group, but has already demonstrated his Test credentials by impressing in Ireland's Grand Slam-clinching Six Nations win over England in March with a performance head coach Andy Farrell labelled \"immense\".\nMaking the final 33-man World Cup squad and representing Ireland in France would undoubtedly surpass the England game as the apex of Baird's international career but it is interesting to note that he didn't idolise Irish World Cup stars of previous generations growing up.\nIndeed, the sportsperson that really caught his eye was tennis star Rafael Nadal, whose \"fight, competitiveness and passion\" captured a young Baird's imagination.\n\"I wouldn't have really looked up to anybody in rugby,\" he reveals.\n\"It was more tennis, Nadal was my idol when I was growing up. I enjoyed watching and playing rugby but it would have been Nadal who I idolised.\"\nBut Baird also admits to having been blown away by meeting Paul O'Connell, the Ireland and British and Irish Lions icon who is now part of Farrell's backroom team.\nO'Connell, a 2009 Grand Slam winner and three-time Lions tourist, is revered in Irish rugby circles and the Munster great's knowledge and aura was not lost on Baird when they first met.\n\"So Paulie to me when I came in, I was just blown away. You see him on TV but I never really focused in on watching him - it was Paul O'Connell, great captain, Lions tours, so successful.\n\"But then you come in here and you see why he was so successful. That was the most impressive part.\"\nOf course, with a World Cup on the horizon, the tournament has to feature in the discussion at some point and Baird admits he has been keeping tabs on South Africa and New Zealand in the ongoing Rugby Championship.\nIreland will face the Springboks, the reigning world champions, in their third pool game in France on 23 September while the All Blacks are potential quarter-final opponents should both teams make it that far.\n\"Yeah, you kind of have a little peak at their [South Africa's] line-outs and the same with New Zealand, just seeing if there are any trends that teams are trying to do at the moment leading up to the World Cup,\" explains Baird, who made his Ireland debut in the 2021 Six Nations.\n\"But I wouldn't be putting too much attention on it, I'd be putting more attention on here.\"\n'Here' meaning Ireland's training programme, of course. Like the rest of his team-mates, Baird has thrown himself into prep ahead of the warm-up games and, when asked if he studies other players in training, his response is unsurprisingly thoughtful.\n\"We were actually just talking about it yesterday and then we sat down and were chatting about what we're all looking at individually,\" he said.\n\"You can learn so much by just watching them on the laptops, seeing how they do something. If I'm struggling to get square in a defensive line, for example, I'll watch someone who's really good at it and pick their brain and they'll say 'oh, what I do is set up this way and then I look this way'.\n\"There's probably someone in the building here who is better than you at pretty much everything, you'll have your one or two super strengths, you don't want too many of those, and then you see someone else's and you pick on them and pick on someone else.\n\"That's when you get the best results, when everyone is sharing and it's collaborative, because everyone has their point of difference and you're trying to learn from each and every person.\"", "url": "https://www.bbc.com/sport/rugby-union/66299211"}