{"authors": ["Holly Bacon", "www.facebook.com"], "date_download": "2025-05-21 06:06:16", "date_modify": "2025-05-21 06:06:16", "date_publish": "2024-12-24 15:34:34", "description": "Kieran McKenna press conference: Arsenal vs Ipswich preview", "filename": "sport_football_articles_czenjrk566jo_1747807576.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8a85/live/ac9e2280-490a-11ef-9e1c-3b4a473456a6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_czenjrk566jo_1747807576.html", "title": "Kieran McKenna press conference: Arsenal vs Ipswich preview", "title_page": "Kieran McKenna press conference: Arsenal vs Ipswich preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "On his midfield options to replace Sam Morsy who is suspended: \"We've got a couple of options which we need to be honest. Massimo [Luongo] has been ill over the last week or two so we have to assess how he is as well. It was good to get Kalvin [Phillips] on the pitch in the second half of the Newcastle game. That was important, he is still working his way back. Jack [Taylor] had a good game against Bournemouth. Neither are necessarily like for like replacements for Sam but they can hopefully bring their own strengths to it.\"\nOn Phillips' fitness he added: \"I think he had a better week last week with his ankle. He said he didn't feel anything from the game and he trained well today. I guess 100% is when you have a few more games under your belt but I think from the ankle issue he had, much better.\"\nOn having Liam Delap back: \"He was a loss [against Newcastle], no doubt about it. He was always going to be. It's important to have him back, we're going to need his strengths in the game and we are going to need the other boys as well - that's for sure. It's nice to have him back.\"\nOn Arsenal's set pieces: \"They are a team who, set plays wise, you look at as a reference for everyone in the league. With some of the things they do, they have been excellent in that phase so we've got a few more days now to prepare over Christmas, a lot of hard work in the next 72 hours and we'll be as ready as we can be.\"\nOn the approach to playing teams such as Arsenal and Chelsea: \"For us as staff it's to try and come up with a game plan that gives us a chance to be competitive, to convince the players of that and then for the players to go again in a game they know they are going to be big, big underdogs in. But they go there with enough humility to know what the game is going to look like but also enough confidence to take the moments and opportunities when they come and to impose themselves and to find the belief that we can go there and try and get a result.\"\nMcKenna added that they have spoken about the mental qualities needed for this game: \"I think we need to show the right mentality first of all in the game. I think it's a chance to show our togetherness, our spirit, resilience, we're going to have to show a real mental strength. Our organisation is going to have to be really good and we're going to have to show bravery at different moments of the game as well to take them on in the way that we want to in different phases of the game. For me it's about the mental characteristics we want to show in the game, that's what we've spoken about this morning.\"", "url": "https://www.bbc.com/sport/football/articles/czenjrk566jo"}