{"authors": ["Stephen Watson", "www.facebook.com"], "date_download": "2025-05-19 15:37:05", "date_modify": "2025-05-19 15:37:05", "date_publish": "2017-08-16 18:01:32", "description": "Carl Frampton's partnership with manager Barry McGuigan may be close to ending, BBC Sport Northern Ireland understands.", "filename": "sport_boxing_40951707_1747669025.html", "image_url": "https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/6CAD/production/_97412872_framptonmcguigan.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_boxing_40951707_1747669025.html", "title": "Carl Frampton's partnership with Barry McGuigan 'may be close to ending'", "title_page": "Carl Frampton's partnership with Barry McGuigan 'may be close to ending' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Carl Frampton's partnership with manager Barry McGuigan may be close to ending, BBC Sport NI understands.\nFrampton's scheduled bout with Andres Gutierrez on 29 July was called off.\nFrampton, 30, was one pound overweight for the bout but the contest was still scheduled to go ahead until the Mexican was injured after slipping in a shower.\nWhen asked on Wednesday whether there was a rift in the camp and if a split was imminent, McGuigan's Cyclone Promotions declined to comment.\nFrampton, meanwhile, was unavailable for comment.\nAfter the late postponement of the 29 July bout, Frampton and McGuigan both apologised to the public but BBC Sport NI has been told by reliable sources that, behind the scenes, the relationship is beginning to unravel.\nLess than 10 days before Frampton's scheduled contest with Gutierrez, the Belfast boxer resigned as a director of Cyclone Promotions.\nFrampton has been guided by McGuigan since signing a professional deal with the former world featherweight champion in 2009 and the duo's relationship had appeared exceptionally close until very recently.\nThe fighter is also trained by McGuigan's son Shane while the manager's wife Sandra and their other sons Blain and Jake are also heavily involved in Cyclone Promotions.\nEarlier this year, there was a three-part documentary series on BBC TV, Fight Game: The McGuigans, which looked at the inner workings of Cyclone Promotions and followed closely Frampton's preparations for both his world title bouts in the US with Leo Santa Cruz.\nAfter landing the European belt by beating Kiko Martinez in February 2013, Frampton defeated the Spaniard again 19 months later to win his first world title as he clinched the IBF super-bantamweight title.", "url": "https://www.bbc.com/sport/boxing/40951707"}