{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-05-21 04:13:33", "date_modify": "2025-05-21 04:13:33", "date_publish": "2025-01-15 08:05:09", "description": "Man Utd news: Opinion - How United kept to PSR rules", "filename": "sport_football_articles_c70k4d62p41o_1747800813.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3b52/live/9721f9b0-4804-11ef-96a8-e710c6bfc866.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c70k4d62p41o_1747800813.html", "title": "Man Utd news: Opinion", "title_page": "Man Utd news: Opinion - How United kept to PSR rules - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Reporters covering Manchester United have repeatedly been told the club is committed to the Premier League's financial rules. They have also been told United are \"tight\" when it comes to their PSR position.\nThe detail of that - as with all clubs - is vague. But while they are dealing with the legacy of ridiculous contracts handed out to underperforming players, they will have a problem.\nSelling homegrown stars is a way to relieve the problem - which is why the future of Marcus Rashford is key in terms of what transfer business United might be able to do this month. But that policy risks alienating supporters, especially if another local lad, like Kobbie Mainoo, was offloaded.\nThe positive, if there is such a thing, around the huge debt United will probably take on for whatever stadium project they choose, is that it will not count in PSR calculations even though, in reality, it will have a massive impact on their budget because it will need paying back.\nFor now, expect overall costs to keep getting cut and more emphasis to be placed on better recruitment at first-team level. They have not been charged this time, but United are too close to spend their way out of their current mess.", "url": "https://www.bbc.com/sport/football/articles/c70k4d62p41o"}