{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:37:07", "date_modify": "2025-04-26 03:37:07", "date_publish": "2025-03-08 00:00:00", "description": "Millwall boost their hopes of reaching the Championship play-offs by coming from behind to beat Watford at Vicarage Road.", "filename": "sport_football_live_cvg5qggzj42t_1745638627.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9fae/live/b3fe3770-fc2b-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_cvg5qggzj42t_1745638627.html", "title": "Watford 1-2 Millwall: Lions come from behind to win", "title_page": "Watford 1-2 Millwall: Lions come from behind to win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Josh Coburn was again Millwall's match-winner, as they came from behind to beat Watford at Vicarage Road and boost their hopes of a Championship play-off place.\nMattie Pollock gave the Hornets the lead with his first league goal for the club, but Casper de Norre slotted into the corner after the break to level the score.\nAnd Coburn - who scored the only goal at Derby in Millwall's previous away game - headed home a right-wing cross as Watford suffered defeat at home for the sixth time this season.\nThey remain 11th, still three points adrift of the top six pending the results of later games, one place and one point better off than Millwall, who were grateful for a superb late save from Lukas Jensen when the ball flew towards the top corner off the head of defender Jake Cooper.\nThere was a minute's applause before kick-off in memory of Dennis Bond and Barry Hartle, both promotion winners with Watford, who passed away this week aged 77 and 85 respectively.\nWatford had skipper Moussa Sissoko back in the starting line-up in place of Tom Ince, while Millwall made three changes, with Coburn restored to provide some extra height up front.\nTom Cleverley's side made an assertive start, looking for space on both flanks and forcing Millwall to keep numbers behind the ball, and Jensen looked uncertain as he pushed away a fierce drive from Giorgi Chakvetadze and was fortunate the loose ball fell to one of his own defenders, who cleared safely.\nCoburn had an effort blocked at the other end following George Honeyman's cutback, but Chakvetadze was soon teasing the Lions defence again, leading to a chance for Imran Louza, who directed a sidefoot effort just wide of the post when he should have done better.\nThe pressure intensified, with Jensen doing well to crowd out Mamadou Doumbia after the young forward was found by Chakvetadze, but the keeper could not prevent Pollock's diving header from crossing the line despite getting a hand to the ball after a Watford corner flicked off the head of Coburn at the near post.\nHaving managed only one on-target effort before the break, Millwall went close when Jeremy Ngakia was penalised for a foul and Joe Bryan curled a free-kick round the wall but saw it fly just the wrong side of the post and into the side netting.\nAn impressive performance by Watford's teenage striker Doumbia was ended by injury, and the Lions soon levelled as Emakhu shrugged off the attentions of Ngakia on the left and found Belgian midfielder De Norre, who opened up his body to create the right angle and find the target.\nCleverley made further changes to try and revitalise the home side, with United States international full-back Caleb Wiley given his debut after arriving in the January transfer window.\nBut Wiley was unable to close down the space as Tristan Crama produced the right-wing cross for Coburn to direct his header beyond Egil Selvik's reach.\nAnd Millwall could have made it three just before the whistle, only for the Norwegian keeper to deny Aaron Connolly with a fingertip save.\nWatford head coach Tom Cleverley told BBC Three Counties Radio:\n\"Second half, technically we were off, and I think we dropped intensity as well. They smelt that and at this level you get punished.\n\"On the balance of the game, I don't think we deserved to lose it. But we have to improve on that second half. First half, we were good value for our lead but we just couldn't replicate that performance. We looked a tired outfit in the second half.\"\n(On Ramadan fasting) \"I think we're the most-affected squad in the league when it comes down to that. We work really hard with our nutritionists to make sure they're in the best condition they possibly can be.\n\"It's something we'll have to manage through this period. Five or six of our players today (were fasting). Did it have an impact? I don't know.\"\nMillwall boss Alex Neil told BBC Radio London:\n\"It's the old adage, a game of two halves. Watford dominated the first half, caused us a lot of problems.\n\"There were a couple of things we had to tinker with at half-time to help our shape and when we did that we got a lot better.\n\"We have got a difficult run-in, five of the top six away from home, so it's certainly not going to be easy. If we do get there (the play-offs), we'll certainly deserve it.\n\"We're not naive. We know we've got tough matches coming, but we've got a really good group, they fight for every ball, they play for the shirt, it matters to them, and I was delighted for them today.\"", "url": "https://www.bbc.co.uk/sport/football/live/cvg5qggzj42t"}