{"authors": ["Tyrone Smith", "www.facebook.com"], "date_download": "2025-05-21 07:35:02", "date_modify": "2025-05-21 07:35:02", "date_publish": "2025-01-22 11:53:29", "description": "'Dundee United can lay down a marker against Rangers'", "filename": "sport_articles_c75z3dn7593o_1747812902.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6c6e/live/69f3f4d0-d89f-11ef-9fd6-0be88a764111.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c75z3dn7593o_1747812902.html", "title": "'Dundee United can lay down a marker against Rangers'", "title_page": "'Dundee United can lay down a marker against Rangers' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Dundee United are a side that have rightly been lauded for the season they have had so far.\nI have used words like gritty and gutsy to describe the way they have performed in this campaign and that shouldn't mask the fact they have also played some decent stuff.\nThey have generally recovered well to any setbacks they have suffered.\nOne such setback was Monday night's Scottish Cup defeat at neighbours Dundee. That will undoubtedly be a huge blow to all involved at United.\nBut there is no time to wallow in self-pity – I suspect manager Jim Goodwin will be stressing all the positives – and there are plenty of them – surrounding the bigger picture to his players.\nThey are flying high in third place in the Premiership, the chance to finish as the best of the rest behind Celtic and Rangers remains very much in their own hands.\nSo this is a season that is delivering more, I suspect, than even the most optimistic of Tangerine fans could have predicted.\nHowever, it is now just the one win in their last four games, in all competitions for Goodwin's side.\nPerhaps Sunday's visit of second-placed Rangers is an opportunity for them to lay down a marker and show everyone they remain very much on track.\nTheir next three games – at home to Rangers, then away to Kilmarnock and Celtic – look tough, but this United team have upset the odds during the course of this campaign, and Goodwin will believe his side can emerge unscathed and very much on course for a European place.", "url": "https://www.bbc.com/sport/articles/c75z3dn7593o"}