{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-05-21 06:28:57", "date_modify": "2025-05-21 06:28:57", "date_publish": "2024-12-24 09:29:45", "description": "Former Premier League official David Coote will not appeal against his dismissal from referees' body the PGMOL.", "filename": "sport_football_articles_cevgn424jz2o_1747808937.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e760/live/3f68e370-c1d8-11ef-9e92-076070f32991.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cevgn424jz2o_1747808937.html", "title": "David Coote: Referee will not appeal against PGMOL sacking", "title_page": "David Coote: Referee will not appeal against PGMOL sacking - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Premier League official David Coote will not appeal against his dismissal from referees' body the PGMOL.\nCoote, 42, was sacked earlier this month following a \"thorough investigation\" into his conduct by the PGMOL (Professional Game Match Officials Limited).\nHe had the right to appeal, but sources have told BBC Sport the official has decided against doing so.\nBBC Sport has contacted Coote for comment.\nCoote was suspended by the PGMOL on 11 November pending a full investigation after a video allegedly showing him making derogatory comments about Liverpool and the club's former manager Jurgen Klopp was circulated on social media.\nA further investigation was opened two days later after the Sun published photos it says were taken during this summer's European Championship, alleging that they appear to show Coote sniffing a white powder through a rolled up US bank note.\nNeither the pictures nor the video have been verified independently by the BBC.\nThe PGMOL said Coote's actions made his position \"untenable\".\nThe organisation is continuing to offer support to Coote, having previously said it was \"committed to his welfare\".\nCoote is also under investigation by the Football Association and Uefa over his conduct.", "url": "https://www.bbc.com/sport/football/articles/cevgn424jz2o"}