{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:56:41", "date_modify": "2025-05-21 05:56:41", "date_publish": "2025-01-31 15:11:36", "description": "Ipswich winger Wes Burns is out for the rest of the season after suffering a torn anterior cruciate ligament during last weekend's defeat at Liverpool.", "filename": "sport_football_articles_c62qd0vgg39o_1747807001.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/37c1/live/f3b85dc0-dfdc-11ef-9e55-bfd035967447.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c62qd0vgg39o_1747807001.html", "title": "Ipswich winger Wes Burns to miss rest of season with torn ACL", "title_page": "Ipswich winger Wes Burns to miss rest of season with torn ACL - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ipswich winger Wes Burns is out for the rest of the season after suffering a torn anterior cruciate ligament during last weekend's defeat at Liverpool.\nThe 30-year-old Wales international will have surgery next week.\nBurns has featured in 18 of Ipswich's 23 Premier League games so far this season.\n\"He's seeing the very best people,\" said Ipswich boss Kieran McKenna.\n\"It's not a very complicated tear, I believe. You can never call an ACL straightforward, but it's an orthodox procedure and everyone is really positive about the prognosis.\n\"Of course he'll miss the rest of the season, and we'll miss him, but he'll be well looked after.\"\nBurns is the second Tractor Boys winger to suffer a season-ending injury after Chiedozie Ogbene sustained a torn Achilles in October.\n\"Wes and Chieo Ogbene are pretty unique profiles for us, so to lose both of them in the course of one season, and with the qualities that they have being so important to our system, it is a blow. That is what it is,\" added McKenna.\nAsked whether the injury will change his transfer plans before Monday's deadline, the Northern Irishman added: \"We have good depth in the squad and we have other players who can fill the role in different ways and with different qualities.\n\"We're not going to make any late panicked decisions in the transfer market. If there are players that could really help us and improve us, then we'd like to do so, but we're not going to add numbers just for the sake of cover. We're pretty strong in terms of cover.\"", "url": "https://www.bbc.com/sport/football/articles/c62qd0vgg39o"}