{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:58:02", "date_modify": "2025-05-20 11:58:02", "date_publish": "2023-08-06 08:04:12", "description": "The fourth meet of the Open Water Swimming World Cup is cancelled after water quality in the River Seine is judged to be \"below acceptable standards\".", "filename": "sport_swimming_66420677_1747742282.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/66B8/production/_130669262_gettyimages-1554614631-1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_swimming_66420677_1747742282.html", "title": "Open Water Swimming World Cup: Paris 2024 test event cancelled over pollution in Seine", "title_page": "Open Water Swimming World Cup: Paris 2024 test event cancelled over pollution in Seine - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "World Aquatics cancelled a test event for the Paris 2024 Olympics and Paralympics after water quality in the River Seine was ruled to be \"below acceptable standards.\"\nThe fourth meet of the Open Water Swimming World Cup was due to take place on 5 and 6 August.\nThe Seine is scheduled to host marathon swimming, triathlon and Para-triathlon events at the Olympics and Paralympics.\nWorld Aquatics said the health of athletes was its \"top priority\".\n\"Following recent above-average rainfall in Paris, the water quality in the Seine has remained below acceptable standards for safeguarding swimmers' health,\" read a statement.\n\"World Aquatics understands that further infrastructure projects will be completed to significantly improve water quality in the Seine in the lead-up to next year's Olympic Games.\n\"Based on this weekend, it is clear that further work is needed with Paris 2024 and local authorities to ensure robust contingency plans are in place for next year.\"\nParis 2024 organisers said efforts to make the Seine swimmable had \"significantly\" improved the quality of the water.\nThey are working with World Aquatics and local authorities on \"specific measures\" for the Olympics such as contingency days to \"reduce the impact of these meteorological risks\".\nWorld Triathlon and Paris 2024 organisers said they are \"confident\" the swimming legs of its Paris 2024 test event would go ahead in the Seine from 17-20 August.\nWorld Triathlon said: \"In the unlikely event that water quality does not meet the requirement of World Triathlon and public health authorities, a contingency plan is in place which would see the race(s) shifted to a duathlon format.\"\nSwimming is set to be one of the major legacies of the Games thanks to a 1.4bn euro (£1.2bn) regeneration project in Paris, with three open-air swimming areas accessible from the quayside by 2025.", "url": "https://www.bbc.com/sport/swimming/66420677"}