{"authors": ["Tom Chappell", "www.facebook.com"], "date_download": "2025-05-21 03:49:55", "date_modify": "2025-05-21 03:49:55", "date_publish": "2025-04-07 11:44:26", "description": "Portsmouth fan writer Tom Chappell gives his thoughts after defeat on the road to Millwall.", "filename": "sport_football_articles_c4g70p32lz0o_1747799395.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cfb0/live/98630020-13a2-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c4g70p32lz0o_1747799395.html", "title": "Portsmouth FC: Blues lose again on road to Millwall", "title_page": "Portsmouth FC: Blues lose again on road to Millwall - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "There is seemingly a palpable shift in opinion within pockets of the Pompey fanbase - from what was relative confidence of divisional status in the Championship next season - to a tangible fragility and nervousness in view of just how tight these last few weeks are going to feel during the campaign's climax.\nThat shift is in large part down to Pompey's inability to learn anything about themselves from previous misadventures away from home - twinned with an almost expected late resurgence from a number of sides below us.\nWhile games on the road are less attributable to conceding four or five now, and more often than not separated by the single goal - there is a horrible repeat pattern of no sooner looking like rescuing a point, to undoing it all and coming away with absolutely nothing.\nBoth the Preston and Millwall 2-1 defeats have similarities in scoreline and endeavour only visible after conceding.\nColby Bishop had probably the biggest chance of the first half, Matt Ritchie in turn struck the upright moments before Pompey's equaliser which felt like it would never find the back of the net. Outside of the aforementioned, there was little troubling Lukas Jensen all afternoon.\nIf Pompey are to stay in the Championship, it will almost certainly be through heavy reliance on fortunes at Fratton Park.\nWhich, albeit had been a source for an awful lot of our joy this season - heaps huge pressure on the outcomes of our remaining home games.\nMaximum home points and minimum away points would just about be enough from here.\nIf anything is to be taken from the upcoming midweek trip to Coventry - it will also have to come by doing something different away from home.\nPompey points away from home have come at a premium at the best of times, so a handful of those to aid the fight at the sharp end of a relegation battle would be extremely welcome.", "url": "https://www.bbc.com/sport/football/articles/c4g70p32lz0o"}