{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:38:36", "date_modify": "2025-04-26 03:38:36", "date_publish": "2025-03-04 22:51:41", "description": "After Glentoran's 1-0 win over Ballymena United at the Oval on Tuesday night, BBC Sport NI gets the views of both managers.", "filename": "sport_articles_ceqj7193v8po_1745638716.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/16e6/live/48da0030-f949-11ef-ab6a-cb409d79bd4e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_ceqj7193v8po_1745638716.html", "title": "Ballymena win 'so important' for Glentoran - reaction", "title_page": "Irish Premiership: Ballymena win 'so important' for Glentoran - reaction - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "After Glentoran's 1-0 win over Ballymena United at the Oval on Tuesday night, BBC Sport NI got the views of both managers.\nGlentoran boss Declan Devine on his side's victory:\n\"Tough game, obviously.\n\"We had a couple of opportunities to score and make the ending a bit easier on us.\n\"We're better than that, we can have more control than that.\n\"The ultimate goal was to get three points.\"\nOn the response to last week's Irish Cup exit to Bangor:\n\"We needed a response tonight. The players were hurting, we were all hurting, we were all sore after Friday.\n\"The anxiety crept in because we were hanging on.\n\"It was so important to get three points by any means. In periods we were good and in periods we were anxious.\"\nBallymena manager Jim Ervin on his side's performance:\n\"Extremely disappointed. It's another game I feel we haven't got what we deserved.\n\"Ultimately when you're on top in these games you need to score in order to get something from the game.\n\"First half we were super, actually, caused them a lot of problems with the boys up front.\n\"Second half, we didn't come out. Last 20/25 minutes we looked dangerous again, but the keeper has made a worldie, a great save.\n\"Performance-wise, other than 15 minutes at the start of the second half, I think the players were superb, gave me everything. On another night, we maybe score one or two goals, even three.\"\nOn refereeing decisions:\n\"The boys are gutted, they've come in at half-time and they feel the ball is over the line [from Stephen O'Donnell's header]and they should have had a penalty.\n\"I haven't seen any footage, so I'll wait and see any footage before I comment but they're adamant that the ball was over the line and that the foul [by Frankie Hvid] was in the box.\"", "url": "https://www.bbc.co.uk/sport/articles/ceqj7193v8po"}