{"authors": ["Chris Wathan", "www.facebook.com"], "date_download": "2025-04-26 04:20:19", "date_modify": "2025-04-26 04:20:19", "date_publish": "2025-03-03 15:44:39", "description": "Cardiff City's latest financial accounts show the Bluebirds continue to remain heavily reliant on owner Vincent Tan.", "filename": "sport_football_articles_c5y257llj3do_1745641219.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7ed8/live/b9152a40-f832-11ef-a8b4-b37546a32a57.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c5y257llj3do_1745641219.html", "title": "Cardiff City lose £11m as club remains reliant on owner Vincent Tan", "title_page": "Cardiff City lose £11m as club remains reliant on owner Vincent Tan - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Cardiff City recorded pre-tax losses of £11.66m in its last financial year, covering the 2023-24 season, with new accounts showing further support from owner Vincent Tan.\nBut the Championship side's latest financial results were boosted by £12m after selling a percentage share of a potential \"proceeds from a litigation claim made by the club\".\nCardiff did not name the case specifically, but has been involved in a long-running legal dispute with French club Nantes over the death of Emiliano Sala.\nThe Bluebirds previously filed a complaint in a French court claiming losses of more than £100m following the striker's death in a plane crash in January 2019. The 28-year-old had been travelling to south Wales to complete a £15m transfer from Nantes. The case is expected to be heard this summer.\nIn a statement on the accounts on the club's website, signed by chairman Mehmet Dalman and finance director Philip Jenkins, they say the £12m received is \"non-refundable and not dependant on the ultimate outcome of the litigation case itself\".\nCardiff had previously settled a High Court case with an insurance firm in connection with Sala's death, with these latest accounts showing an unnamed \"settlement arising from a contractual dispute\" to the value of £5.57m.\nElsewhere, the club's turnover fell by more than £3m and increased investment into the playing squad.\nWith the player wage bill up by 40% to £19.9m, it resulted in an operating loss of just under £10m – down by £1.1m compared to the previous year – with the club again detailing reliance on the ongoing support of majority shareholder Tan.\nThe Malaysian backer, who took control of Cardiff in 2010, added another £11.83m worth of loans, bringing the total owed to the businessman to around £68m.\nThe club says that, as previously, the loans will be written off or converted to equity, while interest is also being waived. Tan has also provided a written commitment outlining his ongoing support, without which the club admits its future \"would look much more precarious\".\nLoans from directors and other connected parties have also increased by an additional £11m, taking the total to £40.3m.\nOther outgoings included £1.13m on the club's academy which saw a new base open at the start of last season, with further investment planned.\nThe club also confirmed an initial £1.6m payment as part of the investment into a new training ground, including the signing of a 150-year lease with Vale of Glamorgan Council for the 42-acre site, with construction expected to start this summer in readiness for the 2026-27 season.\nThe club says such investment – including the increase in spending on the first-team squad – will help put it on a \"more stable, stronger footing for the future\".", "url": "https://www.bbc.co.uk/sport/football/articles/c5y257llj3do"}