{"authors": ["Jamie Strickland", "www.facebook.com"], "date_download": "2025-05-19 15:07:51", "date_modify": "2025-05-19 15:07:51", "date_publish": "2015-02-27 06:53:57", "description": "How a privateer took on the world's most expensive sport in the middle of the credit crunch - and won.", "filename": "sport_formula1_31588540_1747667271.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81311000/jpg/_81311720_jensonbuttonandrossbrawn.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_formula1_31588540_1747667271.html", "title": "The Formula 1 test that revealed the sport's greatest fairytale", "title_page": "The Formula 1 test that revealed the sport's greatest fairytale - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "There may be no winners and losers at pre-season Formula 1 testing, but it is a time when the true pace of a new batch of shiny cars is finally revealed. It is when the world gets its first clues as to who will be genuine contenders.\nSix years ago, F1 testing revealed something that would turn the sport on its head, as a privateer took on the world's most expensive sport in the middle of the credit crunch - and won.\nThis is the story of how the Brawn team won F1's drivers' and constructors' world championships in 2009.\nThe seeds for this modern F1 fairytale were sewn amidst another milestone in British motorsport history.\nAs Lewis Hamilton became the first British F1 world champion since 1996 in the most dramatic fashion - on the penultimate corner of the final lap of the final race of the 2008 season - Jenson Button was watching his F1 career and Honda's megabucks attempts at glory go up in flames.\nIn that 2008 season, British driver Button finished in the points just once as the Honda proved woefully off the pace, despite one of the highest investment budgets in F1, finishing second-last in the constructors' title race.\nPerhaps no one image summed up how far off the rails Button's career had strayed than that which followed the season-ending Brazilian Grand Prix. , external\nButton had just finished 13th when the rear end of his Honda caught alight as he sat in a queue of cars parked in the Interlagos pit-lane entry.\nBy chance, the car behind was that of the elated Hamilton, who barely looked up as Button's flaming Honda rolled backwards and hit the nose of his McLaren.\nButton, meanwhile, gave the RA108's barbecued posterior a withering look, paused to congratulate Hamilton, and then went off to beckon over a fire marshal.\nAt that moment, Button's dreams of ever becoming world champion himself seemed to mix and drift away with the smoke.\nBut even Button would not have realised how grim the situation was. Within weeks of the season ending, Honda announced it was pulling out of F1, external due to the global financial crisis.\nButton's time in F1 - along with that of veteran team-mate Rubens Barrichello - looked as good as over. Two drivers whose careers had promised so much would exit the sport without a world title between them.\nYet this was not just about two men. Seven hundred jobs were threatened by Honda's decision and new buyers were urgently sought. But in the midst of a financial downturn, that would not be easy.\nThree months passed before salvation arrived in the form of Ross Brawn, the former Ferrari technical director and mastermind of all seven of Michael Schumacher's world titles, who had taken the helm of the Honda F1 team in late 2007, albeit too late to avert their dismal 2008 campaign.\nJust weeks before the opening race of the 2009 season in Australia, it was announced Brawn was heading up a management buy-out, external from Honda, taking a controlling 54% stake, renaming the team Brawn GP, retaining drivers Button and Barrichello, and crucially keeping hundreds of employees at Brackley in work.\nDespite the many jobs saved by Brawn's buy-out, there was blood-letting to be done and around 270 roles were lost as a result of Honda withdrawing their £200m-a-year investment.\nAnd while Brawn's success trackside was proven, buying out a whole team was another task entirely - a little like a Premier League benefactor walking out on a club to leave the manager to run it himself.\nThat said, Honda had invested heavily in what would become the 2009 car, and also provided some money to Brawn to ease the transition from factory to privateer team.\nIt was a bold move, but Brawn had reason to be quietly confident as he embarked on a new life as a privateer.\nFor what would have been Honda's 2009 challenger promised to be devastatingly fast, according to computer simulations over the winter - the design team successfully interpreting sweeping new aerodynamic rules set to be introduced for that season.\nSpeaking to BBC Sport's chief F1 writer Andrew Benson in 2009, a Brawn source said: \"Weeks before the car got on the track we were told by one of the aero guys that we would be two seconds quicker [a lap] than anyone else.\"\nAlthough the extent of the car's advantage was exaggerated, they were, quite clearly, ahead of the rest.\nEven with a few inches crudely lopped off the back of the Brawn chassis to accommodate a Mercedes engine rather than one from Honda, the BGP001 was comfortably the class of the field at the end of its first four days of testing in Barcelona, and another strong showing followed at the final pre-season test in Jerez.\nThe promise was there, and at the season-opener in Australia at the end of March the Brawn car duly delivered, Button heading Barrichello in both qualifying and the race., external It was the first of six wins in seven races for Button at the start of the season.\nFor all their early-season success, Brawn lacked resources to develop their car at the same rate as their rivals.\nThe car that by now enjoyed nothing like the advantage it had in Melbourne seven months earlier was being soundly beaten by Sebastian Vettel and Mark Webber in the Red Bulls.\nIt may have been a fairytale year, but the end could not come soon enough.\nJust as with Hamilton 12 months earlier, Button clinched the title with a fifth-placed finish in the Brazilian Grand Prix,, external under a dramatic hail of flashbulbs and a disbelieving paddock - the Briton hoisted on to the shoulders of his jubilant mechanics.\nOne of the victims of the rain-hit qualifying session, Button lined up in 14th place, but drove tenaciously to secure the result he needed to land the title, picking his way through the field in uncharacteristically gung-ho style.\nCome the final reckoning, Button was champion by 11 points and Brawn were the constructors' champions - a unique feat for a team in its debut and, as it would turn out, only season.\nBrawn stayed at the team under the guise of Mercedes until 2013, when a management reshuffle saw him depart Brackley, and the sport - for now.\nHaving dominated 2014, Mercedes are emerging from testing this year with the same sort of advantage that Brawn did six years ago - looking like they will be very hard to beat at the season-opening Australian Grand Prix on 15 March.\nDespite the winning habit, and the significant financial clout that comes with a company such as Mercedes, many in that team will look back with huge fondness - and not a little incredulity - to the time when a title-winning car emerged from the smouldering remains of Honda's failed F1 dream.", "url": "https://www.bbc.com/sport/formula1/31588540"}