{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:16:32", "date_modify": "2025-05-20 14:16:32", "date_publish": "2023-07-29 15:00:46", "description": "In her latest BBC Sport column, GB long jumper Jazmin Sawyers discusses the key issues facing athletics and why a Netflix series could help engage more fans in the sport.", "filename": "sport_athletics_66314806_1747750592.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/A10F/production/_130113214_bbc-sport-project-chameleon-columnist-banner--a06364ef-8ee3-4a69-8cc6-7717a1bcea1d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_athletics_66314806_1747750592.html", "title": "Jazmin Sawyers: Netflix series & structured league can help athletics after 'magic' London Diamond League", "title_page": "Jazmin Sawyers: Netflix series & structured league can help athletics after 'magic' London Diamond League - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Great Britain's Jazmin Sawyers, who won her first major long jump title at the European indoors in March, will feature in a series of BBC Sport columns in the build-up to August's World Athletics Championships in Budapest.\nIn her third piece, Jazz discusses the significance of the sell-out London Diamond League, the key issues facing athletics and why a Netflix series could help engage more fans in the sport.\nAt a time when there is talk of athletics suffering, with uncertainty around what direction it is heading in, all you had to do was spend time at the London Diamond League to realise there remains a huge appetite for the sport.\nIt feels as though there has been a lot of negative press around athletics lately but Sunday's action at London Stadium - a single-day event with no medals up for grabs - attracted a sell-out crowd of 50,000.\nWe all felt the crowd behind us, that they were engaged and interested. It was magic for the athletes - that does not suggest a sport which is dying.\nHowever, it did feel like a significant day for athletics in the UK and the necessary boost a lot of people needed.\nHopefully it will offer proof to sponsors and broadcasters that people do want to watch the sport. We saw some incredible performances and we know that if the events are on, the crowds will come.\nI have never experienced an atmosphere like that outside of a major championships in my career. Even in the call room there was a buzz among the athletes.\nIn the UK we have something special to show the world and I'm glad we already have a date in the diary for London next year. When we can put on a show like that it only encourages more of the world's best athletes to come and compete.\nThe London Stadium is an iconic venue and a lot of the athletes out on the track on Sunday were people who watched the 2012 Olympics and were inspired as children.\nAfter watching the Games I thought the London Stadium was the most amazing place and I was so desperate to go to the track that I turned up to the Anniversary Games one year later in my kit, claiming I was the 'first reserve'.\nOf course, there is no such thing.\nBut they gave me a pass and at that age it was a big deal for me to see the action up close. It is a special stadium and it is still a dream to compete there.\nObviously we can't be there constantly but the fact that we can attract a sell-out crowd - we're told it was the biggest one-day athletics meeting in the world - shows that athletics needs to maintain a presence at London Stadium.\nOn a personal note, I still have a few things to work on but that is always the case for me in the build-up to a major competition and I know I will bring my best when the time comes.\nSunday was a really special day. It felt like a championships atmosphere and it was the perfect meet to end on before the World Championships in Budapest.\nI change my mind on how optimistic I am about the future of athletics all the time.\nThe discussion within the sport is not about major championships. There doesn't appear to be a problem there, people love watching the Olympics and Worlds.\nBut there is an issue with professional athletics more widely.\nAs a highly invested fan I want to see as much of the action as I can - but I have all the necessary context. The question is how we bring athletics to people who don't already follow the sport. That is much harder.\nThe way the Diamond League is structured makes it really hard for casual fans to get involved.\nI doubt 50,000 people at the stadium on Sunday knew how many Diamond League points the athletes have or who is going to qualify for September's final in Eugene.\nWhen you don't have a consistent structure for the season it makes it difficult for anyone - even the die-hard fans - to find out when the next meet is on, who will be competing and how they can watch it.\nI understand fan frustration when athletes pull out of meets but, equally, they know their contracts and livelihoods more or less rest on them doing well at championships.\nIf we had a consistent league that was well sponsored and well paid there would be much greater incentive for athletes to compete, rather than treat it as preparation for a bigger target.\nMany people think all professional athletes make a lot of money but it's not the case. There are so many athletes and most are earning a normal wage and genuinely cannot afford to miss a championships.", "url": "https://www.bbc.com/sport/athletics/66314806"}