{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:56:24", "date_modify": "2025-05-21 07:56:24", "date_publish": "2024-12-23 17:51:22", "description": "County can take confidence from tight league table", "filename": "sport_articles_c23ve3vk0peo_1747814184.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cd0b/live/866f5980-c155-11ef-b200-e594162e2327.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c23ve3vk0peo_1747814184.html", "title": "County can take confidence from tight league table", "title_page": "County can take confidence from tight league table - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former St Mirren striker Rory Loy suggests Ross County can take confidence from how close all the bottom half sides are in the Scottish Premiership.\nCounty, who were beaten 2-1 by St Mirren at the weekend, are second bottom and only one point ahead of St Johnstone.\nBut, Don Cowie's men are only two points behind Hearts above them and only three behind Killie and Hibs above that.\n\"If you're in that position in the league then there's got to be some concern,\" Loy told the BBC's Scottish Football Podcast.\n\"They might not say it outwardly but what will give them faith is it is so tight in there.\n\"You look at Hibs, they've had a good run of five games and they find themselves looking up the way and everyone's kind of positive about them.\n\"No disrespect to Ross County but I wouldn't have said they possess the quality and strength and depth that the likes of Hibs do.\n\"Most people think Hearts will get it right eventually, so you look around them and I just don't see Kilmarnock, Dundee, these types of clubs being in any bother.\n\"The last thing Ross County and Don Cowie will want is for it to become a two-horse shootout for 12th and 11th in terms of the league table.\n\"He'll believe in his squad, that they've got the strength to get away from that, but I do think that the league will really take shape come these next four or five games and I do expect Ross County to be in a relegation scrap, I've got to be honest.\"", "url": "https://www.bbc.com/sport/articles/c23ve3vk0peo"}