{"authors": ["Brian McLauchlin & Tyrone Smith", "www.facebook.com"], "date_download": "2025-05-21 07:29:56", "date_modify": "2025-05-21 07:29:56", "date_publish": "2025-05-20 16:57:40", "description": "Ross County manager Don Cowie and Livingston's David Martindale talk of the pressures involved as their sides meet in Thursday's Scottish Premiership Play-off final first leg.", "filename": "sport_football_articles_c0577m00r5lo_1747812596.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/afe1/live/1a29b150-3593-11f0-8519-3b5a01ebe413.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c0577m00r5lo_1747812596.html", "title": "Third-time lucky for Ross County or instant return for Livingston?", "title_page": "Third-time lucky for Ross County or instant return for Livingston? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Heart of Midlothian disposed of Neil Critchley after failing to reach the Scottish Premiership's top six and Dundee's Tony Docherty paid the price despite narrowly escaping a play-off to avoid relegation.\nSimo Valakari kept his job despite automatic relegation, but it was St Johnstone's players who have felt the brunt of their drop to the Championship - with 21 being shown the door.\nMeanwhile, Partick Thistle interim co-managers Brian Graham and Mark Wilson have been left waiting to see if they have done enough to be given the job permanently after falling short in their promotion bid after losing the Premiership Play-off semi-final.\nThe pressure now shifts to the winners of that semi-final, Livingston, Championship runners-up who were relegated last season, and Ross County, who are facing another play-off after finishing second bottom in the top flight for a third season in the row.\nCounty manager Don Cowie insists he is not thinking about the personal consequences.\nThe 42-year-old, who took interim charge in February 2024 before being appointed permanently that summer, says \"regardless of who the manager is\", most important for him is County retaining Premiership football.\n\"I have been at this club over two spells for over 16 years, I am from the area, it means a lot to me in terms of the job that I have got,\" Cowie said.\n\"I am very proud to be the manager of this football club and I will be doing everything I can to make sure that I am here long term.\"\nCounty are looking to extend their five-year stay in the Premiership, albeit they are now seeking to stay there via the play-offs for the third straight season.\n\"It is a huge moment for the football club,\" Cowie said. \"It is situation we have faced before and we have to go and deal with it again.\n\"I think you have got to recognise how big it is. It is my job to let the players know that, but at the same time, I like to think that they are knowledgeable enough to know the importance of it, the importance of bringing Premiership football to the Highlands.\"\nCounty defeated Thistle last season, and Raith Rovers 12 months ago.\n\"I think what the last two years show is that there are different ways you can get through the scenario we are in,\" he said.\nLivingston manager David Martindale is not surprised that County are in the play-off for a third successive season.\nHe believes that a 12-team top flight means it is likely to be the same clubs battling it out at the bottom to avoid the drop in most campaigns.\nMost years, clubs like County, St Johnstone and his own are likely to be either fighting relegation from the top flight or chasing promotion from the Championship and \"every year seems to get a wee bit more difficult\".\nCowie suggested Livingston have made \"a little tweak in their style of play\" this season and are \"playing a lot of good football\" in a recent run of six wins in seven outings.\nIndeed, the West Lothian side prevailed 3-2 after extra-time when they met in a January Scottish Cup thriller in Dingwall.\nMartindale, though, said Thursday's visitors are \"a club that's done fantastically well over the years\" considering the difficulty in attracting players and keeping them at Scotland's most northerly club.\nHowever, the 50-year-old admitted: \"I've been looking at them probably since the Scottish Cup game up there, so I had one eye on them at that point.\"\nBefore the victory over Thistle, Martindale admitted takeover talks meant there was doubt about whether he would be extending his five-year stint as team boss.\nCalvin Ford, the great-great-grandson of Ford Motor Company founder Henry Ford, has since been announced as the club's new majority shareholder and chairman.\nHowever, Martindale said that, while there is \"a belief\" within his squad that they can win the play-off, all the pressure is on County as it is they who have their Premiership status on the line.\n\"I think all the apprehension, all the anxiety, should probably be with the team that was sitting 11th in the Premiership, because I think there's a huge amount of pressure on them,\" he added.", "url": "https://www.bbc.com/sport/football/articles/c0577m00r5lo"}