{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:19:59", "date_modify": "2025-05-21 07:19:59", "date_publish": "2025-03-30 00:00:00", "description": "Tottenham come from behind to end their five-match losing streak in the Women's Super League with a 1-1 draw at Leicester City.", "filename": "sport_football_live_c337xk1dg4pt_1747811999.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d7cc/live/f5730a50-0d74-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c337xk1dg4pt_1747811999.html", "title": "Leicester 1-1 Tottenham: Visitors end WSL losing run with draw at Foxes", "title_page": "Leicester 1-1 Tottenham: Visitors end WSL losing run with draw at Foxes - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tottenham came from behind to end their five-match losing streak in the Women's Super League with a 1-1 draw at Leicester City.\nRobert Vilahamn's side had not picked up a point in the league since 26 January, slipping to ninth in the table, but rescued a draw with Drew Spence's close-range effort cancelling out Josefine Rybrink's own goal.\nTottenham dominated proceedings at the King Power Stadium, with the best chance of the first half falling to Martha Thomas, who found herself one on one with Janina Leitzig and brought a sharp reaction save out of the goalkeeper.\nOlivia Holdt, Ella Morris, and Jessica Naz also went close for the visitors before the break.\nThey were nearly left to rue those missed opportunities when Leicester took the lead in the 55th minute, Hannah Cain driving a vicious shot at Lize Kop, who could only parry the ball towards defender Rybrink who put it into her own net.\nHowever, they were only behind for seven minutes, with Spence side-footing beyond Leitzig after a cutback from Naz.\nTottenham and Leicester remain ninth and 10th in the division, with the Foxes now seven points clear of bottom side Crystal Palace.\n\"We got a point which is better than the last games we've had,\" Vilahamn told Sky Sports.\n\"Good football, created so many chances, had most of the possession. In one way we're doing a good game but we're not really there yet to manage to actually win.\"\nThe reaction from both sides at the final whistle on Sunday spoke volumes.\nLeicester keeper Leitzig had a beaming smile on her face. Several Tottenham players slumped to the floor. The visitors had ended their losing streak, but this felt like two points dropped rather than one gained.\nBefore this match, Tottenham had scored just once in five league matches, conceding 11 in the process, and all season have been over-reliant on Bethany England, who is currently absent with a quad injury.\nThe England forward is Spurs' top-scorer this campaign with eight goals, with Eveliina Summanen the next best on two.\nReflecting on Tottenham's goal-scoring struggles before the game, Vilahamn said: \"It's a mixture of how we play, create chances, and the self-confidence of the attacking players. We need to keep working on those moments.\"\nAnd that lack of self-confidence and, in the words of Ella Morris, \"clinical edge\" was on display against Leicester.\nTottenham dominated possession (66.2%) and out-shot Leicester 23 to 10 (and 11 to two in terms of attempts on target) but could not make their attacking dominance pay against a spirited Leitzig in the hosts' goal.\n\"If you look at the team they don't have the best self-confidence in the world. But where we are in the table you can see that it's actually a really good team playing good football,\" Vilahamn said afterwards.\nHoldt, Morris, Naz, and Maite Oroz all had chances to open the scoring in the first half, Summanen saw a second half free-kick ping off the crossbar, and Leitzig pulled off a leaping stop in the final minute to deny Matilda Vinberg.\nHowever, no one better epitomised Tottenham's struggles in front of goal than Thomas, who fluffed a one-on-one opportunity midway through the first period, attempting to shoot straight past Leitzig.\nThomas is yet to score in the WSL this season while Tottenham have only managed 21 goals in 18 matches.\n\"We need to be better to finish the set-pieces and in our finishing. Today was better [than last time out losing to West Ham] so I hope we can go to Aston Villa in a few weeks and actually win that game by scoring a few goals,\" said Vilahamn.", "url": "https://www.bbc.com/sport/football/live/c337xk1dg4pt"}