{"authors": ["Matthew Cresswell", "www.facebook.com"], "date_download": "2025-05-21 06:14:08", "date_modify": "2025-05-21 06:14:08", "date_publish": "2025-01-04 17:36:12", "description": "Gloucester start 2025 excellently with an entertaining 36-20 Premiership victory over Sale Sharks.", "filename": "sport_rugby-union_articles_clyk94230rlo_1747808048.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/53ec/live/8e18ff40-cabc-11ef-8449-159a99d87232.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_clyk94230rlo_1747808048.html", "title": "Premiership: Gloucester 36-20 Sale", "title_page": "Premiership: Gloucester 36-20 Sale - Cherry and Whites beat Sharks - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Gloucester started 2025 in excellent fashion with an entertaining 36-20 Premiership victory over Sale Sharks at Kingsholm.\nTwo tries from Max Llewellyn and one apiece from Santi Carreras, Josh Hathaway and Tomos Williams earned the hosts a try bonus-point win.\nTries from Sale skipper Ben Curry, Luke Cowan-Dickie and Tom Roebuck proved mere consolation for the Sharks, whose three-game Premiership winning streak came to an end.\nGloucester climb to fourth, albeit potentially temporarily, while Sale drop to fifth before sixth-placed Saracens' match with Bristol.\nThe hosts got off to a whirlwind start and took the lead with a wonderful team move after only five minutes from deep in their own half, started and finished by Carreras.\nQuick hands from Carreras freed up Hathaway to speed away on the left wing, his pass found scrum-half Williams, who, in turn, teed up the marauding Argentina international to score expertly under pressure from Sharks winger Tom O'Flaherty.\nA penalty from Carreras put the hosts eight points up in but that gap was cut thanks to Rob du Preez's accurate penalty.\nGloucester's line-outs proved hugely problematic in the first half for Sale and from such a move, Wales international Llewellyn broke through Sharks ranks, side-stepping O'Flaherty beautifully to score his seventh league try of the season and move him joint top of the Premiership try scoring charts.\nIn a dominant first half, the Cherry and Whites racked up their third try when Jack Singleton's line-out was moved from left to right and Hathaway, who had a try disallowed moments earlier because of a forward pass, dotted down in the corner.\nCarreras' monster conversion from the touchline added the extras as the hosts raced into a 22-3 lead.\nSale - who were missing England fly-half George Ford because of injury - looked a shadow of the side which thrashed Bristol 38-0 last time out.\nBut late in the first half they were given a potential way back into the game when home prop Marco Vivas was shown a yellow card for a maul infringement after Sale had built good pressure in the Gloucester 22.\nSeconds later, Sale captain Ben Curry crashed over from the back of a sixth successive maul and after Rob du Preez added the extras, the deficit was reduced to 22-10 at half-time.\nSharks failed to make their man advantage count further at the start of the second half, but Gloucester again found themselves a man short when Arthur Clark was sent to the bin for offside.\nCowan-Dickie soon dived over following his own line-out to cut Sale's deficit further only for Gloucester to hit back when Rob du Preez's pass was brilliantly intercepted by Gloucester captain Lewis Ludlow, who offloaded to Llewellyn, who comfortably scored his second of the match.\nSharks refused to give up though and responded again when a good move from left to right found Roebuck and the 23-year-old England international contorted himself wonderfully to gather and score in the corner.\nHowever, with the Kingsholm crowd willing their team home, Williams finished his own chip over the top to seal a deserved win for the hosts.\nSale director of rugby Alex Sanderson told PA Media:\n\"We gave ourselves some opportunities to at least get something out of the game.\n\"What I was most frustrated about was how we pulled the trigger in that second half compared to the first half, when we looked as if we were playing within ourselves.\n\"You don't win games by conceding 36 points often, away from home at Kingsholm, so we have to have a look at our system defence. The intent was there but I don't think system-wise we were on the same page.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/clyk94230rlo"}