{"authors": ["Adam Pope", "www.facebook.com"], "date_download": "2025-05-21 05:22:09", "date_modify": "2025-05-21 05:22:09", "date_publish": "2025-04-03 16:11:33", "description": "Leeds United manager Daniel Farke speaks to the media ahead of their Championship trip to Luton Town on Saturday (12.30 BST).", "filename": "sport_football_articles_cm257g277q8o_1747804929.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/276d/live/64f3c170-10a5-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cm257g277q8o_1747804929.html", "title": "Farke on 'reliable' Darlow and promotion belief", "title_page": "Leeds United: Farke on 'reliable' Darlow and promotion belief - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "On Darlow: \"I have a reliable and proper option in Darlow. An experienced goalkeeper, proven at this level, top class character. I know he hasn't played many league games in the last few years, but he performs really well every day in training, loyal and in a good moment right now because he's played two solid performances for Wales. He's in a good rhythm so we got the feeling in this moment, heading into a nervy crunch time period, feeling the pressure, it's the right time to take this decision.\"\nOn belief the club will be promoted: \"It's my honest feeling, I'm not nervous at all, I'm totally calm and cool that we'll play in the Premier League next season. I'm older and have experience of a few situations. I've been involved in promotion battles in my managerial career, won the title and promotion five times. You get a feeling if you have a team that will make it and I wouldn't speak about it if I wasn't 100% convinced.\n\"Of course at this stage you can't guarantee you'll finish in the top two, the race is too tight. We have strong opponents with Sheffield United, Burnley, even Sunderland have an outside chance. I can't guarantee top two, but I still think we have a great chance to finish top two and if not then the play-offs.\"\nOn coping with Luton's likely physical approach: \"I can't prevent this and this will be exactly the fact. Everyone expected Luton to be in a better position this season. They have many players who played Premier League last season, they have Premier League physicality and right now a good run of form. Last five games, they're in position five in the form table. They know they need each and every point.\"", "url": "https://www.bbc.com/sport/football/articles/cm257g277q8o"}