{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:35:19", "date_modify": "2025-05-21 04:35:19", "date_publish": "2025-02-09 11:55:47", "description": "Torquay United manager Paul Wotton says his side's 2-0 win over fellow promotion chasers Eastbourne Borough \" felt like a war at times\".", "filename": "sport_football_articles_c3d52744pv4o_1747802119.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/919f/live/b7992cb0-e6db-11ef-9c03-b5355c68e892.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c3d52744pv4o_1747802119.html", "title": "Torquay United boss Paul Wotton hails side after 'war' with Eastbourne Borough", "title_page": "Torquay United boss Paul Wotton hails side after 'war' with Eastbourne Borough - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Torquay United manager Paul Wotton says his side's 2-0 win over fellow promotion chasers Eastbourne Borough \"felt like a war at times\".\nThe Gulls ended a four-game winless run as their victory saw them move above Eastbourne into fifth place in National League South - four points off leaders Dorking Wanderers with two games in hand.\nIt took Torquay until the final moments of the game to finally break down their opponents when Sam Dreyer's deflected effort from an 86th-minute corner gave the hosts the lead.\nOmar Mussa clinched the victory with a cool finish in the sixth minute of stoppage time.\n\"It felt like a bit of a war at times,\" Wotton told BBC Radio Devon.\n\"I thought they were very direct, they were playing out from the back, giving it to a centre-half and then he was going direct so it's same thing as being direct.\n\"We knew it would be a war and we knew all week there had to be a reaction from the Maidstone game and there was.\n\"I could tell after the first 20 seconds we were at it, we were up for it.\n\"Eastbourne were unbeaten in 11 and they're up there for a reason because they are very organised and they're good at what they do.\"", "url": "https://www.bbc.com/sport/football/articles/c3d52744pv4o"}