{"authors": ["Adwaidh Rajan", "www.facebook.com"], "date_download": "2025-04-26 07:47:56", "date_modify": "2025-04-26 07:47:56", "date_publish": "2025-02-26 23:12:49", "description": "Everton's 'new manager bounce' under David Moyes continue as they fight back from behind to hold Brentford to a 1-1 draw in the Premier League.", "filename": "sport_football_articles_cly883qg3deo_1745653676.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d8ff/live/b5043bc0-f496-11ef-839b-6909acee4532.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cly883qg3deo_1745653676.html", "title": "Brentford 1-1 Everton: David Moyes' side extend unbeaten run", "title_page": "Brentford 1-1 Everton: David Moyes' side extend unbeaten run in Premier League - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Everton's 'new manager bounce' under David Moyes continued on Wednesday as they fought back from behind to hold Brentford to a 1-1 draw in the Premier League.\nThe Toffees are now unbeaten in seven league matches and have taken 15 points from a possible 24 since Moyes returned for his second spell in January - having only collected 17 from a possible 57 under former boss Sean Dyche.\nEverton's upturn in form is particularly impressive considering the long list of injuries the Merseyside club have had to deal with this season.\nIliman Ndiaye, Dwight McNeil, Dominic Calvert-Lewin, Armando Broja all remain sidelined with injuries while Abdoulaye Doucoure, who was on target against Manchester United on Saturday and also at Brentford last season, was unavailable with his wife due to give birth.\nBut the Toffees did not let the absences affect them at Brentford and could have come away with all three points, had Beto capitalised on one of the three one-on-ones against Bees keeper Mark Flekken.\nThey are now 15 points clear of the drop zone and will hope to pull further away from it when they face 17th-placed Wolves next.", "url": "https://www.bbc.co.uk/sport/football/articles/cly883qg3deo"}