{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:26:04", "date_modify": "2025-04-26 07:26:04", "date_publish": "2025-02-27 22:41:19", "description": "Marcus Rashford is prepared to make his Aston Villa loan move permanent, while Liverpool have a growing interest in Alexander Isak.", "filename": "sport_football_articles_c62kk7rqxd3o_1745652364.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6ee2/live/1510f480-f556-11ef-8c03-7dfdbeeb2526.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c62kk7rqxd3o_1745652364.html", "title": "Football gossip: Rashford, Osimhen, Isak, Adeyemi, Ederson, Kimmich, Leao", "title_page": "Football gossip: Rashford, Osimhen, Isak, Adeyemi, Ederson, Kimmich, Leao - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Marcus Rashford prepared to make Aston Villa loan move permanent, Victor Osimhen keen on Manchester United transfer and Liverpool have growing interest in Alexander Isak.\nManchester United and England forward Marcus Rashford, 27, is prepared to turn his January loan move to Aston Villa into a permanent deal. (Sun - subscription required), external\nBarcelona and Bayern Munich are also keeping tabs on Rashford. (Football Insider), external\nLiverpool have a growing interest in Newcastle and Sweden forward Alexander Isak, while Arsenal also remain keen on a move for the 25-year-old. (Times - subscription required), external\nArsenal might have to sell Belgium forward Leandro Trossard, 30, or their 23-year-old Brazil winger Gabriel Martinelli to fund a summer rebuild, with both players targets for Saudi Pro League clubs. (Mirror), external\nVictor Osimhen is keen on a transfer to Manchester United, although they will need to overcome several major clubs to sign the 26-year-old Nigeria striker, who is on loan at Galatasaray from Napoli. (Teamtalk), external\nManchester United are prepared to offload Denmark forward Rasmus Hojlund, 22, in order to gain Osimhen's signature. (Calciomercato - in Italian), external", "url": "https://www.bbc.co.uk/sport/football/articles/c62kk7rqxd3o"}