{"authors": ["Andy Burke", "www.facebook.com"], "date_download": "2025-05-21 06:48:41", "date_modify": "2025-05-21 06:48:41", "date_publish": "2025-03-28 21:24:22", "description": "Edinburgh's strong first-half showing and late flourish secures a bonus-point win over Dragons in the United Rugby Championship.", "filename": "sport_rugby-union_articles_cdxqxryvlkzo_1747810121.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/26b2/live/eb95b210-0c18-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cdxqxryvlkzo_1747810121.html", "title": "Edinburgh 38-5 Dragons: Bonus-point win for hosts boosts United Rugby Championship play-off hopes", "title_page": "Edinburgh 38-5 Dragons: Bonus-point win for hosts boosts United Rugby Championship play-off hopes - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Edinburgh boosted their United Rugby Championship play-off hopes with a thumping victory over Dragons at Hive Stadium.\nHaving started the evening in 11th place, the hosts ran in six tries to secure a bonus point and hoist themselves up to sixth, with Dragons remaining well adrift at the foot of the table.\nA brace of tries from Paddy Harrison and further scores from returning Scotland stars Darcy Graham and Pierre Schoeman ensured Edinburgh had victory all but assured by half-time.\nAaron Wainwright offered a brief moment of respite for the visitors with a try early in the second period but Boan Venter and Matt Currie responded to ensure Edinburgh ran out comfortable winners.\nThe early stages were dogged by injury stoppages – including the departure of Edinburgh and Scotland wing Duhan van der Merwe – and dropped balls, but a powerful carry from Schoeman got Edinburgh on the front foot.\nFrom a subsequent penalty, Edinburgh kicked to the corner, threw into the lineout and rolled a maul over the Dragons line, with Harrison touching down.\nIf that was a typical hooker's try, his second was anything but.\nGraham dinked a lovely chip over the top, gathered then kicked through before being clattered. It was then a foot race between Harrison and Dragons full-back Huw Anderson and the front-row left the 15 trailing in his dust to score.\nThe third was not long in coming, a clever kick over the top from Ben Vellacott finding space for Graham to outpace the defence and dive over.\nDragons had not won since beating Ospreys on the opening day of the season and they never looked remotely like ending that run.\nSchoeman ploughed over from close range as the home side wrapped up the bonus point and effectively ended the game before half-time.\nDragons struck first after the break, Wainright burrowing over the line to finish off a good passage of play.\nThe intensity of the match dropped significantly until substitute Venter powered over for Edinburgh's fifth try.\nThe home side finished with a flourish, a sweeping move that ended with Currie stretching over in the corner.\nWhile the capital side move back into the top eight, most of their rivals have yet to play this weekend and there is still plenty of work to do for Sean Everitt's side to claim a play-off berth.", "url": "https://www.bbc.com/sport/rugby-union/articles/cdxqxryvlkzo"}