{"authors": ["Alex Brotherton", "www.facebook.com"], "date_download": "2025-04-26 07:49:19", "date_modify": "2025-04-26 07:49:19", "date_publish": "2025-02-26 22:41:18", "description": "Tottenham 0-1 Man City: City youngsters impress", "filename": "sport_football_articles_c93nn5wdjnvo_1745653759.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c984/live/763852e0-f492-11ef-839b-6909acee4532.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c93nn5wdjnvo_1745653759.html", "title": "Tottenham 0-1 Man City: City youngsters impress", "title_page": "Tottenham 0-1 Man City: City youngsters impress - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "During the first half at the Tottenham Hotspur Stadium Manchester City looked like their old selves, but their resilience in the second half was no less impressive.\nJeremy Doku and Savinho caused Spurs plenty of problems on the flanks, while in midfield January arrival Nico Gonzalez excelled both in and out of possession.\nIn the second half City lost control and Tottenham piled on the pressure, but City held out thanks in part to the interventions of 20-year-old centre-back Abdukodir Khusanov.\nCity are changing, and as a difficult season approaches the final stretch, green shoots are appearing.\n\"We have a young, young team,\" City boss Pep Guardiola said during his post-match press conference.\n\"The three up front [Doku, Savinho and Erling Haaland] is the future, Nico [Gonzalez] when Rodri comes back will be the future, and of course, [Abdukodir] Khusanov you have seen it today, Josko [Gvardiol] is young.\n\"But listen, Bernardo [Silva], [Ilkay] Gundogan, Kevin [De Bruyne] and the other ones are really important for us. But it's a question of time; the young players and maybe new acquisitions that the club will do in the summer time have to lead this club for the next years.\"\nCity have looked better in recent weeks. Could they be back to their best next season?", "url": "https://www.bbc.co.uk/sport/football/articles/c93nn5wdjnvo"}