{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:31:09", "date_modify": "2025-05-21 07:31:09", "date_publish": "2025-03-28 17:13:49", "description": "Brighton vs Nottingham Forest: Does 7-0 game make it 'more difficult' for Reds?", "filename": "sport_football_articles_c80y05777z2o_1747812669.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/638d/live/c92cce90-0bad-11f0-8e25-91624fd3b00c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c80y05777z2o_1747812669.html", "title": "Brighton vs Nottingham Forest: Does 7-0 game make it 'more difficult' for Reds?", "title_page": "Brighton vs Nottingham Forest: Does 7-0 game make it 'more difficult' for Reds? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "BBC Radio Nottingham's Colin Fray has been looking ahead to Saturday's FA Cup quarter-final at Brighton on the latest episode of Shut Up And Show More Football: \"Nuno has a love for the competition. He's talked about how they were the only English games he could watch growing up. It does hold a special place.\n\"I saw how relieved he was getting past Exeter. Also last year, getting past Blackpool and Bristol City, he was relieved as it was progress in the cup.\n\"It's undoubtedly a difficult game for Forest. Brighton are improved lately. It's a huge game for Forest and they haven't come along often in the past 30 years or so.\"\nForest - who last won the FA Cup in 1959 - thrashed Brighton 7-0 in the Premier League in February and Fray added: \"You have to praise Brighton's response to it. They have been brilliant since. For that reason, and because they will be completely fired up looking for revenge, it gives them a huge chance to put things right in front of their fans. In a strange way, it makes it more difficult for Forest.\"\nJohnny Cantor, who covers Brighton for BBC Radio Sussex, joined the Forest podcast and referenced the 7-0 defeat, stating: \"It has been the catalyst for Brighton's recent good form. It was a day, evening or 48-hour period when they started to look at themselves and said 'why did that happen?' and 'it can't happen again'.\n\"Fabian Hurzeler reportedly came in on Monday morning when the players came back in and he got the formation sheet and literally burned it in front of the players to say: 'That didn't work, forget it, we are moving on now.'\n\"He has learned from that, and the team has. I think it has given them that impetus and catalyst to really kick on and they are unbeaten since.\n\"They have the appetite back again and have reached the semi-finals twice in the past six seasons. They have got a taste for it. They want to win something. They believe now their squad is probably the strongest it has ever been. And with it being so open this season with a lot of the big boys out, it presents an interesting opportunity.\"", "url": "https://www.bbc.com/sport/football/articles/c80y05777z2o"}