{"authors": ["Jack Skelton", "www.facebook.com"], "date_download": "2025-05-21 07:57:27", "date_modify": "2025-05-21 07:57:27", "date_publish": "2025-01-13 15:00:18", "description": "Former England bowler James Anderson will resume his playing career after signing a deal with Lancashire for the 2025 season.", "filename": "sport_cricket_articles_c17el2yn4wqo_1747814247.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9ce5/live/4359a0f0-d1c3-11ef-9fd6-0be88a764111.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c17el2yn4wqo_1747814247.html", "title": "James Anderson: Lancashire agree deal with former England bowler to play throuhgout 2025 season", "title_page": "James Anderson: Lancashire agree deal with former England bowler to play throuhgout 2025 season - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former England bowler James Anderson has signed to play for Lancashire in 2025.\nAnderson, 42, will be available for the entire County Championship season and the T20 Blast.\nEngland's leading wicket-taker has not played since retiring from international duty with his final Test appearance in July.\n\"I'm very excited,\" Anderson told the Tailenders podcast.\n\"While I'm still fit enough and young enough, I want to play.\"\nLancashire begin their Division Two campaign against Middlesex on 4 April at Lord's, where Anderson played his final Test against West Indies.\nDespite since working with England as a bowling consultant, Anderson expressed a desire to continue playing.\nAnderson will be part of England's staff for the Champions Trophy in February and March but no deal has been agreed for this summer. It is understood Ben Stokes' side are keen for him to return.\nAnderson said it is not yet clear what resuming his playing career will mean for his role with England this summer but added he will prioritise appearing for Lancashire if selected.\n\"I don't think it would be fair on Lancashire if I just dipped in and out,\" he said.\n\"It's only fair that I give it a good crack and that'll take precedence over anything else during the summer.\"\nAnderson retired from internationals after England opted to look to the future with their bowling attack, finishing with 704 Test wickets - the most by a pace bowler and third most overall.\nHe has taken 1,126 wickets in 298 first-class matches, with 376 of those wickets coming in 95 matches for Lancashire since his debut in 2002.\n\"The one thing I've known for many months is that I wanted to play cricket,\" said Anderson, who turns 43 in July.\n\"It was just trying to find what sort of cricket I wanted to play and after a few chats with Lancashire and their plans for the year it just felt like a nice thing to do.\"\nAnderson could play his first T20 match in nearly 11 years when Lancashire's Blast campaign begins on 29 May.\nHe has not played any white-ball cricket since 2019 but has recently tried to enter franchise cricket, going unsold in the Indian Premier League auction in November.", "url": "https://www.bbc.com/sport/cricket/articles/c17el2yn4wqo"}