{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:41:40", "date_modify": "2025-04-26 06:41:40", "date_publish": "2025-03-02 12:30:11", "description": "'Dundee don't deserve to stay up' - fan reaction", "filename": "sport_articles_cly43r31xyeo_1745649700.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/76ee/live/604fbe40-f75e-11ef-9e61-71ee71f26eb1.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cly43r31xyeo_1745649700.html", "title": "'Dundee don't deserve to stay up'", "title_page": "'Dundee don't deserve to stay up' - fan reaction - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "We asked for your views on Dundee's 1-1 draw against St Johnstone.\nHere's what some of you said:\nRonnie: Still not good enough, Dundee should be beating teams like St Johnstone at home. Dire defending for the first goal, nobody in midfield picking up the run that everyone in the stadium could see. On that showing, Dundee don't deserve to stay up, nor will they, and following relegation Tony Docherty needs to be replaced, no more excuses.\nInnes: I fear for Dundee now in staying in the Premiership. That was a chance to put an unwanted run of form behind them. A point is indeed welcome but if we want to stay in this league we will have to put teams away when the chances are there like they were. Seriously dominant in second half but lack of killer instinct may prove decisive.\nMark: Worrying we could not put that game to bed. Another soft goal to give away. Tough run of fixtures before the split. Six points needed from the next four games. Fingers crossed that starts across the road in a couple of weeks.\nGary: It was the usual mix of frustration and elation. Conceded first again, but a quick reply had us right in it. Too often though the pass wasn't made or a shot didn't come off. We still don't take the good chances we're creating, we're waiting for a pass instead of going to meet it, pretty simple stuff. A draw was fair enough, but it doesn't do us much good. I'm so thankful for Simon Murray. He runs himself into the ground every week and spends so much of the games encouraging his teammates to match his effort, that they rarely do in enough numbers is why we're struggling right now. Great to see Charlie Reilly back in the squad but it's another game we should've got more from.\nStephen: Although we never lost and the second half performance was much better, I think that the heads are down and honestly I can't see where we may get points from as every team seems to have got stronger and stronger and getting results, whereas we may pick up a point here and there I think that will be all.", "url": "https://www.bbc.co.uk/sport/articles/cly43r31xyeo"}