{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:23:17", "date_modify": "2025-05-20 12:23:17", "date_publish": "2023-08-04 13:50:11", "description": "The Commonwealth Games is in crisis - seeking hosts for the 2026 and 2030 editions after Victoria and Alberta's withdrawals. So what happens next?", "filename": "sport_commonwealth-games_66405359_1747743797.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1667E/production/_130647719_fbc1e49ee56455bd02cd5abb1ec45cca75b5a519.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_commonwealth-games_66405359_1747743797.html", "title": "Commonwealth Games: Will there be another event after Alberta and Victoria withdrawals?", "title_page": "Commonwealth Games: Will there be another event after Alberta and Victoria withdrawals? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The Commonwealth Games is in crisis - without a host for its next edition in 2026 and struggling to find one for the following event four years later.\nHere we explore what has gone wrong - and what might happen next.\nThe Commonwealth Games, staged across multiple sports, take place every four years. First held in 1930, they have only previously been cancelled during World War Two.\nTo be eligible to participate in the Games, competitors must be from one of the countries or territories that form the Commonwealth Games Association., external Most of the countries in the Commonwealth were once part of the British Empire.\nThere are questions now over the staging of the next two Games. The Commonwealth Games Federation (CGF) is scrambling to find a replacement for Victoria in three years' time. Alberta, meanwhile, had not been awarded the 2030 event, but was mulling over whether to submit an offer.\nThe decision of Alberta to pull out comes a few months after Hamilton, Ontario - which hosted the inaugural Games in 1930 - suspended its effort for a centenary event because of a lack of government support.\nIt leaves the Games' overall viability and relevance in the modern world under increasing scrutiny.\nHowever, UK Prime Minister Rishi Sunak's spokesman rejected a suggestion that Victoria's withdrawal indicated a decline of the Commonwealth, saying the King's coronation showed \"the strength of the Commonwealth and commitment of countries to it\".\nOrganisers had originally estimated the Victoria event - hosted across cities including Geelong, Bendigo and Ballarat - would cost A$2.6bn (£1.4bn) but that figure more than doubled.\nAlberta's Tourism and Sport Minister Joseph Schow baulked at an estimated cost of up to £1.57bn, a bill he says would have landed largely with taxpayers.\nAside from India in 2010, the five events staged so far this century have either been in the UK or Australia.\n\"Other countries like Canada haven't really wanted to get in on the act before,\" Dr Tom Bason, sports event legacy expert from Coventry University's Centre for Business in Society, told BBC Radio 5 Live.\n\"The reason Canada wanted 2030 was because it's going to be the 100-year anniversary of the Games and they held the very first one, so they wanted to look at it as a centenary Games. Apart from that, they've had no real appetite in hosting.\n\"These Games are getting more and more expensive to host - they've cited costs of well over £1bn for an event that's not going to bring with it that many benefits. It's not going to bring a lot of global kudos, it's not going to bring a great sports legacy because these events never do,\"\nBirmingham, which staged the 2022 Games after Durban's withdrawal, might care to argue.\nIts event was the best attended on record, with more than 1.5 million tickets sold. It was broadcast live to 134 countries as 4,600 athletes from 72 nations and territories competed.\nSome £778m of public money was invested in the Games, but an independent report earlier this year said it generated £870m for the UK economy.\nGold Coast is ready to step in to stage the 2026 Commonwealth Games after the state of Victoria pulled out, said mayor Tom Tate.\nThe coastal city - host of the 2018 Games - is in the Australian state of Queensland, which is preparing to host the 2032 Olympics in Brisbane.\nMayor of London Sadiq Khan has said he would support a bid for the capital to host the Games, while Birmingham also has the infrastructure, although any decision on bidding would be taken by the government.\nIn June, the CGF set out a strategy which included assessing the feasibility of hosting in new regions and considering multi-country Games.\nThe federation wants to showcase innovations - Birmingham 2022 broke new ground with the introduction of 3x3 basketball, while T20 women's cricket made its debut at a multi-sport event.\n\"Growing the fanbase and growing the people that are constantly providing us with stories, is a primary goal,\" said chief executive Katie Sadleir.\nSadleir said last month all options will be considered for 2026 hosts, including the UK if there was interest in a bid.\nSouth Africa's ability to one day accommodate the Games, and the will of leaders on the continent to see that happen, remain strong, according to one of the key figures involved in a potential new hosting bid - as long as \"baby steps\" are taken first.\n\"Quietly, at the back of our minds, we know we can deliver a world-class Commonwealth Games - so we will be looking into that,\" Barry Hendricks, the president of South Africa's Sports and Olympic Committee (Sascoc), told BBC Sport Africa.\n\"There are other countries on the continent that have the ability to do it, especially in North Africa. The Commonwealth Games Federation (CGF) still has hopes that Africa can host a Commonwealth Games.\"\n\"This could spell the end of the Commonwealth Games,\" said Steve Georgakis, a sports studies lecturer at the University of Sydney after Victoria's withdrawal.\nLord Coe insisted the event has a future, although it may need to change.\n\"The Commonwealth Games will survive this, it's a strong product, it is about innovating and the Commonwealth Games has opportunity to do that,\" he told the Australian newspaper.\n\"It has less branding [restrictions] than the Olympics and sometimes the World Championships, so it has potential.\"\nBason believes it will be \"really really difficult\" to find new hosts for 2026.\n\"It might need a rethink of what the Commonwealth Games is trying to become, something a little more different, perhaps a festival type event rather than just being a mini-Olympics,\" he said.", "url": "https://www.bbc.com/sport/commonwealth-games/66405359"}