{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:22:10", "date_modify": "2025-05-21 06:22:10", "date_publish": "2025-03-31 14:40:18", "description": "Nottingham Forest striker Chris Wood is \"improving\" from a hip injury, but remains a doubt for Manchester United's visit to the City Ground on Tuesday.", "filename": "sport_football_articles_c9w8kk9p4vpo_1747808530.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6cc3/live/30ea3f50-0e3c-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c9w8kk9p4vpo_1747808530.html", "title": "Chris Wood: Nottingham Forest striker improving but remains a doubt for Manchester United", "title_page": "Chris Wood: Nottingham Forest striker improving but remains a doubt for Manchester United - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Nottingham Forest striker Chris Wood is \"improving\" but remains an injury doubt for Manchester United's visit to the City Ground on Tuesday.\nWood sustained a hip injury while on international duty with New Zealand earlier this month.\nThe 33-year-old, who has scored 18 goals in 32 appearances across all competitions this season, missed Sunday's FA Cup quarter-final victory over Brighton.\nForest boss Nuno Espirito Santo had hoped Wood would be fit for the visit of United in the Premier League, but did not specify when the player would return in his pre-match news conference.\n\"He's getting better day by day,\" said Nuno.\n\"We have to assess him day by day, it's all about him being free and getting better. It's a big contusion, so it's very painful.\"\nWood limped off just 10 minutes into the second half of New Zealand's 3-0 win over New Caledonia, which secured their place at the 2026 World Cup.\nForest sit third in the Premier League as they continue to push for a place in next year's Champions League and Wood has played a crucial part in their success this season.\nTaiwo Awoniyi took the talismanic forward's place against the Seagulls on Saturday, playing for an hour before being substituted as Forest reached the FA Cup semi-finals with victory on penalties.", "url": "https://www.bbc.com/sport/football/articles/c9w8kk9p4vpo"}