{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:35:54", "date_modify": "2025-04-26 04:35:54", "date_publish": "2025-02-28 12:03:48", "description": "Leicester City news: Goals an issue under Ruud van Nistelrooy", "filename": "sport_football_articles_cvgeed5r13eo_1745642154.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f06e/live/3b9c98f0-f5bc-11ef-8c2a-43d22b661d81.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cvgeed5r13eo_1745642154.html", "title": "Leicester City news: Goals an issue under Ruud van Nistelrooy", "title_page": "Leicester City news: Goals an issue under Ruud van Nistelrooy - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Leicester City fan Kate Blakey, who is co-host of Leicester Till I Die TV, spoke to BBC 5 Live Breakfast after Leicester's defeat against West Ham on Thursday night.\nOn where the club are at right now, she said: \"I think it's way more deep-rooted than a confidence issue. As a fan, it feels like a cultural issue and something that has gone so severely wrong, particularly in the last couple of months. We didn't have that feeling under Steve Cooper at all.\n\"Last night was just a carbon copy of what happened on Friday really and echoes of lack of desire, lack of pride, and lack of effort. Somehow we were kind of still in the relegation battle, it was three from any four but we weren't out of it. I don't think we totally are now. The belief has just totally gone out of the team.\n\"The biggest problem for us right now is that in those 12 games where we have had 11 defeats, we've only scored four goals. The goals have completely dried up under Ruud van Nistelrooy. Under Steve Cooper, in his first 10 matches, only him and Manchester City had scored in every game.\n\"So all of a sudden, Ruud is saying we can't compete, but we've just been away to Spurs and beat them and in the first 10 games of the Premier League, we scored in every one. I think we have got enough to compete.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cvgeed5r13eo"}