{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:29:00", "date_modify": "2025-05-20 14:29:00", "date_publish": "2023-07-29 00:00:00", "description": "Follow live text and BBC Radio 5 Sports Extra commentary from the sprint race at the Belgian Grand Prix.", "filename": "sport_live_formula1_63208184_1747751340.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/65C0/production/_130584062_gettyimages-1562798745.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_formula1_63208184_1747751340.html", "title": "F1 LIVE: Belgian Grand Prix sprint latest", "title_page": "F1 LIVE: Belgian Grand Prix sprint latest - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Verstappen beats Piastri to Belgian sprint win\nAndrew Benson\nBBC Sport’s chief F1 writer\nMax Verstappen caught and passed McLaren's Oscar Piastri to win an incident-packed wet sprint race at the Belgian Grand Prix.\nPiastri, who started second behind Verstappen, took the lead as a result of stopping for a change to intermediate tyres as soon as the race was started following five laps behind the safety car.\nVerstappen stuck with the mandatory full wet tyres for a lap before his own change, and had to ride out a safety car period before blasting through into the lead by passing Piastri on the Kemmel straight.\nThe Australian hung on for second place, his best F1 finish in his rookie season, ahead of Alpine's Pierre Gasly.\nMercedes driver Lewis Hamilton finished fourth on the road but was given a five-second penalty for a collision with Red Bull's Sergio Perez that caused the Mexican to retire, and dropped to seventh just in front of team-mate George Russell.\nRead the full report here\nBack on Sunday at 12:45 BST\nSprint Saturday is done and dusted. Back to thinking about the main event on Sunday.\nCharles Leclerc will start on pole position ahead of Sergio Perez and Lewis Hamilton, as Max Verstappen takes that five-place grid penalty for using too many gearbox components this season.\nSecond-placed Oscar Piastri will move down to fifth for the Belgian Grand Prix, while Pierre Gasly will place his sprint bronze medal on the shelf and line up in P12 tomorrow.\nEnjoy the rest of your Saturday night and come back and join us on Sunday for race build-up at 12:45 BST.\nI'm sure Jacky Ickx will be there too. See you tomorrow.\n'It was a comfort that Max was quick' - Horner\nRed Bull boss Christian Horner spoke to Sky Sports on the challenges of the sprint race: “There were two significant ones. One was deciding when to take the pit stop. The privilege of being first in the pit lane does mean that you have everyone else behind you. Then Max stopped at the end of the first lap and came out behind Oscar, closed him down and converted the win. It was a strong drive by Piastri.\n“It was a comfort that Max was quick. You’re looking at risk vs reward - for one point, it didn’t seem to play out. We had confidence, we had good pace. Max commented on Oscar using his tyres hard and that made it easier to convert the win.”\nOn the impact of the damage sustained by Perez: “Unfortunately, the contact on the left front put a big hole in the sidepod. Lost a huge amount of downforce and performance.”\n'It feels very special to have done it here in Spa'- Gasly\nAlpine’s Pierre Gasly finished third, his highest finish in the points all season. He said post Sprint race: “I must say it feels amazing, extremely happy to finish here in the top three especially here in Spa that feels like a home race for us without the French Grand Prix so it was a very difficult conditions but I’m extremely happy, we pitted at the right time and managed to hold up Lewis until the end. It feels very special to have done it here in Spa so obviously a thought for Anthoine (Hubert) and I’m just extremely pleased for the whole team.”\nOn the tyre strategy and Hamilton following closely behind towards the end, he added: “I must say I gave it everything I see him coming back getting further and I was trying to just focus on my driving and making clear laps one after the other, it wasn’t easy the tyres were degrading and I just gave it all and it paid off and I’m just super happy for all the guys.”\n'I’m happy to get my first top three finish' - Piastri\nOscar Piastri, who finished second in the sprint race, said: “I’m very, very happy. We tried our best. We boxed when the safety car came in, led a few laps but were no match for Max. It was nice to be up there in P2 - besides Max our pace was strong. Full credit to the team.”\n“The last three weekends have been pretty special compared to where we were. We still have a lot of work to do but to lead my first laps is something I’ll never forget.”\nOn whether he thought he could keep Verstappen behind him: “I thought the safety car would be in my favour. I looked out of turn one and thought I had a good start, and then looked out at Eau Rouge and he was already ahead. I couldn’t keep him behind. We have more work to do but I’m happy to get my first top three in a sort-of race. I’ll enjoy it!”\n'It was all under the control, the car was quick, tyres were holding on'- Verstappen\nRed Bull’s Max Verstappen finished first in the delayed Sprint race in Spa. He said afterwards: “No I think it was just a safer call, I could come in first but then I might be blocked by other cars. There might be a safety car then you lose out massively so I didn’t mind to stay out I mean we lost one position but we know we are quick and you could see that when we put the inter tyres on we were flying so it was ok.”\nOn his struggles to wake up the brakes, he added: “We just tried to get an even split on the brakes but it was all under the control, the car was quick, tyres were holding on, so yeah just tiny little issues.”\nOn if there was anything to learn in these conditions ahead of tomorrow’s race, he said: “I don’t know I need to pass a few cars so I think the biggest risk is just Lap One, Turn One, it’s always very tricky there so as long as we stay out of trouble I think we will have a quick car.”", "url": "https://www.bbc.com/sport/live/formula1/63208184"}