{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:39:23", "date_modify": "2025-05-21 06:39:23", "date_publish": "2025-01-22 18:41:01", "description": "Women's Super League side Aston Villa appoint Natalia Arroyo as their new head coach.", "filename": "sport_football_articles_c3rwpjwey1xo_1747809563.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2525/live/d42dc480-d8ee-11ef-a6f5-8719fc3c9191.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c3rwpjwey1xo_1747809563.html", "title": "Natalia Arroyo: Aston Villa appoint Spaniard as head coach", "title_page": "Natalia Arroyo: Aston Villa appoint Spaniard as head coach - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Women's Super League side Aston Villa have appointed Natalia Arroyo as their new head coach.\nThe 38-year-old Spaniard, who left Real Sociedad at the end of the 2023-24 season, has signed a three-and-a-half-year deal, pending visa approval.\nVilla sacked Robert de Pauw in December and Shaun Goater, who had said he wanted the role on a permanent basis, has been in interim charge of the team.\nArroyo's first game will be against Chelsea in the WSL on Sunday, 2 February and she will be \"supported by the existing coaching staff\".\n\"Natalia impressed us with her passion for football and approach to coaching,\" said Villa president of football operations Monchi.\n\"We believe Natalia has all the necessary tools to succeed at Aston Villa.\"\nDuring her stint at Spain's Real Sociedad, Arroyo achieved qualification for the Women's Champions League and an appearance in the Copa de la Reina final.\n\"We are familiar with Natalia's playing style and admire her philosophy,\" said Aston Villa head of women's football Lee Billiard.\n\"After an in-depth search, Natalia has consistently stood out in meeting our requirements.\"", "url": "https://www.bbc.com/sport/football/articles/c3rwpjwey1xo"}