{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:47:10", "date_modify": "2025-05-21 07:47:10", "date_publish": "2025-05-18 21:32:29", "description": "Follow a stunning mix of live women's sport - including Euro 2025, the Rugby World Cup, Wimbledon and the World Athletics Championship - across the BBC this summer.", "filename": "sport_articles_cgj82ded2nyo_1747813630.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c40e/live/524160a0-3436-11f0-8947-7d6241f9fce9.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cgj82ded2nyo_1747813630.html", "title": "BBC gears up for stellar summer of women's sport", "title_page": "BBC gears up for stellar summer of women's sport: Euro 2025, Rugby World Cup, Wimbledon, World Athletics Championship - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Women's sport is set to take centre stage this summer with a stellar line-up of major events.\nThe Women's Euros, Women's Rugby World Cup and World Athletics Championships will be live across the BBC alongside Wimbledon, The Hundred cricket tournament and the tennis at Queen's, where women will compete for the first time in more than 50 years.\nTo mark the start of a special sporting summer, BBC Sport is launching 'Names Will Be Made', a campaign that will champion sportswomen as we tell stories of resilience, passion and triumph.\nAlex Kay-Jelski, director of BBC Sport, said: \"The BBC has a strong legacy in championing women's sport and telling their stories to audiences.\n\"No sidelines. No second billing. This summer is packed with top-tier women's competitions.\"\nQueen's (9-15 June): Tennis kick-starts BBC Sport's summer schedule. For the first time in more than 50 years women are competing at the historic Queen's Club in London. The grass court season continues throughout June and July with Nottingham, Eastbourne and Wimbledon, all live across the BBC.\nWomen's Euros (2-27 July): All eyes will be on the Lionesses as they set out to retain their title as European champions in Switzerland from 2 July. Wales have also qualified for the Women's Euros, their first ever major tournament. Follow the tournament live across the BBC.\nThe Hundred (5-31 August): There will be live coverage of the annual cricket competition of eight double headers, featuring both women's and men's matches, including the opening matches and finals.\nWomen's Rugby World Cup (22 August-27 September): All four home nations are competing and, off the back of clinching the Women's Six Nations, England's Red Roses will be hoping to secure the trophy in front of home fans. Every single second will be live exclusively across the BBC.\nWorld Athletics Championships (13-21 September) Tokyo is hosting the showcase where the best women in the world across track and field will compete, all live on the BBC.", "url": "https://www.bbc.com/sport/articles/cgj82ded2nyo"}