{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:26:31", "date_modify": "2025-05-21 07:26:31", "date_publish": "2025-03-28 14:03:57", "description": "Former England all-rounder Ravi Bopara, 39, is named head coach of Karachi Kings in the Pakistan Super League.", "filename": "sport_cricket_articles_crmjmkj2jdno_1747812391.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f8a1/live/1b4039f0-0bdc-11f0-8ae9-2975efdc7f47.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_crmjmkj2jdno_1747812391.html", "title": "Pakistan Super League: Ravi Bopara named head coach of Karachi Kings", "title_page": "Pakistan Super League: Ravi Bopara named head coach of Karachi Kings - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former England all-rounder Ravi Bopara has been named head coach of Karachi Kings in the Pakistan Super League.\nThe 39-year-old's appointment, his first as a head coach in a major T20 league, comes after spells as a player and assistant coach with the franchise.\n\"His journey with Karachi Kings from player and then as part of our coaching staff reflects his deep commitment to the franchise,\" owner Salman Iqbal said.\n\"We are confident that his leadership will bring fresh energy to the squad.\"\nBopara played 13 Tests, 120 one-day internationals and 38 T20s for England between 2007 and 2015.\nSince his last international he has played in a host of domestic leagues, including with Karachi who he captained in 2016. He is due to play for Northamptonshire in this summer's T20 Blast.\nBopara's appointment, replacing former West Indies international Phil Simmons who has been named Bangladesh coach, immediately makes him one of the most high-profile English coaches in franchise cricket.\nEx-England all-rounder Andrew Flintoff is the only English coach in the men's Hundred and there are no Englishmen in charge in the Indian Premier League. Former England coach Peter Moores leads Melbourne Stars in the Big Bash.\nDarren Gough, the former England and Yorkshire bowler, announced on Friday he will not take up his head coach role at Lahore Qalandars this year because of personal commitments.\nThe PSL begins on 11 April.", "url": "https://www.bbc.com/sport/cricket/articles/crmjmkj2jdno"}