{"authors": ["Sophie Hurcom at Ashton Gate", "www.facebook.com"], "date_download": "2025-05-21 04:51:51", "date_modify": "2025-05-21 04:51:51", "date_publish": "2025-01-05 15:10:16", "description": "Ilona Maher made her Bristol Bears debut but could not prevent Gloucester-Hartpury scoring a valuable win in the race for a PWR top-four finish.", "filename": "sport_rugby-union_articles_c9vkzdx2yglo_1747803111.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8647/live/3e753f00-cb78-11ef-b454-0d3064afa545.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c9vkzdx2yglo_1747803111.html", "title": "Premiership Women's Rugby: Ilona Maher debut as six-try Gloucester-Hartpury dominate Bristol Bears", "title_page": "Premiership Women's Rugby: Ilona Maher debut as six-try Gloucester-Hartpury dominate Bristol Bears - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ilona Maher made her much-anticipated Bristol Bears debut off the bench but could not prevent Gloucester-Hartpury scoring a valuable win in the race for a top-four finish in Premiership Women's Rugby.\nIn front of a club record crowd of 9,240 at Ashton Gate, the biggest attendance for a standalone game in the competition, American superstar Maher made her appearance with just over an hour played.\nYet Gloucester-Hartpury kept their focus to see out a prized win over their neighbours, nudging the visitors up a place to second in the table and dealing a blow to fifth-placed Bristol.\nMillie David and Alisha Joyce-Butchers scored tries for Bears to one from Gloucester-Hartpury's Emma Sing in a tightly fought first half that was edged by the hosts.\nNatasha Hunt's try after the break edged the visitors in front before Rachel Lund and Maud Muir added two more to carry Gloucester-Hartpury to a 28-10 lead.\nMaher then made her entrance to a massive roar from the record-breaking crowd at Ashton Gate, and while Sarah Bern pulled one try back for Bristol, Mia Venner and Georgia Brock scored in response as Gloucester-Hartpury made sure of the win.\nMaher's status as the most-followed rugby player in the world on social media saw the game moved to Ashton Gate because of the demand for tickets.\nThe Olympic bronze medallist has been celebrated in the United States as a body positivity and women's sports advocate, modelling for Sports Illustrated and appearing as a celebrity contestant on Dancing With The Stars.\nSunday's final crowd tally smashed the Bears' previous record of 4,101 and set the new competition high mark.\nMaher, 28, signed for the club on a three-month deal in December as she switched back to XVs from sevens in a massive coup for the West country club.\nHowever, this defeat leaves Bristol six points off the top four, while Gloucester-Hartpury sit pretty behind leaders Harlequins.\nGloucester-Hartpury came into the game off the back of three league wins, although the Bears had the upper hand when the two met in the reverse fixture earlier this season.\nIt was the two-time champions who struck first when Sing threw a dummy in a two-on-one before dashing through a gap to run over for her seventh try for Gloucester-Hartpury.\nBristol retaliated instantly, as Jasmine Joyce-Butchers combined with 19-year-old David to open up space for the winger to shrug off a tackle and run into the corner.\nGloucester-Hartpury dominated possession, but the home defence held firm as Jasmine Joyce-Butchers made a try-saving tackle to deny Kate Williams.\nThe visitors then had fly-half Lleucu George yellow-carded for repeated infringements and the Bears made the advantage pay.\nHollie Aitchison sent a long ball to Alisha Joyce-Butchers, who wiped out three defenders with a dummy and crossed in the corner to give the Bears the lead.\nGloucester-Hartpury swung momentum back their way after the break as their international-loaded forwards turned the screw and pinned the Bears in their own half.\nAn opportunistic Hunt darted out of a maul and over before Lund opened up daylight, collecting a pass from Venner for an easy finish.\nMuir added the bonus-point fourth try, crashing over from close range, before Maher had her big moment as she experienced the English top flight for the first time.\nChanges off the bench gave home fans and the Bears an instant lift and they narrowed their deficit through Bern as the forward powered over from close range.\nYet Gloucester-Hartpury crushed any hopes of a comeback, first through Venner before Brock scored their sixth try with a minute left to play, touching down as a maul drove over.\nIn Sunday's other fixture, Loughborough Lightning claimed an impressive victory over Saracens which saw them climb to sixth in the table.\nThe match ended 22-17 meaning Saracens claimed a losing bonus point to take back to the capital.", "url": "https://www.bbc.com/sport/rugby-union/articles/c9vkzdx2yglo"}