{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:49:25", "date_modify": "2025-05-21 03:49:25", "date_publish": "2025-04-07 15:10:20", "description": "Southampton news: Fan views on Ivan Juric's exit", "filename": "sport_football_articles_c78je69lp3po_1747799365.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c78je69lp3po_1747799365.html", "title": "Southampton news: Fan views on Ivan Juric's exit", "title_page": "Southampton news: Fan views on Ivan Juric's exit - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your views on Southampton parting ways with manager Ivan Juric following confirmation of the club's relegation from the Premier League.\nHere are some of your comments:\nMaximus: I think it's the right decision; Ivan Juric was brought in to keep us up, so there's no point in keeping him on now that we've been relegated. It gives us more time to find a new manager who will hopefully get us playing a cohesive and adaptable style of play with players who want to be there. If we can get promoted again at first try, and then stay up, so much the better.\nLen: The club is a mess, poor signings, players and managers for the past four seasons, penny pinching on decent players and buying too many youngsters. You get what you pay for, this season has proved it. If this continues we will struggle in the Championship next season.\nStu: Not his fault. Another bad decision from the top. Huge swing in style to Juric from Martin, players already struggling, not hard to see it go this way. Can only hope Johannes Spors is truly in the driving seat now and can work on implementing a long-term vision which is consistent.\nDave: Southampton owners and management are a disgrace. Relegation is not the manager's fault, it is firmly theirs. Lack of investment, the selling of every decent player they ever had and giving managers an uphill task every time. Without change, nothing will change. Time for the owners to move on and sell their interests to people with ambition.", "url": "https://www.bbc.com/sport/football/articles/c78je69lp3po"}