{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:20:30", "date_modify": "2025-05-21 05:20:30", "date_publish": "2025-04-03 13:22:04", "description": "Captain Tom Westley challenges Essex's younger players to help propel the club to a new era of success.", "filename": "sport_cricket_articles_cy8e7m985evo_1747804830.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ea13/live/f5e57e20-1088-11f0-8513-e5a67661a7e5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cy8e7m985evo_1747804830.html", "title": "Tom Westley: Essex skipper urges younger players to create own legacy", "title_page": "Tom Westley: Essex skipper urges younger players to create own legacy - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Captain Tom Westley has challenged Essex's younger players to help propel the club to a new era of success.\nEssex begin the new County Championship season on Friday with a home game against Surrey, who have dominated the competition for the past three years.\nChris Silverwood has returned as Essex's director of cricket, having previously guided them to the title in 2017, which was followed by a Championship and T20 Blast double in 2019 and the Bob Willis Trophy in 2020.\n\"We haven't won anything for a few years now and if we want to be remembered like the Gooch era, the Fletcher era, we need to add a couple more Championships before we're even considered,\" Westley told BBC Essex Sport.\n\"That's going to be the shift in the mentality of the players, to want to create their own legacy - which is going to be a challenge because we don't necessarily have the resources of some counties.\n\"What we do have is quality and talent in abundance in the changing room. We're tired now of competing or running them close, it would be nice if we can actually lift a trophy again.\"\nEssex, who finished fourth in Division One last season, will again rely heavily on the quality of prolific seam bowlers Jamie Porter and Sam Cook and off-spinner Simon Harmer, while Westley - now 36 - and South African Dean Elgar, who misses the Surrey game after becoming a father of twins, provide the experience in the batting line-up.\nBut they also have the likes of Noah Thain, Luc Benkenstein, Robin Das and Charlie Allison, who are looking to gain more game time with the first team.\n\"There's always a changing of personnel, people getting a bit older, and some of the younger guys are probably at a stage in their careers now where they want to stamp their authority on the club and want their own success,\" said Westley.\n\"It is an exciting time. In the last three or four years we've been competitive but my challenge to the squad and the management's challenge is you actually want to create your own success.\n\"There's only a handful of us who were involved in the trophy success of a few years back, so the challenge is can that next crop of Essex cricketers create their own legacy?\"\nOn former England and Sri Lanka head coach Silverwood's return to Chelmsford, Westley added: \"He is familiar with the club, and is also desperate and hungry for the club to move forward and be successful (again).\n\"Silvers has changed himself, he's had international experience which has been fantastic for him, and hopefully bringing that knowledge and experience back to Essex will only benefit us.\"", "url": "https://www.bbc.com/sport/cricket/articles/cy8e7m985evo"}