{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:29:06", "date_modify": "2025-05-20 14:29:06", "date_publish": "2023-07-29 00:00:00", "description": "Watch and follow updates as Sweden face Italy in Group G of the 2023 Women's World Cup.", "filename": "sport_live_football_66176928_1747751346.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/14512/production/_130581238_gettyimages-1578050436.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_football_66176928_1747751346.html", "title": "Fifa Women's World Cup LIVE: Watch Sweden vs Italy score, commentary & updates from Group G game", "title_page": "Fifa Women's World Cup LIVE: Watch Sweden vs Italy score, commentary & updates from Group G game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "'Brilliant finish from Blomqvist '\nSweden 5-0 Italy\nSue Smith\nFormer England international on BBC Two\nRebecka Blomqvist with a brilliant finish. Individual bit of play, the way that Sweden go from defence to attack so quickly.\nTo have the calmness to just slot it past Francesca Durante, absolutely brilliant.\nSweden are at their best when they go from defence to attack very quickly. Great counter-attack.\nGOAL - Sweden 5-0 Italy\nRebecka Blomqvist\nFive for Sweden. Substitute Rebecka Blomqvist joins the party. She gathers the ball on the halfway line, takes a touch and it's a race she wins.\nShe is then through on goal and it is the calmest of calm finishes to slot the ball past Francesca Durante.\nPost\nSweden 4-0 Italy\nSix minutes of injury time. Italy will be hoping for the match to end soon. A frantic spell of four goals either side of the half-time break have taken this one away from them and we're just going through the motions now,\nPost\nSweden 4-0 Italy\nSue Smith\nFormer England international on BBC Two\nSofia Jakobsson is frustrated, she knows that is an opportunity to get a goal.\nYou just think maybe a little dink around the goalkeeper but she just tries to pass it around Francesca Durante.\n'Sweden have a knack of peaking at the right time'\nSweden 4-0 Italy\nSue Smith\nFormer England international on BBC Two\nSweden seem to have a knack of peaking at the right time in those knock out games and getting to the latter stages of competitions, getting better as the tournament goes on.\nPost\nSweden 4-0 Italy\nSweden will be in the last 16, but have a tough task in the next phase. Group G is paired with Group E meaning the Swedes will face probably either 2019 winners the United States or 2019 runners-up the Netherlands on Sunday, 6 August.\n'Italy haven't threatened Sweden's goal'\nSweden 4-0 Italy\nSue Smith\nFormer England international on BBC Two\nItaly are OK at keeping possession but when it comes to the final third, they have lacked in the quality or threat.\nThey have not really threatened Sweden's goal.\nIt's been set pieces from Sweden and that's what Milena Bertolini will be disappointed with.\nAlmost 30,000 in the ground\nSweden 4-0 Italy\nNeil Johnston\nBBC Sport at Wellington Regional Stadium\nWow. The official attendance is announced over the speakers and is met by roars and applause. There are 29,143 inside the ground - around 2,000 more than watched defending world champions the United States here on Thursday. They have been thoroughly entertained.\nPost\nSweden 4-0 Italy\nMore changes to report. For Italy striker Valentina Giacinti, who started the first match but was a sub today, comes on for Chiara Beccari.\nFor Sweden, legendary midfielder Caroline Seger, playing in her fifth World Cup, comes on for international appearance number 237. Sofia Jakobsson is also on, with Elin Rubensson and Chelsea's Johanna Rytting Kaneryd going off.\nPost\nSweden 4-0 Italy\nThis has been a pretty good way to start day 10 of the Fifa Women's World Cup (unless you are supporting Italy).\nThere are another two matches on Saturday with France v Brazil at 11:00 BST before Jamaica v Panama at 13:30 BST.\nPost\nSweden 4-0 Italy\nAt the moment, this is the equal fourth-largest margin of victory at the 2023 Women's World Cup.\nGermany are the only nation to win by six goals in their 6-0 hammering of Morocco, while both Japan and Spain put five past Zambia without reply.\nget involved\nGet Involved\n#bbcfootball, via WhatsApp on 03301 231826 or text 81111 (UK only, standard message rates apply)\nJoe Gibney: The Arsenal head coach Jonas Eidevall said before the game to watch out for Sweden at corners as they're very good at them. Sweden have scored three goals (so far) from corners. The man knows what he's talking about.\nPost\nSweden 4-0 Italy\nWhile it's a miserable evening for Italian fans, they shouldn't feel too down. Qualification is still very much in their reach and a win over South Africa on Wednesday will take Italy into the last 16.\n'No need to risk Girelli at 4-0 down'\nSweden 4-0 Italy\nSue Smith\nFormer England international on BBC Two\nThere's got to be some reason why Cristiana Girelli is not starting but at 4-0 down do you risk her? Probably not.\nYou wait for that third game when you absolutely need her and you need to get a result.", "url": "https://www.bbc.com/sport/live/football/66176928"}