{"authors": ["Josh Lobley", "www.facebook.com"], "date_download": "2025-05-21 04:28:09", "date_modify": "2025-05-21 04:28:09", "date_publish": "2025-01-23 15:48:27", "description": "Kieran McKenna press conference: Liverpool vs Ipswich", "filename": "sport_football_articles_c5ye2yexpj0o_1747801689.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8a85/live/ac9e2280-490a-11ef-9e1c-3b4a473456a6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c5ye2yexpj0o_1747801689.html", "title": "Kieran McKenna press conference: Liverpool vs Ipswich", "title_page": "Kieran McKenna press conference: Liverpool vs Ipswich - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "McKenna spoke highly of new signing Julio Enciso: \"He's a very talented young player. He's had some great experiences at a young age and had a really good impact at Brighton. It's a good move for both parties and hopefully it will be a good boost for us.\"\nHe was asked what the conversations were like before signing the Paraguayan: \"I speak about similar things with [all] loan players. It's a chance to play more minutes than you are and that is very important for him. We spoke about his role in the team and the squad and how we will try and get the best out of him. He was really keen to come, which is always a positive sign.\"\nMcKenna also confirmed Enciso is available for selection on Saturday.\nHe said that the club will \"go to the last day\" to try and bring in additional players in this transfer window: \"We have enough depth in the squad, so it's only if we can add players who will have a really big impact and improve us.\"\nHe accepted that outgoings are still a possibility before the window closes: \"Ali Al-Hamadi has been having conversations with different clubs. George Edmundson has been recalled but there has been discussions there.\"\nHe says that player availability will not be \"drastically different\" from last weekend's match: \"[Sammie] Szmodics and Connor Chaplin will still fall short. The boys who missed out last week will still be unavailable.\"\nOn opponents Liverpool: \"They have been an enjoyable watch and they have carried that all the way through the season. They are a complete team who defend well and press high. Their counter-press and counter-attacks are good. They can control the game and also change gears really quickly. They are well coached and have good principles in all phases.\"", "url": "https://www.bbc.com/sport/football/articles/c5ye2yexpj0o"}