{"authors": ["Nat Hayward", "www.facebook.com"], "date_download": "2025-05-21 05:51:20", "date_modify": "2025-05-21 05:51:20", "date_publish": "2025-04-02 09:36:58", "description": "Enzo Maresca press conference: Chelsea vs Tottenham preview", "filename": "sport_football_articles_clywddlxze4o_1747806680.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8254/live/3cea8160-6de3-11ef-8c32-f3c2bc7494c6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_clywddlxze4o_1747806680.html", "title": "Enzo Maresca press conference: Chelsea vs Tottenham preview", "title_page": "Enzo Maresca press conference: Chelsea vs Tottenham preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Maresca confirmed Cole Palmer, Noni Madueke and Nicolas Jackson \"are all good\" and ready to return from their respective injuries.\nHe believes returning players can improve the Blues' form: \"We've said many times, it is a game for players and when they are not there, you struggle. This has happened with us this season, where we had five or six unbelievable months and then had six or seven injuries in a row and we lost something. Now it is good to finish with all of them.\"\nHowever, Romeo Lavia remains a doubt: \"He was doing better in terms of progress but unfortunately one or two days ago he had a small problem, so we will see in the next hours.\"\nThe Chelsea boss also added that they \"need to manage\" captain Reece James' fitness: \"The reason why is because you know his history probably better than me. He is a player you need to be careful with. We want him fit until the end so the idea is to manage him until the end and then we will see in the future if we can go every day.\"\nHe said cancelling his players' day off after losing 3-0 to the club's under-21 side was \"nothing\": \"Since I joined the club, I always demand high standards. It was not an official game. Some players were not here but it was normal for players to be a bit relaxed. It was nothing strange or nothing new. I didn't allow this so we decided to train.\"\nOn Jadon Sancho's future: \"I love all the players with us. In this moment, it is to finish well and not think about next season. What happens in the summer, we will see. I am happy with all the players here. For sure, he can do better in terms of numbers, no doubt, but it is not only about Jadon.\"\nOn the climax to the season: \"The attitude has always been top, every day, and even in the last week because they know how important it is from now on. Every game becomes important. We have nine games to go and hopefully we can finish well.\"\nHow crucial could beating Spurs be?: \"From that win, you can build momentum for the end. We need to win as many games as we can and we will see where we finish.\"", "url": "https://www.bbc.com/sport/football/articles/clywddlxze4o"}