{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 08:01:36", "date_modify": "2025-05-21 08:01:36", "date_publish": "2025-03-28 00:00:00", "description": "Watch live coverage of Snowboard, Freestyle and Freeski World Championships from St Moritz, Switzerland.", "filename": "sport_live_c9wpjqw91nwt_1747814496.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/82b9/live/3a76a1a0-0bd8-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_live_c9wpjqw91nwt_1747814496.html", "title": "Snowboard, Freestyle and Freeski World Championships LIVE: Watch coverage from St Moritz, Switzerland", "title_page": "Snowboard, Freestyle and Freeski World Championships LIVE: Watch coverage from St Moritz, Switzerland - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Who to look out for today?\nBBC Sport\nJapanese teenage star Hasegawa Taiga is the early favourite for gold in the men's snowboard big air finals. At age 15, Hasegawa Taiga made history as the world's first rider to land 1800 rotations all four ways – frontside, backside, Caballerial, and switch backside.\nIn the men's Snowboard cross, Great Britain's hopes lie with 23-year-old Huw Nightingale. He competed for Great Britain as part of the 2022 Winter Olympic Games.\nIn the women's, Great Britain also have hope of victory with Charlotte Bankes. She claimed her third successive snowboard cross World Cup victory of the season as she triumphed in Cortina d'Ampezzo, Italy.\nHow to get into winter sports\nGet Inspired\n#GetInspired\nSkiing\nYou fix on a pair of skis to your feet, whilst wearing special boots, and glide down a slope. Many people in the United Kingdom learn the basics of alpine skiing on dry ski slopes or at indoor snow centres, which offer lessons and equipment rental.\nFind your local centre in England,, external Wales, external or Scotland, external to get yourself on the slopes. The Ski Club of Northern Ireland has a useful Facebook page, external too. There's also loads of information at Disability Snowsport, external for anyone looking for inclusive skiing.\nSnowboarding\nSnowboarding will give you an adrenaline rush of speed and you can learn how to do tricks. If you like the cold and being outdoors - although there are indoor slopes all over the country - then give it a go.\nFind your nearest club in England,, externalScotland,, externalWales, external or Northern Ireland., external", "url": "https://www.bbc.com/sport/live/c9wpjqw91nwt"}