{"authors": ["Nick Webb", "www.facebook.com"], "date_download": "2025-05-21 03:42:03", "date_modify": "2025-05-21 03:42:03", "date_publish": "2025-04-06 18:10:36", "description": "Seamer Ian Holland blows away the Glamorgan top order to earn Leicestershire a flying start to the season in Cardiff.", "filename": "sport_cricket_articles_c3ev171v9ngo_1747798923.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/db62/live/75bf2bc0-1311-11f0-a8f7-59659b31eb3f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c3ev171v9ngo_1747798923.html", "title": "Leicestershire race to three-day win over Glamorgan", "title_page": "Leicestershire race to three-day win over Glamorgan despite Carlson ton - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Seamer Ian Holland blew away the Glamorgan top order to earn Leicestershire a flying start to the season in Cardiff.\nGlamorgan were bowled out for 248 in their second innings despite Kiran Carlson's battling 113 and a maiden Andy Gorvin 50.\nLeicestershire needed 51 to win and claimed the extra half-hour to race to victory by 10 wickets.\nThey dominated the game with Holland taking 4-46 to add to his first innings 3-40.\nA consistent visitors' batting display, with five players passing 50, saw them to 427 all out in their first innings.\nAt the start of the day Andy Gorvin finally ended the Leicestershire tail-end frolics as he had Ben Cox lbw for 51 with the second ball of the morning, and although the injured Rishi Patel came out to try to see Chris Wright to a maiden century, his bravery was in vain as Wright was bowled for 74.\nBut even though Glamorgan had hoped the pitch would flatten out in the sunshine after another heavy roller, Holland soon got to work and made the most of the new ball.\nA peach of a yorker accounted for Zain Ul Hassan lbw, Sam Northeast inside-edged his first ball on to the stumps, and Eddie Byrom drove a wide ball to gully after attempting to dig in.\nWith Leicestershire bowling far more consistently than the home side, Ben Green induced an edge from Colin Ingram and batting hero Wright pinned Ben Kellaway leg-before before limping off during his 10th over.\nCarlson and Chris Cooke halted the slide temporarily with a stand of 51 as Carlson reached his 50 off 112 balls with an upper-cut six.\nBut Cooke's dismissal for 21, lbw to Green, looked to signal the beginning of the end as Leicestershire eyed up a day off.\nCarlson and Gorvin had other ideas as they eventually settled in together with a stand of 99 for the eighth wicket which avoided the the innings defeat.\nCarlson's fluent innings, including 10 fours and that six, ended in the last over with the old ball as he skied Mike to tumbling substitute Liam Trevaskis at fine leg, but Gorvin had enough time to reach a well-earned half-century before running out of partners.\nSol Budinger (32 not out) was joined by Rehan Ahmed (13 not out) as the pair swung hard from the start to wrap up the win in helter-skelter fashion, with spinner Kellaway bizarrely bowling two high full-tosses in four balls to be taken off.\nThe injuries to Patel and Wright were the only downside to Leicestershire's dominant display as they prepare to host Derbyshire, while new Glamorgan coach Richard Dawson must ponder whether to make early changes for the trip to his former county Gloucestershire.", "url": "https://www.bbc.com/sport/cricket/articles/c3ev171v9ngo"}