{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 08:07:22", "date_modify": "2025-04-26 08:07:22", "date_publish": "2025-02-26 14:24:13", "description": "Former Republic of Ireland international Andy Reid believes Coventry's run of form could be the perfect timing to get into the play-offs.", "filename": "sport_football_articles_cy83xdd9jy7o_1745654842.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f9ce/live/6dc0bdc0-f44a-11ef-837a-fdc1fd381948.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cy83xdd9jy7o_1745654842.html", "title": "Andy Reid: Coventry City could be timing their play-off challenge right", "title_page": "Andy Reid: Coventry City could be timing their play-off challenge right - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Coventry City may be timing their challenge for the Championship play-offs at just the right time, says former Republic of Ireland international Andy Reid.\nThe Sky Blues have won seven of their past eight league games to move within one point of the top six ahead of their trip to Oxford United on Saturday.\n\"The thing about the Championship is the games come so thick and fast you can rack up up a load of points quickly,\" former Nottingham Forest midfielder Reid told the BBC's Football Daily podcast.\n\"Coventry are the ones you look at and they've put themselves in with a great chance because of how quickly the games come where you can gather the momentum and fire up that league quickly.\"\nCoventry were in 17th place and 10 points off the pace when Frank Lampard replaced Mark Robins as boss at the end of November and have only lost four of their 17 league games under the former England and Chelsea midfielder.\n\"The timing of the run is key like Nottingham Forest did a few years ago where you get into the play-offs with a good bit of form,\" Reid added.\n\"There is so much to be said for going into the play-offs where you've won six games on the bounce and you are battle-hardened.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cy83xdd9jy7o"}