{"authors": ["Mike Henson", "www.facebook.com"], "date_download": "2025-04-26 03:39:14", "date_modify": "2025-04-26 03:39:14", "date_publish": "2025-03-04 21:14:31", "description": "Jamie George says he considered ending his England career because of the shock and pain of losing the captaincy before the start of the Six Nations.", "filename": "sport_rugby-union_articles_cdelz3127d4o_1745638754.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ba5d/live/58006e10-f939-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_cdelz3127d4o_1745638754.html", "title": "Jamie George on pain of losing captaincy before Six Nations", "title_page": "Jamie George on pain of losing captaincy before Six Nations - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Jamie George has said he considered ending his England career because of the shock and pain of losing the captaincy before the start of the Six Nations.\nHooker George, 34, succeeded Owen Farrell as England skipper before last year's championship, but was replaced by Saracens team-mate Maro Itoje in January.\n\"It was hard, it was difficult, it was frustrating and obviously then that makes you question if you can do it,\" he told BBC Sport's Rugby Union Weekly podcast.\n\"I won't lie and say it didn't go through my head [finishing his England career] because I didn't really know how logistically it would work and if it would be too awkward to be coming back in. I didn't want to tread on any toes.\"\nGeorge says he consulted his father, uncle and wife on his decision, and not all of them thought he should continue his international career.\nLISTEN: Jamie George speaks to Rugby Union Weekly\n\"But ultimately it was 'what is your gut feel?\" George added. \"Initially I didn't know if I could go back, but I watched the Ireland game [this year's Six Nations opener which he missed through injury] and all I wanted to do was be back on that field because I missed it.\"\nUnder George, England finished third in the 2024 Six Nations, but then suffered a run of five successive defeats in matches against New Zealand, Australia and South Africa across the summer and autumn.\nEngland won five of 12 Tests under his stewardship.\nGeorge, who has picked up three Six Nations titles and played in the 2019 World Cup final, said head coach Steve Borthwick broke the news to him over coffee in a \"pretty to-the-point\" conversation in St Albans.\n\"I think he was surprised by me questioning myself,\" added George. \"I think it would hit anyone hard. It was a job that I loved, I was incredibly proud to be able to do it and I felt I was at the start of something. It was a surprise.\"\nGeorge added that he would have preferred to have given more time to digest the news privately, with his conversation with Borthwick coming only a day before Itoje's promotion was made public.\nUpon his appointment, Itoje described George as \"a great friend and leader\" who had led the team \"brilliantly\", while Borthwick explained that having a skipper who was on the pitch for 80 minutes, rather than, like most front rows, replaced midway through the second half, was one factor in his decision.\nGeorge said he is now taking inspiration from cricketer Joe Root, who was in a similar situation in 2022 when the England Test captaincy was passed to Ben Stokes.\n\"His batting improved significantly off the back of not being captain any more and he looked freed up and enjoying himself and still contributing a huge amount and them valuing his leadership,\" said George.\n\"I am not saying I am the Joe Root of the England rugby team, but I have taken inspiration from that.\"\nGeorge, who said the captaincy going to Itoje \"eased me a lot as I know how good Maro is\", is poised to win his 100th England cap in Sunday's match against Italy.\nThe Saracen replaced Luke Cowan-Dickie off the bench to help his team to nail-biting wins over France and Scotland in their past two matches.\nGeorge still has big ambitions in the sport and wants to go on a third British and Irish Lions tour this summer and represent England at the 2027 World Cup, both of which are in Australia.\nHe, along with fellow front row Ellis Genge, is now an England vice-captain.\n\"I never thought I would be here, ever, in a million years,\" he said. \"Genuinely it is surreal. I am blown away by it all.\n\"The whole journey has not been straightforward, but you sort of learn and you get your head down. I learnt pretty early on that I had to be resilient and toughen up a bit. I feel that I have done that well.\n\"I am as ambitious now as I was when I was 25 and I first came into the team.\"\nGeorge is poised to become the seventh male player to win 100 England caps after Ben Youngs (127), Dan Cole (118), Jason Leonard (114), Owen Farrell (112), Courtney Lawes (105) and Danny Care (101).", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/cdelz3127d4o"}