{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:49:02", "date_modify": "2025-05-21 03:49:02", "date_publish": "2025-01-15 12:01:09", "description": "Big Bash League 2024-25 results: Ollie Pope and Jamie Overton impress in Adelaide Strikers loss", "filename": "sport_cricket_articles_cqx980pj7l5o_1747799342.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3388/live/d4f5d4b0-d336-11ef-b1bb-f56965424f3f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cqx980pj7l5o_1747799342.html", "title": "Big Bash League 2024-25 results: Ollie Pope and Jamie Overton impress in Adelaide Strikers loss", "title_page": "Big Bash League 2024-25 results: Ollie Pope and Jamie Overton impress in Adelaide Strikers loss - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Adelaide Strikers hopes of making the Big Bash League knockout stages suffered a blow as they fell to a three-wicket loss to Sydney Sixers despite the best efforts of Ollie Pope and Jamie Overton.\nEngland Test vice-captain Pope top-scored with 57 from 39 balls, adding 97 for the fourth wicket with Alex Ross (48 from 37), before Overton added an unbeaten 32 from 14 late in the innings as the Strikers posted 182-5.\nHowever, Steve Smith's half-century got the Sixers chase off to the ideal start before he was dismissed by Overton having made 52 from 31 balls.\nOverton, who ended with figures of 2-35, trapped Jordan Silk lbw in the same over and when Moises Henriques fell to wrist-spinner Lloyd Pope at the start of the next, the Sixers were 92-5.\nBut Lachlan Shaw and Ben Dwarshuis' 55-run stand got them back in contention and Hayden Kerr's cameo of 18 from nine balls got the away side over the line with a ball to spare.\nWhile the Sixers return to the top of the table, the Strikers stay sixth and progressing to the knockout phase is no longer in their own hands.", "url": "https://www.bbc.com/sport/cricket/articles/cqx980pj7l5o"}