{"authors": ["Andy Burke", "www.facebook.com"], "date_download": "2025-05-21 04:10:33", "date_modify": "2025-05-21 04:10:33", "date_publish": "2025-04-06 12:33:43", "description": "'We're here to win the thing' - Venter eyes Champions Cup glory with Glasgow", "filename": "sport_articles_cn4wmmkzvkgo_1747800633.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9628/live/d8ab28d0-12e2-11f0-b182-81b971f8bd66.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cn4wmmkzvkgo_1747800633.html", "title": "'We're here to win the thing' - Venter eyes Champions Cup glory with Glasgow", "title_page": "'We're here to win the thing' - Venter eyes Champions Cup glory with Glasgow - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Henco Venter wants to bring the curtain down on his Glasgow Warriors career by delivering a URC and Champions Cup double.\nThe South African number eight is leaving Scotstoun at the end of the season to join French side Brive.\nVenter, 32, produced a player of the match display against Leicester, including two tries, to help his side into the Champions Cup quarter-finals.\nThey now head to Dublin for a showdown with Leinster, who destroyed Harlequins 62-0 to book their spot in the last eight.\nThe Irish side are one of the tournament favourites and will be overwhelming favourites to reach the semi-finals, but Venter says Glasgow are chasing their own Champions Cup ambitions.\n\"We're here to win the thing,\" Venter told BBC Scotland.\n\"I think Leinster's performance against Harlequins was next level and all kudos to them. We'll meet them next week and we'll definitely take the confidence [from beating Leicester] and be up for it.\n\"I'm also gutted [to be leaving]. I love this place, I love the Scots, I love Glasgow. It's just a privilege to wear this shirt every day.\n\"It's two cups to win for me and just to give everything for this club that's given so much to me.\"", "url": "https://www.bbc.com/sport/articles/cn4wmmkzvkgo"}