{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:14:36", "date_modify": "2025-05-21 06:14:36", "date_publish": "2025-01-04 20:16:44", "description": "Amankwah Forson's match-winning double for Norwich could launch the midfielder's career at Carrow Road, says Canaries boss Johannes Hoff Thorup.", "filename": "sport_football_articles_cg52j8yzd5zo_1747808076.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/fa74/live/43a37230-cad3-11ef-94df-33b0323b7c60.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cg52j8yzd5zo_1747808076.html", "title": "Amankwah Forson: Midfielder can launch Norwich career with double, says boss Thorup", "title_page": "Amankwah Forson: Midfielder can launch Norwich career with double, says boss Thorup - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Amankwah Forson's match-winning stoppage-time double against Coventry could launch the Norwich midfielder's career at Carrow Road, says Canaries boss Johannes Hoff Thorup.\nThe Norfolk side were a goal down when substitute Forson, making his first appearance in seven games, curled home a stunning equaliser from 25 yards in the 91st minute.\nFour minutes later, his first-time finish from the edge of the area sealed a dramatic 2-1 win and sparked euphoric scenes.\n\"They are the small moments that can change, probably, an entire career,\" Thorup told BBC Radio Norfolk.\n\"Of course you need to build on this performance and build on this momentum, but it can be a new start for him, a change from where he was completely out of the team. And that is of course my decision, but it can be that I make mistakes as well.\"\nThorup praised the Ghana international's attitude after he was brought on as a late substitute, and now wants to see the 22-year-old use his match-winning exploits to flourish.\n\"It's just the mentality and personality just to step in and do your job for 10 minutes and try your best and see what you can do - that is the way to behave in moments like this,\" Thorup said.\n\"Then of course when you score two goals and the decisive one at the end, then you probably have some momentum to build on, so it is for us not to kill that.\"\nForson said he was \"excited and happy\" that his first two goals for Norwich proved to be so dramatically instrumental.\nHe also admitted that his start at Carrow Road \"hasn't been easy\".\nThe midfielder had not featured since November and the appearance off the bench against Coventry was just his 19th across all competitions since joining Norwich from Austrian club RB Salzburg last summer.\n\"I can't forget this moment,\" Forson said of the two goals that had him hoisted off the ground in celebrations after the match.\n\"As a football player you know your time will come, you just need to stay focused and make it happen and to grab it.\n\"So whatever it is, I just need to stay focused. If I play or don't play, always be happy and when my chance comes you get it done.\"", "url": "https://www.bbc.com/sport/football/articles/cg52j8yzd5zo"}