{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:23:02", "date_modify": "2025-05-20 12:23:02", "date_publish": "2023-08-04 14:09:37", "description": "Head coach Frankie McAvoy dismisses suggestions the management set-up at Hearts is a problem for the players.", "filename": "sport_football_66409262_1747743782.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/CFCB/production/_130659135_frankie.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66409262_1747743782.html", "title": "Hearts: Frankie McAvoy on managing with Steven Naismith", "title_page": "Hearts: Frankie McAvoy on managing with Steven Naismith - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Head coach Frankie McAvoy has dismissed suggestions the management set-up at Heart of Midlothian could be confusing to the players.\nMcAvoy was named head coach because Steven Naismith, who impressed in interim control last season, has not completed his Uefa pro licence.\nHowever, McAvoy admits he will take the final decisions over team selection.\n\"We don't find [the situation] awkward, we don't find it confusing. We work closely together,\" said McAvoy.\nThe duo, along with first-team coach Gordon Forrest, have signed contracts until the summer of 2025, with the option of a further year.\nHaving the pro licence is a prerequisite for managing in Europe and McAvoy will have to clearly demonstrate to governing body Uefa that he is in charge when Hearts will play a Europa Conference League qualifier against either Rosenborg or Crusaders this month.\nNaismith has been keen to stress the only alterations at Tynecastle since the end of last season - when he was in charge for seven games - are in the job titles.\nBut McAvoy added: \"There are moments in the game where Steven, Gordon and myself are all involved quite closely.\n\"The only difference is if we go through the team selection and there is a bit of a disagreement of opinion then I will make that decision. It's as simple as that.\n\"We worked really well together last season and the club were happy with what we did.\"\nMcAvoy said there is clarity among the squad about the management structure and there is no ambiguity in terms of messaging.\nHe is also keen to empower the players to take leadership roles as Hearts - who begin their Premiership campaign at St Johnstone - target a minimum finish of third.\n\"Of course you need leaders, but leaders are about making others leaders as well,\" added McAvoy, who expects forward Kenneth Vargas to arrive from Costa Rica this weekend.\n\"That's important - but the guys in the dressing room are the most important in knowing and understanding exactly the message we are putting across to them and who is putting it across.\n\"We have set our targets of getting into European football again next season - our aim is to finish third, but there will be other teams like Aberdeen, Hibs, Motherwell and St Mirren who will be trying to stop us.\"", "url": "https://www.bbc.com/sport/football/66409262"}