{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:19:05", "date_modify": "2025-05-21 05:19:05", "date_publish": "2025-01-23 10:02:00", "description": "Man City's Lily Murphy: Derby winner 'dream come true'", "filename": "sport_football_articles_cn4mg927wx1o_1747804745.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/65ae/live/d7b9fe70-d970-11ef-a5c8-1da73bd59591.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cn4mg927wx1o_1747804745.html", "title": "Man City's Lily Murphy: Derby winner 'dream come true'", "title_page": "Man City's Lily Murphy: Derby winner 'dream come true' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester City's teenage forward Lily Murphy says it was \"a dream come true\" to score the winning goal against Manchester United in the League Cup quarter-final on Wednesday.\nThe 18-year-old, making her second start for the club, scored and provided an assist as she stole the show in her side's 2-1 win at Leigh Sports Village.\n\"It's a dream come true,\" she told BBC Radio Manchester. \"You dream of these moments and to win the game as well tops it off completely.\n\"Coming up through the academy makes it even more special.\"\nCity manager Gareth Taylor, who has seen his side hit by a number of injuries to attacking players including Khadija Shaw, Lauren Hemp and Vivianne Miedema this season, was impressed with how Murphy took her opportunity.\n\"We're probably pushing her a bit more than we'd like to at this moment due to some of the injuries we've had but fair play to her, she's stepped up and done really well,\" he said.\n\"She's got a lot to improve on, she's really, really raw. But she has things like that pace, that finishing ability, to go on and have a really good career.\n\"She's really grounded, she's really humble, she's still learning.\"", "url": "https://www.bbc.com/sport/football/articles/cn4mg927wx1o"}