{"authors": ["George O'Neill", "www.facebook.com"], "date_download": "2025-05-21 04:41:29", "date_modify": "2025-05-21 04:41:29", "date_publish": "2025-04-03 08:29:11", "description": "When Hibernian hosted Aberdeen in November, there were 10 places and 23 points between the sides. The 96 minutes that followed set both teams on dramatically different paths.", "filename": "sport_football_articles_cx2wn4q148lo_1747802489.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6d69/live/a5014000-0fc2-11f0-9f8d-f125b11f3e53.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cx2wn4q148lo_1747802489.html", "title": "The six-goal November epic that changed two sides' seasons", "title_page": "Scottish Premiership: The six-goal November epic that changed two sides' seasons - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "When Hibernian welcomed Aberdeen to Easter Road in late November, the moods in the two camps could not have been more different.\nThe Dons were second in the Scottish Premiership, having dropped only five points in their first 12 league games.\nSell-out crowds were flocking to Pittodrie to watch a team transformed into a winning machine by new manager Jimmy Thelin.\nThey were eight points above Rangers and there was real talk of them splitting the Old Firm such was the optimism surrounding Thelin's side.\nAt the other end of the spectrum, Hibs were rooted to the bottom of the table, 23 points behind their next opponents having played a game more.\nRookie head coach David Gray was struggling to get a tune out of an unbalanced squad and, despite his legendary status as a Hibs player, he appeared to be on borrowed time in the dugout.\nWhat followed was a rollercoaster 96 minutes that transformed both teams' fortunes.\nGray switched to a back three in an attempt to reverse Hibs' fortunes, but second-half strikes from Jamie McGrath and Nicky Devlin had turned the game in Aberdeen's favour after Joe Newell opened the scoring for the hosts.\nIt was in second-half stoppage-time that the truly remarkable action took place though - six minutes that kick-started Hibs' season and brought Aberdeen's to a shuddering halt.\nNicky Cadden whipped a magnificent free-kick into the top corner to equalise before Ester Sokler scored at the other end with a powerful overhead kick.\nThat goal put Aberdeen level on points with Celtic at the top of the division for all of 95 seconds, until Rocky Bushiri scrambled in a 96th-minute leveller - his first goal for Hibs.\nAberdeen did not win another league game for more than 11 weeks - a 2-1 triumph at Dundee, 13 matches later.\nHibs, meanwhile, with their new shape, embarked on a stunning run of form. In the 20 matches since that November evening, they have lost only twice in all competitions, both to Celtic.\nThey also found a way to beat Brendan Rodgers' side at Easter Road as they flew up the table.\nGray's side are now third, a point above Aberdeen, having been 23 points and 10 places back on 26 November.\nThe sides have met twice in the four months since, with Hibs cruising to victory on both occasions.\nGoals from Elie Youan, Cadden and Martin Boyle earned a 3-1 win at Pittodrie just before Christmas, while Nectarios Triantis and Cadden found the net as they won 2-0 at Easter Road in February.\nBrian McLauchlin, BBC Sport Scotland\nFor Hibernian fans, the 3-3 draw was the moment their faith in the team they love was restored.\nBut, even throughout a pulsating game, their patience and resolve was tested to its maximum.\nThe last six minutes will live with me and everyone who was inside the stadium for a long time.\nPressure had been mounting on Gray after a series of costly late concessions, but then the most unlikely of heroes emerged.\nBushiri had never really won over the Hibs support. He made mistakes and opponents targeted him.\nIn his previous 78 games, he had never scored. But he did that night and it was the moment that changed a season.\nThe goal probably kept Gray in a job, given defeat would have left them languishing at the bottom of the table.\nHowever, since then, only Celtic have been able to get the better of Gray and his team and a third-place finish is now a distinct possibility.\nTyrone Smith, BBC Sport Scotland\nIt is hard to fathom what Aberdeen experienced at the end of that Easter Road epic.\nThey went from the exhilarating high of thinking they had won in its dying embers to the crushing low moments later of having to settle for a draw.\nA point in the capital is usually viewed positively, but the manner of this one had negative ramifications.\nJust a few weeks before, they had been thrashed 6-0 by Celtic in the League Cup semi-finals.\nIf you then add in the hammer blow at Hibs, it is maybe unsurprising they were blown way off course.\nThey went from a team that started the campaign in blistering fashion, one that would always find a way to win, to one that looked brittle, fragile and devoid of belief.\nIt would be two and a half months before they would win another league game.\nThere may have been other factors behind Aberdeen's incredible slump, but there is no doubt that wild minute at Easter Road was a pivotal screw that loosened the wheels before they came off.", "url": "https://www.bbc.com/sport/football/articles/cx2wn4q148lo"}