{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-04-26 08:04:09", "date_modify": "2025-04-26 08:04:09", "date_publish": "2025-02-26 16:01:06", "description": "Brighton news: Four in a row brings huge possibilities", "filename": "sport_football_articles_c30mdy0e0lqo_1745654649.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c62b/live/6891a6d0-f458-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c30mdy0e0lqo_1745654649.html", "title": "Four in a row brings huge possibilities", "title_page": "Brighton news: Four in a row brings huge possibilities - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Brighton have not won four games in a row since they were a Championship club.\nSo, in this weird campaign, when a run of positive results has been followed by a run of negative ones, it feels fitting Fabian Hurzeler has managed something that proved beyond Chris Hughton, Graham Potter or Roberto de Zerbi.\nThe big question is: how far will it take them?\nSunday's FA Cup trip to Newcastle is one of the toughest games possible, while the Premier League run-in includes matches against Liverpool and Manchester City, plus encounters with five of the teams in the same scramble to secure European football next season.\nWe are long past the point when it was a novelty or something special to see Brighton in the top half of the table. Now there is an expectation about where the Seagulls should be.\nWith eighth potentially good enough for a Conference League berth, depending on England's European performance slot standings and who wins the domestic cups, Brighton have a return to Europe very much in their grasp.\nHurzeler has made some mistakes in his debut season at Amex Stadium, but the good outweighs the bad.\nNow the pressure is on to get his selections and tactics right for the final quarter of the campaign.", "url": "https://www.bbc.co.uk/sport/football/articles/c30mdy0e0lqo"}