{"authors": ["Ross Morren", "www.facebook.com"], "date_download": "2025-05-21 06:03:47", "date_modify": "2025-05-21 06:03:47", "date_publish": "2025-01-14 10:13:04", "description": "Ross County fan column: 'Amissah contract extension comes at perfect time'", "filename": "sport_articles_cwye1r0x11do_1747807427.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3fe1/live/7adbcba0-d256-11ef-94cb-5f844ceb9e30.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cwye1r0x11do_1747807427.html", "title": "Ross County fan column: 'Amissah contract extension comes at perfect time'", "title_page": "Ross County fan column: 'Amissah contract extension comes at perfect time' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ross County's four match unbeaten run was ended on Saturday as they fell to a 4-1 defeat against Celtic in Dingwall.\nThe Staggies were level at 1-1 with ten minutes left in the match and were competing well, but suffered a sucker-punch when Kyogo doubled his tally for the day to put Celtic 2-1 up in the 81st minute.\nIt looked like County would make it a nervous end for the visitors going into stoppage-time as they chased a late equaliser, until a controversial VAR intervention handed Celtic a penalty which Arne Engels dispatched to make it 3-1. Luke McCowan then added a fourth goal a few minutes later to land the final blow on the day and inflict what felt like a very harsh scoreline on Don Cowie's side.\nIt was an encouraging performance from The Staggies who matched Celtic for large spells of the match and nullified their attacking threat extremely well.\nOne player who was a standout going up against Celtic's attacking threat was Jordan Amissah.\nIt's not often a goalkeeper on the wrong end of a 4-1 scoreline would be viewed as man of the match, however Amissah was absolutely outstanding throughout the game.\nHis double save from Adam Idah and Kyogo in the first half was top class, as was his save from Alex Valle's deflected effort in the second half.\nHe was unfortunate to have stepped off his line as he saved Engels' initial penalty and helped clear the ball away from a goalmouth scramble. Had Amissah managed to save the midfielder's second effort, it would have further underlined what was an incredible performance.\nThankfully, Amissah extended his contract until the end of the season just a few days prior to the Celtic match.\nPerfectly timed too, as it's safe to say his performance will have gained the attention of a lot of clubs who would have liked to obtain his services.", "url": "https://www.bbc.com/sport/articles/cwye1r0x11do"}