{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:30:48", "date_modify": "2025-05-21 05:30:48", "date_publish": "2025-04-03 00:00:00", "description": "Kolkata Knight Riders face Sunrisers Hyderabad in the IPL - follow live scores, radio commentary and updates.", "filename": "sport_cricket_live_c5y0mnnkejlt_1747805448.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/266c/live/67548c80-089c-11f0-88b7-5556e7b55c5e.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_live_c5y0mnnkejlt_1747805448.html", "title": "IPL 2025 LIVE: KKR vs SRH", "title_page": "IPL 2025 LIVE: KKR vs SRH - cricket score, radio commentary & updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "KKR seal convincing win over struggling Sunrisers\nDefending champions Kolkata Knight Riders secured a comfortable 80-run win over Sunrisers Hyderabad, who slipped to the bottom of the Indian Premier League (IPL) table.\nSet a target of 201, Sunrisers' powerful but inconsistent top order failed as they slipped to 9-3 and 66-5 before being bowled out for 120 in 16.4 overs.\nAustralia's Travis Head fell for four from the second ball of the chase while Abhishek Sharma and Ishan Kishan were both dismissed for two.\nSunrisers had a glimmer of hope with destructive South Africa batter Heinrich Klaasen in the middle but his dismissal for 33 in the 15th over all-but secured a vital win for KKR, who were bottom of the table going into the match.\nKKR chose seamer Vaibhav Arora as their impact player and he starred with figures of 3-29, including the wickets of Head and Klaasen, while spinner Varun Chakravarthy took 3-22.\nEarlier, KKR's 200-6 came from a late flourish of 78 runs scored from the final five overs of their innings. Venkatesh Iyer struck 60 from 29 balls with seven fours and three sixes, while Rinku Singh made an unbeaten 32 from 17.\nThey capitalised on a platform set by skipper Ajinkya Rahane and Angkrish Raghuvanshi, who added a third-wicket stand of 81 following the early departures of openers Quinton de Kock and Sunil Narine.\nSunrisers started their IPL campaign by posting 286, the tournament's second-highest total of all time, but have since lost three matches in a row.\nThe IPL continues on Friday with Lucknow Super Giants taking on Mumbai Indians.", "url": "https://www.bbc.com/sport/cricket/live/c5y0mnnkejlt"}