{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:34:35", "date_modify": "2025-04-26 06:34:35", "date_publish": "2025-02-27 00:00:00", "description": "All the latest football news and reaction as Liverpool pull further clear in the Premier League title race as Arsenal are held by Nottingham Forest.", "filename": "sport_football_live_c7vze384m3zt_1745649275.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/91bd/live/c6a433b0-f50b-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_c7vze384m3zt_1745649275.html", "title": "Football latest: Premier League title race, build-up and FA Cup news conferences", "title_page": "Football latest: Premier League title race, build-up and FA Cup news conferences - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Thanks for joining us\nThanks for joining us again today. We've been reacting to last night's results in the Premier League and the Lionesses' win over Spain at Wembley.\nWe've also heard from Aston Villa boss Unai Emery ahead of their FA Cup tie against Cardiff tomorrow night.\nClick on the links in this page's summary for a recap of today's main news lines.\nThere is football again this evening. West Ham take on Leicester in the Premier League. Follow that one here.\n'You have to have a respect and humility for the opponents'\nWest Ham v Leicester (20:00 GMT)\nWest Ham United\nWest Ham boss Graham Potter on the challenges of playing Leicester: \"In the Premier League every game is complicated and tough. The opponent has always got something to fight for, always got something to prove, some quality against you.\n\"That is the case with Leicester, they will be looking to turn their fortunes around. That is how football is, it's great. Just when you think there is no way forward something can come up and just when you think you've got it cracked, something can come around and kick you.\n\"You have to have a respect and humility for the opponents which we have.\"\n'You have to show your character, reflect, learn and improve'\nWest Ham v Leicester (20:00 GMT)\nLeicester City\nLeicester City manager Ruud van Nistelrooy on what is needed as they bid to bridge a five-point gap to Wolves in 17th place: \"We have to be resilient and strong. You have to show your character, reflect, learn and improve.\n\"We know the performance against Brentford [in their last match] wasn't good enough but this team has always reacted and I expect them to do so on Thursday.\"\nTonight's team news\nWest Ham v Leicester (20:00 GMT)\nWest Ham boss Graham Potter has confirmed this game will come too soon for Vladimir Coufal, though the defender may have a chance of featuring in their next match against Newcastle on 10 March.\nLucas Paqueta, Niclas Fullkrug, Michail Antonio and Crysencio Summerville also remain sidelined.\nLeicester will give a fitness test to full-back James Justin, who missed the defeat by Brentford after being forced off against Arsenal.\nAbdul Fatawu and Ricardo Pereira are long-term absentees.\nThe great wall of Burnley\nPreston v Burnley (Sat, 12:15 GMT)\nAs Burnley boss Scott Parker was just discussing, at least one Championship side will make it through to the quarter-finals of the FA Cup this season, with the Clarets taking on local league rivals Preston in the fifth round on Saturday.\nThe two sides drew 0-0 in the Championship a fortnight ago.\nThe last time Burnley conceded a goal was in the FA Cup at Reading in the third round - back on 11 January.\nIn the Championship, they've not conceded in 12 games, since a 2-1 win at home to Watford on 21 December - quite an astonishing defensive record.\n'Something we are very proud of' - Parker on 12 consecutive clean sheets\nPreston v Burnley (Sat, 12:15 GMT)\nBurnley\nBurnley boss Scott Parker was asked if he would ever get tired of being asked about his side's extraordinary run of 12 consecutive clean sheets in the Championship: \"No, I won't, to be fair, as long as it keep happening. The day you stop asking is the day it probably stops happening.\n\"It's something we are very proud of. [On the] work [put in] it's full credit to all of us here and the players that work on the defensive side - our structure and everything that goes with that.\n\"A lot of hard work has gone into it, hence why we have produced the numbers that we have in the defensive phase as a team.\n\"It's something we want to continue. It gives us a platform and a foundation in those games and so hopefully you can keep asking me those questions for many weeks to come.\"\nBurnley boss Parker on FA Cup 'opportunity'\nPreston v Burnley (Sat, 12:15 GMT)\nBurnley\nBurnley manager Scott Parker acknowledged that winning promotion back to the Premier League was his main aim this season, with the Clarets currently third in the Championship, just two points outside the top two.\nBut he is eyeing his side's fifth-round FA Cup tie at local league rivals Preston as an \"opportunity\", with the winners just one victory away from a showpiece semi-final at Wembley.\n\"The league is fundamentally our priority this year but it is a competition we want to do extremely well in and we have got an opportunity,\" said Parker.\n\"We are against good opposition but it we can get through this round then that takes us into the realms of maybe seeing something [extraordinary].\n\"So we will go there are strong as we can. We want to get through this round with a good performance and stay in this competition as long as we can.\"\n'It’s a way for Europe'\nAston Villa v Cardiff (Fri, 20:00 GMT)\nAston Villa\nAston Villa boss Unai Emery on the importance of the FA Cup: “It’s a way for a trophy. It’s a way for Europe. The winner is playing next year in the Europa League.\n“We have three ways - Premier League, Champions League and FA Cup. Of course we are not contenders in FA Cup to win this title.\n“To try to compete in this competition and to have a way for a trophy and for Europe is very important and then prestige. Every player, the club, the coaches – everybody would like one way trying to get prestige as well.”\n'To be consistent is our challenge'\nAston Villa v Cardiff (Fri, 20:00 GMT)\nAston Villa\nAston Villa boss Unai Emery on Cardiff City: \"Firstly, we have respect for the competition. Secondly, we respect every team that is competing in this round.\n“Of course Cardiff are a Championship team but we have our own experiences two years ago with Stevenage for example. We weren’t being successful last year and two years ago.\n“We are playing at home at Villa Park and we have to feel strong. To be consistent is our challenge.\"\nVilla team news\nAston Villa v Cardiff (Fri, 20:00 GMT)\nAston Villa\nAston Villa boss Unai Emery with an injury update: \"We will train this afternoon and until we watch on the field how the players are, more or less without the pain to be available for tomorrow we will decide.\n“Pau Torres is still injured. Matty Cash, close, but we will see this afternoon. Mings is a doubt. Emi Martinez is a doubt. Ross Barkley’s not for tomorrow. Amadou Onana, doubt and Boubacar Kamara, doubt, they are close to coming back.\n“Donyell Malen is sick but hopefully he can recover for tomorrow.”", "url": "https://www.bbc.co.uk/sport/football/live/c7vze384m3zt"}