{"authors": ["Tom Garry", "www.facebook.com"], "date_download": "2025-05-19 14:31:57", "date_modify": "2025-05-19 14:31:57", "date_publish": "2017-07-28 20:58:40", "description": "Who's starred, who's flopped and who's looking most likely to win Women's Euro 2017 as we reach the quarter-final stage?", "filename": "sport_football_40735657_1747665117.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/B5FF/production/_97119564_splitagain.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_40735657_1747665117.html", "title": "Women's Euro 2017: The stars, the flops and the Lionesses - meet the quarter-finalists", "title_page": "Women's Euro 2017: The stars, the flops and the Lionesses - meet the quarter-finalists - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "From shock results to \"mystifying\" refereeing and even a six-goal win for England, the Women's European Championship has not been short on colour, goals or controversial refereeing decisions.\nBut, after 24 games, the 16 teams at the largest ever Women's Euros have been whittled down to a last eight.\nIn-form England will face France on Sunday for a place in the semi-finals, but which other nations have made it through, who has looked liked winning the tournament, and what talking points have been thrown up so far?\nHosts Netherlands topped Group A, while holders Germany, surprise package Austria and dominant England were the other group winners.\nFollowing this weekend's last-eight ties, the semi-finals will take place on Thursday, before the final in Enschede on Sunday, 6 August.\nThe winner of the match between Netherlands and Sweden will meet England or France in the last four.\nNorway might not immediately spring to mind as a powerhouse of international football but, in the European women's game, they boast a proud record.\nHaving reached two of the past three finals, the two-time winners (1987 and 1993) are the second most successful side in the competition's history and arrived in the Netherlands as the fifth-highest ranked team in the tournament.\nHowever, the 2013 runners-up surprisingly slumped to three defeats from three in Group A, with their profligacy in front of goal summed up by Wolfsburg forward Caroline Graham Hansen's missed penalty in a frustrating loss to Denmark that sealed their early elimination.\nDespite being led in attack by Lyon's Ada Hegerberg - the 2016 Uefa Best Women's Player in Europe and BBC Women's Footballer of the Year for 2017 - Norway failed to score a single goal.\nJoining the Norwegians on an earlier-than-planned flight out of the Netherlands are Switzerland, Italy, Iceland, Belgium and Russia - the latter having never progressed beyond the group stages of the Euros.\nMeanwhile, debutants Portugal and Scotland both earned their first wins at a major championship before exiting on head-to-head goal difference, with Spain progressing alongside England from Group D.\nJust two sides won their groups with 100% records: the Netherlands and England.\nThe hosts have entertained, with Barcelona's Lieke Martens and Liverpool's Shanice van de Sanden impressing with their pace on opposite flanks.\nEngland's three wins from three games so far is their best return from the group stages of a major tournament.\nWith 10 goals, Mark Sampson's side scored more than all the teams in Group A combined.\nAnd the Lionesses, who are ranked fifth in the world, will fancy their chances of winning Euro 2017 if they can get past France, who have beaten them at the past three tournaments.\nHolders Germany, who are bidding for their seventh consecutive European title, made a relatively sluggish start by their high standards, but eventually qualified as group winners.\nAnd the draw for the latter stages may well have opened up for the Women's Euros' dominant force, because all the sides standing between them and yet another final are ranked outside the top 12 in the world.\nThat's because France - widely tipped before the tournament to be Germany's strongest challengers, following their SheBelieves Cup triumph earlier this year - failed to win their group.\nAfter a slender opening win against Iceland - secured by a late penalty - France were held to a draw by Austria and then survived a scare with 10 players to draw with Switzerland, narrowly avoiding a shock exit.\nThose results gave them the runners-up spot in Group C, putting Les Bleues on a collision course with England for Sunday's quarter-final and moving them in to the same half of the draw as the Netherlands.\nEngland's Jodie Taylor leads the way in the goalscoring charts, despite being rested for the Lionesses' third group game.\nThe Arsenal striker netted a hat-trick against Scotland, before adding another goal to her tally against Spain.\nNo other player has scored more than twice, although of the forwards on two goals, four are still in the tournament: Swedish pair Stina Blackstenius and Lotta Schelin, plus Austria's talismanic captain Nina Burger and England's Toni Duggan.\nNo red cards were shown at Euro 2013, but three have already been dished out this time around.\nMeanwhile, more than 13% of the 53 goals scored have come from penalties, with seven spot-kicks converted.\nReferee Carina Vitulano sparked debate when she reversed her decision to award Spain a penalty against England after the ball struck Ellen White's hand in the area.\nBut 72% of BBC Sport website readers voted to say they felt her call not to award a spot-kick - described as \"mystifying\" by one pundit - was correct.\nPassion for the Netherlands Women's team within their own country has never been higher, and they set a new record crowd for a women's football match there when 21,731 fans attended their opening game in Utrecht\nAll of the hosts' group games sold out, but gates have been much lower at the matches not involving the Dutch.\nAttendances have averaged just over 6,000 so far from the 24 group games.\nMeanwhile, on television, the cumulative audience has been 81.5 million, according to Uefa., external That's a reported increase of 116%, although the number of games has increased compared to the 2013 tournament, which included fewer teams.\nBut, while the colourful Oranje fans have passionately followed their own team, have the hosts truly got behind the event?\nFormer England keeper Rachel Brown-Finnis:\nI've been disappointed. Other than the Netherlands attendances, which have been really good, I'd expect a lot more people at the other games.\nThe England-Scotland crowd was really good as far as noise made, vibe and atmosphere were concerned.\nBut the games are not all on domestic television here - I assumed they would have been - and by not having all the games on at the fan zones, it just doesn't seem like they've generated as much excitement around the tournament.\nSo I've been a little bit disappointed with that. Overall, I think the Netherlands could have done a better job.", "url": "https://www.bbc.com/sport/football/40735657"}