{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:58:28", "date_modify": "2025-05-21 07:58:28", "date_publish": "2025-02-05 00:00:00", "description": "Rampant Celtic put six goals past Dundee to move 13 points clear at the top of the Scottish Premiership.", "filename": "sport_football_live_c5y7gp7lj00t_1747814308.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c5y7gp7lj00t_1747814308.html", "title": "Celtic 6-0 Dundee: Rampant league leaders hit six to move 13 points clear", "title_page": "Celtic 6-0 Dundee: Rampant league leaders hit six to move 13 points clear - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Celtic manager Brendan Rodgers challenged his side to put their foot down in the race for the title after they put six goals past Dundee to move 13 points clear at the top of the Scottish Premiership.\nArne Engels gave Celtic the lead from the penalty spot after Mohammed Sylla was penalised after a VAR check for a shirt pull on Auston Trusty.\nAdam Idah put Brendan Rodgers' side in control at the interval with a powerful finish and they went through the gears in a dominant second-half display.\nDaizen Maeda headed home a pinpoint Jota cross to make it three and just four minutes later, the Japanese forward found the net again with a delightful chip over Dundee goalkeeper Trevor Carson.\nMaeda - playing down the right-hand side to accommodate new signing Jota on the other flank - was a constant threat with his pace in behind, and fully deserved his two goals.\nEngels added his second and Celtic's fifth with a deflected strike from the edge of the box and substitute Nicolas Kuhn curled home a sixth to underline the champions' second-half dominance.\n\"It's been a really good season up to now,\" Rodgers said.\n\"You arrive to this point in a good place and then you've got to keep your foot to the floor. We have to stay concentrated, keep showing aggression on the pitch and keep our humility.\"\nKasper Schmeichel was never troubled in the Celtic goal as Dundee shipped six goals for the second game running following their heavy defeat by Hearts.\nThe Dens Park outfit stay 10th in the table, four points behind sixth-placed Motherwell and six in front of bottom side St Johnstone.\nWhen Kyogo completed his move to French side Rennes, it posed questions about what Celtic's attack might look like for the rest of the season.\nHere, they showed they are still a devastating force without the Japan striker, led by his international colleague Maeda.\nHis pace in behind the Dundee defence was a constant threat and he looked completely unfussed by switching wings, harrying the opposition throughout the game.\nThe 27-year-old created three chances - the joint-most of any player - and had more touches in the opposition box than anyone else.\nHis second goal reflected how high his confidence levels are at present, sending an arcing first-time shot over a helpless Carson and into the top corner.\nIdah scored his fourth goal in his last three outings as he continues to step up in Kyogo's absence, and Jota showed his class too on his first start since returning to Glasgow.\nThe Portuguese winger's cross for Maeda's first was a delightful pick out, and he will only improve as he gets more minutes into his legs.\nKuhn's introduction off the bench showed the depth of quality Rodgers has at his disposal and he put the icing on the cake with a whipped left-footed strike late on.\nOn this showing and given the big gap, it seems a certainty that the league title will be staying at Parkhead come May.\nDundee finished in the top half of the Scottish Premiership last season - an excellent achievement on their return to the top flight, but they had their issues at the back.\nOnly Livingston, who finished bottom of the league and were relegated, conceded more goals than Dundee's 68 and those troubles in defence have continued into this campaign.\nYes, they have been without several defenders through injury, but they are leaking more than two goals per game on average.\nNo side has let in more than their 53 goals after 25 league games.\nThey are the defensive numbers of a side battling relegation, and without improvement, or a lot of goals at the other end - only Celtic and Rangers have scored more than Dundee - they will be in the conversation for the play-off spot.\nUnrest among the club's fanbase is understandably growing after two successive 6-0 losses and they have just one win in their last six league games.\nManager Tony Docherty has to find a solution at the back if their form is to turn around and they are to climb the table again.\nThe positive for the Dundee boss is the table is so tight it only takes a few wins to turn things around quickly, and they are closer to the top half than the bottom.\nCeltic manager Brendan Rodgers: \"Definitely one of the best [performances] of our season. From minute one to the 93rd minute we had a real hunger in our game and real quality in our game.\n\"I think you saw the difference tonight with the counter-pressing and the numbers around the ball and winning the duels, and that gives us the possibilities to play and when we play like that then we can produce great moments.\"\nDundee manager Tony Docherty: \"Our organisation in the first half was good enough to merit us coming in at nothing-each.\n\"The penalty, there's not one Celtic player claims for it. The two players are wrestling with each other - I think it's really soft.\n\"Then before the second goal, Callum McGregor comes across Mo Sylla and anywhere else on the pitch it's a foul but because the ball goes out of play.\n\"That said, the goals we concede in the second half are not good enough. We need to learn as a team. That's two really poor defeats.\"", "url": "https://www.bbc.com/sport/football/live/c5y7gp7lj00t"}