{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:10:17", "date_modify": "2025-05-20 13:10:17", "date_publish": "2023-07-26 09:13:22", "description": "Team GB are predicted to take home 62 Olympic medals at Paris 2024 - and finish fourth in the medal table behind hosts France, China and the United States.", "filename": "sport_olympics_66305346_1747746617.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/10B59/production/_130514486_gettyimages-1334401118.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_olympics_66305346_1747746617.html", "title": "Team GB tipped to bring home 62 medals from Paris 2024 Olympic Games", "title_page": "Team GB tipped to bring home 62 medals from Paris 2024 Olympic Games - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Great Britain are forecast to win 62 medals at the 2024 Olympics in Paris.\nAn analysis released one year out from the Games predicts Team GB will finish fourth in the medal table behind hosts France, China and the United States.\nBritain won 65 medals at London 2012, 67 in Rio 2016 and 64 in Tokyo 2020, having failed to reach 60 in any single Games in 100 years before that.\nThe Gracenote forecast predicts 10 individual gold medals including skateboarder Sky Brown, 15.\nKeely Hodgkinson in the 800m, Bethany Shriever in the BMX, Jessica Gadirova and Bryony Page in gymnastics and Bradly Sinden in the taekwondo are some of the other athletes projected to take gold.\nWorld 1500m champion Jake Wightman and women's bronze medallist Laura Muir are forecast to win bronze and silver respectively in Paris, while Dina Asher-Smith is predicted to take 200m bronze.\nHowever, European 200m champion Zharnel Hughes is among those not included in the medal count, despite being considered among the favourites at this year's World Athletics Championships having run the fastest 100m time this year.\nAmong nine swimming medals, two-time Olympic 100m breaststroke champion Adam Peaty is expected to take silver - as is Tom Dean in the 200m freestyle.\nDean recently took silver at the World Aquatics Championships behind fellow Briton Matt Richards, who is not included among the predicted medals.\nElsewhere, reigning Olympic men's mountain bike champion Thomas Pidcock has not been included among seven cycling medals, nor has men's pommel horse gold medallist Max Whitlock in gymnastics.\nThe forecast does have GB team golds in sports including men's and women's rowing and equestrian eventing, with multiple silver and bronze team medals across the athletics relays, swimming and cycling disciplines.\n\"Britain is expected to come close to sustaining its performance in Tokyo,\" said data analysts Gracenote Nielsen.\n\"Gracenote's virtual media table forecasts a drop of just two medals to 62. Gold medals could be significantly down, though, as the British team are on just 15 golds in this initial prognosis.\n\"British success over the past three Olympic Games has been built on having medal winners in at least 20 sports and the initial virtual media table forecast suggests that this is set to continue.\"\nRussian and Belarusian competitors were not included in the calculations because of uncertainty over their participation.\nThe International Olympic Committee is still fine-tuning its stance on athletes from those countries.\nTeam GB chef de mission Mark England said: \"I think we've got a great opportunity to be the top European nation again, despite the fact that the home nation is very, very strong and getting stronger for a whole variety of reasons.\n\"So top European nation, top five are our aspirations. I know that we are medal-competitive in a significant number of sports. I think we've got all of those building blocks, notwithstanding we've got another 12 months to build on that.\"", "url": "https://www.bbc.com/sport/olympics/66305346"}