{"authors": ["Tyrese King", "www.facebook.com"], "date_download": "2025-05-21 06:05:54", "date_modify": "2025-05-21 06:05:54", "date_publish": "2025-04-01 14:17:11", "description": "Andoni Iraola press conference: Bournemouth vs Ipswich preview", "filename": "sport_football_articles_c75d6elwzd3o_1747807554.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5908/live/85292f40-6de2-11ef-b970-9f202720b57a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c75d6elwzd3o_1747807554.html", "title": "Andoni Iraola press conference: Bournemouth vs Ipswich preview", "title_page": "Andoni Iraola press conference: Bournemouth vs Ipswich preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Iraola revealed he is still \"not completely sure\" about the availability of some of his players but \"Justin [Kluivert] is the one we are more in doubt with\" because \"he finished with some issues and we have to check today to see if he's ready to go again\".\nOn Dean Huijsen and Milos Kerkez returning from suspension: \"It's very good to have Huijsen and Kerkez back because they are in a good moment of form.\"\nOn asked what message he has for clubs linked with the defensive duo: \"I don't comment. For me, I don't have to give other clubs any comments.\"\nIraola said having Adam Smith back is \"very good news\" because he has been a \"very important\" member of the squad.\nOn whether being out of the FA Cup will help the chances of qualifying for Europe: \"I would have preferred to still be in the FA Cup and play more games, but we cannot change our reality. We had our chance and we tried, but it wasn't enough. City were better than us, especially in the second half and it's them who will play in the semi-finals. We need to focus on the league.\"\nIraola believes his side were not \"good enough\" in the second half of the quarter-final: \"We have normally been good in the second half of games, scoring lots of goals, but now it concerns me a bit that we are losing points in the second half. Normally we are better at the end of games than we are at the beginning.\"\nOn whether Bournemouth can play European football next year: \"We will try to win every game and then we will see our position. We are 10th right now. Not long ago we were sixth, but distances are still quite short. At the end, we are competing for every game, and we have to take them as finals - very important games.\"\nOn his lack of attacking options because of injuries: \"It's a challenge for me, as a manager, if you cannot replace man for man, winger for winger in the same type of profiles. You have to manage the ones you have available and that impacts your decision on who starts and who comes off from the bench. Sometimes you start the best starting XI, others you put the best finishing XI.\"", "url": "https://www.bbc.com/sport/football/articles/c75d6elwzd3o"}