{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:54:49", "date_modify": "2025-05-21 05:54:49", "date_publish": "2025-04-02 07:10:14", "description": "Nottingham Forest 1-0 Man Utd: United fan's verdict on the game", "filename": "sport_football_articles_cvgpxd19d2wo_1747806889.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cvgpxd19d2wo_1747806889.html", "title": "Nottingham Forest 1-0 Man Utd: United fan's verdict on the game", "title_page": "Nottingham Forest 1-0 Man Utd: United fan's verdict on the game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your views on Manchester United's 1-0 defeat by Nottingham Forest on Tuesday evening.\nHere are some of your comments:\nCarolus: Tactically, a horrendous performance. It looked like the players have been drilled to follow tactics but all creativity has been removed from them. I saw effort, but confidence and creativity were amiss. Bruno Fernandes was awful but the guy is entitled to one of those.\nMatt: Pathetic. I know Forest have been great this season but here they haven't even played and walked away with the win. None of the attacking options are good enough. Yet we loan out players like Antony and Rashford and sell the matchwinner for pennies. Embarrassing.\nAdam: I hate to sound like a broken record, but Ruben Amorim got it wrong yet again. Poor formation, poor first-team choices, poor substitutions and no adaptability. He's digging his own grave so early on. Just because it worked in Portugal isn't good enough. It's proven to not be working in England. End of story. Adapt or get packing.\nTrevor: Same old lacking of any kind of real sharpness and expectation up front, Alejandro Garnacho extremely frustrating and predictable, Patrick Dorgu worrying on this performance but he has much more to offer I'm sure. Why not keep Harry Maguire as centre-forward for the rest of the season? There is no-one else to challenge him. Great goal and all credit to Forest, but it highlights the very average standard of this season's Premier League that they are in third place.\nAnton: Lots of good ideas in the build-up but we looked clueless in the final third. We created nothing of note aside from a few crosses into a crowded box. It felt like we played into Forest's hands. This is how they would've hoped the game would've gone. Fair play to Nuno.", "url": "https://www.bbc.com/sport/football/articles/cvgpxd19d2wo"}