{"authors": ["Gareth Griffiths", "www.facebook.com"], "date_download": "2025-05-20 13:52:33", "date_modify": "2025-05-20 13:52:33", "date_publish": "2023-07-31 17:21:25", "description": "Wales wing Louis Rees-Zammit believes his best is yet to come as he aims to play in his first World Cup in France.", "filename": "sport_rugby-union_66354794_1747749153.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/15552/production/_130587378_wales_rugby_training_074.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-union_66354794_1747749153.html", "title": "Louis Rees-Zammit: Wales wing targets first World Cup", "title_page": "Louis Rees-Zammit: Wales wing targets first World Cup - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wales wing Louis Rees-Zammit believes his best is yet to come as he aims to play in his first World Cup.\nThe 22-year-old made his international debut aged 19 in 2020 and has scored nine tries in 25 internationals.\n\"I feel like I've got a lot to give, you've probably only seen a little bit and I don't think you've seen the best of me,\" said Rees-Zammit.\nThe Gloucester back is already a British and Irish Lions tourist and Six Nations winner.\n\"I'm ready to showcase my skills on the field whenever I get the chance,\" added Rees-Zammit.\nWhen he was picked for the Lions tour of 2021 to South Africa he became the youngest selected Irish centre David Hewitt on the 1959 tour to Australia and New Zealand.\n\"Everything has come so quick and I've tried riding the wave in a sense,\" he said.\n\"I absolutely love it here. I love rugby and playing for Gloucester and Wales and obviously I got on the Lions tour as well which was unbelievable.\"\nRees-Zammit was battling injuries at the end of last season but insists he is now ready for match action.\n\"I am fully fit now. I have been training for a fair few weeks and my body feels as sharp as ever,\" he added.\n\"I don't think I feel I have been this fit in my life so I am definitely feeling the benefits and I am pretty sure the boys are as well.\"\nRees-Zammit is experiencing Wales' notorious World Cup training camps for the first time. After travelling to train at altitude in Switzerland earlier this month, the team has just returned from an eight-day stay in the sweltering heat of Turkey.\n\"They have been pretty brutal,\" said Rees-Zammit. \"It's the hardest thing I have ever done, physically and mentally probably. I have really enjoyed it so far and all the boys are looking sharp and excited.\n\"It has 100% lived up to everything I have heard. Kicking off with the mini-camps and going to Switzerland was pretty brutal.\n\"You hear all the stories beforehand, all of the boys who have done it previously, you find out how hard it is when you get there.\n\"It was pretty nasty and now we are in Turkey training in 40 degree heat. It's pretty brutal and tough.\n\"It's almost 110 degrees. It's quite nice after training because you're absolutely boiling and can go in and have a nice cool off in the cryotherapy chamber.\"\nRees-Zammit has also been working on his speed with another trip to a sprinting academy in America, after visiting last year.\n\"I'm feeling pretty fast to be honest with you, hopefully I can showcase that when I play,\" he added.\nRees-Zammit hopes it is all worth it by being selected to play in his first World Cup.\n\"It would be an absolute dream come true if I did get named in that squad,\" said Rees-Zammit\n\"I've got loads of World Cup memories watching at the club (Llandaff). I remember watching the last World Cup with my Hartpury team-mates, I think I was 17 at the time.\n\"Watching on I never thought I'd be in contention at all but I'm here now and I've got to put my best foot forward and hopefully I can get in that squad.\n\"This [World Cup] is the next step and I haven't been to one yet.\"\nWales open their pool campaign against Fiji in Bordeaux on 10 September before further group games against Portugal, Australia and Georgia.\nThey have three World Cup warm-up matches before the tournament, starting with the visit of England on 5 August and followed by a return visit to Twickenham seven days later.\nWales complete their tournament preparations against world champions South Africa on 19 August before Warren Gatland is scheduled to name his final 33-man squad the following week.\n\"It has been a while since I have played, I have had a few injuries,\" said Rees-Zammit.\n\"I am just buzzing to get out there again and playing another game of rugby. It has been a long time but all this training has helped and hopefully it can show on the field.\"\nHe was selected at full-back for his last Test against France in the Six Nations in March 2023 and understands versatility is crucial during the World Cup.\n\"I want to be versatile, add more strings to my bow and if that means playing 15 as well, then I'm ready for it,\" said Rees-Zammit.\n\"I've trained at wing and full-back so wherever I get played I'll try my hardest. Being in the back field on your own or with one other person it's the defensive positioning that is different at full-back.\n\"In Test rugby there are a lot of kicks and you've got to be ready.\n\"You've got to be in the right position at the right time. That's a lot different to being on the wing but in attack you get more of a licence to go and look for the ball and get more touches.\n\"We do have a licence and freedom on the wing as well but stepping up as a first receiver from full-back I quite enjoy. I'd say I get my hands on the ball more at 15.\n\"I'd say my kicking game is pretty strong but I do love running with the ball. Being a threat on the counter attack is also there. I do like playing at 15 and it's an option. Wherever I play I'll try my hardest.\"", "url": "https://www.bbc.com/sport/rugby-union/66354794"}