{"authors": ["Martin Dowden", "www.facebook.com"], "date_download": "2025-04-26 06:15:47", "date_modify": "2025-04-26 06:15:47", "date_publish": "2025-03-01 21:17:48", "description": "Barry Ferguson laments the continued poor form at Ibrox as he makes his home debut as Rangers head coach in a 2-1 defeat by Motherwell.", "filename": "sport_football_articles_cr42npk35z7o_1745648147.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/110b/live/109867c0-f6e2-11ef-a7dd-3bc09b1d9495.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cr42npk35z7o_1745648147.html", "title": "Rangers: Familiar frailties for Barry Ferguson in Ibrox homecoming", "title_page": "Rangers: Familiar frailties for Barry Ferguson in Ibrox homecoming  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "\"It's not good enough.\"\nNot the words Rangers interim head coach Barry Ferguson might have expected to be saying in the aftermath of his return to Ibrox, this time in charge, after the departure of Philippe Clement.\nOff the back of a rousing 4-2 fightback win at Kilmarnock in his first outing, this was set up to be a positive homecoming, during which captain James Tavernier made his 500th appearance for the club.\nYou could feel that pre-match. Like a weight had been lifted. Yet it went horribly wrong - again.\nRangers stumbled to a third straight defeat at Ibrox. Queens Park, St Mirren and now Motherwell, by 2-1, all victorious. Unthinkable and certainly unpalatable for the Rangers support as they, once again, demonstrated at full-time.\nAt least the minority that remained at Ibrox come that point. Certainly \"not good enough\".\nRangers are now 16 points behind Celtic with nine games remaining. They have either lost or drawn almost 38% of their league fixtures.\nFerguson looked increasingly agonised by a tepid, lacklustre display during which Motherwell took full advantage to earn a fantastic win, just their second in 61 league meetings between these sides.\nIt would be incredibly harsh to lay blame at Ferguson's feet, but the short-lived honeymoon seems over already.\nThe former Rangers captain has some serious issues to address - and quickly - as this squad looks increasingly unreliable, domestically at least.\n\"There's obviously a clear problem in terms of playing at home and that's something me as a manager and my staff and the players need to sit down and really get to the bottom of,\" Ferguson said.\nWorryingly for him, Ibrox was the one source of solace for much of this season as domestic away form deserted Rangers under Clement until late in his tenure. That home comfort has now imploded.\nSo what is the issue?\n\"There's good players here, I've seen it,\" Ferguson continued. \"Technically, very good. To play at Rangers, they need to be mentally strong. The fans demand that of you.\"\nOn this evidence, the mentality has been shredded. Experienced goalkeeper Jack Butland was culpable for the opener with a poor reaction save to allow Luke Armstrong to net the opener. His confidence looks diminished, as it does in many of his team-mates.\nThey were brutally exposed by some fine play from Motherwell for the second.\nMore concerning for Ferguson was the lack of energy throughout. It rarely felt that Rangers would go on and mount a winning comeback.\nThey cannot possibly win silverware, other than in Europe, where they face a stiff last 16 first-leg test away to Jose Mourinho's Fenerbache on Thursday.\nWill the Europa League version of this Jekyll and Hyde Rangers turn up again?\n\"Well, that's what happens when you play at Rangers,\" Ferguson explained.\n\"European football's great. It's great to be involved in. It's great financially for the club, but your bread and butter is domestic trophies.\n\"Domestically, the form has to be better. Europe's always been a bonus. It's brilliant to go and pit your wits against really good teams and really good managers and really good players, but what matters? Domestic football for me.\"\nRangers will hope that bonus of European form continues as their domestic season lies in tatters.\nIt was another painful home defeat for the home supporters, who must have hoped the familiar face of Ferguson in charge would bring short-term relief and steady the ship. It has not.", "url": "https://www.bbc.co.uk/sport/football/articles/cr42npk35z7o"}