{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:52:04", "date_modify": "2025-04-26 03:52:04", "date_publish": "2025-03-05 11:16:58", "description": "Two-time winner Tiger Woods will miss next week's Players Championship at TPC Sawgrass, the PGA Tour has said.", "filename": "sport_golf_articles_cx294zk0l3lo_1745639524.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b2d1/live/6b416470-f9b1-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_golf_articles_cx294zk0l3lo_1745639524.html", "title": "Players Championship: Tiger Woods to miss PGA Tour flagship event at Sawgrass", "title_page": "Players Championship: Tiger Woods to miss PGA Tour flagship event at Sawgrass - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Two-time winner Tiger Woods will miss next week's Players Championship at TPC Sawgrass, the PGA Tour has said.\nThe 15-time major champion also missed the Genesis Invitational in February following the death of his mother that month.\nAnd while Woods competed in a TGL event on Monday night, with his Jupiter Links GC being eliminated, in an interview this week he hinted he would not play in the PGA Tour's flagship event.\n\"This is the third time I've touched a club since my mom passed so I haven't really gotten into it,\" Woods, 49, told Sports Illustrated, external.\n\"My heart is really not into practising right now. I've had so many other things to do with the Tour and trying to do other things.\n\"Once I start probably feeling a little bit better and start getting into it, I'll start looking at the schedule.\"\nThis will be the sixth consecutive year Woods has not featured in an event that has been dubbed the fifth major and regarded as one of the most prestigious in golf.\nThe 144-man field will contain 48 of the top 50 in the world rankings, with number one Scottie Scheffler aiming to become the first golfer to win the Players for a third time since Jack Nicklaus in 1978.\nPlayers had been given until Friday afternoon to commit to the event which takes between 13-16 March.\nWoods has not participated in a PGA Tour event since last year's Open at Royal Troon in July and had his sixth back procedure in 10 years in September.\nIt is the last year Woods is exempt from the tournament through his Masters victory in 2019.", "url": "https://www.bbc.co.uk/sport/golf/articles/cx294zk0l3lo"}