{"authors": ["Jenna Thomson", "www.facebook.com"], "date_download": "2025-05-21 07:36:28", "date_modify": "2025-05-21 07:36:28", "date_publish": "2025-05-20 15:15:48", "description": "Fan voice: Wimmer needs backing after Well's 'fairly average season'", "filename": "sport_articles_ceqggr1nee4o_1747812988.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8403/live/564f28c0-358b-11f0-96c3-cf669419a2b0.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_ceqggr1nee4o_1747812988.html", "title": "Wimmer needs backing after Well's 'fairly average season'", "title_page": "Fan voice: Wimmer needs backing after Well's 'fairly average season' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The season is officially over. We had some highs and certainly some lows.\nHighlights include reaching the League Cup semi-final, the win at St Mirren in December, beating Rangers at Ibrox, and the ladies team making the Scottish Cup last four.\nMy honest review is that other than the games highlighted above for the men's side it was a fairly average season.\nI am hoping with the right backing for his first full campaign in charge, Michael Wimmer will be able to build a strong, attacking squad with some faces from markets we haven't yet explored.\nWe have the opportunity to sell the club's crown jewel Lennon Miller and invest the proceeds smartly. The £3.25m we got for David Turnbull and the £1m for James Scott came at a vital time and changed a lot for the club. If we can get £6m for Miller, it will make the world of difference.\nFor the Women of Steel, I am intensely proud of them securing a first top-six finish and reaching a cup semi-final.\nI hope the restructuring of the SWPL - from 12 teams to 10 - doesn't widen the already sizeable gap between the top clubs and the rest.\nIt has been a season of change for both Motherwell sides in many ways and I wish nothing but the best for Wimmer and Paul Brownlie next season.", "url": "https://www.bbc.com/sport/articles/ceqggr1nee4o"}