{"authors": ["Frank Keogh", "www.facebook.com"], "date_download": "2025-05-21 04:54:20", "date_modify": "2025-05-21 04:54:20", "date_publish": "2025-04-04 15:11:58", "description": "Broadcaster Gina Bryce will make history for the BBC on Saturday when she commentates on the Grand National.", "filename": "sport_horse-racing_articles_cy8eyk93g4no_1747803260.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/01c7/live/bb1d9e00-1158-11f0-9c64-93da9e1b4cb6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_horse-racing_articles_cy8eyk93g4no_1747803260.html", "title": "Gina Bryce: Female commentator to make Grand National history", "title_page": "Gina Bryce: Female commentator to make Grand National history - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Broadcaster Gina Bryce will make history for the BBC on Saturday when she becomes the first woman in modern times to commentate live from the racecourse on the Grand National.\nBryce will take the third leg of the commentary for Radio 5 Live before handing over to lead commentator John Hunt for the climax of the world's greatest steeplechase at Aintree.\n\"Never in a million years did I think I'd get the opportunity to do something like this,\" she said.\n\"It's a first for me and very exciting, although slightly terrifying as you can imagine. I believe I'm the first female to do it, so that's a privilege, and I'm looking forward to it of course, but I'm just nervous to do it well.\"\nWhile racecourse commentating has not been a regular part of Bryce's broadcasting work, it will not be the first time she has described the action on air in a career which began in 2008 and has included four years with Channel 4 Racing before her current regular spots with Sky Sports Racing, 5 Live, and a variety of international meetings.\n\"I did a whole card at Compiegne once on At The Races when there was no commentator, and it included an Arabian maiden and a cross-country race,\" she said.\n\"I didn't know any of the Arabian horses, and in the cross-country race I didn't know the course they were taking, how many circuits there were, or when they were finishing, so that was challenging to say the least.\n\"I've been very much thrown in on days when the commentary has gone down, including for greyhound racing, but that's the nature of the job. There were a lot less listeners though on At The Races on a Tuesday than there will be on 5 Live Sport on Saturday.\"\nBryce, 41, also presents 5 Live coverage from the Cheltenham Festival, Derby at Epsom, as well as Aintree.\nShe was taken by surprise when asked to join the commentating team, but did not have to think too hard before accepting the offer.\nBryce said: \"When I was first asked, it blindsided me a bit to be honest, but I had a think about it and I asked myself: 'When will I ever get another opportunity to be out on the gantry commentating on a race like the National?'\n\"It's as good an opportunity as you'll get, as someone else is shaping the race before handing it over to me.\n\"I couldn't be in better hands, as I'll take over from Darren Owen and Gary O'Brien before passing it on to John Hunt.\n\"It's not unprecedented either, in that leading broadcasters on 5 Live such as Cornelius Lysaght have done the same leg before.\"\nBryce had a dress rehearsal for the big event when she commentated on the same leg of Friday's shorter Topham Chase, which is one of only three races run over the National's unique obstacles this week.\nThe only other woman to have commentated on the race before is Mirabel Topham, whose family owned the racecourse at the time.\nShe took the microphone for the 1952 renewal, following a dispute with the BBC over copyright. She employed her own commentators for the radio broadcast and took part of it on herself.\nThe race was run in thick fog and mist, which made viewing from the stands almost impossible, and there was a false start which delayed proceedings by 12 minutes. Ten of the 47 runners came down at the first fence.", "url": "https://www.bbc.com/sport/horse-racing/articles/cy8eyk93g4no"}