{"authors": ["Aled Williams", "www.facebook.com"], "date_download": "2025-05-21 05:24:41", "date_modify": "2025-05-21 05:24:41", "date_publish": "2025-01-14 17:06:39", "description": "Wrexham manager Phil Parkinson says striker Jack Marriott has declared himself \"ready\" to return to action after injury.", "filename": "sport_football_articles_c4g7zyx0v55o_1747805081.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ba31/live/a6d730f0-d297-11ef-b526-d36fb212fcf8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c4g7zyx0v55o_1747805081.html", "title": "Jack Marriott: Forward 'knocking on door' for Wrexham return", "title_page": "Jack Marriott: Forward 'knocking on door' for Wrexham return - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wrexham manager Phil Parkinson says striker Jack Marriott has declared himself \"ready\" to return to action after injury.\nMarriott, 30, suffered a broken leg in training in October 2024 which required surgery.\nBut Marriott, who had scored five goals for Wrexham in League One before his injury, is hoping to return earlier than expected.\n\"It's been a huge bonus getting Jack Marriott on the training pitch this week – he's looking really sharp,\" Parkinson said.\n\"When I say on the training pitch that's in full training and for the last two weeks he's been working hard.\n\"He's had a mini pre-season and he's looking fit. He's been knocking on the door saying 'come on, I'm ready'. That's great for us because he had a terrific start to the season.\"\nAnother Wrexham forward, Sam Dalby, is currently on a season-long loan with Scottish Premier League side Dundee United, for whom he has scored 10 goals for this term.\nDundee United boss Jim Goodwin has said the club will be doing all they can to keep Dalby beyond this season.\nParkinson says Wrexham are in talks with Dalby – whose Dragons contract expires at the end of the season – as well as the Scottish club.\n\"I've had a good chat with Sam and his agent last week and we've also spoken at length with Dundee United,\" added Parkinson, who did not elaborate further on the 25-year-old's future.", "url": "https://www.bbc.com/sport/football/articles/c4g7zyx0v55o"}