{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:10:47", "date_modify": "2025-05-21 07:10:47", "date_publish": "2025-03-30 10:01:52", "description": "Bournemouth vs Man City predictions: Chris Sutton on FA Cup tie", "filename": "sport_football_articles_clyny9zdrdno_1747811447.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/561d/live/fbee38e0-d1d4-11ef-87df-d575b9a434a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_clyny9zdrdno_1747811447.html", "title": "Bournemouth vs Man City predictions: Chris Sutton on FA Cup tie", "title_page": "Bournemouth vs Man City predictions: Chris Sutton on FA Cup tie - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "This is such a difficult tie to call.\nBournemouth were the team who started the rot for Manchester City when they deservedly beat them in November, for what was the defending champions' first league defeat of the season.\nBack then, they were still 'mighty City', the team dominating English football who hardly ever slipped up.\nWho would have imagined that, five months on, they would have lost eight of their next 19 league games and be in the position they are now, with just the FA Cup left as the only thing they can win?\nThis competition is huge for City now, because it feels so crucial for boss Pep Guardiola to finish such a difficult season with a piece of silverware.\nSo, it helps him that the Cherries are not in great form, with only one point from their past four league games, and also that they are without two key defenders - Milos Kerkez and Dean Huijsen, who are both suspended.\nCity are still far from convincing at the moment, however, and it is hard to know what their strongest line-up is.\nPhil Foden's struggles for England last week were a reminder of how last season's PFA and FWA Player of the Year has been a shadow of his usual self all campaign, but he is not the only City player to have been well below his best.\nStill, there is no chance of Pep saving anyone for Wednesday's league game against Leicester, even though City have got a real fight on their hands to finish in the top five.\nPep always takes the FA Cup seriously anyway, and he has shown that by reaching the semi-finals in the past six seasons - something no other team had done before.\nWill City make it to the last four again? Yes... but only just.\nBournemouth are so good with their press that they won't allow City to easily play out from the back - there are going to be plenty of goals, and I can see it being settled in extra time.\nSutton's prediction: 2-3 after extra time", "url": "https://www.bbc.com/sport/football/articles/clyny9zdrdno"}