{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:03:06", "date_modify": "2025-05-21 06:03:06", "date_publish": "2025-01-26 00:00:00", "description": "Olivia Holdt scores a brilliant 95th-minute free-kick on her debut to give Tottenham victory over Crystal Palace in the WSL.", "filename": "sport_football_live_cvgm9d8xejkt_1747807386.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cvgm9d8xejkt_1747807386.html", "title": "Crystal Palace 2-3 Tottenham Hotspur: Olivia Holdt scores last-gasp winner on debut", "title_page": "Crystal Palace 2-3 Tottenham Hotspur: Olivia Holdt scores last-gasp winner on debut - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Olivia Holdt came off the bench to score a brilliant 95th-minute free-kick on her debut to give Tottenham victory over Crystal Palace in an entertaining game in the Women's Super League.\nSpurs captain Beth England had put the visitors in control with two fine headers in the first half but Palace rallied after the break.\nKatie Stengel's superb finish from a Molly-Mae Sharpe cross halved the deficit three minutes into the second half.\nThe former Liverpool striker then turned provider with an inch-perfect ball in from the left for Ashleigh Weerden, who tucked it past goalkeeper Lize Kop for her first WSL goal.\nA match played in horrendous conditions at the VBS Community Stadium, with driving rain and strong winds affecting both sides, looked set to end in a draw before Holdt's dramatic late intervention.\nAfter Jess Naz was hauled down on the edge of the box, the Denmark midfielder stepped up and curled the ball over the wall into the corner of the net.\nAlthough the wind favoured Palace in the second half, it was Tottenham who had had the better chances at 2-2.\nEngland, who had a hat-trick goal ruled out for offside prior to Palace's equaliser, missed the best of them when she fluffed her shot after being picked out eight yards from goal by Naz.\nBut ultimately, it did not prove costly as Holdt, a January signing from FC Rosengard, scored less than 13 minutes into her Tottenham career as the visitors snatched victory.\nTottenham move level on points with fifth-placed Brighton, who face Manchester United on Sunday evening (18:45 GMT), while Palace stay bottom of the table on five points.\nTottenham boss Robert Vilahamn had brushed off concerns over his side's lack of goals prior to the match, saying it was only \"small margins\" that have prevented them scoring more.\nHis confidence was justified in the first half with England's double putting the away side in a dominant position.\nThe England international got up well to guide Ashleigh Neville's high, hanging cross back across goal to put Spurs ahead after 14 minutes.\nNine minutes later, she doubled their lead with another header, this one bulleted in at the near most from Maite Oroz's corner.\nBut Palace had shown how dangerous they could be when the game was still goalless with Lexi Potter hitting a glorious chance too close to Kop in the Spurs goal after good work from Weerden and Sharpe curling a shot narrowly wide at the end of a lovely, flowing move.\nIt did not take long after the break for them to show their threat again and this time they had the finish to match - Stengel meeting Sharpe's whipped ball in with a sweet first-time finish.\nSpurs failed to respond and Kop was called to action again soon after when Stengel threaded the ball through to Weerden.\nThat chance went begging but the pair combined once more and this time there was nothing Kop could do.\nBut having got level, Palace were unable to kick on and Tottenham found their footing in the game again.\nChances were still limited but, with the rain still teeming down, Holdt provided the cutting edge they needed to claim a fifth league win of the campaign.", "url": "https://www.bbc.com/sport/football/live/cvgm9d8xejkt"}