{"authors": ["Tom Mallows", "www.facebook.com"], "date_download": "2025-05-21 07:31:57", "date_modify": "2025-05-21 07:31:57", "date_publish": "2025-01-03 21:53:40", "description": "United States Olympic sprinter Fred Kerley is tasered and arrested by police following a confrontation with officers in Miami, Florida.", "filename": "sport_athletics_articles_clykl7gl586o_1747812717.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/47de/live/bc259890-ca11-11ef-bdef-05d8ac69ac36.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_athletics_articles_clykl7gl586o_1747812717.html", "title": "Fred Kerley: US Olympic sprinter tasered after police confrontation", "title_page": "Fred Kerley: US Olympic sprinter tasered after police confrontation - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "United States Olympic sprinter Fred Kerley was tasered and arrested by police following a confrontation with officers in Miami, Florida.\nThe 29-year-old, who won 100m bronze at last summer's Paris Games, faces charges of battery, resisting a police officer and breach of the peace following the incident on Thursday evening.\nOfficers were investigating another incident when Kerley approached them with an \"aggressive demeanour\" over concern about his car, according to a police report.\nThe report said Kerley \"continued to resist officers and used evasive movements to avoid being arrested\" before being wrestled to the ground by four officers.\nPolice bodycam footage shows Kerley getting back to his feet then being tasered and falling back to the floor before being taken into custody.\nLocal media in Miami reported, external that on Friday Kerley made an appearance in court and he has now been released on bail.\nHis lawyer said the incident had been a \"total misunderstanding\".\nAs well as his bronze in Paris, Kerley also won 100m silver at the Tokyo Games in 2021 and gold at the 2022 World Championships.\nHe has also won world 4x100m and 4x400m gold medals, and has recorded the sixth-fastest 100m time in history with 9.76 seconds.", "url": "https://www.bbc.com/sport/athletics/articles/clykl7gl586o"}