{"authors": ["Clive Lindsay", "www.facebook.com"], "date_download": "2025-05-20 12:13:11", "date_modify": "2025-05-20 12:13:11", "date_publish": "2023-08-04 19:14:47", "description": "Michael Beale says he has added \"motivation and quality\" to Rangers' squad without overstretching the club's budget.", "filename": "sport_football_66410095_1747743191.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/178A/production/_130662060_beale.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66410095_1747743191.html", "title": "Michael Beale: Rangers boss full of optimism after re-energising challenge", "title_page": "Michael Beale: Rangers boss full of optimism after re-energising challenge - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "\"The future starts tomorrow\" might be a truism, but when uttered by manager Michael Beale before the new season, it is an indication of just how different his Rangers side will be to the one he inherited in November.\nThe introduction of midfielders Todd Cantwell and Nicolas Raskin was all he managed during the January transfer window - and his side were subsequently unable to narrow the gap already established by reigning champions Celtic at the top of the Scottish Premiership.\nNow Beale starts with a fresh slate, a level playing field and having implemented a summer overhaul to \"maybe re-energise the squad with motivation and quality\".\nNine players have been recruited, all of whom have the potential to be named in the starting line-up for Saturday's opening Scottish Premiership game away to Kilmarnock.\nFour of them commanded a seven-figure transfer fee, with only Parma-bound striker Antonio Colak adding to the credit column.\nHowever, Beale insisted: \"Our squad size will be slightly smaller and our budget will remain the same by the end of the window, so I am really happy.\n\"For every player we've lost, we've brought a player in. If you think, we lost [Malik] Tillman, [Ryan] Kent, [Alfredo] Morelos and Colak and there's a lot of speculation about Fashion Sakala as well. That's why we brought in [Abdallah] Sima, [Sam] Lammers, [Cyriel] Dessers and Danilo, so actually that's one less.\n\"So our numbers are no bigger. I think we can tighten the squad up a little bit more and, if we were to lose a player we weren't planning to, certainly we can go into the marketplace.\"\nZambia forward Sakala, who is in talks with a Saudi Arabian club, and midfielder Glen Kamara, who has also been linked strongly with a move from Ibrox, have not been included in Rangers' squad for their Champions League qualifiers, along with Ben Davies, Tom Lawrence, Rabbi Matondo, Kemar Roofe and Jon McLaughlin.\nSo there could soon be a reason for the squad 'refresh' to go further, particularly with Beale saying defence will be a priority should injuries to Davies, John Souttar and Leon King not improve soon.\nWith the loss of sporting director Ross Wilson to Nottingham Forest, Beale took personal charge of recruitment, but he appears to have thrived on the extra task - and dealings with new chief executive James Bisgrove.\n\"I have been very fortunate to be at the very front of that with James Bisgrove and been able to act very quickly,\" he said.\n\"So I felt a lot of freedom in terms of being able to recruit the players. I think, by the end of the window, you will find our net spend will be very small.\n\"As we stand now, we are no further ahead in our wage structure than what we were. We've lowered the average age of the squad and we've brought players in with a good value and a good pedigree.\"\nKent, the winger now with Fenerbahce, and Morelos, the striker still seeking a club, had been looking like spent forces as they neared the end of their Rangers contracts.\nColak did not seem to fit into Beale's system despite a reasonable goal ratio, while midfielder Scott Arfield and goalkeeper Allan McGregor were near the end of their careers as they moved on.\nMeanwhile, the jury was still out on whether Tillman was worth the hefty transfer fee had Bayern Munich gone ahead with the sale of the midfielder after his loan at Ibrox.\nIn have come players who have proven themselves in top competition - forwards Danilo, Lammers and Dessers from Feyenoord, Atalanta and Cremonese respectively, former Crystal Palace goalkeeper Jack Butland and midfielder Jose Cifuentes from Los Angeles.\nOf course, it's all fine and good for Beale to placate the financial naysayers by pointing out he did not have to press the board to loosen the purse strings substantially, but he will now need to satisfy the desire of his own bosses and supporters for on-field success.\nBeale believes there is \"a lot of optimism\" around Ibrox that he can deliver just that - not just for the coming campaign but especially in the longer term.\n\"The idea was to equip the squad for the coming years, not just for one window to the next,\" he stressed. \"We have recruited a strong squad with good balance and it is important that this team grows together.\n\"The quality of the players we've brought in will hopefully be seen over the season.\"\nWith recent Scottish title wins being characterised by rarely dropping a league point from start to finish, Beale will hope that quality will be shown immediately at Rugby Park against Kilmarnock on Saturday.", "url": "https://www.bbc.com/sport/football/66410095"}