{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:51:54", "date_modify": "2025-05-21 06:51:54", "date_publish": "2025-01-13 21:23:48", "description": "Aberdeen sign Alexander Jensen from Swedish side IF Brommapojkarna on a four-year deal, \"subject to UK Visa and immigration formalities\"", "filename": "sport_football_articles_cpwxr75zndxo_1747810314.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/528a/live/611fcea0-d1f2-11ef-9fd6-0be88a764111.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cpwxr75zndxo_1747810314.html", "title": "Aberdeen sign 'versatile' Alexander Jensen from IF Brommapojkarna on long-term deal", "title_page": "Aberdeen sign 'versatile' Alexander Jensen from IF Brommapojkarna on long-term deal - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Aberdeen have signed Alexander Jensen from Swedish side IF Brommapojkarna on a four-year deal, \"subject to UK Visa and immigration formalities\".\nThe 23-year-old can play either in midfield or at full-back and has been linked with the Dons since the transfer window opened.\nHe becomes the Pittodrie club's fourth January signing, following Jeppe Okkels, Kristers Tobers and Alfie Dorrington.\n\"It has taken a lot of work by people behind the scenes here at the club, and over a number of months, but we're pleased to get this deal for Alexander over the line,\" Thelin said.\n\"It's another piece of the jigsaw complete in terms of strengthening the squad, and providing some reinforcement, particularly as we are experiencing some long-term injuries at the moment.\"\nJensen started his career in the FC Midtjylland academy, before making his senior debut for Vejle BK. He then moved to FC Fredericia before signing for Brommapojkarna in 2023.\n\"He is one the highest performing players in Sweden so it's a bit of coup for us to get him to Aberdeen,\" Thelin added. \"He is a really versatile player so he will offer us flexibility across key areas of the pitch.\n\"He is currently at the end of a close season so he may take a little time to get up to speed, but we will work hard with him in the coming days and weeks and we are confident he will have a positive impact for Aberdeen this season and beyond.\"", "url": "https://www.bbc.com/sport/football/articles/cpwxr75zndxo"}