{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:38:51", "date_modify": "2025-04-26 06:38:51", "date_publish": "2025-03-02 17:03:29", "description": "Newcastle 1-2 Brighton: What Fabian Hurzeler said", "filename": "sport_football_articles_ce8y0nx7zezo_1745649531.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/408c/live/3ae0f910-f788-11ef-a7e0-1fbd7c9e9e6f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_ce8y0nx7zezo_1745649531.html", "title": "Newcastle 1-2 Brighton: What Fabian Hurzeler said", "title_page": "Newcastle 1-2 Brighton: What Fabian Hurzeler said - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Brighton boss Fabian Hurzeler has been speaking to BBC Match of the Day after his side sealed their FA Cup quarter-final spot: \"It was a very emotional game, lots of ups and downs. The key was that we stayed together, stayed calm and tried to find solutions.\n\"They had a big chance, hitting the post, but then I thought we were controlling the game. The penalty was out of nowhere. We played with a lot of courage. We had some small chances and then after we conceded, we showed a brilliant reaction.\n\"We focused on our solutions and staying clam. In the second half, we were very dominant. We suffered a little bit when we received the red card but, overall, it was a great performance.\"\nOn Danny Welbeck and Solly March's performances: \"Two special players. It is very helpful to have them in the team. They are great characters, they are hard workers, they have a lot of experience. It is important to have them in the squad.\"\nOn winning five games in a row: \"We can only win something if we stay together, and that's what we must focus on. In football, there is not a lot of momentum but we have to understand why it's like this in the moment.\n\"It is important to stay grounded and keep doing the basic things.\"\nOn the possibility of reaching Wembley: \"The fans can dream and we can work.\"", "url": "https://www.bbc.co.uk/sport/football/articles/ce8y0nx7zezo"}