{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:07:57", "date_modify": "2025-05-21 04:07:57", "date_publish": "2025-04-06 14:30:02", "description": "Motherwell fan views: 'We're suffering from Kettlewell's signing policy'", "filename": "sport_articles_cm249w8wn0lo_1747800477.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5cfc/live/8d519cd0-12d7-11f0-ac9f-c37d6fd89579.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cm249w8wn0lo_1747800477.html", "title": "'We're suffering from Kettlewell's signing policy'", "title_page": "Motherwell fan views: 'We're suffering from Kettlewell's signing policy' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your views on Motherwell's 2-0 defeat against Kilmarnock.\nHere's what some of you said:\nGordon: It was always going to be tough on that unacceptable pitch, but not one of our players can claim to have had a decent game. Hoofing the ball aimlessly forward, midfield simply helping it on, ball in the air most of the time, poor first touch by anyone it actually reached and always last to second balls. Sending off is a limp excuse.\nDerek: We are suffering from the strategy and signing policy of Stuart Kettlewell. If you ask Well fans, he is up there with Harri Kampman as a total shocker. Michael Wimmer has no chance. It's fingers crossed time now.\nHarry: Referee was a joke, we played poorly fair enough but the first red is never a red! Kofi Balmer is clearing the ball, no malice in it. Dom Thompson is dragged down by Daniel Armstrong and only the Well player is punished, absolute joke!\nGrant: Really, really poor, the first couple of games when Wimmer came we looked really good, full of energy and some lovely triangles. But we haven't looked a team the last two games. The sending off was never a sending off but it wouldn't have made any difference if we had 11 men on the park, no one up front, Luke Armstrong does a lot of running but needs someone up with him. We are going to end in the play-offs", "url": "https://www.bbc.com/sport/articles/cm249w8wn0lo"}