{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:39:21", "date_modify": "2025-05-21 06:39:21", "date_publish": "2025-01-22 18:43:17", "description": "Man Utd news: Amad Diallo 'showed really good signs at Rangers' - James Tavernier", "filename": "sport_football_articles_c79de73e83eo_1747809561.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/bb4f/live/95bdafe0-d8ed-11ef-96e3-7ddb8edc83e8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c79de73e83eo_1747809561.html", "title": "Diallo 'showed really good signs at Rangers'", "title_page": "Man Utd news: Amad Diallo 'showed really good signs at Rangers' - James Tavernier - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Rangers defender James Tavernier says he was \"always convinced\" that Amad Diallo would become a good player.\nTavernier played alongside Diallo during the Manchester United forward's short loan spell at Ibrox in 2021-22.\nThe 22-year-old struggled for consistent game time under then Rangers manager Giovanni van Bronckhorst and ended the season with three goals in 13 games.\nHe had a more fruitful time the following campaign during his season-long loan with Sunderland, scoring 14 goals and registering four assists during his 42 appearances.\nHowever, in a difficult season so far for United, Diallo has been a standout player and will hope to have the chance to continue his good form when Rangers visit Old Trafford in the Europa League on Thursday.\n\"I was always convinced [Diallo would do well]. He showed really good signs at Rangers,\" Tavernier said.\n\"He was in and out the team and then had a really bright spell at Sunderland on loan. He has continued that now at Manchester United and he is really showcasing his talent.\n\"You obviously get tested in an Old Firm game, or you can go away to places where they only have a few fans, so it is a different learning curve [playing in Scotland]. It would have taught him something and he has really progressed since then.\n\"He will be a dangerman we will have to be aware of on Thursday as he is really in form, but I'm looking forward to playing against him.\"", "url": "https://www.bbc.com/sport/football/articles/c79de73e83eo"}