{"authors": ["Alex Howell", "www.facebook.com"], "date_download": "2025-05-20 12:41:32", "date_modify": "2025-05-20 12:41:32", "date_publish": "2023-08-03 15:47:58", "description": "Chelsea agree a deal to sign Brighton goalkeeper Robert Sanchez for £25m plus add-ons.", "filename": "sport_football_66399583_1747744892.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1C38/production/_130642270_gettyimages-1252134436-1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66399583_1747744892.html", "title": "Robert Sanchez: Chelsea agree deal to sign Brighton goalkeeper for initial £25m", "title_page": "Robert Sanchez: Chelsea agree deal to sign Brighton goalkeeper for initial £25m - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Chelsea have agreed a deal to sign Brighton goalkeeper Robert Sanchez for £25m plus add-ons.\nThe Blues have been looking to add a goalkeeper to their squad following the sale of Edouard Mendy to Al-Ahli in Saudi Arabia.\nSanchez, 25, will challenge Kepa Arrizabalaga for the number one spot.\nThe Spaniard will be familiar to the coaching staff at Chelsea as goalkeeping coach Ben Roberts worked with him while at Brighton.\nSanchez has been with the Seagulls since the age of 15, having joined their academy from Levante in 2013.\nAfter loan spells with Forest Green and Rochdale, he made his Brighton debut in November 2020 and became the Seagulls' first-choice stopper for the best part of two years.\nHe was also called up by Spain in 2021 and was part of their squad at both the delayed Euro 2020 tournament and the 2022 World Cup, although his only two caps have both come in friendlies.\nSanchez lost his place to Jason Steele in the second half of Brighton's 2022-23 Premier League season, although he did play in the FA Cup semi-final defeat on penalties by Manchester United at Wembley.\nHis contract at Brighton, where Sanchez has made 90 appearances in total, was set to run until June 2025.", "url": "https://www.bbc.com/sport/football/66399583"}