{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-04-26 07:51:23", "date_modify": "2025-04-26 07:51:23", "date_publish": "2025-02-25 15:14:06", "description": "Manchester United head coach Ruben Amorim says his players must take some responsibility for the club's present financial predicament.", "filename": "sport_football_articles_cg70z0y318do_1745653883.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3f5f/live/36e63070-f385-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cg70z0y318do_1745653883.html", "title": "Manchester United: Ruben Amorim says players must take responsibility for club's financial issues", "title_page": "Manchester United: Ruben Amorim says players must take responsibility for club's financial issues - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Manchester United head coach Ruben Amorim says he and his players must take some responsibility for the club's present financial predicament.\nSpeaking less than 24 hours after United confirmed a second round of redundancies that will lead to up to 200 staff members losing their jobs, Amorim said that, as the \"engine\" of the club, his squad must do better.\nAfter losing more than £300m in the past five years, United find themselves 15th in the Premier League before their encounter with relegation-threatened Ipswich at Old Trafford on Wednesday.\nIt is their worst league campaign since the dark days of 1989-90, when Sir Alex Ferguson almost got the sack as United flirted with the relegation zone before eventually finishing 13th.\n\"We have to address all the problems in the club but one important piece of this moment is to understand how we get to this situation,\" said Amorim.\n\"It has a lot to do with the lack of success of the football team because we are the engine of any football club.\"\nIn the space of under two seasons, United have fallen from a third-place finish in Erik ten Hag's first season in charge to their current position.\nWhile Amorim and his squad might be insulated from the cost-cutting measures - staff at Old Trafford will no longer get free lunches in a move the club estimates will save £1m - some of the people they work with every day will soon no longer be around.\n\"We know this year was really hard for everybody,\" said Amorim, who replaced Ten Hag in November.\n\"As a club, we did a lot of changes. When you are doing the changes if you have a football team who are playing well and winning games, it is easier for the fans and everyone to feel that. But in this moment we are in a difficult period inside of the club and inside of the pitch. We have to fight against this feeling.\n\"We have do our job and we try our best to help the team to perform better.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cg70z0y318do"}