{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:16:15", "date_modify": "2025-05-21 06:16:15", "date_publish": "2025-01-04 18:58:19", "description": "Boss Alex Neil says Millwall's fightback after a testy first half in the draw with Sheffield Wednesday was \"brilliant\".", "filename": "sport_football_articles_clygryyyzn9o_1747808175.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f4e1/live/38918f10-cacb-11ef-87df-d575b9a434a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_clygryyyzn9o_1747808175.html", "title": "Alex Neil praises 'brilliant' Millwall response against Sheffield Wednesday", "title_page": "Alex Neil praises 'brilliant' Millwall response against Sheffield Wednesday - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Millwall boss Alex Neil said his side's response to being outplayed in the first half of the 2-2 draw agaimst Sheffield Wednesday was \"brilliant\".\nThe Lions trailed 1-0 at Hillsborough to Yan Valery's early strike and the Owls missed several great chances to increase their lead, notably when Ike Ugbo missed a penalty.\nGoals from George Honeyman and Ryan Wintle saw Millwall lead 2-1, but Gabriel Otegbayo's strike earned the hosts a point.\n\"Based on the game, it's a great point,\" Neil said. \"In the first half we didn't do well enough; we were fortunate it was only 1-0.\n\"We had a chat at half-time and responded brilliantly. We scored two goals and made it much more difficult for Sheffield Wednesday - albeit they did have their chances.\n\"Once you go 2-1 up, you are naturally disappointed that you don't see the game out, because defensively we are particularly strong.\n\"The goals are disappointing, particularly from a set-play because we should spot the ball slipped down the side and, if we do that, we can defend our box and go on and get three points.\"", "url": "https://www.bbc.com/sport/football/articles/clygryyyzn9o"}