{"authors": ["Nicola Pearson", "www.facebook.com"], "date_download": "2025-05-21 05:53:37", "date_modify": "2025-05-21 05:53:37", "date_publish": "2025-01-31 16:42:58", "description": "Kieran McKenna press conference: Ipswich vs Southampton preview", "filename": "sport_football_articles_clyk503z0gpo_1747806817.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8a85/live/ac9e2280-490a-11ef-9e1c-3b4a473456a6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_clyk503z0gpo_1747806817.html", "title": "Kieran McKenna press conference: Ipswich vs Southampton preview", "title_page": "Kieran McKenna press conference: Ipswich vs Southampton preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "McKenna confirmed that Wes Burns will \"miss the rest of the season\" after picking up an ACL injury against Liverpool last time out, stating: \"He will go for surgery next week. Of course we know that's a significant period of time out. He's seeing the very best people. It's not a very complicated tear, I believe. You can never call an ACL straight forward, but it's an orthodox procedure and everyone is really positive about the prognosis.\"\nThe injury is \"a blow\" for the side, but the Ipswich boss added: \"We're not going to have any late panic in the transfer window. If there was a player who can look to improve us then we will do so, but we are not going to add numbers just for the sake of cover.\"\nMcKenna said he has \"never labelled a game\" as must-win, adding: \"You understand it because terminology around must-win is different, but that implies it is something that the game isn't. Of course we are playing another team down towards the bottom of the division and we want to and need to pick up points along the way. We are coming off the back of a couple of difficult games and this is a home game and and opportunity for us to go and try and win.\"\nHe added: \"The opposition will see it as one of their better opportunities too and whichever way it goes, there is still going to be a lot of games and will be really tight at the bottom. It won't be set one way or the other.\"\nMcKenna said it is \"natural\" there is more \"expectation\" on this game, but that fans \"understand\" the situation. He added: \"The teams who were first, second and fourth in the Championship last year are now 20th, 19th and 17th in the Premier League. Whether at top or bottom, it is about taking care of details, focusing on performance and giving everything to go for the result. I think fans will understand and be right behind us.\"\nOn if he feels they have done enough business this transfer window: \"I don't think you ever feel like you have done enough. We have tried to improve the squad. The three players brought in, I feel like they have improved the squad. Jaden [Philogene] can have a long-term impact. The other two have more experience and can help the squad now. We want the squad to be as strong as possible. In an ideal world there could have been one or two more but it is a difficult window.\"\nOn temptation to play Julio Enciso from the start: \"Julio is ready to go in terms of minutes played this season. He trained really well. He has been really positive around the training ground this week and everyone is really enjoying him being here, so he is ready to make and impact tomorrow with whatever minutes he gets.\"", "url": "https://www.bbc.com/sport/football/articles/clyk503z0gpo"}