{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:27:00", "date_modify": "2025-04-26 04:27:00", "date_publish": "2025-03-03 11:15:20", "description": "Hibernian: 'Speechless' Iredale will never tire of Sunshine on Leith", "filename": "sport_articles_c7781mnrye6o_1745641620.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/50f5/live/e2735010-f81e-11ef-8dde-aff9d405c81c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_c7781mnrye6o_1745641620.html", "title": "'Speechless' Iredale will never tire of Sunshine on Leith", "title_page": "Hibernian: 'Speechless' Iredale will never tire of Sunshine on Leith - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "\"I'm speechless.\"\nJack Iredale wasn't the only one left lost for words in Leith when he sensationally struck, what proved to be, the winner in the Edinburgh derby.\nOn one of his furthest ventures forward at Easter Road, the defender let rip with a rasping, curving cracker to leave Hearts goalkeeper Craig Gordon without a chance.\n\"It was probably the highest I got up all day and I thought, if there's a day to score a goal like that, then why not today?,\" Iredale told club media.\n\"It's an emotion you can't sum up. It's such a special feeling to be able to share something like that with the club and with the fans as well.\n\"I'm struggling to describe it at the minute, I'm still a bit speechless, really.\n\"It's obviously, a massive, massive day, a special day for the club and really happy to be contributing in that way.\"\nThanks to his contribution, seconds after the full-time whistle peeped, Sunshine on Leith was belted around the ground for the second weekend running, after Celtic were defeated to week prior. And it's a song Iredale won't get sick of.\n\"It's so special to hear it,\" he added. \"Some of the lads have said that they've gone quite a while without hearing that song, and then, obviously, we've managed to do it twice in a week.\n\"You'll never get used to something like that.\"", "url": "https://www.bbc.co.uk/sport/articles/c7781mnrye6o"}