{"authors": ["Neil Johnston", "www.facebook.com"], "date_download": "2025-05-20 14:04:09", "date_modify": "2025-05-20 14:04:09", "date_publish": "2023-07-31 05:20:10", "description": "Japan show why they are serious contenders at the Women's World Cup as they cruise past Spain to book a last-16 showdown with Norway.", "filename": "sport_football_66357306_1747749849.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/986B/production/_130591093_gettyimages-1566024647.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66357306_1747749849.html", "title": "Japan 4-0 Spain: Hinata Miyazawa scores twice in impressive win", "title_page": "Japan 4-0 Spain: Hinata Miyazawa scores twice in impressive win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Japan showed why they are serious contenders at the Women's World Cup by hammering Spain to finish top of Group C and book a last-16 showdown with Norway.\nThe 2011 world champions made it look easy by scoring three times before half-time, with Hinata Miyazawa getting two to take her tally to four goals and become the tournament's leading scorer.\nThe attacking midfielder put Japan ahead with a calm finish after Spain's defence had been exposed, before Riko Ueki doubled the lead with a deflected finish which looped into the net.\nMiyazawa, who scored two in Japan's opening group game against Zambia, made it 3-0 by firing across goal and into the net in front of a crowd of 20,957.\nSubstitute Mina Tanaka added to Spain's pain with a fourth goal in the 82nd minute.\nJapan made five changes to the side that overcame Costa Rica in Dunedin five days earlier yet never looked back after taking control on a blustery evening in New Zealand's capital.\nAfter wins against Zambia, who are making their debut at this World Cup, and Costa Rica, who are ranked 36th in the world, this was the night they really showed the world they mean business.\nJapan produced a powerful performance which included some exceptional finishing against a Spain side high in confidence after back-to-back wins.\nMiyazawa, who also laid on the assist for Ueki's goal, looks a real handful and will be crucial if the two-time finalists are to reach the quarter-finals for the first time since 2015.\nJapan fans, who turned out in numbers in Wellington with some dressed in colourful masks and national costume, witnessed a masterclass from their team who look formidable after a third successive win in New Zealand.", "url": "https://www.bbc.com/sport/football/66357306"}