{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:15:26", "date_modify": "2025-05-19 15:15:26", "date_publish": "2015-02-05 06:48:11", "description": "Retired footballer and ex-PFA chairman Clarke Carlisle says he was trying to take his own life when he was hit by a lorry in December.", "filename": "sport_football_31142797_1747667726.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/80797000/jpg/_80797325_cc_bbc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31142797_1747667726.html", "title": "Clarke Carlisle: Ex-PFA chairman reveals suicide attempt", "title_page": "Clarke Carlisle: Ex-PFA chairman reveals suicide attempt - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Burnley defender Clarke Carlisle was attempting to take his own life when he was hit by a lorry in December, he has revealed.\nCarlisle told the Sun newspaper he had been left severely depressed by the end of his football career, financial problems and the loss of a TV punditry role.\nThe 35-year-old left hospital on 30 January, six weeks after being struck in North Yorkshire.\n\"This was my lowest point,\" he said.\nCarlisle, speaking on Time to Talk Day,, external which aims to raise awareness of mental health issues, was chairman of the Professional Footballers' Association between 2010 and 2013 and remains on the PFA's management committee.\nBorn in Preston, he started his career at Blackpool and made more than 500 appearances for nine clubs in a playing career that spanned 16 years, finishing at Northampton in 2013.\nCarlisle was airlifted to Leeds General Infirmary following the 22 December incident on the A64 Leeds to York road.\nHe had suffered cuts, bruises, internal bleeding, a broken rib and shattered left knee.\nOn Christmas Day he was admitted as an in-patient to a psychiatric unit in Harrogate before his release last Friday.\nHe said he had reached \"an epiphany\" that he is \"incredibly unwell\".\n\"I ventured out of my room not as Clarke the ex-footballer, but as Clarke, a mental health patient,\" he said.\n\"That was the first step in my road to recovery.\"\nCarlisle faces a charge of failing to provide a sample after being stopped by police on 20 December - just two days before his suicide bid.\nThe first footballer to appear on Question Time, Carlisle has previously spoken out about depression and suicide in professional sport and presented a BBC Three documentary on the subject.\nOn Wednesday night she tweeted:, external \"Clarke and I thought very long and hard about this over the last week and feel that as you all supported us so immensely through this ordeal you deserved the truth.\n\"We also want to highlight and create understanding for a lot of issues and feel it would be hypocritical of us to say nothing.\"\nMarjorie Wallace, chief executive of the mental health charity SANE, said: \"We admire Clarke Carlisle and his family for speaking openly about his depression and his fight for recovery. This will encourage many thousands of others who will be experiencing despair in silence and without help.\"\nSamaritans can be contacted by phone on 08457 909090, via email, external or you can find the details for your local branch here., external\nClick here for information on mental health issues from BBC's Action Line.", "url": "https://www.bbc.com/sport/football/31142797"}