{"authors": ["Michael Emons", "www.facebook.com"], "date_download": "2025-05-20 14:11:52", "date_modify": "2025-05-20 14:11:52", "date_publish": "2023-07-30 07:24:15", "description": "Co-hosts New Zealand are knocked out of the Fifa Women's World Cup as Switzerland get the draw they need to advance as Group A winners.", "filename": "sport_football_66352248_1747750312.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8AF0/production/_130586553_nz.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66352248_1747750312.html", "title": "Switzerland 0-0 New Zealand: Fifa Women's World Cup co-hosts eliminated", "title_page": "Switzerland 0-0 New Zealand: Fifa Women's World Cup co-hosts eliminated - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tournament co-hosts New Zealand were knocked out of the Fifa Women's World Cup as Switzerland got the draw they needed to advance as Group A winners.\nNew Zealand began the day in second position in the group, but Norway moved above them thanks to a convincing 6-0 victory over the Philippines.\nJacqueline Hand hit the post for New Zealand but they could not get the win they needed to stay in the competition.\nThey become the first host nation to fail to make it past the group phase.\nIt was a tame and disappointing end to the tournament for New Zealand, who had beaten Norway 1-0 in the World Cup's opening match.\nA shock 1-0 loss on Tuesday in Wellington against the Philippines, the lowest ranked nation in Group A, left New Zealand's qualification in the balance, although their fate was still in their hands before their final match in Dunedin.\nBut, in a game they needed to win, they failed to have a single shot on target in the opening 70 minutes against Switzerland.\nWith the Europeans themselves only one goal away from elimination, it became tight and tense with neither side able to create many clear-cut opportunities.\nA number of New Zealand players were in tears at the final whistle, with their team eliminated on goal difference.\nThis was the country's sixth appearance at a Women's World Cup, but they had not won any of their previous 15 matches before Hannah Wilkinson scored the only goal in their 2023 opener as they beat Norway in front of a crowd of 42,137.\nBut the loss to the Philippines, a side ranked 20 places below them, was the one that proved crucial.\nNew Zealand, 26th in the world, did not give their supporters much to cheer about against Switzerland as they had to wait until the 74th minute to see the hosts have their first shot on target - a weak effort from Malia Steinmetz straight at Swiss goalkeeper Gaelle Thalmann.\nThe Football Ferns then had a tame header on target from Claudia Bunge, before eight minutes of injury time.\nNew Zealand goalkeeper Victoria Esson went up for a corner and two free-kicks, getting her head on one of the free-kicks, only to send her effort well off target.\nBut the hosts could not get a goal as Switzerland hung on to move into the last 16 for the second time, after also doing so in their previous appearance in 2015.\nThey will play the runners-up in Group C, the losers of Monday's Spain v Japan game, in the first of the knockout matches on Saturday, 5 August.\nReflecting on her side's exit, New Zealand coach Jitka Klimkova said: \"It's super emotional because everybody's disappointed about the result but this team can be so proud.\n\"There are so many positives we are taking away from the whole experience.\n\"I feel the nation is behind us and I really am thankful for that because they are part of this journey and part of us.\"\nNew Zealand co-captain Ali Riley added: \"I can't ask any more of the players. There's a lot of tears out there but they should be so proud, we fought really hard.\n\"There's such disappointment but I want everyone to be proud of what we've achieved.\n\"I really think we've inspired the country. I hope little girls across New Zealand and the world now will start playing sport and feel they can achieve whatever they put their mind to.\n\"I hope this opens so many doors and opportunities for young girls. We wanted to inspire, we wanted to honour the Ferns that came before us and this team did that. I'm so proud of them.\"", "url": "https://www.bbc.com/sport/football/66352248"}