{"authors": ["Charles Bannerman", "www.facebook.com"], "date_download": "2025-05-19 15:39:11", "date_modify": "2025-05-19 15:39:11", "date_publish": "2017-08-19 19:07:44", "description": "Kyles Athletic win the Artemis MacAulay Cup for the 12th time with a record-equalling 7-4 scoreline over Newtonmore at Oban.", "filename": "sport_scotland_40989733_1747669151.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/16319/production/_97450909_mcf_0817_0242.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_scotland_40989733_1747669151.html", "title": "Shinty: Kyles Athletic beat Newtonmore in high-scoring MacAulay Cup final", "title_page": "Shinty: Kyles Athletic beat Newtonmore in high-scoring MacAulay Cup final - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Kyles Athletic won the Artemis MacAulay Cup for the 12th time with a record-equalling 7-4 scoreline over Newtonmore at Oban.\nFour goals in 18 second-half minutes from Roddy MacDonald swung a previously tight tie the way of the Tighnabruaich side.\nWith just three minutes on the clock in Oban, Colin MacDonald fired Kyles ahead and gave them the lead again after Glen MacKintosh equalised. Fraser MacKintosh just beat the half-time whistle with More's second equaliser and Sandy MacKenzie got Kyles' third soon after the restart.\nThe hour marked the start of MacDonald's goal rush which took Kyles to 5-2 before Glen MacKintosh pulled one back and MacDonald responded with two more. MacKintosh immediately completed his hat-trick to round off an 11-goal final matched only by Oban Camanachd's 8-3 victory 60 years previously.\nKyles' success, however, came at the expense of losing top spot in the Marine Harvest Premiership after Kinlochshiel took a two-point lead with a 5-1 defeat of bottom side Glasgow Mid Argyll.\nOnce again MacRaes scored all five of the Kinlochshiel goals which put them two points clear of Kyles in the Premiership but with an extra game played. In a fixture switched to neutral Inverness, Keith MacRae scored a hat-trick while Oliver was on target in the first half and John in the second. Calum McLay responded for Mid Argyll at 3-0.\nGlenurquhart's relegation concerns deepened after they lost 3-2 at home to Oban Camanachd. The National Division title became an almost certain two-horse race between leaders Skye and Caberfeidh after they disposed of their two nearest challengers. The island side beat Fort William 4-0 while it was 5-2 for Cabers over Inveraray.\nMalcolm Clark got an early goal for Oban Camanachd and Paul MacKintosh equalised late in the first half. Strikes midway through the second from Daniel Cameron and Willie Neilson swung the game firmly in Camanachd's direction before Daniel MacKintosh got one back for Glen late on.\nWith two to go down, Mid Argyll have five points and Kilmallie, whose game was postponed, have seven, both with four matches to play. Glenurquhart and Lochaber have eight and nine points respectively, but both with only two matches left.\nIn the National Division, an early goal from Iain MacLellan and a late one from Jordan Murchison bracketed a James Pringle double for Skye without response from Fort William in Portree.\nAt Strathpeffer, Craig Morrison's hat trick after Colin MacLennan's first minute opener laid the foundations of Cabers' victory. Graham Bartlett was Cabers' other scorer in a game where Inveraray's response came from two Fraser Watt penalties.\nSkye remain three points clear of Caberfeidh in the promotion places while Fort and Inveraray, albeit with two games in hand, are a further seven points adrift making the top two look virtually unassailable.", "url": "https://www.bbc.com/sport/scotland/40989733"}