{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:47:02", "date_modify": "2025-05-21 06:47:02", "date_publish": "2025-03-30 15:02:10", "description": "A round-up of the latest Adran Premier action.", "filename": "sport_football_articles_cm2xnk7dd76o_1747810022.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/755c/live/e6ddb380-0d71-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cm2xnk7dd76o_1747810022.html", "title": "Cardiff City beat The New Saints to clinch Adran Premier title", "title_page": "Cardiff City beat The New Saints to clinch Adran Premier title - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Championship Conference\nCardiff City 3-1 The New Saints: Cardiff City beat TNS to secure a third successive Adran Premier title. Following a scoreless opening half in which Mackenzie Haydn-Jones saved Ffion Price's penalty at Cardiff International Sports Stadium, Eliza Collie and Mackenzie Olden notched in the second half. Mia Davies pulled a goal back for the visitors late on, but Fiona Barry made it 3-1 three minutes from time. Iain Darbyshire's side are seven points clear at the summit of the table with two matches remaining. The Saints stay fourth, two points behind Wrexham, having failed to claim any points in phase two.\nWrexham 1-3 Briton Ferry Llansawel: Briton Ferry secured second place in the Championship Conference after an impressive win over Wrexham at the Stok Racecourse. Tija Richardson put the visitors in front in north Wales, only for Abbie Iddenden to equalise seven minutes later. But Jade Crofts restored Briton Ferry's lead prior to half time before Laura-May Walkley scored a third for Rhys James' side on 53 minutes to end Wrexham's nine-game unbeaten run in all competitions.\nPlate Conference\nBarry Town United 0-3 Swansea City: Swansea confirmed themselves as Plate Conference winners following an emphatic triumph over Barry. Jessica Williams opened the scoring on seven minutes before Stacey John-Davis netted twice in quick succession as Swansea earned all three points at Jenner Park. Barry are guaranteed to finish the season in sixth place.\nAberystwyth Town 2-1 Cardiff Met: Cardiff Met's relegation from the Adran Premier was confirmed after they lost at Aberystwyth. Libby Isaac put the hosts in front after just five minutes at Park Avenue. Beca Thomas equalised for Met on 76 minutes, but Gwenllian Jones struck a late winner as the hosts secured their top-flight status. Met are 12 points adrift at the foot of the table with only two matches left to play.", "url": "https://www.bbc.com/sport/football/articles/cm2xnk7dd76o"}