{"authors": ["Alex Hoad", "www.facebook.com"], "date_download": "2025-05-20 11:41:01", "date_modify": "2025-05-20 11:41:01", "date_publish": "2023-08-06 18:09:48", "description": "Only two EFL matches last less than 100 minutes during the first weekend of the season as referees change the way they add time on.", "filename": "sport_football_66422652_1747741261.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1015/production/_130671140_shutterstock_editorial_14039935bk.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66422652_1747741261.html", "title": "English Football League added time: All but two matches go beyond 100 minutes", "title_page": "English Football League added time: All but two matches go beyond 100 minutes - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Football fans might need to consider revising their travel arrangements and rescheduling post-match plans if the opening weekend of EFL football is anything to go by, as games are going to last longer than ever.\nThis first English Football League programme of 2023-24 was the first to be affected, with all 35 matches featuring at least eight additional minutes of action and several 15:00 kick-offs on Saturday finishing way after 17:00.\nMatch officials are being told to add on the exact time taken for certain events - like goals and substitutions - rather than the \"nominal\" amount they have previously used.\nThe second half of Stoke's 4-1 Championship win over Rotherham did not kick off until 16:13 - in part due to the fact two goals were scored by the hosts in time added on to the opening 45 minutes.\nPresenter Mark Chapman even had to announce on BBC Radio 5 Live's Around the Grounds: \"Sports Report has always started at 17:00 for 75 years… I have a sense that this season it will be starting at about a quarter past.\"\nFans at Sixfields watching Northampton against Stevenage, two teams newly promoted to League One, had to stay put for an incredible 22 minutes and 36 seconds of time added on, eight minutes in the first half and more than 14 in the second, as Borough ran out 1-0 winners.\nThe shortest match across the first 35 fixtures of the campaign came at the Riverside where Middlesbrough's 1-0 home defeat by Millwall in the Championship saw 'just' eight minutes and 45 seconds added on across the two halves.\nThe only other game that lasted less than 100 minutes was Bristol City against Preston where there was a total of nine minutes and 55 seconds extra.", "url": "https://www.bbc.com/sport/football/66422652"}