{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:28:08", "date_modify": "2025-04-26 04:28:08", "date_publish": "2025-03-02 10:08:31", "description": "Former Ireland captain Peter O'Mahony says he wanted to retire before falling out of the national selection reckoning.", "filename": "sport_rugby-union_articles_cm2jj3g4mr2o_1745641688.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5060/live/8b5e93e0-f5e2-11ef-a452-97c9e2e951dd.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_cm2jj3g4mr2o_1745641688.html", "title": "Ireland Rugby: Munster's Peter O'Mahony happy to bow out on his terms as he prepares for Test retirement after Six Nations", "title_page": "Ireland Rugby: Munster's Peter O'Mahony happy to bow out on his terms as he prepares for Test retirement after Six Nations - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Former Ireland captain Peter O'Mahony says he wanted to retire before falling out of the national selection reckoning.\nThe Munster back row has started two of Ireland's three games in this year's Six Nations but, along with fellow long-serving players Cian Healy and Conor Murray, confirmed on Thursday that he would step away from the side at the end of this championship.\nThe 35-year-old was named Ireland skipper last year but was succeeded in the role by Caelan Doris in November. There had been speculation that the 2024 Six Nations would be O'Mahony's swansong but ultimately, he decided to play on for another year.\nWhile some critics last season suggested his status as captain was contributing to his continued selection, he has remained a key figure in recent weeks despite others officially leading the team.\n\"Whether I'm picked or not over the next number of weeks, I've trained really well in this campaign. I've competed, I've pushed guys, guys have pushed me, I haven't been out of place in our training,\" he said.\n\"That was the test for me - are you going to be good enough next year to compete with these guys? If that was the last one last week, it was the right call.\n\"I don't want to get to the point where I'm maybe not selected or not picked for a squad. I didn't want that to happen.\"\nPreparing to face France in Dublin on Saturday, Ireland are top of the Six Nations table and still on course for a Grand Slam after wins over England, Scotland and Wales. There remains the real possibility of a dream curtain call for O'Mahony and his decorated retiring colleagues.\nThe Cork native has already been a part of five Six Nations titles, two of them Grand Slams, with this year's Triple Crown the fourth of his career.\nDespite also winning a pair of league titles with Munster, the flanker feels his club career can only be viewed as a disappointment.\n\"I came into the club with a group of players that had won a lot for the club with a lot of them still around. I wanted to emulate that and, whatever way you look at it, I didn't,\" he said.\n\"I captained the team for a long time, and to very little avail unfortunately, so that's something I'll have to live with.\n\"I can still live with the fact that I put a huge amount of effort in, it wasn't for the lack of trying.\"", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/cm2jj3g4mr2o"}