{"authors": ["Neil Johnston", "www.facebook.com"], "date_download": "2025-05-20 13:42:27", "date_modify": "2025-05-20 13:42:27", "date_publish": "2023-08-01 13:44:52", "description": "Defending champions the USA must get better at the Women's World Cup, says manager Vlatko Andonovski.", "filename": "sport_football_66372368_1747748547.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/165EE/production/_130603619_gettyimages-1584684271.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66372368_1747748547.html", "title": "Women's World Cup 2023: USA head into last 16 with issues to solve", "title_page": "Women's World Cup 2023: USA head into last 16 with issues to solve - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Two-time Women's World Cup winner Carli Lloyd called it \"uninspiring\", \"lacklustre\" and \"too predictable\".\nUSA boss Vlatko Andonovski went on the defensive and said it was \"insane\" for anyone to question the mentality of his team.\nIt did not take long for the fallout to begin after the United States' latest underwhelming performance at the World Cup.\nA 0-0 draw against Portugal saw the defending champions scrape into the last 16 as they survived an almighty scare in Auckland.\nIn the 91st minute a ball was played over the top of the USA defence.\nPortugal substitute Ana Capeta hit a first-time shot past Alyssa Naeher but, to the relief of the thousands of American fans inside New Zealand's national stadium, the ball hit the post - instead of the back of the net.\nThe USA, the world's number one team for so long, were inches away from going out at the group stage.\n\"The player of the match was that post,\" said Lloyd, who helped the USA win the World Cup in 2015 and 2019. \"They're lucky not to be going home.\"\nInstead they advance to the last 16 as runners-up in Group E with five points, their fewest total in what is their ninth appearance at the World Cup.\nFollowing a 1-1 draw with the Netherlands in Wellington last week, this was another disjointed performance which raised more questions than answers.\nThe Stars and Stripes are nowhere near hitting the form that saw them win back-to-back World Cups.\n\"We just have to get better,\" Andonovski admitted afterwards.\nThe USA have five days to regroup and find a solution following two disappointing performances by their high standards.\nEven the 3-0 win over World Cup debutants Vietnam in the opening group game was peppered with missed opportunities before they were forced to come from behind to secure a point against the Netherlands.\nOn Tuesday against World Cup debutants Portugal they carved out 17 chances, of which six were on target.\nYet they failed to find the net at the World Cup for the first time since a 0-0 draw with Sweden in 2015 in Canada.\nAndonovski had named the same starting XI for the first two games but opted to made two changes against Portugal.\nRose Lavelle, who has recovered from a recent knee injury, started after coming off the bench to provide the assist for Lindsey Horan to equalise in the previous game.\nForward Lynn Williams also got her first taste of this World Cup as Savannah DeMelo and Trinity Rodman dropped out.\nBut the USA could not find a way through a determined Portugal defence.\nSpeaking on Fox Sports, Lloyd did not hold back about the performance.\n\"Today was uninspiring. Disappointing. They don't look fit,\" she said., external \"They're playing as individuals and the tactics are too predictable.\n\"There's a difference between confident and arrogance. Where is the direction going?\"\nWhen told about Lloyd's comments at his post-match news conference in Auckland, Andonovski said: \"One thing I want to say is this team wanted to win this game more than anything.\n\"To question the mentality of this team and willingness to win and compete is insane.\n\"We know it's not good enough and we're not happy with the performance, but we have qualified for the next round and we move on.\n\"Going forward, we have to find those moments and get on the same page.\"\nThe USA will find out on Wednesday who they face at the weekend. A showdown with Sweden, who put five past Italy in their most recent match, in Melbourne looks likely.\nHaving drawn with the Netherlands in the previous match, the USA have gone consecutive games without winning at the World Cup for only the second time.\n\"If it is Sweden, we know Sweden - they're a tough squad,\" said defender Crystal Dunn. \"We will be as prepared as possible to take them on.\"\nLavelle, who scored in the 2019 final, is suspended for the next match after picking up a second yellow card.\n\"Rose missing the next game is obviously a loss,\" added Dunn.\nForward Alex Morgan said a much-improved performance was required if the USA are to advance to the quarter-finals.\n\"We should have solved problems on the field a little bit better and taken advantage of opportunities that were given to us,\" she added after the Portugal game.\nAs the USA get ready to fly to Australia to prepare for the next match, Morgan was asked if they will return to New Zealand.\nThe winners of Sunday's game will play a quarter-final tie back at Eden Park on 11 August.\n\"That's the plan,\" said Morgan. \"We want to make it all the way to the final and that means coming back to New Zealand.\"", "url": "https://www.bbc.com/sport/football/66372368"}