{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:29:51", "date_modify": "2025-05-21 07:29:51", "date_publish": "2025-01-03 22:30:52", "description": "Manchester City manager Pep Guardiola says he blames himself for the Premier League champions' awful run of form.", "filename": "sport_football_articles_c1mrvp4e720o_1747812591.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4033/live/57f1e8d0-ca0a-11ef-8de7-43becd15203b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c1mrvp4e720o_1747812591.html", "title": "Pep Guardiola: Manchester City boss accepts blame for bad run", "title_page": "Pep Guardiola: Manchester City boss accepts blame for bad run - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester City manager Pep Guardiola says he blames himself for the club's awful run of form.\nCity, who have won the Premier League title for the past four years and in six of the past seven, are 14 points behind leaders Liverpool.\nA 2-0 win at Leicester on Sunday was only their second victory in 14 matches.\nIt is the worst run of a hugely successful managerial career taking in spells at Barcelona and Bayern Munich.\n\"There are many, many things [involved in being a manager] and I missed something - something I am not doing well,\" said Guardiola, who has been at the club for nine seasons.\n\"In the end, when you lose a lot of games it is an incredible responsibility for the manager to take. There is something the team needs and confidence and I was not able to do it.\n\"The call is on me first, it's not the players. They naturally drop a little bit and that is normal. It happened a little bit last season as well.\"\nCity have had slow starts to seasons before - and trailed the leaders by six points or more in each of the past four title-winning campaigns - but they have never been this bad.\n\"With this consistency [of results] I should have found it, and that is why we're in this position,\" Guardiola said.\n\"I blame [myself]. It's not to say, 'oh how nice is Pep' - it's the truth. I lead that group of players and I could not lift them. This is the reality.\"\nCity have suffered many injuries this season - including to Ballon d'Or-winning midfielder Rodri - which Guardiola has repeatedly highlighted.\n\"We were the only unbeaten team in Europe [until 30 October] and top of the league, but immediately we went down, for injuries, many things we've talked about,\" he said.\n\"But, even with that, I should have found a way to get better results.\"", "url": "https://www.bbc.com/sport/football/articles/c1mrvp4e720o"}