{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:55:31", "date_modify": "2025-04-26 03:55:31", "date_publish": "2025-03-04 16:04:15", "description": "Both Irish Cup semi-finals will be live on the BBC iPlayer with Cliftonville facing Ards on 28 March and Bangor taking on Dungannon Swifts on 29 March.", "filename": "sport_football_articles_c4g0k2wzv93o_1745639731.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7d0a/live/a5569bc0-f8f4-11ef-896e-d7e7fb1719a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c4g0k2wzv93o_1745639731.html", "title": "Irish Cup semi-finals: Cliftonville v Ards and Bangor v Dungannon Swifts live on BBC iPlayer", "title_page": "Irish Cup semi-finals: Cliftonville v Ards and Bangor v Dungannon Swifts live on BBC iPlayer - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Both Irish Cup semi-finals will be live on the BBC iPlayer and BBC Sport website with Cliftonville facing Ards at Windsor Park on 28 March and Bangor taking on Dungannon Swifts at Seaview on 29 March.\nThe holders' contest with Ards will kick-off at the National Stadium on the Friday night at 19:45 GMT with the second semi-final starting at 17:30 on the Saturday at the north Belfast venue.\nSaturday's second semi-final will also be live on BBC Radio Ulster and BBC Sounds.\nCliftonville maintained their hopes of back-to-back Irish Cup successes by beating neighbours Crusaders 2-1 on Saturday.\nChampionship side Ards defeated Loughgall 2-0 to keep alive their ambitions of a first Irish Cup triumph since 1974.\nTheir north Down neighbours Bangor achieved the big quarter-finals shock by defeating previously in-form Glentoran 3-1.\nBangor's only previous Irish Cup triumph came in 1993.\nTheir semi-final opponents Dungannon Swifts have never won the competition with the Tyrone club's only final appearance coming 18 years ago when they lost the decider to Linfield in a penalty shootout.", "url": "https://www.bbc.co.uk/sport/football/articles/c4g0k2wzv93o"}