{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:54:15", "date_modify": "2025-05-20 12:54:15", "date_publish": "2023-08-01 12:49:29", "description": "'Disastrous' League Cup campaign, but not all doom and gloom for MacLean?", "filename": "sport_articles_cpv72wkvn32o_1747745655.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/09f9/live/b783bc20-3068-11ee-8f52-fbf70e4bf742.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cpv72wkvn32o_1747745655.html", "title": "'Disastrous' League Cup campaign, but not all doom and gloom for MacLean?", "title_page": "'Disastrous' League Cup campaign, but not all doom and gloom for MacLean?  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jamie Beatson, We Are Perth, external\nLet's get this out of the way right at the start - the League Cup group stage campaign couldn't have been much more disastrous. Dreadful defending, a lack of goals, worryingly sloppy play all round.\nThere is some mitigation. Steven MacLean has had to gut a bloated squad that was not up to the task of the coming season. He has stated outright that he doesn't want to sign players just for the sake of it, and as such the squad remains very thin just days before the league kicks off.\nThat has been exacerbated massively by a whole series of injuries. Nicky Clark and Chris Kane remain absent, Drey Wright and Graham Carey missed out against Stirling, James Brown played but clearly wasn't fully fit. The same goes for Dan Phillips.\nThat's left us giving players who are very much in the 'promising youth category' far more game time than they'd otherwise have had. Indeed, our bench in the last two games has featured very few names that anyone but St Johnstone fans would recognise.\nI would strongly suspect our starting XI come Saturday's visit of Hearts looks quite a bit different, and certainly by the time the transfer window closes I expect it to be radically different.\nWe certainly need new signings, and the thing I'm holding on to is that Steven Maclean has been very clear about the type of player he wants to bring in, and the additions of Jephcott and Mitov certainly fit the profile.\nSeveral more are needed and I expect us to make the most of the loan market as the bigger clubs both in Scotland and down south begin to finalise their squads and loan out the players they see as surplus in the coming weeks.\nPredicted finish - 9th\nStandout player - Luke Jephcott. A striker who wants to be a penalty box predator. Give him chances and I expect him to take them.", "url": "https://www.bbc.com/sport/articles/cpv72wkvn32o"}