{"authors": ["Tom English", "www.facebook.com"], "date_download": "2025-05-20 11:44:54", "date_modify": "2025-05-20 11:44:54", "date_publish": "2023-08-06 13:29:10", "description": "Trepidation and stress will be running themes as Scotland's World Cup preparations intensify, writes Tom English.", "filename": "sport_rugby-union_66418612_1747741494.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3B71/production/_130671251_20812617.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-union_66418612_1747741494.html", "title": "Gregor Townsend: Scotland boss awaits Fagerson hearing amid World Cup injury worry", "title_page": "Gregor Townsend: Scotland boss awaits Fagerson hearing amid World Cup injury worry - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A World Cup build-up is not a World Cup build-up without some sort of trepidation, some event or other that brings on the fear. Usually it's concern about an injury. Other times it can be fear of suspension. For Scotland on Saturday, it was both.\nThe encouraging news is that though Ben White went off early with a troublesome ankle in the thriller against France, the word is that he should be fine for the World Cup. The less-than-encouraging news is that Zander Fagerson is in bother following his red card for a head-on-head with Pierre Bourgarit, the La Rochelle hooker. It was Fagerson's second red card in just over two years and the fifth red card in this fixture in just over three years.\nSo Scotland are now heading to a place where they'd rather not be. Not Saint-Etienne, where they'll play a fully loaded France on Saturday evening - that'll be hard enough - but to a disciplinary hearing where they'll face a panel sitting in judgment of Fagerson, which, in a sense, could be even harder.\nWe'll get to that, but we'll get to the rugby first. Scotland made it two wins from two in the summer series, which is now five wins from seven in 2023. They were blown away by France for 40 minutes and then blew France away for the second 40 when they played with a ferocity and ruthlessness despite having only 14 men for much of it.\nTo finish one half losing 21-3 and to win the new half 22-0 with a numerical disadvantage underlies the twin personalities of this team. They can do things that only the very best teams in the world can do. They scored 10 points in seven minutes to beat England. They outscored France in Paris 21-6 in a brilliant 42-minute spell. And now they've scored 22 unanswered points in one half.\nThey also do things that the very best teams in the world would rarely do. Falling 19-0 down in Paris, for one. Falling 21-3 down in their own place, for another. There is a seriously good rugby side in there trying to get out, but you wonder if they'll ever find the consistency required to become proper contenders against the biggest beasts.\nThrowing it forward, South Africa won't exactly be panicking ahead of their World Cup opener against the Scots in Marseille, but they'll be wary. There is an element of madness and unpredictability about Scotland in full flight that will focus their minds. The Boks will, no doubt, try to batter Gregor Townsend's team into submission and the odds are that brute force will probably win the day in the end.\nBut what if Scotland turn it on, as they did in the second half on Saturday and as they did for an outstanding spell in Paris and as they did at various points at Twickenham? What if they play with an abandon and take their chances? Peak Scotland, with the backline in sync, are good enough and crazy enough to beat South Africa and South Africa probably know it.\nThey're also capable of being three scores behind at the break and dead to the world. Scotland came back from an 18-point deficit against France and won, but it was a warm-up game. Give South Africa an 18-point lead in Marseille when everything is on the line and there's no comeback. It just wouldn't happen.\nThe business with Fagerson is now a major fight for Scotland. Losing him for the South Africa game is a real possibility and, as such, it's a sleepless night situation for Townsend and his coaches.\nFagerson is Scotland's best tighthead by a country mile. Not flawless, not without a high penalty count at times, not without a red card already on his record, against Wales two years ago, for a similar offence to the one he was guilty of against France.\nBut he's still the best. The most dynamic, the most powerful. Tighthead for Scotland is like a food cupboard in a student flat - pretty bare. WP Nel is a wonder of science, but at 37 his nous is most useful when coming off the bench for the last quarter. The only other two tightheads are Murphy Walker and Javan Sebastian. You don't want to face the Boks with an inexperienced front-row player in your 23. The world champions tend to hunt rookie props like they're disorientated wildebeests in the Northern Cape.\nSo Fagerson's disciplinary hearing on Tuesday is a game within a game that the Scotland management really need to win. And it's complex. We don't yet know what law he'll be charged under. If the panel see his offence on the low end then he'll most likely get a two-game suspension, which would put him in the clear for the Boks.", "url": "https://www.bbc.com/sport/rugby-union/66418612"}