{"authors": ["Andy Gray", "www.facebook.com"], "date_download": "2025-05-20 14:08:58", "date_modify": "2025-05-20 14:08:58", "date_publish": "2023-07-30 11:38:44", "description": "The Republic of Ireland end their first World Cup with a 0-0 draw with Nigeria, who progress to the last-16 and could face England.", "filename": "sport_football_66352670_1747750138.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2223/production/_130593780_inpho_02302077.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66352670_1747750138.html", "title": "Women's World Cup 2023: Republic of Ireland collect first point as Nigeria progress", "title_page": "Women's World Cup 2023: Republic of Ireland collect first point as Nigeria progress - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The Republic of Ireland ended their first World Cup with a 0-0 draw with Nigeria, who progressed to the last-16 and could face England.\nThe result, coupled with Australia's win over Canada, meant the Super Falcons, the lowest-ranked side in Group B, qualified in second place at the expense of the Olympic champions.\nThe Irish were already knocked out after defeats by Australia and Canada but collected their first point at a World Cup in their final match of the tournament.\nIn a low-key encounter in Brisbane, the Nigerians came closest to making the breakthrough when Courtney Brosnan pushed Uchenna Kanu's header on to the crossbar with a stunning save.\nNigeria will face the winners of Group D in Brisbane, which could be England if they draw with or beat China on Tuesday.\nThe Republic's pre-match build-up had been dominated by the future of manager Vera Pauw, whose contract is up after the tournament and the Dutch manager felt both she and her players deserved clarity on her position.\nOn the pitch, it was a cagey first half in Brisbane, where both sides struggled to keep hold of possession and the Republic of Ireland had the first chance when Katie McCabe fired wide after some good build-up play by Sinead Farrelly and the returning Heather Payne.\nThe Irish support dominated the crowd in Brisbane but it was the pockets of Australian fans who had something to cheer when Hayley Raso opened the scoring for the Matildas in Melbourne.\nKnowing a draw would be enough to progress, Nigeria were content to sit deep in their own half but the Super Falcons almost took the lead when Louise Quinn gave the ball away and Asisat Oshoala raced clear, but the Barcelona forward could only fire wide when most in the stadium expected the net to bulge.\nIreland, whose first World Cup goal came courtesy of captain McCabe against Canada, looked the more likely side to break the deadlock and came close but Payne's cross was just too far for the outstretched leg of Farrelly.\nStriker Kyra Carusa headed into the arms of Nigeria captain Chimaka Nnadozie, while Nigeria were restricted to long-range efforts from Toni Payne.\nThe mood in Brisbane was further lifted before half-time when Raso scored Australia's second goal, which gave Nigeria breathing room in their quest to make the next round.\nJust like against Canada, the Republic of Ireland couldn't really get going after the restart and needed Brosnan's stunning save to keep the scores level.\nKanu's header looked like it was going to bounce up into the net but Brosnan flew to her right and tipped the ball on to the crossbar.\nWith the wind in their sails and the Irish defence rocking, the Africans came close moments later when Oshoala dragged an effort wide from inside the box.\nHowever, roared on by the Irish support, Denise O'Sullivan saw an effort well blocked by Blessing Demehin, and news of Australia's third goal came through to further ease the pressure on Randy Waldrum's side.\nNigeria took off Oshoala, who had been nursing an injury, but they were still strong going forward and Lily Agg and Louise Quinn had to be alert to make goal-saving blocks.\nMcCabe came close to repeating her 'Olympico' goal against Canada when her corner kick landed on the roof of the net as the crowd of 24,884 held its breath, but they were disappointed as Ireland's search for a winning goal failed to come to fruition.\nThe Nigerian support celebrated wildly at the full-time whistle as the Super Falcons qualified for the last-16 for the second consecutive World Cup.", "url": "https://www.bbc.com/sport/football/66352670"}