{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:23:32", "date_modify": "2025-05-20 13:23:32", "date_publish": "2023-08-02 08:32:08", "description": "Jac Morgan will captain Wales against England as Leigh Halfpenny wins his 100th cap for his country.", "filename": "sport_rugby-union_66378269_1747747412.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0E25/production/_130612630_bbc-sport-index-imagery-2-split-images-gradient-b6e4e22b-d07a-4b42-8a09-3cc462743a1b.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-union_66378269_1747747412.html", "title": "Wales v England: Jac Morgan captains hosts as Leigh Halfpenny reaches 100 Wales caps", "title_page": "Wales v England: Jac Morgan captains hosts as Leigh Halfpenny reaches 100 Wales caps - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jac Morgan will captain Wales against England on Saturday as Leigh Halfpenny wins his 100th cap for his country.\nWales have named three new caps to start the World Cup warm-up match in Cardiff.\nCardiff props Corey Domachowski and Keiron Assiratti and Gloucester centre Max Llewellyn are set to make their debuts.\nThere could be two new caps off the replacements' bench in Taine Plumtree and ex-England prop Henry Thomas.\nAaron Wainwright will play at number eight at the Principality Stadium with Taulupe Faletau battling a calf injury, while Sam Costelow is named at fly-half alongside his Scarlets half-back partner Gareth Davies.\nOspreys flanker Morgan, 23, will captain Wales for the first time as coach Warren Gatland looks to replace Ken Owens who has been ruled out of at least the tournament pool stages because of a back injury.\nWales have also lost experienced players like Alun Wyn Jones, Justin Tipuric and Rhys Webb who have retired from international rugby ahead of the World Cup.\nGatland will look at captaincy contenders in the three warm-up matches before coming to a final decision.\n\"We've named Jac as captain for this match and it is a great honour for him to be leading his country,\" said Gatland.\n\"We'll be looking at probably having a different captain for each of the matches as we give as many as possible in the squad an opportunity to impress, but also mindful about potential combinations as we get closer to naming the World Cup squad.\"\nMorgan and Wales women's captain Hannah Jones are both former pupils of Brynamman primary and Amman Valley Comprehensive schools.\nHalfpenny, 34, will become the ninth man to play 100 internationals for Wales after Alun Wyn Jones, Gethin Jenkins, George North, Dan Biggar, Stephen Jones, Gareth Thomas, Martyn Williams and Faletau.\nWith his four British and Irish Lions Test caps, Halfpenny played his 100th international against Canada in July 2021. The occasion lasted only a minute for the full-back as he suffered a serious knee injury which forced him out of rugby for more than a year.\nHalfpenny was 19 when he made his first Wales appearance against South Africa in November 2008 and Gatland has urged fans to mark his latest achievement.\n\"I'd like to make a special mention for Leigh,\" said Gatland.\n\"Reaching this milestone is an incredible achievement and testament to the player and person Leigh is. I know it will be a very special day for him and all his family.\n\"There are some tickets still available this weekend and we'd encourage as many fans as possible to come down to celebrate Leigh's achievement with us and see the new players making their Wales debuts.\"\nCardiff props Domachowski and Assiratti impressed last season and were included in the World Cup training squad.\nDomachowski's great-grandfather Stefan escaped from Auschwitz and arrived in Wales at the end of the World War Two.\nCentre Llewellyn, the son of former Wales lock Gareth, has signed for Gloucester for next season and will partner North in the midfield.\nPlumtree, 23, linked up with the Wales training squad in Switzerland just days after joining Scarlets. He was born in Wales and is the son of former Swansea coach John. He began his career with Wellington in the NPC and played for the Blues in Super Rugby.\nThomas played seven internationals for England between 2013 and 2014 but qualifies to play for Wales through his father and is eligible under World Rugby regulations because he last played for the land of his birth more than three years ago.\nWales have been on training camps to Turkey and Switzerland to prepare for the World Cup.\nAfter the weekend's England game, Gatland's side face a return visit to Twickenham on 12 August.\nWales complete their preparations against world champions South Africa on 19 August before Gatland is scheduled to name his final 33-man squad the following week.\nWales open their pool campaign against Fiji in Bordeaux on 10 September before further group games against Portugal, Australia and Georgia.\n\"I've been really pleased with the players' effort and commitment in Turkey, Switzerland and the mini camps in Wales prior, but now it's about putting what we've been training into practice,\" said Gatland.\n\"We're excited to get out on pitch at Principality Stadium this Saturday - it's always so special playing at home in front of our amazing fans.\n\"There is some great competition among the squad in all positions and we've selected a team this week with a few debutants, because we want to give them the opportunity to see what they can do.\n\"There's a lot to play for over the next three matches and everyone is still in contention to make that final squad for France.\"\nWales side to face England: Halfpenny; Rees-Zammit, North, Llewellyn, Dyer; Costelow, Davies; Domachowski, Elias, Assiratti, Jenkins, Rowlands, Tshiunza, Morgan (captain), Wainwright.\nReplacements: Dee, Smith, Thomas, Carter, Plumtree, Williams, Biggar, Grady.", "url": "https://www.bbc.com/sport/rugby-union/66378269"}