{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:29:34", "date_modify": "2025-05-21 07:29:34", "date_publish": "2025-01-22 08:34:53", "description": "Monaco 1-0 Aston Villa: Fan views", "filename": "sport_football_articles_cy8ydv3z4xko_1747812574.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy8ydv3z4xko_1747812574.html", "title": "Monaco 1-0 Aston Villa: Fan views", "title_page": "Monaco 1-0 Aston Villa: Fan views - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your thoughts after Tuesday's Champions League game between Monaco and Aston Villa.\nHere are some of your comments:\nPrit: An opportunity missed for Villa and another lethargic performance. Too many times this season we seem to lose all energy and make mistakes all over the pitch. The subs didn't really work and I would like to see Unai Emery try Lucas Digne at full-back with Ian Maatsen playing ahead of him. On the plus side, we have 13 points and a home game against Celtic. If we can win that we still have a very good chance of making the top eight. Glass still more than half full!\nPaul: We were sloppy all over the pitch - they won all the second balls. We kept losing the ball and nothing created up front. Got what we deserved - nothing.\nRichard: First half wasn't bad. The second half, particularly after Jhon Duran came on to partner Ollie Watkins, was devoid of any creativity and drive from Villa. Monaco did well to crowd the midfield. Predicting an end-to-end, raucous finale against Celtic full of goals, but will it be enough?\nGraeme: I think Villa went to Monaco expecting to win. Arrogance made them come unstuck!\nJonny: Because Villa funnel most of their possession through Youri Tielemans, when he has a bad game, Villa do too. Too many of his passes weren't up to snuff and it meant we couldn't get support through to Watkins. Villa looked tired and too many loose balls again cost us. On the bright side, Emi Buendia looked more like his old self.", "url": "https://www.bbc.com/sport/football/articles/cy8ydv3z4xko"}