{"authors": ["Andrew Benson", "www.facebook.com"], "date_download": "2025-05-21 04:47:46", "date_modify": "2025-05-21 04:47:46", "date_publish": "2025-04-05 04:15:33", "description": "Red Bull's Max Verstappen takes a shock pole position for the Japanese Grand Prix, ahead of the McLarens of Lando Norris and Oscar Piastri.", "filename": "sport_formula1_articles_cj68zz7kgxno_1747802866.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f7fd/live/308f8260-11f0-11f0-999b-253a9e37cf66.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_formula1_articles_cj68zz7kgxno_1747802866.html", "title": "Japanese Grand Prix: Max Verstappen pips Lando Norris to pole at Suzuka", "title_page": "Japanese Grand Prix: Max Verstappen pips Lando Norris to pole at Suzuka - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Max Verstappen stunned his own Red Bull team and rivals McLaren by grabbing pole position from Lando Norris for the Japanese Grand Prix.\nLagging behind the McLarens throughout the weekend, the world champion pipped Norris by 0.012 seconds with his final lap of the session.\nThe second McLaren of Oscar Piastri, fastest on the first laps of the session by 0.226secs from Verstappen, was third, ahead of Ferrari's Charles Leclerc.\nMercedes' George Russell took fifth, while Ferrari's Lewis Hamilton was eighth.\nWhen Piastri fell short of beating Verstappen with the final lap of the session, confirming the Dutchman's pole, the awe in the Red Bull garage was clear.\n\"That is insane,\" his race engineer Giampiero Lambiase said to Verstappen over the radio.\nEven Norris accepted that his rival had excelled himself, saying: \"Max did an amazing lap.\"\nNorris added: \"I'm happy because I feel like I got everything out of the car today. My lap was very good. We were on the limit of what we had but we just didn't have enough today.\"\nPiastri, though, felt he could have done better.\n\"The last lap just didn't quite come together as I wanted,\" the Australian said. \"Incredibly tight margins and still all to play for tomorrow. Just a little bit left on the table.\"\nVerstappen's new team-mate Yuki Tsunoda could manage only 15th place. The Japanese, drafted in for this race after Red Bull demoted Liam Lawson just two races into the season, was 0.498secs down on Verstappen in the second session, after which he was knocked out.\nHe told the team over the radio that he had done a \"pretty messy\" lap and he was out-qualified by Lawson's Racing Bull, which will start just ahead of him.\nTsunoda, who was just 0.024secs slower than Verstappen in the first session of qualifying, said he was \"very sad\", and that he had not managed to prepare the tyres properly for his lap.\nGrass fires again caused a problem - the second part of qualifying was stopped for six minutes when the fifth fire of the weekend broke out on the exit of the fast 130R corner.\nOfficials had doused the grass with water before qualifying in an attempt to prevent any further fires breaking out after four stoppages throughout practice on Friday and Saturday.\nThey had considered a pre-emptive burning of the grass but decided there was not enough time before qualifying and too big a risk that advertising hoardings could catch fire if it was not properly controlled or monitored.\nRain is forecast overnight and it remains to be seen how Formula 1's governing body, the FIA, will address the issue before the race.\nVerstappen's satisfaction at pole was enhanced by the fact that it came at Suzuka, a circuit considered one of the greatest challenges for a racing driver there is.\n\"We tried the best we could to get the best possible balance with the car,\" he said. \"It wasn't easy. Every session we kept making little improvements and then the last lap was just flat out.\n\"Around here, being on the limit, or maybe just a little bit over the limit in places, is incredibly rewarding\n\"It's insane, an F1 car around her is unbelievable and with the new Tarmac it gives you more grip and you have to commit even harder.\n\"I was fully committed on the final lap. At points, not sure if I was going to keep it (on the track). If you look at how our season started, even this weekend, it is very unexpected and that makes it a very special one.\"\nFerrari and Mercedes were not quite in the battle for pole.\nLeclerc was 0.316secs off Verstappen's time and Russell ended up 0.335secs back.\nThe Briton had been just 0.04secs slower than Verstappen on his first run in the final session, albeit 0.266secs behind Piastri. But a mistake at Turn One and Two on his final run, the rear stepping out in both corners, prevented him improving.\nHis team-mate Andrea Kimi Antonelli, who had lagged behind Russell all weekend, closed to within just over 0.2secs behind as a result and will start sixth, ahead of the Racing Bull of the consistently impressive rookie Isack Hadjar.\nHamilton had been closely matched with Leclerc in second qualifying, even though he was impeded by Carlos Sainz on his final lap. But he lacked pace in the top 10 shootout session.\n\"I generally struggled,\" Hamilton said, \"and when I got to Q3 I wasn't able to improve. Had a big snap oversteer in the middle sector on the first lap and then the second lap, I was only down in that sector. Not where I want to be.\"\nSpaniard Sainz was given a three-place grid penalty for impeding Hamilton and will start 15th, while his Williams team-mate Alex Albon took ninth ahead of an outstanding performance from British rookie Oliver Bearman in the Haas.\nBearman starts 10th, with his experienced team-mate Esteban Ocon down in 18th.", "url": "https://www.bbc.com/sport/formula1/articles/cj68zz7kgxno"}