{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:43:09", "date_modify": "2025-05-21 04:43:09", "date_publish": "2025-04-03 07:25:35", "description": "Derby head coach John Eustace speaks to BBC Radio Derby after his side's 2-0 win against Preston North End lifts them out of the relegation places.", "filename": "sport_football_articles_cpdzv5x9g92o_1747802589.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e255/live/72a5ceb0-105c-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cpdzv5x9g92o_1747802589.html", "title": "John Eustace: Derby County boss reacts to win against Preston that lifts Rams out of relegation spots", "title_page": "John Eustace: Derby County boss reacts to win against Preston that lifts Rams out of relegation spots - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Derby County head coach John Eustace spoke to BBC Radio Derby after his side's 2-0 win against Preston North End lifted them out of the relegation places.\n\"I'm very proud of the football club, the players, the staff, the fans. It's a huge effort [to win four Championship games in a row for the first time in five years], not down to any individual,\" he said.\n\"It's about a family. I spoke when I came in about wanting to create a family here at the football club and whatever happens this year it's important that we all grow together and we're successful together and that's not done in a short period. That's done over a long period.\n\"It's important that we don't get too carried away.\n\"We've got a huge game now on Saturday [at 16th-placed Swansea] and we'll prepare properly for that.\n\"It makes no difference if we're out the bottom three tonight. We want to be out of the bottom three after the last game of this season.\n\"That's all I'm worried about. We're making small steps forward. You can see there's a confidence in the group and that's all I can ask for.\"", "url": "https://www.bbc.com/sport/football/articles/cpdzv5x9g92o"}