{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:25:14", "date_modify": "2025-05-21 04:25:14", "date_publish": "2025-01-18 00:00:00", "description": "Everton substitute Veatriki Sarri scores a late equaliser at Walton Hall Park as Everton come from behind to deny Aston Villa victory.", "filename": "sport_football_live_cn01drj8r0rt_1747801514.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cn01drj8r0rt_1747801514.html", "title": "Everton 1-1 Aston Villa: Veatriki Sarri scores late to cancel out Rachel Daly header", "title_page": "Everton 1-1 Aston Villa: Veatriki Sarri scores late to cancel out Rachel Daly header - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Everton fans were full of optimism as they arrived at Walton Hall Park expecting to see several new faces, with the club investing strongly in the January transfer window so far.\nLadd's composure in midfield was evident, while France forward Gago was an exciting introduction off the bench and instantly became a fan favourite.\nThe encouraging signs were there for Everton and they got their rewards for a busy month behind the scenes, with the newcomers helping to push them over the line.\nManager Sorensen has called for more depth in his squad and wanted to be able to impact games off the bench – and this was the perfect example of that.\n\"We weren't ready for the first half. It was a bit off. I don't know why but we were too passive in all our actions,\" he said afterwards.\n\"We needed to do more in the second half and we certainly did that. The impact from the players off the bench made a huge difference to that.\n\"I am pleased with the point because we also have to acknowledge that Courtney Brosnan kept us in the game with some good saves in the first half.\"\nIt was a disappointing end for Villa, though, who had been comfortably the better side for an hour and were made to pay for a catalogue of missed chances.\nWith three wins and a draw under Goater, they are still progressing however, and this result will not damage the former Manchester City striker's claim to be permanent manager.\nVilla have looked exciting going forward and carved out plenty of opportunities on Merseyside which, on another day, they would have been likely to finish.\n\"This is something we will always continue to mention. When we get these chances we need to be able to take them,\" said Goater.\n\"We just have to keep going and make the right decisions. We certainly need to be ruthless and this is something we will talk about.\"\nDaly has often been Villa's match-winner and she nearly was again – timing her run well and finding herself in the right place at the right time to meet Noelle Maritz's cross.\nHer contract is due to expire this year and Villa fans will be hoping the 33-year-old commits her future after another impressive individual display, although it wasn't quite enough to seal all three points.", "url": "https://www.bbc.com/sport/football/live/cn01drj8r0rt"}