{"authors": ["Matthew Henry", "www.facebook.com"], "date_download": "2025-04-26 03:55:23", "date_modify": "2025-04-26 03:55:23", "date_publish": "2025-03-04 16:10:13", "description": "India hold their nerve to reach the Champions Trophy final with a four-wicket victory over Australia in Dubai.", "filename": "sport_cricket_articles_cdxqlerz264o_1745639723.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3d73/live/efeb6440-f917-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_cricket_articles_cdxqlerz264o_1745639723.html", "title": "Champions Trophy: India beat Australia to reach final in Dubai", "title_page": "Champions Trophy: India beat Australia to reach final in Dubai - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "India held their nerve to reach the Champions Trophy final with a four-wicket victory over Australia in Dubai.\nChasing 265, Virat Kohli compiled a typically composed 84 after the loss of captain Rohit Sharma and fellow opener Shubman Gill inside the first eight overs.\nKohli - the master of such chases - looked to be easing his side to victory, only to slap to Adam Zampa at long-on when 40 runs were needed from 45 balls.\nAustralia cannily applied the squeeze but two towering straight sixes from Hardik Pandya in a 24-ball 28 broke the tension.\nThe swaggering all-rounder holed out with India six away, which left KL Rahul to win the match with a six of his own with 11 balls to spare against the side who beat them in the 2023 World Cup final.\nIndia, supported by a loud, partisan crowd, also held firm excellently with the ball to dismiss Australia for 264 in 49.3 overs.\nAustralia were well placed at 198-4 in the 38th but fell away when captain Steve Smith, who dug in for 73, and Glenn Maxwell were bowled in the space of six balls.\nIndia's win means Sunday's final will be played in Dubai, rather than Lahore as initially planned because of their decision not to travel to hosts Pakistan.\nThey will play New Zealand or South Africa, who contest the second semi-final on Wednesday in Lahore.\nHaving moved serenely through the group stage, this was India's sternest test.\nUltimately they came through with another confident victory to continue their quest for a second global title in eight months after they won the T20 crown last year.\nThe match was probably decided at the end of Australia's innings. Another 20, even 30 runs, were possible and it may have been enough.\nInstead, Kohli was able to steer his side on after Gill was bowled for eight and Rohit Sharma pinned lbw by left-arm spinner Cooper Connolly for 28.\nAustralia, without Pat Cummins, Mitchell Starc and Josh Hazlewood here, were always asking a lot of an inexperienced bowling attack. Smith may rue the decision to bat first, given the pitch did not turn as much as expected.\nGlenn Maxwell dropped Kohli on 51 but he was otherwise typically assured – the only surprise coming when he was dismissed by Zampa to set up a more tense finish than was expected.\nThe crowd was quiet when the equation tightened to 24 runs required from 20 balls but erupted when Hardik struck consecutive sixes off Zampa.\nIndia have had plenty in their favour by playing all of their matches in Dubai. They are going to get one more on Sunday.\nIndia captain Rohit Sharma: \"Until the last ball is bowled, nothing is certain. That's how this game is. Halfway through the game, we felt like it was a reasonable score and we'd have to bat really bat well to get it because the nature of the pitch was - it didn't allow you to play how you wanted to play.\n\"We were very, very clinical with the bat. Yes, we got the runs at the 48th over but I thought we were very calm and composed in our chase.\"\nBBC commentator Aatif Nawaz: \"There is a huge self-assuredness about the way Virat Kohli bats. He doesn't worry about how many fours or sixes he scores, he just adapts his game to the task at hand. He takes his ego out of the equation completely and delivers for the team.\n\"He has an instinct for the game and is one of the best to ever do it.\"\nAustralia captain Steve Smith: \"I thought the bowlers did a really good job. Our spinners squeezed and enabled us to take the game deep. It was tough to rotate the strike at times but I thought everyone did a good job tonight.", "url": "https://www.bbc.co.uk/sport/cricket/articles/cdxqlerz264o"}