{"authors": ["Adam Lanigan", "www.facebook.com"], "date_download": "2025-04-26 06:38:55", "date_modify": "2025-04-26 06:38:55", "date_publish": "2025-03-02 17:00:23", "description": "Leeds Rhinos make it back-to-back Super League wins with a solid 38-24 triumph over Castleford Tigers.", "filename": "sport_rugby-league_articles_cn4ymrleyjeo_1745649535.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/51c3/live/4e1673a0-f785-11ef-a7e0-1fbd7c9e9e6f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-league_articles_cn4ymrleyjeo_1745649535.html", "title": "Super League: Leeds Rhinos 38-24 Castleford Tigers", "title_page": "Super League: Leeds Rhinos 38-24 Castleford Tigers - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Leeds Rhinos made it successive Super League victories with a comfortable win over struggling Castleford Tigers.\nRhinos dominated from the start with Jake Connor, Keenan Palasia and Harry Newman all crossing before half-time.\nThe second period produced more Rhinos scores through Jack Sinfield, captain Ash Handley, Ryan Hall and Riley Lumb as they moved up to fifth.\nOn a difficult afternoon for the Tigers as they suffered a third league defeat out of three, Fletcher Rooney, Zac Cini, Jeremiah Simbiken and a brilliant try from Innes Senior added some respectability to the scoreline.\nCastleford slipped down a place to 11th, only above troubled Salford Red Devils on points difference.\nThe Rhinos have been the big underachievers of Super League in the past two years, failing to make the play-offs.\nExperienced Australian head coach Brad Arthur is tasked with changing that but he was forced into significant changes with co-captain Cameron Smith out for more than two months and half-backs Brodie Croft and Matt Frawley both missing.\nDespite the alterations, they still dominated the territory in the early stages as Connor went over for his first Super League try in the blue and amber.\nThat was followed soon after by a first score for one of the Rhinos' off-season NRL recruits in Samoa forward Palasia.\nThe one-way traffic continued as Leeds' third try before half-time effectively sealed the contest as Newman dived over after anticipating the grubber kick from fellow centre Handley.\nCastleford have all lost all three of their league games, got knocked out of the Challenge Cup by Championship side Bradford Bulls and are still awaiting a takeover of the club to be completed by businessman Martin Jepson.\nAnd they were staring at a heavy defeat at 28-0 down as Sinfield and Handley exploited some lax defending to add further tries.\nHowever, Tigers' brightest spark is 19-year-old full-back Rooney and he showed why with a blistering run from near halfway to get his team on the board.\nIt was a brief respite as veteran Hall picked up Super League record-extending try number 256 and Lumb touched down in the opposite corner.\nBut as Leeds eased up, Cas added three tries in the final 10 minutes through Cini and Simbiken before winger Senior produced the score of the game with a 75-metre burst to round off proceedings.\nLeeds Rhinos head coach Brad Arthur told BBC Radio Leeds:\n\"Really happy with the first 60 minutes, but we need to be an 80-minute team. We need to respect ourselves and the opposition more and we didn't do that in the last 20 minutes.\n\"The positive for us is we didn't get any injuries out of the game and we can learn that lesson of the last 20 minutes without it costing us two points.\n\"As soon as I walked into the sheds, it wasn't a shed of a team that has just won a game of footy and that pleases me. But it's tough to win games and we have to enjoy the win.\"\nCastleford Tigers head coach Danny McGuire told BBC Radio Leeds:\n\"I was proud of the way they kept battling away to the end. Obviously it was a little bit too late.\n\"But a lack of discipline, errors, poor skill and Leeds took advantage of that and the tries were soft, I thought.\n\"It's tough. It was never going to be a straight road for us this year. There were always going to be some curves and some bumps and we've had a few bumps already.\"", "url": "https://www.bbc.co.uk/sport/rugby-league/articles/cn4ymrleyjeo"}