{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:49:02", "date_modify": "2025-05-21 07:49:02", "date_publish": "2025-05-19 00:00:00", "description": "Follow live text and listen to live BBC local radio commentaries from Division 1 and Division 2 of the County Championship.", "filename": "sport_cricket_live_c2lz47gld7pt_1747813742.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/221a/live/395e0c20-349d-11f0-96c3-cf669419a2b0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_live_c2lz47gld7pt_1747813742.html", "title": "County Championship LIVE: Day four", "title_page": "County Championship LIVE: Day four - scores, radio & updates - listen - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Late drama tops off excellent round of games\n#bbccricket\nWhat an absolutely brilliant four days of County Championship cricket we've just all been treated to.\nDurham nicked the win over Nottinghamshire in dramatic fashion with just 10 balls remaining to end Notts' unbeaten record.\nGloucestershire won for the first time this season and for the first time on home soil for 970 days in a seesaw encounter with Kent.\nLancashire pushed Derbyshire all the way but couldn't find that elusive first victory of the campaign as the visitors held out to maintain their unbeaten start.\nNot to mention wins for Surrey earlier today, as well as Somerset, Hampshire, Worcestershire, Glamorgan and Leicestershire who wrapped things up on day three.\nA great advert for the sport. We can't wait to do it all again on Friday as we bring you live text coverage of round seven here on the BBC Sport website.\nEngland's men's and women's teams are also in action before then, so be sure to follow those games along with us too.\nUntil then, thank you for joining us and enjoy your evening!\nLANCASHIRE DRAW WITH DERBYSHIRE\nLancs 458 & 184-7d v Derbys 314 & 220-8 - match drawn\nJack Morley works the second to last ball from Tom Hartley into the off side and they don't even bother with the final delivery of the match.\nWhat an absolutely monumental effort from Derbyshire to force the draw. Anuj Dal faced 113 balls for his 13 runs, while Jack Morley saw off 36 for no score.\nLancashire tried to force the issue with a sporting declaration to leave Derbyshire with a chance and they came close to taking all 10 wickets but will remain near the foot of the Division Two table.\nDerbyshire remain unbeaten with their fifth draw of the season (W1).", "url": "https://www.bbc.com/sport/cricket/live/c2lz47gld7pt"}