{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:26:13", "date_modify": "2025-04-26 04:26:13", "date_publish": "2025-03-03 11:33:46", "description": "Aberdeen fan views: 'Roll on the end of another rubbish season'", "filename": "sport_articles_cglk96wyypko_1745641573.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/22c3/live/af14c3f0-f776-11ef-9e61-71ee71f26eb1.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cglk96wyypko_1745641573.html", "title": "Aberdeen fan views: 'Roll on the end of another rubbish season'", "title_page": "Aberdeen fan views: 'Roll on the end of another rubbish season' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "We asked for your views after came from two goals down to draw 2-2 with Dundee United.\nHere's what some of you said:\nJohn: A great point. Whatever Jimmy said to them at half-time certainly worked, a team of two halves. Nisbet is looking sharper every game. We know what we have to do, win every game until the split and then take it from there. Great crowd and atmosphere on Sunday, long may it continue.\nMark: Great strength of character by Aberdeen. If the team stop conceding soft goals, more wins will start to happen. Thank goodness the days of negative Goodwin football are gone for us!\nMike: We're still a long way from the finished article, lots of possession but not much end product. To be honest, we're nowhere near the third best team so any European place would be good from here. All in all, a thoroughly disappointing season after our start.\nWilliam: Teams don't have to work particularly hard to score against this Aberdeen team. We were worth a point on second half effort but had we started the game this way, we wouldn't have been chasing it. Once again we've assembled a squad of good individuals that can't play as a team.\nPaul: Very lucky to get a draw. The whole team looked disinterested for most of the game. My patience with Thelin has all but gone. Its now his team, yet he still persists with players who aren't performing week in, week out. Clueless manager, clueless players, roll on the end of another rubbish season.", "url": "https://www.bbc.co.uk/sport/articles/cglk96wyypko"}