{"authors": ["Bobbie Jackson", "www.facebook.com"], "date_download": "2025-05-21 03:55:09", "date_modify": "2025-05-21 03:55:09", "date_publish": "2025-04-07 14:03:11", "description": "American Jarrell Miller taunts British heavyweight rival Fabio Wardley by wearing a Norwich shirt for their news conference at Ipswich Town's Portman Road.", "filename": "sport_boxing_articles_c4gr9lw4krxo_1747799709.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d538/live/9965d6e0-13b2-11f0-92ad-eb42d450dc76.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_boxing_articles_c4gr9lw4krxo_1747799709.html", "title": "Wardley v Miller: Fabio Wardley and Jarrell Miller news conference descends into chaos", "title_page": "Wardley v Miller: Fabio Wardley and Jarrell Miller news conference descends into chaos - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "American Jarrell Miller taunted British heavyweight rival Fabio Wardley by wearing a Norwich shirt at a bad-tempered news conference held at Ipswich Town's Portman Road.\nWardley is a lifelong Ipswich supporter and gets his dream of fighting at the stadium on 7 June when he faces Miller for the WBA 'interim' title.\nMiller unveiled a Norwich top with ''going down 25\" on the back in reference to Ipswich's likely relegation from the Premier League this season.\n\"I've been doing my homework and I'm going to support the other team,\" Miller said before unzipping his jacket to reveal the bright yellow shirt.\n\"There is a reason why I've been avoided for many years. I had one slip up against [Daniel] Dubois but I had three weeks notice for that.\n\"Real warriors travel anywhere. I've been in people's back yards before.\"\nMiller was referring to the one loss on his 29-fight record which came in December 2023 when he was stopped by IBF heavyweight champion Dubois.\nMiller served a two-year doping ban after twice testing positive for a performance enhancing drug, in 2019 and 2020.\nThe news conference them became more heated shortly after when Miller accused Wardley of disrespecting him by making a \"diss song\".\nMiller stood up and approached Wardley before the pair were held apart by security on the stage at the side of the Portman Road pitch.\n\"I was being respectful but he made a diss song,\" Miller said.\n\"I don't play this sport. He hasn't ever been in a ring with someone like me.\"\nWardley looked perplexed by the accusation and tensions boiled over further when Miller shoved his hand into the undefeated Briton's face.\n\"I haven't made any songs,\" Wardley responded. \"Whatever you heard isn't me. I don't know what song you think you heard but I didn't make anything.\n\"If I did it I would stand on it.\"\nBoth fighters eventually returned to their seats and Queensberry's Frank Warren, who promotes Wardley, apologised for the scenes.\n\"This is not a good look for our sport, not a good look for boxing. I don't want to be seeing this,\" Warren said.\n\"We want the stadium fight in June, not today. I apologise.\"\nWardley was set to face WBA 'regular' champion Kubrat Pulev but will meet 36-year-old Miller instead.\nThe 30-year-old has 18 wins and one draw on his record, with 17 victories via stoppage.", "url": "https://www.bbc.com/sport/boxing/articles/c4gr9lw4krxo"}