{"authors": ["Tyrone Smith", "www.facebook.com"], "date_download": "2025-05-21 07:23:44", "date_modify": "2025-05-21 07:23:44", "date_publish": "2025-03-28 15:59:59", "description": "Aberdeen manager Jimmy Thelin says goalkeeper Dimitar Mitov's shoulder injury is a \"little better\" than they were expecting, but it is unclear if he will be fit for next month's Scottish Cup semi-final with Hearts.", "filename": "sport_football_articles_cvg1g94q58wo_1747812224.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/36f5/live/68d149f0-0be8-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cvg1g94q58wo_1747812224.html", "title": "Dimitar Mitov news 'better than expected', says Aberdeen boss Jimmy Thelin", "title_page": "Dimitar Mitov news 'better than expected', says Aberdeen boss Jimmy Thelin - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Aberdeen manager Jimmy Thelin says goalkeeper Dimitar Mitov's shoulder injury is a \"little better\" than they were expecting, but it is unclear if he will be fit for next month's Scottish Cup semi-final with Hearts.\nThe 28-year-old sustained the knock while playing for Bulgaria during their Nations League play-off first leg defeat by the Republic of Ireland last week.\nIt is a setback for Mitov, who recently returned to action for the Dons after a spell out with a hamstring injury.\n\"It was a little better than we were first expecting,\" Thelin said. \"It is more about weeks and not longer than that, but let's see.\n\"They are working a lot with him now but I think it is some weeks ahead, it was a small muscle injury in the shoulder.\"\nWhen asked how confident he was that Mitov would be available for the Hampden date with Hearts on 19 of April, the manager replied: \"Let's see, we take it day by day and week by week but I think it is in quite a good timeline for us but let's see.\"", "url": "https://www.bbc.com/sport/football/articles/cvg1g94q58wo"}