{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:40:52", "date_modify": "2025-05-19 14:40:52", "date_publish": "2017-07-13 00:00:00", "description": "Steven Finn hits the winning runs as Middlesex beat Surrey by one wicket in the T20 Blast - relive the action as it happened.", "filename": "sport_live_cricket_40494083_1747665652.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_live_cricket_40494083_1747665652.html", "title": "T20 Blast: Middlesex v Surrey as it happened", "title_page": "T20 Blast: Middlesex v Surrey as it happened - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Goodbye\nMiddlesex 161-9 v Surrey 158-9 (Middlesex win by one wicket)\nSo that's it from us tonight. Be sure to check up on us later tonight as we will bring you a round-up of tonight's T20 Blast action, including this rather enjoyable match at Lord's.\nAnd remember, commentary of Essex v Somerset at Chelmsford continues at the top of this page.\nBut until tomorrow, that's from us live text bods. Goodnight!\nThe perfect start\nFriday: England v South Africa (day one, 11:00 BST)\nScoring 190 in your first innings and your team winning inside four days - it wasn't a bad start to Joe Root's reign as England Test captain, was it?\nEngland went 1-0 up in their series against South Africa with victory at Lord's, but there's been little time to celebrate as the second Test at Trent Bridge is quickly upon us.\nWe have it covered - join us on the BBC Sport website and app from 10:00 BST on Friday for live text coverage, Test Match Special commentary and in-play video highlights.\nWar of the Roses\nFriday's T20 Blast fixtures\nThe cricket just doesn't stop there.\nThere are five T20 Blast games taking place on Friday, including a Roses match between Lancashire and Yorkshire at Old Trafford.\nThat will be our feature match in BBC Sport's live text and Radio 5 live sports extra coverage, which is due to begin at about 18:30 BST on Friday.\nWe'll have text updates of the four matches elsewhere, all of which are being covered by BBC local radio.\nPost\nMiddlesex 161-9 v Surrey 158-9 (Middlesex win by one wicket)\nThat all got a little exciting didn't it?\nMiddlesex looked assured of victory at 133-3, before somehow construing to lose six wickets for just 20 runs.\nBut that all proved superfluous, as Steven Finn's winning runs took the hosts over the line in the end.\nMiddlesex win by one wicket\nMiddlesex 161-9 v Surrey 158-9\nRemarkable. Just utterly remarkable.\nSteven Finn, the Middlesex number 11 who never should have come out to bat, becomes the unlikely hero.\nHe hits one four to bring his side within two runs. Then, with such aplomb, he hits another boundary to bring home the bacon to please much of this sell-out crowd.\nWICKET: Simpson c Sibley b Rampaul 7\nMiddlesex 153-9 (target 159)\nI do not quite believe my eyes.\nJohn Simpson, what are you doing? He edges the ball high into the air for an easy catch for Dom Sibley. Steven Finn comes out to bat.\nI don't think he can believe what he is seeing either.\nWICKET: Higgins 10 c Foakes b T Curran\nMiddlesex 143-6 (target 159)\nWell that was entertaining. Ryan Higgins comes in, hits a four down the ground with his first ball, smashes a huge six off his second, and then nicks to the wicketkeeper with his third for a three-ball 10.\nHe's brought his side to within 16, though.\nWICKET: Southee c Sangakkara b Batty 0\nMiddlesex 133-5 (target 159)\nFour for Gareth Batty!\nMiddlesex bring Tim Southee to the crease up the order, clearly to have a swing at it.\nAnd swing he does, right into the hands of Kumar Sangakkara.\nBatty ends with figures of 4-14 - the best in the T20 Blast so far this summer.\nMiddlesex 133-3 (target 159)\nMorgan 31, Franklin 23\nEoin Morgan gets lucky.\nThe England captain edges a Ravi Rampaul delivery towards his wickets, but it sneaks past them and runs away for four.\nJames Franklin shows him how to find a \"proper\" boundary, easing the ball away into the space. 26 needed to win and 30 balls to do it.\nMiddlesex 122-3 (target 159)\nMorgan 26, Franklin 17\nNothing spectacular. That appears to be the mantra that James Franklin and Eoin Morgan have taken to help Middlesex reach their target.\nWith the final ball of Sam Curran's over, Morgan drives it back down the ground and it take some great work from Kumar Sangakkara to stop the four.\nMiddlesex 111-3 (target 159)\nMorgan 19, Franklin 15\nTom Curran comes back into the bowling attack and nearly does some damage when Eoin Morgan almost top edges to Kumar Sangakkara in the deep, but it comes up just too short.\nJames Franklin then shows a cheeky bit of skill, chipping it over Gareth Batty into the space down the ground.\nMiddlesex 102-3 (target 159)\nMorgan 13, Franklin 13\nGareth Batty is not so lucky in his third over. Having taking wickets in his first two, James Franklin sweeps him away for four and a couple of singles help keep the runs ticking over.\nThe batsman are going to have to start teeing off at some point soon, you feel.", "url": "https://www.bbc.com/sport/live/cricket/40494083"}