{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:40:52", "date_modify": "2025-04-26 06:40:52", "date_publish": "2025-03-02 13:21:34", "description": "'Celtic lost their best striker in January and look like a better team for it'", "filename": "sport_articles_credwgzv9g2o_1745649652.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6bac/live/cff84560-5af0-11ef-997c-711b7066309d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_credwgzv9g2o_1745649652.html", "title": "'Celtic lost their best striker in January and look like a better team for it'", "title_page": "'Celtic lost their best striker in January and look like a better team for it' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "We asked for your views on Celtic's 5-2 win against St Mirren.\nHere's what some of you said:\nPatrick: Relentless. St Mirren put in a real challenge and maybe deserved more but Celtic managed to find a win once again, and in the end it was a comfortable scoreline. Great to see Yang Hyun-jun grab a couple of goals, still need a bit more from Adam Idah, we know the talent is there but the consistency isn't.\nCraig: The squad depth and quality proving to be the reason we're strolling the league. The small bit of business in the January window with Kyogo Furuhashi being sold is almost forgotten with Daizen Maeda on fire and Jota settled right back in. Brendan Rodgers proving why he's such a good coach.\nDavid: St Mirren will feel hard done by with the result. They were terrific, played their hearts out and deserved better than the scoreline. They gave Celtic a go, but Celtic just got better as the game went on. The class of the Celtic squad is just so good. They deserved their five.\nPaul: Another invaluable three points secured towards winning the league for a fourth consecutive season. Although St Mirren made it tough for Celtic, missing several opportunities to add to their tally, ultimately Celtic's strength in depth was the overriding difference in the end, and the increasingly improving Yang was worthy of the man of the match award.\nChristopher: Celtic haven't been at their best the last two games, yet have still found a way to score 10 goals. This team lost its best striker in January and look like a better team for it? Incredible!", "url": "https://www.bbc.co.uk/sport/articles/credwgzv9g2o"}