{"authors": ["Andy Gray", "www.facebook.com"], "date_download": "2025-05-21 05:21:37", "date_modify": "2025-05-21 05:21:37", "date_publish": "2025-04-03 12:10:19", "description": "Irish FA CEO Patrick Nelson says it is \"great news\" that the joint-United Kingdom bid is the sole bidder for the 2035 Women's World Cup.", "filename": "sport_football_articles_cy70d3exlgpo_1747804897.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e50a/live/117465d0-107e-11f0-8c6c-d990c1c0e96b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy70d3exlgpo_1747804897.html", "title": "2035 Women's World Cup: 'Great news' that UK proposal is sole bid", "title_page": "2035 Women's World Cup: 'Great news' that UK proposal is sole bid - Irish FA CEO Patrick Nelson - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Irish FA chief executive Patrick Nelson says it is \"great news\" that the United Kingdom is set to host the 2035 Women's World Cup.\nEngland, Scotland, Wales and Northern Ireland submitted a joint expression of interest in March to hold the World Cup across the home nations and Fifa has now said it is the only \"valid bid\" for 2035.\nIt is understood that Windsor Park, Northern Ireland's National Stadium, will be put forward as a stadium for the tournament.\n\"We look forward to hosting games at the tournament and playing our part in what I have no doubt will be a fantastic tournament,\" said Nelson.\n\"There's still a lot of hard work to be done along with our partners in bringing it all together, however this will be a brilliant opportunity to show the world what Northern Ireland and Belfast have to offer.\"\nUnlike the men's Euro 2028 finals, Windsor Park is set to be included in the bid to host the Women's World Cup tournament.\nThe south Belfast stadium has a capacity of 18,500, which is 1500 seats shy of the Fifa's criteria to host group games and some knockout matches.\nThis is a precedent for stadiums that do not have the stated 20,000 capacity requirement to be used with three stadiums at the 2023 edition in Australia and New Zealand falling under that capacity.\nHowever, Windsor Park should be able to accommodate the increased number, with potential space for more seating behind the goal in front of the Kop stand and in each corner of the North stand.\nNorthern Ireland was included in the home nations' bid to host the men's Euro finals in 2028, and gaelic games stadium Casement Park was put forward to host matches as Windsor Park fell under the 30,000 capacity threshold.\nHowever, the redevelopment of Casement Park was delayed to the point where it eventually was pulled from the bid, which means Northern Ireland will not host matches at the Euros, but could still play a role by hosting a training base for a nation at the finals.\nThe criteria to host the Women's World Cup is smaller than the men's Euros, which means there is a more realistic chance of Northern Ireland and Belfast hosting a global tournament coming to fruition.\nWhile the number of teams to feature at the 2035 World Cup, it will be raised to 48 for the 2031 World Cup in the United States.\nThe number of automatic qualifiers, but again, the more teams in the tournament means a higher chance of qualification even if automatic spots are limited.", "url": "https://www.bbc.com/sport/football/articles/cy70d3exlgpo"}