{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:32:37", "date_modify": "2025-05-20 12:32:37", "date_publish": "2023-08-04 10:12:57", "description": "Wolves chairman Jeff Shi writes an open letter to fans saying the club's Chinese owners Fosun are committed to delivering success despite financial concerns.", "filename": "sport_football_66403405_1747744357.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/13154/production/_130646187_jeffshi.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66403405_1747744357.html", "title": "Wolves chairman Jeff Shi says Chinese owners Fosun are committed to club", "title_page": "Wolves chairman Jeff Shi says Chinese owners Fosun are committed to club - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wolverhampton Wanderers chairman Jeff Shi has written an open letter to fans saying the club's Chinese owners Fosun are committed to delivering success.\nShi wrote Fosun have no intention of selling the club, who finished 13th in the Premier League last season.\nHowever, he stressed Wolves have to be cautious with their summer spending in order to meet the Premier League's financial fair play rules.\n\"The club is a long-term project and an important one for Fosun,\" said Shi.\n\"When we were in the Championship, when we were in the pandemic, when we've faced all kinds of challenges, on or off the pitch, the owners have always done their best to support us.\n\"They also share our happiness and excitement with every achievement, or positive step we make at the club, no matter how big or small.\"\nWolves were sold to Chinese group Fosun International in 2016 when they were still in the Championship.\nAccording to FFP rules, the club needs to make a profit on player trading this summer to avoid exceeding the accumulated £105m loss over a three-year period.\nThey sold captain Ruben Neves to Saudi Arabian side Al-Hilal for a club record £47m in June and also let striker Raul Jimenez join Fulham for £5m last month.\nBut boss Julen Lopetegui has struggled to recruit new signings for his squad, with Republic of Ireland full-back Matt Doherty re-joining as a free agent in July the only notable incoming.\nIn May, Lopetegui said he was not asking for \"incredible signings\" and the Spaniard's future as manager is believed to be uncertain because of the club's financial situation.\nShi said the 56-year-old was hired \"at a very difficult moment\" but has done an \"excellent job\" and will continue to be supported.\nShi explained that Wolves were \"very comfortable on FFP\" following their return to the top-flight after a six-year absence in 2018 and before the Covid-19 pandemic because of a lower wage bill and stronger finishes in the league and Europe.\nHowever, the impact of Covid on the club's revenue and the need to continue to strengthen an ageing squad means Wolves \"must pay even closer attention to FFP and manage it well.\"\nShi also cited Wolves' spending in the January transfer window earlier this year, with six players brought in, as an unexpected factor that affected the club's budgeting.\n\"It was a very unusual winter window for us, and it literally advanced the investment room originally left for this summer,\" he added.\n\"The positive thing is that FFP is based on a rolling number, season by season, so if we do manage it well this summer, next summer we will be more free financially.\"\nWolves reached the Europa League quarter-finals during the pandemic-disrupted 2019-20 campaign but have since finished in the bottom half of the league table twice in three seasons.\n\"FFP is one of the more short-term and benign challenges we have faced,\" Shi continued. \"The club has gone through much more difficult tests in the past and will do so again in the future.\n\"However, we are still progressing every day, because we never lose; we win or we learn, as one pack.\"\nWolves face Manchester United at Old Trafford in their opening game of the new Premier League campaign on Monday, 14 August (20:00 BST).", "url": "https://www.bbc.com/sport/football/66403405"}