{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:37:34", "date_modify": "2025-05-20 12:37:34", "date_publish": "2023-08-03 21:20:57", "description": "Jann Benjaminsen's extra-time penalty sees B36 Torshavn knock Haverfordwest County out of the Europa Conference League 3-2 on aggregate.", "filename": "sport_football_66330816_1747744654.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/B634/production/_130644664_hi086673768.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66330816_1747744654.html", "title": "Europa Conference League: Haverfordwest County 1-1 B36 Torshavn aet (agg 2-3)", "title_page": "Europa Conference League: Haverfordwest County 1-1 B36 Torshavn aet (agg 2-3) - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jann Benjaminsen's extra-time penalty saw B36 Torshavn knock Haverfordwest County out of Europe.\nThe Cymru Premier side had lost 2-1 in the first leg in the Faroe Islands of their Europa Conference League tie.\nBen Fawcett squared the tie in the return leg at Cardiff City Stadium, forcing extra time.\nBut the forward was then penalised, perhaps harshly, for handball in the 100th minute and Benjaminsen coolly converted the spot kick.\nTorshavn will now play HNK Rijeka in the third qualifying round after the Croatian side's 6-1 victory over KF Dukagjini of Kosovo, winning 7-1 on aggregate.\nThe second leg had something of an edge to it after Haverfordwest County boss Tony Pennock had accused Torshavn of \"laughable\" gamesmanship during the build-up to the first game in the Faroe Islands.\nCounty went into the game hoping for a repeat of the previous round, when they overturned a 1-0 first-leg defeat against North Macedonia's Shkendija to win the second leg on penalties at the home of Cardiff City.\nThe Cymru Premier side had been boosted by the return to fitness of captain Jazz Richards, who had been rated \"touch and go\" by Pennock after being forced off in the first leg.\nThe former Wales international lined up on the right of a back three for Thursday's return, but only lasted just over half an hour before seeming to awkwardly roll his ankle and was replaced by Jack Wilson.\nTorshavn had the first meaningful effort on goal through striker Hannes Agnarsson but the ball was comfortably batted away by Zac Jones in the County goal.\nMichal Przybylski flashed a near-post header across the face of goal as the visitors continued to probe.\nHaverfordwest held firm and worked their way into the game, forcing a corner from which Kai Whitmore flashed a snap-shot over the Torshavn crossbar when the ball was half-cleared to him.\nRichards limped off soon after though and Torshavn sensed their moment, and Rhys Abbruzzese needed to head an Agnarsson piledriver off the line - the home midfielder needing treatment after being left slightly stunned.\nWith half-time approaching Martell Taylor-Crossdale should have added another goal to his first-leg strike with County's best chance of the half, only to see his header drift wide.\nHaverfordwest started the second period brightly and with Austrian referee Christian-Petru Ciochirca eager to keep play flowing, the game had a nice briskness to it.\nB36 left-back Benjaminsen sent a free-kick on target but Jones was again equal to the danger.\nJust as the visitors seemed to be content to see out the game with their first-leg goal advantage, Haverfordwest levelled the tie with a fine goal.\nTyrese Owen nodded Dan Hawkins' inswinging free-kick back across goal and Fawcett was on hand at the back post to sweep the ball into the net.\nBjarki Nielsen could have restored Torshavn's advantage but was just wide, with this time Jones looking beaten.\nWith the sides deadlocked the game entered extra time and in a cruel twist of fate it was Haverfordwest scorer Fawcett who was ruled to have handled the ball in the penalty area, allowing Benjaminsen to send Jones the wrong way from the spot.\nWhitmore almost found a second County equaliser in the second period of extra time, but Mathias Lamhauge kept out his fierce shot at full stretch to keep the Faroe Islanders' noses in front.\nHaverfordwest County manager Tony Pennock said:\n\"We knew they were panicking half way through the first half - their coach was getting louder and they were getting more animated on the pitch.\n\"They're a very good side and we knew we couldn't go our usual formation against them because they're a full-time team and they have got really good players.\n\"Compared to the first 25 minutes out there last week, we've dealt with them quite well and I can't remember Zac really making a save if I'm honest.\n\"We knew we'd have opportunities and we scared the life of them tonight.\"", "url": "https://www.bbc.com/sport/football/66330816"}