{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 08:07:57", "date_modify": "2025-04-26 08:07:57", "date_publish": "2025-02-26 13:58:58", "description": "Cheltenham Town's dramatic late fightback made a draw feel \"like a win\" against League Two leaders Walsall, says boss Michael Flynn.", "filename": "sport_football_articles_cx2xk45mkxxo_1745654877.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0aa0/live/bb4c6370-f43e-11ef-837a-fdc1fd381948.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cx2xk45mkxxo_1745654877.html", "title": "Michael Flynn: Walsall draw 'felt like a win' for Cheltenham boss", "title_page": "Michael Flynn: Walsall draw 'felt like a win' for Cheltenham boss - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Cheltenham Town's dramatic late fightback made a draw feel \"like a win\" against League Two leaders Walsall, boss Michael Flynn said.\nThe Saddlers led inside a minute and doubled their advantage late in the second half, but goals from Cheltenham substitutes George Miller and Jordan Thomas in the 90th and 93rd minutes ensured the points were split at Whaddon Road.\nIt was a \"deserved\" draw in the end for the Robins, Flynn said.\n\"I thought we went toe to toe - they're such a good, strong team, well drilled, and you can see why they're top of the league,\" he added.\n\"They've got a team that don't stop running, but so do I.\n\"We've got a very good team and a very good squad - you've seen two of the substitutes came on and scored. Liam Dulson nearly scored as well.\"\nTuesday marked the second time Cheltenham have erased a two-goal deficit in their past two home matches.\nOn his side's late efforts to pull level against his former club, who ended Tuesday seven points clear at the top of the division, Flynn added: \"It was a frantic finish.\n\"If it happened the other way round it'd feel like a loss - this one feels like a win, but at the end of the day it's a draw, one point each.\n\"I'd like to see Walsall go on now and get promoted.\"\nCheltenham sit 11th in the table after 32 matches, seven points behind - but with a game in hand on - Crewe Alexandra, who currently occupy the last play-off spot.\nThe Robins next face eighth-placed Grimsby Town on Saturday, before midweek trips to second-placed Bradford City and fourth-placed AFC Wimbledon either side of Colchester at home next weekend.\n\"We've got a horrendous run now, I'm not going to dress it up,\" Flynn said.\n\"We'll go with loads of confidence. Those are long journeys, but we'll give anybody a game.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cx2xk45mkxxo"}