{"authors": ["Matthew Henry", "www.facebook.com"], "date_download": "2025-05-21 05:54:50", "date_modify": "2025-05-21 05:54:50", "date_publish": "2025-04-02 07:08:47", "description": "Durham's 20-year-old opener Ben McKinney is being tipped for the top after an eye-catching winter - and is ready to deal with the hype.", "filename": "sport_cricket_articles_cx27511ewgxo_1747806890.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a438/live/b9b68130-0f19-11f0-acc1-239a761fa7cf.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cx27511ewgxo_1747806890.html", "title": "Ben McKinney: Durham batter happy to deal with hype after eye-catching winter", "title_page": "Ben McKinney: Durham batter happy to deal with hype after eye-catching winter - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ben McKinney has already had a brush with celebrity.\nDuring series one of Netflix's fly-on-the-wall documentary Sunderland 'Til I Die, he is shown celebrating a rare goal in a season most Black Cats supporters would rather forget.\n\"I got a message from one of my schoolmates saying they had seen me,\" McKinney tells BBC Sport.\n\"It summed the season up that it was just me and my dad because no-one else wanted to come any more.\"\nSix years on, 20-year-old McKinney looks ready start his own journey, one he hopes will have a happier ending.\nHaving made his debut for Durham aged 18 in 2023 and scored his first first-class hundred a year later, the opening batter was already seen as someone with a big future.\nScoring 110 runs from 110 balls for England Lions this winter against an Australia A side featuring six full internationals confirmed it.\n\"It was pretty surreal,\" McKinney says. \"In the moment you are just doing it off instinct.\n\"It is good, coming up against good players, to know you are worthy of playing at the standard.\"\nEngland's hierarchy have shown they are not afraid of giving inexperienced youngsters a chance and they are known to like what they see in McKinney.\nFormer spinner Graeme Swann, part of the Lions set-up with McKinney in Australia, said the left-hander could \"easily walk into Test cricket now\", comparing him to New Zealand great Stephen Fleming.\nHe is a former England Under-19 captain, stands at 6ft 7in and falls into the Bazball mould as an aggressive batter.\nIt leaves those in the know thinking McKinney could follow where Jacob Bethell, Shoaib Bashir and Josh Hull have gone before in being given an early international bow.\n\"You say it's a bit of pressure but you would rather that than no-one speaking about you, wouldn't you?\" McKinney says.\n\"Runs are your currency. I will just keep doing what I am doing and hopefully get opportunities.\"\nMcKinney's height is now seen as an advantage, giving him the ability to attack lengths others would have to leave or defend, but it was not always this way.\nA talented footballer, he played for both Durham and Sunderland's academy as a teenager, having joined the Black Cats' ranks aged \"six or seven\".\n\"I was a centre-mid but I was getting a bit too tall for it,\" he says. \"I probably would have been a centre-back by now.\n\"I was always OK but didn't really enjoy it.\"\nMcKinney committed to cricket at the age of 16 – given confidence by Durham's production line which has overseen the development of Ben Stokes, Mark Wood, Paul Collingwood and Steve Harmison among others.\n\"I remember a phone call my dad had with [Durham's academy manager] John Windows,\" McKinney says.\n\"It went something like 'we have never let a lad fail from where he is now'.\n\"That was a massive confidence boost when you are 15 or 16 years old. That tipped me over the edge. My love was always cricket.\"\nThat love was first formed at Seaham Harbour Cricket Club, where his father Neil was one of the area's leading club cricketers. McKinney Sr also spent hours throwing to his son in the nets.\n\"He was relentless and wouldn't let me leave,\" McKinney says.\n\"Sometimes that might be bad but it definitely set me up for the future. It is amazing to have someone who cares for your success and you improving.\"\nDespite the promise, there has been no contact between McKinney and the England set-up, other than what he has been able to glean from having England skipper Stokes alongside him in the Durham dressing room.\n\"How he practises is something I have never seen before,\" McKinney says. \"He is so particular and there is always purpose.\"\nThe opportunities given to McKinney are no coincidence, however.\nHe was picked to open when warm-up opposition were provided to West Indies and Sri Lanka last summer and returned scores of 22, 46 and 20.\nHe also toured Australia with England Under-19s in 2023 - another relevant point with an Ashes series to come this winter - and hit 12 fours in a 45-ball 70 in England's victory in Brisbane, hinting at a keenness to follow the Bazball mantra from the start.\n\"It's actually the opposite,\" he says. \"My dad is very old fashioned. I used to bat 50 overs for 80.\n\"I used to love batting for time but somehow that flicked a switch, probably at a good time.\n\"There was a period I was probably going too hard but trying to find that balance of soaking up pressure and putting it back on has been the most important thing for my success this winter.\"\nThose words will be likely be a soothing symphony in the ears of England fans.\nTheir faith in England's approach is wobbling at the worst possible time with only a Test against Zimbabwe from 22 May to come before five against both India and Australia over the seven months that follow.\n\"I would love to play all formats but I go back to being 10 years old and watching Alastair Cook opening the batting,\" McKinney says.\n\"I loved the way he did it. It's not the road I have gone down now but the basics behind it, I will be happy keeping him as my role model.\"\nThere are no vacancies in England's top seven but Zak Crawley's poor form, Jacob Bethell's Indian Premier League commitments and the chance for injuries means nothing can be ruled out at this stage.\nMcKinney will get six County Championship matches to push his case further before Zimbabwe arrive, starting with a trip to Nottinghamshire on Friday.", "url": "https://www.bbc.com/sport/cricket/articles/cx27511ewgxo"}