{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:13:32", "date_modify": "2025-05-19 15:13:32", "date_publish": "2015-02-27 22:31:33", "description": "Garry Monk believes Swansea's next opponents Burnley will have developed a \"siege mentality\" following the Ashley Barnes furore at Chelsea.", "filename": "sport_football_31667789_1747667612.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81299000/jpg/_81299457_gettyimages_454012270.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31667789_1747667612.html", "title": "Garry Monk: Swansea manager expects Burnley 'siege mentality'", "title_page": "Garry Monk: Swansea manager expects Burnley 'siege mentality' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Swansea's Garry Monk believes Burnley will have a \"siege mentality\" after the Ashley Barnes controversy at Chelsea.\nNemanja Matic was sent off after reacting angrily to being struck on the shin by Barnes, with Jose Mourinho describing the tackle as \"criminal.\"\nBarnes was not punished during the match and faces no FA action is set to face Swansea on Saturday.\n\"I think they will come with that siege mentality after the week they have had,\" Monk said.\n\"Everything outside, you don't worry about - you let people talk.\"\nBurnley manager Sean Dyche defended the 25-year-old and Swansea counterpart Monk admits he has sympathy for Barnes as he feels no malice was intended in the tackle.\nBut the Swansea boss believes the fall-out from the affair makes his side's task at Turf Moor on Saturday more difficult.\n\"It was the same with us last season when we were two points above the drop zone and the group unified and came together,\" Monk added.\n\"You see mistimed tackles and whether it's intentional or not, the debate goes on all the time in football.\n\"I would like to think no player goes in with intent to hurt and I don't think [Barnes] did.\n\"I don't think his intention was to do anything serious. Obviously the authorities felt the same and that's why there's no punishment.\"\nSwansea beat Burnley 1-0 at the Liberty Stadium in August and will be aiming for a second league double in as many weekends following a second win of the season against Manchester United last Saturday.\nBut Monk expects a difficult afternoon, and said: \"Burnley are very high-tempo and very intense and work extremely hard as a team.\n\"If anything they have been a bit unlucky with some of their results and might have had more points.\n\"But I am sure their result last weekend will give them a massive boost and they are in with a good chance of surviving.\"", "url": "https://www.bbc.com/sport/football/31667789"}