{"authors": ["Gary Rose", "www.facebook.com"], "date_download": "2025-04-26 06:24:29", "date_modify": "2025-04-26 06:24:29", "date_publish": "2025-02-28 23:20:53", "description": "Marco Asensio has won the Champions League three times and multiple other trophies at Real Madrid and Paris St-Germain but now he is looking to add more silverware with Aston Villa.", "filename": "sport_football_articles_c70w5q4kzkvo_1745648669.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/adac/live/ca430f30-f625-11ef-bf3c-6bef5f502c94.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c70w5q4kzkvo_1745648669.html", "title": "Marco Asensio: Former Real Madrid player shining at Aston Villa", "title_page": "Marco Asensio: Former Real Madrid player shining at Aston Villa - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "As deadline day signings go, Aston Villa's capture of Marco Asensio looks set to be among the best of them.\nThe Spain international has enjoyed a career laden with trophy victories, from multiple Champions League titles with Real Madrid to winning the French league with Paris St-Germain.\nWith his double against Cardiff in the FA Cup on Friday night - which sent Villa into the quarter-finals - he is keeping himself on course to add to silverware in England to his collection as well.\nHis impact since joining Villa on loan from PSG has been telling as his two goals took him to four in all competitions.\n\"I'm very happy with the team-mates, with the staff, they give me a lot of confidence,\" Asensio told ITV Sport.\n\"I try to do my best on the pitch and it's going well and I want to score more to give more to this team, to this club and this is my objective.\n\"We have to keep pushing, we are in the right way. Next step is Champions League and now the focus is there.\"\nEven more exciting for Villa fans is the understanding he appears to be developing with Marcus Rashford, another winter window signing after the England forward joined on loan from Manchester United.\nHe provided the assist for Asensio's opener against Cardiff, meaning all three of his assists for Villa so far have been for goals scored by the Spanish midfielder.\n\"Marcus [Rashford] is a top player,\" Asensio added.\n\"We are together not so much but I know what he wants to do, where he passes and I am very happy to have Marcus and all of the team-mates.\"\nAsensio was perhaps destined to be a footballer, with his father having named him after legendary Netherlands striker Marco van Basten.\nBut the 29-year-old has forged an impressive career in his own right.\nAfter starting out at Mallorca, he had a spell at Espanyol before joining Real Madrid, where he helped the Spanish giants with La Liga four times and the Champions League three times.\nIn total he won 17 trophies at Real, as many as a player considered one of the greatest in world football - Alfredo Di Stefano.\nAfter seven seasons at Real he made the move to French giants PSG, helping them to win a domestic treble last year.\nGiven the success he has enjoyed, joining a club not currently challenging for league titles no doubt raised an eyebrow.\nBut Unai Emery has been a long-time admirer of Asensio and played a key role in his signing.\n\"Unai has tried to get Asensio in at least three windows,\" Spanish football expert Guillem Balague told BBC Sport.\n\"He has always said to Unai he wanted to work with him and develop with him.\"\nThe clincher for Emery appears to have been the promise of playing Asensio in the number 10 position.\n\"He hasn't played there since Mallorca,\" added Balague.\n\"At Madrid he wasn't allowed, so that was the discussion he had with Unai. He was told number 10 and you can see the good consequences of it.\"\nAsensio is not the only player who is flourishing since moving to Aston Villa, with Rashford appearing to be putting behind him a difficult season at Manchester United with a strong start to life in the Midlands.\nRashford had been struggling for form at Old Trafford and found himself out of the picture under Ruben Amorim.\nBut the move to Villa and playing alongside Asensio appears to bringing him back to his best.\nSince his debut on 9 February, Rashford has created more chances in all competitions than any other Premier League player (13).\nAgainst Cardiff, Rashford created six chances for Aston Villa, equalling the most he ever created in any of his 426 matches for Manchester United (six vs Wigan in January 2024).\nHe has yet to score, although given his performances so far that will surely come sooner rather than later.\n\"Aston Villa have given him a lifeline,\" former Arsenal striker Ian Wright said on ITV Sport.\n\"It seems to have come to an end at Manchester United. He needed to rebuild his confidence, he is 27 and has to show he has a lot to give. Villa have given him a good opportunity.\n\"Things could be very exciting here at Aston Villa with this new exciting Aston Villa forward line.\"\nWith a Champions League last-16 game at Club Brugge up next, Emery believes Asensio and Rashford maintaining their form is key to Villa achieving their ambitions this season.\n\"We need [Asensio] and we need Rashford,\" he said.\n\"We need the players who joined in the last window. We need the players coming back from injury. Every player will be necessary for the matches in the next weeks and months.\n\"Now we focus on the Champions League. We are there and we have to enjoy it and compete.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c70w5q4kzkvo"}