{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:51:41", "date_modify": "2025-05-20 13:51:41", "date_publish": "2023-07-31 17:33:41", "description": "Liverpool: Virgil van Dijk announced as new club captain", "filename": "sport_articles_c1d772pj9ygo_1747749101.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/edb8/live/bf07db50-2fc5-11ee-98ed-0f9d637faba7.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c1d772pj9ygo_1747749101.html", "title": "Liverpool: Virgil van Dijk announced as new club captain", "title_page": "Liverpool: Virgil van Dijk announced as new club captain - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Liverpool have announced Virgil van Dijk as their new club captain, following the departure of former skipper Jordan Henderson.\nThe centre-back, who already wears the armband for the Netherlands, has made 222 appearances for the Reds since joining the club in January 2018.\nVan Dijk said: \"It’s a really proud day for me, for my wife, for my kids, and my family. It’s been a special feeling and I can’t really describe it at this point. But it’s something that I’m really proud of.\n\"I’m captain of Holland, that was already such a huge honour and a proud moment as well. But to also be the captain of Liverpool Football Club is something that I can’t describe at this point.\n\"It’s just something that makes me very proud and I will do everything in my power to make everyone proud and happy with me and the football club.\"\nFellow defender Trent Alexander-Arnold has also been announced as vice-captain, taking over the role from James Milner.\nVan Dijk hopes to bring a \"consistent level\" that was \"missing\" last season back when the Premier League begins.\n“It has been a very disappointing year last year,” said Van Dijk. “It was actually not a bad run-in. Obviously in the end we didn’t achieve anything we hoped to achieve and that was very disappointing.\n“Then you’re going on a very short summer holiday and you reflect on the season you’ve had, personally and as a team, and it hurts. It hurts a lot. You have pride as a human being and you feel like you could have done a lot better, you could have done a lot more consistently.\n“I think that was a big thing that was missing: the consistent level that we showed over the last couple of years was missing. And obviously everyone wants to make this right. We all feel we have to do this together again each and every day, each and every game, with the fans as well.\"", "url": "https://www.bbc.com/sport/articles/c1d772pj9ygo"}