{"authors": ["Michael Pearlman", "www.facebook.com"], "date_download": "2025-04-26 07:41:12", "date_modify": "2025-04-26 07:41:12", "date_publish": "2025-02-27 11:56:22", "description": "Cardiff City top goalscorer Callum Robinson says he is relishing his return to Villa Park.", "filename": "sport_football_articles_cm2yy3gdnzpo_1745653272.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e55b/live/9a625c70-f4ff-11ef-9808-4d9b058d1a40.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cm2yy3gdnzpo_1745653272.html", "title": "FA Cup: Aston Villa fan Callum Robinson planning upset with Cardiff City", "title_page": "FA Cup: Aston Villa fan Callum Robinson planning upset with Cardiff City - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Cardiff City top goalscorer Callum Robinson says he is relishing his return to Villa Park.\nThe Bluebirds travel to Aston Villa for the FA Cup fourth round as Robinson revisits the club who gave him his start in professional football.\nRobinson is a former youth team player at Villa who made four senior appearances for the club, including his debut in the Premier League.\n\"Now it is all about having fun and enjoying the night,\" the 30-year old told BBC Sport Wales.\nRobinson spent most of his childhood at Aston Villa and admits they are now the club he supports as he bids to dump them out of the FA Cup.\n\"I was at Villa from the age of eight all the way through to the first team. I appreciate everything they did for me to get me to where I am today,\" said Robinson.\n\"I made my Premier League debut at Villa. It will be nice going back there because it's an unbelievable stadium and it will be in the FA Cup.\n\"It's always fun and exciting to see what can happen in the cup. I wasn't a Villa fan to start with but as you grow up through the system, and get the free tickets, you end up being a fan. For me and my family we are all now Villa fans, although not on Friday night.\"\nRobinson has been integral to Cardiff climbing out of the Championship relegation zone after an unprecedented bad start to the season for the Bluebirds.\nHowever, Robinson says the cup can provide a nice distraction to Cardiff's league struggles as they are buoyed by playing at Villa Park.\n\"It's an unbelievable stadium. Sometimes you take it for granted. I was playing there in the U21s, I was on the bench there loads for the first team and played there as well,\" he added.\n\"But it isn't until you are bit older and you go around other grounds and realise how good the stadium is. It still has that old, traditional feel to it and it will be nice to get a win there on Friday. That would be amazing.\n\"It will be nice for some of the younger boys to play at a Premier League stadium. It is a proper stadium and it rocks.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cm2yy3gdnzpo"}