{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:37:03", "date_modify": "2025-05-21 05:37:03", "date_publish": "2025-04-01 07:34:32", "description": "Arsenal vs Fulham predictions: Chris Sutton on Premier League game", "filename": "sport_football_articles_cd6jq0egyyxo_1747805823.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/561d/live/fbee38e0-d1d4-11ef-87df-d575b9a434a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cd6jq0egyyxo_1747805823.html", "title": "Arsenal vs Fulham predictions: Chris Sutton on Premier League game", "title_page": "Arsenal vs Fulham predictions: Chris Sutton on Premier League game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Arsenal's title hopes may only be faint but they have still got to try to exert a bit of pressure on Liverpool.\nWin this, and they are nine points behind the leaders before Arne Slot's side play again. I want to see Liverpool pushed, and no other result will do.\nIt won't be easy for Arsenal, though - I was at the reverse fixture at Craven Cottage in December, which finished 1-1, and that was a typical Fulham performance in that they were dangerous on the counter-attack.\nThey showed that day what a capable side they are, and they have several former Arsenal players in their squad who will want to prove a point again too.\nMarco Silva's side had a disappointing defeat at home by Crystal Palace in the FA Cup on Saturday, but they actually played really well in the first half of that game.\nIt's hard to know where some teams are at form wise, coming out of the international break, and if Arsenal are not at the races then Fulham are going to cause them more problems this time.\nI actually think the Gunners will find a way to win this one, though.\nBukayo Saka's return after more than three months out will lift Emirates Stadium even if he starts the game on the bench and, if they need it, he will supply a spark whenever he gets on the pitch.\nSutton's prediction: 2-0", "url": "https://www.bbc.com/sport/football/articles/cd6jq0egyyxo"}