{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:53:59", "date_modify": "2025-05-21 05:53:59", "date_publish": "2025-04-02 07:55:04", "description": "Arsenal 2-1 Fulham reaction: Glenn Murray on 'special' Bukayo Saka", "filename": "sport_football_articles_cpdzvqyq607o_1747806839.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5f4a/live/7f54da60-0f90-11f0-b816-59c082bf45bb.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cpdzvqyq607o_1747806839.html", "title": "Arsenal 2-1 Fulham reaction: Glenn Murray on 'special' Bukayo Saka", "title_page": "Arsenal 2-1 Fulham reaction: Glenn Murray on 'special' Bukayo Saka - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Brighton striker Glen Murray says returning star Bukayo Saka brings \"something special\" to Arsenal after he scored seven minutes into his first appearance since December.\nThe Gunners beat Fulham 2-1 to maintain their slim hopes of the title.\n\"Arsenal did enough in the first half,\" Murray told the Football Daily podcast.\n\"They were fortunate to break the deadlock with [Mikel] Merino's deflected goal that nestled into the side-netting of Bernd Leno's goal.\n\"In the second half, the tempo went up a little bit in the stadium. The introduction of Saka bought a bit more quality and obviously it was written in the stars that he would be the one to score and put them 2-0 up.\n\"We think he came through unscathed, which is massive after he's been out for so long. He just brings a different energy to the team - a different dimension - and he makes the players around him better.\n\"He makes Arsenal tick. Every time he gets the ball there is an anticipation around the stadium. He knows where to be and what to do. He brings something special to Arsenal. He's one of their own and the reception he got when he came on was really special.\n\"For the last two minutes it was a little bit nervy. Arsenal though saw it out. They did enough and it keeps the title race alive.\"", "url": "https://www.bbc.com/sport/football/articles/cpdzvqyq607o"}