{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:51:33", "date_modify": "2025-05-20 14:51:33", "date_publish": "2023-07-27 15:53:44", "description": "Bournemouth: Andrei Radu in focus", "filename": "sport_articles_c1vk0ewd96po_1747752693.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/eeac/live/686efc30-2c94-11ee-b72c-5d125591510e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c1vk0ewd96po_1747752693.html", "title": "Bournemouth: Andrei Radu in focus", "title_page": "Bournemouth: Andrei Radu in focus - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Andrei Radu has joined Bournemouth on loan from Inter Milan to provide competition for Brazilian veteran Neto and Republic of Ireland international Darren Randolph.\nRadu made his senior debut for Inter as an 18-year-old at the end of the 2015-16 season and has also had loan spells with several Italian clubs; Avellino, Parma, Genoa and then Serie A club Cremonese in the first half of last season.\nHe ended last term in France with Auxerre, saving two penalties and keeping five clean sheets in his 17 appearances.\nAt international level, Radu captained Romania's Under-21 team to the semi-finals of the 2019 European Championships. During that run, Romania won 4-2 in the group stage against an England side that featured future senior internationals Mason Mount, Dominic Calvert-Lewin and James Maddison.\nHe started both of Romania's Euro 2024 qualifiers against Andorra and Belarus in March.\nBournemouth expect him to be comfortable on the ball. In a piece on their website, the Cherries said: \"According to stats website Fbref.com, Radu has only misplaced one short pass in his entire career, completing 99.6% of his attempted passes between five and 15 yards.\n\"He's shown a similar ability on passes attempted between 15 and 30 yards in length, picking out a team-mate on 98.6% of occasions.\n\"This highlights how comfortable he is with the ball at his feet and how he’ll likely be able to fit into Andoni Iraola’s system when called upon.\"", "url": "https://www.bbc.com/sport/articles/c1vk0ewd96po"}