{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:16:18", "date_modify": "2025-05-20 13:16:18", "date_publish": "2023-08-02 13:12:53", "description": "Germany are looking to avoid an early exit from the Fifa Women's World Cup, while Colombia will seek to seal first place in Group H on Thursday.", "filename": "sport_football_66384307_1747746978.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/E7D7/production/_130615395_alexandrapopp.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66384307_1747746978.html", "title": "Women's World Cup preview & predictions: Morocco v Colombia; South Korea v Germany", "title_page": "Women's World Cup preview & predictions: Morocco v Colombia; South Korea v Germany - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The group stage of the Women's World Cup concludes on Thursday as two-time champions Germany look to avoid an early exit.\nA stoppage-time strike in the last round of fixtures saw Martina Voss-Tecklenburg's side beaten by Colombia, who are top of Group H and on the brink of a place in the last 16.\nNo-one is eliminated yet from the group, with Morocco and South Korea still in with a chance to progress.\nGroup H, both matches start at 11:00 BST, BBC\nBarring a massive goal swing, Colombia will go through to the knockouts after taking maximum points from their two games so far.\nManuela Vanegas scored in the seventh added minute to stun Germany last time out, with 18-year-old Linda Caicedo having earlier netted a wonder goal. Consequently, Colombia need just a point against Morocco to be assured of top spot.\nCaicedo has undergone checks after having breathing difficulties at the tournament, but coach Nelson Abadia has stressed she is fit for the final group game.\nColombia's primary concern will be to avoid picking up extra bookings. Five players were shown a yellow card against Germany and if they pick up further bookings on Thursday then they will have to sit out the last-16 fixture.\n\"We need to be really smart,\" said Abadia. \"We need to be cautious and smart in terms of managing this. So we will really ponder what we will need to do.\"\nMorocco claimed their first Women's World Cup win by beating South Korea last time out.\nAmbitions of reaching the last-16 stage are out of their hands because they will need to better Germany's result against South Korea to snatch second place.\nGermany are boosted by the return of defender Marina Hegering to full fitness.\nHegering missed Germany's 6-0 win against Morocco and the 2-1 loss to Colombia because of an ankle injury.\n\"It means a lot to us because as soon as Marina is in training and able to perform properly, that's fantastic value for our team,\" manager Voss-Tecklenburg said.\n\"For that reason, we're happy that she's ready to play again.\"\nSouth Korea are all but out after losing their two games so far, but Voss-Tecklenburg believes they have the potential to cause Germany problems.\nThe Koreans are managed by Englishman Colin Bell, who has coached three women's club teams in Germany.\n\"This opponent is exciting for us,\" Voss-Tecklenburg said. \"They play three completely different systems so it will be interesting to see how they approach this match.\n\"Colin is a fantastic coach and he might surprise us.\"\nThe winners of Group H will face Jamaica on Tuesday, 8 August (09:00 BST), while the runners-up tackle France (12:00 BST) on the same day.\nFormer England goalkeeper Rachel Brown-Finnis' prediction for Morocco v Colombia: \"Colombia's success against South Korea in their opening game caught me out, but it was a bigger surprise when Morocco did the same too, for their first ever World Cup win.\n\"Morocco are ranked 72nd in the world while South Korea are a top-20 team, so that was a great achievement.\n\"There is a similar gulf in rankings here - Colombia are number 25, and they showed how good they are when they beat Germany in their second game. They only need a point to go through, but I think they will get all three and win 3-1.\"\nKey stat: Caicedo has scored two goals for Colombia at the Women's World Cup - the last player aged 18 or younger to score more in a single edition of the competition was Brazil's Marta in 2003 [three goals].\nBrown-Finnis' prediction for South Korea v Germany: \"This has been the group of shocks, with the latest one being Germany's last-gasp defeat by Colombia. I certainly didn't see that one coming.\n\"Even so, I still think Germany will be too strong for South Korea - who have not scored a goal or picked up a point so far - and there is only one winner here - Germany 2-0.\"\nKey stat: Alexandra Popp has already scored three goals for Germany at this World Cup - the record for most goals in a single group stage in the tournament by a German player is five, set by Heidi Mohr in the 1991 edition.", "url": "https://www.bbc.com/sport/football/66384307"}