{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:22:56", "date_modify": "2025-05-21 07:22:56", "date_publish": "2025-01-22 11:22:17", "description": "Nottingham Forest news: Fan views on Murillo contract", "filename": "sport_football_articles_cj3ejjj3z8jo_1747812176.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cj3ejjj3z8jo_1747812176.html", "title": "Nottingham Forest news: Fan views on Murillo contract", "title_page": "Nottingham Forest news: Fan views on Murillo contract - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your views on the news that Murillo had signed a new contract with the club until 2029.\nHere are some of your comments:\nKen: Murillo is the best signing of the window. The player himself has publicly said he wants to be here for the whole four years, so the only way he will leave is if Forest sell him. He's quite simply the best young centre-back in the world, and he's OURS! The deal pushes his price over £100m.\nMike: If he isn't already, Murillo will become the best player to have played for Forest since the glory days of the European Cup wins. He's that good. He'd start for any team in the world right now.\nBrian: Our transfer strategy must be to keep our best players and this is fantastic news! Keep your hands off our Murillo, he'll make you cry into your pillow, keep your hands off our Murillo, our sweet Murillo is here to stay!\nShaun: What a great bit of news. As a result of Murillo signing, either Forest fans will get the pleasure of seeing him wear the Garibaldi Red for some time, or the club are assured of getting a massive payout to and will be able to really strengthen the team.\nSteve: Fantastic news. He is incredibly talented and this vote of confidence will convince other players to stay and sign for Forest. It definitely feels like Forest are now back in the Premier League long term.\nLuke: Good news for so many reasons. Most of all, I'm pleased it shows we are going about our business the right way while creating an environment top players want to remain in. The sky feels like the limit for us at the moment.", "url": "https://www.bbc.com/sport/football/articles/cj3ejjj3z8jo"}