{"authors": ["Jonty Colman", "www.facebook.com"], "date_download": "2025-04-26 07:40:06", "date_modify": "2025-04-26 07:40:06", "date_publish": "2025-02-27 12:51:14", "description": "Vikram Banerjee is appointed managing director of The Hundred after he oversaw the sale of stakes in the teams to private investors.", "filename": "sport_cricket_articles_cly33gylp1eo_1745653206.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b48a/live/4bece210-f502-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_cricket_articles_cly33gylp1eo_1745653206.html", "title": "The Hundred: ECB appoints Vikram Banerjee as managing director", "title_page": "The Hundred: ECB appoints Vikram Banerjee as managing director - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Vikram Banerjee has been appointed managing director of The Hundred by the England and Wales Cricket Board after he oversaw the sale of stakes in the teams to private investors.\nThe new investment resulted in the combined worth of the eight Hundred teams being valued at over £950m.\nECB chief executive officer Richard Gould said: \"Vikram has led the work to attract new partners into the competition superbly, and is the perfect person to now conclude these deals and work with the teams and investors to take The Hundred to the next level over the coming years.\n\"Having been at the heart of developing the ECB's Inspiring Generations strategy for cricket, he also truly understands how The Hundred can not only grow the game but also support the whole of cricket in England and Wales.\"\nFormer Gloucestershire bowler Banerjee, 40, who was the ECB's director of business operations, will work on concluding the sales of stakes in the Hundred franchises, as well as continued growth on the competition.\nBanerjee said: \"I'm delighted to be taking on this new role, and to be able to drive the competition forward, building on the success of the competition so far and working with a new group of partners who bring such an impressive range of skills and expertise from the very best of global sport and industry.\"\nThrough sales of stakes in the franchises, a figure north of £500m raised will be shared between the ECB's 18 professional counties, Marleybone Cricket Club (MCC) and the domestic game.\nSouthern Brave and the Northern Superchargers are the two sides to have been bought out in their entirety by Indian Premier League side Delhi Capitals and the Sun Group, who own IPL side Sunrisers Hyderabad, respectively.\nLancashire sold a 70% stake of the Manchester Originals to the owners of IPL side Lucknow Super Giants for around £81m.\nThe owners of Mumbai Indians became the fourth IPL team to buy a stake in a Hundred franchise, purchasing 49% of the Oval Invincibles from Surrey for £60m.\nElsewhere, Chelsea owner Todd Boehly agreed to pay just under £40m for a 49% share in Trent Rockets.\nWarwickshire agreed a 49% sale of Birmingham Phoenix to Birmingham City owners Knighthead Capital for £40m and Glamorgan sold the same stake in Welsh Fire to IT entrepreneur Sanjay Govil for £40m.\nOf the eight sales, the most lucrative has been the £145m from a consortium led by Nikesh Arora for a 49% share of London Spirit.\nAll sales are currently in an eight-week exclusivity period and are expected to be concluded by the start of the new season.", "url": "https://www.bbc.co.uk/sport/cricket/articles/cly33gylp1eo"}