{"authors": ["Matt Lloyd", "www.facebook.com"], "date_download": "2025-05-20 14:04:44", "date_modify": "2025-05-20 14:04:44", "date_publish": "2023-07-31 02:38:18", "description": "Elinor Barker combines elite sport with motherhood but is still hungry to add another world title in Glasgow this August, a decade after claiming her first.", "filename": "sport_cycling_66314348_1747749884.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/B362/production/_130522954_gettyimages-1209700440.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cycling_66314348_1747749884.html", "title": "Elinor Barker: New mum aiming for sixth title at 2023 Cycling World Championships", "title_page": "Elinor Barker: New mum aiming for sixth title at 2023 Cycling World Championships - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It is 10 years since Elinor Barker won the first of five track cycling world titles but she insists there is still plenty more to come.\nBarker, now 28, juggles elite sport with motherhood following the birth of her first child.\nAnd she admits there are times she feels like a parent on the bike given the wealth of young talent around her.\nBut despite sleepless nights and relying on babysitters, she is eying her most successful Championships yet.\nBarker has been named by Great Britain in both the provisional track and road squads for the first ever combined Cycling World Championships, which take place on 3-13 August in Glasgow.\nHaving recovered from sickness to complete the Giro d'Italia earlier this month, Barker is in peak condition for potentially six events in Glasgow.\n\"I've never done that number before but I'd actually like to have a go at them all,\" she said.\n\"Madison is the one I really want but logistically, there's only one clash so I could go for them all. Physically I feel in good shape to play my part.\"\nBarker collected Madison and team pursuit gold at the European Championships in February before turning to the road, and is combining both disciplines with parenting one-year-old Nico.\nShe added: \"On the road team there are some riders who are only 18 or 19, so the idea of being 28 with a kid just seems so old. I'm probably a bit of a mother figure because to them, 28 could be 68.\n\"I know I'm getting old when people call me an \"experienced\" rider. But Bradley Wiggins was Olympic champion at 36, Annemiek van Vleuten has been winning big races at 39 and Geraint [Thomas] nearly won the Giro at 37. So I could reasonably only be halfway through my career.\n\"I still get nervous ahead of big races but that's because I still care. But after a few failures and knock-backs, I guess you just learn not to worry about stuff too much.\"\nAmong those young stars nipping at her cleats is 20-year-old Emma Finucane, who won four golds at this year's British Track Championships.\n\"Emma is definitely one to watch. She is so talented it's insane, and we're all very excited to see just how far she can go. Paris [2024 Olympics] is looking good for her but also LA [2028],\" said Barker.\n\"She has the drive and determination to succeed and also the ability to deal with pressure to go far. But essentially, she's just really fast. It's as simple as that.\"\nBarker admits a sixth world title of her own would be \"nice\" and while she is likely to play a support role in the road race, she now has the luxury of making long-term plans after agreeing a four-year deal with Norwegian team Uno-X Pro Cycling, including the biggest cycling event of them all - the Tour de France Femmes.\n\"That's definitely the dream. What makes it so special is that everybody understands what that event means,\" she said.\n\"The universal recognition that it is one of the biggest sporting events in the world is what sets it apart. The Vuelta and Giro are as difficult and challenging, but they're not the Tour.\"", "url": "https://www.bbc.com/sport/cycling/66314348"}