{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:22:01", "date_modify": "2025-05-21 04:22:01", "date_publish": "2025-01-23 17:57:07", "description": "Four-time Olympic champion Ben Ainslie splits from Sir Jim Ratcliffe's Ineos Britannia America's Cup sailing team.", "filename": "sport_sailing_articles_cj02m85qeveo_1747801321.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cfa2/live/d6036870-d9aa-11ef-b6cc-bbf64212e2cd.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_sailing_articles_cj02m85qeveo_1747801321.html", "title": "America's Cup: Ben Ainslie splits from Sir Jim Ratcliffe's Ineos Britannia sailing team", "title_page": "America's Cup: Ben Ainslie splits from Sir Jim Ratcliffe's Ineos Britannia sailing team - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Four-time Olympic champion Ben Ainslie has split from Sir Jim Ratcliffe's Ineos Britannia America's Cup sailing team.\nAinslie, 47, reportedly, external had a strained relationship with Manchester United co-owner Ratcliffe regarding plans for the next America's Cup which prompted them to part ways.\nAinslie was Ineos Britannia's team principal and skipper, having got the backing of Ratcliffe in 2018 in a bid to a deliver a first win for Great Britain in the yacht race since it started in 1851.\nThe team reached their first final since 1964 last year.\nBut Ineos said in a statement that they could \"not find agreement\" with Ainslie on \"terms to move forward\" after last year's event in Barcelona which was won by New Zealand.\nIneos plan to compete in the next America's Cup under the Britannia name.\nAinslie's team said in response they were \"astounded\" by Ineos' future plans for the America's Cup and it \"raises significant legal and practical obstacles for them\".\nFollowing the split, Ainslie's America's Cup team will be known as Athena Racing.\nRatcliffe did not address the split with Ainslie directly in the Ineos statement but said he was \"enormously proud\" of \"developing a British boat that was truly competitive for the first time in decades\".\nAinslie won medals at five consecutive Olympics from 1996 onwards, including gold at four consecutive Games from 2000 to 2012.\nSince winning gold at London 2012, Ainslie's goal has been to claim the America's Cup for Great Britain but all his attempts in a British boat, including those backed by Ineos, have ended in disappointment.", "url": "https://www.bbc.com/sport/sailing/articles/cj02m85qeveo"}