{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:39:41", "date_modify": "2025-05-21 06:39:41", "date_publish": "2025-02-08 00:00:00", "description": "Audi, text and in-play clip coverage of Saturday's three games with Glentoran hosting Dungannon Swifts, champions Larne taking on Crusaders and Carrick Rangers facing Coleraine.", "filename": "sport_football_live_cly7gkjqgy1t_1747809581.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cly7gkjqgy1t_1747809581.html", "title": "Irish Premiership - Sportsound build-up and text updates", "title_page": "Irish Premiership - Sportsound build-up and text updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Final whistle\nThat is all from us on a day when goals were at a premium.\nGlentoran needed a superb late goal from Danny Amos to get past Dungannon Swifts at the Oval as they cut the gap on Linfield to 17 points.\nCrusaders picked up an impressive 1-0 win away to Larne, whose hopes of retaining the Gibson Cup continue to fade.\nMeanwhile, Coleraine got back to winning ways with a narrow victory against Carrick Rangers.\nYou can read the report from those games here with reaction and highlights to follow on the BBC Sport website.\nThanks for joining us - goodnight.\n'We got that bit of luck'\nFT: Carrick Rangers 0-1 Coleraine\nColeraine assistant manager Michael O'Connor on BBC Sportsound: \"The last five or six games, we have played well and haven't got the results. You come to Carrick away, you have to roll your sleeves up, dig in and work hard and I think our players did that. I thought a scrappy goal would win it and Rhyss did that and we got that bit of luck.\"\n'Momentum continues to build for Glens'\nFT: Glentoran 1-0 Dungannon Swifts\nTiernan Lynch\nDerry City manager and former Larne boss on Radio Ulster\nThree points and a clean sheet, the momentum continues to build for Glentoran.\nI thought there was an opportunity there for Dungannon, with Glentoran not being great I thought they would have went for it. There is nothing worse when you're playing for a point and the other team scores a last-minute winner and you go home with nothing and have maybe a bit of regret.\n'Crusaders deserved the three points'\nFT: Larne 0-1 Crusaders\nDarren Murphy\nSportsound summariser\nWe can talk about how poor Larne were, but we have to give Crusaders credit for how organised they were and how well they defended. They played on the counter and played some lovely football and the substitutions made a difference. You saw a Crusaders team full of fight, full of desire and wanting to come here to get the three points and they deserved them.\nGOAL - Glentoran 1-0 Dungannon Swifts\nDaniel Amos - 90 mins\nOh my word what an absolutely stunning goal from Daniel Amos!\nJust as it looked as if both sides would be leaving with a point a piece, Amos has produced a moment of magic with an unstoppable strike in the 90th minute.\nThe ball falls to the Glentoran left-back as he rifles his first-time effort into the top corner.\nNothing Dungannon and Declan Dunne in goal can do about that one as Amos almost certainly wins it for the Glens with a 30-yard thunderbolt.", "url": "https://www.bbc.com/sport/football/live/cly7gkjqgy1t"}