{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 15:01:28", "date_modify": "2025-05-20 15:01:28", "date_publish": "2023-07-27 12:27:00", "description": "Liverpool: Jurgen Klopp's message to Jordan Henderson", "filename": "sport_articles_cd1ezxr1v4jo_1747753288.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ae92/live/92c8e0c0-2c78-11ee-8736-71d4a41d88a8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cd1ezxr1v4jo_1747753288.html", "title": "Liverpool: Jurgen Klopp's message to Jordan Henderson", "title_page": "Liverpool: Jurgen Klopp's message to Jordan Henderson - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Liverpool boss Jurgen Klopp has paid an emotional tribute to Jordan Henderson, after the announcement of the club captain's move to Al-Ettifaq.\nOn Liverpool's social media channels, Klopp - who has been with the Reds since October 2015 - said: \"Hi, skipper. We will miss you, you know that. You will miss us, I know that. But it's life, and it's not forever - it's just a goodbye. It's wishing good luck. You wished it to us and we wish it to you. We will follow you, you will follow us.\n\"I said at the beginning, when I arrived here, that life should be where we all collect together and, when we are together, we collect together stories and we make it our story.\n\"And when you look back now, I think you can't avoid a smile and I feel exactly the same.\n\"I will miss you, I will miss the talks we have. They're not always easy talks but I wish you the best of luck. You, Rebecca and the kids - I wish you the best of luck for this journey.\n\"If nobody has told you yet, I will tell you now, you are a legend. I know people say that we use that word slightly too often, but I can tell you that it's not in your case.\n\"All the best, skip. Speak soon, see you soon, and I hope you find time to come back and we can say goodbye, as a club, properly - because that's what you deserve.\n\"Thank you for everything. See you soon. Don't forget - you'll never walk alone.\"", "url": "https://www.bbc.com/sport/articles/cd1ezxr1v4jo"}