{"authors": ["Matt Gault", "www.facebook.com"], "date_download": "2025-05-20 14:07:45", "date_modify": "2025-05-20 14:07:45", "date_publish": "2023-07-30 16:09:06", "description": "Dublin edge rivals Kerry to reclaim the All-Ireland Football title with a 1-15 to 1-13 victory in a captivating final at Croke Park.", "filename": "sport_gaelic-games_66355170_1747750065.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/16F1A/production/_130587939_gettyimages-1565441252.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_gaelic-games_66355170_1747750065.html", "title": "GAA All-Ireland Football final: Dublin 1-15 Kerry 1-13 - Dubs reclaim Sam Maguire Cup", "title_page": "GAA All-Ireland Football final: Dublin 1-15 Kerry 1-13 - Dubs reclaim Sam Maguire Cup - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Dublin edged rivals Kerry to reclaim the All-Ireland Football title with a 1-15 to 1-13 victory in a captivating final at Croke Park.\nDespite a first half largely dominated by the Dubs, Paul Geaney's goal gave Kerry a one-point lead at the break.\nKerry stretched their lead to three before Paddy Small's goal brought Dublin back into it.\nClose all the way, Dublin showed their big-day experience to win by two points and deny Kerry back-to-back titles.\nIt is Dublin's first Sam Maguire triumph since they completed their six-in-a-row in 2020, while Kerry are left to reflect after failing to secure successive titles for the first time since 2007.\nAt the sound of David Gough's final whistle, the Dublin players fell to their knees as the realisation of the end of a three-year journey back to the top took over.\nThe Dublin fans roared like it was their first, while there was utter dejection from those clad in green and gold as, after a year in the sun, they were forced to watch the familiar sight of Dublin celebrations at Croke Park.\nDublin no longer have the aura of invincibility synonymous with the Jim Gavin era, but their return to the top - which has included a brief stint back down in Division Two and painful championship semi-final defeats by Mayo and Kerry - is the mark of a county whose desire to be the best remains admirably undimmed.\nIt is Dublin's 31st Sam Maguire Cup - seven short of Kerry's record haul - but significantly it is a record ninth medal for Dublin captain James McCarthy, Stephen Cluxton and Michael Fitzsimons.\nAll three of those players featured for Dublin in the 2011 final win over Kerry, the success which kickstarted the county's All-Ireland dominance, and like that game 12 years ago - which Dublin won by a point thanks to a late Cluxton score - this was a difficult final to call as Gaelic football's two most decorated counties traded blows at a raucous Croke Park.\nFor much of the first half, it looked as though all the half-time chat would focus on Dublin's dominance and brilliant defending.\nWhile the Dubs only managed six scores, they were frustrating Kerry at the other end with Michael Fitzsimons' superb man-marking job on David Clifford emblematic of an aggressive and organised blue defensive unit.\nThere were clear examples of Dublin's defensive superiority. After being set up by Paudie Clifford, it looked as though Paul Geaney was going to score a Kerry goal after just five minutes, and while his shot was going wide, Brian Howard took no chances as he swept it away from danger.\nLater in the half, in one of the rare instances of him actually shaking off Fitzsimons, David Clifford looked to have carved a goal chance of his own, but with Fitzsimons on the ground, two more Dublin defenders charged at the Kerry forward to turn the ball over.\nAt the other end, Dublin were having more joy. After Stephen Cluxton knocked over an early '45, there were fine scores from Brian Fenton and Paul Mannion (2) as well as a Cormac Costello free.\nWhen Cluxton fired over his second point, Dublin were 0-6 to 0-4 and looking on top going into half-time until David Clifford managed to create space out on the right and find Geaney with a sumptuous pass inside, the full forward keeping his composure before firing the ball to the Dublin net.\nIt was the first championship goal Cluxton had conceded since the 2019 All-Ireland final replay, and it felt like a real momentum-shifter with three Seanie O'Shea points and David Clifford's early effort from play the only scores the Kingdom managed prior to their green flag.\nWith Kerry still one up early in the second half, Con O'Callaghan thundered a shot off the crossbar for Dublin before Paudie Clifford and Geaney stretched Kerry's lead to three.\nAnd while Colm Basquel responded, a fine David Clifford effort kept Kerry three ahead before the holders gifted Dublin a way back into the game. Gavin White coughed up possession to Basquel, who found Small, the Dublin number 10's deflected effort beating Shane Ryan in the Kerry goal.\nSmall's goal levelled the game at 1-8 apiece, and while Kerry looked as though they had pulled away by reeling off an unanswered trio of scores, Dublin hit the next four to edge back in front.\nIn a gripping conclusion, Killian Spillane's brilliant score levelled the game before Small tapped over a point after a fine pass inside by substitute Jack McCaffrey.\nKerry levelled again when Sean O'Shea stroked over a free from close range after David Clifford won a free off Michael Fitzsimons having shot wide.\nBut it was Dublin who finished strongly, with Mannion capping an excellent individual performance to edge his side back ahead after Dean Rock's effort had been beaten away by Shane Ryan before Basquel picked up the pieces and fed the onrushing Mannion.\nKerry's fate was sealed when David Clifford's difficult afternoon was capped by him passing up an opportunity to level with his fourth wide of the game before Dean Rock knocked over a free in the dying seconds to confirm Dublin's return to the summit and spark jubilant scenes among those in blue at Croke Park.\nDublin: Stephen Cluxton (0-2, 1f, 1 '45); Eoin Murchan, Michael Fitzsimons, David Byrne; James McCarthy, John Small, Lee Gannon; Brian Fenton (0-2), Brian Howard (0-1); Paddy Small (1-1), Paul Mannion (0-5, 1f), Ciaran Kilkenny; Cormac Costello (0-1, 1f), Con O'Callaghan, Colm Basquel (0-2).\nSubs: Jack McCaffrey for Gannon ('49), Niall Scully for Costello ('55), Sean McMahon for Howard (63), Cian Murphy for Murchan (66), Dean Rock (0-1) for P Small (68).\nKerry: Shane Ryan; Graham O'Sullivan, Jason Foley, Tom O'Sullivan; Paul Murphy, Tadhg Morley, Gavin White; Diarmuid O'Connor, Jack Barry; Dara Moynihan, Sean O'Shea (0-5, 4f), Stephen O'Brien; Paudie Clifford (0-3), David Clifford (0-3, 1f), Paul Geaney (1-1).\nSubs: Brian O Beaglaioch for Murphy (56), Adrian Spillane for Moynihan (58), Micheal Burns for O'Brien (58), Killian Spillane (0-1) for Geaney (63), Mike Breen for Barry (67).\nReferee: David Gough (Meath)", "url": "https://www.bbc.com/sport/gaelic-games/66355170"}