{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:17:10", "date_modify": "2025-05-20 13:17:10", "date_publish": "2023-08-02 12:42:37", "description": "Rodgers will have to prove himself all over again after Postecoglou success", "filename": "sport_articles_cnk2gddx3g5o_1747747030.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ef9c/live/9fb0d9b0-3131-11ee-8f52-fbf70e4bf742.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cnk2gddx3g5o_1747747030.html", "title": "Rodgers will have to prove himself all over again after Postecoglou success", "title_page": "Rodgers will have to prove himself all over again after Postecoglou success - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Alasdair Lamont, BBC Sport Scotland\nBrendan Rodgers admitted after James Forrest’s testimonial on Tuesday he would have to prove himself as a manager all over again following his surprise return to the club. Though that may seem odd for a man who won all seven domestic trophies available in his first spell, he certainly has a lot to live up to.\nAnge Postecoglou left Celtic in a great place – a fabulous treble-winning squad, which played mesmerising football at times and earned positive comparisons even with Rodgers’ invincibles of 2016/17.\nThat squad remains largely intact – Jota and Aaron Mooy the only notable absentees – and indeed has been reinforced with the additions of Maik Nawrocki, Odin Thiago Holm, Yang, Kwon and Marco Tilio.\nThough Rodgers has dismissed notions of bringing in further players in the £15-20m bracket, the club’s finances are healthy enough to allow him to add more quality as he seeks to continue Celtic’s domestic dominance while also making a positive impact in Europe this season, with knock-out football after Christmas surely the expectation.\nRodgers held off Rangers’ challenge pretty comfortable in his first stint but with the Ibrox squad having undergone fairly major surgery over the summer, the prospect of an actual title fight is a mouth-watering one.\nThe Celtic manager was given a warm welcome on his return to Celtic Park for the 3-2 win over Athletic Bilbao but he is well aware he will have to keep delivering to win over any remaining sceptics and ensure further silverware at the end of the campaign.", "url": "https://www.bbc.com/sport/articles/cnk2gddx3g5o"}