{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:58:35", "date_modify": "2025-05-21 07:58:35", "date_publish": "2024-12-23 11:18:57", "description": "Everton 0-0 Chelsea: Hasselbain on progress of Maresca's team", "filename": "sport_football_articles_cx2nd63nv35o_1747814315.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/899a/live/c4491270-c112-11ef-a48e-dbb90985ae4b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cx2nd63nv35o_1747814315.html", "title": "Everton 0-0 Chelsea: Hasselbain on progress of Maresca's team", "title_page": "Everton 0-0 Chelsea: Hasselbain on progress of Maresca's team - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A point from their last visit to Goodison Park shows \"progression\" for Chelsea, says former Blues striker Jimmy Floyd-Hasselbaink.\nIt is a ground Chelsea have struggled at recently, winning on just two of their previous 11 visits and being outplayed in a 2-0 defeat under Mauricio Pochettino last season.\nEnzo Maresca's team missed the opportunity to move top of the Premier League for a few hours before Liverpool's win over Tottenham later on Sunday, but extended their unbeaten run to 12 matches in all competitions.\n\"Chelsea will feel how far they have come,\" Hasselbaink told BBC Radio 5 Live breakfast.\n\"To go to Everton having the expectation they will win and drawing, keeping a clean sheet and being disappointed shows that.\n\"If you analyse it at the beginning of the season and say 'this is what Chelsea are going to do' you would think there is no chance they would be where they are.\n\"In a way it is progression. Playing there in very difficult circumstances with the wind and the rain. Everton is always a difficult place to go no matter their position in the league.\n\"To keep a clean sheet - you have to score goals but nevertheless they have gone there and set out that they are not going to lose, they will leave with at least a point, and that is not a bad thing.\n\"Chelsea at the moment are feeling good and working really hard for each other.\"", "url": "https://www.bbc.com/sport/football/articles/cx2nd63nv35o"}