{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:48:46", "date_modify": "2025-05-20 13:48:46", "date_publish": "2023-07-31 11:55:49", "description": "Players and managers are warned they face tougher punishments for poor behaviour at games following the release of new rules.", "filename": "sport_football_66359526_1747748926.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/10AFD/production/_130594386_gettyimages-1244017364.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66359526_1747748926.html", "title": "Players face harsher punishments for bad behaviour under new FA rules", "title_page": "Players face harsher punishments for bad behaviour under new FA rules - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Players and managers have been warned they face tougher punishments for poor behaviour at games.\nThe new penalties are part of a charter, external introduced by football's authorities for the 2023-24 campaign.\nManagers and coaches will also have to adhere to new rules covering the technical area.\nThe new measures state players \"must not confront, invade the personal space of, or make physical contact with the match officials\".\nThey add that \"two or more players surrounding a match official in a confrontational manner will result in a yellow card and be reported to the Football Association\".\nThe new 'participant charter' has been launched by the Football Association, Premier League, English Football League, Women's Super League, Women's Championship, National League System (Steps 1-4) and referees' governing body PGMOL.\nIt was also developed in partnership with the League Managers Association and Professional Footballers' Association.\nThe new measures also address the issue of fan behaviour and, in particular, tragedy chanting, which involves singing about stadium disasters or fatal accidents involving players or supporters.\n\"Our collective approach is to reset this behaviour on the pitch and from the sidelines, whilst giving our referees the respect and protection that they deserve,\" said FA chief executive Mark Bullingham.\n\"We are also determined to address the rise in unacceptable behaviour from the stands.\"\nThe FA issued more than 20 fines to Premier League clubs last season for surrounding match officials or mass confrontations, totalling more than £1m.\nThe protocols for next season include a team's manager having to attend a pre-match briefing while \"players and team officials not listed on the team sheet must not enter the technical area\".\nIn addition, no occupants from the technical area can \"enter the pitch to confront any match official at half-time or full-time\".\nDuring the match only one person can stand at the front of the technical area and, while a second person can stand, they \"must remain very close to the technical area seating\" and \"all conversations between the two standing must happen close to the technical area seating\" as everyone else stays sitting down.\nAlso, players \"must not instigate or escalate a mass confrontation with opposing players and/or technical area occupants\".\nMatch officials are being given the power \"to take a robust approach\" and \"issue yellow and red cards where behaviour falls below expected standards\".\nIncidents are to be reported to the FA and it \"will apply stronger supplementary disciplinary action\" where necessary.\n\"We want players, managers and fans to continue showing their passion, but these new measures have been introduced to ensure that the line is not crossed when it comes to on-field and technical area behaviour,\" said Premier League chief executive Richard Masters.\nTeams at Step 7 and below of the men's game and in tier 3 and below in the women's pyramid will now face being docked points \"if their players or coaches commit repeated offences of serious misconduct\".\nThe points deductions will range from three to 12 points \"depending on the number of breaches within 12 months of the team's first offence and severity of the case(s)\".\n\"We frequently hear from grassroots participants that player behaviour is a growing issue and we're determined to change this,\" said Bullingham.\n\"Unacceptable behaviour towards other players and officials will not be tolerated.\"\nThe new charter says those who commit the \"vile form of abuse\" of tragedy chanting will \"face stadium bans and potential criminal prosecution\".\nThere will also be resources put in place \"to educate adults and children alike about the hurt tragedy chanting causes\".\nIn November 2022, the FA expressed concerns over the rise of \"abhorrent chants\" related to the Hillsborough disaster.\nA man who wore a Manchester United shirt which made an offensive reference to the Hillsborough tragedy at the FA Cup final against Manchester City in June was banned from all regulated football games in the UK for four years.\nManchester United also said it had issued an indefinite club ban to the person.\n\"We are sending a clear message that we call on so-called fans to stop this vile behaviour of a minority which has a terrible impact on the bereaved and communities,\" said deputy chief crown prosecutor and sports national lead prosecutor Douglas Mackay.\n\"If they do not then they face the risk of being excluded from the game they claim to love.\"\nManchester United and Leeds United also \"strongly condemned\" chants about historic tragedies when they met at Elland Road in February.\nFor those who engage \"in negative matchday behaviour\", a new pilot scheme will be introduced to \"inform and educate about the impact of their behaviour on others\".\nIn July, a Fulham fan was banned from football for three years after admitting a public order offence relating to homophobic chanting during the Cottagers' game against Chelsea at Stamford Bridge in February.\nThe prosecution followed a January 2022 decision by the Crown Prosecution Service to define a chant which has often been aimed at Chelsea players and supporters as a homophobic slur.\nWolves were also recently fined £100,000 by the FA for homophobic chanting by their fans in a game against Chelsea in April.", "url": "https://www.bbc.com/sport/football/66359526"}