{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:15:23", "date_modify": "2025-05-21 06:15:23", "date_publish": "2025-01-04 19:34:39", "description": "Saracens respond to a thumping Premiership defeat by Bath to hold off Bristol and end the Bears' record run of wins away from home.", "filename": "sport_rugby-union_articles_c9384n99kdno_1747808123.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e4fb/live/ef54c030-cacd-11ef-94df-33b0323b7c60.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c9384n99kdno_1747808123.html", "title": "Premiership: Saracens 35-26 Bristol", "title_page": "Premiership: Saracens 35-26 Bristol - Sarries bounce-back to end Bears' away run - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Saracens responded admirably to their thumping festive defeat by Bath as they held off a Bristol fightback to end the Bears' record run of wins away from home.\nTwo tries from Tom Willis and another from Fergus Burke helped the hosts to a 15-point lead at half-time, as Harry Randall put Bristol's only score on the board.\nLucio Cinti added Saracens' bonus point try and, while Kalaveti Ravouvou and Harry Thacker tries threatened a Bears comeback, a late second from Burke put the game to bed.\nJake Heenan scored a fourth try for Bristol with the clock in red to ensure they took a bonus point away.\nDefeat ends Bristol's remarkable run of 10 consecutive Premiership away wins that stretched back to November 2023, and means they continue to search for a first-ever victory at the StoneX Stadium.\nHeenan's fourth try means Bristol stay second in the table, a point in front of Saracens who move up to third from sixth.\nBoth sides came into the game hoping to make amends after bruising defeats, with Bristol arguably coming out the other side worst.\nTheir 38-0 loss to Sale was the Bears' heaviest home Premiership defeat in eight years but their team has continued to be battered by injuries, with winger Gabriel Ibitoye added to the growing unavailable list this week.\nSaracens' 68-10 mauling in Bath was their biggest-ever loss at the Rec and after leaving a number of big names out for that humbling, Mark McCall rang changes again with Elliot Daly, Nick Tompkins and Willis among eight brought back on what was Jamie George's 300th start for the club.\nWillis opened the scoring, picking the ball from a ruck before spinning over the line. Burke made it 14-0, collecting a blind pass from Tompkins before shrugging off a tackle to run over.\nRandall pulled a try back for Bristol, throwing a dummy to create a gap to go over, but the Bears could not take advantage when Maro Itoje was sent to the bin – his eighth yellow card in 21 games – for three infringements in succession.\nThe visitors ended the half with twice as much possession and half the number of tackles as Saracens, but having racked up seven penalties as Daly took over at the tee for a 44-metre effort to stretch the hosts' lead.\nWith Itoje back on the field, the England lock intercepted a pass, sprinted downfield and, when reinforcements gathered, Willis eventually glided over one tackle, skipped over another and ran into the corner.\nQuick hands from Willis and Harry Wilson helped put Cinti and Tompkins through in a two-on-one, for the Italian to then score Saracens' fourth.\nBristol's replacements had a positive impact to keep them in the fight, and Thacker made a break before Randall's pass out wide picked out Ravouvou to score.\nThacker rolled over the line with a try of his own, but Burke all but put the game to bed with two minutes on the clock by diving over to touch down.\nIt remains to be seen how crucial Heenan's score - to ensure Bristol did not leave empty-handed - might be come the end of the season, although replacement fly-half Harry Byrne missed the conversion on his debut that would have given them a second losing bonus point.\nBristol director of rugby Pat Lam told BBC Radio Bristol:\n\"The boys did well to get it back and get something out of the game, all the points are crucial.\n\"Sarries were a lot better than they were last week, we knew they would be, they're at home, big occasion for them and they didn't really give us too many scraps. We put them under pressure at times but the try turned over from one end to the other of the field was a bit of a body blow.\n\"At half-time we said let's keep coming at them and see what happens and to get a bonus point was pleasing.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/c9384n99kdno"}