{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:44:54", "date_modify": "2025-05-20 14:44:54", "date_publish": "2023-07-27 19:41:04", "description": "Danish champions FC Copenhagen ban fans from taking signs to matches asking for players' shirts.", "filename": "sport_football_66330290_1747752294.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/60B3/production/_130555742_pogba_shirt1_getty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66330290_1747752294.html", "title": "FC Copenhagen ban 'can I have your shirt?' signs at games", "title_page": "FC Copenhagen ban 'can I have your shirt?' signs at games - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Danish Superliga champions FC Copenhagen have banned fans from taking signs to matches asking for players' shirts.\nSupporters will not be allowed to take the signs into the club's Parken Stadium - or in the Copenhagen section at away games.\nThe club said, external they took the decision because young fans were disappointed when they did not get a shirt.\nThey also said players were being put in a \"difficult situation\".\n\"The decision stems from the fact that it is not possible for the players or the club to meet the many wishes, and we therefore disappoint a lot of children who come with the hope of getting a jersey,\" the club said.\n\"The number of signs has increased significantly over recent seasons, and unfortunately we have many children who get a bad experience from carrying a sign.\n\"At the same time, the players are put in a difficult situation because they cannot fulfil the wish and are perceived negatively because they have to say no to the many requests.\"\nThe club added that players will still be allowed give their shirts to fans.\nDutch champions Ajax Amsterdam banned such signs last year, saying they led to criticism of players, while the cardboard was a fire hazard.\nCzech side Slavia Prague also banned the signs in February, after they said organised groups were using children to ask for shirts which later appeared for sale online.", "url": "https://www.bbc.com/sport/football/66330290"}