{"authors": ["Liam McLeod", "www.facebook.com"], "date_download": "2025-04-26 03:41:03", "date_modify": "2025-04-26 03:41:03", "date_publish": "2025-03-05 09:09:01", "description": "Rangers will play a Fenerbahce side full of famous names managed by one of the game's superstars of the past two decades in the Europa League last 16.", "filename": "sport_football_articles_cz9ny2vkgvyo_1745638863.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/383f/live/8de47710-f835-11ef-a8b4-b37546a32a57.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cz9ny2vkgvyo_1745638863.html", "title": "Europa League: Jose Mourinho's Fenerbahce to take on Rangers", "title_page": "Europa League: Jose Mourinho's Fenerbahce to take on Rangers - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Jose Mourinho has one job - to turn bridesmaid Fenerbahce into the blushing star of the show.\nThe Istanbul club are a ball of frustration on the banks of the Bosphorus, a scenario illustrated perfectly by Mourinho in his short time in Turkey.\nThe 62-year-old is no stranger to courting controversy of course, but in the firepit of Istanbul football he has rubbed plenty up the wrong way with his regular tirades at the Turkish referees in particular.\nYou do not have to pour much petrol on football in this city to engulf it in flames.\nIndeed, following last week's derby stalemate with reigning champions, league leaders and bitter rivals Galatasaray, Mourinho received a four-game domestic ban - which was later halved - for his post-match comments.\nHe was not railing against Turkish officials this time though, because experienced Slovenian Slavko Vincic - who took charge of Rangers' Europa League final in 2022 - was drafted in to take charge at the request of both clubs.\nThe legendary Portuguese will however be in the dugout for their last-16 meeting against Barry Ferguson's Rangers as he continues to hunt down a sixth European trophy.\nHis first continental success would rather be forgotten by Celtic supporters, given it was he who masterminded Porto's Uefa Cup victory in the Seville sunshine in 2003 against Martin O'Neill's team.\nA year later and it was the big one for 'The Special One', as Porto defeated Monaco in Gelsenkirchen to lift the Champions League.\nIt is perhaps surprising he has only got his hands on the European Cup once more since then, when he did so with Inter Milan in 2010.\nThe 2017 Europa League was won with Manchester United and five years later Mourinho completed the set by guiding Roma to the inaugural Conference League title.\nFenerbahce are strong and have invested significantly in their bid to wrestle the Turkish title back from their neighbours.\nThey have largely been starved of success in recent times and have mostly watched Galatasaray and Besiktas win Super Lig since their last triumph 11 years ago. Even the unheralded Istanbul Baskakhsehir have won it during these barren years.\nVeterans Edin Dzeko, the club captain, Dusan Tadic and Filip Kostic - on loan from Juventus - who are 38, 36 and 32 respectively - have been lynchpins for Mourinho, with the former Manchester City striker only seven behind En-Nesyri in the goalscoring list this term despite his advancing years.\nAnother Morocco hero from that memorable run to the World Cup semi-finals in Qatar, Sofyan Amrabat, joined on loan from Fiorentina and Scotland know all about the danger of Poland's Sebastian Szymanski, who scored at Hampden during last autumn's Nations League campaign.\nOne bonus for Rangers is that former Manchester United midfielder Fred misses the first leg through suspension.\nLast season, Fenerbahce agonisingly lost out on the title by three points as a result of two draws in their final six league games.\nThey received a boost to their hopes at the weekend when Galatasaray conceded a late goal to draw with mid-table Kasimpasa while Mourinho celebrated a 3-0 win against Antalyaspor on Sunday evening.\nThey remain second but the gap has been reduced to four points.\nThe weight of expectation on Mourinho to overturn that and bring back the glory days is huge - but if he can and also add to his European haul, he could yet make himself a legend in the blue and yellow pocket of Europe's largest city.", "url": "https://www.bbc.co.uk/sport/football/articles/cz9ny2vkgvyo"}