{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:24:50", "date_modify": "2025-05-20 12:24:50", "date_publish": "2023-08-04 11:38:57", "description": "Can Tino Livramento push Kieran Trippier for starting spot?", "filename": "sport_articles_cv2nlx05kyno_1747743890.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/545f/live/2dc8a3d0-32b4-11ee-9217-27b202a39e56.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cv2nlx05kyno_1747743890.html", "title": "Can Tino Livramento push Kieran Trippier for starting spot?", "title_page": "Can Tino Livramento push Kieran Trippier for starting spot? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Nicola Pearson, BBC Sport\nNewcastle look set to sign Southampton full-back Tino Livramento for a fee in the region of £40m, but with Kieran Trippier proving integral since his arrival in January 2022, can the 20-year-old push for that starting right-back spot?\nThe former Chelsea academy player joined the Saints for £5m in the summer of 2021 and became their first choice right-back in his breakthrough campaign.\nAn anterior cruciate ligament injury curtailed his season in April 2022 and he was sidelined for a over a year before returning to first team action in May 2023.\nDespite the injury struggles of last season, the England under-21 international won a lot plaudits for his performances in the 2021-22 season - the reason Southampton have valued him so highly.\nBut 32-year-old Trippier will not be giving up his position on the right side of defence so easily after his experience proved crucial in helping the Magpies to a top four spot in his first full season back in the Premier League.\nDespite playing less minutes in his 2021-22 season (2422) compared to Trippier's 2022-23 season (4100), Livramento was still able to run the England international close in some key areas.\nWith neither man being afraid to go forward, both players scored one goal during their respective campaigns, but Trippier did provide more assists (nine) and more crosses into the penalty area (26) than Livramento, who had one assist and eight crosses into the penalty area.\nHowever, when it came to passing the ball, the Saints defender was marginally more accurate, completing 74.1% of his passes compared to Trippier's 71.6%. He was also more willing to run at the opposition with ball, attempting to take on an opponent 55 times to Trippier's 35.\nFormer Tottenham defender Trippier did show his experience in the defensive side of the game, winning more tackles (60), making more blocks (45) and more interceptions (55) than the youngster's 32, 23 and 49 respectively.\nWhile it remains to be seen whether Livramento can return to the form he showed before his injury, if he can, Trippier may have to rely on more than just his experience to keep his place on the team-sheet for the season ahead.", "url": "https://www.bbc.com/sport/articles/cv2nlx05kyno"}