{"authors": ["Adwaidh Rajan", "www.facebook.com"], "date_download": "2025-05-21 04:17:10", "date_modify": "2025-05-21 04:17:10", "date_publish": "2025-04-05 17:26:25", "description": "Though West Ham have improved since Graham Potter replaced Julen Lopetegui, their attacking unit has come under scrutiny as they headed into Saturday's meeting with Bournemouth searching for a first win in four games.", "filename": "sport_football_articles_cqx49rlenzpo_1747801030.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/bd0b/live/bef1e990-123f-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cqx49rlenzpo_1747801030.html", "title": "West Ham 2-2 Bournemouth: Hammers improve after break rescue point in Premier League", "title_page": "West Ham 2-2 Bournemouth: Hammers improve after break rescue point in Premier League - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Though West Ham have improved since Graham Potter replaced Julen Lopetegui, their attacking unit has come under scrutiny as they headed into Saturday's meeting with Bournemouth searching for a first win in four games.\nThe Hammers had failed to score in four of Potter's 10 games in charge and it looked like they were drawing another blank after 45 minutes against the Cherries.\nPotter's side had failed to get a single effort on target in an underwhelming first half and the closest they came to creating a chance was when full-back Ollie Scarles played a ball across the goal that did not have any takers in a West Ham shirt.\nPotter removed Scarles in favour of Emerson at the break but with little in the way of improvement, he made two more substitutions nine minutes later that helped the game spring into life.\nNiclas Fullkrug, who replaced Tomas Soucek, was instrumental in the 2-2 draw as he headed home West Ham's first only seven minutes after his introduction.\nIt was his first goal at London Stadium since his transfer from Borussia Dortmund last year and would be a huge fillip for the German, whose stint in England has been hampered by injuries.\nJarrod Bowen ending his goal drought on home soil will also come as a welcome sight for the Hammers, who have little to play for this season but will try to delay Liverpool's title celebrations when they visit Anfield on 13 April.", "url": "https://www.bbc.com/sport/football/articles/cqx49rlenzpo"}