{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:48:57", "date_modify": "2025-05-21 05:48:57", "date_publish": "2025-04-02 11:14:51", "description": "Chelsea news: Enzo Maresca on Cole Palmer 'rest'", "filename": "sport_football_articles_c5ylrvgk5dgo_1747806537.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/984b/live/56a777e0-0fad-11f0-9f4f-1b858dcfe51a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c5ylrvgk5dgo_1747806537.html", "title": "Chelsea news: Enzo Maresca on Cole Palmer 'rest'", "title_page": "Chelsea news: Enzo Maresca on Cole Palmer 'rest' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Chelsea boss Enzo Maresca says Cole Palmer having some days off during the international break was \"a good thing\".\nPalmer missed the trip to Arsenal through injury and pulled out of Thomas Tuchel's first England squad to focus on rest and recovery.\nTwo weeks on, Maresca confirmed in his pre-match news conference that Palmer is fit to return for Thursday's visit of rivals Tottenham.\n\"The reason why he was not with the international team was that the day before Arsenal, he had a muscle problem that was not a big issue but didn't allow him to play the Arsenal game and join his international team,\" he said.\n\"We always say that going with the international team is the best thing for a player, but overall, some days off for Cole and some rest was a good thing.\"\nNoni Madueke and Nicolas Jackson are also fit to return against Spurs, meaning Maresca will have all the trio available for the first time since the start of February.\n\"It is very good [to have them back],\" he added.\n\"We have said many times, that this is a game for the players and when they are not there for different reasons, you struggle.\n\"It's exactly what happened to us this season. We had six unbelievable months and then six or seven injuries in a row. Then we lost something. But it will be good to finish [the season] with all of them.\"", "url": "https://www.bbc.com/sport/football/articles/c5ylrvgk5dgo"}