{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:51:39", "date_modify": "2025-05-20 13:51:39", "date_publish": "2023-07-31 17:47:40", "description": "Arsenal: Would Raya be worth £40m?", "filename": "sport_articles_cgrggm5g12po_1747749099.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8ffa/live/402a0390-2f92-11ee-999b-b74dedc428d3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cgrggm5g12po_1747749099.html", "title": "Arsenal: Would Raya be worth £40m?", "title_page": "Arsenal: Would Raya be worth £40m? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Joe Bradshaw, BBC Sport\nThomas Frank says Brentford goalkeeper David Raya should only be sold for £40m, because that is what he is worth.\nBut is that correct? And would it be worth it for Arsenal?\nThe Gunners spent £30m on Aaron Ramsdale two years ago and he has become one of the leading keepers in the Premier League. At only 25, he has plenty of years left to continue his progression.\nAndre Onana’s £47.2m arrival at Manchester United was the fourth-highest amount spent on a number one – Kepa Arrizabalaga’s £72m signing for Chelsea in 2018 remains the world record.\nDespite that, the goalkeeper market has yet to fully explode and, if Raya was signed for a £40m, he would rise to fifth on that list. Is it worth it for a probable second-choice keeper who might be available for free next summer?\nLast season, Raya had a higher save percentage than Ramsdale (78% to 71%), despite facing 60 more shots in total than the Arsenal stopper.\nBrentford play a more direct game than Arsenal, but Raya’s accuracy with his feet meant his passing stats are virtually equal to the Gunners number one.\nIndeed, Raya was more involved than Ramsdale in his team’s build-up, playing nearly 500 more passes and generally playing on the edge of his box.\nBoth players are fixtures in their international squads but neither have been able to oust the current incumbent from between the posts.\nMikel Arteta may think competition between the pair would drive them to new heights. It stands to reason one of the duo’s international hopes would take a hit if they are competing with each other at club level.\nTop sides all have top keepers. Arsenal thought they had found their version in Ramsdale. Adding Raya into the mix would certainly be a luxury.", "url": "https://www.bbc.com/sport/articles/cgrggm5g12po"}