{"authors": ["Alex Turk", "www.facebook.com"], "date_download": "2025-05-21 08:02:03", "date_modify": "2025-05-21 08:02:03", "date_publish": "2025-05-19 16:10:22", "description": "Man Utd player of the season: Make your choice for 2024-25", "filename": "sport_football_articles_ckgej0178x2o_1747814523.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e0ad/live/5ed65cc0-2ca8-11f0-8f57-b7237f6a66e6.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ckgej0178x2o_1747814523.html", "title": "Man Utd player of the season: Make your choice for 2024-25", "title_page": "Man Utd player of the season: Make your choice for 2024-25 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Bruno Fernandes\nFernandes is understandably the favourite to retain his Sir Matt Busby Player of the Year trophy at the club and join David de Gea and Cristiano Ronaldo on a record four wins. He has been a level above again, and deserves better than Manchester United's current depths.\nAmad Diallo\nIf not for an unfortunate ankle injury that sidelined him for three months, Amad would dominate the player of the season ballots. The exciting Ivorian has exploded this term and committed his future to United until 2030 in January.\nNoussair Mazraoui\nMazraoui arrived as an add-on in the Matthijs de Ligt deal last summer, which has proven to be a £17m masterstroke. The Moroccan has shown commendable consistency at full-back, centre-back, wing-back and even in attacking midfield, and he undoubtedly has a role to play in Ruben Amorim's mammoth rebuild.\nHarry Maguire\nNot only has Maguire continued his renaissance at the heart of Amorim's back three, but he has also contributed multiple clutch goals. Among them were Porto (90+1), Leicester City (90+3), and, of course, Lyon (120+1) - one of the most memorable in Old Trafford's iconic history.\nPick your 2024-25 United player of the season from our shortlist here", "url": "https://www.bbc.com/sport/football/articles/ckgej0178x2o"}