{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:39:51", "date_modify": "2025-05-21 06:39:51", "date_publish": "2025-03-31 07:21:31", "description": "Saracens will rest their England players for their Champions Cup last-16 trip to Toulon on Saturday.", "filename": "sport_rugby-union_articles_cvgn37zpr4wo_1747809591.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7e63/live/184816f0-0dfd-11f0-8255-450fbdd8b6d3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cvgn37zpr4wo_1747809591.html", "title": "Saracens to rest England stars for Toulon Champions Cup trip", "title_page": "Saracens to rest England stars for Toulon Champions Cup trip - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Saracens will rest their England players for their Champions Cup last-16 trip to Toulon on Saturday.\nDirector of rugby Mark McCall says he is prioritising making the Premiership play-offs ahead of a chance at a fourth European crown.\nMcCall started Maro Itoje, Jamie George, Tom Willis and Elliot Daly in his side's 29-22 win at Leicester on Sunday, while Ben Earl was a replacement.\nItoje and Willis will complete their mandatory post-Six Nations rest period this coming week while McCall says his other England players will also be stood down for the tip to Toulon, who are third in the French Top 14.\nVictory in Toulon would set up the possibility of a trip to French league leaguers Toulouse in the quarter-finals, should they beat Sale at home.\n\"We made the decision to do this halfway through the Six Nations,\" McCall said after the win at Leicester.\n\"After we lost to Castres we got on the difficult side of the draw so we were always going to do this and those players are all off now for the next seven to 10 days.\n\"They will all miss Toulon. We don't have to do that but we will. We think it's unwise not to rest them. It's very important that they get rest.\n\"They have to do it in one of the three games after the Six Nations so we took the decision to prioritise the Premiership. Your hand is forced to some extent. We're just realistic about what's possible.\n\"A lot of the English teams have done this, it's not just us. We had our big game at Tottenham last weekend and it was essential that we had our best players playing.\n\"We will send our best available team to Toulon. We're not going to send a pack of 18-year-olds out against Toulon, we'll also give it a crack with absolutely nothing to lose.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/cvgn37zpr4wo"}