{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:22:12", "date_modify": "2025-05-21 06:22:12", "date_publish": "2025-03-31 14:39:08", "description": "Tottenham chairman Daniel Levy says the club's transfer spending must be \"sustainable\" and \"smart\" after a fall in revenue in their latest financial results.", "filename": "sport_football_articles_cz6dwwzn7vdo_1747808532.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/458e/live/f4e9f230-0e3a-11f0-bfea-d170975f1d6a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cz6dwwzn7vdo_1747808532.html", "title": "Daniel Levy: Tottenham transfer spending must be 'smart' and 'sustainable'", "title_page": "Daniel Levy: Tottenham transfer spending must be 'smart' and 'sustainable'  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tottenham chairman Daniel Levy says the club's spending in the transfer market must be \"sustainable\" and \"smart\" after their latest financial results showed a fall in revenue.\nFor the year ending June 2024, Spurs' total revenue decreased by 4% from £549.6m in the previous 12 months to £528.2m.\nOverall, Spurs saw a reduction in their losses after tax for 2024 (£26.2m) in comparison to 2023 (£86.8m)\nTottenham fans have protested against Levy and the club's owners Enic over how the club is run, including a perceived lack of investment in the playing squad.\nLevy acknowledged in notes accompanying the results that he \"often read calls for us to spend more\" as Spurs are \"ranked as the ninth richest club in the world\".\nBut he said Tottenham's \"spending must be sustainable in the long term\".\n\"We cannot spend what we do not have, and we will not compromise the financial stability of this club,\" Levy said.\n\"Recruitment remains a key focus, and we must ensure that we make smart purchases within our financial means. Our capacity to generate recurring revenues determines our spending power.\"\nThe club received more in television revenue - £165.9m last year compared to £148.1m in 2023 - but recouped just £1.3m in prize money from Uefa in 2024.\nThat was a sizable decrease in contrast to £56.2m in the previous year following participation in the Champions League.\nTottenham's operating expenses, before football trading, decreased by 7% to £453.6m (2023: £487.9m) which was attributed to \"fewer football matches and third-party events\".\nMatch receipts dropped to £105.8m from £117.6m due to nine fewer games.\nTottenham's net debt increased to £772.5m in 2024 compared to £677.4m 12 months ago.\nHowever, the club said that because the average maturity of all their borrowings is 18.6 years it will have \"limited impact\" on the their ability to invest in the playing squad.", "url": "https://www.bbc.com/sport/football/articles/cz6dwwzn7vdo"}