{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:42:53", "date_modify": "2025-04-26 06:42:53", "date_publish": "2025-03-01 18:14:49", "description": "Northern Ireland Football League competitions could be among those that would benefit from video support for match officials in the future, believes Irish Football Association chief Executive Peter Nelson.", "filename": "sport_articles_cx286jjxd87o_1745649773.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/84d1/live/cdd1d7d0-f6c0-11ef-a811-cd286d96b2f6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cx286jjxd87o_1745649773.html", "title": "Review requests could provide VAR alternative for NIFL", "title_page": "Irish League: Review requests could provide VAR alternative for NIFL - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Northern Ireland Football League (NIFL) competitions could be among those that would benefit from video support for match officials in the future, believes Irish Football Association (IFA) chief executive Patrick Nelson.\nVideo support is being trialled by Fifa and involves two review requests per match made by coaches.\nDesigned for countries where video assistant referees (VAR) would be cost prohibitive, the system was up for discussion at the annual general meeting of the International Football Association Board (IFAB) held on Saturday in Holywood, Northern Ireland.\nFormer referee Pierluigi Collina, now chairman of the Fifa referees committee, was also in attendance at the meeting where it was noted that, despite widespread implementation of VAR, not all countries can afford the required number of cameras and officials at games.\n\"I think it was pointed out by Pierluigi Collina that we now have VAR in 65 countries and more than 200 competitions, but of course that leaves many, many countries that haven't been able to invest in this,\" said Nelson.\n\"Fifa have trialled this and it has some really good potential for smaller countries and I would include Northern Ireland in that.\n\"It's different from VAR. It's only based on one, two, or three cameras and it doesn't require specialist VAR officials, it just requires a monitor operator to assist the referee.\"\nNelson said that \"in reality (VAR) would be too expensive\" to implement in Northern Ireland but noted that it is not possible to put a \"timeframe\" on when an alternative system could be implemented in the Irish Premiership.\nHe also said it would ultimately be a decision for NIFL.\n\"It's not something that we could roll out today or tomorrow, but it's something that we've watched with interest,\" added Nelson.\n\"It's something that could work given the necessary finance within the Northern Ireland Football League.\n\"We don't manage the NIFL directly so it's a decision for them, but every game in that league is covered by at least one camera, so that gives us the option at some point when we've gone a little further down the line with the testing that Fifa are heading up.\"", "url": "https://www.bbc.co.uk/sport/articles/cx286jjxd87o"}