{"authors": ["Eshlin Vedan", "www.facebook.com"], "date_download": "2025-04-26 07:37:18", "date_modify": "2025-04-26 07:37:18", "date_publish": "2025-02-27 14:30:42", "description": "South Africa Test and ODI captain Temba Bavuma says possessing the mental strength to ignore doubters has been crucial throughout his cricket career.", "filename": "sport_cricket_articles_cj4n87degyjo_1745653038.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9fdb/live/765c22a0-f452-11ef-9d52-1b1b29dc5f7f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_cricket_articles_cj4n87degyjo_1745653038.html", "title": "Temba Bavuma: South Africa captain on mental resilience and overcoming doubters", "title_page": "Temba Bavuma: South Africa captain on mental resilience and overcoming doubters - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "\"The doubters will always be there. What's important is what happens inside of you. Stay true to what your heart and mind is.\"\nFor Temba Bavuma, psychology and mental resilience have been just as important as working on technique during his rise to become South Africa's Test and One-Day International captain.\nEven after playing a leading role in reaching the World Test Championship final, where the Proteas will face Australia in June, the batter has been the subject of scathing abuse online.\nBut the 34-year-old has learnt that concentrating on his own talent, and sustaining self-belief, is far more important than paying attention to outside factors.\n\"I think you have to have almost a warped view of yourself and your ability, but also where you want to be,\" Bavuma told BBC Sport Africa.\n\"You want to live in that space as much as possible. Reality is what you make it to be.\n\"I still have the power to influence whatever my path is.\"\nThe challenges of life on tour have been well documented, with England all-rounder Ben Stokes among those choosing to take a mental health break amid a packed cricket calendar.\nHowever, Bavuma has faced extra scrutiny because he is the first black African to captain South Africa.\nTwice overlooked for lucrative contracts in the SA20, the leading domestic T20 competition, last year brought further challenges as an injury-hit season saw him omitted from the 2024 T20 World Cup, where South Africa lost in the final against India.\nThe art of journaling, a traditional reflection strategy, is one that has helped Bavuma maintain a positive and calm mindset.\n\"I'm a guy that likes to write,\" he explained.\n\"I get my pen and book out, and I start mapping out practically how I want to move forward.\n\"You readjust whatever goals you have. You start putting in plans and action to get yourself moving in a direction. Just focus on what you want to do.\"\nSince the end of Apartheid and South Africa's return to international cricket in 1991, Bavuma is the only black African batter to be selected regularly across all three formats of the game.\nBorn in Langa, a township in Cape Town, he believes some coaches \"doubted\" his ability to reach the top level because of both his race and short stature.\nStanding 5 foot 4 inches tall, the right-hander has definitively proved he can handle the extra pace and bounce of Test cricket over the course of 63 caps since making his debut in December 2014.\nMore recently, close working relationships with Test coach Shukri Conrad and Cricket South Africa (CSA) director of cricket Enoch Nkwe have aided Bavuma.\nThe batter has previously praised Conrad for validating his \"vulnerability\" after ending what was a year-long wait for an international century.\n\"I'm very grateful for the challenges that I've gone through. It's allowed me to discover and understand who I am,\" Bavuma outlined.\n\"I take a lot of pride in the mere fact that I'm still standing. I think other people would have folded.\n\"You come to understand that life throws you questions and you have to have the answers.\"\nBavuma led the way in South Africa's run to the World Test Championship final by being his team's most consistent run-scorer (among players who featured in more than two games), averaging 60.90 batting in the middle order over his seven appearances in the two-year cycle.\nHe has also been praised for his leadership, which has included cultivating a healthier environment within the team.\nWhen he was initially appointed as limited-overs captain in 2021, several off-field controversies - including allegations of racial tension within CSA - saw questions arise about the future of the sport in South Africa.\nAnd, when the runs dry up or things go wrong for the Proteas, Bavuma tends to be the one singled out for abuse on social media - with some of it appearing to be racially motivated.\n\"I'd love to understand why it becomes a lot more viral when it's just me,\" he said.\nHowever, Bavuma opts to ignore much of what is said online.\n\"For some people there's a genuineness about the game and they probably just want the team to perform at a certain level. Other people, I guess it's their insecurities.\n\"I don't think you can go and live your life out on social media. That is a facade.\n\"We've reached the Test Championship final, but there's people who are criticising us. I wouldn't go listening to everything that is said out there.\"\nWell aware of the fact that he is entering his final years in the international game, Bavuma is aiming to go out on a high.\nThat will hopefully include ending a trophy drought of 27 years for South Africa, who last year overcame their 'semi-final curse' at the T20 World Cup before falling at the final hurdle.\nThe ongoing Champions Trophy in Pakistan and the United Arab Emirates offers a chance of glory before the World Test Championship final at Lord's.\n\"We've always felt as players we were close [to winning trophies],\" he said.\n\"It's got to happen at some point. There's too much talent, ability and 'don't give up attitude' within the group.\"\nThere could also be the chance - form and fitness permitting - to captain South Africa when the country co-hosts the 2027 Cricket World Cup.\n\"My story is not done,\" Bavuma said.\n\"I'm still looking for that happy ending and I won't stop until that happens. As long as that enjoyment is there, I believe that I'll be able to overcome and persevere through whatever comes my way – the good and the bad.\n\"But there's nothing in my career that I regret.\"", "url": "https://www.bbc.co.uk/sport/cricket/articles/cj4n87degyjo"}