{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:42:54", "date_modify": "2025-05-20 14:42:54", "date_publish": "2023-07-24 17:03:19", "description": "A foul play 'Bunker' review system is one of a number of innovations set to be used during rugby's Summer Nations Series.", "filename": "sport_rugby-union_66294909_1747752174.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/31FF/production/_130499721_gettyimages-1481004751.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-union_66294909_1747752174.html", "title": "Summer Nations Series: Bunker review system and shot clock among new features at tournament", "title_page": "Summer Nations Series: Bunker review system and shot clock among new features at tournament - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A foul play 'Bunker' review system is one of a number of innovations set to be used during rugby's Summer Nations Series.\nThe series runs from the 29 July-27 August to offer warm-up games before the World Cup in September.\nThe various innovations are intended to provide \"even more support to match officials\" and help bring fans \"as close to the action as possible\".\nThey include a shot clock for kicks at goal and Hawk-Eye for replays.\nThe series has 15 games, starting with Scotland hosting Italy on 29 July, and features 13 teams.\nThey include Australia, England, Fiji, France, Georgia, Ireland, Italy, Japan, Romania, Samoa, Scotland, South Africa and Wales.\nWorld Rugby used the Television Match Official (TMO) Bunker during the recent World Rugby Under-20 Championship.\nIf, after two video replays, the on-field referee is unable to decide if an incident deserves a red card, they have the option to show a yellow card. That then gives a second TMO a chance to have a detailed look at the incident in more detail, with all angles available.\nThe \"Foul Play Review Officer\" (FPRO), situated within the TMO Bunker will have up to eight minutes to review the incident and communicate the decision to the in-play officiating team.\nThe yellow card can then be upgraded to a red card with the player not returning to the field of play. This helps avoid players being wrongly shown a red card, as England's Freddie Steward was in the Six Nations in February.\nAs well as the bunker trial, Hawk-Eye technology will \"act as the independent video replay operator, to support referees and enhances accuracy of decision making\".\nIn-game play is expected to be increased by the introduction of the shot clock which gives players 90 seconds to take a conversion, and 60 seconds to take a penalty kick. This was trialled in this year's Six Nations.\nOther innovations, such as Ref Cam and Smart Ball match data, will aim to add to the matchday experience for fans, helping to offer broadcasters access to new angles and perspectives, organisers Six Nations Rugby say.\n\"Bringing the latest technology, processes and rugby focused innovations into Six Nations Rugby competitions is a core part of helping drive the collective growth of the game,\" Julie Paterson, director of rugby at Six Nations Rugby said.\n\"The likes of the Bunker Trial and Hawk-Eye will offer even more support to match officials and the decisions they make in the heat of a live match environment. For fans, we want to bring them as close to the action as possible.\n\"Everyone in the game wants to keep developing and pushing new initiatives, and the Summer Nations Series offers a great opportunity to deliver in this area.\"", "url": "https://www.bbc.com/sport/rugby-union/66294909"}