{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:51:01", "date_modify": "2025-05-21 03:51:01", "date_publish": "2025-02-09 11:06:12", "description": "Aston Villa vs Tottenham predictions: Chris Sutton on FA Cup tie", "filename": "sport_football_articles_ckg0pjr7pk9o_1747799461.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/561d/live/fbee38e0-d1d4-11ef-87df-d575b9a434a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ckg0pjr7pk9o_1747799461.html", "title": "Aston Villa vs Tottenham predictions: Chris Sutton on FA Cup tie", "title_page": "Aston Villa vs Tottenham predictions: Chris Sutton on FA Cup tie - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The Carabao Cup semi-final defeat means the pressure going into this tie is heightened for Tottenham.\nThe way Spurs beat Brentford was more 'Ange-wall' than 'Ange-ball' but it worked, and they might need more of the same to get through here.\nIt will help Aston Villa that they don't have a midweek game before this tie and, as well as the result against Liverpool, one of the things that will affect Tottenham is fatigue and how many players they have got fit.\nWhen these two teams met in November, Spurs won 4-1, but it was a strange game and it could actually have gone either way. The same applies here.\nLike Tottenham, Villa also have a problem keeping clean sheets - they have managed only one in their past 13 games - so I think there will be goals in this tie.\nIt will be interesting to see if Villa's new loan signing, Marcus Rashford, gets one of them.\nBringing Rashford in is a gamble, but I know myself from my career how a change of scenery can reinvigorate a player.\nThis is essentially a trial for him - if he does well, they will sign him. If not, he will be going back to Manchester United.\nSutton's prediction: 2-2 after extra time, Villa to win 12-11 on penalties", "url": "https://www.bbc.com/sport/football/articles/ckg0pjr7pk9o"}