{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:15:17", "date_modify": "2025-05-21 04:15:17", "date_publish": "2025-02-01 12:24:59", "description": "New signing Morgan Whittaker says Middlesbrough is the perfect club to enable his career to flourish.", "filename": "sport_football_articles_ce8ynp1knvxo_1747800917.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d797/live/6cb2d430-e096-11ef-a007-f3ccc874f456.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ce8ynp1knvxo_1747800917.html", "title": "Morgan Whittaker says joining Middlesbrough is 'perfect' move", "title_page": "Morgan Whittaker says joining Middlesbrough is 'perfect' move  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Morgan Whittaker says Middlesbrough is the perfect next step in his career - as he gears up for his debut for the club.\nWhittaker joined the Teesside outfit for £5m from Plymouth Argyle and is eligible to play against Sunderland on Monday.\nThe 24-year-old scored 33 goals in 103 games for Argyle, making him one of the hottest properties in the Championship.\n\"I'm very clear what I want and what I need next for my career and a team like Middlesbrough is perfect for me,\" he told BBC Radio Tees.\nWhittaker is one of a raft of reinforcements for Boro this month, in a recruitment drive that also includes goalkeeper Mark Travers and defenders Ryan Giles and George Edmundson.\nBut it is the arrival of Whittaker that is the most eye-catching.\n\"With the way the team plays, the manager and where they are in the league, everything for the next step to progress to a higher level, this is the perfect place to do it,\" he said.\nWhittaker joins a forward line that already includes on-loan Liverpool player Ben Doak, Tommy Conway and attacking midfielder Finn Azaz.\nHe previously played alongside Aaz at Plymouth in a dynamic partnership and is hoping to rekindle that on Teesside.\n\"In the season when I scored 20, Finn set up most of my goals,\" he said. \"I'm hoping he can do the same here.\"", "url": "https://www.bbc.com/sport/football/articles/ce8ynp1knvxo"}