{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:57:08", "date_modify": "2025-05-21 05:57:08", "date_publish": "2025-02-09 00:00:00", "description": "Watch live coverage of the Men’s Downhill at the Alpine World Ski Championships taking place in Saalbach, Austria.", "filename": "sport_winter-sports_live_cevgwemll2mt_1747807028.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_winter-sports_live_cevgwemll2mt_1747807028.html", "title": "Alpine World Ski Championships LIVE: Watch Men’s Downhill from Saalbach, Austria", "title_page": "Alpine World Ski Championships LIVE: Watch Men’s Downhill from Saalbach, Austria - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Everything you need to know\nBBC Sport\nWhat is it?\nTaking place almost exactly a year prior to the Winter Olympics in Milan-Cortina, the Alpine Ski Championships are the perfect dress rehearsal for the world’s best skiers to showcase their talent on the slopes.\nThe championships have taken place in a variety of ski resorts all over the world since its inception 1931. This year, for its 48th edition, they’ll be hosted in Saalbach, Austria. It’s the second time the Austrian resort has held the event, last hosting the championships in 1991.\nAll races are held on the Zwölferkogel in Hinterglemm, which combines all World Cup slopes with just one finish area for all disciplines. The two racetracks are sure to test the skiers this year; with the Schneekristall and Ulli Maier slopes setting the stage for elite racing across the week. Saalbach promises to produce a vibrant, enthusiastic crowd atmosphere; with ski fanatics swarming the town from far and wide.\nThe story so far…\nAustria hold the most alpine men’s titles with 56, with last year’s Men’s Downhill Champion’s home country Switzerland in second on 35. Marco Odermatt also took the win in the Giant Slalom in Courchevel, as Canada’s James Crawford claimed the Super-G title. Norway’s Henrik Kristoffersen, France’s Alexis Pinturault and German’s Alexander Schmid won the Slalom, Alpine combined and Parallel giant slalom events respectively.\nIt's a similar story in the women’s events, with Austria leading the rankings with 42 world titles and Switzerland sitting in second on 36. In 2023, Swiss skier Jasmine Flury led the way in the Downhill, whilst Italians Bassino and Brignone took home wins in the Super-G and Alpine combined. Mikaela Shiffrin won the Giant Slalom event, Laurence St. Germain of Canada claimed the Slalom title, with Norway’s Maria Therese Tviberg winning the Parallel giant slalom title.\nWho to look out for\nEight male and six female athletes have been selected across six Alpine disciplines for the Championships for GB, making it the largest British Team selected for an Alpine World Championships in recent history. The squad marks an increase on the 12 athletes named for the 2023 Championships in Meribel-Courchevel, which at the time held the record for British representation.\nThe squad includes the full British Men’s Slalom World Cup team, consisting of: Dave Ryding, Billy Major and Laurie Taylor. They’ll line up alongside the likes of Roy Steudle, Victoria Palla and Reece Bell.\nThe remainder of the initial selection list includes: Owen Vinter, Calum Langmuir, Giselle Gorringe, Lois Jackson, Dominic Shackleton, Molly Butler, Abi Bruce and Jack Irving.", "url": "https://www.bbc.com/sport/winter-sports/live/cevgwemll2mt"}