{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:50:01", "date_modify": "2025-05-21 05:50:01", "date_publish": "2025-01-31 15:47:03", "description": "Watford boss Tom Cleverley says he prefers the weeks without midweek fixtures so he can spend more time on the training ground.", "filename": "sport_football_articles_c0k5drzerdjo_1747806601.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d30b/live/e596eb80-dfe6-11ef-9db5-61a9bc752e71.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c0k5drzerdjo_1747806601.html", "title": "Watford boss Tom Cleverley has 'enjoyed calmer week'", "title_page": "Watford boss Tom Cleverley has 'enjoyed calmer week' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Watford head coach Tom Cleverley says he prefers the weeks without midweek games so he can spend more time working with the squad on the training ground.\nThe Hornets have played a midweek game followed by another at the weekend for the past two weeks.\nSaturday's home fixture against Norwich is the first time since the 2-1 loss at Burnley on 21 December that Cleverley has had the luxury of more than five days between matches to prepare his players.\n\"I really do enjoy these Saturday to Saturday weeks where you can get some good, quality time on the training pitch with the players,\" Cleverley told BBC Three Counties Radio in his pre-match press conference.\n\"Selfishly, it's what I enjoy about the job. Obviously everyone loves matchday but actually being able to work on things you're trying to get out in the games is nice.\n\"Through the period we've had, you're sort of rest, recovery, picking the team, dealing with other stuff and then it's all about matchday. But I do enjoy these weeks where you can really focus on your job and what you love.\n\"It's a big incentive to get to the promised land because there, it's even more of that where there are eight games less, but there's a lot to be said about the league that we're in, the chaotic nature of it and how enjoyable that can be.\n\"But I've enjoyed the calmer week with some real quality time with the players.\"", "url": "https://www.bbc.com/sport/football/articles/c0k5drzerdjo"}