{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:22:17", "date_modify": "2025-04-26 06:22:17", "date_publish": "2025-03-04 00:00:00", "description": "Lincoln earn only their second home League One win in 2025.", "filename": "sport_football_live_c4geev9yze5t_1745648537.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b389/live/1b5795b0-f5e7-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_c4geev9yze5t_1745648537.html", "title": "Lincoln City 4-1 Crawley Town", "title_page": "Lincoln City 4-1 Crawley Town - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Lincoln earned only their second home League One win in 2025, beating Crawley to ease the pressure on under-fire head coach Michael Skubala, while also leaving their opponents deep in relegation trouble.\nThe Imps bounced back from conceding an early Kamari Doyle goal to lead 3-1 at the break, with Dom Jefferies providing the assists for James Collins and Jovon Makama, before Jefferies himself added the third. And Joe Gardner's first goal for the club late on wrapped up a convincing victory.\nCrawley took the lead inside six minutes. Charlie Barker was played in down the right and he drove in a cross that was palmed out by George Wickens straight to the unmarked Doyle, who slammed the ball into the net from six yards.\nCity's Tendayi Darikwa nearly levelled five minutes later, but his fierce shot hit the bar and bounced down to safety.\nThree minutes later, though, parity was restored. Jefferies' shot was saved by Jonjo Wollacott but the ball came back to the Lincoln man who crossed for Collins to head home.\nThe hosts took the lead in the 25th minute. Jefferies again was the creator, crossing for Makama – whose header was pushed onto a post by Wollacott. However, the ball bounced back to Makama who prodded it in.\nMakama then turned provider, crossing for Jefferies, who finished with aplomb.\nThe second half struggled to get going, with home sub Bailey Cadamarteri bringing a save out of Wollacott late on.\nAnd fellow replacement Gardner broke clear in the 88th minute to drive home a shot into the bottom corner to seal a valuable win.", "url": "https://www.bbc.co.uk/sport/football/live/c4geev9yze5t"}