{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:16:22", "date_modify": "2025-05-21 05:16:22", "date_publish": "2025-04-03 17:20:16", "description": "Hull City boss Ruben Selles says the Championship relegation battle is \"in their hands\".", "filename": "sport_football_articles_cn4w29lvyx3o_1747804582.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/17f2/live/a0a25d60-10ac-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cn4w29lvyx3o_1747804582.html", "title": "Hull City control own future says boss Ruben Selles", "title_page": "Hull City control own future says boss Ruben Selles - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Hull City boss Ruben Selles says the relegation battle is \"in their hands\" despite fellow strugglers Luton Town and Derby County both beginning to find form.\nLuton are unbeaten in three league games (W2 D1), whilst Derby have four straight wins.\nThe Tigers, on the other hand, saw their undefeated run of four games (W2 D2) come to an end with a loss to the Hatters last time out.\n\"We always say that we don't need to have an eye on the other ones, we need to do our jobs. Obviously when we don't win our game, it becomes more speculation about what the others do and the other ones are winning,\" Selles told BBC Radio Humberside.\n\"Luton beat us. Derby have won four in a row, which is unbelievable for a team in that place.\n\"We are still in the position where we control our own future and that's the mentality we need to keep working with. Again, we are in the same position where it depends on us.\"\nHowever, with Hull only one point above the drop zone and a difficult trip to Sheffield Wednesday on Saturday, the Spaniard is determined not to get caught up in outside noise.\n\"Everything is relative. It's not the pressure,\" Selles added. \"If we had won the last couple of matches, we'd be in a different situation.\n\"We know we've been competitive every single game and we need to keep trying to be that competitive, and try to keep pushing forward and try to not speculate.\"", "url": "https://www.bbc.com/sport/football/articles/cn4w29lvyx3o"}