{"authors": ["Odhran Crumley", "www.facebook.com"], "date_download": "2025-05-21 04:33:30", "date_modify": "2025-05-21 04:33:30", "date_publish": "2025-04-04 21:01:21", "description": "Derry City overturn a first half deficit to come from behind and beat Cork City 2-1 at Brandywell in the Irish Premier Division.", "filename": "sport_football_articles_crm3nlj8grpo_1747802010.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/27aa/live/81d28730-1196-11f0-9c0d-3d00dc5c90d6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_crm3nlj8grpo_1747802010.html", "title": "Derry City: Candystripes come from behind to beat Cork at Brandywell", "title_page": "Derry City: Candystripes come from behind to beat Cork at Brandywell  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Derry City came from behind to beat Cork City 2-1 and claim their third win of the Premier Division season.\nSecond half strikes from Michael Duffy and Ronan Boyce were enough to give the Candystripes victory at Brandywell after Kitt Nelson had headed the visitors in front.\nTiernan Lynch's side move up to sixth in the table and are now four points behind unlikely leaders Drogheda United after eight games whilst Cork fall to ninth position and are just three points above bottom side Sligo Rovers.\nDerry are back at the Brandywell on Friday, 11 April as Drogheda come to town.\nCork took an unlikely lead on 14 minutes as Brian Maher seemed to misjudge Benny Couto's cross allowing Nelson, who was unmarked at the back post, to head into the empty net.\nThe Candystripes would trail 1-0 at the break as Sean Patton was twice denied in quick succession by Tienn Troust in the Cork goal while Kevin Holt came close with a header.\nDerry hosted fans in their new North Stand for the first time tonight and they were treated to a front row seat for all of the action in the second half.\nCork failed to clear a home corner allowing Boyce to fire in the equaliser from an acrobatic bicycle kick on 65 minutes.\nLess than 10 minutes later Duffy found a yard of space in the box and sent a powerful effort through the legs of Troust to seal a much needed three points for his side.\nThat was Duffy's fifth goal of the season and with Derry only scoring seven so far, his goals have directly contributed to 10 of his side's 11 points so far this season.", "url": "https://www.bbc.com/sport/football/articles/crm3nlj8grpo"}