{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:29:02", "date_modify": "2025-05-21 06:29:02", "date_publish": "2025-01-22 18:07:05", "description": "Southampton news: Fan views on the one thing going under the radar", "filename": "sport_football_articles_c247n0jgljyo_1747808942.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c247n0jgljyo_1747808942.html", "title": "Southampton news: Fan views on the one thing going under the radar", "title_page": "Southampton news: Fan views on the one thing going under the radar - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for you what one thing - good or bad - that nobody is talking about at Southampton but should be.\nHere are some of your comments:\nJoel: Unfortunately, when it was decided Southampton would become a selling club, developing young talent and moving them on for generous fees, no-one had the foresight to recognise a point in time that the conveyor belt may slow up, with the talent pool running dry. Southampton then had to look to lower European leagues for hidden gems. The new directorate are following that same model and you only have to look at the past two seasons to recognise that the strategy has left us completely underprepared for the Premier League. The club needs a new culture and operating model that will retain talent and give the club a platform to build on.\nMark: Next season. This squad will need breaking up - it's shot to pieces confidence wise. We need to return to our historical roots. Homegrown hungry talent and a better recruitment team scouring Europe's lesser leagues. It's going to be a long process to repair the damage of the past few years.\nSimon: I think we should acknowledge how many good young players (22 and under) that we have at Southampton. Those who are either currently playing in the Premier League or out on loan can form the basis of a good team going forward.\nJack: I think our biggest problem all season hasn't been the ability of the squad, which is limited, but our collective inability to see out matches. Multiple times this season we've looked decent in the first half and gone into the break 0-0, only to collapse in the second half. I'm not sure you can buy mental resilience in the transfer market!\nAnthony: There are four games, out of the fixtures left, where on current form we may be able to get maximum points. That would get us to 18 points. Still terrible but would beat Derby's sad point tally. I think however that we are cursed this season so I am not holding out too much hope.", "url": "https://www.bbc.com/sport/football/articles/c247n0jgljyo"}