{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:26:25", "date_modify": "2025-05-20 12:26:25", "date_publish": "2023-08-04 11:24:39", "description": "Cornish Pirates chairman Paul Durkin expects a new structure for English club rugby with a Premiership One and Premiership Two.", "filename": "sport_rugby-union_66405243_1747743985.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/B5F8/production/_130648564__-1257.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-union_66405243_1747743985.html", "title": "Two-tier Premiership predicted by Cornish Pirates chairman", "title_page": "Two-tier Premiership predicted by Cornish Pirates chairman - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The chairman of Cornish Pirates, Paul Durkin, says he expects a new structure for English club rugby with a Premiership One and Premiership Two.\nThe top flight has been reduced to 10 teams for this season after Wasps, Worcester and London Irish went bust.\nAll 22 Premiership and Championship sides will compete in the Premiership Rugby Cup this season.\nThe bottom side in the Premiership will also face the Championship winner in a two-legged play-off for promotion.\nBut should the Championship side win the play-off, their ground would have to meet the league's minimum standards, something which has stopped Ealing and Jersey Reds from going up in the last two seasons.\nIt comes as the Pirates start work on a new ground in Truro, which will initially be a 3,000 capacity and shared with Truro City - with the aim of opening in 12 months time for the National League South side before the Pirates leave their Mennaye Field home in Penzance at a later date.\n\"What we don't know is, and this is why I can't say for definite when we might move, is what the minimum criteria might be for what we're talking about as being Prem One and Prem Two,\" Durkin told BBC Radio Cornwall.\n\"Prem One will be the Premiership, so it's 10,000, we know that, and to be honest to try and put the millions in that are required to get that - and there's no guarantee you're going to be there - doesn't make financial sense.\n\"We don't know what the criteria are going to be for Prem Two, but what I do know so far, and this is what they're talking about, we won't know until the end of this calendar year, that's what the plan is, is that it will not be Championship.\n\"The Championship clubs will be asked to have an expression of interest that they want to join Prem Two.\n\"Would they make it 5,000? They might, in which case you've got to look to see how do we get to that in the timeframes that would be required.\n\"Or would they have it at something like 3,000 or 3,500, with a couple of years to build it up, which I think if they have any sense is what they'll go for.\"\nBut whatever decision is made on the future of rugby outside of the top flight in England, funding is a major issue.\nSecond-tier sides have seen the money they get from the Rugby Football Union reduced from £650,000 to £150,000.\nDurkin says a club like Cornish Pirates needs to be fully professional in the second tier as there are not the jobs around that would sustain a semi-professional side unlike places such as London.\n\"The elephant in the room will be funding, let's be very honest about that,\" added Durkin.\n\"The RFU took £500,000 per club away per annum and it was a big, big hit.\n\"How do you make Premiership Two much more sustainable that it can be a professional league, that's what it comes down to.\n\"They want it to be a professional league, well then the reality is they have to fund that because Championship clubs as they are at the minute couldn't afford to do that continuously.\"\nBut Durkin says that until a future for professional rugby is mapped out by the bodies in charge, clubs like Cornish Pirates are left in a state of limbo.\n\"How do you plan for the second season? If you want to try and put players onto two or three-year contracts you don't even know where you're going to be in two years time,\" he added.\n\"Players have got to look after themselves, they've got a finite career, they need to do that, and they do it with our blessing because they've been great for us.\n\"But that's the uncertainty. It would be lovely to say 'you're here for two years or three years', but we just don't know.\"", "url": "https://www.bbc.com/sport/rugby-union/66405243"}