{"authors": ["Jude McCann", "www.facebook.com"], "date_download": "2025-05-21 03:38:03", "date_modify": "2025-05-21 03:38:03", "date_publish": "2025-02-01 08:34:41", "description": "BBC Sport NI introduces you to the seven Irish fighters set to take the stage at the Ulster Hall for Saturday's Nations Fight Night.", "filename": "sport_boxing_articles_cz7eln43dlwo_1747798683.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9ca0/live/20ce59a0-e004-11ef-a819-277e390a7a08.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_boxing_articles_cz7eln43dlwo_1747798683.html", "title": "BBC Nations Fight Night: Meet the crop of Irish fighters in the Nations Fight Night", "title_page": "BBC Nations Fight Night: Meet the crop of Irish fighters in the Nations Fight Night - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Nations Fight Night\nVenue: Ulster Hall Date: Saturday, 1 February Live from: 18:00 GMT\nCoverage: Watch live on the BBC iPlayer and BBC Sport website from 18:30 GMT and on BBC Two Northern Ireland from 21:00 GMT.\nWith weigh-ins complete, all roads now lead to the battle on Bedford Street with the Nations Fight Night at the Ulster Hall.\nOn Saturday, tenacious talent collides under the unforgiving lights, where only the strongest will take the next step. The stakes could not be higher.\nThe first bell is fast approaching. The stage is set. The next chapter in Ulster Hall's illustrious boxing legacy begins now.\nCould one of these high-fliers be the next to carve their name into boxing history?\nBBC Sport NI introduces you to the seven local fighters set to take the stage at an iconic venue.\nAge: 25 Weight: Featherweight Opponent: Kasimu Hamad Haji Record: 13-0-0\nTopping the bill at the Ulster Hall is Colm 'Posh Boy' Murphy. The south Belfast born boxer will defend his Commonwealth Silver featherweight title which he won against Jack Turner at the SSE Arena last summer.\nWeighing in at 8st 9lb, Murphy says he isn't one to pinpoint a winning round, but believes that after a few rounds warming up, he'll be out to get Haji.\n\"I'm going to wear my heart on my sleeve and put in a performance I've been building up to for the last two months of sacrifice and do my city proud,\" he told BBC Sport NI.\nAge: 28 Weight: Super-featherweight Opponent: Nathan Howells Record: 11-0-0\nJohn 'The Kid' Cooney faces Newport's Nathan Howells at the Ulster Hall in the co-main event. Cooney defends his Celtic super-featherweight title, with the loser of the contest also being ruled out for the British title.\n\"I'm just looking forward to it. This is the platform you want to be on. You want to be on the TV, in front of the thousands of people and express yourself and enjoy it.\"\nSpeaking on the atmosphere, Cooney added: \"I'm really looking forward to fighting in that small hall, but at the end of the day I'm focused as well. The outside doesn't make too much noise to me.\"\nAge: 29 Weight: Super-featherweight Opponent: Brayan Mairena Record: 2-0-0\nBorn in East Timor, Cookstown's Teo Alin faces Brayan Mairena in his third career fight. Alin comes into this fight after a 40-36 points win over experienced journeyman Joshua Ocampo.\nAlin believes the fans should expect a really good performance with \"a bit of everything in it\".\n\"I just deal with what's in front of me. If the knockout comes it comes, but the fans are guaranteed a performance,\" he added.\nAge: 20 Weight: Lightweight Opponent: Karl Sampson Record: 1-0-0\nDungannon's Charles 'The Dream' McDonagh makes his debut at home after his first professional victory over Nestor Maradiaga in Glasgow.\nLooking ahead to his fight against Karl Sampson, McDonagh expects \"an exciting and nasty performance\".\n\"I'm happy to bank four rounds, or if it ends in the first round, whatever happens, happens. I just want to go in and enjoy it,\" he continued.", "url": "https://www.bbc.com/sport/boxing/articles/cz7eln43dlwo"}