{"authors": ["Emma Smith", "www.facebook.com"], "date_download": "2025-05-21 04:05:06", "date_modify": "2025-05-21 04:05:06", "date_publish": "2025-01-23 21:29:00", "description": "Tottenham striker Dominic Solanke is set to be out for \"around six weeks\" with a knee injury, says head coach Ange Postecoglou, as the club's injury crisis deepens.", "filename": "sport_football_articles_ckgxln82zx5o_1747800306.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/440a/live/baf8a610-d9cf-11ef-a37f-eba91255dc3d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ckgxln82zx5o_1747800306.html", "title": "Dominic Solanke: Spurs injury crisis deepens with striker out for 'around six weeks'", "title_page": "Dominic Solanke: Spurs injury crisis deepens with striker out for 'around six weeks' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tottenham striker Dominic Solanke is set to be out for \"around six weeks\" with a knee injury, says head coach Ange Postecoglou, as the club's injury crisis deepens.\nSolanke was one of 14 senior players absent from Spurs' 3-2 win at Hoffenheim in the Europa League on Thursday.\nAnd afterwards, Postecoglou said he expected Solanke to be out until early March, meaning he will miss their Carabao Cup semi-final second leg meeting with Liverpool as well as several Premier League games.\n\"With Dom [Solanke], the information now is around the six-week mark with him,\" Postecoglou said.\n\"No surgery but we're looking around six weeks. It might be quicker but we'll see.\"\nSolanke joins a lengthy injury list that includes fellow forwards Timo Werner and Brennan Johnson.\nWhile some players, such as Yves Bissouma, Pape Sarr and Cristian Romero, are close to a return, others are long-term absentees, including first-choice keeper Guglielmo Vicario.\nSpurs have been left shorthanded by their injury troubles. Against Hoffenheim, Postecoglou could only name eight substitutes, including two goalkeepers and five teenagers.\nAll three of the players to come off the bench against Hoffenheim were 19 or younger, including 17-year-old debutant Callum Olusesi.\n\"These guys are giving everything they can. It should not be dismissed that I had five teenagers [on the pitch],\" Postecoglou said.\n\"We are a Premier League outfit playing in an away game in Europe and we had five teenagers out there. It is pretty much unheard of in an important game, not a dead rubber. And that goes to show the load these guys are willing to take on themselves, without making excuses.\n\"I could not speak highly enough of the players carrying us through. They will get some help hopefully soon with some players coming back. We are in a real good position in Europe.\"\nSpurs are now fourth in the Europa League table, and will qualify as one of the eight sides to go straight into the knockout phase if they beat Elfsborg on matchday eight.\nTheir progress in the cups is in stark contrast to their league form. In the Premier League, they have won one of their past 10 matches and have fallen to 15th, eight points above the relegation zone.", "url": "https://www.bbc.com/sport/football/articles/ckgxln82zx5o"}