{"authors": ["Phil Harlow", "www.facebook.com"], "date_download": "2025-05-19 15:15:40", "date_modify": "2025-05-19 15:15:40", "date_publish": "2015-02-19 09:53:53", "description": "Played 24, lost 24. BBC Sport looks at London Welsh's nightmare season and how players cope with the pressure of a losing run.", "filename": "sport_rugby-union_30837106_1747667740.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81069000/jpg/_81069734_462982064.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_rugby-union_30837106_1747667740.html", "title": "London Welsh: The Premiership side that forgot how to win", "title_page": "London Welsh: The Premiership side that forgot how to win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Having a bad day at work? Spare a thought for London Welsh.\nIt's freezing mid-February and the Exiles are still seeking their first win of a season which began in the late summer warmth of September.\nBottom of the table and with 24 defeats from 24 matches in all competitions, London Welsh are on course - statistically speaking - to go down as the worst team in Premiership history.\n\"When you've lost the number of games we have, and it's not through a lack of effort, the reality is that we aren't good enough,\" assistant coach Ollie Smith, a former Premiership and Heineken Cup winner with Leicester, told BBC Radio Oxford.\n\"If we were, we'd have won a game or been a lot closer in several more. You can't beat around the bush on that.\"\nProfessional sport is an unforgiving environment. An athlete or team's value to the outside world frequently boils down to the answer to a simple question: did they win?\nWhen the answer, week-in, week-out, is 'No' then it becomes easy to dismiss the Exiles as simply rubbish or not up to it.\nBut even in professional sport there is nuance to be found.\nThe club, who only sealed promotion via the play-offs in early June last year, are currently pursuing their complaints about the way, they say, the odds are stacked firmly against them.\nForced to pull together a squad to compete with established superpowers at three months' notice, with a funding gap understood to be in the region of £2m, as well as funding their rivals to run academies, London Welsh are not happy with the current arrangement.\n\"The results haven't been good enough but there are far bigger questions around the structure of English rugby.\n\"London Welsh get about £2m less than other clubs in funding, while the play-offs finish in June, so if you get promoted against the odds then you have to build a squad in a few months.\n\"Rugby's becoming more professional by the day and there's a real chasm between the Premiership and the Championship. London Welsh are ill-equipped for Premiership rugby - and it's not necessarily their fault.\"\n\"Our results have highlighted the ludicrous difference in the funding we're missing out on,\" said head coach Justin Burnell.\n\"People assume we would spend it all on players but we want to look at the recovery aspect, training facilities and so on.\n\"It's something that needs to be addressed. The board have rightly got stuck into it because we are at a massive disadvantage.\"\nBut whatever the reasons for their record, it is very easy to forget the players and coaches on the end of defeat after defeat are elite sportsmen whose struggles are being played out in public.\n\"It has been painful and I can certainly say that losing doesn't get any easier,\" club captain Matt Corker told BBC Sport.\n\"I've never had anything like this in my career. But what I am proud of is how positive we've been able to stay. It's easy to shout and scream at each other but that's not what we've chosen to do.\n\"Something I learned early in my career was that when you're at the club you work as hard as you can, but when you go home it's important you rest your body but also your mind. It's easier said than done and there are things that rattle round in your mind.\n\"You have to come in on a Monday morning with a smile on your face and there has been times when that's not too easy but you make that choice not to be a negative influence. We're not rolling over.\"\nOne man who can truly empathise with the Exiles' plight is Mike Schmid, who coached Rotherham when they went through the 2003-04 Premiership season without a win., external\n\"Pressure brings out the worst or the best in people's characters,\" Schmid, who is now chief executive at Esher Rugby Club, told BBC Sport.\nThe current squad, including 25 new arrivals in a summer trolley dash, may lack that level of stardust but still feature ex-internationals like Piri Weepu and Olly Barkley.\nAnd so chairman Bleddyn Phillips says the club - who play home matches at Oxford United's Kassam Stadium - now face a huge decision about the way forward.\n\"Do we play at Old Deer Park as a social club that finds its own level, maybe at semi-pro or amateur standard, or are we a club with aspirations to play in the top tier of English rugby?\" said Phillips, speaking on BBC Radio 5 live.\nFor Corker, though, discussions over funding or the future direction of the club are secondary to the job in hand - winning a match this season.\n\"We have to focus on what we do which is bringing 100% and not worry about rugby politics,\" he added.\n\"As soon as you start making excuses it's a very dangerous road to go down. It's fine margins and it might sound silly with some of the scorelines we've had but every match has pivotal moments that we need to control.\n\"If we can do that then we can exert pressure on other teams so yes, I definitely think we will win.\"", "url": "https://www.bbc.com/sport/rugby-union/30837106"}