{"authors": ["Sean Kearns", "Dan Roan", "www.facebook.com"], "date_download": "2025-05-21 04:40:44", "date_modify": "2025-05-21 04:40:44", "date_publish": "2025-04-03 09:06:10", "description": "The UK is set to host the 2035 Women's World Cup as the sole \"valid\" bidder for the tournament, Fifa president Gianni Infantino says.", "filename": "sport_football_articles_c9venlzl7kjo_1747802444.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7300/live/9e1975f0-1067-11f0-93d7-a3dd8019c0be.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c9venlzl7kjo_1747802444.html", "title": "UK set to host 2035 Women's World Cup after submitting only 'valid' bid", "title_page": "UK set to host 2035 Women's World Cup after submitting only 'valid' bid - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The United Kingdom is set to host the 2035 Women's World Cup as the sole \"valid\" bidder for the tournament, Fifa president Gianni Infantino says.\nEngland, Scotland, Wales and Northern Ireland submitted a joint expression of interest in March to hold the World Cup across the home nations.\nUnder Fifa rotation rules, the tournament must be in Europe or Africa.\nSpain's federation president Rafael Louzan said last week that they were \"working on\" a joint bid alongside Portugal and Morocco.\nHowever, the deadline for expressions of interest passed on Monday and Infantino says the UK's bid is the only one received for 2035, while the United States are set to host the 2031 edition.\n\"Today I can confirm as part of the bidding process that we received one bid for 2031 and one valid bid for 2035,\" Infantino said at a Uefa congress in Belgrade.\n\"The 2031 bid is the United States of America and potentially some other Concacaf members and the 2035 bid is from Europe and the home nations.\n\"So the path is there for the Women's World Cup in 2031 and 2035 to take place in some great nations and further boost the women's football movement.\"\nFA chief executive Mark Bullingham said: \"We are honoured to be the sole bidder for the Fifa Women's World Cup 2035. The hard work starts now to put together the best possible bid by the end of the year.\"\nScottish FA chief executive Ian Maxwell said: \"We look forward to working together to finalise our proposal and lay the foundations for a tournament that will excite football fans around the world and inspire girls and women across Scotland.\"\nPatrick Nelson, chief executive of the Irish FA, said: \"There's still a lot of hard work to be done along with our partners in bringing it all together, however this will be a brilliant opportunity to show the world what Northern Ireland and Belfast have to offer.\"\nNoel Mooney, chief executive of the Welsh FA, said: \"With our first ever participation in a Women's Euro's coming up this summer and the hosting of major women's finals coming to Cymru [Wales], we are on an incredible journey so we must make the most of this to inspire the next generation of players, volunteers and supporters.\"\nEngland women's manager Sarina Wiegman said: \"We know from the experience of the Euros [in 2022] how big the game is already here and what the momentum did in the country.\n\"Another tournament on an even bigger stage would be incredible and give another boost to the game.\"\nFormal bids for the 2035 World Cup must be submitted this winter, with a vote taking place to confirm the hosts in a Fifa congress in 2026.\nInfantino also confirmed that the 2031 Women's World Cup will be a 48-team tournament, up from 32 in 2027.\nShould the UK's bid be confirmed, the 2035 Women's World Cup will be the second time a World Cup has been held in the home nations after the 1966 men's tournament in England.\nEnglish FA insiders are delighted by the news and see it as a hugely significant moment for both women's football in the UK as well as the governing body's relationship with Fifa, which officials have been trying to improve.\nEngland failed to win the right to host the men's World Cups in both 2006 and 2018, and then in 2022 a proposed UK and Ireland bid for the 2030 tournament was abandoned after it became clear it was futile.\nBut assuming this bid for the 2035 Women's World Cup is ratified at next year's Fifa congress - and it appears a formality - the UK can finally look forward to staging a global senior football competition for the first time since 1966.\nThe hosting of men's Euro 2020 games in England and Scotland, and then all of the women's Euros in England in 2022, will have helped restore trust - along with the fact the men's Euros in 2028 is being played across England, Scotland, Wales and the Republic of Ireland.\nWhile details are yet to be finalised, England is expected to host the bulk of the games in 2035, and the final is also expected to be at Wembley.", "url": "https://www.bbc.com/sport/football/articles/c9venlzl7kjo"}