{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:15:55", "date_modify": "2025-05-20 14:15:55", "date_publish": "2023-07-29 14:57:48", "description": "Everton: Besiktas, Crystal Palace, Fulham keen on Demarai Gray", "filename": "sport_articles_cw4gvwz8nrpo_1747750555.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/09f8/live/3e3971c0-2e1f-11ee-9e4e-91e7f78631d2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cw4gvwz8nrpo_1747750555.html", "title": "Everton: Besiktas, Crystal Palace, Fulham keen on Demarai Gray", "title_page": "Everton: Besiktas, Crystal Palace, Fulham keen on Demarai Gray - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Shamoon Hafez, BBC Sport\nTurkish Super Lig side Besiktas and two Premier League rivals are among a number of clubs interested in signing Everton winger Demarai Gray.\nGray, 27, played 33 Premier League games and scored four goals as the Toffees narrowly escaped relegation last season.\nSelling Gray would mean Everton losing another attacking player from a squad that struggled for goals in 2022-23.\nReports in Turkey, external say Everton want £8.6m for the former Leicester City and Birmingham City player, with a \"first meeting\" taking place between the two clubs.\nBBC Sport understands that, though there is firm interest from Besiktas, Crystal Palace, Fulham and Saudi Arabian clubs, no bids have yet been lodged.\nBesiktas have agreed a deal to sign midfielder Ante Rebic, external from AC Milan, so a deal for Gray might only be possible if they can move on Congolese striker Jackson Muleka.\nEverton manager Sean Dyche has brought in Ashley Young on a free transfer and Arnaut Danjuma on loan so far this summer. With the Toffees working on a restricted budget, cashing in on Gray might be an option in order to rejuvenate the squad.\nEverton suffered a blow in their pursuit of a striker after Atalanta announced the signing of long-term target El Bilal Toure., external\nThey also hold a mild interest in Nigeria forward Kelechi Iheanacho, who was relegated with Leicester City last season.", "url": "https://www.bbc.com/sport/articles/cw4gvwz8nrpo"}