{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:49:44", "date_modify": "2025-05-21 03:49:44", "date_publish": "2025-01-15 11:56:23", "description": "Chelsea news: Fan views on decision not to send David Brooks off for Marc Cucurella incident", "filename": "sport_football_articles_cn7grg80rgzo_1747799384.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cn7grg80rgzo_1747799384.html", "title": "Chelsea news: Fan views on decision not to send David Brooks off for Marc Cucurella incident", "title_page": "Chelsea news: Fan views on decision not to send David Brooks off for Marc Cucurella incident - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your views on the decision not to send David Brooks off for an incident involving Marc Cucurella during Chelsea's 2-2 draw at home to Bournemouth on Tuesday evening.\nHere are some of your comments:\nMichael: Should we expect to see more players deliberately grabbed around the face and neck off the ball now that referees have determined it to be a yellow-card offence?\nKerry: Jack Stephens was sent off for pulling Cucurella's hair at Southampton before Christmas. Brooks clotheslined him before dragging him to the ground by his hair and was booked. What's the point of VAR if it can't ensure consistency in this most unique and specific type of incidents?\nSteve: Chelsea were by far the better team. Rob Jones should be ashamed of himself for not sending Brooks off. The referee was the most influential in the result - that should not happen, although we are seeing this week after week.\nMike: Call me old fashioned but I was always led to believe that flinging an opponent to the ground by their hair was serious violent foul play. Yellow card was an insult.\nMG: Referee was the only person at the Bridge who did not think the assault on Cucurella was a red.", "url": "https://www.bbc.com/sport/football/articles/cn7grg80rgzo"}