{"authors": ["Brian McLauchlin", "www.facebook.com"], "date_download": "2025-05-21 05:22:50", "date_modify": "2025-05-21 05:22:50", "date_publish": "2025-04-03 15:48:20", "description": "Scotland have \"already started\" preparing for an \"inspirational\" UK-hosted Women's World Cup in 2035, according to interim head coach Mick McArdle.", "filename": "sport_football_articles_cdde0j22pj1o_1747804970.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6251/live/2050cc30-108b-11f0-94b3-d3222284d093.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cdde0j22pj1o_1747804970.html", "title": "Scotland 'already started' preparing to host Women's World Cup", "title_page": "Scotland 'already started' preparing to host Women's World Cup - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Scotland have \"already started\" preparing for an \"inspirational\" UK-hosted Women's World Cup in 2035, according to interim head coach Mick McArdle.\nFifa president Gianni Infantino revealed on Thursday that a joint expression of interest in hosting the tournament from England, Northern Ireland, Scotland and Wales was the only valid one received by the world governing body's deadline day.\nMcArdle is not only preparing his team for Friday's Nations League visit by Germany but is closely involved with Scottish FA policy as head of elite women's football.\nAsked about \"the exciting news\" and the prospect of Scotland hosting World Cup games in 10 years' time, he said: \"We're two and a half years into that cycle.\n\"The association's decision to have the foresight to create the role that I'm the custodian for just now, the head of elite game, is that we've already started that preparation.\n\"It's up to us to qualify for the tournament as well, if it's not automatic, but it's an inspiration to us all, myself, the full pathway, the players in the dressing room just now.\"\nScotland qualified for their first World Cup finals in 2019 but missed out in 2023, while they have not reached a European Championship finals since 2017.\nMcArdle says the response to England hosting the Euros in 2022 was felt throughout that country and he hopes Scotland can capitalise on a similar scale.\n\"It's a massive inspiration that we could be hosting but also get ourselves to a World Cup now as well,\" McArdle said.\n\"We've seen how massive the hosting of Euros in England was to the English game's development overnight and it's certainly something that would have a massive impact across the game.\"\nMeanwhile, McArdle repeated his belief that he is ready to take the head coach on a permanent basis if it is offered at the end of \"currently ongoing\" recruitment process\nHaving lost their opening Group A ties to the Netherlands and Austria, Scotland face a double header with the top seeds and group leaders, travelling to Wolfsburg for the return tie on Tuesday.\nMcArdle says the campaign \"gives us a benchmark\" to gauge their progress and \"learn\" as they look \"towards consistently qualifying for competitions\".\nScotland have lost their three previous meetings with Germany without scoring, the latest of those being a 3-0 friendly defeat in 2013.", "url": "https://www.bbc.com/sport/football/articles/cdde0j22pj1o"}