{"authors": ["Kheredine Idessane", "www.facebook.com"], "date_download": "2025-05-21 07:58:14", "date_modify": "2025-05-21 07:58:14", "date_publish": "2025-03-27 18:04:41", "description": "Ferguson's Rangers 'starting to show the standards expected'", "filename": "sport_articles_cdxq15e9ge9o_1747814294.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6ce3/live/7b01c090-0b35-11f0-b1de-e342f84c59e9.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cdxq15e9ge9o_1747814294.html", "title": "Ferguson's Rangers 'starting to show the standards expected'", "title_page": "Ferguson's Rangers 'starting to show the standards expected' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Interim manager Barry Ferguson has warned Rangers won't \"rest easy\" after beating Celtic and reaching the Europa League quarter-finals as he strives for further improvement.\nFerguson is proud that he's been able to add a steelier side to a Rangers team he felt had become far too \"nice\".\n\"I'm not going to sit here and kid anyone on - I thought we were far too nice. You can't be nice at Rangers at times,\" said Ferguson.\n\"When you step out on that park every single team wants to beat you and you need to stand up to that. Bar the Motherwell game at home, my group of players are starting to show the standards that are expected.\n\"There's still a bit of work to go, there's no doubt. We're not sitting here and thinking everything's perfect. It's far from that but they're certainly heading in the right direction.\n\"Change is difficult at times and they've shown me they're more than capable of being here and getting results. We need to continue that.\n\"We're not going to rest easy and think, 'It was a great 10 days, we got into the last eight in Europe'. That's a great achievement and then you go across to Celtic Park and everybody is expecting us to get beaten but I had every confidence in them.\n\"They now really understand what way we have to approach the rest of the games between now and the end of the season. \"\nThe next hurdle to overcome is Saturday's trip to Dens Park, where Rangers have already dropped points this season.\n\"This is a challenge I'm looking forward to because, over the course of the season, games away from home haven't been up to the standard expected at Rangers,\" Ferguson added.\n\"We all know what Dundee did a couple of Sundays ago. They went across to Tannadice and were really good, they won the game convincingly, so I'm under no illusions as to what type of game it's going to be.\n\"Sometimes you need to dig deep to get results and that's maybe going to happen on Saturday.\"", "url": "https://www.bbc.com/sport/articles/cdxq15e9ge9o"}