{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:48:36", "date_modify": "2025-05-21 06:48:36", "date_publish": "2025-03-28 21:43:27", "description": "Newcastle are one of the Premier League teams who want Darwin Nunez - while Liverpool are hopeful of signing Alexander Isak - in today's gossip column.", "filename": "sport_football_articles_cvg1gexjpneo_1747810116.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3288/live/f5c8dcb0-0c1a-11f0-ba12-8d27eb561761.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cvg1gexjpneo_1747810116.html", "title": "Football gossip: Darwin Nunez, Alexander Isak, Bart Verbruggen, Benjamin Sesko", "title_page": "Football gossip: Darwin Nunez, Alexander Isak, Bart Verbruggen, Benjamin Sesko - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Newcastle and Liverpool want each other's strikers, Bayern Munich are interested in Brighton's goalkeeper and Manchester United chase two Leipzig players.\nNottingham Forest and Newcastle are both interested in Liverpool and Uruguay striker Darwin Nunez, 25, who looks increasingly likely to leave Anfield. (Teamtalk, external)\nLiverpool's pursuit of Newcastle United and Sweden striker Alexander Isak, 25, is gaining traction. (Givemesport), external\nBayern Munich are preparing to make a bid for £60m-rated Brighton and Netherlands goalkeeper Bart Verbruggen, 22. (Telegraph - subscription needed), external\nManchester United manager Ruben Amorim is targeting Sporting and Portugal winger Francisco Trincao, 25, as a key part of his planned summer squad overhaul. (Talksport), external\nManchester United, Arsenal, Paris St-Germain, Bayer Leverkusen, Real Madrid and Atletico Madrid are all interested in Espanyol keeper Joan Garcia, 23. (AS - in Spanish), external\nArsenal want uncapped Spaniard Garcia to be number two to David Raya and he is open to the move. (Athletic - subscription needed), external\nArsenal, Manchester United, AC Milan and Bayern Munich are all interested in Leipzig striker Benjamin Sesko, 21, but the Slovenian favours a move to the Premier League.(Bild - in German), external\nAnother Leipzig star could be in line for a move to Old Trafford as Manchester United are interested in 21-year-old Dutch midfielder Xavi Simons. (Teamtalk), external\nAston Villa are favourites to secure the signing of Chelsea and England winger Noni Madueke, 23. (Givemesport), external\nChelsea and Manchester City are among the clubs considering a move for Roma and Serbia goalkeeper Mile Svilar, 25. (Caught Offside), external\nNewcastle have produced a promotional video of a new 65,000-capacity stadium at Leazes Park in the strongest indication yet that they are planning to leave St James' Park. (Guardian), external\nCollette Roche, the Manchester United chief operating officer, has emerged as one of the candidates for the chief executive role at Newcastle United. (Telegraph - subscription needed), external", "url": "https://www.bbc.com/sport/football/articles/cvg1gexjpneo"}