{"authors": ["Matthew Henry", "www.facebook.com"], "date_download": "2025-04-26 06:44:53", "date_modify": "2025-04-26 06:44:53", "date_publish": "2025-03-01 16:24:58", "description": "England coach Brendon McCullum has not ruled out appointing separate 50-over and T20 captains or bringing in a player from outside the current squad to do the role.", "filename": "sport_cricket_articles_c0mw9gvz09mo_1745649893.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a6bd/live/4e1c6820-f6b6-11ef-9c6a-9b6bc9defc65.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_cricket_articles_c0mw9gvz09mo_1745649893.html", "title": "England cricket: Brendon McCullum does not rule out splitting white-ball captaincy", "title_page": "England cricket: Brendon McCullum does not rule out splitting white-ball captaincy  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "England coach Brendon McCullum has not ruled out appointing separate 50-over and T20 captains or bringing in a player from outside the current squad to do the role.\nWhite-ball captain Jos Buttler resigned on Friday following England's exit from the Champions Trophy.\nMcCullum has said England will take stock of the situation in the coming weeks and then move to appoint a successor.\n\"If it's the same person, great, if it's two, that's great too,\" said McCullum, after England's campaign in Pakistan ended with a sorry seven-wicket defeat by South Africa.\n\"Give me a couple of weeks to work it out and get this thing back on track.\"\nEngland's next white-ball series starts against West Indies on 29 May and the next ICC global event is the T20 World Cup in India and Sri Lanka in February and March 2026.\nBatter Harry Brook appears the favourite to replace Buttler, given he was appointed vice-captain in January and led in Buttler's absence last year against Australia.\nBut appointing him would bring issues because Brook is a regular in the Test side.\nHe would either have to rest in some white-ball series, an approach England have regularly used, or take on a heavy workload around his Test commitments.\nOne solution would be splitting the white-ball captaincy but England have not had three captains since Andrew Strauss, Alastair Cook and Stuart Broad held the roles in the early 2010s.\n\"It could definitely work, I don't see why not,\" England bowler Chris Woakes told the Test Match Special podcast.\n\"I feel we are in a stage in the cricket landscape where that can be the way forward.\n\"The formats are very different. Extremely different. 50-over is not just an extended T20 game. It's not, there are more games within the game, which is closer to Test cricket and being able to do things for longer.\"\nLiam Livingstone and Phil Salt have also both captained England in white-ball cricket over the past year. Another option would be to bring in a player who captains in domestic cricket but is not currently part of the side.\nEngland wicketkeeper Sam Billings captained Oval Invincibles to victory in The Hundred last year but has not played for England since November 2022.\nJames Vince, whose last international was in March 2023, has had success as Hampshire captain while Sam Curran has captained in the Indian Premier League but was dropped by England last year.\nAsked if England could bring in such a candidate, McCullum said: \"Give us a couple of weeks to work it all out, sort of digest what's happened over the past month and a half, and then we will start to plot and plan our way forward from there.\"", "url": "https://www.bbc.co.uk/sport/cricket/articles/c0mw9gvz09mo"}