{"authors": ["Charlotte Coates", "www.facebook.com"], "date_download": "2025-05-21 06:13:29", "date_modify": "2025-05-21 06:13:29", "date_publish": "2025-01-04 17:28:28", "description": "Aston Villa 2-1 Leicester: Villa in a fight for Champions League", "filename": "sport_football_articles_c80v4053x8eo_1747808009.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4f54/live/cad73dd0-cac0-11ef-bb47-87a9dea68aa1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c80v4053x8eo_1747808009.html", "title": "Aston Villa 2-1 Leicester: Villa in a fight for Champions League", "title_page": "Aston Villa 2-1 Leicester: Villa in a fight for Champions League - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Aston Villa have had a taste of the big time and they want more of it next season.\nUnai Emery's side have taken to the Champions League like a duck to water and they are on course for reaching the last 16 of the competition.\nHowever, they are embroiled in a tough fight to secure their place among Europe's elite once again for next term but they have closed the gap to Chelsea in fourth to just four points.\nAfter two games without a win, Villa needed to start the year on a high and take three points in a game they would expect to do so and that is exactly what they did.\nDespite starting the game at a walking pace, Villa turned it on once the second half started and they took the lead after a brilliant Ross Barkley hit.\nAfter being pegged back five minutes later, Villa did not allow their heads to drop as they went on the attack again and Leon Bailey was on hand to secure the three points.\nThey then went in search of more goals as Bailey struck the underside of the bar and Ollie Watkins skied one from close range.\nWith Everton up next in the league, Villa may feel they are in a good place to snatch a point or three.", "url": "https://www.bbc.com/sport/football/articles/c80v4053x8eo"}