{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-05-20 12:25:08", "date_modify": "2025-05-20 12:25:08", "date_publish": "2023-08-04 12:08:23", "description": "Manchester City boss Pep Guardiola says Croatia defender Josko Gvardiol is having a medical and will complete his switch from RB Leipzig 'in the next hours'.", "filename": "sport_football_66405633_1747743908.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/15DE6/production/_130647598_gettyimages-1582904582.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66405633_1747743908.html", "title": "Josko Gvardiol: Croatia defender close to completing Man City move, says Pep Guardiola", "title_page": "Josko Gvardiol: Croatia defender close to completing Man City move, says Pep Guardiola - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester City manager Pep Guardiola has confirmed defender Josko Gvardiol is having a medical and should complete his move from RB Leipzig \"in the next hours\".\nCity have agreed a £77m fee for the 22-year-old Croatia international.\n\"He is here,\" said Guardiola. \"He is doing medical tests and hopefully we can finish the deal in the next hours.\"\nGuardiola also discussed the uncertain futures of Kyle Walker and Bernardo Silva.\nBayern Munich are keen to sign England defender Walker, 33, whilst Portugal winger Silva, 28, has attracted huge interest from Saudi Arabia, in addition to long-time admirers Barcelona.\n\"We will do everything to keep them,\" he said. \"It is not like [Ilkay] Gundogan as they have contracts.\n\"We want them to stay because they want to stay. Losing Kyle and Bernardo would be so difficult.\"\nSo far this summer City have already lost former captain Gundogan, who joined Barcelona after his contract at the Etihad expired, and forward Riyad Mahrez, who was purchased by Al-Ahli as part of the Saudi Pro league's significant recruitment drive.\nGuardiola says his priority is to work with players who want to continue at City, and also claimed the club has to pay an additional 'tax' to bring in new additions because of their status.\n\"I want to work with guys who want to stay. [If they don't], we have to get a proper offer [for them],\" Guardiola said.\n\"If we don't get a proper offer, he's [Silva] our player and we want him. If they [Barcelona] want him, they will take a plane and come here and talk to our sporting director and CEO to make an agreement. For us to buy a player, just because we are Man City it is £10-15m more expensive than other clubs all the time. If people want our really really important players, first they have to make an offer - and that hasn't happened.\n\"When it happens, we will fight to extend the contract and [have them] be with us. That has happened with all of our players since day one.\"\nSilva is understood to be conflicted about his future.\nHe recognises the achievements he has had at City, and their chances of further success in the future.\nBut he is unsure whether it is time for another challenge, and a move to a climate more in keeping with his Portuguese roots.\nPlaying for Barcelona is a long-held dream for Silva, although he also understands the club's financial problems mean they may not be able to put a deal together that would suit City.", "url": "https://www.bbc.com/sport/football/66405633"}