{"authors": ["Chris Wathan", "www.facebook.com"], "date_download": "2025-05-21 05:19:52", "date_modify": "2025-05-21 05:19:52", "date_publish": "2025-04-03 21:11:37", "description": "Swansea City have held discussions with potential new managers – but caretaker Alan Sheehan has been told he remains a candidate to become permanent boss.", "filename": "sport_football_articles_cx20n2540kyo_1747804792.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/612a/live/5f1ce810-10cf-11f0-9388-abc6cefd9011.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cx20n2540kyo_1747804792.html", "title": "Swansea City hold talks with new boss candidates", "title_page": "Swansea City hold talks with new boss candidates - but Alan Sheehan still in frame - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Swansea City have held discussions with potential new managers – but caretaker Alan Sheehan has been told he remains a candidate to become permanent boss.\nSheehan, 38, has agreed to stay in temporary charge until the end of the season, with the club keen to fully support the Irishman as they seek to retain their Championship status.\nBut director of football Richard Montague told supporters at a fans' forum that has not paused the process of identifying a long-term to successor to Luke Williams, who was axed in February.\nIt is understood that has included speaking to possible candidates – both British-based and abroad – with an appointment to come when the season finishes early next month.\n\"There's nothing more important right now than getting the very best person for the role and Alan being here allows us the time to do that – while also recognising he is a candidate for the role,\" said Montague.\nMontague is leading the managerial search as well as recruitment for the new season, also telling fans several conversations with players have already taken place and were in a \"strong position\" to tie up some deals once an appointment was made.\nWith Swansea five points above the bottom three with seven games remaining, the former Notts County executive director said: \"We wouldn't normally want such a long period without a permanent head coach but it's the cards we've been dealt and the most responsible thing I can be doing is run process thoroughly as can to get person lead us forward, and that's why we've waken this path both for short term and medium long term goals of the club.\n\"Alan gives us the stability we need and the best chance to achieve a strong finish to the season, including picking up the points to still be in the Championship next year.\"\nMontague admitted the club had \"underperformed\" against their most recent budget and told supporters at the Swansea.Com Stadium that a lot of work has gone on to change that trend. That has included new appointments and a change in structure to the club's recruitment process, heavily criticised over a number of transfer windows.\nAnd he stressed he has been given assurances of being able to make final and fast decisions on deals, rather than having to pass up to US-based owners Brett Cravatt and Jason Cohen.\nThat is also the case for day-to-day decisions on the running of the club, now overseen by chief executive Tom Gorringe who spoke publicly for the first time since being promoted into the role.\nHe has taken over American businessman's Andy Coleman's duties, who will formally leave his post as chairman at the end of the season.\nGorringe told fans he is in daily contact with the ownership who are \"fully involved\" and have been keen to add greater \"football insight\" to the club's operations.\nThe former Bristol Rovers executive, who acknowledge the club had drifted in recent years, said: \"Running a football club is difficult, it's one of the most difficult industries to operate in with a huge amount of stakeholders and emotion attached to decisions.\n\"You need to have experienced that to make strong, rational decisions for the betterment of the football club.\n\"I've vast array of experiences at different clubs from League Two to the Premier League, worked with teams that have been promoted out of this division, so I know what it needs to look like for us to get there.\n\"That understanding of what good looks like in football, in the decisions you make, the contracts being negotiated, is really important.\n\"That always hasn't been the case from what I've seen here - but we've got a good team on the ground aligned as to what success looks like.\"", "url": "https://www.bbc.com/sport/football/articles/cx20n2540kyo"}