{"authors": ["Rob Stevens", "www.facebook.com"], "date_download": "2025-05-20 12:33:54", "date_modify": "2025-05-20 12:33:54", "date_publish": "2023-08-04 10:00:21", "description": "Leyton Orient head coach Richie Wellens believes the League One promotion race will be wide open this season.", "filename": "sport_football_66400109_1747744434.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/14DBA/production/_130643458_shutterstock_editorial_14032663e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66400109_1747744434.html", "title": "Leyton Orient boss Richie Wellens expects League One to be 'more competitive'", "title_page": "Leyton Orient boss Richie Wellens expects League One to be 'more competitive' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Leyton Orient head coach Richie Wellens believes the League One promotion race will be wide open this season.\nThe O's are back in the third tier for the first time since 2014-15, having won the League Two title in May.\n\"There is no way you are going to have three teams with nearly 100 points and the next four are going to have 85-plus points,\" Wellens told BBC Sport.\n\"I think it will be a lot more competitive and there will be opportunities to get a play-off spot.\"\nPlymouth Argyle finished on 101 points last season to win the division, with Ipswich Town finishing three points behind in the second automatic promotion spot.\nEventual play-off winners Sheffield Wednesday missed out on the top two despite amassing 96 points - becoming the first EFL team in history to get 95 points or more and not go up automatically - while fourth-placed Barnsley and Bolton, in fifth, accrued 86 and 81 points.\nOrient were beaten play-off finalists the season before their relegation from League One eight years ago, and Wellens thinks his side have the potential to finish in the top six given this year's field.\n\"I think Bolton are really stable under Ian Evatt, Derby will be strong, Portsmouth will be strong because they have got a bit of continuity from the end of last season,\" the 43-year-old, who was appointed by the east London club in March last year, said.\n\"Then Barnsley have lost their manager, Blackpool have lost their best striker, Reading are a little bit all over the shop and Wigan have minus eight [points].\n\"There are lots of clubs that we don't quite know what will happen with them.\n\"That can be an opportunity for ourselves, your Lincolns, Shrewsburys and Fleetwoods that finished from eighth to 16th or 17th last season.\n\"We have to embrace it and attack it, as this is what we've worked the last 15 or 16 months for.\"\nWellens last managed in League One with Doncaster Rovers in 2021-22, but he was sacked in December 2021 after winning just three of his 19 league games in charge.\nHis record in League Two, which included a title-winning campaign with Swindon in 2019-20 along with Orient's success last season, has seen him amass 1.74 points per game as opposed to 1.03 points per game in League One across spells with Oldham, Swindon and Doncaster.\nHowever, he argues his Orient squad is much better placed than his former clubs to tackle the challenges posed by the third tier.\n\"At Oldham, we were bottom when I took over and we put up a real good fight. You can see what happened to Oldham since I left,\" he said.\n\"At Doncaster, the majority of the time, 80% of my starting outfield players had 50 games or less and were at the start of their career. Look what's happened to Doncaster since.\n\"No matter how good a manager you are, if you haven't got experience in your dressing room or players who can play at the level, then it's always going to be a difficult task.\n\"I'd like to think in our squad of 20, we've got a lot players who can handle this division, have experience of this division and have hundreds of games underneath their belts.\"\nOrient begin their league campaign away to Charlton Athletic on Saturday (15:00 BST).", "url": "https://www.bbc.com/sport/football/66400109"}