{"authors": ["Mantej Mann", "www.facebook.com"], "date_download": "2025-05-21 04:55:49", "date_modify": "2025-05-21 04:55:49", "date_publish": "2025-04-04 14:16:11", "description": "Ten-try Toulon recover from a 22-point deficit to overpower an under-strength Saracens side and reach the Investec Champions Cup quarter-finals.", "filename": "sport_rugby-union_articles_c5yrd7x12n7o_1747803349.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/91c6/live/52eda430-121e-11f0-a820-05f89b05038b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c5yrd7x12n7o_1747803349.html", "title": "Toulon 72-42 Saracens: Champions Cup thriller as 10-try hosts overpower spirited Premiership side", "title_page": "Toulon 72-42 Saracens: Champions Cup thriller as 10-try hosts overpower spirited Premiership side - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ten-try Toulon recovered from a 22-point deficit to overpower an under-strength Saracens side and reach the Investec Champions Cup quarter-finals.\nFacundo Isa marked his 150th appearance for the French side with a hat-trick and Melvyn Jaminet scored two tries, while Jiuta Wainiqolo, Brian Alainu'uese, Leicester Fainga'anuku, Baptiste Serin and Seta Tuicuvu also crossed.\nSaracens, who rested England stars Maro Itoje, Jamie George, Ben Earl and Elliot Daly for their trip to the Stade Felix Mayol, started brightly and threatened an upset in an impressive first half.\nJuan Martin Gonzalez capitalised on a couple of Toulon handling errors to score twice and centres Nick Tompkins and Olly Hartley also crossed in a clinical opening half an hour to hand the visitors a 35-13 lead.\nThe hosts scored a quickfire double to reduce the deficit to three points at the interval before taking complete control in the sunshine with the next 26 points.\nJames Hadfield claimed a consolation for Sarries against the run of play but Toulon finished strongly, with a final flurry of three late tries sealing their place in the next round.\nThe Top 14 side will host either Toulouse or Sale Sharks in the quarter-finals next weekend.\nIsa ended the game with a hat-trick of tries but it was mixed performance from the Argentine back row as he made key errors to gift Saracens a couple of early tries.\nThe first was a dropped ball as Jaminet opted to fire a pass wide rather than clear his lines deep inside Toulon territory, which the number eight fumbled before his compatriot Gonzalez picked to score the opening try.\nJaminet quickly made amends as his break set up Wainiqolo to open Toulon's account but Saracens, driven forward by influential England hooker Theo Dan, moved in front once again through Tompkins.\nCentre partner Hartley then added a fine finish with a first-phase strike play in midfield to score Saracens' third before Gonzalez was the beneficiary of another error by Isa, who lost control of the ball after making a clever turnover, to score potentially the easiest double of his career.\nAnother charging run by Dan, who proved a constant threat in the first half, set up Van Zyl to cross for the fifth in a whirlwind opening by the visitors.\nIsa reduced the deficit with a powerful surge from close range before Jaminet crossed in midfield to hand Toulon a reprieve and a route back into the game.\nThe hosts emerged from the sheds revitalised and Brian Alainu'uese drove over the line to maintain their momentum before Isa sealed his hat-trick with another fierce carry after picking up the ball from the base of the ruck.\nToulon's physical approach began to take its toll on their English visitors, creating space in the wide channels, and Gabin Villiere made a break close to the touchline and fed Fainga'anuku on the inside for a run-in.\nSarries needed a lifeline and it came in bizarre circumstances from a penalty, which was nudged to touch and recycled for Hadfield's try, after Toulon were penalised for momentarily having 16 players on the pitch.\nIt would prove to be a consolation, though, as Villiere added another clever assist moments later for Serin to dive over in the corner, before Tuicuvu added the hosts' 10th try.\nSaracens director of rugby Mark McCall told Premier Sports: \"It is funny feeling proud when you concede 70 points, but then you have got to check yourself, and with 12 minutes to go I think it was an 11-point game.\n\"We did some magnificent stuff in the first half, but second half we just couldn't get our hands on the ball. They spent a lot of time in our 22, and they are a big side and are hard to stop.\n\"The commitment of our playing group from start to finish was superb. We will learn a lot from it, but what an experience for a group of young players.\n\"We were brave. To come away to somewhere like this and not play within ourselves was really important. We gave it a go in a good way for a long time.\n\"There is a lot to like, a lot to learn and a lot to be proud of.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/c5yrd7x12n7o"}