{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:31:56", "date_modify": "2025-05-21 06:31:56", "date_publish": "2025-01-31 11:33:19", "description": "Manchester United boss Marc Skinner is pleased to see extra investment in the women's game, but believes Chelsea's spending in the January transfer window \"skews the market\".", "filename": "sport_football_articles_c4g9pp7gn8eo_1747809116.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ce3e/live/9446cbf0-dfbf-11ef-819e-d1f2ca20e9fa.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c4g9pp7gn8eo_1747809116.html", "title": "Naomi Girma: Chelsea spending 'skews market' according to Man Utd boss Marc Skinner", "title_page": "Naomi Girma: Chelsea spending 'skews market' according to Man Utd boss Marc Skinner - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester United boss Marc Skinner is pleased to see extra investment in the women's game, but believes Chelsea's spending in the January transfer window \"skews the market\".\nWomen's Super League leaders Chelsea signed United States defender Naomi Girma for £900,000, making her the most expensive female footballer in the world.\nOn Friday they confirmed a deal for Barcelona's England midfielder Keira Walsh.\nUnited made one permanent signing in the January window, with goalkeeper Kayla Rendell arriving from Women's Championship side Southampton and Skinner said his club are not at the same level as Chelsea when it comes to transfers.\n\"I am happy the investment has come in,\" said Skinner. \"Does it widen the gap? It definitely skews the market a little bit.\n\"I don't think Chelsea will be moaning about that because they are in a situation where they can hit those levels of investment.\n\"For us it's fantastic for the women's game, the growth and development in such a short period of time.\n\"But we may potentially see fallouts and how it affects everybody else.\"\nChelsea are top of the WSL, seven points clear of United in second.\nBut Skinner said his team will continue to try to bridge the gap on the pitch when spending off it is out of their control.\n\"It has to make you try harder,\" he added. \"That is the reality. We're not that team. We can't go and spend those types of fees.\n\"But what we can do is we can try and recruit smartly, not panic that teams are investing in that kind of way, and really push into our own way of doing it.\"\nUnited made a deadline-day offer for England forward Chloe Kelly from rivals Manchester City, but the 27-year-old joined Arsenal on loan late on Thursday.\n\"If we found the right person and we could make a right deal, then we'd try and do it,\" Skinner said.\n\"If not, I'm really happy with the forward options we have. Chloe Kelly is an Arsenal player on loan from Manchester City. So it really doesn't affect us now.\"\nFormer Manchester City captain Steph Houghton said Chelsea's signing of Girma for a women's world record fee is \"a lesson for all the other clubs\" to start investing more.\nWomen's Super League bosses have had their say about whether the league is at risk of becoming less competitive.\n\"They spend [on one player] what we spend on our squad in an entire year,\" said Everton boss Brian Sorensen. \"So that's a gap, right? They are number one in this country and they are that for a reason.\n\"If they have an injury on a good centre-back, they just go out and buy the best one available. Have an injury on a striker last year, and they just go out and buy the best one available.\n\"That shows commitment to the women's team, so fair play. But I think if you're talking about longer term, making it sustainable and all that, then probably it's going to be hard.\"\nLeicester boss Amandine Miquel, who previously managed French side Reims for seven years, hopes other clubs take note and up their investment.\n\"Hopefully we still believe somewhere in life that money doesn't make anything and we have to wake up every day thinking that we can compete against any team and we can continue doing that as long as we can,\" she said.\n\"It's something we had to live with in France for 12 years with Lyon far ahead, so if that happens it is just going to be an old story for me. When that happens you have to think that second place is the one and that's it.\n\"It's not ideal but it can also maybe give the other clubs intention to try and build the same thing.\"\nWest Ham boss Rehanne Skinner said a marquee signing like Girma could be the difference in Chelsea winning the Women's Champions League, which would be a good thing for women's football domestically in England.\n\"It is important to say the money that has been spent on two transfers for two players is more than half of the WSL's whole budget,\" Skinner said.\n\"Clubs are aiming to win the Champions League so they have to ensure they have the squad to be able to do that.\n\"I do think it's about time that an English team won the Champions League. If that happens it grows the game in our country and it benefits everyone.\"\nTottenham head coach Robert Vilahamn agreed that while signing a player of Girma's quality made Chelsea even more difficult to beat, it was good for the WSL overall.\n\"I'm an advocate for raising [the profile of] women's football so if that means clubs show that they want to invest more money in the game, I think it is a good thing for female athletes and for women's football,\" he said.\n\"If I look at it with those eyes I am happy that it happened because then it might happen even more, and more money might come in which is what we need to make sure we make steps.\n\"For trying to beat Chelsea it is more difficult but for the bigger picture it is brilliant.\"", "url": "https://www.bbc.com/sport/football/articles/c4g9pp7gn8eo"}