{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:45:33", "date_modify": "2025-05-21 06:45:33", "date_publish": "2025-03-30 17:20:31", "description": "Kerry clinch a 24th Allianz Football League title as they beat Mayo 1-18 to 1-12 in the Division One Final with Mickey Harte's Offaly securing Division Three honours.", "filename": "sport_articles_c934pn599p2o_1747809933.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f451/live/f2f1c690-0d88-11f0-ab29-6f021f80ae61.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c934pn599p2o_1747809933.html", "title": "Allianz Football League: Kerry win 24th title with 1-18 to 1-12 win over Mayo", "title_page": "Allianz Football League: Kerry win 24th title with 1-18 to 1-12 win over Mayo - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Kerry clinched a 24th Allianz Football League title as they overcame Mayo 1-18 to 1-12 in the Division One Final at Croke Park.\nThe Kingdom fittingly became the first winners of the new Micheal O Muircheartaigh Cup being awarded to the winners of the Division One title in honour of the legendary Kerry native GAA commentator who died last June.\nAfter the excitement of last weekend's final series of round-robin fixtures, the final was somewhat of a pedestrian affair with focus already turning to the championship which gets under way next weekend.\nMayo led 0-4 to 0-2 early on but Kerry suddenly were ahead as David Clifford intercepted a kickout from Mayo goalkeeper Colm Reape and set up Paul Geaney to find an empty net.\nKerry never trailed again as they led 1-9 to 0-7 at the interval with Clifford having registered 0-4 in the opening half.\nA Ryan O'Donoghue point cut Kerry's lead to four after the restart but the Kingdom responded with four straight scores to lead by eight.\nMayo briefly rallied to reduce the the margin to three after 48 minutes as an Eoghan McLaughlin goal was followed by an O'Donoghue two-pointer.\nHowever scores from Tony Brosnan and Clifford put Kerry back in firm control and the Kingdom superstar was close to notching a second goal late on when he struck the woodwork.\nThe six-point margin at the finish accurately reflected the 70 minutes of action as Clifford finished with 0-9 with his brother Paudie contributing 0-3 of Kerry's total.\nIn the curtain-raiser at Croke Park, Offaly joint-manager Mickey Harte celebrated winning the Division Three title as the Faithful County edged out Kildare 2-17 to 1-18.\nOffaly became the fourth county that Harte has won a Football League title with given his previous Division One and Division Two triumphs with his native Tyrone, Division Four and Division Three successes with Louth and last year's Division One victory with Derry.\nJack Bryant's early goal helped Offaly lead 1-10 to 0-10 at half-time.\nAn unanswered run of 1-3 - which included Cormac Egan's goal - kept Offaly in control even though Kildare did kick the final three scores.", "url": "https://www.bbc.com/sport/articles/c934pn599p2o"}