{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:01:13", "date_modify": "2025-05-21 06:01:13", "date_publish": "2025-01-04 18:02:23", "description": "Torquay United manager Paul Wotton says he is embarrassed after his side were thrashed 5-1 at Worthing in the FA Trophy.", "filename": "sport_football_articles_cg7rkz4ek37o_1747807273.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7ba6/live/d3549ac0-cac5-11ef-9fd6-0be88a764111.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cg7rkz4ek37o_1747807273.html", "title": "Torquay United boss Paul Wotton 'embarrassed' after FA Trophy loss at Worthing", "title_page": "Torquay United boss Paul Wotton 'embarrassed' after FA Trophy loss at Worthing - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Torquay United manager Paul Wotton said he was \"embarrassed\" as his side were thrashed 5-1 at Worthing in the FA Trophy.\nThe National League South leaders were 4-0 down at half-time as Muhammadu Faal scored a hat-trick and Joel Colbran got Worthing's other goal.\nJordan Young pulled one back with 17 minutes left but Danny Cashman replied with a fifth goal for the hosts late on.\n\"There's a lot of disappointment, a lot of embarrassment, a lot of frustration, a lot of anger from me,\" Wotton told BBC Radio Devon.\n\"I'm not sure there is from lots of the players, but from me there is, so it's not a great day.\"\nTorquay only had their trip to Worthing confirmed earlier in the week after Gosport Borough, who had beaten the Sussex side in the last round, were expelled for fielding an ineligible player.\nBut having missed a good early chance, Torquay were second-best for long periods as they were knocked out in the fourth round.\n\"We just had players doing whatever they wanted on the pitch today,\" added Wotton.\n\"When I say I'm embarrassed, the embarrassing thing is it looks like they haven't been coached.\n\"They just took it upon themselves to do whatever they wanted.\n\"We didn't do any of the basics, so that's really disappointing, and they've been told.\n\"It's one of those where I'd rather it happened today than in a league game, even though we wanted to progress.\"", "url": "https://www.bbc.com/sport/football/articles/cg7rkz4ek37o"}