{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:44:45", "date_modify": "2025-05-21 05:44:45", "date_publish": "2025-04-02 22:25:07", "description": "Galatasaray accuse Fenerbahce boss Jose Mourinho of \"physically attacking\" their manager Okan Buruk after appearing to grab his nose.", "filename": "sport_football_articles_crrz92ng2j8o_1747806285.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9f4c/live/28024710-1063-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_crrz92ng2j8o_1747806285.html", "title": "Jose Mourinho: Fenerbahce manager accused of grabbing nose of Galatasaray boss Okan Buruk", "title_page": "Jose Mourinho: Fenerbahce manager accused of grabbing nose of Galatasaray boss Okan Buruk - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Galatasaray have accused Fenerbahce boss Jose Mourinho of \"physically attacking\" their manager Okan Buruk after he appeared to grab his nose following a fiery derby in the Turkish Cup.\nThe incident occurred after the final whistle at Sukru Saracoglu Stadium, when both managers were interacting with the match officials in the centre circle.\nMourinho approached Buruk from behind and appeared to pinch his nose, causing the Galatasaray manager to fall to the floor with his hands covering his face.\n\"Our manager Okan and Mourinho congratulated the referees. After that, while Okan was continuing, Mourinho first verbally and then physically attacked him,\" Galatasaray's vice-president Metin Ozturk said.\n\"Where else in the world can he do this? What does he think of Turkey?\n\"I believe that Fenerbahce's management will impose the necessary sanction before the federation does.\"\nGalatasaray won the Turkish Cup quarter-final tie 2-1 with Victor Osimhen scoring twice for the visitors.\nBBC Sport has contacted Fenerbahce for a response.\nBuruk, who enjoyed two spells at Galatasaray as a player before returning as manager in 2022, played down the incident at his post-match news conference.\n\"There was nothing between me and Mourinho,\" Buruk said.\n\"He pinched my nose from behind. There was a slight scratch. Of course, it wasn't a very nice or elegant thing to do.\n\"We expect managers to behave more appropriately in such situations. I won't exaggerate this issue, but it wasn't a classy move.\"\nFenerbahce substitute Mert Yandas and Galatasaray substitutes Kerem Demirbay and Baris Yilmaz were shown red cards for their part in a melee between the two benches during stoppage time.\nFollowing a goalless draw between the two clubs in the Turkish Super Lig in February, Galatasaray said they would \"initiate criminal proceedings\" against Mourinho after claiming he made \"racist statements\".\nThe Turkish Football Federation also handed Mourinho a four-game ban and a fine of £35,194 for two separate disciplinary matters.\nMourinho responded by launching a lawsuit against Galatasaray \"due to the attack on the personal rights\" of the Portuguese.", "url": "https://www.bbc.com/sport/football/articles/crrz92ng2j8o"}