{"authors": ["Dan Roan, Stephan Shemilt & Timothy Abraham", "www.facebook.com"], "date_download": "2025-05-21 05:40:17", "date_modify": "2025-05-21 05:40:17", "date_publish": "2025-01-31 17:18:48", "description": "A consortium of tech billionaires agrees a fee of £145m for a stake in London Spirit and with it the chance to form a partnership with Lord's.", "filename": "sport_cricket_articles_c360z2k47jwo_1747806017.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e79c/live/5b9a4340-dff6-11ef-a552-ef694361914c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c360z2k47jwo_1747806017.html", "title": "The Hundred: London Spirit stake sold for £145m to tech consortium", "title_page": "The Hundred: London Spirit stake sold for £145m to tech consortium - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A consortium of tech billionaires has agreed a huge fee of £145m for a stake in London Spirit and with it the chance to form a partnership with the prestigious Lord's ground.\nThe consortium - led by Nikesh Arora the chief executive of Palo Alto Networks - has agreed the deal for 49% of Spirit, meaning the whole franchise was valued at around £300m.\nIn Friday's second auction, the owners of Major League Cricket (MLC) franchise Washington Freedom agreed a deal to buy a stake in Welsh Fire.\nFreedom are backed by Indian-American IT entrepreneur Sanjay Govil and tabled a winning bid of around £80m to potentially secure a 49% share of Fire worth £40m.\nThe winning bidders for Spirit are thought to have beaten off competition from the Glazer family, co-owners of Manchester United, Todd Boehly, a shareholder in Chelsea, and Indian Premier League side Lucknow Super Giants.\nThe fee demonstrates the lure of Spirit's base Lord's, the home of cricket.\nInternally, the England and Wales Cricket Board (ECB) had valued all eight Hundred teams combined at a minimum of £350m.\nMarylebone Cricket Club (MCC), owners of Lord's, opted to keep all of the 51% share it was gifted by the ECB, while county club Glamorgan told their members last month they were planning to retain their 51% of the Fire.\nFriday's sales were third and fourth auctions of stakes in the eight Hundred teams, following an opening pair on Thursday. So far, the sales come to a total of around £285m.\nOn Thursday, a 49% share in Oval Invincibles was sold to the owners of Indian Premier League team Mumbai Indians for around £60m.\nA same-sized stake in Birmingham Phoenix then went to Knighthead Capital, the owners of Birmingham City Football Club, for about £40m.\nLike the MCC, both Surrey and Warwickshire, hosts of the Invincibles and Phoenix respectively, opted to retain their 51% shares.\nFor each of the deals there will now be an eight-week exclusivity partnership to finalise the details.\nThe varied backgrounds of the three successful bidders to date fulfils the ECB's stated desire of a blend of investors, rather an IPL takeover of The Hundred.\nThe consortium that has agreed the deal for the Spirit is known as Cricket Investor Holdings Limited. Indian-born Arora has been leading Palo Alto Networks, a cybersecurity giant, since 2018. He previously spent a decade at Google.\nThe MCC described Arora's group as \"11 high net-worth individuals\". The consortium includes Egon Durban, the chief executive of Silver Lake Management, Satyan Gajwani, the co-founder of Major League Cricket and vice-chairman of Times Internet, Satya Nadella, the chief executive of Microsoft, Shantanu Narayen the chief executive of Adobe, and Sundar Pichai, the chief executive of Google.\nMontreal-born Govil is the founder and chairman of Infinite Computer Solutions, which is based in Rockville, Maryland and has an annual revenue of $2bn with 20,000 employees globally.\nGovil made his first foray into professional cricket franchise ownership with Freedom during the first season of MLC in 2023 with his son Avikar also actively involved in the day-to-day running of the team.\nFreedom have a strategic partnership with Cricket New South Wales and have a strong Australian flavour to their set-up.\nFreedom's owners beat off interest from Capri International, which owns UP Warriorz in India's Women's Premier League and Sharjah Warriors in the UAE's International League T20 to secure a deal for Fire.\nWrexham Football Club's Hollywood owners Ryan Reynolds and Rob McElhenny were among those who were interested in acquiring a stake in Fire but were not part of the final auction\nThe ECB is retaining control of The Hundred competition, but is selling stakes in the teams to provide a cash injection to the game in this country.\nThe hosts of the eight teams have been given a 51% stake in their franchise, which they can sell or keep, with the ECB then selling the remaining 49%.\nThe eight hosts are Lord's (Marylebone Cricket Club (MCC)/London Spirit), The Oval (Surrey/Oval Invincibles), Southampton (Hampshire/Southern Brave), Cardiff (Glamorgan/Welsh Fire), Trent Bridge (Nottinghamshire/Trent Rockets), Edgbaston (Warwickshire/Birmingham Phoenix), Old Trafford (Lancashire/Manchester Originals) and Headingley (Yorkshire/Northern Superchargers).\nOf the 51% the hosts have been given, they can keep all, or choose to sell all or part of their stake.\nFrom the total money raised, 10% will go straight to the recreational game. Proceeds from the 49% sales will be divided between the 18 first-class counties and the MCC. If a host decides to sell part or all of its stake, it will hand over 10% of what it receives to be divided between the 18 counties and MCC.\nLittle change is expected to The Hundred for the upcoming 2025 season, which the ECB sees as \"transitional\". Some team names, colours or branding could change in 2026.", "url": "https://www.bbc.com/sport/cricket/articles/c360z2k47jwo"}