{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 08:00:56", "date_modify": "2025-05-21 08:00:56", "date_publish": "2025-01-30 16:19:27", "description": "Arsenal are charged by the Football Association after players surrounded referee Michael Oliver during their 1-0 win against Wolves at Molineux Stadium last weekend.", "filename": "sport_football_articles_cvger7p8z3lo_1747814456.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d3a4/live/d2f88840-df22-11ef-a622-27240dd7c784.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cvger7p8z3lo_1747814456.html", "title": "Arsenal charged over players' reaction to Myles Lewis-Skelly red card", "title_page": "Arsenal charged over players' reaction to Myles Lewis-Skelly red card - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Arsenal have been charged by the Football Association after players confronted referee Michael Oliver following Myles Lewis-Skelly's controversial dismissal in the 1-0 win against Wolves.\nOliver showed Lewis-Skelly a straight red card in the first half after the teenager fouled Matt Doherty, with the referee ruling it was serious foul play.\nThe Gunners appealed against the decision and the 18-year-old's three-match ban was overturned earlier this week.\nArsenal have until 3 February to respond to the FA charge.\nPolice have been investigating \"threats and abuse\" directed at Oliver, said referees' body Professional Game Match Officials Limited.\nThe FA said Arsenal had allegedly failed to ensure their players \"did not behave in an improper manner\".\nDoherty was just outside the Wolves box as he mounted a counter-attack in the 43rd minute when he was brought down by Lewis-Skelly.\nThe decision to send him off was upheld by Darren England, who was the video assistant referee (VAR).\nThe red card infuriated Arsenal boss Mikel Arteta and divided opinion among pundits and fans.\nMatch of the Day pundit Alan Shearer, the Premier League's record goalscorer, said the sending off was \"one of the worst decisions I've seen in a long time\".", "url": "https://www.bbc.com/sport/football/articles/cvger7p8z3lo"}