{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:36:50", "date_modify": "2025-05-20 14:36:50", "date_publish": "2023-07-28 14:34:12", "description": "Nottinghamshire bowl out Kent for 85 before tea on the final day to win by 321 runs.", "filename": "sport_cricket_66335946_1747751810.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/F5ED/production/_130575926_gettyimages-1489427027.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66335946_1747751810.html", "title": "County Championship: Nottinghamshire bowl out Kent for 85 to win by 321 runs", "title_page": "County Championship: Nottinghamshire bowl out Kent for 85 to win by 321 runs - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Five wickets for Dane Patterson and four for Brett Hutton consigned Kent to a rapid and damaging defeat in their County Championship match at Trent Bridge, where they were bowled out for 85 to drop into the bottom two in Division One with only three matches to play.\nPatterson finished with 5-41 in 10 overs, while Hutton's 4-44 allowed him to celebrate a 50-wicket season for the first time in his first-class career, giving him 52 so far.\nKent skipper Jack Leaning's 21 was a paltry top score as Kent, theoretically chasing 407 to win from 72 overs, were dismissed in just 21.3 overs.\nEarlier, Will Young and Ben Slater had both made 87 and Joe Clarke 73 before Nottinghamshire declared their second innings on 372-6 some 40 minutes or so before lunch.\nThe result gives Nottinghamshire 22 points, which is probably enough to ensure they remain in Division One for another season after being promoted in 2022.\nSlater, his eyes on a second hundred in the match, fell to the fifth ball of the day, unable to add to his overnight score, but otherwise Nottinghamshire's plans on how to set up a run chase could not have gone better.\nIf anything, they went too well, the scoreboard turning so rapidly that skipper Steven Mullaney might well have had to think again about when to declare given the overs left in the match. When he did decide the moment was right, some 196 runs had been added in just 78 minutes following Nottinghamshire's resumption on 176-1.\nOf those, 114 came off just 77 balls in a blistering third-wicket stand between New Zealand's Young, who made 87 in the last innings of his brief attachment to the county, and Clarke, whose 73 from 40 balls would have felt like the perfect preparation for his upcoming stint with Welsh Fire in The Hundred.\nClarke hit three sixes, matching Young's tally of maximums in half the number of balls, and there were a couple each for Mullaney and Lyndon James, who hammered 42 in 18 balls for the sixth wicket before Mullaney's dismissal, bowled aiming to inflict more damage in an Arafat Bhuiyan over that had already gone for 20, prompted the declaration.\nEventually caught at deep mid-wicket, Clarke should have gone for 26 but Arshdeep Singh, in his final outing for Kent, dropped a regulation catch at mid-off. Joey Evison, the disappointed bowler and Clarke's former Trent Bridge team-mate, was only too aware of how costly that mistake might be.\nLike Clarke, Young and Tom Moores were caught in the deep going for big returns as Nottinghamshire ultimately pushed the Kent target beyond 400, which was never likely to be a realistic ask of a side lacking so many front-line batters through injuries and international calls.\nYet draw still looked within their capabilities and the rapid unravelling of that possibility came as a surprise.\nIn the eight overs before lunch, their top three all departed. Toby Albert copped a beauty from Hutton to fall for a fourth-ball duck, Ben Geddes fell victim to a fine, rapid-reaction catch by Slater at short leg off Paterson and Ben Compton was leg before to a swinging ball as the South African celebrated his second success.\nLunch did nothing to stiffen Kent's resolve, with Harry Finch soon leg before as Hutton claimed his 50th of the season, before Jack Leaning was caught behind off a bottom edge to make it 51.\nPaterson had Evison caught low down at third slip and Matt Quinn on the boundary as a merrily brief innings ended with a top-edged pull. Alex Blake knew his fate immediately as he saw Mullaney readying himself for the catch as he heaved Hutton over midwicket and Arshdeep, having launched Paterson for six over the leg side, perished next ball, well caught by a diving Hutton at deep backward square attempting a repeat.\nThe two pacemen each took a breather after 10 overs, but Kent's demise was quickly completed as Bhuiyan gave Haseeb Hameed's leg breaks a maiden first-class wicket.\nNottinghamshire paceman Dane Paterson:\n\"It's a very important result for us, looking at the table. It takes us away from the bottom three, which is a good situation to take into the break from red-ball cricket.\n\"The time lost in the game made it more difficult but we were determined to win. The way Joe Clarke and Will Young played this morning, getting runs so quickly from where we were overnight, set the game up to give us enough overs to bowl them out.\n\"Brett (Hutton) was superb again. The way he has been bowling this season, to get 50 wickets with four games left is an incredible achievement. He has worked so hard on his bowling.\n\"He has been in the shadow of Luke Fletcher and myself in the last couple of seasons and it is great to see him get his rewards. I'm really chuffed for him.\"\nKent captain Jack Leaning:\n\"For three days, we were right up with them competing, and then for an hour and a half today we were a mile away. It was pretty abysmal, if I'm honest. They bowled well, they got quite a few wickets from good bowling early doors, but ultimately a few of us got ourselves out.\n\"But we had a young team out there and we actually did pretty well to stay in the game as long as we did. If you take 10 players out of any side it would look a very different team and those injuries have all come at once for us.\n\"We're making too many mistakes as a team and we've got to put that right pretty quickly or we are going to find ourselves playing in Division Two next season.\n\"On the positive side, we were in the same position last season and ended up fifth. Cricket can be a funny game sometimes, and we have a break for the 50-over competition now, where we are the defending champions.\"\nReport supplied by ECB Reporters' Network.", "url": "https://www.bbc.com/sport/cricket/66335946"}