{"authors": ["Carwyn Harris", "www.facebook.com"], "date_download": "2025-05-20 13:28:06", "date_modify": "2025-05-20 13:28:06", "date_publish": "2023-07-26 10:29:07", "description": "Sinead Harris will compete at the 2023 British Transplant Games just six months after undergoing a kidney transplant.", "filename": "sport_wales_66280558_1747747686.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/14063/production/_130491028_dsc_0671.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_wales_66280558_1747747686.html", "title": "British Transplant Games: From kidney surgery to athlete", "title_page": "British Transplant Games: From kidney surgery to athlete - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Run down and constantly groggy, Sinead Harris barely had enough energy to leave the house.\nThat is when she was diagnosed with a chronic kidney disease that had left the organ with just 13% function.\nHowever a transplant has given her a new lease of life and feeling like a \"new\" woman.\nNow just six months after that major surgery, the 32-year-old is preparing to represent Wales at the British Transplant Games in Coventry this week.\nWhile working as a delivery driver during the height of the coronavirus pandemic Harris, from Abercynon, Rhondda Cynon Taf, was diagnosed with the condition.\n\"I was tired all the time. I'd get up half-past nine in the morning but be back in bed by 11 o'clock,\" she said.\n\"I didn't have any energy to do anything, so bar the occasional walk I didn't really go outside of the house for quite some time.\"\nBy the autumn of 2022, she was told by doctors she required a transplant and, as luck would have it, her uncle was a perfect match. It meant she did not require dialysis and after six months, she underwent surgery in January.\n\"I have a new appreciation for everything I'm able to do now. Before I was so limited because I was tired, but it has been great since the surgery,\" she said.\n\"I feel like a new woman. I'm running, I swim twice a week, play tennis and badminton and just try to keep my fitness up.\n\"I've lost a little over 8kg in three-and-a-half months and it's done me the world of good. Before I was getting really frustrated but now I have so much energy and I'm willing to try new things.\"", "url": "https://www.bbc.com/sport/wales/66280558"}