{"authors": ["Sam Drury", "www.facebook.com"], "date_download": "2025-05-21 05:19:04", "date_modify": "2025-05-21 05:19:04", "date_publish": "2025-01-23 09:58:22", "description": "Alex Hartley has been \"hit pretty hard\" by the reaction to revealing she has been shunned by some of her former England team-mates during the Women's Ashes.", "filename": "sport_cricket_articles_c4gwev2083no_1747804744.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1271/live/a2a16d60-d964-11ef-91ba-f9b50d923955.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c4gwev2083no_1747804744.html", "title": "Alex Hartley 'hit pretty hard' by reaction to England players' snub during Women's Ashes", "title_page": "Alex Hartley 'hit pretty hard' by reaction to England players' snub during Women's Ashes - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Alex Hartley says she has been \"hit pretty hard\" by the reaction to revealing she has been given the \"cold shoulder\" by some of her former England team-mates during the Women's Ashes after questioning the team's fitness levels.\nHartley is working as a pundit for the BBC and television networks in Australia and was refused a TV interview by Sophie Ecclestone during the first T20 game on Monday.\nThe 31-year-old said some England players were \"letting the team down when it comes to fitness\" last autumn following their early exit from the T20 World Cup.\n\"It's been a pretty tough few days for me,\" Hartley told TNT Sports. \"I wasn't expecting it to be in the newspapers and all over the UK press so it has actually hit me, personally, pretty hard.\n\"Ultimately, I was frustrated and upset with the events that unfolded before that first T20.\"\nEngland wicketkeeper Amy Jones said she \"doesn't think it is the case\" that Hartley has been shunned and that the team have a \"lot of love\" for the former spinner.\nHowever, ex-England batter Ebony Rainford-Brent says the incident shows the difficulty players face when they move into the commentary box.\n\"I know about moving out of the dressing room, I moved into commentary two weeks later and you don't want to be rubbishing your mates because you're then going to call them for a prosecco and they don't want it,\" the ex-England batter told TNT Sports.\n\"What I like about Hartley is that she is saying the truth, that she feels the players haven't been fit and she's put it out there. She is doing what she should be doing as a broadcaster.\n\"From Ecclestone's perspective, I'm disappointed she didn't follow through with the interview because as a player, there are jobs on the field and jobs off the field.\n\"Women's sport is now in the public eye, my taxi driver today said he had never watched cricket but he knew about this story. Women's sport is on the rise and we've all got to adapt quicker.\"\nEx-Middlesex captain Isabelle Westbury believes England's struggles in Australia combined with the increasing demands on players has exacerbated the issue.\n\"I've got no problem with [Hartley's comments] whatsoever,\" she told BBC Radio 5 Live.\n\"It's more you can understand why some of the remarks have come from the England camp.\n\"They are professionals. We're coming into a new era of women's sport in that they are getting well paid and they have to remember they're not just athletes, but there's a wider obligation here as role models and to speak to the media.\n\"And to improve against a side that is, frankly, thrashing them.\n\"For the greater good of women's sport, this is fantastic. You want some characters in there, you want a bit of bite back.\n\"That's what you get in the men's sports coverage. Why on earth can't we have characters and disagreements and arguments in women's sport? I'm all for it.\"", "url": "https://www.bbc.com/sport/cricket/articles/c4gwev2083no"}