{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:33:32", "date_modify": "2025-05-20 14:33:32", "date_publish": "2023-07-28 19:38:03", "description": "France's Celine Boutier takes the halfway lead of her home major at the Evian Championship with a second-round 69.", "filename": "sport_golf_66343829_1747751612.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/BDD5/production/_130579584_gettyimages-1576227360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_golf_66343829_1747751612.html", "title": "Evian Championship: Celine Boutier leads by one shot at halfway stage", "title_page": "Evian Championship: Celine Boutier leads by one shot at halfway stage - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "France's Celine Boutier took the halfway lead of her home major at the Evian Championship with a two-under-par second-round 69.\nThe world number 15, who has yet to win a major, is one clear of Thailand's Patty Tavatanakit and Japan's Yuka Saso thanks to three birdies in her final seven holes.\nNasa Hataoka, Gaby Lopez and Alison Lee are another shot back in joint fourth.\nFirst-round leader Paula Reto fell four shots behind 29-year-old Boutier.\nThe South African signed for a four-over-par 75 after three bogeys and a double bogey on the back nine.\nSpain's Carlota Ciganda was disqualified because she refused to add a two-shot penalty to her score after being penalised for slow play on the final hole.\nShe had an appeal denied before leaving the scoring tent without adding the penalty\nCiganda had been in a group with Anna Nordqvist and Celine Herbin in windy conditions.\nThe top Briton is Scotland's Gemma Dryburgh on two under after a second 70 in a row.\nLydia Ko of New Zealand fell away with a five-over-par 76, having started the day tied for second.\nEngland's Georgia Hall birdied the final hole to finish on two over alongside compatriot Jodie Ewart Shadoff but Charley Hull missed the cut on five over.", "url": "https://www.bbc.com/sport/golf/66343829"}