{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:26:04", "date_modify": "2025-05-21 07:26:04", "date_publish": "2025-05-20 22:31:17", "description": "After every round of Premier League matches this season, Troy Deeney gives us his team of the week. Do you agree with his choices?", "filename": "sport_football_articles_c2d55n52gkeo_1747812364.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a1ed/live/b4cc5000-35ca-11f0-96c3-cf669419a2b0.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c2d55n52gkeo_1747812364.html", "title": "Troy Deeney's Team of the Week: Martinez, Cucurella, Konsa, Bradley, Milenkovic, Rice, Ayari, Elliott, Ndiaye, Nketiah, Vardy", "title_page": "Troy Deeney's Team of the Week: Martinez, Cucurella, Konsa, Bradley, Milenkovic, Rice, Ayari, Elliott, Ndiaye, Nketiah, Vardy - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "After every round of Premier League matches this season, BBC football pundit Troy Deeney will give you his team and manager of the week.\nHere are this week's choices. Do you agree? Give us your thoughts using the comments form at the bottom of this page.\nMarc Cucurella (Chelsea): He has been really consistent. I wasn't convinced with him at first but he has been proving himself with his displays and he can step up with a big goal at the big moments.\nNikola Milenkovic (Nottingham Forest): The big Serb has arguably been the best centre-half in the Premier League this season. A big shout but he has been really good and scored a big goal in a must-win game for Forest at West Ham. Excellent.\nEzri Konsa (Aston Villa): It is not nice for me to talk about Aston Villa players in a really good way, but these guys are performing big at the moment. An excellent performance and he is growing more as a man and as a leader under Unai Emery. I can see him being a real threat for England in the World Cup - and starting.\nConnor Bradley (Liverpool): A lot of eyes on him. Not only with Trent leaving but what looks like Jeremie Frimpong joining. I think he has been fantastic and showcased how good he can be going forward with a lovely assist at Brighton. A career we will all watch with intrigue. It is up to Mr Frimpong to get him out.\nDeclan Rice (Arsenal): He has stepped up in big, big moments. A lovely finish to beat Newcastle and he is affecting the game all over. He is an infectious personality and now his players are feeding off him. There are a few calls for him to be captain - I don't think that would be fair on Martin Odegaard. But life isn't fair - he is becoming the leader without the armband.\nYasin Ayari (Brighton): A lovely goal against Liverpool. He is a very young, very exciting player but played with a maturity and level of confidence that was very impressive. He is another one Brighton have picked off the conveyor belt. The energy he brings, he wasn't scared to put himself about. Excellent.\nHarvey Elliott (Liverpool): Another youngster who has played with real maturity and confidence. Elliott will have to move on and could play for any of the big teams and be a star.\nIliman Ndiaye (Everton): On what was an emotional day for Everton, I think he epitomised the club and Goodison Park. Not the first person you would pick - he has had ups and downs throughout the year but through his form he has shown a level of class.\nEddie Nketiah (Crystal Palace): Did we see a glimpse of what Crystal Palace could look like without Jean-Philippe Mateta? Maybe. Nketiah has had a tough season at Palace but great to see him scoring and smiling and, again looking ahead to the World Cup, we need young English strikers who are scoring. Nketiah will be trying his best to get on the England plane.\nJamie Vardy (Leicester): The man, the myth, the legend. I don't want to hear Roy of the Rovers any more. All I want to hear is the Jamie Vardy story. Everything he has done in his career was encapsulated as he scored in the win against Ipswich. There is talk of him doing a screenplay - the scene is set to end on '500 games, 200 goals'. Perfect. Can't say enough about the man.", "url": "https://www.bbc.com/sport/football/articles/c2d55n52gkeo"}