{"authors": ["Andy Burke", "www.facebook.com"], "date_download": "2025-05-21 05:27:32", "date_modify": "2025-05-21 05:27:32", "date_publish": "2025-01-16 19:08:19", "description": "Lee McGregor says his goal for 2025 is to capture a world title, with an all-Scottish featherweight showdown with Nathaniel Collins also on his radar.", "filename": "sport_boxing_articles_cn018ln5lp5o_1747805252.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d4a1/live/e17cfd60-d428-11ef-943c-b5e53c85fbbb.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_boxing_articles_cn018ln5lp5o_1747805252.html", "title": "Lee McGregor: Scot seeks world title in 2025 & Nathaniel Collins bout", "title_page": "Lee McGregor: Scot seeks world title in 2025 & Nathaniel Collins bout - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Lee McGregor says his goal for 2025 is to capture a world title, with an all-Scottish featherweight showdown with Nathaniel Collins also on his radar.\nThe Edinburgh fighter, 28, advanced his case for world honours with victory over Isaac Lowe on the undercard of the Tyson Fury-Oleksander Usyk rematch in Riyadh in December.\nNow the Scot wants to kick on for more big nights this year.\n\"I feel like going into 2025, I'm in a very, very good position and I do firmly believe that's going to be the year where I become a world champion,\" McGregor told BBC Scotland.\n\"I've done British, Commonwealth, European, now just picked up the WBC international title in Saudi. So one or two more fights and then I think maybe towards mid-to-late end of the year, I'll hopefully be challenging again for the world title and this time becoming world champion.\"\nMcGregor fell short in his bid to win the IBO world super-bantamweight title when he lost to Erik Robles in July 2023 at Meadowbank.\nA period of rebuilding was required before he was handed his shot at the big time in Saudi Arabia last month.\n\"My career has been full of ups and downs and you've just got to look at 2024, which was the rebuild for me after a tough 2023,\" he explained.\n\"So, I wanted to rebuild in 2024 and I think 18 May was the first Fury-Usyk fight. I was fighting in the Hilton Hotel the same night.\n\"I came out the ring, ran upstairs to my hotel room, quick shower and I was downstairs and I was watching the big fight on the big screen in the Hilton Hotel in Glasgow.\n\"Fast forward to 21 December the same year, I was part of the rematch and it's just unbelievable, surreal. I took the opportunity with both hands. I won and won well. I feel like I boxed well and I looked good doing it and hopefully I can get myself back out there.\"", "url": "https://www.bbc.com/sport/boxing/articles/cn018ln5lp5o"}