{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:48:21", "date_modify": "2025-05-21 05:48:21", "date_publish": "2025-04-02 11:33:24", "description": "Brentford news: Fan views on what no-one is talking about", "filename": "sport_football_articles_cd9lnn8p2vwo_1747806501.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cd9lnn8p2vwo_1747806501.html", "title": "Brentford news: Fan views on what no-one is talking about", "title_page": "Brentford news: Fan views on what no-one is talking about - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your views on the one thing no-one is talking about at Brentford, but really should be.\nHere are some of your comments:\nMitch: My feeling is there absolutely must be something to play for: pride, passion, keeping the name of this club on everyone's lips. But... I've watched too many end of season games where the players are 'on the beach' - Leeds a couple of seasons back, a prime example. We, the fans, are turning up to watch our best players play to their best level against whomever they're playing. If the players are not bothered, then why should we be?\nCharlie: I reckon we give it our absolute all for the past nine games with nothing to lose as we're already safe and have been for a while now. So why not go for a European place? Knowing my Brentford, we've been planning for next season for a while now. We're always prepared for whatever obstacles get in our way whether it's a player potentially leaving etc. I couldn't be prouder of my club anymore with what we've done since being in the Premier League. We haven't looked out of the place since the first game against Arsenal a few years ago. I'm very confident in saying that we are the best run club from top to bottom in the country. Let's be having ya!\nTom: We're finally going to have some full-backs! Fingers crossed Rico Henry and Aaron Hickey will be back with the first team in the coming weeks. It's been more than 500 days since they last played together so it'll be a long awaited reward.\nCliff: Clubs like Brighton and Bournemouth are regularly discussed in the debate for European places but Brentford have been almost totally ignored. We have a tough month of fixtures but we're only a handful of places off a Europa League place so don't write off our season.\nPhilip: Our owner Matthew Benham is looking to sell a minority stake in the club. This will raise a very substantial sum without it burdening us with debt. This will allow potentially larger investment in players to take us to the next level in the coming years. An amazing position for Brentford football club to be in.", "url": "https://www.bbc.com/sport/football/articles/cd9lnn8p2vwo"}