{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:55:44", "date_modify": "2025-05-21 04:55:44", "date_publish": "2025-04-04 14:20:06", "description": "Coventry City goalkeeper Oliver Dovin is to undergo ACL surgery and will miss the remainder of the 2024-25 season.", "filename": "sport_football_articles_cy8q9jg088do_1747803344.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/48ce/live/351661f0-115f-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy8q9jg088do_1747803344.html", "title": "Coventry City: Oliver Dovin out for rest of season with ACL injury", "title_page": "Coventry City: Oliver Dovin out for rest of season with ACL injury - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Coventry City goalkeeper Oliver Dovin will miss the rest of the season after suffering an anterior cruciate ligament (ACL) injury, boss Frank Lampard has confirmed.\nThe Sky Blues shot-stopper was stretchered off during the first half of the 3-1 defeat at Sheffield United last Friday and will undergo surgery on his knee.\nDovin has made 30 appearances for the Sky Blues this season, 28 of them in the Championship, and earned a call-up by Sweden for the recent friendlies against Luxembourg and Northern Ireland, when he was on the bench.\nAhead of Saturday's game against Burnley (12:30 BST), Lampard said: \"We are really disappointed for him. He has got as we feared, an ACL injury which ends his season. He is going to have surgery.\"\nThe 22-year-old was signed from Swedish side Hammarby last summer, penning a four-year deal at the CBS Arena.\nACL recoveries often take around nine months, throwing significant doubt around Dovin's status into the start of next season but Lampard added: \"The time frame, I'm not going to go there, but in the short term we know that his season is done.\n\"He has had an incredible season personally and the strides he's taken since we've been here, making the Sweden squad, makes it slightly more bitter because he's been doing so well.\n\"He is disappointed, particularly in the moments after the injury, as is normal. He should understand how far he has come and it's an unfortunate thing for us and we all support him.\n\"He is a really good lad; low maintenance and he has been brilliant in every sense. We spoke to him, these things are obviously challenging for young players who want to play and want to do well, so we will all support him along the way.\"\nCity sit fifth in the Championship ahead of the visit of third-placed Burnley, but with only a two-point lead in the race for the play-offs with seven games remaining.\nLampard will likely choose between Bradley Collins and Ben Wilson to replace Dovin, while Coventry recalled Luke Bell earlier this week from his loan spell at Southern League Premier Division side Gloucester City.\nCollins has made eight league starts this season to Wilson's three, and replaced Dovin following his injury against Sheffield United.", "url": "https://www.bbc.com/sport/football/articles/cy8q9jg088do"}