{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:44:51", "date_modify": "2025-05-21 03:44:51", "date_publish": "2025-04-06 15:28:42", "description": "Scotland fan views: 'We won't qualify for tournaments any time soon'", "filename": "sport_articles_cvgn8jpj9p3o_1747799091.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2120/live/d45f1fe0-12e5-11f0-b234-07dc7691c360.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cvgn8jpj9p3o_1747799091.html", "title": "Scotland fan views: 'We won't qualify for tournaments any time soon'", "title_page": "Scotland fan views: 'We won't qualify for tournaments any time soon' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your views on Scotland's 4-0 defeat against Germany in the Women's Nations League.\nHere's what some of you said:\nBrian: An absolutely disgraceful performance, team needs a complete overhaul. No fight, no passion and no hope. We travelled down from Aberdeen for that shambles.\nNick: This is no surprise, Scotland are a second or third tier level side. No matter where the game is played they're nowhere near good enough to challenge the big sides, and Germany are certainly one of those.\nRuaridh: Germany had better shape, better attacking options, and just all round looked more likely to score. Fair play to Scotland, they looked as though they weren't beaten, but Germany always looked like champions in the end.\nScott: I knew there was no chance of a victory, it was just a case of how many would the Germans score. The players put a lot of effort in but they are not going to be in any tournament any time soon sadly.\nMike: Sophie Howard leaves a weakness in the centre of defence - was slow to react and caught out of position throughout. The goalkeeper does not look like she is confident. Scotland had control of this game for large periods of the match but did not press into the box much. Lots of random kicking of the ball out from defence that meant the midfield were caught out frequently.", "url": "https://www.bbc.com/sport/articles/cvgn8jpj9p3o"}