{"authors": ["Andrew Benson", "www.facebook.com"], "date_download": "2025-05-19 14:46:43", "date_modify": "2025-05-19 14:46:43", "date_publish": "2015-03-03 12:19:05", "description": "McLaren driver Fernando Alonso will miss the season-opening Australian Grand Prix on 15 March on medical advice.", "filename": "sport_formula1_31713292_1747666003.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81373000/jpg/_81373908_fernando_alonso_getty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_formula1_31713292_1747666003.html", "title": "Fernando Alonso: McLaren driver to miss Australian Grand Prix", "title_page": "Fernando Alonso: McLaren driver to miss Australian Grand Prix - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "McLaren's Fernando Alonso will miss the season-opening Australian Grand Prix on 15 March on medical advice.\nDoctors have advised the 33-year-old Spaniard, who crashed in testing on 22 February, not to risk a second concussion by racing in Melbourne.\nAlonso tweeted:, external \"It will be tough not to be in Australia, but I understand the recommendations.\"\nThe two-time champion's place will be taken by 22-year-old Dane Kevin Magnussen, McLaren's reserve driver.\nMagnussen tweeted: \"Shame about the circumstance but still I'm so excited to be racing in Melbourne.\"\nAlonso was driving at a speed of 215km/h (133.6mph) when he lost control of his car at the Circuit de Barcelona-Catalunya.\nHe hit a wall, suffered two blows to his head and was immediately flown to hospital, where he was kept for three nights.\nMcLaren said a series of medical tests and scans found that the former Ferrari driver had \"no medical issue\" and was \"entirely healthy from neurological and cardiac perspectives alike\".\nBut a team statement said doctors had recommended he should limit his activity \"so as to minimise the chances of second impact syndrome\".", "url": "https://www.bbc.com/sport/formula1/31713292"}