{"authors": ["Sophie Hurcom", "Alistair Durden", "www.facebook.com"], "date_download": "2025-05-21 03:58:24", "date_modify": "2025-05-21 03:58:24", "date_publish": "2025-04-07 08:19:04", "description": "Somerset need to make themselves \"Hundred-ready\" says the county's chief executive Jamie Cox in case the competition expands.", "filename": "sport_cricket_articles_c0el48ndp80o_1747799904.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/62b4/live/6f797650-12bf-11f0-af7d-630082e03613.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c0el48ndp80o_1747799904.html", "title": "Somerset need to be 'Hundred-ready', says chief executive Jamie Cox", "title_page": "Somerset need to be 'Hundred-ready', says chief executive Jamie Cox - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Somerset need to make themselves \"Hundred-ready\" says the county's chief executive Jamie Cox in case the competition expands.\nThe Hundred is currently made up of eight franchises and in February director of business operation of the England and Wales Cricket Board (ECB), Vikram Banerjee, said expansion is a \"no brainer\" if the tournament continues to grow.\nCox, who has been chief executive at the west country county since December 2023, said while entering the Hundred is not necessarily the end-goal, the club want to be at the front of the conversation regardless.\n\"Part of our goal is to make ourselves what we call Hundred-ready,\" Cox told BBC Points West.\n\"That's not to say that we'll endeavour to do whatever we can to get in but we need to make sure that if the opportunity comes we're right at the front of that conversation, so we can make the call at the right time.\"\nThe Hundred launched in 2021 and in February the ECB oversaw the sale of the eight teams to private investors, which had a collective value of over £975m and bringing in around £520m to be split across the game in this country.\nThe eight-week exclusivity period to complete the sales was extended this week.\nThe ECB's broadcast deal with Sky for the competition runs until the end of 2028 and no further teams will be added before then.\nYet former Somerset captain Cox - who was previously director of cricket operations at Marylebone Cricket Club at Lord's said the 100-ball competition is \"transforming\" the sport and Somerset needs to find its place within that.\n\"It's sort of well known with the prospects of the Hundred sale that the game is transforming, it's moving and we've got to figure out what's our role in that,\" Cox said.\n\"We're in a good spot, we've been a competitive and successful county and a real cricket county so what's our role in the future?\n\"We've got an opportunity to figure out what that is because it's really important that we make some good decisions for what's ahead.\"", "url": "https://www.bbc.com/sport/cricket/articles/c0el48ndp80o"}