{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-05-20 12:01:58", "date_modify": "2025-05-20 12:01:58", "date_publish": "2023-08-05 14:38:17", "description": "West Ham are thrashed 4-0 by Bayer Leverkusen in their final pre-season friendly, while Manchester United beat RC Lens after keeper Andre Onana is lobbed from 50 yards.", "filename": "sport_football_66417587_1747742518.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/061E/production/_130666510_gettyimages-1563444579-1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66417587_1747742518.html", "title": "West Ham United thrashed in friendly; Andre Onana lobbed from 50 yards in Manchester United win", "title_page": "West Ham United thrashed in friendly; Andre Onana lobbed from 50 yards in Manchester United win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "West Ham were thrashed 4-0 by Bayer Leverkusen in their final pre-season friendly, while new Manchester United goalkeeper Andre Onana was lobbed from the centre circle against RC Lens.\nGrowing unease among fans about West Ham's lack of signings will only have been heightened by their side's defeat.\nThere is understood to be a difference of opinion between manager David Moyes and technical director Tim Steidten.\nA total of 13 Premier League teams were in pre-season action on Saturday.\nThe thrashing by German side Leverkusen - who were 3-0 up at half-time - will increase the scrutiny on Moyes' side before next Saturday's first league game at Bournemouth.\nMoyes is thought to favour established Premier League players, such as James Ward-Prowse, Chelsea's Conor Gallagher and Manchester United duo Harry Maguire and Scott McTominay.\nHowever, West Ham believe they are too expensive and Steidten has suggested other options.\nThe Hammers believe any tensions that do exist will settle down once the season starts, but results like this will increase the demand to spend some of the £105m raised from the sale of Declan Rice to Arsenal last month.\nTalks are thought to be at an advanced stage over signing Ajax midfielder Edson Alvarez, who was outstanding in Mexico's Gold Cup final triumph against Panama in Los Angeles earlier this month, although no deal has been finalised yet.\nMarcus Rashford was on target for Manchester United as Erik ten Hag's side came from behind to record a 3-1 success against Ligue 1 outfit Lens at Old Trafford.\nA missed chance by Mason Mount and fellow new signing Onana being caught off his line from halfway for Lens' opener did not bode well.\nHowever, in fairness to the Cameroon keeper, he was exposed by Diogo Dalot needlessly giving the ball away in his own half, which gave Florian Sotoca the chance to chip home from 50 yards.\nRashford led the revival, finishing off a fine Antony pass to bring a strong United starting line-up level, before the Brazilian winger put them in front from Alejandro Garnacho's assist.\nNew signing Rasmus Hojlund was introduced to a 57,802 crowd before kick-off but Rashford showed United have one striker in form, powering the header that deflected in off Casemiro to complete the victory.\nTen Hag's side complete their pre-season campaign against Athletic Bilbao in Dublin on Sunday.", "url": "https://www.bbc.com/sport/football/66417587"}