{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:32:46", "date_modify": "2025-05-20 12:32:46", "date_publish": "2023-08-04 09:05:29", "description": "Chelsea confirm capture of France defender Axel Disasi from Monaco on a six-year contract for 45m euros (£38.5m).", "filename": "sport_football_66403293_1747744366.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4C76/production/_130647591_gettyimages-1247201926.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66403293_1747744366.html", "title": "Axel Disasi: Chelsea sign France defender on six-year deal", "title_page": "Axel Disasi: Chelsea sign France defender on six-year deal - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "France international defender Axel Disasi has joined Chelsea from Monaco on a six-year contract for 45m euros (£38.5m).\nDisasi, 25, offers defensive cover at Stamford Bridge after Wesley Fofana sustained a serious knee injury.\nHe played in all 38 of Monaco's Ligue 1 games last season.\n\"I am really proud to be able to be a part of this great family,\" Disasi told Chelsea's website, external.\n\"I hope to achieve very big things here. To win titles. I will do everything I can to achieve those objectives. I am very ambitious.\"\nThe Blues, meanwhile, have agreed a fee with Brighton for goalkeeper Robert Sanchez, while several bids for the Spaniard's team-mate Moises Caicedo have been rejected by the Seagulls.\nDisasi has played four times for France, including featuring as a substitute in the 2022 World Cup final defeat against Argentina, and made 129 appearances for Monaco after joining from Stade de Reims in August 2020.\nThe centre-back becomes Chelsea's sixth signing of the summer following the acquisitions of Christopher Nkunku, Nicolas Jackson, Lesley Ugochukwu, Angelo Gabriel and Diego Moreira, as new manager Mauricio Pochettino continues to put his stamp on the squad.\nDisasi will compete with fellow central defenders Thiago Silva, Trevoh Chalobah, and Levi Colwill - who signed a new deal on 2 August - for a starting berth, while compatriot Benoit Badiashile will miss the start of the Premier League season with a hamstring injury and Fofana is expected to be sidelined for several months after damaging his anterior cruciate ligament.\n\"I can't wait to feel the energy of the fans,\" Disasi added.\n\"The fervour of the fans in the Premier League, the atmosphere, the intensity of the games - it is something that excites me.\"\nChelsea's pre-season fixtures concluded on Sunday with a 1-1 draw against Borussia Dortmund in Chicago - ending their US tour undefeated - and the focus now turns to their opening Premier League game of 2023-24 at home to Liverpool on 13 August.\nPochettino has been tasked with overhauling the squad while also trying to vastly improve on last season's 12th-place finish in the Premier League.\nMateo Kovacic, Edouard Mendy, Kalidou Koulibaly, N'Golo Kante, Mason Mount, Kai Havertz, Christian Pulisic, Ruben Loftus-Cheek, Ethan Ampadu, Pierre Emerick-Aubameyang, Abdul Rahman Baba and former captain Cesar Azpilicueta have all departed the club so far this summer.\nCo-sporting directors Laurence Stewart and Paul Winstanley told the club's website, external: \"Axel has showcased his quality over several seasons in France and that has deservedly led to recognition on the international stage.\n\"He is ready to take the next step in his career and we are delighted that will be with Chelsea. We welcome him to the club and look forward to him joining up with Mauricio Pochettino and his new teammates in the days ahead.\"", "url": "https://www.bbc.com/sport/football/66403293"}