{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:29:03", "date_modify": "2025-04-26 06:29:03", "date_publish": "2025-02-27 11:17:33", "description": "Issy Wong is included in an England pathway squad for a training camp in Abu Dhabi.", "filename": "sport_cricket_articles_c4gpp3zldn9o_1745648943.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0150/live/2f9782a0-f4f8-11ef-a2a8-e1b826ae43ce.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_cricket_articles_c4gpp3zldn9o_1745648943.html", "title": "Issy Wong: Fast bowler include in England pathway squad for Abu Dhabi training camp", "title_page": "Issy Wong: Fast bowler include in England pathway squad for Abu Dhabi training camp - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Issy Wong has been included in an England pathway squad for a training camp in Abu Dhabi.\nThe 22-year-old Warwickshire fast bowler is part of a 15-player group which has flown to the United Arab Emirates for the warm-weather camp.\nWong is attempting to reignite her England career after falling out of favour following a slump in form since 2023.\nShe made her debut in all three formats as a 20-year-old in 2022 and with her pace and aggression, was seen as one of England's most exciting prospects.\nFormer England coach Mark Robinson recently said she had been mishandled after being made a \"pin-up girl\" by the England and Wales Cricket Broad (ECB).\nWong has been given a development contract from the ECB for 2024-25 and most recently played in the white-ball series against Ireland last September, when most of the first XI were preparing for the T20 World Cup.\nWong, who has taken 16 wickets across all three formats for England, will work with pace bowling performance programme coach Chris Liddle during the camp from 27 February to 8 March.\n\"Within the player group, we are also excited for the next phase of our pace programme and getting the players exposed to scenario training and the challenges that it brings,\" Liddle said.\n\"We have seen some great improvements over the winter in each player and this camp provides a further step in their growth, allowing improvements made already to be developed under further pressure.\"\nRyana MacDonald-Gay, who played for England during their Ashes whitewash defeat, is also in the squad along with Mahika Gaur, Bess Heath, Freya Kemp and Katie George.", "url": "https://www.bbc.co.uk/sport/cricket/articles/c4gpp3zldn9o"}