{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:55:52", "date_modify": "2025-05-21 05:55:52", "date_publish": "2025-02-01 00:00:00", "description": "Watch live coverage of France v Wales in the men's U20 Six Nations.", "filename": "sport_rugby-union_live_c20w89rg788t_1747806952.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_live_c20w89rg788t_1747806952.html", "title": "U20 Six Nations LIVE: France v Wales", "title_page": "U20 Six Nations LIVE: France v Wales - watch stream - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "What happened in last year's tournament?\nBBC Sport\nBoth Ireland and England were undefeated in the competition last year, drawing a thriller 32-32 in Bath.\nEngland came from behind to beat France with a bonus point in Pau and pip Ireland to the title by one point.\nIn July, Mark Mapletoft's side added the World Under-20 Championship to their Six Nations title, beating France in the final.\nPlayers to watch in the U20 Six Nations\nBBC Sport\nFrance - Simeli Daunivucu\nCentre Daunivucu made his La Rochelle debut last season and has featured 11 times for Ronan O'Gara's side.\nThe 19-year-old is a strong, skilful player and son of former Fiji scrum-half Jone Daunivucu.\nHe was selected for France's tour of Argentina in the summer but did not pick up his first senior cap.\nWales - Tom Bowen\nThe 19-year-old has started three games for Cardiff on the left wing in this year's Challenge Cup, scoring on his debut against South African side Cheetahs.\nBowen has a lethal left-foot step and an exceptional turn of pace, which has been evident already in the professional game.\nSix Nations - graduating from U20 to senior level\nBBC Sport\nEngland\nJack van Poortvliet played at both the 2020 and 2021 editions of the U20 Six nations. He captained his side to victory in the 2021 edition and made his senior England debut the following year. Van Poortvliet has been named in Steve Borthwick’s squad for the 2025 six nations tournament.\nFin Baxter played a handful of games in England’s 2021 U20 Six Nations side and captained the U20s in the 2022 edition of the tournament. The prop received his first senior call up in May 2024 and has been named in the 2025 Six Nations squad.\nWales\nJac Morgan captained Wales in the U20 Six Nations in 2020, achieving more turnovers than any other player in the tournament before it got halted due to the COVID pandemic. He made his senior Wales debut in 2022 and has made 17 appearances, and will captain Wales for the 2025 Six Nations tournament.\nEvan Lloyd played for Wales in the 2021 U20 Six Nations Championship. The Hooker has made five senior appearances since he made his debut in 2024 and will look to add to that as a part of the 2025 Six Nations squad.\nWales’ Freddie Thomas actually played for England in the 2021 U20 Six Nations tournament. The Gloucester-born player has made just one appearance for the senior team but has a spot in the 2025 Six Nations squad.\nDan Edwards is one of two uncapped players in the Welsh 2025 six nations squad. He made his U20s debut in the 2020 Six Nations, and started all six matches in the 2023 U20 Six Nations edition.\nIreland\nGus McCarthy captained Ireland to victory in the 2023 U20 Six Nations tournament. He made his senior debut in November 2024, and scored a week later on the 150th anniversary of the IRFU.\nFrance\nNolann Le Garrec played for France in the 2021 U20 Six Nations. The scrum-half has made six appearances for the seniors since making his debut in 2024.\nNicolas Depoortere captained France in the 2023 U20 Six Nations tournament, and made his debut for the senior team in 2024.\nHow to get into rugby union\nBBC Sport\nWhy get into rugby union?\nIf you enjoy being active and want to build your fitness with team mates then this is the game for you.\nWho is it for?\nIt's one of the most inclusive sports around and there are various versions of the game that you can test out.\nIs there a cheap option?\nYou can just play touch rugby in the park with a bunch of friends or family, but joining a club can be inexpensive.\nWhat if I want a proper workout?\nFrom scrummaging to tackling, to sprinting with the ball, this can be a high intensity workout that will boost both your fitness and your strength.\nCan I take it to another level?\nWork your way up. Start with a club then look to your county and from there people will start noticing you.\nIs there a disability option?\nWheelchair rugby was a big hit at the 2012 Paralympics. There are now chances to have a go all over the UK.\nIs there a family option?\nMost clubs will cater for all the family with kids' teams, and men's and women's teams for mum and dad.\nTag rugby , externalis a great introduction to the sport for youngsters, with tackling replaced by a cloth attached players' waists, which opposition players have to remove and shout 'tag!', leaving the ball carrier with three seconds to pass.\nTouch rugby, external is similar to tag, except all a defender needs to do is touch the opposition to tackle.\nSearch for your local club in England, , externalScotland, , externalWales, external or Northern Ireland., external", "url": "https://www.bbc.com/sport/rugby-union/live/c20w89rg788t"}