{"authors": ["Brian McLauchlin", "www.facebook.com"], "date_download": "2025-04-26 08:06:30", "date_modify": "2025-04-26 08:06:30", "date_publish": "2025-02-26 14:34:40", "description": "How a potentially tricky night at Hibs agm turned to buoyant mood", "filename": "sport_articles_cqx097pgdwlo_1745654790.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8963/live/b72eaa90-f44e-11ef-896e-d7e7fb1719a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cqx097pgdwlo_1745654790.html", "title": "How a potentially tricky night at Hibs agm turned to buoyant mood", "title_page": "How a potentially tricky night at Hibs agm turned to buoyant mood - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "When Hibernian recently announced losses of £7.2m in their annual accounts it rocked supporters and shareholders.\nIt is an astonishing loss. Just how can a club with an income of around £15m go so far over budget?\nAt Tuesday night's annual general meeting in the Famous Five Stand, around 200 shareholders gathered to ask key questions of the board.\nNew finance director Philippa Lombardi gave an impressive presentation, pointing out areas where money had been spent and admitting mistakes had been made, saying under her watch this won't happen again.\nAnd when Ian Gordon confirmed his family were underwriting these losses and the cash would be offered as a donation it put everyone in the room at ease.\nGordon also gave an impressive presentation about the vision moving forward and how the partnership with Bill Foley and his Black Knight organisation can bring success to the club both on and off the park.\nThe most important aspect of any football club is what happens on the pitch and sporting director Malky Mackay showed those in attendance the plans to make Hibs a real force again in Scottish football and beyond.\nSo what could have been a tricky night for those on the board turned into one where the vast majority of shareholders left the room in buoyant mood.\nThey have undoubtedly been helped by the team's form, with the victory against Celtic fresh in everyone's minds and Hibs having gone 13 games undefeated.", "url": "https://www.bbc.co.uk/sport/articles/cqx097pgdwlo"}