{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:17:27", "date_modify": "2025-05-21 06:17:27", "date_publish": "2025-03-31 08:00:31", "description": "Brighton news: Fan views on Nottingham Forest FA Cup defeat", "filename": "sport_football_articles_ckg8453wjklo_1747808247.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ckg8453wjklo_1747808247.html", "title": "Brighton news: Fan views on Nottingham Forest FA Cup defeat", "title_page": "Brighton news: Fan views on Nottingham Forest FA Cup defeat - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your views on Brighton's penalty shootout defeat by Nottingham Forest in the quarter-finals of the FA Cup.\nHere are some of your comments:\nMick: We weren't good enough - we looked jaded and lacking in energy. Too many passes went astray. If we had played with the intensity of the final 10 minutes of extra time, we would have won. Let's reset and concentrate on the league and getting into Europe.\nDavid: The best team on the night won. Too much strolling around and standing still with the ball. You never score by continually passing the ball backwards. Georginio Rutter's injury certainly affected the game. Disappointing but Europe is still possible.\nFran: Not our best performance. Not sure why but we always seem lethargic after any international break or any break come to that. Not just this game but in previous seasons as well. Concentrate now on finishing as high as possible.\nChris: Kudos to Nuno Espirito Santo for the way he prepared Forest. They made the Seagulls look bad every time we managed to get into the final third of the pitch. Too many poor passes and too many speculative no-look passes that were often picked off by a Forest player. I have to wonder if we've got the player depth to make it back to European football this season.\nFred: Was inevitable we would go out once it got to pens. Feels like a real missed opportunity. We have two huge games in the next week so the boys need to bounce back quickly.", "url": "https://www.bbc.com/sport/football/articles/ckg8453wjklo"}