{"authors": ["Katie Wright", "www.facebook.com"], "date_download": "2025-04-26 06:13:26", "date_modify": "2025-04-26 06:13:26", "date_publish": "2025-03-02 06:09:06", "description": "Former England captain Casey Stoney tells BBC Sport how she and her family have rebuilt their lives after her sacking by San Diego Wave left them effectively homeless.", "filename": "sport_football_articles_c62z76ewgn0o_1745648006.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d867/live/34f4eb70-f72d-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c62z76ewgn0o_1745648006.html", "title": "Casey Stoney: Ex-England captain on rebuilding after San Diego sacking and becoming Canada boss", "title_page": "Casey Stoney: Ex-England captain on rebuilding after San Diego sacking and becoming Canada boss - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Casey Stoney was only meant to be returning to England temporarily last June for a funeral when she found herself stuck in the country, along with her family, unable to go back to their home in California.\nUpon landing on British soil, the former England captain was informed by her agent that she had been sacked as head coach of NWSL club San Diego Wave.\n\"When I got fired, it terminated our visas with immediate effect whilst I was in the UK, pretty much rendering me and my partner homeless, with three children,\" she tells BBC Sport.\nAs she had been outside of the US when her sacking happened and her visa was dependent on her work, she had no way of returning without finding another sponsor.\nThat led to a turbulent few months for the 42-year-old, who was left questioning whether she even wanted to keep working in football.\nNow the former Manchester United boss is taking on international management for the first time in her new role as Canada coach, and is finally back to doing what she loves - getting out on the training pitch and working with her players.\nStoney, who won 130 caps for England and captained Great Britain at the 2012 Olympics, had been in charge of San Diego Wave for nearly three years after resigning as Manchester United manager in 2021.\nThe NWSL club were a new franchise when she became head coach and she led them to third place and then top spot during the first two seasons.\nThey twice reached the semi-finals of the end-of-season play-offs, which crowns the league's champions, but her third season had not continued on the same trajectory with just three wins after 14 games.\nShe saw the job as a long-term project. She had experienced a painful spell apart from her partner, Megan, and three children - twins Teddy and Tilly and youngest child Willow - when she first moved to the US but they had eventually resolved their visa issues, enabling them to be reunited, and set up their family home in California.\n\"It took 22 months to get them out there, we were 22 months apart, we weren't even out there a year [together] and I lost my job,\" she says.\n\"If I'm honest, I didn't think I deserved to lose my job either, so that made it even tougher, with the successes that we had, we just had a little dip. It wasn't even anything major.\n\"So to be treated in that way, after everything that had been done and sacrificed and everything that had been achieved, it was really, really hard to swallow on a personal level, but it was more what happened to my family.\n\"I have three young children, they were nine and six at the time, they didn't have a home. So that, for me, is inexcusable to do to a family.\"\nThe day her children were supposed to be back at school in August in San Diego following their summer break came and went, so Stoney took on home-schooling herself.\nIt was a period she describes as \"one of the hardest times in my life\".\nShe says: \"It did make me question if I wanted to stay in the game because if the game chews you up and spits you out like that, after everything that we had sacrificed to be there, and after what I had achieved in a short space of time, and what we had achieved as a club, it did make me question the game.\n\"I got offers quite quickly after the announcement and I said no to all of them, whether they were right or wrong, because I wanted to take time. I needed to make sure I sorted our lives out.\n\"My priority was my family [and] how do we get back to San Diego.\"\nIt took four months for the family to get new visas, based on Stoney's consultancy work, enabling them to return to the US and \"our lives\". They had relied on family in England to provide a roof over their heads in the interim.\n\"[The children] missed two and a half months of education. They missed a lot of their life during that time.\"\nShe also had a lot of time for self-reflection and took the opportunity to visit different clubs as she reassessed her priorities.\n\"It just helped me get to a point where I was ready to get back in [to football] and I was very keen to get back in. At first I couldn't have thought of anything less that I wanted to be involved in and it just took a bit of time to heal the wounds.\"\nThe ex-England defender was spotted at her former club Arsenal, who were looking for a replacement for Jonas Eidevall while she was out of work, while other Women's Super League clubs also had vacancies during that time.\nBut then along came the Canada job.\nAt first she was unsure whether she wanted to move into international football and leave behind what she \"loves\", which is working with players day to day.\nYet the initial conversations proved appealing and she found herself in a lengthy interview process lasting some three to four months.\n\"I really liked that it was extensive,\" she says. \"It meant that their hiring process was thorough. I got to interview them as much as they interviewed me.\"\nThat included speaking to the manager of the men's team, former Leeds boss Jesse Marsch, who had already made the transition from club to the international game.\nAnd she was impressed – by the organisation's leadership led by chief executive Kevin Blue, the culture of the team, and the talent of the players, plus Canada were happy for her to continue living in California if she took the role.\n\"When I interviewed for this job, Kevin was very clear that I didn't have to move,\" she said.\n\"That's been really, really beneficial for us as a family. I don't think people understand when you take on a head coach role, and I understand people say you're in a privileged position, but it's the impact on your family it has.\n\"I had young children that just didn't understand what was going on [when she was sacked] - lots of tears, lots of heartache, that I felt like I'd contributed to that, which was difficult.\n\"There were jobs open in the UK at the time when I didn't have a job. There were some I would have been interested in, some I wouldn't have been interested in, but as soon as I got involved in this process it became clear I was really interested in this [and] I was only committed to one thing.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c62z76ewgn0o"}