{"authors": ["Chris Wathan", "www.facebook.com"], "date_download": "2025-04-26 07:28:08", "date_modify": "2025-04-26 07:28:08", "date_publish": "2025-02-27 19:33:26", "description": "Recently retired James Chester has no regrets after putting his body on the line for Aston Villa.", "filename": "sport_football_articles_c0rzqk9d0rro_1745652488.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f8b5/live/e7529f30-f474-11ef-aeb3-bb556fdec0fe.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c0rzqk9d0rro_1745652488.html", "title": "The player who sacrificed his career for Aston Villa", "title_page": "James Chester: The player who sacrificed his career for Aston Villa - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "\"I've damaged my body indefinitely.\"\nAs Aston Villa resume their bid to reach Wembley with Friday's fifth round tie against Cardiff City, the comments of a former captain made under the arch continue to jar.\nJames Chester had just been part of the celebrations as Villa sealed a promotion to the Premier League when he told reporters the extent of his sacrifice.\nHe had played through injury for three months to avoid derailing a promotion bid. By the time Villa reached the 2019 play-off final to beat Derby County, the Wales defender was in a tracksuit having succumbed to a persistent knee problem.\nFor Villa, the six years since have seen the club go from strength to strength; from Championship to Champions League and hopes of a first FA Cup win since 1957.\nFor Chester, there were only a hundred or so further games, the majority in the lower tiers. No more Wales caps to add to his 35 that included all games in the run to the Euro 2016 semi-finals. No more reaching the levels he knew he had been capable of as a central defender of calmness and quiet toughness.\nBut, after the repercussions of that decision finally led to the retirement that came a few weeks ago, no regrets either.\n\"It's made the last five or six years tough,\" 36-year-old Chester says. \"It's been difficult at times when some of the performances I produced were almost alien to what I was what I was used to.\n\"But when I go back to Aston Villa, it's the first topic conversation that the fans speak to me about: how grateful they are of the decision I made to continue playing.\n\"To see where the club are now, it's almost a justification for the decision I made.\"\nThe club then was in a very different place. Chester had joined Villa in the second tier in the summer of 2016. It took a while for the club to shake off frustrations and financial concerns.\nChester was almost sold to help pay bills, but he stayed on to help the team, a key man for a side containing the emerging Jack Grealish as they found their feet under Dean Smith having lost the 2018 play-off final to Fulham.\n\"We played Derby in the November and as soon as I got in the car my knee was aching,\" recalls Chester. He met up with Wales and played 50 minutes of their Nations League tie with Denmark. Unbeknown to him, it would be his final international appearance.\nThe soreness had been there a while. First a scan suggested fluid before it became apparent his cartilage was deteriorating. Every run, every bend, would aggravate the issue.\nWith Villa short of centre-backs, Chester opted to play on – at least until the January transfer window – despite the increasing pain, despite the risks, and despite eventually getting to a point it was miserable being on the pitch.\nBut, having been safely navigated through to the window, Chester had done his job. His final game of the season was an agonising one against Ipswich. Tyrone Mings arrived on loan from Bournemouth five days later. The injured captain lifted the play-off trophy in a tracksuit alongside Grealish.\nAnd yet Chester is not from Birmingham, not a boyhood Villa fan – though he says they are \"his club\" now – and had seen his old manager at Hull, Steve Bruce, sacked.\nSo why put his body on the line?\n\"I think it's just the way I was brought up at home, the way we were brought up through the academy at Manchester United,\" he says. \"I'd like to think it epitomises me as a person.\n\"There's always certain clubs you play for that take a hold of you and Aston Villa did that. That first season was difficult but as soon as you walk through the door you understand the size of the club and you see the potential.\n\"The first season was difficult but the aim when I signed was to get back into the Premier League. The club was turning itself around and had a really good togetherness – and when you believe in the cause you're fighting for you're probably willing to go further.\"\nVilla did go further, but Chester eventually went elsewhere.\nHe waited 11 months before he was able to return to the pitch, playing a handful of Premier League games before moves to Stoke City, Derby and – after time without a club – eventually time in League Two with Barrow and, most recently, Salford.\nThe knee affected performances, random muscular injuries began to impact availability. While Villa fans rediscovered belief in achieving at the top, Chester found his joy when he dropped to the other end.\n\"I was probably kicking the can down the road for the last two or three years but I'm glad I did,\" he says.\n\"It gave me the opportunity to play in front of my children. I didn't see myself playing in League Two at this stage of my career, but the year at Barrow was some of the most fun and best memories the game gave me, just to remember that feelings of why you first play football.\n\"When you're in professional football for a long time you probably forget with the pressure of the clubs you play for the results required, just enjoying the game and the company you're in.\"\nPerhaps that was best illustrated as part of the 'Together Stronger' Wales group under Chris Coleman.\n\"My wife actually asked me on the day I retired what was the favourite part of my career, and I said the Euros,\" he says, before laughing that she didn't roll her eyes given most of the fans and squad of that time still happily reminisce of a summer that has become almost mythical in Welsh football.\n\"I think she was worried I was going to be an emotional state so I got a pass to talk about it. But I think everyone who shared that journey would say the same.\"\nChester admits excitement about Wales' future under Craig Bellamy, and over where his own journey leads to now. There are no plans set in stone, but he had begun a sporting director course via the PFA having been intrigued by the role and some of the decisions he's seen made through his playing days.\nHis decision to officially retire will see him stay at Salford to shadow such roles to continue his learning and – it appears – helping the club.\n\"If they get something back financially with me ending the my deal earlier with the constraint there are lower down the pyramid, then it could allow bring some players in to hopefully push the club to the next level,\" he says.\nA fitting move in keeping with that decision at Villa, the club appearing to recognise the significance of his role; he was among a select few former players to recently help model a 150th anniversary kit worn as they started their FA Cup run with a third round win over West Ham.\n\"I'd hope so,\" he laughs when asked if he'd be able to get a ticket for Wembley if Villa went all the way. \"I was at the fourth round (against Tottenham) too so perhaps I'm a lucky omen!\n\"I'm not saying that we as a squad thought that within five years the club would be in the Champions League knock-out stages,\" he adds.\n\"But, once you play for them, you can see the potential the club has and it's nice to see them fulfilling that. They've been incredibly well run and, to see where the club is now, I'm incredibly proud of the part I've played.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c0rzqk9d0rro"}