{"authors": ["Nick Webb", "www.facebook.com"], "date_download": "2025-05-20 11:41:24", "date_modify": "2025-05-20 11:41:24", "date_publish": "2023-08-06 17:24:32", "description": "A brilliant century from Colin Ingram steers Glamorgan to a seven-wicket win as they chase down a target of 299 away to Derbyshire.", "filename": "sport_cricket_66419354_1747741284.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/935F/production/_130672773_cdf_190822_glamorgan_v_hampshire80.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66419354_1747741284.html", "title": "One-Day Cup: Colin Ingram ton leads Glamorgan to win over Derbyshire", "title_page": "One-Day Cup: Colin Ingram ton leads Glamorgan to win over Derbyshire - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Colin Ingram's mature century saw Glamorgan home to a seven-wicket win at Derby as they reached 299-3 with 17 balls to spare.\nIngram, who suffered a calf injury during his innings, added 135 with Kiran Carlson (65) in the key stand.\nDerbyshire's 298-8 was built on a fine opening start of 134 inside 25 overs from Harry Came (73) and Luis Reece (69).\nHaider Ali hit a rapid 63 but Ben Kellaway (3-41) sparked a collapse.\nThe home side's opening pair, who added 360 without loss on the final day of the Championship game against Glamorgan, picked up where they left off despite a restrained start after being put in.\nDerbyshire belted 78 off the second 10 overs in a rapid gear-change, their progress being interrupted only by Reece being hit on the elbow by a throw, followed by a delay for the removal of fox dirt from the outfield.\nReece hit nine fours and a six before providing Kellaway with a maiden List A wicket as he was stumped by fellow teenager Alex Horton.\nKellaway then ran out Came, whose career-best score came off just 86 balls, with a direct hit from point, also poleaxing Horton, who was hit on the foot by the ricochet in a chaotic moment.\nHaider Ali picked up the tempo again as he sped to his half-century off 42 balls and hit three sixes before slicing Kellaway to point, and the back end of the innings petered out despite Brooke Guest's 35.\nAndy Gorvin picked up two wickets in the charge while Jamie McIlroy (1-43) was the pick of the seamers.\nDerbyshire's 299 looked a challenging target and Glamorgan's patient start was very similar to the home side on a slowish pitch as Eddie Byrom and Tom Bevan got used to conditions in a stand of 81.\nBevan struck two sixes in his 44 off 43 before lofting Anuj Dal to deep mid-wicket, while Byrom was caught behind off Nick Potts for 30.\nThe experienced Ingram started cautiously before accelerating, but Carlson took the initiative and quickly got the visitors back up towards the required rate, reaching his 50 off just 40 balls with a six into the pavilion seating.\nDerbyshire tried their occasional spinners as they struggled to make the breakthrough, and Ingram went through the gears despite a calf niggle as his 50 only took 45 deliveries.\nCarlson's scintillating knock ended when he top-edged a sweep off off-spinner Alex Thomson after a stand of 135 with Ingram, giving Derbyshire a sliver of hope.\nThomson and Reece managed to regain some control but Billy Root gave good support to Ingram with 34 not out off 31 balls.\nIngram was able to find the boundary often enough not to need quick singles, and he lofted Reece into the pavilion seating to finish the match in a grand manner.\nHe will sit out at least Glamorgan's next match against Durham at Neath on Tuesday 8 August while Derbyshire entertain Sussex the following day.\nGlamorgan's Colin Ingram told BBC Sport Wales:\n\"I went out there with a clear mind and Kiran played ultra-positively to get us going so I fed off that and played what was in front of me.\n\"It looked like a big total but it was still a good wicket and there were a lot of boundary options, we got the innings flowing and I tried to just steer that on, then Billy came in and hit the ball sweetly.\n\"Ben Kellaway was bowling to some really good players there and bowled beautifully, the attack in generally dragged us back into the game which was excellent.\n\"I struggled during the Blast with a bit of a calf strain, it reared its head again today. It's unlikely I'll play again this week, hopefully I'll miss about two games and then be back.\"\nDerbyshire's Harry Came told BBC Radio Derby:\n\"We were about 30 runs short, being two (wickets) down for nearly 200, we would have liked to get at least 330 and that killed us in the end.\n\"Hopefully we can learn our lessons, come back Wednesday and get plenty of runs on the board.\n\"It's been a good season (personally) but I would have liked more match-winning performances, it's very frustrating to be on the losing side today.\n\"We've shown at times we can play some really awesome cricket in this competition but we've been five or 10 per cent short so far.\"", "url": "https://www.bbc.com/sport/cricket/66419354"}