{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:28:41", "date_modify": "2025-05-21 06:28:41", "date_publish": "2025-04-02 00:00:00", "description": "Stuttgart reach the German Cup final for the first time since 2013 with a hard-fought victory over RB Leipzig at MHPArena.", "filename": "sport_football_live_clyzy9976kwt_1747808921.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f7c9/live/2ef86630-1004-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_clyzy9976kwt_1747808921.html", "title": "German Cup: Stuttgart beat RB Leipzig to reach final", "title_page": "German Cup: Stuttgart beat RB Leipzig to reach final - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Stuttgart reached the German Cup final for the first time since 2013 with a hard-fought victory over RB Leipzig at MHPArena.\nA superb 20-yard volley from Germany midfielder Angelo Stiller gave Sebastian Hoeness' side an early lead, with Nick Woltemade doubling the hosts' advantage 12 minutes after the break.\nLeipzig, who won the competition in 2022 and 2023, briefly reduced their arrears thanks to a composed finish from Slovenia international Benjamin Sesko.\nHowever, Germany winger Jamie Leweling prodded in from close range to restore Stuttgart's two-goal cushion against a Leipzig side managed by interim boss Zsolt Low, who took over after Marco Rose was sacked on Sunday.\nWhile Sesko hit the crossbar late on for the visitors, it was not to be their night with on-loan Bayern Munich goalkeeper Alexander Nubel making several excellent saves to deny Lois Openda in the first period, when Stuttgart were on the back foot.\nStuttgart, who last won the competition in 1997 when Giovane Elber was the match-winner, will now face third-tier Arminia Bielefeld in the final at Berlin's Olympiastadion on 24 May.", "url": "https://www.bbc.com/sport/football/live/clyzy9976kwt"}