{"authors": ["Alex Turk", "www.facebook.com"], "date_download": "2025-04-26 08:07:51", "date_modify": "2025-04-26 08:07:51", "date_publish": "2025-02-26 14:00:42", "description": "Man Utd news: Opinion - A new striker or 'brutal reality' awaits", "filename": "sport_football_articles_cpq29pwnr1ro_1745654871.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a3e3/live/587ec2b0-b62d-11ee-8f07-bbfdfa890097.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cpq29pwnr1ro_1745654871.html", "title": "A new striker or 'brutal reality' awaits", "title_page": "Man Utd news: Opinion - A new striker or 'brutal reality' awaits - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Manchester United are near the depths of the Premier League for a reason. The brutal reality is that they will remain there unless a new striker is leading the line next season.\nAnd I'm not talking about another \"long-term investment\". United do not need another raw striker aged between 20 and 23 with just one season of goalscoring on their resume.\nUnited are crying out for a seasoned frontman who is nearing or in the peak of their powers and will guarantee at least 15 league goals per season.\nA top-five finish looks increasingly likely to be enough to qualify for next season's Champions League. Nottingham Forest and Bournemouth are among the clubs vying to compete against Europe's elite.\nMeanwhile, the most striking fifth-place standing you can associate United with this term is on the rankings for the top flight's worst attacks.\nOnly Everton and relegation-destined Ipswich Town, Leicester City and Southampton have lacked bite in the box more than Erik ten Hag, Ruud van Nistelrooy and Ruben Amorim's attack.\nAnd you do not have to boast industry-leading analytical prowess to understand why that is the case.\nRasmus Hojlund, Joshua Zirkzee and Alejandro Garnacho are the only senior forwards at Amorim's disposal for the rest of the season.\nAmad Diallo is ruled out with ankle ligament damage, while United could not replace winter loan exits Marcus Rashford and Antony amid severe financial constraints.\nHojlund has not scored a goal in his past 16 appearances. Garnacho's drought extends to 19 matches. He has not been assisting much either.\nIf you revisit Zirkzee's previous 19 outings, you will watch two strikes. It is hardly a Golden Boot-winning rate, is it?\nMinimal service? Sure. But United's chance-conversion rate is another metric among the Premier League's most damning.\nIneos simply cannot afford to follow suit and misfire this summer.", "url": "https://www.bbc.co.uk/sport/football/articles/cpq29pwnr1ro"}