{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:43:48", "date_modify": "2025-05-21 06:43:48", "date_publish": "2025-03-30 22:38:44", "description": "Australia's Min Woo Lee claims his first PGA Tour win with victory at the Houston Open in a dramatic finish.", "filename": "sport_golf_articles_cgrgj4kw1g7o_1747809828.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b2ab/live/7b549320-0db4-11f0-9b13-5102cdf6ad17.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_golf_articles_cgrgj4kw1g7o_1747809828.html", "title": "Min Woo Lee holds off Scottie Scheffler and Gary Woodland to win Houston Open", "title_page": "Min Woo Lee holds off Scottie Scheffler and Gary Woodland to win Houston Open - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Australia's Min Woo Lee claimed his first PGA Tour win with victory at the Houston Open in a dramatic finish.\nLee was leading by three shots on 21 under from Scottie Scheffler and Gary Woodland when he put his tee shot into the water at the par-five 16th and carded a bogey.\nWoodland finished with an eagle and two birdies from his final four holes to equal the course record of 62 and set the clubhouse lead at 19 under.\nWorld number one Scheffler, playing in the penultimate group, had a chance to take a share of the lead on the 17th but missed a putt for a fifth consecutive birdie - and also ended on 19 under after a final-round 63.\nLee needed a par on the 18th to secure victory and managed it, holding his nerve to card a 67 and finish one shot clear on 20 under.\n\"It's hard, really hard,\" said Lee, 26, after his triumph. \"Scottie is a wonderful golfer and he keeps you on your toes.\n\"This is my first time being in front and trying to hold a lead. I'm glad I got it done, but man, I'm just very exhausted.\n\"It was a lot of mental grind. I'm so proud of the way I handled myself.\"\nNorthern Ireland's Rory McIlroy produced an impressive six-under-par round of 64, which included an eagle, six birdies and a bogey, as he got to 15 under.\n\"It was a good week,\" said McIlroy, who is hoping to complete a career Grand Slam by winning the Masters at Augusta next month.\n\"I still feel like I've got some stuff to work on. Overall, a solid week and nice to have another week to get ready and fine tune my game for Augusta.\n\"My right elbow has been bothering me a little bit so [I'll] maybe just get some treatment on that to make sure it's OK going into Augusta.\"", "url": "https://www.bbc.com/sport/golf/articles/cgrgj4kw1g7o"}