{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:23:21", "date_modify": "2025-05-19 14:23:21", "date_publish": "2015-04-17 13:49:07", "description": "Championship strugglers Millwall are four points from safety following their 0-0 draw away against mid-table Cardiff City.", "filename": "sport_football_32261753_1747664601.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/82408000/jpg/_82408512_cdf_180415_cf_cardiff_v_millwall_22.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_32261753_1747664601.html", "title": "Cardiff City 0-0 Millwall", "title_page": "Cardiff City 0-0 Millwall - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Relegation-threatened Millwall gained what could be a vital point in their bid for Championship survival, drawing 0-0 at mid-table Cardiff City.\nBluebirds midfielder Joe Ralls, 21, came closest to breaking the deadlock in a first half of few chances, hitting the Millwall bar with a cross-shot.\nAfter the break Mark Beevers rattled the Cardiff crossbar for the visitors.\nThe Lions are four points from safety with three games to go, while the Bluebirds stay in 13th.\nNeil Harris' side's hopes of extending their five-season stay in the Championship may now hinge on the Football League.\nIts disciplinary commission is set to decide, before the end of the season, whether to deduct points from Rotherham United - the team one place above them - for fielding an ineligible player.\nOn the field, tempers boiled over on a hot day in the Welsh capital after Lee Gregory's high challenge on Cardiff defender Bruno Ecuele Manga.\nLee Peltier reacted angrily to the challenge and had to be calmed down by his Bluebirds team-mates, as he and the Millwall striker were both booked.\nChances were few and far between in the opening 45 minutes, with Ralls's effort beating Millwall goalkeeper David Forde but hitting the woodwork.\nLions captain Alan Dunne fired his side's best effort of the half straight at Cardiff goalkeeper David Marshall from just outside the box.\nThe London club nearly made the breakthrough early in the second half as Beevers smashed a powerful shot against the bar, and Marshall reacted well to deny Gregory from slotting home the rebound.\nCardiff created little of note in the second half and Millwall looked most likely to score.\nBluebirds defender Sean Morrison lost the ball to Lions attacker Lee Martin and his pass found Aiden O'Brien unmarked inside the box, but Marshall kept out the striker's effort with his legs.\nGary Taylor-Fletcher spurned a great opportunity to win it for the Lions late on, but failed to trouble Marshall after not connecting with the ball properly just nine yards out.\nMillwall travel to Blackburn Rovers away on Tuesday 21 April, while Cardiff host already relegated Blackpool at home on Saturday 25 April.\nMillwall boss Neil Harris: \"I know as much as you guys about the Rotherham situation. We just know we are back in the mix. It does not help us not knowing but we have to look after ourselves and keep going.\n\"The teams above us are looking over their shoulders. It may not have been the best of games but we are showing we have got what it takes to win football games - and it means the sides above us know they need to pick up wins.\"\nCardiff assistant manager Scott Young: \"It was not a great game or a great spectacle. Millwall came with a game plan to slow the game down and make it a niggly affair.\n\"We try to give the fans something to smile about every time we go on to the pitch and we are as disappointed as the fans. We edged the first half but, give them credit, they were probably the better team in the second half.\"", "url": "https://www.bbc.com/sport/football/32261753"}