{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:40:29", "date_modify": "2025-05-21 05:40:29", "date_publish": "2025-04-06 00:00:00", "description": "Southampton suffer the earliest relegation in Premier League history after a Brennan Johnson brace earned Tottenham Hotspur a comfortable victory in North London.", "filename": "sport_football_live_crkxdgxzdvmt_1747806029.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/df2a/live/f96150b0-12f4-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_crkxdgxzdvmt_1747806029.html", "title": "Tottenham Hotspur 3-1 Southampton: Saints relegated in record time", "title_page": "Tottenham Hotspur 3-1 Southampton: Saints relegated in record time - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Southampton suffered the earliest relegation in Premier League history after a Brennan Johnson double inspired Tottenham Hotspur to a comfortable victory in North London.\nThe Wales forward converted Djed Spence's cut-back in the 13th minute, before he latched on to James Maddison's header over the defence to flick in a second three minutes before half-time.\nMateus Fernandes replied in the 90th minute, but Mathys Tel claimed his first Spurs league goal with a penalty in added time to ensure Saints became the first Premier League side to be relegated with seven games left, beating the previous record of six.\nA subdued atmosphere hung over Tottenham Hotspur Stadium following another pre-match fan protest against chairman Daniel Levy and discontent with manager Ange Postecoglou, following a run of one win in their last 10 home league games that had left them fifth from bottom at the start of the day.\nSpurs started brightly though, with Johnson and Lucas Bergvall creating problems and Cristian Romero's thumping header forcing Saints goalkeeper Aaron Ramsdale into a smart stop from a corner.\nThings could have turned sour for the hosts, though, when Kamaldeen Sulemana drifted in at the far post following a rare foray forward for the visitors, but his shot was deflected on to the post by Pedro Porro.\nSpurs responded immediately to claim the opener and ease nerves through Johnson's 10th league goal of the campaign.\nRomero was again denied by Ramsdale when another powerful header struck the face of the former Arsenal keeper.\nBergvall thought he had doubled the lead when he bundled home Romero's knock-down from a free-kick, but the Argentine defender was judged to have been offside after a four-minute video assistant referee (VAR) check.\nBoss Postecoglou was visibly frustrated on the touchline, but cracked a smile when Johnson caught the Saints defenders on their heels and slotted past Ramsdale.\nSouthampton improved after the break and dominated possession, with Fernandes chesting down Sulemana's cross and firing through the legs of Vicario in the 90th minute for a late consolation.\nRamsdale made five saves - including fine stops from Spence and Dominic Solanke - to keep the hosts at bay, but Tel's penalty - following a foul by Welington on Johnson - sealed Southampton's fate with an instant return to the Championship.\nRooted to the bottom on 10 points, Saints now need two more points to avoid beating Derby County's record-low tally of 11, achieved in 2007-08.\nSpurs' 11th win of the season moved them up to 13th in the table with 37 points.\nHave your say on Tottenham's performance\nWhat did you make of Southampton's display?\nWith a backdrop of growing tensions between Postecoglou and supporters, and protests against Levy, a second home league win of 2025 was exactly what Tottenham needed.\nThey should really have gone into half-time with the three points secured.\nSaints goalkeeper Ramsdale was engaged in something of a running battle to deny Romero a goal, although it was surprising how quiet Son Heung-min was on his 450th appearance for the club.\nThe lively Johnson earned a deserved player of the match award, winning the late penalty and allowing loanee Tel to record a confidence-boosting goal.\n\"He was outstanding and earned the penalty,\" Postecoglou said of Johnson. \"His general play was really good, not just his goals, so really pleased for him.\"\nPostecoglou was less pleased with the way his side fell away after the break - and unable to keep a first clean sheet since February.\n\"The first half was really good, really pleased,\" he added. \"We were a bit sloppy with the ball in the second half. [There is] stuff to improve on, but it is a victory with three goals so positive.\n\"We looked threatening every time we went forward in the first half. We performed well in the first half and we have got to make sure we do that for the full 90.\"", "url": "https://www.bbc.com/sport/football/live/crkxdgxzdvmt"}