{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:04:34", "date_modify": "2025-04-26 04:04:34", "date_publish": "2025-03-03 18:45:04", "description": "Kent head coach Adam Hollioake has said he has been made to feel immediately welcome in his new surroundings following his first official day in the role.", "filename": "sport_cricket_articles_cqjd7kr9edpo_1745640274.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9899/live/c32411f0-f85e-11ef-b809-97b36d89f5f9.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_cricket_articles_cqjd7kr9edpo_1745640274.html", "title": "Adam Hollioake: New Kent head coach made to feel very welcome", "title_page": "Adam Hollioake: New Kent head coach made to feel very welcome - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Kent head coach Adam Hollioake has said he has been made to feel immediately welcome in his new surroundings following his first official day in his new role.\nThe 53-year-old was appointed in December after signing a deal until the end of the 2027 season and arrived in Canterbury on Monday.\n\"Everyone's been really friendly, they've welcomed me,\" Hollioake said.\n\"I spent a bit of time with the boys out in Mumbai - they're a great bunch of guys.\"\nBorn in Melbourne but opting to represent England at international level, Hollioake spent the majority of his playing career at Surrey between 1992 and 2004, leading them to three County Championship titles as captain.\n\"Fundamentally, I'm a pretty laid-back guy, until I'm not,\" he added.\n\"As long as people are trying their hardest, taking the game on aggressively, trying to remove the fear of failure, the results will come.\"\nDespite his previous allegiances at rivals Surrey, Hollioake is ready to leave the past behind him and help achieve a new era with Kent.\n\"I've got a message for the members. I think I was here for 15 years during my career and they booed me every time I came out to play here,\" he said.\n\"I'm actually looking forward to hopefully getting a couple of claps this time. It'll be nice to have them on my side for once because for 15 years, I was getting sick of the sight of them.\"\nKent, who were relegated to Division Two last season, get their County Championship campaign under way at Northamptonshire on 4 April.", "url": "https://www.bbc.co.uk/sport/cricket/articles/cqjd7kr9edpo"}