{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:22:52", "date_modify": "2025-05-20 13:22:52", "date_publish": "2023-08-02 10:07:39", "description": "Miller 'possesses an intelligence beyond his years'", "filename": "sport_articles_c3ge76nnvp9o_1747747372.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f5b1/live/2377b6f0-3110-11ee-8f52-fbf70e4bf742.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c3ge76nnvp9o_1747747372.html", "title": "Miller 'possesses an intelligence beyond his years'", "title_page": "Miller 'possesses an intelligence beyond his years' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jane Lewis, BBC Sport Scotland\nThe early - albeit very early - signs look good for Motherwell. Three wins and a draw in the Viaplay Cup group stages secured progression to the last 16.\nCoupled with the side’s strong finish to last season, Motherwell fans have every right to feel confident about the campaign ahead.\nStuart Kettlewell was a huge factor in turning around the club’s fortunes last season. Motherwell didn’t look back after he was appointed interim manager in mid-February. They picked up 30 points from their final 14 games of the season, and the misery fans had endured for much of the season seemed like a distant memory.\nFor this season, the club have lost some key players, with Kevin Van Veen being the most significant departure. Max Johnston’s exit for Sturm Graz will also be felt. Stuart McKinstry, James Furlong and Ollie Crankshaw all returned to their parent clubs in May, while Mikael Mandron left for Premiership rivals St Mirren.\nSo far five players have come in, and it’s perhaps too early to judge, but there are signs of promise there. For one, Jon Obika’s loan spell has led to a permanent deal, and in three starts since, he’s scored twice.\nFans will always be intrigued to see how their summer signings fare, but it’s a name familiar to most Motherwell supporters who’s getting them most excited.\nYouth academy graduate Lennon Miller started all four of the club’s Viaplay Cup group games, and his performances so far, have earned rave reviews.\nHe’s exciting to watch, full of confidence, and for one so young (he turns 17 later this month), he seems to possess an intelligence on the park beyond his years.\nStuart Kettlewell will be just as excited as the fans are to see how this young talent develops this season and beyond. He’ll be mindful of his age and the concerns that can bring, while acknowledging that he could be ready to make a significant contribution to Motherwell’s season.", "url": "https://www.bbc.com/sport/articles/c3ge76nnvp9o"}