{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:33:39", "date_modify": "2025-04-26 07:33:39", "date_publish": "2025-02-27 16:00:12", "description": "BBC Sport football expert Chris Sutton takes on comedian and Plymouth fan Josh Widdicombe with his predictions for the eight FA Cup fifth-round ties.", "filename": "sport_football_articles_cx28v54g7wjo_1745652819.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/46d3/live/5ec0ece0-f1f8-11ef-8c03-7dfdbeeb2526.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cx28v54g7wjo_1745652819.html", "title": "Sutton's FA Cup fifth-round predictions v comedian Josh Widdicombe", "title_page": "Sutton's FA Cup fifth-round predictions v comedian Josh Widdicombe - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Plymouth have already shocked Brentford and Liverpool in the FA Cup this season, but can they upset another Premier League team, Manchester City, in round five?\n\"Argyle have gone really direct under new manager Miron Muslic,\" said BBC Sport football expert Chris Sutton.\n\"It's a great clash of styles with the possession football that Pep Guardiola plays, but the problem if you keep going long against City is that you keep giving them the ball back.\"\nSutton has made his predictions for all eight fifth-round ties and for this weekend's matches he is up against comedian and Plymouth fan Josh Widdicombe.\nWiddicombe is touring the UK with his 'Not My Cup Of Tea' stand-up show in 2025 and 2026, which culminates with two nights at the Hackney Empire in London.\nDo you agree with their scores? You can choose who you think will win each tie, below.\nJosh missed Plymouth's famous win over Liverpool in round four because he was at a Strictly Come Dancing Live Show with his daughter, so will he be at Etihad Stadium this weekend?\n\"No, I will be in Chipping Norton, doing a preview show for my tour,\" he told BBC Sport.\n\"My on-stage time will be 7.30pm which would be when injury time starts. That's life!\n\"I was actually disappointed we got City because when you get into the fifth round of the FA Cup, you start thinking that, if we get an easy draw, we are in the quarter-finals.\n\"So, City were the worst possible draw, really. The fact the FA Cup is the only thing they can win doesn't help much either. If they were playing in the Champions League next week we would be in a slightly better position.\n\"Still, the longer we go without conceding, the more I will dare to dream. I would obviously take penalties now, in a heartbeat, even though I would be on stage.\n\"Although, by the time penalties happen, after all the injury time and extra time, it might be around 8.15pm, which is when my break usually is.\n\"That's what I am going to be wishing for, because I might just get to see a shootout - but honestly let's just hope the tie is still up for grabs when I go on stage.\"\nJosh co-hosted the cult podcast about 1990s football 'Quickly Kevin, Will He Score?' between 2017 and 2024 and feels that decade was full of classic FA Cup moments.\n\"There were lots of iconic finals in the 1990s,\" he added. \"I can instantly tell you the result and every goalscorer of every one, while I am struggling to tell you who won it last year.\n\"That's because of a combination of two things - firstly, in the same way you remember what was Christmas number one when you were a kid, everything is more vivid the first time around - it is more exciting and seems to matter more.\n\"Also, sadly, the FA Cup is not nearly as important as it was. You've even got some Plymouth fans saying they would rather stay up than win it this season - my response to that is 'are you clinically insane? Who cares if we stay up!'.\n\"In a few years you are not going to say 'oh thank God we are in the Championship. You are going to go 'can you remember when we won the FA Cup!?!' That's what you dream about.\n\"Those one-off events are the things you cling on to, and in a strange way I am glad that because I wasn't able to go to our win over Liverpool, I was at Strictly Live with my daughter instead.\n\"That makes it more of a memory for me. I will always remember where I was when it happened, and it wasn't just the case where I was at home watching on TV and then I had to go to the park.\"\nChris Sutton and Josh Widdicombe were speaking to BBC Sport's Chris Bevan.\nAston Villa 2-0 Cardiff City\n10th in Premier League v 19th in Championship\nGap = 29\nLive commentary on BBC Radio 5 Live.\nThe rest of the season is going to be a bit of a juggling act for Aston Villa.\nThey are still in the Champions League and also trying to finish high enough in the Premier League to qualify for it again next season.\nSo, it will be interesting to see if they target the FA Cup too. I'm sure Unai Emery would ideally like to keep his finger in every pie, but we've seen how that has stretched his squad already.\nStill, this is where you want to be as a Villa fan, with your team fighting on all fronts near the end of the season - and they will be favourites for this tie even if Emery rests players.\nLet's face it, Cardiff are pretty hopeless, especially on the road where they have only won one Championship game all season.\nCardiff have won away twice in the FA Cup, against Sheffield United and Stoke City, but it was basically the Blades reserves who they beat in round three.\nThey may rest players too - it depends whether they prioritise this tie or their relegation fight and Tuesday's league game at home to Burnley - but, even if they don't make changes, Villa will probably be too strong for them, especially at home.\nSutton's prediction: 3-1\nJosh's prediction: Villa are still in the Champions League but they still seem to me to be a team for the FA Cup this year, because they are not going to win anything else, realistically.\nSo, there is quite a lot in this for them while, in contrast, if any of the Championship teams are going to be focused on the league it is Cardiff. 3-0\nJosh's favourite FA Cup moment: It would probably be Wrexham beating Arsenal in 1992 with Mickey Thomas's free-kick for their equaliser. I don't like Wrexham now because they are the big dogs of the lower leagues but that was the iconic upset of my childhood.\nIt was probably the first big one that I saw for myself. When I was a kid, all the same FA Cup upsets used to get talked about all the time - like Hereford against Newcastle - but this was the first proper one I remember, after Arsenal had won the league and Wrexham had finished bottom.\nCrystal Palace 3-1 Millwall\n12th in Premier League v 12th in Championship\nGap = 8\nWatch live on BBC One, BBC iPlayer and the BBC Sport website. Live commentary on BBC Radio 5 Live.\nWill in-form Crystal Palace go for it in the FA Cup? I really hope so.\nOliver Glasner's side have improved as the season has gone on and they are comfortably in mid-table of the Premier League without any danger of going down. A cup run would really cap this as a successful campaign for him.\nIt would have an even bigger impact for Palace's fans. I still remember Ian Wright's goals in the 1990 final where they lost to Manchester United in a replay. They lost to United in the 2016 final too, and it would be great to give them a new memory.\nThis won't be easy, because former Norwich boss Alex Neil took charge of Millwall at the end of last year and is doing a good job.\nThey have been quite stubborn in recent weeks and I'm expecting more of the same here, but the Eagles should edge it in normal time.\nSutton's prediction: 2-1\nJosh's prediction: We beat Millwall 5-1 off the back of of our win over Liverpool, which was a bit of a freak result. Normally you'd lose straight after that kind of game.\nLike Villa, Palace are another team who should be going for the FA Cup but Millwall have reached the final in my lifetime, even if it was fully 21 years ago.\nI'd gone for a replay at first, before I remembered there aren't any - the death of FA Cup replays is very sad, isn't it? 1-1 after extra time, then Millwall to win on penalties\nPreston North End 3-0 Burnley\n15th in Championship v 3rd in Championship\nGap = 12\nWatch live on BBC iPlayer and the BBC Sport website.\nThis will be 0-0 after 90 minutes, 0-0 after extra time and 0-0 after the first five penalties by each team in the shootout.\nIt ended 0-0 when they played each other in the league a couple of weeks ago and I'd be shocked if we see anything different this time, bearing in mind how both teams are set up.\nMaybe they should just play a kind of 'golden goal' from the start on Saturday where the first team to score, wins?\nBurnley have kept 12 consecutive clean sheets in the Championship and their defensive record is incredible but I suppose it might open things up a bit if their manager Scott Parker has one eye on automatic promotion and makes changes before they go to Cardiff on Tuesday.\nPreston boss Paul Heckingbottom probably has more scope to go for it, but his side are not exactly prolific so there are not going to be many goals here.\nLet's be honest, this is unlikely to be a thriller.\nSutton's prediction: 0-0 after extra time, Burnley to win 1-0 on penalties\nJosh's prediction: Preston are perennially fine in the Championship - I can't remember the last time they changed division and they must be quite a boring club to support.\nBurnley in contrast are one of the six teams that are forever going to switch between the Premier League and the Championship. They are trying to win promotion this time by not conceding any goals whatsoever, which is different, but still not very exciting for their fans.\nThis is a local derby, but it is such a dry game. I'll go 1-0 to Burnley - no, 1-0 to Preston. 1-0\nBournemouth 1-1 Wolves (Bournemouth win 5-4 on penalties)\n7th in Premier League v 17th in Premier League\nGap = 10\nLive commentary on BBC Radio 5 Live.\nWolves won here in the Premier League on Saturday but only after Bournemouth had Illia Zabarnyi sent off in the first half. That completely skewed that result so I am not using it as a form guide for this tie.\nWhat will be more relevant is how many changes both teams make for this game.\nI was at Wolves' win over Blackburn in round four and their manager Vitor Pereira went kind of half-strong there. I can guarantee you he will be prioritising Premier League survival ahead of FA Cup progress, so we will probably see another mix-and-match selection from him here too.\nAs for Bournemouth, well I have already talked about why Crystal Palace should be trying to win the FA Cup this season, and the same definitely applies to Andoni Iraola's side.\nThe Cherries have only reached the quarter-finals twice before, losing at that stage in 1957 and 2021, and their best moments in the competition are probably as a lower-league giantkiller, such as when they beat Manchester United as a third-tier team in 1984.\nThis year they are genuine contenders to win it and lift the club's first major trophy, and they have already shown they can beat anyone, especially at home.\nThey are still seventh in the Premier League despite losing their past two matches, and I would be really disappointed - no, actually I'd be angry - if Iraola picks a weakened team in the situation they are in.\nHe has got a responsibility to the fans to try to reach the semi-finals for the first time. Yes they have got a chance of making the Champions League, which would be incredible, but they are only two wins away from their biggest day out ever at Wembley. Why not go for it?\nSutton's prediction: 2-1\nJosh's prediction: Usually, the result never recurs when teams play each other twice in a short space of time, so I am backing Bournemouth. 2-0\nManchester City 3-1 Plymouth Argyle\n4th in Premier League v 22nd in Championship\nGap = 38\nLive commentary on BBC Radio 5 Live.\nThe FA Cup is Manchester City's only realistic chance of a trophy this season, so there is no chance they will lack focus here.\nCity come into this tie off the back of a good win at Tottenham on Wednesday, which I predicted. The readers went for a Spurs victory, which was just ridiculous - what on earth were you thinking?\nI am going for Pep Guardiola's side to win this comfortably, but fair play to Plymouth for getting this far.\nThey have knocked out Liverpool and won at Brentford but it is going to be third time unlucky for them against Premier League teams.\nWith what is at stake for them, City cannot let this one slip - and they won't.\nSutton's prediction: 5-0\nJosh's prediction: I think it is absurd when fans predict victories for their own team. They do it all the time, while I just go into every game thinking we are going to lose - that is my attitude to life, that surely this is going to go wrong.\nSo, I think we are going to lose every game 4-0, which actually feels like a worthwhile prediction here. Then you are always pleasantly surprised - well, maybe not always, but most of the time - when you don't.\nWe have played very, kind of, pretty football for the past five years but under our new manager, our playing style is, shall we say, a little more industrial these days.\nIt's much worse when you are at home trying to break down a team in the Championship but it is perfect for this scenario, away at Manchester City. We are practising the right type of football to cause an FA Cup upset but the truth of it is that we are not going to win, so who cares!? 4-0\nJosh on who will win the FA Cup? I obviously want Plymouth to win it but I think City will do it. So, in a way, this is one of those games where people say 'this is the real final'. Whoever wins out of Plymouth and City will go on and win the FA Cup.\nManchester United 1-1 Fulham (Fulham win 4-3 on pens)\n14th in Premier League v 9th in Premier League\nGap = 5\nWatch live on BBC One, BBC iPlayer and the BBC Sport website.\nI am sick of backing Manchester United. Even though they beat Ipswich on Wednesday, they did not half make hard work of it and the Tractor Boys ran them close at Old Trafford.\nAlejandro Garnacho appeared to have a bit of a hissy fit after being hooked before half-time, so it will be interesting to see how Ruben Amorim deals with that. He won't have any players left at this rate if he decides to leave Garnacho out.\nUnited are the FA Cup holders and they have beaten Fulham home and away already this season but on both occasions it was far from convincing, and I don't really care about that anyway.\nAmorim is a likeable guy, and I've got sympathy for him about the size of his task at Old Trafford but, from watching United, I cannot think of any reason to back them to win this.\nI am usually wrong about Fulham, but they are going to take this one - 100%.\nSutton's prediction: 0-3\nJosh's prediction: I can see United getting to the cup final this year. They were quite jammy on their way to winning it last year - against Coventry in the semi-final for example - but were they actually jammy? It meant they kept Erik ten Hag for another six months which is probably the worst thing which could have happened to them. I don't know if that FA Cup win has made this season much worse. 2-0\nCity Ground, 19:30 GMT\n3rd in Premier League v 18th in Premier League\nGap = 15\nLive commentary on BBC Radio 5 Live.\nIpswich boss Kieran McKenna made 11 changes when his side beat Coventry in round four and I suspect he will do something similar here.\nYou might have heard about 'Sutton's Super Computer', which were the calculations I did for the Monday Night Club this week, where I worked out the results of all the remaining Premier League fixtures.\nAccording to my secret formula, which is obviously extremely scientific, the Tractor Boys only have an outside chance of staying up. Along with Leicester they were in my 'no-hopers' category.\nMaybe Ipswich can surprise me and go on an FA Cup run, but you have to fancy Nottingham Forest here.\nDefeat would just leave a grim fight against relegation for McKenna's side, so I feel for my daughter's teacher, Mr Fields, who regular readers will know follows the Tractor Boys, but not so much for my 5 Live colleague Ali Bruce-Ball who is a phony Ipswich supporter - when I asked him, he could not remember the last time he went to watch them as a fan.\nOne thing I really can't stand are people like Bruce who attach themselves to a club which has a bit of success, claiming some tenuous link from the past.\nMy boyhood team Forest may make changes too because they are still in a good position for a Champions League spot, but I am backing Chris Wood to come off the bench and get us a winner.\nSutton's prediction: 2-1 after extra time\nJosh's prediction: Forest are another throwback team who do not seem to have had a decent Cup run for a long time. 2-0\nJosh's favourite FA Cup final of the 1990s: Spurs versus Forest in 1991 was a really important and seismic one, because of Gazza [Paul Gascoigne] and what it did to his career.\nThere were some other great ones too, though, like 1997 when Middlesbrough lost to Chelsea. That was quite fun because of Roberto di Matteo's goal after 47 seconds.\nThen there was 1995 when Manchester United lost to Everton after they had been going for the Double and lost everything, and even 1993 was interesting because Arsenal and Sheffield Wednesday met in both domestic cup finals. I'm not going to, but you could write a book about the history of 90s football based around those finals, because they mattered so much then.", "url": "https://www.bbc.co.uk/sport/football/articles/cx28v54g7wjo"}