{"authors": ["Nizaar Kinsella", "Simon Stone", "www.facebook.com"], "date_download": "2025-05-21 03:42:43", "date_modify": "2025-05-21 03:42:43", "date_publish": "2025-02-01 18:04:54", "description": "Chelsea midfielder Carney Chukwuemeka, 21, could move to Germany on loan with Borussia Dortmund to get his career back on track after an ill-fated spell at Stamford Bridge.", "filename": "sport_football_articles_c983jppdjn1o_1747798963.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9d62/live/65d546f0-e0c5-11ef-80f0-273d2cd9a9c9.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c983jppdjn1o_1747798963.html", "title": "Carney Chukwuemeka: Dortmund make loan move for Chelsea midfielder", "title_page": "Carney Chukwuemeka: Dortmund make loan move for Chelsea midfielder - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Dortmund have made a loan move for Chelsea midfielder Carney Chukwuemeka.\nThe 21-year-old midfielder is deemed surplus to requirements by manager Enzo Maresca and now subject to talks which could include an option to buy.\nThe Blues previously valued their £20m signing from Aston Villa in 2022 at around £40m, but have since lowered their demands to allow him to move on loan.\nChukwuemeka joined Chelsea on a six-year contract, but struggled with injuries in his first two seasons.\nHe has made just four appearances this season, without making a single matchday squad in the Premier League, despite being injury-free.\nThe Blues have also left open the option of sending Chukwuemeka on loan to their partner club Strasbourg, who are also owned by Todd Boehly and Clearlake Capital, with defender Caleb Wiley expected to be recalled to free up a third and final loan spot in France.\nDortmund are 10th in the Bundesliga table but are now led by former Bayern Munich manager Niko Kovac.", "url": "https://www.bbc.com/sport/football/articles/c983jppdjn1o"}