{"authors": ["Stephan Shemilt", "www.facebook.com"], "date_download": "2025-05-19 14:40:44", "date_modify": "2025-05-19 14:40:44", "date_publish": "2017-08-07 16:44:46", "description": "England beat South Africa by 177 runs in the fourth and final Test at Old Trafford to complete a 3-1 series win.", "filename": "sport_cricket_40856217_1747665644.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/107EC/production/_97246576_englandgetty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_cricket_40856217_1747665644.html", "title": "England v South Africa: Joe Root's side complete 3-1 series win", "title_page": "England v South Africa: Joe Root's side complete 3-1 series win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Moeen Ali claimed five wickets as England completed a 177-run win over South Africa in the fourth Test at Old Trafford to seal a 3-1 series victory.\nThe Proteas, chasing an unlikely 380, were bowled out for 202, with James Anderson also picking up 3-16.\nEngland were held up by Hashim Amla, who made 83, but after he was dismissed they lost their last seven wickets for 39 runs.\nIt is England's first home Test series win against South Africa since 1998.\nIt also ends a run of three series without a win and gives Joe Root success in his first as captain.\nEngland climb to third in the International Cricket Council's Test rankings,, external above Australia, who they meet in defence of the Ashes this winter.\nTheir next assignment is a three-Test series against West Indies, which begins with the first day-night match in this country at Edgbaston on 17 August.\nMoeen had blasted a thrilling 67 on the third evening and was left unbeaten on 75 as England lost their final two wickets to be bowled out in their second innings for 243.\nAfter Anderson, Stuart Broad and Toby Roland-Jones took a wicket apiece, Moeen was asked to wheel away with his off-spin, only to be thwarted by the imperious Amla.\nBut, when he switched ends, he trapped Amla leg before and worked through the rest of the South Africa line-up.\nQuinton de Kock played a loose drive to slash to gully and Theinus de Bruyn tamely edged to slip.\nMoeen ended the third Test at The Oval with a hat-trick and closed this match with two wickets in two balls - Morne Morkel holed out to mid-off and Duanne Olivier nicked to slip.\nMoeen is the first man to take 25 wickets and score more than 250 runs in a four-match Test series.\nFormer captain Amla has endured a mixed series, averaging 35 before this knock, but the 34-year-old gave a reminder of his excellence in what his likely to be his last Test innings in this country.\nOn an increasingly uneven surface and faced with some testing England new-ball bowling, South Africa found themselves 40-3, with Amla needing 19 balls to get off the mark.\nBut, after lunch, the right-hander played classy front and back-foot drives off the seamers, as well as reverse-sweeping Moeen and hitting the spinner for a straight six.\nHe added 123 with skipper Faf du Plessis, who made a gritty 61. While they were together, the prospect of the game reaching a fifth day seemed real.\nBut, when Amla tried to work Moeen to the leg side, he was hit in front of the stumps.\nThe initial appeal reprieved him, but the review sealed his fate and the rest followed quickly.\nThough England have ultimately won this series by a comfortable margin, they are still no closer to solving the problems that existed beforehand.\nOpener Keaton Jennings has averaged only 15 and looks set to be replaced, while Tom Westley and Dawid Malan - given opportunities at three and five respectively - have not yet proven they belong at this level.\nIn a series where matches have been won by huge margins, England have triumphed in the Tests in which they won the toss and batted first. But they remain vulnerable when batting second.\nHowever, they have seen the emergence of Roland-Jones. The Middlesex pace bowler has taken 10 wickets in two matches and looks a strong candidate for the Ashes squad.\nEngland's man of the series Moeen Ali, as chosen by South Africa coach Russell Domingo: \"This series I have felt more consistent with bat and ball, especially ball. I felt in good rhythm after the first game. I contributed with the bat a couple of times. In general, I'm very pleased.\n\"It doesn't matter what I'm labelled as, when we play one spinner, I'm the lead, if we play two then, depending on who it is, I may be second fiddle. But I have the experience in international cricket now and it's a good challenge.\n\"I was patient before I got my wickets today. My hat-trick at The Oval, to win the way we did, I felt was massive for my confidence. I still can't believe I have a hat-trick in international cricket.\"\nEngland bowler James Anderson, who ended the series with 20 wickets: \"It's an amazing win, we played really well through the game.\n\"We had some tough patches to get through. Bairstow's innings was crucial and Moeen in the second innings played brilliantly well, then finished it off with his bowling today.\n\"I'd like to say we were calm on the field today but the way the game has gone we knew it only takes one wicket and then you lose some in a cluster. We kept faith.\"\nSouth Africa's man of the series Morne Morkel: \"I'll enjoy this champagne tonight... it was hard work.\n\"Personally you set some goals for the year and this was definitely one of them. I was pleased what I did with the ball. The most important thing is to keep asking questions. I've committed to hitting that fuller length and I have done that consistently.\n\"As soon as the ball went a bit softer it is important to get a fuller length consistently. I worked hard on that and hopefully it is something I can continue to do.\"", "url": "https://www.bbc.com/sport/cricket/40856217"}