{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:02:34", "date_modify": "2025-05-20 14:02:34", "date_publish": "2023-07-30 13:25:14", "description": "Liverpool: Klopp on Nunez, Gakpo, Jota, Salah and Diaz", "filename": "sport_articles_cyx99r7dyg0o_1747749754.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b07d/live/ac4d59d0-2edb-11ee-999b-b74dedc428d3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cyx99r7dyg0o_1747749754.html", "title": "Liverpool: Klopp on Nunez, Gakpo, Jota, Salah and Diaz", "title_page": "Liverpool: Klopp on Nunez, Gakpo, Jota, Salah and Diaz - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jurgen Klopp says defensive qualities will be crucial for his strikers if they wish to hold down a regular starting place this season.\nThe Reds scored four goals in their third successive pre-season friendly as they beat Leicester City 4-0 in Singapore on Sunday morning.\nGoals from Darwin Nunez, Bobby Clark and Diogo Jota in the first half gave Klopp's side control, before Ben Doak netted a fourth after the break at the National Stadium.\nIn his post-match comments, Klopp said he was unhappy with Liverpool's press in the opening period, despite their three-goal advantage, adding his was \"really happy\" with the second half as he could see the volume of work his players have put into their high-press this summer.\nWith the likes of Nunez, Diogo Jota, Luis Diaz, Cody Gakpo and Mohamed Salah to call upon, Klopp said: \"They all are a threat, they all are good footballers – the ticket into the team will be the readiness for defence because you never hear about a team being really successful with sloppy defending, it just will not happen.\n\"For Darwin [it's] the same like for all the other strikers as well because I know about the quality they have and they need to do both, like our other players have to do both as well – defend and being influential in all the offensive situations.\n\"It's good, you can see he is a handful, the speed and the goal was a typical goalscorer's goal. Being there, smelling it and finishing it off. In training he looks really good. He is fit, that helps, and now two more games and Chelsea.\"", "url": "https://www.bbc.com/sport/articles/cyx99r7dyg0o"}