{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:51:43", "date_modify": "2025-05-20 13:51:43", "date_publish": "2023-07-31 17:44:06", "description": "Chelsea: How important could pre-season success be?", "filename": "sport_articles_c5133el14nyo_1747749103.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/de16/live/b5cd2f90-2fc5-11ee-98ed-0f9d637faba7.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c5133el14nyo_1747749103.html", "title": "How important could pre-season success be?", "title_page": "Chelsea: How important could pre-season success be? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Nicola Pearson, BBC Sport\nChelsea's 2-0 win over Fulham on Sunday night brought a sight that has become familiar to Blues fans in the past 20 years - lifting silverware.\nWhile this trophy from a pre-season mini-league understandably won't bring the fanfare of domestic and European major honours, victory in the inaugural Premier League summer series could prove beneficial for Chelsea as they head into the crucial second season under their new ownership.\nTodd Boehly and his consortium's turbulent first year at the helm of the club saw them sack two managers, finish 12th in the Premier League and in the bottom half for the first time since 1995-96, all despite going on a record spending spree in the transfer market.\nWith a new but experienced head coach in charge and an already slimmer squad after a summer of player sales, the hierarchy will be hoping they have put much of last season's turmoil behind them.\nAnd, they can be optimistic as Mauricio Pochettino - who has already talked about bringing \"what the club needs to be at the top\" - looks to have made a positive impact in his first month in charge.\nHis new-look Blues have already won more games in pre-season than in their previous 15 games and scored more than in their past 14.\nIt's not just the numbers which are catching the eye, but the performances too. Rather than the disjointed side of last season, players appear more in sync, even with fresh signings and returning youngsters.\nPerhaps most exciting for Chelsea fans after recent struggles in front of goal is how new forwards Nicolas Jackson and Christopher Nkunku look to have hit the ground running - scoring five goals between them and making three assists.\nBut supporters, Pochettino and the club will be under no illusion that these pre-season matches are not an accurate representation of where the team will be come the opening game of the season on 13 August.\nThere will be more outgoings, incomings and fine tuning - \"tough\" decisions the Argentine boss has said - before he can pick his starting line-up against Liverpool.\nPre-season results may be taken with a pinch of salt, but there could be a lot to be said for reigniting a winning feeling and momentum into this recovering Chelsea squad.", "url": "https://www.bbc.com/sport/articles/c5133el14nyo"}