{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:05:12", "date_modify": "2025-05-21 04:05:12", "date_publish": "2025-01-23 21:34:54", "description": "Chelsea consider move for Alejandro Garnacho, Manchester City chase Andrea Cambiaso, and Borussia Dortmund weigh up two Premier League left-backs.", "filename": "sport_football_articles_c1we3w47ge8o_1747800312.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e7fc/live/47cb8580-d9d0-11ef-902e-cf9b84dc1357.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c1we3w47ge8o_1747800312.html", "title": "Football gossip: Garnacho, Cambiaso, Rashford, Chilwell, Zinchenko, Veiga", "title_page": "Football gossip: Garnacho, Cambiaso, Rashford, Chilwell, Zinchenko, Veiga - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Chelsea considering move for Alejandro Garnacho, Manchester City chasing Andrea Cambiaso, and Borussia Dortmund weighing up two Premier League left-backs.\nChelsea are considering a move for Argentina winger Alejandro Garnacho, 20, after Napoli ended their pursuit of the Manchester United player. (Sky Sports), external\nManchester City are interested in Italy full-back Andrea Cambiaso, 24, but Juventus will demand a fee in the region of 65m euros (£54.8m). (Gazzetta dello Sport - in Italian), external\nBorussia Dortmund have stepped back from the race to sign England forward Marcus Rashford, 27, with the Manchester United player's £350,000-per-week wages proving a stumbling block. (Mail), external\nBayern Munich midfielder Joshua Kimmich is in contact with Real Madrid over his future with the 29-year-old German international's contract at the Bavarian club set to expire in the summer. (Christian Falk), external\nArsenal and Ukraine left-back Oleksandr Zinchenko, 28, is expected to leave before the end of the January transfer window, with Borussia Dortmund looking at a deal. (Telegraph), external\nDortmund also have an eye on Chelsea and England left-back Ben Chilwell, 28, as an alternative option. (Sun), external\nChelsea have verbally agreed a deal to loan Portugal midfielder Renato Veiga, 21, to Juventus for the rest of the season. (Athletic), external\nArsenal and Scotland left-back Kieran Tierney, 27, is on the verge of agreeing a pre-contract to return to Celtic on a free transfer at the end of the season. (Telegraph), external\nBrighton have held talks over whether 20-year-old Republic of Ireland striker Evan Ferguson can leave on loan this month. (Mail), external\nReal Madrid have joined the race to sign Benfica defender Alvaro Carrera with Barcelona and Manchester United also interested in the 21-year-old Spanish left-back. (Diaro AS - in Spanish), external\nManchester United are leading the race to sign 18-year-old English defender Ayden Heaven from Arsenal with Barcelona and Eintracht Frankfurt having already made approaches. (Fabrizio Romano), external\nWest Ham want RB Leipzig's Andre Silva, 29, on loan for the rest of the season but will turn to Ajax's Netherlands striker Brian Brobbey, 22, if they fail to secure a deal for the Portugal forward. (Florian Plettenberg), external\nAston Villa want to bring in French centre-back Loic Bade, 24, from Sevilla after allowing Brazilian defender Diego Carlos, 31, to sign for Fenerbache. (Express and Star), external\nChelsea are targeting Hellas Verona and Morocco midfielder Reda Belahyane, 20, as they prepare to sell Italian 22-year-old Cesare Casadei. (Gianluca di Marzio - in Italian), external\nNewcastle retain an interest in Burnley's English goalkeeper James Trafford, 22, and Wolves' 25-year-old Brazilian forward Matheus Cunha. (The I), external\nBrazilian winger Willian, 36, who left Olympiakos in late December and has attracted interest from Everton, would prefer to join a club in the Premier League over a move to Saudi Arabia. (Football Insider) , external", "url": "https://www.bbc.com/sport/football/articles/c1we3w47ge8o"}