{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:21:14", "date_modify": "2025-05-20 13:21:14", "date_publish": "2023-07-24 12:30:40", "description": "Heart of Midlothian could meet Crusaders in the third qualifying round of the Europa Conference League, while Hibernian might face Djurgarden or Luzern.", "filename": "sport_football_66288169_1747747274.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/FC4D/production/_130498546_20727985.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66288169_1747747274.html", "title": "Europa Conference League: Hearts could face Crusaders as British sides learn potential opponents", "title_page": "Europa Conference League: Hearts could face Crusaders as British sides learn potential opponents - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Heart of Midlothian will face Crusaders or Norway's Rosenborg in the third qualifying round of the Europa Conference League.\nShould Hibernian defeat Inter Club d'Escaldes of Andorra, they will take on Djurgarden of Sweden or Luzern of Switzerland.\nThe two-legged third qualifying round ties will take place on 10 and 17 August.\nThe winners of Hibs' tie will be at home, with Hearts kicking off away.\nSecond qualifying round first legs are taking place this week and Northern Irish champions Larne will face Gibraltar's Lincoln Red Imps if they defeat Ballkani of Kosovo after next week's reverse fixture.\nIf Wales' The New Saints beat Luxembourg's Swift Hesper, they will take on either Struga of Macedonia or Buducnost Podgorica of Montenegro.\nLinfield face a particularly tough draw should they manage to overcome Polish side Pogon Szczecin, with the Belfast outfit drawn against Gent of Belgium or Slovakian club Zilina.\nMeanwhile, Derry City's opponents if they manage to progress against Finnish outfit KuPS Kuopio will be either Swiss side Basel or Tobol Kostanay of Kazakhstan.\nRosenborg will be favourites to face Hearts as the Edinburgh side look to reach the group stage for the second year running.\nThe Tynecastle side won home and away against Latvian side RFS last season but lost in their four matches against Istanbul Basaksehir and eventual finalists Fiorentina.\nShould Hibs and Djurgarden progress, it will set up a repeat of their European Cup quarter-final of 1955-56, when the Leith side won before losing to Stade de Reims in the semis.\nHibs' last European sortie ended in the third round of Europa League qualifying in 2021, when they were beaten 5-2 on aggregate by Croatian side Rijeka.", "url": "https://www.bbc.com/sport/football/66288169"}