{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:42:58", "date_modify": "2025-05-21 03:42:58", "date_publish": "2025-04-07 00:00:00", "description": "Relive the final day of the first round of the 2005 County Championship as Worcestershire hold out for a draw at Taunton and Notts beat Durham.", "filename": "sport_cricket_live_clyn89gj8w0t_1747798978.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_live_clyn89gj8w0t_1747798978.html", "title": "County Championship as it happened: Worcestershire hang on for draw, Notts beat Durham", "title_page": "County Championship as it happened: Worcestershire hang on for draw, Notts beat Durham - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "And relax!\n#bbccricket\nSo that's the first round of the summer's Championship action done and dusted and what entertainment we have had.\nVictories for Nottinghamshire, Hampshire, Kent, Derbyshire and Leicestershire - but what about the draw at Taunton!\nTom Banton's record innings of 371 set up what we all thought was a certain Somerset win over Worcestershire but Brett D'Oliveira's mammoth century and brilliant defiance from Matthew Waite and last man Tom Hinley saw the visitors survive.\nYou can catch up with all the reports and reaction on our cricket pages and we'll be back on Friday for round two.\nMIDDLESEX DRAW WITH LANCASHIRE\nMiddlesex 260 & 407 v Lancashire 359 & 262-8\nGeorge Balderson safely negotiates the final over from Blake Cullen as Lancashire secure a draw against Middlesex after a gripping final day at the home of cricket.\nBalderson finishes with 36 not out but Middlesex wicketkeeper Jack Davies will rue dropping him earlier in his innings.\nMax Holden made 184 before Middlesex declared their second innings, leaving the Red Rose a target of 309.\nKeaton Jennings (49) and Michael Jones (44) laid the platform and Marcus Harris made 52, but a mini-collapse from 240-5 to 247-8 forced them to shut up shop.\nWICKET\nBailey lbw Brookes 0 (Lancs 247-8 - target 309)\nTwo in two for Henry Brookes - he's on a hat-trick.\nBut he's going to have to wait because that was the final ball of the over.\nLancashire now under serious pressure. Do they have Worcestershire-like powers of resistance to salvage a draw?", "url": "https://www.bbc.com/sport/cricket/live/clyn89gj8w0t"}