{"authors": ["Rob Stevens", "www.facebook.com"], "date_download": "2025-05-20 12:59:15", "date_modify": "2025-05-20 12:59:15", "date_publish": "2023-08-02 18:04:04", "description": "Millwall boss Gary Rowett is confident he can keep midfielder Zian Flemming at The Den despite interest from top flight clubs.", "filename": "sport_football_66389186_1747745955.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/D5A3/production/_130619645_gettyimages-1253175553.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66389186_1747745955.html", "title": "Zian Flemming: Gary Rowett confident Dutchman will stay at Millwall", "title_page": "Zian Flemming: Gary Rowett confident Dutchman will stay at Millwall - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Millwall boss Gary Rowett is confident he can keep midfielder Zian Flemming at The Den despite interest from top flight clubs.\nThe Lions have reportedly turned down several bids from Championship winners Burnley for the 28-year-old Dutchman.\n\"As we stand there is going to be interest from Premier League clubs because he is a top quality player,\" Rowett told BBC Sport.\n\"I believe he will be our player come the first game of the season.\"\nFlemming scored 15 goals in 43 Championship outings for Millwall last season after joining from Fortuna Sittard last June.\nThat form helped the south-east London club challenge for a place in the play-offs, although they ultimately finished eighth in the table after a 4-3 home defeat by Blackburn Rovers on the final day of the campaign.\n\"You can't have a player who has his first season in the Championship and scores 15 goals and then be surprised or disappointed that there is interest from elsewhere,\" Rowett said.\n\"We have to accept that.\n\"He'll have an opportunity to go and add to that. I think after another strong season he'll certainly have other Premier League interest along the way.\"", "url": "https://www.bbc.com/sport/football/66389186"}