{"authors": ["Peter Scrivener", "www.facebook.com"], "date_download": "2025-05-21 04:15:37", "date_modify": "2025-05-21 04:15:37", "date_publish": "2025-04-05 19:03:09", "description": "World number one amateur Lottie Woad hits a final-round 72 at Augusta National to finish third, behind Spanish winner Carla Bernat Escuder.", "filename": "sport_golf_articles_cy0xpl7d19po_1747800937.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9996/live/e6f20960-1254-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_golf_articles_cy0xpl7d19po_1747800937.html", "title": "England's Lottie Woad third at Augusta National Women's Amateur as Spain's Carla Bernat Escuder wins", "title_page": "England's Lottie Woad third at Augusta National Women's Amateur as Spain's Carla Bernat Escuder wins - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England's world number one amateur Lottie Woad finished third at the Augusta National Women's Amateur as Spain's Carla Bernat Escuder took the title.\nWoad, 21, had jointly led overnight but a bogey on the par-three 16th effectively ended her hopes of becoming the first player to win successive ANWA championships.\nShe birdied three of the final four holes to win last year's title but was unable to match that charge this year, missing a 10-foot birdie putt on the 15th and then dumping her tee shot on the next into a greenside bunker and taking three more from there.\nWoad had started the final round on nine under - after two rounds at the nearby Champions Retreat course - but could only shoot a level-par 72 at the famed Georgia course that will host next week's Masters.\nA consolation for Woad is that she continues her record of finishing inside the top three of her past nine strokeplay events.\nBernat Escuder rolled in a four-foot par putt on the last to win the sixth staging of the championship by one shot from from American teenage sensation Asterisk Talley.\nThe 21-year-old Spaniard had six birdies and two bogeys in her round of 68 to post 12 under and hold off Talley, who also shot a four-under-par final round.\nTalley, 16, holed her second shot from the fairway for an eagle two on the par-four first.\nShe then had successive birdies on the 16th and 17th holes to put pressure on Bernat Escuder, but the Spaniard kept her nerve to par the last.\n\"I cannot process that I won,\" said Bernat Escuder who is the first player to score under 70 in all three rounds.\n\"I tried to enjoy this round with my coach because it's going to be the last one.\n\"I'm turning professional this next summer, so I was really focused on smiling and just enjoying Augusta National because it's the best golf course in the world.\"\nThe victory entitles Bernat Escuder to play in four of the year's five women's majors, including the US Women's Open and Women's Open.", "url": "https://www.bbc.com/sport/golf/articles/cy0xpl7d19po"}