{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:04:29", "date_modify": "2025-05-21 04:04:29", "date_publish": "2025-02-09 15:01:17", "description": "Bradford Bulls upset Super League side Castleford in the third round of the Challenge Cup, as Salford and Huddersfield go through.", "filename": "sport_rugby-league_articles_ce8jm7y7m34o_1747800269.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/336d/live/cb7ac3c0-e6ee-11ef-96cd-45cf16ace6f4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-league_articles_ce8jm7y7m34o_1747800269.html", "title": "Bradford Bulls 18-16 Castleford Tigers: Bulls upset Cas in dramatic Challenge Cup tie", "title_page": "Bradford Bulls 18-16 Castleford Tigers: Bulls upset Cas in dramatic Challenge Cup tie - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Championship side Bradford Bulls dramatically upset Super League team Castleford Tigers with an 18-16 victory in the third round of the Challenge Cup.\nTries from James Donaldson and Matty Gee helped the hosts take an early lead, before Tom Holmes ran almost the entire length of the field unchallenged to make it 17-0 at half-time.\nBut Castleford roared back after the break to reduce the deficit to 17-12, before the hosts snuck in a drop-goal to ensure a Cas converted try would not result in defeat.\nTex Hoy gave Cas a last-gasp chance to take the game to golden-point extra time by dancing through Bradford's defence for a try, but his conversion to add an extra two points drifted agonisingly wide.\nThere were no shocks for the other two Super League sides in action on Sunday as Salford Red Devils beat Midlands Hurricanes and Huddersfield Giants saw off Hunslet.\nBatley Bulldogs, Featherstone Rovers, Widnes Vikings and Oldham were the other teams to make it through to round four.\nBradford worked tirelessly to keep up the early pressure on their opponents and deserved to go ahead when Donaldson drove over the line from Mitch Souter's neat pass.\nMoments later, a clever steal of the ball by James Meadows led to a delicate pass by Joe Keyes, which Gee showed hunger to dive onto and score.\nCastleford's defence continued to look ragged and uncomfortable as they repeatedly gave away penalties in Danny McGuire's first competitive match as head coach, with Meadows opting to strike between the posts for an extra two points.\nAn opportunistic drop-goal from Keyes kept the scoreboard ticking over, before Holmes collected a loose ball and accelerated away brilliantly, just as the visitors had committed high up the pitch.\nCas lacked cutting edge, but finally scored in the second half when Jeremiah Simbiken touched over from Daejarn Asi's delicate toe-poked kick.\nThree minutes later, Josh Simm reignited Castleford's belief after capitalising on a loose offload by Bradford, with Hoy converting to reduce the deficit to 17-12.\nJust as Bradford tried to wind down the clock, Jordan Lilley eased the home side's nerves by adding another drop-goal.\nBut Hoy sent shockwaves around Odsal Stadium when he showed great pace and trickery to spook the Bulls backline and put his side within reach of extra time.\nHoy, who looked hurt as he touched the ball down, then got up to take the all-important kick, but he fell to his knees in agony as it sunk narrowly wide of the posts.", "url": "https://www.bbc.com/sport/rugby-league/articles/ce8jm7y7m34o"}