{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:28:39", "date_modify": "2025-05-20 13:28:39", "date_publish": "2023-07-24 13:53:23", "description": "Fulham: What will Raul Jimenez bring?", "filename": "sport_articles_cndk2rz0zx7o_1747747719.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/29af/live/cd23b2e0-2a16-11ee-b1d7-8fdc93c2782e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cndk2rz0zx7o_1747747719.html", "title": "Fulham: What will Raul Jimenez bring?", "title_page": "Fulham: What will Raul Jimenez bring? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Phil Cartwright, BBC Sport\nWith Aleksandar Mitrovic's future in some doubt at Fulham, will proposed new signing Raul Jimenez be able to fill the void?\nJimenez was one of the Premier League's most prolific strikers during his first two years in England, netting 30 league goals across the 2018-19 and 2019-20 seasons and 10 during Wolves' run to the Europa League quarter-finals.\nOften operating as a lone focal point up front, the Mexican's tireless running and expert hold-up play were features of his game, as were profitable link-ups with Diogo Jota and Adama Traore.\nHowever, since his return from a fractured skull at the start of the 2021-22 season, the Mexico striker has scored six league goals in 49 Premier League appearances. He failed to score in 15 league outings last term, with his three goals all coming in the League Cup.\nArguably his most impressive display of last season came in Wolves' 1-1 draw against Fulham at Craven Cottage in February.\nJimenez combined well with Matheus Cunha, who was playing in a more withdrawn striking position before his injury early in the second half, and set up Wolves' goal for Pablo Sarabia with an intelligent back-post header - his only Premier League assist of the season.\nIn his prime, Jimenez would have been an ideal replacement for Mitrovic - he was utterly unplayable at times.\nSince the devastating head injury he suffered, though, he has struggled to recapture those heights. Either Marco Silva believes the Mexico forward can rediscover them at Fulham - or he has someone else in mind should Mitrovic leave the club.", "url": "https://www.bbc.com/sport/articles/cndk2rz0zx7o"}