{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:57:51", "date_modify": "2025-05-20 12:57:51", "date_publish": "2023-08-02 20:39:20", "description": "Rangers will face Servette in Champions League qualifying after the Swiss side defeated Genk on penalties despite playing 117 minutes with 10 men.", "filename": "sport_football_66390725_1747745871.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/132F5/production/_130618587_genk.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66390725_1747745871.html", "title": "Genk 2-2 Servette (agg 3-3, 1-4pen): Rangers will face Swiss in Champions League qualifier", "title_page": "Genk 2-2 Servette (agg 3-3, 1-4pen): Rangers will face Swiss in Champions League qualifier - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Rangers will face Servette in Champions League qualifying after the Swiss side defeated Genk on penalties despite playing 117 minutes with 10 men.\nThe Belgian league runners up were favourites with home advantage after last week's 1-1 draw in Geneva.\nEnzo Crivelli's third-minute dismissal further boosted Genk's chances.\nA Mike Tresor penalty and Tolu Arokodare header twice had Genk in the lead, but replies from Timothe Cognat and Chris Bedia forced extra time.\nSevette scored all four of their spot kicks as Patrick Hrosovsky and Arokodare missed theirs to secure the Swiss league runners-up a place in the third qualifying round and a visit to Ibrox for the first leg on Wednesday.\nIt looked bleak for Rene Weiler's visitors when a VAR check upgraded French forward Crivelli's yellow card to red for a challenge on midfielder Bryan Heynen that led to the Genk captain being taken off on a stretcher.\nTheir chances were dented further when Serbian referee Novak Simovic blew for a spot kick just before the half-hour mark and Belgium midfielder Tresor fired Genk ahead.\nServette levelled eight minutes later through Cognat's deflected free-kick.\nHowever, moments after being denied by the woodwork, Nigerian striker Arokodare added to his first-leg opener by heading in from Tresor's corner six minutes after the break.\nServette, though, were level once more just past the hour mark, with French midfielder Cognat involved in the build-up that led to Ivory Coast Under-23 striker Bedia's close-range equaliser.\nThat came shortly after the visitors had to replace Jeremy Frick with Joell Mall after the goalkeeper was injured blocking a shot from Bilal El Khannous.\nServette also had Swiss midfielder Alexis Antunes carried off 15 minutes from the end of normal time, but they held out to win a bruising battle.\nRangers have never faced Servette in European competition, but they have played a total of eight games against Swiss opponents - Young Boys, FC Zurich and Grasshopper Zurich - winning two ties and losing three.\nThe most recent of those came in the 2019-20 Europa League group stage, when they drew 1-1 with Young Boys at Ibrox and lost 2-1 in Switzerland.", "url": "https://www.bbc.com/sport/football/66390725"}