{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:17:52", "date_modify": "2025-05-20 13:17:52", "date_publish": "2023-08-02 12:59:28", "description": "Former Barcelona and Brazil defender Dani Alves is formally indicted by a Spanish judge after being jailed for alleged sexual assault in January.", "filename": "sport_football_66383107_1747747072.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/D8A5/production/_130616455_gettyimages-1245655363.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66383107_1747747072.html", "title": "Dani Alves: Former Barcelona and Brazil defender indicted by Spanish judge", "title_page": "Dani Alves: Former Barcelona and Brazil defender indicted by Spanish judge - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Barcelona and Brazil defender Dani Alves has been formally indicted by a Spanish judge after he was jailed for alleged sexual assault in January.\nAlves was arrested over an allegation he assaulted a woman in a Barcelona nightclub in December.\nThe judge said she had found evidence of wrongdoing by the 40-year-old.\nAlves, who has been held in a prison without bail and had requests to be released rejected, claims he had consensual sex with his accuser.\nHis lawyer said the player would not slow down the process by appealing against the indictment.\n\"Alves is upset with the narrative of the facts. He disagrees with it,\" his lawyer Cristobal Martell told reporters.\nIn Spain, a claim of rape is investigated under the general accusation of sexual assault and convictions can lead to prison sentences of four to 15 years.\nThe prosecution must now submit formal charges to the court, following which a date will be set for a trial.\nAlves played 408 times for Barcelona, winning six league titles and three Champions Leagues across two spells, and was also part of Brazil's 2022 World Cup squad.\nHis most recent club, Mexican side Pumas UNAM, terminated the Brazilian's contract with immediate effect in January.", "url": "https://www.bbc.com/sport/football/66383107"}