{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:54:16", "date_modify": "2025-05-20 11:54:16", "date_publish": "2023-08-05 18:14:44", "description": "Celine Boutier takes a three-shot lead into the final day of the Women's Scottish Open as she looks to secure back-to-back titles.", "filename": "sport_golf_66418705_1747742056.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/14FD8/production/_130667958_gettyimages-1593881122.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_golf_66418705_1747742056.html", "title": "Women's Scottish Open: Celine Boutier leads by three shots after third round", "title_page": "Women's Scottish Open: Celine Boutier leads by three shots after third round - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Celine Boutier takes a three-shot lead into the final day of the Women's Scottish Open as she looks to secure back-to-back titles.\nHaving won her first major last Sunday on home soil at the Evian Championship, the French player surged in front at Dundonald Links with a six-under 66.\nPaphangkorn Tavatanakit of Thailand matched that score to head the chase on 10 under with Sweden's Maja Stark (72).\nHalfway leader Hinako Shibuno tumbled to six off the pace with a 77.\nEngland's Eleanor Givens is four under following her 72, while Gemma Dryburgh is the top Scot on two under after posting four front-nine birdies in a 68.\nWorld number four Boutier, the Scottish Open runner-up last year, also made a flying start, gaining four shots in her opening seven holes.\nA bogey at nine stalled her momentum but four further birdies - including the 17th and 18th - and just one dropped shot allowed her to capitalise on Stark's late struggles.\nThe Swede had held a two-shot lead after a birdie on the 10th, but bogeys on three of her final eight holes knocked her into a tie for second.\nBoutier, 29, said: \"I've definitely been playing well and the fact I got a good result last week also is giving me a little bit of confidence. I'm just trying to build off of that and hopefully have a good, solid round tomorrow.\n\"I'm trying to stay focused and I feel like this course is pretty challenging with the weather conditions. When you're playing well, it's easier to be positive about it.\n\"I made a bogey on nine, which also fired me up a little bit. It was nice to get some more energy going. I'm just going to try to hopefully play the same and stick to my game-plan and see what happens.\"", "url": "https://www.bbc.com/sport/golf/66418705"}