{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:42:39", "date_modify": "2025-05-20 12:42:39", "date_publish": "2023-08-03 15:06:13", "description": "Nkunku and Jackson have been 'the players of the tour'", "filename": "sport_articles_cx7ywgv7ld3o_1747744959.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/94da/live/124e2e90-31fb-11ee-8f52-fbf70e4bf742.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cx7ywgv7ld3o_1747744959.html", "title": "Nkunku and Jackson have been 'the players of the tour'", "title_page": "Nkunku and Jackson have been 'the players of the tour' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Alex Howell, BBC Sport\nChelsea did manage two big signings before the USA tour - and they have quite possibly been the players of the tour.\nChristopher Nkunku, 25, a £52m signing from RB Leipzig, and 22-year-old Nicolas Jackson from Villarreal have been brought in to try to get the goals flowing again.\nThe side only managed 38 goals during the last Premier League season and Pochettino will be optimistic that things can be better this time out, although there is a concern about Nkunku, who limped off with a knee injury against Borussia Dortmund.\nNkunku has scored three goals in his five pre-season appearances and has also played in a number of different positions. He has scored all of his goals while playing as a number nine and his calm finishing has been noticeable. He has seemed to take every chance that has come his way.\nHis versatility and ability to play in the number 10 role or on either wing means he can be partnered with Jackson, something Pochettino tried again against Dortmund.\nSenegal forward Jackson scored 13 goals in 38 appearances for Villarreal last season, including nine in their final eight league games, and was close to joining Bournemouth in January.\nIn the USA, he took to the Chelsea team seamlessly, scoring two goals and getting three assists.\nHe is excellent at holding the ball up, good at running in behind defences and, as well as his goals, he seems able to pick the right pass in the final third.", "url": "https://www.bbc.com/sport/articles/cx7ywgv7ld3o"}