{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:33:58", "date_modify": "2025-05-21 05:33:58", "date_publish": "2025-01-31 18:56:09", "description": "Killie must 'crack on' if they are to make top six - McInnes", "filename": "sport_articles_c5y7jz8p3yro_1747805638.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d4c3/live/6f7643c0-e003-11ef-a319-fb4e7360c4ec.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c5y7jz8p3yro_1747805638.html", "title": "Killie must 'crack on' if they are to make top six", "title_page": "Killie must 'crack on' if they are to make top six - McInnes - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Kilmarnock manager Derek McInnes says his side must start winning games now if they are to earn a top-six Scottish Premiership finish this season.\nLast week's 3-2 defeat by Hearts means Killie sit second bottom, but just five points separate them and Hibs in sixth before they host Dundee United on Saturday.\nThe Rugby Park club finished fourth last season, with an impressive run of form before the split taking them into the top half, and McInnes is targeting a similar run.\n\"It feels as if there's a lot on the game and there is, with nine games to go before the split,\" he said. \"There's a realisation that if we are going to be a top-six team we really need to get going with that.\n\"The time for finding our best form, digging deep, not feeling sorry for ourselves about injuries and decisions and really just to crack on and get results.\n\"We are only two wins shy of where we were last season and at this stage we went on a brilliant run and accumulated 18 points from the last nine games.\n\"We feel we have to do something similar – 15-16 points from the last nine games will give us a chance of the top six.\n\"It's important we maximise everything we have got and get the home support right behind the team. Rugby Park is pretty special when the team feed off the fans.\"", "url": "https://www.bbc.com/sport/articles/c5y7jz8p3yro"}