{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:43:52", "date_modify": "2025-05-21 06:43:52", "date_publish": "2025-03-30 22:22:16", "description": "Sam Kerr will remain as Australia captain after the country's football association rules out any further disciplinary action following the player's court case.", "filename": "sport_football_articles_c9qwgd9nq2go_1747809832.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e573/live/80099710-0db1-11f0-ab0b-b322cc9c20ff.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c9qwgd9nq2go_1747809832.html", "title": "Sam Kerr to remain Australia captain after Football Australia rules out further disciplinary action", "title_page": "Sam Kerr to remain Australia captain after Football Australia rules out further disciplinary action  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Sam Kerr will remain as Australia captain after the country's football association ruled out any further disciplinary action following the player's court case.\nLast month Chelsea striker Kerr was found not guilty of causing racially aggravated harassment after calling a Metropolitan Police officer \"stupid and white\" in an incident in Twickenham on 30 January 2023.\nIn a joint statement with Football Australia, after meeting members of the organisation's board, 31-year-old Kerr expressed her \"sincere regret for how events unfolded\".\nFootball Australia said it had \"concluded that Kerr's professional and sincere acceptance of responsibility, as well as her acknowledgment of the far-reaching implications of on and off-field actions, warranted no further action\".\n\"Knowing how Sam feels about the events, along with the additional context we've learned, has added vital perspective that the general public may not be aware of,\" said Football Australia chairman Anter Isaac.\n\"Setting aside those difficulties, this one incident should not offset the incredible contributions she has made, both publicly and privately, on and off the field for more than 15 years.\"", "url": "https://www.bbc.com/sport/football/articles/c9qwgd9nq2go"}