{"authors": ["Andy Gray", "www.facebook.com"], "date_download": "2025-05-19 14:31:40", "date_modify": "2025-05-19 14:31:40", "date_publish": "2017-08-13 19:20:45", "description": "Colin Turkington takes three podiums at Knockhill to take the lead in the British Touring Car Championship.", "filename": "sport_motorsport_40918552_1747665100.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/128DB/production/_90959957_turkington.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_motorsport_40918552_1747665100.html", "title": "British Touring Cars: Colin Turkington leads series after three podiums", "title_page": "British Touring Cars: Colin Turkington leads series after three podiums - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Colin Turkington secured three podiums at Knockhill to take the lead in the British Touring Car Championship.\nThe Portadown driver picked up two third-place finishes behind Subaru's Jason Plato and Ash Sutton in races one and two.\nThe Team BMW driver had a more eventful race three, coming home in third behind Tom Ingram and Gordon Shedden.\nTurkington now leads the standings by four points over Sutton, followed by Shedden and Rob Collard.\nChris Smiley also picked up points for the third race weekend in succession for BTC Norlin Racing.\nAfter qualifying in third, Turkington held station behind Plato and championship rival Sutton to take the championship lead for the first time this season.\nIt was a similar story in race two for Turkington, with Sutton coming home ahead of Plato to take a 1-2 finish ahead of the 35-year-old, despite carrying maximum ballast.\nTurkington had a race-long battle with Shedden and Collard in the third event, with the race ending in a two-lap shootout after a late safety car.\nChris Smiley put in a good performance in race one after struggling with traffic in qualifying, moving up from 24th to 19th place.\nThe Carrickfergus driver continued his progress in race two, bringing home points with a 14th place finish.\nAt the beginning of race three, contact from Tom Chilton forced Smiley into the gravel at turn three and he had to pit with a puncture which resigned the 25-year-old to a 26th place finish.\nHillsborough teenager Dan Harper picked up two podiums to move within 29 points of the summit of the Ginetta Junior championship.\nHarper took third on the final lap of race one, coming home second in race two after being nipped to the line by team-mate Kiern Jewiss.\nCharlie Eastwood continued his title challenge in the Porsche Carrera Cup, winning race two but only after contact with title rival Dan Cammish on the penultimate lap.\nAdding to a third-place finish in race one, Eastwood leads the standings by 13 points but dropped scores to be taken into account the championship race is still wide open.", "url": "https://www.bbc.com/sport/motorsport/40918552"}