{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:23:42", "date_modify": "2025-05-21 07:23:42", "date_publish": "2025-03-28 16:04:08", "description": "Lewis Mayo urges Kilmarnock to build on 'huge' point", "filename": "sport_articles_cd92902k100o_1747812222.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2cc8/live/2fd818c0-0bdb-11f0-8ae9-2975efdc7f47.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cd92902k100o_1747812222.html", "title": "Lewis Mayo urges Kilmarnock to build on 'huge' point", "title_page": "Lewis Mayo urges Kilmarnock to build on 'huge' point - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Lewis Mayo has urged Kilmarnock to deliver a strong end to the season despite leaving it \"too late\" for a top-six finish.\nDerek McInnes' 10th-place side visit St Mirren on Saturday looking to build on the dramatic draw they rescued against Hibs before the international break.\n\"We need to use it, \" defender Mayo said of Fraser Murray's leveller that halted a run of three straight defeats.\nHe added: \"It was huge. Psychologically it was almost like a win for us.\n\"That period of games was disappointing for us but in a game that we didn't do enough to win, that we were probably the second best team overall, once again it was our character and effort that gets us through and gets us a point.\n\"The next few games coming up is a chance for us to try to put some more points on the table and build on it.\n\"Where we are at now, we've almost left it too late for it [top-six finish] to be in our own hands.\n\"While it is still possible, you need to accept that for the time being it is about getting back to basics and putting points on the board and see where that leaves us.\n\"It is almost like a mini reset for us after that last period and we are just looking forward again.\"", "url": "https://www.bbc.com/sport/articles/cd92902k100o"}