{"authors": ["Julien Laurens", "www.facebook.com"], "date_download": "2025-05-19 14:40:33", "date_modify": "2025-05-19 14:40:33", "date_publish": "2017-07-29 13:25:19", "description": "Monaco have developed some of world football's top talent - despite attracting average crowds of only 9,000. Julien Laurens explains how.", "filename": "sport_football_40763916_1747665633.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/CBA4/production/_97123125_hi039531409.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_40763916_1747665633.html", "title": "Martial, Mendy & Mbappe: How Monaco became Europe's talent factory", "title_page": "Martial, Mendy & Mbappe: How Monaco became Europe's talent factory - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "They have small crowds and their stadium is built on a car park. Yet Monaco continually produce some of the most coveted footballers in the world.\nThe French champions have banked 173.5m euros (£155m) so far this summer by selling their top talents and might yet add to that tally.\nProdigious 18-year-old striker Kylian Mbappe has been linked with a world record £160m move to Real Madrid, external and 21-year-old winger Thomas Lemar continues to be talked about as a £45m target for Arsenal.\nBut what are the secrets of Monaco's success in rearing, selling and - most importantly - replacing players?\nMonaco did not always adhere to this simple business plan.\nWhen Russian billionaire and Monaco resident Dmitry Rybolovlev bought the club for one euro in December 2012, he had other things in mind. At the time, they were second from bottom of France's second tier and the oligarch was ready to spend heavily - first, to win promotion back to Ligue 1 and then to try to compete with Paris St-Germain.\nFor that, he had to spend a lot. In the summer of 2013, Colombia striker Radamel Falcao, was bought for around 60m euros (then the equivalent of £50m) from Atletico Madrid and a fee of 70m euros (£60m) secured Porto's James Rodriguez and Joao Moutinho.\nIt worked, at least at the beginning, as the 'rouges et blancs' kept pace with a star-studded PSG team led by Zlatan Ibrahimovic.\nHowever, it quickly appeared that such huge spending was not viable for a club with an average home attendance of around 9,000, low television broadcast revenues and small sponsorship deals.\nMonaco were spending far more than they were earning. It was impossible for them to comply with Uefa's Financial Fair Play regulations.\nWhen Monaco sold Colombia's Rodriguez to Real Madrid in 2014 after an impressive World Cup in Brazil, they replaced him with little-known 19-year-old Frenchman Lemar, who signed from Caen for 4m euros (£3.2m). It marked a change in the way they ran the club.\nThe new approach was to find promising youngsters, develop them, give them a platform to showcase their talent and sell them to finance the next generation.\nTwo summers ago, the first batch of players were sold for a combined total of 180m euros (£161m). French striker Anthony Martial - 20 at the time, and bought 12 months earlier from Lyon for 5m euros (£4m) - left for Manchester United for a fee that could rise to 80m euros (£71.6m); Belgium midfielder Yannick Ferreira Carrasco left for Atletico Madrid; Tunisian defender Aymen Abdennour went to Valencia and French left-back Layvin Kurzawa joined PSG.\nHowever, Monaco are not just after the bargains. Take French midfielder Geoffrey Kondogbia. He stayed one season, played a big part in knocking out Arsenal of the Champions League in March 2015, and was sold to Inter Milan for 35m euros (£25m) - 'only' 15m more than they had bought him for.\nAt the time, Monaco were criticised heavily, accused of betraying the spirit of football by taking it to the extreme in terms of business. The club had to sell to balance their books and they had lots of high-value players, so they sold. And then they rebuilt and replenished.\nTo become what they are today - a successful club and a selling machine - Monaco have put in place the perfect system.\nFirst their academy is excellent and has just been named the best in France. They spend around 8m euros (£7.16m) each year on it and have a very simple but effective rule: the top talents in each group are playing a year above their own age so they can develop quicker.\nAt youth level, they have the best scouting network in Europe. In Paris alone, they have six scouts - more than anyone else - who know everyone in every grassroots club in the capital and the suburbs. They were able to sign Mbappe at 14 because his family felt Monaco had been there pretty much all the way.\nThey sign the best young players in Ligue 1 - such as Lemar, Tiemoue Bakayoko, Djibril Sidibe and Benjamin Mendy - and do so at a reasonable price. Those players are eager to join because they know they will get their chance on a European stage quickly. That reputation has spread, with talent spotters in Brazil, Belgium, Portugal and the Netherlands able to identify and recruit players such as Franco Antonucci, the 17-year-old Belgian prodigy who arrived from Ajax last January.\nMonaco still rely on the advice of agents, too. When Jorge Mendes, the Portuguese who represents Cristiano Ronaldo among others, mentioned little-known Benfica reserve Bernardo Silva in 2014, nobody could have guessed that three years later he would sign for Manchester City for 50m euros (£43m).\nIn Leonardo Jardim, they also have the perfect manager for their project. The man who led the club to their first French title in 17 years last season and a place in the Champions League semi-finals loves working with young players and developing them. He is like a teacher. Indeed, he studied for a sport degree at university in Madeira before embarking on his coaching badges.\nFinally, credit must go to successive sporting managers Luis Campos and Antonio Cordon. Both have used their contacts to help Monaco's project grow. When Cordon leaves for a Chinese football consortium in September, the club will have to find the right replacement once again.\nRybolovlev and his vice-president Vadim Vasilyev are businessmen first and foremost.\nSelling at the highest price and buying at the lowest was always their strength, before even going into football. They are clever, fearless and articulate - and know exactly how to drive a price up. They were tough negotiators with Manchester United over Martial in the summer of 2015, making them wait until the final hours of the transfer window before realising a potential profit of 75m euros - or more than £67m.\nThey played a similar waiting game over Mendy, who became the most expensive defender of all time earlier this month by joining Manchester City for 57.5m euros (£52m) - just a year after signing from Marseille for 15m euros (£11.4m). New Chelsea signing Bakayoko is a similar case, arriving from Rennes for 8m euros (£6.35m) in 2014 before moving to Stamford Bridge for 45m euros (£40m).\nThe two Russians realised quickly that they were very good at football business and are now taking the project even further.\nMonaco have just bought Belgian second division club Cercle Brugge, and will use them to develop even more young players. They have sent seven players there on loan, including Jordi Gaspar, the promising right-back signed for free from Lyon in June. Might he be the next one to be sold for a huge profit?\nThe football world will continue to watch and see the development of this fascinating and shrewd business.\nNote: Where possible, transfer fees listed in euros have been converted into sterling using the exchange rate at the time of the deal.", "url": "https://www.bbc.com/sport/football/40763916"}