{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:28:18", "date_modify": "2025-05-21 05:28:18", "date_publish": "2025-04-03 10:31:42", "description": "Veteran forward David McGoldrick has shown he has \"many years\" left in his career, says Notts County boss Stuart Maynard.", "filename": "sport_football_articles_cx2wnrr4dvqo_1747805298.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6767/live/085d3be0-1063-11f0-a838-a720bcf3cdb5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cx2wnrr4dvqo_1747805298.html", "title": "David McGoldrick: Notts County forward has 'many years' left, says Magpies boss", "title_page": "David McGoldrick: Notts County forward has 'many years' left, says Magpies boss - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Veteran forward David McGoldrick has shown he has \"many years\" left in his career, says Notts County boss Stuart Maynard.\nThe 37-year-old, who is into the final months of his contract at Meadow Lane, scored the opening goal in Wednesday's 3-0 win against MK Dons to help the Magpies move within one spot and two points of the League Two automatic promotion places.\nMcGoldrick's curled, left-footed strike took the former Sheffield United, Ipswich Town, Nottingham Forest and Derby County striker's goal tally to 15 for the season and comes just weeks after he said he would be playing for a new deal in the final weeks of the season.\nWhen asked if he thought McGoldrick had more years in him, Maynard replied: \"As long as he wants to play, he will keep playing.\n\"He has that burning desire inside, he has the legs, he has the enthusiasm and we don't need to talk about ability because we have seen it this year in abundance with the goals he has scored and the way he has played people in.\n\"I think he has many years to go.\"\nNot for the first time this season, Maynard called McGoldrick \"Superman\" for the performance he produced to boost Notts' hopes of a top-three finish.\nIt was not a comment limited to what the forward managed to spark with his goal against MK Dons, but also the influence he is having on the childhood club he first made his professional debut for more than two decades ago.\n\"It's everything,\" Maynard told BBC Radio Nottingham. \"Off the pitch he is incredible with the whole group, the connection he has with the fans, the energy he brings when we play at home.\n\"It's what Superman does though, isn't it? He just does the unbelievable and unthinkable.\n\"With all his quality and ability, look at his press, at his desire right until he comes off the pitch.\n\"And I'm bringing him off - he doesn't want to come off, he is telling me he is fine and ready to keep going. He doesn't stop, he is relentless in everything he does and he is like that in training every day.\"", "url": "https://www.bbc.com/sport/football/articles/cx2wnrr4dvqo"}