{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:04:27", "date_modify": "2025-05-21 04:04:27", "date_publish": "2025-01-15 09:05:19", "description": "West Ham 3-2 Fulham: Fan views on Premier League game", "filename": "sport_football_articles_c07g4xzx493o_1747800267.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2f7f/live/95709000-0915-11ef-bee9-6125e244a4cd.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c07g4xzx493o_1747800267.html", "title": "West Ham 3-2 Fulham: Fan views on Premier League game", "title_page": "West Ham 3-2 Fulham: Fan views on Premier League game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your thoughts after Tuesday's Premier League game between West Ham and Fulham, which the Hammers won 3-2 in Graham Potter's first Premier League game in charge.\nHere are some of your comments:\nWest Ham fans\nJim: What a result. Yes, we rode our luck, especially at the end, but we also played some really good stuff, especially the second goal. At the end, there was a feel-good factor - it was joyous. What a massive three points.\nKevin: How good to see us play like a team rather than a bunch of individuals who didn't seem to know what they were supposed to be doing. Real character shown by all the players, including the subs. To fashion a team and tactics with so many key players missing shows a lot of promise.\nMichael: Big respect to Potter, for a great three points. Getting a result against a good team like Fulham with NO proper strikers is an extraordinary achievement. However, he must fix our terrible defence. Sadly, I doubt if they can be coached to be better. I would keep Max Kilman and Aaron Wan-Bissaka and clear out the rest. Get some defenders with pace and leadership qualities. Up front we must sign a striker or take someone on loan. But, overall I'm heartened by Potter's start.\nAnt: Nowhere near perfect, but how refreshing to see some shape and urgency from the team, where they all looked like they knew what their job was and wanted to do it well. It was also great to hear the crowd really get behind the team, roaring the boys on to a hard-fought and much-needed three points. Two games in and definite signs of improvement.\nFulham fans\nCharlie: Just frustrating. Went from controlling the game to 2-0 down in about 30 seconds. We seem to have these random off days, such as the 4-1 loss to Wolves in November. On to the next on. In Marco we trust!\nRobert: Fulham made four goals. Two were for West Ham. That says it all.\nSimon: You'll hear a lot of people citing a lack of finishing or the risks of playing out from the back as the problem, but our real problem is our defence. That's the fifth time this season we've scored two goals and failed to win. We simply have to tighten up, and can't continually need to score three just to win or even draw a game.", "url": "https://www.bbc.com/sport/football/articles/c07g4xzx493o"}