{"authors": ["Coral Barry", "www.facebook.com"], "date_download": "2025-05-20 14:50:17", "date_modify": "2025-05-20 14:50:17", "date_publish": "2023-07-27 22:45:12", "description": "Terence Crawford says he will prove he is the \"best fighter in the world\" when he takes on Errol Spence Jr in their undisputed welterweight fight on Saturday in Las Vegas.", "filename": "sport_boxing_66307271_1747752617.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/126C9/production/_130556457_spencejr.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_boxing_66307271_1747752617.html", "title": "Terence Crawford v Errol Spence Jr: WBO champion aims to prove he is 'best fighter in world'", "title_page": "Terence Crawford v Errol Spence Jr: WBO champion aims to prove he is 'best fighter in world' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Terence Crawford says he will prove he is the \"best fighter in the world\" when he takes on Errol Spence Jr in their undisputed welterweight fight on Saturday in Las Vegas.\nWBO welterweight champion Crawford, 35, challenges WBA (Super), IBF and WBC champion Spence aiming to become the first male fighter to win undisputed titles in two divisions.\nA fiery news conference was taken over by heckling from each fighter's team, drawing out a passionate speech from the usually reserved Crawford.\n\"This is the Terence 'Bud' Crawford era. This is my era,\" he said.\n\"Everything about Terence Crawford is better than Errol Spence Jr. When you look at everything I do in the ring, it is better than Errol Spence Jr.\n\"Come fight night, I will be proving each and every one of the doubters wrong, once again, that Terence Crawford is the best fighter in the world. Not taking anything away from Errol Spence Jr but Terence Crawford is the better fighter.\"\nAfter a relatively amicable build-up, tensions ran high between camps inside the T-Mobile Arena on Thursday in Las Vegas.\nThere was more needle between the fighters and their opposing teams than with each other.\nTrainers Derrick James and Brian 'Bomack' McIntyre clashed over their respective coaching credentials, prompting furious heckling from their gathered teams in the crowd.\nSpence, the WBC, WBA (Super) and IBF belt holder, said the fight would be a \"Crawford boil\" - telling his opponent he was \"too emotional\". Crawford spent most of his time telling Spence's team to be quiet.\n\"I am going to win because I am the better fighter. I am going to break him down and break his will,\" Spence said when he finally had the chance to speak.\n\"That my skills are superior. He's talented, but we're talking about skillset.\n\"I do have great stamina, I do have great fundamentals - I don't just have talent.\"", "url": "https://www.bbc.com/sport/boxing/66307271"}