{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:27:48", "date_modify": "2025-05-21 05:27:48", "date_publish": "2025-04-03 10:46:23", "description": "Bournemouth 2-1 Ipswich: Fan views on Premier League game", "filename": "sport_football_articles_cvg1qe8x70jo_1747805268.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cvg1qe8x70jo_1747805268.html", "title": "Bournemouth 2-1 Ipswich: Fan views on Premier League game", "title_page": "Bournemouth 2-1 Ipswich: Fan views on Premier League game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your views on Ipswich's victory at Bournemouth on Wednesday. Here are some of your comments:\nBournemouth fans\nLee: A poor performance from the Cherries, the front-foot high press and attacking pressure has disappeared and we offered very little against an average but spirited Ipswich Town. Delap was the best player on the pitch by a mile.\nMatthew: Running on empty currently. Key players missing and our frantic tempo is taking its toll. Not sure there is enough time to regroup for a European push. Top half and a best points total may have to suffice.\nTony: Baffling. A team of players who collectively and individually looked to be almost unbeatable six weeks ago suddenly seem to have lost their individual and collective mojos and appear to be exhausted.\nIpswich fans\nDamien: Great team performance. Everyone worked hard for each other. Took our chances, which were limited - but two quality goals and a great defensive display earned us vital three points away from home.\nTerry: Football is a results-based business and this was a badly needed result. Nothing more, nothing less. This gives us belief to beat Wolves next time out and perhaps give the most optimistic fans to shout about staying up.", "url": "https://www.bbc.com/sport/football/articles/cvg1qe8x70jo"}