{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:54:39", "date_modify": "2025-05-20 11:54:39", "date_publish": "2023-08-06 00:00:00", "description": "Follow text and radio commentary as Oval Invincibles face Welsh Fire in the 2023 Men's Hundred.", "filename": "sport_live_cricket_66306994_1747742079.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/F2B9/production/_130673126_gettyimages-1596878892.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_cricket_66306994_1747742079.html", "title": "The Hundred 2023 LIVE: Oval Invincibles vs Welsh Fire in men's competition plus score, commentary, video highlights & updates", "title_page": "The Hundred 2023 LIVE: Oval Invincibles vs Welsh Fire in men's competition plus score, commentary, video highlights & updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Post\nThat's it for today.\nWe do it all again tomorrow with a double-header at Old Trafford as Manchester Originals take on Birmingham Phoenix in both the men's and women's competitions.\nTake a read of Tom Mallows' report of this fantastic tied match.\nWe'll see you on Monday.\n'That's so tight' - Curran\nMatch hero Tom Curran speaking to Sky Sports: \"That run-out, that's so tight. I guess you could say a fair result in the end. It could have gone either way on that last ball.\n\"When I came in there was one option. We had to go - we needed about 12 a set. They have two world class death bowlers. I was lucky to get a few out of the middle - what a game.\n\"It was amazing. A lot of the time when you're playing you can't hear the crowd, it's just white noise, but I could hear it there, it was loud. I think Nasser Hussain said that last year we didn't have many close games, now we've had last ball finishes in almost every game - it's been a great start to The Hundred.\n\"It's always amazing playing here at The Oval. The wicket was a bit two-paced, in the sense that some were flying through, Gus Atkinson had some in our innings, the same with Rauf and Shaheen. But it is a good wicket here and if you do get bat on ball you get good value for your shots and it's a quick outfield.\"", "url": "https://www.bbc.com/sport/live/cricket/66306994"}