{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:40:15", "date_modify": "2025-04-26 04:40:15", "date_publish": "2025-03-02 07:36:05", "description": "Former Australian motorcycle gang member and prisoner Ryan Peake has qualified for this year's Open at Portrush after winning the New Zealand Open.", "filename": "sport_golf_articles_cqjd4j040ywo_1745642415.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/836f/live/e510b0c0-f72d-11ef-bf03-69362392de0a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_golf_articles_cqjd4j040ywo_1745642415.html", "title": "Ryan Peake: Convicted ex-motorcycle gang member and prisoner qualifies for Open with win", "title_page": "Ryan Peake: Convicted ex-motorcycle gang member and prisoner qualifies for Open with win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Former Australian motorcycle gang member and prisoner Ryan Peake has qualified for this year's Open at Portrush after winning the New Zealand Open.\nHowever, because of his conviction, the 31-year-old left-hander from Perth will need clearance to travel to the tournament, which takes place in Northern Ireland from 17-20 July.\nAs a 21-year-old he was part of an outlawed motorcycle gang, the Rebels, and was sentenced to five years in prison for a serious assault, but says that focusing on golf has turned his life around.\n\"Yeah, I'm pretty lost for words at the moment, [the win is] life-changing,\" he said.\n\"It's one hell of a story, one hell of a moment.\"\nA promising golfer in his youth, Peake was contacted in prison by coach Ritchie Smith, who encouraged him to take up the clubs again after his release from custody.\nNow a rookie on the Australasian Tour, he almost missed the tournament at the Millbrook Resort course near Queenstown after his entry to New Zealand was delayed by immigration officials.\nHe only arrived on Tuesday before Thursday's opening round of the event, which was co-sanctioned by the Australasian and Asian Tours.\nPeake was close to tears as he celebrated with family and friends after the one-shot victory, which earned him Aus$201,600 (£99,500).\nHe said the win came down to \"just belief\", adding: \"I always knew I could do it, it was just a matter of time when I was going to do it.\n\"This is what I do now. I want to be here and just play golf. The story is what it is, but I'm just out here playing golf.\n\"From this morning when I woke up four shots behind, to chase down a win. I've never been in a final group to now being a member of the Asian Tour.\"\nHe finished one shot clear of compatriot Jack Thompson, South African Ian Snyman and Japan's Kazuki Higa.", "url": "https://www.bbc.co.uk/sport/golf/articles/cqjd4j040ywo"}