{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:34:24", "date_modify": "2025-05-21 06:34:24", "date_publish": "2025-03-31 05:36:59", "description": "Schedule for the Grand National meeting from 3 to 5 April, race times and details of BBC coverage.", "filename": "sport_horse-racing_articles_c0459rwnpego_1747809264.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b1ca/live/def95ce0-0d59-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_horse-racing_articles_c0459rwnpego_1747809264.html", "title": "When is Grand National 2025? Date, time, favourites, Aintree course & how to follow", "title_page": "When is Grand National 2025? Date, time, favourites, Aintree course & how to follow - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Follow the world's most famous horse race here on the BBC with live text and radio coverage from Aintree.\nCan last year's Grand National winner I Am Maximus become only the second horse since the legendary Red Rum in the 1970s to defend his title?\nThe big race is due off at 16:00 BST on Saturday, 5 April and is part of a three-day meeting which starts on Thursday.\nListen to commentary of the National on BBC Radio 5 Live and follow on the BBC Sport website and the BBC Sport mobile app.\nThere will also be coverage of four races on Ladies Day on Friday on BBC Radio 5 Sports Extra.\nThe 2024 winner I Am Maximus, trained by Willie Mullins, is among the leading contenders for owner JP McManus, along with Iroko and Perceval Legallois.\nThe latter is trained by Gavin Cromwell, who also runs 2023 runner-up Vanillier and Stumptown, winner of the Cross Country Chase at Cheltenham in March.\nLast year's Irish Grand National victor Intense Raffles and bargain buy Hewick, who cost just £800, are among other hopefuls.\nFriday 4 April – Ladies Day\n13:45: Huyton Asphalt Franny Blennerhassett Memorial Mildmay Novices' Chase (Grade 1) 3m 1f\n14:20: William Hill Handicap Hurdle 2m 4f\n14:55: Trustatrader Top Novices' Hurdle (Grade 1) 2m\n15:30: My Pension Expert Melling Chase (Grade 1) 2m 4f\n16:05: Randox Supporting Prostate Cancer UK Topham Handicap Chase 2m 5f\n16:40: Sefton Novices' Hurdle (Grade 1) 3m ½f\n17:15: Hallgarten and Novum Wines Handicap Hurdle 2m ½f\nCoverage: BBC Radio 5 Sports Extra from 14:00 to 16:15, with commentary of the Topham Chase also on 5 Live.\nSaturday 5 April – Grand National Day\n13:20: William Hill Top Price Guarantee Handicap Hurdle 3m ½f\n13:55: Turners Mersey Novices' Hurdle (Grade 1) 2m 4f\n14:30: William Hill Freebooter Handicap Chase 3m 1f\n15:05: Liverpool Hurdle 3m ½f\n16:00: Randox Grand National 4m 2½f\n17:00: Maghull Novices' Chase (Grade 1) 2m\n17:35: Weatherbys NHStallion.co.uk Standard Open National Hunt Flat Race 2m 1f\nCoverage: Build-up and commentary on the National on BBC Radio 5 Live from Aintree; live text commentary, reaction and reports on BBC Sport website and app.\nMark Chapman will present coverage on 5 Live from midday, alongside former Liverpool defender Stephen Warnock.\nAs well as coverage of Premier League football, there will be updates and commentaries from Grand National day throughout the afternoon with the team of Gina Bryce, Andrew Thornton, Charlie Poste, John Hunt, Darren Owen, Gary O'Brien and Rob Nothman.\nThere is television coverage on ITV and Racing TV.\nRunners have to complete two laps of the Merseyside track, covering four-and-a-quarter miles and jumping 30 fences.\nThe Chair is the tallest of the 16 fences at 5ft 2in but along with the Water Jump only features on the first lap. The 14 other fences, which include Becher's Brook, Canal Turn and Valentine's Brook, are jumped twice.\nThe course takes roughly between nine and 11 minutes to complete, depending on conditions on the day.", "url": "https://www.bbc.com/sport/horse-racing/articles/c0459rwnpego"}