{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:31:36", "date_modify": "2025-04-26 06:31:36", "date_publish": "2025-02-27 08:42:31", "description": "Liverpool 2-0 Newcastle: Fan views", "filename": "sport_football_articles_c20dddl1g63o_1745649096.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c20dddl1g63o_1745649096.html", "title": "Liverpool 2-0 Newcastle: Fan views", "title_page": "Liverpool 2-0 Newcastle: Fan views  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "We asked for your views on Liverpool's Premier League match against Newcastle.\nHere are some of your comments:\nLiverpool fans\nYusuf: Excellent performance in all areas. Everyone looked like they wanted something to prove. Two very clean strikes from Dominic Szoboszlai and Alexis Mac Allister. And just give Mohamed Salah his new contract - every time he delivers a cross with the outside of his boot is an extra £10,000 add-on bonus in waiting!\nDavid: This was the best-looking performance of the season. Fluid and intense. They look like champions all the way through.\nStuart: Once it was apparent Alexander Isak wasn't playing, Liverpool nullified Newcastle with ease. They worked the ball so well and hardly broke a sweat. Salah smiled the entire game. Every player glided around the pitch. Once the Arsenal result filtered through to the players, they were very professional and closed the game out.\nNewcastle fans\nKrish: When you play at Anfield you need to take chances or make the keeper work and we couldn't do that. We limited Liverpool to only a few chances but there's a clear divide in quality without Isak, Joelinton and Sven Botman. We need positive performances ahead of the final\nRobert: Sadly it's going to be more than 70 years of winning a trophy in this country for Newcastle United. It seemed like men against boys.", "url": "https://www.bbc.co.uk/sport/football/articles/c20dddl1g63o"}