{"authors": ["Stephan Shemilt", "www.facebook.com"], "date_download": "2025-05-20 12:45:43", "date_modify": "2025-05-20 12:45:43", "date_publish": "2023-07-25 17:00:03", "description": "Batter Harry Brook says he is open to signing a multi-year central contract with England.", "filename": "sport_cricket_66285707_1747745143.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/B3E3/production/_130515064_harrybrook.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66285707_1747745143.html", "title": "The Ashes 2023: Harry Brook open to signing multi-year England contract", "title_page": "The Ashes 2023: Harry Brook open to signing multi-year England contract - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The prospect of multi-year central contracts arose from the High Performance Review into English cricket, led by former England captain Andrew Strauss and published last year.\nThe idea of tying players to the national team comes amid the rise of global short-form leagues.\nWith the same owners controlling teams in a number of different countries, there is the potential for a player to sign a contract with a franchise that then employs them in various leagues across a year.\nThere have been unconfirmed reports of England players Jofra Archer and Jos Buttler being offered full-time contracts by the owners of their Indian Premier League (IPL) teams.\nEarlier this year, batter Jason Roy gave up his contract with England in order to play in the ongoing Major League Cricket competition in the United States.\nYorkshire's Brook looks set to become a multi-format mainstay in the England middle order. In his 11 Tests he averages 64.05 and was part of the team that won the T20 World Cup in November. He is likely to be part of the squad that will defend the 50-over World Cup in India later this year.\nAfter previous stints in the Pakistan Super League and Australia's Big Bash, Brook this year played his first season in the IPL after being bought by Sunrisers Hyderabad for £1.35m.\n\"I'm not bothered about all the franchise stuff,\" said Brook. \"I want to play cricket for England.\n\"If I'm in all three formats for England, I don't really feel like there's too much time to be playing any other franchise stuff. The IPL is the only one that is really free, when you're available for everything.\"\nBrook was speaking before the final Ashes Test against Australia at The Oval, where England will attempt to level the series at 2-2.\nThe home side were denied the chance to win the urn when rain caused the fourth Test to be abandoned as draw.\nAlthough Australia will at least retain the Ashes, England are looking to protect an unbeaten home record against their oldest rivals that stretches back to 2001.\n\"It would have been class coming to here 2-2, but we can't think too much about that,\" Brook told BBC Sport.\n\"We have to move on and there's a Test match to win here. We're fully concentrated on that now.\"\nFor Australia, avoiding defeat at The Oval would see them better the result on their last tour four years ago, when they drew 2-2.\nThey were 2-0 up in this series, only to lose the third Test at Headingley and then find themselves outplayed at Old Trafford before the rain arrived.\n\"The ambition was to come here and win the Ashes and we have that chance,\" said Australia batter Travis Head.\n\"The scoreline is 2-1. A couple of Tests could have gone either way. We played well in parts and England have played well in parts. It matches up to an extremely good last Test.\"\nEngland captain Ben Stokes missed optional training on Tuesday, along with Mark Wood, Ben Duckett and Moeen Ali.\nIt is thought that all of the pace attack will be fit after only bowling 30 overs on the final two days of the Old Trafford Test, although there may be a decision to make on Stuart Broad, who is the only home fast bowler to play all five Tests so far this summer.\nAustralia must decide whether to recall the off-spin of Todd Murphy, probably at the expense of one of all-rounders Mitchell Marsh and Cameron Green.", "url": "https://www.bbc.com/sport/cricket/66285707"}