{"authors": ["Janine Bailey", "www.facebook.com"], "date_download": "2025-05-21 07:47:50", "date_modify": "2025-05-21 07:47:50", "date_publish": "2024-12-23 15:58:31", "description": "Life-long Oxford United supporter and chair of the U's supporters' panel Janine Bailey gives her take on events at the Kassam Stadium.", "filename": "sport_football_articles_c1el4x59pj2o_1747813670.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6e61/live/14ff3390-c148-11ef-a2ca-e99d0c9a24e3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c1el4x59pj2o_1747813670.html", "title": "Oxford United: Can Gary Rowett turn things around for U's?", "title_page": "Oxford United: Can Gary Rowett turn things around for U's?  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "I've heard it said that the Championship has two or even three mini-leagues and as we approach the halfway mark of the season, that is evident in the league table.\nUnder any circumstances it was going to be hard for Oxford to get points at Leeds on Saturday; on current form it required a Christmas miracle.\nOxford United's record signing last summer, Siriki Dembele, cost under £1m yet he remains in the treatment room.\nDan James, scorer of Leeds' first goal, commanded a fee of £25m when he joined the Whites in 2021.\nThe majority of the players in Oxford's squad for this match came up from League One last season.\nOxford cannot compete financially with clubs such as Leeds, so we must produce performances that are more than the sum of their parts.\nThere were glimmers of this against Leeds, and gritty persistence won points earlier in the campaign, including against Burnley - newly relegated from the Premier league.\nThis was always going to be a tough season, but we have earned the right to play in this league and have to show that we have what it takes to remain here.\nGary Rowett comes in with the squad looking low on confidence and disjointed on the pitch.\nWe have two sold-out home fixtures against teams alongside us in the bottom-of-the table mini-league.\nWhat better opportunity to begin to turn things around and get some points on the board?", "url": "https://www.bbc.com/sport/football/articles/c1el4x59pj2o"}