{"authors": ["Matthew Howarth", "www.facebook.com"], "date_download": "2025-05-21 07:50:06", "date_modify": "2025-05-21 07:50:06", "date_publish": "2025-05-18 16:51:17", "description": "Brentford 2-3 Fulham: Bees' European hopes hanging by thread", "filename": "sport_football_articles_c5y5p844wqyo_1747813806.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d313/live/b2d7fc00-3407-11f0-8944-2b1dd2bd7018.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c5y5p844wqyo_1747813806.html", "title": "Brentford 2-3 Fulham: Bees' European hopes hanging by thread", "title_page": "Brentford 2-3 Fulham: Bees' European hopes hanging by thread - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "In-form Brentford had looked set to register five consecutive top-flight victories for the first time since 1939 after Bryan Mbeumo and Yoane Wissa had struck their 19th Premier League goals of the campaign to give the Bees a 2-1 half-time lead against neighbours Fulham.\nBut Thomas Frank's side faded as an attacking force after the restart, failing to register another attempt at goal until the 74th minute, by which time the Cottagers had struck twice in two minutes to go 3-2 ahead.\nThe closest Brentford came to restoring parity was when Christian Norgaard's 86th-minute header was tipped over the crossbar by Bernd Leno, who had crucially denied Mbeumo from the spot in the first half.\nThe Cameroonian had scored his previous 11 penalties for the Bees, but Leno dived the right way to keep out the forward's latest effort.\nOnly Manchester City, Newcastle, Arsenal and Liverpool have scored more goals than Brentford this season, but their defensive record on home soil leaves a lot to be desired.\nRelegated Southampton and Ipswich are the only sides to concede more than their 35 in front of their own supporters this season – the most Brentford have shipped at home in the top flight since 1946-47.\nFrank's men must now beat Wolves away on the final day of the season and hope other results go their way to stand any chance of sneaking into Europe.", "url": "https://www.bbc.com/sport/football/articles/c5y5p844wqyo"}