{"authors": ["Nat Hayward", "www.facebook.com"], "date_download": "2025-05-21 07:24:42", "date_modify": "2025-05-21 07:24:42", "date_publish": "2024-12-23 22:01:22", "description": "Unai Emery press conference: Aston Villa vs Newcastle preview", "filename": "sport_football_articles_c5y4qn8523jo_1747812282.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6296/live/dbade4a0-4907-11ef-b74c-bb483a802c97.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c5y4qn8523jo_1747812282.html", "title": "Unai Emery press conference: Aston Villa vs Newcastle preview", "title_page": "Unai Emery press conference: Aston Villa vs Newcastle preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Asked if the Magpies are their main rivals for Champions League qualification, Emery replied: \"We are in a good balance in the table but we are a long way from what we want to do. Newcastle are behind us by two points but we are not now in the top four. We are only facing them thinking they are our opponent now.\"\nOn the Magpies: \"They are now in top form. They played Champions League two years ago. The objective is clear for them to be in Europe. It will be a difficult game.\"\nOn the job Eddie Howe is doing at St James' Park: \"He was doing a fantastic job at Bournemouth. His Newcastle team is very dynamic, they like to play aggressively in attack. They like to do a lot of duels on the field with the players man to man. They beat us last year two times and I respect him a lot.\"\nHe is pleased with the form of Morgan Rogers: \"He has a lot of responsibility in my eyes. I am trying to push him a lot. We will need his numbers. More or less he is getting it. I am very demanding with him because he is very important for us. I am happy with him but I want more from him.\"\nEmery is happy with his midfield options: \"We are building a team. Amadou Onana is getting better. Boubacar Kamara is coming back really, really strong and feeling comfortable after injury. We have to try to use our players with the combinations we can have. Yuri Tielemans can play as a six, eight and sometimes 10. With Ross Barkley we are thinking the same.\"", "url": "https://www.bbc.com/sport/football/articles/c5y4qn8523jo"}