{"authors": ["Ian Westbrook", "www.facebook.com"], "date_download": "2025-04-26 07:55:56", "date_modify": "2025-04-26 07:55:56", "date_publish": "2025-02-25 12:25:50", "description": "Brentford news: 'Brilliant forward planning' meets 'team spirit'", "filename": "sport_football_articles_clyjvp4v4y8o_1745654156.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3eee/live/caf4a690-f0d7-11ee-b0e1-b9dd5ac46984.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_clyjvp4v4y8o_1745654156.html", "title": "'Brilliant forward planning' meets 'team spirit'", "title_page": "Brentford news: 'Brilliant forward planning' meets 'team spirit' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Brentford were just one of the teams this weekend who showed the huge gap which now exists between the established and the promoted Premier League clubs.\nOur 4-0 win at Leicester means we have now scored 20 goals this season against the Foxes, Southampton and Ipswich in only five games – made up of one five, three fours and a three. This follows on from our 5-1 win at Luton at the end of the last campaign.\nOur recruitment seems to have been much better than theirs – buying players in the Championship who we knew could easily also play in the Premier League.\nFriday's starting line-up contained four of our Championship players and two more would have been involved but for injury. That shows continuity and brilliant forward planning.\nThe length of service of so many key players has also produced a superb team spirit, which has been one of our strengths in the Premier League.\nThis is between both the older and the newer players, and another great example of this occurred late in the game at the King Power Stadium.\nSummer signing Fabio Carvalho has had a stop-start time with the Bees so far, making only three starts in his 19 Premier League appearances.\nThere has been talk in some sections of the media about him being unsettled, but whenever it has been raised in press conferences, Thomas Frank has defended the player, saying he trains well and his chance will come.\nSo after Carvalho scored Brentford's fourth at Leicester and ran towards us in the away end, it was great to see his team-mates looking genuinely delighted for him that he had scored.\nThe perfect end to our fourth successive away win!", "url": "https://www.bbc.co.uk/sport/football/articles/clyjvp4v4y8o"}