{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:57:49", "date_modify": "2025-05-20 14:57:49", "date_publish": "2023-07-27 06:35:15", "description": "Kieran Tierney is told he still figures in Arsenal's plans as Rangers wait until next week for Danilo and Jose Cifuentes deals.", "filename": "sport_football_66320819_1747753069.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1504C/production/_130529068_tierneygossip.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66320819_1747753069.html", "title": "Scottish Gossip: Tierney, Armstrong, Danilo, Cifuentes, Sakala, Welsh, Wright, Lowry, Morelos, Helander, McGrath, Smith & Weston", "title_page": "Scottish Gossip: Tierney, Armstrong, Danilo, Cifuentes, Sakala, Welsh, Wright, Lowry, Morelos, Helander, McGrath, Smith & Weston - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Arsenal manager Mikel Arteta insists that Scotland defender Kieran Tierney is in his plans for the upcoming season despite the 26-year-old being linked with Newcastle United and former club Celtic. (Glasgow Evening Times), external\nRangers manager Michael Beale does not expect deals for Feyenoord's Danilo and fellow forward Jose Cifuentes, currently with Los Angeles, to be concluded until next week. (The Herald), external\nManager Michael Beale says the amount Rangers are paying to sign striker Danilo from Feyenoord is \"nowhere near\" what is being reported amid suggestions a £6m offer was lodged and that the 24-year-old will earn £45,000 per week. (Daily Record), external\nFeyenoord have accepted an improved offer of £5m from Rangers for Danilo and, according to Dutch outlet AD, the striker will arrive in Scotland on Monday to sign a five-year contract. (Scottish Sun), external\nBrazilian striker Danilo has formally said goodbye to his Feyenoord teammates and has trained with them for the last time ahead of his proposed transfer to Rangers.(1908), external\nManager Michael Beale says Rangers are weighing up \"three or four\" transfer enquiries for his players as he urged fringe men not to hedge their bets that they will be involved in his plans when he narrows down his squad for European selection. (The Scotsman), external\nRangers forward Fashion Sakala has turned down the chance to leave Ibrox and move to Saudi Arabian club Al-Fayha. (Daily Mail, print edition)\nRangers winger Scott Wright remains in negotiations with Turkish club Pendikspor despite the 25-year-old returning to Scotland to train with his Ibrox teammates. (Scottish Sun), external\nNorthampton Town, newly promoted to League One, are among a number of clubs who are keen on taking 20-year-old Rangers midfielder Alex Lowry on loan. (Daily Record), external\nBradford City are interested in taking 20-year-old Rangers winger Ross McCausland on loan. (Daily Record), external\nAlfredo Morelos' first club, Independiente Medellin, have revealed that they missed out on a sell-on fee after the 27-year-old Colombia striker left Rangers as a free agent this summer. (Daily Record), external\nCagliari are interested in signing Sweden centre-half Filip Helander following the 30-year-old's release by Rangers. (Sky Sports), external\nStriker Tony Weston has agreed a deal to join Derby County after the 19-year-old was released by Rangers. (Football Insider), external\nItalian interest in 23-year-old Celtic centre-half Stephen Welsh, who is admired by Hellas Verona and Udinese, is set to be ramped up after the foreign rules in Serie A were relaxed, with players from the United Kingdom no longer being considered non-European Union players. (Daily Record), external\nRight-back Ben McPherson could be the next Celtic youth to join Admira Wacker on loan, with the 19-year-old possibly following academy teammates Matthew Anderson and Tobi Oluwayemi to the Austrian Second Tier outfit. (Daily Record), external\nSouthampton manager Russell Martin hopes that an enjoyable pre-season has convinced 31-year-old Scotland midfielder Stuart Armstrong to stay despite relegation to the Championship. (Southern Daily Echo), external\nRepublic of Ireland midfielder Jamie McGrath, who spent last season on loan to Dundee United, has opted to terminate his contract with Wigan Athletic, alerting clubs in Scotland to the 26-year-old's availability. (The National), external\nDefender Ryan Edwards has been offered the chance of a big-money move to Owen Coyle's Chennaiyin in the Indian Superleague after the 29-year-old's release by Dundee United. (Daily Record), external", "url": "https://www.bbc.com/sport/football/66320819"}