{"authors": ["Jonathan Jurejko", "www.facebook.com"], "date_download": "2025-05-21 05:32:47", "date_modify": "2025-05-21 05:32:47", "date_publish": "2025-04-02 17:12:36", "description": "Emma Raducanu withdraws from the Great Britain squad for next week's Billie Jean King Cup tie in the Netherlands to \"look after her body\".", "filename": "sport_tennis_articles_cj45v29j92jo_1747805567.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8685/live/1c014210-0fe4-11f0-8db5-3f4abea6b85e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_tennis_articles_cj45v29j92jo_1747805567.html", "title": "Emma Raducanu withdraws from Great Britain squad before Billie Jean King Cup tie", "title_page": "Emma Raducanu withdraws from Great Britain squad before Billie Jean King Cup tie - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Emma Raducanu has withdrawn from the Great Britain squad for next week's Billie Jean King Cup qualifiers in the Netherlands to \"look after her body\".\nThe British number two reached the Miami Open quarter-finals last week.\nRaducanu has competed in seven tournaments so far this year - the most she has played in the first three months of a season.\nThe 22-year-old, who climbed back into the world's top 50 this week, needed medical attention before losing to fourth seed Jessica Pegula in Miami.\nRaducanu's representatives said pulling out of the British squad was a \"difficult decision\".\nThey added: \"She needs a little space in the calendar to best look after her body.\"\nRaducanu has been hampered by a series of fitness issues over recent seasons, while she recently took time off after being targeted by a stalker at the Dubai Tennis Championships in February.\nThe 2021 US Open champion plans to do a training block over the next two to three weeks.\nShe has pulled out of the Rouen Open, which starts on 14 April, and it is unclear when she will return to match action.\nGreat Britain face the Netherlands and Germany in a new BJK Cup round-robin format between 10-12 April.\nRaducanu was part of the British squad that reached the semi-finals of last year's BJK Cup.\nHer withdrawal means British captain Anne Keothavong is assessing her options, but likely to call up another player next week to join Katie Boulter, Sonay Kartal, Harriet Dart and Olivia Nicholls.\n\"Of course you always miss a player of her quality on the team. But I have the utmost belief in the players who are travelling,\" said Keothavong.\nThe leading nation from the qualifying ties in The Hague will seal a place in the Finals later this year.\nThe other two teams will go into the play-offs for the chance to return to the qualifiers in 2026.\nEarlier on Wednesday, world number two Iga Swiatek pulled out of Poland's qualifying ties against Switzerland and Ukraine, saying it was a \"difficult decision\" and she would instead be \"focusing on myself and my training\".", "url": "https://www.bbc.com/sport/tennis/articles/cj45v29j92jo"}