{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:09:18", "date_modify": "2025-05-21 06:09:18", "date_publish": "2025-03-31 11:01:25", "description": "Former Stoke City technical director Ricky Martin will take over as Bristol Rovers' director of football in the summer.", "filename": "sport_football_articles_cj9el9ylvklo_1747807758.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4444/live/34b2ea70-0e18-11f0-8331-61229d24cb73.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cj9el9ylvklo_1747807758.html", "title": "Ricky Martin: Bristol Rovers appoint new director of football", "title_page": "Ricky Martin: Bristol Rovers appoint new director of football - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Stoke City technical director Ricky Martin will take over as Bristol Rovers' director of football in the summer.\nHe will replace George Friend, who will step down at the end of the season having been in the role since February 2024.\nMartin was sacked at Stoke that same month after just over a year in the job and replaced by former Potters striker Jonathan Walters.\nHe will join the club immediately but Friend will also remain at Rovers until the end of the season to \"ensure a smooth transition\".\n\"I am proud of the improvements we have achieved together in developing the club's staffing infrastructure, alongside a sustainable and exciting game model, while the plans for upgraded training ground and stadium facilities promise to further elevate Bristol Rovers in the years to come,\" Friend told the club website., external\n\"The club has a strong foundation with an excellent head coach in Inigo Calderon, a core group of talented players and promising, young, homegrown talent who have been firmly integrated into the first-team environment,\" added the former Rovers defender who also had spells at Middlesbrough, Birmingham City and Exeter City.", "url": "https://www.bbc.com/sport/football/articles/cj9el9ylvklo"}