{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:44:18", "date_modify": "2025-05-21 06:44:18", "date_publish": "2025-01-31 09:32:05", "description": "Former winger Chris Ashton believes England will see Sam Prendergast's inexperience as an \"opportunity\" in Saturday's Six Nations opener.", "filename": "sport_rugby-union_articles_cjder0vz9yro_1747809858.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c294/live/af9b6690-dfb0-11ef-88d3-dd7c96a87c10.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cjder0vz9yro_1747809858.html", "title": "Six Nations: England will 'target' Ireland's Sam Prendergast at Aviva Stadium, says Chris Ashton", "title_page": "Six Nations: England will 'target' Ireland's Sam Prendergast at Aviva Stadium, says Chris Ashton - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former winger Chris Ashton believes England will see Sam Prendergast's inexperience as an \"opportunity\" in Saturday's Six Nations opener.\nThe 21-year-old Leinster fly-half will be making his championship debut having won his three previous caps in November.\nAfter the retirement of Johnny Sexton following the 2023 World Cup, Munster's Jack Crowley wore the number 10 jersey for every minute of last year's Six Nations.\nThe 25-year-old started against the All Blacks and Argentina in the autumn but has since had to make do with a role as a replacement.\n\"The inexperience of Sam might be an opportunity,\" said Ashton on BBC's Rugby Union Weekly.\n\"You're so used to having someone there for Ireland who is so experienced.\n\"We're going back 20 years, [Ronan] O'Gara, Sexton, you're so used to having someone there who is experienced and can lead a team.\n\"Sam is 21-years-old, so if you're looking for a chink somewhere, a target for your team, you're going to go for the fly-half, aren't you?\"\nWhile predicting Ireland's fly-half debate will be a \"close contest for years to come\", Ashton likens Prendergast's style to that of Sexton, who has been in the side's camp in a mentoring role.\n\"The way he looks, the way he plays, is so similar to Johnny Sexton,\" he added.\n\"The way he operates, those wraparound passes, there's so many similarities there.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/cjder0vz9yro"}