{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:23:34", "date_modify": "2025-05-21 05:23:34", "date_publish": "2025-04-03 15:11:51", "description": "Dani Olmo and Pau Victor are eligible to play for Barcelona for the rest of the season, Spain's National Sports Council (CSD) rules.", "filename": "sport_football_articles_c0m9z3171plo_1747805014.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6492/live/c22053d0-1097-11f0-b6ff-f7b4e8c1b1b9.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c0m9z3171plo_1747805014.html", "title": "Dani Olmo: Barcelona forward granted permission to play for rest of season", "title_page": "Dani Olmo: Barcelona forward granted permission to play for rest of season - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Dani Olmo and Pau Victor are eligible to play for Barcelona for the rest of the season, Spain's National Sports Council (CSD) has ruled.\nLa Liga granted Barcelona temporary licences to register Olmo and Victor last summer, but later revoked their registrations after claiming the club had failed to prove they were complying with the league's financial rules by the deadline on 31 December.\nThe CSD gave Barcelona permission to temporarily reinstate the pair following an appeal in January.\nOn Wednesday, La Liga said that the club do not have the financial capacity to register the forwards.\nBut the CSD annulled the agreement between the Spanish top flight and the country's football federation (RFEF).\nThe CSD said the two players' registrations remain valid as the RFEF acknowledged that \"there is no federation resolution that agreed to the cancellation of the licences\" and that its decision not to grant a licence is \"null and void\".\nLa Liga said it will appeal the decision.\nIn a statement on Wednesday, La Liga said it had lowered Barcelona's wage cap after irregularities with their end-of-year accounting for the 2024-25 season.\nBarcelona announced a deal on 3 January to sell VIP boxes at the club's Nou Camp stadium, which is being rebuilt, to raise 100m euros (£83m) in order to meet La Liga's Financial Fair Play rules and extend the registrations of Olmo and Victor.\nBut La Liga said the deal had not been recorded in accounts submitted by Barcelona to the league last week, and that the deal had been approved by a different, unnamed auditor.\nOlmo was part of Barcelona's academy before leaving to play for Dinamo Zagreb and RB Leipzig.\nBarcelona paid £52m to reunite with the Spain international last summer and he has featured 28 times this season, including 13 since the CSD's ruling.\nVictor also came through Barcelona's famed La Masia academy and has played 22 times this term, with five of those appearances coming since the ruling.", "url": "https://www.bbc.com/sport/football/articles/c0m9z3171plo"}