{"authors": ["Tyrone Smith", "www.facebook.com"], "date_download": "2025-05-21 05:41:32", "date_modify": "2025-05-21 05:41:32", "date_publish": "2025-01-31 17:18:00", "description": "Aberdeen boss Thelin backs Rubezic after 'small issues'", "filename": "sport_articles_cre831y1rxzo_1747806092.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2f02/live/a308b360-dff6-11ef-a552-ef694361914c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cre831y1rxzo_1747806092.html", "title": "Aberdeen boss Thelin backs Rubezic after 'small issues'", "title_page": "Aberdeen boss Thelin backs Rubezic after 'small issues' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jimmy Thelin says Aberdeen defender Slobodan Rubezic is in the squad for Saturday's Premiership trip to Hibs after the \"small issues\" that led to the defender being withdrawn at his own request in the first half last weekend.\nRubezic was at fault for the opening two goals in the Dons' 3-0 defeat by St Mirren and was booed by a section of the home support as he was replaced five minutes before the break.\n\"He had some small issues,\" said manager Thelin. \"He didn't train the first session after the game but he has trained the late part of the week.\n\"We always support our players and football is a game of emotions, everybody knows that. There are a lot of emotions out there but we always support our players as a footballer and as a person.\n\"We are still in this together, everyone, and the fans have been really great for us and we keep moving.\"\nWhen asked how difficult it will be for Rubezic to get over the situation, Thelin said: \"He is a human being but he is a good professional player and he has had a lot of energy. Today he was really sharp in the training session.\n\"It can happen, everyone sometimes needs a bit of man-management. Sometimes it is more about the specific of the football, sometimes it can be something outside the football. We have a good relationship.\"\nAberdeen are fourth in the Premiership, but travel to Easter Road looking to end a disastrous run of 13 games without a league win.\n\"I have a strong belief, I speak with the chairman since day one, with Alan [Burrows, chief executive] and Steven [Gunn, director of football] and the rest of the board, my staff, the players,\" Thelin added.\n\"We have a clear picture of what we want to achieve and how we want to look in the future.\n\"The part that has changed has been the results, it has not gone as well as we hoped for but still we are in a strong position. Of course we need to turn the trend around.\n\"We don't like to use excuses, we have to be strong and keep belief. Nothing has dropped in the belief and the passion we have to create a strong future for the club.\"", "url": "https://www.bbc.com/sport/articles/cre831y1rxzo"}