{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 08:04:22", "date_modify": "2025-04-26 08:04:22", "date_publish": "2025-02-26 15:54:39", "description": "BBC's Tom English answers your Scottish rugby questions", "filename": "sport_articles_c4gm9q061gno_1745654662.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d2da/live/243af370-f457-11ef-8c03-7dfdbeeb2526.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_c4gm9q061gno_1745654662.html", "title": "BBC's Tom English answers your Scottish rugby questions", "title_page": "BBC's Tom English answers your Scottish rugby questions - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "BBC Scotland's chief sportswriter Tom English has been answering some of your Scottish rugby questions.\nJames asked: For a number of years the Scotland U20 team have been destroyed in the Six Nations. This year is maybe the worst. What is going wrong? How worried should we be for the future of the Scotland team? Is there a way to address this?\nTom answered: That's why David Nucifora is here as performance director. He's been given what seems like total power to reimagine the player pathway system from about the age of 15.\nI hope he's serious about his business - he flies in and out of his native Australia - because the pathway system has let down years and years worth of young players.\nThey say the first step in solving a problem is accepting you have a problem. The SRU know their underage system is largely not fit for purpose. Hence, Nucifora.\nYoung players need a more professional set-up - better coaching, better strength and conditioning, more meaningful games. I think a lot of the Scottish U-20s in recent years have been badly let down.\nDavid G asked: After losing the pivotal match against England - a game they should have won - are you now concerned Scotland's morale will be low and a revitalised Wales can win? How does Gregor Townsend lift Finn Russell and the players for this game?\nTom answered: I don't think morale will be low. Sadly, Scotland have been in this place before and have managed to bounce back, even though the bounce came too late to contend for a championship.\nThe Wales game has a whole different look now. It was an odds-on win before for Scotland, but the Welsh performance against Ireland was an eye-opener. Yes, it was driven by emotion and desperation, but that only partly explains why they were so good.\nIt explains the thunder of their forwards but the quality of their attack was on a different planet to anything we have seen from them in over a year. A new coaching voice who has put players in their natural positions did wonders against Ireland.\nThe question remains about Wales' ability to replicate that away from home. I still make Scotland favourites - they're hardly lacking in motivation themselves - but I suspect this will be closer than it might have been before Warren Gatland left. I think Scotland will win.\nGrant asked: Considering how many foreign imports Ireland have in their 23, why does it seems only Scotland get flak for their so-called 'plastic players'?\nTom answered: Ireland get less grief for their 'foreign' players probably because they win things.\nNot much is made of it, you're right. I guess when you win then you get to write the narrative. Bundee Aki, James Lowe, Jamison Gibson-Park, Mack Hansen, Finlay Bealham have all played an enormous part in Ireland's success.", "url": "https://www.bbc.co.uk/sport/articles/c4gm9q061gno"}