{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:01:48", "date_modify": "2025-05-21 04:01:48", "date_publish": "2025-01-15 09:45:46", "description": "Everton vs Aston Villa predictions: Chris Sutton on Premier League game", "filename": "sport_football_articles_cy5kl7vx76xo_1747800108.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/561d/live/fbee38e0-d1d4-11ef-87df-d575b9a434a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy5kl7vx76xo_1747800108.html", "title": "Everton vs Aston Villa predictions: Chris Sutton on Premier League game", "title_page": "Everton vs Aston Villa predictions: Chris Sutton on Premier League game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "David Moyes is back in charge of Everton and has a really tough job on his hands. In terms of firepower, he is armed with a water pistol.\nHe has taken over a team which did not score enough goals under Sean Dyche. That was their biggest issue, and it is hard to see how Moyes can solve it with the same players that Dyche had.\nWith Jordan Pickford, James Tarkowski and Jarrad Branthwaite, Everton have got players who can hold them together at the back, but Moyes' conundrum is to increase their attacking threat, and that is going to be a struggle, especially in these early days.\nArmando Broja is injured again so maybe Moyes can get a tune out of Dominic Calvert-Lewin, but that is something none of the the past few Everton managers have managed to do, and I have even seen him being linked with a move away.\nI have got Aston Villa's Emi Martinez in my Fantasy team, and I see him as the best goalkeeper in the Premier League, but they always seem to concede silly goals.\nSo it is possible to get at Villa, I just don't see Everton managing it.\nI don't like talking about myself much but my last goal as a professional footballer was a clever header in a Villa win over a Moyes' Everton team at Goodison Park, and I am going for the same outcome here.\nSutton's prediction: 0-2", "url": "https://www.bbc.com/sport/football/articles/cy5kl7vx76xo"}