{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:33:28", "date_modify": "2025-04-26 03:33:28", "date_publish": "2025-03-08 00:00:00", "description": "Aberdeen seal their passage to the Scottish Cup semi-finals in comfortable fashion as they put Queen's Park adventures in the competition to an end.", "filename": "sport_football_live_c07z177230yt_1745638408.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_c07z177230yt_1745638408.html", "title": "Aberdeen vs Queen's Park: Scottish Cup report, reaction & stats", "title_page": "Aberdeen vs Queen's Park: Scottish Cup report, reaction & stats - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Aberdeen sealed their passage to the Scottish Cup semi-finals in comfortable fashion as they put Queen's Park adventures in the competition to an end.\nThe Championship side were looking to repeat their heroics of knocking out Rangers at Ibrox in the previous round and started strongly, with Jack Turner's stinging volley blocked well after only two minutes.\nAberdeen weathered that early storm, though, and soon their quality told with two goals only 105 seconds apart.\nKevin Nisbet got the first - his backheel flick diverting a near-post corner into the back of the net to get the scoring under way.\nOday Dabbagh made it two, getting on the end of a Shayden Morris cross to tap home. His second and Aberdeen's fourth was close to a carbon copy.\nThe third crept in on the stroke of half-time as Ante Palaversa picked out Graeme Shinnie - making his 600th professional appearance - on the edge of the box.\nThe captain swept a volley at goal, with the ball evading Calum Ferrie, bouncing off a post and going in.\nThe game was well put to bed by that point, even more so after Dabbagh's second-half strike. But Queen's Park were able to get a consolation when the ball sat up kindly for Zak Rudden six yards from goal and he made no mistake.\nFerrie kept the scoreline down in the second-half - reminiscent of his fine performance against Rangers - when he denied substitutes Dante Polvara and Peter Ambrose with two fine saves.\nJimmy Thelin's side saw out the remainder of the game quite comfortably to make it to their sixth semi-final in the last nine seasons.\nAberdeen manager Jimmy Thelin: \"In the first five minutes, they got some good crosses in, got some opportunities. Then we found our rhythm and started playing better as a team - it was a good performance.\n\"Graeme did really well. 600 games is a lot - I'm so proud of how he still has that hunger. He gives energy to the team, in training sessions, off the pitch, on the pitch. I'm so happy to have a player with that mentality.\"\nQueen's Park head coach Callum Davidson: \"It's a wee lesson for us. We started the game pretty well but had that wee period where we concede two quick goals that takes the game away from us.\n\"Then, for another 25 minutes, it's backs against the wall. They score the fourth and it becomes a long afternoon. The lads gave me everything, kept going and didn't stop until the end - I was pleased with their character.\"", "url": "https://www.bbc.co.uk/sport/football/live/c07z177230yt"}