{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:45:34", "date_modify": "2025-05-20 14:45:34", "date_publish": "2023-07-27 18:39:40", "description": "Nottinghamshire give themselves a chance of victory against Kent by building a handy lead of 210 on day three.", "filename": "sport_cricket_66323925_1747752334.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/11909/production/_130554917_gettyimages-1408486880.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66323925_1747752334.html", "title": "County Championship: Ben Slater stars with bat again for Notts against Kent", "title_page": "County Championship: Ben Slater stars with bat again for Notts against Kent - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ben Slater and Haseeb Hameed built on a small first-innings lead to move Nottinghamshire 210 in front with nine wickets in hand at the close of day three of their County Championship match against Kent.\nThe pair shared a partnership of 131 - Nottinghamshire's best this season for the first wicket - before Hameed was out for 45 six overs before the close.\nSlater's unbeaten 87 leaves him 13 runs away from a second hundred in the match, with Will Young on 32 from just 19 balls as Nottinghamshire closed on 176-1.\nEarlier, although there were solid performances from Harry Finch (73) and Joey Evison (49), Kent ultimately squandered what looked to be a good position in reply to Nottinghamshire's first-innings 350 by losing their last five wickets for 23 to be 316 all out.\nLeg-spinner Calvin Harrison finished with a career-best 4-28 - albeit in only his seventh first-class match - and Brett Hutton kept his nose in front as Division One's leading wicket-taker with 3-76.\nKent had been well placed at 102-2 when rain forced them off at tea on Wednesday, but their morning began badly when Ben Geddes was out in the second over, caught by Harrison at second slip chasing a widish ball from Hutton that found some extra bounce.\nHarrison entered the attack for the first time just before lunch and a disbelieving Leaning was out to his second ball, getting a thin edge that then freakishly ballooned high into the air, apparently off the top of wicketkeeper Tom Moores' boot. It flew over the head of Steven Mullaney at slip but the Nottinghamshire skipper had time to catch it on its way down.\nAlex Blake fell to the fifth delivery with the second new ball as Hutton raised his tally for the season to 48 - his best return in a first-class season - but as Finch and Evison added 75 in 18 overs it seemed Kent's confidence had not been misplaced after all.\nFirst Finch made a rare misjudgement and paid the price, offering no shot as Dane Paterson brought one back to clip his off stump.\nThe South African followed up by bowling Evison in his next over with another nip-backer, good enough to do the job even though Evison did attempt to keep it out.\nHarrison then coaxed a miscue to deep extra cover from Matt Quinn and from 293-5, Kent were suddenly 308-8. A couple of overs more and they were all out and conceding a 34-run deficit, the leg-spinner finishing the innings with two in two balls as Arshdeep Singh holed out to deep midwicket and Arafat Bhuiyan offered him a rigid front pad.\nSlater and Hameed exposed the limitations of the Kent attack, which lacks a front-line spinner, proceeding largely untroubled, certainly in terms of chances offered, through almost 35 overs before Hameed aimed an injudicious slash at a shortish wide delivery from Singh and was caught behind.", "url": "https://www.bbc.com/sport/cricket/66323925"}