{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:55:51", "date_modify": "2025-05-21 04:55:51", "date_publish": "2025-04-04 14:13:32", "description": "The Court of Arbitration for Sport will hear the appeals of Mexican sides Club Leon and Pachuca next month following Fifa's decision to remove Club Leon from this summer's Club World Cup.", "filename": "sport_football_articles_cj68zy22nnjo_1747803351.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6e5c/live/68d84c60-115a-11f0-9c64-93da9e1b4cb6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cj68zy22nnjo_1747803351.html", "title": "Fifa Club World Cup: Cas hearing set over Club Leon ban", "title_page": "Fifa Club World Cup: Cas hearing set over Club Leon ban - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The Court of Arbitration for Sport will hear the appeals of Mexican sides Club Leon and Pachuca next month following Fifa's decision to remove Club Leon from the Club World Cup this summer.\nLast month Fifa determined that Club Leon and Pachuca did not comply with rules prohibiting clubs to directly or indirectly hold or deal in the securities or shares of another participating in the competition.\nBecause both clubs are owned by Grupo Pachuca, Fifa removed Club Leon from the upcoming Club World Cup in the United States.\nCas has now registered separate appeals from Pachuca and Club Leon seeking to annul the decision and declare that the clubs comply with the Club World Cup eligibility requirements.\nClub Leon have filed an additional appeal against the decision by the Fifa secretary general to be reinstated in the competition.\nCas said the appeals will be expedited and heard during the week beginning Monday, 5 May.\nOn Monday, Fifa said it was considering a one-off play-off match between LAFC and Mexican side Club America for the right to replace Club Leon in the tournament.\nCas proceedings are ongoing for a separate appeal by Costa Rican side Asociacion Liga Deportiva Alajuelense (LDA), who say one or both of Club Leon and Pachuca should be removed.\nLDA requests that they are admitted to the competition as the next eligible club. That case will be heard in Madrid on 23 April.\nClub Leon were drawn in a group with Chelsea, ES Tunis and Flamengo.\nThe Club World Cup will begin on 14 June with the final to be played on 13 July in New Jersey.", "url": "https://www.bbc.com/sport/football/articles/cj68zy22nnjo"}