{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:37:41", "date_modify": "2025-04-26 03:37:41", "date_publish": "2025-03-08 00:00:00", "description": "Tyrese Campbell's second goal in as many games secures victory for Sheffield United against Preston.", "filename": "sport_football_live_cn9vj99pe2zt_1745638661.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_cn9vj99pe2zt_1745638661.html", "title": "Sheffield United 1-0 Preston North End: Tyrese Campbell earns Blades win", "title_page": "Sheffield United 1-0 Preston North End: Tyrese Campbell earns Blades win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Tyrese Campbell's second goal in as many games secured victory as Sheffield United beat Preston at Bramall Lane to move level on points with league leaders Leeds.\nThe forward headed in a near-post cross from Harrison Burrows to earn the promotion contenders their sixth win in their past seven matches.\nPreston, managed by former Blades boss Paul Heckingbottom, defended tenaciously and made it difficult for the home side to break them down.\nHaving struck the woodwork through Sam Greenwood just before Campbell's goal, North End finished strongly but were unable to carve out an equaliser.\nThe Blades, who started unchanged from their 2-1 win at QPR last weekend, dominated possession from the first whistle and might have opened the scoring inside the second minute.\nBurrows charged down the left-hand side and delivered a low cross that found its way through to Campbell at the far post, only for the striker to bundle his finish into the side netting.\nCampbell was later foiled by keeper Freddie Woodman after racing on to a pass from Gus Hamer – who pulled most of the strings for the home side and went close himself with a run and drive just wide of the post.\nPreston rarely ventured into their opponents' half and, other than a glancing header from Ryan Porteous that sailed over the bar, Michael Cooper remained largely untroubled in the home goal.\nHowever, the keeper was beaten early in the second period when Robbie Brady won the ball and fed Greenwood – the on-loan Leeds player almost striking a vital blow for his parent club as his drive rattled the post.\nThat close call seemed to galvanise United, who took the lead almost immediately as Hamer fed Burrows, who whipped over a curling cross for Campbell to power in his eighth goal of the campaign.\nHeckingbottom responded by making a triple change and two of those new arrivals, Andrew Hughes and former Blade Ched Evans, both tested Cooper as Preston applied some pressure during the closing stages.\nBut Chris Wilder's side saw out the game to complete their fourth consecutive victory over North End and maintain their promotion bid, while Preston slip a place in the table to 16th.\nSheffield United manager Chris Wilder told BBC Radio Sheffield:\n\"I thought we were really good from start to finish, against stubborn opponents. We were really connected, from mid to top of the pitch, and possibly should have got something more rewarding for our first 20 to 25 minutes.\n\"We came in at half-time 0-0 and basically said, 'don't get anxious'. We've got players that can find those big moments and we found that with a fabulous ball by Harrison and a great finish by Ty.\n\"Late on, they had nothing to lose – they were 'Hail Marying' it and going more direct than they were in the first half and we just had to deal with that. I don't think Coops really had much to do.\n\"We were always looking for that second goal and we made positive substitutions, but we didn't find it. Going into those last five minutes where they're taking risks, you have to win first and second balls – which we did.\"\nPreston manager Paul Heckingbottom told BBC Radio Lancashire:\n\"I've been involved in enough games at Bramall Lane to know that to come here you've got to play well and take your moments, then you've got to have the big decisions go your way. We didn't take our moments and we didn't have the big decisions.\n\"First half-hour they caused us a lot of problems, probably more than most have this season, with their front four – but after that we got to grips with it.\n\"Because of the problems they were causing us, we were on the back foot and much more apprehensive than we normally are as a team. We went into our shell a little bit.\n\"We restricted them to very little in the second half but then that one moment, that one lapse, they score. Even though we had moments we struggled to get the goal, which the effort probably deserved.\"", "url": "https://www.bbc.co.uk/sport/football/live/cn9vj99pe2zt"}