{"authors": ["Phil McNulty", "www.facebook.com"], "date_download": "2025-05-21 06:12:04", "date_modify": "2025-05-21 06:12:04", "date_publish": "2025-01-23 00:13:40", "description": "Paris St-Germain’s \"Ultras\" warned Manchester City what awaited them in Paris – but they could not have contemplated the scale of the nightmare that unfolded, writes Phil McNulty.", "filename": "sport_football_articles_czepl0g4pl0o_1747807924.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4d2b/live/ae150410-d962-11ef-902e-cf9b84dc1357.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_czepl0g4pl0o_1747807924.html", "title": "'Guardiola's job at Man City never been bigger'", "title_page": "'Guardiola's job at Man City never been bigger' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Paris St-Germain's 'Ultras' warned Pep Guardiola and Manchester City about what awaited them on a stormy night in Paris - but they could not have contemplated the scale of the nightmare that unfolded.\n\"Beaten By The Waves, Paris Never Sunk\" was the message emblazoned on a giant flag that stretched the length of one end at the Parc des Princes, the centrepiece of a spectacular pre-match display of pyrotechnics and naked hostility designed to raise the noise and the atmosphere.\nIt contained a brutal truth for City and Guardiola, who suffered one of the most chilling, chastening nights of his reign as an undeserved two-goal lead was transformed into a 4-2 defeat that flattered the Premier League champions, not PSG.\nThe manner in which City collapsed, crumbling in the face of PSG's thrilling attacking assault, exposed every flaw that has seen Guardiola's side slide into a steep decline this season.\nThey are off the pace in defence of their domestic title, while they now need a win against Club Brugge at Etihad Stadium to go into the Champions League play-offs, their standing of 25th in the new table something that should serve as a source of embarrassment to everyone at the club.\nGuardiola's Manchester City of old would have completed the job after going two up. Not this version. Not the version that has lost eight points from winning positions in the Champions League and 14 in the Premier League.\nWhen City lost a 3-0 lead in the final 16 minutes to draw at home to Feyenoord in November, it was regarded as freak occurrence, a cruising team taking its eye of the ball.\nIt was not. This Manchester City is the team that cannot be trusted.\nFurther compelling evidence of their current lack of character and capacity to meltdown came when they conceded two goals in the last two minutes to lose the derby to Manchester United.\nThis was different. This was far more disturbing as PSG showed heart when 2-0 down, simply overpowering City who were a pale shadow of a once all-conquering team. Even Guardiola was forced to admit: \"We could not cope.\"\nIt was a pitiful, barely believable, surrender as City were too slow through the central areas, ripped apart on the flanks and generally given the sort of comprehensive going over they used to hand out, as opposed to being the recipient of.\nIn a PSG barrage, City faced 26 shots - the highest total against them since the Champions League game against Real Madrid in September 2012 when the Spaniards had 35.\nThe sight of Matheus Nunes - an attacking operator - at right-back, with Kyle Walker close to completing a move to AC Milan, demonstrated the sort of muddled thinking that has clouded City and Guardiola's season, a flaw which requires addressing.\nHe was all at sea, as was another substitute Rico Lewis, as PSG rampaged through the wide areas at will, with Bradley Barcola, Desire Doue and substitute Ousmane Dembele leaving a trail of destruction behind them.\nThis loss was, however, a collective failure of manager and team as City threatened to fall apart, then did as they conceded four goals in one half for the first time in a game since they lost 5-2 at home to Leicester City in September 2020.\nEven after going 2-0 up, City never looked in any form or condition to manage the game. Guardiola regards possession as nine-tenths of football's law - here they were guilty of criminal negligence, with Dembele's goal three minutes after Haaland's second a major turning point.\nGuardiola, as he stood soaked and stunned on the sidelines, powerless to prevent a defeat which should have been far more emphatic, may now realise he has an even bigger rebuilding job on his hands than he thought.\nThe great Kevin De Bruyne looked all of his 33 years, as did Bernardo Silva and Mateo Kovacic, both 30, as PSG's energy in and out of possession flagged up every frailty that has haunted City this season. De Bruyne and Kovacic were both replaced, spent, after 70 minutes.\nOf course, so much can be traced back to the serious knee injury sustained by midfielder Rodri, the best player in the world in his position, against Arsenal in September, but that simply cannot explain or excuse a defeat, and the manner in which it came, that should send shockwaves through a club of such high ambitions.\nThe statistics make grim reading for Guardiola, with City having failed to win after taking the lead in nine games in all competitions this season (four losses and five draws) the most of any Premier League club in 2024/25.\nCity have lost their past three Champions League games away from home, their second-longest losing streak since four in a row between November 2011 and December 2012 under Roberto Mancini.\nAnd this was the first time they have lost a game from two goals up since a 3-2 defeat by Brighton in May 2021.\nGuardiola's renewal of City has started with the signings of defensive duo Abdukodir Khusanov, the 20-year-old from Lens and Vitor Reis, 19, from Palmeiras, while Eintracht Frankfurt forward Omar Marmoush is on the way.\nOn this evidence, the rebuild should not end there because City looked weak in the wide defensive areas, a problem exacerbated by the imminent departure of the veteran Walker, and laboured in central midfield, a department in clear need of refreshment.\nGuardiola was magnanimous in defeat against his old friend and Barcelona cohort Luis Enrique, saying: \"PSG were better than us. We could not make the passes, cope with the fast transitions.\n\"The table is fair, we all have points, no argument - PSG have played better and not won, today they did. To defend we have to play, we could not. Give credit to PSG.\n\"We tried to keep ball with Ilkay Gundogan, James McAtee and Jack Grealish but couldn't. Everything happens in the middle where you control game, they could, we could not. PSG players move with a lot of sense attacking & defending - good collective.\n\"We could not cope, but when one team is better, it is not a problem to accept it. We now prepare for a tough game against Chelsea [in the Premier League on Saturday] and then final with Brugge.\"\nBrugge sit in 20th place in the Champions League table. City should be favourites, but such is their reduced level of performance and their tendency to crack under pressure - and this is now a high-pressure situation - this is no longer a guarantee for Guardiola's team.\nEvents on a crackling, emotional, rain-lashed night in Paris left them in Champions League peril.\nWhat was unthinkable at the start of the season will now be troubling the thoughts of a manager and team in danger of elimination before the last 16.", "url": "https://www.bbc.com/sport/football/articles/czepl0g4pl0o"}