{"authors": ["Drew Heatley", "www.facebook.com"], "date_download": "2025-05-21 05:44:13", "date_modify": "2025-05-21 05:44:13", "date_publish": "2025-01-14 12:36:25", "description": "Fulham news: Opinion - Will FA Cup campaign be significant?", "filename": "sport_football_articles_c98ye5vng0eo_1747806253.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ed37/live/daad5110-b629-11ee-beb5-e1400df560f2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c98ye5vng0eo_1747806253.html", "title": "Opinion - Will FA Cup campaign be significant? - BBC Sport", "title_page": "Fulham news: Opinion - Will FA Cup campaign be significant? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "This season marks 50 years since our last domestic cup final. That is scandalous for a club with our heritage.\nGrowing up, we clung onto that Wembley defeat to West Ham in 1975. Even 20-odd years ago, replica kits were produced, the players were spoken about with reverence (and rightly so), and DVDs were on sale.\nThe Europa League final has usurped 'Wembley 75' in recent years, but that day remains as good as it has ever got for us on home turf.\nVictory over Watford at a two-thirds full Craven Cottage on Thursday night means we are in the hat for the fourth round and have been drawn away against League One opposition in either Mansfield Town or Wigan Athletic.\nThe fact we contested the third-round tie under the floodlights, and it wasn't even a replay, shows how the magic of the cup continues to ebb away, but a trip to Field Mill in particular would stoke the flames of nostalgia – it has been nearly 30 years since we faced the Stags.\nThis FA Cup campaign feels like it could be significant. As that 50-year anniversary looms, under Marco Silva we are as well equipped to mount a run to Wembley as we have been at any point since.\nWe are enjoying one of our strongest-ever Premier League campaigns, and tasted a League Cup semi-final last season, falling narrowly to Liverpool over two legs. The trajectory since Marco's arrival has only been going one way, and I have got a feeling he is destined to add to the Championship trophy he lifted in 2022.\nThere is a long way to go, of course, starting with Wigan or Mansfield. But what better way to inject a bit of magic back into the world's premier domestic cup competition than to have London's oldest football club reach the final?\nIt is in danger of becoming a once-in-a-lifetime occurrence, and that just will not do.", "url": "https://www.bbc.com/sport/football/articles/c98ye5vng0eo"}