{"authors": ["Nicola Pearson", "www.facebook.com"], "date_download": "2025-05-21 05:57:49", "date_modify": "2025-05-21 05:57:49", "date_publish": "2025-01-31 13:59:36", "description": "Pep Guardiola press conference: Arsenal vs Man City", "filename": "sport_football_articles_c1jg9e7r7r1o_1747807069.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/deec/live/405a9a50-4922-11ef-9e1c-3b4a473456a6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c1jg9e7r7r1o_1747807069.html", "title": "Pep Guardiola press conference: Arsenal vs Man City", "title_page": "Pep Guardiola press conference: Arsenal vs Man City - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The injury list \"continues the same\" so Guardiola does not expect any players to return for Sunday.\nOn facing Real Madrid in the Champions League play-offs: \"It feels like a derby already. Four years in a row facing Real Madrid. But Bayern or Madrid - both was really tough. Hopefully we can arrive for the first leg here, and then at Madrid, as best as possible.\"\nOn the difficulty of the Champions League draw: \"It's fine. We could have been better? Yeah. We could have been in the top eight? Yeah, but we were not good enough. We don't deserve to be in the finals this season, winning just three games and drawing another one. We lost a lot. The draw could have been nicer? Yes, but the draw is the draw. Bayern Munich was extremely difficult. Real Madrid difficult - we know that. We have done it in the past. It is not a problem.\"\nOn a congested fixture calendar in February, Guardiola said the \"schedule is what it is\" and that the \"Premier League always puts the toughest schedules for teams in Europe\".\nHe insisted that he was \"not complaining\" because it has \"always been like that\": \"I remember when I was in Barcelona, following the Premier League and Alex Ferguson, Jose Mourinho and Arsene Wenger made the same complaints. Do you think it is going to change? The broadcasters decide - they don't ask me.\"\nGuardiola is not sure if City will add any more players this window but said he is \"always happy\" with what the club do as they have done \"their best for now and [will do for] the next five, 10, 20 years. They always try to do their best\".\nOn the future of James McAtee: \"I don't think [we are selling]. He is going to stay. We don't have enough players. We have a World Cup at the end of the season [and] we have a lot of games. But maybe an offer will arrive and we will have to sell him.\"\nThe City boss rejected questions that Sunday's game is a grudge match, stating his relationship with Arsenal counterpart Mikel Arteta is still \"exceptional\" and \"the respect we have is always there\".\nOn whether Rodri picking up his injury against Arsenal in September was the turning point for City this season: \"The absence of Rodri is massive but it has not just been Rodri. The best player in the world absent - tell me one team in the world who would not notice? I'd have preferred to lose that game and have Rodri all season, but the situation we had this season was not just because of Rodri.\"", "url": "https://www.bbc.com/sport/football/articles/c1jg9e7r7r1o"}