{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 08:12:39", "date_modify": "2025-04-26 08:12:39", "date_publish": "2025-02-26 11:54:32", "description": "Man Utd news: Fan views on what nobody is talking about", "filename": "sport_football_articles_cpdex404xn6o_1745655159.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cpdex404xn6o_1745655159.html", "title": "Man Utd news: Fan views on what nobody is talking about", "title_page": "Man Utd news: Fan views on what nobody is talking about - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "We asked you to tell us an issue no-one is talking about at Manchester United.\nHere are some of your replies:\nRemi: Alejandro Garnacho hasn't scored in his past 19 games. I don't even think this is a huge issue on his part, he clearly plays well enough to stay in the squad, but if he can go on that kind of goal drought and stay... why couldn't Marcus Rashford?\nMike: How bad is Bruno Fernandes? How many times does he give the ball away seeking the killer pass from all over the pitch? Attempting that gets them into trouble more often than not!\nMartyn: The fact Altay Bayindir is actually wearing the number one shirt but isn't actually our first-choice goalkeeper. Every time Bayindir has started a match he has been pretty solid. Andre Onana, on the other hand, makes everyone nervous! It is time Bayindir was given more game time and Onana dropped to the bench.\nPete: Kobbie Mainoo. His performances recently have been seriously under par, and the only time he has looked vaguely quality was as a number 10 in the Europa League. What has happened to the young defensive midfielder we saw at first? He looks slow and heavy - almost a different player.", "url": "https://www.bbc.co.uk/sport/football/articles/cpdex404xn6o"}