{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:55:20", "date_modify": "2025-05-21 04:55:20", "date_publish": "2025-01-23 13:54:32", "description": "Liverpool news: Jarell Quansah on first Champions League start", "filename": "sport_football_articles_cg5yvrpgdl2o_1747803320.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cb90/live/c210fbc0-d987-11ef-9467-577a0b7c8ee7.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cg5yvrpgdl2o_1747803320.html", "title": "Liverpool news: Jarell Quansah on first Champions League start", "title_page": "Liverpool news: Jarell Quansah on first Champions League start - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Liverpool defender Jarrell Quansah is \"very proud\" to have made his first Champions League start for Liverpool but is determined to keep level-headed about it.\nIt was the 21-year-old's second appearance in the competition for Liverpool after making a brief cameo in their win against Bayer Leverkusen at Anfield in November.\n\"[It was] a very enjoyable experience - I've worked so hard in my career and to play in the Champions League at Anfield is a dream come true,\" Quansah told BBC Radio Merseyside after the win over Lille.\n\"[I am] very proud. [It's important to] try and keep perspective as well - if things don't go your way, you look back at these nights and they'll always be under my belt.\n\"Every game is a learning process for myself. I'm not getting too down if I make a mistake or two - I know I need to learn.\n\"Hopefully, it's going to be a long career for myself so I just will keep level and not get too high with the highs or low with the lows - temperament is the most important thing.\nThe defender has made 12 appearances this season for the Reds, but has not started any of their past seven Premier League games. He agreed he does not enjoy being a substitute.\n\"I'm not going to sit here and say it's easy,\" he said. \"It's always tough. It's about how you prepare and put yourself in the best mind frame and physical condition that you can.\" it's not easy when you're not in the team you've just got to do everything for the team when you're in it.\"", "url": "https://www.bbc.com/sport/football/articles/cg5yvrpgdl2o"}