{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:49:01", "date_modify": "2025-05-21 03:49:01", "date_publish": "2025-02-09 17:55:08", "description": "Tyrone overturn a seven-point half-time deficit to beat Mayo 1-15 to 2-11 in Division 1 of the Ladies National Football League.", "filename": "sport_articles_cp8kr8wepk3o_1747799341.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4173/live/a9e96b60-e70e-11ef-a5b2-6f302c2db239.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cp8kr8wepk3o_1747799341.html", "title": "Ladies National Football League: Tyrone earn dramatic Division One win in Mayo", "title_page": "Ladies National Football League: Tyrone earn dramatic Division One win in Mayo - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tyrone overturned a seven-point half-time deficit to earn their first win in Division 1 of the Ladies National Football League by edging out Mayo 1-15 to 2-11 at Swinford.\nTwo points from Chloe McCaffrey and a superb Aoife McGahan score kept Tyrone in touch at 0-4 to 0-3 down despite playing against the breeze before a run of four unanswered points by the hosts and Clodagh Keane's goal on the stroke of half-time left the interval scoreline at 1-9 to 0-5.\nHowever, Tyrone used the elements well after the break as they hit four straight points when Mayo were down to 14 players following a yellow card.\nAgainst the run of play, Sinead Walsh scored Mayo's second goal on 43 minutes after a wayward shot by Hannah Reape fell into her hands and she thundered a strike past Amelia Coyle.\nHowever, Mayo skipper Danielle Caldwell was then yellow carded as two more McCaffrey frees and brace of Niamh O'Neill scores left only a kick of the ball between the sides before Sorcha Gormley fired a levelling goal.\nErin Murray put Mayo back ahead but O'Neill fired over two late points to put Tyrone ahead for the first time.\nKayla Doherty had a chance in the final seconds to win it for Mayo but her shot was brilliantly saved by Coyle as Darren McCann's side left Swinford with a valuable win.\nDefending Division One champions Armagh maintained their winning run by edging out Dublin 0-11 to 2-4 on Saturday.\nIn Division Two, a last-minute goal from skipper Roisin Rodgers earned Donegal a 1-7 to 0-8 win over Monaghan.\nCavan were among the Division Three winners as they hammered Carlow 6-17 to 1-4 while Down lost 2-11 to 1-4 against Laois.\nFermanagh, meanwhile, were victorious in Division Four as they held off Longford 4-14 to 4-8 in a high-scoring contest.\nLIDL NATIONAL FOOTBALL LEAGUE RESULTS\nDivision One\nArmagh 0-11 Dublin 2-4\nKerry 2-10 Kildare 0-7\nTyrone 1-15 Mayo 2-11\nMeath 2-11 Waterford 1-13\nDivision Two\nDonegal 1-7 Monaghan 0-8\nGalway 1-18 Roscommon 1-11\nCork 3-12 Tipperary 0-9\nClare 2-17 Westmeath 0-7\nDivision Three\nCavan 6-17 Carlow 1-4\nLaois 2-11 Down 4-3\nLimerick 5-12 Offaly 1-4\nLouth 1-6 Wexford 0-6\nDivision Four\nFermanagh 4-14 Longford 4-8\nLeitrim 1-11 Wicklow 3-4", "url": "https://www.bbc.com/sport/articles/cp8kr8wepk3o"}