{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:10:39", "date_modify": "2025-05-21 06:10:39", "date_publish": "2024-12-24 12:27:07", "description": "Kilmarnock boss McInnes keen to strengthen several areas of squad in January", "filename": "sport_articles_cgkx8r0mgn4o_1747807839.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7831/live/fc88d640-c1f1-11ef-b28c-1f5932281567.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cgkx8r0mgn4o_1747807839.html", "title": "McInnes keen to strengthen several areas of squad in January", "title_page": "Kilmarnock boss McInnes keen to strengthen several areas of squad in January - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Kilmarnock manager Derek McInnes says his January transfer aims aren't confined to strengthening a threadbare defence.\nWith Robbie Deas suspended and fellow centre-back Stuart Findlay a long-term injury absentee, Killie played a back three in Friday's 1-1 draw against Motherwell, with winger Fraser Murray and midfielder Brad Lyons at full-back.\n\"I think for every manager, you look to try and bring some reinforcements in if we can, and maybe one or two of the lads look to move on and get some regular football as well, which is natural,\" said McInnes.\n\"January's such a difficult month, unless you've got bundles of cash to spend, which we don't, to improve your starting 11.\n\"But we'll certainly try and see if we can get some reinforcements in to help us. I think defensively, we were short in numbers, and it's an obvious area, but it's not the only area we'd like to strengthen if we could.\"\nDeas remains suspended for the Boxing Day visit of Aberdeen but Killie will go into the game with confidence after bouncing back well from their 6-0 defeat against Rangers at Ibrox.\nThe Ayrshire side have since beaten Hearts - despite an early red card for Deas - and picked up a point at both Tannadice and Fir Park.\n\"The response has been terrific,\" McInnes said. \"Two away points, two decent performances and a brilliant performance.\n\"So much was said about Hearts last week, about how bad Hearts were and how poor they were, and finger pointing, but I don't think there was enough said about how 10 men can play 90 minutes from scratch and still have enough to go and win.\"", "url": "https://www.bbc.com/sport/articles/cgkx8r0mgn4o"}