{"authors": ["Iain Carter", "www.facebook.com"], "date_download": "2025-05-21 04:06:16", "date_modify": "2025-05-21 04:06:16", "date_publish": "2025-04-07 05:06:44", "description": "This week's Masters heralds the start of the men's major season with Rory McIlroy still searching for how to win the coveted Green Jacket, writes Iain Carter.", "filename": "sport_golf_articles_c2ewg1ezd3mo_1747800376.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d614/live/98182440-153e-11f0-a455-cf1d5f751d2f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_golf_articles_c2ewg1ezd3mo_1747800376.html", "title": "Rory McIlroy's Augusta Masters memories must be turned into positive as he chases Grand Slam", "title_page": "Rory McIlroy's Augusta Masters memories must be turned into positive as he chases Grand Slam - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It is often referred to as the most important distance in golf - the five inches between the ears.\nThe game is as much a test of temperament as technique and champions at the very highest level have to conquer both elements to land the biggest titles.\nIn their prime the likes of Colin Montgomerie and Lee Westwood had the physical attributes to win any tournament they played. But something would always get in the way when it came to the majors, the big four tournaments that define careers.\nThere was always a stumbling block at the Masters, The Open, the US Open or US PGA Championship. It prevented them, and many others, from producing their best shots when they most needed them.\nIt is not a slight to say this. It's golf. The mental challenge of pulling off key shots when the only inhibiter is the pressure of the moment encapsulates the magic of the game.\nIt will be evident in abundance again this week as Rory McIlroy embarks on his latest attempt to complete the career Grand Slam. He is among the world's best who are all gathering together for the first time in eight months for the Masters at Augusta National.\nThese major weeks are the ultimate individual examination and for all his prolific form at tour level, McIlroy has failed to add to his tally of four major wins since 2014.\nWe wonder why Westwood and 'Monty' never won a major, why it took Phil Mickelson until his 13th year on tour to land his first win on this elevated stage but the most burning current question surrounds McIlroy's frustrations - the majors and most pertinently the Masters.\nSo precocious was the Northern Irishman's talent when he first competed as a teenager in 2009 he was asked about completing the Grand Slam by the age of 22.\nTwo years on at Augusta he led by four shots going into the final round, only to shoot 80 in a scarring denouement. Despite four subsequent top-five finishes, he has never since embarked on the final day back nine with a real chance of glory.\n\"The biggest challenge for Rory is the mental one,\" said Paul McGinley. The former Ryder Cup captain's Golf Channel colleague, Brandel Chamblee, added of the Masters. \"It is literally his nemesis, It brings out the worst golf in Rory annually.\"\nThe popular view is that McIlroy suffers from a build-up of mental scar tissue, first triggered by that Augusta capitulation in 2011.\nAlthough he quickly started collecting his quartet of majors, post 2014 there have been many instances where further setbacks have added to the malaise. Most recent was last year's US Open where he was beaten by to the title by Bryson DeChambeau despite leading by two with five holes to play.\n\"It is possible for people to build something up in their heads and say this is the one that I struggle with because previously something bad happened,\" chartered psychologist Stephen Smith told BBC Sport.\n\"That memory hasn't been processed properly out of what we call the short term executive memory into your long term memory.\n\"And it's literally interfering with the performance message from the higher order brain.\n\"It's almost like a mini form of PTSD (post traumatic stress disorder).\"\nSmith has worked with athletes across a wide range of sports and says bad memories can influence physical performance.\n\"The wire that carries the performance movement message from your brain to your body gets that wonderful swing going in a connected way,\" he said.\n\"And that's why you make more mistakes on that hole or on that course or in that tournament, because you're just literally not able to send the signal to the muscles. It's getting interfered with by what you would call scar tissue.\"\nNot since that ill-fated tilt in 2011, when he began with a 65, has McIlroy made a dominant start to the Masters. He has only broken 70 on one occasion - a 69 in 2018 when he finished tied fifth behind Patrick Reed after a final round 74.\nIn this period he has won at every level, including the prestigious Players Championship twice. The second of those Sawgrass wins occurred only last month and that combined with a fine win at Pebble Beach in February is fuelling optimism for this week.\nThe now 35-year-old is second favourite behind defending champion Scottie Scheffler, who has yet to win this year. Indeed, of all the biggest names, McIlroy has had the most successful start to the year.\nStars are aligning for him to win the one major to elude him.\nVictory this week would put him alongside the all time greats: Gene Sarazen, Ben Hogan, Gary Player, Jack Nicklaus and Tiger Woods - the only golfers to have won all four majors and completed the Grand Slam collection.\nMcIlroy is desperate to wear the famous Green Jacket, but can you want it too much?\n\"That's a very good point,\" said Smith.\n\"All of this is said without me ever having spoken to Rory, I couldn't comment as to how accurate my views on the situation are.\n\"But looking at it from outside the goldfish bowl that is tournament golf, you look at it and say, OK, right, maybe that's it, it could be that he actually wants it too much.\"\nMcIlroy has been working with sports psychologist Bob Rotella in the build up to his 17th attempt at winning the Masters. \"I think he'll have him very well prepared now,\" McGinley said.\n\"They've had two or three runs at this now, and I think they will be coming up with a plan in terms of taking that pressure and decimating it and putting it aside.\"\nSmith believes the answer lies in reaffirming good memories, such as McIlroy's imperious opening drive in his three-hole play-off win over JJ Spaun at the Players three weeks ago. The champion admitted to being very nervous before that tee shot.\nNicklaus, winner of a record 18 majors, used to insist he never missed a short putt in the sport's biggest championships, which was not true but a valuable technique to reaffirm confidence. Woods would celebrate fine shots with a trademark move with his club.\n\"Tiger with his club twirl,\" said Smith, who is an associate fellow of the British Psychological Society. \"It's a hard copy down of the good stuff into the long-term memory so he can draw on it.\n\"I know that I can do it. I know that I've won.\"\nAnd while the notion of accumulated mental scar tissue is potentially ruinous, Smith believes that McIIroy is at a prime age to deal with any such issue.\n\"His emotional intelligence is growing, immensely,\" he said. \"He is not the man he was was when he was 29 or 30.\"\nAnd in 2025, McIlroy - without yet playing at his very best - looks assured. Using a different ball this year his technique, especially in his approach play, looks better nuanced and more effective.\nSo this might just be the year for the man with 28 PGA Tour wins, but no major victories in his past 38 attempts. He is playing the best golf of any of the leading contenders, but this week carries a mental burden far greater than any of his rivals.\nIt is the bit between the ears.\n\"You've got to own it because if you don't it'll just niggle away at you,\" Smith said. \"So you've got to almost burst that cyst, excise it, clean it out, deal with it.\"", "url": "https://www.bbc.com/sport/golf/articles/c2ewg1ezd3mo"}