{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:41:46", "date_modify": "2025-05-20 14:41:46", "date_publish": "2023-07-28 09:36:42", "description": "Manchester United: Relegation for a Glazer exit?", "filename": "sport_articles_cd1ek525vexo_1747752106.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8b52/live/5355a830-2d20-11ee-b1d7-8fdc93c2782e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cd1ek525vexo_1747752106.html", "title": "Relegation for a Glazer exit?", "title_page": "Manchester United: Relegation for a Glazer exit? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Simon Stone, BBC Sport\nThe Manchester United fans' group leading the current protests against the Glazer family's ownership of the club says any continued long-term involvement by the Americans at Old Trafford would leave \"a bitter taste\".\nNegotiations around the potential sale of Manchester United are still taking place, with Qatari banker Sheikh Jassim bin Hamad Al Thani submitting a fifth bid for 100% of the club last month.\nRival bidder Sir Jim Ratcliffe's Ineos Group is willing to secure a majority stake, which would allow current owners the Glazer family to retain representation in some capacity.\nThe 1958 Group is the fan organisation that arranged a number of 'strategic' protests against the Glazers at matches last season, including the EFL Cup final and FA Cup final. This summer, it held another at Old Trafford to coincide with United's kit launch.\nTwo leading members spoke to BBC Sport on the condition of anonymity, refusing to be named, they say, to stop their message being diluted.\nAmong their views were that some fans would be \"happy\" to see the club relegated from the Premier League if it meant a change of ownership, with concerns the takeover process could drag on throughout the coming 2023-24 season.\n\"The fanbase is big and fractured,\" they told BBC Sport. \"Lots of people have lots of opinions. The minute someone puts their head above the parapet, you will be judged.\n\"This family have inflicted untold damage, generational damage, on our club. It is personal and real to us. It is community. It is family.\n\"A lot of United fans would happily see United go down if it meant that the Glazer family left. Look at what happened when the Glazers came in - some fans went on to form another club. That is the strength of feeling.\n\"Fans of other clubs might say we are spoiled but they wouldn't like the Glazers running their club.\"\nBBC Sport approached Manchester United and the Glazer family for comment. They have previously not commented on the specific protests, but said they \"respect the right of fans to voice their opinions peacefully\".\nRead more from Simon on the fan protest group fears", "url": "https://www.bbc.com/sport/articles/cd1ek525vexo"}