{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:54:04", "date_modify": "2025-04-26 06:54:04", "date_publish": "2025-03-01 00:00:00", "description": "Watch live coverage as Crystal Palace host Millwall and Preston face Burnley in the FA Cup, plus live text coverage and radio commentary across the other fifth round ties.", "filename": "sport_football_live_cm21m39239mt_1745650444.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6203/live/61195570-f6d2-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_cm21m39239mt_1745650444.html", "title": "FA Cup LIVE: Crystal Palace vs Millwall in fifth round", "title_page": "FA Cup LIVE: Crystal Palace vs Millwall in fifth round - live stream, radio commentary and score updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "'I'm so proud - I love it'\nFT: Man City 3-1 Plymouth\nManchester City\nManchester City manager Pep Guardiola, speaking to BBC Match of the Day: “I didn’t take anything for granted, when I saw how well they defended and the problems they created for Liverpool. They’re an incredibly solid team.\n“We created a lot and conceded little – the basics we have done for many years. We’re happy to reach the quarter-finals and with the way we played.\n“How many times in the last years have we reached the semi-finals? When you arrive six times in a row in the semi-finals, it’s because [the FA Cup] is important. When you play in this competition and you behave like the way we behave, I’m so proud – I love it.\n“It shows how honest we are, and I like that. We’re one game away from Wembley and we’ll see what happens.”\nOn Nico O’Reilly: “He’s not a typical academy player. He’s a physical presence – a number 10, I would say. He can play in a few positions. He’s a threat from set pieces because he’s strong. I’m really pleased for him because he helped us a lot.”\nOn Plymouth: “Defensively they were incredibly well organised. They didn’t press much and defended a little deeper, but they defended with solidarity. That’s why I said I didn’t take anything for granted.”\n'This will give us a confidence boost'\nFT: Man City 3-1 Plymouth\nPlymouth Argyle\nPlymouth boss Miron Muslic speaking to ITV:\n\"I think we gave a game to Man City. We made it difficult. Structure defensively was there. City are one of the best teams in the world coached by the best coach in the world. We can be disappointed with the result but proud of the performance.\"\nThink they could win it at 1-0? \"Of course, it feels like why not? We deserved the lead because we were disciplined and we used our chance at the corner. Unluckily we conceded with the last action of the first half but that's how it is and we tried everything until the end.\"\nOn fight to stay in Championship: \"This will give us a confidence boost, I've only been here eight or nine weeks and my first message to the team was that it should be hard to play against us, it should be annoying and difficult. We have proved this tonight so these are steps we can take.\"\n'Very proud of our performance'\nFT: Man City 3-1 Plymouth\nPlymouth Argyle\nPlymouth manager Miron Muslic, speaking to BBC Match of the Day: “We can only be disappointed with the result but very proud of our performance.\n“We gave Man City a game – a proper one. We created some problems for them and had a good defensive structure. It’s City, with the best players and definitely the best coach in the world, who will come up with some solutions.\n“In those moments you need a bit of luck not to concede and we gave the Green Army an unbelievable moment with the goal of Maksym. It’s a pity to concede the equaliser with the last action [of the first half].\n“In the second half we tried, as always, but we can be proud of our performance. I said when I arrived I wanted to make us tough to play against.”\nOn Plymouth’s FA Cup run: “It will help because it gives us confidence. We were hard to play against – this will always help us for the upcoming challenges [in the Championship].”\n'Big compliments to Plymouth'\nFT: Man City 3-1 Plymouth\nManchester City\nManchester City manager Pep Guardiola: “Big compliments to Plymouth for making our job so difficult. They were incredibly organised, but we played a good game – really good.\n“We conceded a goal but we were so solid. I’m really pleased with the game we played.\n“No team has been in the [FA Cup] semi-finals five or six times in a row. Now we will fight, see the draw and see what happens.”\nOn Nico O’Reilly: “It looks like our left-backs score our goals! He’s a different type of academy player. He’s a big presence and can play in three or four positions. I’m really happy for him, he helped us a lot.”\nOn Kevin de Bruyne: “Maybe one of the best three to five players in this club’s history. Every time he performs well I’m the happiest man on the planet. He’s given many, many things to the team and to me, and he’s played really, really well today. Nobody knows [where he will be next season].”\n'We did our best'\nFT: Man City 3-1 Plymouth\nPlymouth Argyle\nPlymouth goal scorer Maksym Talovierov speaking to ITV:\n\"Happy to play here against the best team in the world against really fantastic players. We are a bit upset because of the result but I hope our fans will be proud of us because we tried to do our best and we gave 100%. We really appreciated the fans, around 10,000 of them and we appreciated it so much. We tried to do our best.\"\nOn his father helping him before games: \"He sends me a lot of information about the strikers. He really helps me. We worked a lot with him this week. It really helped me. We didn't speak a lot about scoring and set pieces but he helps me a lot. He spends a lot of time doing it.\"\nOn situation in home country of Ukraine: \"It's around three and a half years since I've seen him [father]. We have really hard situation right now, but these few hours we have just to focus on the game and football helps us to forget it and for our warriors and supporters in Ukraine they try to watch and forget things. I'm really proud of them, hard situation but we will try to help our people and win this war as fast as possible.\"\n'We want to win FA Cup'\nFT: Man City 3-1 Plymouth\nManchester City\nManchester City goal scorer Nico O'Reilly speaking to ITV:\n\"Two goals, wasn't expecting it but I'm glad.\n\"Going into half time at 1-0 down would've been tough. It lifted the spirits and we were ready for the second half after that.\"\nKevin de Bruyne at his best? \"You can say so. He's an amazing player, it's a pleasure to play with him.\"\nFA Cup importance: \"It's always important. Big competition. All the teams in England play and we want to win it.\"\nOn Plymouth: \"They were a very good team. Very physical, direct, congratulations to them for getting this far.\n\"We want to do our best to win and we're into the quarter-finals.\"", "url": "https://www.bbc.co.uk/sport/football/live/cm21m39239mt"}