{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:09:58", "date_modify": "2025-04-26 04:09:58", "date_publish": "2025-03-02 18:52:15", "description": "Gerard Walsh scores a late goal for Antrim to rescue a 2-18 to 1-21 draw against Carlow at Dr Cullen Park in hurling's Division 1B.", "filename": "sport_articles_c30m8dr656do_1745640598.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9b7b/live/e221c300-f781-11ef-b744-2fe4be9f666c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_c30m8dr656do_1745640598.html", "title": "Walsh scores late to salvage Antrim draw against Carlow", "title_page": "Walsh scores late to salvage Antrim draw against Carlow - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Gerard Walsh scored a late goal for Antrim to rescue a 2-18 to 1-21 draw against Carlow at Dr Cullen Park in hurling's Division 1B.\nWalsh netted from a free with the last puck of the game to salvage a point for Davy Fitzgerald's side.\nCarlow led 1-11 to 0-8 at the break after Chris Nolan's goal, but Antrim managed to stay in the game before James McNaughton missed a penalty.\nLate goals from Conor Johnston and Walsh then completed the unlikely comeback.\nNolan netted on 28 minutes with James Doyle tagging on three points from play for Carlow.\nThe Saffrons responded with two points from Eoghan Campbell and three from McNaughton as they tried to stay in touch with the hosts.\nNolan got Carlow's first score after the restart, but Antrim fought back as Johnstone hit two quick points.\nMcNaughton's accuracy from frees helped Fitzgerald's side continue to chip away at Carlow's lead before the late drama ensued.\nWith 10 minutes remaining Paul Doyle fouled McNaughton and was shown a black-carded, but McNaughton's penalty was saved by Brian Tracey.\nDespite their numerical disadvantage, Carlow continued to keep the scoreboard ticking over through a Conor Kehoe point and two Marty Kavanagh frees.\nMcNaughton and Eoin McFerran responded for Antrim with points before Johnston goal set up a tense finale.\nCarlow were then the architects of their own downfall, losing the ball in own half and then conceded a 35-metre free from which Walsh netted the unlikely equaliser.\nAntrim now have a huge game in Ballycastle to look forward to next weekend as they face Laois, looking to keep their hopes of staying in the division alive.", "url": "https://www.bbc.co.uk/sport/articles/c30m8dr656do"}