{"authors": ["Ciara Fleming", "www.facebook.com"], "date_download": "2025-04-26 04:04:20", "date_modify": "2025-04-26 04:04:20", "date_publish": "2025-03-03 19:18:03", "description": "Mikel Arteta press conference: PSV vs Arsenal", "filename": "sport_football_articles_c1jp514pz3eo_1745640260.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/adba/live/e81c39a0-4842-11ef-96a8-e710c6bfc866.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c1jp514pz3eo_1745640260.html", "title": "Mikel Arteta press conference: PSV vs Arsenal", "title_page": "Mikel Arteta press conference: PSV vs Arsenal - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "On Arsenal's chance to 'change the narrative': \"It's a game that brings a different energy. It's a competition that puts everybody on their toes. Now is the moment to start to make some strong steps in the direction we want. The level of consistency that we have had for many months does not happen for a random reason. It is because we have it within us. We are a top team.\"\nOn lifting players after recent dropped points in the Premier League: \"It's part of our job. In the moment you have a bad result, it hurts but it can only last 24 hours. We can't change it. We just have to learn from it and take it into the next game.\"\nOn things Arsenal have learned in the Champions League this season: \"In Europe this season, we have been much more like us. We have been much more consistent and scored a lot of goals. \"\nHe also emphasised how strong the Gunners have been in defence: \"We haven't conceded almost anything, three goals, and we have the lowest expected goals conceded in the group phase. Now we have to continue to do it.\"\nOn whether Arsenal's style makes teams sit in low blocks against them: \"Sometimes, it is not a choice. Sometimes, we have lost a lot of opportunities to run and we did not execute well enough. When we have been organised, we have won a lot of those games. We are so used to it. It is about execution.\"\nHe dismissed questions about whether Arsenal could win the competition, saying he was only focused on PSV: \"The reality is that as a coach I just look at what is ahead. They eliminated Juventus, a team with a lot of history. I know the difficulty of the game - we have played them a lot in recent years.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c1jp514pz3eo"}