{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:45:26", "date_modify": "2025-05-21 05:45:26", "date_publish": "2025-04-02 13:55:50", "description": "Warwickshire's England Lions player Hamza Shaikh extends his contract with the Bears until at least 2026.", "filename": "sport_cricket_articles_c33ze7el21jo_1747806326.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cf9c/live/0de01a90-0fc5-11f0-9f8d-f125b11f3e53.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c33ze7el21jo_1747806326.html", "title": "Shaikh signs extended contract with Bears", "title_page": "Warwickshire: Hamza Shaikh signs extended contract with Bears - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Warwickshire teenager Hamza Shaikh has signed a contract extension with the Bears.\nThe 18-year-old Birmingham-born England Lions batter has added a further year to his existing deal and is now tied to Edgbaston to at least 2026.\nShaikh, who has been on Warwickshire's books since the age of 10, made his debut for the Bears as a 16-year-old in the One-Day Cup in August 2022.\nHe hit 91 on his first-class debut for Engand Lions against the Sri Lankan tourists last August before going on to play in three of the Bears' final five County Championship games, making 83 runs.\n\"I signed a rookie contract two years ago and things have moved quickly,\" said Shaikh. \"I'm grateful for the opportunities Warwickshire have given me.\n\"I love playing in a team with guys I've grown up with and know well. Hopefully we can inspire other young kids in Birmingham and the West Midlands to pick up a bat and a ball. It's great to see more of my family and friends watching cricket now.\"\nBears new head coach Ian Westwood said: \"Hamza is a fantastic young player with a bright future ahead of him.\n\"Last year was an important one for him and he took it impressively for England Lions. It's always pleasing to see homegrown talent come through our youth system into the senior side.\"\nShaikh is in contention for a place in the Bears' top order for Friday's Championship opener at home to promoted Sussex at Edgbaston.\nBut the Bears have big doubts over main strike duo Chris Rushworth and Olly Hannon-Dalby.\nRushworth, who has a calf issue, is almost certainly sidelined, having not bowled on the Bears' pre-season tour, while they are \"waiting for an update\" with regard to Hannon-Dalby.", "url": "https://www.bbc.com/sport/cricket/articles/c33ze7el21jo"}