{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:57:07", "date_modify": "2025-05-20 11:57:07", "date_publish": "2023-08-06 13:02:57", "description": "Welsh driver Elfyn Evans reduces the gap on World Rally Championship leader Kalle Rovanpera to 25 points after winning Rally Finland.", "filename": "sport_motorsport_66399920_1747742227.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6A3C/production/_130669172_gettyimages-1589677771.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_motorsport_66399920_1747742227.html", "title": "World Rally Championship: Elfyn Evans closes gap on leader Kalle Rovanpera with Rally Finland win", "title_page": "World Rally Championship: Elfyn Evans closes gap on leader Kalle Rovanpera with Rally Finland win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Elfyn Evans has reduced the gap on World Rally Championship (WRC) leader Kalle Rovanpera to 25 points after winning Rally Finland.\nToyota driver Evans inherited the lead on Friday when team-mate Rovanpera rolled his GR Yaris and was forced to abandon.\nThe 34-year-old Welshman finished more than 39 seconds ahead of runner-up, Hyundai driver Thierry Neuville.\n\"It's been a pretty good weekend,\" said Evans.\n\"Of course we're sorry for the loss of Kalle at the start of the rally but after that it's been really fantastic to drive this car - it's such a joy to be behind the wheel on these roads and we're really happy with this one.\n\"It's been a fantastic atmosphere and great to have the support behind us.\n\"Of course, in terms of the Championship it's also not bad and we close the gap.\"\nFinland's Rovanpera - the defending world champion - had been forced to retire from his home rally on the eighth special stage when the rear got away from him on a corner and ultimately left his Toyota on its roof.\nTeam-mate Evans lost time as he had to slow down when he want past Rovanpera's car but moved to the top of the rally standings with a six-second lead ahead of Belgian Neuville by the end of Friday.\nThe Welsh driver and co-driver Scott Martin, who took overall victory in Rally Croatia in April, had only won three WRC stages in 2023 prior to this weekend, but collected seven in a row on Saturday as they built an insurmountable advantage.\nEvans, the 2021 winner, becomes one of just three non-Finns to win Rally Finland more than once and collects 25 points for victory, with a further five bonus points for winning the rally's final power stage.\nA maximum 120 points remain available from four more events as the drivers head into round 10 of the 13-rally Championship, the Acropolis Rally Greece running from 7-10 September.\nOtt Tanak, fourth in the World Championship, was also forced to retire in Finland, while fifth-placed Sebastien Ogier did not compete.", "url": "https://www.bbc.com/sport/motorsport/66399920"}