{"authors": ["Stephan Shemilt", "www.facebook.com"], "date_download": "2025-05-20 14:14:08", "date_modify": "2025-05-20 14:14:08", "date_publish": "2023-07-29 22:19:14", "description": "Few England cricketers have created memorable moments, fed off the crowd or enjoyed the battle like the retiring Stuart Broad, writes Stephan Shemilt.", "filename": "sport_cricket_66351643_1747750448.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/17CA8/production/_130584479_broad.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66351643_1747750448.html", "title": "The Ashes 2023: Stuart Broad retires as the ultimate competitor", "title_page": "The Ashes 2023: Stuart Broad retires as the ultimate competitor - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Always a man for the big moment, Stuart Broad has seized another.\nIn announcing his decision to retire from all cricket, the consummate performer created a little more theatre.\nWith the evening sun shining at The Oval, Broad was still in his England shirt and had only just removed his pads. Unbeaten with the bat and with a bowling day still to come, Broad said after the fifth Ashes Test there will be no more.\nThere will be one last crack at the Australians, one more chance to knock over David Warner, one final match to win. He might even club some runs. There will not be a dry eye in the house.\nHow fitting that one of the finest Ashes competitors of them all, the boy who grew up watching replays of his father Chris downing the Aussies, will go out toe to toe against the oldest enemy, with the lights on brightest and the stakes at their highest.\n\"Something inside of me wanted to finish playing at the top level,\" said Broad. \"England against Australia at The Oval in one of the most entertaining, fun Ashes I can remember seems an appropriate time.\n\"The competitiveness of what Australia bring to cricket brings out the best in me. I love that eye-to-eye battle, I love the energy the crowd brings.\n\"I know my emotions have to be sky high to be a good bowler. I can promise you every single time I've run in with a ball in my hand against Australia, they've been there.\"\nBroad made his decision to call time less than 24 hours before he told the world. He went to see England captain Ben Stokes and broke the news.\nHis old mate and long-time new-ball partner James Anderson thought he was joking. Broad choked up when he told Joe Root, then passed on responsibility for organising the team kickabout in the warm-up to Ben Duckett.\nOn Saturday at The Oval, England were batting with the knowledge that Broad was bowing out. When he walked to the middle, Mark Wood was waiting and joked with Broad it was a \"great honour\". How apt that Broad ended the day walking off with Anderson.\nThe bare facts tell a tale of a great career. Some 602 Test wickets and counting, fifth on the all-time list and second only to Anderson in terms of pace bowlers. One of just two men, alongside Shane Warne, to take more than 500 Test wickets and score in excess of 3,000 runs. The only man to take two Test hat-tricks for England. Four Ashes series wins.\nBut Broad is a cricketer of more than mere numbers.\nPerhaps no England player has connected with and fed off a crowd like Broad. Few have thrived on the heat of battle quite as much as the Nottinghamshire man. Fewer still have the ability to turn themselves into an unstoppable force, with a Broad 'spell' as thrilling as it is irresistible.\nThe Oval in 2009, Chester-le-Street in 2013 and, most famously, Trent Bridge in 2015 are Broad's Ashes highlights, but South Africa at the Wanderers in 2016, India in Nottingham in 2011 and New Zealand at Lord's in 2013 were just as spectacular.\nNo England bowler has taken more six-wicket hauls than Broad's 12 in Test cricket. When the knees were pumping, we all knew.\nBroad was the premature baby, born 12 weeks early and weighing 2lb 2oz, who grew up to become an England giant. He was the teenager that went off to play club cricket in Australia as a batter and came back on course to become one of the greatest fast bowlers the game has ever seen.\nNot that the upward trajectory was always smooth. Three months before his Test debut, Broad was infamously whacked for six sixes in a single over by India's Yuvraj Singh in the first T20 World Cup in South Africa. Some 21-year-olds might not have recovered.\nIn the early stages of Broad's Test career, there was a theory that his height would make him suited as a bang-it-in enforcer, not a top-of-off hunter like his hero Glenn McGrath. It took until the 74th match of a 167-Test career for Broad's bowling average to dip below 30.\nHe had a three-year spell as England's T20 captain that resulted in more losses than wins, most notably a humbling by the Netherlands at the 2014 World Cup in Bangladesh. It was the last T20 international he ever played and he was part of only two more one-dayers for England after the horrible early exit at the 2015 World Cup. The end of the white-ball involvement allowed the Test career to extend to a point where only Sachin Tendulkar, Anderson, Ricky Ponting and Steve Waugh have played more matches.\nThere are times when he has been written off. Dropped for the first Test against West Indies in 2020, when England were in the Southampton 'bio-bubble', Broad famously went in front of the Sky cameras and said he was \"frustrated, angry and gutted\".\nTwo years later, with England playing the Windies once more and Andrew Strauss pressing the button on a 'red-ball reset', Broad was left out again, fearing it was the end of his career. In the period since he was recalled, no fast bowler in the world has taken more than Broad's 65 Test scalps.\nIf Broad the bowler is so hard to replace, Broad the character will never be matched.\nThis is the man who was vilified in Australia after not walking in the 2013 Trent Bridge Ashes Test, then fell out with a robot, external at Hobart in 2022.\nHe has the outrageous facial expressions and the celebrappeals. He is the Nighthawk and the man who, in his own words, picked a fight with every Australian when he arrived at the crease as the next man in after the controversial stumping of Jonny Bairstow at Lord's earlier this summer.\nJust last week, when Marnus Labuschagne was complaining of a reflection from the direction of the Old Trafford pavilion, it was Broad who went to speak to the spectators sitting in front of the sightscreen and persuaded them all to change seats.\nEven in this Test, with England low on luck, Broad dipped behind Labuschagne and switched the bails. Next ball, Labuschagne nicked off.\nFor Broad, the timing of the exit might be bittersweet, given he has finally emerged from the shadow of Anderson as England's attack leader.\nIn this Ashes, it is Anderson who has bowled without success and had to fend off questions about his future, while Broad, at 37, has played in every Test and emerged as England's leading wicket-taker. It is a quirk of their great partnership that Broad actually has a better average and strike-rate in matches when he has not played with Anderson.\nBroad's departure is the first domino in an impending regeneration of an England Test team that currently has eight players over the age of 32.\nFor Stokes, revolutionising the way England play is one achievement, presiding over the arrival of a new team is a different proposition.\nWhoever arrives, Stokes is unlikely to find a fighter like Broad.\n\"When I was a kid growing up, I had sporting idols like Martin Johnson and Stuart Pearce,\" said Broad. \"When I watched them, I loved their passion and drive. I never looked at them and thought 'I could give more for that shirt'.\n\"I have never wanted anyone in the crowd or watching at home or listening on the radio to think 'he's not putting in, he's not giving absolutely everything'.\n\"I know I am not the most skilful player that's played. I know I need every inch of my competitive spirit and my drive and my effort to get anything out of my ability.\n\"I've given my heart and soul. I can't think there'll be too many cricket fans out there who would think I've slacked off for a moment.\"\nHe's right, too.\nWhat a competitor. What a cricketer. What a bowler.", "url": "https://www.bbc.com/sport/cricket/66351643"}