{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:05:31", "date_modify": "2025-05-20 14:05:31", "date_publish": "2023-07-31 00:00:00", "description": "Watch live coverage as England face Tonga and South Africa play Trinidad & Tobago in the second stage of the Netball World Cup in Cape Town.", "filename": "sport_live_netball_65814837_1747749931.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/14491/production/_130598038_gettyimages-1565404580.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_netball_65814837_1747749931.html", "title": "Netball World Cup 2023 LIVE: Watch Tonga v England & South Africa v Trinidad & Tobago", "title_page": "Netball World Cup 2023 LIVE: Watch Tonga v England & South Africa v Trinidad & Tobago - score, commentary & updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Goodbye!\nThanks for joining us this evening as England tick off another win in their World Cup journey.\nThey'll play their fifth game in as many days tomorrow against Fiji then there'll be a rest day for the Roses on Wednesday.\nI don't know about you lot but I could do with that rest day as well!\nDon't forget you can watch every match from the World Cup on the BBC iPlayer and the BBC Sport website and app.\nAs for us, we'll be back tomorrow for the Roses' second Pool F match which is also on BBC Three.\nCan't wait, see you then!\nWhat's happening tomorrow?\nIt's a bit of a quieter day tomorrow as a few teams are on their rest days. No rest for us though!\nAustralia take on Malawi in their second Pool F match at 10:00 BST then Scotland will face Tonga at 15:00.\nThen it's all about England as they take on Fiji in their second Pool F match at 19:00.\nYou can watch all of those matches across the BBC iPlayer and BBC Sport website and app!\n'Ticking off games'\nFT: England 72-Tonga\nEngland defender Fran Williams speaking to BBC Sport:\n\"Another win, really happy with how we're tracking, ticking off games in the early stages.\n\"Atmosphere playing here in South Africa has been amazing. We're hearing our loud English fans as well as all the other nations singing and dancing.\n\"My family are loving it and loving watching me and the Roses - they can't get enough of Cape Town!\n\"Five games of five so last push tomorrow - rest up and lots of video, we're probably still making too many errors so probably still need to tighten that up.\"\n'We're slowly getting there'\nFT: England 72-46 Tonga\nEngland shooter Eleanor Cardwell speaking to BBC Sport:\n\"It was a pretty tough match, another game tomorrow so five in a row but that's what this is about it's coming up against different opposition in back to back games.\n\"Every game has had its difficulties, we've played Tonga before the World Cup so we knew what we'd be up against. We need to keep working on consistency, we're slowly getting there and we're building.\n\"It always gets feisty with me. I love a bit of feisty - it brings some energy to the game and hopefully to the girls. We don't think we go into a game knowing we'll win every team is competitive so it's just about building as a team.\n\"Imogen [Allison] is such an amazing athlete she is incredible, well done to her she really deserved it [player of the match] today.\"\n'England still need time to build'\nAma Agbeze\nFormer England captain on BBC Two\nThey need to be more clinical. You know what you're going to get from Australia. They are hard on pressure and the body.\nIf England were playing Australia today I don't know that they'd be capable - when it's a big game England do turn up but they also need time to build.\nEngland need to build, they can't just switch it on. Whereas Australia can. England need the build-up games so I think it's just consistency that we're after from England.\nFortunately they have time to slowly get there, but England that is how they play. Australia can turn it on in he blink of an eye so it's just about whether England can build up in time to face them.", "url": "https://www.bbc.com/sport/live/netball/65814837"}