{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:41:15", "date_modify": "2025-05-21 06:41:15", "date_publish": "2025-01-17 00:00:00", "description": "Follow live text commentary, score updates and match stats from Liverpool vs Brighton & Hove Albion in the Women's Super League", "filename": "sport_football_live_cwyel44px00t_1747809675.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cwyel44px00t_1747809675.html", "title": "Women's Super League", "title_page": "Liverpool vs Brighton & Hove Albion: Women's Super League live text commentary, score updates and stats - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A late own goal from Jorelyn Carabali gave Liverpool a well-earned victory against Brighton on the return of the Women's Super League.\nWith almost a month off because of a winter break and cancellations in the Women's FA Cup after freezing conditions, it was a battling contest between two sides competing to close the gap on the WSL's traditional top four.\nOlivia Smith produced a moment of brilliance for Liverpool in the first half when she burst away from Guro Bergsvand, ran almost half the length of the pitch and fired the ball past goalkeeper Sophie Baggaley to score the opener.\nIt was cancelled out by Nikita Parris after the break - the England striker's effort deflected over goalkeeper Teagan Micah and bounced inside the far corner.\nThe former Everton striker celebrated with her hand cupped around her ear in front of the Liverpool fans as they booed, clearly frustrated by their side's missed chances.\nSubstitute Mia Enderby had raced in behind moments earlier, only to drag her shot wide, while Smith had come close again in the first half.\nLiverpool continued to cause problems as they searched for a winner, boosted by the impact of January loan signing Sam Kerr on her debut.\nBrighton looked set to hold on but they were eventually undone when yet another dangerous Liverpool attack came down the right-hand side and Grace Fisk forced Carabali into a mistake and she bundled the ball over her own goalline.\nIt left Brighton manager Dario Vidisoc frustrated and he said afterwards his side looked \"unrecognisable\".\n\"That was unacceptable. We took so many steps backwards. Credit to Liverpool. They made it tough,\" he added.\n\"We knew they would be in our face and make it hard. We just lacked aggression and that match-up to fight. We made a lot of simple errors.\n\"We looked toothless. The good thing is we know we are, and can be, a lot better than that.\"\nThe result means Liverpool move to within five points of fifth-placed Brighton in the table and start the new year with one of their strongest performances of the season.\nLast season it was Liverpool who were leading the race for the teams outside of the WSL's traditional top four of Arsenal, Chelsea, Manchester City and Manchester United - but Brighton came into this match with five wins from 10 matches and with an eight-point advantage over their hosts.\nThey started as the better side too, pressing Liverpool's defence and causing problems.\nParris almost took advantage when she closed down goalkeeper Micah after Liverpool defender Taylor Hinds was denied an opportunity at the other end moments before.\nBut Liverpool manager Beard, who was sat in the stands serving a one-game touchline ban, will have been pleased by the response of his side.\nLiverpool began to find space down the right-hand side and Smith was heavily involved, running at defenders and getting in behind Brighton's backline.\nShe burst away from Bergsvand to score her stunning individual goal and that proved to be the difference in the first half.\nParris' equaliser came against the run of play and she was fortunate it took a heavy deflection to beat Micah.\nHowever, that sparked a response from Beard in the stands and his substitutions – the introduction of Leanne Kiernan and Enderby – made a difference as they stretched Brighton's defence.\nBeard said this week he hoped for a \"fresh start\" in the new year having seen his side struggle for consistency and impacted by injuries in the first part of the season.\nHe will have been delighted by the performance of debutant Kerr and the result, particularly against a Brighton side who are continuing to progress under Vidosic.\n\"It was a total reset. There's competition and there isn't a solidified starting XI. Other people have an opportunity to show themselves,\" said goalscorer Smith.\n\"It was definitely important for us. We're really excited to get the second half of the season started and this win was really great.\"", "url": "https://www.bbc.com/sport/football/live/cwyel44px00t"}