{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-05-21 07:33:22", "date_modify": "2025-05-21 07:33:22", "date_publish": "2025-03-26 08:07:19", "description": "Man Utd news: Can United win Premier League by 2028? Simon Stone Q&A", "filename": "sport_football_articles_c871zrgx77ro_1747812802.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3b52/live/9721f9b0-4804-11ef-96a8-e710c6bfc866.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c871zrgx77ro_1747812802.html", "title": "Man Utd news: Can United win Premier League by 2028? Simon Stone Q&A", "title_page": "Man Utd news: Can United win Premier League by 2028? Simon Stone Q&A - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "BBC Sport chief football news reporter Simon Stone has been answering your questions on Manchester United. In the first of a four-part Q&A, he looks at the club's ownership, hierarchy and expectations for the coming years.\nMark asked: Are there any rumblings that Ineos/Sir Jim Ratcliffe are unhappy with what they have come into?\nSimon: Ratcliffe has already said the scrutiny is probably more than expected – and he has stopped reading newspapers because of the adverse publicity against him.\nHowever, that doesn't mean he is not determined to sort the situation out. I think there are question marks over how he is going about it - making ordinary staff redundant while a squad costing hundreds of millions of pounds is underperforming to such a huge degree is not a good look.\nHe believes, though, that it is the right way forward and he is the one who spent over £1bn to buy a chunk of the club. Time will tell whether he is right. But, for now, Ratcliffe is as keen as he was on day one to turn Manchester United into the club it once was.\nJoe asked: Omar Berrada said that we would try to aim to win the league by 2028. Do you think this is realistic? If so, what transfers and decisions off and on the pitch would we have to make to have a squad ready for glory?\nSimon: Realistically? Not a chance.\nBy definition, winning the league in 2028 means you need a title-winning squad by the summer of 2027. With what United have at the moment, and the financial constraints they are working with, I don't see how that is possible.\nI do recall a depressed feeling hanging over United in 2005-06 when it felt like they were going nowhere. But that squad had Cristiano Ronaldo and Wayne Rooney, who were developing into true world-class talents, plus a host of brilliant back-ups in the likes of Edwin van der Sar, Rio Ferdinand, Nemanja Vidic and Patrice Evra. Michael Carrick was about to join.\nThe current squad is simply not at the same level. I will answer the second part of your question, along with a connected one, next.", "url": "https://www.bbc.com/sport/football/articles/c871zrgx77ro"}