{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:26:47", "date_modify": "2025-05-21 05:26:47", "date_publish": "2025-02-01 20:24:03", "description": "Caroline Dubois will defend her world title on the undercard of Natasha Jonas v Lauren Price on 7 March at the Royal Albert Hall.", "filename": "sport_boxing_articles_ce85ez6x73xo_1747805207.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2c44/live/cc232db0-e0d8-11ef-a819-277e390a7a08.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_boxing_articles_ce85ez6x73xo_1747805207.html", "title": "Boxing: Caroline Dubois to defend WBC world title against Bo Mi Re Shin on Jonas vs Price undercard", "title_page": "Boxing: Caroline Dubois to defend WBC world title against Bo Mi Re Shin on Jonas vs Price undercard - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Caroline Dubois will defend her WBC lightweight world title against South Korea's Bo Mi Re Shin on 7 March in London.\nDubois, 24, will be the co-main event to Natasha Jonas' welterweight unification fight against Lauren Price at the Royal Albert Hall.\nFans were hoping to see the Englishwoman take on rival world champion Terri Harper, but she faces Shin instead, who is ranked number one by the WBC.\n\"I think she is going to be a tough challenge, but I believe I'm levels above,\" Dubois said.\n\"I'm excited to be a part of such an incredible show. Women's boxing is rocking at the moment. It's doing amazing.\n\"It's proven time and time again that it's here and it's here to stay.\"\nDubois is undefeated in eleven fights, though the first defence of her WBC title last month ended prematurely because of a cut to her opponent Jessica Camara.\nThe fight ended in a technical draw as a result, but Dubois still retained her belt.\nShin, 30, has had two defeats and three draws in 23 bouts and has fought more frequently at super-featherweight.\n\"I have been preparing for Caroline for two years since I first heard of a potential fight with her,\" she said. \"I will become world champion.\"", "url": "https://www.bbc.com/sport/boxing/articles/ce85ez6x73xo"}