{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:38:48", "date_modify": "2025-04-26 07:38:48", "date_publish": "2025-02-27 13:44:07", "description": "Ireland captain Caelan Doris is \"in with a shout of being involved\" in next week's Six Nations game against France, says forwards coach Paul O'Connell.", "filename": "sport_rugby-union_articles_c05mm6qv0y9o_1745653128.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6bec/live/3778a4f0-f510-11ef-a276-596f7e6218f8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_c05mm6qv0y9o_1745653128.html", "title": "Doris 'in with a shout' of return against France", "title_page": "Six Nations 2025: Ireland captain Caelan Doris 'in with a shout' of return against France - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Ireland captain Caelan Doris is \"in with a shout of being involved\" in next week's Six Nations game against France, says forwards coach Paul O'Connell.\nBack row Doris missed the win over Wales in Cardiff with a knee injury but trained with the squad during Thursday's open session at Aviva Stadium.\nHooker Ronan Kelleher has also returned to training after missing the Wales game with a neck issue, while O'Connell was similarly upbeat about number eight Jack Conan (back) and prop Tadhg Furlong (calf and hamstring).\n\"Everyone is fine,\" said O'Connell.\n\"Caelan has been running for the past week, he ran today, so he's certainly in with a shout of being involved. Jack Conan is looking after his back, he injured it in a carry the other day but we'd be pretty confident he'll be OK.\n\"I know Ronan Kelleher trained today. Nobody is ruled out. They're all carrying bumps and bruises but they're all doing OK.\n\"Tadhg Furlong was back with his province and he'll be rejoining us next week. No-one is ruled out at this point.\"\nWhen asked about Furlong, who is yet to feature in this year's tournament having also missed the November Tests, O'Connell said the 32-year-old has had \"a few false starts\" with his rehabilitation.\n\"He wants to be sure about it,\" explained O'Connell.\n\"The medics want to be sure about it as well and not have another false start. I'd say if he had no history with that calf, he'd be back by now, but they just want to make sure and he wants to feel sure and confident in it himself.\"\nPacesetters Ireland, who are chasing a record third straight title, host second-placed France in Dublin on 8 March before facing Italy in Rome in the final round on 15 March.", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/c05mm6qv0y9o"}