{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:59:13", "date_modify": "2025-05-21 05:59:13", "date_publish": "2025-04-05 00:00:00", "description": "Follow live text commentary, score updates and match stats from Everton vs Arsenal in the Premier League", "filename": "sport_football_live_ce3vw9051g0t_1747807153.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/fd02/live/07a5c310-1221-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_ce3vw9051g0t_1747807153.html", "title": "Everton vs Arsenal: Premier League preview, team news, stats & head-to-head", "title_page": "Everton vs Arsenal: Premier League preview, team news, stats & head-to-head - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Arsenal's faint Premier League title hopes suffered a potentially fatal blow as they were held to a draw at Everton.\nThe result means leaders Liverpool require only 11 points from their remaining eight games - starting with Fulham on Sunday - to guarantee themselves the title.\nThe first half an hour was a tetchy, stop-start affair but Arsenal broke the deadlock on 34 minutes with the first shot on target of the contest as Leandro Trossard drilled home a cool finish on the counter following Raheem Sterling's pass.\nGoalscorer Trossard could have doubled his tally on the stroke of half-time but his toe-poked effort was scrambled away by Jordan Pickford, while Declan Rice's follow-up was blocked.\nEverton equalised when they were awarded a penalty a minute into the second half - Myles Lewis-Skelly bundling over Jack Harrison inside the box and Iliman Ndiaye nervelessly stroking in the spot-kick.\nThe Toffees were rejuvenated after a poor first half showing and Abdoulaye Doucoure forced David Raya into a sharp save low down while at the other end, Rice's thunderous free-kick was batted away by England team-mate Pickford.\nNeither side were able to find a winning goal as Everton provided a boost to local rivals Liverpool by claiming a point.\nEverton were revitalised following the appointment of David Moyes in January with three straight victories seemingly ensuring their top-flight survival.\nBut the Blues have now gone six games without victory, which includes five draws, and their season is in danger of petering out.\nCaptain James Tarkowski returned to action after being fortunate not to get a red card for his brutal tackle on Alexis Mac Allister in midweek, and following the abuse sent to him and his family that drew condemnation from his club.\nHe received a yellow here after bringing down Lewis-Skelly - the Englishman's 64th Premier League booking, the most of any player in the competition's history without being sent off.\nThe Toffees have only three games left to play at their famous Goodison Park home, before their move to the new Bramley-Moore Dock ground next season, but they will need to produce better if they are to give the grand old stadium the send-off it deserves.\nNdiaye, who returned from a knee injury at Anfield on Wednesday, grabbed the leveller against Arsenal courtesy of a cool penalty and the point takes them 15 clear of the relegation zone with seven games remaining.", "url": "https://www.bbc.com/sport/football/live/ce3vw9051g0t"}