{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:47:21", "date_modify": "2025-04-26 06:47:21", "date_publish": "2025-03-01 12:17:14", "description": "Critchley senses 'different psychological feel' to top-six derby", "filename": "sport_articles_c337730k3vdo_1745650041.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/54ef/live/1d9b6f60-f5e0-11ef-a452-97c9e2e951dd.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_c337730k3vdo_1745650041.html", "title": "Critchley senses 'different psychological feel' to top-six derby", "title_page": "Critchley senses 'different psychological feel' to top-six derby - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "There is a \"different psychological feel\" to this weekend's Edinburgh Derby than previous, reckons Hearts head coach Neil Critchley.\nThe capital's big two were the league's bottom clubs when they drew 1-1 in late October, and were both still in the bottom half after Hibs' dramatic derby win on Boxing Day.\nNow the sides meet at Easter Road on Sunday with them each occupying a spot in the top six for the first time since August after Hearts climbed into the top half on Wednesday\n\"I think there's a different psychological feel to the game because of the different situation that both teams find themselves in,\" said Critchley, whose side have only lost once since that Boxing Day defeat and face a Hibs side on a remarkable 14-game unbeaten run.\n\"I think both teams will be taking to the pitch with a more positive feeling, that might mean it is a different type of game from both teams.\n\"It is exciting, I'm really looking forward to it and may the best team win.\"\nAfter starting the season with a packed European and domestic schedule, Critchley is grateful for more time on the training pitch.\n\"Maybe having more time between games has helped us to reinforce some of the things we want to see from the players, our principles,\" he added.\n\"Your identity takes time, you need consistency in your work. For the things that you want to become habits, you've got to keep working at them and we've probably had that time.\n\"We've been better at both ends of the pitch.\n\"I think January helped with some of the players that we brought in. There's a new energy and enthusiasm from the players.\"", "url": "https://www.bbc.co.uk/sport/articles/c337730k3vdo"}