{"authors": ["Pat Nevin", "www.facebook.com"], "date_download": "2025-05-21 07:21:58", "date_modify": "2025-05-21 07:21:58", "date_publish": "2025-01-22 11:30:33", "description": "Man Utd news: Opinion - Pat Nevin on Ruben Amorim 'taking the nuclear option'", "filename": "sport_football_articles_cy08y057nr2o_1747812118.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5a49/live/bc090290-d838-11ef-ba26-ef826ed919d4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy08y057nr2o_1747812118.html", "title": "Man Utd news: Opinion", "title_page": "Man Utd news: Opinion - Pat Nevin on Ruben Amorim 'taking the nuclear option' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Who has had the most horrific season so far?\nSouthampton are marooned and regularly outclassed but expectations were low to start with. Spurs have a claim given they have plummetted after being expected to challenge for a top-four spot. Even Manchester City have an interest considering the giddy heights they have fallen from, but surely Manchester United are hitting the jackpot for booby prizes.\nRuben Amorim has probably known for a few weeks as he chopped and changed personnel - though never the system - that Sisyphus had an easier job in comparison to his. He only had to try to push a boulder up a mountain while it continually rolled back down for eternity.\nTrying to clamber up the Premier League table seems less soul-destroying right now.\nAmorim's comment that this could be the worst Manchester United team ever is not accurate, but it is the subtext behind the headline that is important: \"You lot simply aren't good enough.\"\nConsidering these are the players that must get him out of the canyon-like hole he is in, this is a high-stakes gamble.\nWill they be emboldened to go into battle for him or will enough of them totally lose faith in the man who has lost faith in them? We will soon find out.\nOne thing is clear, he has gone for the nuclear option in terms of managerial ordnance. It is understandable to some degree, but he has pressed that button staggeringly early in his tenure. There is nowhere else to go if this doesn't work.\nWell nowhere except back to Portugal if things do not turn around relatively soon and the United hierarchy do not continue to have the patience of an army of saints.", "url": "https://www.bbc.com/sport/football/articles/cy08y057nr2o"}