{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:45:50", "date_modify": "2025-05-21 07:45:50", "date_publish": "2025-03-28 08:40:21", "description": "Nottingham Forest news: Chris Wood injury 'was worst case scenario'", "filename": "sport_football_articles_cn8r8xxv18lo_1747813550.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3e9d/live/589be740-0baf-11f0-8e25-91624fd3b00c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cn8r8xxv18lo_1747813550.html", "title": "Nottingham Forest news: Chris Wood injury 'was worst case scenario'", "title_page": "Nottingham Forest news: Chris Wood injury 'was worst case scenario' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Nottingham Forest were dealt a huge blow during the international break after striker Chris Wood limped off during New Zealand's 2026 World Cup qualifier and as a result will miss Saturday's FA Cup quarter-final at Brighton.\nThe extent of Wood's hip injury is unknown, but \"it is certainly not the news Nuno Espirito Santo would have wanted,\" said BBC Radio Nottingham's Colin Fray on the Shut Up and Show More Football podcast.\n\"It was worst case scenario,\" Fray added.\n\"Nuno has referenced that he hopes he will be alright for Manchester United on Tuesday night so that is in the - fairly - short term. That means there is some optimism that it is not a really bad injury despite it inducing a lot of pain.\n\"I guess what they are hoping for is that it was just the impact and once the pain subsides then there is no further damage. But we are all guessing until the results of his scan come through.\"\nWood's injury rounded-off an eventful international break in which he also scored a hat-trick against Fiji, before being substituted off and getting booked for signing autographs for people in the crowd.", "url": "https://www.bbc.com/sport/football/articles/cn8r8xxv18lo"}