{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:39:20", "date_modify": "2025-05-19 15:39:20", "date_publish": "2017-08-20 16:42:40", "description": "Keith Farmer has one hand on the British Supersport title after completing a double at Cadwell Park on Sunday.", "filename": "sport_motorsport_40994633_1747669160.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/72291000/jpg/_72291213_keith.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_motorsport_40994633_1747669160.html", "title": "BSB: Keith Farmer edges towards title with Supersport double", "title_page": "BSB: Keith Farmer edges towards title with Supersport double - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Keith Farmer has one hand on the British Supersport title after completing a double at Cadwell Park on Sunday.\nThe Clogher rider holds a 63-point lead over Dubliner Jack Kennedy, who came home second in race two.\nDavid Allingham secured a fourth-place finish in to stay in title contention, albeit a further 21 points adrift.\nAndrew Irwin has dropped away from challenging Farmer after two retirements at the English circuit.\nFarmer extended his lead in the series with victory in the sprint race on Saturday with Allingham crossing the line in third, while Kennedy and Irwin both failed to finish the race after mechanical issues.\nIrwin was keeping in touch with Farmer in race two, but crashed out on the safety car restart after running over a kerb to finish the weekend without any points.\nIn the British Superbike class Michael Laverty was seventh in race one while Glenn Irwin and Andy Reid made it a trio of Northern Irish racers in the points with 11th and 13th place finishes.\nToome rider Laverty made it two top-10 finishes by coming in eighth in race two with Irwin one place behind and Reid also in the points in 13th.\nBallinamallard's Josh Elliott was sixth in the Superstock 1000 class as Carl Phillips missed the round due to budgetary issues.\nRichard Kerr picked up a podium in the Motostar championship while Euguene McManus had a best result of fourth.", "url": "https://www.bbc.com/sport/motorsport/40994633"}