{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:29:13", "date_modify": "2025-05-20 13:29:13", "date_publish": "2023-07-25 08:54:46", "description": "Norwich City sign Switzerland international winger Christian Fassnacht from Young Boys for an undisclosed fee.", "filename": "sport_football_66299095_1747747753.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1BB2/production/_130509070_gettyimages-1249777842.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66299095_1747747753.html", "title": "Christian Fassnacht: Norwich City sign Switzerland winger from Young Boys", "title_page": "Christian Fassnacht: Norwich City sign Switzerland winger from Young Boys - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Norwich City have signed winger Christian Fassnacht from Swiss side Young Boys for an undisclosed fee.\nThe Canaries have signed the Switzerland international on a two-year deal, with the option of an additional year.\nFassnacht, 29, will reunite with Canaries boss David Wagner, who he played under at Young Boys.\n\"To challenge myself outside of Switzerland, in this club, for me, it is a dream come true,\" he said.\n\"I know the head coach very well. Of course, this was a big part of my decision to come to the club.\n\"We talked a lot and he gave me a really good feeling to make this move.\"\nFassnacht, who has four goals in 19 international caps for Switzerland, has played all of his club career in his homeland, and joined Young Boys in 2017.\nIn his first season he helped guide Young Boys to their first Swiss league title in 32 years, and the first of five league titles during his stay.\nThe right winger has Champions League and Europa League experience, scoring 75 times in 251 appearances for Young Boys.\n\"He is a player I know very well, a top professional, and he was desperate to come join us and test himself with a new experience,\" said Wagner.\n\"He has a track record, with many goals and assists at the top level in Switzerland and for the national team.\"", "url": "https://www.bbc.com/sport/football/66299095"}