{"authors": ["Neil Johnston", "www.facebook.com"], "date_download": "2025-05-20 14:01:42", "date_modify": "2025-05-20 14:01:42", "date_publish": "2023-07-30 13:20:09", "description": "Spain have overcome a rebellion and, according to reports, boredom to become one of the first teams to qualify for the last 16 at the Women's World Cup.", "filename": "sport_football_66346869_1747749702.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/D9C4/production/_130584755_gettyimages-1571918601.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66346869_1747749702.html", "title": "Women's World Cup 2023: Spain excite despite reports of 'boredom'", "title_page": "Women's World Cup 2023: Spain excite despite reports of 'boredom' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "\"I wouldn't wish what I'm going through on anyone,\" Spain boss Jorge Vilda said before the start of the Women's World Cup.\nLa Roja have overcome a rebellion and, according to one report, boredom to become one of the first teams to reach the last 16.\nVilda's squad, including two-time Ballon d'Or winner Alexia Putellas, reportedly moved from their training base in Palmerston North early and relocated to Wellington - about 85 miles away - before Monday's third and final Group C game against Japan in New Zealand's capital (08:00 BST kick-off).\nThe lack of things to do in the small city has taken its toll on the Spanish, according to ESPN., external\nThe report added that families, including some players' children, are staying with the squad as part of a pre-tournament agreement with the Spanish Football Federation.\nAlong with the players, they have found there is little to do in Palmerston North, especially in the evenings.\nAndrea Pelaez Marzo, a sports journalist for Spanish radio station Cadena COPE, is following the team around New Zealand.\n\"Palmerston North is the smallest place in the whole tournament,\" she told BBC Sport.\n\"When the players have free days, they do not have too much to do. We prefer - the media and players - to stay in cities like Wellington or Auckland.\"\nVilda, whose father, Angel, worked under Johan Cruyff at Barcelona, said his squad had \"great memories\" of Palmerston North when asked about the report at a news conference on Sunday.\n\"We were very pleased with the treatment that we received inside and outside the hotel. They treated us like a family,\" said Vilda.\n\"The family members that travelled were able to be there as a group and that also helps the team. Now we are in Wellington for logistics and I'm sure we will all be quite comfortable here.\"\nSpain headed into their third World Cup with a cloud of doubt hanging over the squad after a feud between Vilda, who has been in charge since 2015, and many senior players.\nFifteen players had threatened to quit the team as they were unhappy with Vilda's methods, and the coach subsequently exiled them from the squad.\nThe dropped players complained to the Spanish FA that they were unhappy with the management of injuries, the atmosphere in the dressing room, and Vilda's handling of team selection and training.\nVilda responded by saying: \"At no time have I thought about resigning. I''m with those players who want to be part of this national team.\"\nThree of the 15 frozen out of the national set-up - Mariona Caldentey, Aitana Bonmati and former Manchester United defender Ona Batlle - were eventually included in Vilda's squad for the World Cup.\nBut this is a different Spain team to the one that comfortably secured qualification with two games to spare and without conceding a goal.\nReal Sociedad's Amaiur Sarriegi, who scored 11 of her country's 53 goals in qualifying, is not in New Zealand, while midfielder Patri Guijarro, who scored twice in Barcelona's Champions League win over Wolfsburg, is another notable absentee.\nSeventeen of Vilda's squad are at a World Cup for the first time, including 19-year-old Barcelona forward Salma Paralluelo.\nBefore this tournament they had won just one of their previous seven games on the world stage.\nHere in New Zealand, La Roja opened with a 3-0 victory over Costa Rica before putting five past debutants Zambia without reply, their biggest win in nine matches at the World Cup.\nSpain appear to have put their differences aside, for the time being at least, with an uneasy truce developing following peace talks.\n\"The atmosphere was weird maybe one month ago,\" added Marzo.\n\"The Spanish media is always asking questions about the atmosphere in the team. [But] the players always say the same thing, that the atmosphere is good at the moment because we are professionals.\"\nPutellas, regarded as the best player on the planet, has played 58 minutes at this World Cup as she works her way back to full fitness following a serious knee injury sustained before Euro 2022 which ruled her out for almost a year.\nAfter a brief substitute appearance against Costa Rica, she was handed a start against Zambia. The Barcelona midfielder is set to get more minutes against Japan.\n\"We've had conversations with her team-mates and they say Alexia is ok to have more minutes in matches,\" said Marzo.\n\"At the beginning of this tournament she felt she was not ready to play a lot of minutes. She is really conscious of that. The idea is to increase the minutes.\"\nSpain and Japan have scored 15 goals between them in four matches, and are among the contenders to win the tournament.\n\"Tomorrow is a good trial, it's an important game for us,\" Vilda concluded.", "url": "https://www.bbc.com/sport/football/66346869"}