{"authors": ["Matthew Henry", "www.facebook.com"], "date_download": "2025-04-26 06:27:43", "date_modify": "2025-04-26 06:27:43", "date_publish": "2025-02-28 18:35:50", "description": "Picking the right captain and getting the best out of Jos Buttler are just two of the issues facing England after the captain's resignation.", "filename": "sport_cricket_articles_c5ymg8py7r0o_1745648863.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f79b/live/b318a900-f602-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_cricket_articles_c5ymg8py7r0o_1745648863.html", "title": "Champions Trophy 2025: Five issues facing England after Jos Buttler's resignation", "title_page": "Champions Trophy 2025: Five issues facing England after Jos Buttler's resignation  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The end came quicker than anyone expected.\nJust six months ago England coach Brendon McCullum backed Jos Buttler to the hilt despite questions over his captain's future.\nEven after defeat by Afghanistan, most thought the decision would be made after the flight home. Instead, Buttler resigned with a smile, his mate by his side, leaving McCullum searching for a new lieutenant.\nEngland's fall from the white-ball summit has been stark and there are issues aplenty to face...\nThe first is the most obvious - finding Buttler's replacement.\nHarry Brook is the overwhelming favourite given he is the current deputy, impressed when standing in for the five-match one-day international series against Australia last September and is regularly praised by coaches and team-mates for his smart 'cricket brain'.\nBut appointing the 26-year-old would bring its own challenges.\nThere is less crossover ahead in England's multi-format schedule, but playing every white-ball match and being a Test regular would require Keely Hodgkinson's stamina.\nMcCullum has already accepted he will have to miss tours, having taken charge of the Test and limited-overs sides. If Brook were named skipper, he would surely have to do the same.\nThe alternative is turning to a white-ball specialist, but Adil Rashid, 37, is too old and Liam Livingstone and Phil Salt too insecure in the XI. Sam Curran has Indian Premier League captaincy experience, but is currently out of the side.\nRecalling a specialist captain like James Vince or Sam Billings is surely a non-starter.\nBoth Buttler and McCullum were keen to stress the resignation is not the end of the 34-year-old's England career.\n\"I'm sure we will look at ways that we can get the best out of him in terms of his role, so he can have maximum impact as well,\" said the former Black Caps skipper.\nYet Buttler the batter is in need of reinvigoration. He has scored only two 50s in ODIs since September 2023, but an example to follow is not hard to find.\n\"Hopefully now I can follow Joe Root's lead and play like he has since he relinquished the captaincy,\" Buttler said of his team-mate, who gave up the Test job and scored centuries in three of his next four Tests.\nButtler cannot continue as a non-captaining, non-bowling number six in the modern game, meaning some imagination is required.\nMcCullum and Buttler created a new role for Jamie Smith in this tournament - a powerplay-attacking number three that has resulted in Smith twice being dismissed cheaply by poor shots.\nPerhaps, a revitalised Buttler is actually the ideal man for that.\nThis one is English cricket's long-standing problem.\nWhen England focus on the Test side, the white-ball team struggles. When they give priority to those in a coloured kit, the red-ball side lurches towards review-inducing crisis.\nThat Buttler has rarely had his best players available is the caveat that should go down alongside a tournament record that reads one title and three sorry exits.\nMcCullum's first act as white-ball leader has been to bring the two sides closer together. Smith, Ben Duckett, Brydon Carse and Gus Atkinson are all Test players given limited-overs opportunities. The results cannot be deemed a success.\nEngland will play only 10 Tests this year, having played 17 in 2024, and McCullum does not sound ready for change.\n\"Most other teams manage that, if you look at India's players and how they play cross-formats, look at Australia's fast bowling line-up, New Zealand are similar,\" he said.\n\"I'm hopeful that with some shrewd planning and a better understanding of what our player pool looks like, we'll be able to make sure we can get it across all formats, because that's ultimately what people that follow this team deserves.\"\nThat takes us to another issue that continues to disadvantage England. They have to find a generation of 50-over cricketers from a pool who are not playing the format.\nThe Hundred is not going anywhere. England need to find a solution to the problems it has caused rather than just throw their arms into the air.\nThe main issue is not giving youngsters a taste of 50-over cricket - the One-Day Cup will continue to do that while it is played as a development competition alongside The Hundred - but instead ensuring the talents spotted have enough competitive, challenging cricket to aid their progression afterwards.\nThis is where the Lions programme will be crucial.\nJacob Bethell, Jordan Cox, Tom Hartley and Carse all played in the Lions' last ODI in February 2023 and have gone on to varying degrees of success on the international stage.\nAnother solution would be to move the One-Day Cup and give England an advantage over their rivals.\nNo nation's players are currently playing a good amount of domestic one-day cricket. Were England to find a way, their rebuild could gain a jump start.", "url": "https://www.bbc.co.uk/sport/cricket/articles/c5ymg8py7r0o"}