{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:26:07", "date_modify": "2025-05-21 06:26:07", "date_publish": "2025-04-01 10:12:57", "description": "Arsenal news: Bothroyd hopes Saka return from injury not 'too soon'", "filename": "sport_football_articles_cy708vmkl0lo_1747808767.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/22f7/live/a72f22c0-0ee1-11f0-afac-b7b6977543af.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy708vmkl0lo_1747808767.html", "title": "Arsenal news: Bothroyd hopes Saka return from injury not 'too soon'", "title_page": "Arsenal news: Bothroyd hopes Saka return from injury not 'too soon' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Wolves striker and Arsenal academy product Jay Bothroyd says he does not want Bukayo Saka to \"come back too soon\", with the Gunners winger set to return from injury in Tuesday's visit of Fulham.\nMikel Arteta said in his pre-match news conference that Saka was \"ready to go\" and in contention to start for the first time since limping off against Crystal Palace on 21 December.\n\"Obviously there has been a lot of talk about Saka coming back but, if I'm honest, I'm going against the grain,\" Bothroyd told BBC Radio 5 Live Breakfast.\n\"I don't really want to see Saka for a while because the hamstring can be a funny injury and it was a rupture - he did have it reattached.\n\"I don't want him to come back too soon. There is the big Real Madrid game coming up, which is more important. Maybe give him a few minutes but if Arteta is thinking about starting him then I'm not on the side of that.\n\"We need to protect Saka. He's been playing since such a young age week in, week out. It's caught up with him and that's why he's got that type of injury now.\n\"But, it's great that he could potentially be back soon.\"", "url": "https://www.bbc.com/sport/football/articles/cy708vmkl0lo"}