{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:06:17", "date_modify": "2025-04-26 04:06:17", "date_publish": "2025-03-03 16:53:31", "description": "Sean Lynn has named his first Wales training squad since being appointed as head coach of the side in January.", "filename": "sport_rugby-union_articles_c9q409vj49no_1745640377.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2dea/live/57d0e130-f84a-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_c9q409vj49no_1745640377.html", "title": "2025 Women's Six Nations: New Wales head coach Sean Lynn names training squad", "title_page": "2025 Women's Six Nations: New Wales head coach Sean Lynn names training squad - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "New head coach Sean Lynn has named a 48-player training squad ahead of Wales' 2025 Six Nations campaign.\nThe Gloucester-Hartpury head coach was named as Ioan Cunningham's successor in January and has named an extended training squad around the 15 Welsh internationals who featured in the Women's Premier Rugby semi-finals.\nLynn's Gloucester-Hartpury take on Saracens in the final on 16 March at StoneX Stadium - with the Swansea-born head coach then taking charge of Wales permanently for the Six Nations.\nKeira Bevan and Alex Callender have been appointed as vice-captains to support captain Hannah Jones.\nThe squad also includes a number of players from the Celtic Challenge's two Welsh sides, Gwalia Lightning and Brython Thunder.\n\"It's exciting to get to name a first Wales training squad and one full of experienced international players, playing well for their clubs and young exciting players who have shone in the Celtic Challenge,\" said Lynn.\n\"To have so many Welsh internationals feature in the PWR semi-finals is a testimony to the players quality and to their performances with their clubs.\n\"As coaches we have selected players who have really impressed and put their hands up playing for Gwalia Lightning and Brython Thunder in the Celtic Challenge.\"", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/c9q409vj49no"}