{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:31:33", "date_modify": "2025-05-21 07:31:33", "date_publish": "2025-01-22 08:35:16", "description": "Liverpool 2-1 Lille: Fan views", "filename": "sport_football_articles_c0rnypzrr8lo_1747812693.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c0rnypzrr8lo_1747812693.html", "title": "Liverpool 2-1 Lille: Fan views", "title_page": "Liverpool 2-1 Lille: Fan views - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your thoughts after Tuesday's Champions League game between Liverpool and Lille.\nHere are some of your comments:\nTom: Hard-fought win against a well-organised Lille side who are no mugs. We need to cut out these moments of switching off which are costing us in games recently but we managed to get away with it here. Harvey Elliott deserves more minutes and needs to push Dominik Szoboszlai for that number-10 spot.\nIan: Really professional performance. Their goal was a gift but we controlled the game well. It was great to give so many players a rest too. We know that we could be pushing on three fronts at the end of the season and that has been our undoing in previous years.\nFran: Another disappointing performance from Liverpool and a lucky win against 10 men. They've been extremely lucky this season in all competitions but I suspect that their luck will have run out come the end of the season.\nRich: Deservedly top of both the toughest leagues in the world by some distance - but no one wins anything in January. We go again!\nKev: I would like to see Federico Chiesa start against Ipswich or PSV as he looked very lively and a threat. We never really got out of first gear and I think that is in part a credit to Lille who worked extremely hard. Very happy to qualify and miss the round of play-offs.", "url": "https://www.bbc.com/sport/football/articles/c0rnypzrr8lo"}