{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:48:22", "date_modify": "2025-05-21 03:48:22", "date_publish": "2025-04-07 12:15:06", "description": "'We've been grinding out wins like this all season. They're no flukes'", "filename": "sport_articles_cx2w0lqy4jno_1747799302.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/aae4/live/f626b350-139d-11f0-ac9f-c37d6fd89579.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cx2w0lqy4jno_1747799302.html", "title": "'We've been grinding out wins like this all season, they're no flukes'", "title_page": "'We've been grinding out wins like this all season. They're no flukes' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "United fans, we asked for your views on Sunday's 1-0 win over Hearts.\nHere's what some of you said:\nDave: The good: another terrific three points on the road, top six secured and hopefully the end of a tricky period for us. David Babunski getting some minutes - don't know why he's not been featuring of late. The bad: a referee that clearly doesn't understand the game. James Wilson's red card was marginal, but probably right, but the yellow cards and non-fouls that were penalised on both sides were ridiculous. When will the authorities get a grip on refereeing standards?\nMat: A great result for the Terrors but being honest another poor performance against a Hearts team that didn't look that great either. Our players look mentally tired and have definitely lost that spark and sharpness from earlier in the season. But we can recover and we can push on in the last six games to make this not just a very good season, but a great one.\nKieran: Much like last week, the game had no real quality. That was until big Sam Dalby, our talisman, popped up with one of the best headed goals I have seen for a while. Another crucial three points and although Hearts were by far the better side, this team has shown all season we can claim a result without playing particularly well.\nKenneth: We've been grinding out wins like this all season, they're no flukes we're just hard to beat. Kudos to Ross Docherty, Dalby, Jack Walton and the whole team for another good shift. Glenn Middleton and Dalby's play for the goal was class.\nJim: Considering we had a couple of main defenders missing, a great result! Our passing at the back was very dodgy in the first half, gifting Hearts chances but Wilson's sending off turned the game and Dalby's goal was a cracker. Now it's onward and hopefully upward.", "url": "https://www.bbc.com/sport/articles/cx2w0lqy4jno"}