{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:38:21", "date_modify": "2025-05-20 11:38:21", "date_publish": "2023-08-07 00:00:00", "description": "Arsenal beat Manchester City on penalties to win Community Shield, plus all the latest transfer news and gossip.", "filename": "sport_live_football_66424684_1747741101.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3EC3/production/_130676061_bbc-sport-index-imagery-3-split-images-gradient-a108ab73-5a4a-4484-89bf-5cb14887f3fc.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_football_66424684_1747741101.html", "title": "Latest transfer news - Kane, Salah, Van de Beek", "title_page": "Latest transfer news - Kane, Salah, Van de Beek - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Thanks for joining me\nThat’s your lot for today.\nThanks for joining me to react to Arsenal’s Community Shield win over Man City. We have also discussed Man Utd, and Tottenham’s situation with Harry Kane.\nThe Lionesses also made it to the World Cup quarter-finals!\nHere are some of the key stories on the site right now.\nEngland match report from Emma Sanders in Brisbane.\nMohamed Salah 'committed' to Liverpool amid Saudi Arabia transfer link - agent\nRaphael Varane: Manchester United defender criticises added time and dissent rule changes.\nI’ll be back tomorrow so see you then!\nWhat's the takeover latest and how will it affect plans this season?\nWe are still waiting for the Glazer family to decide what to do.\nAs it has been since day one, they could either sell the whole thing - to Sheikh Jassim - sell a majority stake - to Sir Jim Ratcliffe's Ineos Group - or keep the club and bring in outside investment.\nHaving more to spend would not be a bad thing and owner funding does open another door from a Financial Fair Play perspective. Given the timescale though, it will not have an impact in this window.\nAs for the players, it should have zero impact on them. If it gets blamed, that would appear to be someone looking for an excuse.\nWhat does improvement look like this season?\nSimon Stone\nBBC Sport\nI ask this a lot.\nWould finishing second, 20 points behind the champions be improvement? What about fourth, two points back, losing out on the final day?\nPep Guardiola always talks about \"being there\". Sir Alex Ferguson used to say the same kind of thing. What they mean is being in contention for big prizes in April and May, when pressure starts to be applied and - they hoped - talent and mental strength began to show through.\nThe brutal truth is Manchester United have not competed for a Premier League since Ferguson retired. They have never gone further than the last eight of the Champions League and they only reached that stage once, under David Moyes.\nIf United can challenge, properly, deep into the campaign, that would be improvement and a clear sign they are moving in the right direction under Erik ten Hag.\nGet Man Utd news direct to your phone\nWill Ten Hag win the Premier League during his time as Man Utd boss?\nSimon Stone\nBBC Sport\nWell, he could. But this season is going to tell us a lot.\nI personally feel there are steps to take. Last season United moved forward. But they did that under Louis van Gaal, Jose Mourinho and Ole Gunnar Solskjaer.\nThe next bit is to prove they can be contenders. Once they have done that, they can win something big.\nI still feel Manchester City have a clear edge, not just over United but everyone else. However, if they stumble, Ten Hag’s team has a chance this season.\nThe problem is that under previous managers, every time United got to this point, they dropped back again. Ten Hag is younger than Van Gaal, does not upset people the way Mourinho did and has more power than Solskjaer.\nHe is in the best position to keep driving United forward. Time will tell whether he manages it or not.\nSign up to get Man Utd news direct to your phone\n'You see this team has character'\nManchester United manager Erik ten Hag reflected on a \"good weekend\" as the Red Devils followed Saturday's win over Lens at Old Trafford with a 1-1 draw against Athletic Bilbao in Dublin.\nUnited needed a late Facundo Pellistri equaliser to avoid defeat by the Spanish side, but Ten Hag told MUTV, external that the last-gasp leveller showed the \"resilience\" of his team.\n\"We don’t give up, we fight until the end,\" he said. \"Finally, we got the equaliser and I thought it was justified.\n\"We wanted a good result to finish the pre-season well. We gave a stupid goal [away] and went down. It was a giveaway, but as a team we showed character and that’s what we need for the season.\"\nTen Hag continued: \"In one weekend, two times we are losing but you see this team has character and that’s what you need in a season as well. Sometimes you are down and then you have to show resilience and especially in such moments you need determination. We have shown that this weekend, it was a good weekend for us.\n\"[On Saturday] I thought it was a very good level, today I have seen also very good spells. I think the start of the game was also very good and we should have scored a goal to go up, because it was a great chance from Jadon Sancho. We had some good moments after that as well and it was stupid how we went down but as I said, we had a result and we came back so it was a good weekend for us.\"\nForest agree deal for USA keeper Turner\nNottingham Forest have agreed a deal to sign Arsenal goalkeeper Matt Turner.\nThe USA international has been back-up to Aaron Ramsdale but with Mikel Arteta trying to sign David Raya from Brentford, Turner has accepted the chance to move on.\nHe is due to have a medical later today.\nThe 29-year-old has established himself as the USA's number one and played throughout the recent Gold Cup campaign when they reached the semi-final stage.\nIt is understood the move for Turner will not have any impact on Forest's attempt to sign Manchester United's Dean Henderson, who manager Steve Cooper is keen to bring back to the City Ground.\nMessi brace helps Inter Miami into League Cup last eight\nLionel Messi's stunning brace helped Inter Miami seal a dramatic victory against FC Dallas to reach the quarter-finals of the Leagues Cup on Sunday.\nFC Dallas led 4-2 with 10 minutes left but two late goals took the game to a penalty shootout.\nMiami won the shootout 5-3 at Toyota Stadium in Frisco, Texas.\n\"Being 4-2 down in the 80th minute and then coming back, we are very happy with the result,\" Miami manager Gerardo Martino said.\n\"But the fact that we have gone through shouldn't let us lose sight of the things that we have to improve.\"\nMiami were winless in 11 before Messi's arrival but have now won four in a row.\nFull story.\nWhy do we now have more injury time?\nFootball's lawmakers, the International Football Association Board (Ifab), announced its intention to \"create fairer conditions for both teams in terms of the amount of time available in a match\" at the start of the year, a trend which came to the fore at the Qatar World Cup at the end of 2022.\nUpon that recommendation, the Football Association and English Football League have told match officials to add on the exact time taken for certain events - like goals and substitutions - rather than the \"nominal\" amount they have previously used.\nThe average amount of time the ball spent in play in England during the 2022-23 season diminishes lower down the professional pyramid.\nThe Premier League average was 55 minutes, the Championship was 52 minutes, League One was 50 minutes, and in League Two matches just 48 minutes.\nThe first weekend of the 2023-24 EFL season was marked by many games with long amounts of injury time.\nGuardiola said: \"Now, every game we're going to play for 100 minutes. Wasting time, from my point of view, it is not going to be solved by extending 10 more minutes.\n\"It's more tiring for the players. It's too much.\"\nIn the build-up to the new Championship season, QPR manager Gareth Ainsworth was also sceptical. \"I think that there will be some in-season reviews on some of these rules. I really do, because I can't see them working.\"\nHowever, Charlton Athletic boss Dean Holden is \"on board\" with the bid to have more playing time.\n\"I am a trained referee myself and know how difficult it is to make so many decisions and to keep an eye on the time. I think it should be either the fourth official or someone in the stadium that does the time.\" He told BBC Sport.\n‘Important players and managers highlight issues’\nWorld Cup winner Varane, who retired from international football earlier this year, added: \"As a player I feel very privileged to do the job I love every day but I feel these changes are damaging our game. We want to be at our maximum level, the best we can be and put on amazing performances for fans to celebrate every week.\n\"I believe it is important that we, players and managers, highlight these important issues as we want to protect the game we love and give the fans our best.\"\nMeetings took place with both City and United last week to discuss the implementation of these new rules.\nThe Professional Footballers' Association said its chief executive Maheta Molango had met with a \"significant number\" of senior players and managers in the past few weeks, including Varane.\n\"There are concerns about how the new additional time rules will play out over a long season of league and cup games, as opposed to short tournaments,\" a PFA spokesperson said.\n\"Across what is now essentially a year-long football season, players are already thinking of these additional minutes in terms of extra games being played. It also comes at a time when players are pushing back against what is, increasingly, a completely unsustainable football calendar.\"\nTalking to BBC Sport about fixture congestion last month, Fifa vice-president and Concacaf president Victor Montagliani said: \"The pressure on the players is really only for the 1% [at the top of the game]. The rest of the footballers in the world don't play enough football. I can say that not only in my Confederation but even in Europe, for the majority of players, unless you are playing for a top, top club, when you are maybe not playing to the level others are playing at.\"\nVarane defender criticises added time and dissent rule changes\nManchester United defender Raphael Varane says new injury time and dissent rules are \"damaging our game\" and players are \"not being heard\".\nMatches will have more injury time this season to more accurately reflect stoppages in play, while players and managers have been warned they face tougher punishments for poor behaviour at games.\nOn Sunday the new added time rule was criticised by Manchester City boss Pep Guardiola.\nHe claimed the \"big brains\" did not consult people in the game after his side conceded in the 101st minute of the Community Shield, which they went on to lose on penalties to Arsenal.\nAlso in that match, Arsenal's Thomas Partey and City's Julian Alvarez were both booked for kicking the ball away after the whistle was blown for a free-kick, while Gunners boss Mikel Arteta was shown a yellow card after asking for Rodri to be booked as new conduct rules from the Football Association kicked in.\n\"We had a meeting last week with the FA. They recommended from the referees new decisions and rules,\" former France international Varane, 30, wrote in a post on social media on Monday., external\n\"From the managers and players, we have shared our concerns for many years now that there are too many games, the schedule is overcrowded, and it's at a dangerous level for players' physical and mental well-being.\n\"Despite our previous feedback, they have now recommended for next season: longer games, more intensity, and less emotions to be shown by players. We just want to be in good condition on the pitch to give 100% to our club and fans. Why are our opinions not being heard?”\nWhat will need changing if Spurs start slowly - system or manager?\nGeorge Cummins\nBBC Radio 5 live\nNeither.\nI would not be worried if Spurs start slowly under Ange Postecoglou.\nCeltic made their worst league start in 23 years under him. The statistics made for grim reading and it was a bad start. They lost a Champions League qualifier and exited the competition. They could not win away in the league and a heavy 4-0 defeat at home to Bayer Leverkusen followed in the Europa League.\nHowever, the manager was confident results would come and they ended up winning the league that season.\nTottenham will not win the Premier League but there will be a transition period.\nThe football will be more free-flowing than under the previous three managers and the players will need time to gel, but I think Spurs fans will enjoy what they are about to see.\nGet Spurs news and analysis direct to your phone", "url": "https://www.bbc.com/sport/live/football/66424684"}