{"authors": ["Brent Pilnick", "www.facebook.com"], "date_download": "2025-04-26 06:15:43", "date_modify": "2025-04-26 06:15:43", "date_publish": "2025-03-01 21:31:23", "description": "Plymouth Argyle head coach Miron Muslic says he is proud of his side as they lost 3-1 to Premier League champions Manchester City in the FA Cup.", "filename": "sport_football_articles_c3d8k23kgleo_1745648143.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/caac/live/96a752b0-f6e0-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c3d8k23kgleo_1745648143.html", "title": "FA Cup: Plymouth Argyle boss Miron Muslic proud of side after Manchester City loss", "title_page": "FA Cup: Plymouth Argyle boss Miron Muslic proud of side after Manchester City loss - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Plymouth Argyle head coach Miron Muslic said he was proud of his side as they lost 3-1 to Premier League champions Manchester City in the FA Cup.\nUkraine defender Maksym Talovierov headed the Pilgrims in front in the fifth-round tie before City rallied to overcome the Championship strugglers.\nThe loss ended one of Argyle's most memorable FA Cup runs which saw them knock out top-flight side Brentford in January's third round before beating Liverpool 1-0 at Home Park in the fourth round last month.\n\"We can only be disappointed with the result, but very proud of our performance,\" Muslic told BBC Radio Devon.\n\"We gave Manchester City a game, and we gave them a proper game.\n\"It's one of the best teams in the world, coached by the best coach in this sport.\n\"I think we had an excellent game plan and the lads just executed this game plan, with the structure and the organisation you need to survive here and get out of this game.\n\"But also especially the passion and the heart that's been with us for the last seven, eight, nine weeks.\"\nBefore the game - which saw almost 8,000 Argyle fans watch their side at the Etihad Stadium - Muslic said how pitting his wits against Manchester City boss Pep Guardiola would be the \"biggest honour of my life\".\nGuardiola promised Muslic an \"incredible bottle of wine\" after the game for an experience that the Pilgrims boss will not forget.\n\"It's a huge privilege and a huge honour,\" said Muslic.\n\"Sometimes everything goes so fast in football and so fast for me that I didn't even realise how big this moment was.\n\"It was an honour to face Manchester City here tonight, it was also an honour to face Pep Guardiola and we gave them a challenge.\"\nFor Talovierov, what was arguably the biggest goal in his career came at a time of deep uncertainty in his homeland.\nEuropean nations are meeting to discuss the fallout from the acrimonious meeting between Ukraine President Volodymyr Zelensky and United States President Donald Trump.\n\"We have a really hard situation right now, but these few hours we have just to focus on the game and football helps us to forget it and for our warriors and supporters in Ukraine, they try to watch and forget things,\" Talovierov told ITV after the match.\n\"I'm really proud of them, [it's a] hard situation but we will try to help our people and win this war as fast as possible.\"\nMuslic, who fled war-torn Bosnia for Austria as a nine-year-old refugee, was full of praise for the centre-back who has been impressive since joining for a club-record fee in January.\n\"His goal was the summary of his performance and his character,\" said Muslic.\n\"A straight guy, big heart, big passion, loves to defend, loves to give his all, he just fits perfectly to the type of player and character I was looking for.\n\"He played an excellent game defensively and also a beautiful header. It is a Premier League goal and I think he has the potential for this.\"\nBut with defeat comes the end of an FA Cup run that will live long in the memory, but the start of a singular focus on keeping their Championship status.\nThe Pilgrims are second from bottom, three points off Hull City, just outside the relegation zone, who they travel to on Tuesday.\nThey are staying in the north of England until after Tuesday's game - and if they can return home with three points and be closer to safety any disappointment at losing to Manchester City will be long forgotten.", "url": "https://www.bbc.co.uk/sport/football/articles/c3d8k23kgleo"}