{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:37:14", "date_modify": "2025-05-21 07:37:14", "date_publish": "2025-05-20 15:05:26", "description": "Everton midfielder Abdoulaye Doucoure announces he will leave the club when his deal expires at the end of the season.", "filename": "sport_football_articles_clyggq2qrq3o_1747813034.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7294/live/084f9e80-358a-11f0-9b2c-138cad92aeb3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_clyggq2qrq3o_1747813034.html", "title": "Abdoulaye Doucoure: Midfielder will leave Everton this summer", "title_page": "Abdoulaye Doucoure: Midfielder will leave Everton this summer - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Everton midfielder Abdoulaye Doucoure has announced he will leave the club when his contract expires at the end of the season.\nThe 32-year-old Mali player has made 165 appearances for the Toffees since joining from Watford for £20m in September 2020.\nDoucoure has scored 21 goals for Everton, including a memorable winner in their 1-0 victory over Bournemouth when the club avoided relegation on the final day of the 2022-23 season.\nHe joins veteran midfielder Ashley Young and goalkeepers Asmir Begovic and Joao Virginia in leaving, while forward Dominic Calvert-Lewin, midfielder Idrissa Gueye and defenders Michael Keane and Seamus Coleman are also out of contract this summer.\nIn a video posted on social media, Doucoure said: \"Hi Evertonians - just wanted to share this message with you that I'm going to leave the football club at the end of the season.\n\"After five wonderful years, my time at Everton came to an end.\n\"Everton means a lot for me. Obviously the past five years it's been hard but I will always remember my time as a dream for me, to play for Everton Football Club.\n\"Obviously I'm sad to leave the club but I think the time has come for a new chapter for me and the club as well and I will always be grateful for what the club did for me.\n\"My best memory, I will say it will be the goal I scored against Bournemouth to keep the club in the Premier League. I think this is something I will always be proud [of]. It was a wonderful moment for me and my family and for the club as well.\n\"I will miss the fans. I will miss the football club. I just wanted to let them know that I gave everything every single time in training, in games.\n\"I was always proud to wear the shirts, always proud to play at Goodison Park.\"\nThe midfielder looked emotional as he was substituted in the second half of Sunday's 2-0 victory over Southampton - Everton's final game at their Goodison Park home.\nThe Toffees will travel to Newcastle for their last match of the campaign this Sunday (16:00 BST) before relocating to their new Hill Dickinson Stadium at Bramley-Moore Dock.\nDoucoure added: \"I gave everything to win the most games I could and I will just miss the place, and I wish them all the best in the new stadium.\n\"Everton will always be part of my life now. I will be forever a Blue. I will always support Everton and I hope they're going to have a bright future.\"", "url": "https://www.bbc.com/sport/football/articles/clyggq2qrq3o"}