{"authors": ["Matt Newsum", "www.facebook.com"], "date_download": "2025-05-21 07:35:40", "date_modify": "2025-05-21 07:35:40", "date_publish": "2025-03-26 06:33:57", "description": "World champions Australia will return to England this autumn for the first Ashes tour since 2003, with all matches shown live on the BBC.", "filename": "sport_rugby-league_articles_c20d350nv7eo_1747812940.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0b8e/live/6863d490-0997-11f0-97d3-37df2b293ed1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-league_articles_c20d350nv7eo_1747812940.html", "title": "England v Australia: Rugby league Ashes series returns in 2025", "title_page": "England v Australia: Rugby league Ashes series returns in 2025 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "World champions Australia will return to England this autumn for the first Ashes tour since 2003, with all matches shown live on the BBC.\nThe sides will play Test matches on three successive Saturdays - at Wembley on 25 October, at Everton's new Bramley-Moore Dock stadium on 1 November and then at Headingley on 8 November.\nIt is eight years since the nations last met - in the 2017 World Cup final in Brisbane, with Australia winning 6-0.\nEngland's failure to beat Samoa in the World Cup semi-final in 2022 meant Shaun Wane's side missed the chance to renew rivalries with the Kangaroos in an Old Trafford showpiece.\nIn the two years since that delayed tournament, England have beaten Tonga 3-0 in a home Test series and then won two Tests against Samoa in 2024.\nThis announcement is a bright spot for rugby league's governing body, at a time of upheaval and uncertainty around its own governance and board structure.\nIt will be the first time since 2003 the Kangaroos have travelled to play in an Ashes series - with the previous incarnation a contest between Australia and Great Britain.\nThe absence of the series on the calendar for so long came as the Great Britain brand was dissolved for the most part in 2006 - barring an ill-fated return in 2019 - and the Tri-Nations, and then Four Nations, competitions came into being.\nThat meant opportunities for England to test themselves against Australia became all the more fleeting.\nThe appetite for the international game in the southern hemisphere also waned amid the rise in prominence of State of Origin as a high-profile representative option for New South Wales and Queensland players - and general dominance of Australia's National Rugby League.\nHowever, the experience of a World Cup on these shores in 2022 - with the bonding and team growth achieved by spending time away on foreign soil - helped reinstate Australia players' love for the green-and-gold jersey.\nThe recent Pacific Championships featuring New Zealand, Tonga, Samoa and the Kangaroos have also thrived.\nBut this is the biggest step made by the Australians, who have committed to a three-Test tour against northern hemisphere opposition at the end of the demanding NRL season.", "url": "https://www.bbc.com/sport/rugby-league/articles/c20d350nv7eo"}