{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:26:39", "date_modify": "2025-05-21 06:26:39", "date_publish": "2025-01-22 21:32:18", "description": "Manchester United striker Marcus Rashford's camp meet Barcelona, Arsenal initiate move for RB Leipzig striker Benjamin Sesko, Nottingham Forest prepare club record bid for Wolves forward Matheus Cunha, plus more.", "filename": "sport_football_articles_cn4zq7d0v7qo_1747808799.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/eac5/live/de196ec0-d904-11ef-a37f-eba91255dc3d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cn4zq7d0v7qo_1747808799.html", "title": "Football gossip: Rashford, Sesko, Garnacho, Adeyemi, Walker, Cunha, Dorgu, Tomori", "title_page": "Football gossip: Rashford, Sesko, Garnacho, Adeyemi, Walker, Cunha, Dorgu, Tomori - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester United striker Marcus Rashford's camp meet Barcelona, Arsenal initiate move for RB Leipzig striker Benjamin Sesko, and Nottingham Forest prepare club record bid for Wolves forward Matheus Cunha.\nRepresentatives of England forward Marcus Rashford met with Barcelona executives on Tuesday as the 27-year-old looks for a route out of Manchester United. (Sky Sports), external\nArsenal have made a tentative enquiry about trying to sign 21-year-old Slovenia striker Benjamin Sesko from German club RB Leipzig. (Talksport), external\nAC Milan have agreed a deal to sign 34-year-old England defender Kyle Walker from Manchester City which will be an initial loan but include an option to buy for 5m euros (£4.2m). (Sky Sports Italy), external\nManchester United winger Alejandro Garnacho favours a move to Chelsea rather than Napoli, who have had a bid for the 20-year-old Argentina international rejected. (TyC Sports, via Metro) , external\nArsenal's talks with Juventus over signing 24-year-old Serbia striker Dusan Vlahovic have broken down. (Football Transfers), external\nNapoli are also in talks about signing 23-year-old Germany winger Karim Adeyemi from Borussia Dortmund. (Fabrizio Romano), external\nA trio of Chelsea players could leave this month with Portugal defender Renato Veiga, 21, pushing to join Juventus, Italian midfielder Cesare Casadei, 22, the subject of an £11.5m bid from Lazio and England defender Ben Chilwell, 28, attracting interest from Everton. (Mail), external\nNottingham Forest are preparing a club-record bid, possibly in the region of £60m, to try lure Brazil forward Matheus Cunha, 25, away from Wolves. (Sky Sports), external\nJuventus have offered Chelsea the opportunity to sign Brazil midfielder Douglas Luiz, 26, who is also on the radar of Manchester City and Arsenal. (Teamtalk), external\nFrance midfielder Paul Pogba, 31, is considering several offers from teams inside Europe's top five leagues, but an agreement on a deal is not imminent. (ESPN), external\nWest Ham technical director Tim Steidten's future at the club is in doubt after the Hammers finalised a deal to bring in Chelsea recruitment analyst Kyle Macaulay, who has previously worked with manager Graham Potter. (Guardian), external\nWest Ham are in negotiations with Belgian club Leuven for 19-year-old Dutch midfielder Ezechiel Banzuzi. (Standard), external\nEverton have expressed an interest in Sporting's English winger Marcus Edwards, 26. (Caught offside), external\nThe agent of AC Milan's Emerson Royal, 26, has spoken with Everton and Fulham, but the Brazil defender is also on the radar of Galatasaray. (Calciomercato - in Italian), external\nManchester United are considering whether to make an improved bid for Lecce left-back Patrick Dorgu after having an initial bid for the 20-year-old Danish international rejected. (Star), external\nBut Napoli are hoping to beat Manchester United to the signature of Dorgu. (Gazzetta dello Sport - in Italian), external\nAston Villa and Newcastle United are set to battle it out for 27-year-old England and AC Milan centre-back Fikayo Tomori. (Football Insider), external", "url": "https://www.bbc.com/sport/football/articles/cn4zq7d0v7qo"}