{"authors": ["Emma Smith", "www.facebook.com"], "date_download": "2025-05-20 14:18:08", "date_modify": "2025-05-20 14:18:08", "date_publish": "2023-07-29 14:06:08", "description": "As Linda Caicedo sets the World Cup alight with two goals in two games, it is the latest high point in the 18-year-old Colombian's extraordinary rise.", "filename": "sport_football_66309149_1747750688.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/D5F0/production/_130586745_gettyimages-1564866120.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66309149_1747750688.html", "title": "Linda Caicedo: The Fifa Women's World Cup teen star who recovered from cancer", "title_page": "Linda Caicedo: The Fifa Women's World Cup teen star who recovered from cancer - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "At 11pm on the day she signed for Real Madrid in February, Linda Caicedo was not out celebrating with family and friends. Instead, the 18-year-old was calling a young cancer patient about to undergo surgery back home in Colombia.\nIt shows where the priorities of Caicedo lie - she may be one of the breakout stars of the 2023 Fifa Women's World Cup on the pitch, but off it she knows there is much more to life than football.\nHer journey so far includes a professional and international debut at 14, a cancer diagnosis at 15, and a move to one of the most well-known clubs in the world.\nThe latest step of that journey came in Sydney, where she jinked in from the left wing and fired through the gloves of keeper Yoon Young-geul as Colombia beat South Korea in their opening match, to earn only their second ever win at the Women's World Cup.\nCaicedo's goal means, at 18 years and 153 days, she is the second-youngest South American player to score a goal in the history of the tournament, with only Brazil icon Marta doing so at a younger age.\nInvoking Marta when comparing female footballers is a big statement to make - but Caicedo looks the real deal.\nAnd she backed it up with a world class goal against Germany as Colombia beat the two-time champions 2-1 on Sunday.\nShe has been the poster girl for the rise of women's football in Colombia, who only qualified for their first World Cup in 2011 but have been a growing power since.\nBorn in the town of Candelaria, Caicedo came from a poor background and has never forgotten the sacrifices needed to get her to this point. She recently travelled to Candelaria and donated 100 grocery bags of food to people in need, with no media brought along.\nShe has a close relationship with the Colombian manager Nelson Abadia, who has been in charge of the national team since 2017 but was involved as technical assistant from three years earlier.\n\"In 2016 I started with youth divisions, I had Linda here, she was 12 the first time I took her to the national team,\" said Abadia. \"She evolved from there.\"\nCaicedo's evolution saw her make her professional debut with Colombian club America de Cali in July 2019, when she was 14. In November 2019, she received her first international call-up.\nYet her meteoric rise was temporarily halted In 2020, when, amid the Covid-19 pandemic, Caicedo began to feel pain in her abdomen.\nFollowing tests, she was informed she had ovarian cancer. Two weeks after the diagnosis, in March 2020, Caicedo had surgery to remove a tumour, which involved the removal of one of her ovaries.\nCaicedo has been able to recover from her illness, which she in part puts down to the support from both her family, and her national coach Abadia.\n\"There was a difficult process, thank God I could overcome it,\" she said. \"My family was always behind me and my coach beside me was always very close.\n\"He [Abadia] was often calling me. I was going into surgery one day and I felt really bad, like I could not play top level football again; he said relax, you will come back. So I want to thank my coach.\n\"For people in difficult times like I was, I am an example you can overcome this.\"\nCaicedo started six months of chemotherapy after surgery, and days after finishing treatment - once she was declared cancer-free - she was back at training.\nShe returned to action with both Deportivo Cali and the national team. While being a senior international, she also continued to gain experience at age group tournaments.\nIn 2022, Caicedo remarkably played in four separate international competitions - the South American Under-17 Women's Championship, the Under-20 Women's World Cup in Costa Rica, the Under-17 Women's World Cup in India, and the Copa America Femenina.\nIt was in that latter tournament when the world really started to sit up and take notice of Caicedo. At 17 she was named player of the tournament as hosts Colombia reached the final, where they lost 1-0 to Brazil but had done enough to qualify for the 2023 World Cup.\nIn February 2023, just a few days after Caicedo turned 18, she signed with Real Madrid, becoming one of seven Spanish-based players in Colombia's World Cup squad.\n\"You need to leave your country to evolve, and support from fans and coaching staff helps me a lot,\" she said. \"This is how I have secured my place at Real Madrid.\n\"I've played U17, U20, now to be at a World Cup with such experienced players, the experience contributes a lot. I have learned at every stage. I feel this World Cup will be physical, which I will learn with the knowledge already gained.\n\"I am still very young, I still need to learn lots. I gain experience every day in this team. This is my first senior World Cup, I want to enjoy it. I have a lot of time.\"\nColombia assistant Angelo Marsiglia describes Caceido as \"extraordinary\".\n\"She wants the ball, never hides, she's from another planet, entirely unique,\" he added.", "url": "https://www.bbc.com/sport/football/66309149"}