{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:36:17", "date_modify": "2025-05-21 06:36:17", "date_publish": "2025-01-04 13:45:05", "description": "The Welsh sporting schedule has been impacted by plummeting temperatures across the country.", "filename": "sport_articles_c6274l5en4do_1747809377.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a541/live/02cb0db0-cb62-11ef-93a8-6966a864daf4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c6274l5en4do_1747809377.html", "title": "Welsh sporting schedule impacted due to weather", "title_page": "Welsh sporting schedule impacted due to weather - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The Welsh sporting schedule has been impacted by plummeting temperatures across the country.\nThe Met Office issued yellow and amber weather warnings for large parts of Wales over the course of the weekend - with snow and freezing rain expected to lead to \"disruption to transport and some other services\".\nNewport County's League Two match against Morecambe on Sunday has been called off after the pitch at Rodney Parade failed a midday inspection.\nBala Town's rearranged Cymru Premier contest with Caernarfon Town - which was initially abandoned on New Year's Eve due to poor weather conditions - was postponed on Friday night due to a frozen pitch at the Lakesiders' Maes Tegid home.\nSunday's Adran Premier games have all been postponed.\nAberystwyth Town and Barry Town United and Cardiff Met against Wrexham were called off on Saturday, before Swansea City against Briton Ferry Llansawel and The New Saints versus Cardiff City followed suit on Sunday morning.\nAnd the Southern Premier match between Gwalia United and Oxford was called off early on Sunday morning as a result of the overnight weather's impact on the pitch.\nThe rugby fixture list was also impacted - with Merthyr's Premiership match against Neath at The Wern on Saturday also being postponed due to a frozen pitch.\nPontypool against Carmarthen in the Super Rygbi Cymru Trophy has also been postponed due to an unplayable pitch.", "url": "https://www.bbc.com/sport/articles/c6274l5en4do"}