{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:02:05", "date_modify": "2025-05-21 05:02:05", "date_publish": "2025-04-04 09:48:56", "description": "Tottenham head coach Ange Postecoglou says he is not affected by the abuse he receives from some supporters and \"will continue fighting\".", "filename": "sport_football_articles_cdde6emz0qmo_1747803725.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/42b0/live/fe6a4d80-112f-11f0-8950-c1ec4174f99f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cdde6emz0qmo_1747803725.html", "title": "Ange Postecoglou: Tottenham boss 'not affected' by abuse from some supporters", "title_page": "Ange Postecoglou: Tottenham boss 'not affected' by abuse from some supporters - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tottenham head coach Ange Postecoglou says he is not affected by the abuse he receives from some Spurs supporters and \"will continue fighting\".\nSpurs suffered their 16th defeat in 30 Premier League games this season with Thursday night's 1-0 loss at Chelsea.\nPostecoglou cupped his ear in the direction of the travelling Spurs fans after substitute Pape Sarr, whose introduction was booed four minutes earlier, scored an equaliser which was later disallowed.\nAsked whether the abuse from some fans goes too far, Postecoglou said on Friday: \"No, I am fine. I don't get affected by that. I will continue fighting my whole career.\"\nHe added: \"I get that they [the fans] are frustrated and angry. At the same time, I understand the criticism towards me. But if anyone looked at the players and said they aren't trying - then I am sorry they are not watching the right game.\"\nSpurs are 14th in the table with eight games left - one place above their worst Premier League finish in 1994 - and on course to finish outside the top 10 for the first time in 17 years.\nWith their side trailing at Stamford Bridge, the Tottenham fans chanted \"you don't know what you're doing\" after booing Postecoglou's decision to replace Lucas Bergvall with Sarr in the 65th minute.\nBut Postecoglou turned towards them and cupped his ear when Sarr appeared to have levelled, before the goal was ruled out following a VAR review for a foul by Sarr on Moises Caicedo in the build-up.\nAddressing that incident, Postecoglou said: \"I made a mistake last night in that I celebrated a goal.\n\"Since VAR came in here, there were four or five incidents in Scotland and I thought I am not really going to celebrate goals.\n\"I just felt we needed something. Cracking goal from Pape, I heard the fans weren't happy and I felt the need to celebrate and it could be a real momentum shift to finish strong.\n\"My mistake was celebrating a goal, VAR defeated me, I won't be doing that again.\"", "url": "https://www.bbc.com/sport/football/articles/cdde6emz0qmo"}