{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:00:49", "date_modify": "2025-05-20 12:00:49", "date_publish": "2023-07-26 08:11:30", "description": "Boston's Jaylen Brown signs the richest NBA contract in history and a Los Angeles Chargers deal sees Justin Herbert become the highest-paid NFL player.", "filename": "sport_66309737_1747742449.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/C153/production/_130519494_bbc-sport-index-imagery-2-split-images-gradient-c55e7c21-20e9-4b32-8e5b-082642ec72db.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_66309737_1747742449.html", "title": "Jaylen Brown signs richest NBA contract and Justin Herbert becomes highest-paid NFL player", "title_page": "Jaylen Brown signs richest NBA contract and Justin Herbert becomes highest-paid NFL player - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Kylian Mbappe may be about to become the most expensive footballer of all time - but in the United States two financial records have just been smashed.\nWhile we await the outcome of Al-Hilal's world record £259m bid for Paris St-Germain forward Mbappe, lucrative contracts have been agreed in both the NBA and NFL.\nJaylen Brown has signed the richest deal in NBA history, agreeing a $304m (£236.8m) contract to remain at Boston Celtics, according to reports, external.\nMeanwhile, Justin Herbert's new five-year, $262.5m (£203.6m) extension with the Los Angeles Chargers will make the quarterback the NFL's highest-paid player by annual salary, insiders say, external.\nBrown's five-year Celtics contract exceeds reigning NBA Finals Most Valuable Player Nikola Jokic's $264m (£204.9m) deal at Denver Nuggets, which he signed last summer.\nThe two-time All-Star, 26, averaged career bests in points (26.6), rebounds (6.9) and assists (3.5) during 2022-23 as Boston reached the Eastern Conference finals.\nBrown, the third pick in the 2016 NBA draft, will earn $28.5m (£22m) next season before his extension begins in 2024, when he will average $60.8m (£47.1m) per year.\nTeam-mate Jayson Tatum is eligible for his own supermax extension next summer - which allows a team to re-sign qualified players on deals worth up to 35% of the salary cap, to maximum five-year contracts.\nBrown and Tatum combined for 56.7 points per game last season, which is the fourth-most by a duo since the competition's 1976-77 merger.\nHerbert's Chargers contract surpasses the $52.5m (£40.7m) average annual salary of Lamar Jackson, who signed a five-year, $260m (£201.8m) extension with the Baltimore Ravens this offseason.\nThe 25-year-old is the only quarterback to top 4,000 passing yards in each of the first three seasons of their career - and no player in NFL history has made more completions (1,316) over the first three campaigns.\nFrom Eugene, Oregon, Herbert was the sixth pick in the 2020 NFL Draft and was named the NFL's Rookie of the Year 2020-21 following a record-breaking season in which he became the youngest player to throw 30 touchdowns in a single season.\nHe still had two years remaining on his rookie contract, which would have paid him about $8.5m (£6.5m) this season.\nHis new deal may not remain the NFL's highest for long as Cincinnati Bengals quarterback Joe Burrow is due for an extension, which could top Herbert's figure.", "url": "https://www.bbc.com/sport/66309737"}