{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:17:49", "date_modify": "2025-05-21 04:17:49", "date_publish": "2025-04-06 00:00:00", "description": "Listen to live commentary and follow text updates from the Japanese Grand Prix.", "filename": "sport_live_cvg1zx59kgjt_1747801069.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e418/live/33966110-12b1-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_live_cvg1zx59kgjt_1747801069.html", "title": "F1 Japanese Grand Prix 2025: Reaction & result as Max Verstappen wins for Red Bull", "title_page": "F1 Japanese Grand Prix 2025: Reaction & result as Max Verstappen wins for Red Bull - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Post\nWe don't have long to wait for the next race as Formula 1 heads to Bahrain next weekend.\nWe'll have live coverage of all the action from there but we're going to wrap up our coverage of the Japanese Grand Prix now.\nSee you later!\nVerstappen fends off Norris to win in Japan - report\nAndrew Benson\nBBC F1 correspondent at Suzuka\nRed Bull's Max Verstappen fended off a race-long challenge from the McLarens of Lando Norris and Oscar Piastri to win the Japanese Grand Prix.\nThe Dutchman's fourth consecutive victory at Suzuka was his first of the year and moves Verstappen to within one point of Norris at the head of the drivers' championship.\nVerstappen's drive was cool under intense pressure, with rarely more than two seconds between him and Norris, and founded on a quite brilliant pole position lap on Saturday.\nMcLaren had feared that the Red Bull would be difficult to pass if Verstappen held the lead at the start, and so it proved.\nVerstappen led the two McLarens for the entire first stint, the three lapping closely together.\nThere may be questions as to why McLaren pitted Piastri first, when it might have made sense to attack Verstappen with Norris with an earlier pit stop.\nRead the full report here\n'The pace was mega' - Piastri\nMcLaren’s Oscar Piastri finished where he started in third, he said: \"I think the pace today was really, really good and I was very happy with that. I got close a few times and tried to then challenge but the track position around here is so important.\n\"Yesterday was where we effectively won the race and we didn’t do a good enough job so I will take the podium. There are still a lot of positives to take out of this weekend and the pace was mega, next time I just need to make sure I’m in a better position to use it.”\nOn pitting first out of the top three: \"I think for me it was just more trying to cover the guys behind, I was starting to struggle with the mediums and I was in the window to take a pit-stop anyway so that was the thinking there. It was a good strategy and we were kind of a bit in no man’s land.\"\nOn potentially swapping with Lando Norris: \"I had really strong pace and felt like if I had the track position I could go and get Max [Verstappen] but that’s what happens when you qualify behind unfortunately.\n\"I at least asked the question and that was a fair response, it was a good race and that’s how we want to go racing.\"\n'We're fighting for a win every weekend' - Norris\nLando Norris who finished second at the Japanese Grand Prix: \"Yeah I guess we lost out yesterday. Max drove a great race, no mistakes and the pace was too similar today to do anything more. It was a long race, a lot of pushing, flat out race from start to finish, it was tough but not enough today. There was nothing special we had, that we could get Max on. They were quick and no mistakes as I said, he deserved it.\nOn the pit lane exit: \"It's racing, he was ahead, it kind of squeezed into one and Max is the last guy I expect to give me any space, in a good way, in a racing way. Nothing more than that.\"\nOn a positive weekend: \"Yeah it has been a very good weekend, obviously didn't get the positions that we wanted. We're fighting for a win every weekend. Both Red Bull and Max deserved it this weekend, they've been catching up, they've obviously been making improvements. As a team we did not have enough this weekend so we will have to work harder for the next one.\"\n'The car was in its best form' - Verstappen\nRed Bull’s Max Verstappen wins his fourth Japanese Grand Prix in a row, he said: \"It was tough, just pushing very hard especially on the last set, the two McLarens were pushing very hard.\n\"It was a lot of fun out there, not easy to manage the tyres but I’m incredibly happy. It started off quite tough but we didn’t give up and we kept improving the car and today it was in its best form. Starting on pole that really made it possible to win this race.\n\"It’s important to execute, always try and maximise your performance and I think we did that very well this weekend.”\nOn Suzuka: \"This place means a lot to me and it was in the back of mind in the last few laps to try and stay ahead because it would be a great story and a kind of final farewell with Honda here in Japan.\n\"I’m incredibly proud of what we have achieved across all those years together and this is a perfect send-off.\"", "url": "https://www.bbc.com/sport/live/cvg1zx59kgjt"}