{"authors": ["Ray Hunt", "www.facebook.com"], "date_download": "2025-04-26 04:23:30", "date_modify": "2025-04-26 04:23:30", "date_publish": "2025-03-03 13:13:31", "description": "Southampton news: Opinion - Fan on how bad it is to follow Saints at this moment", "filename": "sport_football_articles_cp3yqj2519po_1745641410.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/57d7/live/2bcb00b0-b62a-11ee-8f07-bbfdfa890097.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cp3yqj2519po_1745641410.html", "title": "Opinion - Fan on how bad it is to follow Saints at this moment - BBC Sport", "title_page": "Southampton news: Opinion - Fan on how bad it is to follow Saints at this moment - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "With World Cup qualifiers and FA Cup fifth round and quarter-finals dominating this month, there is only room for two Premier League fixtures. This means there is only two chances for Southampton to ruin our weekends in the whole month of March.\nWe are sitting bottom of the table with just nine points and are destined for relegation as one of the worst teams in Premier League history. Three points are still needed from our remaining 11 fixtures to avoid that feat.\nEven if we manage to make that number, we will still be in the conversation.\nIn my time following this club, I cannot remember feeling as dejected as I do right now. Which leads me to question, is this the worst it has been?\nI remember, with no fondness, our relegation from the Championship in 2008-09 and entering the 2009-10 campaign with a 10-point deduction in League One.\nAt the time, it was a mess but - with new owner Markus Liebherr, new manager Alan Pardew and incoming goal-machine Rickie Lambert all entering the mix - things would surely turn around.\nWithout that points deduction, a fifth-place finish would have been secured. We did finish the season with a trip to Wembley and silverware in the Football League Trophy after a 4-1 win over Carlisle United.\nEven though we are currently a Premier League team (just), it feels like we are in a far worse situation. A situation that could have and should have been avoided.\nThe wrong decisions have been made, the recruitment has been a shambles and we find ourselves nowhere near being competitive with our peers - something that could never have been said in the doldrums of the Football League.\nFinancially, our hands were tied but the results were still coming - and we all still had hope.\nThe current situation we find ourselves in is that we are heading down, with no future direction, looking set to lose our star players and making no plans to change. But financially we are in a better place.\nIs there a worse time to be a Saints fan?", "url": "https://www.bbc.co.uk/sport/football/articles/cp3yqj2519po"}