{"authors": ["Andrew Benson", "www.facebook.com"], "date_download": "2025-05-19 14:41:47", "date_modify": "2025-05-19 14:41:47", "date_publish": "2017-07-14 09:31:51", "description": "Valtteri Bottas sets the pace as Mercedes dominate first practice at the British Grand Prix.", "filename": "sport_formula1_40606203_1747665707.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/17839/production/_96931369_valterribottas3_getty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_formula1_40606203_1747665707.html", "title": "Valtteri Bottas fastest in first practice, Lewis Hamilton second", "title_page": "Valtteri Bottas fastest in first practice, Lewis Hamilton second - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Valtteri Bottas set the pace as Mercedes dominated first practice at the British Grand Prix.\nThe Finn, who won in Austria on Sunday, was 0.078 seconds quicker than team-mate Lewis Hamilton, as the two swapped fastest times through the session.\nHamilton's title rival Sebastian Vettel was sixth quickest, 1.411secs off the pace after a big spin at Becketts and a trip over the kerbs at Village.\nHamilton is 20 points behind Vettel with Bottas a further 15 points behind.\nRed Bull were Mercedes' closest rivals out on the track on Friday morning as the weekend started under grey skies, with a chill wind and temperatures at only 15-16C.\nMax Verstappen was third fastest, 0.498secs off the pace and 0.338secs ahead of team-mate Daniel Ricciardo, with Kimi Raikkonen the fastest Ferrari in fifth.\nBut Mercedes' superiority on this high-speed circuit was underlined by the fact they set their fastest times on the soft tyre, whereas their rivals were on the super-soft.\nThere were some encouraging signs for McLaren, as Fernando Alonso set the eighth-fastest time behind Toro Rosso's Daniil Kvyat, and team-mate Stoffel Vandoorne only 0.048secs behind the Spaniard in 10th.\nAlonso already knows he will have at least a five-place grid penalty as a result of using too many engine parts and Honda has said more are likely to be on the way.\nThe McLarens were separated by Williams driver Felipe Massa in ninth, six places and 0.685secs quicker than team-mate Lance Stroll.", "url": "https://www.bbc.com/sport/formula1/40606203"}