{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:38:57", "date_modify": "2025-05-19 15:38:57", "date_publish": "2017-08-23 14:00:18", "description": "Banbridge athlete Emma Mitchell suffers in the heat as she finishes ninth in the 10,000m at the World University Games in Taipei.", "filename": "sport_athletics_41026899_1747669137.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6637/production/_97476162_bottle.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_athletics_41026899_1747669137.html", "title": "World University Games: Emma Mitchell ninth in 10,000m as she struggles in heat", "title_page": "World University Games: Emma Mitchell ninth in 10,000m as she struggles in heat - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Banbridge athlete Emma Mitchell suffered in the heat as she finished ninth in the 10,000m at the World University Games in Taipei.\nMitchell was almost exactly two minutes outside her personal best as she clocked 31 minutes and 51.62 seconds.\nThe humid conditions was always going to be a big concern going into Wednesday's race and they appeared to take a toll on the 23-year-old.\nKyrgyzstan's Daria Maslova took gold in 33:19.27 seconds.\nMaslova, who competed at the recent World Championships in London, was reported to have pulled out of the final but she did take to the start line and finished three seconds ahead of India's surprise silver medallist Sanjivani Jadhav.\nJapan's Ai Hosoda took bronze in 33:27.89 with her compatriot and long-time leader Yuki Munehisa a further 13 seconds back in fourth.\nMunehisa went into the race with the fastest personal best (31:58.46) with Maslova next quickest with a 32:21.21 clocking.\nHowever, Maslova and Indian Jadhav broke clear of the two Japanese runners with 600m left and the Kyrgyzstan athlete pulled away in the closing home straight to take the title.", "url": "https://www.bbc.com/sport/athletics/41026899"}