{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:34:20", "date_modify": "2025-05-21 05:34:20", "date_publish": "2025-04-02 15:40:09", "description": "Chelsea news: Enzo Maresca on managing the fitness of Reece James", "filename": "sport_football_articles_ckgr7nxl83lo_1747805660.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/df64/live/776d6920-0fbd-11f0-b775-419686450991.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ckgr7nxl83lo_1747805660.html", "title": "Chelsea news: Enzo Maresca on managing the fitness of Reece James", "title_page": "Chelsea news: Enzo Maresca on managing the fitness of Reece James - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Enzo Maresca has said he will continue to take Reece James out of Chelsea's starting line-up in a bid to \"manage\" the 25-year-old and prevent him from being unavailable through injury.\nThe Blues boss has said it is not viable for the defender to play matches every three to four days - and implied that he will continue to swap him in and out of the team.\n\"I still think that we need to manage Reece,\" Maresca said. \"You know his history better than me. You know that he is a player you need to be careful with in this moment.\"\nJames has only played 11 Premier League games this season for the Blues, but that is still more than the 10 appearances he managed last campaign - and Maresca is keen to retain his captain's services for the rest of the season.\n\"We want him fit until the end [of the season],\" Maresca said. \"The idea is to try to manage him and then we'll see in the future if we can go every day. But in this moment, because we need him until the end, we will try to manage him.\n\"Reece in another team is very young. In our team, probably he is a bit old, but he is still very young.\"\nChelsea have nine Premier League games left but could face an additional five if they reach the Conference League final.", "url": "https://www.bbc.com/sport/football/articles/ckgr7nxl83lo"}