{"authors": ["Phil McNulty", "www.facebook.com"], "date_download": "2025-05-21 04:40:33", "date_modify": "2025-05-21 04:40:33", "date_publish": "2025-04-03 09:27:17", "description": "Aston Villa news: Phil McNulty on successful transfer business", "filename": "sport_football_articles_c62j4e79p8po_1747802433.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f994/live/76a46b30-106a-11f0-ac9f-c37d6fd89579.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c62j4e79p8po_1747802433.html", "title": "Aston Villa news: Phil McNulty on successful transfer business", "title_page": "Aston Villa news: Phil McNulty on successful transfer business - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Aston Villa's second-half goals against Brighton all came from players who arrived at the club in January, the perfect advert for a fiercely ambitious manager in Emery and the progressive thinking of co-owners Nassef Sawiris and Wes Edens.\nThere was undoubtedly an element of gamble about Villa's work in January, but it is paying off as their season moves towards a potentially glorious conclusion fuelled by their work in this month.\nIt is a strategy reflected in results, with Villa's latest win putting them just three points behind fourth-placed Manchester City in the table with eight games left.\nBefore Marcus Rashford and Marco Asensio made their league debuts, Villa had played 24 games, winning 10, drawing seven and losing seven with a points-per-game ratio of 1.54.\nIn the league games since, they have played six, won three, drawn two and lost one at 1.83 points per game - with both players making crucial contributions in the FA Cup and Champions League.\nIt remains to be seen if Villa can persuade - or indeed want - Asensio and Rashford to extend their stays, but the results in the short term are bringing rich dividends.\nIn a January window often characterised by panic buys and a desire to correct errors from the summer window, Villa have played it smart and can move towards the season's conclusion with huge optimism and expectation.", "url": "https://www.bbc.com/sport/football/articles/c62j4e79p8po"}