{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:43:55", "date_modify": "2025-04-26 06:43:55", "date_publish": "2025-03-02 00:00:00", "description": "Watch and follow live coverage as Gloucester-Hartpury face Bristol Bears in the semi-finals of Premiership Women's Rugby.", "filename": "sport_live_cwye311wjx0t_1745649835.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b623/live/c42ef550-f779-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_live_cwye311wjx0t_1745649835.html", "title": "Premiership Women's Rugby semi-final LIVE: Gloucester-Hartpury v Bristol Bears", "title_page": "Premiership Women's Rugby semi-final LIVE: Gloucester-Hartpury v Bristol Bears - watch stream and listen to radio coverage - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Maher's impact 'phenomenal' as PWR semi looms\nBBC Sport\nPremiership Women's Rugby semi-final: Gloucester-Hartpury v Bristol Bears\nDate: Sunday, 2 March Kick-off: 15:00 GMT Venue: Queensholm\nCoverage: Watch on the Red Button, BBC iPlayer and BBC Sport website\nIn the 16 years captain Amber Reed has been with Bristol Bears she has never experienced such a commotion as there has been since American superstar Ilona Maher joined in January.\nMaher starts on the wing again when the Bears walk out this Sunday for the Premiership Women's Rugby (PWR) semi-final against Gloucester-Hartpury.\nWhatever the result, the Bears and the wider rugby community hope the 'Maher effect' will continue to ripple through the sport long after the final whistle.\n\"The noise, the level of excitement, the social media buzz that's been around this group this season, has been the best it ever has been, the best I've ever known,\" Reed said.\n\"The impact that she's had on the game as a whole is pretty phenomenal.\n\"Our ticket sales have dramatically increased from where they were last season and it would be pretty remiss of me to not give her credit for that and what she's done to the game.\n\"But I think the most impressive thing for me is she's managed all that [and] she's just a class team-mate.\"\nTo continue reading, click here.\nSaracens see off Harlequins to reach PWR final\nBBC Sport\nSaracens have reached the Premiership Women's Rugby final by defeating Harlequins 32-24 in a thrilling semi-final at StoneX Stadium.\nEngland wing Jess Breach, who returned to the Saracens side last week after sustaining a hip injury in November, was the standout player.\nThe 27-year-old's try, alongside two from Alysha Corrigan and tries from Marlie Packer and May Campbell, were enough to put the home side into the final on 16 March.\nGloucester-Hartpury face Bristol Bears in the other semi-final on Sunday, live on the BBC Red Button, BBC iPlayer and BBC Sport website from 15:00 GMT.\nBreach told TNT Sports after the match: \"Last year was really horrible to lose in the semi-final [against Bristol Bears].\n\"To come out here, on our home turf, and win - we really fought for the win.\n\"It's been a long season for me to get back on the pitch; I feel like I really performed back to the best of my ability today and I'm just so glad it was in a semi-final that helped the team get to a final.\"\nSaracens finished second in the PWR table, while Harlequins were one place behind in third.\nQuins opened the scoring inside two minutes through Spain full-back Claudia Pena, but were 20-12 down by half-time.\nA smart set-play by the visitors in the second half led to a try for Lauren Torley, cutting the gap to three points with 20 minutes to go.\nBut tries from Corrigan and Campbell, plus a conversion from Zoe Harrison, put Saracens back in control, before Babalwa Latsha grabbed a late try for Quins.\nGloucester-Hartpury 'know how to win' semi-finals\nBBC Sport\nGloucester-Hartpury know the challenge they are up against when they face West Country rivals Bristol Bears on Sunday for a place in the Premiership Women's Rugby (PWR) final.\nThe Bears were the last team to beat the two-time league champions, in a match that also took place on their own turf at Kingsholm in November - rebranded to Queensholm for this weekend's semi-final.\nSince that 19-14 defeat Gloucester-Hartpury have not looked back, winning their past nine games to storm into the league play-offs.\n\"Everybody talks about what you learn from your losses and we learned a lot from our loss that day,\" head of women's rugby Sean Lynn told BBC Radio Gloucestershire.\n\"Everything seems to be going in the right steps [since]. Friday night against Harlequins was really positive. Sport's all about momentum and, hopefully, we can take that momentum from Friday into Sunday.\"\nGloucester-Hartpury are aiming to become the first team to win the PWR title three times consecutively.Read more here.\nHow to get into rugby union\nGet Inspired\n#GetInspired\nCamaraderie and teamwork are vital skills in most team sports, but none to the same extent as in rugby union.\nFrom boisterous Saturday-league club houses, to schoolyard games of touch, to lining up for your country in the 6 Nations, union is a sport of skill, bravery and strength.\nAnd if you're more interested in throwing a ball around there are plenty of options for you, from the aforementioned touch, where tackling is banned, to light-hearted options like beach rugby.\nAlthough a certain level of physical stature is required in the professional ranks, rugby union really is an accessible sport, with the wide range of functions between different positions making it a sport for everybody,\nForwards are typically stronger, heavier and entrusted with the more physical aspects of the game, whereas backs utilise pace and agility.\nIt is incredibly popular at universities, and women's rugby clubs around the country are always looking for enthusiastic players and the next new pool of talent.\nFind your local club in England, , externalScotland,, external Wales, external and Northern Ireland , externalto give it a go.", "url": "https://www.bbc.co.uk/sport/live/cwye311wjx0t"}