{"authors": ["Gareth Vincent", "www.facebook.com"], "date_download": "2025-05-20 14:14:54", "date_modify": "2025-05-20 14:14:54", "date_publish": "2023-07-29 18:48:31", "description": "Alex Cejka leads the Senior Open Championship by a shot after a brutal third day at Royal Porthcawl on which no player shot an under-par round.", "filename": "sport_golf_66349181_1747750494.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/16470/production/_130584219_gettyimages-1563017207.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_golf_66349181_1747750494.html", "title": "Senior Open Championship: Cejka leads Harrington and Singh after brutal third round", "title_page": "Senior Open Championship: Cejka leads Harrington and Singh after brutal third round - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Alex Cejka leads the Senior Open Championship by a shot after a brutal third day at Royal Porthcawl on which no player shot an under-par round.\nCejka birdied the last to finish one clear of Padraig Harrington, Vijay Singh, Steven Alker and Phillip Archer.\nHarrington and Archer were among a group who managed best-of-the-day level par rounds of 71 in gusting winds on the south Wales coastline.\nRound-two leader Alker shot 76 despite a hole in one on the 15th.\nWelsh duo Bradley Dredge, who shot 74, and Phil Price, who went round in 73, are both within sight of the lead at four over par, alongside four-time champion Bernhard Langer.\nThis was the first time no player has produced an under-par round in the Senior Open since 2005, when Tom Watson triumphed at Royal Aberdeen.\n\"This is the sort of day you would love going out with your mates at home, when you didn't have a card in your hand but you would have fun with your mates, because silly things happen in wind like this,\" Harrington told BBC Sport Wales.\n\"The course is quite exposed - [holes] three and four with out of bounds are quite intimidating with a hurricane coming off the left. I think the golf course is particularly difficult in wind.\"\nSingh reached four under at one stage on his front nine only to drop six shots in nine holes starting at the ninth.\nFiji's three-time major winner had earlier saved par on the third despite having to play a left-handed chip because of an awkward lie.\n\"We don't normally play wind like this, especially me, I haven't played in conditions like this for a long, long time,\" Singh said.\nHarrington made eagles on the sixth and 18th holes and chipped in for a birdie on 14 as he moved into contention before Sunday's final round, when heavy rain is forecast.\n\"I didn't realise until I got the bad news that it's actually going to be worse tomorrow,\" he said.\n\"I will try and do my best no matter what. I will knuckle down and convince myself that those conditions suit me.\"\nItaly's Emanuele Canonica made an albatross when he holed his second shot on the par five 15th, only to drop six shots in his next four holes to finish six over par.\nFirst-round leader Miguel Angel Jimenez, who shot a five under par 66 on Thursday before dropping back to level par on Friday, went round in 83 to slide to 12 over.", "url": "https://www.bbc.com/sport/golf/66349181"}