{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:00:40", "date_modify": "2025-05-21 05:00:40", "date_publish": "2025-04-04 11:01:07", "description": "Kevin de Bruyne announces he will leave Manchester City when his contract expires at the end of the season.", "filename": "sport_football_articles_cj3x0jpmgv4o_1747803640.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6343/live/44a01490-1146-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cj3x0jpmgv4o_1747803640.html", "title": "Kevin de Bruyne to leave Manchester City at end of season", "title_page": "Kevin de Bruyne to leave Manchester City at end of season - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Kevin de Bruyne has announced he will leave Manchester City when his contract expires at the end of the season.\nDe Bruyne, 33, has won 16 trophies since joining from Wolfsburg in 2015, including six Premier League titles and the Champions League in 2023.\nReacting to the news, City manager Pep Guardiola said De Bruyne is \"one of the greatest midfielders to ever play in this country\".\nThe Belgian has scored 106 goals in 413 appearances for City, who described him as a \"global icon of the game\", but has started just 19 matches this season.\n\"Whether we like it or not, it's time to say goodbye,\" De Bruyne wrote on social media.\nAnd Guardiola said: \"It was not easy for me to tell him it [his City career] won't continue.\"\nIn an impassioned post, De Bruyne expanded: \"Football led me to all of you - and to this city. Chasing my dream, not knowing this period would change my life. This city. This club.\n\"These people gave me everything. I had no choice but to give everything back. And guess what - we won everything.\n\"Whether we like it or not, it's time to say goodbye. Suri, Rome, Mason, Michele, and I are beyond grateful for what this place has meant for our family. Manchester will forever be on our kids' passports - and more importantly, in each of our hearts.\n\"This will always be our home. We cannot thank the city, club, staff, team-mates, friends, and family enough for this 10-year ride.\"\nGuardiola compared De Bruyne's impact to that of other title-winning former City players Vincent Kompany, Sergio Aguero and David Silva - all of whom have had statues built outside Etihad Stadium.\n\"A sad day but a happy day for the fact that I had the pleasure personally to live this time with him,\" Guardiola said.\n\"What he gave us, all of us, with his humanity and his influence in our success in the last decade. Of course, part of us is leaving. When Vincent or Sergio or David left, these players have contributions.\n\"He's one of the greatest in this country. Always I have to be careful for the respect for the players that have played incredible roles, but there's no doubt he's one of the greatest for sure.\n\"The doors are open here for the rest of his life. He's part of this family, this club.\"\nAsked if De Bruyne will also have a statue, Guardiola added: \"I don't know. But I will bet a lot of money that is going to happen, that's for sure. He deserves to.\"\nCity, who have won the past four Premier League titles, said they are planning a \"fitting tribute\" before the end of the season.\n\"Manchester City will bid an emotional farewell to Kevin de Bruyne this summer when his contract expires, bringing an end to a glittering 10-year period at the club,\" the club said.\n\"The Belgian, a global icon of the game, has played 413 matches for City.\n\"During that period, he has scored 106 times, making him the first City midfielder since Colin Bell to reach a century of goals.\n\"The club and all of our fans will now take the time to deliver a fitting tribute and farewell to one of the greatest players to ever play in the Premier League.\"\nThe Belgium captain moved to City from Bundesliga club Wolfsburg in 2015 for £55m.\nManager Guardiola joined City a year later and helped develop De Bruyne, who had played in wide and attacking roles, into a central midfielder.\nDe Bruyne played a huge part as City enjoyed a dazzling period of success, culminating in the club's first Champions League triumph two seasons ago in Istanbul, where they beat Inter Milan in the final.\nBut De Bruyne has started to struggle with injury in recent years. He missed almost five months of last season as City won their fourth consecutive Premier League title, playing just 26 games in all competitions.\nMore recently, he paused contract negotiations while recovering from a thigh problem sustained in September.\nThe former Chelsea player said he was \"open to everything\" last summer after being linked with a move to Saudi Arabia.\nIt appears that De Bruyne could play for City in the group stage of this summer's Club World Cup, but as it stands he would not be eligible for the knockout stage as his contract expires at the end of June.\nGuardiola says it is up to the player to decide whether to sign a short extension that covers the rest of the tournament and then leave.\nWorld governing body Fifa has also tweaked its registration rules to effectively mean clubs can sign players solely for the duration of the tournament.\nDe Bruyne began his professional career with Belgian side Genk before signing for Chelsea in January 2012 for about £7m.\nHe made just nine appearances for the Blues and spent a season on loan at Werder Bremen before moving to Wolfsburg in 2013.\nThe midfielder has also made 109 appearances for Belgium, appearing at three European Championships and three World Cups, finishing third at the 2018 global tournament in Russia, when the Belgians beat England 2-0 in the play-off.\nAnalysis by BBC Sport chief football writer Phil McNulty\nWhen any conversation takes place, whether it is now or in the future, about the greatest players to grace the Premier League, Kevin de Bruyne will justifiably be part of it.\nThe heartbeat of one of the finest teams in the history of British football, De Bruyne was a creator supreme, a scorer of goals, a controller and dictator of games at the very highest level.\nThe Premier League has been fortunate to have him and we have been fortunate to watch him.\nThe word \"great\" is bandied around too easily - but it fits De Bruyne perfectly.\nOne standout personal memory was De Bruyne's performance when Manchester City beat Real Madrid 4-0 in the Champions League semi-final second leg at Etihad Stadium in May 2023.\nCity's first 45 minutes, in which they established a 2-0 lead, remains one of the finest halves of football I have ever witnessed - they delivered quality of the highest level, executed at a searing pace that bewildered Real Madrid.\nAt the heart of it all was De Bruyne, the great orchestrator of a magnificent team display.\nIf there is a sadness about De Bruyne's City career, it is that he was injured during both of their Champions League final appearances, suffering a serious facial injury following a collision with Antonio Rudiger in the 1-0 loss to Chelsea in 2021, then sustaining a hamstring injury in the victory against Inter Milan two years later.", "url": "https://www.bbc.com/sport/football/articles/cj3x0jpmgv4o"}