{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:04:23", "date_modify": "2025-04-26 07:04:23", "date_publish": "2025-02-28 00:00:00", "description": "Follow live text updates as Munster meet Edinburgh in the United Rugby Championship.", "filename": "sport_rugby-union_live_ckg1x9x44q8t_1745651063.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9534/live/3428c5b0-f618-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_live_ckg1x9x44q8t_1745651063.html", "title": "URC: Munster 28-34 Edinburgh", "title_page": "URC: Munster 28-34 Edinburgh - live text: BBC Sport - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Goodnight\nFT: Munster 28-34 Edinburgh\nThat's all from me tonight, as Edinburgh get their season back on track with a crucial win away to Munster.\nA dominant performance at scrum time laid the groundwork for four first-half tries which proved decisive.\nThanks for your company. Until next time...\n'Our whole game was off' - Costello\nFT: Munster 28-34 Edinburgh\nMunster interim head coach Ian Costello tells Premier Sports: \"Really disappointed. Really poor performance - that's not good enough. A very disappointed dressing room and rightly so.\n\"[Set-piece] had a big factor in the game, really dictated the momentum. Our whole game tonight was off, not at a standard that's acceptable.\n\"Struggling to take positives but those two points could be really important. We've got a couple of weeks off now and we've got to sit with that.\"\n'Set-piece functioned really well' - Everitt\nFT: Munster 28-34 Edinburgh\nEdinburgh head coach Sean Everitt tells Premier Sports: \"Very pleased. We had to go back to the drawing board when you lose at home.\n\"Our set-piece functioned really well which allowed us to put pressure on them from a field position point of view, and I thought we were outstanding defensively tonight.\n\"We learned hard lessons against Zebre. Top four is probably a little bit ambitious, but certainly top eight.\n\"We don't often win away from home so this was a really good confidence builder for the team.\"\n'We were hurting after Zebre' - Currie\nFT: Munster 28-34 Edinburgh\nEdinburgh centre Matt Currie has been named player of the match after his hat-trick:\n\"I've got a few family members here tonight,\" he told Premier Sports. My grandad Frank played hurling for Kilkenny and I've still got a lot of family here - probably a bittersweet one for them.\n\"We were hurting after that Zebre game. That wasn't a performance you want to put out, so it definitely gave us the shock we needed. The focus going on is keeping that consistency - we don't want to have those games to then perform afterwards.\n\"We maybe got lucky off the back of a few mistakes, but we spoke a lot about building pressure throughout the game and those tries came off the back of us doing that well.\"\nPost\nFT: Munster 28-34 Edinburgh\nJohn Barclay\nFormer Scotland captain on Premier Sports\nIt's a frustrating one from a coach and fan point of view, because we've seen two completely different versions of the same team.\nThat points to something being not quite right. They have a nice squad but it doesn't deliver on a consistent basis.\nConverted try Munster 21-34 Edinburgh\nBen O'Connor\nOver they go. Game on?\nIt's a rare occasion tonight where Munster have had a solid platform to attack from and they take full advantage.\nBen O'Connor the beneficiary of some tidy hands after multiple home phases.\nThe conversion splits the posts and suddenly the gap is back to 13 points.", "url": "https://www.bbc.co.uk/sport/rugby-union/live/ckg1x9x44q8t"}