{"authors": ["Stephan Shemilt", "www.facebook.com"], "date_download": "2025-05-21 07:20:35", "date_modify": "2025-05-21 07:20:35", "date_publish": "2025-05-20 08:21:34", "description": "All-rounder, leader and mother, Stephan Shemilt talks to those who best know new England captain Nat Sciver-Brunt.", "filename": "sport_cricket_articles_cx2e7z4j728o_1747812035.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8d04/live/52c102c0-34f8-11f0-96cc-13b63b61b4b0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cx2e7z4j728o_1747812035.html", "title": "Nat Sciver-Brunt: The girl born in Tokyo who became England captain", "title_page": "Nat Sciver-Brunt: The girl born in Tokyo who became England captain - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "\"It's been absolute carnage. I don't even know how to describe the last six months of our lives.\"\nKatherine Sciver-Brunt is in a hotel in Canterbury and baby Theo has just been passed to her wife Nat. It is two days before Nat's first game as the new full-time England captain.\nNat will soon head to training, in the evening and under lights, to prepare for the first T20 against West Indies.\nWhen Nat walks out to toss the coin on Wednesday, she will do so as only the fourth permanent England skipper this century.\nShe is the girl born in Tokyo who became captain of England. All-rounder, leader and mother.\nFor Sciver-Brunt, it is the culmination of an eclectic journey. Her early years were shaped by the diplomatic career of her mother Julia, now the UK's ambassador to Japan.\nNat Sciver, as she was then, went to school in Poland and the Netherlands before ending her education at Epsom College in Surrey.\nIzzy Westbury, who would become Middlesex captain, then a cricket writer and commentator, was two years above Sciver-Brunt at The British School just outside The Hague.\n\"I thought I was the tomboy, the only girl that played in the football team, then this little upstart popped up,\" Westbury tells BBC Sport.\n\"Not only was there another girl in that sphere, but she was really good. She played basketball and tennis, but, in terms of her sporting career, it could have been football instead of cricket.\"\nFor Sciver-Brunt, whose idol was David Beckham, there were football trials with Chelsea before she joined Surrey.\n\"I had that glimpse into her playing sport as a young teenager, then I didn't see her again until we were playing county cricket,\" says Westbury.\n\"When I saw her again, I thought: 'Oh, help.' She dislocated my finger with one of her cover drives. She hit it so hard, even then.\"\nSciver-Brunt played county cricket as a 17-year-old and was picked by England three years later. Such was the humble nature of the women's game at the time, her one-day international debut against Pakistan was at Louth Cricket Club in Lincolnshire.\n\"Very quickly she became one of my favourite team-mates to bat with, mainly because of her calmness,\" says former England batter Lydia Greenway, now the national selector.\n\"She never got flustered by the situation. It was also her ability to read the game. She probably doesn't get enough credit for how good she is tactically.\"\nMaking an impression on the field, and off it.\n\"She's a bit of a hustler,\" adds Greenway. \"You'll be playing table tennis and all of a sudden she's won 21-0. One of the questions we regularly got asked was 'who is the best dancer?' and Nat always came out on top of that.\"\nIn 2016, England went through a revolution not dissimilar to the soul-searching of the past few months. Back then a T20 World Cup semi-final exit was the catalyst for change and Sciver-Brunt was identified as a key component of the new-look team.\nGiven the recent questions England have faced over their fitness, Sciver-Brunt's early interaction with then-coach Mark Robinson has further similarities to the present day.\n\"She was one of six players who came back not very fit from the Women's Big Bash,\" says Robinson. \"One of my first dealings with her was addressing what had gone on. After that, she was a breeze to work with.\"\nBefore Robinson took over, Sciver-Brunt had only once batted in England's top five in a one-day international. Since then, she has never been out of the top five.\n\"It was pretty obvious she could be somebody special,\" says Robinson. \"Mark Davis, the former Sussex off-spinner and head coach, came with us on a tour and was calling her Jacques Kallis. 'Kallis will get us some runs today,' he would say.\"\nFor Sciver-Brunt, Robinson and England, everything built towards the 2017 World Cup triumph on home soil. While Tammy Beaumont and Anya Shrubsole produced stellar performances, it was Sciver-Brunt who captured the imagination with a shot she invented - the Natmeg - jamming down on a full-length delivery and hitting the ball between her legs.\n\"The only person who took it personally was Ali Maiden, the batting coach. He felt it was a technical flaw that she got into a bad position and had no choice but to squirt it out between her legs,\" says Robinson.\n\"Ali spent all the time with her hitting straight, holding her balance. He wasn't happy that all the work he was doing was being undone because when she got it wrong she was lauded as a hero for inventing a new shot. For Nat, it was water off a duck's back.\"\nThe World Cup was won on a historic day at Lord's, the greatest moment in English women's cricketing history. It was at that point Katherine asked Nat if they could be more than friends.\n\"I first met Natalie when I was working at Loughborough University,\" says former fast bowler Katherine. \"She was trialling at the National Cricket Performance Centre there.\n\"She came in with an arm brace on because her elbow hyper-extends. Mark Lane, the England coach at the time, was trying to wind me up saying she could bowl faster than me. I thought 'she's not all that'. Laney's wind-up worked, because I took notice.\"\nKatherine and Nat became housemates and business partners. They invested in a property and rented it out to England team-mates Amy Jones, Beth Langston and Fran Wilson. The group were so tight the other players nicknamed them 'Little Mix'.\nWhereas the rest could see the potential relationship developing, Katherine took her time.\n\"It's not like we wanted to hide anything from anyone, it's just that me and Nat didn't really know either,\" says Katherine. \"We were and still are all so close, that I didn't want to mess up any of that. It was me holding back.\n\"One day, I realised she was the best thing that ever happened to me.\"\nNat and Katherine went public about their relationship, engagement and eventual marriage. Last year, Nat had egg-freezing treatment, and they announced the birth of Theo, carried by Katherine, in April.\n\"We felt it was important to touch on subjects some people would find helpful,\" says Katherine. \"We cover a lot of difficult bases in the public eye, playing international sport, being gay, being women.\n\"We ticked a lot of boxes that touched areas where people could struggle. We felt if we could help people feel a little less uncomfortable, why not?\"\nWith two huge life events - becoming a parent and becoming England captain - happening at the same time, there are simultaneous struggles at play.\nKatherine was able to travel with Nat on England's winter tours, but was too deep into the pregnancy to go to the Women's Premier League (WPL) in February and March. As Katherine spent time in hospital, Nat was in India becoming the leading run-scorer and player of the tournament. If Katherine had gone into labour, Nat would not have made it home in time.\nThere was an initial plan for Nat to miss the West Indies series, but after England sacked Heather Knight, they needed a captain.\n\"Watching the WPL and how she dealt with what we were going though, that showed me she will be fine as England captain,\" says Katherine.\n\"We know her for being calm, calculated and being able to pull off her best performances in the worst situations. For that alone, if there is anyone for the job, it is Nat.\"\nAnd Katherine?\n\"I'll be looking away,\" she says. \"I have a distraction, which is good. I will be making sure Theo sees the first ball, so I can tell him he saw his mum's first game as England captain.\"", "url": "https://www.bbc.com/sport/cricket/articles/cx2e7z4j728o"}