{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:25:16", "date_modify": "2025-05-21 05:25:16", "date_publish": "2025-04-03 13:44:55", "description": "Plymouth Argyle head coach Miron Muslic calls on his attacking players to have a greater impact on his struggling side.", "filename": "sport_football_articles_c807lnjy3vgo_1747805116.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/09b9/live/055f1da0-1090-11f0-94b3-d3222284d093.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c807lnjy3vgo_1747805116.html", "title": "Miron Muslic calls on Plymouth Argyle forwards to step up", "title_page": "Miron Muslic calls on Plymouth Argyle forwards to step up - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Plymouth Argyle head coach Miron Muslic has called on his attacking players to have a greater impact on his struggling side.\nThe Pilgrims are seven points from safety at the bottom of the Championship ahead of the visit of Norwich City on Saturday.\n\"I think we have nine offensive players. They have to do better,\" Muslic said.\nWhile Muslic says leading goalscorers Ryan Hardie and Mustapha Bundu have \"delivered\" in recent weeks, the rest of the forward line have to improve.\n\"I think our game changers have to do it better,\" he added.\n\"It's every time when you impact the game as a coach, as a head coach, and you try to change, you have one objective to maintain the quality, intensity, structure, threat, or even to increase it.\n\"Right now we don't have it. When we change players we can't maintain the quality any more. When we change we can't increase the quality any more, and I think the game changers, they have to step up.\"\nPlayers including Michael Baidoo, Rami Al Hajj, Muhamed Tijani and Michael Obafemi have struggled to make an impact this season with just six goals between them in total.\nArgyle's attacking threat has also been hit by Morgan Whittaker's move to Middlesbrough in January and Ibrahim Cissoko cutting his loan from Toulouse short to make a temporary move to Championship rivals Sheffield Wednesday.\n\"Offensive players, it's all about output. If you're number nine, if you're number 10, if you're a winger, it's all about output,\" Muslic added.\n\"Their output in the end is assists and goals, and if you see us that's something we are struggling with throughout the whole season.\"", "url": "https://www.bbc.com/sport/football/articles/c807lnjy3vgo"}