{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:56:06", "date_modify": "2025-05-20 13:56:06", "date_publish": "2023-07-31 10:27:05", "description": "Jersey head coach Neil MacRae says his side feels a \"frustration\" at not qualifying for the 2024 T20 World Cup.", "filename": "sport_cricket_66360456_1747749366.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/10765/production/_130592476_denmarkvjersey_ar230728_4124.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66360456_1747749366.html", "title": "Jersey 'frustration' at missing out on T20 World Cup place", "title_page": "Jersey 'frustration' at missing out on T20 World Cup place - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jersey head coach Neil MacRae says his side feels a \"frustration\" at not qualifying for the 2024 T20 World Cup.\nThe islanders finished fourth in the European qualifying tournament in Scotland, with the hosts and fellow professional side Ireland going to the event in the USA and West Indies.\nThe pair both beat Jersey, as did Italy who finished in third place.\n\"We certainly came here with serious ambitions to qualify for the World Cup,\" MacRae told BBC Radio Jersey.\n\"But two tight games against Scotland and Italy took our chances away and there is frustration about that, because we've shown enough quality and we've certainly still got a young side that's going to improve, but we thought we were coming here with genuine chances and it's just not quite happened for us.\"\nHaving begun with a big win over Austria, Jersey lost by 15 runs to Scotland in a game where they had chances to win, before being beaten by 25 runs by Italy and nine wickets by Ireland.\nJersey rallied to end with big wins over Germany and Denmark but ended a fourth T20 World Cup Qualifier without progressing to the main event.\n\"We've got a very dedicated group of players who are extremely passionate in representing Jersey,\" MacRae added.\n\"There is genuine quality in this young squad, we're certainly playing better T20 cricket than we did even last summer in the Global Qualifier in Zimbabwe, and we'll continue to progress.\n\"In the Scotland game and the Italy game we had moments when we were dominating the match and opportunities to win, but we've not got over the line there, so we need to be realistic about that, understand there are still some areas to improve, and keep working for the next opportunity in two years' time.\"", "url": "https://www.bbc.com/sport/cricket/66360456"}