{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:24:42", "date_modify": "2025-04-26 04:24:42", "date_publish": "2025-03-03 12:34:32", "description": "Gillingham boss John Coleman has likened his side's 1-0 victory over Morecambe on Saturday to taking off a pair of shoes.", "filename": "sport_football_articles_ce8m14n4gn4o_1745641482.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4270/live/12edab70-f82c-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_ce8m14n4gn4o_1745641482.html", "title": "John Coleman: Gillingham boss relieved after first win at club", "title_page": "John Coleman: Gillingham boss relieved after first win at club - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Gillingham boss John Coleman has likened his side's 1-0 victory over Morecambe on Saturday to taking off a pair of shoes.\nRobbie McKenzie's 79th-minute strike earned the Gills their first win in 14 outings and Coleman's first since taking over as head coach in January following the dismissal of Mark Bonner.\n\"People who know me, know the analogy I use - it's like taking a pair of shoes off that are too tight and the relief you feel is unbelievable,\" Coleman told BBC Radio Kent.\n\"I'm a size nine, that was like taking a pair of size ones off.\"\nSaturday's victory took the Gills up a place to 18th in the League Two table and crucially 12 points of clear of one of Coleman's former clubs, Morecambe, in 23rd and who now find themselves three points from safety.\nThey travel to 16th-placed Newport County next on Tuesday night (19:45 GMT) with the opportunity to climb up above the Welsh side.\n\"That's the type of spirit we want at Gillingham Football Club,\" the 62-year-old added.\n\"When a lot of people are working hard, people feel obliged to work as hard - that's the herd mentality.\n\"You can't just say that's it, I feel the relief now. First and foremost we've got to get the points that make sure you don't go down and secondly we've got to give the fans what they deserve, particularly at home.\"", "url": "https://www.bbc.co.uk/sport/football/articles/ce8m14n4gn4o"}