{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:59:56", "date_modify": "2025-05-21 05:59:56", "date_publish": "2025-01-14 08:10:42", "description": "Alex Scott: Arsenal legend says WSL Hall of Fame induction 'brings it all back'", "filename": "sport_football_articles_c9d5lvlv6x7o_1747807196.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ad5f/live/514a8810-75c9-11ef-b02d-c5f3b724a1ea.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c9d5lvlv6x7o_1747807196.html", "title": "Alex Scott: Arsenal legend says WSL Hall of Fame induction 'brings it all back'", "title_page": "Alex Scott: Arsenal legend says WSL Hall of Fame induction 'brings it all back' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Arsenal defender Alex Scott said being inducted into the Barclays Women's Super League Hall of Fame was a full circle moment.\nThe 40-year-old's induction was celebrated on Monday evening alongside fellow inductees Steph Houghton, Gilly Flaherty and Rebecca Welch.\n\"It's a very proud moment,\" Scott told BBC Sport. \"So many people have seen what I have managed to achieve in my broadcasting career which is incredible, but this just brings it all back to what I managed to do as a football player.\n\"The reason I am doing what I am doing now is because of what I managed to achieve then. It's a time for celebration for that part of my career.\"\nThe Gunners legend won 21 trophies during 12 years at the club and when asked what her favourite memory as a player was, Scott said: \"With Arsenal I managed to win quite a few trophies. The 2007 quadruple-winning season has gone down in history because no team has managed to do that [since].\n\"Wining the FA Cup final and playing at Wembley in my club colours, I had managed to play there for England and Team GB, but finally getting that moment in an Arsenal top closed the chapter for me. I managed to achieve everything I thought I ever could and then it was time to move into broadcasting.\"", "url": "https://www.bbc.com/sport/football/articles/c9d5lvlv6x7o"}