{"authors": ["Shamoon Hafez", "www.facebook.com"], "date_download": "2025-05-21 05:43:48", "date_modify": "2025-05-21 05:43:48", "date_publish": "2025-04-02 23:20:32", "description": "A possible red card and potential offside in the build-up to the winner - did the officials get it wrong in the Merseyside derby?", "filename": "sport_football_articles_c87px355xpjo_1747806228.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/043e/live/7a6a61f0-106c-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c87px355xpjo_1747806228.html", "title": "Liverpool 1-0 Everton: James Tarkowski 'lucky' to escape red card", "title_page": "Liverpool 1-0 Everton: James Tarkowski 'lucky' to escape red card - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It was a challenge that would not have looked out of place in a derby in years gone by - but even Everton manager David Moyes considered his captain James Tarkowski \"lucky\" to stay on the pitch.\nIn the 11th minute and with a loose ball to contest, Toffees centre-back Tarkowski lunged in to clear his lines but caught Liverpool midfielder Alexis Mac Allister just below the knee with his studs.\nReferee Sam Barrott went immediately to his pocket and there could have been few complaints if he brandished a red card - but instead only a yellow was issued.\nWithin one TV replay it seemed clear the 32-year-old could yet find himself in trouble with the video assistant referee (VAR), but after a quick check, Paul Tierney decided no further action was necessary.\nThere was less than 60 seconds between Barrott showing the yellow card and Tierney concluding his review - with around 10 seconds between TV viewers being told there was a VAR review, shown the VAR review, and the review being complete.\nCommentating on the game for BBC Radio 5 Live, former Liverpool defender Stephen Warnock said: \"Tarkowski knows exactly what he's doing in that situation. I think it is so dangerous. It is out of control from Tarkowski.\"\nReds boss Arne Slot later pointed out that \"even people who are not liking Liverpool a lot are saying how clear and obvious it was\", while Moyes added: \"We could have been lucky we didn't get a red. It looked a high one.\"\nLiverpool, though, edged closer to the Premier League title courtesy of Diogo Jota's winning goal - a strike itself not without controversy with Everton claiming for an offside in the build-up.\nSo what did the officials get right and wrong in another controversial Merseyside derby?\nExplaining the decision, the Premier League Match Centre said on X: \"The referee's call of yellow card for a reckless foul by Tarkowski was checked by the VAR, with contact on the follow through after Tarkowski had played the ball deemed to be reckless.\"\nThe key word here is \"reckless\", which according to the laws of the game merits a yellow card rather than a red.\nHowever, Liverpool - and many onlookers - felt Tarkowski's challenge was not just reckless but also was made with excessive force.\nAccording to law 12, as explained on the Football Association's website, \"a tackle or challenge that endangers the safety of an opponent or uses excessive force or brutality must be sanctioned as serious foul play\".\nIt continues: \"Any player who lunges at an opponent in challenging for the ball from the front, from the side or from behind using one or both legs, with excessive force or endangers the safety of an opponent is guilty of serious foul play.\"\nTaking this into account, Blues defender Tarkowski was somewhat fortunate to stay on the pitch, with his challenge leaving Mac Allister writhing in pain - though the Argentine World Cup winner was able to continue after receiving treatment.\nIt is also worth noting that, within the wording of the laws, there is no reference to winning the ball in making a tackle. If a player uses excessive force, whether he takes the ball or not is irrelevant - it would still meet the threshold for a red card.\nFor such a robust challenge, it was a surprise that a VAR check and the subsequent decision came so quickly.\nThe Premier League rules state: \"In the Premier League, there will be a high bar for VAR intervention on subjective decisions.\n\"The decision of the referee, known as the \"referee's call\", will stand unless, in the opinion of the VAR, based upon the evidence readily available, that call is a clear and obvious error.\n\"If a clear and obvious error is identified by the VAR, for subjective decisions, after checking the attacking possession phase for any clear infringements by the attacking team, the VAR will advise the on-pitch referees to use the pitchside monitors to review the incident and make a final decision.\"\nThe judgement here was that there was no clear and obvious error.\nEx-England goalkeeper Joe Hart on Match of the Day: \"This is a Merseyside derby tackle of old... but he has got way too carried away and it could have ended so badly. Mac Allister is lucky to be standing up. The fact he has got the ball is irrelevant because it is dangerous.\"\nFormer Premier League referee Mike Dean on Sky Sports News: \"The follow through is awful. He hasn't got his foot planted luckily enough, but it's a red card.\n\"It's a terrible challenge and for me he should've gone to the screen and sent Tarkowski off 100%. I'm astounded he's not been sent to the screen.\"\nFormer Everton striker Duncan Ferguson said on Sky Sports: \"There is no argument. Straight red. Back in the day, you might have got away with that.\n\"That could have been a leg-breaker but that is a straight red all day long. He should have given the decision on the field but that is a straight red. Terrible decision.\"\nFormer Manchester United defender Gary Neville said on Sky Sports: \"I think he's lucky. He's gone high. I think it's a bad one, it's a potential leg-breaker.\n\"You do not need to follow through like that - it's with such force and it's high. Very lucky.\"\nThere were also question marks over whether Jota's well-taken goal should have stood.\nRyan Gravenberch played a ball forward which forced Tarkowski to slide in and intercept on the edge of the box, with Luis Diaz standing in an offside position behind the Everton defender - albeit making no motion towards the ball.\nLiverpool then recycled the play and Diaz's cute backheel was finished off by Jota to spark wild scenes inside Anfield.\nEverton centre-back Jarrad Branthwaite was convinced it should have been flagged offside, immediately putting his arms in the air and baying for a free-kick to no avail.\nBlues boss Moyes told BBC Sport: \"The players behind Jarrad interfere with him clearing it. It is an easy decision to give. I cannot understand any reason why that wasn't given offside.\n\"I am disappointed. He was along the line and it is quite an easy one to give offside.\"\nFormer England goalkeeper Joe Hart said on Match of the Day: \"I totally understand from a player's point of view and a manager's point of view. I am appealing for offside. But there are so many elements as to why this stands.\n\"I feel for David Moyes, but Arne Slot is bang on. When the ball is played Luis Diaz is making no attempt to play the ball. It is a perfectly good goal and a massive goal for Liverpool.\"", "url": "https://www.bbc.com/sport/football/articles/c87px355xpjo"}