{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:11:27", "date_modify": "2025-05-21 06:11:27", "date_publish": "2025-04-01 13:25:28", "description": "Wolves news: 'Timing was poor' - Bothroyd on Cunha comments", "filename": "sport_football_articles_cjdx5rn0v9jo_1747807887.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0b1b/live/56d31670-0ed6-11f0-a3a0-a5d2188117fa.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cjdx5rn0v9jo_1747807887.html", "title": "Wolves news: 'Timing was poor'", "title_page": "Wolves news: 'Timing was poor' - Bothroyd on Cunha comments - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The timing of Matheus Cunha's comments implying he wants to leave Wolves \"doesn't make sense\", says former Wanderers striker Jay Bothroyd.\nForward Cunha said in an interview with the Observer that he has told the club he needs to \"take the next step\" and fight for titles in his career.\nHowever, in a social media video on Monday, the 25-year-old said people did not have the \"correct interpretation\".\n\"The timing was poor,\" Bothroyd told BBC Radio 5 Live Breakfast.\n\"Everyone knows he wants to leave - he's a quality player who is going to go to a bigger club.\n\"But when you've signed a new deal and they've paid you more money - and they've given you a new contract so they can demand more money for you - why would you say this now?\n\"This should be a period where he gets his head down and tries to contribute to the team getting results, and then at the end of the season look at the scenario which comes around then.\n\"Right now, it just doesn't make sense.\n\"It doesn't affect the way you treat them, because obviously they're still your team-mate, but some players might go to him and say: 'Why did you do that?'\n\"I had a situation at Cardiff in the last year of my contract where every weekend I was being asked if I was leaving and why I hadn't signed a new deal My answer was simple and what it should be: 'I'm focusing on my football, I haven't got time for anything else.'\n\"That is what Cunha should have said to whoever interviewed him about Wolves because it is a big part of the season, there are some big games coming up and he needs to be on form.\n\"The manager won't be happy he spoke like that either. It's a strange one.\"", "url": "https://www.bbc.com/sport/football/articles/cjdx5rn0v9jo"}