{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:30:02", "date_modify": "2025-05-21 05:30:02", "date_publish": "2025-04-03 05:21:01", "description": "Donegal selector Colm McFadden warns that Derry have \"the ability to turn us over\" in the Ulster Championship opener on 6 April.", "filename": "sport_articles_c1eg8p6p548o_1747805402.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5bfd/live/4e853160-0e36-11f0-bfea-d170975f1d6a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c1eg8p6p548o_1747805402.html", "title": "Ulster Championship: Derry have ability to turn Donegal over", "title_page": "Ulster Championship: Derry have ability to turn Donegal over - Colm McFadden - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Donegal selector Colm McFadden warns that Derry have \"the ability to turn us over\" in the Ulster Championship opener on 6 April.\nJust one month after Donegal defeated Derry in Division One, the sides meet in the preliminary round of the provincial championship in Ballybofey.\nDonegal finished fourth in Division One as the top seven teams were separated by just two points, while Derry were relegated after being cut adrift with just one point.\n\"We know what Derry can produce and they have quality all over the field,\" said McFadden.\n\"Our boys will definitely have to get their heads in the right place. We will head into the game in the right frame of mind to try and get a result.\n\"Anything less than that, we know Derry have the ability to turn us over.\"\nDespite leading in Ballyshannon, Derry let a late lead slip in the Division One match between the sides on 2 March as Donegal ran out 1-22 to 1-19 winners.\nMcFadden said that if Donegal let Paddy Tally's side build up a significant lead in the Ulster Championship then \"it will be too big a scoreline to claw back\".\n\"We'll have to tighten up on that and not allow them that big of a lead,\" said McFadden, who added Derry were unfortunate not to win more matches.\n\"Before the league even started we knew the teams in Division One were all quality opposition and anyone can beat anyone.\n\"There's nothing between the teams in Division One and the top teams in Division Two. It's going to be a tight Championship, particularly in Ulster.\n\"It's going to be tough but the players will look forward to it.\"", "url": "https://www.bbc.com/sport/articles/c1eg8p6p548o"}