{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:59:17", "date_modify": "2025-05-21 05:59:17", "date_publish": "2025-04-05 00:00:00", "description": "Wolves close in on Premier League survival and left Ipswich on the brink of relegation after a vital comeback at Portman Road.", "filename": "sport_football_live_c230kmx9828t_1747807157.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0e76/live/1344b1b0-122e-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c230kmx9828t_1747807157.html", "title": "Ipswich 1-2 Wolves: Pablo Sarabia and Jorgen Strand Larsen settle Premier League relegation scrap", "title_page": "Ipswich 1-2 Wolves: Pablo Sarabia and Jorgen Strand Larsen settle Premier League relegation scrap - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wolves closed in on Premier League survival and left Ipswich on the brink of relegation with a vital comeback win at Portman Road.\nJorgen Strand Larsen and Pablo Sarabia's second-half strikes cancelled out Liam Delap's opener to leave the Tractor Boys facing an immediate return to the Championship.\nKieran McKenna's third-bottom side are 12 points behind the visitors with seven games left after a damaging defeat.\nIt was a game Ipswich had to win, yet a third successive league victory should now end Wolves' own relegation fears with just 21 points to play for.\nThe result meant Southampton will also be relegated on Sunday if they fail to win at Tottenham.\nStrand Larsen and Toti Gomes forced Alex Palmer into early saves but Delap fired Ipswich ahead after 16 minutes when he swept in his 12th goal of the season from Dara O'Shea's knockdown.\nIt gave the hosts a platform, but keeper Palmer almost conceded a calamitous own goal when he allowed O'Shea's backpass to drift under his foot before scrambling back to palm it off the line.\nWolves were awarded an indirect free-kick on the six-yard box, only for Sam Morsy to block Emmanuel Agbadou's strike.\nIt rattled Ipswich and they remained on the back foot after the break with Joao Gomes hitting the post for Wolves as the nerves grew.\nIt was no surprise when Spaniard Sarabia found the bottom corner to level in the 72nd minute after excellent build-up play involving Strand Larsen.\nThe in-form Norway striker, on loan from Celta Vigo, then bundled in the crucial winner from a Sarabia cross with six minutes left for his fourth goal in three successive games.\nTown boss McKenna stood stony-faced at the full-time whistle to reflect on a bitter loss - and there is no hiding from the mammoth task he faces to keep Ipswich in the top flight.\nThe Portman Road exodus had begun before the start of injury time with the disappointed home fans unwilling to suffer more.\nAn expectant support had roared their side on at kick-off and there was belief when Delap nudged in his 12th goal of the season from O'Shea's right-wing cross, but that slowly disappeared.\nThis was their 11th league loss of the season at Portman Road and sixth in successive home games, matching a record league run back in 1963.\nThat has left the Tractor Boys needing a minor miracle to stay up.\nBack-to-back promotions from League One to the Premier League was a staggering achievement, especially having been out of the top flight since 2002.\nThere was little expectation this season, but the aim to survive. Ipswich were not in the Premier League as tourists but there was little pressure after their rapid rise.\nThe money they spent - a reported £150m - should have made them more competitive after just one home win all season but it shows the gulf between the Premier League and Championship, let alone for a team who were in League One two years ago.\nThere will be pride in their journey but their spell among English football's elite is about to come to an end.\nThe smiles at the end said it all. In contrast to his counterpart McKenna, Wolves boss Vitor Pereira beamed and high-fived his staff in the stands as his side maintained their impressive winning run.\nThe Portuguese was banned from the touchline after his third yellow card of the season against West Ham in midweek, but it was a small price to pay for the man who had plotted their mission to survive.\nPereira arrived in December after Wolves had lost 2-1 at home to Ipswich, leaving them four points from safety and desperately in need of a lift.\nThey now have a 12-point gap to the bottom three thanks to a spirited comeback success.\nWolves kept their composure after going behind in the first half and took control in the second period. After beating Southampton and West Ham, this was a third straight win for the first time this season and first since December 2023.\n\"We are staying up\" chanted the away fans as they saluted Pereira and his team, who have shown a relish for battle and their survival instincts.", "url": "https://www.bbc.com/sport/football/live/c230kmx9828t"}