{"authors": ["Amy Canavan", "www.facebook.com"], "date_download": "2025-05-21 03:46:18", "date_modify": "2025-05-21 03:46:18", "date_publish": "2025-01-05 21:12:10", "description": "Eight points adrift. Eight games without a win. Three goals conceded inside 22 minutes against Dundee. Things aren't pretty for St Johnstone, writes Amy Canavan.", "filename": "sport_football_articles_c07g3jnv47yo_1747799178.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b2ce/live/cd439d50-cb99-11ef-947e-cddaefa76bda.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c07g3jnv47yo_1747799178.html", "title": "St Johnstone: Simo Valakari admits relegation is 'a big possibility'", "title_page": "St Johnstone: Simo Valakari admits relegation is 'a big possibility' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Eight points adrift. Eight games without a win. Three goals conceded inside 22 minutes against Dundee.\nThings aren't pretty in Perth. In fact, head coach Simo Valakari went as far as to say \"it looks very, very bad\" for St Johnstone after their latest defeat.\n\"We know if we don't perform, if we don't get results, relegation is a big possibility,\" the Finn told BBC Scotland.\nAnd with just four wins in 22 Scottish Premiership games this season, positive results have been painfully rare.\nThough it's only January, survival in the top flight already appears a struggle for the side who have dodged the drop, just, in recent times since promotion in 2009.\nBut there's something different in the air this season and plenty missing on the pitch.\nJust three days ago, St Johnstone enjoyed praise for earning a draw against in-form Hibernian with 10 men. It was a result Valakari said - and hoped - should breed confidence.\nSuch hopes were banished inside three minutes of what the Finn described as \"a nightmare start\" against Dundee.\nA calamity at the back involving goalkeeper Josh Rae and makeshift defender Drey Wright set the tone for a treacherous first half.\nOne goal quickly became two, while number three for Dundee was on the scoresheet before the 23rd minute.\nIn a game where a strong - or at least safe - start was required, the utter opposite was deployed as it swiftly became shambolic.\nSaints have now conceded 19 first-half goals in 22 league games, a league high.\nToo often they leave themselves chasing sides. Too often they're chasing shadows.\nIn the 14 games where they've conceded first, they've gone on to lose 12. It's uphill battle after uphill battle. Dundee was one of the steepest of the season, though.\n\"We were trying to recover the whole match,\" said Valakari. \"It was just too much in our situation, the way we are, to give away those three pretty soft goals.\n\"It was almost mission impossible today.\"\nHowever, Valakari won't concede the season as an impossible mission quite yet. He might want to give Tom Cruise a call for some tips.\nWhile St Johnstone find themselves in an unwanted, though not unfamiliar, rut, the difference this time around is they're down in the doldrums on their own.\nRoss County, their regular fellow relegation battlers, have opened up a 10-point gap by cracking the code of away wins, while the nearest strugglers, Hearts, are expected to drag themselves out of second bottom.\nThat's an expectation few have for St Johnstone. The signs for survival are scarce.\nThe Finnish boss knows few favour his side to pull off a great escape, but he insists they \"must believe\".\n\"Yes, it looks very, very bad, but if we don't believe in ourselves, no-one will believe in us,\" he said.\nWhere he might get folk on side is in attack. No-one can say St Johnstone don't go for it.\nWhen the exceptional Lyall Cameron smashed in the Dark Blues' third, St Johnstone's possession was above 75%. Even at that point they'd dominated shots and shots on target.\nThey ended the game with 26 shots - their highest league tally this season - and 599 passes in comparison to their opponents' 181.\nGoing forward, Saints can give sides a fright. But at the back, they often look timid.\nWith defenders Kyle Cameron and Lewis Neilson both returning to their parent clubs this week, it's a department where St Johnstone simply must strengthen, and soon, before any slither of belief is booted out the building.", "url": "https://www.bbc.com/sport/football/articles/c07g3jnv47yo"}