{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:39:13", "date_modify": "2025-05-20 14:39:13", "date_publish": "2023-07-28 12:45:53", "description": "Burton Albion defender Ryan Sweeney says the team spirit brought by the club's new signings \"will be huge\" this season.", "filename": "sport_football_66335150_1747751953.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2B95/production/_130575111_gettyimages-1233886858.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66335150_1747751953.html", "title": "Ryan Sweeney: Burton defender looking forward to challenge of winning a place", "title_page": "Ryan Sweeney: Burton defender looking forward to challenge of winning a place - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Burton Albion centre-back Ryan Sweeney says he is \"relishing\" the increased level of competition the influx of new signings have brought to the club.\nSweeney, 26, is one of 10 new recruits signed by the Brewers ahead of the new League One season.\n\"I've found it an easy transition, to be fair,\" he told BBC Radio Derby.\n\"The lads are a really good bunch and there's been quite a few new signings but the ones that were here last year have integrated us all well.\"\nSweeney, who captained Dundee to the Scottish Championship title last term, is one of four defensive players who have arrived this summer along with full-back Steve Seddon, centre-half Jasper Moon and wing-back Jake Caprice.\nWith Moon having taken one of the three central-defensive spots during his loan spell with the club last season, Sweeney knows he cannot take it for granted that he will walk straight into the team.\n\"You can see the ones who played there last year - Jasper, Hughesy [Sam Hughes] and Bray [John Brayford] - they're really good players,\" Sweeney said.\n\"I think that can only help. The standard in training's really high and you know if you dip below a certain level, there's someone who can come in that won't weaken the squad.\n\"We've got that all over the pitch and that's something I'm relishing.\"", "url": "https://www.bbc.com/sport/football/66335150"}