{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:22:07", "date_modify": "2025-05-21 04:22:07", "date_publish": "2025-01-23 18:09:16", "description": "Celtic manager Brendan Rodgers expects the sale of Kyogo Furuhashi to Rennes and the return of Jota from the French club to be completed within the next 24 hours.", "filename": "sport_football_articles_cqld2lyy46qo_1747801327.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/25f0/live/da442580-da51-11ef-9101-0340529baaeb.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cqld2lyy46qo_1747801327.html", "title": "Celtic close to Kyogo Furuhashi sale and Jota return from Rennes", "title_page": "Celtic close to Kyogo Furuhashi sale and Jota return from Rennes - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Celtic manager Brendan Rodgers expects the sale of Kyogo Furuhashi to Rennes and the return of Jota from the French club to be completed within the next 24 hours.\nRodgers revealed that the 30-year-old Japan striker, who has been a key player since arriving in Glasgow in July 2021, had recently expressed his desire to leave the Scottish champions.\nJota also made a big impression at Celtic Park, initially joining on loan from Benfica in 2021 and then on a permanent deal before being sold to Al-Ittihad for a reported £25m two years later.\nBut the 25-year-old Portuguese failed to establish himself at the Saudi Arabian Pro League club, was sold to Rennes in August but has also fallen out of favour with the Ligue 1 outfit.\nCeltic have accepted a bid from Rennes for Kyogo and Rodgers said of Jota: \"It's not finalised yet, but a player that would clearly be an absolutely incredible addition to our squad from what he has done here before and his qualities.\n\"Hopefully we can confirm that in the next 24 hours.\"\nKyogo left Glasgow after helping Celtic into the knockout stages of the Champions League in Wednesday's win over Young Boys.\n\"He has travelled for a medical, so that will probably be confirmed in the next 24 hours,\" Rodgers said.\n\"It's nothing to do with the club. Naturally, as a manager, I wouldn't want to lose one of our top players and someone who fits in with how we want to play.\n\"Kyogo expressed an interest to leave a number of months back. That expression becomes stronger and obviously it gets to the stage where he clearly wants to leave. Sadly, we then have to do a deal and finalise that with him.\n\"He's been an incredible player for the club in the three and a half years he has been here and not someone we wanted to lose but we have to accept where he's at.\"\nRennes head coach Jorge Sampaoli on Thursday confirmed that Jota would be leaving and hoped Kyogo could make his debut in Saturday's league match away to Monaco.\nRennes are fifth-bottom of the Ligue 1 table in France with 17 points from 18 games and have scored only 24 league goals this season.\nKyogo arrived at Celtic from Vissel Kobe for an undisclosed fee in July 2021 and has been one of the key players in the club's domestic dominance.\nHe has won three Premiership titles, two Scottish Cups and two League Cups with the Glasgow club.\nHis involvement in securing those titles was pivotal, scoring 85 goals in 165 games - including 137 starts - as well as providing 15 assists.\nThe Japan forward, who was contracted to 2027, has scored 12 goals from 32 games this season as Celtic have opened up a commanding lead at the top of the Scottish Premiership and qualified for the knockout phase of the Champions League.\nHe played for 75 minutes of Wednesday's victory against Young Boys that secured Celtic's progress to a Champions League play-off tie.\nKyogo scored his first Celtic goal in his first start against Jablonec in the Europa League in August 2021 and netted a 67-minute hat-trick in his next match - a 6-0 win against Dundee.\nHis 20-goal tally in his first season included two strikes against Hibernian in the League Cup final at Hampden.\nThe following campaign he opened the scoring against Inverness Caledonian Thistle in the final of the Scottish Cup that sealed the Treble.\nHe also scored twice to see off Rangers in the Scottish League Cup final earlier that season.\nSince his debut in the Premiership he has scored 63 goals, 12 more times than the next highest scorer, Lawrence Shankland, during that period.\nFind all the latest football transfers on our dedicated page.", "url": "https://www.bbc.com/sport/football/articles/cqld2lyy46qo"}