{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:13:49", "date_modify": "2025-05-20 12:13:49", "date_publish": "2023-08-04 17:27:31", "description": "Tottenham Hotspur: The limitless potential of Ashley Phillips", "filename": "sport_articles_cjrl0j51y4wo_1747743229.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b5a4/live/3efe2d80-32a2-11ee-a154-7d808d235ea7.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cjrl0j51y4wo_1747743229.html", "title": "The limitless potential of Ashley Phillips", "title_page": "Tottenham Hotspur: The limitless potential of Ashley Phillips - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Joe Bradshaw, BBC Sport\nTottenham fans have been crying out for help at centre-back this summer after their defence caved in at the back end of last season.\nIn impending new arrival Ashley Phillips from Blackburn Rovers, they are probably not acquiring an immediate solution, and actually the signing of Mickey van de Ven is inching closer to deal with that particular issue.\nInstead, with Phillips, if potential is anything to go by, the future of Spurs' backline will suddenly be a whole lot more secure.\nBlackburn have an impressive record of producing young talent and Phillips is considered the best of the lot. Physically imposing, despite only just turning 18, his ceiling is sky-high.\nLast season, he played every minute of England Under-19s' European Championship qualifiers and has continued his involvement with the national team's youth ranks this summer.\nHe was thrown in at the deep end for Blackburn at the start of the 2022-23 campaign and, as a raw 17-year-old, acquitted himself admirably on his debut against West Brom last August.\nWhen more experienced defenders regained their fitness, he generally reverted to the under-23 side where his composed, agile and authoritative performances drew admiring glances from many Premier League clubs.\nHe did still make 14 senior appearances last season - impressive numbers for a 17-year-old.\nIt is clear he is not yet ready for action at the sharp end of the Premier League, but what Ange Postecoglou is banking on is limitless potential.\nAfter all, he had only one defender older than 25 last season in his mighty Celtic side, with age clearly not a barrier to impressing the Australian.\nIf Phillips develops as hoped, Spurs will have English steel at the heart of their defence for the next decade.", "url": "https://www.bbc.com/sport/articles/cjrl0j51y4wo"}