{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:27:40", "date_modify": "2025-05-20 13:27:40", "date_publish": "2023-07-26 08:02:45", "description": "Everton: Dobbin impresses but Blues need goals", "filename": "sport_articles_cyx9vpk9wgro_1747747660.html", "image_url": "https://ichef.bbci.co.uk/ace/standard/1024/cpsprodpb/92d6/live/dd84a4d0-2b80-11ee-ad0f-1d8cf9ebdc84.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cyx9vpk9wgro_1747747660.html", "title": "Everton: Dobbin impresses but Blues need goals", "title_page": "Everton: Dobbin impresses but Blues need goals - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Joe Bradshaw, BBC Sport\nWith Dominic Calvert-Lewin’s fitness a lingering concern, Everton are in dire need of other options to boost their goalscoring.\nRightly, Sean Dyche is scouring the transfer market, but could he be priming young forward Lewis Dobbin for an elevated role this season?\nHe was certainly in the thick of it against Bolton Wanderers in Tuesday’s friendly, playing just off lead striker Neal Maupay, who himself was quiet at the Toughsheet Community Stadium.\nDobbin, 20, has two years left on his contract and, after a season on loan at Derby County, he will have aspirations of making the step up this year.\nHe bagged five goals for the League One side, playing 54 times and helping them to a play-off push.\nIncluded in that was a blistering volley in the FA Cup, thrashed into the top of the net from the edge of the box that showcased his technical ability.\nHis versatility found him operating on the right and left flanks, as well as in a second striker role.\nAgainst Bolton, he had a couple of opportunities, particularly when Dwight McNeil set him free in the first half, but he was denied by the keeper. He looked lively throughout, flickering with menace and always seeking to create chances.\nIn the friendly double-header last weekend, Dobbin joined the more youthful XI against Tranmere Rovers, and was again impressive, including one stunning solo run that was only denied by a last-ditch tackle.\nHowever, while Dobbin has offered intent, pace and promise, he does not give a physical presence and, like the rest of his team-mates so far, has not been able to find the clinical edge Everton really need.\nIf anything, the role he has been auditioning for is probably the one earmarked for Arnaut Danjuma, who signed on Sunday.\nHis arrival offered a statement of intent, but more firepower is desperately needed. Another forward must surely be on Dyche's shopping list.", "url": "https://www.bbc.com/sport/articles/cyx9vpk9wgro"}