{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:32:05", "date_modify": "2025-05-21 05:32:05", "date_publish": "2025-04-02 18:32:06", "description": "Wrexham's run-in more favourable than Wycombe's - Andy Morrell", "filename": "sport_football_articles_c70z4w41jkwo_1747805525.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7783/live/bef7bbf0-0f8c-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c70z4w41jkwo_1747805525.html", "title": "Wrexham's run-in more favourable than Wycombe's", "title_page": "Wrexham's run-in more favourable than Wycombe's - Andy Morrell - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Wrexham striker and manager Andy Morrell feels Wrexham have a more favourable run-in than Wycombe Wanderers as the League One finish line comes into sight.\nBoth sides were held to draws on Tuesday night, with Wrexham's contest with Cambridge United finishing 2-2 while Wycombe's match with bottom side Shrewsbury Town ended goalless.\nIt leaves Phil Parkinson's side in second place in the third tier with six matches remaining this season. The Chairboys are third and three points behind Wrexham, although they do have a game in hand.\nWycombe play six top 10 sides across their final seven games, with their opponents having an average current league position of eighth compared to 14th for Wrexham's remaining opponents.\n\"It's as you were,\" Morrell told BBC Radio Wales Breakfast.\n\"Charlton and Stockport are still six and seven points behind, Shrewsbury did us a favour. Wycombe had potentially more than 35 shots in the game but couldn't score.\n\"We take an away point, four points from the last two long away trips and we're back at home on Saturday.\n\"It's another one chalked off, and you can see the finish line. Can we get over it?\n\"Our run is slightly easier than Wycombe's, but we've still got a couple of tricky ties in there.\n\"Blackpool and Burton, both of those are going really well at the moment. We've got Charlton who are chasing us down as well so I think it's going to go right down to the wire.\n\"It's just so tight and tense. It's the team that can keep their heads the most, bring the intensity when you need to and try to get over the line in each of those games like we have done all season.\"\nGeorge Dobson gave Wrexham an early lead at Cambridge, although Liam Bennett equalised for the hosts before Josh Stokes made it 2-1 from the penalty spot.\nBut Sam Smith netted his fourth goal since joining Wrexham from Reading in January to ensure the visitors claimed a point.\n\"It started really well, we scored after a few minutes and it look really comfortable for the first half an hour, but then Cambridge got back into the game and they had a really good go,\" added Morrell.\n\"We equalised and it was pretty much a slugfest until the end. It was actually a good game to watch and probably a draw was a fair result.\n\"I thought it was a penalty, but Phil Parkinson was not happy afterwards saying it was one of the worst decisions he's ever seen.\"", "url": "https://www.bbc.com/sport/football/articles/c70z4w41jkwo"}