{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:53:00", "date_modify": "2025-05-20 12:53:00", "date_publish": "2023-08-03 10:04:15", "description": "Newcastle: Controversy over Saint-Maximin Saudi move a 'storm in a tea cup'", "filename": "sport_articles_ce9kdqyny3do_1747745580.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/897d/live/e3966130-31e1-11ee-8f52-fbf70e4bf742.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_ce9kdqyny3do_1747745580.html", "title": "Newcastle: Controversy over Saint-Maximin Saudi move a 'storm in a tea cup'", "title_page": "Newcastle: Controversy over Saint-Maximin Saudi move a 'storm in a tea cup' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The Athletic's Adam Crafton believes the controversial deal which has seen Allan Saint-Maximin join Al-Ahli from Newcastle is not a key issue when discussing the impact of Saudi-Arabia spending big money on footballers.\nAl-Ahli are run by Saudi Arabia's Public Investment Fund (PIF), which also owns Newcastle.\nSpeaking on BBC Radio 5 Live Football Daily's The Saudi Story podcast, Crafton said: \"I think the whole fuss around that Saint-Maximin deal is really a bit of a storm in a teacup.\n\"I think the deal in the end was around €30m. It's probably a bit high given he had a year left on his contract, but relative to what the Saudis have spent on Fabinho from Liverpool or (Sadio) Mane from Bayern Munich it doesn't seem in anyway outside of the market that the Saudis have created.\"\nThe Premier League has \"robust\" rules in place to ensure sales made between clubs owned by the same entity are of \"fair market value\", however Crafton believes there is the potential to bypass this with loan deals.\nHe added: \"I think one of the looming issues is if in January Bruno Guimaraes has an injury and all of a sudden Ruben Neves rocks up to Newcastle on loan for six months - I think that's the sort of thing the Premier League would struggle with.\n\"From a regulatory point of view, I don't think there's regulations there to stop that. I also think other clubs in the league would kick up a big fuss about that.\"", "url": "https://www.bbc.com/sport/articles/ce9kdqyny3do"}