{"authors": ["Neil Johnston", "www.facebook.com"], "date_download": "2025-05-20 12:22:02", "date_modify": "2025-05-20 12:22:02", "date_publish": "2023-08-04 13:41:21", "description": "Spain reach the quarter-finals of the Fifa Women's World Cup for the first time after producing an outstanding display of firepower to send Switzerland out.", "filename": "sport_football_66404305_1747743722.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5934/production/_130663822_spaingoal.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66404305_1747743722.html", "title": "Switzerland 1-5 Spain: Aitana Bonmati scores twice as La Roja march into quarter-finals", "title_page": "Switzerland 1-5 Spain: Aitana Bonmati scores twice as La Roja march into quarter-finals - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Spain reached the quarter-finals of the Women's World Cup for the first time after producing an outstanding display of firepower to send Switzerland out.\nLa Roja were beaten 4-0 in their final group game by Japan five days earlier in Wellington but bounced back in style to score four times during a dominant first half showing in front of 43,217 - a record crowd for a football match in New Zealand.\nAitana Bonmati swept the Spanish ahead before Switzerland equalised when Laia Codina, without looking up, hit a back pass past her own keeper and into the net from 10 yards inside her own half.\nSpain soon restored their lead through Alba Redondo's header before Barcelona midfielder Bonmati produced a classy finish to make it 3-1.\nIn an incredible opening half, Codina made up for her own goal by adding Spain's fourth after a scramble inside the box.\nSpain produced the perfect response after being written off following the 4-0 hammering against Japan.\nBoss Vilda promised a response from his players after that comprehensive defeat and he got one as the side ranked sixth in the world got the job done before half-time in Auckland.\nVilda responded to the Japan defeat by making five changes, giving a debut to goalkeeper Cata Coll in place of first-choice Misa Rodriguez, who had started the previous three games in New Zealand.\nColl will not have appreciated the wild back pass by her Barcelona team-mate Codina.\nThat aside, this was a highly impressive performance from a team that came into this World Cup with a cloud of doubt hanging over the squad after a feud between Vilda and many senior players.\nThose differences have been put aside for now and Spain look like a team playing in harmony. This was their third win in four games in New Zealand.\nThis was one game too many for Group A winners Switzerland, who had qualified for the knockout stage despite winning one game out of the three and scoring two goals in 270 minutes.\nTen of the starting XI at Eden Park were starting their fourth game after three successive clean sheets yet they were overwhelmed by their opponents.\nSwiss boss Inka Grings had said that finding goals was a priority in training yet they struggled to trouble Spain's defence and registered just one attempt on target.\nThey head home from their second Fifa Women's World Cup having topped a group containing Norway, co-hosts New Zealand and the Philippines.\nHaving required a 121st minute winner in a play-off against Wales in Zurich to qualify, their World Cup ended in disappointing fashion, with their players looking crestfallen as they walked around the pitch applauding fans after full time.\n\"My team has invested everything at this tournament and I am very proud of them,\" said Grings.\n\"There is nothing I would change and I would select the same players again. There is nothing my players did wrong. They played a really good tournament. Maybe we should have been more defensive against Spain.\"", "url": "https://www.bbc.com/sport/football/66404305"}