{"authors": ["Mantej Mann", "www.facebook.com"], "date_download": "2025-04-26 07:29:52", "date_modify": "2025-04-26 07:29:52", "date_publish": "2025-02-27 18:09:29", "description": "Uncapped back row forward Henry Pollock has a \"wonderful future ahead of him\", says England skills coach Kevin Sinfield.", "filename": "sport_rugby-union_articles_cqx00z3qjy9o_1745652592.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a25d/live/2a7c8160-f531-11ef-a161-d137c0587442.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_cqx00z3qjy9o_1745652592.html", "title": "England v Italy- in Six Nations: Henry Pollock has 'wonderful future', says Kevin Sinfield", "title_page": "England v Italy- in Six Nations: Henry Pollock has 'wonderful future', says Kevin Sinfield - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Uncapped back-row forward Henry Pollock has a \"wonderful future ahead of him\", says England skills coach Kevin Sinfield.\nThe 20-year-old has enjoyed a stellar season with Northampton Saints and was called up to the England training camp before their Calcutta Cup meeting with Scotland.\nPollock was influential as England Under-20s won the World Cup last summer and Sinfield says the flanker has been impressive in training since stepping up to the senior set-up.\n\"Pollock has been outstanding,\" Sinfield told BBC Sport at England's training camp in York.\n\"He's been great and has massively impressed not just the coaches, but the players as well.\n\"He's got a wonderful future ahead of him.\"\nEngland remain in contention to win the Six Nations after dramatic one-point home wins over both France and Scotland.\nThere are no games in the Six Nations this weekend and Steve Borthwick's side return to Allianz Stadium on Sunday, 9 March to host Italy in their penultimate match of this year's tournament, with Sinfield saying Pollock is in contention to make his Test debut.\n\"Henry's in a squad of 29 here that are fit and available, with four or five that are here rehabbing,\" said Sinfield.\n\"He's in with a shout [of making the squad] but they all are.\"\nHowever, Leicester lock George Martin is out of contention for England's final two fixtures with a knee injury.\nThe 23-year-old started alongside captain Maro Itoje in the second row against Ireland and France, but was replaced in the squad by Ted Hill for the win over Scotland.\n\"He's actually got two injuries - the knee, which has been a niggle for some time, and the shoulder as well,\" said Sinfield.\n\"It will be the shoulder that will keep him out.\n\"We're very hopeful it won't be long after the Six Nations, but there's still some medics investigating further.\"\nEngland's comeback victory over France earlier this month was their first Test win in nearly a year against anyone other than Japan, while Fin Smith's winning penalty a fortnight later against Scotland returned the Calcutta Cup to London for the first time since 2020.\nThe feel-good factor has returned to Allianz Stadium but England have acknowledged their performances have not been at the level they are aiming to reach.\nBorthwick's side have kicked the ball more than any other team in the competition, external and, despite ending a run of four consecutive defeats by the Scots, were outscored by three tries to one.\nEngland are expected to maintain their unbeaten record against Italy, who arrive at Twickenham after a 73-24 thumping by France, but Sinfield says a repeat of the French demolition job is unlikely.\n\"First of all we want to win,\" said the 44-year-old.\n\"Previously, we've had a couple of tight defeats and our job in sport at this level is to win games.\n\"We're not talking about under-9s where it's about participation and improving and developing. Clearly within that we are trying to improve every single day.\n\"People may have seen the France v Italy game and expect England to win by 50 points because we are at home. We have to be realistic as well. It's a Test match and Italy are a decent side, they are well coached and have some good players who we know a lot about.\n\"Of course it's important how we play, but our job is to win rugby games. We probably didn't give Scotland enough credit for how well they played. Would we like to throw the ball about and score eight or nine tries? Of course we would, but the reality is they are a good side and they took that away from us.\"\nSinfield's current title is skills coach, but the former rugby league international says his role is very varied, as he has also been seen working with England's kickers before they address the ball.\nMarcus Smith began the tournament as England's fly-half and main kicker but his disappointing performance from the tee against France led to namesake Fin Smith converting Elliot Daly's winning try late on.\nMarcus Smith retained the kicking duties in the victory over Scotland before Fin Smith took the responsibility for a long-range penalty from just inside the halfway line.\nAsked whether England have a main kicker, Sinfield said: \"Typically it's been Marcus for this campaign.\n\"That kick where we changed at the weekend was from bang on the halfway line and on a slight angle as well so it's understanding what people's ranges are. The guys actually made that decision on the field.\n\"The balance between them is great. They understand the team has to come first and sometimes that means some decisions are made, not just around kicking but with selection, positions people play in and the minutes they get.\"\nMarcus Smith has played the past two matches at full-back, with Fin Smith steering the attack from fly-half, but Sinfield says the aim of the decision is to utilise the Harlequins playmaker's strength in space.\n\"I think he's played in that [full-back] role a number of times for Quins,\" added Sinfield. \"He perhaps hasn't started there, but certainly gone there in games when Jarrod Evans has gone on.\n\"We know he is a world-class number 10 and part of our role as coaches is trying to get our best players on the field, and sometimes that means they have to shift positions slightly.\n\"One of Marcus' big qualities is how he beats people and what he's like in spaces that are a little bit bigger and when the gaps are a bit bigger, and trying to get him into those positions is a big part of why he was moved to 15.\n\"That's not to say it will continue or to say it will change, it's to say the fact he has some flexibility in his play is really important to us.\"", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/cqx00z3qjy9o"}