{"authors": ["Alex Howell", "www.facebook.com"], "date_download": "2025-05-21 05:23:27", "date_modify": "2025-05-21 05:23:27", "date_publish": "2025-04-03 15:26:18", "description": "Crystal Palace news: Opinion - What does the future hold?", "filename": "sport_football_articles_cwy74e6825xo_1747805007.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/67e6/live/e19956f0-0fdc-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cwy74e6825xo_1747805007.html", "title": "Crystal Palace news: Opinion", "title_page": "Crystal Palace news: Opinion - What does the future hold? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "In the final part of our special Q&A, BBC Sport football news reporter Alex Howell looks ahead to what the future could hold for Oliver Glasner and Crystal Palace.\nAl asked: Will the board properly invest in the team and support Oliver Glasner? He is the best manager we have had in a long time.\nAlex: The summer is likely to be busy because of the player situations mentioned in earlier questions. The board will need to buy players regardless as a result of the competitive nature of the Premier League, but the level of backing really depends on how Palace end the season.\nIf they qualify for Europe somehow, there is going to have to be a rethink on the model because the Eagles will need players who have competed at that level before and maybe need a bigger squad too.\nRob asked: Are Crystal Palace starting to build a sustainable model to become a regular top 10 club, with Glasner looking likely to sign a new contract and the quality of our player recruitment?\nAlex: I would argue they are sustainable now just because of the length of time they have been in the Premier League. The jump to a regular top 10 side depends on an increased number of quality options. At times, because of injuries and other factors, those have been lacking.\nGlasner is key to the future, I believe. He is an excellent manager and not going to be short of clubs interested in him for what he has done at Palace - all of which will be aware of the length of time left on his contract.", "url": "https://www.bbc.com/sport/football/articles/cwy74e6825xo"}