{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:56:13", "date_modify": "2025-05-20 13:56:13", "date_publish": "2023-07-31 10:16:25", "description": "Brighton: Evan Ferguson says Roberto de Zerbi 'strives for perfection'", "filename": "sport_articles_c3g44pxmlx2o_1747749373.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/30e5/live/77424c50-2f8a-11ee-a250-c9a4d46a1cc3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c3g44pxmlx2o_1747749373.html", "title": "Brighton: Evan Ferguson says Roberto de Zerbi 'strives for perfection'", "title_page": "Brighton: Evan Ferguson says Roberto de Zerbi 'strives for perfection' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Simon Stone, BBC Sport\nBrighton were sixth last season, their highest league finish.\nThey also reached the FA Cup semi-finals - where they were the better team but ultimately beaten on penalties by Manchester United.\nBettering that achievement will not be easy because, once more, they are having to cope with the loss of key players.\nWorld Cup winner Alexis Mac Allister has joined Liverpool and uncertainty remains over the future of midfielder Moises Caicedo, with Brighton already turning down a succession of bids from Chelsea for the Ecuador international.\nBut Roberto de Zerbi has spent money too, bringing in Joao Pedro from Watford for a club record fee of just under £30m, as well as experienced midfielder James Milner, former Fiorentina defender Igor Julio and Dutch goalkeeper Bart Verbruggen from Anderlecht.\n\"You always try to beat your previous year,\" said Albion striker Evan Ferguson, who enjoyed a breakthrough season in 2022-23. \"That is the way it needs to be.\n\"The manager strives for perfection. He is passionate and loves what he is doing.\n\"The way we play as well, you have to be tuned in. You have to know everyone's position. As a striker, you have to do a few more different things which you might not have to do for a different team. But that is good. It gives you extra knowledge.\"", "url": "https://www.bbc.com/sport/articles/c3g44pxmlx2o"}