{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:40:39", "date_modify": "2025-05-21 04:40:39", "date_publish": "2025-04-03 09:15:43", "description": "BBC's Andy Burke answers your Scottish rugby questions", "filename": "sport_articles_cy4v3wwg5l5o_1747802439.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cd78/live/a3aae9c0-0efc-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cy4v3wwg5l5o_1747802439.html", "title": "BBC's Andy Burke answers your Scottish rugby questions", "title_page": "BBC's Andy Burke answers your Scottish rugby questions - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "BBC Scotland rugby reporter Andy Burke has been answering some of your questions.\nStuart asked: Is Darcy Graham too good for Edinburgh? Does he need to move on?\nAndy answered: The harsh reality is yes, Darcy Graham is too good for Edinburgh.\nThe Scotland wing has the ability, attitude and X-factor to be playing for any of the world's top club sides.\nGiven that Edinburgh have been bobbing around the bottom half of the URC for too long, you can't get away from the fact that Graham's talents are deserving of a bigger stage.\nHe turns 28 in June and is contracted until the 2027 Rugby World Cup, by which time he will be 30.\nIt may be that at that stage he wants to sample something different, perhaps following the lead of his former Edinburgh team-mate Blair Kinghorn who has enjoyed such tremendous success in France with Toulouse. There would be no shortage of offers.\nFrom an Edinburgh and Scottish rugby perspective, you would hope Graham sticks around and a team can be built around him to compete. He is a player that deserves to be challenging for silverware.\nAlex asked: Why are the SRU not promoting Murrayfield for European cup finals? The last year's finals were at Tottenham Stadium in London, a non-rugby club, and also in Spain, again at a football stadium. Surely revenue should be kept within the game? The last one played at Murrayfield was in 2017.\nAndy answered: That 2017 Champions Cup final at Murrayfield between Saracens and Clermont was a fantastic occasion and definitely something the SRU should be pushing to do again.\nOf the seven finals played since then, four have taken place at football stadia, affirming the EPCR's desire to get rugby's showpiece club event into non-rugby territory in front of new audiences.\nThe final returns to Cardiff this season and while reaching new fans is an understandable focus for those running the European game, it's also important to cater for your base, the supporters who sustain the sport all year round.\nThe SRU are eager to maximise revenues from Murrayfield, and staging European finals would seem like an obvious way to do just that.", "url": "https://www.bbc.com/sport/articles/cy4v3wwg5l5o"}