{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:58:56", "date_modify": "2025-05-21 04:58:56", "date_publish": "2025-02-12 00:00:00", "description": "Makhtar Gueye gets both goals as Blackburn, without Derby-bound boss John Eustace, beat Tony Mowbray's West Brom.", "filename": "sport_football_live_c74ed4gg1y2t_1747803536.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c74ed4gg1y2t_1747803536.html", "title": "West Brom 0-2 Blackburn: Gueye scores twice in Rovers victory", "title_page": "West Brom 0-2 Blackburn: Gueye scores twice in Rovers victory - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Blackburn Rovers made light of the absence of manager John Eustace as they ended their five-game winless league run on the road by beating Tony Mowbray's West Bromwich Albion.\nWith David Lowe in interim charge ahead of Eustace's impending appointment at Derby, Rovers won with two early second-half goals from Senegal striker Makhtar Gueye.\nAlbion's first home defeat since former Rovers boss Mowbray returned to the club lifted the visitors above the Baggies from sixth to fifth, although they trail fourth-placed Sunderland by 14 points.\nAfter days of distracting speculation as to whether Eustace would take charge or not, Rovers released a statement not long before kick-off to confirm that Lowe would fill the head coach role until further notice, aided by a backroom team of Damien Johnson, Ben Benson, Mike Sheron and Paul Butler.\nEustace will be joined in making the move to Derby by two of his coaching staff - former Wolves midfielder and Albion coach Keith Downing and former Worcester City boss Matt Gardiner.\nWhether all the off-field comings and goings had an effect on how this game panned out is open to question - but it was certainly a very poor first half, enlivened by few incidents of note.\nFrom John Buckley's crossfield ball, Rovers full-back Callum Brittain attempted a shot on the full but it flew just over, while Tyrhys Dolan shot straight at home keeper Joe Wildsmith.\nAlbion went closer still when Torbjorn Heggem's header hit the outside of the post, but things quickly got better for the visitors straight after the restart.\nGueye burst into the Albion box and went over under the challenge of Mason Holgate, thinking he might have won a penalty.\nReferee David Webb ruled it was only a corner, but from Buckley's left-wing flag-kick, Coventry old boy Dom Hyam headed back across goal and Gueye pounced with an acrobatic volley that Wildsmith could not keep out at his near post.\nAlbion,who had Karlan Grant missing with a chest infection, did twice have the ball in the back of the net, But both were ruled out, the first for offside, the second for a push by Rovers old boy Adam Armstrong on Hyam.\nAnd, on 63 minutes, Rovers doubled the lead and secured all three points when, with Albion's marking all over the place, Gueye had the time and space to pick his spot from eight yards.\nMowbray made four second-half substitutions in a bid to find his side's missing spark - but it was all to no avail as Albion failed to score at home for the first time since they last faced East Lancashire opposition, a 0-0 draw with Burnley in early November.\nWest Bromwich Albion boss Tony Mowbray told BBC Radio WM:\n\"We huffed and puffed but we didn't have enough. We didn't have the cutting edge and you have to give them some credit for the way they came and defended.\n\"I've already seen them twice this season. They're hard to get through. They know when to foul and when to kill the clock.\n\"We we allowed them to score from a set play. We're definitely missing Kyle Bartley. He's the most dominant defender we have in the box - and he's a big voice.\n\"But they also scored a decent second goal on the break and, although we got the ball in the back of their net, they were both ruled out.\"\nBlackburn Rovers interim boss David Lowe told BBC Radio Lancashire:\n\"It's been a difficult week, so to come to a place like this and perform like we did in and out of possession was a great credit to the lads.\n\"Our defensive organisation was really good and, up front, Makhtar Gueye looks a real handful.\n\"He's taken time to settle in, but we've been working a lot with him – and he took his goals really well.\n\"It's sad to see John Eustace and the other two coaches go. They've worked really hard here. We'll just keep on going until an announcement is made. And we're now just focusing on Saturday.\"", "url": "https://www.bbc.com/sport/football/live/c74ed4gg1y2t"}