{"authors": ["Nat Hayward", "www.facebook.com"], "date_download": "2025-05-21 07:47:55", "date_modify": "2025-05-21 07:47:55", "date_publish": "2025-01-13 14:01:43", "description": "Chelsea analysis on Tyrique George", "filename": "sport_football_articles_c203njwlz98o_1747813675.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/90f8/live/fe74b620-d1a7-11ef-a14b-8f7223b7d1ef.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c203njwlz98o_1747813675.html", "title": "Chelsea analysis on Tyrique George", "title_page": "Chelsea analysis on Tyrique George - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Finding noteworthy topics from Chelsea's 5-0 victory over League Two strugglers Morcambe in the third round of the FA Cup was tough.\nDefender Tosin Adarabiayo scored twice from outside the box - his first albeit via a decisive deflection - while Joao Felix registered his own fine double to put some much-needed numbers on the board.\nElsewhere, Christopher Nkunku continued on his quest to end the season as the Blues' top goalscorer while offering the fewest Premier League goals possible. His celebrations contained a solemn familiarity that will make fans feel his long-term future is likely away from Stamford Bridge.\nBut these were contributions from experienced top-flight players against a team currently sitting 91st out of 92 in the English Football League.\nAt least 18-year-old winger Tyrique George's performance stood out, as he clocked 90 minutes and registered two assists.\nGeorge looks like he belongs at senior level, exhibiting a composure on the ball and maturity in decision-making that belies his age and inexperience.\nYoung wingers have a tendency after receiving the ball to either turn back and pass to their full-back or become predictable by driving at the defender. George though offered a variety of approaches - at certain times providing genuine threat with his jinking runs and at others keeping possession before offering an option for another pass.\nExcitement rippled through a rather subdued Stamford Bridge crowd whenever he was on the ball. Aside from his two assists, he created five chances, completed three successful dribbles - both the most from any player on the pitch - and won the ball once in Morecambe's final third. The quality and application he exhibited was key in breaking down a stubborn low block.\nSo far this season, George has featured in all of Chelsea's six Conference League group games but is yet to make his Premier League debut.\nGiven Mykhailo Mudryk is unlikely to return soon after testing positive for a banned substance, there will be minutes available on the left wing. It would therefore not be a surprise to see George appear as a late substitute if the Blues are comfortably winning in upcoming league games against Bournemouth and Wolves.\nAll you can ask from a young player is to seize their first team opportunities when they come. George is certainly doing that.", "url": "https://www.bbc.com/sport/football/articles/c203njwlz98o"}