{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:44:31", "date_modify": "2025-04-26 03:44:31", "date_publish": "2025-03-05 07:11:12", "description": "Aghyaran footballer Kevin Penrose tells The GAA Social about the twists and turns of his Gaelic Games journey as a gay man.", "filename": "sport_articles_c0egpprnn9qo_1745639071.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ef09/live/e2e19900-f920-11ef-ab75-3d760539555a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_c0egpprnn9qo_1745639071.html", "title": "The GAA Social: Kevin Penrose on coming out as gay in the GAA world", "title_page": "The GAA Social: Kevin Penrose on coming out as gay in the GAA world - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Aghyaran footballer Kevin Penrose is the guest on this week's The GAA Social Podcast on BBC Sounds.\nThe surname 'Penrose' will be familiar to Tyrone football watchers with Kevin's brother Martin having helped the Red Hand County win the All-Ireland Senior title in 2005 and 2008.\nGrowing up in a GAA household, football was the done thing and he played for the club during his childhood and teenage years.\nHowever the realisation that he was gay after going to university in Liverpool in his early twenties led to Kevin pulling back from the club to an extent, although he did continue to have sporadic playing stints with the St Davog's outfit based near Castlederg.\n\"The whole thing of changing room culture and lad culture was a thing. There are words thrown out there,\" he recalls.\nKevin took several more years to come out to his family and friends and it was during a travelling stint in south east Asia in 2022 when he was aged 28, that he finally broke the news to his mother during a FaceTime call home.\nThe Aghyaran native painted a picture during the BBC podcast of the mental anguish that he went through for five days during a stint in the Thai city of Phuket as he weighed up whether to tell his family about his sexuality.\n\"I felt the travelling was catching up on me and reaching burnout in a way,\" Kevin recalls\n\"I was in a dark room in a hotel. The motivation was gone to travel and I was just like, 'I can't really do this any more.' I was probably in the room for about five days straight. Wasn't going out, wasn't seeing anyone and I knew myself what it was.\n\"I needed to ring home and I needed to tell people and when I made the phone call on the Thursday or Friday with mum, it was just an instant weight lifted.\"\nHis mother and father and indeed all his family reacted with love and understanding, which meant Kevin could finally visualise his previous life \"of essentially playing two different people….two different characters\", coming to an end.\n\"Dad is a man of few words. It was just 'right well done' sort of thing. He is just a typical GAA father and he was asking, 'when are you coming home?'. Where are you going today?'\"\nAfter telling his aunts, uncles and cousins, Kevin, who already had a sizable social media following thanks to the travel videos he had been posting, felt it was time to inform the wider world.\n\"I was travelling for another month and with social media, having the platform I just thought 'I'll post this and whoever sees it, that's done and dusted'. Though as long as my family and close friends knew, that's all that really I cared about.\"\nBy the time he arrived home in Castlederg, the word had spread and 2021 Tyrone All-Ireland winner Ronan McNamee soon got in touch to ask Kevin to return to playing football for Aghyaran.\n\"I was worried in a sense because I hadn't really been fully involved in the team for years….in and out, in and out. I was there but not fully there.\n\"Ronan McNamee asked me to come back playing and was speaking on behalf of the lads and saying 'no one has a problem with this'.\"\nProfessionally, he is now making a living from his travel videos with brands using his social media profile to advertise on his platforms.\n\"It started just as a love of outdoors and hiking and during my summers growing up when I was at Camp America.\n\"But Ireland has a lot here too with, cliffs, mountains and the beaches. I've made an effort to explore my own country and with my GoPro camera.\n\"Once you grow your following and get people engaged, brands just look at you as a way to push their products and that's where the brand deals come and how you make your money out of it.\n\"It's mad to think it's a career but so far so good.\"", "url": "https://www.bbc.co.uk/sport/articles/c0egpprnn9qo"}