{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:20:29", "date_modify": "2025-05-21 04:20:29", "date_publish": "2025-02-09 12:37:41", "description": "Can Dundee take cup confidence into league?", "filename": "sport_articles_c391ym300kno_1747801229.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2556/live/8595d040-e6e2-11ef-a319-fb4e7360c4ec.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c391ym300kno_1747801229.html", "title": "Can Dundee take cup confidence into league?", "title_page": "Can Dundee take cup confidence into league? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Dundee fans, we asked for your views after Saturday's Scottish Cup victory over Airdrieonians.\nHere's what some of you had to say:\nMark: Professional performance and a very much needed clean sheet. Hope for a home tie next round.\nRod: Great to be in the quarter-finals. We are a match for most teams at home so hoping for a home draw in the next round. Two bad results will not stop us getting into the latter stages of the cup or top six. After being a yo-yo club in recent years Tony Docherty has stabilised us and there is no real fear of relegation. I'm hoping Doc stays for a long time.\nRoberto: A recovery of sorts. 4-0 is 4-0 but we need to beat a Premiership team to be able to claim to be back on the rails. It was a much better second half from Airdrie.\nCarl: Walk in the park today for the team, especially first half. The second half was a stroll against a poor Airdrie side so it's hard to judge how we would do against Premiership teams with the six changes made to the starting line-up. But, can we please have a back four because five is certainly not working.\nGary: A nice change to benefit from errors rather than making them but the Dee pressed Airdrie into those mistakes & were good enough to capitalise. Great to see the returnees, a debut for Victor Lopez and a clean sheet. Now let's hope for a good draw and to take the confidence forward into the league.", "url": "https://www.bbc.com/sport/articles/c391ym300kno"}