{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:09:03", "date_modify": "2025-04-26 04:09:03", "date_publish": "2025-03-02 19:55:28", "description": "What the managers said: Arsenal 4-3 West Ham", "filename": "sport_football_articles_cqx0e4pdq28o_1745640543.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ad5f/live/514a8810-75c9-11ef-b02d-c5f3b724a1ea.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cqx0e4pdq28o_1745640543.html", "title": "What the managers said: Arsenal 4-3 West Ham", "title_page": "What the managers said: Arsenal 4-3 West Ham - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Arsenal scored three goals in six minutes as they came from behind to beat West Ham in a seven-goal thriller. Here is what the managers said after the game:\nArsenal boss Renee Slegers to Sky Sports: \"I was saying before that we pride ourselves on clean sheets and being solid to beat defensively, so we put ourselves in a situation that we have not been in before as a team since I was here.\n\"I am very proud of the way that the girls kept calm and composed, found the solutions and kept digging in - I think it shows great strength and character. That is why we are stood here with a win.\n\"I am happy to hear [the players believed in the team] because it is important for them to believe in what we do. As a player it is easier to believe becasue you can influence it on the pitch and impact what is happening. Also the support from the fans kept us believing. They kept calm and kept supporting.\"\nWest Ham boss Rehanne Skinner speaking to Sky Sports: \"I thought first half we capitalised on our chances really well, showed our pace, got in behind and our set play deliveries were really good. We were not prepared to let anything go, fighting for everything and got goals out of the game. They weren't expecting us to play in a back five and we did it really, really well. I am proud of the players' efforts today.\n\"We scored three fantastic goals and caused a lot of problems. There are a lot of positives for us to take out of the game heading into Wednesday night.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cqx0e4pdq28o"}