{"authors": ["Tom English", "www.facebook.com"], "date_download": "2025-05-19 15:19:03", "date_modify": "2025-05-19 15:19:03", "date_publish": "2015-02-18 20:51:46", "description": "Europe's 2016 Ryder Cup captain was always going to be the popular Darren Clarke, says BBC Scotland's Tom English", "filename": "sport_golf_31527721_1747667943.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81095000/jpg/_81095000_10036616.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_golf_31527721_1747667943.html", "title": "Ryder Cup: Darren Clarke being 2016 captain is no surprise", "title_page": "Ryder Cup: Darren Clarke being 2016 captain is no surprise - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "As soon as the elite of European golf started to endorse Darren Clarke's candidacy, then there really was only one runner in the race for the captaincy of the European team at the 2016 Ryder Cup at Hazeltine.\nMiguel Angel Jimenez and Thomas Bjorn were right there with him on the starting line, but they were never going to raise a gallop, not when nine of the glorious twelve from Gleneagles 2014 were rooting for the Northern Irishman. It was always going to be a coronation rather than a contest.\nClarke has been love-bombed for months. He's popular, he's in tune with the players, he has four victories in five appearances in the Ryder Cup and 11 and a half points from a possible 20 and, on top of that, he has a fine track record as an assistant captain.\nHe's inheriting a blueprint for success that was modified and improved on by his predecessor, Paul McGinley.\nSince Gleneagles, McGinley's role in the winning of the Ryder Cup has grown arms and legs, as it tends to do for a winning captain. McGinley is a humble guy and the trumpeting of his role in Gleneagles has been done by others - players, mostly.\nThere's nothing wrong, however, with saluting McGinley's contribution without going over the top and casting him in the role of a tactical genius.\nMcGinley was thoughtful, dedicated and clever. He created a wonderful environment and was blessed with a superb bunch of players. He also had an opposite number, Tom Watson, who was miles off the pace and who instead of inspiring his own team merely managed to antagonise them.\nThe Irishman didn't need Watson to be a slapstick captain - his team would have won regardless - but the comparison between the enlightened Dubliner and the intractable Kansan has done McGinley's legacy no harm at all.\nAnd maybe it's fed the feeling of superiority that we have in Europe when it comes to the Ryder Cup. At times, that superiority - understandable, given the domination in recent times - has veered into the realms of pomposity. We hail our success and our continuity and our passion and our marvellous captains and players and point across the Atlantic and laugh and say 'they just don't get it'.\nWe do tend to enjoy rubbing American noses in European success.\nThe reaction to the soon to be confirmed appointment of Davis Love III as American Ryder Cup captain for 2016 is a case in point. He has been described as a failed captain which, of course, he is, having led his team to defeat in the most dramatic way at Medinah in 2012.\nIt had been assumed that the PGA Tour Ryder Task Force, an 11-man body set up in the wake of Gleneagles to try to figure out the way ahead, would go for Fred Couples as captain in 2016.\nThe word was that Tiger Woods, Phil Mickelson, Rickie Fowler and Jim Furyk - all members of the Task Force - wanted Couples, who boasts an excellent record as captain in the Presidents Cup.\nThe question was posed as to why America would ignore the claims of a popular guy like Couples, who appears capable of creating the right mood music in a team setting, and opt instead for a captain who has already blown his big chance. 'Will they never learn?' appeared to be the gently mocking gist.\nAnd if you think that the captaincy has a week-defining importance then it's a fair question to ask. Sure, a captain can help lose a Ryder Cup with bad planning and duff decisions, as Watson showed. But beyond creating a happy and positive world for your team and their entourage to live in and making sure they are comfortable in each other's company, on and off the golf course, the rest of it is not exactly a cosmic pursuit.\nIf you have common sense in your pairings and you get your guys to the first tee feeling brilliant about themselves, while hoping like hell that by the time they get there their game is still in good order, then there's not a lot else you can do. Your fate is in the hands of the players.\nLove is remembered as the man who oversaw one of the great implosions in Ryder Cup history. From 10-4 ahead at one point late on Saturday afternoon, America ended up losing 14-and-a-half to 13-and-a-half.\nBecause Mickelson was 1-up with two to play in his singles match with Justin Rose - and lost - then Love is a failure and Jose Maria Olazabal, his counterpart, is a hero. Because Jim Furyk was 1-up with two to play against Sergio Garcia - and went bogey-bogey to lose his match - Love is a failure and Olazabal is a hero.\nBecause Matt Kuchar lost four holes to par in his defeat to Lee Westwood, Love is a failure and Olazabal is a hero. Because Steve Stricker was so out of sorts that he allowed Martin Kaymer to win his match - and clinch the cup itself - despite the German being over-par for his 18 holes, Love is a failure and Olazabal is a hero.\nLove made a mistake on the Saturday afternoon four-balls when the rampant Mickelson-Keegan Bradley combination were allowed to rest when they should have been sent out again to wreak their havoc. That's the loser's burden. Your every mis-step is remembered. Olazabal also made errors, but he won and nobody cares about what he did or didn't do. He's Olly - victorious Ryder Cup captain. The nuances are lost in time.\nThe hope for 2016 is that Love's team are made of sterner stuff than recent versions. The probability is that their team will have less of the old guard than before. That'll be no harm. Less baggage and more competitive edge as typified by Jordan Speith, Patrick Reed and Rickie Fowler. There are some mildly encouraging signs in the return of Dustin Johnson and the emergence of Brooks Koepka. They'll need more artillery.\nYou wouldn't wish it on Clarke, but for the good of the Ryder Cup and a much-needed changing of the dynamic, Europe getting a bloody nose wouldn't be such a bad thing. The last time the two captains met on this stage it was in the singles at Oakland Hills in 2004. With three holes to play, Love was 2-up. When they shook hands on 18, it was all square.\nThat's been America's problem in microcosm. Love gets another chance to correct it while Clarke gets a deserved opportunity to write another chapter in his great Ryder Cup story.", "url": "https://www.bbc.com/sport/golf/31527721"}