{"authors": ["Pat Nevin", "www.facebook.com"], "date_download": "2025-05-21 07:36:20", "date_modify": "2025-05-21 07:36:20", "date_publish": "2025-05-20 15:30:26", "description": "Everton news: Pat Nevin's farewell to Goodison Park", "filename": "sport_football_articles_cn0gg84g10ko_1747812980.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/40f3/live/9b0e1b00-3564-11f0-bf15-094eef773db0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cn0gg84g10ko_1747812980.html", "title": "Everton news: Pat Nevin's farewell to Goodison Park", "title_page": "Everton news: Pat Nevin's farewell to Goodison Park - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "I had an interesting weekend. On Saturday night I was at my old stomping ground Stamford Bridge, where I was MC for a night celebrating the legacy of Roberto di Matteo – and what a lovely man he is. The Italian scored in three Cup finals for Chelsea and as manager brought the FA Cup to the club before delivering their first Champions League trophy in 2012. It was quite emotional as the fans were able to show their appreciation at last.\nTwelve hours later I was 200 miles north at another old stomping ground, this time for the last time. Many of us former Everton players were invited back for the final men's game at Goodison Park and it was an incredibly emotional day.\nFrom Neville Southall, the finest keeper in the world on his day, to Duncan Ferguson and Wayne Rooney, most of the greatest names in the club's history who are still living, were on the pitch at the end. It was an honour to be among them, but even more of an honour to be in front of those fans one last time.\nI have rarely if ever heard a noise as loud as the one at the beginning of the game. It was a visceral celebration and outcry that no one who was there will ever forget. Everton won and Iliman Ndiaye scored a couple but the game and the result didn't matter.\nMany fans talked to me about their memories - friends made and family moments cherished. They recalled precious moments with other Everton fans who are no longer with us. Fathers and sons hugging on the terraces after a goal, when they could never hug anywhere else.\nThe atmosphere was charged with positive emotions and, yes, plenty of sentiment. It was like so many other places around football at the moment, the end of a season as well as the end of an era can have those effects. Those who do not love the game can never fully understand and share our passions.\nI feel a little sorry for those people today, they don't know what they are missing.\n'Goodbye to Goodison' is available to watch now on BBC iPlayer, where you can hear from fans, players past and present, and David Moyes on what Goodison Park means to Everton Football Club.", "url": "https://www.bbc.com/sport/football/articles/cn0gg84g10ko"}