{"authors": ["Andrew Benson", "www.facebook.com"], "date_download": "2025-05-21 07:37:09", "date_modify": "2025-05-21 07:37:09", "date_publish": "2025-01-22 09:59:00", "description": "Crowds gather as Lewis Hamilton drives a Ferrari Formula 1 car for the first time at the team's Fiorano test track.", "filename": "sport_formula1_articles_cj482551gl9o_1747813029.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0f71/live/8d40bb60-d8d8-11ef-902e-cf9b84dc1357.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_formula1_articles_cj482551gl9o_1747813029.html", "title": "Lewis Hamilton drives Ferrari Formula 1 car for first time", "title_page": "Lewis Hamilton drives Ferrari Formula 1 car for first time - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Lewis Hamilton said his first test in a Ferrari Formula 1 car was \"awe-inspiring\" and \"one of the best feelings of my life\".\nThe 40-year-old seven-time champion completed 30 laps of Ferrari's Fiorano test track in cold, damp conditions on Wednesday in a 2023 Ferrari F1 car.\nHamilton said: \"When I started the car up and drove through that garage door, I had the biggest smile on my face.\n\"It reminded me of the very first time I tested a Formula 1 car. It was such an exciting and special moment, and here I am, almost 20 years later, feeling those emotions all over again.\n\"I already knew from the outside how passionate the Ferrari family is, from everyone in the team to the tifosi [fans].\n\"But to now witness it first hand as a Ferrari driver has been awe-inspiring. That passion runs through their veins and you can't help but be energised by it.\n\"I'm so grateful for the love I have felt from everyone in Maranello this week, we have a lot of work to do but I can't wait to get started.\"\nFinishing his driving just after 11:00 local time (10:00 UK), Hamilton handed the car over to team-mate Charles Leclerc, who competed 14 laps in the afternoon.\nFerrari team principal Frederic Vasseur said: \"As is the case every year, the first time you go out on track is a bit like the first day back at school and quite an emotional feeling, especially today as it was Lewis' first day as part of the team. Welcoming a new driver is always an important moment.\n\"Maybe today was less special for Charles, but it was good to see him fit, relaxed and keen to go racing again.\"\nHamilton's run in the SF-23 - the most recent car he is allowed to drive under F1's testing restrictions - is part of his acclimatisation work with his new team.\nHis test follows two days of work at the Ferrari factory in Maranello, of which the Fiorano track is a part.\nHamilton is also expected to test at Spain's Circuit de Barcelona-Catalunya in the coming weeks before experiencing the team's 2025 model at its launch on 19 February.\nHamilton will be limited to a total of 1,000km (621 miles) of what is known as testing of previous cars running by F1's regulations.", "url": "https://www.bbc.com/sport/formula1/articles/cj482551gl9o"}