{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:30:39", "date_modify": "2025-05-21 07:30:39", "date_publish": "2025-01-30 22:22:23", "description": "Tottenham agree £50m deal with Bayern Munich for Mathys Tel, Al-Nassr plot £90m offer for Brighton's Kaoru Mitoma, Ollie Watkins open to joining Arsenal, plus more.", "filename": "sport_football_articles_c0e4dn1z713o_1747812639.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a22d/live/a2644b30-df34-11ef-bd1b-d536627785f2.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c0e4dn1z713o_1747812639.html", "title": "Football gossip: Tel, Garnacho, Mitoma, Watkins, Tierney, Henderson, Ferguson, Kobel", "title_page": "Football gossip: Tel, Garnacho, Mitoma, Watkins, Tierney, Henderson, Ferguson, Kobel - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tottenham agree £50m deal with Bayern Munich for Mathys Tel, Al-Nassr plot £90m offer for Brighton's Kaoru Mitoma, Ollie Watkins open to joining Arsenal, plus more.\nTottenham have agreed a £50m deal with Bayern Munich for 19-year-old French forward Mathys Tel. (L'Equipe - in French), external\nHowever, Manchester United are aiming to sell 20-year-old Argentina winger Alejandro Garnacho and bring in Tel on loan (Independent), external\nTel would prefer a move to Old Trafford over Arsenal, Chelsea and Tottenham and is waiting to see if United's interest is concrete before making a decision. (i Sport), external\nAl-Nassr are planning to make a second and final offer for 27-year-old Brighton and Japan winger Kaoru Mitoma worth £90m. (CBS Sports), external\nArsenal have blocked Scotland left-back Kieran Tierney, 27, from bringing forward a summer move to Celtic. (Telegraph - subscription required), external\nParis St-Germain and Spain forward Marco Asensio, 29, is one of a number of attacking players Aston Villa are interested in signing before the transfer window closes. (Mail), external\nVilla are also considering a bid for Wolves' 25-year-old Brazil striker Matheus Cunha. (Guardian), external\nEngland striker Ollie Watkins would be open to joining Arsenal this month but Villa are determined to keep the 29-year-old. (Mail), external\nChelsea and Portugal midfielder Joao Felix, 25, is another target for Villa boss Unai Emery. (Express), external\nAl-Hilal have made a \"super offer\" for Real Madrid and Brazil winger Rodrygo, 24, as a replacement for 32-year-old Brazil attacker Neymar. (Marca) , external\nMonaco are close to agreeing a deal with Ajax for 34-year-old England midfielder Jordan Henderson. (Fabrizio Romano), external\nThe Ligue 1 side are reluctant to pay a fee for Henderson so want Ajax to terminate his contract so they can sign him on a free transfer. (Telegraph - subscription required), external\nEverton are weighing up a late bid for 20-year-old Brighton and Republic of Ireland striker Evan Ferguson. (i Sport), external\nChelsea are interested in Borussia Dortmund and Switzerland goalkeeper Gregor Kobel, 27, although any move is likelier in the summer. (Independent), external\nNewcastle have held talks with 18-year-old Spain Under-19 winger Antonio Cordero over a free transfer when his Malaga contract expires this summer. (Mail), external", "url": "https://www.bbc.com/sport/football/articles/c0e4dn1z713o"}