{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:33:58", "date_modify": "2025-05-20 12:33:58", "date_publish": "2023-08-04 09:17:44", "description": "Newcastle Falcons have signed hooker Michael van Vuuren on a one-year deal.", "filename": "sport_rugby-union_66404198_1747744438.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/023E/production/_130647500_gettyimages-1354437066.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-union_66404198_1747744438.html", "title": "Michael van Vuuren: Newcastle Falcons sign ex-Wasps, Bath & Leicester Tigers hooker", "title_page": "Michael van Vuuren: Newcastle Falcons sign ex-Wasps, Bath & Leicester Tigers hooker - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Newcastle Falcons have signed hooker Michael van Vuuren, who most recently played for Golden Lions in the United Rugby Championship, on a one-year deal.\nThe South Africa-born 31-year-old, who is English-qualified, has previous Premiership experience with Wasps, Bath, Northampton and Leicester.\nVan Vuuren also had a spell with French Top 14 side Stade Francais and played for Cheetahs and Kings in South Africa.\n\"He brings a lot of experience,\" head coach Alex Codling said.\n\"He's one of those players who helps glue a team together, and his set-piece work is really strong.\n\"He has a deep knowledge and passion around that area of the game and he's also played a lot of Premiership rugby, so he knows the competition and how things work.\"\nVan Vuuren and Codling worked together previously at Championship side Ealing.\n\"Codders is a tough coach but he'll get the best out of the boys, and I know a few of them from my time at Wasps,\" he said.\n\"It's going to be good to link up with them and to experience Newcastle, because I've only heard good things about the city and the club.\"", "url": "https://www.bbc.com/sport/rugby-union/66404198"}