{"authors": ["Peter Scrivener", "www.facebook.com"], "date_download": "2025-05-21 04:19:38", "date_modify": "2025-05-21 04:19:38", "date_publish": "2025-01-15 06:42:00", "description": "Tiger Woods says his Jupiter Links team would have not broken 100 after suffering a heavy defeat in their opening match of the indoor Tomorrow's Golf League.", "filename": "sport_golf_articles_c79d1w291v8o_1747801178.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4ef8/live/66b92220-d32e-11ef-87df-d575b9a434a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_golf_articles_c79d1w291v8o_1747801178.html", "title": "Tiger Woods makes TGL debut as Jupiter thrashed by Los Angeles", "title_page": "Tiger Woods makes TGL debut as Jupiter thrashed by Los Angeles - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "\"I'm not sure we'll break 100 shots\" was Tiger Woods' verdict of his team's woeful display on his Tomorrow's Golf League debut in Florida.\nTwo hours earlier the 15-time major champion bounded into the purpose-built arena - to the sound of the Survivor classic Eye of the Tiger - with a huge grin on his face, declaring he was there to \"have fun\".\nDespite his Jupiter Links team suffering a 12-1 defeat by Los Angeles, he said he was \"still hurting from laughing so hard\".\nThere were certainly more farcical scenes at the Sofi Center than in the opening week, with Woods, Max Homa and Kevin Kisner bordering on being the class clowns, frequently forgetting their score and hitting careless shots.\nBut then, that's perhaps part of the charm. This is, after all, a made-for-TV entertainment show that Woods says is designed to \"showcase golf and grow the game\".\n\"We hit six penalty areas, I had two shots out of a bunker and Kis nearly killed someone,\" said Woods of his team's efforts over the 15 holes.\nWoods' 15-year-old son Charlie was among the 1,500 or so fans in the stands surrounding the football pitch-size playing arena and, according to Homa, the teenager's succinct summation was \"we're not very good\".\nTGL is a technology-led indoor golf league developed by Woods and Rory McIlroy.\nSix teams will compete against each other in a round-robin format over the coming weeks, leading to semi-finals and a best-of-three final in late March.\nEach week two teams of three players compete against each other over 15 holes.\nThe opening nine holes feature all three players on each team hitting alternate shots. Tee shots are thudded into a 60ft high simulator screen from a distance of 35 yards, with the action switching to the real life short-game complex once the ball is within 50 yards of the hole. After each hole the short-game area is rotated and a new green is created by the 600 motors below its surface.\nThe final six holes are played head-to-head with each player playing two holes.\nThe scoring is simple. Win a hole, win a point. The team with the most points after 15 holes wins two points in the league. A closest-to-the pin play-off will decide the winner in tied matches.\nThere is also the tactical 'hammer', which can be used by the side in possession to double the points on offer on a hole should they win it.\nWatched by tennis legend Serena Williams, who co-owns the LA team, England's Justin Rose and his American team-mates, Sahith Theegala and former Open champion Collin Morikawa, raced into a 5-0 lead after four holes.\nThe hammer was barely used in the opening week, but Woods threw it down before the first ball had been struck on Tuesday evening and, while the opening hole was halved, LA, who won the second hole, secured double points on holes three and four.\nRose poured in a 10-footer to win the third, while a Woods miss from seven feet on the next handed LA two more points.\nRose was again on target from six feet on the sixth, holing his putt amid a cacophony of good-natured boos from a crowd desperate to see the home team chalk up a first point.\n\"I'm digging it, I'm loving it,\" said Rose after nailing a 12-footer to win the eighth, and LA were 8-1 ahead and cantering after picking up another hammer-inspired two-pointer on the ninth.\nTheegala was similarly impressed after noticing his ball speed of 184mph among the on-screen stats after his tee shot on the ninth. \"I've never hit that in a tournament,\" he said, although the expected insight from having players wear microphones has mainly been limited to laughs and trying to put off the opposition.\nIn an effort to keep the entertainment value high, Spandau Ballet's 'Gold' blared out while former Olympic champion Rose hit a shot. Spotlights frequently scudded around the arena.\nRose took on Woods in the singles but the sporting contest already felt over. Woods, who barely played last year, looked out of touch, particularly on the greens. He three-putted the 10th after hitting a 35ft putt 14ft past the hole.\nAnd Kisner, who was wayward off the tees, said \"how did I make six?\" before conceding the 11th to Morikawa as Jupiter went 9-1 down.\nMorikawa executed an excellent flop shot off the artificial grass, and Rose tried to slam dunk a chip shot straight into the hole from close range as LA showcased their golfing skills, while, with the match lost, Kisner and Homa discussed if they could get relegated for being the worst TGL team.\nKisner then provided the late belly laughs with a high-handicapper mishit out of a bunker on the 14th that crashed into the flagstick and flew across the other side of the green, leading to players and fans ducking for cover. It was bordering on farcical before he almost holed the 50ft return shot.\n\"We honestly didn't think that anyone could get hit in here,\" Woods said. \"That was honestly one of the funniest things I've seen. And then the chip shot, the next one, should have gone in. It was just one of those weird nights.\"\nSport and entertainment in the name of growing the game.", "url": "https://www.bbc.com/sport/golf/articles/c79d1w291v8o"}