{"authors": ["Ben Miller", "www.facebook.com"], "date_download": "2025-05-20 12:59:17", "date_modify": "2025-05-20 12:59:17", "date_publish": "2023-08-02 18:27:56", "description": "South Africa's dramatic progress to the Women's World Cup last 16 is dedicated to the entire country, says Banyana Banyana coach Desiree Ellis.", "filename": "sport_africa_66389908_1747745957.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5782/production/_130620422_gettyimages-1587133868.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_africa_66389908_1747745957.html", "title": "Women's World Cup 2023: South Africa coach Desiree Ellis lauds 'amazing' squad", "title_page": "Women's World Cup 2023: South Africa coach Desiree Ellis lauds 'amazing' squad - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "South Africa were given \"no chance\" before beating Italy 3-2 to reach the last 16 of the Women's World Cup, ecstatic coach Desiree Ellis has said.\nBanyana Banyana claimed their first ever win at the finals through Thembi Kgatlana's stoppage-time winner.\nThe thrilling victory took the world's 54th-ranked team through at the expense of opponents 38 places above them.\n\"It is personal - more so for the players who work so, so hard,\" Ellis said, calling her squad \"amazing\".\nThe decorated former midfielder, who played in South Africa's first ever women's international 30 years ago, added: \"No-one gave us a chance today but we knew what we were capable of.\n\"This is for everyone back home - people getting up in the early hours of the morning when they were all disappointed because we should have won against Argentina.\n\"I said 'I want them to go to work smiling in their cars', because we knew the game took place at 9am.\n\"This is for all the coaches in the league who have played their part, all the coaches and players that have come before, everybody involved in women's football.\"\nHildah Magaia is known as the \"breadwinner\" for her ability to reward South Africa's work with goals, including both in their 2-1 win over hosts Morocco in the final of the 2022 Women's Africa Cup of Nations (Wafcon).\nThe clinical striker lived up to her nickname by putting them 2-1 ahead in Wellington from Kgatlana's assist in the 67th minute, then returned the favour for the decisive goal after Arianna Caruso had set Italy back on course to qualify with her leveller.\n\"Without the breadwinner, there is no bread,\" the 28-year-old said of her second goal at the tournament.\n\"I had to provide the bread for the nation. It really means a lot, especially knowing that we were so close to going home.\"\nAsked about the increase in prize money for reaching the first knockout stage, which gives each player twice as much, Magaia said: \"I'll be able to help my family and do everything for my mother, because I'm the one taking care of her.\"\nEllis praised goalkeeper Kaylin Swart and said South Africa had trained for the possibility of falling behind and discussed pressing Italy only when necessary to conserve energy.\n\"I speak about every challenge they have faced in the past,\" said the 60-year-old.\n\"Just look at Wafcon. The breadwinner came through today.\n\"We knew that we were going to catch them on the counter. We just needed to be solid at the back.\n\"The players ran themselves to a standstill. They ran out of steam in the previous games and the changes we made then didn't give us what we wanted.\n\"When we pressed, we won the ball further up the field. They were magnificent.\"\nMagaia gave South Africa the lead in their opener against Sweden before the world's third-best team recovered to win 2-1.\nThe group underdogs also drew 2-2 with Argentina, having led 2-0 against the 28th-ranked team who have now been eliminated.\n\"We gave everything against Sweden and Argentina but I said we've got to give more,\" reflected Ellis, who passed instructions to adopt a more attacking approach around on a piece of paper with her team's exit looming.\n\"It's about how badly you want this - and they wanted it so, so badly.\n\"At 2-2, we went to three at the back and said 'what's the use of defending now? Let's go for it'.\"\nAnother top-10 ranked team, unbeaten Group E winners the Netherlands, await South Africa in Sydney on Sunday.\n\"It's a knockout match - it's all to play for,\" said Ellis. \"There's no tomorrow - it's on the day.\n\"We'll celebrate, most probably, until the early hours of the morning, because they deserve it.\"", "url": "https://www.bbc.com/sport/africa/66389908"}