{"authors": ["Matthew Henry", "www.facebook.com"], "date_download": "2025-05-20 14:14:02", "date_modify": "2025-05-20 14:14:02", "date_publish": "2023-07-29 17:46:45", "description": "England bowler Stuart Broad says he will retire after the conclusion of the fifth Ashes Test at The Oval.", "filename": "sport_cricket_66350377_1747750442.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/10778/production/_130584476_broadgetty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66350377_1747750442.html", "title": "The Ashes 2023: Stuart Broad to retire after conclusion of series", "title_page": "The Ashes 2023: Stuart Broad to retire after conclusion of series - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England bowler Stuart Broad says he will retire after the conclusion of the fifth Ashes Test at The Oval.\nThe 37-year-old has taken 602 wickets in 167 Tests, making him the second most successful paceman in Test history behind team-mate James Anderson.\nBroad said he made the decision on Friday evening.\n\"It's been a wonderful ride, a huge privilege to wear the Nottinghamshire and the England badge as much as I have,\" he told Sky Sports.\n\"I've been thinking about it for the last few weeks but England v Australia has always been the pinnacle for me.\n\"I've loved the battles I've had with Australia. I've got a love affair with Ashes cricket and I think I wanted my last bat and bowl to be in Ashes cricket.\"\nEngland reached 389-9 on day three of the series finale, leading by 377, with Broad batting late in the evening.\nIf they complete victory over the final two days, they will draw the series 2-2, denying Australia a first Ashes win in England since 2001.\nBroad has taken 20 wickets in the series, the most by an England player, and has admitted his own surprise at being fit to play in all five Tests which have been played in just six weeks.\nHe has been one of England's great performers in Ashes cricket, taking a record 151 Test wickets against Australia.\n\"I'm loving cricket as much as I ever have,\" Broad said.\n\"It's been such a wonderful series to be a part of and I've always wanted to finish it at the top.\n\"This series feels like one of the most enjoyable and entertaining I've been a part of.\"\nBroad made his debut against Sri Lanka in December 2007. Last week, during the fourth Ashes Test in Manchester, he became just the second pace bowler after Anderson to take 600 Test wickets.\nHe and Anderson, who has ignored calls to retire himself, are the most successful bowling partnership in Test history.\n\"He just said 'are you joking?',\" Broad told BBC Test Match Special, after being asked when he gave Anderson the news.\n\"We then had a hug. It is always hard.\n\"When I spoke to Jimmy, I got a bit emotional. But ultimately we have a game to win here. We can do the reminiscing afterwards if we get the job done.\"\nAfter defeat in the 2021-22 Ashes series in Australia, Broad and Anderson were dropped for a tour of West Indies in the spring of last year but were then recalled when captain Ben Stokes and coach Brendon McCullum took over.\n\"I told Stokesy [England captain Ben Stokes] last night and told the changing room this morning and to be honest, it felt the right time,\" Broad said.\n\"I have thought a lot about it and even up until 8 o'clock last night I was - I wasn't 50/50 - but I was a little bit unsure.\n\"But once I went to Stokesy's room and told him I felt really happy.\n\"I feel really content with everything I have achieved in the game and ultimately the decision came down to I knew I wanted to leave the game loving cricket and my last memories being a really enjoyable changing room.\"\nSpeaking on Test Match Special, Sir Alastair Cook, Broad's former England captain, paid tribute to the bowler's ability to perform on the biggest stage.\n\"I'm a bit emotional,\" said Cook, who played 123 times with Broad in Tests.\n\"You always get questioned about heart and whether you're good enough in big moments.\n\"The one player to deliver, alongside Ben Stokes, in the big moments is Stuart Broad. And what a feeling that must be for a player.\"\nMichael Vaughan was England captain when Broad made his debut.\nHe said: \"I have nothing but a huge amount of respect.\n\"I remember when he first came into the England side, he was just different. He wanted to captain himself, thinking about the game all of the time.\n\"If there has been a bit of niggle or a hot moment in the game, it has always been when Stuart has been around. He has been fantastic for the England side.\"\nRichard Gould, chief executive of the England and Wales Cricket Board, paid tribute to Broad, calling him \"quite simply one of England's all-time greats\".", "url": "https://www.bbc.com/sport/cricket/66350377"}