{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:48:43", "date_modify": "2025-04-26 03:48:43", "date_publish": "2025-03-05 14:29:06", "description": "Arsenal news: Thierry Henry backs Gunners for Champions League glory", "filename": "sport_football_articles_c62zg4n732go_1745639323.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/84f4/live/78c001d0-f9b9-11ef-9509-b3ecaa172155.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c62zg4n732go_1745639323.html", "title": "Arsenal news: Thierry Henry backs Gunners for Champions League glory", "title_page": "Arsenal news: Thierry Henry backs Gunners for Champions League glory - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Arsenal legend Thierry Henry believes his former club can win the Champions League this season.\nDespite being hampered with injuries, the Gunners beat PSV Eindhoven 7-1 in the first leg of their last-16 tie on Tuesday.\n\"Yes, they can [win the Champions League],\" he said. \"I do believe that, this is why I called it.\n\"I'm just saying now, show us that you can do that against a good team, with people that are coming back.\n\"No disrespect to Eindhoven, I really thought it was going to be difficult, especially away from home - but they made it look easy. I think they had an outstanding game.\"\nWith Mikel Arteta's side all but confirming their progression to the quarter-finals, Henry says the Gunners will take confidence from Tuesday's performance in the Netherlands into their last-eight match against either Real Madrid or Atletico Madrid.\n\"We all know the Premier League is over, apart from if something crazy happens,\" he added.\n\"This game can help them maybe to be confident in this competition and the game that you have after - Real Madrid or Atletico.\n\"The path to the final can at times help or not, but if you want to win the competition you have to go through these teams.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c62zg4n732go"}