{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:31:47", "date_modify": "2025-04-26 07:31:47", "date_publish": "2025-02-27 16:59:15", "description": "Paul O'Connell praises the longevity of retiring Ireland stalwarts Peter O'Mahony, Cian Healy and Conor Murray.", "filename": "sport_rugby-union_articles_cly3362lkxgo_1745652707.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/23b1/live/b22b5d80-f52b-11ef-9621-af4ff1a2bf4c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_cly3362lkxgo_1745652707.html", "title": "Ireland rugby: Paul O'Connell praises retiring Peter O'Mahony, Cian Healy and Conor Murray", "title_page": "Ireland rugby: Paul O'Connell praises retiring Peter O'Mahony, Cian Healy and Conor Murray - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Paul O'Connell has praised the longevity of retiring Ireland stalwarts Peter O'Mahony, Cian Healy and Conor Murray.\nOn Thursday, the three Test centurions confirmed they will bring the curtain down on their international careers at the end of this year's Six Nations.\nO'Connell said their ability to remain at the highest level has been \"amazing\".\n\"To stay as important to the teams they play in for as long as they have is probably the big thing,\" said the forwards coach, who played alongside all three with Ireland.\n\"Some guys fade away, those guys have got better and better and more important in some ways. You just can't beat experience sometimes. To have seen the picture so many times makes you better with what unfolds in front of you. Those guys are particularly good at it.\n\"So the caps they've accumulated, big games, big moments, they've come back from injuries, they've come back from setbacks with their provinces and with Ireland and they're a great example to the rest of the team.\"\nAll three players have won five Six Nations titles with Ireland with O'Mahony captaining the team to last year's championship triumph.\nHealy is Ireland's most-capped player with 136 while Murray is tied fourth with Rory Best on 124 and is a three-time British and Irish Lions tourist.\nO'Connell added: \"As an ex-player even it's nice to see that they love it maybe as much as you did as well, so it makes you believe that you're kind of right that you felt this team was really important. So it's been incredible.\n\"They're a great example to the young players. They get on great with guys from all across the provinces, that's the nice thing about them as well. Some of them, their best mates in the team are probably from other provinces.\n\"It's a great example for when other players come into the squad.\"", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/cly3362lkxgo"}