{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:07:32", "date_modify": "2025-05-20 14:07:32", "date_publish": "2023-07-30 16:18:19", "description": "Man Utd and West Ham: Harry Maguire 'should' move but expect a 'saga'", "filename": "sport_articles_cx8yyn51r4po_1747750052.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7cc1/live/270d7cb0-2ef3-11ee-999b-b74dedc428d3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cx8yyn51r4po_1747750052.html", "title": "Maguire 'should' move but expect a 'saga'", "title_page": "Man Utd and West Ham: Harry Maguire 'should' move but expect a 'saga' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Scotland and Aston Villa captain Rachel Corsie speaking on Football Daily about Harry Maguire's Manchester United future and West Ham's rejected offer for him: \"It's a difficult situation and complex for many reasons.\n\"There's a financial part. Players want to stay on a salary and to take a pay cut will be difficult. To leave a club like Manchester United - even though for the last while they probably haven't been at where they were in the past.\n\"For me he has had a really tough time. He is a top defender. He has been under incredible scrutiny. He has been criticised more than most players are. But equally that is back to that connection in that he moved for so much money, there was so much expectation. I think that became overwhelming.\n\"Every mistake seemed to be pinned on him. I think he should look for a new opportunity. I think something fresh will be really good for him. But equally I know as a player the fear of change is also something legitimate too. There are lots of feelings that come with that. So it is complex.\n\"I think it is something that will become a saga for some weeks too.\"\nFormer England and Liverpool striker Natasha Dowie: \"He needs to play. His England spot is under threat if he doesn't get the minutes. He is probably fourth choice centre-back for Manchester United. I don't see him getting much game time. So for me has has to be looking elsewhere. You want to be playing football. But it's a sticky situation as United will want to do a good deal and good business.\"", "url": "https://www.bbc.com/sport/articles/cx8yyn51r4po"}