{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:52:18", "date_modify": "2025-05-21 03:52:18", "date_publish": "2025-04-07 10:04:01", "description": "Leicestershire head coach Alfonso Thomas says he has 16 or 17 players puttin their hands up for selection after a convincing win against Glamorgan on the opening week of the County Championship", "filename": "sport_cricket_articles_c3dk8v872kxo_1747799538.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9e65/live/3e636990-1396-11f0-b054-11b99aeb4b3e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c3dk8v872kxo_1747799538.html", "title": "Leicestershire: Alfonso Thomas 'over the moon' with squad depth", "title_page": "Leicestershire: Alfonso Thomas 'over the moon' with squad depth  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Leicestershire head coach Alfonso Thomas has praised his squad's strength in depth after a convincing opening week County Championship victory against Glamorgan.\nThe Foxes lost opening batter Rishi Patel to a thumb injury in the third over of the match in Cardiff, with main strike bowler Chris Wright also set to miss the second game of the season against Derbyshire.\nWright was limited to just 9.5 overs in Glamorgan's second innings but they still went on to win by 10 wickets, in a result Thomas described as \"really satisfying\".\n\"There's depth, there's competition for places,\" the former Somerset and Hampshire bowler told BBC Radio Leicester.\n\"We know that to be able to be competitive over a County Championship season, you will need 16 or 17 guys to put their hands up.\n\"We lost our opening batter in the third over, on the first day of the first day of the season, which is not ideal.\n\"I had three or four guys put their hand up to open, and to bat number three. As a whole, I'm over the moon with it, it was a fantastic squad effort.\"", "url": "https://www.bbc.com/sport/cricket/articles/c3dk8v872kxo"}