{"authors": ["Kieran Fox", "www.facebook.com"], "date_download": "2025-05-21 05:26:33", "date_modify": "2025-05-21 05:26:33", "date_publish": "2025-04-03 11:30:12", "description": "Worcester Warriors are set to return to professional rugby union two and a half years after the club went into administration.", "filename": "sport_rugby-union_articles_c62gjv9rg29o_1747805193.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9d82/live/ed4892a0-1080-11f0-8513-e5a67661a7e5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c62gjv9rg29o_1747805193.html", "title": "Worcester Warriors set for Championship return", "title_page": "Worcester Warriors set for Championship return - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Worcester Warriors are set to return to professional rugby union two and a half years after the club went into administration.\nThe Midlands-based outfit will be part of a new expanded 14-team Championship next season, after passing an RFU-led tender process to enter the division.\nThe RFU's Tier 2 Board agreed that the former Premiership club can compete in the 2025-26 season at its Sixways Stadium, subject to paying back its creditors.\nJunction 6 Limited, which assumed control of the Warriors last year, announced plans to increase capacity at Sixways, alongside a new hotel, multi-storey car park, a golf driving range and a solar farm.\nNew chairman and owner Christopher Holland said they have \"made significant progress in stabilising the Sixways business as well as successfully navigating the detailed and demanding application process for entry of the club into the second tier of professional rugby in England\".\nWarriors were suspended from all competitions in September 2022 over unpaid tax of about £6m. Players and staff had their contracts terminated and the organisation's men's team has not competed since.\nIn the space of a year fellow Premiership clubs Wasps and London Irish also went out of business, before Championship title-holders Jersey Reds also ceased\nLast year the RFU's Tier 2 Board ran an open tender process to the whole game for any club, college or university to join the Championship - the level below the Premiership - for the 2025-26 season if they could meet the league's minimum operating standards and growth strategy.\nWorcester were admitted on a majority decision, but the Tier 2 Board said Wasps and London Irish were not in a position at the end of last year to meet the minimum criteria.\nApproval means Worcester will be admitted alongside the winners of the National League 1 division, currently being led by Richmond.\nRichmond were the first professional club in England after the game went open in 1995 but when they went bust in 1999, they were relegated to the bottom of the league pyramid and have worked their way up since.\nWarriors owner Holland said: \"Had we opted to restart at the bottom of the rugby pyramid, as others have before us, the obligation to settle rugby creditors would have been removed.\n\"After careful consideration we chose to make the application to the new league under the name Worcester Warriors, a club founded in 1871, to preserve its history and legacy.\n\"As a result, even though we applied as a new non-league entrant, we are required to settle rugby creditors as defined by the RFU Regulation 5. We acknowledge and fully own this process and the responsibility that comes with it.\n\"We have taken full responsibility for addressing these inherited obligations.\"\nBusinessman Holland also owns the intellectual property for Wasps where he was a non-executive director. Should they return to the league structure he would have to relinquish ownership of one club.\nIt is understood the Warriors have been putting people and processes in place in order to be ready for the start of next season in the Championship.\nThursday's announcement comes one week after RFU chief executive Bill Sweeney survived a vote of no confidence at a special general meeting.\nThe meeting was called in part by vociferous Championship clubs who have been unhappy at funding cuts from the game's organising body in England.\nIn a statement, Simon Gillham, Tier 2 Board chairman, said there was \"still a great deal still to achieve\".\nHe added: \"The vision for this league is really ambitious and so much work and collaboration has taken place over nearly two years to establish a path towards a vibrant and self-sustaining competition.\n\"Today marks a significant step forward with Worcester Warriors returning to professional rugby under new ownership in a heartland for our sport, with the club's new owners having provided a financial security guarantee, held by the RFU, as well as committing to paying off debts left by the previous owners to rugby creditors.\"\nPlans for the Championship's full competition structure are still to be announced.\nWith no relegation from the Championship into National League 1 this season, it means only two teams, instead of the usual three, will be relegated from National 1.", "url": "https://www.bbc.com/sport/rugby-union/articles/c62gjv9rg29o"}