{"authors": ["Jordan Chamberlain", "www.facebook.com"], "date_download": "2025-05-21 03:48:09", "date_modify": "2025-05-21 03:48:09", "date_publish": "2025-04-07 12:31:56", "description": "Liverpool news: Opinion - Fan writer on how the absence of Trent Alexander-Arnold's 'has stifled' Mohamed Salah", "filename": "sport_football_articles_c7vnz500ep1o_1747799289.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2b81/live/3beedc30-b62c-11ee-8f07-bbfdfa890097.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c7vnz500ep1o_1747799289.html", "title": "Opinion - Fan writer on how the absence of Trent Alexander-Arnold's 'has stifled' Mohamed Salah - BBC Sport", "title_page": "Liverpool news: Opinion - Fan writer on how the absence of Trent Alexander-Arnold's 'has stifled' Mohamed Salah - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We are starting to get a taste of what life will be like next season without Trent Alexander-Arnold if he leaves Liverpool - and the player it affects most is Mohamed Salah.\nWithout the world-class right-back, who has been injured for a month now, Salah has fallen off a cliff - failing to score or assist five times on the trot.\nTrent feeds Salah constantly. His passing range is arguably the best in Europe, but Trent's replacements cannot find the Egyptian inside or outside of the box. As a result, Salah has barely had a kick in weeks and the team are struggling without his offensive input.\nHe was on track for the best Premier League season of all time in terms of goals or assists, but it does not look like he will break the records now.\nSalah regularly finishes seasons worse than he starts them, but this drop-off has been considerable. Liverpool were poor against Fulham and deserved to lose. In truth, we have not played well since the 2-0 victory over Newcastle United on 26 February, and that was six games ago.\nTrent's absence has stifled our best player, but Salah will likely not have Trent in the side at all next season.\nCan Liverpool's recruitment team secure a right-back who can fill Trent's void and get Salah ticking again for next term?\nIt's a huge question.", "url": "https://www.bbc.com/sport/football/articles/c7vnz500ep1o"}