{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:49:28", "date_modify": "2025-05-21 05:49:28", "date_publish": "2025-04-02 10:56:22", "description": "Exeter cut their pre-tax loses by more than £2.5m according to the Premiership club's latest accounts.", "filename": "sport_rugby-union_articles_czrv73knn7mo_1747806568.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/58e7/live/e8d59b70-0fac-11f0-9f4f-1b858dcfe51a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_czrv73knn7mo_1747806568.html", "title": "Exeter Chiefs cut losses by more than £2.5m", "title_page": "Exeter Chiefs cut losses by more than £2.5m - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Exeter have cut their pre-tax loses by more than £2.5m according to the Premiership club's latest accounts.\nFigures submitted to Companies House show in the year to 30 June 2024 the Sandy Park club lost £458,744, having lost £2,982,503 in the previous 12-month period.\nAs well as cutting £1.2m off their wage bill, the accounts show the club sold another stake in a hotel on club grounds to chairman Tony Rowe.\n\"This generated an additional cash inflow to the group and reduced the group's shareholding in Sandy Park Hotel Limited to 24%,\" the accounts reveal.\nExeter say they may need to sell the rest of their stake in the hotel to balance the books should current attendances continue to be lower than expected.\nThis season has been Exeter's worst on the field since they were promoted to the top flight - they have won just three Premiership matches all season and lost all of their European Champions Cup matches.\nThey did make the Premiership Rugby Cup final but were well beaten by Bath.\nExeter say there is still uncertainty over the repayment of loans given to the club from the Department of Culture, Media and Sport during the Covid-19 pandemic.", "url": "https://www.bbc.com/sport/rugby-union/articles/czrv73knn7mo"}