{"authors": ["Mike Henson", "www.facebook.com"], "date_download": "2025-05-21 05:53:43", "date_modify": "2025-05-21 05:53:43", "date_publish": "2025-02-08 18:57:26", "description": "England strike in the 79th-minute to win a roller-coaster Six Nations encounter against France at Allianz Stadium.", "filename": "sport_rugby-union_articles_c14nyg1zjp2o_1747806823.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b9e5/live/22ae97c0-e659-11ef-bd1b-d536627785f2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c14nyg1zjp2o_1747806823.html", "title": "England 26-25 France: Late Elliot Daly try seals Six Nations win", "title_page": "England 26-25 France: Late Elliot Daly try seals Six Nations win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England snatched a dramatic victory over Six Nations favourites France as Elliot Daly glided in for decisive 79th-minute try at a rapturous Allianz Stadium.\nFin Smith, making his first start at fly-half, held his nerve with the conversion and, with their last-play defeat by Australia in the autumn still fresh in the memory, his team secured France's restart and, with it, victory.\nIt was a fitting conclusion to a frantic, scrappy slugfest, which featured plenty of mistakes, but no shortage of drama.\nThe lead swapped hands three times in the final 10 minutes as replacement prop Fin Baxter's try gave England a narrow lead, only for France wing Louis Bielle-Biarrey to dance in and seemingly deny the hosts.\nBut England summoned the knockout blow on the penultimate passage of play as Fin Smith's pop pass put Daly into a hole and the replacement held off a despairing Antoine Dupont to go in.\nAfter an opening-round loss to defending champions Ireland, defeat would have surely sunk any hopes England had of contending for the title.\nInstead they head into a meeting with Scotland in a fortnight's time with a chance to reclaim the Calcutta Cup - and will head into the latter stages of the tournament with aspirations intact of taking the crown for the first time since 2020.\nIn contrast to a frenetic finale, the scoreboard remained blank for an opening 29 minutes most notable for French mistakes.\nThe visitors enjoyed most of the ball, but also made a rash of handling errors in the London drizzle.\nWings Bielle-Biarrey and Damian Penaud both knocked on in good positions, with Dupont spilling a Thomas Ramos pass as the line beckoned, much to the delight of the home fans.\nEngland returned pointless from their one incursion into the France 22 as Yoram Moefana twice repelled Ollie Lawrence on the gainline.\nFin Smith had been promoted to fly-half to grease England's attack but, perhaps unsurprisingly, there were some stutters, with a couple of tame grubbers handing back scarce England possession.\nFrance finally made an attack stick as Dupont scampered across the pitch, went against the flow of England's cover defence with a smart inside ball to Penaud and the wing 's deft nudge found Bordeaux-Begles team-mate Bielle-Biarrey for the try.\nFrance, who won 53-10 on their last visit to Twickenham two years ago, couldn't accelerate away though.\nInstead England bounced back. Lawrence swatted aside Ramos to go in under the posts off some scrappy ball six minutes later.\nMarcus Smith, whose wriggling break had set up the spell of pressure, duly clipped over the conversion for parity.\nEngland have been in such positions before.\nThey led Ireland by five at the break last weekend. They were within two of New Zealand, Australia and South Africa in the autumn. On each occasion, they ended up empty-handed.\nThis time, however, they crowbarred their way to victory.\nFrance's wastefulness continued as Bielle-Biarrey, under pressure from Ollie Sleightholme, butchered an outstanding opening; his loose basketball pass failed to find Peato Mauvaka after he had ripped the ball free of Marcus Smith and hurtled down the touchline.\nRamos' boot instead landed two penalties to push France's lead out to 13-7.\nEngland resolutely kept in the fight. Fin Smith's punted chip into the corner was snaffled by Northampton team-mate Freeman over the shorter Bielle-Biarrey just before the hour - the first of five tries in 20 enthralling final minutes.\nFrance countered quickly with an overload of pace out wide giving Henry Slade too much ground to cover as Bielle-Biarrey put Penaud into the corner and France 18-12 up.\nMarcus Smith was a constant danger with ball in hand, but endured two difficult moments as he fluffed a presentable penalty shot and knocked on an attempted flick pass on the French line.\nBut Harlequins team-mate Baxter bashed through from close range to move England a point clear with 10 to go.\nBielle-Biarrey looked to have inflicted another gut-punch late defeat on England, but, with his under-scrutiny replacements coming up trumps, head coach Steve Borthwick could finally revel in a famous win, complete with bonus point, after six defeats in their past seven games.\nFormer England scrum-half Matt Dawson on Radio 5 Live: \"England needed it. They needed the big win. Nobody saw this coming.\n\"We have got to be honest, that first half England were lucky as France had so many opportunities. But you have got to make the most of your opportunities and England did that.\n\"England looked threatening, they looked dangerous, but my goodness did they have to work for it.\n\"We saw unbelievable character and fight from this England side.\n\"It was a vintage performance.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/c14nyg1zjp2o"}