{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:56:28", "date_modify": "2025-04-26 03:56:28", "date_publish": "2025-03-04 15:09:18", "description": "PSG v Liverpool: 'We must have the ball more' - Enrique", "filename": "sport_football_articles_cvgwnprywyzo_1745639788.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8fea/live/f6b607f0-f8f7-11ef-ad98-31dd620eac72.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cvgwnprywyzo_1745639788.html", "title": "PSG v Liverpool: 'We must have the ball more'", "title_page": "PSG v Liverpool: 'We must have the ball more' - Enrique - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Paris St-Germain boss Luis Enrique has stressed his team \"must have the ball\" more than Liverpool if they are to emerge from Wednesday's Champions League round of 16 first leg with a positive result.\nThe French Champions are in great form, scoring 21 goals in their past four games and sitting 13 points clear at the top of Ligue 1.\n\"There are some differences between the two teams,\" Enrique said in his pre-match news conference. \"Liverpool want to attack, but we need the ball.\n\"They maybe don't need the ball as much to impose their game. Each manager tries to do his best.\n\"We must have the ball more than them and generate more chances and defend effectively, the same as in all the other matches.\n\"We're going to try to keep the ball and not suffer too much on the transitions. If we manage to impose our style of play, we'll manage not to suffer too much.\"\nThe Reds themselves arrive at the Parc des Princes in good form and know bringing a positive result back to Anfield will give them a strong platform for progression. However, Enrique does not believe the first leg will be decisive.\n\"The first match, I don't think it will define who will qualify but it's true that it's a very, very important match for us,\" he added.\n\"It's difficult for our opponents to play at the Parc with the pressure and the atmosphere. It's extraordinary.\n\"We are a collective, sometimes it is the substitutes who are the most important. Tomorrow, I could play four or five players and we would not see the difference. That is what makes us stronger. Everyone will have their role.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cvgwnprywyzo"}