{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:27:59", "date_modify": "2025-05-21 06:27:59", "date_publish": "2025-01-04 15:19:03", "description": "Celtic: St Mirren game a chance to 'rectify' Rangers loss - McGregor", "filename": "sport_articles_c7ve4p2n3dno_1747808879.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1086/live/22ea85d0-caae-11ef-8fb8-75874e244aea.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c7ve4p2n3dno_1747808879.html", "title": "St Mirren game a chance to 'rectify' Rangers loss - McGregor", "title_page": "Celtic: St Mirren game a chance to 'rectify' Rangers loss - McGregor - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Celtic captain Callum McGregor believes Sunday's Scottish Premiership match against St Mirren is the perfect time to \"rectify\" their surprise Old Firm derby defeat by Rangers.\nThe league champions suffered their first defeat at Ibrox since May 2023, but are still 11 points clear at the top of the league.\nMcGregor says the result was a wake-up call for Celtic before the visit of the Buddies.\n\"It just shows you that if you're not competitive in the game then it can happen,\" he said. \"I think over the piece we've been so good in these games that maybe everyone's a bit like, 'oh, what happened there?'\n\"It's probably a testament to how well we've done and how much we've managed to go there and get results and play well.\n\"So, it's just a reminder that if you're not quite on the money then these games are tough and you can lose them and then the pressure starts to build so it's important that we reflect on the game and then we get it out of our system come Sunday.\n\"We just need to reset and go again. That's the good thing. There's a game in a few days so we can try and rectify it.\n\"Obviously, it is a different opponent and everything else, but you can try and get it out of your system.\n\"There's a lot of football in January, so just get that performance, get the high energy and just tick them off one at a time.\"", "url": "https://www.bbc.com/sport/articles/c7ve4p2n3dno"}