{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:47:26", "date_modify": "2025-05-21 06:47:26", "date_publish": "2024-12-24 00:00:00", "description": "All the latest football news and Premier League news conferences with Ange Postecoglou, Pep Guardiola and Enzo Maresca speaking to the media.", "filename": "sport_football_live_c4gp91483zet_1747810046.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c4gp91483zet_1747810046.html", "title": "Premier League news conferences, team news and build-up", "title_page": "Premier League news conferences, team news and build-up - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Goodbye!\nThank you for joining us today. We hope if you're travelling home, that your journey is comfortable and trouble-free. And if you're already where you need to be, then we hope you have a very happy and merry holiday season.\nWe will be back on Boxing Day for the traditional feast of football, from up and down the nation.\nUntil then, Merry Christmas!\nTake our advent calendar quiz\nFancy flexing your trivia muscles? See if you can get the correct answer on our Premier League advent calendar quiz.\nCheck out the latest one here.\nP.S. Both Charlotte and Emma got this right, and therefore get their Christmas bonus.\n'Sir Alex' documentary coming on Boxing Day\nBBC iPlayer\nFor all of you Man Utd supporters out there or just fans of Sir Alex Ferguson, BBC Sport have something very special coming your way on Boxing Day.\nA new documentary called 'Sir Alex' will hit BBC iPlayer and it will take a look at Britain's most decorated football manager.\nAs a preview, you can have a read about the time the former United boss' hairdryer treatment made Cristiano Ronaldo cry.\nBoxing Day 2023 recap\nDoes anyone else struggle to remember what happened on Boxing Day in the Premier League last year?\nLet's take a look...\nA Chris Wood hat-trick against his former club gave Nottingham Forest a 3-1 win at Newcastle.\nLuton produced a stunning comeback to beat Sheffield United 3-2 at Bramall Lane.\nBournemouth put three past Fulham on the south coast in a 3-0 win.\nDarwin Nunez and Diogo Jota found the net as Liverpool won 2-0 at Burnley.\nMan Utd came from 2-0 down to take all three points against Aston Villa at Old Trafford.\nWhat's in store for us this year?\nWouldn't mind something like this again!\nI'm sure you've all seen Boxing Day results from 1963 because who hasn't?! That being said, we're going to take a look once more because it is Christmas after all!\nBlackpool 1-5 Chelsea\nBurnley 6-1 Manchester United\nFulham 10-1 Ipswich\nLeicester 2-0 Everton\nLiverpool 6-1 Stoke\nNottingham Forest 3-3 Sheffield United\nSheffield Wednesday 3-0 Bolton\nWest Brom 4-4 Tottenham\nWest Ham 2-8 Blackburn Rovers\nWolves 3-3 Aston Villa\nLet's hope we get close to 66 goals across 10 games this year!\nIwobi plays Santa with his Christmas shop\nFulham\nAlex Iwobi has been spreading festive cheer in east London by opening up his own temporary shop.\nThe Fulham and Nigeria star has been giving out free food, including turkeys, to local residents struggling to pay for their Christmas dinner.\nBBC Sport went along to Alexpress to see Iwobi in action behind the till.\nFootballers at Christmas\nClinton Morrison\nFormer Republic of Ireland striker on BBC Radio 5 Live's Monday Night Club\nWhat I didn't like was an away game on Boxing Day. You would train in the morning, go and have Christmas dinner with your family then travel in the night. But you have to accept it, you are a professional footballer so you have to leave your family to do that.\nI used to love the home games, meeting in the morning. I liked playing on Boxing Day, and now I'm a pundit I love it even more. And I would never get booked to miss it!\nListen to the Monday Night Club here.\nDo footballers train on Christmas Day?\nThe festive period in England is littered with football and that means that footballers do have to train on Christmas Day.\nYou'll see many a picture of a player wearing a Santa hat or some footage released by clubs enjoying some Christmas fun.\n\"When you have your kids there playing with their new toys and you have to go training, that is a big sacrifice. It's not about money - it's just human nature,\" former Sheffield United, Tottenham and Fulham midfielder Michael Brown told the BBC.\nHaaland's return - FPL tips & team of the week\nThomas Woods\nBBC Sport senior journalist\nIt looks very much like there will be a Boxing Day bonanza for Fantasy Premier League players, with the top three all at home including Liverpool against a leaky Leicester City side.\nStruggling champions Manchester City also have what would, in normal times, be a plum home game for them against Everton.\nHowever, it is also prime rotation season so who, aside from the obvious big names, should you target this week?\nBukayo Saka's injury at least makes picking between premium assets a touch easier.\nYou can find our tips and hints here.\n'It's another big challenge for us'\nChelsea v Fulham (Thurs, 15:00 GMT)\nFulham\nFulham boss Marco Silva on Enzo Maresca's Chelsea: \"Very, very good. It is quite clear there. A football club that has spent money in such a short period of time, the quality was there. For young players, it's not easy to find a club with so many young players performing. They are very good and very confident to play in that system. They have been dominant in most of their games. It's another big challenge for us.\"\n'We need to keep assessing them'\nChelsea v Fulham (Thurs, 15:00 GMT)\nFulham\nFulham boss Marco Silva on team news: \"Too early to be sure about some players. We need to keep assessing them. The games come thick and fast. Less time to recover between games. We will take a decision for Boxing Day's match.\"\nOn Emile Smith Rowe: \"He got a big knock on his ankle so let's see and we will make a decision.\"\nBarry-Murphy to join Foxes\nLiverpool v Leicester (Thurs, 20:00 GMT)\nNick Mashiter\nBBC Sport football news reporter\nBrian Barry-Murphy is due to be appointed Leicester's new first team coach under Ruud Van Nistelrooy.\nThe former head coach of Manchester City's elite development squad is available after leaving the club in the summer.\nEx-Sheffield Wednesday midfielder Barry-Murphy, who also managed Rochdale, is expected to link up with the Foxes once the move is finalised, with the deal not yet signed.\nVan Nistelrooy said: \"It's not official yet but I can confirm, 99.9 per cent is done on the contracts. I'm very happy to add him to the coaching team.\n\"It's a very important factor in the translation of the game model to the training pitch, developing the team, the unit and individual to the max.\n\"He is excellent in that and I'm very happy to add him to the team.\"\n'We did not defend the box well enough'\nBournemouth v Crystal Palace (Thurs, 15:00 GMT)\nCrystal Palace\nCrystal Palace boss Oliver Galsner reflects on the 5-1 loss to Arsenal: \"We trained today on what we think we have to improve. We prepare like we always do. It's box defending, not about the whole defence. We defended the box not good enough. [Their] players had three yards of space.\"\n'It's important to stay stable'\nLiverpool v Leicester (Thurs, 20:00 GMT)\nNick Mashiter\nBBC Sport football news reporter\nLeicester go to Liverpool on Boxing Day after Sunday's 3-0 defeat to Wolves saw them miss the chance to go eight points clear of their relegation rivals.\nWolves, who occupy the final relegation spot, now just just two points behind the 17th placed Foxes.\nBut Ruud Van Nistelrooy has refused to create a drama around the defeat.\n\"If you are going to evaluate it into a drama or success that's not the way to work as professionals,\" he said. \"It will be highlighted in the media and fans reacting, it's the world we live in.\n\"We know we're here for the long run and we know the end of the season is the finish line where we have to be in a position to stay in the league.\n\"I'm not going to create a drama every week or celebrate a win every week. Whatever occurs it's important to stay stable.\"\n'I don't care about Christmas'\nWolves v Manchester United (Thu, 17.30 GMT)\nManchester United\nManchester United manager Ruben Amorim on the Premier League's Christmas schedule: \"I just want to win. I don't care about Christmas. I'm just focused on we need to win the next match.\n\"That's the only thing. It's very good for the fans. We are that. We are privileged. We are privileged.\n\"So we can play on Boxing Day to give some happiness to the fans and we want so bad to win another game.\"", "url": "https://www.bbc.com/sport/football/live/c4gp91483zet"}