{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:36:38", "date_modify": "2025-05-21 03:36:38", "date_publish": "2025-02-04 00:50:40", "description": "Premier League clubs spent around £370m in the winter transfer window with Manchester City spending almost as much as the other 19 top-flight teams combined.", "filename": "sport_football_articles_cn8yz3e5jw7o_1747798598.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0b45/live/e7a339a0-e280-11ef-bf78-8ba219386e40.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cn8yz3e5jw7o_1747798598.html", "title": "Deadline day transfers: Winter window spending up on last year", "title_page": "Deadline day transfers: Winter window spending up on last year - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Premier League clubs spent around £370m in the winter transfer window, significantly up on the £100m paid out last year, with Manchester City spending almost as much as the other 19 top-flight teams combined.\nWhile spending is up, it is still way down on the 2023 record of £815m.\nThe £50m signing of midfielder Nico Gonzalez from Porto just before Monday's 23:00 GMT deadline took Manchester City's total spending to around £180m, according to Football Transfers, , externalas manager Pep Guardiola was given the backing to try and improve the defending champions' current form.\nCity's is the second-highest spend in a winter window ever, behind Chelsea in 2023, who spent £275m.\nThis season has not gone to plan for Manchester City.\nA dreadful run of form in November and December during which they lost six out of eight Premier League games saw their hopes of defending the title once again all but ended.\nMeanwhile, hanging over them is the outcome of the 115 charges they face for allegedly breaking the financial rules of the Premier League.\nBut they made the biggest moves during the winter window, signing Eintracht Frankfurt's Omar Marmoush for £59m, Palmeiras' Vitor Reis for £29.6m, and Lens' Abdukodir Khusanov for £33.6m before completing their business with £50m Gonzalez just before Monday's deadline.\nThey also signed Argentina Under-17 midfielder Claudio Echeverri for £12.5m but immediately loaned him back to River Plate.\nDespite the outlay of around £180m, their net spend for the 2024-25 season so far stands at £67m, helped by the departure of Julian Alvarez to Atletico Madrid last summer for an initial £64.4m, while defender Joao Cancelo moved to Saudi Pro League club Al-Hilal in a £21.2m deal.\nIt is rare for Manchester City to spend big in the winter window but this has been the most they have laid out since the £225m in the 2017 summer window.\n\"From a financial perspective, City are in a really strong position,\" football finance expert Kieran Maguire told BBC Radio 5 Live.\n\"Under these profitability and sustainability rules, you are allowed to lose £105m over a rolling three-year period. Manchester City have probably made somewhere in the region of £160-170m worth of profit because there has been an awful lot of players leaving the club - as well as the benefits of qualifying for Europe every year, the bonuses from sponsors and broadcasters for winning all of these trophies.\"\nOn the charges looming over them, Maguire added: \"The 115 charges relates to the period 2009-2018, so that, to a certain extent, is ancient history.\n\"When it does come to pass that we get a judgement, we will have to have a complete reset I think in what they can spend going forwards.\"\nAs is seemingly the case for many recent transfer deadline days, things were quiet until towards the end.\nBy 18:00 GMT - five hours before the window closed - just two deals had been done in the Premier League and both involved Brighton.\nThe first of those was the loan move of striker Evan Ferguson from the Seagulls to West Ham for the rest of the season, before Brighton later signed 19-year-old forward Stefanos Tzimas from Nuremberg for £20.8m.\nA quiet transfer deadline day needs a saga with twists and turns, and that was provided by Axel Disasi.\nThe Chelsea defender initially wanted to stay and fight for his place but was told it would be better to leave.\nBoth Aston Villa and Tottenham emerged as suitors but Spurs quickly went cold on signing the France international after feeling he didn't want to join.\nHis agents then, seemingly out of nowhere, appeared to convince Disasi that Spurs was better but they ultimately lost out to Villa, with a loan deal agreed with the club, although the move had yet to be confirmed by the 23:00 GMT deadline.\nVilla also added Spain midfielder Marco Asensio on loan from Paris St-Germain in the final few hours of the window.\nOther significant moves late in the day included Tottenham signing France Under-21s forward Mathys Tel from Bayern Munich on loan, while Crystal Palace signed full-back Ben Chilwell on loan from Chelsea.\nIt was a quiet window for Manchester United with just two players arriving and none on deadline day.\nPatrick Dorgu was their main signing with the defender joining from Lecce for £25m. The other player to arrive was 18-year-old defender Ayden Heaven from Arsenal.\nThere were, however, some significant outgoings with Antony, who signed for United from Ajax in August 2022 for £81.3m, joining Real Betis on loan, while Marcus Rashford left to join Villa on loan.\nBBC Sport's chief football news reporter Simon Stone:\nIn the end, though head coach Ruben Amorim said the club would try to bring in new players on deadline day, the other element of his assessment of Manchester United's transfer business held sway – do not repeat the mistakes of the past.\nUnited did explore the loan market and there were discussions around Tel. But, according to United sources, the structure of the deal being offered did not make sense. They effectively felt they were taking a chance on a young player knowing if he did well, Bayern Munich would benefit from his increased value.\nBut, according to Old Trafford officials, there is a wider point, namely avoiding what they felt were \"reckless and expensive risks\" which is essentially how United have ended up in the mess Sir Jim Ratcliffe is trying to sort out.\nThe reality is, after years of heavy losses, United were not in a position to buy anyone, without selling someone for a profit.\nAmortisation is not a word football supporters tend to use when they are chatting about the game. But essentially, it is the value of a specific player in terms of their cost and the length of time left on their contract. If a player is sold for above their 'value', it is profit and handy when it comes to PSR. If they are sold at a loss, it reduces the scope for spending.\nThat is essentially why Premier League clubs sell 'home-grown' players. For Manchester United, that would have meant academy graduates Alejandro Garnacho and Kobbie Mainoo - despite the fact Garnacho was signed from Atletico Madrid. The problem is Amorim wanted to keep the pair.\nThere was very little movement between Premier League clubs in the winter window.\nOn deadline day, Chilwell moved from Chelsea to Crystal Palace, Ferguson joined West Ham from Brighton and 18-year-old defender Somto Boniface joined Ipswich from Chelsea.\nPrior to that there were just three moves between Premier League clubs throughout all of January - Rashford's move to Villa and Ipswich signing both Jaden Philogene from Villa for around £20m and Julio Enciso on loan from Brighton.\nPaul MacDonald from FootballTransfers.com said: \"It's a case of Premier League teams now having a level of revenue - across the league - to know that they can command a huge fee from the teams near the top.\n\"There's no real need to sell or do business at a knockdown price unless profit and sustainability rules (PSR) really demands it.\n\"Alexander Isak is a prime example. Newcastle are struggling to spend because of PSR, but there's absolutely no obligation to sell on their part, either. Arsenal probably had very little chance of getting that deal done.\n\"Lastly, it's a competitive Champions League race this year; teams don't want to sell assets with such a valuable prize potentially available.\"", "url": "https://www.bbc.com/sport/football/articles/cn8yz3e5jw7o"}