{"authors": ["Emma Sanders", "www.facebook.com"], "date_download": "2025-05-21 05:28:42", "date_modify": "2025-05-21 05:28:42", "date_publish": "2025-01-31 19:30:38", "description": "Chelsea sign England midfielder Keira Walsh from Barcelona.", "filename": "sport_football_articles_cx24d0xqrdxo_1747805322.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a805/live/4c96df00-e00c-11ef-8992-59cb2eb4d7c4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cx24d0xqrdxo_1747805322.html", "title": "Keira Walsh: Chelsea sign England midfielder from Barcelona", "title_page": "Keira Walsh: Chelsea sign England midfielder from Barcelona - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Chelsea have signed England midfielder Keira Walsh from Barcelona.\nThe 27-year-old, who spent eight years at Manchester City before joining Barcelona, has signed a four-and-a-half-year deal with Chelsea.\nThe Women's Super League transfer deadline was on Thursday but the deal was only announced on Friday.\nChelsea did not confirm the fee but it does not challenge the world record of around £900,000 that they paid for USA defender Naomi Girma earlier this month.\n\"It's unbelievable. I'm very happy to be here and very excited to get started,\" Walsh said.\n\"You look at the history of the trophies Chelsea have won and I'm an ambitious player and person, so for me, it is a good fit.\"\nDespite Barca initially being unwilling to sell, it is believed Chelsea's bid was accepted late on Wednesday before Walsh had a medical on Thursday.\nThe 27-year-old, who left Manchester City to join Barcelona for a then world record fee of £400,000 in 2022, was keen to return to England to be close to family.\nChelsea, who are top of the Women's Super League and the only unbeaten side after 12 games, have had a long-standing interest in Walsh and have been looking to bolster their midfield since the summer.\nManager Sonia Bompastor has received significant backing as the club bid to win the Champions League. Walsh has won the competition twice with Barcelona.\nWhile she has played for Barcelona in the group stages of the competition this season, she is still eligible to play for Chelsea from the quarter-finals onwards.", "url": "https://www.bbc.com/sport/football/articles/cx24d0xqrdxo"}