{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:10:20", "date_modify": "2025-05-20 12:10:20", "date_publish": "2023-08-05 08:40:07", "description": "Chelsea complete the £25m signing of Spanish goalkeeper Robert Sanchez from Brighton & Hove Albion.", "filename": "sport_football_66397787_1747743020.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/D31E/production/_130664045_gettyimages-1252134436-1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66397787_1747743020.html", "title": "Robert Sanchez: Chelsea complete £25m signing of goalkeeper from Brighton", "title_page": "Robert Sanchez: Chelsea complete £25m signing of goalkeeper from Brighton - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Chelsea have completed the £25m signing of Spanish goalkeeper Robert Sanchez from Brighton & Hove Albion.\nThe 25-year-old moves to Stamford Bridge on a seven-year deal.\nSanchez made 23 league appearances for Brighton last season before losing his starting place to Jason Steele.\n\"Robert is a good guy and a really good player, but being a coach sometimes means making difficult and painful decisions for the team,\" Brighton boss Roberto de Zerbi said.\n\"I wish him good luck for the future.\"\nSanchez joined Brighton as a 15-year-old in 2013 from La Liga side Levante and signed his first professional contract with the Seagulls two years later.\nAfter loan spells with Forest Green Rovers and Rochdale he made his Premier League debut for Brighton in a 2-1 defeat at Tottenham Hotspur in November 2020.\nHe will compete with fellow Spaniard Kepa Arrizabalaga at Chelsea after Senegal goalkeeper Edouard Mendy moved to Saudi Pro League side Al-Ahli in June.\n\"Robert has repeatedly proved himself in the Premier League and been capped by his country,\" Chelsea's sporting directors Paul Winstanley and Laurence Stewart said in a statement.\n\"We are excited to watch him work with Mauricio Pochettino and his coaching team during the season ahead.\"", "url": "https://www.bbc.com/sport/football/66397787"}