{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:34:55", "date_modify": "2025-05-20 13:34:55", "date_publish": "2023-08-01 18:30:34", "description": "Chelsea: Mauricio Pochettino on Levi Colwill role", "filename": "sport_articles_c515kx6nr6yo_1747748095.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7314/live/f8742b80-3094-11ee-8f52-fbf70e4bf742.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c515kx6nr6yo_1747748095.html", "title": "Chelsea: Mauricio Pochettino on Levi Colwill role", "title_page": "Chelsea: Mauricio Pochettino on Levi Colwill role - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Levi Colwill \"needs to deserve\" his place in the side if he is to push for a place in Chelsea's first team this season.\nThe young defender - who has featured for Mauricio Pochettino's side in pre-season - impressed on loan with Brighton last campaign and has been linked with a move back to the south-coast club.\nAsked about the 20-year-old in a pre-match news conference before the Blues face Borussia Dortmund in a friendly, the head coach said: \"At the moment I need to see him and know each other better. He is a fantastic talent. We are talking also how we can improve his game. He is so relaxed, so calm. So happy to have him in the squad.\n\"We assume he is going to play. We are talking for him to have the possibility to compete with different team-mates. If he deserves to play, he will play. There is the possibility to play because Benoit [Badiashille] is injured. He needs to deserve. He needs to show he is ready to play.\"\nChelsea have been linked with a number of players in this summer transfer window, but Pochettino insists he is \"not disappointed\" more signings have not come in.\n\"We knew we would find this situation, I am aware the club is working. Working hard to try to finish the squad as soon as possible,\" he added.\n\"We understand the last few weeks of the transfer window maybe some things are going to happen. Always better to have everything close but not only us, for different clubs also. We continue to try to finish.\"", "url": "https://www.bbc.com/sport/articles/c515kx6nr6yo"}