{"authors": ["Emma Sanders", "www.facebook.com"], "date_download": "2025-04-26 07:47:42", "date_modify": "2025-04-26 07:47:42", "date_publish": "2025-02-26 23:40:31", "description": "It has been a rocky few months for the Lionesses but victory over Spain proves they are still up there with the world's best.", "filename": "sport_football_articles_c8j0822jp7yo_1745653662.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/efaf/live/a4f205c0-f48f-11ef-b27c-cbb996f05222.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c8j0822jp7yo_1745653662.html", "title": "England 1-0 Spain: 'A proper English performance' secures Nations League win", "title_page": "England 1-0 Spain: 'A proper English performance' secures Nations League win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "It has been a rocky few months for the Lionesses but their latest victory over Spain was proof they are still up there with the world's best.\nDefensively solid, tenacious out of possession and dangerous going forward, this was England coming close to a complete performance.\n\"We played proper English,\" defender Millie Bright said moments after she danced along to the song 'Sweet Caroline' with fans at Wembley Stadium.\nJess Park's first-half goal proved to be the winner in an impressive 1-0 victory over the world champions which poured cold water over criticism that had been heating up.\nEngland had won just two of their previous six matches prior to facing Spain and manager Sarina Wiegman had been questioned about their readiness to defend their European title in Switzerland this summer.\nThe head coach remained defiant, insisting England had made improvements. On Wednesday night they were finally able to show them.\n\"Of course it gives us a boost. We showed again tonight that we can compete with the best,\" said Wiegman.\n\"We have shown that before and it was really good to show that again, maybe for ourselves. The fans who were in the stadium I think enjoyed the game.\n\"It felt a very good performance and I'm very happy. There are always things to improve but lots of things went well today.\"\nGoalscorer Park was one of a number of England players who will have come off the pitch brimming with confidence.\nLauren James was exceptional out wide, Millie Bright unbeatable in defence and Lucy Bronze tireless in dealing with Spain forward Salma Paralluelo.\nIt was a performance which encapsulated the best of England and was the perfect response to Friday's underwhelming 1-1 draw with Portugal.\n\"After the last game, we wanted to be even more connected. We spoke about just being proper English tonight,\" said Bright.\n\"I mean that fight and that desire to defend for each other, to work hard for each other and to be hard to beat. It's so important to be hard to beat.\"\nWiegman agreed it felt like \"a proper English\" performance and highlighted the \"fight and togetherness\" to compete with Spain.\n\"It was an absolute team performance and we fought for every yard,\" she added.\n\"I think the fight and the togetherness is the most important thing and it always starts with that. Of course it gives a boost when you win.\"\nEngland's players celebrated on the pitch afterwards, Bright dancing with team-mate Chloe Kelly, while Bronze fist-pumped towards the stands.\nThey were applauded heavily at half-time and again when the final whistle went, while Spain's players stood looking dejected in the centre of the pitch.\nIt was only the second match of the Nations League campaign and this result does not affect things heavily yet - but it is a significant boost to England's Euro 2025 preparations.\nFormer England midfielder Izzy Christiansen said it felt like \"a semi-final or possibly a final of a major competition\" between two of Europe's heavyweights.\nSpain had their chances too - Lucia Garcia hit the crossbar in the first half before Aitana Bonmati was denied by goalkeeper Hannah Hampton.\nBut it was a match of high quality with England's star players James and Bronze showing their credentials and Spain's threat continuing until the final whistle.\n\"An absolutely superb game of football we've just witnessed,\" said Christiansen on BBC Radio 5 Live.\n\"The intensity and the magnitude of that first 45 minutes - it felt like a semi-final, possibly a final, of a major European or world competition.\n\"The 22 players on the pitch and the substitutes that came on were going at it 100%. This is the start of a massive rivalry between two top nations.\"\nIt was a performance by England that felt overdue but defender Niamh Charles said it was one they knew they were capable of.\n\"I think we know in ourselves our standards and we always kept looking internally and working on what we could do,\" she added.\n\"There was a lot of noise going on outside but we stuck to what we know and we've really been putting in the work over this camp.\n\"Hopefully you saw a bit of it and that's motivated us to keep going.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c8j0822jp7yo"}