{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:10:06", "date_modify": "2025-04-26 04:10:06", "date_publish": "2025-03-02 18:26:01", "description": "Reigning Division One champions Armagh remain on course to reach another league final after a 2-15 to 1-7 victory against Kildare.", "filename": "sport_articles_cvg171z4g3jo_1745640606.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/41f1/live/4a038d00-f791-11ef-ba30-7dc3acc49c5d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cvg171z4g3jo_1745640606.html", "title": "Armagh secure fifth Division One win with Kildare victory", "title_page": "Allianz Leagues: Armagh secure fifth Division One win with Kildare victory - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Reigning Division One champions Armagh remain on course to reach another league final after a 2-15 to 1-7 victory against Kildare.\nThe Orchard County racked up a fifth successive league win thanks to goals in either half from Niamh Henderson and Emily Druse.\nThey led 1-6 to 0-2 at the break after a dominant first half display as Henderson rifled home after being played through by Aoife McCoy.\nDruse gave them a 13-point advantage at one stage in the second half when she scored their second goal before Leah McGovern slotted home what proved to be a late consolation for Kildare.\nAlso in Division One, Tyrone were thrashed 6-15 to 0-6 by an impressive Waterford side at Aghyaran.\nWaterford controlled the game from start to finish and were well on their way to the win by half-time as they held a commanding 3-8 to 0-2 lead.\nLauren McGregor scored a hat-trick and they also had goals from Chloe Fennell, Katie Murray and Kellyann Hogan in their dominant win.\nThe Red Hands, despite having three points on the board, now find themselves in a relegation battle with fellow strugglers Mayo.\nIn Division Two, Donegal were beaten 2-16 to 0-6 by Galway whilst Monaghan claimed a 4-11 to 1-9 win against Clare.\nIn Division Three, Cavan overcame Offaly 3-12 to 0-4 whilst Down played out a draw with Wexford.\nIn Division Four, Antrim and Fermanagh booked their places in the semi-finals as the Saffrons continued their winning streak.\nThey eased past Wicklow 7-6 to 1-7 whilst Fermanagh picked up a 2-10 to 0-6 victory against Sligo.\nDerry got a much-needed win as they beat Kilkenny 5-15 to 0-4.", "url": "https://www.bbc.co.uk/sport/articles/cvg171z4g3jo"}