{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:39:23", "date_modify": "2025-05-21 03:39:23", "date_publish": "2025-04-08 00:00:00", "description": "Championship leaders Burnley are held to a draw by relegation-threatened Derby County at Pride Park.", "filename": "sport_football_live_c0qn0ddkdw5t_1747798763.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c0qn0ddkdw5t_1747798763.html", "title": "Derby County 0-0 Burnley: Clarets held to drab draw by Rams", "title_page": "Derby County 0-0 Burnley: Clarets held to drab draw by Rams - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Burnley relinquished top spot in the Championship with a weary display in a drab draw against an ever-improving relegation-threatened Derby County at Pride Park.\nThe Clarets, now second in the table on goal difference following Leeds United's victory away at Middlesbrough, started well and twice went close through the outstanding Zian Flemming.\nBut the Rams, who move onto 42 points and remain out of the relegation zone, were resolute in defence and grew in confidence as the visitors faded.\nJerry Yates nearly broke the deadlock with a shot that was brilliantly saved by Burnley keeper James Trafford.\nA tense and disjointed second period saw very little goalmouth action, although Matt Clarke almost won it for the Rams in the second of eight minutes of added time, but he could not leap high enough to nod the ball home from two yards.\nA match full of endeavour and spirit had very little quality and only three attempts on target in total.\nBut although both sides were desperate for a victory for different reasons, they can take solace in other results meaning their destiny remains in their own hands.\nSheffield United's second defeat in two games sees them drop two points behind Scott Parker's side, whose incredible unbeaten league run now extends to 28 games.\nAnd Derby's run of five wins and draw in their past five games has given them real hope of avoiding the drop with five matches remaining.\nThe chances for Yates and Clarke towards the end of each half could easily have seen John Eustace's side make it five wins from six.\nBut the Clarets will lament three close calls for Flemming - a glorious turn and shot that produced a wonderful save by Jacob Widdell Zetterstrom, a hooked effort that went just wide and a instinctive curler that was also narrowly off target.\nThe only blemish for the visitors was a nasty-looking shoulder injury to striker Lyle Foster, who had to be replaced just six minutes after coming on as a substitute.\nDerby County boss John Eustace told BBC Radio Derby:\n\"I am very proud of the group - and the fans. We went toe-to-toe against a very good team and on another day we could have nicked a winner.\n\"The lads are very well drilled. We kept our concentration for 95 minutes. Every player on the pitch did their jobs. We showed we are together against a very good team.\n\"It took us 20 minutes to get into the game; we were a bit nervous. But as soon as we adjusted a few things with our shape we were on the front foot and we finished the first half very strong.\n\"In the second half, we competed really well and limited Burnley to nothing, really. And, on another day, maybe Clarkey could have nicked a winner.\"\nBurnley boss Scott Parker told BBC Radio Lancashire:\n\"It's a tough place to come. It's a team fighting for their lives.\n\"They cause you problems with the way they play; they put the ball in areas constantly and get you running back towards your own goal and I thought we coped with that really well.\n\"We started the game electric and really took a foothold in the game for 35 minutes.\n\"At the back end of the first half they caused us problems from long throws and set plays. We had to be resilient in those moments as it becomes a 50-50 game.\n\"We defended exceptionally well and overall it's a point gained and another clean sheet.\n\"Lyle has damaged his shoulder and it doesn't look good. He'll have a scan tomorrow.\"", "url": "https://www.bbc.com/sport/football/live/c0qn0ddkdw5t"}