{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:55:40", "date_modify": "2025-05-21 05:55:40", "date_publish": "2025-04-02 06:22:06", "description": "Derry's Gareth McKinless says the potential return of former manager was \"always lingering\" for the county.", "filename": "sport_articles_cn4wznwll37o_1747806940.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d22c/live/98a26cf0-0f2a-11f0-819f-fb51f256a881.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cn4wznwll37o_1747806940.html", "title": "Gaelic Games: Gareth McKinless expected Rory Gallagher to make Derry return", "title_page": "Gaelic Games: Gareth McKinless expected Rory Gallagher to make Derry return - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Derry's Gareth McKinless says the potential return of former manager Rory Gallagher was \"always lingering\" for the county.\nGallagher was accused of abuse over a 24-year period by his estranged wife Nicola Gallagher in May 2023.\nThe accusations, which he has consistently denied, led to him stepping down as manager during the build-up to Derry's Ulster SFC final victory over Armagh that same month.\nTwo files were submitted to the Public Prosecution Service (PPS), which decided against pressing charges due to evidence that was insufficient \"to provide a reasonable prospect of a conviction\".\nMcKinless feels there was a \"breakdown in communication\" at the time of the former Donegal and Fermanagh manager's resignation two seasons ago and that he \"thought\" a return was in the offing.\n\"The miscommunication between a county board and potentially players, it just filtered down throughout,\" the 2023 All Star told the GAA Social, BBC Sport NI's Gaelic Games podcast.\n\"It wouldn't have been easy to handle it, but if we literally just met as a full group, as a county, and said this is the way it's going forward.\n\"Whether it's right or wrong is another story.\"\nGallagher, who has stated his intention to return to management, was linked to a second stint in charge of Derry in the autumn but the Oak Leaf County eventually installed Paddy Tally to succeed Mickey Harte.\nHis appointment to a coaching role with Kildare senior club champions Naas then fell through in January.\nDespite winning the Allianz League Division One title in March 2024 under Gallagher's successor Mickey Harte, Derry have struggled since his departure.\nThey surrendered their Ulster title with an emphatic defeat by Donegal in last year's quarter-finals and this season were relegated to the league's second tier.\nIt is a stark contrast to the team that won a pair of provincial titles in 2022-23.\nMcKinless, who also pointed to the influence of assistant coaches like Ciaran Meenagh, felt the environment during the period ensured success.\n\"We were all singing off the same hymn sheet, we all had the same goals and we were working towards that every day,\" he said.\n\"The credit to the management team was the environment they created for the players to excel in. They pushed us to the limits we never thought were possible.\n\"On the pitch and nearly more off the pitch, how we see the game and how we understand it was probably a bigger element than most. We had teams beaten before we'd play them.\"\nLooking to rebound from relegation, Derry begin the Ulster Championship with a trip to Ballybofey to face Donegal in the preliminary round on Sunday.\nThey will travel as considerable underdogs and McKinless, who will miss the campaign with a cruciate ligament injury, said the change in status has been difficult for the players.\n\"We had massive aspirations to go and do special things - when it comes crashing down, it's hard to put into words, it's hard to take,\" he added.\n\"You go from being a top three or four team in the country, to being down the pecking order. For that group, it's hard to take.\"\nYou can listen to the GAA Social with Gareth McKinless on BBC Sounds now", "url": "https://www.bbc.com/sport/articles/cn4wznwll37o"}