{"authors": ["Callum Matthews", "www.facebook.com"], "date_download": "2025-05-20 11:45:06", "date_modify": "2025-05-20 11:45:06", "date_publish": "2023-08-06 12:22:04", "description": "Southern Brave return to winning ways in The Hundred women's competition with a five-wicket victory over Northern Superchargers.", "filename": "sport_cricket_66421865_1747741506.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/128E7/production/_130670067_gettyimages-1596079961.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66421865_1747741506.html", "title": "The Hundred 2023: Southern Brave beat Northern Superchargers to return to winning ways", "title_page": "The Hundred 2023: Southern Brave beat Northern Superchargers to return to winning ways - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Southern Brave returned to winning ways in The Hundred women's competition with a five-wicket victory over Northern Superchargers at the Ageas Bowl.\nBrave, who lost to Welsh Fire on Friday, chased 101 with 13 balls to spare to pick up their second win.\nThey did stutter on a slow pitch but England's Maia Bouchier made 31 before Chloe Tryon (13*) sealed the win.\nSuperchargers crawled to 100-8 with opener Marie Kelly making 39, while off-spinner Georgia Adams took 3-21.\nSouthern Brave captain Anya Shrubsole to Sky Sports: \"Really pleased with the way we bounced back from Friday. It was a bit of a scrappy run chase but a win's a win.\n\"I was pretty terrible on Friday. I was really disappointed with the way I bowled. But it was nice to be able to come here and put it right.\"\nOn Rhianna Southby: \"I have been winding her up all day. It is like Rhianna Southby day. She is an exceptional keeper and probably the second-best keeper in the country behind Amy Jones, so we are really happy to have her.\"\nMatch Hero Southern Brave's Rhianna Southby: \"It is amazing. I've not been anywhere near my best but to show people what I'm capable of is brilliant.\n\"The catch to dismiss Alice Davidson-Richards was my favourite because under-edges are difficult to take because they go low.\"\nYou can watch Hundred matches on BBC Two and BBC iPlayer every Wednesday and Saturday throughout the competition, alongside both finals on Sunday, 27 August. More details.", "url": "https://www.bbc.com/sport/cricket/66421865"}