{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:36:35", "date_modify": "2025-04-26 06:36:35", "date_publish": "2025-02-26 07:04:00", "description": "Liverpool manager Arne Slot says he \"can't accept\" striker Darwin Nunez's work-rate in his past two games.", "filename": "sport_football_articles_ckgz0lkpz21o_1745649395.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8bff/live/0a40c810-f40b-11ef-ad3e-8392e5cb3fca.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_ckgz0lkpz21o_1745649395.html", "title": "Liverpool: Arne Slot criticises Darwin Nunez work-rate", "title_page": "Liverpool: Arne Slot criticises Darwin Nunez work-rate - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Liverpool manager Arne Slot says he \"can't accept\" striker Darwin Nunez's work-rate in his past two games.\nThe Uruguay international was a second-half substitute in the win over Wolves on 16 February and the draw at Aston Villa on 19 February, when he missed an open goal.\nNunez did not come off the bench in Sunday's 2-0 win at Manchester City, which took Liverpool 11 points clear at the top of the Premier League.\nSlot defended Nunez after his miss against Villa but said he allowed his \"disappointment\" to impact his work-rate.\n\"I helped him by saying you can miss a chance,\" Slot said in his news conference before Wednesday's visit of Newcastle.\n\"I wasn't only hard on him. But for the second time in a row I wasn't happy with his work effort, against Wolves and against Villa.\n\"I can't accept if a player doesn't give everything. That is clear. I can accept it once, but twice was a bit too much. That's why I addressed it.\n\"If you miss a chance, you need to be fighting for the team. I'm not saying he didn't do that at all, but it wasn't the usual Darwin, the one that is loved by the fans. That is mainly because he always works so hard.\"\nSlot said Nunez, who has scored six goals in 35 games in all competitions for Liverpool this season, was \"incredible\" in training on Monday.\nOpta stats for the season show that Nunez performs well in distance covered and sprints per 90 minutes when compared with his Liverpool team-mates.\nHis 25.86 sprints per game average is second only to Connor Bradley (28.19) and his average distance covered per game is fifth highest at 11.28km. Bradley is also top of that metric with 12.27km.\nNunez played fewer than 30 minutes in the Wolves and Villa games, making direct comparisons hard, but Opta recorded 3.66km distance and eight sprints against Wolves and 3.06km and six sprints against Aston Villa.", "url": "https://www.bbc.co.uk/sport/football/articles/ckgz0lkpz21o"}