{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:47:06", "date_modify": "2025-05-20 13:47:06", "date_publish": "2023-07-31 13:56:24", "description": "Southampton winger Sam Edozie says they are ready to face Sheffield Wednesday when they kick off the Championship season on Friday.", "filename": "sport_football_66361976_1747748826.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1827B/production/_130593989_gettyimages-1419976932.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66361976_1747748826.html", "title": "Sam Edozie: Southampton winger says the team is prepared for their Championship opener", "title_page": "Sam Edozie: Southampton winger says the team is prepared for their Championship opener - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Sam Edozie says Southampton are ready to kick off the Championship season on Friday after a strong pre-season.\nSaints' first game back in the second tier following Premier League relegation is away to newly promoted Sheffield Wednesday at Hillsborough.\n\"We're going to enjoy it under the lights,\" the winger told BBC Radio Solent.\n\"It's a great game to start the season and the whole team is looking forward to it.\"\nSouthampton completed their pre-season with three friendlies packed into one week against Reading, Bournemouth and AZ Alkmaar.\nEdozie says the high tempo match against the Premier League Cherries followed by Dutch side AZ just four days later was a real test.\n\"With the Championship being quite full on you often have two games a week,\" the 20-year-old added.\n\"So having two close and varied games in pre-season is a big positive for us.\n\"We are now ready for the start of the season.\"\nEdozie working on end product\nNew Southampton boss Russell Martin, who arrived at St Mary's on a three-year-contract from fellow Championship side Swansea in June, recently said his side were trending in the right direction but that they would not be \"perfect\" for the season-opener.\nEdozie made 24 appearances for Saints last season but failed to score a goal or register an assist.\nHowever, the England Under-20 player believes Martin's style and leadership is having a positive impact on his game at the right time.\n\"He [Martin] has been very encouraging and he believes in me,\" Edozie added.\n\"That is one of the main things for us players, to have a manager who believes in them, and he has been working with me to try and get that end product into my game and get it to work.\n\"Football at the end of the day is about goals and assists and that is definitely something I know I will improve on this season.\n\"It can take time to get your sharpness back and I'm not at my peak but that will come soon and I like to stay positive and keep working - I am excited for the season to start.\"", "url": "https://www.bbc.com/sport/football/66361976"}