{"authors": ["Celestine Karoney & Rob Stevens", "www.facebook.com"], "date_download": "2025-05-21 05:11:01", "date_modify": "2025-05-21 05:11:01", "date_publish": "2025-01-23 10:38:51", "description": "Zimbabwe's Kirsty Coventry is aiming to become the first female president of the International Olympic Committee.", "filename": "sport_olympics_articles_cly92vxyy7jo_1747804261.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/853a/live/240118c0-d74d-11ef-94cb-5f844ceb9e30.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_olympics_articles_cly92vxyy7jo_1747804261.html", "title": "Kirsty Coventry: IOC presidential candidate aims to challenge 'status quo'", "title_page": "Kirsty Coventry: IOC presidential candidate aims to challenge 'status quo' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Kirsty Coventry hopes to \"challenge the status quo\" at the International Olympic Committee (IOC) should she be elected as its first female president.\nThe 41-year-old former swimmer would also become the youngest person and the first from outside Europe or North America to head the organisation in its 130-year history should she see off six other candidates and succeed Thomas Bach in March's vote.\nThe Zimbabwean, who is Africa's most-decorated Olympian, wants to go further in empowering female athletes by putting in place stronger safeguarding procedures and providing more support for mothers.\n\"I want to show people and women across Africa and the world: 'Don't be afraid of anything',\" Coventry told BBC Sport Africa.\n\"If you believe in something and know you can lead an organisation, don't be too scared to put your hand up and do it.\n\"It's time for women in Africa to stand up and lead, to not be afraid of leading, and to not be afraid of leading in a different way.\"\nCoventry won seven medals, including two golds, across the Athens 2004 and Beijing 2008 Games, and has served as her country's minister of sport, arts and recreation since September 2018.\nShe is also currently leading IOC commissions overseeing progress on the Dakar 2026 Youth Olympics and 2032 Brisbane Olympics.\nCoventry says her bid to become IOC president is motivated by her desire to \"give back\" to the Olympic movement which has changed her life \"for the better\".\nDescribing herself as being at \"the crossroads between the older generation and the younger generation\", she intends to embrace new technologies such as online streaming and artificial intelligence (AI) in order to \"remain relevant\".\n\"One of my expectations from our media rights holders is, how are we going to access streaming around the world?\" she explained.\n\"We saw, for the first time, NFL games over Christmas Day being streamed on Netflix.\n\"What does that look like for us? That is going to be very important as we move into the future.\n\"I do believe that if we can open up opportunities in these new areas, we create more fans which should in turn bring new revenue opportunities.\"\nMeanwhile, Coventry believes AI could benefit athletes on her home continent by helping them gain better access to training tools, doctors and nutritionists.\nAs the only woman in the IOC presidential race, Coventry is keen to support female athletes, particularly around what she describes as \"sensitive topics\".\nThe introduction of a dedicated room for nursing mums at the most recent Olympics is one particular step which she wants to build on.\n\"This is a great program,\" she said.\n\"We're going to help mothers come to the Games, and we're going to cover that extra ticket. For me, those are the kinds of programs that help more athletes than just a select few.\"\nYet instances of gender based violence suffered by female athletes, particularly in East Africa, have highlighted a deeper problem.\nWorld Athletics has already identified campaigning on that issue as a priority but Coventry aims to take that further.\n\"If we have an Olympian that's doing some incredible work on gender based violence, how do we support that?\" she explained.\n\"Is there a sponsor [or] philanthropist that, as the IOC, we can reach out to and put in touch with that Olympian to amplify what they're doing - to take their voice, their message, from one community to an entire country, to an entire continent?\"\nCoventry does not believe in offering prize money at the Games, an incentive which was first seen at Paris 2024 when World Athletics offered $50,000 to every gold medallist in track and field.\nInstead, she argues that funds would be better spent elsewhere as prize money would only benefit top athletes.\n\"We have 10,500 athletes at the Summer Olympic Games and nearly 3,000 at a Winter Games. How do we impact them?\" she said.\n\"How do we ensure that Olympians, or prospective Olympians and athletes from around the world get better access to sport, to training, to health and mental health [support]?\n\"Those are the programs that I would like to focus on.\"\nThe other six candidates for the IOC presidency are France's David Lappartient, Japan's Morinari Watanabe, Prince Feisal al Hussein of Jordan, Spain's Juan Antonio Samaranch Jr, Sweden's Johan Eliasch and the UK's Lord Sebastian Coe.", "url": "https://www.bbc.com/sport/olympics/articles/cly92vxyy7jo"}