{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:54:01", "date_modify": "2025-04-26 03:54:01", "date_publish": "2025-03-03 07:26:42", "description": "Ulster head coach Richie Murphy says the province are \"looking into\" their injury issues this season but that there is \"no proof\" that training on their artificial pitch is a contributing factor.", "filename": "sport_articles_c3rn8yyr39xo_1745639641.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cc60/live/fdb81740-f6d2-11ef-b441-0f08798b3a21.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_c3rn8yyr39xo_1745639641.html", "title": "Ulster Rugby: No reason found for province's injury struggles says Richie Murphy", "title_page": "Ulster Rugby: No reason found for province's injury struggles says Richie Murphy - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Ulster head coach Richie Murphy said the province are \"looking into\" their injury issues this season but added that there is \"no proof\" that training on their artificial pitch is a contributing factor.\nThe Irish province beat Scarlets on Saturday in the United Rugby Championship (URC) despite missing the likes of Iain Henderson, Tom Stewart, Cormac Izuchukwu and John Cooney through injury.\nSat 14th in the table even after the win, senior absentees have been a feature of their difficult campaign.\nSpeaking on BBC NI, former Ulster and Ireland flanker Chris Henry noted concerns over whether the Kingspan Stadium artificial surface, installed in 2023, has any part to play.\n\"There's a large injury list. Interestingly, a lot of these injuries are lower limb injuries and obviously the pitch has been talked about a lot,\" he said.\n\"When Ulster put out their top 15 players we can compete with anyone. Whenever the injuries happen, we're putting in young guys who, it's not their fault, but perhaps they aren't absolutely ready.\"\nMurphy said that Ulster's squad has had 70% availability through the campaign but that it is the calibre of player missing, rather than frequency or nature of the injuries, which has cost the province.\nHe said: \"At this moment in time there's no proof that training on a plastic pitch creates more injuries.\n\"We do have an injury issue at the moment. Ulster Rugby as a group, we're looking into why we're picking up those injuries but there's no real reason for it at the moment, or that's been found at the moment.\"\nUlster welcomed Jacob Stockdale, James Hume and Stuart McCloskey back into the side last month after spells on the sidelines, but then lost Henderson, Stewart and Izuchukwu to fresh injuries, while Robert Baloucoune has not played this season.\nMurphy added: \"When you look at the players that have been out all across the season, it's all our big senior players.\"", "url": "https://www.bbc.co.uk/sport/articles/c3rn8yyr39xo"}