{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:19:47", "date_modify": "2025-05-19 15:19:47", "date_publish": "2015-03-04 12:55:36", "description": "Middlesbrough boss Aitor Karanka praised his side to the hilt after they went top of the Championship by beating Millwall.", "filename": "sport_football_31729678_1747667987.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81394000/jpg/_81394913_borostrikers.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31729678_1747667987.html", "title": "Middlesbrough: Aitor Karanka pleased with 'perfect' Boro", "title_page": "Middlesbrough: Aitor Karanka pleased with 'perfect' Boro - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Middlesbrough coach Aitor Karanka praised his side after they responded to Saturday's loss to Sheffield Wednesday by beating Millwall.\nBoro, who lost for only the second time in 2015 at Hillsborough, returned to top form on Tuesday with a 3-0 win over the Lions to top the Championship.\n\"I had no doubt the players would have this reaction, everything was perfect,\" Karanka told BBC Tees.\n\"It was going to be difficult after the defeat on Saturday.\"\nThe intensity of the Championship has meant a flurry of fixtures for all clubs, with the Teessiders' FA Cup run only adding to the workload.\nKaranka admitted fatigue might have been a factor in their loss to Wednesday, and the home defeat by Leeds late in February.\n\"This was our eighth game in a month,\" he said.\n\"I can understand the players can be tired in the legs, they have motives to be tired. A lot of games brings mental tiredness.\"\nTuesday's success saw a return to goals for three of Boro's forwards, with Patrick Bamford ending a three-game drought, while Kike and Jelle Vossen scored for the first time in four appearances.\n\"I'm very pleased because all of the forwards have scored a goal,\" said Karanka.\n\"We need those goals, because all of the teams now below us, their strikers have 40, 45 between them.\n\"I knew when our strikers start to score goals it will make the difference because we are a consistent team.\"", "url": "https://www.bbc.com/sport/football/31729678"}