{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:16:29", "date_modify": "2025-05-21 06:16:29", "date_publish": "2025-03-31 09:08:06", "description": "'It feels like the man scores every game' - Sinisalo hails Maeda's Celtic impact", "filename": "sport_articles_cedy1qq63zxo_1747808189.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4137/live/4106fa40-0e0f-11f0-90cb-6de76cd8d1c0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cedy1qq63zxo_1747808189.html", "title": "'It feels like the man scores every game'", "title_page": "'It feels like the man scores every game' - Sinisalo hails Maeda's Celtic impact - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Goalkeeper Viljami Sinisalo says there is an inevitability about Daizen Maeda's game after the Celtic striker took his tally for the season to 30 goals with a clinical double against Hearts on Saturday.\nThe 27-year-old Japan forward scored either side of Jota's tap-in, which Maeda also played a vital role in, as Brendan Rodgers' side raced into a three-goal lead before the break.\nMaeda is now the Scottish Premiership's leading scorer on 15, but that total doubles when you include his strikes across all competitions.\nSinisalo, who was making his first league start for Celtic in the absence of Kasper Schmeichel, told Celtic TV: \"[Maeda's] been fantastic and it feels like the man scores every game!\n\"You're just waiting for [the goal] to come. He's been brilliant. Hopefully he can keep it going and I'm sure he will.\"\nReflecting on his own performance at Celtic Park, Finnish keeper Sinisalo added: \"It was great to be out there. We probably started a bit slow and there were a few things I had to do early doors.\n\"But after 20 minutes, the team picked up and it was a very complete performance. There were a few things I could have done better, but it was great to be out there.\"", "url": "https://www.bbc.com/sport/articles/cedy1qq63zxo"}