{"authors": ["Katie Stafford", "www.facebook.com"], "date_download": "2025-04-26 06:54:21", "date_modify": "2025-04-26 06:54:21", "date_publish": "2025-02-28 16:05:05", "description": "Man Utd news: Fernandes' captaincy compares to Maguire's", "filename": "sport_football_articles_cd7ev3xznv1o_1745650461.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0058/live/60a4fdc0-f5eb-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cd7ev3xznv1o_1745650461.html", "title": "Man Utd news: Fernandes' captaincy compares to Maguire's", "title_page": "Man Utd news: Fernandes' captaincy compares to Maguire's - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Whether Bruno Fernandes should be Manchester United's captain is the latest talking point in this challenging season for the club.\nThe Portugal international has probably been the most successful signing of the post-Sir Alex Ferguson era, with 89 goals and 79 assists in 272 games in all competitions.\nHe remains this season's standout performer as joint top scorer with Amad Diallo on six in the Premier League, and has also provided the most assists (seven).\nBut there have also been several instances in which he has been criticised for his attitude and discipline since signing from Sporting Lisbon in January 2020, so his role as captain continues to divide opinion.\nThe latest person to spark the debate is former club captain Roy Keane, who claimed \"talent is not enough\" for Fernandes, who he also believes is \"not a fighter\".\nSince February 2020, either Fernandes or Harry Maguire have been captain for the majority of Manchester United's games.\nFernandes was officially handed the armband in July 2023 when Maguire was dropped from Erik ten Hag's starting XI following a period of poor form and stripped of his captaincy.\nAccording to Opta, Maguire boasts the better win ratio of 58.1% after leading United to 72 victories in his 124 games as captain.\nFernandes has managed two more wins - 74 - in his 146 matches as skipper, which converts to 50.7% to date.\nInterestingly, Maguire ignored the chance to move in the summer and has gone on to outlast Ten Hag and turn into one of Ruben Amorim's key men.\nMaguire has taken up the central role in Amorim's back three and has scored three key goals across the FA Cup, Europa League and Premier League.\nCould the armband be passed on again in the summer?", "url": "https://www.bbc.co.uk/sport/football/articles/cd7ev3xznv1o"}