{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:45:02", "date_modify": "2025-05-21 06:45:02", "date_publish": "2025-03-30 17:42:07", "description": "'If we start feeling sorry for ourselves, then it's over, finito' - Valakari", "filename": "sport_articles_cx2vykre3mmo_1747809902.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ca62/live/41c98b90-0d8e-11f0-80e2-6f5e46851467.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cx2vykre3mmo_1747809902.html", "title": "'If we start feeling sorry for ourselves, then it's over, finito' - Valakari", "title_page": "'If we start feeling sorry for ourselves, then it's over, finito' - Valakari - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Simo Valakari insisted \"nothing changes\" for St Johnstone in their fight for survival, despite their 3-0 loss to Hibernian on Saturday.\nAlthough the Saints have won five of their last 10 in all competitions, they still trail Dundee by five points and looked far from the resilient side of the last few weeks as they succumbed to a heavy defeat at Easter Road.\n\"Nothing changes,\" Valakari said. \"We have been in this situation before many times.\n\"I take responsibility, we need to own this performance, we don't have any other option, as we haven't had in the last three months [since slipping to the bottom of the league]. We need to go again.\"\nThe Finn has won plaudits in the last few months, with draws against Aberdeen and Dundee helped by wins over Ross County, St Mirren and Motherwell.\n\"If we start feeling sorry for ourselves, if we start feeling frustrated, disappointed, angry, making excuses, then it's over, finito.\n\"That's why, boom, we go. I know my players will shake this off. They feel it, they hurt, of course, because they are good boys, they wanted to show in a nice stadium, in front of a lot of fans, how good they are, and we couldn't do it.\n\"We shake it off and we need to go again.\"", "url": "https://www.bbc.com/sport/articles/cx2vykre3mmo"}