{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:15:40", "date_modify": "2025-05-21 04:15:40", "date_publish": "2025-04-05 18:55:51", "description": "Runs continue to flow in the County Championship Division One match between Warwickshire and Sussex.", "filename": "sport_cricket_articles_c1dr3vg99n7o_1747800940.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3785/live/10a4fd90-124f-11f0-a75c-b716eb718e3b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c1dr3vg99n7o_1747800940.html", "title": "County Championship: Batters dominate between Warwickshire and Sussex", "title_page": "County Championship: Batters dominate between Warwickshire and Sussex - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Bowlers continue to suffer in the Birmingham sunshine as an opening-round runfest unfolds between Warwickshire and Sussex in the County Championship Division One at Edgbaston.\nSussex have returned to the top tier in style by amassing 528 all out after captain John Simpson added a superb unbeaten 181 to Tom Clark's opening day century.\nWarwickshire's injury-hit attack, led by debutants Ethan Bamber (4-105) and Tazeem Ali (3-103), plugged away nobly but found the going tough in good batting conditions.\nSussex's hopes of turning that strong total into a victory were then held up by the home batters who responded with 223-3.\nRob Yates closed the second day on 113 after captain Alex Davies launched the reply with an aggressive 66.\nEdgbaston pitches in recent years have tended to flatten out as matches lengthen, so it is difficult to see either side forcing a victory. Both would probably be happy enough with a solid draw from their season-opener.\nSussex resumed on the second day on 386-5 and were given early impetus by Jack Carson's punchy 28 before he lifted Ed Barnard to deep square leg in pursuit of his fourth boundary of the over.\nFynn Hudson-Prentice was soon lbw to Bamber but the implacable Simpson was joined by Danny Lamb in a stand of 85 in 25 overs.\nLamb and Ollie Robinson fell lbw to successive balls from Tazeem and Simpson's hopes of challenging his career best 205 ended when Jayden Seales scooped Michael Booth to mid-wicket.\nWarwickshire opening batters Davies and Yates enjoyed their moments of good fortunes against the new ball attack of Robinson and Seales but batted positively and the score advanced briskly as soon as the ball softened. Davies hit 11 fours on his way to a 48-ball half-century as his side eased to 112 without loss from 21 overs at tea.\nThey reached that point without taking risks which made Davies' departure, slashing the third ball of the evening session, a wide, short offering from Seales, to third man all the more strange.\nHamza Shaikh (23) helped the steady Yates to add 56 in 14 overs but was undone by a lovely ball from Carson. Having seen a flighted delivery driven for four earlier in the over, the off-spinner looped up another which turned sharply to bowl the batter through a drive.\nThat left Warwickshire, needing 379 to avoid the follow on, 172-2 with 17 overs left in the day.\nYates chugged on to a 132-ball hundred but the departure of Sam Hain, who edged Seales to slip with 17 balls left in the day, sent Sussex off the field with a spring in their step and feeling that a strong morning tomorrow could keep the door open to them returning to Division One with a very impressive win.", "url": "https://www.bbc.com/sport/cricket/articles/c1dr3vg99n7o"}