{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:43:16", "date_modify": "2025-05-20 14:43:16", "date_publish": "2023-07-28 11:42:42", "description": "Goalkeeper Daniel Bachmann signs a new five-year deal with Watford, and is named captain by head coach Valerien Ismael.", "filename": "sport_football_66337054_1747752196.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/F999/production/_130579836_gettyimages-1252354803.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66337054_1747752196.html", "title": "Daniel Bachmann: Watford goalkeeper signs new deal and named captain", "title_page": "Daniel Bachmann: Watford goalkeeper signs new deal and named captain - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Goalkeeper Daniel Bachmann has signed a new five-year deal with Watford, and been named captain by head coach Valerien Ismael for 2023-24.\nThe 29-year-old Austria international has played 86 games for the Hornets since joining from Stoke City in July 2017, including 45 last term.\nBachmann replaces retired midfielder Tom Cleverley in the role, who has since joined the coaching staff.\n\"It's a clear commitment from Dan to the club,\" boss Ismael said., external\n\"For me, he is the obvious choice for captain of the squad. He's the longest-serving player here and he will be very important as a leader who understands not just English football but the Championship specifically.\n\"I believe he knows it is his time to take this responsibility and I am sure he will step up to the challenge with the support of the player leadership group.\"\nHe also becomes one of six players in the leadership ground assembled by Ismael, alongside Ben Hamer, Wesley Hoedt, Jake Livermore, Imran Louza and Ken Sema\nMeanwhile, midfielder Dan Gosling has left Vicarage Road following the expiry of his contract.\nThe Hornets said last month that Gosling was one of three players in talks about new deals and there was \"no rush\" to decide their futures.\nGosling, 33, leaves with two goals in 37 games since arriving in 2021.\nHe made 18 appearances last season but then suffered a serious Achilles injury against Bristol City last November.\nThe other two players who were in talks about new deals, Cleverley and Craig Cathcart, are no longer playing for Watford, with the latter looking for a new club.", "url": "https://www.bbc.com/sport/football/66337054"}