{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:52:47", "date_modify": "2025-05-21 06:52:47", "date_publish": "2025-03-29 18:46:47", "description": "Truro City manager John Askey is left frustrated as his title-chasing side draw 0-0 at 10-man Chelmsford City in National League South.", "filename": "sport_football_articles_cvg5gqdqn37o_1747810367.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9d01/live/b422e4a0-0ccd-11f0-bd5c-75dd3ff67252.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cvg5gqdqn37o_1747810367.html", "title": "Truro City boss John Askey frustrated with 0-0 draw at Chelmsford City", "title_page": "Truro City boss John Askey frustrated with 0-0 draw at Chelmsford City - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Truro City manager John Askey was left frustrated as his title-chasing side drew 0-0 at 10-man Chelmsford City in National League South.\nThe draw saw the Tinners drop three points behind leaders Worthing - who they face next week.\nAnd they slipped to third place on goal difference after Dorking Wanderers' win over fifth-placed Eastbourne Borough.\nDorking, Truro and Torquay United all have 77 points with five games to play with Eastbourne two points further back.\nChelmsford almost took the lead on the stroke of half-time when Ruaridh Donaldson hit the bar.\nThe hosts had Arthur Penney sent off for bringing down Jaze Kabia on the edge of the box and denying a goalscoring opportunity three minutes into the second half.\nBut despite the advantage Truro could not find a breakthrough despite Kabia and Yassine En-Neyah having penalty appeals turned down.\n\"I thought both of them were penalties to be honest,\" Askey told BBC Radio Cornwall.\n\"It wasn't only the penalty decision that he didn't give, he started to sway towards them because he'd sent somebody off.\n\"But it was the right decision to send him off, he can't then try and level it up because he's sent somebody off.\n\"You might say 'you should come away and score from open play', but if you're getting fetched up when you're in front of goal and about to shoot, decisions like that at this time of the season can cost you.\n\"It is still in our hands and it's a great position to be in at this time of the season, and we just get over this now.\n\"I'm not disappointed with the players' effort and how they played, sometimes things don't quite go for you in certain games.\"", "url": "https://www.bbc.com/sport/football/articles/cvg5gqdqn37o"}