{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:50:14", "date_modify": "2025-05-20 11:50:14", "date_publish": "2023-08-07 08:07:30", "description": "Rosenborg extend winning run ahead of Hearts tie", "filename": "sport_articles_c9r1214rvqeo_1747741814.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c9r1214rvqeo_1747741814.html", "title": "Rosenborg extend winning run ahead of Hearts tie", "title_page": "Rosenborg extend winning run ahead of Hearts tie - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Like Thursday's visitors, Heart of Midlothian, Rosenborg enjoyed a domestic win ahead of their meeting in the third qualifying round of the Europa Conference League.\nThey fell behind 11th-placed Haugesund to a goal from Mali striker Sory Ibrahim Diarra after only three minutes, but defender Hakon Rosten equalised after 66 minutes and forward Magnus Holte grabbed the winner a minute from time.\nDespite it being Rosenborg's sixth game without defeat after a third consecutive win, they only lie eighth in Norway's top flight, 16 points adrift of leaders Bodo/Glimt after 18 games.\nWith the draw for the Conference League play-off round being made on Monday, Hearts could face a re-match with Italian side Fiorentina, who beat them home and away in last season's group stage, should they progress.\nSvein Maalen, the Rosenborg development coach who has been in interim charge for nine games since June, replaced Norway capped Andre Hansen with 20-year-old Sander Tangvik in goal after their 3-2 extra-time second-leg win over Crusaders.\nMeanwhile, midfielder Sverre Nypan and striker Ole Sæter, who were both substituted late on against the Northern Irish side, did not feature against Haugesund.", "url": "https://www.bbc.com/sport/articles/c9r1214rvqeo"}