{"authors": ["Chris Jones", "www.facebook.com"], "date_download": "2025-05-21 07:27:11", "date_modify": "2025-05-21 07:27:11", "date_publish": "2025-03-28 14:00:33", "description": "RFU chief executive Bill Sweeney survived a no-confidence vote at Thursday's special general meeting - what does the future hold for English rugby now?", "filename": "sport_rugby-union_articles_cedldyjel5lo_1747812431.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3e1d/live/d9ccca00-0bd2-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cedldyjel5lo_1747812431.html", "title": "Bill Sweeney: What next for English rugby after RFU chief executive survives no-confidence vote?", "title_page": "Bill Sweeney: What next for English rugby after RFU chief executive survives no-confidence vote? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "\"The time for division is behind us. The time for collaboration is now.\"\nRFU interim chair Sir Bill Beaumont was quick to look to the future after the special general meeting (SGM) where chief executive Bill Sweeney faced - and survived - a vote of no confidence.\nThe meeting was a highly significant event for English rugby - the first of its kind in 20 years and an opportunity for the game at all levels to hold the powers-that-be to account.\nBut despite the uproar inside and outside Twickenham that followed Sweeney's £1.1m pay packet in the autumn - and the various perceived governance failures of the past few years - the 67-year-old has been given a clear mandate by the game to continue in his role.\nBut what happens next and what does the future hold for the game at all levels?\nBBC Sport answers some of the key questions.\nWith more than 700 votes cast on Thursday - from clubs at all levels, constituent bodies, unions and various individuals - this was one of the biggest turnouts in recent memory, with just under 66% of the votes opposing the motion and backing Sweeney.\nThe embattled chief executive had some big-hitters in his corner. Since coming in as interim chair just before Christmas, former England captain Beaumont has been on a mission to convince the game Sweeney must stay - and the roadshows the pair have been on in the community game have paid off.\nHighly-respected board member Wayne Barnes was another to strenuously defend Sweeney's record. Barnes opposed the motion at the SGM and told the BBC afterwards losing Sweeney would have \"damaged the game\".\nMeanwhile, the RFU president Rob Udwin, who chaired the meeting, made it clear where his loyalties lay.\nHowever, whether an RFU president should be quite as openly and determinedly partial was a matter of consternation for some in attendance.\nDespite suggestions before the SGM that it would be just the start, not the end, of the rebellion, Sweeney's opponents struck a more conciliatory tone when they spoke to the BBC afterwards.\nThey stressed that forcing the SGM and making the RFU board answerable to the game at large was a victory in itself.\nMeanwhile, a second motion, which the board brought forward, to devolve more responsibility to the community game seems to have gone a long way to quelling the uprising.\n\"We want to work together,\" said Paddy McAlpine, chair of Chichester Rugby Club and co-chair of the Whole Game Union (WGU).\n\"What is really encouraging about tonight is that all those rugby players across the nation from the smallest club up to the Championship now have a voice.\n\"And we will hold those responsible for the leadership of our game to account. We look forward to all the changes and improvements that they are going to put in place.\"\n\"This was never really about one individual,\" added Alistair Bow, chairman of Championship club Nottingham and co-chair of the WGU.\n\"We felt the game was suffering to the point that we needed to have a look at the top. We went to the game and the vote has been cast.\n\"But actually we got what we needed. There was no winner and loser from the outset, but what we have done is we have taken our plight to the whole game.\n\"The game has had an opportunity [to voice concerns] and there were some very interesting questions raised in there tonight.\n\"And you could see there was a good percentage of people voted for him to go.\"\nSurprisingly, Sweeney's whopping pay packet and bonus was barely discussed throughout the 90-minute meeting, despite it being the catalyst that rallied the grassroots in the first place.\nA report by consultants Freshfields into the controversial bonus plan was published by the RFU in February and while this report threw up more questions than answers, especially around the metrics and methods of the scheme, it has done enough to turn attention elsewhere.\nWhat is clear from the questions raised at the meeting and from the nationwide roadshows of the past few months is how the grievances vary - from the Championship clubs unhappy at their funding cuts and blocked routes to the Premiership, to the rank-and-file referees put in an invidious position by the union's bungled tackle-height change.\nMeanwhile, some community clubs have spoken about how they don't feel represented while other clubs have cited the lack of rugby expertise – in their opinion – on the RFU board, as well as ongoing concerns about the sustainability of the professional game.\nIdeological conflicts over what the RFU is, who it serves and who should make decisions still remain.\nBut without the revolt, Sweeney and Beaumont wouldn't have embarked on the roadshow and may have remained shielded to the various gripes felt up and down the English rugby pyramid.\n\"We have had thousands of conversations in clubhouses up and down the country in recent weeks,\" explained Beaumont.\n\"Some feedback has been hard to hear but most of it has been constructive. We have listened. We have responded.\n\"It is absolutely right that members should always have the opportunity to hold the leadership of the RFU to account. That is part of our democratic process as a membership-owned organisation.\"\nAccording to Barnes, an RFU board member since September, Sweeney is valuable to the point of being irreplaceable.\n\"The question I have asked myself over the last few months is: is Bill the right person to lead this organisation?\" the former World Cup referee added.\n\"The answer is categorically yes. That's what I said to the members today. He is someone who leads our game, who leads the game across the world. To lose him would have damaged our game.\"\nSo with the RFU board squarely behind him and the wider game backing him too, Sweeney's hand has been strengthened, although the Twickenham executive team would be wise to heed the residual resentment from RFU foot soldiers, who faced stressful job losses while their bosses pocketed record bonuses.\nMeanwhile, the appointment of the next permanent chair is crucial, with Beaumont's interim role ending in the coming months. The RFU have a shortlist for his successor, with a decision expected in time for June's annual general meeting.\nThe previous chairman, Tom Ilube, is a highly-impressive businessman but was an aloof figure to many. The genial Beaumont, an English rugby grandee, has done his job in building bridges with the community game.\nWho is appointed to chair the organisation long-term - and in the process hold the RFU board and CEO to account - will be critical.\nAccording to senior RFU figures, these governance reforms are a \"once-in-a-lifetime opportunity\" to revolutionise the running of the game.\nCurrently, almost all decisions that impact clubs are made in Twickenham but the RFU believes it now has a mandate to modernise the governance and give far greater flexibility for local areas to run the game as they see fit, with less centralised control over matters including where money is invested and league structures.\n\"We will give local clubs a more direct voice and influence in a new devolved structure,\" explained Beaumont.\n\"We will embark upon this process with renewed vigour in the months between now and the Annual General Meeting.\"\n\"I am encouraged because the RFU have committed themselves to a period of change, proper change,\" said the WGU's McAlpine.\n\"They are going to commit to that change and consult about that change and we are going to be involved in that change. So that has to be a good thing.\"\nAway from the grassroots, Beaumont also pledged a renewed focus on making the professional game sustainable and working with the Championship, whose clubs were a driving force behind the rebellion.\n\"We are all going to have to work very hard together because this is being monitored,\" added Nottingham's Bow.\n\"I am not downhearted. At the end of the day we have something to work with. The RFU have made some big commitments tonight.\n\"I have heard some positives but time will tell about whether they are going to be able to deliver.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/cedldyjel5lo"}