{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:51:27", "date_modify": "2025-05-20 14:51:27", "date_publish": "2023-07-27 16:18:39", "description": "The Football Association lays out plans to recruit 50% more referees from \"historically under-represented\" backgrounds and reduce abuse.", "filename": "sport_football_66330001_1747752687.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/A4FB/production/_130553224_gettyimages-80171258.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66330001_1747752687.html", "title": "Football Association issues plan to boost referee safety and diversity", "title_page": "Football Association issues plan to boost referee safety and diversity - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The Football Association has laid out plans to recruit 50% more referees from \"historically under-represented\" backgrounds by 2026.\nIt means the governing body plans for an increase of 1,000 women referees and 1,000 black or Asian referees at all levels of football in three years.\nThe FA also wants to ensure those rises are reflected in the professional game.\nAs well as improving diversity, the FA's new strategy outlines steps for tackling the abuse of referees.\nThey include continuing a trial of body cameras on grassroots referees, and points deductions for teams \"if their players or coaches commit repeated offences of serious misconduct\".\nThe strategy, called 'To Grow, Guide and Govern', was released on Thursday and has four key areas:\nCurrently, 8% of officials are of black or Asian ethnicity, but only 3% in professional football. No black or Asian referee has taken charge of a Premier League game since Uriah Rennie's final match in 2008.\nFemale referees also account for 8% of officials, compared with just 2.5% in elite-level football.\nThe target by 2026 is to raise that to 10% in both groups.\nFootball anti-racism group Kick It Out said it welcomed the FA's \"commitment to make refereeing a more inclusive and safe environment for women and those from traditionally under-represented groups\".\n\"Improvement has been desperately needed in this area,\" it added.\nSteps to boost diversity will include a new bursary fund for those from under-represented backgrounds looking to become referees.", "url": "https://www.bbc.com/sport/football/66330001"}