{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:29:49", "date_modify": "2025-05-21 07:29:49", "date_publish": "2025-01-03 22:45:42", "description": "H&W Welders manager Paul Kee praises his team despite losing 4-2 to Glentoran in the Irish Cup fifth-round tie at Blanchflower Stadium.", "filename": "sport_articles_cdjg4rmlmj9o_1747812589.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/353b/live/00a5dce0-ca27-11ef-a93b-571596df0d47.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cdjg4rmlmj9o_1747812589.html", "title": "'We were magnificent' - Welders boss Kee on Glens defeat", "title_page": "Irish Cup: 'We were magnificent' - Welders boss Kee on Glens defeat - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "H&W Welders manager Paul Kee praised his team despite losing 4-2 to Glentoran in the Irish Cup fifth-round tie at Blanchflower Stadium.\nThe Championship hosts led their east Belfast neighbours 2-1 before the in-form Glens fought back to secure victory.\nJames Singleton headed the visitors in front before a Ewan McCoubrey double put the Welders on course for a huge upset.\nDavid Fisher levelled for the Premiership outfit and a Lewis Patterson own goal was followed by Frankie Hvid sealing Glentoran's place in the next round.\n\"I thought we were excellent - excellent in the first half, controlled large parts and again I thought we were excellent in the second half,\" said Kee.\n\"But we can't give goals away the way we did. The second, third and fourth [goals] were really disappointing individual errors.\n\"However, as a team I thought we were magificent - we moved the ball, passed the ball, played good football but they had a bit more nous and a bit more quality and that's where we lacked in individual moments.'\n\"I said to the boys 'how did we lose that match 4-2?'. They will be disappointed. It's a case of picking them back up but they will take heart from the performance.\"", "url": "https://www.bbc.com/sport/articles/cdjg4rmlmj9o"}