{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:47:19", "date_modify": "2025-05-21 07:47:19", "date_publish": "2025-03-28 07:52:36", "description": "Charley Hull shoots an impressive nine-under-par round of 63 to take a one-shot lead into the second round of the Ford Championship.", "filename": "sport_golf_articles_cn040x5z6lro_1747813639.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/aeb4/live/f7fbecf0-0ba4-11f0-9344-957e0d9fa61c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_golf_articles_cn040x5z6lro_1747813639.html", "title": "LPGA: Charley Hull has one-shot lead in Ford Championship", "title_page": "LPGA: Charley Hull has one-shot lead in Ford Championship - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ford Championship first-round leaderboard\n-9 C Hull (Eng); -8 NK Madsen (Den); -7 SY Kim (Kor), B Henderson (Can), J-H Im (Kor), M Lee (Kor), M Katsu (Jpn), A Doherty (US), P Chien (Tpe), I Yoon (Kor)\nSelected others: -5 N Korda (US); -2 C McGinty (Eng), L Maguire (Ire); -1 G Dryburgh (Sco); E J Ewart (Eng); +2 G Hall (Eng)\nFull leaderboard\nEngland's Charley Hull shot an impressive nine-under-par round of 63 to take a one-shot lead into the second round of the Ford Championship in Arizona.\nHull started her bogey-free round on the back nine, picking up four shots before the turn and birdieing five holes down the stretch.\n\"I kind of tweaked my driver at the beginning of the week and I really, really, really hit it well today,\" said Hull, whose last LPGA win came in 2022.\n\"I felt like that put me in a lot of good positions. I was hitting it good and felt confident. I just felt good out there.\"\nHull leads Nanna Koerstz Madsen by one after the Dane bogeyed the par-four fifth hole, while eight players are tied on seven under.\nDefending champion and world number one Nelly Korda shot 67 on her return from a six-week break, leaving her tied for 17th place.\n\"When you take that much time off and you come back into competition, you're rusty, [you feel] a lot more nerves,\" Korda said.", "url": "https://www.bbc.com/sport/golf/articles/cn040x5z6lro"}