{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:02:39", "date_modify": "2025-05-20 14:02:39", "date_publish": "2023-07-30 12:58:42", "description": "Jonathan Rea says he will make a 'clear decision' on his future in racing after a win and two podium places in the World Superbike round in the Czech Republic.", "filename": "sport_northern-ireland_66354733_1747749759.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7898/production/_129627803_mediaitem129627802.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_northern-ireland_66354733_1747749759.html", "title": "World Superbikes: Jonathan Rea considering future after successful weekend in Czech Republic", "title_page": "World Superbikes: Jonathan Rea considering future after successful weekend in Czech Republic - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jonathan Rea says he will make a 'clear decision' on his future after a win and two podium places in the World Superbike round in the Czech Republic.\nThe 36-year-old six-time champion from Ballyclare lies third in the 2023 series going into a six-week break.\n\"My heart has to be in it - this is a tough enough job at the best of times,\" he told World Superbike.\n\"I need to make a clear decision in my brain and in my heart on what's good for me.\"\nThere has been speculation that Rea could exit his Kawasaki contract a year early to retire while he's also been linked with a possible move to the Pata Yamaha team next season.\nRea followed up his first win of the season on Saturday with two podium finishes on Sunday.\nThe Ballyclare rider battled with Toprak Razgatlioglu for victory in the sprint race but had to settle for second place - they were followed in by championship leader Alvaro Bautista.\nRea was on course for another second-placed finish in race two but was pipped on the line by Danilo Petrucci.\nBautista's title challenger Razgatlioglu crashed out with six laps remaining to allow the Spaniard to win with ease.\nHe set a new record of 18 wins in a season and leads Razgatlioglu by 74 points with Rea well back in third.", "url": "https://www.bbc.com/sport/northern-ireland/66354733"}