{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:51:28", "date_modify": "2025-04-26 03:51:28", "date_publish": "2025-03-05 11:53:57", "description": "Brighton news: Paul Barber on latest financial accounts", "filename": "sport_football_articles_cly81l577jwo_1745639488.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f9a5/live/8e9f6ae0-f9af-11ef-b257-2b725ccbdd87.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cly81l577jwo_1745639488.html", "title": "Brighton news: Paul Barber on latest financial accounts", "title_page": "Brighton news: Paul Barber on latest financial accounts - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Brighton and Hove Albion deputy chairman Paul Barber says \"everyone can be proud\" of Brighton's financial accounts for the 2023-24 season.\nSpeaking on BBC Radio Sussex's Albion Unlimited podcast, Barber said: \"It is the highest turnover in the club's history, the third consecutive year of profit and the fourth year of profit in eight seasons in the Premier League.\n\"We have been advised by Kieran Maguire [a football finance expert] that these results make us the fourth most profitable club in the Premier League history. That is a 'wow'.\n\"We have been able to deliver these results while maintaining a degree of consistency on the pitch. We have been able to replace the players that have been sold - those players have been able to adapt very quickly to life in the Premier League.\n\"These results are the culmination of the hard work of people all across the club on and off the pitch - every department plays a part. The staff and the fans can be really proud.\n\"We cannot afford to stand still and pat ourselves on the back. It is nice to receive compliments, but at the same time there is a lot more work we have to do to maintain this position we have created.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cly81l577jwo"}