{"authors": ["Pat Nevin", "www.facebook.com"], "date_download": "2025-05-21 06:45:51", "date_modify": "2025-05-21 06:45:51", "date_publish": "2024-12-24 08:38:59", "description": "Tottenham: Pat Nevin on Ange Postecoglou's Spurs", "filename": "sport_football_articles_c3wezdnex27o_1747809951.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e264/live/50e216c0-c1cf-11ef-a2ca-e99d0c9a24e3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c3wezdnex27o_1747809951.html", "title": "Tottenham: Pat Nevin on Ange Postecoglou's Spurs", "title_page": "Tottenham: Pat Nevin on Ange Postecoglou's Spurs - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "You friend says to you \"I am driving to work the same way as usual today\", but you tell him that one of the roads has changed overnight to a one-way street going the opposite way. How do you react when he proclaims, \"I always drive that direction, so I will just drive that way anyway\".\n\"But the circumstances have changed,\" you plead. \"It will end up in a car crash, there will be casualties.\"\nAnd so we come to Spurs against Liverpool at the weekend. A weakened back line and a phenomenal Liverpool team with a particularly strong attack, conspired against Spurs, but Ange was still willing to take the hit.\nNot unlike the infamous all-out attack and high line against Chelsea when they went down to nine men, Ange is not for turning whatever the oncoming traffic looks like.\nHad I been a player in any of those Spurs catastrophes, I would have felt like a passenger looking at the driver thinking, \"are you sure you know what you are doing? Do you care about the damage to us?\"\nAnge's approach is spectacular to watch but he needs more players to make it work.\nJust like an RTA happening in front of you, it is impossible not to look but remember the past four domestic games have a combined score of 15-13. With a fully fit squad, or just some trustworthy back up, it might have been even better and even more exciting.\nI am already looking forward to the Arsenal v Spurs game in January, it will be carnage. Maybe I would feel different if I was a Spurs fan, but long live Ange's days behind the wheel on this demolition derby - although maybe, just maybe, he could quietly slip a seat belt on now and again.", "url": "https://www.bbc.com/sport/football/articles/c3wezdnex27o"}