{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:34:29", "date_modify": "2025-04-26 07:34:29", "date_publish": "2025-02-27 15:48:53", "description": "The NFL reveals that Irishmen Mark McNamee and Ross Bolger are among five players added to the 2025 International Player Pathway programme.", "filename": "sport_american-football_articles_cdx22y07wr5o_1745652869.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3ec3/live/9b18bbb0-f521-11ef-9339-81d4ea72d09f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_american-football_articles_cdx22y07wr5o_1745652869.html", "title": "NFL: Mark McNamee and Ross Bolger added to 2025 International Player Pathway programme", "title_page": "NFL: Mark McNamee and Ross Bolger added to 2025 International Player Pathway programme - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The National Football League has announced that Irishmen Mark McNamee and Ross Bolger will be two of five specialists joining the International Player Pathway programme for 2025.\nMcNamee, 25, moves from gaelic football after previously playing for Dublin club Ballyboden St Enda's.\nFormer Laois under-20 gaelic footballer Bolger joins up after the 23-year-old had a successful season of college football as punter/kicker at Idaho State University.\nOn Wednesday, McNamee and Bolger performed in front of NFL scouts at the 2025 NFL Scouting Combine in Indianapolis.\nGerman punter Bastian Roppelt, German kicker Lenny Krieg and Italian kicker Jonata Loria are the other three specialists joining the 2025 IPP class, with the initial 14-strong group announced in December.\nThey hope to follow in the footsteps of former Down gaelic footballer Charlie Smyth, who secured a place on the New Orleans Saints practice squad via the programme in 2024.\nEstablished in 2017, the IPP programme aims to provide elite international athletes with the opportunity to compete at the NFL level, improve their skills and ultimately work to earn a spot on an NFL roster.\nSmyth's hopes of forging an NFL career remain alive after he signed a new contract with the Saints last month, which guarantees him at least another off-season with the team.\nIn November, Derryman Jude McAtamney became the first Irish-born placekicker to feature in a regular season NFL game since 1985 when he made his New York Giants debut in a game against the Washington Commanders.", "url": "https://www.bbc.co.uk/sport/american-football/articles/cdx22y07wr5o"}