{"authors": ["Kheredine Idessane", "www.facebook.com"], "date_download": "2025-05-21 05:51:26", "date_modify": "2025-05-21 05:51:26", "date_publish": "2025-04-02 09:36:15", "description": "Manchester United's Emma Watson discusses the \"scars\" she bears from her year-long absence as she prepares to return to the Scotland squad.", "filename": "sport_football_articles_cn7xyp5n0jeo_1747806686.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/41ab/live/da04eac0-0f24-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cn7xyp5n0jeo_1747806686.html", "title": "Women's Nations League Scotland v Germany: 'You can change your mindset & narrative'", "title_page": "Women's Nations League Scotland v Germany: 'You can change your mindset & narrative' - Emma Watson - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "\"Scars tell you where you've been, not where you're going.\"\nThe words of 19-year-old Emma Watson reveal a very mature head on relatively young shoulders. She was even younger - just 17 - when her world appeared to fall apart.\nA month after clinching a dream move to Manchester United from Rangers, she ruptured the ligaments in her right knee in a training session with Scotland.\nIt was not just a big match with England she missed. Anterior cruciate ligament injuries mean you're out for a year.\nThe past six months, however, have helped put a smile back on her face. Her delayed debut for the Red Devils happened against Everton late last year. The Toffees were so impressed, they signed her on loan in January.\nThe goal-scoring midfielder is also now back in the Scotland fold, licking her lips at the prospect of two cracks at Germany, the third best team in the world, in the Nations League.\nWatson is about to find out if she has come through her injury a better player. What she harbours no doubts about is how much stronger the ordeal has made her as a person.\n\"At the time, I was absolutely devastated,\" she told BBC Scotland.\n\"I thought that was it for me. That my world was ending. But you can quickly change your mindset and change the narrative of your story. I'm a big believer that scars tell you where you've been, not where you're going.\n\"It was definitely a blip in my career, but at the same time, I don't think it was time lost. In the 12 months I had off the pitch in the gym rehabilitating, I really worked on my mental side. I think I've become a lot more resilient and developed stronger physically.\n\"So I think there are definitely a lot of positives to take from the experience and a lot of learnings. As bad as it was, I don't think I would change the experience. You have to go through everything in life and that was an obstacle I had to deal with.\n\"Now that I'm back from that, it's about taking the learnings from that, getting back playing, trying to work those levels back up again and just continue my story.\"\nThe scar is still there, visible right down the middle of her right knee. A symbol of her successful struggle with adversity.\n\"I look at it some days and you think back and it makes you a bit sad about what you've been through,\" she explained.\n\"But it's a warrior wound and I'm very proud of the hard work that I've put in to get myself back playing football, because it's not a guarantee.\n\"I have to be the one in the gym every day doing the work, so I'm just very grateful that I was surrounded by such supportive people at United - the physios, the staff, the players. I wouldn't have done it without them.\n\"Even the support from the Scotland national team, like the psychologists, working with them and having people to talk to was massive. I'm happy that I'm back now. \"\nNot just back but back in the Scotland squad. She made quite the impression before her injury, scoring three international goals as a 17-year-old in her first four matches for her country.\nPerhaps no surprise, given she was playing - and scoring - for Rangers as a 15-year-old. However, it was the national colours, not club affiliations, that she dreamt about as she grew up in Edinburgh as a child.\n\"One of my earliest dreams was to play for Scotland,\" she said.\n\"I don't really remember thinking I wanted to play for this club or that club. It was more, 'I want to play for the Scotland national team one day'.\n\"As a young girl, I used to go to all the games and travel around the country to go see the likes of Claire [Emslie] and Caroline [Weir] when I was younger. I used to sit and watch and say, 'I really hope that's me one day because they're living the dream'.\n\"It's massive now that we have all these top players that young girls can look up to and we can go to the games and see. That visibility is massive for getting young girls into sport, getting them into football and hopefully following in their footsteps one day.\n\"Even going to tournaments. I was at the World Cup [in France in 2019] as a young player watching that.\n\"It's just an amazing feeling. I can imagine being at a World Cup and hopefully one day I can get to experience that. \"\nIt is a hope that will be echoed up and down her country. Scotland have not been to one since 2019 and will not be participating at this year's Euros either.\nNow restored to full fitness and armed with much greater mental fortitude as a result, Watson is convinced good times lie ahead for the national side.\nShe has the \"warrior wound\" to prove she can overcome adversity. She knows Scotland will need the same fighting spirit when Germany come calling on Friday.", "url": "https://www.bbc.com/sport/football/articles/cn7xyp5n0jeo"}