{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:20:06", "date_modify": "2025-04-26 04:20:06", "date_publish": "2025-03-03 16:00:39", "description": "Wrexham: Eoghan O'Connell says Dragons relishing League One promotion run-in", "filename": "sport_football_articles_c743qy873n8o_1745641206.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/66f0/live/49f95290-f83b-11ef-b77d-adf8244f4020.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c743qy873n8o_1745641206.html", "title": "Wrexham: Eoghan O'Connell says Dragons relishing League One promotion run-in", "title_page": "Wrexham: Eoghan O'Connell says Dragons relishing League One promotion run-in - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Wrexham go to Huddersfield Town on Tuesday (19:45 GMT) with Eoghan O'Connell insisting Phil Parkinson's squad will savour another end-of-season promotion race.\nWrexham are just two points outside League One's top two with 13 third-tier games remaining in 2024-25.\nHaving played a part in the Welsh club's promotions in the previous two campaigns, defender O'Connell believes Parkinson's team are well placed to push for a place in the Championship.\n\"I think we are in a good position,\" the 29-year-old said.\n\"We know we enjoy this part of the season and we are really excited for the run-in.\n\"There is still a long way to go, a lot of twists and turns, and I think how you deal with that, how you remain calm, is a sign of how good a team you are.\n\"We have had the two promotions, that stands you in good stead going into games that are so important.\"\nWrexham, who are third in the table, go in search of a fourth successive away league victory as they take on fifth-placed Huddersfield, who are four points behind the Dragons having played one game more.\nThe Terriers triumphed at Stevenage on Saturday – a third victory in their past four away fixtures – but have failed to win in their past six home matches and have scored only two goals at the John Smith's Stadium during that dispiriting run.\n\"At this stage of the season you really just have to look after yourselves and try to win the next game,\" added former Charlton player O'Connell.\n\"Obviously Huddersfield are always going to be a good team in this league. We had a tough game at home against them and I have no doubt it will be the same on Tuesday.\n\"But we'll be ready. We are relishing these games and this run.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c743qy873n8o"}