{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:37:02", "date_modify": "2025-05-21 03:37:02", "date_publish": "2025-04-08 00:00:00", "description": "Inter Milan are in a strong position to advance into the Champions League semi-finals after winning away at Bayern Munich in the first leg of their quarter-final.", "filename": "sport_football_live_cy8ey77l3rxt_1747798622.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9fed/live/8c866a90-14b9-11f0-a455-cf1d5f751d2f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cy8ey77l3rxt_1747798622.html", "title": "Bayern Munich 1-2 Inter Milan. Germans upset in first leg of quarter-final", "title_page": "Bayern Munich 1-2 Inter Milan. Germans upset in first leg of quarter-final - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Inter Milan struck late to put themselves in a strong position to advance into the Champions League semi-finals after winning the first leg of their last-eight tie at Bayern Munich.\nThe German hosts dominated the opening half hour with England captain Harry Kane curling an effort against the right-hand post, but they fell behind to Inter's first shot on target.\nThe Serie A leaders scored a fine goal at the end of an excellent team move in the 38th minute.\nMarcus Thuram showed great skill to jump and flick the ball into Lautaro Martinez's path with the Argentine striker firing his effort with the outside of the boot into the roof of the net.\nHowever, substitute Thomas Muller levelled in the 85th minute with a goal that looked to have saved Bayern from defeat.\nThe 35-year-old announced last week he would be leaving in the summer, ending a 25-year association with the club, and he finished from close range after Konrad Laimer's low cross.\nBut there was to be another twist with just two minutes left.\nInter quickly broke up field and Carlos Augusto's cross was converted by substitute Davide Frattesi to ensure the Italians would leave Germany with a crucial advantage.\nDefeat also ended Bayern's 22-match unbeaten home run in the Champions League, dating back to 2021.\nThe second leg at the San Siro takes place on Wednesday, 16 April with the overall winners going on to play either Barcelona or Borussia Dortmund in the two-legged semi-final.\nBayern's Allianz Arena will stage the final on 31 May.\nBayern, who are six points clear at the top of the Bundesliga, will now have to get an excellent result in Italy in eight days' time to turn the tie around if they are to keep alive their hopes of appearing in that home final.\nAnd boss Vincent Kompany was confident as he said: \"At the end I saw a lot of celebrations [from Inter Milan] but from our side it's half-time, it's 2-1 and we're motivated for the next game.\n\"The result is what it is, but it's still an opportunity for us to win in Milan. It's great to play at home, but also great to play away and we're looking forward to the game.\n\"We still feel belief we can win there and have no reason to think any different than we can do it - and we will do everything we can.\"\nKompany's side included two England internationals, Kane and centre-half Eric Dier, in their injury-affected starting line-up and will rue a host of missed chances.\nHaving cut inside on his left foot, former Crystal Palace winger Michael Olise had a low shot deflected just wide, while also having a 20-yard effort saved later on.\nKane looped a header at goal, sent a second headed opportunity wide and was free in the penalty area from Olise's pass, only to curl a finish against the post.\nThat miss proved costly as Inter got back into the match with Carlos Augusto firing into the side-netting, before the well-worked opener as Inter captain Martinez netted his seventh Champions League goal this season.\nRaphael Guerreiro shot over and Kane drilled an effort wide, before Muller, who had come on as a 74th-minute substitute for Leroy Sane, pounced for his 57th goal in the competition for the six-time European champions.\nBut a memorable moment for the veteran forward was ruined as Inter, beaten in the 2023 final by Manchester City, rallied again to retake the lead in dramatic fashion and gain a crucial advantage.", "url": "https://www.bbc.com/sport/football/live/cy8ey77l3rxt"}