{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:15:52", "date_modify": "2025-05-20 14:15:52", "date_publish": "2023-07-29 15:36:11", "description": "Hukum won the King George VI and Queen Elizabeth Stakes at Ascot as favourite Auguste Rodin came home in last place.", "filename": "sport_horse-racing_66350244_1747750552.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/14E22/production/_130583558_gettyimages-1578558342.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_horse-racing_66350244_1747750552.html", "title": "Hukum wins King George VI and Queen Elizabeth Stakes at Ascot", "title_page": "Hukum wins King George VI and Queen Elizabeth Stakes at Ascot - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Hukum won the King George VI and Queen Elizabeth Stakes at Ascot as favourite Auguste Rodin came home in last place.\nThe 13-2 shot under Jim Crowley moved up to challenge Westover for the lead in the final two furlongs and pressed on to win by a head.\nKing Of Steel finished third ahead of Luxembourg with defending champion Pyledriver in fifth.\n\"It was something special and I never felt like he would come off second best,\" Crowley told ITV Racing.\n\"The ground was good and he came alive on it.\"\nThe six-year-old, trained by Owen Burrows, had only returned from injury in May to see off the 2022 Derby hero Desert Crown in the Brigadier Gerard at Sandown.\n\"It would have to be the best day of my career,\" Burrows said.\n\"It was a great team effort to get him back after his injury. What a tough horse he had to be out there.\"\nDual Derby winner Auguste Rodin had gone off as the 9-4 favourite and had been highly fancied to challenge King Of Steel after their battle at Epsom but was trapped wide throughout.\nRyan Moore looked for a reaction on the way home but the three-year-old trained by Aidan O'Brien faded and eventually passed the post in last place.\n\"There are no excuses. Whatever happened, the power ran out and it ran out early,\" O'Brien said.\n\"He was calm in the paddock, we were very happy with him. There is obviously a reason and we'll find it. It is frustrating, but that's the way.\"", "url": "https://www.bbc.com/sport/horse-racing/66350244"}