{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:54:43", "date_modify": "2025-05-21 06:54:43", "date_publish": "2025-03-29 16:44:22", "description": "Leroy Sane scores twice as Bayern Munich go six points clear at the top of the Bundesliga with victory over St Pauli.", "filename": "sport_football_articles_c3d8djrk143o_1747810483.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f2b5/live/5ec3a040-0cb8-11f0-97e3-3568f3d0bae1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c3d8djrk143o_1747810483.html", "title": "Bayern Munich 3-2 St Pauli: Michael Olise and Leroy Sane star as hosts go six points clear in Bundesliga", "title_page": "Bayern Munich 3-2 St Pauli: Michael Olise and Leroy Sane star as hosts go six points clear in Bundesliga - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Leroy Sane scored twice as Bayern Munich went six points clear at the top of the Bundesliga with victory over St Pauli.\nEngland captain Harry Kane opened the scoring by sweeping home from Michael Olise's cross for his 22nd league goal of the campaign.\nElias Saad equalised for St Pauli 10 minutes later, ghosting past the Bayern defence and finishing into the bottom corner from close range.\nOlise provided his second assist of the game with a sublime ball over the top, which Sane controlled before firing past St Pauli goalkeeper Nikola Vasilj.\nSane produced a calm finish for his second from Kane's low cross into the box.\nSt Pauli provided a late scare deep into stoppage time when Lars Ritzka struck low and hard into the bottom corner from the edge of the area, but it proved to be a mere consolation.\nThe result means Bayern remain on course for a record-extending 34th German title with defending champions Bayer Leverkusen in second place.\nVincent Kompany's side suffered significant defensive setbacks during the international break, with Canada captain Alphonso Davies ruled out for the rest of the season due to a cruciate ligament injury sustained against the United States.\nCentre-back Dayot Upamecano is also sidelined after sustaining a knee injury on international duty with France, as Les Blues beat Croatia to reach the semi-finals of the Nations League.", "url": "https://www.bbc.com/sport/football/articles/c3d8djrk143o"}