{"authors": ["Pat Nevin", "www.facebook.com"], "date_download": "2025-05-21 06:45:25", "date_modify": "2025-05-21 06:45:25", "date_publish": "2024-12-24 08:43:18", "description": "Man City: Pat Nevin on Aston Villa's Morgan Rogers", "filename": "sport_football_articles_c3e3d50kx8do_1747809925.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f695/live/af3ed170-c1d1-11ef-aff0-072ce821b6ab.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c3e3d50kx8do_1747809925.html", "title": "Man City: Pat Nevin on Aston Villa's Morgan Rogers", "title_page": "Man City: Pat Nevin on Aston Villa's Morgan Rogers - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We all know that creeping feeling on the back of your neck, when you see something is going badly wrong and you slowly realise it might just be your fault. I wonder who is feeling this most at Manchester City just now.\nAs the first team creaks and groans with age, eyes must be on at least two of the perfect replacements, Cole Palmer and Morgan Rogers, who had literally been available under their noses for free all along, and they let them go.\nPep Guardiola bats it off as best he can and there is the old PSR argument for having sold Palmer, but in reality it is an utter embarrassment.\nIt hasn't quite reached Chelsea proportions. They once thought getting rid of Kevin de Bruyne and Mo Salah for a combined profit of around £10m, was the height of good sense. That's the gold standard of short sighted business decisions, but City's recent howler looks bad enough.\nRogers was man of the match against City at the weekend and I have heard it said that all he has to do now is up his goal count. This misunderstands his particular brilliance completely. It is the fact that he is not a purely selfish striker that sets him apart from others and why the likes of Jhon Duran and Ollie Watkins are desperate to work with him.\nThe pass for Duran's goal on Saturday was classic Rogers. Most other strikers would have shot themselves, but he knew that passing was the better percentage option for a team goal.\nThat is why it will rarely be Duran and Watkins up front together but always Rogers twinned with one of the other two. And it is why his goal scoring stats should never be considered the main thing.", "url": "https://www.bbc.com/sport/football/articles/c3e3d50kx8do"}