{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 08:03:13", "date_modify": "2025-05-21 08:03:13", "date_publish": "2025-05-19 15:33:55", "description": "Derby County chief executive Stephen Pearce says the club would not have landed John Eustace as manager if they had sacked Paul Warne earlier.", "filename": "sport_football_articles_ce824p1mq61o_1747814593.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c816/live/5ce34270-34c3-11f0-89a8-7f565660f11b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ce824p1mq61o_1747814593.html", "title": "Paul Warne delay allowed John Eustace to take Derby job", "title_page": "Paul Warne delay allowed John Eustace to take Derby job - Stephen Pearce - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Derby County chief executive Stephen Pearce says the club would not have landed John Eustace as manager if they had sacked Paul Warne earlier.\nThe Rams escaped relegation back to League One on the last day of the season having been seven points adrift at the foot of the Championship when Eustace came in on 7 February.\nThe delay in dismissing Warne was questioned by fans, who felt the club missed a chance to bring in Eustace - who had taken Blackburn Rovers into the play-off positions - earlier so he could have influenced the club's business in the transfer window.\n\"Would we have liked to do it earlier? If we had to, yes, but all of the signs told us John would not have come if we'd done it earlier and we wouldn't have got the same calibre of manager as we got in John Eustace,\" Pearce told the Rams Daily Podcast.\nAsked if he should be held accountable for the way things went wrong under Warne, Pearce replied: \"The results speak for themselves.\n\"I'm accountable to the board and to David [Clowes] but ultimately I would also say that when we made that decision with regard to making that change and appointing John Eustace, I have to be accountable for that because I was the one that put him forward, that said to David 'Let's go and get him' and that got him over the line.\n\"In terms of something going wrong, Paul got us promoted. We missed out on the last game of the season in the first season to Sheffield Wednesday to get into the play-offs.\n\"Second season we were promoted with our record points total. Paul wasn't a failure.\"\nDerby drew with Stoke City on the final day of the season to ensure safety, and now they head into the summer with a transfer budget boosted by the sale of centre-back Eiran Cashin to Brighton in January.\nSome of the fee received from the Seagulls went on bringing in replacement Sondre Langas from Norwegian club Viking, but the rest is still in the pot, says Pearce.\n\"David has been very open and clear on it, we have a budget every year,\" he said.\n\"This is how much we'll put in, and anything you generate over and above that doesn't get taken out and goes back into the pot to build for the future.\n\"We don't want to get carried away. All I will say is that the base we have got, the way we finished the season from when John came in, post the week of the build-up to the QPR game when he hadn't had time to instil his way of working, is a massively positive base for us to go forwards. His points per game tally speaks for itself.\n\"We are going to strengthen the squad and we've got a bigger budget. Our ambitions are to finish as high as possible, we're not going to put a position on it, but hopefully it will be an exciting season.\"\nFans are still waiting to hear the outcome of talks held by owner David Clowes with an unnamed investor, but Pearce says he has no intention of leaving if there is a takeover.\nHe said that he is not party to ongoing talks but added: \"I will stay at this football club until the day it's decided I'm not. I love this football club.\n\"What we've built over the last couple of years and what we're continuing to build is genuinely exciting, I believe in, but ultimately I'm not naive enough to believe that in football things can't change on a sixpence, so let's see what happens moving forward.\"", "url": "https://www.bbc.com/sport/football/articles/ce824p1mq61o"}