{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:10:08", "date_modify": "2025-05-21 04:10:08", "date_publish": "2024-12-29 00:00:00", "description": "Frank Lampard's Coventry City are held to a goalless draw at home by managerless Millwall, who are watched by Alex Neil.", "filename": "sport_football_live_c4gwv8y7vx9t_1747800608.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c4gwv8y7vx9t_1747800608.html", "title": "Coventry City 0-0 Millwall: Lampard's Sky Blues held at home", "title_page": "Coventry City 0-0 Millwall: Lampard's Sky Blues held at home - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Managerless Millwall managed to grind out a point against Coventry City watched by prospective new boss Alex Neil.\nIn a game of few chances, the Sky Blues maintained their unbeaten home record under head coach Frank Lampard, a month and a day on from his appointment.\nAs for Millwall, it has been widely reported that former Norwich City, Preston North End, Sunderland and Stoke City boss Neil is set to be appointed as the Lions' new boss.\nThe 43-year-old was in attendance at the Coventry Building Society Arena as City's draw, their second in seven games under Lampard, left them 15th, a point behind 13th-placed Millwall.\nDavid Livermore has been Millwall caretaker manager for three games since the departure of Neil Harris in early December.\nLivermore made two changes to the side that lost at Norwich last time out, bringing in George Honeyman and Macaulay Langstaff to replace Mihailo Ivanovic and the injured Aidomo Emakhu.\nThe Sky Blues won 4-0 at home to Wayne Rooney's Plymouth Argyle on Boxing Day but, without in-form Ephron Mason-Clark through injury, it was a completely different story.\nDespite enjoying 75 per cent possession, the hosts managed just one shot on target in a dismal first half.\nThe recalled Victor Torp played in Jake Bidwell, who cut back for Ben Sheaf, but the midfielder's effort was comfortably saved by Millwall keeper Lukas Jensen.\nCoventry went closest early in the second half when Jack Rudoni cut inside onto his right foot and fired an effort off the underside of the bar which came close to cdossing the line.\nLampard threw on substitutes Ellis Simms and Brandon Thomas-Asante in search of a winner - but it was to no avail as Millwall extended this season's record on the road to a sixth draw in 11 games - and still only eight goals scored.\nNeil was ironically also in attendance, as the visiting manager, the last time the Sky Blues were held to a goalless home stalemate by Stoke City 13 months ago.\nCoventry City boss Frank Lampard told BBC CWR:\n\"Millwall make it very hard for you. They're very hard to get through and you just have to stay patient.\n\"I'm only frustrated with the result - but happy with the performance and another clean sheet.\n\"You go though Millwall's results this season and you see how hard they've made it for other teams.\n\"All we can do is try to keep improving - and we have Haji Wright to come back in January. First, we have to go again at Cardiff on New Year's Day, but it's the same for everybody this time of year.\"\nMillwall caretaker manager David Livermore:\n\"We're really pleased with a clean sheet and a point.\n\"We had a tough game at Norwich on Boxing Day, where we tried to get after the ball a little bit higher up the pitch and we got hurt a couple of times, so it was important that we made sure that we were a little bit more conservative with our press.\n\"We nullified them, we made them play passes we wanted them to play and they had a really good chance in the second half but other than that I can't remember too many clear-cut chances for them.\nOn Alex Neil:\n\"I'm aware of what's going on behind the scenes but we haven't spoken yet. I'm sure when the club makes an announcement tomorrow that will happen. He had no input today.\n\"I haven't had a chance to meet him at the moment. I don't think it's a secret. It's really out of my control, and not in my train of thought.\"", "url": "https://www.bbc.com/sport/football/live/c4gwv8y7vx9t"}