{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:46:17", "date_modify": "2025-05-20 13:46:17", "date_publish": "2023-07-31 15:01:33", "description": "Denmark forward Nicoline Sorensen agrees a one-year contract extension with Everton.", "filename": "sport_football_66364328_1747748777.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2309/production/_130596980_gettyimages-1476115876.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66364328_1747748777.html", "title": "Nicoline Sorensen: Denmark forward signs one-year contract extension with Everton", "title_page": "Nicoline Sorensen: Denmark forward signs one-year contract extension with Everton - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Denmark forward Nicoline Sorensen has signed a one-year contract extension with Everton.\nThe 25-year-old joined the Toffees from Brondby in 2020 and played in 15 Women's Super League matches last season, scoring twice.\nShe has featured in both of Denmark's opening World Cup games, starting in their 1-0 win against China.\n\"I'm so happy to continue my journey with this amazing club,\" said Sorensen of her new Everton deal.\nSorensen sustained a ruptured anterior cruciate ligament (ACL) injury in September 2021 and spent 14 months on the sidelines, before making her return last season.\nNow contracted through to June 2024, she said: \"The past eight months have been fantastic, to be back on the pitch enjoying my football is an amazing feeling.\n\"Every member of staff at Everton had been so supportive during my injury rehab and I hope I can repay that support in the season ahead.\n\"My full focus for now is with Denmark and going as far as we can in the World Cup, but I can't wait to pull on the royal blue jersey once again later this year.\"\nEverton boss and fellow Dane Brian Sorensen added: \"I was really impressed with the way she conducted herself last season.\n\"To begin the season on the sidelines and then perform to the level she has over the past eight months is testament to the player and person she is.\"", "url": "https://www.bbc.com/sport/football/66364328"}