{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:05:26", "date_modify": "2025-04-26 04:05:26", "date_publish": "2025-03-03 17:27:01", "description": "Imagine being 66th out of 11 million players in the world of Fantasy Premier League (FPL) - and just 51 points off the top spot...", "filename": "sport_football_articles_cm2j6gn8l4do_1745640326.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/003c/live/13497220-f84f-11ef-8c03-7dfdbeeb2526.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cm2j6gn8l4do_1745640326.html", "title": "Fantasy Premier League: Meet the contender who is 51 points off the top spot", "title_page": "Fantasy Premier League: Meet the contender who is 51 points off the top spot - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "It is the bane of many football fans' lives.\nThe game of Fantasy Football has rarely been so popular, with supporters up and down the country wanting random players to perform in pursuit of points to beat their pals.\nNow imagine being 66th out of 11 million players in the world of Fantasy Premier League (FPL) - and just 51 points off the top spot.\nThat is the reality for 19-year-old Nathan Bannister, a Nottingham Forest fan who works as an apprentice at BBC Sport.\nHere he shares the work that has gone into taking his team, Game of Stones, into the top 0.0006% of teams worldwide, how he's been buoyed by the success of Nottingham Forest and the mental toll of doing well.\nNathan Bannister was talking to BBC Sport's Ciaran Varley\nWhen I meet new people now, I'm often introduced as the FPL guy. I've played the game for five years and this is the best season I've had by a mile. I finished around 13,000th the season before last, which is still really good, but nothing to shout about.\nIt becomes a real part of your life when you're doing so well and makes me commit more to the research.\nIn previous seasons, I'd scroll though X a bit on a Friday and then make my transfers. I wouldn't be thinking about the game all week. This season, FPL is something I consider a lot and it affects my mood heavily.\nIt's weird knowing that if I suddenly drop off, I'll lose a bit of what makes me unique.\nOver the weekend, I watch as many games as I can. If one of my players is involved, I want to see how they perform, rather than just checking how many points they've picked up afterwards.\nFor the first couple of days of the week, I'll review my decision-making process from the previous weekend.\nThen I'll look at what FPL content creators are putting out on Wednesday and Thursday.\nOn Friday, I'll look at every single club's press conference, checking who's injured. Even if the player is not in my team, I want to know.\nOn a Saturday, I do my transfers at 10:30 - right before the deadline - so I have all my information up to date.\nThroughout this whole process, I'm endlessly talking to friends and family because it's very easy to get tunnel vision. My brother's a massive FPL fan too, so we have phone calls for hours, just chatting about teams.\nI also look five gameweeks into the future, thinking about who to buy and who to get rid of. It's important to be aware of when fixtures land, because you have gameweeks where teams play twice and gameweeks in which teams don't play at all.\nI've planned to play my wildcard chip - which allows players infinite transfers - in two weeks' time. Around wildcard weeks, I will build loads of drafts of different teams and compare them side by side. I've already got about 10 draft teams that I might use.\nI trust my gut a lot too, because I try to bear in mind that it's a game and it's supposed to be fun.\nMy favourite part of FPL is the community. Everyone's passionate about the game so we're always sharing opinions and advice, trying to make the 'optimal' team. There's no hierarchy to any of it, just people coming together.\nBeing 66th in the world in FPL and Forest being third in the Premier League is the most ridiculous season I could ever imagine.\nI've also had a lot of other things happen in my life this year: I got this job and I moved from London to Manchester. I always think: 'how much has FPL improved my life?' It is football, so you can't really tell.\nThis season has changed football for me a little bit. When I watch a game, I'm now following it as an FPL fan first, football fan second. It's fun, but there is a degree to which I'll be relieved when the season is over.\nAt that point, I'll think about what's made me so successful this season. I'll probably go through the entire season and every single decision I made.\nBecause there are no international tournaments in the men's game this summer, I'll be missing football by the time the new season comes along.\nThere are people online that have ridiculous records, season on season. I'll want to prove to myself that I'm as good as I think I am, in terms of replicating my success.", "url": "https://www.bbc.co.uk/sport/football/articles/cm2j6gn8l4do"}