{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:05:58", "date_modify": "2025-05-21 07:05:58", "date_publish": "2025-03-29 00:00:00", "description": "Zian Flemming's fine free-kick is enough for promotion-chasing Burnley to secure victory over Championship play-off contenders Bristol City.", "filename": "sport_football_live_ckgdedel4n5t_1747811158.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_ckgdedel4n5t_1747811158.html", "title": "Burnley 1-0 Bristol City: Clarets maintain promotion push", "title_page": "Burnley 1-0 Bristol City: Clarets maintain promotion push - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Zian Flemming's exquisite free-kick was enough to secure victory over play-off contenders Bristol City and take Burnley back to within two points of the Championship summit and level on points with second-placed Leeds United.\nThe Clarets were dominant throughout and wasted several excellent chances to avoid a tense finish at Turf Moor.\nBut their typically impenetrable defence meant the Robins did not manage an attempt on target - with just three overall - and the hosts did not need the security of a second goal on their way to 21st clean sheet in 26 unbeaten games.\nBurnley's victory, their 16th win in 26 league games, means Scott Parker's side remain in third place with seven games remaining - two points off Sheffield United, but just behind Leeds on goal difference following their dramatic draw against Swansea City.\nBoss Parker was forced to watch from the stands following his one-match touchline ban for his red card against West Bromwich Albion.\nBut his absence made little difference as his side kept pace with the Blades, who beat Coventry 3-1 on Friday, and Leeds, who dropped two points in a nervy home draw.\nThe Robins, hoping to stretch their unbeaten league away run to six matches and extend their overall unbeaten streak to eight, started well enough with Anis Mehmeti almost getting on the end of a Jason Knight cross.\nBut from the moment Flemming's pinpoint strike flew over the wall and nestled into the top left-hand corner past scampering keeper Max O'Leary, Burnley seized control.\nJaidon Anthony could have doubled the lead after some smart link-up play with Marcus Edwards but shot straight at O'Leary, Anthony went even closer with a powerful header that was just off target from a teasing Flemming cross and a Connor Roberts strike went narrowly wide.\nMehmeti did drag an effort past the post from 20 yards in a rare City attack but it was a brief respite and Burnley remained in control on the resumption.\nA brilliant tackle from City's Rob Dickie prevented Edwards making it 2-0 from six yards out, Josh Brownhill had a shot cleared off the line and Anthony also went close.\nBut the visitors never really looked like forcing a leveller and avoiding an eighth consecutive defeat against Burnley.\nThe Robins drop to eighth, level on points with West Bromwich Albion and Middlesbrough, who are sixth and seventh respectively.\nBurnley boss Scott Parker told BBC Radio Lancashire:\n\"The main thing is we won. We were exceptional for 45 minutes. We should go in two or three-nil up\n\"We missed some big chances, but we created them and looked a real threat and a top team.\n\"In the second half, we had some big moments but didn't execute them.\n\"There is always - at 1-0, at the back end of the game - a worry. It's tricky because they have nothing to lose and load the top line with five or six players. The game can become a little bit edgy.\n\"But overall I am delighted with the way we performed. They are an in-form team and we knew it was going to be a tough test. I am really impressed with the way we performed.\"\nBristol City boss Liam Manning told BBC Radio Bristol:\n\"You want to test yourself against a good team.\n\"I am proud of the lads for fighting to the end. The group have been terrific at that this season.\n\"Burnley are a very good side with great depth, but I know we are capable of playing better so that's why there is frustration there.\n\"We blocked shots, put our bodies on the line and kept going to the end but we were a sloppy at times and a bit careless with the ball.\n\"They created a lot of chances. As the games goes on, you think 'can we nick a point here', but it wasn't to be.\"", "url": "https://www.bbc.com/sport/football/live/ckgdedel4n5t"}