{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:16:17", "date_modify": "2025-05-20 12:16:17", "date_publish": "2023-08-04 15:13:37", "description": "'These are the games you want to play in' - Baldwin relishing tough opener", "filename": "sport_articles_czdv09z85g4o_1747743377.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5597/live/5f31a2f0-32d7-11ee-a689-1b83893e90da.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_czdv09z85g4o_1747743377.html", "title": "'These are the games you want to play in' - Baldwin relishing tough opener", "title_page": "'These are the games you want to play in' - Baldwin relishing tough opener - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ross County captain Jack Baldwin still expects “the same standards” from champions Celtic despite their change of manager.\nThe defender is excited to kick off County's league campaign with a \"tough\" assignment in Glasgow on Saturday against last season's treble winners.\n\"There has been a change at Celtic and as players whenever there's change you need that time to settle, we'll still approach the game the same way we do every other game,” Baldwin told Sky Sports.\n“Last year Celtic were relentless with everything they did, will they be the same again this year? I'm not sure, it's a bit of an unknown quantity.\n\"But they've still got the bulk of the players there from last year so I've got no doubt they'll still have the same standards set among the group.\n\"It will just be whether the new manager has changed the style of play slightly, but we'll focus on ourselves as much as we can and try to show what we can do against the best team in the league.\n\"We're really excited, you've got to play the likes of Celtic and Rangers throughout the season anyway so what better day to do it than on the first day of the season.\n\"As players, they're the games you want to play in, testing yourselves against the best players, in the best stadiums with the biggest atmospheres.\"\nThe 30-year-old is focused on his own battle against Kyogo Furuhashi, the Japanese forward who scored 34 goals last term.\n\"For me, the smaller, nippier strikers are a bit more of a nightmare to play against,\" added Baldwin.\n\"He got player of the year and scored all the goals he did for a reason, he's very sharp and I've no doubt from the way he cuts about on the pitch on a Saturday that he's very hard-working [in training].\"", "url": "https://www.bbc.com/sport/articles/czdv09z85g4o"}