{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:25:19", "date_modify": "2025-05-21 05:25:19", "date_publish": "2025-01-14 16:48:00", "description": "Jamie George is \"clearly disappointed\" to be replaced as England captain by Maro Itoje after one season in the job admits England coach Steve Borthwick.", "filename": "sport_rugby-union_articles_c5y7rzdekkyo_1747805119.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d217/live/e25dc8f0-d292-11ef-87df-d575b9a434a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c5y7rzdekkyo_1747805119.html", "title": "Six Nations: George disappointed to lose England captaincy to Itoje", "title_page": "Six Nations: George disappointed to lose England captaincy to Itoje - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jamie George is \"clearly disappointed\" to be replaced as England captain after one season in the job admitted England coach Steve Borthwick.\nGeorge, 34, has led the team since the end of their run at the 2023 Rugby World Cup, but will be vice-captain to Saracens team-mate Maro Itoje at this year's Six Nations.\n\"I think Jamie is clearly disappointed as anybody would be,\" Borthwick told Rugby Union Weekly.\n\"But he's a wonderful rugby player, a fantastic person and he's always put the team first. That was the nature of the conversation - the reaction was disappointment, but always put the team first.\"\nAside from a stand-out win over Ireland in the Six Nations, England's other victories in 2024 were against Wales, Italy and Japan (twice).\nThey lost seven out of their 12 Tests overall.\nThe absence of the starting captain in the latter stages of matches, by which time George and the rest of the front row have often been replaced, was part of Borthwick's decision.\nEngland faded in the final quarter of their three autumn defeats, giving up an eight-point advantage against New Zealand, conceding seven unanswered points to South Africa and twice giving away leads in the final six minutes against Australia.\n\"I think Maro has started 84-86 games, but has only come off twice, which is an incredible figure,\" added Borthwick.\n\"It's one of the considerations and I think every coach's preference would be that the captain is there for 80 minutes. It's not the only consideration and sometimes that's not possible… but I think that would generally be the preference.\"\nNorthampton flanker Henry Pollock attended a pre-announcement meeting with England last week, but didn't make Borthwick's final squad for the Six Nations.\nThe 20-year-old, who was a key part of the England under-20 team that won junior versions of the Six Nations and Rugby World Cup last season, has impressed for Saints this season, scoring four tries in 13 matches.\nBorthwick says it is a matter of when, not if, he appears and thrives at Test level.\n\"Henry is an excellent player,\" Borthwick said of Pollock.\n\"We're intent on this guy being an England player for a very long time. Not necessarily this week or next week, we want to make sure this player in in an England shirt for a very long time.\"\nProp Dan Cole is at the opposite end of is career. The 37-year-old was left out of the squad with Leicester team-mate Joe Heyes and Sale youngster Asher Opoku-Fordjour preferred as tighthead options, but Borthwick insists Cole can still add to his 118 caps.\n\"There's always a hunger for Dan to be involved with England and help England,\" he said.\n\"I know he'd be disappointed but I also know that should we need him he'll be straight in and ready to go.\"\nOverall, Borthwick resisted making widespread changes with 32 of his 36-strong group involved in squads for the autumn internationals or listed among those that would have been in contention for the campaign had they not been injured.\nHe says that continuity is crucial for England to develop the entertaining, attacking game they want to play and they are taking lessons from their first opponents in this year's Six Nations.\n\"You see the cohesiveness and consistency they've had in the Ireland team for many years - a number of them play together at Leinster,\" added Borthwick.\n\"We have to build that cohesiveness and the way we want to play. I think point of difference is going to be around the way we attack and move the ball.\n\"You look at the athleticism and the speed this England team has and has developed through 2024.\n\"How well you know each other, how cohesive you are and how many games you've played together just helps you to be more effective as an attacking team.\"\nHear more analysis on England's Six Nations squad from Ugo Monye, Chris Ashton and Chris Jones in Rugby Union Weekly's latest episode, out on Tuesday evening.", "url": "https://www.bbc.com/sport/rugby-union/articles/c5y7rzdekkyo"}