{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:43:04", "date_modify": "2025-05-21 06:43:04", "date_publish": "2025-03-28 23:29:56", "description": "Russian Daria Kasatkina will switch allegiance to Australia after having an application for permanent residency accepted.", "filename": "sport_tennis_articles_cr727l3jp30o_1747809784.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/034e/live/b6136a40-0c2e-11f0-83be-a9aa7a823ae2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_tennis_articles_cr727l3jp30o_1747809784.html", "title": "Daria Kasatkina: Tennis player changes allegiance from Russia to Australia", "title_page": "Daria Kasatkina: Tennis player changes allegiance from Russia to Australia - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Russian Daria Kasatkina will switch allegiance to Australia after her application for permanent residency was accepted.\nThe 27-year-old, who has criticised Russia's LGBTQ+ rules and opposed the war in Ukraine, has been living in Dubai and has not returned to Russia in two and a half years.\nLast month she denied suggestions she had switched to Spanish nationality after a mix-up with the flag used next to her name at a WTA Tour draw ceremony.\nThe world number 12, who has won eight singles titles, wrote on social media: \"Australia is a place I love, is incredibly welcoming and a place where I feel totally at home.\n\"I love being in Melbourne and look forward to making my home there.\n\"As part of this, I am proud to announce that I will be representing my new homeland, Australia, in my professional tennis career from this point onwards.\n\"Obviously, there are parts of this decision that have not been easy. I want to express my thanks and gratitude to my family, coaches and everyone who has supported me throughout my tennis journey to date.\"\nKasatkina revealed she is gay in a video interview in 2022 and left Russia, which has strict laws on LGBTQ+ rights.\nAfter also criticising the war in Ukraine in the interview, a Russian politician unsuccessfully called for her to be listed as a 'foreign agent' - someone acting against Russian interests.\nLast year, she said she was expecting \"consequences\" following her actions.\nHer statement on Friday added: \"I will always have respect and fond appreciation for my roots, but I am thrilled to start this new chapter in my career and my life under the Australian flag. Thank you all for your understanding and continued support.\"", "url": "https://www.bbc.com/sport/tennis/articles/cr727l3jp30o"}