{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:17:54", "date_modify": "2025-05-21 07:17:54", "date_publish": "2025-05-20 09:43:09", "description": "Wycombe Wanderers offer a new contract to defender Joe Low as fellow Wales international Sam Vokes heads a list of six players leaving the club.", "filename": "sport_football_articles_cy755k01l3do_1747811874.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/423a/live/f0e79410-355b-11f0-bf15-094eef773db0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy755k01l3do_1747811874.html", "title": "Wycombe Wanderers offer Joe Low new deal as Sam Vokes departs", "title_page": "Wycombe Wanderers offer Joe Low new deal as Sam Vokes departs - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wycombe Wanderers have offered a new contract to defender Joe Low while fellow Wales international Sam Vokes heads a list of six senior players leaving the club.\nLow made 42 appearances, scoring four goals, for the Chairboys who finished third in League One but lost to Charlton Athletic in the play-offs.\nVokes helped the club reach the play-off final in 2022, in which they lost to Sunderland but only played nine games this season.\n\"Sam has been a wonderful ambassador for the club in many ways and his experience and character off the pitch have been hugely instrumental, even though his playing time has become limited,\" said chief football officer Dan Rice.\nFellow forwards Brandon Hanlan, Beryly Lubala and Kieran Sadlier are also leaving Adams Park, along with goalkeeper Franco Ravizzoli and former West Brom, Middlesbrough and Sheffield Wednesday midfielder Adam Reach, who was signed in February on a short-term deal.\n\"Brandon worked extremely hard to battle back from his year-long injury and that speaks volumes for his determination and resilience, while Beryly and Kieran have provided lots of bright sparks in the attack, though both have also been unfortunate with injuries,\" said Rice.", "url": "https://www.bbc.com/sport/football/articles/cy755k01l3do"}