{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:25:43", "date_modify": "2025-05-21 04:25:43", "date_publish": "2025-01-23 16:18:14", "description": "Stoke City boss Mark Robins reveals defender Ben Wilmot's leg injury is not a fracture but he will face a period of time out of action.", "filename": "sport_football_articles_c9w5gw291rlo_1747801543.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/60ee/live/8241b430-d9a5-11ef-98f3-8f799a2ac21a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c9w5gw291rlo_1747801543.html", "title": "Stoke City: Ben Wilmot's injury 'not as bad as first feared'", "title_page": "Stoke City: Ben Wilmot's injury 'not as bad as first feared' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Stoke City boss Mark Robins has revealed a leg injury to defender Ben Wilmot is not as serious as first thought but he will still face an undefined period out of action.\nThe 25-year-old was hurt by a tackle late on in Wednesday's 3-1 Championship defeat by Portsmouth.\nHaving briefly given the Potters hope by pulling a goal back after they trailed 2-0 inside nine minutes at Fratton Park, Wilmot's night ended badly when he was on the wrong end of a full-blooded challenge in injury time from home midfielder Terry Devlin.\n\"He went for an X-ray and it's cleared up that there is no fracture so that's a positive,\" Potters boss Mark Robins told BBC Radio Stoke.\n\"There is soft tissue damage and bone damage, I think, but no fracture. But there'll be bruising and he'll have a period of time out - but it won't be as long as we may have feared.\"\nWilmot has started 23 of Stoke's 28 Championship games this season, scoring twice.\nStoke have now played 14 games in 61 days since the last international break in November - and Robins admits there is no escaping the Championship's relentless, punishing schedule.\nHaving conceded his Potters side were \"bullied\" by Pompey, who rolled out \"all the dark arts\", he admitted: \"If you're playing in a lot of games like that, and as often as we are doing, you're going to pick up injuries. There's no getting away from it.\n\"You've got to fight for the right to play football in this league. And one or two look really tired, out on their feet - but you've got to be able to deal with it.\"", "url": "https://www.bbc.com/sport/football/articles/c9w5gw291rlo"}