{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:43:50", "date_modify": "2025-04-26 07:43:50", "date_publish": "2025-02-26 18:22:29", "description": "Mohamed Salah contract: Former director of research Ian Graham on Liverpool forward's deal", "filename": "sport_football_articles_cvg182d277vo_1745653430.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7af2/live/2dbf0240-f46d-11ef-aeb3-bb556fdec0fe.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cvg182d277vo_1745653430.html", "title": "Mohamed Salah contract: Former director of research Ian Graham on Liverpool forward's deal", "title_page": "Mohamed Salah contract: Former director of research Ian Graham on Liverpool forward's deal - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Liverpool's former director of research Ian Graham says he was \"surprised\" at what he discovered when Mohamed Salah last negotiated a new deal at Anfield.\nGraham helped work on the three-year contract in 2022 that saw then 30-year-old Salah extend his stay with the club until this summer.\nThe 32-year-old is now in the final months of that contract with a new deal as yet unsigned, having scored 25 goals and provided 16 assists in a remarkable 27 Premier League games so far this season.\n\"At that time, I thought I would not recommend for players of his age to sign a contract,\" Graham told a Financial Times Business of Football summit. \"But, this was the strength of the data that forces you to take an objective viewpoint. It surprises you.\n\"I was surprised at looking at his calibre of player and how they could go into their 30s [still] performing at the same level. When those players drop off, it tends to be a drop in minutes rather than in quality.\n\"We decided to give him a contract in the summer of 2022 and that was a hard piece of work.\n\"I am delighted I am not responsible for that piece of work today!\"", "url": "https://www.bbc.co.uk/sport/football/articles/cvg182d277vo"}