{"authors": ["Jack Herrall", "www.facebook.com"], "date_download": "2025-05-21 06:14:15", "date_modify": "2025-05-21 06:14:15", "date_publish": "2025-04-01 11:06:03", "description": "Kevin Nisbet hitting form at key time for Euro-chasing Aberdeen", "filename": "sport_articles_c0l0w92e4j4o_1747808055.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b8bf/live/019d8910-0ee0-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c0l0w92e4j4o_1747808055.html", "title": "Kevin Nisbet hitting form at key time for Euro-chasing Aberdeen", "title_page": "Kevin Nisbet hitting form at key time for Euro-chasing Aberdeen - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Aberdeen's return to form has coincided with one all-important factor: Kevin Nisbet is looking like his old goalscoring self.\nWith a European spot in their sights after securing top six, and a Scottish Cup semi-final against Hearts on the horizon, Scotland striker Nisbet is hitting his stride at the opportune moment for Jimmy Thelin's side.\nNisbet's double - his second brace in four games - in the 4-1 weekend trouncing of Motherwell took his tally to seven goals in his past eight matches, only one of which the Dons have lost.\nThe 28-year-old put Saturday's game to bed with a header and 30-yard stunner from a combined xG of just 0.51, but it's not just his form in front of goal that's lifting spirits again around Pittodrie.\nThe on-loan Millwall forward also created two chances for his team-mates, recovered the ball four times, and had the highest passing accuracy of anyone who played more than 45 minutes, with 19 of his 20 passes finding a red shirt.\nAll while having the fewest touches, 38, of any outfield player, showing his ability to be an effective part of the game while often doing a lot of his work off the ball.\n\"Crucial for Aberdeen has been the return to form of Nisbet,\" Sunday Mail chief football writer Scott McDermott told the Scottish Football Podcast.\n\"He was just not producing enough, or not producing the form that we knew he was capable of obviously from his Hibs days. But something seems to have clicked in the last few weeks.\n\"He's back among the goals. And when you've got that threat that can pretty much guarantee goals up front, it's obviously a massive, massive help.\"", "url": "https://www.bbc.com/sport/articles/c0l0w92e4j4o"}