{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:44:50", "date_modify": "2025-05-21 05:44:50", "date_publish": "2025-04-02 22:14:00", "description": "Brighton 0-3 Aston Villa: Unai Emery reacts to win", "filename": "sport_football_articles_cy5rlepnrp9o_1747806290.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b82f/live/b7dea120-100f-11f0-992e-13a2fb1a4046.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy5rlepnrp9o_1747806290.html", "title": "Brighton 0-3 Aston Villa: Unai Emery reacts to win", "title_page": "Brighton 0-3 Aston Villa: Unai Emery reacts to win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Aston Villa boss Unai Emery, speaking to Sky Sports: \"Every match we are facing is very difficult. More or less our challenge now is to try to be more consistent than we were before.\n\"Brighton have been very good in their matches here. The opponent was with us and we competed very well. We had enough chances to score and we were clinical.\n\"We weren't performing very well defensively and conceding more goals than usual. Today is a clean sheet and we are getting balance. Those three points are very important for the table. On Saturday we have Nottingham [Forest] and we know how difficult that will be.\n\"Try to be compact defensively and respect the opponent. Win some duels. This is the only way I know.\n\"Keep going is the message for him [Marcus Rashford]. Playing more minutes means he's getting physically better, he's scoring more goals. We're playing him as a striker and trying to compete with [Ollie] Watkins. Maybe going forward we can play them together.\n\"Try to exploit his [Rashford's] qualities. He's in the best confidence moment. On Sunday we planned to play him as a striker and he scored two goals so I decided to go again and he scored.\n\"We will analyse the match today and prepare for Nottingham Forest. The table is very tight. They are going fanatic this year. They are feeling confident, feeling so comfortable playing each match being successful.\"", "url": "https://www.bbc.com/sport/football/articles/cy5rlepnrp9o"}