{"authors": ["Andy Burke", "www.facebook.com"], "date_download": "2025-05-20 14:37:56", "date_modify": "2025-05-20 14:37:56", "date_publish": "2023-07-28 13:36:16", "description": "Rory Darge says Gregor Townsend's decision to name him as Scotland captain for Saturday's meeting with Italy took him by surprise.", "filename": "sport_rugby-union_66340211_1747751876.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/14665/production/_130575538_4ceb50ad-dbff-48f5-8e3a-2f49c5365466.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-union_66340211_1747751876.html", "title": "Scotland v Italy: Rory Darge 'didn't see' captaincy coming", "title_page": "Scotland v Italy: Rory Darge 'didn't see' captaincy coming - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Rory Darge says Gregor Townsend's decision to name him as Scotland captain for Saturday's meeting with Italy took him by surprise.\nThe Glasgow back-row will lead his country for the first time in the opener of four World Cup warm-up games.\nDarge, 23, has won seven caps and Saturday's match will be just his second appearance at Murrayfield in Scotland colours.\n\"I'm honoured, obviously, but I didn't see it coming,\" Darge said.\n\"It was pretty special when Gregor told me. It was on the Friday morning last week not long before he announced the team.\n\"I'm glad he did it on the Friday so I had time to digest it and get my head round it. I went back to tell my folks which was nice. It's been a pretty special week.\n\"I'm delighted that Gregor has picked me as a captain and sees me as a leader. I'll just do my best on Saturday.\"\nDarge missed most of last season after suffering a serious ankle injury but returned to a play a part in Warriors' run-in at the end of the campaign.\nDescribed by head coach Townsend this week as \"world class\", the former Edinburgh back-row wants to nail down his spot on the plane to France for the World Cup this autumn with Scotland up against South Africa, the defending champions, and Ireland, the world's top-ranked team, in Pool A.\n\"It's obviously why we are doing all this grafting how,\" Darge said.\n\"2015 (World Cup) is the one that I remember well, watching Benzo (Mark Bennett) scoring that try against Australia. I won't speak about what happened after! It was special watching the World Cup growing up.\n\"Pre-season has been really tough and that's obviously the goal, to go to a World Cup, which would be special. To go against the best - our group has some of the very best - would be an honour.\"", "url": "https://www.bbc.com/sport/rugby-union/66340211"}