{"authors": ["Sean Kearns", "www.facebook.com"], "date_download": "2025-05-21 03:56:00", "date_modify": "2025-05-21 03:56:00", "date_publish": "2025-04-07 13:21:53", "description": "Michal Szubarczyk is hoping to become the youngest player to qualify for the World Championships at the Crucible.", "filename": "sport_snooker_articles_c4g2evx3548o_1747799760.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c960/live/71a90e60-13ad-11f0-92ad-eb42d450dc76.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_snooker_articles_c4g2evx3548o_1747799760.html", "title": "Michal Szubarczyk - the 14-year-old gunning for Ronnie O'Sullivan's Crucible record", "title_page": "Michal Szubarczyk - the 14-year-old gunning for Ronnie O'Sullivan's Crucible record - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Michal Szubarczyk. Remember the name.\nThe 14-year-old is hoping to make history this week by breaking Ronnie O'Sullivan's long-standing record by becoming the youngest player to qualify for the World Championship at the Crucible.\nThe Pole has been making waves on the snooker circuit, winning the U16 and U18 European Championship titles in March.\nBut the teenager really caught the eye by reaching the final of the open-age event, where he was beaten by 34-year-old Liam Highfield.\nThat remarkable run was enough for Szubarczyk to be offered a two-year card on the World Snooker Tour (WST).\nHis performances earned praise from three-time world champion Mark Williams, who said the teenager was \"not far away\", external from the level of O'Sullivan at the same age.\nNow Szubarczyk is aiming to break O'Sullivan's 33-year record by qualifying for the 2025 World Championship.\nSeven-time winner O'Sullivan is the youngest-ever qualifier at the Crucible, doing so at the age of 16 in 1992. With qualifying held months in advance of the tournament proper, he was then 17 years and five months old when he made his debut at the event, losing 10-7 to Alan McManus.\nFormer champion Luca Brecel holds the record for the youngest player at the Crucible's main event, playing at the age of 17 years and 45 days in 2012.\nSzubarczyk can comfortably beat both of those records as he heads into qualifying at the English Institute of Sport in Sheffield on 8 April, with final-round matches being played on 15 April.\nThe Pole faces Scotland's Dean Young in the first round, with the winner of the best-of-19-frames tie going through to face Stan Moody.\nThe teenager needs to win four consecutive matches to earn a spot at the Crucible.\nBut a victory against Young would mean Szubarczyk becomes the youngest player to win a qualifying match at the World Championship, beating the record previously held by Liam Davies, who was 15 years and 277 days old when he beat Aaron Hill in 2022.", "url": "https://www.bbc.com/sport/snooker/articles/c4g2evx3548o"}