{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:40:02", "date_modify": "2025-05-20 11:40:02", "date_publish": "2023-08-06 21:14:08", "description": "McGowan sees 'glimpses' of Saints recovery in defeat", "filename": "sport_articles_cxep4jkzz8mo_1747741202.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cxep4jkzz8mo_1747741202.html", "title": "McGowan sees 'glimpses' of Saints recovery in defeat", "title_page": "McGowan sees 'glimpses' of Saints recovery in defeat - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ryan McGowan saw \"glimpses\" that St Johnstone can put behind them their \"shocking\" Viaplay Cup campaign despite opening the league season with a 2-0 home defeat by Heart of Midlothian on Saturday.\nThe Perth side failed to qualify for the last 16, rounding off the group stage with a 4-0 humbling at home to League 2 champions Stirling Albion.\n\"I didn't think it was a 2-0,\" former Hearts defender McGowan insisted. \"Obviously we were chasing the game at the end and it was a well-worked goal from them. Credit to Hearts - they brought on some quality in the second half and that showed towards the end.\"\nAsked what manager Steven MacLean said after their cup exit, he told BBC Scotland: \"Just to try to be hard to beat. We need to put more effort into games. Our performances were shocking to say the least.\n\"Today we showed in glimpses that we are much better than in the League Cup campaign, but at the end of the day, we still got beat 2-0 and we've still got a lot of work to do.\n\"But there's a few positive to take. We need to keep putting in performances like that and just have that little bit of quality in the final third to make sure we can open teams up and score goals.\n\"Once a few injured boys are back and the boys we've brought in can train with us for a little bit longer then I think we should be okay.\"", "url": "https://www.bbc.com/sport/articles/cxep4jkzz8mo"}