{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:55:26", "date_modify": "2025-05-21 05:55:26", "date_publish": "2025-02-08 18:34:18", "description": "Harlequins beat Ealing in the Premiership Rugby Cup and there are also wins for Bath, Northampton and Leicester.", "filename": "sport_rugby-union_articles_c4gxy89n8z4o_1747806926.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cebb/live/2c7b9640-e64a-11ef-83f8-35f434c6ab1c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c4gxy89n8z4o_1747806926.html", "title": "Quins overcome Ealing in Premiership Rugby Cup", "title_page": "Quins overcome Ealing in Premiership Rugby Cup - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Harlequins overcame Ealing 32-10 in a tightly-fought contest at the Trailfinders Sports Ground to take control of Pool C in the Premiership Rugby Cup.\nQuins got off the mark quickly, with a try from Cameron Anderson, before Ealing responded from a maul through Mike Willemse.\nBen Waghorn restored the away team's lead before a yellow card for Ealing's Tobi Wilson turned the tie decisively in Quins favour, with further tries for Sam Riley and Jack Musk sealing the win.\nIn the day's other matches, there were also victories for Bath, Northampton Saints and Leicester Tigers.\nIn wet conditions, Anderson made the home team pay for their slow start, sliding over the line with less than two minutes on the clock.\nEaling responded through Willemse's close-range effort shortly afterwards, before Waghorn dotted down, receiving the final pass following Jared Evans' delicate chip over the Trailfinders defence.\nDan Jones cut the deficit to two following a Quins infringement, before Wilson's yellow card put the home team on the back foot.\nRiley and Musk then powered over from successive driving mauls, to give Danny Wilson's side a try bonus point, before Jamie Benson's late penalties sealed the victory.\nThe result leaves Quins top of Pool C, with Saracens to come, while Ealing will need to beat London Scottish to have a chance of stealing top spot.\nIn Pool B, Leicester saw off Nottingham 57-19 in a one-sided contest at Welford Road.\nJoseph Woodward was the first to dot down for the Tigers, following Kyle Hatherall's break, before Ben Volavola exploited a massive gap in the away team's defence to go over for a second.\nFinn Carnduff got in on the act following a pinpoint kick-pass from Dan Kelly, before Finn Theobald-Thomas powered over to secure the try bonus point.\nTom Manz fought his way over the line from close range for the Tigers' fifth before Tom Whiteley squeezed through a gap to score, as the Archers appeared overwhelmed.\nLeicester understandably took their foot off the gas after such a fine start, allowing scores from Kody Vereti, Levi Roper and David Williams to halve the deficit, before a late effort from Carnduff, and a brace from George Pearson, saw the Tigers home in emphatic fashion.\nIn the other match in Pool B, Northampton Saints overcame near neighbours Coventry 50-23 at Franklin's Gardens.\nAfter a scrappy opening, Josh Kemeny forced his way over from short-range following repeated phases, before Tommy Mathews responded with a penalty.\nSaints captain Angus Scott-Young was the beneficiary of a quick tap penalty, going over for his team's second try, before Jimmy Martin responded for the visitors.\nTom Lockett then stretched his legs to run in from 30 metres and Tom Seabrook's burst for the corner secured the Saints' bonus point.\nDavid Opoku-Fordjour fought his way over to restore dignity to the scoreline, before a Saints counter-attack saw the rampaging Tarek Haffar feed Billy Pasco for a fifth.\nWill Glister and Tom West's efforts put up the half-century, before Tom Hitchcock stole through for a consolation score.\nThe Saints are in prime position in the pool, but will need a bonus point against Nottingham next Friday to ensure top spot.\nIt's all to play for in the Coventry-Leicester match, with the potential for the victor to progress as one of the three best second-placed finishers.\nIn Pool D, Bath scored eight tries to win 50-7 against Ampthill at the Rec.\nKnowing a victory would secure their place at the top of the pool with a game to spare, the home team made the best of their early pressure, scoring two tries within the first 10 minutes.\nLouie Hennessey was the first to go over, following Orlando Bailey's break, before Arthur Green powered through the middle of the Ampthill line to dot down under the posts.\nJasper Spandler added a third following a powerful driving maul, before captain Ewan Richards seized on the loose ball to dive over for a bonus point before the half-hour mark.\nFollowing repeated Bath infringements, Wilson Ijeh's swan dive secured Ampthill's only try of the day, before further tries from Green, Spandler, Tyler Offiah and Scott Kirk after the break capped off a dominant performance by the home team.\nThe result leaves Bath looking forward to the knockout stages, with Ampthill playing only for pride next weekend.", "url": "https://www.bbc.com/sport/rugby-union/articles/c4gxy89n8z4o"}