{"authors": ["Sophie Hurcom at Ashton Gate", "www.facebook.com"], "date_download": "2025-05-21 03:51:00", "date_modify": "2025-05-21 03:51:00", "date_publish": "2025-01-05 19:21:38", "description": "American superstar Ilona Maher says rugby needs more people \"connecting\" with the sport after making her debut for Bristol Bears.", "filename": "sport_rugby-union_articles_c4gj14zgekpo_1747799460.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d1d2/live/09764510-cb9b-11ef-87df-d575b9a434a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c4gj14zgekpo_1747799460.html", "title": "Ilona Maher: Bristol Bears' new USA star wants to see more superstars in women's rugby", "title_page": "Ilona Maher: Bristol Bears' new USA star wants to see more superstars in women's rugby - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Almost an hour and a half after the final whistle at Ashton Gate and Ilona Maher was still at pitchside, still posing for pictures and greeting the hordes of fans, one by one, who had waited in the cold January weather hoping to see her.\nThe American might have only played for 20 minutes of Bristol Bears' eventual defeat to rivals Gloucester-Hartpury on her debut for the home club, but her influence was bouncing around the stadium.\nBefore Maher had even stepped out on to the pitch, the impact of her arrival was being felt across women's domestic rugby union in the UK.\nNews of the 28-year-old's signing for the West country club in December created such a buzz that the Bears moved this fixture from their usual ground of Shaftesbury Park to Ashton Gate.\nIn the end, 9,240 fans came out, smashing the Bears' previous record attendance of 4,101 against Harlequins in May 2022 and setting a new Premiership Women's Rugby record for a standalone game.\n\"I saw the line of people out there [after full-time] and was like, 'I'm going to take as many photos as I can',\" Maher said.\n\"They bought a seat and that seat is going to lead to hopefully some more seats, and fans are the revenue we need to bring in to make this league bigger.\n\"It's almost - I feel - my duty. They're doing so much, so I want to do more for them.\"\nMaher is the most followed rugby union player - male or female - on social media. Her profiles have amassed more than eight million followers across Instagram and TikTok.\nHaving long been an advocate for body positivity and women's sports, since claiming bronze as part of the USA's rugby sevens side at the Paris Olympics last summer, Maher's profile has only continued to skyrocket.\nThis autumn she was a runner-up on television show Dancing With The Stars and Maher has also been featured prominently by Forbes and Sports Illustrated.\nAt Ashton Gate, a documentary crew from US production house Hello Sunshine - a company founded by Oscar winner Reese Witherspoon - was following Maher's every move for a future project.\nMaher might only be on a three-month deal with Bristol, as she switches back to XVs in the hope of selection for the USA at the Rugby World Cup this summer, but fans walked in wearing shirts emblazoned with her name across the back.\nOne had travelled about 4,000 miles with his family from Louisville, Kentucky to see the game. Another came from Washington DC.\nMaher said she was \"proud\" of the impact she has made, but rugby still has work to do to showcase more athletes in the sport.\n\"I've seen the power in it, I've seen the power of people connecting with the individual and then going to the sport,\" Maher said.\n\"If we can have more people connect with Holly Aitchison, Jaz Joyce, Evie Gallagher, that brings them in.\n\"That's my goal - I love being a superstar and people call me the superstar of rugby but that's not enough for the sport, we can't just have one superstar.\n\"We need to have more, we need to have people connecting with so many different players and that is what will grow our game.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/c4gj14zgekpo"}