{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:05:37", "date_modify": "2025-05-19 15:05:37", "date_publish": "2015-02-16 07:37:19", "description": "Inter Milan ask Rangers if they can use Murray Park before Celtic tie...", "filename": "sport_football_31484504_1747667137.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/75814000/jpg/_75814058_gossip_promo_sportfootball(2).jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31484504_1747667137.html", "title": "Monday's Scottish gossip", "title_page": "Monday's Scottish gossip - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Inter Milan, who beat Atalanta 4-1 on Sunday, have asked Rangers if they can use their Murray Park training facility to help them prepare for Thursday's Europa League last-32 match against Celtic. (Various)\nCeltic midfielder Kris Commons, who has missed the last two games because of a thigh muscle injury, insists he will give it his \"best shot\" to be fit in time to play the Italians. (Daily Record)\nInter's Xherdan Shaqiri feels he has a point to prove against Celtic after being given the nod over fellow new recruit Lukas Podolski for a place in the Europa League squad by coach Roberto Mancini. (Daily Record)\nCeltic striker Leigh Griffiths says he cannot wait to experience the atmosphere of a full Celtic Park for the Inter tie. (The Sun)\nGriffiths' on-loan team-mate Jason Denayer reveals he is hoping to return to parent club Manchester City for next season, where he hopes to play alongside Belgium star Vincent Kompany. (The Sun)\nLowland League side Spartans hope to take almost 1,000 fans to Berwick Rangers for Tuesday's Scottish Cup fifth-round replay, with 530 having already signed up to the club's £2 subsidised bus offer to Shielfield. (Daily Express)\nAberdeen striker Adam Rooney reveals that the linesman apologised to him after failing to spot that his disallowed goal in Sunday's win over Hamilton was a yard over the goalline. (Various)\nRaith Rovers midfielder Ross Callachan says his team are aiming for a league and cup double over Rangers when they host the Light Blues on Friday in the Championship, soon after knocking them out of the Scottish Cup. (Daily Express)\nScotland forward George Boyd marvels at his 84-year-old grandfather, Richard Boyd, who left Motherwell for England when he was 21 and who now wears his grandson's Scotland top around his London home. (The Sun)", "url": "https://www.bbc.com/sport/football/31484504"}