{"authors": ["Laura Scott", "www.facebook.com"], "date_download": "2025-05-21 06:14:58", "date_modify": "2025-05-21 06:14:58", "date_publish": "2025-04-01 10:50:42", "description": "A look at how horseracing conditions are categorised, how this is measured, and the impact on horse welfare.", "filename": "sport_horse-racing_articles_cdrglr40n5no_1747808098.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a9d4/live/1eb3fa30-0e1c-11f0-8331-61229d24cb73.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_horse-racing_articles_cdrglr40n5no_1747808098.html", "title": "What is 'the going' in horseracing?", "title_page": " What is 'the going' in horseracing? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "In horse racing 'the going' refers to the condition of the racing surface, essentially describing how soft or firm it is.\nIt is determined by the amount of moisture there is in the ground, but won't just come down to the volume of rainfall or artificial watering as soil structure and type can play their part.\nThe going can have a significant impact on the outcome of races as some horses perform very differently depending on the conditions.\nThere are horses who are typically better on faster ground (closer to firm), and others that will be described as 'mudlarks' (preferring heavier going), so trainers, owners, and punters will pay close attention to the going.\nIt is the responsibility of the racecourse, and specifically the clerk of the course, to provide the going description.\nIn British racing on turf, there are s descriptions of the going - hard, firm, good to firm, good, good to soft, soft, and heavy.\nBut there may be variations on the track itself, so the going could be described as 'soft, heavy in places' to communicate that variation.\nWhilst 'hard' remains an available going description, in reality if the ground is hard before a jump or flat racing fixture it will lead to abandonment for equine welfare reasons.\nOn all-weather tracks the going descriptions are fast, standard to fast, standard, standard to slow and slow.\nIn Irish racing, the term 'yielding' is used instead of 'good to soft'.\nThe going will typically be updated on the morning when entries are made, five days out from the race meeting. There is then a requirement for a fresh going description on the day when entries are declared, 48 hours before the raceday, and then on the raceday itself.\nAndrew Cooper, clerk of the course at Sandown Park and Epsom Downs racecourses, said: \"All the trainers like and appreciate an update as early as you can on raceday morning, so you are probably trying to do it by 7am.\n\"So most clerks of the course would have their first walk of the course at 6am. That means walking around in broad daylight in summer, or wandering around by pitch black in winter.\"\nIrrigation methods can be used to artificially water the ground.\nThe going is measured using a special instrument called the GoingStick, which was made mandatory at all British racecourses in 2009 with the intention of giving an \"objective numerical reading\".\n\"The industry was desperate to find an objective measure of the ground, rather than people like me walking around with a wooden stick,\" Cooper explained.\n\"It produces a statistical reading on a scale of 0-15 from the wettest to firmest - if it gives zero, you would probably be taking it in the bath, 15 would be on the M4.\n\"You take three readings at 30 locations on the circuit of the racecourse, and the probe averages them all out to give a numerical reading of the going.\n\"The probe is measuring two things - penetration and shear - and its movement in the soil replicates the action of the horse's hoof.\"\nOn a raceday itself, there is insufficient time for a clerk of the course to do a full inspection.\nHowever, the going might be changed during racing based on feedback from participants, mostly experienced jockeys.\nWelfare has become a subject of intense scrutiny in horse-racing, and Cooper said clerks of the course feel pressure not only to provide an accurate going description but as consistent a surface as possible across a whole racecourse.\n\"If there is one piece [of the course] that is unraceable or unsafe that could scupper you,\" he said.\n\"From a track point of view in terms of welfare side of things, what's important is for a racecourse to be as consistent as it can be - physically consistent - you don't want to be going from a firm to a wet patch. Consistency of surface is a fundamental aim.\"\nFor jump racing, the British Horseracing Authority (BHA) instruction is that racecourses should aim for ground officially described as 'good' for jump racing, and 'good to firm' in flat racing.\nIf the ground is too firm, then racing won't take place on welfare grounds, but is there such a thing as ground that is too wet to race on?\n\"For jump racing there is far greater tolerance and acceptance to race on deep, wet ground. You would be calling off a day's flat racing far sooner in wet conditions than in jump racing,\" said Cooper.\n\"The clerk has got to decide if this is safe, acceptable ground. Jump racing is fundamentally a winter sport, with older, stronger horses.\n\"The key element in really soft ground is if it has a bottom to it, you might put the stick in it but after six or seven inches you are hitting something sound, and that is OK.\n\"The key thing with jumping, as long as your take-offs and landings and approaches to takeoffs and landings are relatively sound, you can tolerate muddier, deeper ground in between the jumps.\"", "url": "https://www.bbc.com/sport/horse-racing/articles/cdrglr40n5no"}