{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:57:01", "date_modify": "2025-05-21 04:57:01", "date_publish": "2025-01-31 22:08:54", "description": "Jack Thorn netted a brace as Aberystwyth Town secured a vital victory over relegation rivals Briton Ferry in the Cymru Premier.", "filename": "sport_football_articles_cr7eldnjkkmo_1747803421.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/bef9/live/bc659110-e0b5-11ef-a319-fb4e7360c4ec.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cr7eldnjkkmo_1747803421.html", "title": "Cymru Premier: Aberystwyth secure vital win at Briton Ferry", "title_page": "Cymru Premier: Aberystwyth secure vital win at Briton Ferry - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Saturday, 1 February\nPenybont 0-0 Haverfordwest County: Title challengers Penybont were held at home by Haverfordwest in a goalless encounter that included 10 yellow cards. The draw put the hosts level on points, but second behind leaders The New Saints before their kick-off later in the day against Cardiff Met.\nThe New Saints 3-1 Cardiff Met: TNS moved three points clear of Penybont at the top of the Cymru Premier with victory over Cardiff Met. Adam Wilson fired the Saints ahead after just two minutes at Park Hall, although Eliot Evans equalised in the 16th minute for the Archers. Aramide Oteh struck for the third game in succession to put Craig Harrison's side back in front early on in the second half, with Danny Davies bagging his side's third. Met sit fifth in the table on 35 points.\nBarry Town United 3-1 Flint Town United: Barry secured a second successive victory since the league split to bolster their chances of earning a play-off spot. A lively opening half saw Barry go ahead through Keenan Patten in the third minute at Jenner Park, although goalkeeper Liam Armstrong turned into his own net to make it 1-1 soon after. Callum Sainty scored his first goal of the season to restore Barry's lead after the half hour mark before Patten's second of the afternoon capped off a fine win for the home side - who have a seven-point lead over Connah's Quay at the top of the Play-Off Conference. Flint are ninth, three points above the bottom two.\nBriton Ferry Llansawel 2-3 Aberystwyth Town: Aberystwyth moved within five points of safety as they secured a vital victory over relegation rivals Briton Ferry. Captain Jack Thorn put Town ahead after just four minutes at Old Road with his second goal in as many games. Kieran Williams levelled proceedings shortly after half time with his second of the season, only for Thorn to notch his second of the afternoon to put Aberystwyth back in front. Jonathan Evans gave the visitors breathing space with his side's third before Jasper Payne gave the hosts late hope. But the visitors - who remain bottom of the table - held on for just a fifth league win of the campaign as Briton Ferry sit just two points above the drop zone.\nConnah's Quay Nomads 1-0 Newtown: Connah's Quay ended their four-game losing run with a hard-fought success against Newtown. Jack Kenny struck the only goal of the contest on 17 minutes - his sixth goal of the campaign - to earn the Nomads all three points. The Robins stay 11th while Connah's Quay are eighth - seven points behind Barry.", "url": "https://www.bbc.com/sport/football/articles/cr7eldnjkkmo"}