{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:25:58", "date_modify": "2025-05-20 14:25:58", "date_publish": "2023-07-29 13:16:13", "description": "Jonathan Rea secures his first win of the 2023 World Superbike season in race one in the Czech Republic on Saturday.", "filename": "sport_northern-ireland_66348611_1747751158.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6C46/production/_130581772_jonnyrea4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_northern-ireland_66348611_1747751158.html", "title": "World Superbikes: Jonathan Rea secures first win of the season in race one in Czech Republic", "title_page": "World Superbikes: Jonathan Rea secures first win of the season in race one in Czech Republic - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jonathan Rea took his first win of the 2023 World Superbike season in race one at the Most circuit in the Czech Republic on Saturday.\nTyre choice proved crucial as the six-time world champion from Northern Ireland chose intermediates, which proved effective on a drying track.\nThe Kawasaki rider controlled the pace at the front for most of the race to win from Yamaha's Toprak Razgatlioglu.\nSeries leader Alvaro Bautista was 12th; he heads the standings by 54 points.\nThe Ducati rider had led nearest challenger Razgatlioglu by 70 points going into Saturday's 22-lap race.\nBautista had equalled the record for the most wins in a World Superbike season with his 17th success of the year at Imola two weeks ago.\nThe Spaniard was demoted to 14th place on the grid as a result of a penalty but got off to a flying start in damp conditions and was up 11 places to third by the end of the opening circuit.\nRazgatlioglu, the most successful rider at the Czech circuit in terms of race wins, had ground to make up after a disappointing start from pole position.\nItalian Axel Bassani built up a six-second lead at the front but like many of the riders in the field, including Bautista, was forced to pit to put on slick tyres as the track dried out.\nRea enjoyed a 12-second lead at the front at one stage but that was reduced to four seconds by Razgatlioglu by the chequered flag, the Turkish rider unable to reel in his rival enough to take the win.\nItalian Danilo Petrucci was third and England's Scott Redding fourth.\nIt was Rea's first race win since the final round of the 2022 championship at Phillip Island and it was the first triumph in a Saturday race this season for any rider other than Bautista.\n\"I have to remind myself it was a conditions win but I really wanted it on the grid before the race. I knew it was my chance with me starting on intermediates,\" said the 36-year-old, who moves up to third in the series.\n\"I tried to dig in in the early laps and then found myself with a huge gap which I just tried to manage.\"\nIt was a 119th victory of Rea's World Superbike career in his 399th race in the series and comes amid speculation linking him with a possible move to the Pata Yamaha team next season.\nHis 400th race will be in Sunday's Superpole race, with the second feature race of the weekend to follow that.", "url": "https://www.bbc.com/sport/northern-ireland/66348611"}