{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:42:19", "date_modify": "2025-05-21 03:42:19", "date_publish": "2025-04-06 17:42:39", "description": "IPl 2025: Sunrisers Hyderabad suffer fourth successive defeat", "filename": "sport_cricket_articles_c9qwjdw32zno_1747798939.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d364/live/f60ec0f0-130d-11f0-bb1f-752fc4c9ccf8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c9qwjdw32zno_1747798939.html", "title": "IPl 2025: Sunrisers Hyderabad suffer fourth successive defeat", "title_page": "IPl 2025: Sunrisers Hyderabad suffer fourth successive defeat  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jos Buttler was out for a duck but Gujarat Titans inflicted a fourth successive defeat on Sunrisers Hyderabad with a comfortable seven-wicket win.\nEngland batter Buttler, who made two half-centuries in his first three innings at this year's Indian Premier League, nicked his third ball behind off Australia captain Pat Cummins but the Titans still chased 153 in 16.4 overs.\nOpener Shubman Gill batted through for 61 not out, Washington Sundar added 49 and Sherfane Rutherford finished unbeaten on 35.\nIt came after Sunrisers' hard-hitting top order disappointed again in making 152-8.\nThey made 286-6 in their opening victory against Rajasthan Royals but have since failed to fire.\nTravis Head was caught for eight, fellow opener Abhishek Sharma out for 18 and Ishan Kishan 17.\nNitish Kumar Reddy top-scored with 31 and South Africa batter Heinrich Klaasen made 27 but neither were able to kick on.\nMohammed Siraj took 4-17 for the Titans on the back of 3-19 against Royal Challengers Bengaluru.\nThe win lifts Gujarat up to second in the table, level on points with leaders Delhi Capitals. Sunrisers, last year's finalists, are bottom with four defeats from five.", "url": "https://www.bbc.com/sport/cricket/articles/c9qwjdw32zno"}