{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:05:47", "date_modify": "2025-05-20 14:05:47", "date_publish": "2023-07-30 18:02:59", "description": "Boxer Tommy Fury will face YouTuber KSI in a bout at Manchester's AO Arena on 14 October.", "filename": "sport_boxing_66356029_1747749947.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/165C4/production/_130588519_bbc-sport-index-imagery-2-split-images-gradient-0276c0c1-5e00-4a8d-9da2-daddd2406dca.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_boxing_66356029_1747749947.html", "title": "Tommy Fury v KSI: Boxer to face off against YouTuber in Manchester in October", "title_page": "Tommy Fury v KSI: Boxer to face off against YouTuber in Manchester in October - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Boxer Tommy Fury will face YouTuber KSI in a bout at Manchester's AO Arena on 14 October.\nFury, 24, beat YouTuber-turned-boxer Jake Paul in Saudi Arabia in February.\nUnlike that bout, the match-up with KSI, 30, will not be sanctioned by the British Boxing Board of Control (BBBofC) as a professional fight.\nKSI, real name Olajide Olatunji, has previously fought in a variety of exhibition bouts, twice taking on Paul's brother Logan.\nLogan Paul will fight as part of the double main event on October's card against a yet-to-be-named opponent.\nFormer Love Island star Fury, the brother of WBC heavyweight champion Tyson Fury, called the fight \"easy money\" adding: \"All that is left for me to do is send this man to sleep. I'll do that inside four rounds.\"\nHowever, KSI promised to \"silence all the doubters that believe I have no chance\" in what he says is \"the toughest fight in the influencer boxing scene\".\nFury is unbeaten in nine professional fights, winning four by knockout.\nHe was expected to beat Jake Paul easily in February, but that fight went the distance and ended in a split decision in his favour.\nKSI found fame with The Sidemen and is regularly involved in sketches on their YouTube channel, which has more than 18 million subscribers.\nIn April, he was forced to apologise for a racial slur in a YouTube video, an incident which led him to take a break from social media.\nOctober's card is organised by Misfits Events who are sanctioned not by the BBBofC, but instead by a body called the Professional Boxing Association (PBA).\nThe PBA is not the recognised sanctioning body in the UK, and KSI does not hold a professional licence in the country, so the Fury bout does not count towards professional records.", "url": "https://www.bbc.com/sport/boxing/66356029"}