{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:15:48", "date_modify": "2025-05-20 12:15:48", "date_publish": "2023-08-04 15:43:03", "description": "McGregor backs Rodgers to improve Celtic and bring further success", "filename": "sport_articles_crgrpmm0kyro_1747743348.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ab1c/live/7404cb20-32d8-11ee-9217-27b202a39e56.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_crgrpmm0kyro_1747743348.html", "title": "McGregor backs Rodgers to improve Celtic and bring further success", "title_page": "McGregor backs Rodgers to improve Celtic and bring further success - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Celtic captain Callum McGregor says it is obvious how driven manager Brendan Rodgers is to replicate the success he had during his first spell in charge.\nRodgers won all seven domestic trophies on offer between taking the Celtic job in 2016 and leaving for Leicester City in 2019, and McGregor believes the Northern Irishman's passion to succeed still burns bright.\n“You have one conversation with him and you can see it in his eyes, hear it in his voice,\" McGregor said.\n\"As football people, you always want to bring success. If you’re that way inclined it doesn’t matter what you’ve won, what you’ve achieved - when you push the start button, that drive kicks in and you want to be the best, and you get that feeling when you speak to him.\n\"The more of those characters that you have in the building, it gives you a great chance for success.\n“He’s a top manager and he likes to work closely with players. His level of detail and understanding of the game will benefit everyone.\n\"The hope is that everyone will improve and continue to improve. I’m not immune to that - I’m always keen to learn. We’re a really willing bunch to learn and absorb the information that he’s got.\"", "url": "https://www.bbc.com/sport/articles/crgrpmm0kyro"}