{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:07:21", "date_modify": "2025-05-20 13:07:21", "date_publish": "2023-08-02 15:11:53", "description": "As Marta bows out at the group stage of her sixth and final World Cup, BBC Sport examines her legacy as one of women's football's greats.", "filename": "sport_football_66385925_1747746441.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1554B/production/_130617378_gettyimages-1571695062.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66385925_1747746441.html", "title": "Marta: Is Brazil legend's incredible career coming to an end?", "title_page": "Marta: Is Brazil legend's incredible career coming to an end? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Marta's sixth and final Women's World Cup ended in despair beyond her \"worst nightmares\" as Brazil failed to reach the knockout stage in Australia and New Zealand.\nA goalless draw against Jamaica saw Brazil eliminated as their Caribbean opponents reached the last 16 alongside France.\nThe 37-year-old Marta's legacy has long been cemented and she bows out as the greatest scorer in the tournament's history with 17 goals.\nAfter the game, she made it clear the early exit was a dark moment but held out hope for Brazil's future.\n\"It's hard to talk at a time like this,\" Marta said.\n\"Not even in my worst nightmares was it the World Cup I dreamed of. But it is only the beginning, the Brazilian people ask for renewal, and there is renewal.\n\"The only old one is me, most of them [her team-mates] are young girls with enormous talent, it's just the beginning for them.\n\"Marta ends here, there is no more World Cup for Marta.\"\nMarta will always be one of the most revered players in the women's game, which she has helped to put on the map.\n\"You know what's good? When I started there were no idols in women's football,\" she said on the eve of the Jamaica match.\n\"How could there be if you didn't show women's football? How could I understand that I would reach the national team and become a reference point?\"\nMarta made her World Cup debut in 2003, and although she never led them to a global tournament victory, Brazil reached the final in 2007, losing to Germany. Near-misses for her country extended to the Olympics, with silver medals in 2004 and 2008.\n\"Twenty years ago, nobody knew who Marta was at my first World Cup. Twenty years later, we have become a reference for many women all over the world, not only in football,\" Marta added.\nOverall, Marta scored 122 international goals in 189 matches, Brazil's federation said. At club level, she has played for 11 sides over 23 years, in South America, North America and Europe, being crowned World Player of the Year six times.\nShe won the Copa Libertadores - the South American equivalent of the Champions League - with Santos in 2009 and has represented Orlando Pride since 2017.\nBut her most successful spells came in Sweden, winning the league title in four successive seasons between 2005 and 2008 with Umea IK, with Tyreso FF in 2012 and FC Rosengard in 2014 and 2015.\nChelsea manager Emma Hayes, who was working for ITV, paid her own tribute.\n\"What an emotional moment for Marta. It's not the way she would want to bow out at a World Cup but what memories she has made for lots of us who have witnessed an incredible footballer over a long period of time,\" Hayes said.\n\"She deserves at least that farewell to the fans. She is one who will go down in history for all the right reasons.\"\nMarta was substituted against Jamaica after 80 minutes to rapturous applause, regretful she could not be decisive once more for Brazil, but there are not many - if any - who can match her career-long impact.", "url": "https://www.bbc.com/sport/football/66385925"}