{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:20:11", "date_modify": "2025-05-21 04:20:11", "date_publish": "2025-04-05 14:58:50", "description": "Guernsey FC keep their Isthmian League South Central survival hopes alive with a 2-0 win at bottom-of-the-table Badshot Lea.", "filename": "sport_football_articles_c78j620013po_1747801211.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cc68/live/3e603df0-1225-11f0-a820-05f89b05038b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c78j620013po_1747801211.html", "title": "Guernsey FC keep up survival hopes with 2-0 Badshot Lea win", "title_page": "Guernsey FC keep up survival hopes with 2-0 Badshot Lea win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Guernsey FC kept their Isthmian League South Central survival hopes alive with a 2-0 win at bottom-of-the-table Badshot Lea.\nThe Green Lions remain third from bottom of the table but are now four points from safety with four games to play.\nRoss Allen gave the Green Lions a fourth-minute lead when he converted Charlton Gauvain's free-kick at the near post to score in his eighth successive appearance.\nIt was another Gauvain free-kick that set up Guernsey's second goal as Jacob Fallaize stooped to head home at the far post after 33 minutes.\nSteven Sylla hit the Guernsey post with a long-range effort for the already-relegated hosts four minutes later, before Allen went close just before half-time.\nMatt Loaring almost got a third for the islanders but saw his effort go just wide of the Badshot post with 10 minutes to go.\nThe victory lifts Guernsey on to 33 points, a point behind Ashford Town and four off Metropolitan Police who were beaten 3-1 at Westfield.\n\"It was a fairly comfortable win to be honest,\" Guernsey manager Tony Vance told BBC Radio Guernsey.\n\"The pitch was awful, very bobbly, it wasn't a great game of football to be honest.\n\"But we did the job and that's the main thing because we needed to get three points, no doubt about it.\"", "url": "https://www.bbc.com/sport/football/articles/c78j620013po"}