{"authors": ["Mike Hughes", "www.facebook.com"], "date_download": "2025-05-21 07:16:40", "date_modify": "2025-05-21 07:16:40", "date_publish": "2025-05-20 10:32:36", "description": "Everton news: Toffees feel optimistic on 1995 FA Cup anniversary", "filename": "sport_football_articles_c1j5x74j3djo_1747811800.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5b58/live/9796be80-6ea6-11ef-8c1a-df523ba43a9a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c1j5x74j3djo_1747811800.html", "title": "Everton news: Toffees feel optimistic on 1995 FA Cup anniversary", "title_page": "Everton news: Toffees feel optimistic on 1995 FA Cup anniversary - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Everton fans won't be celebrating the 30th anniversary of their FA cup final success against Manchester United, because in some respects its become a source of sadness.\nAnd disappointment. Not the day itself of course, and more on that shortly, but it's because it's also the last piece of silverware that the team won. Since then there have been some near misses along the way.\nThe truth hurts sometimes and that's always the case in football, when the metrics of success are taken to their most basic level. What did you win and when ?\nAs much as they'd like to, Blues supporters can't alter those harsh, realistic facts. Nevertheless what has happened to the club in the last few months points to a new era of positivity is on the way. New owners The Friedkin Group know what's required to make things happen in a sporting sense. The decision to sack Sean Dyche probably wasn't a difficult one to make. Appointing David Moyes as his successor has proved to be an absolute masterstroke. He knows Everton, he understands Everton and in the space of four months he's transformed the team into something even the most ardent Evertonians would not have thought possible in such a short space of time. He deserves a lot of praise for that.\nWhen you look back and reflect on the events of cup final day in 1995, it's worth remembering that the Everton manager Joe Royle's first match in charge was exactly six months earlier. He took over a team that were cast adrift at the foot of the Premier League table. That season under Mike Walker they'd won one game in the previous 16 and had eight points from 14 matches. Yet somehow he'd managed to construct a new look team, that had determination, discipline and defiance at it's very core.\nSo today when Blues fans think back to Wembley stadium on 20th May 1995, they'll be more optimistic than they've been for a long, long time that maybe they can get back there and win some of the games glittering prizes again.\nCome back for part two of Mike's account of the 1995 FA Cup final at 13:00", "url": "https://www.bbc.com/sport/football/articles/c1j5x74j3djo"}