{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:31:27", "date_modify": "2025-05-19 14:31:27", "date_publish": "2017-08-13 20:05:59", "description": "Ukraine's Elina Svitolina beats Caroline Wozniacki to win her fifth title of 2017 and leave the Dane with six final defeats.", "filename": "sport_tennis_40918020_1747665087.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1EB5/production/_97316870_041081114.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_tennis_40918020_1747665087.html", "title": "Rogers Cup: Elina Svitolina beats Caroline Wozniacki in Toronto final", "title_page": "Rogers Cup: Elina Svitolina beats Caroline Wozniacki in Toronto final - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ukraine's Elina Svitolina beat Caroline Wozniacki in straight sets to win her fifth title of the year and condemn the Dane to a sixth final loss in 2017.\nFifth seed Svitolina won 6-4 6-0 at the Rogers Cup to become the first woman to win three events at the elite Premier 5 level in the same year.\nThe 22-year-old could become world number one if results go her way at next week's Cincinnati Open.\nWozniacki, seeded sixth, has lost all six finals she has played this year.\n\"It was a tough day,\" said the Dane., external \"She played well. She mixed up the pace and made it uncomfortable for me out there.\n\"Today, probably I could have used some more pace, but she played really smart today and used my pace to her advantage.\"\nAfter her victories in Dubai and Rome, Svitolina's win in Toronto takes her past Wozniacki, Maria Sharapova, Serena Williams and Victoria Azarenka as a three-time winner of Premier 5 titles in the same season.\n\"It's amazing that I achieved this, but I try to take one tournament at a time, to not think so much about all the past titles,\" said Svitolina.\n\"Of course it brings me confidence, I have the experience from those finals, but I try to take it as a new challenge and always look forward to it.\"\nThe Ukrainian was twice pegged back by Wozniacki in the first set but ran away with the final from 4-4, reeling off the last eight games in a row.\nIt was Svitolina's third match in two days, after rain delays meant she saw off both Wimbledon champion Garbine Muguruza and world number two Simona Halep on Saturday.\n\"I was very, very tired after the first game of first set, and I knew that I need to give everything because Caroline doesn't miss much,\" said Svitolina.\n\"You have to work really hard to get unforced error from her.\"", "url": "https://www.bbc.com/sport/tennis/40918020"}