{"authors": ["Tom English", "www.facebook.com"], "date_download": "2025-05-19 14:41:52", "date_modify": "2025-05-19 14:41:52", "date_publish": "2017-07-29 10:50:53", "description": "Hearts are knocked out of the Scottish League Cup after drawing with second-tier Dunfermline, who progress as Group B winners.", "filename": "sport_football_40760158_1747665712.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/12716/production/_97124557_cathro1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_40760158_1747665712.html", "title": "Hearts 2-2 Dunfermline (1-3 pens)", "title_page": "Hearts 2-2 Dunfermline (1-3 pens) - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Hearts were knocked out of the Scottish League Cup after drawing with second-tier Dunfermline Athletic, who progress from round one as Group B winners.\nDon Cowie's opener for Premiership Hearts was cancelled out by Joe Cardle's stylish finish.\nDeclan McManus fired the Pars in front but Isma Goncalves equalised before Dunfermline secured a bonus point by winning the penalty shoot-out.\nAlso in Group B, Peterhead beat Elgin City 3-0 to seal the runners-up spot.\nHowever, the Blue Toon's hopes of going through as one of the four best second-placed teams depends on either Dundee or Dundee United sustaining a heavy defeat in Sunday's derby.\nDunfermline had put five on Peterhead earlier in the group whereas Hearts lost to them. Dunfermline scored six against Elgin whereas Hearts toiled for a 1-0 win. The visitors to Edinburgh were full of confidence; the hosts stymied by lack of pace, creativity, leadership and defensive stability.\nWhat all of this means to head coach Ian Cathro's job is hard to know, but there were cries of \"sacked in the morning\" from the home support in the second half. What reason do they have to believe in him now? Cathro has been given time but nothing is improving. Those who were completely with him when he was appointed in December are deserting him fast, their faith exhausted.\nHearts, with only seven wins in 2017 so far, did take the lead when Cowie's angled shot from decent set-up play from Kyle Lafferty gave Cathro the beginning he was hoping for. The optimism was short-lived.\nTo be precise, it lasted eight minutes. John Souttar stood off Cardle and the winger took advantage, curling in a beauty past Jack Hamilton.\nHearts needed energy and trickery but the man they usually turn to, Jamie Walker, was not in the squad, left out for footballing reasons said his manager.\nAmid speculation about a move to Rangers, Cathro remarked that Walker has shown a \"drop-off\" in performance level and focus.\nIt has to be said that Walker finished last season poorly and has not been good in the early games of this season either. He has one goal in his last 18 games for Hearts.\nThe best chance the hosts had to go back in front came from a Dunfermline player - Callum Morris - who almost knocked one past his own goalkeeper only for Sean Murdoch to make a superb save.\nBoos at the break for Hearts and then, early in the new half, a second goal for Dunfermline.\nPanic-ridden defending was at the root of it, Souttar selling himself and opening up the space that Dunfermline executed with composure and precision. McManus received Callum Smith's pass and smashed in his third goal in four games in this competition.\nDunfermline were pushed back in the latter stages. As Hearts grew desperate they managed to cause the Championship side some bother, Nate Wedderburn and Cardle knocking efforts off the line in quick succession.\nHearts did get the equaliser when another deep cross sent into the Dunfermline box led to Goncalves bundling home and they could have pulled off a dramatic comeback in the dying seconds had substitute Cole Stockton not blasted wide on the turn from three yards out.\nDunfermline advanced even before the spot-kicks had taken place and Hearts were out. And how Tynecastle let Cathro know how they felt about it. Cathro cut a lonely figure at the end.\nHearts then added to the feeling of rancour inside the stadium when they lost the most meaningless of penalty shoot-outs. Jordan McGhee, Malaury Martin and Cowie could not even hit the target on a desperately bleak day. One wonders how many more of these experiences Cathro will be allowed.\nAt Borough Briggs, Paul Cairney struck an early opener for Peterhead and David McCracken headed their second before the break. Jamie Stevenson fired a third for the visitors after the break.", "url": "https://www.bbc.com/sport/football/40760158"}