{"authors": ["Sophie Hurcom", "www.facebook.com"], "date_download": "2025-04-26 06:53:43", "date_modify": "2025-04-26 06:53:43", "date_publish": "2025-02-28 16:32:09", "description": "American superstar Ilona Maher has had a huge impact on PWR, and now she will look to shine in the semi-final between Gloucester-Hartpury and Bristol Bears.", "filename": "sport_rugby-union_articles_cly33v1e4dvo_1745650423.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/92ec/live/d70df5f0-f5ca-11ef-9b68-05a34bb37cf3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_cly33v1e4dvo_1745650423.html", "title": "Ilona Maher: US rugby star's impact on PWR 'phenomenal' as Bristol face semi-final", "title_page": "Ilona Maher: US rugby star's impact on PWR 'phenomenal' as Bristol face semi-final - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "In the 16 years captain Amber Reed has been with Bristol Bears she has never experienced such a commotion as there has been since American superstar Ilona Maher joined in January.\nMaher starts on the wing again when the Bears walk out this Sunday for the Premiership Women's Rugby (PWR) semi-final against Gloucester-Hartpury.\nWhatever the result, the Bears and the wider rugby community hope the 'Maher effect' will continue to ripple through the sport long after the final whistle.\n\"The noise, the level of excitement, the social media buzz that's been around this group this season, has been the best it ever has been, the best I've ever known,\" Reed said.\n\"The impact that she's had on the game as a whole is pretty phenomenal.\n\"Our ticket sales have dramatically increased from where they were last season and it would be pretty remiss of me to not give her credit for that and what she's done to the game.\n\"But I think the most impressive thing for me is she's managed all that [and] she's just a class team-mate.\"\nMaher is the most followed rugby union player in the world on social media, with more than eight million followers on Instagram and TikTok.\nAfter helping the United States win Olympic bronze in rugby sevens at the Paris Games last summer, Maher's profile rocketed further as she appeared on Dancing with the Stars and the cover of Sports Illustrated.\nDemand was so high for tickets for the 28-year-old's first game for Bristol on 5 January - coincidentally also against Gloucester-Hartpury - that the club moved the game to Ashton Gate, where 9,240 fans set a new league attendance record.\nRecords have continued to fall. Harlequins and Trailfinders have also seen record attendances since Maher's arrival.\nThe PWR has seen a 68.5% increase in its social media followers, its YouTube subscribers have doubled, and 11 million accounts have been reached across its Instagram and TikTok pages.\n\"From a commercial point of view there's no doubt she's brought her superstar reach and power and influence with her, and she's not just brought it to Bristol or to PWR, I think she's brought it to the whole game,\" said Genevieve Shore, executive chair of the PWR.\n\"It's great to see her appearing on The One Show, or appearing on the podcasts, in the press. The rugby media want to write about her and that lifts the whole women's game and men's game.\"\nMaher built a superstar-size online profile focusing on empowering women and body positivity, and it is a message Bristol head coach Dave Ward believes she has spread to others in the team.\n\"I think it's brought a real good energy to the group, they're excited - she's loud and proud and I think again it just brings other people's personalities out and they can see if she's not afraid to be herself, then they don't have to be afraid to be themselves,\" Ward said.\n\"I think the more that people get to know the girls and the amazing women we've got in the programme, the better it's going to be for the sport.\"\nMaher's following has brought new fans to the league that may stay beyond the games she plays in.\n\"Hopefully the fans that have joined because of her [Maher] love what we do and they come back next year and we keep inspiring the next generation through our actions,\" Reed said.\nMaher will be partnered by Wales' Jasmine Joyce-Butchers on the wing. Joyce-Butchers returns to the starting XV in the only change for Bristol for the play-off match.\nGloucester-Hartpury have welcomed back England prop Maud Muir to their front line for her first appearance since January after injury, in one of four changes from their win at Harlequins last week.\nEl Perry comes in alongside Muir at loose-head, while England centre Tatyana Heard returns in the centre and Rachel Lund comes on to the wing.\nGloucester-Hartpury are two-time league champions and are chasing a record third consecutive title - they have lost only six times in 54 games over the past three campaigns.\nBut Bristol have the knowledge that they were the last team to beat them, in a 19-14 victory in November - also at Kingsholm, which has been renamed as Queensholm for the semi-final.\n\"Everyone is writing us off for this weekend. We're massive outsiders, Gloucester are heavy favourites,\" head coach Ward said.\n\"It is a bit of a 'nothing to lose' mentality, but for us it does mean a bit more than that. We know we're a team capable of rattling Gloucester and we hope to do that.\"\nWard believes it works nicely for Bristol that they are the underdogs.\nSaracens and Harlequins face off in the first semi-final on Saturday.\n\"I'm happy to talk up Gloucester until the cows come home,\" Ward said.\n\"We understand where they are. For us it's a huge task, but certainly not a task we're afraid of.\"", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/cly33v1e4dvo"}