{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:56:32", "date_modify": "2025-05-21 03:56:32", "date_publish": "2025-04-07 13:07:35", "description": "Everton news: Armando Broja on rest of season and injury recovery", "filename": "sport_football_articles_cyvqe76l1q3o_1747799792.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5b37/live/f5fce990-13b0-11f0-92ad-eb42d450dc76.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cyvqe76l1q3o_1747799792.html", "title": "Everton news: Armando Broja on rest of season and injury recovery", "title_page": "Everton news: Armando Broja on rest of season and injury recovery - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Everton striker Armando Broja says \"the best is still to come\" as he continues his return from an ankle ligament injury.\nThe Albania striker, who joined Everton on loan from Chelsea last summer, has made three appearances off the bench since being sidelined for three months, but is yet to score.\n\"I feel much better now,\" Broja told EvertonTV, external. \"I'm happy I can come back on the pitch and play pain-free. That's all I wanted - to be pain-free, to enjoy my football, play in front of the fans and try to do the best for the team.\n\"I'm 100% sure there's way more to come from me. There's still the best to come from me. There's so much more I can do.\"\nWith seven games remaining, including a trip to third-placed Nottingham Forest this weekend, the 23-year-old hopes to make a mark before the end of the season to potentially stake a claim for a permanent move in the summer.\n\"Every time you step over that white line, it's about giving your all,\" he said. \"No matter where you are, what level you're at, it's always about doing the best for yourself and for the club.\n\"It's going to be a special run-in. It's a historic moment for the club, being the last season at Goodison.\"", "url": "https://www.bbc.com/sport/football/articles/cyvqe76l1q3o"}