{"authors": ["Brent Pilnick", "www.facebook.com"], "date_download": "2025-04-26 03:51:14", "date_modify": "2025-04-26 03:51:14", "date_publish": "2025-03-05 12:01:09", "description": "Exeter prop Josh Iosefa-Scot signs a new two-year contract with the Premiership club.", "filename": "sport_rugby-union_articles_c86pgn3l31qo_1745639474.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c761/live/a858a830-f9a4-11ef-a629-ef88fbd35a13.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_c86pgn3l31qo_1745639474.html", "title": "Josh Iosefa-Scott: Exeter prop signs new deal to stay at club until 2027", "title_page": "Josh Iosefa-Scott: Exeter prop signs new deal to stay at club until 2027 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Exeter prop Josh Iosefa-Scot has signed a new two-year contract with the club.\nThe 28-year-old tight-head has made 69 appearances in all competitions since his move from Waikato in the summer of 2021.\nThe England-qualified New Zealander has been called up to the national 'A' squad this season.\nHe missed the end of last season with a toe injury, but has established himself in the Exeter side over the past few months.\n\"He's grown as the season's gone on, he's up and running now and at the moment he's our first-choice tight-head,\" director of rugby Rob Baxter told BBC Sport.\n\"He's a big guy with lots of potential, but he's a good rugby player as well.\n\"He's going to be one of those guys who I'd like to think will be a cornerstone of what we're trying to achieve.\"\nBaxter believes Iosefa-Scott, who also had a spell with Highlanders in Super Rugby, has the potential to force his way into the full England squad in the years ahead.\n\"I would like to think in the coming seasons we as a club and the squad we have, and his performances, will merit him being looked at in the future,\" he said.\n\"In the past players have come to us and they've been so far outside international recognition it's scary - even tight-heads like Harry Williams and Tom Francis came to us as tight-heads out of the Championship.\n\"They were both capped by England and Wales by the time they finished their career with us, and that's what you can do.\n\"If you can build a good squad and you can perform well together everybody starts to thrive and everybody starts to look good and people can end up with caps.\n\"What will help Josh get a cap is if we can become a good team within the Premiership.\"", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/c86pgn3l31qo"}