{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:15:58", "date_modify": "2025-05-20 13:15:58", "date_publish": "2023-08-02 14:29:01", "description": "'We won't allow cup disappointment to be a hangover' - MacLean", "filename": "sport_articles_clm1vjp3k5zo_1747746958.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3d02/live/b08db910-3140-11ee-8f52-fbf70e4bf742.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_clm1vjp3k5zo_1747746958.html", "title": "'We won't allow cup disappointment to be a hangover' - MacLean", "title_page": "'We won't allow cup disappointment to be a hangover' - MacLean - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "St Johnstone manager Steven MacLean says that he won't allow his players to be affected by their group stage exit from the Viaplay Cup.\nThe Perth outfit suffered shock defeats to Stenhousemuir, Ayr United, and Stirling Albion as they crashed out of the cup.\n\"It is not what we wanted,\" MacLean said. \"I am not going to lie, it wasn’t acceptable - you want to win the games.\n\"But we wont allow it to be a hangover, we wont allow it to have negative thoughts in our minds.\n\"We are positive. I have spoken to the players, and we know that is now gone. We have got enough quality in there to go and win games; we will be fine this season.\"\nWhen asked about pressure building following the disapointing start to the season, MacLean said: \"I think you have got use that as motivation as well. People always want to write you off. I think that is our culture in Scotland and Britain. Everybody wants to write people off, they try and build you up to try and shoot you down.\n\"I am thick skinned, I can handle criticism and I want my players to react properly to that.\n\"I quite enjoy people trying to write me off, and the players should enjoy it as well. Embrace it - go and prove people wrong.\"", "url": "https://www.bbc.com/sport/articles/clm1vjp3k5zo"}