{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:52:53", "date_modify": "2025-04-26 03:52:53", "date_publish": "2025-03-03 09:46:28", "description": "Former Real Madrid captain Sergio Ramos scores his first goal for Monterrey since joining Mexican side, while Lionel Messi left out by Inter Miami.", "filename": "sport_football_articles_c62z8njwdq0o_1745639573.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/732e/live/de88b4f0-f809-11ef-86bb-a924c748a1a8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c62z8njwdq0o_1745639573.html", "title": "Sergio Ramos scores first Monterrey goal and Lionel Messi left out by Inter Miami", "title_page": "Sergio Ramos scores first Monterrey goal and Lionel Messi left out by Inter Miami - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Former Real Madrid captain Sergio Ramos scored the first goal of his Monterrey career as the Mexican side beat Santos Laguna 4-2 at the Estadio BBVA.\nThe 38-year-old joined the Liga MX side in February after leaving boyhood club Sevilla at the end of the 2023-24 season.\nRamos, a World Cup winner with Spain in 2010, headed in a cross from a corner to put his side 2-1 in front.\nIt was the 120th goal of Ramos' club career, having netted 101 times for Real Madrid, six goals for Paris St-Germain and seven for Sevilla.\nFormer Spain international Sergio Canales put Monterrey in front again after Laguna equalised, with Mexico's Gerardo Arteaga scoring late in injury time to round off victory.\nThe win helped Monterrey climb to ninth in the table, 11 points behind league leaders Leon.\nNeymar continued his fine form since returning to Brazil as Santos beat Bragantino 2-0 to reach the semi-finals of the Campeonato Paulista.\nThe 33-year-old rejoined boyhood club Santos in February, 12 years after leaving the club to join Barcelona.\nHe opened the scoring in the ninth minute, beating Bragantino goalkeeper Cleiton Schwengber at his near post with a free-kick from the edge of the 18-yard box.\nThe forward has registered three goals and three assists since his move back to the club.\nBrazilian striker Joao Schmidt doubled Santos' lead in the second half, to set-up a semi-final fixture against either Corinthians or Palmeiras on the weekend of 8/9th March.", "url": "https://www.bbc.co.uk/sport/football/articles/c62z8njwdq0o"}