{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:41:06", "date_modify": "2025-05-21 03:41:06", "date_publish": "2025-04-06 19:50:34", "description": "The representatives of Fiorentina striker Moise Kean approach Newcastle, Arsenal prepare to pay full amount for Espanyol goalkeeper Joan Garcia, while Everton contact agent of Freiburg's Merlin Rohl.", "filename": "sport_football_articles_c0r5q9v2nnwo_1747798866.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4cd1/live/09d908d0-1308-11f0-b234-07dc7691c360.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c0r5q9v2nnwo_1747798866.html", "title": "Football gossip: Kean, Garcia, Leao, Kerkez, Modric, Rohl, Ancelotti", "title_page": "Football gossip: Kean, Garcia, Leao, Kerkez, Modric, Rohl, Ancelotti - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The representatives of Fiorentina striker Moise Kean have been approached by Newcastle, Arsenal prepare to pay full amount for Espanyol goalkeeper Joan Garcia, while Everton have contacted agent of Freiburg's Merlin Rohl.\nNewcastle have made direct contact with the agent of Fiorentina striker Moise Kean about a summer move, with the 25-year-old Italy striker also interesting Arsenal, Tottenham, AC Milan, Napoli and Barcelona. (Calciomercato - in Italian), external\nArsenal are willing to pay the £17m (20m euros) buyout clause of Espanyol goalkeeper Joan Garcia after interest from clubs in Serie A and the Bundesliga in the 23-year-old Spaniard. (El Nacional - in Spanish), external\nEverton have spoken to the representatives of Freiburg's 22-year-old Germany midfielder Merlin Rohl over a potential move. (Kicker - in German), external\nReal Madrid have identified AC Milan and Portugal winger Rafael Leao, 25, as one of three possible replacements should they decide this summer is the time to sell 24-year-old Brazil wideman Vinicius Jr. (Fichajes - in Spanish), external\nArsenal and Liverpool are set to be among the main teams trying to sign Crystal Palace and England midfielder Eberechi Eze, 26, this summer. (Caughtoffside), external", "url": "https://www.bbc.com/sport/football/articles/c0r5q9v2nnwo"}