{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:25:44", "date_modify": "2025-05-21 07:25:44", "date_publish": "2025-01-25 00:00:00", "description": "Nathanael Ogbeta's last-minute goal secures a well-deserved point for struggling Plymouth Argyle as they draw 2-2 at high-flying Sunderland.", "filename": "sport_football_live_c78wj1wn75vt_1747812344.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c78wj1wn75vt_1747812344.html", "title": "Sunderland 2-2 Plymouth Argyle: Nathanael Ogbeta secures late point for Pilgrims", "title_page": "Sunderland 2-2 Plymouth Argyle: Nathanael Ogbeta secures late point for Pilgrims - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Nathanael Ogbeta's last-minute goal secured a well-deserved point for struggling Plymouth Argyle at high-flying Sunderland in the Championship.\nArgyle keeper Conor Hazard kept his side in it at the break after good saves from Dan Neil and Dennis Cirkin on his return from injury as Sunderland had more than three-quarters of the first-half possession.\nRyan Hardie should have headed Plymouth ahead early in the second period but he made amends soon after as his shot from a tight angle was deflected over the line by Sunderland keeper Anthony Patterson.\nSeconds later, however, Sunderland were level through Wilson Isidor before Argyle's Callum Wright hit the home post with 19 minutes left.\nSunderland thought they had got the winner when Trai Hume volleyed home from inside the box.\nBut substitute Ogbeta was on hand to blast into the top corner after a period of late Plymouth pressure.\nThe draw sees Sunderland stay fourth in the Championship, two points off the top two, while Argyle remain bottom of the table and are seven points from safety.\nHaving been thrashed 5-0 by Burnley on Wednesday and seen star forward Morgan Whittaker leave the club on Friday for a club-record fee of £5m, Argyle fans could have been forgiven for fearing the worst against a Sunderland side with eyes on the top two.\nArgyle boss Miron Muslic made five changes and his side frustrated the Black Cats for long periods.\nEnzo Le Fee provided much of the home side's early threat down the left and saw Neil fail to connect with a 25th-minute pass after getting to the by-line.\nRecalled goalkeeper Hazard produced a full-length save to deny a powerful Neil long-range volley heading for the top corner eight minutes later.\nCirkin's diving header at the far post was well saved by Hazard four minutes from the break, while the full-back saw a back-post header from a corner deflected into the side netting off team-mate Luke O'Nien soon after.\nHardie was left to rue a great chance as he glanced Mustapha Bundu's inviting 52nd-minute cross wide of the far post, while a minute later at the other end Chris Mepham had a header saved by Hazard.\nHowever, Hardie was able to help put his side ahead as Adam Randell's ball into the box came off Mepham and found Hardie on the by-line - the Scottish striker played the ball against Patterson and it deflected just over the line.\nBut Isidor ensured any Sunderland worry did not last long as he got in front of Julio Pleguezuelo to guide Hume's cross past Hazard.\nThe Pilgrims almost levelled when Wright got on the end of Randell's ball over the top, but his angled drive was touched on to the post by Patterson, and two minutes later Sunderland thought they had sealed the points as Patrick Roberts floated a free-kick into the box and Hume was there to fire in from 12 yards.\nBut Argyle never gave up and Muslic made three key substitutions - one of them, Darko Gyabi, went close with five minutes to go before he was involved in the winner as Ogbeta, another of Plymouth's changes, blasted home.\nSunderland head coach Regis Le Bris told BBC Radio Newcastle:\n\"At the end I think we were a bit lucky to win a single point.\n\"I think we started well because the first half was OK, but we were faced with a very compact block and we found some solutions sometimes, but we didn't create many chances.\n\"During the second half I think we made many mistakes and we opened our shape and they found solutions to create chances and they scored.\n\"It was deserved from them and we came back in the game - but at the end it was more direct for them and we didn't manage the end of the game properly.\"\nPlymouth Argyle head coach Miron Muslic told BBC Radio Devon:\n\"It's a step forward. We are moving slowly, but we are moving and that's the most important thing.\n\"We've had challenging days behind us, if you lose the game 5-0 just a couple of days ago and then you know you have to come to Sunderland facing one of the strongest teams, especially here.\n\"It takes courage, and I'm very happy that we showed this reaction and we showed this character.\"", "url": "https://www.bbc.com/sport/football/live/c78wj1wn75vt"}