{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:42:19", "date_modify": "2025-05-19 14:42:19", "date_publish": "2017-08-20 16:04:46", "description": "Rhys Hanbury and Chris Bridge both score hat-tricks as Widnes thrash Featherstone to boost hopes of Super League survival.", "filename": "sport_rugby-league_40938789_1747665739.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/14785/production/_97454838_hanbury_sw.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_rugby-league_40938789_1747665739.html", "title": "Qualifiers: Widnes Vikings 58-10 Featherstone Rovers", "title_page": "Qualifiers: Widnes Vikings 58-10 Featherstone Rovers - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Rhys Hanbury and Chris Bridge both scored hat-tricks as Widnes ran in 11 tries to thrash Featherstone and edge closer to Super League safety.\nCharly Runciman, like Bridge and Hanbury, grabbed a first-half double against the Championship club to put Widnes 34-4 up in the Qualifiers match.\nMisi Taulapapa and James Lockwood responded either side of the interval, but they were mere consolation efforts.\nBridge and Hanbury completed their hat-tricks to seal the comprehensive win.\nTwo of Widnes' five second-half scores came from Stefan Marsh, while Joe Mellor went over for their 11th try late on.\nFeatherstone remain winless and second from bottom after three Qualifiers matches.\nWidnes Vikings boss Denis Betts: \"I was very satisfied with that. We wanted to be more ruthless this week. We got opportunities this week and we took them.\n\"That win was important, but also important was the points difference. Last time we were in this situation the points difference was like an extra point for us and it was worth having. We spoke about it at half-time and the players went back out there and got the job done.\"\nFeatherstone head coach John Duffy: \"I'm very disappointed with the performance today. Widnes have taken us for a great lesson.\n\"We took the lads in at half-time and questioned people's attitude. We have a lot of learning to do and I'm glad we have some time to look at this at training.\n\"These (Widnes) guys are full time and play high intensity stuff. They have a fantastic squad and have been unlucky in some of the Super League games this season to finish where they did.\"\nWidnes Vikings: Hanbury; Marsh, Bridge, Runciman, Thompson; Mellor, Craven; Buchanan, White, Dudson, Houston, Whitley, Cahill.\nReplacements: Gerrard, Burke, D. Walker, Olbison.\nFeatherstone Rovers: Hardman; Briscoe, Hardcastle, Taulapapa, Turner; Briggs, Thackeray; Griffin, Wildie, Moore, Davies, Lockwood, Baldwinson.\nReplacements: Carlile, Brooks, Ormondroyd, Tagg.", "url": "https://www.bbc.com/sport/rugby-league/40938789"}