{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:43:58", "date_modify": "2025-04-26 07:43:58", "date_publish": "2025-02-26 18:11:49", "description": "An extended map of Morocco worn on RS Berkane shirts is a symbol of \"a political nature\", the Court of Arbitration for Sport rules.", "filename": "sport_football_articles_c80y5znnx10o_1745653438.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a537/live/41c3a920-f469-11ef-90a0-375e853e684a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c80y5znnx10o_1745653438.html", "title": "Morocco map row: Cas upholds Algerian appeal over RS Berkane shirts", "title_page": "Morocco map row: Cas upholds Algerian appeal over RS Berkane shirts - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The Court of Arbitration for Sport (Cas) has upheld an appeal by the Algerian Football Federation (Faf) against the decision to allow a Moroccan club to wear a shirt displaying an extended map of the country.\nThe Confederation of African Football (Caf) had approved RS Berkane's kit to be worn in continental competition, despite the fact the map included the disputed territory of Western Sahara.\nThe design is seen as a political provocation in Algeria and caused a row which saw both legs of last season's Caf Confederation Cup semi-final tie between Berkane and Algerian club USM Alger called off.\nA Caf disciplinary committee awarded Berkane two 3-0 victories, and Caf subsequently dismissed an appeal from USM Alger.\nThe Algerian club and Faf took the case to Cas, which has ruled the shirts are contrary to Caf regulations and the laws of world governing body Fifa and annulled the decision by the Caf appeals body to maintain the approval of the shirts.\nUSM Alger hailed a \"well-deserved victory\" that \"enhances the team's rights and supports the principles of sports justice\" in a post on social media.\nCaf has been contacted for comment.\nCas determined the extended map on Berkane's shirt depicts \"a message, a demonstration or propaganda of a political nature\" as it represents \"the assertion of a territorial dispute that is contested and still unresolved\".\nThe Lausanne-based body also stated that, under Caf's regulations and Fifa laws, it is prohibited to convey any content of a political nature on all equipment.\nThe Cas decision included the assertion Caf \"is bound to respect and implement the duty of political neutrality\".\nThe outcome of the case will have no bearing on the final result of the 2023-24 Confederation Cup, which was won by Egyptian club Zamalek after Berkane received their walkover to the final.\nUSM Alger and Berkane could meet again in the semi-finals of this season's competition.", "url": "https://www.bbc.co.uk/sport/football/articles/c80y5znnx10o"}