{"authors": ["Nizaar Kinsella", "www.facebook.com"], "date_download": "2025-04-26 06:15:49", "date_modify": "2025-04-26 06:15:49", "date_publish": "2025-03-01 21:06:26", "description": "Bournemouth news: Officials 'unable to rely on' technology during eight-minute stoppage", "filename": "sport_football_articles_cr52dpy6vplo_1745648149.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2772/live/ec3be470-f6e0-11ef-a7dd-3bc09b1d9495.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cr52dpy6vplo_1745648149.html", "title": "Officials 'unable to rely on' technology during eight-minute stoppage", "title_page": "Bournemouth news: Officials 'unable to rely on' technology during eight-minute stoppage - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The Football Association has said the record eight-minute VAR stoppage during Bournemouth's FA Cup fifth-round win against Wolves was caused by a congested penalty area.\nIt came during the first weekend of the semi-automated offside system being trialled in English football, which is supposed to reduce the decision time by 30 seconds in close offside calls.\nThe officials were unable to rely on that technology during the check and needed to revert to manually drawn lines before disallowing Bournemouth defender Milos Kerkez's 35th-minute goal.\nFellow defender Dean Huijsen was adjudged to have been in an offside position as Kerkez's effort brushed his shoulder.\nBut the stoppage was also extended as the video assistant referee (VAR) pairing Timothy Wood and Darren England made two different checks for handball - including against Huijsen - prior to the tight offside call.\nWolves supporters did not celebrate the decision that benefited their team, instead allying with the home supporters by chanting \"it's not football any more\" and \"this is embarrassing\" during the unprecedented stoppage.\nDuring the break in play, referee Sam Barrott explained what was happening to the managers and players, while some on the pitch opted to re-do their warm-up routines.\nThe previous longest VAR check was believed to be five minutes 37 seconds in the Premier League match between West Ham and Aston Villa in March 2024.", "url": "https://www.bbc.co.uk/sport/football/articles/cr52dpy6vplo"}