{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:59:08", "date_modify": "2025-05-21 03:59:08", "date_publish": "2025-04-07 07:41:24", "description": "Bristol Rovers defender Taylor Moore says there is \"a lot more to come\" from his mental health initiative after winning an EFL award.", "filename": "sport_football_articles_cwy6g2xp620o_1747799948.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4736/live/92ec7110-12cd-11f0-b016-9502dca93ab5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cwy6g2xp620o_1747799948.html", "title": "Taylor Moore: Bristol Rovers defender says 'more to come' from mental health initiative", "title_page": "Taylor Moore: Bristol Rovers defender says 'more to come' from mental health initiative - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Bristol Rovers defender Taylor Moore said there is \"a lot more to come\" from his mental health initiative after winning an English Football League community award.\nMoore was awarded the League One Community Player of the Year by the EFL after launching a mental health initiative last year called \"5K Your Way\" to promote mental and physical wellbeing, partnered with the Bristol Rovers Community Trust.\nParticipants take part in a 5km walk in various parts of Bristol - the most recent one started at the SS Great Britain - and are encouraged to engage in open conversations about mental health.\n\"I can't remember what game it was but it was on a Tuesday night and we'd lost at home and the day after I was doing my little bit with the community and you find yourself stood there surrounded by people with a big smile on your face,\" Moore told BBC Radio Bristol's Having a Gas.\n\"It just makes you forget about football for a couple of hours and I found that really powerful.\n\"If I can have the same affect on people as well, if they can come down to one of these events, have a walk, have a talk, whatever it may be, and for a couple of hours they forget their problems, their issues, work, relationships, finance whatever it may be.\"", "url": "https://www.bbc.com/sport/football/articles/cwy6g2xp620o"}