{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:35:17", "date_modify": "2025-05-21 07:35:17", "date_publish": "2025-05-20 16:20:17", "description": "Cambridge United appoint former Southend United and Bristol Rovers defender Adam Barrett as assistant head coach.", "filename": "sport_football_articles_clyggg2dqdjo_1747812917.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7777/live/3847e380-3595-11f0-b0ff-f7093bacd9ad.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_clyggg2dqdjo_1747812917.html", "title": "Adam Barrett: Ex-Millwall coach joins Cambridge United as assistant boss", "title_page": "Adam Barrett: Ex-Millwall coach joins Cambridge United as assistant boss - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cambridge United have appointed former Southend United and Bristol Rovers defender Adam Barrett as assistant head coach.\nThe 45-year-old previously worked under boss Neil Harris at Millwall and succeeded him temporarily as interim head coach following his 2019 resignation.\nHe remained part of the coaching staff at the Championship club before leaving in December 2024.\n\"He is somebody I have known as a work colleague, assistant head coach and a competitor on the football pitch over many seasons,\" said Harris.\n\"I believe we have brought in the highest calibre candidate and personality to support me and the current staff.\n\"He is a man with huge integrity, vast coaching experience and a real drive to develop players and win football matches.\"\nCambridge are beginning a revamp of their squad following relegation to League Two and Barrett will work alongside Harris and director of football Mark Bonner as part of that process when he takes up his new role on 23 June.\n\"It's a club that wants to push on and move forward and that is reflected in the conversations I have had with Neil and Mark,\" he said.\n\"I want to be part of the journey. I think I can come in and really help and it's an exciting new challenge for myself.\"\nMeanwhile, there have also been changes in the boardroom at the Cledara Abbey Stadium, with Christoph Loch and Jenny Horsfield stepping down as directors.\nLoch had been a member of the board since 2016 and Horsfield since 2020.\n\"On behalf of all the board and our owners I would like to place on record our huge appreciation for Christoph and Jenny's very significant contribution,\" said chairman Shaun Grady.\n\"We will collectively reflect on how we can continue to develop and strengthen across the club at the board level and elsewhere.\"", "url": "https://www.bbc.com/sport/football/articles/clyggg2dqdjo"}