{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:40:36", "date_modify": "2025-05-20 13:40:36", "date_publish": "2023-07-25 08:39:23", "description": "Leeds United: Max Wober would feel like 'kick in proverbials'", "filename": "sport_articles_c14znzzjvqyo_1747748436.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6754/live/64d9b060-2a37-11ee-b1d7-8fdc93c2782e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c14znzzjvqyo_1747748436.html", "title": "Leeds United: Max Wober would feel like 'kick in proverbials'", "title_page": "Leeds United: Max Wober would feel like 'kick in proverbials' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "BBC Radio Leeds' Adam Pope on several players leaving Leeds on loan, with defender Max Wober another expected to exit: \"I don't think anyone's too concerned about Rasmus Kristensen, Brenden Aaronson, Diego Llorente etc going out - but Wober, for some reason, feels like a real kick in the proverbials.\n\"The indications were that he was going to stay. Now he obviously wants out - there's no way back. Is there any way back for any of them if they have good seasons anyway? And what value is there at the end of it?\"\nKaiser Chiefs bassist Simon Rix added: \"If Wober was going but we were getting a few million for him, you'd be like, 'OK fine, it didn't work out'.\n\"But the fact is they're all going for free so there's no money for us to spend on other players, and there's the whole dilemma about what happens next. Wober's the only one where maybe if he came back, he's a decent player and he hasn't burned many bridges apart from moving.\"\nBBC Radio Leeds' Jonny Buchan: \"I don't think it's the right mentality to have within a dressing room - that you've been culpable for a club's relegation, you then go out on loan because you don't want to do it in the Championship and you want to go to a club that's better for your individual career.\n\"That's absolutely fine, but don't expect to be able to come back if the club gets back into the Premier League.\"", "url": "https://www.bbc.com/sport/articles/c14znzzjvqyo"}