{"authors": ["Jane Lewis", "www.facebook.com"], "date_download": "2025-05-21 05:38:26", "date_modify": "2025-05-21 05:38:26", "date_publish": "2025-01-14 12:08:21", "description": "Forwards galore in Jane Lewis' SWPL team of the week", "filename": "sport_articles_c3w8qp0dllqo_1747805906.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/446b/live/b3298860-d1a4-11ef-9fd6-0be88a764111.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c3w8qp0dllqo_1747805906.html", "title": "Forwards galore in Jane Lewis' SWPL team of the week", "title_page": "Forwards galore in Jane Lewis' SWPL team of the week - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jeni Currie (Partick Thistle): Yes she conceded four goals, but she was by far the most tested goalie this weekend. She was brave at times putting her body on the line keeping Celtic's attack at bay. But for her, Celtic would have won this one more comfortably.\nChelsie Watson (Motherwell): Proved a real threat from set pieces, two headers from two corners, as the defender helped her side to a comfortable win over Dundee United.\nLaura Rafferty (Rangers): Under little pressure against Queen's Park, but when called upon she did her defensive job well. Composed on the ball, and was comfortable playing out from the back with some effect.\nEmma Lawton (Celtic): Her energy and determination shone through yet again. After setting up Celtic's first goal, her desire to keep the ball helped Celtic scored their vital second goal.\nLizzie Arnot (Rangers): Provided plenty of energy down the left, and was a real threat all afternoon. Her deliveries were bang on the money and as well as three assists, she grabbed a goal too.\nMichaela McAlonie (Hibs): Her goal was an absolute beauty, showing both confidence and skill. Plenty of grit in the middle of the park too, she showed great desire to win the ball, then produced a lovely pass to set up Hibs' sixth.\nBrenna Lovera (Glasgow City): Worked tirelessly all afternoon, proving a real handful, and was rewarded with two goals.\nBrogan Hay (Rangers): Was such a threat on the flank, driving forward all afternoon. She was key in two goals, providing the assists, and fully deserved her goal.\nBerry (Motherwell): Scored a hat-trick although it could have been more. Had a penalty saved, but her three goals were key for Motherwell and their top six ambitions.\nNicole Kozlova (Glasgow City): Set the tone for City with two quick goals. She showed good vision and execution for her opening goal.", "url": "https://www.bbc.com/sport/articles/c3w8qp0dllqo"}