{"authors": ["Amy Canavan", "www.facebook.com"], "date_download": "2025-05-20 14:36:19", "date_modify": "2025-05-20 14:36:19", "date_publish": "2023-07-28 16:07:57", "description": "Teenager Emma Mitchell secured a spot in the Bowls Scotland Ladies Singles final on her first appearance at the National Championships", "filename": "sport_bowls_66332243_1747751779.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/E215/production/_130577875_19938770-1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_bowls_66332243_1747751779.html", "title": "Bowls Scotland National Championships: Mitchell to take on Commonwealth medallist Brown in final", "title_page": "Bowls Scotland National Championships: Mitchell to take on Commonwealth medallist Brown in final - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Teenager Emma Mitchell secured a spot in the Bowls Scotland Ladies Singles final on her first appearance at the National Championships with an impressive win against Chloe Stewart.\nThe young Gilmerton star, 19, rallied from 8-2 down to command the semi-final at the National Centre for Bowling at Northfield, Ayr, eventually sealing a 21-14 triumph.\nMitchell will meet Commonwealth Games medallist Caroline Brown of Motherwell in Saturday's showpiece final.\nA slow start from the youngster, who has been well-backed this week by her club and wider district of Midlothian, allowed Stewart to soar into an early lead, picking up a two and three in the opening stages, coupled with a few singles, to sail 8-2 ahead.\nMitchell, though, who completed a stunning comeback in her quarter-final game against Commonwealth Games silver medallist Lesley Doig, did not lose the head, keeping it tight with a string of twos to take the cagey affair to 11-11.\nThe first to find their groove was Mitchell. The talented footballer, who will be jetting off to the United States next month on a football scholarship, scored a composed three to take the lead for the first time at 14-11.\nThe nip-and-tuck nature of the game continued, until a dead draw to rest on Stewart's bowl inches behind the jack saw the Gilmerton player stretch into a 16-12 lead.\nMature beyond her years, Mitchell maintained her cool despite collecting a full house to take her within one shot of victory.\nStewart managed to delay the likely outcome for one extra end with a stunning shot of her own, but it was all about Mitchell's resilience and her superior drawing delivered a deserved 21-14 victory.", "url": "https://www.bbc.com/sport/bowls/66332243"}