{"authors": ["Chris Jones", "www.facebook.com"], "date_download": "2025-05-20 13:32:39", "date_modify": "2025-05-20 13:32:39", "date_publish": "2023-08-01 17:08:10", "description": "England will not be using Saturday's World Cup warm-up match with Wales in Cardiff as a \"selection shootout\", says assistant coach Richard Wigglesworth.", "filename": "sport_rugby-union_66377859_1747747959.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6E82/production/_130609282_gettyimages-1567565263.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-union_66377859_1747747959.html", "title": "Richard Wigglesworth: England's game with Wales will not be 'a selection shootout'", "title_page": "Richard Wigglesworth: England's game with Wales will not be 'a selection shootout' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England will not use Saturday's World Cup warm-up game with Wales in Cardiff as a \"selection shootout\", says assistant coach Richard Wigglesworth.\nHead coach Steve Borthwick will confirm his 33-man squad for the tournament in France on Monday morning, three weeks before the World Rugby deadline.\nWigglesworth says it is important to give players as much \"clarity\" as possible over where they stand.\n\"We definitely don't want to see it as a selection shoot-out,\" he said.\nSpeaking to BBC Sport he added: \"If we go into a game [with that attitude] then we are not giving the players the best chance of playing well.\n\"We all know players will be feeling selection is coming up, and that is huge for them, and it should be huge for them because you get to play for England at a World Cup.\n\"But we want to give them the best chance to play well at the weekend.\n\"We have a pretty good idea of what we want [as the final squad], and those conversations have been ongoing for a long time.\"\nEngland play four matches this month, with a return fixture against Wales at Twickenham before a showdown with Ireland in Dublin and finally Fiji back at Twickenham on 26 August.\nBut Wigglesworth says the focus through August will be on preparation and building cohesion.\n\"We have carried quite a small squad all the way through because we didn't want everything to be around selection,\" Wigglesworth explained.\n\"We want as much cohesion and clarity in what we are doing as possible.\n\"I think those [final squad] decisions are always going to be hard. But it's best [to name it] now because we give ourselves the best chance to be the best prepared in France.\n\"We want everything to be around how well we can prepare. It could never come down to just one Test match and that's the only reason why someone would get selected or not selected.\n\"We are definitely not going 'if this guy plays well he goes'; it is way bigger than that and we want it to be more informed than that.\"\nWigglesworth went to two World Cups as a player, in 2011 and 2015, and says he has learned lessons from those experiences.\n\"I have been in camps and some parts of it have always been about: 'where do I sit? Where do I stand?'\" he added.\n\"Those are natural feelings, but they aren't useful feelings for how well you can prepare a squad.\n\"I think all players have always wanted clarity, I wanted that as a player. Steve has done an incredible job of constantly meeting the players to make sure they feel like they have been treated really fairly.\"\nWigglesworth has also confirmed Ollie Chessum, Ollie Lawrence and Billy Vunipola are all \"back in training\" after rehabbing from injury.\nFor Chessum it completes a quick return after he suffered a serious ankle fracture in training during the Six Nations in March.\nMeanwhile, prop Will Stuart says Saturday is a chance to bring together eight weeks of pre-season graft.\n\"It's the first chance for us to show people what we have been working on, and how hard we have been working,\" Stuart told BBC Sport.\n\"It's a chance to put a marker down and that is a big thing for this group, to show people we are at the races.\"", "url": "https://www.bbc.com/sport/rugby-union/66377859"}