{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:57:59", "date_modify": "2025-04-26 06:57:59", "date_publish": "2025-02-28 13:43:26", "description": "Manchester United duo Joshua Zirkzee and Matthijs de Ligt have been left out of the Netherlands' provisional squad for next month's Nations League quarter-finals.", "filename": "sport_football_articles_c93nn3pgx81o_1745650679.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2883/live/7192c250-f5d4-11ef-ab72-e7ad4ede4251.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c93nn3pgx81o_1745650679.html", "title": "Netherlands: Manchester United duo Joshua Zirkzee and Matthijs de Ligt miss out on Nations League call-up", "title_page": "Netherlands: Manchester United duo Joshua Zirkzee and Matthijs de Ligt miss out on Nations League call-up - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Manchester United's Joshua Zirkzee and Matthijs de Ligt have been left out of the Netherlands' provisional squad for the Nations League quarter-finals.\nThe Netherlands host Spain on 20 March in Rotterdam before travelling to Valencia for the second leg which takes place three days later.\nStriker Zirkzee, 23, made his senior international debut as a substitute against Turkey at Euro 2024 and has been named in each squad since, picking up six caps.\nCentral defender De Ligt, 25, has featured in every squad for the Netherlands, when fit, since earning his first cap in 2017.\nManager Ronald Koeman has selected a 25-man provisional group, which he will trim next week.\nThe provisional squad includes 10 Premier League players: Liverpool's Virgil van Dijk, Cody Gakpo and Ryan Gravenberch, Brighton's Bart Verbruggen and Jan Paul van Hecke; Arsenal's Jurrien Timber, Aston Villa's Donyell Malen, Bournemouth's Justin Kluivert, Brentford's Mark Flekken and Manchester City's Nathan Ake.\nZirkzee and De Ligt joined United last summer and have struggled to find their feet at Old Trafford, although De Ligt scored in the 3-2 win over Ipswich on Wednesday.\nDe Ligt has featured 25 times in the Premier League, starting on 21 occasions, and was formerly the Netherlands captainuntil he lost his spot in the starting line-up to Inter Milan defender Stefan de Vrij.\nDuring the September international break, De Ligt was substituted at half-time during a 2-2 draw with Germany after committing mistakes in the build-up to both goals conceded.\n\"It just looks like he is now in a period where all his mistakes are being punished,\" Koeman said after that game.\n\"I gave him a new chance today, but eventually I protected him by taking him off.\"\nZirkzee has regularly appeared from the bench for United, with just 11 of his 27 appearances in the Premier League coming as a starter. He has three Premier League goals to date.\nFormer Manchester United forward Memphis Depay, who moved to Brazilian club Corinthians in September, is named in the provisional Dutch squad.\nDepay has scored eight goals in 24 appearances for the South American side but has not represented his nation since their loss against England in the semi-finals at Euro 2024.", "url": "https://www.bbc.co.uk/sport/football/articles/c93nn3pgx81o"}