{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:22:46", "date_modify": "2025-05-21 05:22:46", "date_publish": "2025-04-03 15:58:25", "description": "Larne head coach Gary Haveron says he will be happy to fulfil any role Larne want him to do in the future after Nathan Rooney was accepted for a Uefa Licence course.", "filename": "sport_articles_cr5dm06r0evo_1747804966.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/fd18/live/cd0c5c40-109b-11f0-b4be-f729a68ebc4d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cr5dm06r0evo_1747804966.html", "title": "Irish Premiership: 'I'll fulfil any role Larne want me to do'- Haveron", "title_page": "Irish Premiership: 'I'll fulfil any role Larne want me to do'- Haveron - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Larne head coach Gary Haveron says he will be happy to fulfil whatever role the club want him to do in the future.\nHaveron was elevated to the top job from his previous position as part of the backroom coaching staff at the Irish Premiership club in mid-December after newly appointed manager Nathan Rooney switched to become head of football because he did not possess a Uefa Pro Licence.\nRooney has since successfully enrolled to undergo his Pro Licence training and is expected to resume his place as manager of the Invermen in the future.\n\"I'm more than happy to fulfil any role that Larne Football Club want me to fulfil,\" said Haveron.\n\"It's maybe difficult when you have to make tough awkward decisions [as head coach] but that comes part and parcel with the job.\n\"Nathan is obviously on the Pro Licence and I hope it all goes according to plan with him and I'll do whatever role Larne FC want me to do.\"\nLarne's domestic season to date has seen them lose to Glentoran in the County Antrim Shield final, exit the BetMcLean Cup at the semi-final stage to eventual winners Cliftonville and suffer a disappointing Irish Cup fifth-round defeat to Limavady United.\nTheir European exploits in qualifying for the league phase of the Uefa Conference League have hindered their domestic progress as they have been forced to play catch-up with their Premiership fixtures.\nDespite failing to mount a significant challenge for a third successive Irish League title however, the east Antrim outfit remain well in contention for the runner-up spot which would secure automatic European qualification for next season\nHaveron's side are two points behind second-placed Glentoran with four rounds of matches still to play.\n\"This season has been full of positives. So many people have written us off over the course of the season and we still find ourselves in the mix for second place in the league,\" added Haveron, whose side are away to Crusaders on Saturday.\n\"Some people are saying it's been a disastrous season for Larne and we maybe didn't put enough pressure on Linfield, but we had so many games to catch up on it obviously ended up being detrimental to us.\n\"At the same time our season, if you offered it to any other team in the Irish League, they would have taken it.\"", "url": "https://www.bbc.com/sport/articles/cr5dm06r0evo"}