{"authors": ["Um-E-Aymen Babar", "www.facebook.com"], "date_download": "2025-05-20 14:08:12", "date_modify": "2025-05-20 14:08:12", "date_publish": "2023-07-30 16:43:06", "description": "All the drama and excitement from day four of the fifth Ashes Test in digest format.", "filename": "sport_cricket_66355414_1747750092.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/F594/production/_130586826_branderson.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66355414_1747750092.html", "title": "Ashes digest: Stuart Broad's big six and Anderson floors Warner", "title_page": "Ashes digest: Stuart Broad's big six and Anderson floors Warner - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Australia openers David Warner and Usman Khawaja spoiled - or perhaps delayed - Stuart Broad's farewell party by frustrating England on day four of the fifth Ashes Test at The Oval.\nBefore rain brought an early end to play, the two batters put on their highest partnership in this Ashes series to take Australia to 135-0 at the close, requiring 249 runs to win with 10 wickets remaining.\nOn a shortened but still interesting penultimate day of the Ashes, Broad, who announced his retirement on Saturday, hit his final delivery in Test cricket for six and his family shared some of their favourite memories of him on Test Match Special.\nIt's all set for an exciting final day tomorrow. Here are some of the best takeaways.\nStuart Broad hit his final ball in Test cricket for six off Australia's Mitchell Starc. Ex-West Indies fast bowler Wayne Daniel is the only other player to have sent the final ball he faced over the ropes.\nIt was Broad's 55th six for England and only four players have hit more sixes for England in Tests: Ben Stokes, Kevin Pietersen, Andrew Flintoff and Ian Botham. Not bad company!\nEngland's James Anderson bowled a beamer that floored Australia's David Warner, who managed to get it away for four and then raise a smile after dusting himself down.\nAnderson was given a warning after the delivery and, if repeated, he would not be allowed to bowl for the rest of England's innings.", "url": "https://www.bbc.com/sport/cricket/66355414"}