{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:32:44", "date_modify": "2025-05-20 12:32:44", "date_publish": "2023-08-04 09:55:49", "description": "Sunderland will benefit from their taste of Championship football last season, says goalkeeper Anthony Patterson.", "filename": "sport_football_66404740_1747744364.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/84B6/production/_130647933_gettyimages-1569361572.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66404740_1747744364.html", "title": "Anthony Patterson: Sunderland squad benefited from last season's Championship experience", "title_page": "Anthony Patterson: Sunderland squad benefited from last season's Championship experience - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Sunderland's young squad will benefit from their taste of Championship football last season as they seek to improve on reaching the play-offs, says goalkeeper Anthony Patterson.\nThe Black Cats forced their way into the top-six, losing to eventual winners Luton Town in the semi-finals.\nIt was a run which came just 12 months after promotion into the second tier.\n\"It was the first season for many of us in the Championship,\" Patterson told BBC Look North.\n\"So we've got that experience now and we need to use it to kick on.\"\nPatterson, at 23, is a barometer of the relative youth within a squad that has an average age of 23, with Danny Batth, Corry Evans and Alex Pritchard the only players over 30.\nPlayers such as Trai Hume, Dennis Cirkin and Dan Neil, all 21, were regulars in Tony Mowbray's squad, as were Jack Clarke, 22, Dan Ballard, 23, and Aji Alese, 22.\nNew arrivals such as Luis Semedo, Eliezer Mayenda and Jenson Seelt have only added to that youthful feel, although Bradley Dack's experience at 29 makes him a key addition.\nSuch arrivals have fuelled belief that the team can at least repeat last season's challenge for the promotion places.\n\"I don't see why not, we gave it a good crack last season,\" Patterson added.\n\"If we can keep a squad fit then I don't see why not.\"\nOne advantage in Sunderland's favour last season was the atmosphere created at their Stadium of Light home, with crowds averaging 38,500 and exceeding 40,000 on nine occasions.\n\"The fans here are unbelievable, we regularly get 40,000-plus at home game,\" Patterson said.\n\"It's incredible, you can hear them all game long and it drives you on, gives you that extra bit of something during the game and helps the rest of the team kick on.\"", "url": "https://www.bbc.com/sport/football/66404740"}