{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:33:44", "date_modify": "2025-05-21 07:33:44", "date_publish": "2025-01-07 00:00:00", "description": "Herbie Kane's first-half volley proves the difference as Huddersfield overcome promotion rivals Wycombe 1-0 at Adams Park.", "filename": "sport_football_live_cvg67g12ll0t_1747812824.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cvg67g12ll0t_1747812824.html", "title": "Wycombe Wanderers 0-1 Huddersfield Town: Terriers extend unbeaten run to 15", "title_page": "Wycombe Wanderers 0-1 Huddersfield Town: Terriers extend unbeaten run to 15 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Huddersfield made it 15 league games unbeaten as they defeated Wycombe 1-0 at Adams Park to move within four points of the League One automatic promotion places.\nHerbie Kane's superb 15th-minute volley proved decisive as Town strengthened their position in the play-off spots and kept their second-placed opponents within range.\nThe opening 20 minutes belonged to the away side as they peppered the Chairboys with shots, Callum Marshall blazing one effort over before being denied at close range by keeper Franco Ravizzoli.\nFive minutes later, the Terriers went ahead thanks to a brilliant strike from Kane.\nBen Wiles' corner was punched away by Ravizzoli only for Kane to smash home his second goal of the season.\nWycombe looked flat but carved out a couple of chances, most notably when Tyreeq Bakinson shot just over the bar.\nIn the second period Wanderers threw everything at the Terriers goal, with Cam Humphreys' cross causing a goalmouth scramble.\nRichard Kone was denied on three occasions by Jacob Chapman while Bakinson also had a shot saved.\nFred Onyedima fizzed an effort across the face of the Huddersfield goal whilst Dan Udoh went close.\nGarath McCleary, Brandon Hanlan, Gideon Kodua and Beryly Lubala were introduced as Wanderers continued to search for an equaliser, but Hanlan shot wide and Bakinson hit the crossbar as they came up short.", "url": "https://www.bbc.com/sport/football/live/cvg67g12ll0t"}