{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:41:37", "date_modify": "2025-05-19 14:41:37", "date_publish": "2017-07-22 19:50:47", "description": "Portsmouth confirm that a fan died during the League One team's friendly against local rivals Bournemouth on Saturday.", "filename": "sport_football_40694622_1747665697.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/C4BC/production/_97046305_gettyimages-679701154.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_40694622_1747665697.html", "title": "Portsmouth v Bournemouth: Fan dies during pre-season game", "title_page": "Portsmouth v Bournemouth: Fan dies during pre-season game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Portsmouth have confirmed that a fan died during the League One team's friendly against local rivals Bournemouth on Saturday.\nThe second half of the match at Fratton Park was delayed as medical staff went to the aid of the man.\nNo details of the man's death have been revealed.\n\"We are sad to announce that a Pompey fan has passed away after falling ill at today's match,\" the club said in a statement.\n\"The incident occurred during the half-time break. Despite valiant attempts by medical staff - who were quickly on hand to administer CPR - and following transportation to hospital, he was unable to be revived.\n\"Next of kin have been notified and our thoughts are with them at this time.\"\nBournemouth won the match 2-1 and afterwards the club tweeted: \"The thoughts and prayers of everyone at #afcb are with the family and all connected at this difficult time.\"\nCherries defender Nathan Ake added: \"Sad to hear that the @officialpompey fan has passed away during our game today. Wishing his family strength during this difficult time.\"\nPortsmouth's Conor Chaplin said on Twitter: \"Deeply saddened to hear that a fan passed away at the game today. Thoughts and prayers with his loved ones and friends.\"", "url": "https://www.bbc.com/sport/football/40694622"}