{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:37:55", "date_modify": "2025-04-26 03:37:55", "date_publish": "2025-03-08 00:00:00", "description": "Bolton move into the League One play-off places as goals by Aaron Morley and Josh Sheehan give them victory at Burton Albion.", "filename": "sport_football_live_clynzyyp12zt_1745638675.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/074d/live/696fd8d0-f8ed-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_clynzyyp12zt_1745638675.html", "title": "Burton Albion 1-2 Bolton Wanderers", "title_page": "Burton Albion 1-2 Bolton Wanderers - Visitors move into play-off places - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Bolton's good form under new boss Steven Schumacher continued as goals in each half from Aaron Morley and Josh Sheehan saw them to a League One win at Burton.\nOn a ground where they had not won in five previous visits, the Wanderers' midfield produced the goals to propel them into the play-off places.\nMorley struck with a clinical finish midway through an entertaining first half. Skipper George Thomason was able to exploit space on the left to pull the ball back behind the strikers, where the Bolton midfielder was able to fire home from 12 yards.\nAaron Collins was denied at the far post by a combination of Ryan Sweeney and Jack Armer, whist defender Will Forrester saw a close-range header deflected away at the end of the first half.\nAlbion equalised early in the second period, skipper Ryan Sweeney forcing the ball over the line in a scramble from Charlie Webster's corner.\nThe visitors were adamant there was a handball in the Burton goal.\nBut they put their frustration aside when Sheehan rifled in from 25 yards after Morley's free-kick had been blocked by the Burton wall and then defended stoutly as Albion pushed for a second equaliser in the latter stages of the game.", "url": "https://www.bbc.co.uk/sport/football/live/clynzyyp12zt"}