{"authors": ["Jonathan Jurejko", "www.facebook.com"], "date_download": "2025-05-21 04:20:25", "date_modify": "2025-05-21 04:20:25", "date_publish": "2025-01-15 06:32:06", "description": "Carlos Alcaraz's beefed-up serve produces 14 aces in his second-round win at the Australian Open, where he is looking to complete the career Grand Slam.", "filename": "sport_tennis_articles_c77rjx57l12o_1747801225.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4d3e/live/f50674c0-d2fb-11ef-9b17-c13b1198ce20.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_tennis_articles_c77rjx57l12o_1747801225.html", "title": "Australian Open 2025 results: Carlos Alcaraz reaps rewards of new-look serve in Melbourne", "title_page": "Australian Open 2025 results: Carlos Alcaraz reaps rewards of new-look serve in Melbourne  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It is safe to say a player who is aiming to become the youngest man to complete the career Grand Slam does not have many faults.\nHowever, if there was one area where Carlos Alcaraz was weaker than the rest, it was his serve.\nThe 21-year-old Spaniard and his team, headed by coach Juan Carlos Ferrero, looked to put that right before the new season.\nSo far at the Australian Open, Alcaraz has been reaping the benefit of his beefed-up serve.\nOn Wednesday, Alcaraz hit 14 aces in a 6-0 6-1 6-4 second-round win against Japan's Yoshihito Nishioka.\nHe left a cheeky message on the on-court camera lens afterwards, writing: \"Am I a servebot?\"\nAlcaraz was joking, of course - he will never be John Isner, the 6ft 10in former world number eight who became the prototype 'servebot'.\nNor will he be Reilly Opelka, another skyscraper American who has whacked 78 aces in his opening two matches.\nAlcaraz has hit 20 aces in total - putting him in tied 20th in the men's draw - but his ironic message showed he is happy with his serving progress.\nIn the one-sided victory over Nishioka, the world number three won 89% of first serve points - helped by those aces - and 71% of second serve points.\nIt was a huge improvement from his opening match and the result of a Tuesday practice session dedicated to serving.\n\"I felt really good today with the serve,\" said Alcaraz, who is bidding to surpass Rafael Nadal as the youngest man to win all four majors in the Open era.\n\"I talked with Juan Carlos about what I have to do today with the serve, what I did wrong and what I did great from the first match.\n\"I felt more comfortable on it. I think the serve is about confidence and feelings.\"", "url": "https://www.bbc.com/sport/tennis/articles/c77rjx57l12o"}