{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:34:57", "date_modify": "2025-04-26 07:34:57", "date_publish": "2025-02-27 15:17:47", "description": "How Casey 'stopped the rut' for Motherwell", "filename": "sport_articles_c05mmje2d7do_1745652897.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/67d6/live/35b363d0-f498-11ef-839b-6909acee4532.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_c05mmje2d7do_1745652897.html", "title": "How Casey 'stopped the rut' for Motherwell", "title_page": "How Casey 'stopped the rut' for Motherwell - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Dan Casey was determined to \"stop the rut\" of Motherwell's six straight defeats.\nHe did exactly that with an impactful display at both ends of the pitch in the 2-1 win over Dundee.\nThe defender was solid at the back, making six tackles - the most of any player on the pitch - and winning them all. He also won possession four times and contributed eight clearances.\nAnd when it came to attacking, he excelled. From four touches in the opposition box, the Irishman had three shots - all on target - and scored a match-winning double. Not half bad for a centre-half from an xG of just 0.31.\n\"It was full of emotions,\" Casey told BBC Scotland.\n\"I think it was a big night for the club. I'm just glad I could help the team and now I think it has to be a starting point for the rest of the season.\"\nCasey's heroics made it a winning Fir Park bow for new manager Michael Wimmer and the 27-year-old praised the German's calm and methodical approach.\n\"I think he's been brilliant, he's been very clear with his gameplan. High intensity, and I think you could see that in the first half and possession keeping the ball,\" Casey added.\n\"His details are very good. He's quite calm on his approach. He'll pull you over and he'll be very clear with you. We all enjoy working with him and hopefully we can kick on.\"", "url": "https://www.bbc.co.uk/sport/articles/c05mmje2d7do"}