{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:54:51", "date_modify": "2025-05-21 06:54:51", "date_publish": "2024-12-24 08:14:53", "description": "Newport County: Bobby Kamwa looks to keep scoring after MK Dons hat-trick", "filename": "sport_football_articles_cq620nvel1jo_1747810491.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6918/live/f2588220-c13c-11ef-a8c2-37ad53d91ed7.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cq620nvel1jo_1747810491.html", "title": "Newport County: Bobby Kamwa looks to keep scoring after MK Dons hat-trick", "title_page": "Newport County: Bobby Kamwa looks to keep scoring after MK Dons hat-trick - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Bobby Kamwa hopes his numbers are starting to add up after his hat-trick in Newport County's win over MK Dons.\nThe 24-year-old scored three times in 58 minutes as the Exiles claimed a thrilling 6-3 victory last weekend.\nKamwa, who signed on free in August after he left Burton Albion, had scored only once in 22 Newport appearances before the Dons thrashing.\nKamwa's treble means this is already the best goalscoring season of his career, with the former Leeds United youngster surpassing the three strikes he managed for Burton in 2022-23.\nNow Kamwa is eyeing more success in the final third.\n\"I could smell in that game there would be goals and luckily I took my chances,\" he said.\n\"Stats have always been a thing for me - my end product. If it's to do with the ability, I know I can play higher up. But it's always been questions of stats, so I am happy I am starting to concentrate on end product.\"\nCameroon-born Kamwa has started 16 League Two games this season, and expressed his gratitude to boss Nelson Jardim.\n\"I want to say thank you to the gaffer for trusting me,\" he added.\n\"There are times when it hasn't come off for me but he has stuck with me. I am happy I could repay him.\n\"I do a lot of finishing, crossing after training. These are things I need to stick at and focus on. If I can get that right, I know what level I can play at.\"\nNewport will look to build on the MK Dons triumph when they go to Bromley on Thursday, 26 December (15:00 GMT).", "url": "https://www.bbc.com/sport/football/articles/cq620nvel1jo"}