{"authors": ["Amy Canavan", "www.facebook.com"], "date_download": "2025-04-26 03:54:53", "date_modify": "2025-04-26 03:54:53", "date_publish": "2025-03-04 16:53:22", "description": "Who is George Hirst? The 'unit' Steve Clarke was scouting", "filename": "sport_articles_c4g7ddrp62ko_1745639693.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7b1a/live/a979a7d0-f910-11ef-b5c1-27f306935cb2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_c4g7ddrp62ko_1745639693.html", "title": "Who is George Hirst? The 'unit' Steve Clarke was scouting", "title_page": "Who is George Hirst? The 'unit' Steve Clarke was scouting - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Throughout his Scotland tenure, Steve Clarke has never been blessed with a full, fit and firing forward line.\nNow is no different.\nWhile Che Adams is still enjoying life out in Italy, Lyndon Dykes is injured, Lawrence Shankland is struggling to hit last season's heights and Tommy Conway is still in the infancy of his international career.\nWith a crucial Nations League A two-legged play-off against Greece to come later this month, Clarke headed out on a scouting mission to catch Ipswich Town's George Hirst in FA Cup action against Nottingham Forest.\nThe 26-year-old, son of former Sheffield Wednesday forward David, headed in the opener at the City ground, with Clarke in the stands.\nIt was his third goal of the season, with his only Premier League goal coming in a 4-3 defeat to Brentford in October, but he's been playing second fiddle to Liam Delap.\nHirst, a former England Under-20 international, qualifies for Scotland through his paternal grandfather, and, according to BBC 5 Live presenter Aaron Paul, \"offers something different\" to what Scotland already have.\n\"He's a very, very different kind of player to the likes of someone like a Conway, and definitely different to someone like an Adams or a Kevin Nisbet. So why not?\" Paul told BBC Scotland.\n\"He's 6ft 3in, powerful, mobile and intelligent. The apple doesn't fall far from the tree. He's the son of David Hirst, the former Sheffield Wednesday striker, so he's got the pedigree.\n\"But he's a thinker, and he's someone who's had to work really hard for his opportunities.\"\nHirst has missed nearly two months of this season with a knee injury, having also missed a chunk of The Tractor Boys' promotion campaign last term.\n\"They haven't been minor little injuries, they've been big setbacks,\" Paul added.\n\"But he's committed, he plays in a high-octane Kieran McKenna side who like to press hard from the front. He's a big unit and he'll use his size. He's not a raw goalscorer, he's not a pure all-rounder, but he's someone who will press well.\"\nPaul confirmed McKenna was unaware of the Scotland head coach's presence at their game against Forest, but the Northern Irishman said: \"Scotland is something that George definitely wants to explore.\n\"I just think this could be a fantastic opportunity if others are somewhat struggling, or if there is an opportunity there, to take it and grasp it with both hands.\"", "url": "https://www.bbc.co.uk/sport/articles/c4g7ddrp62ko"}