{"authors": ["Luke Pingu", "www.facebook.com"], "date_download": "2025-05-21 07:27:43", "date_modify": "2025-05-21 07:27:43", "date_publish": "2025-01-22 12:55:50", "description": "Derby County supporter and YouTuber Luke Pingu shares his thoughts about the Rams in his first 'fan's view' contribution for BBC Sport.", "filename": "sport_football_articles_cx25rjnd605o_1747812463.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a68d/live/8fe04440-d8be-11ef-9fd6-0be88a764111.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cx25rjnd605o_1747812463.html", "title": "Derby County Fan's View", "title_page": "Derby County Fan's View - Belief in Warne, new recruits & a need for goals - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Derby County are still without a point in 2025 after four games. But after Tuesday's game versus Sunderland, I hope fans can see Paul Warne is the right man for the job.\nDerby showed great character and work-rate against the Black Cats and deserved at least a point. But it ended as a 1-0 defeat.\nWith Ebou Adams playing at centre-back in a back three and Kane Wilson playing on the left, Derby showed they could put in a good performance against one of the best teams in the league.\nNew signing Lars-Jorgen Salvesen made an immediate impact when he was subbed onto the pitch with two great headers on target after connecting with Corey Blackett-Taylor's crosses into the box.\nI truly hope both these players are given the opportunity to start the next handful of games because even from 30 minutes on the pitch against Sunderland, you could clearly see they will create goals for Derby - one thing we have lacked so far this season.\nRight now, Derby are only one point above the relegation zone and need a win soon to lift the club into safety. And I hope that comes in the next three or four games, or Derby will fall into the bottom three.\nEvery Derby fan going into the season knew safety was the primary target, and with the opportunity to strengthen with a week left of the window, I hope the Rams find the signings required to ensure their Championship status.", "url": "https://www.bbc.com/sport/football/articles/cx25rjnd605o"}