{"authors": ["Mo Allie", "www.facebook.com"], "date_download": "2025-05-20 13:41:22", "date_modify": "2025-05-20 13:41:22", "date_publish": "2023-08-01 15:35:22", "description": "South Africa can build towards hosting a \"world-class\" Commonwealth Games after 2026, the country's Sports and Olympic Committee tells BBC Sport Africa.", "filename": "sport_africa_66315550_1747748482.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/F3E0/production/_130523426_gettyimages-486208102.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_africa_66315550_1747748482.html", "title": "Commonwealth Games 2026: African nations 'have the ability' to host future events", "title_page": "Commonwealth Games 2026: African nations 'have the ability' to host future events - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "There were distinct echoes of Durban's aborted hosting of the 2022 Commonwealth Games when the Australian state of Victoria cancelled its plans to put on the 2026 edition.\nFinancial constraints were partly to blame when the South African coastal city was stripped of hosting rights in 2017, something which organisers in Victoria also said had driven their decision.\nWith an alternative host yet to be chosen for 2026, the future and relevance of the 93-year-old event has been called into question.\nBut Africa's ability to one day accommodate the Games, and the will of leaders on the continent to see that happen, remain strong, according to one of the key figures involved in a potential new hosting bid - as long as \"baby steps\" are taken first.\n\"Quietly, at the back of our minds, we know we can deliver a world-class Commonwealth Games - so we will be looking into that,\" Barry Hendricks, the president of South Africa's Sports and Olympic Committee (Sascoc), told BBC Sport Africa.\n\"There are other countries on the continent that have the ability to do it, especially in North Africa. The Commonwealth Games Federation (CGF) still has hopes that Africa can host a Commonwealth Games.\"\nDr Mike Sutcliffe, who was the city manager of the municipality encompassing Durban between 2002 and 2011, said their evidence showed the Games had \"nothing like the pull\" of the Olympic Games or the Fifa World Cup, which South Africa hosted in 2010.\n\"There was no real value-add that was happening to the city except huge cost,\" added Sutcliffe. \"Personally, I don't think hosting the Commonwealth Games is a worthwhile exercise.\n\"There are many other events that could be a better proposition.\n\"I don't see what value the Commonwealth Games would bring.\"\nWhen it comes to back-up hosts for 2026, Sutcliffe is urging potential bidders - including Australia's Gold Coast, whose mayor has voiced interest - to \"do their homework.\"\n\"If it does fit with what you're trying to achieve in your city, it's not too expensive and you have control over it, then go for it,\" he said.\n\"But look at all the other events that you could be bidding for if you have that kind of money to spend.\"\n\"We need to start with baby steps by first hosting smaller multi-sport events before thinking of bigger projects like the Commonwealth Games or the Olympics.\n\"We've successfully hosted cricket, rugby and soccer World Cups, which are big events, but we're speaking about a multi-coded event with many different types of facilities and technical officials and a lot of different logistical aspects.\n\"Once we have a stable environment and the environment has fully recovered after Covid, we can then start planning around issues like that.\n\"Let's try and prime ourselves for the bigger multi-code events by going for the smaller ones first - and then building our confidence and our infrastructure, as well as our capacity.\"\nThere may be the desire to see an historic first Commonwealth Games take place on African soil but that dream still feels a long way off.", "url": "https://www.bbc.com/sport/africa/66315550"}