{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:55:02", "date_modify": "2025-05-21 03:55:02", "date_publish": "2025-04-07 14:09:12", "description": "MK Dons' long-serving defender Dean Lewington is to stop playing at the end of the season, after making 915 appearances for the club - an EFL record.", "filename": "sport_articles_c8x84j7jv2xo_1747799702.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/270a/live/61f0e4a0-13b9-11f0-92ad-eb42d450dc76.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c8x84j7jv2xo_1747799702.html", "title": "Dean Lewington: MK Dons legend to retire after 22 years at the club", "title_page": "Dean Lewington: MK Dons legend to retire after 22 years at the club - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Dean Lewington, MK Dons' record appearance holder, is to stop playing for the club at the end of the season.\nThe left-back has made 915 appearances for the club over 22 years, breaking John Trollope's 40-year record for the most league appearances for a single club in the EFL in 2023.\nThe 40-year-old, son of former England assistant manager Ray, won promotion three times with the Dons, as well as winning a league and cup double in 2007-08.\nHe has not played since November, becoming an interim boss three times. The club say he now wants to move into coaching permanently.\nLewington has been playing for the club for so long that he made his debut for Wimbledon in 2003, before they relocated to Milton Keynes.\nHe has been a regular in Dons sides ever since, starting 779 of his 789 league appearances for the club.\nAs MK Dons' longest-serving player, Lewington was involved in many of the club's most notable moments, beating Grimsby Town to win the EFL Trophy at Wembley in 2008, beating Manchester United 4-0 in the League Cup in 2014 and winning promotion to the Championship in 2015.", "url": "https://www.bbc.com/sport/articles/c8x84j7jv2xo"}