{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:50:24", "date_modify": "2025-05-21 06:50:24", "date_publish": "2025-04-02 00:00:00", "description": "Follow live text commentary, score updates and match stats from AFC Bournemouth vs Ipswich Town in the Premier League", "filename": "sport_football_live_cvgwg11v7j4t_1747810224.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8b8b/live/92d34890-1000-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cvgwg11v7j4t_1747810224.html", "title": "Bournemouth 1-2 Ipswich: Visitors hang on for first win of 2025", "title_page": "Bournemouth 1-2 Ipswich: Visitors hang on for first win of 2025 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Relegation-threatened Ipswich Town won in the Premier League for the first time in 2025 to dent Bournemouth's hopes of qualifying for Europe.\nThe hosts nearly took the lead when Alex Scott's shot was cleared off the line by Ipswich defender Dara O'Shea, with the visitors scoring shortly afterwards.\nWales international Nathan Broadhead grabbed his first Premier League goal as he collected the ball following Julio Enciso's fine run, cut inside defender Dean Huijsen and fired a shot through the legs of goalkeeper Kepa Arrizabalaga.\nIpswich, who had not won in the league since a 2-0 home victory over Chelsea on 30 December, had been the only team in the top four divisions in English football yet to claim a league win in 2025.\nBournemouth almost equalised at the start of the second half but visiting goalkeeper Alex Palmer made a superb save to tip over Scott's powerful 20-yard strike.\nOn the hour mark, Liam Delap then scored his 11th goal of the season, lashing the ball past Arrizabalaga after Conor Townsend's pullback to double Ipswich's lead.\nBournemouth thought they had a route back into the match when referee Rob Jones pointed to the penalty spot.\nHowever, after an intervention from the video assistant referee, the decision was changed to a free-kick as the contact from Axel Tuanzebe on Antoine Semenyo was deemed to have happened outside the 18-yard area.\nBut the Cherries did pull a goal back in the 67th minute when Evanilson reacted quickest to convert the rebound after Palmer had parried Lewis Cook's effort.\nThe hosts dominated possession late on, although Ipswich held on for only their fourth league win of the campaign.\n\"I'm really proud and there is a little bit of relief after the last 10 minutes,\" said Ipswich boss Kieran McKenna. \"Really proud of the performance in terms of how hard we worked, the two goals we scored, the result and what we showed defensively.\"\nBournemouth have never played in European competition and a 3-1 win at Southampton in February had left Andoni Iraola's team fifth in the Premier League.\nHowever, they have not won a top-tier match since, with this loss stretching their winless league run to five games and, although they remain 10th, this was a big opportunity missed to get back on form.\n\"It's a bad result for us, but we need to stay together and focus on the things we can improve,\" said Iraola.\n\"We are in a bad period. They scored two goals with two shots on target, that was the worst part as we controlled the game.\"\nBournemouth were without 12-goal top scorer Justin Kluivert after he had picked up an injury in the 2-1 FA Cup quarter-final loss to Manchester City, but the hosts will still be wondering how they failed to get any points.\nDango Ouattara and Antoine Semenyo both fired efforts wide, before Ipswich took the lead against the run of play with their first effort on target.\nIpswich have dropped 22 points from winning positions in 2024-25, with three of those coming in the reverse fixture at Portman Road when they led Bournemouth until the 87th minute, only for the Cherries to score two late goals, including a 95th-minute winner to snatch a 2-1 victory.\nAfter Delap had put Town 2-0 ahead, the Ipswich fans were left sweating after Evanilson's goal set up a nervy finish, with the visitors, led by Dara O'Shea, defending superbly and resolutely.\nBournemouth had chances to grab a point but Semenyo shot just wide and in the 96th minute, with Arrizabalaga up for a corner, Ouattara headed over the top.\nIpswich won successive promotions under McKenna to jump from League One to the Premier League in two seasons, but for large parts of the season had looked out of their depth and their players and fans celebrated a rare win.\nThey had only previously earned two points from 10 league games in 2025, but this victory leaves them 18th, nine points behind 17th-placed Wolves, who travel to Portman Road on Saturday in a match Ipswich have to win to have any chance of staying in the Premier League.\n\"We have been waiting a while for a win and in this league that's what can happen,\" added McKenna. \"There's still belief, a lot of togetherness and you can see that as a team so it was a good night for us.\n\"We're coming into the last quarter of the season and we want to finish off the season well and make it our best quarter and get as many points as we can and where that leaves us, let's see.\"", "url": "https://www.bbc.com/sport/football/live/cvgwg11v7j4t"}