{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:07:56", "date_modify": "2025-05-20 12:07:56", "date_publish": "2023-08-05 11:22:09", "description": "Millwall open Championship campaign with away win at Middlesbrough thanks to Romain Esse's first goal for the Lions.", "filename": "sport_football_66345306_1747742876.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1402E/production/_130666918_shutterstock_editorial_14039937o.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66345306_1747742876.html", "title": "Middlesbrough 0-1 Millwall: Romain Esse's first goal gives Lions victory", "title_page": "Middlesbrough 0-1 Millwall: Romain Esse's first goal gives Lions victory - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Millwall opened their Championship campaign with victory at Middlesbrough thanks to Romain Esse's first goal for the Lions.\nThe 18-year-old broke the deadlock in the 79th minute when fellow substitute Aidomo Emakhu crossed from the left and Esse curled a fine first-time finish into the top corner.\nThe Lions were a constant threat on the counter-attack against a Boro side who were beaten play-off semi-finalists last season, with Zian Flemming and debutant Kevin Nisbet going close for the visitors.\nSammy Silvera sent a fierce effort over the bar as the hosts sought an equaliser, while Dael Fry also failed to connect with a cross from his Australian team-mate.\nThe Teessiders had seen a Hayden Hackney goal ruled out six minutes before the break after the ball ran out over the byline before Matt Crooks was able to pull it back.\nMillwall had also challenged for promotion to the Premier League last season, but fell out of the play-off places on the final day of the season following a dramatic home defeat by Blackburn Rovers.\nFlemming was off target with two early chances, firing a side-footed effort narrowly past the left-hand post and then slicing wide when well-placed from a short corner.\nMeanwhile, former Boro man Duncan Watmore almost came back to haunt his old side but his shot deflected over the bar.\nMichael Carrick had lifted Middlesbrough from 21st place to finish fourth last season but his side were disappointing, with their need for additional signings in attack glaringly apparent throughout.\nChuba Akpom, top scorer in the Championship last season with 28 goals, remained an unused substitute for the hosts after missing most of pre-season with a knee injury.\nGoalkeeper Seny Dieng, a summer signing from QPR, raced off his line to deny Scotland striker Nisbet with his legs in a one-on-one but could do little to prevent the only goal of the game.\nAfter Emakhu had skipped away from Paddy McNair to break down the left, Esse showed composure and quality to guide the ball back across goal and into the top left-hand corner to give Gary Rowett's men all three points.\nMiddlesbrough boss Michael Carrick told BBC Radio Tees:\n\"We didn't come here to lose the game but it's one game. Whatever happened, there's a long way to go.\n\"We need to be better but I thought there were still a lot of good things in the game. We just need to be sharper and more inventive.\n\"Teams are going to come here, close the space down and try and hit us on the break and that is something we are going to have to deal with.\n\"It's a good group and we have got quality and we want to improve it as we go. We don't accept losing very lightly but we need to move on pretty quickly as well.\"\nMillwall manager Gary Rowett:\n\"We've had four seasons where we've been very, very close to the play-offs, and the last two seasons have gone to the last game.\n\"I think we've strengthened well and got a good squad.\n\"I'd expect a club like Middlesbrough to be ahead of us in people's thoughts of what's going to happen at the end of the season, but that doesn't stop us from being what we are.\n\"People label Millwall a certain way. Yes we defended diligently, yes we transitioned well, but we actually played some really good football as well and we've got some talented players.\"", "url": "https://www.bbc.com/sport/football/66345306"}