{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:40:26", "date_modify": "2025-04-26 07:40:26", "date_publish": "2025-02-27 12:17:10", "description": "Exeter forward Richard Capstick signs a contract extension with the Premiership club.", "filename": "sport_rugby-union_articles_cvgww9r97jxo_1745653226.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c449/live/804244d0-f4fb-11ef-9808-4d9b058d1a40.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_cvgww9r97jxo_1745653226.html", "title": "Richard Capstick: Exeter forward agrees new deal at Sandy Park", "title_page": "Richard Capstick: Exeter forward agrees new deal at Sandy Park - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Exeter forward Richard Capstick has signed a contract extension with the Premiership club.\nThe 25-year-old, who can play at lock or flanker, has been part of the England 'A' setup this season.\nHe has been with the club since he was a teenager and made his debut in November 2018.\nCapstick has since gone on to play 79 times for Rob Baxter's side in all competitions and has featured in every Premiership match this season, having missed much of the previous two campaigns with injury.\n\"He's had a very good season since his return from injury as he's proved to be very good across the back five of the scrum for us,\" Exeter director of rugby Rob Baxter told the club website., external\n\"This season he's maturing well and taking on some roles like taking charge at the line-out and calling that set-piece.\n\"His good individual form has led to him having some time with England A recently which is great. He looks to be one of those guys who is still improving, taking on a bigger part in what we're trying to do here as a group.\n\"He's one of those players who I think the best is still to come from as we grow, mature and move forward as a team.\"\nCapstick is the second player whose deal was due to end in the summer to extend their stay at Sandy Park this week.\nOn Wednesday, fellow forward Greg Fisilau agreed a new three-year deal.\nExeter have not disclosed the length of Capstick's new deal.", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/cvgww9r97jxo"}