{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:11:04", "date_modify": "2025-05-20 14:11:04", "date_publish": "2023-07-30 09:00:48", "description": "Former Wales captain, coach, manager and WRU president Clive Rowlands, who masterminded the 1971 Grand Slam, dies aged 85.", "filename": "sport_rugby-union_66325527_1747750264.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5D40/production/_130527832_cdf_170513_welsh_sport_hall_of_fame_28.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-union_66325527_1747750264.html", "title": "Clive Rowlands: Wales' 1971 Grand Slam coach dies aged 85", "title_page": "Clive Rowlands: Wales' 1971 Grand Slam coach dies aged 85 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Wales captain, coach, manager and Welsh Rugby Union (WRU) president Clive Rowlands has died aged 85.\nRowlands, whose nous earned him the nickname 'Top Cat', coached Wales from 1968-1974 and guided them to the Triple Crown in 1969 and Grand Slam in 1971.\nA qualified teacher, he captained Wales from scrum-half in each of his 14 Test appearances from 1963-1965.\nHe played for Pontypool, Llanelli and Swansea before turning to coaching, winning 18 of his 29 games with Wales.\nRowlands, renowned for his passion and motivational methods as a coach, later moved into rugby administration and managed Wales when they finished third at the inaugural Rugby World Cup in 1987.\nTwo years later he filled a similar role as the British and Irish Lions beat Australia 2-1 down under.\nHe was also president of the WRU in 1989-90 during a period of controversy in the game in Wales.\nLegendary Wales and Lions fly-half Barry John was among those to pay tribute, saying: \"What a Welshman he was.\n'Welsh rugby, and the Welsh Rugby Union in particular, owes him a huge debt of gratitude for his huge contribution to the game as player, coach and administrator.\n'When he walked into the dressing room before a game he didn't talk about what we were going to do and how we were going to play. All the chat was about the Welsh factor.\n\"He never overplayed it, although I remember being at Twickenham for a game against England when he told us it was such an important game \"that even the dogs are barking in Welsh\".\n\"He had the belief that when he sent his team on to the field they all knew how lucky they were to be playing for Wales. In his eyes, 15 Welshmen were always better than any opposition.\n\"Clive was abrasive, confident and Welsh to the core.\n\"He was made for the Wales coach job. He was also fortunate a group of good players turned up with a similar mindset, but his involvement was key to our success.\n\"With his death, a genuine chunk of Welsh life has gone.\"\nAnother Wales and Lions legend, Sir Gareth Edwards, who was in the Wales team by the time Rowlands became coach, said: \"It's a very sad loss, one of the giants of Welsh rugby without question, one of the giants of rugby, a great character who will never be forgotten.\n\"He was an incredible coach, manager, president, you name it he's done everything for Welsh rugby.\"\nEdwards added: \"The first time I ever watched Clive Rowlands play I was at Millfield school and I came to watch Wales play Ireland, it was a Triple Crown match.\n\"I remember I was so taken by the whole atmosphere and Clive's unbelievable way of playing the game, the control he had.\n\"It didn't please everybody, there was a lot of kicking and what have you, but the game probably demanded that at that time.\n\"He without question, at that time of the game, in the little time you had in the preparation of a game, he was made for that situation. He could talk anybody to do anything.\n\"His passion, desire and knowledge of the game, meant he had all the attributes for the little time we had in preparation.\n\"Clive became an integral part of my early years in the Welsh team and indeed successful in it because I remember in his first season as coach, we won the Triple Crown.\n\"Even the non-speaking Welsh players in the team knew what 'calon' (heart) was because that was Clive's favourite sentiment just before a game. It made you think a great deal.\n\"Clive was a fantastic motivator and many times he would say something, but he'd say the wrong thing and the boys would start to laugh, but he'd change it in a word and that's why he was so successful.\n\"People today see how players are so professional in their preparation, we didn't have time in those days.\n\"We had a day or so to prepare for the game, an hour or two in the changing room and Clive had to wind us up and he'd wind us up like a corkscrew.\n\"He'd open the door and virtually kick us out onto the field and the boys were ready.\n\"There's no doubt in those early successes when we started winning Triple Crown's or Grand Slams in the early 70s, it was Clive's motivation and preparation that inspired us all and got the results we had in those days.\"\nFormer Wales and Lions centre John Devereux wrote: \"Wales has lost another great man, Clive played a big part in my career for Wales and for the Lions.\n\"The tour to Oz in 89 was a great tour and he was a great team manager. Rest in peace my old friend.\"\nRowlands' village club Cwmtwrch also paid tribute to their former trustee, life member and president, writing: \"Clive's passion for Cwmtwrch was second to none, he elaborated so much on the unique Upper and Lower sections of the village that it became well known the world over.\"\nThe Lions said: \"All our thoughts are with the family and friends of Clive Rowlands.\n\"A true Welsh rugby legend, Clive managed the Lions on our Tour of Australia in 1989 and will be greatly missed by the entire rugby community.\"", "url": "https://www.bbc.com/sport/rugby-union/66325527"}