{"authors": ["Shamoon Hafez", "www.facebook.com"], "date_download": "2025-05-19 15:25:31", "date_modify": "2025-05-19 15:25:31", "date_publish": "2015-02-13 16:43:10", "description": "Josh King scores a hat-trick as Championship side Blackburn shock 10-man Premier League side Stoke in the FA Cup fifth round.", "filename": "sport_football_31423138_1747668331.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81013000/jpg/_81013961_blackburncelebrate2-ap.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31423138_1747668331.html", "title": "Blackburn Rovers 4-1 Stoke City", "title_page": "Blackburn Rovers 4-1 Stoke City - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Josh King's hat-trick helped Blackburn shock 10-man Premier League side Stoke and reach the FA Cup quarter-finals.\nPeter Crouch reacted quickest to poke Stoke ahead from close range.\nBut Championship side Rovers were level when forward King, who had earlier hit the crossbar, made amends by flicking in the equaliser from a corner.\nGeoff Cameron was sent off for bringing down King, with Rudy Gestede converting the penalty, before King raced clear to score twice with similar strikes.\nIt was an embarrassing return to Ewood Park for Stoke boss Mark Hughes who managed Rovers for four years, guiding the side to an FA Cup semi-final in 2007.\nCurrent manager Gary Bowyer - youth team coach under Hughes - stated before the match that Hughes had \"taken the club to another level\".\nHe led the Lancashire side into Europe twice, leading them to seventh in the 2007-08 Premier League season before joining Manchester City.\nSuch has been Blackburn's plight since relegation from the top division in 2012, they now lie ninth in the second tier, reporting debts of £79.8m last month.\nBut after troubled times, the FA Cup has given the players and supporters something to cheer about, as they knocked out a second Premier League side in this year's competition.\nThey were behind after just 10 minutes though. Victor Moses swung in a corner which the home side were unable to deal with as Crouch stuck out a leg to finish from inside the six-yard box.\nIt was the only high point in an otherwise disappointing match for Stoke as Blackburn reacted positively with forward King causing numerous problems. However, he could only hit the bar from a presentable opportunity, before neatly nodding in the leveller.\nGestede fluffed a glorious chance just before the turning point of the match.\nFormer Manchester United forward King was barged over in the penalty area by last man Cameron - who received a straight red card - and Frenchman Gestede calmly slotted home his 14th goal of the season.\nBowyer's men were firmly in control and extended their lead further in the second half. King completed his treble in the space of four minutes - both with cool finishes after running clear of the Stoke defence.\nGestede had a header kept out by City keeper Jack Butland, and Craig Conway shot wide after a mazy run, as Blackburn progressed into the last eight.\nBlackburn manager Gary Bowyer:\n\"It was a hell of a cup tie. We have immense pride for the supporters and it is a terrific result for the club.\n\"We were extremely disappointed to concede a soft goal but the lads bounced back from that.\n\"We will enjoy tonight but I said to the players, we have to focus on Cardiff for our next game. We would like another home draw but we will take each game as it comes.\"\nStoke manager Mark Hughes:\n\"We were well beaten today, credit to Blackburn, they put the ball in good area and used the threats they had up front. We didn't deal with it all afternoon, we got our noses in front without really dictating Blackburn. We allowed them to get back into the game.\n\"We couldn't deal with the pair of them [Rudy Gestede and Josh King]. All in all, a poor performance from us.\n\"We wanted to progress and I couldn't emphasise the point enough in the lead up to the cup games, but we need to get our heads down this week and not let our season peter out.\"", "url": "https://www.bbc.com/sport/football/31423138"}