{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:31:16", "date_modify": "2025-04-26 06:31:16", "date_publish": "2025-02-27 09:43:10", "description": "Former Sunderland striker Martin Smith says Friday's match against Sheffield Wednesday is pivotal to the club's promotion hopes.", "filename": "sport_football_articles_cwynn6xenwdo_1745649076.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3b26/live/f1469a50-f4ec-11ef-ae0a-4bca4f518eb0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cwynn6xenwdo_1745649076.html", "title": "Martin Smith: Sheffield Wednesday game 'huge' for Sunderland", "title_page": "Martin Smith: Sheffield Wednesday game 'huge' for Sunderland - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Sunderland's home meeting with Sheffield Wednesday on Friday is \"huge\" in terms of their promotion hopes, according to former Black Cats striker Martin Smith.\nThey have lost their past two Championship matches to slip eight points behind the automatic promotion places and face a Wednesday side still harbouring serious play-off hopes.\n\"Friday is huge because are you looking at the top of the table or what's coming behind you?\" Smith told BBC Radio Newcastle.\n\"If you go and win Friday you're still looking at that top two and things can change massively if the results go your way on Saturday.\n\"If you get beaten you're suddenly looking over your shoulder if Coventry win, so I think Friday is absolutely massive in terms of what could happen leading towards the end of the season.\"\nSunderland were beaten 2-1 at leaders Leeds United 10 days ago and followed that up with a home defeat by Hull City last Saturday.\nSmith, who scored 25 goals in more than 100 appearances for the Wearside club in the 1990s, is hoping a night game at the Stadium of Light can get his former side back on track.\n\"Night games tend to be a higher tempo, the atmosphere is better so there should be no worries about being up for it, so hopefully it's the one that gets everyone thinking positively again.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cwynn6xenwdo"}