{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:51:16", "date_modify": "2025-05-21 06:51:16", "date_publish": "2025-03-29 22:37:25", "description": "Real Madrid plot £90m move for Man Utd captain Bruno Fernandes, Man City are interested in Barcelona midfielder Pedri and Chelsea are keen on Barca defender Jules Kounde.", "filename": "sport_football_articles_cn5250xkw7yo_1747810276.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1856/live/7c2db1f0-0cec-11f0-ac9f-c37d6fd89579.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cn5250xkw7yo_1747810276.html", "title": "Football gossip: Fernandes, Zubimendi, Pedri, Larsson, Kounde, Fernandez", "title_page": "Football gossip: Fernandes, Zubimendi, Pedri, Larsson, Kounde, Fernandez - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Real Madrid plot £90m move for Manchester United midfielder Bruno Fernandes, Manchester City are interested in Barcelona midfielder Pedri and Chelsea are keen on Barcelona defender Jules Kounde.\nManchester United's Portugal midfielder Bruno Fernandes, 30, is a £90m transfer target for Real Madrid. (Star), external\nIncoming Arsenal sporting director Andrea Berta will have the task of completing a deal for Real Sociedad's Spain midfielder Martin Zubimendi amid interest in the 26-year-old from Real Madrid. (Mirror), external\nManchester City view Spain international Pedri as an ideal option for their midfield but Barcelona have no intention of selling the 22-year-old. (Fichajes - in Spanish), external\nManchester City have held initial talks about signing 20-year-old Sweden midfielder Hugo Larsson, with Eintracht Frankfurt holding out for at least £50m. (Sky Sports Germany), external\nChelsea have made Barcelona's France defender Jules Kounde, 26, their primary target for the summer window. (Sport - in Spanish, external)\nBarca are close to agreeing a contract extension with 34-year-old Polish keeper Wojciech Szczesny until June 2026. (Fabrizio Romano), external\nBournemouth are keen on signing Spain goalkeeper Kepa Arrizabalaga on a permanent deal from Chelsea this summer. The 30-year-old is currently on a season-long loan with the Cherries. (Fabrizio Romano, external)\nAtletico Madrid want Chelsea's Argentina midfielder Enzo Fernandez, 24 - with the Spanish side preparing an offer of about £25m, plus 21-year-old Spain midfielder Pablo Barrios, for the World Cup winner. (Fichajes - in Spanish, external)\nRB Leipzig hold a serious interest in Sunderland midfielder Jobe Bellingham, 19, but consider the Black Cats' current asking price for the England U21 international too high. (Sky Sport Germany, external)", "url": "https://www.bbc.com/sport/football/articles/cn5250xkw7yo"}