{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:20:12", "date_modify": "2025-05-20 12:20:12", "date_publish": "2023-08-04 21:17:14", "description": "Catalans Dragons stay four points clear at the top of Super League with a 30-10 win over coachless Warrington Wolves.", "filename": "sport_rugby-league_66397937_1747743612.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/17A3A/production/_130662869_01h711vnxqe0fjss4mf1321ghd.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-league_66397937_1747743612.html", "title": "Super League: Warrington Wolves 10-30 Catalans Dragons - Catalans ease to two more points", "title_page": "Super League: Warrington Wolves 10-30 Catalans Dragons - Catalans ease to two more points - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Catalans Dragons remain four points clear in Super League after heaping more misery on Warrington Wolves.\nWire, in their first game since the departure of coach Daryl Powell, lost a sixth straight Super League game.\nBut the French side reeled off a fourth consecutive win thanks to five different try scorers - Adam Keighran, Tom Davies, Mitchell Pearce, Matt Whitley and Matt Ikuvalu.\nThe Wolves' consolation scores came from Ben Currie and Josh Thewlis.\nWhen Warrington won 20-16 in the south of France on Easter Saturday, it was an eighth straight victory in their best ever start to a Super League season and Powell was posing for photos with travelling supporters.\nBut the wheels fell off for him, with seven defeats in Powell's last eight league games in charge and a painful Challenge Cup quarter-final exit to 12-man Wigan Warriors sealing his demise.\nThe Wolves also knocked Catalans out of the cup in May, but since then the two clubs have been on opposing trajectories.\nAnd that was underlined in the first half as Steve McNamara's outfit showed why they are on top of the league and in with a big chance of reaching the Grand Final in October.\nFrom Pearce's high kick, the ball was allowed to bounce and centre Keighran, who will join Wigan Warriors next season, latched on to it and dived over.\nThen when the home side, under the interim charge of Gary Chambers, lost possession deep in their own territory, Catalans swiftly worked it across the line for Davies to slide in at the corner, before those handling skills were evident again as Pearce rounded off another slick move.\nHowever, a 99th career try for Currie, following his good aggressive line, gave the Wolves hope going in at the interval.\nWarrington were halted by strong defending from the French side early in the second period, and when Catalans went forward, Tyrone May's inch-perfect grubber kick was touched down by Whitley.\nIkuvalu's try added gloss to the scoreline, while Thewlis' late score was little more than a consolation for the home side, who climbed a place in the table to fifth despite the loss, due to Hull KR's heavy defeat at Wigan.\nWarrington now have over two weeks to regroup and try to rescue their flagging campaign before they head to Leeds Rhinos on Sunday, 20 August.\nWarrington: Dufty; Thewlis, Mata'utia, Ratchford, Wrench; Williams, Drinkwater; Dudson, Walker, Vaughan, Nicholson, Currie, Crowther.\nInterchanges: Clark, Kasiano, Philbin, Mikaele.\nCatalans: Tomkins; Davies, Keighran, Ikuvalu, Johnstone; May, Pearce; Bousquet, Da Costa, Navarete, Whitley, Seguier, Garcia.\nInterchanges: Goudemand, Chan, Romano, Simone.\nReferee: Liam Moore.", "url": "https://www.bbc.com/sport/rugby-league/66397937"}