{"authors": ["Nick Mashiter", "www.facebook.com"], "date_download": "2025-05-21 03:48:49", "date_modify": "2025-05-21 03:48:49", "date_publish": "2025-04-07 15:47:54", "description": "In their past two Premier League campaigns Southampton have had six managers. But was sacking Russell Martin a mistake?", "filename": "sport_football_articles_c4g70d1wd7jo_1747799329.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7ab3/live/deabf8b0-13c6-11f0-ba12-8d27eb561761.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c4g70d1wd7jo_1747799329.html", "title": "Southampton sack Ivan Juric: Was sacking of Russell Martin a mistake?", "title_page": "Southampton sack Ivan Juric: Was sacking of Russell Martin a mistake? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "In their past two Premier League campaigns Southampton have had six managers.\nIvan Juric's exit - following relegation from the Premier League after defeat by Tottenham - sees the conveyor belt of coaches continue and casts doubt on the club's direction.\nSimon Rusk may now be the caretaker but he will have taken charge of eight games come the end of the season - as many as Nathan Jones managed in 2022-23.\nRussell Martin was dismissed in December with the side nine points from survival and replaced by Juric, who has won just two of his 16 matches and left with the club 22 points away from safety.\nThere have been 14 occasions where a Premier League club has gone through three permanent managers in one season.\nNot counting Rusk, Southampton are on the list twice (2022-23 and 2004-05) along with Fulham (2013-14 and 2018-19) and Watford (2019-20 and 2021-22), as well as relegated Leeds in 2022-23 when Sam Allardyce could not save them with four games in charge.\nIn 2022-23 Saints replaced Ralph Hasenhuttl - who had a 0.86 points per game (PPG) record - with Jones, who was sacked with a PPG record of just 0.38, then Ruben Selles was appointed to earn 0.63 PPG.\nSurvival is hard with that rate of change - only Portsmouth (2004-05 and 2008-09) and Swansea (2016-17) have managed it.\nAnd for newly promoted sides it's even harder - 50% have been relegated after just one season in the Premier League over the past 10 years.\nSouthampton will increase that percentage and are now looking for someone new to take them back up.\nBut as that search begins, many will question whether the sacking of Martin was a mistake in the first place?\nShould Southampton have followed in the footsteps of the likes of Norwich and Burnley and kept faith with the man who took them up - knowing they would be well placed to lead another promotion charge, with relegation already on the cards?\nUnder Martin, Southampton – along with champions Leicester last season – were among only 37% of clubs relegated from the Premier League to bounce straight back, in the past decade.\nIt was always going to be a struggle to keep Southampton in the Premier League, even before their poor summer 2024 transfer window.\nThe departure of technical director Jason Wilcox, a big advocate of ex-boss Martin, to Manchester United last year left the Saints head coach without a crucial ally and vital support.\nSouthampton returned to the Premier League without sufficiently replacing Wilcox, which left them without a key position and experience.\nThere was frustration with the ownership as chief executive Phil Parsons - who joined from Dyson in July 2023 - had limited experience in the game and the club struggled to move quickly enough to get deals done last summer.\nThe target for the season was to avoid relegation and build the team's value, something they have done with the emergence of Tyler Dibling - even if their reported £100m valuation is unlikely to be achieved.\nMartin had a patient-passing, possession-based style of play - something he had implemented since becoming MK Dons manager in 2019 and continued at Swansea.\nIt was something that appealed to Southampton and why they were so determined to take him from the Swans after relegation in 2023, a move that turned acrimonious when Swansea took Martin to court.\n\"Every team we've had has looked similar but we've had to find a different way,\" he said after losing to Wolves in November.\n\"At MK Dons we had two strong, powerful centre-forwards so played two strikers and found a way to score goals. At Swansea we didn't have any wingers so we had to play defenders or midfielders.\n\"Last season we had so much attacking power for the Championship we scored a lot of goals.\n\"Now the guys are doing what we were told we couldn't in terms of having so much of the ball in the Premier League, but there has to be the same mentality there was last year.\n\"Whichever style of play you have, the game is about beating your opponent and dominating your opponent, and we don't do that quite enough yet.\"\nThe style criticisms came as the Saints struggled and the toxic atmosphere at St Mary's during the final weeks - including as Tottenham scored four goals in 25 minutes in Martin's final game - made the situation untenable.\nMistakes happened too often. The tone was set by goalkeeper Alex McCarthy's error to gift Joelinton the winner in Newcastle's 1-0 opening day victory in August - and it is perhaps naive to think Southampton would have survived this season.\nBut had Martin ridden out the storm - difficult in a football culture that demands everything yesterday - perhaps he would have been the best person to mount a promotion challenge.\nIt may have come down to how psychologically scarred the squad and club were from relegation, and it is a fanciful suggestion but the pedigree was there.\nJust two wins from 16 games, including a 3-0 FA Cup win over Swansea, is a sorry return for the now-departed Juric.\nAfter two months at Roma earlier this season, his record for 2024-25 is played 28, won six, drew four and lost 17.\nMartin left after five points from 16 Premier League games, while Juric won four from 14. Rusk, who steps in as caretaker again, earned a point in the 0-0 draw at Fulham.\nSources suggested Juric had struggled to bond with the squad. While he fell out with Flynn Downes, a £15m signing from West Ham in the summer, he reintegrated Kamaldeen Sulemana and Paul Onuachu who struggled to play under Martin.\nHe largely blamed the recruitment for Southampton's failing, with the Saints having missed out on a number of first-choice targets in the summer.\nLiam Delap and Jack Clarke went to Ipswich while Fabio Carvalho joined Brentford from Liverpool. Denmark international Matt O'Riley, who Martin worked with at MK Dons, went to Brighton and an offer for Bournemouth full-back Max Aarons was also rejected.\nSummer buys including Ben Brereton-Diaz, Ronnie Edwards and Charlie Taylor were also offered to Championship sides before January in the hope of loaning them out, with Edwards and Brereton-Diaz joining QPR and Sheffield United respectively.\nThe former Croatia international tried to impose his style: a high-press, aggressive, man-to-man game. But the Saints were unable to adapt well enough. Juric admitted he should have adjusted quicker to the Premier League with the squad he had.\nDecent performances at Liverpool and Manchester United, where Southampton led in both, showed glimpses but there was never going to be enough quality to survive.\nJuric may have inherited a sinking ship but he never looked like he would steer them to safety.\n\"I have some sympathy for Southampton as newly promoted sides have really struggled in recent seasons but it has been embarrasing for them,\" Premier League title winner Chris Sutton said on BBC Radio 5 Live's Monday Night Club.\n\"It has been a pathetic season. After the relegation the manager [Juric] said the aim was to get past Derby's record low of 11 points - that's the lowest of low bars.\n\"It has been a mess. The cautionary thing is look at what has happened to Luton, they are bang in trouble in the Championship and could go down again.\n\"That is my fear for Southampton.\"\nSheffield Wednesday boss Danny Rohl, a former Southampton coach under Hasenhuttl, is the clear favourite.\nSouthampton technical director Johannes Spors will lead the search, having already worked with Rohl when the pair were at RB Leipzig together.\nHe told BBC Sport in March: \"I have known Danny for a long time. When you know each other and make a career you follow each other. I was really happy for him when I saw he took the job in the Championship.\n\"One of the important parts of my job is knowing managers all around the globe in different countries. It's important to know talent in general. I want to bring talent to Southampton on the pitch and off the pitch. I'm always following talented people.\"\nRohl moved to Wednesday in October 2023 with the side seven points from safety in the Championship. He currently has them 13th and eight points adrift of the play-offs.\nWith Sheffield Wednesday's current financial situation - the staff and players received their March wages late - a move to the south coast is likely to appeal.\nLiam Rosenior, who has Strasbourg fourth in Ligue 1, has also been linked to the Saints role but is likely to be an outsider given the high-pressing style owners Sport Republic want from their next manager.\nRohl's style of front-foot defending and high-pressing attack fits the bill as Southampton search for an eighth manager in seven years.", "url": "https://www.bbc.com/sport/football/articles/c4g70d1wd7jo"}