{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:45:25", "date_modify": "2025-05-20 12:45:25", "date_publish": "2023-08-03 13:02:24", "description": "Jacob Stockdale earns his first Ireland cap in two years in Saturday's World Cup warm-up game against Italy, with Ulster team-mate Iain Henderson to captain the side.", "filename": "sport_rugby-union_66386655_1747745125.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/D6BC/production/_130627945_inpho_02295211.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-union_66386655_1747745125.html", "title": "Ireland v Italy: Jacob Stockdale earns first Ireland cap in two years with Iain Henderson captain", "title_page": "Ireland v Italy: Jacob Stockdale earns first Ireland cap in two years with Iain Henderson captain - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jacob Stockdale will earn his first Ireland cap in two years in Saturday's World Cup warm-up game against Italy, with Ulster team-mate Iain Henderson to captain the side in Dublin.\nStockdale has not featured at Test level since a try-scoring performance against Japan in July 2021.\nWith captain Johnny Sexton suspended, Jack Crowley will start at fly-half.\nIn addition to Stockdale and Henderson, Ulster's Stuart McCloskey, Rob Herring and Tom O'Toole are all given the nod.\nWith warm-up games against England and Samoa to come, head coach Andy Farrell has offered several fringe players in his 42-man squad a chance to stake their claim for inclusion in his final 33-strong panel for France.\nUlster hooker Tom Stewart is also set to make his Ireland debut having been named among the replacements alongside fellow uncapped players Ciaran Frawley and Calvin Nash.\nThis will be a huge opportunity for Stockdale to push for a regular starting spot in Farrell's side ahead of the World Cup.\nA standout performer in Ireland's 2018 Grand Slam triumph, Stockdale was part of this year's Six Nations squad but did not play, while he did not make the squad for last year's tour of New Zealand.\nThe 27-year-old is part of a shaken-up back three with Munster's Keith Earls earning his 99th cap - and first since last year's tour in New Zealand - on the opposite wing and Leinster's Jimmy O'Brien at full-back.\n\"[He's had] a few setbacks injury wise and form wise, he's been working his way back through that,\" Farrell said of Stockdale.\nCrowley, who made his Ireland debut against Fiji in November, is preferred to Ross Byrne and Frawley at out-half with Sexton beginning his three-match ban for misconduct.\nCrowley, 23, forms an all-Munster half-back partnership with Craig Casey.\nMcCloskey partners Robbie Henshaw, who missed most of the Six Nations campaign through injury, in midfield while O'Toole and Herring are joined in the front row by Munster's Dave Kilcoyne.\nHenshaw and back-rowers Caelan Doris and Ryan Baird are the only players retained from Ireland's starting line-up in the Grand Slam-clinching win over England in Dublin in March.\nPaolo Odogwu and lock Dino Lamb, both England-born, will make their Test debuts for Italy as part of Azzurri head coach Kieran Crowley's nine changes from last week's defeat by Scotland at Murrayfield.\nFormer Sale and Wasps player Odogwu, who is selected on the right wing, trained with his native country during Eddie Jones' reign without being capped, while Harlequins' ex-England Under-20 international Lamb lines up in the second row.", "url": "https://www.bbc.com/sport/rugby-union/66386655"}