{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 08:00:05", "date_modify": "2025-05-21 08:00:05", "date_publish": "2025-05-19 17:46:10", "description": "James Anderson takes two more wickets but Derbyshire hold out for a County Championship draw with Lancashire at Old Trafford.", "filename": "sport_cricket_articles_cdxvnr390dxo_1747814405.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a817/live/1b7cddf0-34d2-11f0-a7d6-116e90b77ae3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cdxvnr390dxo_1747814405.html", "title": "Derbyshire hold out for draw with Lancashire", "title_page": "County Championship: Derbyshire hold out for draw with Lancashire - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England bowlers past and present, James Anderson and Tom Hartley, took two wickets apiece but Lancashire's County Championship against Derbyshire ended in a tense draw.\nThe visitors closed on 220-8, 109 runs short of what had become a notional victory target.\nIn the morning session, Lancashire had declared on 184-7, thereby challenging their opponents to score 328 in 88 overs for victory.\nHarry Came made 63 but after reaching tea on 165-5, Derbyshire's batsmen settled for the draw.\nThe visitors' heroes were Anuj Dal, who faced 114 balls for 13 not out and Jack Morley, who was unbeaten on nought after 36 balls when the game ended.\nDespite remaining winless after six games, Lancashire take 13 points from the match, meaning that they move off the bottom of the Division Two table, whereas Derbyshire's 11 points keeps them in second place.\nIn the morning session, Lancashire scored 43 runs off six overs before declaring -the only batsman dismissed was George Balderson, who was caught at third man by Martin Andersson off Blair Tickner for nine, with Matthew Hurst 56 not out when Marcus Harris called his batsmen in.\nDerbyshire's pursuit of 329 began poorly when Caleb Jewell, on 12, played too early at a slower ball from Anderson and chipped a catch at Tom Bailey at mid-on.\nAnderson returned figures of 6-1-17-1 in his first spell but David Lloyd and Harry Came guided their side to 78-1 after 20 overs at lunch\nBut any optimism among the visiting supporters was dampened four balls after the resumption when Anderson trapped David Lloyd lbw for 30.\nUndaunted, Came and Wayne Madsen, saw off Anderson's second spell (4-2-4-1) and had added 50 in 16 overs before Madsen tickled Bailey down the leg side and was caught by Hurst for 17.\nBy that stage, Came has reached his third fifty of the season off 72 balls, most of them pedigree strokes, but Brooke Guest could not match his partner's fluency and was bowled round his legs for two when trying to sweep Hartley.\nFour overs later, Hartley struck again when he took the vital wicket of Came, the Derbyshire batsman pushing uncertainly forward and giving a catch to George Bell at short leg.\nBy tea the visitors had reached 165-5 and it soon became clear that Derbyshire's batsmen had abandoned all thoughts of victory.\nOver an hour into the evening session, Lancashire took their sixth wicket when Josh Bohannon induced Martin Andersson to drive a full toss straight to Keaton Jennings at short extra cover and his dismissal for 43 was followed two overs later by a second success for Bohannon when Zak Chappell gave him a return catch.\nThat left Derbyshire on 212-7 with 18 overs to be bowled and Tom Bailey struck the next blow when he had Ben Aitchison lbw for nought with 65 balls left in the game.\nAfter 80 overs Lancashire took the new ball but Dal and Morley resisted successfully.", "url": "https://www.bbc.com/sport/cricket/articles/cdxvnr390dxo"}