{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:05:15", "date_modify": "2025-05-21 05:05:15", "date_publish": "2025-04-04 07:11:07", "description": "Galatasaray boss Okan Buruk \"acted as if he had been shot\" as part of a \"planned provocation\" of Jose Mourinho following their confrontation during a Turkish Cup match, according to Fenerbahce.", "filename": "sport_football_articles_c0qn0wjn5jwo_1747803915.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/433a/live/c5949c20-111d-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c0qn0wjn5jwo_1747803915.html", "title": "Fenerbahce accuse Galatasaray boss of acting 'like he'd been shot' in Jose Mourinho row", "title_page": "Fenerbahce accuse Galatasaray boss of acting 'like he'd been shot' in Jose Mourinho row - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Fenerbahce have accused Galatasaray boss Okan Buruk of acting \"as if he had been shot\" after a confrontation with their manager Jose Mourinho on Wednesday night.\nIn a strongly-worded statement, Fenerbahce accused Buruk of having the \"audacity to make disrespectful hand gestures\" to provoke Mourinho, who then \"briefly touched his nose\" in response.\nThe Turkish Cup match, which Galatasaray won 2-1, came amid increased animosity between the two clubs.\nFollowing the match Galatasaray accused Fenerbahce boss Jose Mourinho of \"physically attacking\" their manager Buruk after he appeared to grab his nose following the fiery derby match.\nThe incident occurred after the final whistle at Sukru Saracoglu Stadium, when both managers were interacting with the match officials in the centre circle.\n\"This was a planned provocation [by Buruk] and as part of this plan the individual acted as if he had been 'shot' and fell to the ground in a professional manner, and his disrespectful words and actions are documented on video,\" Fenerbahce said in a statement.\n\"The absurdity of someone who is touched on the nose immediately throwing himself to the ground and writhing for seconds is clear to the public.\n\"It is evident that this individual's tendency to fall to the ground, seen during his playing days, continues in his coaching career, showing that this behaviour is a characteristic attitude.\"\nBuruk sought to play the incident down at his post-match news conference, saying there was \"nothing\" between him and Mourinho.\nBut Galatasaray inflamed the situation further by posting a video on X mocking Mourinho in the style of US comedy South Park.\nFenerbahce substitute Mert Yandas and Galatasaray substitutes Kerem Demirbay and Baris Yilmaz were shown red cards for their part in a melee between the two benches during stoppage time.", "url": "https://www.bbc.com/sport/football/articles/c0qn0wjn5jwo"}