{"authors": ["Alastair Telfer", "www.facebook.com"], "date_download": "2025-05-21 05:30:57", "date_modify": "2025-05-21 05:30:57", "date_publish": "2025-02-08 22:11:24", "description": "Fin Smith admits he started \"like a rabbit in the headlights\" on his first Test start before settling down to produce a man-of-the-match performance in England's last-gasp victory over France.", "filename": "sport_rugby-union_articles_cd0jm74kj1po_1747805457.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/602c/live/80d9c180-e663-11ef-bd1b-d536627785f2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cd0jm74kj1po_1747805457.html", "title": "Fin Smith delivers England Six Nations win over France after nervy beginning", "title_page": "Fin Smith delivers England Six Nations win over France after nervy beginning - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Fly-half Fin Smith admitted he started \"like a rabbit in the headlights\" on his first Test start before settling down to produce a man-of-the-match performance in England's last-gasp win over France.\nWith the match into its 80th minute, the 22-year-old set up the winning try for Elliot Daly before knocking over the winning conversion to propel England to a thrilling 26-25 Six Nations victory.\nSmith was named at 10 instead of his namesake Marcus Smith, who started at full-back and missed two relatively straightforward kicks before Fin Smith took over from the kicking tee.\nThe Northampton star showed nerves of steel to nail two vital late conversions as England fought back to the delight of the Allianz Stadium.\n\"I was probably not as calm as I looked,\" Smith told BBC Sport.\n\"In the first half, I was like a bit of a rabbit in the headlights, but I felt like I grew into the game and got more of a feel for what Test rugby is like and what it is like to play at that level.\n\"I'll learn a lot from that, but I am happy with my first hit out [from the start].\n\"I was standing over the final conversion, which felt like the longest minute of my life, thinking this better go over, or otherwise I am going to be in big trouble.\"\nSmith, who was first capped against Italy last year, previously had only came off the bench in his seven international appearances but was handed his chance as England sought to upset the pre-tournament favourites.\nDespite some loose kicking in open play, Smith grew into his first start and delivered the key match-winning moments, which included a chip-kick that was sharply finished by Northampton team-mate Tommy Freeman.\n\"Defensively I thought he [Fin Smith] was very good and he led the troops out there. He was physical,\" try-scorer Daly told BBC Sport.\n\"Then in attack he got the ball to space and put some good kicks in behind.\"\nSmith, who was forced to leave Worcester Warriors following their demise in 2022, steered Northampton to the Premiership title last season, but handing him his first start against an in-form France side was still something of a gamble.\nFormer Saints and England fly-half Paul Grayson said Smith's ability to overcome early mistakes showed \"a sign of an international player\".\n\"I have watched him a bit and that's what he is,\" Grayson told the BBC's Rugby Union Weekly podcast.\n\"He's a good organiser, he is measured, and he will call the right decisions most of the time.\n\"His open field kicking needs work. He kicked some shockers.\n\"But that didn't define him. He grew into the game, and got better the longer he was on the pitch.\"\nIn the autumn, England were leading heading into the final stages against Australia and New Zealand but failed to close out both games.\nAgainst Ireland in their opening Six Nations match, Steve Borthwick's side led 10-5 at half-time but fell away in the final quarter.\n\"There is so much relief,\" added Smith.\n\"We felt we were due one and luckily we were on the right side of one. There is a lot of joy.\"\nFormer England scrum-half and World Cup winner Matt Dawson believes the way Smith grabbed the game in final quarter makes him \"more of the man\" for the 10 shirt going forward.\n\"Watching other players go up to Fin [after the game], I saw more of the senior players pretend to bow down to him a little bit,\" he added.\n\"That means quite a lot for someone who is 22 years old.\n\"They obviously appreciate that they're being managed and looked after on the pitch by the 10.\n\"Not every fly-half has the ability to do that to the team.\"\nBorthwick was pleased with the way his side's scramble defence forced France's much-lauded backs into making errors, and consequently butchering multiple chances to score tries.\n\"I think the players handled themselves really well throughout that last period of the game,\" Borthwick told BBC Sport.\n\"That was a tough Test match and France are an exceptional side with world-class players throughout their team and we were really tested.\n\"You can talk about the tries scored, and there were some good tries, and I think you can talk about how hard the players ran back to make tackles and save tries.\n\"That's a measure of how much these players care about this team.\"\nEngland have won six of their past 14 Tests, but only one other victory came against a top-four side - Ireland at home in last year's Six Nations.\nCaptain Maro Itoje believes his side finally getting over the line against one of the world's best teams shows the potential of his young side.\n\"That is the foundation of what we can be going forward,\" he said.\n\"Imagine how good we can be when we add that layer of accuracy on top of this fight.\n\"We will look to build from here.\"\nEngland, who last won the Six Nations in 2020, next face Scotland on 22 February at Allianz Stadium.", "url": "https://www.bbc.com/sport/rugby-union/articles/cd0jm74kj1po"}