{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:32:39", "date_modify": "2025-05-20 14:32:39", "date_publish": "2023-07-28 20:58:19", "description": "Full-back Jack Welsby scores two tries to help St Helens overcome a gutsy Leeds side in the latest chapter of their intense rivalry.", "filename": "sport_rugby-league_66301853_1747751559.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0F39/production/_130579830_pc2_1013-2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-league_66301853_1747751559.html", "title": "Super League: St Helens 22-18 Leeds Rhinos - Jack Welsby shines in intense encounter", "title_page": "Super League: St Helens 22-18 Leeds Rhinos - Jack Welsby shines in intense encounter - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Full-back Jack Welsby delivered two clutch tries to help St Helens overcome gutsy Leeds in the latest chapter of their intense Super League rivalry.\nThe lead continually changed hands in a see-sawing affair, although neither side could be separated at the break.\nWill Hopoate and Tee Ritson scored for Saints, with Rhyse Martin and Sam Walters replying for the visitors.\nWelsby added his two tries either side of Nene MacDonald's score as Saints edged it in a frantic second period.\nSaints' disappointment at being dumped out of the Challenge Cup last weekend was compounded by the loss of key players such as Alex Walmsley, Agnatius Paasi and Louie McCarthy-Scarsbrook through injury, but a patched-up side found character and spirit to bounce back.\nGeorge Delaney, Sam Royle and Lewis Baxter belied their youthful age with mature displays, while newcomer Moses Mbye was introduced to give veteran James Roby a break.\nHopoate had his best game in a Saints shirt, opening the scoring with a fine finish from a Welsby grubber kick, while slick moves created a try for Ritson right at the end of the opening half.\nWelsby's first try was a typically forthright surge and defiant finish. A superb line break, with the full-back galloping on to Jonny Lomax's pass, was the key to the second crucial score.\nLeeds have been a stuttering unit at times in 2023 but they seemed to be roused by the encounters with their old foes, and this was no exception.\nMartin plunged in to punish a loose Welsby kick that went out on the full, while Walters rounded the mercurial Saints full-back with devastating footwork to enhance his rapidly growing reputation.\nMacDonald's try, a powerful finish after Saints coughed up good ball, showed the fight within the Leeds side, and they made the hosts work defensively with a string of sets in their end of the field.\nBut the key moment belonged to Saints, with Welsby ensuring that there would be no third golden-point period in meetings between the two in 2023.\nSt Helens head coach Paul Wellens:\n\"Jack's [second] try was absolutely breathtaking. There's only him and maybe Bevan French and Jai Field in the competition who could score that try. The fans come to games to see moments like that.\n\"It has been a challenging week for us as a club and a disappointing week. But we had a choice on where to channel our emotions and I am so lucky we have a group of individuals who are honest, who want to go out and perform.\n\"Our squad is fairly deep and what we have is a lot of lads who aren't getting regular opportunities. But we saw tonight that they gave everything - absolutely everything they have got.\"\nLeeds head coach Rohan Smith told BBC Radio Leeds:\n\"It was super competitive, hard fought from both teams, overall the defence of both teams was pretty good, there were a couple of reads that we'd like back but overall I thought we tackled well in a game than didn't have any real rhythm, it could have gone either way.\n\"I don't think that was a high standard of game, but it was a high standard of competitiveness.\n\"We had opportunity and position to create more points but the bounce of the ball went the other way.\"\nSt Helens: Welsby; Makinson, Hurrell, Hopoate, Ritson; Lomax, Dodd; Lees, Roby, Delaney, Bell, Royle, Knowles.\nInterchanges: Norman, Davies, Baxter, Mbye.\nLeeds: Myler; Fusitu'a, Martin, MacDonald, Handley; Austin, Sezer; Oledzki, O'Connor, Walters, Bentley, McDonnell, Smith.\nInterchanges: Johnson, Lisone, Holroyd, Sangare.\nReferee: Liam Moore.", "url": "https://www.bbc.com/sport/rugby-league/66301853"}