{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:36:56", "date_modify": "2025-05-20 14:36:56", "date_publish": "2023-07-28 14:41:13", "description": "Chelsea: 'You don't need an armband to be a leader' - Ben Chilwell", "filename": "sport_articles_cjmr7xk22jgo_1747751816.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d573/live/dd577b90-2d47-11ee-bdb5-c3a8b20de896.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cjmr7xk22jgo_1747751816.html", "title": "'You don't need an armband to be a leader'", "title_page": "Chelsea: 'You don't need an armband to be a leader' - Ben Chilwell - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Alex Howell, BBC Sport\nMauricio Pochettino has said that he is not going to name a club captain until he's had a chance to look at the players in his squad ahead of Chelsea's opening Premier League match against Liverpool on 13 August. But could Ben Chilwell's leadership traits put him in the running?\n\"I would love to be captain. I'm sure you've had that answer off a few of the players,\" he told BBC Sport.\n\"I was captain of the youth team at Leicester and thoroughly enjoyed it. I think it brings the best out in me and my game, having a little bit more pressure and trying to help people around me. I think it's one of my strengths.\n\"I don't think you need an armband to be a leader though, so whether I get it or I don't I'll continue to do what I'm doing.\"\nChilwell is determined to lead the club back to the top end of the table.\n\"I won the Champions League in my first season and after that, seeing the reaction that it brought around the club, I want to feel that again with Chelsea - not just in football but with Chelsea.\n\"I want to help Chelsea get back to winning titles and winning cups.\n\"I am not going to run when things are going badly. I want to be one of the reasons that helps us get back to the best.\"", "url": "https://www.bbc.com/sport/articles/cjmr7xk22jgo"}