{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:57:04", "date_modify": "2025-05-21 03:57:04", "date_publish": "2025-02-09 16:42:10", "description": "Derby County are understood to have made an official approach to bring Blackburn Rovers boss John Eustace to Pride Park.", "filename": "sport_football_articles_cgmyd3p1mpvo_1747799824.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/241b/live/c2e747f0-e703-11ef-9b11-a943219c72d4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cgmyd3p1mpvo_1747799824.html", "title": "John Eustace: Derby County make official approach for Blackburn boss", "title_page": "John Eustace: Derby County make official approach for Blackburn boss - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Derby County are understood to have made an official approach to bring Blackburn Rovers boss John Eustace to Pride Park.\nThe Rams are looking for a new manager after they sacked Paul Warne on Friday.\n\"I've just come off the pitch and realised that they've made an official approach,\" Eustace told BBC Radio Lancashire after watching his side lose 2-0 to Wolverhampton Wanderers in the FA Cup fourth round.\n\"I'll have to chat with the owners and see what's happened.\n\"I'm sure Steve [Waggott] and Suhail [Sheikh] will want to sit down with me. I'd be disappointed if they didn't.\"\nEustace, who made 62 appearances for Derby as a player, took over at Ewood Park in February.\nBlackburn have won just two of their past 11 league games, a run that has frustrated the head coach.\n\"I'm away from my family a lot and as everyone is, I'm working my socks off to make sure that Blackburn are really competitive,\" Eustace, who previously managed Birmingham City, added.\n\"It's about seeing this club be back where it should be. The fans are fantastic fans here as well and I think everyone connected with the club wants it to succeed as much as possible.\n\"I've been linked with jobs all season. That is down to the effort of the group of players that we have got. It's part of the job.\"\nEustace played for Derby County during two separate spells - first joining on loan from Watford in the 2008-09 season - before joining the club permanently for two years in 2013.\nThe Rams are 22nd in the Championship but ended a run of seven straight league defeats with a draw at Norwich on Saturday.", "url": "https://www.bbc.com/sport/football/articles/cgmyd3p1mpvo"}