{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:31:53", "date_modify": "2025-05-21 05:31:53", "date_publish": "2025-01-31 17:35:43", "description": "Cardiff City boss Omer Riza is given a three-game touchline ban after his red card during the game against Swansea City.", "filename": "sport_football_articles_cm23lzpn605o_1747805513.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/381f/live/fad0de20-da3c-11ef-a37f-eba91255dc3d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cm23lzpn605o_1747805513.html", "title": "Cardiff City: Omer Riza given touchline ban after Swansea City red card", "title_page": "Cardiff City: Omer Riza given touchline ban after Swansea City red card - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cardiff City boss Omer Riza has been given a three-game touchline after being sent off during his side's 3-0 south Wales derby win over Swansea City.\nRiza was charged with misconduct by the Football Association (FA) after being dismissed by referee James Bell following an altercation with Swansea midfielder Goncalo Franco on the touchline at Cardiff City Stadium.\nRiza has been fined £3,500 and warned over his conduct after admitting to the charges, which included acting in an improper and/or confrontational manner during the 92nd-minute incident as well as after his sending off.\nHe will be banned from the touchline for Cardiff's Championship game at Leeds United on Saturday, as well as the FA Cup fourth-round tie at Stoke City on 8 February and the league game to Portsmouth three days later.\nSpeaking prior to the outcome of the case, Riza said he would accept a potential punishment from the FA, but added that he had been left angered by multiple incidents involving Franco during the Swansea game.\nVictory over the Swans came just two days after Riza confirmed the passing of his father, Josh.\n\"I wasn't happy with my own actions if I'm being honest, very uncharacteristic of me,\" Riza said last week.\n\"But sometimes you're fuelled by things that happen. There's three or four instances in the game from Franco that I wasn't happy with, aimed at me.\"\nHe added: \"I'm not going to divulge what happened. I put down what I felt happened to the FA. Hopefully they'll read it and show some compassion. But that's it, I accept whatever decisions are made.\"\nAn independent regulatory commission imposed the sanctions and is due to publish its written reasons in due course, the FA says.\nA brace from Callum Robinson and Dimitrios Goutas' header earned Cardiff an emphatic victory over Luke Williams' Swansea side on 18 January.", "url": "https://www.bbc.com/sport/football/articles/cm23lzpn605o"}