{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:57:38", "date_modify": "2025-05-21 07:57:38", "date_publish": "2024-12-23 11:10:15", "description": "Barrow head coach Stephen Clemence praises the character of his squad as they end a nine-game winless run.", "filename": "sport_football_articles_cqx8q1xyrr8o_1747814258.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0035/live/86448220-c117-11ef-b76e-9de78285d5f5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cqx8q1xyrr8o_1747814258.html", "title": "Barrow: Stephen Clemence admits to 'hard' spell as winless run ends", "title_page": "Barrow: Stephen Clemence admits to 'hard' spell as winless run ends - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Barrow head coach Stephen Clemence reflected on a 'hard' spell as his team ended a nine-game spell without a win.\nThe 2-0 victory over Fleetwood Town was a first in League Two since 5 October and moved them up to 15th.\nInjuries have hit the squad but Clemence has been impressed with his side's character in a difficult period.\n\"It's been very hard,\" he told BBC Radio Cumbria. \"But full credit to the boys, they've never chucked it, that's why I'm right behind them.\"\nBarrow face Christmas away fixtures against Salford City and Tranmere Rovers as they bid to get a good run going.\nAnd with many key players having recovered from injuries, Clemence is hopeful for better in the second half of the season.\n\"Paul Farman, Niall Canavan, Robbie Gotts, Kian Spence, Emile Acquah, Connor Mahoney, Ged Garner, Katia Kouyate, they've all been four to 10-week injuries,\" he said.\n\"That is very hard to deal with for anybody.\"\nHe added: \"I know there's a group of players in there who care, who want to do well for the football club and who want to do well for their own careers.\n\"If they carry on the way they are, there's no reason why we can't have a successful second part of the season.\"", "url": "https://www.bbc.com/sport/football/articles/cqx8q1xyrr8o"}