{"authors": ["Simon Stone at the Gaughan Group Stadium", "www.facebook.com"], "date_download": "2025-05-21 06:14:30", "date_modify": "2025-05-21 06:14:30", "date_publish": "2025-02-08 16:48:29", "description": "Manchester City come from behind to knock League One Leyton Orient out of the FA Cup but Jamie Donley produces the strike of a lifetime for the Londoners.", "filename": "sport_football_articles_crlkw03p7g8o_1747808070.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0d07/live/78488e40-e639-11ef-a319-fb4e7360c4ec.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_crlkw03p7g8o_1747808070.html", "title": "Leyton Orient 1-2 Manchester City: Jamie Donley scores FA Cup wonder goal", "title_page": "Leyton Orient 1-2 Manchester City: Jamie Donley scores FA Cup wonder goal  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The history books will say Leyton Orient led their thrilling FA Cup fourth-round tie with Premier League champions Manchester City for 40 minutes because of a Stefan Ortega own goal.\nForget that.\nTo anyone lucky enough to be there to witness it - a tie Man City recovered to win 2-1 - Leyton Orient scored thanks to a wonder strike from Jamie Donley.\nIt was the Tottenham loanee who seized on the loose ball after City midfielder Nico Gonzalez had the ball taken off him just inside the visitors' half. It was Donley who spotted Ortega off his line and executed a quite brilliant 50-yard chip that sailed over the City goalkeeper.\nYes, the ball struck the bar and only crossed the line because it hit Ortega as the German failed to regain his balance after trying to make the initial save. It was Donley's goal.\n\"It is a shame it has gone down as an own goal,\" said Leyton Orient boss Richie Wellens. \"It is not deserved and I am sure Ortega doesn't want it. It is one thing seeing it, it is another executing.\"\nDespite the result, the goal belongs in FA Cup folklore.\nA series of experienced former top-level professionals certainly spoke about the effort as if Donley has scored it.\n\"It's an absolutely remarkable goal,\" said ex-Arsenal defender Martin Keown on Match of the Day. \"It's the strike of a lifetime. To even think about shooting from there - wow.\"\n\"What a spot,\" enthused Chris Sutton on BBC Radio 5 Live. \"What a story. It's absolutely sensational.\n\"It will go down as an own goal but it is one of the greatest FA Cup goals.\"\nBut what did it feel like to actually do it?\n\"I know I hit the goal well,\" said Donley. \"I knew it fell for me nicely.\n\"I saw him off his line and luckily it went in. It would have been a lot nicer if we won but it was a good moment.\"\nDonley had previously scored five goals this season. In status or artistic impression, none can compare to this one.\nEven City boss Pep Guardiola, while seething at what he believed was a clear foul on his £50m debutant Gonzalez - whose status as the replacement for injured Ballon d'Or winner Rodri makes him such a key figure, and who, as a result of the perceived infringement, now has his participation in Tuesday's Champions League play-off first-leg in doubt, was full of admiration.\n\"What a goal,\" he said. \"What a fantastic shot - the quality, the technique, the speed, the flight of the ball.\n\"When you concede this goal, you just congratulate Donley. He's an incredible left-footed player and he made a fantastic goal.\"\nGuardiola seemed to enjoy his day in east London.\nThe former Barcelona and Bayern Munich boss has not lost to a lower-league team since City were beaten by Wigan at the DW Stadium in 2018.\nYet he spoke enthusiastically afterwards about difficult FA Cup days in the past he had encountered at places like Newport and Cheltenham.\nThe City boss was even able to make light of the taunting he received from the home fans as his side tried to come to terms with being a goal behind.\n\"The atmosphere was fantastic,\" he said. \"Even when they say 'you're getting sacked in the morning'.\n\"It's routine in all the stadiums right now. With this result, I think my chairman is not going to sack me but it [the atmosphere] was really good.\"", "url": "https://www.bbc.com/sport/football/articles/crlkw03p7g8o"}