{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:12:54", "date_modify": "2025-05-20 12:12:54", "date_publish": "2023-08-04 18:10:29", "description": "Tottenham: Gary Lineker 'concerned for Spurs' this season", "filename": "sport_articles_ce5rpvg5v8xo_1747743174.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c9da/live/ad3004a0-32ec-11ee-9217-27b202a39e56.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_ce5rpvg5v8xo_1747743174.html", "title": "Tottenham: Gary Lineker 'concerned for Spurs' this season", "title_page": "Tottenham: Gary Lineker 'concerned for Spurs' this season - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Gary Lineker is \"concerned\" for Tottenham \"whatever happens\" with Harry Kane during the transfer window.\nKane has been heavily linked with a move away from the north London club, with Bundesliga champions Bayern Munich understood to be his preferred choice if a deal could be made.\nThe England captain - who is out of contract at the end of this season - was Spurs' top scorer during the last campaign, but his 30 league goals were still not enough to prevent the side finishing eighth - their lowest position in the league since 2008-09.\nSpeaking to PA news agency, former Spurs and England forward Lineker said: \"I'm concerned for Spurs either way, whatever happens with Harry.\n\"I have been concerned about them for a while, I see where they ended last season and they are in the worst position they had been in for quite some time.\n\"They have made an exceptional signing in James Maddison, he is a better player than a lot of people think, I think he is absolutely top class.\n\"That is a good addition but they are a long, long way short. The new manager could make a difference, but Harry, the goals he scores, take that away from any team it would be hugely difficult. It is time to rebuild for Tottenham - rebuild, rethink, re-plan.\"", "url": "https://www.bbc.com/sport/articles/ce5rpvg5v8xo"}