{"authors": ["Ethan Hampton", "www.facebook.com"], "date_download": "2025-04-26 07:52:57", "date_modify": "2025-04-26 07:52:57", "date_publish": "2025-02-25 14:28:38", "description": "Dundee fan voice: 'Next two games could define our season'", "filename": "sport_articles_cd92q2jgdddo_1745653977.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5082/live/88b13e70-f382-11ef-9e61-71ee71f26eb1.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cd92q2jgdddo_1745653977.html", "title": "'Next two games could define our season'", "title_page": "Dundee fan voice: 'Next two games could define our season' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Dundee's slide continues. A fourth consecutive league defeat - this time at Ross County - leaves the Dark Blues second bottom of the Premiership.\nThe next two games could define Dundee's season. A trip to Motherwell on Wednesday will determine whether we remain within reach of the mid-table teams or if a daylight gap emerges.\nRemarkably, Dundee were 10 points ahead of St Johnstone in January. By Saturday, we could replace them in bottom spot.\nWith Motherwell and St Johnstone being the teams directly above and below Dundee it adds heavier emphasis to the matches for a team that will be feeling the pressure.\nThis could very well be the biggest week of Tony Docherty's managerial career to date. Failure to pick up points could throw the manager and club into a very alarming situation.\nOn the other hand, a turnaround now would be perfect timing given the Scottish Cup quarter-final and Dundee derby at Tannadice on the horizon.\nFootball is a funny game - just now feels very doom and gloom but we could quickly be on cloud nine. It is up to to the players to prove they have the character to match their ambitions and rise up from their current wreckage of form.\nAmid this chaos, I find myself reminiscing about how strong the team looked at the start of the season. I stated that if Dundee sold Luke McCowan for anything less than a club record fee, it would be a disaster. I argued that, to compete for Europe and make cup runs, keeping him was essential and his influence outweighed any short-term financial gain.\nWas losing a captain in a team short of leaders, a matchwinner in a side lacking a talisman, and the heartbeat of the squad, worth just £1m?\nDundee have a history of underselling their best assets. And in every scenario I can think of it never ends with us competing where we want to be.", "url": "https://www.bbc.co.uk/sport/articles/cd92q2jgdddo"}