{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:45:16", "date_modify": "2025-05-21 07:45:16", "date_publish": "2025-01-13 14:34:07", "description": "Bristol City head coach Liam Manning says the Robins have \"work to do\" after their FA Cup defeat by Wolves on Saturday.", "filename": "sport_football_articles_cz6pjj877l0o_1747813516.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8590/live/a7879510-d1ae-11ef-bbe0-eb255759a6ac.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cz6pjj877l0o_1747813516.html", "title": "Liam Manning: Bristol City boss says there is \"work to do\" after Wolves defeat", "title_page": "Liam Manning: Bristol City boss says there is \"work to do\" after Wolves defeat - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Bristol City head coach Liam Manning says the Robins have \"work to do\" after their FA Cup third round defeat by Wolves on Saturday, but that the loss provided a \"great lesson\" for his squad.\n\"Conceding the goals early on made it quite a challenge. I thought that in terms of intent, the press was there, but naturally when you're playing against good players and you're half a yard off or you arrive a little bit late, you get opened up - that happened a couple of times,\" Manning told BBC Radio Bristol.\nOn Scott Twine's long-range free-kick that gave City a fighting chance heading into the interval, he continued: \"It's not the first time we've seen it.\n\"[Twine] is in a good spot, he needs to make sure he takes that into the league now and we bounce into Coventry, and that we all take the lessons from today.\n\"It's quite clear we've got a load of work to do, we're under no illusions. Even when you're performing well and winning games it's a constant process.\n\"You have to get better, you have to turn up and I think today's a good lesson in terms of being a little bit too respectful early on. Second half we showed a bit more belief, a bit more of our identity.\"\nThe Robins were inches from a late equaliser when another Twine free-kick pinged off the head of Wolves goalscorer Rayan Ait-Nouri and struck the underside of his own crossbar.\nPraising his side's fight, Manning said: \"The second half I thought we didn't give up a huge amount and kind of took control of the game and the ball without really creating a lot.\n\"We've got levels we can go to as a group and when you step on the pitch you need a healthy arrogance, or whatever you want to call it, that belief has to be there and I definitely thought we showed more of that in the second half.\n\"We've got a young group, lads at varying stages of their careers with different experiences. We have to take the lessons like we do every single week. We reflect and review every game, then roll it into next week.\"\nManning also confirmed that Robins midfielder Marcus McGuane had taken a \"knock to the head\" and would need to be assessed after being withdrawn midway through the second half.", "url": "https://www.bbc.com/sport/football/articles/cz6pjj877l0o"}