{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:16:16", "date_modify": "2025-05-21 04:16:16", "date_publish": "2025-04-05 18:17:27", "description": "Essex declare on 582-6 before Surrey close day two on 109-1 as bowlers toil at Chelmsford.", "filename": "sport_cricket_articles_cj9e0m09jz1o_1747800976.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7049/live/dc261f00-1243-11f0-9d46-3377f28968f3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cj9e0m09jz1o_1747800976.html", "title": "County Championship: Batters continue to dominate between Essex and Surrey", "title_page": "County Championship: Batters continue to dominate between Essex and Surrey - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Rory Burns and Ollie Pope retreated into survival mode as Surrey chased an initial target of 433 to make Essex bat again after a chastening day for the reigning champions in the County Championship at Chelmsford.\nSurrey were still 473 runs adrift of Essex's formidable first-innings total in the 42 overs they faced under lengthening shadows at the end of another warm day. Burns clocked up his 75th first-class fifty in anchoring the Surrey reply after losing opening partner Dom Sibley in the fourth over.\nAt the close the second-wicket pair had put on 101 with Burns 59 not out and Pope unbeaten on 45 in Surrey's 109-1.\nEssex's 582-6 included three centuries – not forgetting Paul Walter's 95 – as Matt Critchley and Michael Pepper emulated first-day centurion Jordan Cox. Critchley was left 145 not out, six runs short of his highest first-class score, while Pepper's 109 came off 162 balls during a fifth-wicket stand of 216.\nDan Lawrence was chief toiler as Surrey were kept in the field for 148 overs but had the comfort of taking 3-169 from a marathon 35.2 overs – nearly as many as he bowled in any entire season during eight years at Chelmsford before moving to the Oval.\nWhen Surrey responded, Sibley lasted just eight balls before he was trapped plumb on his crease by Sam Cook. It was only the third wicket to fall in the day, and seventh in two days.\nIt might have been worse for the visitors, but Critchley spoilt an otherwise perfect day on a personal level when had put down a simple chance at short midwicket when Ollie Pope was 10.\nInstead, it got considerably better. Pope whipped Shane Snater through the covers for one four and clubbed Jamie Porter through midwicket for another. Rory Burns, at the other end, got an inadvertent edge to one from Snater that flew over the boundary at third man.\nBy mid-evening session, Essex had spin at both ends as Critchley joined Simon Harmer in tying down the Surrey second-wicket pair to a trickle of runs. Burns, though, was sufficiently expansive to reach fifty from 114 balls with seven fours.\nEssex had barely been troubled throughout four-and-a-half sessions on a batsman-friendly wicket. Critchley and Pepper had come together during the previous evening after the dismissal of Cox. When they were parted 56 overs later, they had ground the champions, metaphorically at least, into the turf.\nThe pair took an equal share in the fifth-wicket partnership, mixing watchfulness with tempered aggression, as they steered Essex to four batting points and well beyond.\nHowever, when he had reached 92, Critchley survived a chance when Ryan Patel could only parry the ball above his head at square leg off Lawrence. Surrey were made to pay for that soon after when Critchley hooked Matt Fisher for the single that took him to a 208-ball hundred.\nPerversely, Critchley's 14th of 17 fours, lifted over square leg from a widish delivery, took Lawrence's bowling analysis into three-figures. To compound that, Critchley then swept Lawrence over midwicket for the first six of the game.\nPepper turned Taylor leg-side for the two runs that not only took him to his century but also brought up the 200-run stand. He celebrated by launching Lawrence straight back down the ground for six, but next ball cross-batted to wide mid-on to provide his former Essex team-mate with some long-overdue consolation.\nLawrence claimed a third wicket when Noah Thain, having hit a run-a-ball 26, picked out Roach on the long-on boundary at which point the signal came from the dressing room to call a halt to Surrey's misery.", "url": "https://www.bbc.com/sport/cricket/articles/cj9e0m09jz1o"}