{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:10:14", "date_modify": "2025-05-21 04:10:14", "date_publish": "2024-12-29 00:00:00", "description": "A Nathan Lowe late show saw Walsall extend their winning run to six matches with victory over Newport County.", "filename": "sport_football_live_c745wdyedxqt_1747800614.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c745wdyedxqt_1747800614.html", "title": "Nathan Lowe fires leaders Walsall to a 2-0 victory over Newport", "title_page": "Nathan Lowe fires leaders Walsall to a 2-0 victory over Newport - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A Nathan Lowe late show saw Walsall extend their winning run to six matches with a 2-0 victory over Newport County.\nCounty had dominated possession against the League Two leaders and looked worthy of a draw before Lowe found the bottom corner of the net in the 72nd minute.\nThe lead could have been doubled a few minutes later, but Nick Townsend produced a fine save to keep out Ryan Stirk's half volley from the edge of the area.\nLowe then struck again in injury time, thundering home another Taylor Allen cross from 18 yards out for his 12th goal of the campaign.\nWalsall are now 12 points clear at the top of the table before facing second placed Notts County on 1 January.\nNewport are 18th and will be looking to pick up a first festive win when they host Wimbledon at Rodney Parade on 2 January.\nWalsall head coach Mat Sadler:\n\"It was a really tough game, they're a good team and I like how they play.\n\"The whole group, we all recognised we needed to be a little bit more aggressive, we wanted to get more pressure on their full-backs.\n\"It felt like us in the second half. I'm delighted for Lowey [Nathan Lowe], he worked tirelessly, as did so many of the others.\"\nNewport County head coach Nelson Jardim:\n\"It's a disappointing result but I think in terms of performance, we were the better team, I've got no doubt about that.\n\"We were unlucky not to get at least a point from this game. When you play the top of the table and the only thing they have to offer is set plays and long balls, it sums everything up.\n\"We should be proud of the way we came away and played the way we did here. I'm sure that our goals will come.\"", "url": "https://www.bbc.com/sport/football/live/c745wdyedxqt"}