{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:11:44", "date_modify": "2025-05-20 13:11:44", "date_publish": "2023-08-01 08:16:29", "description": "Somerset all-rounder Kasey Aldridge signs a contract extension to keep him at Taunton until the end of 2025.", "filename": "sport_cricket_66370073_1747746704.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8476/production/_130601933_kaseyaldridgerex2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66370073_1747746704.html", "title": "Kasey Aldridge: Somerset all-rounder signs two-year contract extension", "title_page": "Kasey Aldridge: Somerset all-rounder signs two-year contract extension - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Somerset all-rounder Kasey Aldridge has signed a two-year contract extension.\nThe 22-year-old, who came up through the club's academy, made his first-class debut in July 2021 and hit his maiden County Championship century at Lancashire earlier this year.\nHe has also been a part of the club's limited-overs sides and helped Somerset reach this year's T20 Blast final.\nThe former England Under-19 player has 39 wickets in 17 first-class matches and 19 wickets in 50-over games.\n\"In the next few years, we want to achieve more of what we did at Edgbaston,\" Aldridge said.\n\"We all want to win more trophies, especially that big one. To win the County Championship is a massive aspiration for me and the rest of the boys in the squad as well.\"\nSomerset director of cricket Andy Hurry added: \"In the last few years we have seen Kasey's high potential really evolve.\n\"In a short space of time, he has become an integral member of the first XI squad across all three formats of the game.\n\"Last year he was pivotal in the One-Day Cup and broke into the County Championship team.\n\"This season we have seen Kasey make important contributions for our Vitality Blast winning team and play an influential role in our County Championship side.\n\"He is a player with a very high ceiling who has the ability to change the course of a game with the ball, the bat and in the field.\"", "url": "https://www.bbc.com/sport/cricket/66370073"}