{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:28:23", "date_modify": "2025-05-19 15:28:23", "date_publish": "2017-08-21 10:54:04", "description": "Birmingham City sign Arsenal's Carl Jenkinson and Cohen Bramall plus Southampton's Sam Gallagher on loan for the season.", "filename": "sport_football_41000686_1747668503.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/EC0A/production/_97462406_gettyimages-464865793.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_41000686_1747668503.html", "title": "Birmingham loan Arsenal's Carl Jenkinson and Cohen Bramall plus Southampton's Sam Gallagher", "title_page": "Birmingham loan Arsenal's Carl Jenkinson and Cohen Bramall plus Southampton's Sam Gallagher - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Birmingham City have signed Arsenal's Carl Jenkinson and Cohen Bramall, plus Southampton's Sam Gallagher on loan until the end of the season.\nRight-back Jenkinson, 25, made just five appearances for Arsenal last season after spending the previous two campaigns on loan with West Ham.\nLeft-back Bramall, 21, moves after joining the Gunners from non-league side Hednesford Town in January.\nSaints striker Gallagher, also 21, has two goals in 20 Saints games.\nThe trio could make their debuts in Tuesday's EFL Cup second round tie against Bournemouth at St Andrew's.\nJenkinson departs on his third loan spell in four seasons, having made 62 appearances for Arsenal since arriving from Charlton in 2011.\nBramall is yet to play for Arsenal's first team after his move from Hednesford, but was a part of the club's pre-season tour of Australia and China.\nGallagher has experience of the Championship following spells with MK Dons in 2015-16 and then last season on loan to Blackburn Rovers where he netted 12 goals in 47 appearances.\nThey join David Stockdale, Marc Roberts, Cheikh Ndoye and Isaac Vassell in making the move to St Andrew's over the summer.", "url": "https://www.bbc.com/sport/football/41000686"}