{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:17:56", "date_modify": "2025-05-21 05:17:56", "date_publish": "2025-04-03 16:23:39", "description": "Reading owner Dai Yongge is given an extension to his deadline where he must divest his interests in the club.", "filename": "sport_football_articles_cly12lv11y0o_1747804676.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/86fd/live/193db200-10a4-11f0-9af0-9909a653fc84.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cly12lv11y0o_1747804676.html", "title": "Reading FC: Dai Yongge given new deadline of 22 April to sell club", "title_page": "Reading FC: Dai Yongge given new deadline of 22 April to sell club - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Reading owner Dai Yongge has been given more time to sell the club by the English Football League.\nThe EFL previously said that he must complete a sale or move on from the Royals this week, but this has now been extended to 22 April.\nLast month the EFL also announced that Yongge had been officially disqualified under the EFL's Owners' and Directors' Test, believed to be for \"unsatisfied judgements in China\".\n\"As stated previously, the League's priority is to progress a sale of the club at the earliest opportunity, in order to end the current uncertainty surrounding its future for its staff, supporters and wider community,\" an EFL statement said.\n\"While Mr Yongge is yet to divest his interests, as is required following his disqualification, discussions for him to do so remain active and ongoing.\"\nIf Yongge does not fulfil the EFL's request by the deadline then they can suspend the Royals from playing matches.\nReading are seventh in League One, one point outside the play-offs, with seven games remaining.\nThe club previously said that they had the full intention of avoiding any potential suspension and Yongge was \"committed\" to reaching a conclusion.\n\"The League has the power to suspend a club if a director fails to comply with the requirements of their disqualification,\" the EFL statement added.\n\"The terms of any suspension would be at the discretion of the board, and while suspended clubs are not permitted to fulfil league matches, they would continue to be a member of the league at that point.\"", "url": "https://www.bbc.com/sport/football/articles/cly12lv11y0o"}