{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:28:57", "date_modify": "2025-05-21 07:28:57", "date_publish": "2025-05-20 17:03:23", "description": "Interim boss Matt Sherratt is hoping a Test win in Japan in July will ensure the new permanent head coach is not saddled by Wales' record losing streak.", "filename": "sport_rugby-union_articles_c7v7d2g57n2o_1747812537.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/dd62/live/a9ea26b0-3586-11f0-9b2c-138cad92aeb3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c7v7d2g57n2o_1747812537.html", "title": "Matt Sherratt: Wales caretaker coach aims to lift losing burden in Japan", "title_page": "Matt Sherratt:  Wales caretaker coach aims to lift losing burden in Japan  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Interim boss Matt Sherratt is hoping a Test win in Japan in July will ensure Wales' new permanent head coach is not saddled by the squad's record losing streak.\nWales ended their Six Nations campaign in March with a record 68-14 home loss to England that represented a 17th successive Test defeat.\nSherratt will again fill the caretaker role he adopted during the Six Nations and lead Wales against Japan in Kitakyushu on 5 July and Kobe seven days later.\nHe will return to Cardiff and make way for the new appointment, but says victory and not development is what matters against Eddie Jones' Japan.\n\"The development angle should be left to the next guy coming in,\" said Sherratt.\n\"Probably a big part of doing it when I was asked a couple of weeks ago, was laying a foundation for the next guy coming in.\n\"I don't think it's our job as coaches to look at the big picture. We'll be in camp for six or seven weeks and it's a short tour.\n\"With the world rankings and Japan being one place behind, it's about going there and trying to get a result.\"\nThe last time Wales tasted victory was against Georgia in October 2023, and that losing run has seen the team slip to a record low of 12th in the world rankings.\nNew Welsh Rugby Union (WRU) director of rugby Dave Reddin is leading the search for a new permanent head coach to replace Warren Gatland, who resigned in February.\n\"I would love for the next guy to look at the team, think there's something to build on and not have that losing record around their neck,\" Sherratt added.\n\"Speaking to the players, there's a real desire to go to Japan and prove a point. We'll do our best to go there and hopefully take that losing record away as well.\"\nPlayers will start preparing for Wales' tour next week amid the backdrop of the latest crisis to hit Welsh rugby between the WRU and its professional sides, with Ospreys and Scarlets in a dispute with the governing body about unequal funding proposals.\nThe WRU made the announcement it was reverting to a two-tier funding model amid reports it intends to cut a professional team, although it has neither confirmed nor denied if reducing the amount of sides from four to three is part of its plans.\nSherratt says this recent turmoil had not deterred him from again accepting the caretaker role after he had taken charge for the final three games of the Six Nations.\n\"I've been in this job long enough, I just concentrate on the rugby,\" said Sherratt. \"I love coaching, that's my motivation.\n\"I'll let other people who are way above my pay grade worry about the future of the regions and the national game.\n\"It's probably bigger news outside of an environment than it is inside. I'm sure in the background, after the tour, that may be an issue.\n\"As soon as you come into an international camp, you are a bit cocooned. The players are busy focusing on playing and training, so all the big-picture stuff seems to go away.\"\nThere is more harmony between the coaches with Sherratt saying he sought advice from the other regional Wales bosses when selecting the squad, even sounding out some to join his backroom team.\n\"I thought it was important I spoke to the WRU about having some other regional coaches involved, but unfortunately they were not all able to do it for various reasons,\" said Sherratt.\n\"They've been involved, not directly, with selection and been more than helpful to me.\"\nThe 33-man squad Sherratt came up with includes Ospreys hooker Dewi Lake as captain with Jac Morgan away with the British and Irish Lions.\nThere are six uncapped players in Keelan Giles, Macs Page, Reuben Morgan-Williams, Liam Belcher, Chris Coleman and Garyn Phillips.\nExeter captain Dafydd Jenkins will undergo surgery and misses out, along with Scarlets prop Henry Thomas, who the WRU says will seek specialist opinion on a long-term condition, while Gloucester centre Max Llewellyn is also injured.\nLocks Adam Beard and Will Rowlands have been rested, while notable absentees from the squad includes Gloucester fly-half Gareth Anscombe, Saracens centre Nick Tompkins, Scarlets wing Ellis Mee and Cardiff flanker James Botham with uncapped Ospreys number eight also missing out.\nFly-half Sam Costelow, prop Archie Griffin and lock Ben Carter return after missing the Six Nations through injury.\nSherratt will have a new team of assistant coaches alongside him in Harlequins head coach Danny Wilson and the Premiership club's scrum specialist Adam Jones, in addition to Gloucester's Rhys Thomas and former Wales prop Gethin Jenkins.\nJones and Thomas worked alongside Sherratt during the Six Nations and - together with interim forwards coach Wilson - are on secondment from their Premiership clubs, while defence coach Jenkins has been released by WRU-owned Cardiff.\n\"There's a big change happening at the moment with the system,\" said Sherratt.\n\"The WRU were clear they wanted to take an interim staff. As soon as they said that, it was important - with the limited time - that we'd worked together before.\n\"It's a familiar staff. Having staff harmony rubs off on the players. It's important I had people I know and trust.\"\nWales will consider adding a kicking coach at a later date, with Leigh Halfpenny linked with a role that Neil Jenkins has filled for almost 20 years.\nJonathan Humphreys and Mike Forshaw, who were part of Gatland's coaching staff throughout his second spell in charge, will not be involved this summer, while Rob Howley and Alex King are also again missing.\nNo detail have been provided about their futures, with Sherratt saying their fate will be decided by others.\n\"That's for the next coach to make that decision, as well as the top of the WRU,\" Sherratt added.\n\"That wasn't something I was comfortable with getting involved in.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/c7v7d2g57n2o"}