{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:03:54", "date_modify": "2025-05-20 14:03:54", "date_publish": "2023-07-24 16:15:50", "description": "'Horribly dressed' Vassell to set high standards as captain", "filename": "sport_articles_c87mym75mjjo_1747749834.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f8ae/live/48f45d90-2a3d-11ee-b1d7-8fdc93c2782e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c87mym75mjjo_1747749834.html", "title": "'Horribly dressed' Vassell to set high standards as captain", "title_page": "'Horribly dressed' Vassell to set high standards as captain - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Killie fans - and perhaps Derek McInnes - may owe new captain, Kyle Vassell's girlfriend a little thank you after she gave him a pep talk when a bit of self-doubt crept in.\nThe striker immediately accepted the offer of the captaincy from the manager but soon had some worries. Though they were quickly dispelled in a conversation with his partner, Jasmine.\n“When I got asked to be captain I spoke to my missus and said: ‘Babe, I don’t know if I want to do this because I don’t know what I am going to do and how I am going to be’,\" the 32-year-old, who scored in Killie’s Viaplay Cup win at Dunfermline on Saturday, said.\n“She said: ‘You have obviously been asked to be captain because of who you are, so just be yourself’.\n“I think my job will be a bit more just leading by example and making sure everyone is on top of things. I like to keep standards high personally so that’s something I will try and push on other boys.\n“Other than that, it’s just the same. The boys still hammer me about my dress sense and all that so I will just carry on,\" he joked.\n“I kind of maybe now have to be not as horrible as I was before but Joe (Wright) will always get a piece of my mind because his dress sense is as bad as mine.”", "url": "https://www.bbc.com/sport/articles/c87mym75mjjo"}