{"authors": ["Michael Emons", "www.facebook.com"], "date_download": "2025-05-21 04:10:54", "date_modify": "2025-05-21 04:10:54", "date_publish": "2025-04-06 11:51:51", "description": "Hundreds of Tottenham fans take part in a protest showing their anger at the club's board and owners and calling for chairman Daniel Levy \"to get out of our club\".", "filename": "sport_football_articles_cgkgjn3z40xo_1747800654.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c557/live/95e9bfa0-12da-11f0-b182-81b971f8bd66.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cgkgjn3z40xo_1747800654.html", "title": "Tottenham fans protest against owners Enic and chairman Daniel Levy", "title_page": "Tottenham fans protest against owners Enic and chairman Daniel Levy - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Hundreds of Tottenham fans took part in a protest showing their anger at the club's board and owners on Sunday, and calling for chairman Daniel Levy \"to get out of our club\".\nThe demonstration happened before Spurs' Premier League match at home to Southampton, with Ange Postecoglou's side 16th in the table after a disappointing campaign.\nThe protest was organised by the Change For Tottenham group, with fans able to buy flags and scarves, profits from the sales of which will be donated to The Tottenham Food Bank and Noah's Children's Hospice.\n\"Time for change,\" was the message on the flags, while some scarves said 'Enough is enough, Enic Out!\".\nThe Enic Group, a British investment company, took over Tottenham in 2001.\n\"Built a business, killed a football club,\" was written on another flag.\nThe fans' chants included \"We want Levy out,\" and \"Daniel Levy, get out of our club.\" A third chant included the lines: \"I don't care about Levy, he don't care about me, all I care about is [Dejan] Kulusevski.\"\nThe new stadium has hosted a number of NFL and rugby matches, as well as concerts, and fans believe Levy's priority is hosting major events instead of building a successful football team.\n\"Can Beyonce play in defence?\" was one chant from the supporters, while another was \"Guns 'n' Roses, stick them up front.\"\n\"Many lifelong Tottenham supporters feel alienated by the club's ownership and direction,\" said Change For Tottenham.\nThe fan-led group says its frustration is \"primarily aimed\" at owners Enic and Levy \"whose tenure has been marked by financial growth but, in the eyes of many, sporting decline\".\nChange For Tottenham added: \"The New Tottenham Hotspur Stadium is a state of the art facility, but at what cost? Ticket prices are among the highest in the Premier League, forcing many fans, some of whom have supported Spurs for decades, to give up their season tickets or attend fewer games.\n\"For years the team has lacked investment in key areas, particularly in defence, while transfer windows have felt reactive instead of proactive. The result? Another trophy-less season looms, extending a drought that has lasted since 2008.\"\nLast week Levy called for the club's spending in the transfer market to be \"sustainable\" and \"smart\" after their latest financial results showed a fall in revenue.\nHe acknowledged in notes accompanying the results that he \"often read calls to spend more\" as Spurs are \"ranked as the ninth richest club in the world\".\n\"We cannot spend what we do not have, and we will not compromise the financial stability of this club,\" Levy said.\n\"Recruitment remains a key focus, and we must ensure that we make smart purchases within our financial means. Our capacity to generate recurring revenues determines our spending power.\"", "url": "https://www.bbc.com/sport/football/articles/cgkgjn3z40xo"}