{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:34:54", "date_modify": "2025-05-21 04:34:54", "date_publish": "2025-04-04 18:24:14", "description": "Yorkshire are bowled out for 121 on the opening day against Hampshire at Southampton, but reduce the home side to 164-5 at the close.", "filename": "sport_cricket_articles_cn8rd21ljg1o_1747802094.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/dbee/live/a9904140-1173-11f0-b594-f7ec3c1d2e0a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cn8rd21ljg1o_1747802094.html", "title": "Yorkshire fight back against Hampshire", "title_page": "County Championship: Yorkshire fight back against Hampshire - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Kyle Abbott and Liam Dawson made sure Jonny Bairstow had a rollercoaster of a start as Yorkshire captain as Hampshire edged the opening day of their County Championship fixture.\nThe Bairstow era started strongly after winning the toss, but quickly fell apart as Yorkshire crumpled to 121 all out, with the last five wickets collapsing in four overs.\nAbbott and Dawson both shared three wickets apiece, while Brad Wheal and debutants Brett Hampton and Sonny Baker also picked up one each.\nBut late wickets in the day - including two each for Jack White and George Hill - left Hampshire five down at close with a 43-run first innings lead.\nEngland wicketkeeper Bairstow took the reins of promoted Yorkshire on the eve of the season after the role had been shared by Jonny Tattersall and Shan Masood in 2024.\nHis leadership experience is slim – with just three professional matches, all of which being white-ball, on his CV – but he is following in the footsteps of his late father David, who captained Yorkshire between 1984 and 1986.\nBairstow's first decision was to call heads, and when that succeeded, his second was to choose to bat – the obvious choice on a dry pitch with uncharacteristic April heat in the air.\nSouth African Abbott got the wickets flowing when he pinned Adam Lyth lbw, before New Zealander Hampton found Fin Bean slashing to point with his fifth delivery since becoming a late replacement for the injured Jack Edwards.\nJames Wharton was undone by some nip off the pitch from Brad Wheal to edge to third slip, before Bairstow arrived at the crease.\nAfter 20 largely uneventful balls, exciting fast bowler Baker's introduction – his first in the Championship brought drama.\nBairstow swatted a wide first delivery of the over to the fence, before his concentration was disturbed by an insect.\nBaker's follow-up was equally wide but this time Bairstow sliced to deep third man.\nDawid Malan had been the most lucid Yorkshire batter – striking six boundaries in his 31 – but ran himself out by taking on Mark Stoneman's arm from extra cover.\nThe visitors made it to 106-5 at lunch, but after that they disintegrated. Abbott was relentless, while Dawson continued from his impressive 54-wicket 2024 campaign.\nBen Cliff was the last man out – lbw trying to reverse sweep Dawson – with the last five wickets disappearing in 27 post-lunch deliveries.\nHampshire's response was solid as Stoneman and Fletcha Middleton produced a 70-run opening stand.\nFormer Middlesex left-hander Stoneman hit two legside sixes, summing up his approach to poor deliveries, but he was bowled by a George Hill inswinger before Nick Gubbins edged to first slip, White's first Yorkshire scalp.\nThe White Rose then had their best spell of the day, with Ben Coad in particular, stemming Hampshire's runs – typified by new batter Toby Albert taking 23 balls to get off the mark.\nMiddleton eventually fell to a bat-pad chance, with Bairstow leaping around the batter to make the catch in a short leg position.\nTom Prest made a brisk 32 before Hill set his off-stump tumbling and nightwatcher Brad Wheal was lbw as Hampshire reached the end of the day on 164-5.", "url": "https://www.bbc.com/sport/cricket/articles/cn8rd21ljg1o"}