{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:52:09", "date_modify": "2025-05-21 06:52:09", "date_publish": "2025-03-29 20:21:17", "description": "Dungannon Swifts manager Rodney McAree says reaching his first Irish Cup final as a manager of his hometown club was an emotional experience.", "filename": "sport_articles_c20x767zxwno_1747810329.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f09b/live/d91262b0-0cda-11f0-a6b8-f91f29ac3e55.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c20x767zxwno_1747810329.html", "title": "Irish Cup: 'There were a few tears in the dugout'", "title_page": "Irish Cup: 'There were a few tears in the dugout' - Swifts boss McAree - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Dungannon Swifts manager Rodney McAree says there were \"a few tears in the dugout\" in the closing minutes of his side's 2-0 Irish Cup semi-final win over Bangor as the realisation that the county Tyrone side were about to book a place in the decider against Cliftonville sunk in.\nKyle Owens' first-half own goal and Dean Curry's header in the second period ensured Dungannon's passage to the May 3 showpiece at Windsor Park.\nIt will be the Stangmore Park club's second appearance in an Irish Cup final - McAree was part of the team which went down to Linfield on penalties in the 2007 final.\n\"It's something I've dreamt of all my life. Obviously I'm a Dungannon Swifts lad, it's my club,\" McAree told BBC Radio Ulster's Sportsound programme.\n\"I always had an ambition that I wanted to play in an Irish Cup final with Dungannon Swifts and as soon as I started doing my coaching badges I knew that I wanted to be a manager or a head coach in an Irish Cup final and to be the head coach at Dungannon Swifts and go to an Irish Cup final on 3 May is something special, something that we'll look forward to and something that I'll take great pride in.\"\nA swirling breeze made for difficult conditions at Seaview on Saturday.\n\"Conditions today were extremely difficult. I thought we controlled the game in the first half, in the second we knew that the long ball from Bangor was always going to put us under pressure with the conditions as they were.\n\"It was just reward for Dean to score the second goal, the goal that sealed our place in the final, it's truly fantastic.\"\nSwifts are now looking ahead to locking horns with the Reds, who are aiming to retain the trophy they won for the first time in 45 years last season.\n\"Anyone involved with the Irish League wants to be in an Irish Cup final. We have a great game to look forward to,\" added McAree.\n\"Cliftonville, we know what sort of backing they come with. There'll be a good crowd at Windsor Park.\n\"It's a game only two clubs in the country will be involved in and we're one of them. That's truly amazing. We'll go there and try to give a good account of ourselves and try to win it.\"", "url": "https://www.bbc.com/sport/articles/c20x767zxwno"}