{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:09:44", "date_modify": "2025-05-21 07:09:44", "date_publish": "2025-03-30 11:10:29", "description": "'A shaky start, but once we got going we won at a canter'", "filename": "sport_articles_cdxn60kx4kdo_1747811384.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0298/live/85ac9000-0d57-11f0-b234-07dc7691c360.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cdxn60kx4kdo_1747811384.html", "title": "'A shaky start, but once we got going we won at a canter'", "title_page": "'A shaky start, but once we got going we won at a canter' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Celtic fans, we asked for your views on the routine 3-0 win over Hearts. Here's a taste of what you had to say...\nScott: Kyogo who? Daizen Maeda doing what he does best, just a shame he spent nearly three years on the left. Decent showing too from the boy Viljami Sinisalo. Not the most taxing game but never looked flustered and can play with his feet. Eight more games like this would do nicely.\nRoddy: A shaky start, but once we got going we won at a canter. Sinisalo in goal and Maik Nawrocki in defence should be playing every game to finish the season now to give them confidence going into next season.\nPaul: Slow start by Celtic, but they raised their performance levels and deserved their three-goal lead at half time. Conditions were tough and had an impact on close ball control but fair play to Celtic, they stuck with their processes and earned a very valuable three points.\nShaun: I was frustrated with the passing around the defence again, but once we got going we had three great goals. I was very impressed with Sinisalo and to see him comfortable at corners and not panicking like Kasper Schmeichel was good, I want him to continue in goal as Kasper is past it.", "url": "https://www.bbc.com/sport/articles/cdxn60kx4kdo"}