{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:12:09", "date_modify": "2025-04-26 04:12:09", "date_publish": "2025-03-04 12:34:29", "description": "Liverpool news: Fan views on one thing nobody is talking about", "filename": "sport_football_articles_cly424j5320o_1745640729.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cly424j5320o_1745640729.html", "title": "Liverpool news: Fan views on one thing nobody is talking about", "title_page": "Liverpool news: Fan views on one thing nobody is talking about - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "We asked for your views on one thing nobody is talking about at Liverpool but really should be.\nHere are some of your comments:\nRoger: What does the future hold for Harvey Elliott? He is still very young but seems to have been around for years. Our midfield options appear much stronger now with the revelation of Gravenberch, Jones getting more games, and Chiesa's arrival. And we still have the likes of Bajcetic (currently on loan) to come back. Elliott needs a move if he wants to be an automatic pick I feel, although he would be a big miss if he left.\nAlan: Ticketing for home games is becoming more difficult for local/UK supporters and while many understand the need for 'new' money the traditional fans are what make Anfield the fortress it is.\nDavid: One thing not being talked about - Ben Doak. Already a Scotland international, currently on loan at Middlesbrough and doing very well. Also plays in the Salah position. Odd that he never gets mentioned in the context of the tediously endless discussion of Mo's contract.\nPat: Nobody's speaking about the goalkeeper drama that is going to make or break next season. Mamardashvili, Alisson, Kelleher - we don't need all three. Presumably none of them want to be a number two. Personally I'd cash in on injury-prone Allison, as good as he is, and let the two younger men fight for the jersey. But, whatever the club decides, having three world class goalies is probably a recipe for disaster.\nJoe: Virgil van Dijk. I don't notice any significant difference in his performances this season compared to the 2018-19 season where many campaigned that he should have won the Ballon D'or, yet I also see very little conversation around how dependable he is. He is surely the most consistently brilliant player on the planet yet I would be surprised to see his name mentioned for the biggest individual prizes at the end of the season.\nRhys: The most under-reported story of this season is the development of Quansah. From the start of the season he has really grown into the squad and is a solid centre-back for his age. If progress continues it won't be long until the young man is pushing for regular first team action.\nJosh: Wataru Endo. The closer. That's it. That's the message.", "url": "https://www.bbc.co.uk/sport/football/articles/cly424j5320o"}