{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:34:04", "date_modify": "2025-05-20 14:34:04", "date_publish": "2023-07-28 17:27:11", "description": "Denmark's Emma Norsgaard holds on to claim victory on stage six of the Tour de France Femmes by metres as Charlotte Kool chased her down.", "filename": "sport_cycling_66342561_1747751644.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/12293/production/_130578347_gettyimages-1407846002.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cycling_66342561_1747751644.html", "title": "Tour de France Femmes: Emma Norsgaard holds off Charlotte Kool to win stage six", "title_page": "Tour de France Femmes: Emma Norsgaard holds off Charlotte Kool to win stage six - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Denmark's Emma Norsgaard held on to claim victory on stage six of the Tour de France Femmes by metres as Charlotte Kool chased her down.\nNorsgaard was part of a three-rider breakaway away with nearly 100km left of the stage from Albi to Blagnac.\nThe chasing peloton, led by Dutchwoman Kool, caught the other two riders but was unable to beat Norsgaard to the line.\nBelgium's Lotte Kopecky came third to stretch her overall lead to 53 seconds.\nNorsgaard, who has missed a large chunk of the season after breaking a collarbone in the Strade Bianche in March, had looked comfortable but had to hang on in the latter stages as Kool and the chasing pack finished just a second behind her.\n\"I want to thank everyone around me for still believing in me after being out the whole spring,\" said an emotional Norsgaard, who turned 24 on Wednesday. \"I'm super emotional. It's the biggest victory ever.\"\nVictory for Norsgaard means a second stage win for Movistar in this year's tour.\n\"I'm not a sprinter any more I have to realise it,\" she added. \"I might be fast, but I cannot keep up with the real sprinters. I took a chance today and reached for the stars.\"\nEarlier, SD Worx team boss Danny Stam was kicked off the tour following his actions after Demi Vollering suffered a puncture on Thursday's stage five.\nThe Dutch rider tucked into the slipstream of the team car, driven by Stam, as she tried to catch up with the peloton.\nThe car was seen weaving between and overtaking other teams' vehicles.\nRace officials said Stam was guilty of \"particularly dangerous overtaking of other cars and riders\" and \"inappropriate comments made to the jury of commissaires\".\nSaturday's penultimate stage seven is 90km from Lannemezan to Tourmalet Bagneres-de-Bigorre.\nFinishing with a climb on the famous Col du Tourmalet, Belgian Kopecky will be hoping to maintain the lead she has held since the opening stage, before the race ends in Pau with Sunday's time trial.", "url": "https://www.bbc.com/sport/cycling/66342561"}