{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:39:07", "date_modify": "2025-04-26 06:39:07", "date_publish": "2025-03-02 16:36:13", "description": "After 12 group-stage matches the Champions Trophy has reached the knockout stages - here is how it works and how you can follow it on the BBC.", "filename": "sport_cricket_articles_cn48q9w0k1go_1745649547.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/64b5/live/755f2920-f780-11ef-9e61-71ee71f26eb1.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_cricket_articles_cn48q9w0k1go_1745649547.html", "title": "Champions Trophy 2025 semi-finals: Schedule, dates, times, venues, rules & how to follow", "title_page": "Champions Trophy 2025 semi-finals: Schedule, dates, times, venues, rules & how to follow - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "After 12 group-stage matches, the Champions Trophy is into the knockout stages.\nIndia and New Zealand progressed from Group A and Australia and South Africa made it through from Group B, with Rohit Sharma's side the first through to the final.\nHere's everything you need to know about the semi-finals and final, including how you can follow on the BBC.\nIndia and New Zealand both won their opening two games in Group A to confirm their progression, while India beat the Kiwis on Sunday to secure top spot.\nSouth Africa topped Group B with five points. They had wins over Afghanistan and England and a washed-out game against Australia.\nThey were joined by Australia who beat England in their opener before washed-out matches against South Africa and Afghanistan.\nIndia are playing all of their games in Dubai after they refused to play in Pakistan because of political tensions between the two countries. That meant they were always going to play in the first semi-final if they qualified.\nThe Champions Trophy final is scheduled for Sunday, 9 March. It will start at 09:00 GMT.\nAfter India beat Australia in the last four, the final will take place in Dubai.\nHad Rohit's side failed to qualify it would have remained in Pakistan and been held at the Gaddafi Stadium in Lahore.\nThere are reserve days for both semi-finals and the final, although the first semi-final went ahead as planned.\nThe second semi-final has a reserve day on Thursday, 6 March (09:00). A rearranged final would take place on Monday, 10 March (09:00).\nThere is a maximum of two hours of additional time available on both the original day and reserve day for both games.\nFor all knockout games a minimum of 25 overs per side is needed to constitute a match. That is up from 20 in the group stages.\nThe International Cricket Council says \"every effort will be made\" to complete the match on the scheduled day, including reducing the overs to the minimum required.\nIf play starts on the scheduled day but a reserve day is then required play will resume from where it stopped, rather than a new match starting.\nWhether it is a 50-over or reduced-over match depends on whether play resumes in a reduced-over format on the original day.\nIf rain means a result is not possible in either semi-final then the side that finished top in the group stage will progress to the final.\nThe trophy will be shared if the final is washed out on both the original and reserve day.\nAs with the group stages, any tie would see a super over played.\nThere will be ball-by-ball commentary on all three matches across BBC Sounds, BBC Radio 5 Sports Extra and the BBC Sport website and app.\nMembers of Test Match Special include Jonathan Agnew, Aatif Nawaz, Vic Marks and Alex Hartley.\nThe BBC Sport website and app will have live text commentary on every match, alongside in-play and post-match video highlights.\nThere will also be regular coverage on the BBC Cricket Instagram, external and WhatsApp, external account.\nThe tournament is available to watch live in the UK on Sky Sports.", "url": "https://www.bbc.co.uk/sport/cricket/articles/cn48q9w0k1go"}