{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:52:14", "date_modify": "2025-05-20 11:52:14", "date_publish": "2023-08-07 08:31:47", "description": "Former world number one Justin Thomas falls one shot short of a place in the season-ending FedEx Cup play-offs.", "filename": "sport_golf_66425963_1747741934.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/086D/production/_130675120_gettyimages-1597110290.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_golf_66425963_1747741934.html", "title": "Justin Thomas: Former world number one misses out on FedEx Cup play-offs by one shot", "title_page": "Justin Thomas: Former world number one misses out on FedEx Cup play-offs by one shot - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Justin Thomas suffered heartbreak on the final hole at the Wyndham Championship to miss out on a FedEx Cup play-off spot by one shot.\nThe 2022 US PGA Championship winner finished in a tie for 12th on eleven-under at Sedgefield Country Club.\nHe was close to picking up a birdie on the 18th when a long range chip bounced off the flagstick.\n\"It would have been a lot more incredible if it would have gone in,\" Thomas said.\nThe 30-year-old had to settle for par on the final hole and was still unsure of his fate in the aftermath as his rivals remained on the course in Greensboro, North Carolina.\nThe American started the week ranked number 79 in the FedEx Cup standings and needed to break into the top 70 to qualify for the play-offs, which begin next week.\nBy finishing tied for 12th, however, the two-time major winner only climbed to 71st and was eight points adrift of 70th Ben Griffin.\nIt's the first time Thomas will miss the play-offs since his rookie season in 2014.\n\"I know this game doesn't owe you anything, but I feel like I fought hard enough to deserve it,\" Thomas said.\n\"I hit some really really good shots when I needed to, hit some great chips when I needed to, hit an unbelievable putt for eagle on 15 and obviously the up-and-down on 17 and 18. I did the best I could.\"\nThomas - who won the FedEx Cup in 2017 - arrived at the Wyndham event after missing five cuts from his last seven starts and has struggled at this season's majors, carding two rounds over 80.\nAfter a disappointing end to the season, Thomas is still hoping he has done enough to earn a place in the USA's Ryder Cup team.\nThe 2023 Ryder Cup runs between 29 September - 1 October at Marco Simone Golf and Country Club in Italy.", "url": "https://www.bbc.com/sport/golf/66425963"}