{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:50:31", "date_modify": "2025-05-20 12:50:31", "date_publish": "2023-08-03 12:18:14", "description": "Belgium midfielder Justine Vanhaevermaet joins Women's Super League side Everton on a two-year contract until the end of June 2025.", "filename": "sport_football_66393961_1747745431.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/15042/production/_130628068_justinevanhaevermaetjuly2023-002.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66393961_1747745431.html", "title": "Justine Vanhaevermaet: Everton sign Belgium midfielder on a two-year contract", "title_page": "Justine Vanhaevermaet: Everton sign Belgium midfielder on a two-year contract - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Belgium midfielder Justine Vanhaevermaet has joined Women's Super League side Everton on a two-year contract until the end of June 2025.\nThe 31-year-old spent two years at Reading before the club was relegated from the WSL last season.\nVanhaevermaet has played 41 times for Belgium since her debut in 2013, scoring six goals.\nShe told EvertonTV she was \"so happy\" to sign for the club and added that the team has been \"progressing well\".\nVanhaevermaet, who has also played club football in her homeland, Norway and Germany, said: \"Everton already play at a good level; I hope I can help continue to improve that level and contribute to more success.\n\"The team play really good football and try to play out from the back, which I really love. As a central midfielder, it's a pleasure to play in that style of system.\"\nVanhaevermaet is Everton manager Brian Sorensen's fourth signing of the summer after striker Martina Piemonte, goalkeeper Emily Ramsey and midfielder Emma Bissell.\nSorensen led the Toffees to a sixth-placed finish in the WSL last season and said he had been impressed by Vanhaevermaet's performances for Reading.\n\"Justine has shown a calm, composed presence during her time playing so far in England,\" he said.\n\"She brings experience from overseas and also in England which will be vital to the younger players in our group.\"", "url": "https://www.bbc.com/sport/football/66393961"}