{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:06:43", "date_modify": "2025-05-20 14:06:43", "date_publish": "2023-07-30 18:06:24", "description": "New defenders imminent as Cormack gives signings update", "filename": "sport_articles_cn3jj52337ko_1747750003.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e9a4/live/91bcf030-2f03-11ee-999b-b74dedc428d3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cn3jj52337ko_1747750003.html", "title": "New defenders imminent as Cormack gives signings update", "title_page": "New defenders imminent as Cormack gives signings update - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Aberdeen chairman Dave Cormack says the club are “very, very close” to signing two defenders and are seeking up to three further new recruits.\nCormack revealed the Dons put “four months of effort” into pursing Croatian midfielder Tonio Teklic, only to miss out when the 23-year-old opted to join Trabzonspor from Varazdin this summer.\nCormack said on Twitter: “We are very, very close on two defenders, and targeting another two to three players, which, given Barry [Robson] is looking for quality that can play in his system, will most likely take us well into the transfer window during August.\n“Yes, we just missed out on Teklic, which was tough after four months of effort. It happens when we you looking for really good quality.\n“Let’s remember that we convinced and invested in transfer fees and wages for [Leighton] Clarkson, [Graeme] Shinnie, [Ester] Sokler etc. and that Dante’s [Polvara] loan spell puts him in real contention for the way that Barry wants to play.\n“Your support and encouragement of Barry and the team is really appreciated. It’s going to be a very competitive league again this year. We will never take European qualification or last season’s third place for granted.”", "url": "https://www.bbc.com/sport/articles/cn3jj52337ko"}