{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:20:56", "date_modify": "2025-05-21 04:20:56", "date_publish": "2025-01-23 18:15:32", "description": "Solihull Moors appoint Wealdstone boss Matt Taylor as the club's new head coach.", "filename": "sport_football_articles_ckgy609xxyko_1747801256.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3d15/live/2b3338f0-da2f-11ef-95b0-9ba717ab19ce.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ckgy609xxyko_1747801256.html", "title": "Matt Taylor: Solihull Moors appoint Wealdstone boss as head coach", "title_page": "Matt Taylor: Solihull Moors appoint Wealdstone boss as head coach - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Solihull Moors have appointed Wealdstone boss Matt Taylor as the club's new head coach.\nThe 43-year-old, who has previously managed Walsall, Shrewsbury Town and Tottenham's Under-18 side, succeeds Andy Whing, who left the club earlier this week to take over at Barrow.\nTaylor made more than 600 appearances as a midfielder, featuring in the Premier League for Portsmouth, Bolton Wanderers, West Ham and Burnley, before spells in the EFL with Luton Town, Northampton Town and Swindon Town.\nHe leaves the Stones - who he joined in May - in the National League's final relegation place after five wins and 10 losses in 25 league matches. Solihull are seventh in the fifth tier, occupying the final play-off spot.\nWealdstone assistant manager Paul Hughes will take charge of the first team on an interim basis while the club appoints Taylor's successor.\n\"It's a great club with big plans and ambitions, on and off the pitch, and I am really looking forward to playing my part in that,\" Taylor told the Solihull website, external.\n\"I have been made to feel at home straight away and I am absolutely determined to repay the trust that has been placed in me by building a successful team playing good football to entertain the fans.\"\nThe club is keeping its backroom team with Richard Stearman stepping up to serve as Taylor's assistant.\n\"I'm absolutely delighted that we have been able to attract Matt to the club,\" chairman Darryl Eales added.\n\"We had many highly respected applicants, but Matt was the outstanding candidate for many reasons.\n\"He's intelligent, articulate, principled, knows the league and already has a good understanding of Moors, our ethos and our ambition allied to a real hunger and humility to continue to build on our strong foundations.\"", "url": "https://www.bbc.com/sport/football/articles/ckgy609xxyko"}