{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-04-26 06:57:30", "date_modify": "2025-04-26 06:57:30", "date_publish": "2025-02-28 14:10:21", "description": "Manchester United winger Alejandro Garnacho will \"pay for a team dinner\" after his reaction to being substituted against Ipswich.", "filename": "sport_football_articles_ce8yy837175o_1745650650.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f03d/live/9671e650-f5d9-11ef-b21f-25997e41ca0d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_ce8yy837175o_1745650650.html", "title": "Alejandro Garnacho to 'pay for Manchester United team dinner' after reaction to being subbed", "title_page": "Alejandro Garnacho to 'pay for Manchester United team dinner' after reaction to being subbed - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Manchester United winger Alejandro Garnacho \"will pay for a meal for his team-mates\" after he headed straight down the tunnel following his substitution against Ipswich, head coach Ruben Amorim has said.\nThe Argentine was sacrificed for Noussair Mazraoui on Wednesday after Patrick Dorgu was shown a straight red card for a challenge on Ipswich winger Omari Hutchinson.\nGarnacho did not take his place on United's bench, opting instead to go straight down the tunnel.\nAmorim has since spoken to Garnacho to get to the bottom of his decision and says the winger will fund a night out for his team-mates.\n\"It was funny because in the next day he came to me, to my office,\" said the United boss.\n\"I did some investigations, and he went to the dressing room, he changed his clothes because he was wet.\n\"He watched the game in the different [place], not on the bench. In the end of the game he was there, then he went home, so there's not an issue there.\n\"But I told them that in Manchester United everything is important, and the perception in a big club is really important, so he's going to pay a dinner to all the team, and that's it.\n\"I think he understands. He was subbed, he was playing well and has to go off in that moment of the game. It's hard to deal with everything but they have to deal with everything. I just try to help them be better footballers.\"\nUnited face Fulham in the fifth round of the FA Cup on Sunday (16:30 GMT).\nGarnacho, who Amorim said has a \"knock\", is expected to be fit for the tie.\nThe Portuguese coach was also asked about comments from former United skipper Roy Keane following the Irishman's furious rant about Bruno Fernandes' role as captain.\n\"I have a different opinion,\" said Amorim.\n\"I know sometimes he does things with his arms but most of all, a lot is out of frustration for this year and last. He wants to win.\n\"Roy Keane had big standards. It is normal to have opinions. I have an opposite opinion and I think my opinion is more important because I am the coach.\"", "url": "https://www.bbc.co.uk/sport/football/articles/ce8yy837175o"}