{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 08:02:51", "date_modify": "2025-05-21 08:02:51", "date_publish": "2025-01-30 20:07:33", "description": "When Jim Driscoll died 100 years ago, crowds of 100,000 people came on to the streets to pay respects to a 'Peerless' boxer.", "filename": "sport_articles_c1m580mg9p0o_1747814571.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/fd29/live/10538560-df0e-11ef-a819-277e390a7a08.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c1m580mg9p0o_1747814571.html", "title": "Peerless Jim Driscoll: Story of Wales' 'unofficial' boxing world champion who died 100 years ago", "title_page": "Peerless Jim Driscoll: Story of Wales' 'unofficial' boxing world champion who died 100 years ago - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "If there is one criticism to be made of Cardiff, the location of its statues would be a valid one.\nWere you aware of a statue of Mahatma Gandhi among the trees just a stone's throw away from the Millennium Centre in Cardiff Bay? Gareth Edwards lurks outside a Primark store in the indoor St David's shopping centre.\nYou might even have wandered past the Radisson Hotel in the middle of the city without noticing one of the nation's sporting giants standing proudly on a plinth by the main road.\nIt's impossible to compare Jim Driscoll - who died 100 years ago this January - with any other boxer or athlete in Welsh sporting history, and that's to be expected when you consider his nickname.\n'Peerless Jim' was born in the Adamsdown area of Cardiff in 1880.\nWhen he died aged 44 in 1925, some 100,000 people came on to the streets to pay their respects.\nOften, when sportsmen reach the upper echelons of pubic renown, it is due to their contribution away from their field.\nConsider Muhammad Ali, or even South Africa's rugby union captain Siya Kolisi, two greats who are recognised for their actions and social sacrifices alongside their sporting successes.\nWithin the context of Driscoll, personal sacrifice was responsible for the respect directed his way.\nHe gave up the chance to reach the peak of his sport because he promised to support his community.\nThe son of an Irish immigrant, Driscoll had a tough upbringing in desperate poverty at the end of the 19th century.\nHis father died after being hit by a train when Jim was only one.\nHis mother had to depend on the support of the church to help with raising her children, as well as maintaining her tough labouring job of loading potatoes and fish from the boats at the docks in Cardiff Bay.\nDriscoll developed his art form in boxing booths.\nDriscoll, like other legendary Welsh boxers Jimmy Wilde and Tommy Farr, would travel Britain's fairs and carnivals challenging any one of the public who would be foolish enough to pay for the misfortune of stepping in the ring with him.\nThis meant battling with every size and shape, and doing so for hours.\nThe old legend goes that Driscoll would often stand on a handkerchief with his hands tied behind his back, challenging opponents to hit him on the nose.\nIt is estimated that Driscoll racked up over 600 unofficial fights in these boxing booths, and by 1901 he was ready to take the step forward into the professional ladder.\nHe went on for seven years in England and Wales before turning his sights towards the United States of America.\nWith his slick style and his ability to avoid punches by dancing around the ring, many people prophesised that the Welshman would be the next featherweight champion of the world.\nIn 1910 he finally got his chance, facing the champion Abe Attell.\nMost fights of the time followed the 'no-decision' rule, which meant that Driscoll would have to knock his opponent out to take the title away.\nAttell is said to have insisted that this rule be put in place ahead of his fight against 'Peerless Jim'.\nDriscoll controlled the fight, but after 10 rounds he couldn't finish off the American.\nThe fight had to have an official winner to please those that had bet on the fight, and the decision was unanimous.\nDriscoll was the winner, but because of the 'no-decision' rule the belt would not be his.\nDriscoll died of tuberculosis on 30 January 1925.\nAs his coffin slowly made its way towards Cathays cemetery, thousands were on the streets of the Welsh capital, which at the time was home to only 200,000 residents.\nIf you were to visit the cemetery today - 100 years after his death - you would notice there are always flowers at his grave.\nWhich brings us back to the present.\nNext time you're shopping in Cardiff - and in particular the John Lewis department store - take the opportunity to leave through the back door.\nTake care when crossing four lanes of traffic, and there you will see, standing proud, a man with whom nobody compares.\nJim Driscoll was quite simply 'Peerless'.", "url": "https://www.bbc.com/sport/articles/c1m580mg9p0o"}