{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:38:20", "date_modify": "2025-05-21 07:38:20", "date_publish": "2025-03-28 12:26:41", "description": "Leicester podcast: 'It feels like the whole club is on auto pilot'", "filename": "sport_football_articles_c5y9y2el082o_1747813100.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b2f6/live/0a9175c0-3aa3-11ef-a044-9d4367d5b599.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c5y9y2el082o_1747813100.html", "title": "Leicester podcast: 'It feels like the whole club is on auto pilot'", "title_page": "Leicester podcast: 'It feels like the whole club is on auto pilot' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Leicester City interim manager Michael Appleton joined Owynn Palmer-Atkin and The Fosse Way's David Bevan to discuss Leicester's poor form on the When You're Smiling podcast.\n\"Leicester need a result from somewhere and that result has got to come quickly. It's a very difficult position. Losing games of football is just as much of a habit as winning matches. It just comes down to confidence and momentum. When you go on a losing streak, things come less naturally to you,\" said Appleton.\nBevan added: \"You look at the stats. They have lost 13 in 14, haven't scored a goal at home in seven games. It is really difficult to have any optimism about even reaching Wolves' current tally to be honest.\"\nWolves are 17th in the league and have 26 points, nine more than the Foxes.\n\"Even as a manager, losing this many games and not scoring any goals without a change being made is kind of unprecedented in my time supporting the club. It speaks to a lack of ambition but it feels to me that the only reason they haven't made a change is because of the financial restrictions and even that is down to long-term decision making that the club is responsible for,\" Bevan continued.\nLeicester's most recent league match, where they lost 3-0 against Manchester United, meant they became the first team in English top-flight history to lose seven home games in succession while failing to score in each.\n\"We just want to see something a little bit different for those final few games. It really feels at the moment like the whole club is on auto pilot.\"", "url": "https://www.bbc.com/sport/football/articles/c5y9y2el082o"}