{"authors": ["Bobbie Jackson", "www.facebook.com"], "date_download": "2025-05-20 14:52:55", "date_modify": "2025-05-20 14:52:55", "date_publish": "2023-07-27 15:20:20", "description": "Dustin Poirier and Justin Gaethje believe their battle for the symbolic BMF title at UFC 291 offers a chance to seal their legacy.", "filename": "sport_mixed-martial-arts_66328550_1747752775.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/158B/production/_130551550_gettyimages-946960942.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_mixed-martial-arts_66328550_1747752775.html", "title": "UFC 291: Dustin Poirier & Justin Gaethje want to cement legacy with symbolic BMF title", "title_page": "UFC 291: Dustin Poirier & Justin Gaethje want to cement legacy with symbolic BMF title - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It's all about legacy for Dustin Poirier and Justin Gaethje when they headline UFC 291 in Salt Lake City, Utah this weekend.\nFor just the second time in UFC history, the symbolic BMF title is on the line to add another dimension to an already high-stakes bout between former interim lightweight champions Poirier and Gaethje, ranked number two and three in the division.\nUltimately, the pair have their sights set on the lightweight title and both feel they will be next in line for a shot if they successfully come through the encounter on Saturday night (03:00 BST Sunday).\nLightweight champion Islam Makhachev makes the second defence of his belt against Charles Oliveira at UFC 294 on 21 October.\nFor now, Poirier and Gaethje will have to settle for the opportunity to hold the symbolic BMF title.\nThe belt, which some regard as a gimmick, is given to the toughest fighter in the UFC and is the brainchild of UFC president Dana White.\nAfter Nate Diaz beat Anthony Pettis at UFC 241, he took the mic and proceeded to call out Jorge Masvidal, who was in attendance and sitting cage-side at the Honda Center in Anaheim, California.\nWith UFC fans desperate to see the pair throw down, White confirmed they would meet just three months later to headline UFC 244 - the UFC's 500th live event - at the historic Madison Square Garden in New York with the BMF title on the line.\nThe fight lived up to the hype for as long as it lasted, with both landing some heavy shots; however, a cut above Diaz's right eye led to the doctor cutting it short at the end of round three.\nMasvidal was subsequently crowned the inaugural symbolic BMF champion, although neither fighter was happy with the way it ended.\nDespite both Masvidal and Diaz stating their intention to run it back in a rematch, they did not step into the octagon together again and the belt has not been up for grabs since.\nIt is now vacant after Masvidal announced his retirement following a unanimous decision defeat against Gilbert Burns at UFC 287.\nPoirier and Gaethje certainly have the credentials when it comes to being among the toughest fighters in the UFC.\nThey never shy away from a challenge and rarely, if ever, leave fans feeling short-changed.\nPoirier, 34, is tied with Diaz, Frankie Edgar and Edson Barboza for the most Fight of the Night bonuses in the UFC's 30-year history - collecting eight.\nGaethje, 34, is only one behind with seven and there's every chance they'll be leaving with another bonus on Sunday as they did in 2018 when Poirier won their first meeting by TKO in round four.\n\"This is who I am and what I do,\" Poirier said.\n\"It was five years ago that I beat him - he's done great things, I've done great things, and it just seemed we were on a collision course to do it again.\n\"It's cool [to be fighting for the symbolic BMF title], it's a legacy fight. I can put this BMF belt up on my mantel when I'm gone from the sport. I can talk about being the second BMF champion. It's history, it's legacy and it's fun.\n\"Even to have your name in the hat to be considered for a fight like this is a special thing.\"\nFor all the excitement around this rematch between Poirier and Gaethje, both fighters see it as a huge opportunity to stake their claim to challenge for lightweight supremacy.\nWhether it be Makhachev or Oliveira who prevails at UFC 294 in Abu Dhabi, it is difficult to see anything but the winner this weekend being next in line.\nPoirier said: \"I haven't been told directly that the winner is fighting for the [lightweight] belt, but I assume that's how it will be. I don't want to look forward too far. I just want to get my arm raised and then when the smoke clears we'll assess the next fight.\"", "url": "https://www.bbc.com/sport/mixed-martial-arts/66328550"}