{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:05:39", "date_modify": "2025-05-19 15:05:39", "date_publish": "2015-02-09 15:32:37", "description": "Anthony O'Connor will decide on his future after seeing where Plymouth Argyle end the current season.", "filename": "sport_football_31309830_1747667139.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/80889000/jpg/_80889086_anthonyoconnorgetty_pafc1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31309830_1747667139.html", "title": "Anthony O'Connor: Plymouth Argyle future depends on success", "title_page": "Anthony O'Connor: Plymouth Argyle future depends on success - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Anthony O'Connor says he will decide on his future after seeing where Plymouth Argyle end the current season.\nO'Connor , external on transfer deadline day, having been on loan at Home Park for most of the season.\nHe is an Ireland Under-21 international and has played 30 times for Argyle.\n\"Hopefully we can be where we want to be at the end of the year and I'll base my future on that,\" said the 22-year-old, who is a free agent in the summer.\n\"I'm only here until the end of the season, but that doesn't mean I won't be giving everything to the club because I'm only signed until the end of the season.\"\nO'Connor spent much of last season in League Two on loan at Argyle's nearest rivals Torquay United.\nHe returned to Blackburn in the middle of January and played for the club's under-21s, but says he only ever had eyes to get back into the Football League.\n\"It's not really football, you're not really playing for anything,\" he said of the Under-21s Premier League.\n\"It doesn't really mean anything. It's more about development at that age but I'm past that stage now. I want to be playing first-team football all the time.\n\"When you're playing for three points on a Saturday, everyone's job is on the line, so you know you've got to get your head down and work hard.\"", "url": "https://www.bbc.com/sport/football/31309830"}