{"authors": ["Matthew Henry", "www.facebook.com"], "date_download": "2025-05-20 14:06:41", "date_modify": "2025-05-20 14:06:41", "date_publish": "2023-07-30 17:33:53", "description": "Michael Vaughan says Australia are \"slight favourites\" to win the fifth Ashes Test, but will there be a Stuart Broad fairytale as the 2023 series concludes?", "filename": "sport_cricket_66356322_1747750001.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/BE30/production/_130588684_broad.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66356322_1747750001.html", "title": "Ashes 2023: Australia are 'favourites' over England in fifth Test, says Michael Vaughan", "title_page": "Ashes 2023: Australia are 'favourites' over England in fifth Test, says Michael Vaughan - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "\"If there was one more fairytale left, it would be ideal.\"\nIs it written in the stars for Stuart Broad and England? Or will Australia claim a stunning victory on the final day of the 2023 Ashes and in doing so clinch a 3-1 series win?\nDay four was supposed to be all about Broad, who announced the previous evening he will retire after this Test.\nThe 37-year-old, England's second-highest Test wicket-taker, was given a guard of honour to start the day but Australia openers Usman Khawaja and David Warner batted to 135-0 in pursuit of 384 when rain brought an early close.\nBroad is an Ashes legend. He has taken more wickets against Australia than any player in Test history. Does he have one more spell - like his famous 8-15 in the 2015 Ashes at Trent Bridge - in him on the final day?\n\"If there was one more fairytale left, it would be ideal if it was Stuart's last five-fer,\" said England coach Marcus Trescothick. \"One to win or two to win and he runs in and gets his last five-fer... something like that would be brilliant wouldn't it?\n\"We don't quite see the fairytales that we want to see at times but it would be lovely to dream of it.\"\nEngland were below par with the ball in their 38 overs, given little help from a slow and lifeless pitch - or with movement through the air.\nThey dominated Australia at times on day three, as they did throughout the drawn fourth Test at Old Trafford last week, before eventually being bowled out in their second innings for 395 earlier on day four.\nBut former England captain Michael Vaughan said the tourists, trying to win an Ashes series in England outright for the first time since 2001, are \"slight favourites\".\n\"At the start of the chase, you would say England are clear favourites but now, needing just 249, Australia are favourites going into the last day.\n\"England are looking like one or two of the bowlers are struggling.\"\nCuriously, Mark Wood did not bowl until the 33rd over but Trescothick, while admitting various bowlers were carrying niggles, said the Durham quick is fit.\nMoeen Ali did bowl, having injured his groin while batting on day one, but struggled with his off-spin, with part-timer Joe Root offering more threat.\n\"Clearly spin is an issue,\" Vaughan said.\n\"Are you going to expect Joe Root to bowl Australia out on the last day? I doubt it.\n\"The Aussies have taken some blows and they have sprung up today.\n\"For three days, they have been on the ropes and they were on the ropes at Old Trafford. It would be a remarkable series win if they get these runs tomorrow.\"", "url": "https://www.bbc.com/sport/cricket/66356322"}