{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:10:13", "date_modify": "2025-05-21 07:10:13", "date_publish": "2025-03-30 10:57:25", "description": "Hibs fan replies: 'Who'd have thought in November we'd be here?'", "filename": "sport_articles_cqx4jg3gy9xo_1747811413.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2ab8/live/4ccac460-f451-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cqx4jg3gy9xo_1747811413.html", "title": "'Who'd have thought in November we'd be here?'", "title_page": "Hibs fan replies: 'Who'd have thought in November we'd be here?' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Hibs fans, we asked for your views after Saturday's victory over St Johnstone secured a top six spot.\nHere's what some of you had to say:\nPaul: In season's gone by, and even earlier this season, games like that would end in a drab draw or disappointing loss but the composure, control and result feels like a significant step forward in mindset. Hats off to David Gray and the players!\nLes: A completely dominant performance from start to finish. It was a pleasure to watch the confidence flowing through this Hibs team and get the result they fully deserved. A far cry from the abject displays earlier in the season. Well done to the manager and players for making us proud again.\nDrew: Two rainbows meant the sun was definitely shining on Leith, but the three goals made it worth singing. Hibs were clumsy at times but St Johnstone couldn't capitalise. The penalty was icing on the cake but the real sweetness was seeing Hibs staying strong. David Gray's made a real difference to the mentality of the team it seems, we didn't look like a team who were looking for a way to lose. It seems impossible that we've moved from worries about relegation to hopes of Europe, but that's the difference a Gray makes.\nTim: What a turnaround from the beginning of the season. Hibs look so assured and confident on the pitch. They look well drilled, disciplined and creative. With the right signings over the summer, we'll be a real threat to the Old Firm.\nCraig: Top six secure and now to wrap up European football for next season. Who'd have thought in November we'd be here? Junior Hoilett's goal was superb and he was defensively sound all game. It was good to see Alasana Manneh get some minutes, hope he continues to improve the more game time he gets. Anniversary year going well to date.", "url": "https://www.bbc.com/sport/articles/cqx4jg3gy9xo"}