{"authors": ["Mike Henson", "www.facebook.com"], "date_download": "2025-04-26 03:50:15", "date_modify": "2025-04-26 03:50:15", "date_publish": "2025-03-05 12:57:58", "description": "South Africa head coach Rassie Erasmus says he will make use of assistant Felix Jones' new knowledge of England and their northern-hemisphere rivals.", "filename": "sport_rugby-union_articles_cwygezy9vqyo_1745639415.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9b60/live/15f0d830-f9bf-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_cwygezy9vqyo_1745639415.html", "title": "Felix Jones: Rassie Erasmus keen for England insights", "title_page": "Felix Jones: Rassie Erasmus keen for England insights - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "South Africa head coach Rassie Erasmus says he will make use of assistant Felix Jones' new knowledge of England and their northern-hemisphere rivals, but denied the Irishman's short-lived stint at Twickenham was part of any deliberate ploy.\nJones won back-to-back Rugby World Cup in South Africa's set-up before joining up with England as defence coach in January 2024.\nHowever, he quit after only seven months and his return to South Africa's staff was announced last week.\n\"I don't want people to think it was at all a plan to get him over there and come back again,\" said Erasmus.\n\"We all hoped for him that it would work out and I can't comment on why it didn't work out at England. But getting him back is fantastic, because we never wanted to lose him.\"\nJones previously had a remit with South Africa that focused on attack and core skills, but Erasmus says the 37-year-old's time concentrating on defence in a different environment would make him an even greater asset to the Springboks.\n\"Obviously Felix will have learned a lot and we would love him to share some of those things with us,\" he added.\n\"We do think there are little things we have missed where we can do better and Felix is going to play a pretty vital role in that. There is not one coach who didn't send me a list of things that he wants Felix to be involved with in in his department.\"", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/cwygezy9vqyo"}