{"authors": ["Calum Macdonald", "www.facebook.com"], "date_download": "2025-05-21 07:27:24", "date_modify": "2025-05-21 07:27:24", "date_publish": "2025-03-28 13:39:24", "description": "'Crash, bang, wallop' football gets best out of me - Motherwell's Tom Sparrow", "filename": "sport_articles_c78e2g7e0xlo_1747812444.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/738c/live/3e3b3470-0bbc-11f0-9ca8-c5035ea95420.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c78e2g7e0xlo_1747812444.html", "title": "'Crash, bang, wallop' football gets best out of me", "title_page": "'Crash, bang, wallop' football gets best out of me - Motherwell's Tom Sparrow - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tom Sparrow says the \"crash, bang, wallop\" style of Scottish football suits his game as he bids to help Motherwell sneak a top-six finish.\nThe Wales Under-21 international, who moved to Fir Park from Stoke City last summer, has been deployed at wing-back under Michael Wimmer and is relishing working with the new manager, who has praised the squad's work ethic.\n\"Really enjoyed it, you can see that in the results, everything he's tried to implement I've enjoyed and every day has been enjoyable to come into,\" said Sparrow.\n\"It shows well on the group, we're hard working and everyone wants to dig in and help, which is brilliant if he [the manager] see that.\n\"That's the main thing and that goes across the whole of Scotland, all the games, I call them crash, bang, wallop, they are all action, everyone is full blooded and I enjoy that, it probably gets the best out of me.\n\"The way the gaffer wants me to play is really attacking, which is what I enjoy. As long as I'm playing it's fine by me.\"\nSeventh-place Motherwell - currently a point off Hearts in sixth - head to Pittodrie to face Aberdeen on Saturday in their third-last fixture before the split.\n\"All games are big, especially in this league where everyone beats everyone,\" added Sparrow.\n\"We've said all week we just need to take it game by game, and win every game, but if we get a good result it puts in a good position.\"", "url": "https://www.bbc.com/sport/articles/c78e2g7e0xlo"}