{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:10:16", "date_modify": "2025-05-21 04:10:16", "date_publish": "2024-12-29 00:00:00", "description": "Middlesbrough climb back into the play-off spots but Burnley remain outside the top two after a goalless draw on Teesside.", "filename": "sport_football_live_cwyp82kwjl9t_1747800616.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cwyp82kwjl9t_1747800616.html", "title": "Middlesbrough 0-0 Burnley - Boro back in top six as Clarets stay third", "title_page": "Middlesbrough 0-0 Burnley - Boro back in top six as Clarets stay third - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Burnley missed the chance to move into the Championship's automatic promotion spots as they played out a goalless draw with play-off chasing Middlesbrough.\nA win would have taken them second after Sheffield United had earlier drawn with West Bromwich Albion, but Josh Brownhill spurned two great second half opportunities to take all three points.\nBoro, whose best effort saw Finn Azaz bring a fine save out of James Trafford, did move back into the top six above Watford on goal difference with a point.\nBut it is now one win in six for Michael Carrick's side, a run which has included two draws with Scott Parker's Clarets in a little over three weeks.\nBurnley's last visit to the Riverside in April 2023 saw them clinch promotion to the Premier League and after a brief stay in the top flight, the Clarets are chasing another promotion.\nConnor Roberts, Josh Cullen and captain Brownhill all started that night and are now mainstays for Parker as they were under Vincent Kompany in that previous promotion campaign.\nThis time, confidence has been built on a rock-solid defence, the meanest in the division with just nine goals conceded in half a season.\nOnly leaders Leeds United have scored more than Boro, but their problems had been at the other end conceding three goals in three of their previous four matches.\nThat included letting a three-goal lead slip to draw at home to Sheffield Wednesday on Boxing Day. The loss of two points came at a heavy cost too, as they lost forward Tommy Conway and goalkeeper Sol Brynn to injury.\nBrynn's dislocated shoulder meant a first start for Australian Tom Glover since February and Boro's third-choice keeper made a good smothering save to keep out Josh Laurent as Burnley started with confidence.\nThe visitors had more of the ball early on and looked threatening, but efforts from Jaidon Anthony and Brownhill were off target.\nBoro striker Emmanuel Latte Lath headed over after good wing play from teenager Ben Doak but probably the best chance of the half fell to Delano Burgzorg.\nFor once, the visitors lost composure at the back as CJ Egan-Riley lost a header to Latte Lath, Trafford was robbed outside his area by Burgzorg, but the Dutch forward could not find the target from 25 yards.\nMiddlesbrough head coach Michael Carrick told BBC Radio Tees:\n\"That was a real, proper game tonight.\n\"I know it wasn't a high level in terms of entertainment or excitement or goalmouth action but there was a lot of top level stuff in the game, testing each other in different ways and having to deal with different problems and finding solutions.\n\"I really enjoyed the game. The boys were fantastic in what we asked them to do against a really good team and I thought it was a good step forward for us.\"\nBurnley head coach Scott Parker told BBC Radio Lancashire:\n\"Over the course of the last two games, two very tough fixtures certainly in this Christmas period, these boys have been away from their families, not complaining but there have been real challenges.\n\"We managed to get three points in the last game but it was fine margins tonight and we didn't manage to be on the right end of that.\n\"Obviously we missed a big chance - we wouldn't have wanted it to have fallen to a better man on that pitch - but we didn't manage to execute and we walk away with a point and we're all really pleased with the last two games.\"", "url": "https://www.bbc.com/sport/football/live/cwyp82kwjl9t"}