{"authors": ["Adam Blackmore", "www.facebook.com"], "date_download": "2025-05-21 06:15:08", "date_modify": "2025-05-21 06:15:08", "date_publish": "2025-04-01 10:45:24", "description": "Southampton Q&A: Do Saints need to start from scratch?", "filename": "sport_football_articles_cx20yy0eyjro_1747808108.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ff31/live/e3e3dcf0-0e4c-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cx20yy0eyjro_1747808108.html", "title": "Q&A: Do Saints need to start from scratch?", "title_page": "Southampton Q&A: Do Saints need to start from scratch? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Here is another question posed to BBC Radio Solent's Adam Blackmore during our special Southampton Q&A.\nEthan asked: Russell Martin possibly started this season with a naive attitude and the players were always on edge with the dangerous style of football. Ivan Juric's football and man-management style seems too much of a shift in the opposite direction. Except from a clinical nine, I believe most of the players are of enough Premier League quality.\nWhat do you think - have the players been mismanaged or are we simply lacking threat? Now do we need a complete club culture shift and to start from scratch or otherwise?\nAdam: I have answered elements of your question in my replies to Jack and David (07:48) - please have a read of them.\nBut to answer your question on management directly, I think the players have been mismanaged and there was a middle ground to be found in the contrasting styles of Russell and Ivan that would have helped them more on the pitch.\nI also think it is not an either/or - I think the extreme styles of play that players have not been able to execute is also about the quality of the players trying to do it at the highest level.\nThe evidence of the season is overwhelmingly that they are, as a group, not Premier League quality, and as things have gone from bad to worse, their confidence is also shot to bits, which is a massive factor.\nIt will be a frustration that they have not been able to grow in the league by playing a simpler, safer style of football that they could have grown from. Saints definitely lack threat, though, and the constant failure to buy just one proven top-flight goalscorer has probably cost five managers their jobs - and counting...\nAs for a culture shift, that is definitely needed and should be delivered by the next manager and Johannes Spors. But starting from scratch is impossible to do player-wise, you just can't ship 30 out and 30 in, as much as agents would love it! So the club need to balance making money in the summer from sales with keeping players who want to be there and fight next season.\nThen there are the players who need to go for the good of the club, and they will be the hardest ones to shift.\nI did an episode of my BBC Sounds series Goin' Home With Adam And Jo this week on exactly this - the summer transfer strategy. Please feel free to have a listen.", "url": "https://www.bbc.com/sport/football/articles/cx20yy0eyjro"}