{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:41:49", "date_modify": "2025-05-21 04:41:49", "date_publish": "2025-02-09 09:24:36", "description": "A clinical Australia complete a nine-wicket victory over Sri Lanka early on day four in Galle to seal a dominant 2-0 series win.", "filename": "sport_cricket_articles_ceq9ddpqwvgo_1747802509.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9029/live/ad1ed700-e6c5-11ef-b644-850edeaf117f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_ceq9ddpqwvgo_1747802509.html", "title": "Australia in Sri Lanka: Tourists complete nine-wicket victory to seal 2-0 series win", "title_page": "Australia in Sri Lanka: Tourists complete nine-wicket victory to seal 2-0 series win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A clinical Australia completed a nine-wicket victory over Sri Lanka early on day four in Galle to seal a dominant 2-0 series win.\nThe tourists took just 25 minutes to take Sri Lanka's final two second-innings wickets, dismissing their hosts for 231.\nThat left Australia, who won the first Test by an innings and 242 runs, chasing 75 and they cruised to victory before lunch, despite the loss of opener Travis Head for 20.\nUsman Khawaja ended 27 not out and Marnus Labuschagne unbeaten on 26. Sri Lanka batter Dimuth Karnuaratne bowled the last over in his 100th and final Test.\nIt sealed Australia's first series win in Sri Lanka since 2011.\n\"We played really well from the outset,\" said Australia stand-in captain Steve Smith, who whose 131 in the first innings followed 141 in the first Test.\n\"The plans that the batters came with and were able to adapt to the conditions here - it was amazing.\"\n\"I thought all our bowlers did a tremendous job.\"\nThe match also concludes the league phase of the 2023-25 World Test Championship cycle.\nAustralia had already secured their place in June's final at Lord's, where they will play South Africa, who finished top of the table. Sri Lanka end the cycle sixth, a place below England.\n\"Losing a home series 2-0 is very disappointing,\" said Sri Lanka captain Dhananjaya de Silva. \"The conditions were very suitable for us.\"\n\"We haven't had opportunities to get into the game, right from the first game, and Australia proved why they are in the final.\"", "url": "https://www.bbc.com/sport/cricket/articles/ceq9ddpqwvgo"}