{"authors": ["Chris Harby", "www.facebook.com"], "date_download": "2025-04-26 06:25:28", "date_modify": "2025-04-26 06:25:28", "date_publish": "2025-02-28 22:02:58", "description": "Leigh Leopards brush aside a misfiring Catalans Dragons to extend their winning start to the Super League season.", "filename": "sport_rugby-league_articles_c78ewyjxvn2o_1745648728.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a19a/live/4a164ca0-f61b-11ef-a416-3b7c7b93a27e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-league_articles_c78ewyjxvn2o_1745648728.html", "title": "Super League: Leigh 34-6 Catalans Dragons", "title_page": "Super League: Leigh 34-6 Catalans Dragons - Leopards continue perfect start - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Umyla Hanley's hat-trick helped Leigh Leopards brush aside misfiring Catalans Dragons to extend their winning start to the Super League season.\nCatalans struggled to turn pressure into points, while their clinical hosts tore into a 16-0 half-time lead as Hanley, Keanan Brand and Jack Hughes all crossed.\nHanley extended the lead soon after the break and Ethan O'Neill went over for his first Leigh try as the Dragons' error count soared.\nAlrix da Costa finally got the visitors on the board, but Hanley completed his hat-trick to cap an emphatic win.\nA third straight win moves Leigh second, level on points with leaders Hull KR, while Catalans drop to 11th and point-less after an error-strewn display.\nReimis Smith had an early score for the visitors overturned by video referee James Vella, but that was as good as it got for the French side in a dismal first half.\nHanley had a score chalked off at the other end, but moments later he did claim his first try of the season, showing neat footwork to crash through after Tesi Niu's brilliant run had made big inroads.\nAs in last week's defeat to Warrington, Catalans enjoyed plenty of territory and possession but lacked an end product, and their start to the season was typified by two Leigh scores before the half-hour mark.\nFirstly, Luke Keary's pass went to ground, allowing Owen Trout to collect and send Brand away for a 70-metre run to the line.\nBen Garcia, making his 250th Catalans appearance, was then held up over the Leigh line and within 60 seconds, the hosts had a third try.\nIt was ignited by debutant AJ Towse - in for the sick David Armstrong - with a 30-metre run from behind his own in-goal line, and finished off by Hughes via a second Lachlan Lam assist.\nCatalans' growing frustration spilled over just before the break when Jordan Dezaria was sent to the sin-bin for obstructing a 20-metre restart as more attacking pressure failed to bear fruit.\nHanley showed more nifty footwork to weave through some slack tackling for his second, and with the basic errors stacking up, O'Neill then dropped over the line after a surge from Gareth O'Brien - who kicked five conversions - was halted.\nTrailing 28-0, Da Costa burrowed his way over from dummy half to avoid a shutout, but Hanley replied with a super finish from 30 metres out after a sweeping move.\nLeigh Leopards head coach Adrian Lam told BBC Radio Manchester:\n\"We gave AJ Towse his debut today as a Super League player and I'm really pleased for him. Davy Armstrong woke up this morning and was ill so we made a call on that and to have him come in here and do what he did tonight was outstanding.\n\"And in the same breath I thought Bailey Hodgson at full-back was brilliant. It just gives us trust to give other players a go when it's their turn.\n\"It's great that the group's a quick learning group, but I don't want to get too far ahead of ourselves.\n\"I've been in this situation before and know that it can turn quickly, but we're all working hard to head in the right direction.\"", "url": "https://www.bbc.co.uk/sport/rugby-league/articles/c78ewyjxvn2o"}