{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:42:31", "date_modify": "2025-05-19 14:42:31", "date_publish": "2017-08-06 18:11:52", "description": "Aberdeen boss Derek McInnes praises his side's powers of recovery as they beat Hamilton despite their European exertions.", "filename": "sport_football_40845501_1747665751.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/672D/production/_97231462_13755580.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_40845501_1747665751.html", "title": "Aberdeen 2-0 Hamilton: Derek McInnes praises Dons' powers of recovery", "title_page": "Aberdeen 2-0 Hamilton: Derek McInnes praises Dons' powers of recovery - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Derek McInnes was delighted with Aberdeen's resilience as they recovered from their European exertions to get the better of Hamilton Academical.\nA 2-0 defeat away to Cypriot side Apollon Limassol on Thursday night ended the Dons' Europa League hopes.\nBoss McInnes made only four changes against Accies on Sunday but his side still ran out 2-0 winners at Pittodrie.\n\"They deserve so much credit for getting themselves game ready for that today,\" he told BBC Scotland.\n\"We all know what Hamilton are, at the very least they give you a real competitive game, they get after you and make the game quick. We needed to be ready for that and I thought we were at the start of the game.\n\"It's never easy when Hamilton are preparing on Thursday and Friday and our players are playing in that type of heat, travelling through the night and sleeping through the day. It's a huge advantage physically for Hamilton today but our players coped very well.\"\nAnthony O'Connor nodded the Dons into the lead and after Accies had Xavier Tomas sent off for a second yellow card, substitute Miles Storey put the game beyond doubt.\n\"We scored a good goal and passed up a few opportunities,\" McInnes said. \"Some of the play was really good, some of it not so good. We were a bit sloppy and over-indulgent at times, but 1-0 was a fair reflection at half-time and I thought we were good for another goal - although it didn't come until later in the game.\n\"I think what's clear, you can see when we're hot we're going to be really hot but I'd still like us to be a bit more mindful of doing the basics right, getting that element of control. I think today a lot of that has to do with the exertions and coming back from Europe.\"\nWinger Scott Wright was a stand-out for the Dons and McInnes was thrilled with the 19-year-old's display.\n\"He was a bundle of energy, he was positive and I thought he needed a bit more protection at times - there was a tackle on him that bordered on a red card for me, although I'd need to see it again,\" he added.\n\"He was a real handful for each and every one of the Hamilton players he came up against. It was a good game for him to come into. He was a real positive.\"", "url": "https://www.bbc.com/sport/football/40845501"}