{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:23:13", "date_modify": "2025-04-26 06:23:13", "date_publish": "2025-03-04 00:00:00", "description": "Benony Andresson comes off the bench to rescue promotion-chasing Stockport a draw at relegation-battling Northampton.", "filename": "sport_football_live_c1mnnkey510t_1745648593.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cb12/live/71e2ee10-f5e8-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_c1mnnkey510t_1745648593.html", "title": "Northampton Town 1-1 Stockport County", "title_page": "Northampton Town 1-1 Stockport County - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Benony Andresson came off the bench to rescue promotion-chasing Stockport a draw at relegation-battling Northampton in League One.\nTerry Taylor's deflected free-kick gave the Cobblers a half-time lead but Andresson equalised with 11 minutes left.\nThe point was enough to edge Northampton five points clear of safety while County sit six adrift of the automatic promotion spots.\nStockport had won seven of their last nine league games but they were second best in the first half and fortunate not to be more than one goal behind at the break.\nTariqe Fosu headed over before Northampton opened the scoring in the 31st minute.\nBen Perry was fouled just outside the box and Taylor's free-kick deflected off the wall and wrong-footed goalkeeper Corey Addai.\nPerry missed a good chance to make it two before the break, side-footing wide from the middle of the box, while Stockport's only attack of note in the first half saw Sam Cosgrove's header disallowed for a foul.\nDave Challinor made a quadruple change early in the second half and while his side continued to labour, they levelled out of nothing when Andresson superbly headed in Ryan Rydel's cross.\nStockport had chances to win it but Lee Burge made three excellent saves late on, denying Oliver Norwood, Lewis Bate and Kyle Wootton in quick succession.", "url": "https://www.bbc.co.uk/sport/football/live/c1mnnkey510t"}