{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-05-20 14:00:26", "date_modify": "2025-05-20 14:00:26", "date_publish": "2023-07-31 07:00:07", "description": "Manchester United will confirm a decision on striker Mason Greenwood's future prior to their opening Premier League game of the season.", "filename": "sport_football_66357915_1747749626.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/14E69/production/_130590658_hi073427517.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66357915_1747749626.html", "title": "Man Utd to make Mason Greenwood decision before start of Premier League season", "title_page": "Man Utd to make Mason Greenwood decision before start of Premier League season - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester United will decide striker Mason Greenwood's future before their opening Premier League game of the season against Wolves on 14 August.\nA number of serious charges against Greenwood, including attempted rape and assault, were dropped on 2 February.\nThe Crown Prosecution Service said key witnesses had withdrawn and new material had come to light.\nIt meant there was \"no longer a realistic prospect of conviction\".\nAt the time, a statement released on 21-year-old Greenwood's behalf said he was \"relieved\".\nHowever, United then said they were launching their own investigation.\nGreenwood has been unavailable for selection ever since and has not been involved at the club's Carrington training ground. His United contract runs until June 2025.\nAsked about the situation at the start of United's current tour of the United States, manager Erik ten Hag said he had given his opinions on the matter but it was for others at the club to decide.\nIt is understood that process is now nearing its conclusion, with an announcement anticipated at some point before the Wolves game.", "url": "https://www.bbc.com/sport/football/66357915"}