{"authors": ["Matthew Henry", "www.facebook.com"], "date_download": "2025-04-26 07:51:25", "date_modify": "2025-04-26 07:51:25", "date_publish": "2025-02-25 15:14:06", "description": "England captain Jos Buttler admits his future as captain may be on the line against Afghanistan in the Champions Trophy, but will continue to focus on the positives.", "filename": "sport_cricket_articles_cly8782n8x3o_1745653885.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9196/live/200b4a00-f387-11ef-bdb2-df3b1e28059d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_cricket_articles_cly8782n8x3o_1745653885.html", "title": "Champions Trophy 2025: England captain Jos Buttler admits future as skipper on the line", "title_page": "Champions Trophy 2025: England captain Jos Buttler admits future as skipper on the line - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "England captain Jos Buttler says his future as skipper may be on the line against Afghanistan in the Champions Trophy.\nEngland know they must win the Group B match in Lahore on Wednesday to avoid being eliminated from the competition.\nWere they to go out it would be a third disappointing white-ball tournament in a row under Buttler after their failed defences of the 50 and 20-over World Cups in 2023 and 2024 respectively.\nAsked if the stakes were high for his future after the poor run, Buttler said: \"Yes, absolutely.\n\"Any time as an England captain, you want to perform well and you want to lead your team to winning games of cricket.\n\"We haven't been doing that enough in the recent past.\"\nDespite the pressure on him, batter Buttler, who took over as white-ball captain after Eoin Morgan retired in 2022, said he will continue to focus on the positives.\n\"As soon as you catch yourself thinking about any negative things, you just try and completely forget that and focus on all of the positive things that could go right and where you can take the team,\" he said.\n\"I'm very much focused on that.\"\nButtler confirmed the only change to England's XI is Jamie Overton replacing injured fellow fast bowler Brydon Carse.\nEngland's poor form has not only been in major white-ball events. Defeat by Australia in their group opener - when they scored 351-8 but lost by five wickets - was their 11th in 15 one-day internationals since the 2023 World Cup and fifth in a row.\nThey have also lost their past four bilateral series, although Buttler was injured for two of those.\nAustralia's washout against South Africa means England will be guaranteed to progress to the semi-finals if they beat Afghanistan and the Proteas. Barring more rain affecting results in the group, defeat in either game will eliminate them.\n\"We need to make sure we build on the things we did well the other day, try and execute a little better in certain areas as well,\" Buttler told BBC Sport.\n\"Scoring 350 is a great effort and we probably left a few out there, which is a nice sign for the batting unit.\n\"With the ball we did a lot of things right but we could have just been a bit more consistent to build the scoreboard pressure.\"\nThe match will be played at the same ground as England's defeat by Australia, albeit on a fresh pitch.\nIn recent days, England players have suggested the dew had a significant impact on that match, making conditions easier for batting during Australia's chase - with the advantage possibly worth as many as 60 runs.\nDew usually hampers spinners, who are unable to get as much turn from the damp surface, or grip a wet ball. Afghanistan have a fearsome spin attack, including world-class leg-spinner Rashid Khan.\n\"They are a stiff challenge but we like focus on that and be really well prepared and focus on ourselves individually and collectively performing to the best of our ability to win the game,\" said Buttler.", "url": "https://www.bbc.co.uk/sport/cricket/articles/cly8782n8x3o"}