{"authors": ["Tom Williams", "Paul Grunill", "www.facebook.com"], "date_download": "2025-05-21 05:29:56", "date_modify": "2025-05-21 05:29:56", "date_publish": "2025-04-03 05:08:06", "description": "Kate Coppack is putting her career as an employment lawyer on hold for a full-time professional contract with the Essex women's cricket team.", "filename": "sport_cricket_articles_cvg1rmep3lno_1747805396.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ba93/live/f7e18650-0963-11f0-9401-656920122950.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cvg1rmep3lno_1747805396.html", "title": "Kate Coppack: Essex seamer swaps law for full-time cricket deal", "title_page": "Kate Coppack: Essex seamer swaps law for full-time cricket deal - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "According to the Marylebone Cricket Club website, there are 42 different laws of cricket, external, most of them divided into multiple sub-sections, plus an appendix.\nOne player who would feel right at home immersed in such fine legal details is seam bowler Kate Coppack, who will be part of the Essex women's squad this summer.\nCoppack, who helped Sunrisers win last summer's Rachael Heyhoe Flint Trophy under the old regional format, is an employment lawyer by profession.\nBut at the age of 30, she is temporarily turning away from the world of litigation and affidavits, having signed a professional contract at Chelmsford as the women's county game enters a new era.\n\"When I was growing up, it [turning pro] wasn't an option at all,\" Coppack told BBC Look East.\n\"Even when I was at uni, it wouldn't have been an option for me to be a professional cricketer - law was always the career path and cricket was playing on the weekends, seeing how high I could go amateurly.\n\"But when the game became professional, there were added incentives, the standard got better and I really enjoyed working hard at my game and seeing where it could go. It was kind of a natural progression to try to get a fully professional contract while I still can.\"\nEssex are among eight women's county sides granted fully-professional tier one status by the England and Wales Cricket Board (ECB) - although Nottinghamshire will continue to use their old regional name, The Blaze - and will take part in their own T20 Blast and 50-over One-Day Cup competitions this summer.\nCoppack played for Sunrisers on a 'paid-by-game' basis and took 4-27 as they beat South East Stars in a rain-affected RHFT final last September, for which she was named player of the match.\nBut she now has the chance to concentrate fully on cricket this summer, as her legal career takes a back seat.\n\"In terms of how much studying I did, and training, in total it was seven years - five years of studying, then two years in practice,\" she said. \"It's a long road to become a lawyer and I didn't stop it lightly. I did think about it for a while.\n\"I will miss it, I love the firm I was working with, the team I was working with, but it's good I can now focus on cricket.\n\"I will miss that intellectual stimulation and I am going to try and do a bit of work while playing cricket. In the winter, there'll obviously be a lot more opportunity for that, there's quite a bit of downtime when I can do some legal work still so that's the best of both worlds really.\"\nApart from last summer's final, Coppack has a couple of other more notable achievements on her cricketing CV.\nWhen she was 13, she became the first girl to play for the first XI at King's School in Chester and also made six appearances as a guest for Peru at the 2018 South American Women's Cricket Championship.\nBut now, following a training camp in Abu Dhabi, everything is geared towards Essex's One-Day Cup opener away to Durham on Wednesday, 23 April.\n\"We always had a few full-time professionals (for Sunrisers), but now some of those girls who were juggling careers with playing part-time are now full-time which is great for them,\" said Essex team director Andy Tennant.\n\"It gives them the chance to fulfil their potential and I know they'll be even more excited than the full-time pros. We're just looking forward to having a whole collective that we've got every day of the week to train.\n\"Eventually, the women's game will have to stand on its own two feet. This is the next step for the domestic game for us to start getting more bums on seats here at Chelmsford and earning our corn, if you like, on top of the ECB investment that's already come into the game.\"\nTennant hopes the Sunrisers' improvement in 2024, which brought their first major trophy, can be continued by Essex, who have signed several other members of their squad, apart from Coppack.\n\"We just want to be competitive in all formats - we'll focus on doing what we do well and hopefully at some point, somebody will give us some silverware,\" he added.\nAll-rounder Eva Gray believes the fact that members of the squad have taken \"different routes\" to reach this point is a strength.\n\"We have people that weren't full-time until about a week ago but also people that have been full-time for five or six years,\" she said.\n\"The whole way through the Sunrisers era, we were all pretty understanding of different scenarios and people's commitments. Now, for us to pull together as one big full-time squad is really key. We're looking forward to seeing the progress we can make.\"\nFor Coppack, as one of the oldest members of the squad, it remains to be seen how many years she wishes to commit to the professional game.\nBut she added: \"There's plenty of time to be a lawyer, we'll enjoy cricket for now.\"", "url": "https://www.bbc.com/sport/cricket/articles/cvg1rmep3lno"}