{"authors": ["Lauren McCann", "www.facebook.com"], "date_download": "2025-05-21 03:48:59", "date_modify": "2025-05-21 03:48:59", "date_publish": "2025-04-07 15:26:49", "description": "Northern Ireland boss Tanya Oxtoby believes the return of record goalscorer Rachel Furness will add \"enthusiasm and belief\" to her young squad.", "filename": "sport_football_articles_cz013lr85gro_1747799339.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3547/live/0137d450-13c0-11f0-b1c4-498f305c3d3a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cz013lr85gro_1747799339.html", "title": "Rachel Furness: 'Tactically astute' midfielder returns for Northern Ireland", "title_page": "Rachel Furness: 'Tactically astute' midfielder returns for Northern Ireland - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Northern Ireland boss Tanya Oxtoby believes the return of record goalscorer Rachel Furness will add \"enthusiasm and belief\" to her young squad.\nNewcastle United midfielder Furness is a late addition to the panel for the Nations League game against Romania at Windsor Park on Tuesday, with Nottingham Forest's Megan Bell ruled out through illness.\nOxtoby is delighted to have the 36-year-old back in the fold for the first time since October 2023.\n\"We've got a fairly young group and we're in a great position where we can bring Furney in, she has been getting regular minutes for her club and she is tactically very astute,\" Oxtoby told BBC Sport NI.\n\"With the way we want to play we need versatility, and she can play in a number of different roles and the leadership she brings around the group is priceless, she'll come in and add a lot of enthusiasm and belief.\"\nDefender Rachel Dugdale, who started Friday night's 1-1 draw with Romania in Bucharest, has also withdrawn from the squad and has been replaced by Cliftonville centre-back Kelsie Burrows.\n\"We have been managing illness in the camp, and we have done really well to contain it but unfortunately Duggie and Megan were casualties of that,\" Oxtoby added.\nNorthern Ireland sit second in Group B1 after three matches following a loss against Poland, a late win over Bosnia-Herzegovina and that draw with Romania.\nOxtoby admitted her side are now concentrating on finishing strongly with their promotion hopes fading, starting with a win against Romania.\n\"We're focusing on a points tally rather than a position in the group now and if we hit that we'll end up where we need to.\n\"We need to put out a complete performance against a really experienced Romania team and if we do that, we have every chance of getting a result.\"\nThe Australian manager knows her side will have to produce a better display in both boxes than they did in Bucharest if they are to come away with all three points in Belfast.\nDanielle Maxwell opened the scoring for NI with a superb strike, but Romania equalised when Mihaela Ciolacu capitalised on a defensive error.\nNorthern Ireland failed to turn their possession into clear cut chances and Romania almost won the game in stoppage time when Ciolacu hit the crossbar.\n\"I think we had a positive foundation on Friday night coming away with a point but really excited to be back here [at Windsor Park] and hopefully the crowd can bring the noise,\" Oxtoby continued.\n\"We need to cut out those [defensive] errors and going the other way, we need to finish teams off when we are in the ascendancy.\"", "url": "https://www.bbc.com/sport/football/articles/cz013lr85gro"}