{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:57:55", "date_modify": "2025-05-21 03:57:55", "date_publish": "2025-02-01 17:45:06", "description": "Gloucester-Hartpury beat Leicester Tigers to secure their place in the Premiership Women's Rugby play-offs.", "filename": "sport_rugby-union_articles_cz6py14q532o_1747799875.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ac3e/live/6f1bd660-e0c1-11ef-80f0-273d2cd9a9c9.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cz6py14q532o_1747799875.html", "title": "Premiership Women's Rugby: Gloucester-Hartpury clinch play-off place", "title_page": "Premiership Women's Rugby: Gloucester-Hartpury clinch play-off place - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "League leaders Gloucester-Hartpury have secured their place in the Premiership Women's Rugby play-offs thanks to a comfortable 38-7 win over Leicester Tigers.\nSaturday's victory, combined with Loughborough Lightning's surprise 31-22 win over top-four chasing Bristol Bears, means Gloucester cannot be caught by the Bears, who sit in fifth.\nOn Sunday, Harlequins needed a late try from Ellie Kildunne, her second of the afternoon, converted by Ella Cromack, to come from 19-12 down at the break to beat Exeter Chiefs 31-30 and keep the pressure on the leaders.\nThat came a day after a hat-trick from May Campbell helped Saracens defeat local rivals Trailfinders Women 31-17 to stay in touch with the top two.\nGloucester had five different try scorers, with Meg Davies and Carmen Castellucci both crossing before a penalty try left them 19-0 up at the break.\nLeicester scored first in the second half with a length-of-the-field try from Claire Gallagher but Gloucester hit back with Hannah Jones securing the bonus point before replacements Kathryn Buggy and Gillian Boag also crossed.\nKrissy Scurfield scored twice for the Lightning, who led 31-12 with 10 minutes to play before Lark Atkin-Davies and Reneeqa Bonner cut their advantage before the end.", "url": "https://www.bbc.com/sport/rugby-union/articles/cz6py14q532o"}