{"authors": ["Mike Richards", "www.facebook.com"], "date_download": "2025-05-21 07:41:47", "date_modify": "2025-05-21 07:41:47", "date_publish": "2025-05-20 13:57:55", "description": "Everton news: 1995 FA Cup final anniversary 3 years on", "filename": "sport_football_articles_ce3vyx33wnyo_1747813307.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b550/live/69581a40-b629-11ee-beb5-e1400df560f2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ce3vyx33wnyo_1747813307.html", "title": "Everton news: 1995 FA Cup final anniversary 3 years on", "title_page": "Everton news: 1995 FA Cup final anniversary 3 years on - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "On this day 30 years ago, Saturday 20th May 1995, events will be forever etched in my memory.\nThis was my first (and only) taste of Everton success - as I'd been unlucky to miss the glory of the mid-eighties.\nThe memories from that day still remain incredibly vivid.\nPrior to arriving at Wembley, it was a memorable occasion for all the wrong reasons.\nWith the promise of a luxurious journey on an executive coach, my mum and I arrived at Goodison Park to be greeted by the most basic of elongated tin cans to carry us down south.\nNot the greatest start to proceedings, and it set the tone for what was to happen next.\nWith lunch at Lords Cricket Ground all part of the package we'd booked, the excitement soon dissipated once it became apparent that the coach driver was lost, meandering through the streets of London.\nOur eventual arrival coincided with dessert being dished out. Strike two for the day and as we know, things always happen in threes! It's fair to say we couldn't envisage what materialised a short few hours later.\nA slither of cake and hastily painting of my face later, we approached the Twin Towers to scenes of blue and white. I'll never forget the immense ferocity of our club colours as far as the eye could see.\nAfter the start to the day, to witness Paul Rideout's winner, Neville Southall's heroics and the Dogs of War mentality against the much fancied Manchester United, felt nothing short of miraculous.\nEven at the age of 10, I always remember wondering if it was always going to be this way.\nI never left Wembley that day contemplating this would be the only time I'd see an Everton captain raise a piece of meaningful silverware above their head.\nThe unthinkable has sadly been our reality since that day.\nSporadic false dawns and unfounded hope have littered our history since.\nThe move to our new stadium, under the ownership of The Friedkin Group, gives us a fabulous opportunity to become competitive once again.\nIt feels like we've been given a second, and potentially final opportunity to get it right. We simply have to take it.", "url": "https://www.bbc.com/sport/football/articles/ce3vyx33wnyo"}