{"authors": ["Paul Battison", "www.facebook.com"], "date_download": "2025-05-21 05:00:55", "date_modify": "2025-05-21 05:00:55", "date_publish": "2025-02-09 07:24:09", "description": "Dricus du Plessis outclasses Sean Strickland to retain his middleweight title by unanimous decision at UFC 312 in Sydney, Australia.", "filename": "sport_mixed-martial-arts_articles_cpql3xn85geo_1747803655.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/55b7/live/ef4633d0-e6b1-11ef-8723-1f11f5101e0b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_mixed-martial-arts_articles_cpql3xn85geo_1747803655.html", "title": "UFC 312: Dricus du Plessis outclasses Sean Strickland to retain middleweight title", "title_page": "UFC 312: Dricus du Plessis outclasses Sean Strickland to retain middleweight title - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "South Africa's Dricus du Plessis outclassed Sean Strickland to retain his middleweight title by unanimous decision at UFC 312 in Sydney, Australia.\nThe 31-year-old was the far busier and more effective striker as he claimed his second win over the American.\nTwo judges scored the contest 50-45 with the other calling it 49-46 in Du Plessis' favour.\n\"I told you guys, to knock him out is next to impossible. I wanted a submission, knockout or absolute domination over a five-rounder and that's what I gave,\" said Du Plessis.\n\"I am a top three pound-for-pound fighter as of tonight and I'm coming for that number one spot.\"\nIn the co-main event, China's Zhang Weili defended her strawweight title with a masterful performance against American Tatiana Suarez.\nThe 35-year-old was the pre-fight underdog but out-struck and out-grappled Suarez on her way to a unanimous decision victory.\nThe fight was a rematch of their bout just over a year ago, when Du Plessis triumphed via split decision following a back-and-forth contest.\nStrickland, 33, believes he should have been awarded victory that night, but can have no complaints about the judges at the Qudos Bank Arena in Sydney.\nStrickland, who had light-heavyweight and former middleweight champion Alex Pereira in his corner, had angered Australian media during fight week with a series of inflammatory comments but was cheered by fans as he made his walkout.\nDu Plessis received a mixed reception but was not fazed as he took control of the fight in the early stages.\nStrickland spent much of the contest methodically using his jab and front kick, with Du Plessis delivering more output and landing the more eye-catching strikes.\nThe South African, who was making the second defence of his belt, mixed up his kicks and punches well, with Strickland's corner growing more frustrated as the rounds slipped by.\nA big moment came in the fourth round, as a huge right hand from Du Plessis appeared to break Strickland's nose, seeing the American quickly back off.\nWith blood gushing down his face, he showed remarkable toughness to survive until the end of the fight, but was unable to deliver any significant damage to Du Plessis.\nIn his post-fight interview, Du Plessis took aim at Perreira, asking \"is there no one else?\", in response to the Brazilian saying previously he would be interested in a future matchup.\nTwo-time champion Weili was making the third defence of her second reign as she looked to add gloss to her status as one of the greatest strawweights of all time.\nIt was Suarez who came into the contest as the favourite, however, after winning the first 10 fights of her mixed martial arts career.\nSince making her UFC debut in 2016 the 34-year-old has dominated the majority of her opponents, earning five finishes in seven bouts in the promotion.\nSuarez took Weili down early - the first time in eights bouts she had surrendered a takedown - before controlling the action on the ground for the majority of the round, but it proved to be one of the few times she got the better of the champion.\nWeili took control in the second round, reversing a takedown and landing some pummelling shots on the ground, and she never looked back.\nWeili rocked Suarez with a big right midway through the fight, before continuing to defend takedowns and land at will.\nAs the fight wore on, Weili's superior speed showed as she avoided any danger, before stamping her authority on the contest by controlling the remaining action on the ground.\n\"I had a full camp for this fight so I was well-prepared. I respect Tataina, she's very strong,\" said Weili.\n\"I don't care if I was the underdog, I just focused myself. I just want to say Aussie Aussie Aussie!\"", "url": "https://www.bbc.com/sport/mixed-martial-arts/articles/cpql3xn85geo"}