{"authors": ["Andrew Petrie", "www.facebook.com"], "date_download": "2025-05-21 05:59:53", "date_modify": "2025-05-21 05:59:53", "date_publish": "2025-01-23 00:40:14", "description": "Brendan Rodgers praises his Celtic side after they \"kept believing\" to snatch a late win over Young Boys and create a \"bit of history\" by reaching the Champions League play-off round.", "filename": "sport_articles_cy08jdjw2wxo_1747807193.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a61d/live/40cb3770-d922-11ef-bc01-8f2c83dad217.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cy08jdjw2wxo_1747807193.html", "title": "Celtic 'kept believing to write history'", "title_page": "Celtic 'kept believing to write history' - Rodgers - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The \"open goal\" of a tie against Young Boys was unravelling into \"one of those nights\" for Celtic.\nIt was a game that had Celtic fans up and out of their seats four times in the first half, without truly celebrating until the 86th minute. Even then there was still time for a red card for Daizen Maeda and more tension.\nBut after the late own goal that secured a 1-0 victory and the club's Champions League progression for the first time since 2013, Brendan Rodgers was able to breathe a sigh of relief and revel in \"a little bit of history created\".\n\"We'll always fight to the very end,\" Rodgers added. \"The players showed the benefits of that.\n\"Tonight was such a big night, there was such a big expectation on the team. No game at this level is easy but we didn't get disappointed. We kept believing.\"\nBefore Wednesday night it seemed the hard work had already been done. The win over RB Leipzig has gone down as one of Celtic's finest hours in Europe, while the goalless away draw against Atalanta showed the kind of steel Superman would have been proud of.\nAll Celtic needed was a win against Young Boys - Swiss champions last year, struggling badly this season and with six Champions League losses out of six before the trip to Glasgow.\nBut after three Kyogo Furuhashi goals were ruled out for various infringements and Arne Engels missed a penalty, doubts started to cloud over Celtic Park.\n\"Because of who they were playing, before the game this felt like an open goal for Celtic - but it looked like it was turning into one of those nights for them,\" former striker Chris Sutton said on Match of the Day.\n\"They had so many opportunities in the first half but then in the second half they looked tired and lacked a spark - Young Boys had the better of things and Celtic had Kasper Schmeichel to thank for keeping them out.\n\"Then just when it looked like the game was petering out, they got the bit of luck they needed.\"\nIt was a moment of magic from Reo Hatate that put Adam Idah through on goal, with his shot saved by the keeper before deflecting off Young Boys captain Loris Benito and in. Calamity averted.\nRodgers has already won all there is to win in Scotland, comfortably and repeatedly. Europe was the hurdle he had failed to clear with them - until now.\nAfter the 7-1 loss to Borussia Dortmund at the start of October, this would have been almost unimaginable.\n\"The ultimate aim is to get into the knockout phase and that's what they've done so it's a brilliant night,\" former manager Neil Lennon said on TNT Sports.\n\"Off the back of the heavy defeat in Dortmund, they're unbeaten in the Champions League. For them to bounce back from that was great character and great ability.\"\nThat five-game unbeaten streak has propelled Celtic to qualification with a game to spare, taking the pressure off next week's trip south to face Aston Villa. Victory there could even mean a top-eight finish and direct entry to the last 16.\n\"I couldn't dream that he would get a point away against Atalanta, for example, and that showed really that they've matured,\" said former defender Johan Mjallby.\n\"The balance is better. They know they can't go gung-ho and always on attack. They're a bit better in balancing to keep the ball a bit longer nowadays. That's been a key, especially the way the away form has been very, very good.\"\nOn a similar theme, Rodgers added: \"For us to win it, it shows the maturity and the development of this squad. You've seen where they've come from last season, where we played well but didn't quite get the points.\"\nWhile under-fire Adam Idah played a big part in the goal, the win could also be credited to the heroics of veteran keeper Kasper Schmeichel - who signed a new contract earlier in the day to extend his stay at Celtic Park.\nAs Celtic hit a lull in the second half, the Dane produced a huge double save to keep his side level.\nRodgers paid tribute to his players, saying: \"The idea is to sustain this level over the coming years but we have to make the first steps and qualify and we've been able to do that, which is a fantastic achievement from the players.\"\n\"It's a privilege to be here and manage here. There's been so many critics of Celtic at this level, and there's no doubt it is a challenge at this level, but the players have stepped up. They've been absolutely superb.\"", "url": "https://www.bbc.com/sport/articles/cy08jdjw2wxo"}