{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:07:47", "date_modify": "2025-05-21 06:07:47", "date_publish": "2025-02-08 18:09:52", "description": "Holders Armagh continue the defence of their Division One title with a 0-11 to 2-4 victory against Dublin at Parnell Park.", "filename": "sport_articles_cp8kr288z7zo_1747807667.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1da8/live/02167170-e642-11ef-abf5-19b142cf30ba.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cp8kr288z7zo_1747807667.html", "title": "Dublin 2-4 Armagh 0-11: Orchard County continue winning run with victory against Dublin", "title_page": "Dublin 2-4 Armagh 0-11: Orchard County continue winning run with victory against Dublin - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Holders Armagh continued the defence of their Division One title with a 0-11 to 2-4 victory against Dublin at Parnell Park.\nNiamh Reel managed 0-5 as the Orchard County made it three wins from three in the league campaign.\nArmagh, who beat Kerry and Tyrone in their opening two games, led 0-6 to 1-2 at half-time.\nThe Dubs scored again in the second half, but Armagh held on for the one-point win and a vital three points.\nDarnell Parkinson's side raced into a four-point lead before things went from bad to worse for Dublin as corner-back Jess Tobin was sin binned.\nDespite their numerical disadvantage, Dublin pegged Armagh back as Kate Sullivan rifled home a goal and they scored a point soon after to draw level.\nThe holders scored two late points in the half to edge in ahead by a point at the break, with Reel having kicked 0-4 in the first half.\nAs they did in the first half, the Orchard County rattled off four points in a row to reestablish a commanding lead.\nDublin got their first score of the half on 48 minutes and continued to keep the scoreboard ticking over as they tried to fight back.\nThey reduced the deficit to one point once again as Hetherton found the net on the rebound on 57 minutes, but Armagh clung on for the win.", "url": "https://www.bbc.com/sport/articles/cp8kr288z7zo"}