{"authors": ["Amy Canavan", "www.facebook.com"], "date_download": "2025-05-21 03:53:00", "date_modify": "2025-05-21 03:53:00", "date_publish": "2025-04-07 09:31:13", "description": "Scotland midfielder Caroline Weir talks about being the focus of a new Scottish FA documentary, \"Galactica\", about her move to Real Madrid.", "filename": "sport_football_articles_c2lz9ww5gx0o_1747799580.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7cb1/live/6708e140-1062-11f0-a838-a720bcf3cdb5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c2lz9ww5gx0o_1747799580.html", "title": "Caroline Weir: The story of Scotland's Real Madrid Galactica", "title_page": "Caroline Weir: The story of Scotland's Real Madrid Galactica - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "In the Weir family household, a fence with a painted white goalframe took quite a battering.\nFather Lindsay and mother Mhairi watched from the kitchen window as their four children took turns smacking the ball against the makeshift goal.\nAs young as age four, Lindsay says, one stood out. It was, of course, Caroline.\nWhen not dodging spiteful shots in her direction from her siblings, the Zinedine Zidane Real Madrid shirt-wearing Caroline was practising and perfecting the Marseille turn in her Dunfermline back garden.\nSoon, she would be doing so in grander surroundings at Arsenal, Liverpool, Manchester City and her hero's home of Real Madrid, as well as on the international stage with Scotland.\nShe left Hibernian - and her homeland - as a fresh-faced 18-year-old. A family holiday had been booked, but the midfielder was itching to join up with Shelley Kerr's Arsenal.\nSuch drive and determination has taken her on an wild ride from Pitreavie Park to the Alfredo di Stefano Stadium and, at just 29 years old, her journey is far from over.\nThe many highs, including back-to-back Puskas Award nominations, and the lows - a devastating ACL injury and failing to qualify for the last three major tournaments with Scotland - are all explored in Galactica, the Scottish FA's documentary, external on the wee girl from Dunfermline.\nThe old, grainy family footage of Weir doing keepy-uppies with the number five on her back is proof that, two decades later, she truly is living her life-long ambition.\nSpeaking at the premiere of her movie last week in Edinburgh – fewer than 24 hours after she became Real Madrid women's record goal-scorer as she hit 40 – Weir admitted it's \"weird\" how her dreams have been realised.\nWearing the customised Zidane shirt, which had been embroidered with references to her career – thistles for Scotland, bees for her time in Manchester with City, the midfielder said: \"This is the Zidane top, it was my first-ever football top.\n\"I don't think I ever thought back then that I would be wearing number 10 for Real Madrid and playing against Barcelona, playing in the Champions League and all these big matches.\n\"It's something I dreamed of. I've just been really lucky as well.\"\nGetting to where she is – a 109-time Scotland international and history-maker with Real – has not come without its challenges, though.\nShe had to fight back the tears when recalling her ACL surgery after an injury sustained on Scotland duty in 2023, while mum Mhairi shared the struggles the then-teenager faced settling into London life with Arsenal.\nThe bright light during that period, though, was driving through London in a maroon Fiat Cinquecento – the car from The Inbetweeners - and being questioned on arrival at the training centre due to her young appearance.\nThe documentary does not leave a stone unturned in the life of one of Scotland's true superstars and captures Weir's humility.\nFrom the importance of sourcing the perfect nail salon on her arrival in Spain – look your best to perform your best – to taking in walks with her beloved dachshund, Skye, the modest life in Madrid is shown.\nThat is, until a large storage box appears and she nonchalantly pulls out signed shirt after signed shirt from some of the game's best.\nA Kevin de Bruyne City top. One of John McGinn's Aston Villa numbers - though that was more for super-fan husband Josh.\nOr even a few Andy Murray training tops. They've become pals over the years, obviously. Tucked away in a tub rather than, understandably, on show.\nThere's every chance, though, Weir has forgotten what she's accumulated over the years.\nShe admitted the documentary detailing her life will remind her of moments, goals and games she has lost track of.\n\"It's funny, because you do kind of forget things when you're just in that cycle of football and that's the most important thing – training and performing,\" she said.\n\"I remember when they were filming in October and they were asking me all these different questions. It was sparking so many memories that I'd just kind of forgotten or moved on from.\n\"I'm sure, when I watch it, a lot of it will come back again.\"", "url": "https://www.bbc.com/sport/football/articles/c2lz9ww5gx0o"}