{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:00:30", "date_modify": "2025-05-21 04:00:30", "date_publish": "2025-02-01 15:12:02", "description": "Nottingham Forest 7-0 Brighton: What Morgan Gibbs-White said", "filename": "sport_football_articles_c0lzx1y8kzpo_1747800030.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/939b/live/ca74ac70-e0ae-11ef-a544-6d6714619779.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c0lzx1y8kzpo_1747800030.html", "title": "Nottingham Forest 7-0 Brighton: What Morgan Gibbs-White said", "title_page": "Nottingham Forest 7-0 Brighton: What Morgan Gibbs-White said - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Nottingham Forest captain Morgan Gibbs-White has also been speaking to TNT Sports: \"That's exactly what we wanted after last week, and exactly what the fans wanted. Last week was no way near our standards, we have been working on things to put it right all week in training and the lads were incredible today.\n\"We completely nullified everything they did and caught them a couple of times on the counter-attack. We were clinical in the final third.\"\nOn responding to last week's defeat: \"Last week was really tough to take. We had a clear game plan of what we wanted to do. Fair play to Bournemouth, they nullified us. It was just about using the character and belief in the squad, choosing how we wanted to respond, and choosing which way we wanted to move in the table.\n\"Do we want to crumble or do we want to bounce back? That response today showed exactly where we want to be heading.\"\nOn his involvement in the goals: \"We played five at the back and three in midfield today, so myself and Elliot [Anderson] had a bit more license to roam across the right side, to move higher or deeper to get on the ball.\n\"We had been working on things in training and had found that there was a real gap at the front post. I saw the gap appear, the ball appeared perfectly and I just had to add a little flick on it [to take it in].\"", "url": "https://www.bbc.com/sport/football/articles/c0lzx1y8kzpo"}