{"authors": ["Matthew Henry", "www.facebook.com"], "date_download": "2025-05-21 07:34:25", "date_modify": "2025-05-21 07:34:25", "date_publish": "2025-05-20 14:09:26", "description": "England will introduce minimum fitness standards for their women's players next year, says head coach Charlotte Edwards.", "filename": "sport_cricket_articles_c2d554rek53o_1747812865.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/258c/live/a4d146f0-3580-11f0-9b2c-138cad92aeb3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c2d554rek53o_1747812865.html", "title": "England to introduce minimum fitness standards under coach Charlotte Edwards", "title_page": "England to introduce minimum fitness standards under coach Charlotte Edwards - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England will introduce minimum fitness standards for their women's players next year, says head coach Charlotte Edwards.\nFormer captain Edwards, who will take charge of her first match on Wednesday in a T20 against the West Indies, was appointed last month following this winter's 16-0 Ashes defeat.\nThe team's fitness and athleticism was criticised during the tour and Edwards has said players will be made \"accountable\" on the issue.\n\"The players are very aware there will be minimum fitness standards come this time next year which they will have to adhere to,\" said Edwards.\n\"There has to be more accountability in the area.\n\"But what I will say is I have been so impressed with their standards, the way they have gone about stuff and I couldn't be more impressed in that area.\"\nAfter England's early exit from the T20 World Cup in October, former spinner Alex Hartley said some players were \"letting the team down\" in terms of fitness.\nAthleticism again came into focus during the Ashes, but coach Jon Lewis attributed that to a cultural difference between the UK and Australia. He and captain Heather Knight were sacked after the Ashes defeat.\nEdwards, who captained England more than 200 times, oversaw fitness testing of the players in her first week in the role.\nWhile there were expectations and standards under previous regimes, there was no specific benchmarks players had to hit to be selected.\n\"Clearly we had to touch on the fitness issue,\" Edwards added.\n\"When I came in I said it was all about individual improvement.\n\"Before the World Cup [in India in September] it is about individuals improving as much as they can in that time.\n\"I am not going to set fitness standards [now] because there haven't been any standards in place so I felt I was defeating the object.\"\nEngland's men have had minimum standards in the past but their approach has become more relaxed under captain Ben Stokes and coach Brendon McCullum.\nElsewhere in the women's game, South Africa dropped captain Dane van Niekerk for a home T20 World Cup in 2023 after she failed to meet the required time in the two kilometre run but have since relaxed their rules.\nEdwards also said she is in \"constant communication\" with spinner Sophie Ecclestone, who was left out of the squad to play West Indies as she recovers from injury.\nEcclestone, who refused a TV interview with former team-mate Hartley during the Ashes, has featured in three matches for Lancashire in the past week, having not played for two months following the Women's Premier League.\n\"I have had lots of communication with Soph,\" Edwards said. \"I went up to see her.\n\"When the squad was selected she hadn't played a game of cricket.\n\"Between us both we felt the best preparation for the summer was to go back play for Lancashire and get some cricket under her belt.\"\nThe first of three T20s on Wednesday, which are followed by three one-day internationals from 30 May, are also England's first under captain Nat Sciver-Brunt.\nIn a bid to develop more leaders in the squad, Edwards said England will appoint a leadership group for each series rather than one permanent vice-captain with wicketkeeper Amy Jones, all-rounder Charlie Dean and batter Sophia Dunkley in the role for the Windies T20s.", "url": "https://www.bbc.com/sport/cricket/articles/c2d554rek53o"}