{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:22:11", "date_modify": "2025-05-21 06:22:11", "date_publish": "2025-03-31 14:39:54", "description": "Wayne Rooney on why Liverpool defender Trent Alexander-Arnold would want to join Real Madrid - and how he might even stay at Anfield.", "filename": "sport_football_articles_c4g3e60321po_1747808531.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6a0b/live/fea44660-0d57-11f0-ac9f-c37d6fd89579.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c4g3e60321po_1747808531.html", "title": "Trent Alexander-Arnold transfer: I was tempted by Real Madrid too", "title_page": "Trent Alexander-Arnold transfer: I was tempted by Real Madrid too - Wayne Rooney - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "If Trent Alexander-Arnold does join Real Madrid this summer, fair play to him. I was once tempted to make a big move to Spain myself.\nAlexander-Arnold is 26 and out of contract at the end of the season, so he is in a position where he either commits the rest of his career to Liverpool or decides to go to Real - who clearly want him.\nIf he was to leave Liverpool for any other club you might wonder why, but, because it is Real we are talking about, I don't think you could question it as a career move.\nReal are the biggest club in the world with an incredible history, so it would be a massive opportunity and I'd understand if he felt it was too good to turn down.\nLiverpool are his boyhood club, so I can understand why leaving them is more of a dilemma, but sometimes as a player you have to make these decisions about where your future lies.\nWhen I told Manchester United in 2010 that I did not want to sign a new deal and put in a transfer request, three clubs came in for me.\nManchester City are often talked about as being one of them, but I don't think that was ever an option for me - the teams who made an approach were Chelsea, Real and Barcelona.\nIn my head, I was ready to go and play in Spain and some talks did take place.\nA deal with Real looked more likely for a couple of days but it was Barcelona whom I thought about the most, and how I might fit into their side alongside Lionel Messi, Andres Iniesta, Xavi and Sergio Busquets.\nIn the end I decided to stay at United, but Barca had an incredible team then and any player would have loved to have played in it.\nReal are the same now with superstars like Kylian Mbappe, Jude Bellingham and Vinicius Jr, so of course it must be appealing to Alexander-Arnold to think about playing alongside them - anyone would feel the same.\nHe has been at Liverpool for almost 20 years - since he was six - but the reality is that most players move at some point - that's why there are so few one-club men like Gary Neville and Jamie Carragher.\nI would not blame Alexander-Arnold for wanting to do something a little bit different - like a fresh challenge in a new country - Spain would be a really good move for him.\nWinning trophies was the biggest reason I considered leaving United in 2010. I was about to turn 25 and I was concerned about the direction of the club.\nI don't think anyone could say that's the reason Alexander-Arnold would want to leave Liverpool, because they are on the verge of winning the Premier League.\nHe's had a brilliant time there and has already won everything there is to win.\nIt was a completely different situation for me when I left my boyhood club, Everton, to join United in 2004. I did not want to leave them when I did - I was devastated - but I would have moved on at some point, to try to better myself and win some trophies.\nThat's another reason why Liverpool fans might wonder why Alexander-Arnold might leave now, because he is already doing that with them. But, again, it comes back to experiencing a different culture.\nIf he goes to Real he would be very likely to enjoy even more success in a different country - and have the challenge of not just winning more trophies, but different ones.\nAlso, we are seeing a lot of young English players go abroad and have huge success there, and I am sure Alexander-Arnold has seen how much they enjoy it.\nThe fact he is close to Bellingham would make the move feel easier as well.\nI get why Liverpool fans are upset and even angry at the thought of Alexander-Arnold leaving - all supporters like to see local lads coming through at their club, and they never like to see them being sold.\nI feel like it is the fact he would be going on a free which has upset them the most, but that situation is down to Liverpool as well as Alexander-Arnold.\nWe don't know why his contract has been allowed to run down - or whether that is down to him or the club - but it is something Liverpool have done with Mohamed Salah and Virgil van Dijk this season too, and also in the past with Georginio Wijnaldum and Roberto Firmino.\nNo-one seems to have said much about the other players letting their deals run down, just Alexander-Arnold. I think that's because he's a local lad, which feels a bit unfair.\nAlexander-Arnold has been an excellent servant to the club, so you can't begrudge him wanting to try something new.\nIt would not just be a shame for Liverpool fans if he left because you want to see the best players in the Premier League but, if he does go to Real, I wish him well.\nStill, as I found out myself, just because there are talks over a transfer does not mean it will happen.\nIt is well known that some United fans protested outside my house when they thought I was going to leave in 2010, but I'd agreed my new contract by then.\nAlexander-Arnold has not signed anything with Real yet and it would not surprise me if, even after all this speculation, he ends up staying at Anfield after all.\nA lot can happen before a contract is signed - as I know from experience.\nWayne Rooney was speaking to BBC Sport's Chris Bevan.", "url": "https://www.bbc.com/sport/football/articles/c4g3e60321po"}