{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:39:42", "date_modify": "2025-05-20 13:39:42", "date_publish": "2023-07-26 08:05:18", "description": "Benfica 0-2 Burnley: Vincent Kompany reaction", "filename": "sport_articles_cd1z241l8jlo_1747748382.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ca37/live/b489c090-2b87-11ee-8c0b-459d40177172.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cd1z241l8jlo_1747748382.html", "title": "Benfica 0-2 Burnley: Vincent Kompany reaction", "title_page": "Benfica 0-2 Burnley: Vincent Kompany reaction - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Vincent Kompany was delighted after Burnley made it five pre-season wins out of five with an impressive 2-0 victory over Portuguese giants Benfica in Lisbon.\nOwen Dodgson and Hjalmar Ekdal got the goals as the Clarets' preparations for the new Premier League season continue to gather pace.\n\"We were obviously playing against a team with so much talent,\" he told the club's Twitter feed, external. \"When they were good on the ball, we were extremely aggressive and extremely brave without dropping our standards on the ball.\n\"As much as we could, we made it difficult for them high up the pitch and that is what you have to when you face these teams.\n\"We did what the game demanded when it ramped up physically.\n\"When you see our scorers, maybe you think it was two set-piece goals - but they were both well worked in open play and I am really happy.\"\nBurnley head to Spain for the next part of their pre-season tour and will play Real Betis on Friday (18:30 BST kick-off).\n\"We are not focusing on too much other than fitness,\" Kompany added. \"Making sure the new lads blend in and understand what we do. That's the priority.\n\"The biggest challenge is to not have any gaps - to make sure the team is one team at all times in every phase.\"", "url": "https://www.bbc.com/sport/articles/cd1z241l8jlo"}