{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:31:36", "date_modify": "2025-05-20 12:31:36", "date_publish": "2023-07-24 14:05:03", "description": "Worcestershire batter Jack Haynes agrees to join Nottinghamshire on a three-year deal at the end of the season.", "filename": "sport_cricket_66291730_1747744296.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/12A2A/production/_130503367_shutterstock_editorial_12916715af.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66291730_1747744296.html", "title": "Jack Haynes: Worcestershire batter agrees Nottinghamshire move", "title_page": "Jack Haynes: Worcestershire batter agrees Nottinghamshire move - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Worcestershire batter Jack Haynes has agreed to join Nottinghamshire on a three-year deal at the end of the season.\nThe 22-year-old made his debut for the Pears in 2019 and has an average of 36 in first-class cricket from 41 games, including four hundreds.\nIn List A cricket, the right-hander averages just under 43, and has a T20 strike rate of more than 143.\n\"I'm really excited to move to Nottinghamshire,\" Haynes said.\n\"Trent Bridge is always a place I've loved coming to as a player; the club has a great feel about it, and the facilities and pitch are conducive to helping me develop as a cricketer.\"\nHe becomes the third player to confirm a move from New Road to Trent Bridge next season after paceman Dillon Pennington and England fast bowler Josh Tongue also signed three-year deals.\n\"I'm under no illusion that it'll take hard work to nail down a place in the side and continue to grow in all formats, but Notts have a track record of taking on players and improving them to help them reach their potential,\" Haynes added.\nEarlier this month, Haynes made two half-centuries for England Lions against Sri Lanka, a tour which was led by Nottinghamshire opener Haseeb Hameed.\n\"Jack is already a good player, though it his hunger to move his game forward that really excites me,\" said Nottinghamshire head coach Peter Moores.\n\"As a top order batter in all formats he will strengthen our batting unit as well as adding healthy competition.\"", "url": "https://www.bbc.com/sport/cricket/66291730"}