{"authors": ["Matthew Henry", "www.facebook.com"], "date_download": "2025-05-21 06:57:02", "date_modify": "2025-05-21 06:57:02", "date_publish": "2025-01-22 16:34:55", "description": "England fall to a crushing seven-wicket defeat by India in Kolkata in their first T20 under Brendon McCullum.", "filename": "sport_cricket_articles_c98y9lprdqgo_1747810622.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/25c2/live/793fccc0-d8d6-11ef-86b5-b74cbf3823dc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c98y9lprdqgo_1747810622.html", "title": "England in India: Brendon McCullum's side thrashed in first T20 of new era", "title_page": "England in India: Brendon McCullum's side thrashed in first T20 of new era - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England's new era in white-ball cricket under Brendon McCullum began with a crushing defeat against world champions India as familiar frailties against spin resurfaced in the first T20 in Kolkata.\nAfter seamer Arshdeep Singh dismissed Phil Salt for a three-ball duck and Ben Duckett in his first two overs, the middle order fell in a sorry heap against India's spinners and England were bowled out for 132.\nCaptain Jos Buttler played a lone hand with 68 from 44 balls but Harry Brook was the next highest scorer with 17.\nBrook was bowled in the eighth over by the superb Varun Chakravarthy, who then dismissed Liam Livingstone for a duck two balls later as England's scoring stalled and wickets tumbled.\nJacob Bethell struggled for seven from 14 balls, Jamie Overton managed only two at number seven and Gus Atkinson fell to England's old foe Axar Patel for a painful two from 12 balls.\nChakravarthy returned to dismiss Buttler in the 17th over - ending England's hope of a big finish as he claimed figures of 3-23.\nJofra Archer impressed with 2-21 in India's chase but the hosts still romped to a seven-wicket victory with 43 balls to spare - England's heaviest T20 defeat in terms of deliveries remaining.\nAtkinson conceded 23 in the second over and Abhishek Sharma crashed 79 from 34 balls with the pressure released.\nThe second T20 in the five-match series is on Saturday in Chennai at 13:30 GMT.\nAfter his transformative impact on the Test side, McCullum's arrival as white-ball coach has been highly anticipiated, with England hoping he can revitalise a team that has lost its way in giving up two world titles in the last two years.\nThe attacking approach instilled by the New Zealander has drawn criticism at times. This, though, was a result of England's oldest weakness, rather than any tactical misstep.\nWhile left-arm seamer Arshdeep struck twice early on, it was spin that brought their collapse from 65-2 in the eighth over.\nOnly Buttler, who was at his classy rather than inventive best in striking eight fours and two sixes, seemed able to pick Chakravarthy's mystery.\nBrook and Livingstone were bowled by his googlies and afterwards the only boundaries were hit by England's skipper until one by Adil Rashid in the 19th over.\nBethell and Atkinson, in particular, chewed up deliveries and were unable to give Buttler the strike. Overton was caught and Atkinson stumped off left-arm spinner Axar, who backed up Chakravarthy with 2-22.\nThe ground fielding and catching was also high-class by a youthful India, without many of their big names from last year's World Cup win.\nMark Wood was run out off the last ball of the innings and England were never going to have enough on a decent pitch.\nEngland captain Jos Buttler: \"There was a little bit in the wicket early on and we probably didn't expect that. They found some movement and we lost wickets.\n\"We wanted to enforce the game we want to play. We were not quite capable of doing that against good bowlers but we are better for the run out and look forward to the next one.\"\nIndia captain Suryakumar Yadav: \"The way we started after winning the toss set the benchmark. We took it from there. All of the bowlers had good plans. The way we batted was the icing on the cake.\"\nIndia spinner Varun Chakravarthy: \"I am used to seeing such pitches in the IPL.\n\"There is a length that I bowl where it will be helpful. I am trying to keep it away from their arc.\"", "url": "https://www.bbc.com/sport/cricket/articles/c98y9lprdqgo"}