{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:56:52", "date_modify": "2025-05-20 13:56:52", "date_publish": "2023-07-31 06:00:35", "description": "Before The Hundred returns on 1 August, BBC Sport have worked with data analysts CricViz to assess how the eight women's teams are shaping up.", "filename": "sport_cricket_66317250_1747749412.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2DE8/production/_130525711_-18a6750d-18dd-4d58-87a9-26c76f037949.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66317250_1747749412.html", "title": "The Hundred 2023: How are the women's teams shaping up for the new tournament?", "title_page": "The Hundred 2023: How are the women's teams shaping up for the new tournament? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The third season of The Hundred starts on Tuesday with familiar faces returning to their sides and some joining new teams.\nBBC Sport asked data analysts CricViz to assess the strengths and weaknesses of the eight teams in the women's competition.\nThey have also looked at how each squad may be used throughout a game and the tournament to get you prepared for the four weeks ahead.\nPhoenix will be hoping to improve on their near misses from previous editions of The Hundred, after finishing third and fourth.\nRetaining fit-to-bowl-again Sophie Devine is a huge plus for Phoenix but losing a rejuvenated Ellyse Perry, who would have led from the front with bat and ball and brought top-class international quality, to a knee injury is a huge blow.\nPerry has been replaced by fellow Australia all-rounder Tess Flintoff, 20, while Eve Jones will now captain Phoenix.\nEngland players Amy Jones and Issy Wong provide more quality, with the latter likely to be used as a new-ball option in search of wickets to get the Edgbaston crowd fired up.\nJones offers arguably the best gloves in the game and will likely buy Phoenix some wickets other keepers may not get close to.\nErin Burns will provide controlled slower bowling for the Phoenix and, combined with the quality wrist spin of Scotland's Abtaha Maqsood, will have both bases covered in terms of spin should the Edgbaston wickets offer turn.\nWith the second pick in the draft, Spirit opted to choose hard-hitting Australia all-rounder Grace Harris for her first taste of Hundred cricket.\nHarris' boundary percentage is 18.66 in T20s and she will add some devastating ability to the engine room of Heather Knight, Amelia Kerr and Richa Ghosh, making Spirit's batting - on paper - one of the more formidable line-ups.\nSpirit are boosted by the acquisition of breakout Ashes star Lauren Filer, who will bring some much-needed speed to the bowling. Along with the left-arm threat of American Tara Norris and all-round talent of Danielle Gibson, Filer, who took four wickets in the Ashes Test, will provide good variety to the seam attack.\nArguably, however, Spirit's strongest aspect of their squad composition is their spin attack, led by England duo Sarah Glenn and Charlie Dean and bolstered by the all-round talents of Kerr.\nThey have every base covered in this sense with a mixture of wrist and finger spin, and both attacking and defensively minded bowlers. Although not traditionally a happy hunting ground for spinners, should any pitches at Lord's offer turn, expect Spirit to be very difficult to beat at home.\nWith the third pick in the draft, Manchester Originals opted for elegant South African batter Laura Wolvaardt, whose cover drive is sure to draw admiration at Old Trafford when coupled with the brutal ball-striking of West Indies' Deandra Dottin.\nEngland Test opener Emma Lamb will be expected to do a lot of the heavy lifting with the bat, as the only other frontline batter with top-level international experience.\nThe Originals will be strong in the spin bowling department, with the world's best women's bowler Ecclestone leading the attack, paired with The Hundred's leading wicket-taker Amanda-Jade Wellington, who has joined from Southern Brave. Wellington has taken 31 wickets in two years, including a tournament-high 17 in 2022.\nPace bowling remains an issue though. Katie George adds quality to the line-up alongside the emergence of 17-year-old Mahika Gaur who is an exciting prospect on the fast and bouncy pitches in Manchester.\nHowever, with questions over Dottin's fitness to bowl, Originals may find themselves searching for quality bowling options as the tournament goes on.\nSuperchargers had elected to go for an all-Australia overseas trio, with stand-in captain Alyssa Healy and all-rounders Heather Graham and Georgia Wareham providing a multitude of high-level skills in all departments.\nHowever Healy and Graham have been forced to pull out through injury and are replaced by Australia batter Phoebe Litchfield and India's Jemimah Rodrigues.\nLitchfield, 20, is an extremely talented prospect but potentially lacks the power, and certainly the experience, of Healy, while Rodrigues does not offer the same all-round game that Grahm would have.\nThe most significant domestic recruitment has been the capture of England seam bowler Kate Cross, who is making a cross-Pennine switch from the Originals to a ground which has traditionally favoured seam bowlers.\nEngland fringe player Alice Davidson-Richards has had a brilliant couple of years - taking 14 wickets and scoring 131 runs in The Hundred - and will be looking to add quality with bat and ball to an inexperienced line-up.\nThe recent development of Wareham's power game - she hit 26 off one Lauren Bell over in the Ashes - may give Superchargers an edge and the late-innings momentum they need to make the difference in the closer matches.\nOpting for continuity leading into this year's competition, the Invincibles have re-signed Suzie Bates and skipper Dane van Niekerk in the draft and retained almost all of the squad which delivered back-to-back titles.\nThe loss of Shabnim Ismail to Welsh Fire will be sorely felt, coupled with the prolonged injury to Tash Farrant. It means extra responsibility will be placed on the shoulders of all-rounder Marizanne Kapp in the pace bowling department. She had a stellar Women's Premier League (WPL) with the ball - taking nine wickets at just 5.72 runs per over - and shows no sign of slowing down at 33.\nPoster child of The Hundred, 18-year-old superstar Alice Capsey, will be key with both bat and ball, having excelled yet again in international cricket and in the WPL for the Jon Batty-led Delhi Capitals. Her aggressive brand of cricket will be an essential part of the Invincibles' make-up.\nEngland's Lauren Winfield-Hill is enjoying a white-ball renaissance at the back end of her career and will look to set a strong platform for her team at the top of the order.\nThe Invincibles will be the side to beat yet again as they look to build the tournament's first dynasty.\nTrent Rockets have arguably the in-form batter in the world in Nat Sciver-Brunt - the England all-rounder has taken her game to another level this year for her country and also Mumbai Indians in the WPL.\nHarmanpreet Kaur captained champions Mumbai and should slot in alongside Sciver-Brunt in the middle of the order, with Lizelle Lee and Bryony Smith charged with getting the Rockets off to a quick start.\nNat Sciver-Brunt will also be vital for the Rockets with the ball alongside Katherine Sciver-Brunt and leg-spinner Alana King, who returns to the side after taking a hat-trick in Rockets colours at Old Trafford last season.\nLeft-arm spinner Kirstie Gordon and right-arm quick Grace Potts were mid-priced picks for the Rockets and could be valuable in complementing the star trio of bowlers at the Rockets in 2023.\nFire opted for Sophia Dunkley with the first pick during the draft in March. The England opener had plenty of success opening the batting for Southern Brave - scoring 437 runs in two seasons - but will have to adapt to the challenge of batting at the often bowler-friendly Sophia Gardens.\nFellow England opener Tammy Beaumont joins Dunkley, Hayley Matthews and Laura Harris to provide a power-packed batting line-up that should perform better after struggling last year.\nThe fastest bowler in the world and two-time Hundred winner Shabnim Ismail moves across from Oval Invincibles to bring some heat to the Fire bowling.\nLeft-arm spinner Alex Hartley and off-spinner Hayley Matthews are both capable of bowling at the top of the innings, and at the death, and bring added flexibility to the Fire attack.\nThe likes of Freya Davies, Georgia Elwiss and Emily Windsor all provide valuable skills alongside the Fire's big names.", "url": "https://www.bbc.com/sport/cricket/66317250"}