{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:40:33", "date_modify": "2025-05-21 06:40:33", "date_publish": "2025-03-31 06:40:45", "description": "Scotland winger Ben Doak is linked with a controversial £25m move from Liverpool to Everton, according to reports.", "filename": "sport_football_articles_c99p0zmx84yo_1747809633.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/09fb/live/21310090-0dfa-11f0-ba12-8d27eb561761.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c99p0zmx84yo_1747809633.html", "title": "Scottish gossip: Ben Doak linked with £25m Everton switch", "title_page": "Scottish gossip: Ben Doak linked with £25m Everton switch - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Scotland winger Ben Doak is linked with a controversial £25m move, while Rangers defender Ben Davies discusses his future.\nEverton are plotting a shock £25m move to sign Liverpool's Scotland winger Ben Doak, 19, who is currently on loan at Middlesbrough. (Scottish Sun, external)\nRangers defender Ben Davies, currently on loan at Birmingham City, admits he will consider all his options in the summer (Daily Record), external.\nViljami Sinisalo has assured Celtic boss Brendan Rodgers he's ready for a long run as the club's goalkeeper in the absence of injured Kasper Schmeichel (Scottish Sun), external.\nMotherwell midfielder Andy Halliday insists Aberdeen striker Pape Gueye's challenge on him would have been a red card 30 years ago and believes VAR should have intervened (Daily Record), external.\nScotland midfielder Billy Gilmour started and excelled in Napoli's crucial win over AC Milan, but Scott McTominay missed out through illness (Scotsman), external.\nJim Goodwin has singled out Vicko Sevelj for praise after the versatile Dundee United ace produced a marvellous showing at the heart of defence in Dingwall (Courier), external", "url": "https://www.bbc.com/sport/football/articles/c99p0zmx84yo"}