{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:50:39", "date_modify": "2025-05-21 05:50:39", "date_publish": "2025-01-14 11:36:16", "description": "New Ireland under-20 head coach Neil Doak includes five Ulster players in his squad for the upcoming Six Nations.", "filename": "sport_articles_cvge712y9nvo_1747806639.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d6b0/live/8c4a54f0-d26b-11ef-9dbb-9559c8b74d9b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cvge712y9nvo_1747806639.html", "title": "Under-20 Six Nations 2025: New Ireland head coach Neil Doak names squad", "title_page": "Under-20 Six Nations 2025: New Ireland head coach Neil Doak names squad - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "New Ireland under-20 head coach Neil Doak has included five Ulster players in his squad for the upcoming Six Nations.\nForwards Connor Magee, Tom McAllister and Henry Walker and backs Daniel Green and Clark Logan are included in the 31-man panel.\nDoak was named under-20 boss in December, succeeding another former Ulster player Willie Faloon, who had led the team to the semi-finals of World Rugby Under-20 Championship last summer.\nConnacht back row Eanna McCarthy will captain the squad, which features six returning players: Walker, Alex Usanov, Alan Spicer, Mikey Yarr, Billy Corrigan and Will Wootton.\n\"We have been working hard for a number of weeks and it's an exciting time for these young players, who have the honour of representing the wider group in the Six Nations,\" said Doak.\n\"We, as coaches, have pushed the players over the last number of months and I have been impressed by their work-rate, commitment, and application.\n\"Now our focus turns to performance and the opening game against England, which we know will be a big challenge first up.\"\nHaving relinquished their title to England last year, Ireland host the holders in the opening round on 30 January. Ireland then travel to Wales and Scotland and host France before the final game away to Italy.", "url": "https://www.bbc.com/sport/articles/cvge712y9nvo"}