{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:13:08", "date_modify": "2025-05-21 05:13:08", "date_publish": "2025-04-05 00:00:00", "description": "Cardiff City remain in the Championship relegation zone despite earning a point at out-of-form Queens Park Rangers at Loftus Road.", "filename": "sport_football_live_cwynl3zg0nqt_1747804388.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cwynl3zg0nqt_1747804388.html", "title": "QPR 0-0 Cardiff: Bluebirds remain in relegation zone despite earning point", "title_page": "QPR 0-0 Cardiff: Bluebirds remain in relegation zone despite earning point - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cardiff City remain in the Championship relegation zone despite earning a point at out-of-form Queens Park Rangers as the two sides played out a tight and tense 0-0 draw.\nCardiff did not register an effort on target at Loftus Road until the 71st minute and rarely threatened in a contest the hosts will feel they should have won.\nQPR's poor recent form was evident as the football did not match the sunshine, with Paul Smyth coming closest to producing a winner with a late effort that was saved by Cardiff goalkeeper Ethan Horvath.\nCardiff remain in the Championship relegation zone in 22nd spot, losing ground on Stoke and Hull, but thankful to their rivals Swansea who ended Derby's winning run and ensured the Bluebirds remain level on points with the side directly above them.\nThe Bluebirds made the worst start to a league season in their history and have been playing catch-up ever since, never fully able to pull away from the Championship's relegation battle.\nCardiff re-entered the bottom three after Derby's midweek win over Preston and headed to London with key midfielders Aaron Ramsey and Joe Ralls injured and ruled out for the remainder of the campaign.\nThe Bluebirds tend to find London life tough, having won just four of the last 41 league games in the English capital, but they could at least be buoyed by QPR's rotten recent form, having lost eight of their last 11.\nQPR looked outside bets for a play-off spot at the turn of the year, but have slipped away alarmingly and both clubs would have earmarked this as an especially important fixture.\nA cagey start was no surprise with the stakes high, but the hosts began to exert themselves and Paul Smyth forced Cardiff goalkeeper Ethan Horvath to save with a powerful 25-yard effort, while at the other end Rubin Colwill's powerful shot from distance whistled past the post.\nCardiff were relieved to see QPR's penalty appeals waved away after Alfie Lloyd went down under Sivert Mannsverk's heavy challenge, while Smyth also headed over from Kenneth Paal's precise cross.\nThe Bluebirds failed to register a shot on target in the first half and boss Omer Riza reacted with a triple substitution at the break and Cardiff did show more enterprise with striker Yousef Salech seeing a penalty appeal waved away.\nSalech fired just over the crossbar after exchanging passes with sub Callum Robinson, but Hoops goalkeeper Paul Nardi still had not been forced to make a save until he comfortably stopped Salech's long-range effort on 71 minutes.\nSubstitutes Ollie Tanner and Yakou Meite both fired wide as Cardiff looked for a smash-and-grab victory and Smyth's clever turn and shot on 84 minutes almost gave QPR a winner, but Horvath produced an excellent save to deny him.\nA frantic finish, out of keeping with the rest of the contest where quality was in short supply, saw Cardiff come close to a winner through Meite, but he failed to find the target, heading over from Callum O'Dowda's cross.\nQueens Park Rangers boss Marti Cifuentes said:\n\"I think in the first half we were perhaps slightly better than Cardiff.\n\"The feeling at half-time was that we needed – especially in a game like this with two teams not in the best moment of the season – to score the first goal of the game, but to not lose the game.\n\"In the second half Cardiff got a bit more energy off the bench... in the end it is a fair result.\n\"We are struggling with the options that we have in attacking positions, we need to give credit, because we have an honest group of players trying to do their best.\nCardiff City boss Omer Riza told BBC Radio Wales Sport:\n\"It was a difficult game, especially first half I thought QPR were really aggressive, they showed intent to pick up first and second balls well and we didn't do that too well in the first half.\n\"We went in 0-0 at least, so we were at least solid to not concede and in the second half I thought it was a better half from us and we created a few more chances and opportunities.\n\"We just didn't quite create those clear-cut opportunities we needed to finish the game off.\n\"In general we dealt with some of their directness at times and we take a point.\"", "url": "https://www.bbc.com/sport/football/live/cwynl3zg0nqt"}