{"authors": ["Simon Stone", "Sami Mokbel", "www.facebook.com"], "date_download": "2025-05-21 04:40:52", "date_modify": "2025-05-21 04:40:52", "date_publish": "2025-04-03 09:03:25", "description": "BBC Sport is told by the Premier League's refereeing body that James Tarkowski should have been sent off for his tackle on Alexis Mac Allister during Everton's defeat at Liverpool.", "filename": "sport_football_articles_cr5dm1gny9ro_1747802452.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/76cd/live/5f2bfe80-1067-11f0-93d7-a3dd8019c0be.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cr5dm1gny9ro_1747802452.html", "title": "James Tarkowski: Everton defender should have been sent off against Liverpool, PGMOL says", "title_page": "James Tarkowski: Everton defender should have been sent off against Liverpool, PGMOL says - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "James Tarkowski should have been sent off during Everton's defeat at Liverpool, the Premier League's refereeing body has acknowledged.\nTarkowski won the ball but caught Liverpool midfielder Alexis Mac Allister just below the knee with his studs in the 11th minute of the Merseyside derby at Anfield.\nThe Everton centre-back was shown a yellow card and the video assistant referee (VAR) decided to take no further action after a review.\nBut BBC Sport has been told by the Professional Game Match Officials Limited (PGMOL) the tackle met the threshold for serious foul play.\nThe view of PGMOL is that an on-field review should have been recommended to referee Sam Barrott and ultimately the original decision overturned.\nReferee Barrott felt the challenge was reckless in real time and VAR Paul Tierney deemed that call not to be a clear and obvious error.\nLiverpool have been contacted by the PGMOL about the matter.\nSpeaking on Thursday, Liverpool boss Arne Slot said: \"It is always good that if they think they have made a mistake, they acknowledge that.\n\"I think it is quite an OK season for referees in England, actually. Mistakes are being made, the most important thing is that it doesn't influence the league table, but it is normal that it does.\"\nEverton manager David Moyes admitted Tarkowski was fortunate to stay on the pitch, and the centre-half apologised to Mac Allister at full-time.\nThe PGMOL says it wants to operate in a transparent way by admitting mistakes, and felt the incident needed to be addressed immediately, rather than waiting for referees' chief Howard Webb's next 'Match Officials Mic'd Up' appearance., external\nAnother contentious incident was Diogo Jota's winning goal on Wednesday, with Everton claiming an offside in the build-up.\nTarkowski slid in to intercept a pass towards Luis Diaz, who was stood in an offside position - but the PGMOL agreed with the decision to award the goal, with the Liverpool attacker ruled not to have been affecting the game.\nIn an update on 4 February, the Premier League said there had been 13 VAR mistakes this season, which was down from 20 at the same point last season.\nThose mistakes were four incorrect VAR interventions and nine missed interventions from the first 23 rounds of games.\nThe update said the rate of VAR interventions was averaging around one in every three matches at the start of February.\nThe league also claimed the accuracy of 'Key Match Incidents' was at 96.4% - up from 95.7% at the corresponding point last season.", "url": "https://www.bbc.com/sport/football/articles/cr5dm1gny9ro"}