{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:44:20", "date_modify": "2025-05-21 06:44:20", "date_publish": "2025-01-31 09:32:51", "description": "Everton captain Megan Finnigan has an anterior cruciate ligament knee injury and is set to miss the rest of the season.", "filename": "sport_football_articles_c4gw99x3g55o_1747809860.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/58ae/live/4cc6f7b0-dfb4-11ef-819e-d1f2ca20e9fa.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c4gw99x3g55o_1747809860.html", "title": "Megan Finnigan: Everton captain suffers ACL injury", "title_page": "Megan Finnigan: Everton captain suffers ACL injury - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Everton captain Megan Finnigan is set to miss the rest of the season because of an anterior cruciate ligament knee injury.\nThe English defender went down in the opening 10 minutes of Everton's 2-0 win over Tottenham Hotspur in the FA Cup fourth round on Wednesday.\n\"A scan confirmed Finnigan's injury and the 26-year-old will now have rehabilitation under the care of our medical team,\" an Everton statement read.\n\"Everyone at Everton is thinking of Meg and wishes her all the best with her recovery.\"\nEverton lost two players to the same type of injury in their opening two Women's Super League games of the season - Inma Gabarro and Aurora Galli.\nFinnigan has played in all 12 of Everton's WSL games this season and the club sit 10th, five points clear of bottom-placed Crystal Palace.\nShe has been at the Toffees since the age of nine and is Everton's longest-serving player.\n\"Meg is tough but of course she's devastated. We all are,\" manager Brian Sorensen said on Friday morning.\n\"In the three years I've been here we hadn't had any [ACL injuries] until this season, and this is number three so it's not ideal.\n\"From a playing point of view, we will manage. It's definitely not ideal to lose your captain but we'll manage. It's probably more around mentality and what she means to the squad.\"", "url": "https://www.bbc.com/sport/football/articles/c4gw99x3g55o"}