{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:42:36", "date_modify": "2025-05-21 07:42:36", "date_publish": "2025-01-22 10:06:10", "description": "Stevenage boss Alex Revell is excited at facing Birmingham City in the EFL Trophy quarter-finals and the return of three players.", "filename": "sport_football_articles_c62eng5p2vvo_1747813356.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b915/live/fa5d6120-d8a2-11ef-993a-9dfb304c6a75.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c62eng5p2vvo_1747813356.html", "title": "Alex Revell: Stevenage boss excited by Birmingham EFL Trophy tie", "title_page": "Alex Revell: Stevenage boss excited by Birmingham EFL Trophy tie - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Stevenage boss Alex Revell is excited at the prospect of taking on Birmingham City in the EFL Trophy quarter-finals following their 1-0 win at Leyton Orient.\nBoro have yet to face the big-spending League One leaders this season but will have home advantage for the last-eight tie next month.\nAnd there was more good news with Luis Appere and Dan Sweeney starting a game for the first time since August and defender Charlie Goode playing the entire match on his return from a broken leg.\n\"We haven't played them yet and now it's going to be three times in the next couple of months. But we'll get to that when it comes,\" Revell told BBC Three Counties Radio.\n\"These cups are important for the club to progress and we want to keep going, we want to get to that grand stage (at Wembley), of course we do, and more performances like that will get us there for sure.\"\nAn own goal was enough to give Stevenage victory over Orient and Revell said the only negative was that his side should have scored more.\nBut he was delighted by the performances of the players returning from injuries, giving more competition for places for their League One campaign.\n\"Players have to feel people behind them and those that are in the team have to make sure their performances are up to the level because otherwise (other) players come in,\" he said.\n\"Luis was relentless and now Jamie Reid knows he's coming back - and that's great because that gets the best out of Jamie Reid.\n\"[Dan Sweeney and Charlie Goode] are both competing for the same position but when they get on the pitch together, they put on a terrific performance.\"\nGoode had not played for the first team since suffering his broken leg in a 2-0 defeat by Exeter City on 21 September - only his sixth appearance for the club.\nAnd he told BBC Three Counties Radio that his return to action had been \"a long time coming\".\nThe 29-year-old said: \"It's been a long way back, I've worked really hard. I've done everything I can to be back as quick as this. And when you come back and win, with a clean sheet, it's worth the wait.\n\"I've felt ready for it for a couple of weeks and to do it in a competitive game like that, I'm raring to go now. I've been desperate to help the boys and now I can, I'm buzzing to be back.\"\nStevenage are currently 16th in League One and are away to play-off chasing Barnsley on Saturday, before travelling to north Wales to face third-placed Wrexham next Tuesday.", "url": "https://www.bbc.com/sport/football/articles/c62eng5p2vvo"}