{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:36:57", "date_modify": "2025-04-26 03:36:57", "date_publish": "2025-03-08 00:00:00", "description": "Chesterfield battle back to see off visitors Newport County in League Two.", "filename": "sport_football_live_cdxqvxxpd05t_1745638617.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/438e/live/f02b6db0-fc3c-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_cdxqvxxpd05t_1745638617.html", "title": "Chesterfield 2-1 Newport County: Hosts fight back to win", "title_page": "Chesterfield 2-1 Newport County: Hosts fight back to win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Chesterfield fought back to see off visitors Newport County in League Two.\nMatt Baker hit home from close range off James Clarke's header to break the deadlock in the 40th minute.\nNewport's lead was short-lived as Ollie Banks also struck from close range with the build up also featuring a headed pass, this one from Tom Naylor.\nAnd the hosts went into the lead before the break as Aribim Pepple, the assist again headed on, albeit via Ashley Palmer from a corner.\nThe win took Chesterfield up two places to 15th while Newport drop a spot to 17th.\nNewport boss Nelson Jardim:\n\"We knew it was going to be a tough game. I thought first half was, to be fair, quite even in terms of opportunities. I think the best one was when we scored and then we conceded two soft goals.\n\"And this is happening, that lack of consistency, especially away games and I've told them, we need to grow up, toughen up and we cannot give the excuse that the fact that we are young team.\n\"We cannot be because they are growing, they are older now and we have to stop that.\n\"So moving into the second half we tried a couple of things. We improved for long spells. I think we created not as much as we as we wanted, but again, I think when you concede two goals just before half time like that, it just sets the tone for the second half.\"", "url": "https://www.bbc.co.uk/sport/football/live/cdxqvxxpd05t"}