{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:45:09", "date_modify": "2025-05-21 07:45:09", "date_publish": "2025-01-13 14:22:55", "description": "'Organised' Tobers contributes to 'better collective performance'", "filename": "sport_articles_cd64v0jq4q1o_1747813509.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8ebd/live/a1aa4420-d1b9-11ef-8a2a-b1f18b093115.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cd64v0jq4q1o_1747813509.html", "title": "'Organised' Tobers contributes to 'better collective performance'", "title_page": "'Organised' Tobers contributes to 'better collective performance' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "\"Calm\" Kristers Tobers impressed manager Jimmy Thelin on his Aberdeen debut, but the Dons \"must be careful\" with the Latvia captain.\nTobers played 66 minutes against Hearts on Sunday in what was his first match since playing for previous club Grasshoppers five weeks ago.\nThe 24-year-old was enjoying a winter break before joining the Pittodrie club last week, but he didn't look like a player who's been out in the cold recently.\n\"I think Kristers did really well,\" said Thelin after the 0-0 draw. \"He is a calm player, he can organise a team.\n\"We have to have in mind that we also have to take him off because he has come in from a between season (winter break in Switzerland) where he didn't train so much.\n\"We have to be careful about him, but in a new team, after one-and-a-half training sessions and he did that performance. It was really good.\"\nThelin's side are back in action away to Rangers on Wednesday and although they remain without a win in 11 matches, he is hoping the clean sheet and the fact they halted a five-game losing run on Sunday, can boost the morale of his squad.\n\"It's been a while, so it's important to have that feeling,\" he said of the clean sheet. \"Especially the goals we get against us in the last couple of games is too easy.\n\"We were focused on being better collectively and it's important to have a clean sheet because it gives us a chance to win a game.\n\"It's difficult if you always get two goals against you and you have to score three to win and then create the stress. It was good to have a clean sheet and also use the positive parts like we stopped losing games.\"", "url": "https://www.bbc.com/sport/articles/cd64v0jq4q1o"}