{"authors": ["Stephan Shemilt", "www.facebook.com"], "date_download": "2025-05-19 14:40:53", "date_modify": "2025-05-19 14:40:53", "date_publish": "2017-07-28 18:07:41", "description": "Ben Stokes hits a century and Toby Roland-Jones takes a sensational 4-39 as England seize control of the third Test against South Africa.", "filename": "sport_cricket_40758314_1747665653.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1775B/production/_97119069_stokesreport.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_cricket_40758314_1747665653.html", "title": "England v South Africa: Ben Stokes & Toby Roland-Jones put hosts on top", "title_page": "England v South Africa: Ben Stokes & Toby Roland-Jones put hosts on top - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ben Stokes struck a sparkling century and debutant Toby Roland-Jones took a sensational 4-39 as England seized control of the third Test against South Africa on day two at The Oval.\nStokes' flawless 112, which included three successive sixes in the course of bringing up three figures, helped the hosts to 353 all out.\nRoland-Jones then ripped through the South Africa top order as the Proteas slumped to 61-7 before closing on 126-8, still 28 runs shy of the follow-on target.\nThough the weather forecast is mixed for the weekend, Joe Root's men look set to take a 2-1 lead in the four-match series.\nThat would represent another familiar swing in the fortunes of the England side, who won handsomely at Lord's only to be annihilated at Trent Bridge.\nSouth Africa were hampered by the absence of Vernon Philander, the pace bowler sent to hospital after a stomach complaint worsened, while their batting was decimated in ideal conditions for pace bowling.\nPhilander will spend Friday night on a drip and is unlikely to play any part on Saturday.\nFast bowler Roland-Jones, 29, made his one-day international debut in May and got the chance for a first Test cap after an injury to Mark Wood.\nA batsman as a youngster at Middlesex, he was persuaded to take bowling more seriously by former England international Angus Fraser and sealed last season's County Championship with a hat-trick against Yorkshire.\nTall, broad and with a long, languid approach, he exploited the dark, damp conditions by moving the ball in the air and occasionally extracting spitting bounce at speeds of just over 80mph.\nDean Elgar was caught behind, Heino Kuhn trapped lbw playing across the line and Hashim Amla gloved a brutal delivery that reared towards his throat.\nWhen Quinton de Kock was caught at gully off a leading edge, Roland-Jones had taken 4-15 in 24 balls.\nJames Anderson then got in on the act, with Faf du Plessis lbw offering no stroke and Chris Morris, who earlier struggled with the ball, caught and bowled.\nStokes had a wafting Keshav Maharaj caught at first slip as South Africa faced the indignity of following-on before the close.\nTemba Bavuma could have been given out caught off an inside edge from his first ball, delivered by Roland-Jones, but added 53 with Kagiso Rabada.\nWith Philander absent, England had about six minutes to take the ninth and final wicket, but Morne Morkel accompanied Bavuma to the close.\nEx-South Africa skipper Graeme Smith: \"Ben Stokes' innings was one of the best innings you'll see. He showed poise and determination on the first day, and he's got his side into a really good position today.\"\nFormer England captain Michael Vaughan: \"Stokes has played some real quality innings but I don't remember seeing him batting in such a mature way, to leave so many balls and wait for a straight one or a short one.\n\"It was full of determination and the way England batted in the first innings is exactly the way I expect to see them bat on a regular basis.\"\nEngland's Toby Roland-Jones told BBC Sport: \"It was a pretty special day, we wanted to push ourselves as high as possible in some testing conditions.\n\"There were still some nerves at the top of the mark, but it always helps when you've got guys like Jimmy [Anderson] and Stuart [Broad] who guided me through the opening few overs, and I was on adrenaline after that.\n\"Particularly in the context of the game, we stand here on day two in a pretty strong position. The Amla wicket was probably the best of the bunch, with all that he's done in the game.\"", "url": "https://www.bbc.com/sport/cricket/40758314"}