{"authors": ["Matthew Cresswell", "www.facebook.com"], "date_download": "2025-05-21 08:00:10", "date_modify": "2025-05-21 08:00:10", "date_publish": "2025-05-19 17:21:07", "description": "Bristol City boss Liam Manning implies he wants to keep central defender Rob Atkinson after a successful loan spell at Portsmouth.", "filename": "sport_football_articles_cgr5nx1x47do_1747814410.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3876/live/a0988380-3244-11f0-9f11-ad778c3a662b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cgr5nx1x47do_1747814410.html", "title": "Liam Manning: Bristol City boss hopes to keep defender Rob Atkinson", "title_page": "Liam Manning: Bristol City boss hopes to keep defender Rob Atkinson - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Bristol City boss Liam Manning has implied he wants to keep Rob Atkinson at the club following the defender's loan spell at fellow Championship side Portsmouth.\nSpeaking after his side's play-off semi-final defeat by Sheffield United, Manning looked back on the progress the Robins have made since his appointment in November 2023 and says he is already looking to the task ahead next season.\n\"At the minute, he's our player - that doesn't change for me,\" Manning said of Atkinson to BBC Radio Bristol's Sound of the City show.\n\"I'm going to have a call with Rob soon to get everything out of the way and then I'll have a meeting with him as well to have a discussion with how it went.\"\nAtkinson was sent out on loan to Championship strugglers Pompey having failed to play a single minute of league football in the first half of the campaign ahead of favoured central defenders George Tanner, Rob Dickie and Zak Vyner.\nThe 26-year-old duly proved his worth at Fratton Park, however, making 14 league appearances and scoring twice against relegation rivals Derby County, helping the club retain their Championship status with a couple of games to spare.\n\"It was good to see him have minutes and when you look at it from that perspective, it was a good loan for him but I think I could have done with him,\" Manning added.\n\"It's one of those. I think he'll be coming back here.\"\nAt the other end of the pitch, Manning stated he already has a \"clear profile\" of a new striker he wants to add to the squad this summer.\nAlbanian winger Anis Mehmeti was the Robins' top scorer in the league with 12 goals, at a strike rate of exactly one goal every four games, but Manning is yet to have a discussion with the club's hierarchy over a budget for a new frontman.\n\"When you look at it, goals become the biggest bit,\" Manning said.\n\"There's so much good work between the two boxes in the last two games and across so much of the season but what separates teams is what happens in both boxes.\"", "url": "https://www.bbc.com/sport/football/articles/cgr5nx1x47do"}