{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:57:47", "date_modify": "2025-05-20 11:57:47", "date_publish": "2023-08-06 10:59:38", "description": "Wales clinch bronze at the European II Women's Hockey Championship after a penalty shoot-out win against Ukraine.", "filename": "sport_hockey_66421704_1747742267.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/137EB/production/_86515897_hockey.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_hockey_66421704_1747742267.html", "title": "European II Women's Hockey Championship: Wales clinch bronze after Ukraine penalty shoot-out", "title_page": "European II Women's Hockey Championship: Wales clinch bronze after Ukraine penalty shoot-out - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wales clinched bronze at the European II Women's Hockey Championship after a penalty shoot-out against Ukraine.\nUkraine had led 2-0 in Prague through Veronika Movchan and Yevheniia Moroz.\nBut Wales fought back when Xenna Hughes' flick set up Beth Bingham to tap the ball into the net, before Izzie Howell claimed the equaliser.\nElla Jackson took over in Wales' goal for the shoot-out and shut out Ukraine, with Bingham, Izzy Webb and Millie Holme finding the back of the net.\nWales had finished the pool stage second in Group B thanks to a draw with Austria, a loss to overall champions France and then a 5-0 thumping of Lithuania to qualify for the semi-finals on goal difference.\nThey fell 1-0 to Group A winners Czech Republic in the semis but finished on a high with the win over Ukraine in the bronze medal match.\nWales head coach Kevin Johnson said: \"Much credit to a spirited and technically skilful Ukraine team who gave us a huge challenge to overcome with us being 2-0 down at half-time.\n\"But the team spirit of this group along with some learning from the semi-final the night before ensured we stuck to our process and deserved to get back into the game.\n\"Our shoot-out takers were brilliant in holding their nerve, as well as Ella Jackson in the goal in keeping Ukraine out.\n\"We have thoroughly deserved our bronze medal and one we will cherish as only the second Wales senior women's side to medal at this level of European competition, with this one being the first since 2009.\n\"We have had terrific support out here and at home and we would like to thank everyone for this.\"", "url": "https://www.bbc.com/sport/hockey/66421704"}