{"authors": ["Emma Middleton", "www.facebook.com"], "date_download": "2025-05-21 08:01:48", "date_modify": "2025-05-21 08:01:48", "date_publish": "2025-01-13 13:32:44", "description": "BBC Sport explains why some Welsh clubs continue to play in England, despite the launch of the League of Wales more than 20 years ago.", "filename": "sport_articles_cy53654lr04o_1747814508.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/bdd7/live/a97a6370-cc13-11ef-9fd6-0be88a764111.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cy53654lr04o_1747814508.html", "title": "Why do some Welsh clubs play in English leagues?", "title_page": "Why do some Welsh clubs play in English leagues? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "For more than a century, Cardiff City, Swansea City, Wrexham and Newport County have been playing football across the English-Welsh border.\nBut why? BBC Sport looks into the key questions...\nAt the top, you've got the Cymru Premier - the Welsh top division.\nThis was launched in August 1992, then known as the League of Wales. Numerous previous attempts to get a league going had failed.\nThe Cymru Premier consists of 12 clubs, who are a mix of professional and semi-professional.\nBelow that, there are the Cymru North and Cymru South - both of which are feeder leagues for the top division.\nThey came about following a restructure before the start of the 2019-2020 season, when the Football Association of Wales (FAW) took control over the second tier.\nOne of the main reasons for that restructure was to address an imbalance between the number of clubs and leagues in certain regions.\nThe short answer is that, originally, there was no alternative.\nBy 1912, Cardiff, Swansea, Wrexham and Newport had all moved across the border.\nAt that time, there was no Welsh national league - even though the FAW is the third oldest football association in the world, having been set up in 1876.\nSeveral clubs - including Cardiff and Swansea - were invited to play in the Southern League, before joining the expanding Football League.\nIn 1927, Cardiff made history by becoming the first and only Welsh club to win the FA Cup.\nThe logistics were tricky.\nPoor transport links between the north and the south were a huge barrier to creating a professional league in Wales.\nBut by the late 1980s, the FAW was under increasing pressure to start a national league.\nFifa's members were starting to question why Wales could play as an independent football nation, despite not having its own national league.\nA vote of Fifa members never happened - but there were fears it would have forced the home nations to play as a single Great Britain side.\nSo, creating a Welsh league was a means of protecting the country's footballing independence.\nThe FAW allowed the three sides playing in the English football league at the time - Cardiff, Swansea and Wrexham - to stay.\nCardiff and Swansea are now Championship rivals, and Wrexham are in League One after securing back-to-back promotions.\nThe FAW made different allowances for non-league teams. That didn't go down well with all clubs.\nSome non-league teams had moved to play in England - Bangor City, Barry Town, Caernarfon Town, Colwyn Bay, Merthyr Town, Newport County, Newtown and Rhyl - and refused to come back.\nThose clubs, known as the 'Irate Eight', were threatened with sanctions by the Welsh FA.\nThe FAW told clubs that if they wanted to play football in England, they would also have to play their home games there.\nIn 1995, some clubs - including Newport, Caernarfon and Colwyn Bay - took the FAW to court and won.\nAll of the clubs - except from Newport County (League Two) and Merthyr Town (non-league) - eventually returned to Wales.\nYes - but they must do so via the English Premier League, FA Cup or EFL Cup.\nPreviously, Welsh clubs playing in England could qualify for Europe via the Welsh Cup, with several enjoying runs in the old European Cup Winners' Cup.\nBut that ended in 1995 under pressure from Uefa - Europe's football governing body.\nIn 2012, the FAW tried to reverse that decision, but Uefa reiterated that Welsh sides must finish in qualification spots in the English Premier League or win an English cup competition to qualify for Europe.\nThat happened in 2013, when Swansea won the League Cup - reaching the last 32 of the Europa League.\nThe FAW and Wales' four EFL clubs - Cardiff, Swansea, Wrexham and Newport County are now exploring whether the Welsh League Cup can be used as an entry point to European football.\nClubs would still play their league football in England, but would sacrifice their ability to qualify for Europe through English competitions.", "url": "https://www.bbc.com/sport/articles/cy53654lr04o"}