{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:52:53", "date_modify": "2025-05-21 07:52:53", "date_publish": "2025-01-22 09:27:18", "description": "Laura Muir announces she is being coached by fellow Olympic silver medallist Steve Cram and her former rival Laura Weightman.", "filename": "sport_athletics_articles_c5y65px0gjdo_1747813973.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0712/live/ef0ad940-d89f-11ef-993a-9dfb304c6a75.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_athletics_articles_c5y65px0gjdo_1747813973.html", "title": "Laura Muir: Steve Cram & Laura Weightman coaching Olympic medallist", "title_page": "Laura Muir: Steve Cram & Laura Weightman coaching Olympic medallist - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Laura Muir has announced she is being coached by Steve Cram and her former rival Laura Weightman.\nThe Olympic silver medallist, 31, had been working with UK Athletics' former endurance programme manager Steve Vernon in the lead up to Paris 2024.\nThat followed splitting from long-time coach Andy Young in 2023, who guided her to the 1500m runner-up spot in Tokyo, as well as world bronze and European and Commonwealth titles.\nCram himself won Olympic silver over 1500m in Los Angeles in 1984 and fellow English middle distance runner Weightman won European and Commonwealth medals.\nWriting on Instagram, Muir described her new coaches as \"truly inspiring people, both of which I have been fortunate to know for over a decade\".\nAnd she added: \"Steve, someone who has commentated on practically every major race of my career, coached Laura W and ran pretty well himself over 1500m….and Laura an amazing competitor and dear friend who I raced and trained alongside for many a year.\n\"A massive thank you to my previous coach Steve Vernon who supported me in 2023/2024. Good luck with your new ventures!\"", "url": "https://www.bbc.com/sport/athletics/articles/c5y65px0gjdo"}