{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:34:55", "date_modify": "2025-05-20 14:34:55", "date_publish": "2023-07-26 05:18:04", "description": "Football Association of Wales chief executive Noel Mooney gives his backing to national team manager Robert Page after recent poor results.", "filename": "sport_football_66306118_1747751695.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/DE6D/production/_130514965_gettyimages-1258833132.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66306118_1747751695.html", "title": "Robert Page: Wales manager receives FAW chief's backing", "title_page": "Robert Page: Wales manager receives FAW chief's backing - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Football Association of Wales chief executive Noel Mooney has given his backing to national team boss Robert Page after recent poor results.\nPage has been criticised after one win in 12, including defeats by Armenia and Turkey in June's Euro 2024 qualifiers.\nBut when asked if the FAW still backed Page, Mooney said: \"We do.\"\nWales host South Korea on Thursday, 7 September in a friendly before going to Latvia four days later for their next Euro qualifier.\n\"Rob will be managing the team against Latvia and South Korea, and we've got a long-term contract with Rob [until 2026],\" Mooney told BBC Radio Wales Breakfast.\nHe added: \"What I will say is that we've got a very good handle on where we're going, we've got a lot of transition happening.\n\"But we'll keep it under constant review, like of course we will, like we always would, at any time.\"\n\"A high performing organisation like us have to keep reviewing things. Have we got the right people, not just in that position, but all positions. We keep looking at performances.\n\"If we do really well in the September camp that will be fantastic because we need to win.\n\"Will we get to the Euros? It's definitely damaged since the last camp, there's no point in saying it's not.\n\"Let's see how the next camp goes and keep everything under review.\"\nPage has been in charge since November 2020, taking over temporarily from Ryan Giggs at first before getting the job permanently.\nHaving led Wales at Euro 2020 and the 2022 World Cup, Page signed a four-year contract before the finals in Qatar last year.\nBut Mooney does not believe the decision to award the former Port Vale and Northampton boss a long-term deal ahead of the World Cup was unwise.\n\"He was someone who had got us to the World Cup finals, he'd taken us to the Euros,\" Mooney said.\n\"We can't forget the movement that we've made, but it is really important that we continue that.\n\"At the time we feel that we're not continuing on the right track then that may be time to change because you've got to keep growing.\n\"If we go backwards that's not acceptable to the FAW - that's not acceptable to anybody.\n\"But what we don't do, we don't make knee-jerk decisions just based on a lot of people upset that we lost a game.\"\nMooney was speaking as the FAW launched a partnership with the FUW - the Farmers Union of Wales - for a new initiative to bridge the gap between young men in farming and football clubs.\nThe aim is for football clubs to be hubs in local communities and be used to house and support mental health service.\n\"There's a lot of isolation living in rural Wales so mental health is a challenge of our time,\" Mooney added.\n\"One thing about living in a city is you have access to services, but when you live out on a farm it's much more difficult.\n\"We've got 950 football clubs all across Wales - they're in every village and in every town in the country.\n\"So we've got a natural network of places that particularly young men and, increasingly thankfully, young women go too.\n\"So what we're trying to do is put in place, with the clubs, services that allow farmers to raise their topics and to know what to do next.\n\"It's like giving tools, framework and ways of dealing with the issues that young farmers face, which can be depression and all sorts of mental health issues.\n\"With the Farmers Union of Wales we are going to put in place the provisions and opportunities for farmers to benefit from football, which is much wider than just kicking a football.\n\"Football is a social phenomena and this partnership allows us to use this social phenomena to help farmers.\"\nListen to the interview in full with Noel Mooney on BBC Radio Wales Breakfast on Wednesday, 26 July", "url": "https://www.bbc.com/sport/football/66306118"}