{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:08:16", "date_modify": "2025-05-19 15:08:16", "date_publish": "2015-02-14 19:10:50", "description": "England coach Stuart Lancaster says his side lacked early intensity in their 47-17 Six Nations win over Italy at Twickenham.", "filename": "sport_rugby-union_31474282_1747667296.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81015000/jpg/_81015539_stuart_lancaster_getty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_rugby-union_31474282_1747667296.html", "title": "Six Nations 2015: England 'lacked intensity in defence'", "title_page": "Six Nations 2015: England 'lacked intensity in defence' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England head coach Stuart Lancaster said his side \"lacked intensity\" in their victory over Italy at Twickenham.\nEngland recovered from conceding the first try to win 47-17 and keep their 100% Six Nations start intact.\nBut Lancaster said his young side, who beat Wales in Cardiff last Friday, started poorly, with Sergio Parisse crossing to give Italy a 5-0 lead.\n\"I am disappointed really. I thought we lacked the intensity we had in defence last week,\" said Lancaster.\n\"We addressed it in the second half but the last try was a frustrating one.\n\"I guess at the start of the day, if someone had said we would get 47 points, I would have taken it.\n\"We played some really good rugby and scored some excellent tries. Then defensively, apart from the last minute, we really fronted up physically.\"\nEngland full-back Mike Brown had to be replaced in the first half after after appearing to be knocked out in an inadvertent collision with Andrea Masi, and will not take part in training this week ahead of the trip to Dublin to face Ireland on 1 March.\nLancaster says England will follow all the return to play protocols when monitoring Brown's condition.\n\"We will see how he goes the following week before deciding whether to pick him for Ireland,\" added Lancaster.\n\"I saw him after the game and he seemed fine, if a bit grumpy because he had to miss most of the game.\"", "url": "https://www.bbc.com/sport/rugby-union/31474282"}