{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:29:57", "date_modify": "2025-05-21 07:29:57", "date_publish": "2025-05-20 16:56:05", "description": "Daan Hoole beats Great Britain's Josh Tarling to win the stage 10 time trial at the Giro d'Italia in Pisa as Isaac del Toro sees his overall lead cut.", "filename": "sport_cycling_articles_cg5vvdj1j9po_1747812597.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/445a/live/201d64e0-3592-11f0-8f95-179a79186756.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cycling_articles_cg5vvdj1j9po_1747812597.html", "title": "Giro d'Italia 2025 stage 10: Daan Hoole beats Britain's Josh Tarling to time trial victory in Pisa", "title_page": "Giro d'Italia 2025 stage 10: Daan Hoole beats Britain's Josh Tarling to time trial victory in Pisa - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Dutchman Daan Hoole secured his first Grand Tour stage win as he beat Great Britain's Josh Tarling in the time trial on stage 10 of the Giro d'Italia in Pisa.\nJuan Ayuso finished 22nd, over a minute and half down, but cut UAE Team Emirates -XRG team-mate Isaac del Toro's lead in the general classification to 25 seconds.\nLidl-Trek rider Hoole finished seven seconds clear of Ineos Grenadiers' Tarling with a time of 32 minutes and 30 seconds, with British national road champion Ethan Hayter, 26, 10 seconds back on Hoole in third.\nTarling, 21, was the pre-stage favourite after winning the first time trial of the race on stage two, but he was unable to match the performance of Hoole over the 28 kilometre course between Lucca and Pisa on Tuesday.\n\"I'm so happy and there are so many people I need to thank. I just can't believe it,\" said 26-year-old Hoole, who took advantage of dry roads before torrential rain hampered the later starters, who were the general classification contenders.\nRace leader Del Toro of Mexico finished in 37th place, two minutes 22 seconds behind Hoole, but retained the pink jersey.\nBriton Simon Yates of Visma-Lease a Bike moved up two places in the standings to fourth after placing 23rd.\nOverall race favourite Primoz Roglic of Slovenia, who lost time after a crash on Sunday, finished one minute 15 seconds down on Hoole in 17th place.\nBut the 2023 Giro champion made up time on all his main rivals and now sits fifth overall, one minute 18 seconds behind Del Toro.", "url": "https://www.bbc.com/sport/cycling/articles/cg5vvdj1j9po"}