{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:22:02", "date_modify": "2025-05-21 04:22:02", "date_publish": "2025-01-23 18:16:42", "description": "BBC's Tom English answers your Scottish rugby questions", "filename": "sport_articles_c9qjxvly9edo_1747801322.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/fa96/live/7f97be50-d9af-11ef-bc01-8f2c83dad217.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c9qjxvly9edo_1747801322.html", "title": "BBC's Tom English answers your Scottish rugby questions", "title_page": "BBC's Tom English answers your Scottish rugby questions - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "BBC Scotland's chief sportswriter Tom English has been answering some of your Scottish rugby questions.\nSteve asked: I was full of hope for Scotland's Six Nations campaign. I wasn't ready for my optimism to leave quite so fully because of the loss of one player. Am I right to be quite this deflated and how many games can we now expect to win?\nTom answered: Everyone is deflated by Sione Tuipulotu's injury. How could it be any other way when you've just lost a world-class player and a magnetic personality? It's a proper kick in the guts.\nIf it's going to be a new combination of Stafford McDowall and Huw Jones then that's still really good.\nThey know each other's game really well and McDowall shouldn't be underestimated. He's a terrific player, but he's not Sione, who's two players in one, to be honest. A battering ram and a beautifully subtle ball player.\nI think Scotland will beat Italy, I'd already predicted they'd beat Ireland and England, but I'm losing my nerve a little on that now. They'll beat Wales and will lose to France in Paris because France should be awesome.\nSo I've gone from possibly four wins to two while still retaining a modicum of belief they can get another one somewhere along the way. It's incredible how the picture has changed in the space of a few days.\nJake asked: Do go 'like for like' with McDowall at 12 or try something a little different and having a ball-playing 12 like Rory Hutchinson? I would always go for size in the Six Nations but Rory has been carving up in the Premiership.\nTom answered: You're right, Hutchinson has been outstanding in the Premiership. A midfield of Hutchinson-Jones would be potentially thrilling, as would Tom Jordan-Jones. I suspect it's going to be McDowall-Jones, though.\nIn Test rugby you need his extra physicality in there. Look at the other contenders at 12. Ireland have Bundee Aki or Robbie Henshaw. England have Ollie Lawrence. France have Yoram Moefana. They're all very powerful guys. McDowall is 6ft 4in and 16st. And he can play. I think he gets the nod.", "url": "https://www.bbc.com/sport/articles/c9qjxvly9edo"}