{"authors": ["Neil Johnston", "www.facebook.com"], "date_download": "2025-05-20 14:09:02", "date_modify": "2025-05-20 14:09:02", "date_publish": "2023-07-30 11:05:35", "description": "Fans of co-hosts New Zealand react with \"disappointment\" and \"pride\" after the Football Ferns fall agonisingly short of qualifying for the knockout stage of the Women's World Cup.", "filename": "sport_football_66353974_1747750142.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/101B0/production/_130586956_gettyimages-1580408025.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66353974_1747750142.html", "title": "Women's World Cup 2023: New Zealand fans react with 'disappointment' and 'pride' after exit", "title_page": "Women's World Cup 2023: New Zealand fans react with 'disappointment' and 'pride' after exit - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "There was silence inside Shed 6 on Wellington's waterfront when the full-time whistle signalled the end of New Zealand's Women's World Cup dream.\nAnd then a round of applause from the hundreds of locals watching on a big screen in New Zealand's capital.\nHaving claimed a historic first win over Norway on the opening night of the tournament, the co-hosts exited the competition at 20:58 local time on Sunday after a tension-filled night.\nFollowing a goalless draw with Switzerland, the Football Ferns finished on four points from three games - the same number as Norway, who hammered the Philippines 6-0 in their final group match.\nNorway's superior goal difference saw them advance along with Group A winners Switzerland to the knockout stage.\nFans banged on the tables and roared when the fourth official signalled a minimum of eight minutes of stoppage time in the New Zealand-Switzerland match.\nAnd cheers and whistles filled the air when Football Ferns keeper Victoria Esson went up for a 96th-minute corner - and headed wide.\nEven Japan fans, who are in the city for Monday's Group C encounter with Spain (08:00 BST kick-off), cheered inside the indoor fan park each time New Zealand surged forward.\nIn the end, there was a huge sense of disappointment mixed with pride as the Football Ferns fell agonisingly short.\n\"There are plenty more World Cups to come and New Zealand's women are only getting better and better at football,\" Terry Lynch, who watched the match on the big screen with his son Dante, said.\n\"Huge credit to the Football Ferns because I thought they played terrific.\n\"Unfortunately goals are what wins matches and we didn't get one. You're up against the best in the world and you have got to be on form all the time.\n\"But as much as you can say there is disappointment, there is a lot of pride that the ladies gave it their all.\n\"I cannot wait to see where we will be in four years' time when the next World Cup takes place. We'll be back.\"\nAnnie Kennedy said the Football Ferns had changed opinions in New Zealand despite going out.\n\"It's sad that we are out, but I'm really filled with hope,\" she added.\n\"There was such a sense of complacency in the country that New Zealand were not going to do well and wasn't going to achieve anything in this tournament.\n\"But that first win over Norway completely flipped the mindset of everybody into thinking 'this could be a thing'. There is hope and belief that wasn't there before. So I see that as a huge success.\"", "url": "https://www.bbc.com/sport/football/66353974"}