{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:55:32", "date_modify": "2025-04-26 06:55:32", "date_publish": "2025-02-28 15:22:51", "description": "A total of 220 requests have been made to replace medals won at the Paris 2024 Olympic Games, the French Mint has said.", "filename": "sport_olympics_articles_ckgd2wwx6zlo_1745650532.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b602/live/76431b40-f5e5-11ef-86a6-15c2bb2c0119.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_olympics_articles_ckgd2wwx6zlo_1745650532.html", "title": "Paris 2024 Olympics: A total of 220 athletes have made requests to replace damaged medals", "title_page": "Paris 2024 Olympics: A total of 220 athletes have made requests to replace damaged medals - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A total of 220 requests have been made to replace medals won at the Paris 2024 Olympic Games.\nThe medals were designed by French luxury jeweller Chaumet and are set with a piece of iron taken from the Eiffel Tower during its renovation in the 20th Century.\nHowever, British diver Yasmin Harper, who won Team GB's first medal of the Games, was among the athletes to notice her medal was showing signs of \"tarnishing\".\nParis 2024 organisers said any damaged medals will be replaced and the French Mint told AFP it has received 220 such requests - equivalent to four percent of the total awarded.\n\"The French Mint [Monnaie de Paris] has replaced some of them and is continuing its replacement operation at the request of the athletes,\" it said in a statement.\nHarper, who won women's 3m synchronised springboard bronze with partner Scarlett Mew Jensen, said later in the Games she had noticed \"small bits of tarnishing\".\nThat came after American skateboarder Nyjah Huston criticised the quality of his medal, posting a video of the bronze he won in the men's street skateboarding that appeared discoloured and chipped.\nA Paris 2024 spokesperson said at the time it was working closely with the Monnaie de Paris to understand the cause of the damage and promised \"damaged medals will be systematically replaced and engraved in an identical way to the originals\".", "url": "https://www.bbc.co.uk/sport/olympics/articles/ckgd2wwx6zlo"}