{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:55:43", "date_modify": "2025-05-20 11:55:43", "date_publish": "2023-08-05 15:57:30", "description": "DIGIONLY", "filename": "sport_football_66378422_1747742143.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66378422_1747742143.html", "title": "Saturday's Championship reports", "title_page": "Saturday's Championship reports - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Blackburn Rovers 2-1 West Bromwich Albion\nHarry Leonard and Dilan Markanday scored on their first league starts to give Blackburn victory against West Brom.\nThe opening day of the Championship season was a miserable one, however, for Baggies manager Carlos Corberan, who was sent off for two yellow cards as his team's second-half fightback was not quite enough.\nTeenage striker Leonard and 21-year-old winger Markanday scored within two minutes of each other in the first half for an excellent start to their season as Rovers looked to build on last season where they just missed out on the play-offs.\nMatt Phillips pulled one back for the visitors in a much brighter performance after the break but the West Midlands side could not find the equaliser.\nThe opening round of Championship games had pitted two sides who were seemingly heading in different directions at the end of last season, against each other.\nRovers slipped out of the play-off places with a dismal finish to that campaign, while the Baggies had shown promotion form after Corberan had taken the reins as they sat in the relegation places - and only finished three points behind their opponents.\nThe loss of key players Ben Brereton Diaz, Bradley Dack, Thomas Kaminski and Ash Phillips had further deepened the gloom at Ewood Park, while optimism was rife at The Hawthorns.\nRovers were quickest out of the blocks, however, as Markanday won the ball to start a counter-attack, Leonard and Lewis Travis carrying on the move before Markanday - who spent much of last season at Aberdeen on loan - finished well.\nFrom the re-start, Sammie Szmodics intercepted and played in Leonard, given his chance after the summer departures, for his first senior goal.\nThe travelling Baggies fans voiced their displeasure at half-time and within five minutes they had fresh hope as Phillips finished a slick move with a curling finish.\nCorberan was yellow-carded for protesting that an arm had been used as Joe Rankin-Costello made one of two crucial blocks to deny Jayson Molumby, and was red-carded soon afterwards for more dissent.\nBristol City 1-1 Preston North End\nSummer signing Will Keane's 86th-minute strike earned Preston North End a share of the points at Bristol City in their opening game of the Championship season.\nForward Keane, who joined Preston in July after leaving Wigan Athletic, marked his second spell at the club he played for on loan in 2015 by turning to fire in their equaliser with four minutes remaining.\nSam Bell's close-range second-half opener had put the Robins on course for victory as part of an uneventful first half between two sides lacking early cohesion.\nHighly-rated 21-year-old Bell atoned for missing the best chance of the opening period by pouncing to stab in the rebound after Nahki Wells shot against a post in the 47th minute.\nBell should have scored when Wells found him unmarked at the far post with a cross from the right, only to see goalkeeper Freddie Woodman rescue the visitors by blocking his shot at full stretch.\nEngland Under-20 midfielder Alex Scott, who has been the subject of several transfer bids and is , did not feature because of injury.\nCity captain Andreas Weimann hobbled off injured early as both sides struggled to make openings, although North End newcomer Mads Frokjaer-Jensen tested Max O'Leary in the City goal and Brad Potts shot over the target from long range.\nPreston enjoyed more possession and had 11 shots at goal to Bristol City's five, with Zak Vyner thwarting Keane, and Potts spurning further chances during the second half as the away side's wait for a first win since 10 April went on.\nKian Best, 17, made his debut after coming through the youth ranks at Preston, who have not won their opening league match in five seasons.\nThe result means Bristol City have not won on the opening day for four seasons but they did extend their dominant run in the fixture to one defeat in 10.\nMiddlesbrough 0-1 Millwall\nMillwall opened their Championship campaign with an away win at Middlesbrough thanks to Romain Esse's first goal for the Lions.\nThe 18-year-old broke the deadlock in the 79th minute when fellow substitute Aidomo Emakhu crossed from the left and Esse curled a fine first-time finish into the top corner.\nThe Lions were a constant threat on the counter-attack against a Boro wide who were beaten play-off semi-finalists last season, with Zian Flemming and debutant Kevin Nisbet going close for the visitors.\nSammy Silvera sent a fierce effort over the bar as the hosts sought an equaliser while Dael Fry failed to connect with a cross from the Australian.\nThe Teessiders had seen a Hayden Hackney goal ruled out six minutes before the break after the ball ran out over the byline before Matt Crooks was able to pull it back.\nMillwall had also challenged for promotion to the Premier League last season, but fell out of the play-off places on the final day of the season following a dramatic home defeat by Blackburn Rovers.\nFlemming was off target with two early chances, firing a side-footed effort narrowly past the left-hand post and then slicing wide when well-placed from a short corner.\nMeanwhile, former Boro man Duncan Watmore almost came back to haunt his old side but had a shot deflected over the bar.\nMichael Carrick had lifted Middlesbrough from 21st place to finish fourth last season but his side were disappointing, with their need for additional signings in attack glaringly apparent throughout.\nChuba Akpom, top scorer in the Championship last season with 28 goals, remained an unused substitute for the hosts.\nGoalkeeper Seny Dieng, a summer signing from QPR, raced off his line to deny Scotland striker Nisbet with his legs in a one-on-one but could do little to prevent the only goal of the game.\nAfter Emakhu had skipped away from Paddy McNair to break down the left, Esse showed composure and quality to guide the ball back across goal and into the top left-hand corner to give Gary Rowett's men all three points.\nNorwich City 2-1 Hull City\nSubstitute Adam Idah scored a 96th-minute winner as Norwich City came from behind to break Hull City's stubborn resistance and earn a deserved victory at Carrow Road.\nIdah toe-poked the ball in 10 minutes after coming on following a goalmouth scramble as the mounting home pressure finally told.\nLiam Delap's debut strike gave the Tigers the lead against the run of play as they chased a first away victory in 11 matches.\nBut, the excellent Jonathan Rowe's first senior goal levelled scores deep into first-half stoppage time and ensured Norwich would avoid a sixth game in a row without a goal at home.\nCruel as it was on the Tigers, Idah's strike was rich reward for a stylish attacking performance which saw David Wagner's side create 28 opportunities.\nThe Canaries dominated possession and territory and made chances at will.\nThey set the tone early on when summer signing Ashley Barnes, one of three Norwich debutants, teed up Gabriel Sara only for the midfielder's curled effort to soar over the bar.\nRowe saw a strike hit the post, while last season's top scorer Josh Sargent also threatened.\nBut it was the visitors who went ahead with one of just two attempts on target in the first half, Manchester City loanee Delap robbing Ben Gibson and finishing smartly following Shane Duffy's sloppy pass.\nHowever, Norwich remained on top, Onel Hernandez had a shot cleared off the line by Lewis Coyle, the impressive Jack Stacey smashed an attempt wastefully over the bar - as did Hernandez - and Duffy headed narrowly wide.\nSargent also went close with a header that produced a superb save from the busy Ingram and Barnes nodded an attempt off target, before Rowe finally made it 1-1 deep into added time - one of 18 attempts on goal by the home side before the break.\nThe second half followed a similar pattern without reward, until Idah's late heroics secured just their third opening weekend success in 21 games.\nPlymouth Argyle 3-1 Huddersfield Town\nTwo goals in two second-half minutes saw Plymouth Argyle beat Huddersfield Town in their first Championship game in more than 13 years.\nSummer signing Morgan Whittaker gave the Pilgrims a dream start as he scored from close range, but Huddersfield got a deserved equaliser in first-half stoppage time through Michal Helik.\nHaving seen the Terriers go close, Argyle weathered the storm as Bali Mumba's superb individual goal gave Argyle the lead with 17 minutes left.\nAnd soon after the result was put beyond doubt as Whittaker put Ryan Hardie through on goal and the Scot coolly finished.\nHaving helped Huddersfield perform miracles to stay up against the odds last season Neil Warnock saw his side concede a sloppy opener as Argyle impressed early on.\nA sixth-minute cross into the area was not dealt with and Whittaker, a £1m summer signing from Swansea City after being on loan last season, capped his return to Home Park by forcing the ball home.\nBut as the half continued Huddersfield grew into the game and should have drawn level when Josh Koroma smashed a low effort into the side netting after 23 minutes - the forward was left unmarked at the back post after Sorba Thomas' cross from the right.\nThe Pilgrims began to look nervous as the half wore on as they cheaply gave away possession too often - and they were eventually made to play as Helik levelled from close range after Koroma's left-footed shot from the edge of the box came back off the post and fell to the feet of the defender.\nHuddersfield twice almost went ahead early in the second half as Brahima Diarra's curling left-footed cross from the right got caught in the strong Home Park wind and was clawed out of the top left corner by Conor Hazard.\nFive minutes later Diarra robbed the Pilgrims keeper eight yards out but Hazard was able to get a hand to the Malian's effort which he should have converted.\nBut Argyle began to improve as Mumba, like Whittaker a former loanee returning to Plymouth on a £1m deal, scored what must be the finest goal of his young career.\nThe former Norwich City player cut in from the left 50 yards out from goal and beat a number of players as he skipped into the penalty area before producing a superbly delicate finish.\nHardie raced through to slot home the third left-footed soon after thanks to Whittaker's pass as Argyle's two big-money summer signings proved their worth.\nTown could have pulled a goal back soon after, but Hazard made an excellent point-blank save from Danny Ward after Jack Rudoni's cutback.\nBut despite some late pressure in nine minutes of second-half stoppage time they could not create a clear-cut chance to pull a goal back.\nStoke City 4-1 Rotherham United\nKi-Jana Hoever's sumptuous volley, Andre Vidigal's brace in first-half added time and Jacob Brown's late tap-in gave new-look Stoke City their biggest win on the opening day of the season for 20 years with victory over 10-man Rotherham United.\nMidfielder Hoever launched his second loan spell at Stoke from Wolves in glorious fashion by firing Josh Laurent's left-wing cross beyond Viktor Johansson via the crossbar, but the hosts struggled to match their dominance of possession and succession of corners with attempts on goal during the first 45 minutes.\nJuly signing Vidigal struck twice in six additional minutes, pouncing on Ben Wilmot's header and lashing in the rebound from a Johansson save to send Stoke on their way to victory on the opening day for only the second time in 14 seasons.\nHalf-time substitute Lee Peltier poked in for Rotherham shortly after the restart to deny on-loan Bournemouth goalkeeper Mark Travers, one of six players making their full debuts for Stoke, a clean sheet.\nVidigal could have had a hat-trick before Brown converted at the far post in the 90th minute to give Wilmot a second assist.\nMidfielder Ben Pearson - a loanee from the Cherries last season before completing a permanent move in July - joined Hoever in beginning his second stint for Alex Neil's side, who appealed for a red card over a challenge by Sean Morrison on Ryan Mmaee shortly before Vidigal's first.\nDefender Morrison was operating as part of a Rotherham side deprived of new striker Andre Green through injury, while centre-back Grant Hall also missed out on making his bow as a permanent Millers player because of a tight hamstring as his side's four-match unbeaten run in their first games of each campaign came to a comprehensive end.\nMillers manager Matt Taylor faced further problems when Peltier had to be replaced 10 minutes after coming on and debutant Cafu was dismissed with 21 minutes remaining for a second yellow card following a foul on Mmaee.\nTaylor's squad stretched their barren run on the road without a win to 14 games, last prevailing on their travels on 8 November at Sheffield United - their only away victory last season aside from a win at Stoke in October.\nSwansea City 1-1 Birmingham City\nMichael Duff claimed a point in his first game as Swansea City boss as Jerry Yates denied Birmingham City an opening-day away win.\nDuff's Swansea were heading for defeat after Birmingham debutant Siriki Dembele took advantage of a defensive mistake to stroke the visitors in front just before half-time.\nJohn Eustace's men looked well placed to claim victory as they smothered a Swansea side who lacked inspiration going forward at times.\nBut a moment of attacking quality allowed Yates to mark his debut following a summer move from Blackpool with a simple finish.\nIvan Sunjic was denied a late winner by a superb Carl Rushworth save, and Birmingham may feel more frustrated by the draw given that they created better chances.\nYet both Duff and Birmingham's Eustace could take some satisfaction having each got off the mark in 2023-24.\nThis was the beginning of a new era for both clubs, with Swansea starting life under a new head coach following Russell Martin's move to Southampton and Birmingham opening the season with fresh optimism after a summer takeover.\nBirmingham's mood was lifted further on the eve of the season when American football legend Tom Brady became a minority shareholder of the club.\nThere was more good news for the Blues as they edged in front late in a first half which was full of endeavour but a little short on final-third quality.\nSwansea huffed and puffed, playing with the high tempo demanded by Duff but without the control of possession which was their hallmark under Martin.\nHome chances were limited, with Jamie Paterson seeing a cross-shot smothered by John Ruddy, then beating the Birmingham keeper only to see celebrations halted by the offside flag.\nBirmingham carried more threat, with Dembele forcing an early save from Rushworth before another debutant, Ethan Laird, teed up Krystian Bielik for a shot which was well smothered by Swansea's on-loan Brighton goalkeeper.\nThe breakthrough as a result of home error, with Rushworth trying to feed Ben Cabango on the edge of his own box when a clearance would have been the better option.\nKeshi Anderson dispossessed the Swansea centre-back and squared for Dembele, who took a touch before guiding the ball beyond the helpless Rushworth.\nIt was the sort of defensive lapse which cost Swansea too often last season - and came despite the fact Duff wants his team to take fewer risks than they did under Martin.\nBirmingham might have doubled their advantage on the counter early in the second half but Sunjic could only shoot tamely at Rushworth.\nSwansea missed a chance to respond when Ruddy could only parry a Paterson corner to Harry Darling, whose looping header left the Birmingham goalkeeper stranded but bounced to safety off the crossbar.\nThe leveller came thanks to a high-class Matt Grimes pass which sent substitute Liam Cullen scampering down the left and his measured cross allowed Yates to guide the ball home from close range.\nJoel Piroe and Cabango then saw shots blocked as Swansea went in search of a winner, before Rushworth made amends for his part in the Birmingham goal with a fine reaction save to deny Sunjic at the other end.\nWatford 4-0 Queens Park Rangers\nWatford eased to a dominant win over sorry Queens Park Rangers in Valerien Ismael's first Championship game in charge of the Hornets.\nTom Dele-Bashiru slotted in to put the hosts ahead after just 33 seconds and QPR were unable to contain their rampant opponents, who established a 4-0 half-time lead at Vicarage Road.\nImran Louza was given space 25 yards out to curl in a low shot and double the lead in the 20th minute, with Matheus Martins guiding in a looping header and Vakoun Bayo sliding home for the fourth two minutes before the break.\nIt could have been worse for the visitors, as Bayo almost made it 5-0 with a lob in first-half stoppage time and Louza rattled the crossbar with a dipping effort on the hour mark.\nThe second half was a much quieter affair with the outcome beyond doubt, although Sinclair Armstrong and Lyndon Dykes both went close to pulling a goal back.\nQPR conceded 71 goals last season - the second most in the second tier - and boss Gareth Ainsworth saw his defence continually carved apart on the opening day of the campaign.\nThe west London club finished six points above the relegation zone in 20th place in May and, with just two clean sheets in 14 matches since Ainsworth took charge in February, will need a vast improvement to avoid another struggle against the drop.\nWatford ended last season in mid-table following relegation from the Premier League and, after selling top scorer Joao Pedro to Brighton, appointed Ismael as head coach in May.\nTheir first-half performance would surely have exceeded the expectations of the former Barnsley and West Brom boss, with the first two goals going in following slick passing moves.\nAfter QPR keeper Asmir Begovic made good saves to deny Jeremy Ngakia and Wesley Hoedt, a short corner routine allowed Ken Sema to cross for Martins to make it 3-0 in the 38th minute.\nBayo then converted Francisco Sierralta's ball across the box to give Watford complete control at the break.\nGeorgian midfielder Giorgi Chakvetadze almost netted a debut goal for the Hornets after coming off the bench, while fellow substitute Ryan Andrews fired into the side-netting from a tight angle.\nWatford have only lost once on the opening day of the season over the past 17 campaigns, with that defeat a 3-0 home reverse against Brighton in 2019.", "url": "https://www.bbc.com/sport/football/66378422"}