{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:52:45", "date_modify": "2025-05-20 13:52:45", "date_publish": "2023-07-31 16:19:44", "description": "Manchester United: 'The culture has changed' - Luke Shaw", "filename": "sport_articles_c72ll59223ko_1747749165.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/336c/live/7cf31f20-2fb8-11ee-8f52-fbf70e4bf742.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c72ll59223ko_1747749165.html", "title": "'The culture has changed'", "title_page": "Manchester United: 'The culture has changed' - Luke Shaw - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Simon Stone, BBC Sport\nSigned by Louis van Gaal in 2014 in a £27m deal which made the then 18-year-old the fourth most expensive defender in the world, Luke Shaw is now the longest-serving member of the Manchester United first-team squad following the summer exit of David de Gea.\nSpeaking to broadcast media in San Diego on the club's pre-season tour of the United States, Shaw admitted his new status has taken some getting used to.\n\"It does feel very strange,\" he said. \"I don't feel like I've been here for that long. It's gone really quickly.\"\nDuring those nine years United have won four trophies: one FA Cup, one Europa League and two EFL Cups.\n\"Of course it's not enough,\" said Shaw. \"I know that. The whole club knows that, I think.\n\"To be successful we need to be challenging for every trophy and winning competitions.\n\"We felt like we could have added another two competitions last season and I think we should have.\"\nUnited ended Erik ten Hag's first season in charge with a single piece of silverware.\nSince Sir Alex Ferguson retired, only Jose Mourinho has won more than one cup and only once have United lifted trophies in successive seasons.\nYet in the intensity with which he approaches the job, the maximum use he makes of time and the demands he places on his players, Ten Hag gives the impression of being someone who can at the very least turn United into contenders for major honours once again, something they took for granted in the Ferguson era.\n\"The culture has changed,\" said Shaw. \"It's the attitude, the way we train, the intensity, the application that everyone brings in day in, day out.\n\"The manager demands that every single day. Even when you're at home he wants you to be at your best. He wants you to be doing the right things, living the right way, because football is our life - it's what we do day in, day out - and we need to do everything we can to get to the maximum level.\"", "url": "https://www.bbc.com/sport/articles/c72ll59223ko"}