{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:42:29", "date_modify": "2025-05-21 04:42:29", "date_publish": "2025-04-03 07:54:06", "description": "'Celtic thwarted in weekend bid for Georgia midfielder' - gossip", "filename": "sport_articles_c5y4xlqwwy4o_1747802549.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/27d3/live/76300a10-1060-11f0-b234-07dc7691c360.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c5y4xlqwwy4o_1747802549.html", "title": "'Celtic thwarted in weekend bid for Georgia midfielder' - gossip", "title_page": "'Celtic thwarted in weekend bid for Georgia midfielder' - gossip - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Celtic were thwarted after making a last-gasp bid at the weekend to sign Georgia midfielder Giorgi Kochorashvili for next season, according to reports in Spain, but the 25-year-old, currently in La Liga's second tier with Levante, completed a £5m transfer to Sporting Lisbon. (The National), external\nCeltic are likely to sell Japan midfielder Reo Hatate this summer while making another attempt to sign £4m-rated Motherwell 18-year-old Lennon Miller. (Daily Record), external\nCeltic have renewed their interest in £5m winger Michel-Ange Balikwisha, whose chance of a move to the Scottish champions in January was ended by injury, with scouts watching Royal Antwerp's 5-1 defeat by Union Saint-Gilloise on Saturday. (Scottish Sun), external\nDinamo Zagreb remain confident of landing Greg Taylor at the end of his Celtic contract this summer after offering the 27-year-old a significant increase on his current deal, but the Scotland left-back also has options in Major League Soccer and they have not been dismissed yet for family reasons. (Daily Record), external\nNo plans have been put in place ahead of expected celebrations at the end of this year's football season despite a \"productive discussion\" last week after MSP Kaukab Stewart brought together community councils for Merchant City, Trongate and Calton and representatives for Celtic, Rangers, the Scottish Professional Football League, Police Scotland and Glasgow City Council in a bid to avoid the 'disruption' seen in previous years. (The Herald), external", "url": "https://www.bbc.com/sport/articles/c5y4xlqwwy4o"}