{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:14:32", "date_modify": "2025-05-19 15:14:32", "date_publish": "2015-02-13 16:53:41", "description": "A Yan Klukowski double helps secure Newport County's first win in six in League Two away against Wycombe Wanderers.", "filename": "sport_football_31423602_1747667672.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81012000/jpg/_81012675_cdf_161114_newport_v_exeter_22.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31423602_1747667672.html", "title": "Wycombe Wanderers 1-2 Newport County", "title_page": "Wycombe Wanderers 1-2 Newport County - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A Yan Klukowski brace secured sixth-placed Newport County's first win in six in League Two at Wycombe Wanderers.\nRene Howe diverted Miles Storey's cross to Klukowsi, who finished from 10 yards out to fire County in front.\nSam Wood's long range effort was parried into the path of Wanderers's teenage striker Fred Onyedinma, who slotted home the fourth goal of his loan spell from Millwall.\nBut Klukowski's late goal moves County six points behind third-placed Wycombe.\nWycombe Wanderers manager Gareth Ainsworth told BBC Three Counties Radio:\n\"We changed the formation. We created plenty more chances on goal but converting them was a problem today. We were all over them second half, but they nicked one, a sucker-punch from a set play.\n\"Gutted about that one (Newport's second). I was pleased on a few things, but it's also opened my eyes on a few things. I'm looking forward to next Saturday (against Carlisle). It'll be a long trip, but we seem to do well on those long trips.\n\"They didn't create much again. I'm sure on the stats we would have out done them, it's just now converting these chances.\n\"It's nothing like we went through last year. Still third in the league after two defeats. We'll get back on it no problem, I've got a good group.\"\nNewport County caretaker manager Jimmy Dack told BBC Radio Wales:\n\"I'm absolutely delighted. We had a tough week this week and the boys dug in and they got their rewards today.\n\"We're nearly coming into March now and we're sitting sixth in the league and that hasn't come through luck, it's come through hard work.\n\"We've just got to keep working hard and the result will come.\n\"I'm starting to settle down into the job now. It's made easy by the players.\n\"They make the job easy for me.\"", "url": "https://www.bbc.com/sport/football/31423602"}