{"authors": ["Jake Garner", "www.facebook.com"], "date_download": "2025-05-21 06:18:28", "date_modify": "2025-05-21 06:18:28", "date_publish": "2025-01-31 11:46:29", "description": "Fit-again Mansfield Town defender Alfie Kilgour talks about his new-found appreciation for the game after his lengthy injury layoff.", "filename": "sport_football_articles_cre83x4yx41o_1747808308.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d70a/live/c8ea5b70-dfc8-11ef-976a-75f9ab68fe5f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cre83x4yx41o_1747808308.html", "title": "Alfie Kilgour: Mansfield Town defender reflects on lengthy injury layoff", "title_page": "Alfie Kilgour: Mansfield Town defender reflects on lengthy injury layoff - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It was in the 12th minute of Mansfield Town's trip to Doncaster Rovers back in August 2023 when defender Alfie Kilgour climbed highest to head the ball against the post at the Eco-Power Stadium.\nLess than 60 seconds later, as the 26-year old got back into his defensive position, he ruptured his Achilles tendon, immediately ending his season within days of it beginning.\nThe Stags captain left the field on a stretcher. Dad Mike, who was at the game, was the one that had to help him climb into the shower later that night.\nBy the next morning, Stags boss Nigel Clough had confirmed the defender would need surgery that would rule him out for over a year.\nHis rehabilitation meant he would miss 14 months of first-team football, including a historic promotion which would see Mansfield playing in the third tier for the first time in 21 years.\nKilgour admits to struggling with feelings of lost purpose during his recovery.\n\"I'm unable to do my job,\" he told BBC Radio Nottingham. \"You still get paid for doing nothing while sat at home on the sofa, which isn't me. I'm a competitor who loves to play football.\"\nHe signed a new contract at The One Call Stadium in January 2024 targeting a comeback within a year.\nThat day finally arrived on 5 October, 2024.\nMansfield were leading 2-0 at home to Blackpool in League One, when Kilgour came on as a substitute in the 88th minute for his first appearance since that injury.\nIt was little more than a late cameo as he was thrust forward into an unfamiliar position, but it remains a moment he says he will remember for the rest of his life.\n\"I'd been training for a couple of weeks but to get chucked on up front was a surprise,\" he said.\n\"The reception I got from the fans was amazing, to have that feeling of playing again after 14 months out was very special.\"\nIt came following a lengthy and lonely spell away from the pitch. Kilgour's surgery was followed by rehabilitation and a mental battle to re-build the confidence to play again.\n\"In those dark times you do learn a lot about yourself, you have to dig deep and think about the end goal.\" Kilgour added.\n\"Every time I was in a gym session by myself, learning to walk again or struggling upstairs, I did it to give me confidence and get rid of any doubts that I may have had about coming back.\"\nThe defender has since made 10 further appearances for Mansfield in League One, where the the Stags sit in 12th in the table after 26 games.\nThe 26-year old says his time on the sidelines gave him a new perspective on football and life in general.\n\"I don't take any day for granted because I know my dad is on a building site at 7 o'clock in the morning while I'm running around on a football pitch with my mates,\" he said. \"I definitely appreciate it more now.\"", "url": "https://www.bbc.com/sport/football/articles/cre83x4yx41o"}