{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:16:27", "date_modify": "2025-05-21 04:16:27", "date_publish": "2025-04-05 18:01:03", "description": "Plymouth Argyle head coach Miron Muslic says his side showed they still have belief that they can stay up after their 2-1 win over Norwich City", "filename": "sport_football_articles_c4grxvqyjlpo_1747800987.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6db3/live/a42f0bd0-1247-11f0-9d46-3377f28968f3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c4grxvqyjlpo_1747800987.html", "title": "Miron Muslic: 'We knew we just had to win' says Plymouth Argyle boss", "title_page": "Miron Muslic: 'We knew we just had to win' says Plymouth Argyle boss - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Plymouth Argyle head coach Miron Muslic says his side showed they still have belief that they can stay up after their 2-1 win over Norwich City.\nRyan Hardie's two first-half goals were enough to ensure just an eighth win of the season for the Pilgrims.\nArgyle remain bottom of the Championship, but are now just four points from safety with six games to play.\n\"We knew the importance of the game and we also knew our situation,\" Muslic told BBC Radio Devon.\n\"We knew we just had to win, and I mentioned in my last speech in the locker room it's about the sacrifice and to give it all, and we have a chance.\n\"It was hard for us to find our way into the game in the first 10 or 15 minutes.\n\"But then you see what momentum means in football - that first goal that was a door-opener for us, that was a big relief, a massive confidence boost inside our team and the Green Army just jumped on this train and gave us this second wave of support.\n\"The first half, after the first goal, was brilliant, maybe one of the best performances in the last couple of weeks.\"", "url": "https://www.bbc.com/sport/football/articles/c4grxvqyjlpo"}