{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:33:03", "date_modify": "2025-05-21 06:33:03", "date_publish": "2025-03-31 16:38:14", "description": "Horne 'delighted' to extend stay at 'exciting' Warriors", "filename": "sport_articles_c8eplwwk1rdo_1747809183.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1ef0/live/1d035140-0e4e-11f0-8fda-f199207bcb26.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c8eplwwk1rdo_1747809183.html", "title": "Horne 'delighted' to extend stay at 'exciting' Warriors", "title_page": "Horne 'delighted' to extend stay at 'exciting' Warriors - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "George Horne has signed a new contract with Glasgow Warriors just days after becoming the club's record try scorer.\nThe 29-year-old scored Warriors' fourth try in Saturday's 42-0 win over Lions to take his club total to 55, which saw him overtake DTH van der Merwe as the United Rugby Championship club's record try scorer.\nThe scrum-half says it was an easy decision to sign a new contract at \"exciting\" Glasgow Warriors, with the club announcing he he signed on \"for the foreseeable future\".\n\"That's the main thing, everyone's been so delighted for me, a lot of congratulations online and stuff, so it's been nice to see,\" he said.\n\"The boys have been great, they recognised it after the game. I'm just thankful to play in a team that gets me on the end of a lot of tries, it's been a cool couple of days.\n\"[I've] Just signed up for another couple of years here, and I think I said after the game, I'm really proud to represent Glasgow, the club and the city as well and obviously delighted to be staying on.\n\"It's a club where I've played my whole professional career at, I love being part of it - the boys, the backroom staff, everyone involved with the club - it's a great place to come into work every day.\n\"Obviously, coming off the back of last year, we're in a pretty good place, but we're desperate to achieve more. It's an exciting club to be a part of at the moment, and I can't wait to see what the rest of this year and the next couple of years have in store.\"", "url": "https://www.bbc.com/sport/articles/c8eplwwk1rdo"}