{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:37:07", "date_modify": "2025-05-21 06:37:07", "date_publish": "2025-01-31 10:28:21", "description": "Portsmouth's new centre-back Hayden Matthews impressed on his debut against Millwall, says ex-Pompey defender Lee Brown.", "filename": "sport_football_articles_ce9n11rz2k0o_1747809427.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0338/live/65f91e20-dfbe-11ef-bd1b-d536627785f2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ce9n11rz2k0o_1747809427.html", "title": "Portsmouth: Hayden Matthews has handled move incredibly", "title_page": "Portsmouth: Hayden Matthews has handled move incredibly - Brown - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Portsmouth's new centre-back Hayden Matthews impressed on his debut against Millwall on Tuesday night despite the 1-0 defeat, according to former Pompey defender Lee Brown.\nThe Australia defender's move to Fratton Park from Sydney FC was only confirmed the day before the Championship game with the Lions but he went straight into the starting line-up.\n\"For a 20-year-old to go in after just getting off a plane, I think he did exceptionally well,\" Brown told BBC Radio Solent's \"Who Needs Mourinho?\" podcast.\n\"He won the majority of his headers, on the ball he looked composed. He was firing the ball out to the full-backs. I thought he defended well. You can look at the goal, but was he isolated by people around him?\n\"You shouldn't really be in that position from a defender's point of view. You should have some bodies around you.\n\"I certainly think you've got a player there. You can tell, little movements and little things that he does on the ball, you can just tell he's got a little bit.\"\nBrown, who made 131 appearances for Pompey between 2018 and 2022, said it was \"incredible\" how Matthews has handled arriving in a new country and playing in front of 20,000 fans within a week of joining.\n\"I remember being 20, I was at QPR making my debut and I was a nervous wreck - I thought 'I'm out of my depth here' and it was daunting,\" Brown said.\n\"It's incredible how he's handled it really. People don't realise how young 20 is, moving country, so the mentality from him is incredible.\n\"He must have a really good head on his shoulders because he didn't look nervous, he didn't look out of place.\"", "url": "https://www.bbc.com/sport/football/articles/ce9n11rz2k0o"}