{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:20:54", "date_modify": "2025-05-21 05:20:54", "date_publish": "2025-04-03 12:44:02", "description": "Kilmarnock news: Fan views on what has gone wrong this season", "filename": "sport_articles_cvgnedr4773o_1747804854.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c69b/live/093c6790-107f-11f0-ba12-8d27eb561761.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cvgnedr4773o_1747804854.html", "title": "Kilmarnock news: Fan views on what has gone wrong this season", "title_page": "Kilmarnock news: Fan views on what has gone wrong this season - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your views on what has gone wrong this season at Kilmarnock.\nHere's what some of you said:\nCraig: Poor team selections and not enough summer signings have been our downfall. Playing players out of form and out of position, also most signings have been bench warmers. Derek McInnes out.\nAndy: We have two very poor goalkeepers to choose from. We should have signed a good keeper in January rather than Calvin Ramsay to sit on the bench. Injuries to key players (Kyle Vassell in particular is very important to us). The coaching team have not developed any of the players in the squad; there is not a single player who is better now than they were a year ago. The manager's constant tactical tinkering must create some uncertainty for players, they often look like they don't know what they're supposed to be doing. The style of play is awful to watch.\nNick: Over the season, if you look at the statistics for many of the games, the final scoreline is not what would be expected. For example, the recent Ross County away game had Killie with 20 shots and County with only five, yet Killie lost 1-0. So there would appear to be effort from the players but the missing players in both defence and, more significantly, in attack may have prevented the defensive lapses and converted more of the shots into goals.\nDavid: No doubt injuries have played their part. However, there is absolutely no confidence in the team and the constant tinkering of formation has an effect on performance. Get back to four defenders, two or four midfielders and two or four forwards. Back to basics and let other teams worry about us rather than McInnes trying to nullify the opposition.\nColin: Almost no mention of the shocking recruitment at Kilmarnock during the summer. Why? It is one of the most important reasons for Killie's poor form. No pressure on places, serious lack of midfield pace.\nFrank: I believe 100% it has been the inconsistency of team selection and tactics by the manager that has caused the current unacceptable position we find Kilmarnock in. Another factor has been injuries to key players who performed well last season. We should have a full squad available for the rest of the season to get us out of relegation or the playoffs, alternatively a change at the top.", "url": "https://www.bbc.com/sport/articles/cvgnedr4773o"}