{"authors": ["Kheredine Idessane", "www.facebook.com"], "date_download": "2025-05-21 06:33:53", "date_modify": "2025-05-21 06:33:53", "date_publish": "2025-01-22 19:47:13", "description": "Clement on Butland return, United struggles & embracing 'big challenge'", "filename": "sport_articles_c203xv822djo_1747809233.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a3ab/live/2df0a990-d8e2-11ef-a289-b3809f04eef2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c203xv822djo_1747809233.html", "title": "Clement on Butland return, United struggles & embracing 'big challenge'", "title_page": "Clement on Butland return, United struggles & embracing 'big challenge' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Clement says he won't be afraid to take a bold approach despite having eight players unavailable. The Ibrox boss is glad to have goalkeeper Jack Butland - \"it's clear what Jack has done\" - and former Old Trafford academy midfielder Tom Lawrence back.\nDespite struggling for numbers, Clement wants his side to \"write history\" with a first win over United and remains upbeat: \"It's about the whole team and the whole squad digging in together.\"\nThe Belgian insists his team \"can hurt any opponent\" and is not paying much attention to United's struggles: \"I'm totally not busy with that, whether the other team is high or low in confidence. We had it a few weeks ago before the Old Firm match when nobody gave us a chance. The team proved what they can do in big moments.\"\nClement is clear about one thing – don't give United any encouragement by making some of the mistakes that have blighted Rangers' domestic season.\nHe says: \"We shot ourselves in the foot a lot of times in the domestic away games. We were dominating and creating chances but not scoring and then making individual mistakes. We need to take lessons from those games.\"\nOn whether this is his biggest game as Rangers boss, given the stage and occasion: \"No, I never think that way. For me, the last game in the cup [against Fraserburgh] I treated with the same respect. The teams knows that also.\"\nClement wants his men to embrace the \"really, really big challenge\", enjoy their time in the limelight and rise to the occasion against one of the most famous clubs in world football.", "url": "https://www.bbc.com/sport/articles/c203xv822djo"}