{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:57:17", "date_modify": "2025-05-21 04:57:17", "date_publish": "2025-04-04 13:28:33", "description": "Ollie Tanner 'buzzing' to make long-awaited Cardiff City return", "filename": "sport_football_articles_c39j0z99g8zo_1747803437.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/978c/live/4e935230-1157-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c39j0z99g8zo_1747803437.html", "title": "Ollie Tanner 'buzzing' to make long-awaited Cardiff City return", "title_page": "Ollie Tanner 'buzzing' to make long-awaited Cardiff City return - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cardiff City winger Ollie Tanner expressed his excitement at returning to action after a lengthy spell on the sidelines due to a knee injury.\nThe 22-year-old missed more than two months of action but came on as a substitute during the Bluebirds' 1-1 draw with Sheffield Wednesday last weekend.\n\"I was buzzing to get back on the field last week. It was my first long-term injury. It was really frustrating,\" he said.\nTanner reflected on the mental and physical challenges of being injured, explaining how it affected his connection with the team: \"You feel really isolated and away from the boys.\n\"You train on your own, do gym work on your own and it's a tough time. But it's part of the game – you get injured and you have to live with it.\"\nWith just seven games remaining in the season and Cardiff currently sitting in the relegation zone, Tanner's return is timely.\nOn Saturday (15:00 BST), the Bluebirds face a Queens Park Rangers side who are on a six-match winless run.\nDespite Cardiff's own struggles, Tanner is fully aware that his place in the starting line-up is not guaranteed - while the wideman spoke highly of team-mate Isaak Davies who also returned from a lengthy absence due to injury.\n\"The boys are playing well and I'm buzzing for Isaak,\" he added.\n\"He's one of my good mates and he's scored a couple of goals. After his injuries, I told him 'I take off my hat to you because, given the amount of time you were out injured, you stayed strong'.\"\nTanner also praised the healthy competition for places within the squad.\n\"The competition can only be a good thing because, in the position we're in at the moment, we need everyone firing,\" he added.\n\"As frustrating as it is for me, if those boys are playing well and we win games, then I don't mind.\"\nAs Cardiff continue their battle against relegation, Tanner's return could provide a much-needed boost for the squad in the final stretch of the season as Omer Riza's side bid to preserve their Championship status.", "url": "https://www.bbc.com/sport/football/articles/c39j0z99g8zo"}