{"authors": ["Adam Blackmore", "www.facebook.com"], "date_download": "2025-04-26 03:50:43", "date_modify": "2025-04-26 03:50:43", "date_publish": "2025-03-05 12:32:40", "description": "Southampton news: Opinion - should Saints move for Danny Rohl?", "filename": "sport_football_articles_cly42934z88o_1745639443.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/231a/live/4c6eb390-777f-11ef-b282-4535eb84fe4b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cly42934z88o_1745639443.html", "title": "Opinion - should Saints move for Danny Rohl? - BBC Sport", "title_page": "Southampton news: Opinion - should Saints move for Danny Rohl? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "In December, Southampton's top target to replace Russell Martin was Danny Rohl. It did not happen, with Sheffield Wednesday owner Dejphon Chanseri \"not picking up the phone\", as it was put to me at the time.\nThe Owls owner confirmed at a January fans' forum that he had received contact from Saints regarding Rohl's availability.\nLess than three months after moving on to Ivan Juric, Saints are again being linked with Rohl. After nine defeats in 10 Premier League games, saying that Juric might not be staying and Saints remaining interested in their former first-team coach is hardly a leap of faith.\nJuric deserves more credit than he will get. He has shaken up a dressing room, made players accountable, acted without ego and with humility, and taken on a job many managers would not have touched, knowing the likely outcome. And he has done all that when he could have stayed in Italy and just taken his payoff from Roma and relaxed.\nBut he has not improved results.\nOver the past three years or so, Sport Republic's recruitment has allowed too many experienced professionals to leave and asked a lot of academy players. Jason Wilcox was not replaced as director of football. And lurching from Ralph Hasenhuttl to Nathan Jones to Ruben Selles to Martin to Juric has not helped the team or the club establish a positive identity.\nHowever, there is now hope. Majority owner Dragan Solac has had enough and decided he needs to take control.\nThis is good news.\nChief executive Phil Parsons has aggressively driven forward off-field revenue streams and the long-term development plan for the waterside area by St Mary's is a feather in his cap. The club recognises the only way to compete and sustain in the long run is by making PSR rules work for them.\nAnd now Johannes Spors is in situ as group technical director. If he is allowed to do his job alongside a manager - using all his experience in analysis and recruitment to improve Saints' player trading, making that manager's job easier - great.\nNow all Southampton need is the next Hasenhuttl; the next manager who can squeeze every last bit out of the squad, help Saints punch above their weight sometimes, play a brand of football his players can execute, and stick around long enough to set the club on a path.\nIs there anyone better than a man who worked under Hasenhuttl at Southampton and RB Leipzig, knows the club and Spors, is highly regarded - and now has plenty of Championship knowledge and experience?\nIf Rohl is that man, what is gained by waiting until the end of the season, rather than giving him a headstart with the squad and the chance to reacquaint himself with Spors before the summer's business?\nAnd what is the benefit of Juric working with the sword of Damocles over his head for the next three months?\nThe optics of three managers in a season are not good, but it is not like Sport Republic has not been here before.\nSouthampton are at Liverpool this weekend, a fixture unlikely to do Juric any favours. Then, before the international break, is a home game against 17th-placed Wolves that could effectively relegate Saints.\nWednesday have got two away matches and the Sheffield derby. They could be realistically out of play-off contention by the international break.", "url": "https://www.bbc.co.uk/sport/football/articles/cly42934z88o"}