{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:28:13", "date_modify": "2025-05-20 13:28:13", "date_publish": "2023-07-25 11:02:56", "description": "Crystal Palace: Zaha 'treasured in all of our memories' - Parish", "filename": "sport_articles_c1vkxdewek3o_1747747693.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/588b/live/6303d2f0-2abb-11ee-8fff-c10eea4d0f3e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c1vkxdewek3o_1747747693.html", "title": "Zaha 'treasured in all of our memories' - Parish", "title_page": "Crystal Palace: Zaha 'treasured in all of our memories' - Parish - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Crystal Palace chairman Steve Parish has paid tribute to Wilfried Zaha after he completed his move to Galatasaray: \"Wilfried Zaha leaves the club having been our best and most influential player. As much as we would have loved him to stay, after long discussions it became clear he wanted a different challenge, to experience something new and somewhere different before the end of his career, and I think that’s something we can all understand.\n\"I would like to personally thank Wilfried for everything he has done for this football club. He leaves as our most-capped academy graduate, our talisman, our greatest player, and he leaves lifelong friends behind.\n\"He remains a true inspiration for all our young players in the academy and at the early stages of their Palace career - all of whom dream of being the next Zaha.\n\"We would not be the club we are today without Wilfried. We are entering our 11th consecutive season in the top flight, and he has spearheaded the vast majority of those campaigns.\n\"A phenomenal player, who gave us incredible moments on the pitch and worked hard in the community helping inspire people off it. He will be treasured in all of our memories.\n\"Good luck, Wilfried. I like many Palace fans will watch from afar and wish you every success on your new adventure.\"", "url": "https://www.bbc.com/sport/articles/c1vkxdewek3o"}