{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:58:20", "date_modify": "2025-05-21 05:58:20", "date_publish": "2025-02-01 00:00:00", "description": "Reaction as Wolves beat Aston Villa to end winless Premier League run, after wins for Liverpool, Everton, Southampton, Fulham and Nottingham Forest.", "filename": "sport_football_live_clyng79g38dt_1747807100.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_clyng79g38dt_1747807100.html", "title": "Premier League LIVE: Six games including Nottingham Forest v Brighton, Everton v Leicester City, Bournemouth v Liverpool, Newcastle United v Fulham", "title_page": "Premier League LIVE: Six games including Nottingham Forest v Brighton, Everton v Leicester City, Bournemouth v Liverpool, Newcastle United v Fulham - radio commentary, live text and score updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "'Cunha can create a goal from nothing'\nFT: Wolves 2-0 Aston Villa\nWolves\nMore from Wolves boss Vitor Pereira speaking to Sky Sports: \"When we put Cunha as a striker, man to man in the last line, we know he can receive a ball and create a goal against one player or two players. He can create a goal from nothing. He is a special player and he is a player that for us, that gives us a lot of things.\n\"I think he is committed with us. The last conversation we had, he said to me 'I will help the team to be in the Premier League next season and then at the end of the season we will see.' He is very committed to us, to his team-mates and to the club.\n\"It will be a long way and with this quality, I believe and I am sure we will be in the Premier League next season.\"\n'We played with true spirit'\nFT: Wolves 2-0 Aston Villa\nWolves\nWolves boss Vitor Pereira speaking to Sky Sports: \"We played today tactically a very good game and with the true spirit and energy. Everything was on the pitch today and I think we deserve this result.\n\"I understand that Villa had their game three days ago and the intensity of this team is really good and they play with high quality and when they come, I know that maybe they will be a little tired. In the end they had a pace on the game and intensity and were difficult to beat.\n\"We were tactically strong to understand the moments of the game. The moments we should press, the moments we should wait. We were committed with the tactical work and tried to explore the spaces. We created chances and I believe if we scored the second goal in the first half it would have been difficult.\"\n'We need some players'\nFT: Wolves 2-0 Aston Villa\nAston Villa\nAston Villa boss Unai Emery told BBC Sport: \"I was frustrated. Still work to do. The frustration is with the ambition we have.\n\"We are not Manchester City - the teams strong in everything. We are increasing our level, our demand but we don't have the power they have. We have to do it intelligently. To get Europe two years in a row and be in the last 16 this year is fantastic. To be consistent in the Premier League has been more difficult for us.\n\"We competed today at the beginning, trying to get this challenge. First half was really bad. We started well but didn't control the game.\n\"We needed it [changes]. Fresh legs. Tactical change with Bailey going wide. Second half we were better. We created two or three changes to score.\n\"I think we deserved to lose.\"\nOn Ollie Watkins' injury: \"A little bit. He felt some pain but hopefully not a lot. We'll test him tomorrow.\"\nOn new signings: \"We need some players. We need to replace some players who left. Tomorrow and Monday are the last two days. I think we'll get some players to help us because we're in the Champions League last 16. We have to try to get points in the Premier League to be top eight, seven, six, five.\"\n'Cunha is committed with us'\nFT: Wolves 2-0 Aston Villa\nWolves\nWolves boss Vitor Pereira told BBC MOTD: \"Very happy. Very proud. We played a tough game. Tactically we played with quality.\n\"We played as a team with true spirit, working together and suffering together.\n\"I'm very happy. Important game not only for the three points but to break this [bad run].\n\"We know this kind of team [Villa] will come strong and try everything. We organised the block. A clean sheet for us. For everyone we are happy.\n\"We know it's a long way, a difficult way. With our supporters and this spirit we can do it.\n\"It was a block on our player [for Villa's disallowed goal]. In the moment it looked offside. I was calm.\"\nOn Matheus Cunha: \"He has this quality. A special player. He's committed with us. He knows in the future he can play for the best teams in England but he's committed with us.\"\n'It will take time to build the team'\nFT: Wolves 2-0 Aston Villa\nAston Villa\nMore from Aston Villa manager Unai Emery speaking to Sky Sports: \"We tried to give fresh legs and tactically tried to change things (in the second half). Watkins had a small pain and hopefully it is not a big injury he has. I needed to introduce some fresh legs and something tactically with Leon Bailey getting wider.\n\"We had two chances from Malen that the goalkeeper saved really well and then the goal VAR refused. We controlled it better and the last one they scored the goal but in the second half we didn't conceded many chances.\n\"We are speaking about our ambition and increasing our levels and then when we are not getting it, the frustration we have. We are still building a team. We got Champions League this year and are competing well but to build a team to be competitive in the high demands, we need more time.\"\nOn links with Manchester United forward Marcus Rashford: \"I am going to wait for the last two days (of the transfer window).\"\n'We deserved more'\nFT: Wolves 2-0 Aston Villa\nAston Villa\nAston Villa manager Unai Emery speaking to Sky Sports: \"We tried. We started very well in the first 15 minutes but when they scored the goal it was more difficult to come back. We had more chances to score the second goal and in the second half we tried to push. We competed better but we had two chances to score and maybe if we score it is different. Over 90 minutes, we deserved more.\"\nOn Donyell Malen's ruled out goal: \"It is VAR's task. They watched it and told me. It was not offside because he did not touch the ball. But it is VAR's task. Even sometimes I think they are making mistakes.\"\n'We just weren't good enough and can't have excuses'\nFT: Wolves 2-0 Aston Villa\nAston Villa\nAston Villa defender Ezri Konsa speaking to Sky Sports: \"We just weren't good enough today. Simple as that. Second half we performed better but we didn't have enough. We can make excuses about being fatigued but if we want to play Champions League we have to be prepared to play this much.\n\"This season, away from home, we have conceded early quite a lot and it is something we have to work on. Second half was better but it wasn't enough. We put pressure on but I don't think we troubled their back four or goalkeeper enough. We have to improve and we have to do it now.\"\nOn Donyell Malen's goal being ruled out: \"I thought it was a normal goal. It is gone now and nothing we can do.\"\nOn building for the future: \"I think we have to stop conceding goals. I feel like we are conceding every game and me, being in the back line, I have to go back and look on it and change it.\"\n'Type of win that can rally whole club'\nFT: Wolves 2-0 Aston Villa\nWolves\nWolves defender Matt Doherty told Sky Sports: \"We knew how important this was after four losses in a row. The teams around us lost today. We knew Villa had a lot of players missing. We knew it was a big opportunity and we took it. If you do the basics right the results will come. We did what the manager told us - we know we’re good enough to get points. Today was a good performance.\n\"[We had to do] a lot of defending. That’s the Premier League – you’re defending to the last minute. It's the best league in world, the hardest league in world. You have to be switched on for the whole game.\n\"We know how good Jose Sa is. He can make incredible saves you’d expect other keepers not to make.\n\"We hope so [it can be a springboard]. We know we’re good enough to beat anyone on our day. This is the type of win that can rally the whole club.\"", "url": "https://www.bbc.com/sport/football/live/clyng79g38dt"}