{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:31:24", "date_modify": "2025-05-19 14:31:24", "date_publish": "2017-08-25 11:37:03", "description": "David Brooks is included in the Wales Under-21 squad for their European Championship qualifiers despite seeming to turn his back on Wales.", "filename": "sport_wales_41050262_1747665084.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/14EC7/production/_97530758_gettyimages-694533646.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_wales_41050262_1747665084.html", "title": "David Brooks: Player who switched allegiance to England is named in Wales squad", "title_page": "David Brooks: Player who switched allegiance to England is named in Wales squad - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "David Brooks is in Wales' Under-21 squad for European Championship qualifiers after previously choosing to play for England.\nSheffield United's Brooks, 20, was named in England's squad for the Toulon Tournament in May, just 11 minutes after he withdrew for Wales' squad.\nHe was England's player of the tournament in France.\nWales travel to Switzerland on 1 September before taking on Portugal in Chaves four days later.\nAge-grade manager Robert Page had also named Liverpool youngster Harry Wilson in his squad but he was a late withdrawal along with Aron Davies, with Cian Harries and Liam Cullen called up.\nwhile George Thomas - who recently completed a move to Leicester City - is also included.\nOn Brooks, Page said: \"It was like we said in the summer. He is dual nationality so went to Toulon with England.\n\"He always said from day one he was keen to play for Wales and we were never going to close that door on him.\n\"Having had that conversation, that was never going to change, he was still keen to play for Wales. That shows that in his selection in the squad.\n\"He got player of the tournament in Toulon. I have watched him closely playing and recognised the lad had something.\n\"Only the lad can answer that [whether he will commit to Wales or England]. What's nice is that he is showing he is committed and wants to be part of the squad.\"", "url": "https://www.bbc.com/sport/wales/41050262"}