{"authors": ["George O'Neill", "www.facebook.com"], "date_download": "2025-05-21 03:42:47", "date_modify": "2025-05-21 03:42:47", "date_publish": "2025-04-06 17:41:36", "description": "Hearts, St Mirren and Motherwell are all battling for the one remaining top-six spot in the Scottish Premiership. Who will prevail next weekend?", "filename": "sport_football_articles_cvg74jqzxwwo_1747798967.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d0bb/live/121b1930-1307-11f0-b234-07dc7691c360.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cvg74jqzxwwo_1747798967.html", "title": "Scottish Premiership top-six race goes down to final game", "title_page": "Scottish Premiership: Top-six race goes down to final game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Hearts' defeat by Dundee United on Sunday means the composition of the Scottish Premiership's top six will not be decided until a nervy finale next weekend.\nThe Edinburgh side would have joined Celtic, Rangers, Hibernian, Aberdeen and United in the top half had they prevailed.\nBut James Wilson's red card and Sam Dalby's 14th league goal opens the door for St Mirren and Motherwell, who both would have feared that away defeats on Saturday had ended their chances.\nWith just one point separating the three teams, it really is all to play for.\nFor the uninitiated, Scotland's top flight splits in half after the 12 clubs have played each other three times.\nThe top six sides then play each other once more, as do the bottom six, taking us to 38 matches played and the final league standings.\nThe other thing to note is that because the teams in each half of the table are set after the split, the team in seventh could theoretically finish on more points than the team in sixth.\nHearts still occupy sixth place on 39 points, while St Mirren and Motherwell are a point further back.\nThe Tynecastle outfit have by far the best goal difference, with Motherwell's by far the worst.\nThe battle for the final top-six spot is made even more interesting by the fact Motherwell and Hearts face off at Fir Park on Saturday (15:00 BST).\nThat match becomes a straight shootout if St Mirren fail to beat Ross County in Paisley at the same time.\nWere St Mirren to win, only Hearts could deny them... unless Motherwell were to win by 10 or more goals.\nThat feels unlikely. Not least given their biggest margin of victory in the league this season is two goals.\n\"If we win, we're there,\" Hearts head coach Neil Critchley said after the United defeat. \"We know what to do. That's what we'll be concentrated on.\n\"We'll be going to Motherwell doing everything we can to win. You've got to thrive in those moments as show what you're about. We're looking forward to it.\"\nObviously, the SPFL cannot release post-split fixtures until the top six clubs are confirmed on Saturday.\nFrom there, it is expected they will announce the final five rounds of games at the start of the following week, beginning 14 April, after talks with the SPFL, police and broadcasters.", "url": "https://www.bbc.com/sport/football/articles/cvg74jqzxwwo"}