{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:33:42", "date_modify": "2025-04-26 04:33:42", "date_publish": "2025-03-06 00:00:00", "description": "Lucas Bergvall's own goal leads to a flat Tottenham losing the first leg of their Europa League last-16 tie at AZ Alkmaar.", "filename": "sport_football_live_cn52xd422ykt_1745642022.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1275/live/e1fe6600-fac2-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_cn52xd422ykt_1745642022.html", "title": "AZ Alkmaar 1-0 Tottenham: Lucas Bergvall scores own goal as Spurs lose first leg", "title_page": "AZ Alkmaar 1-0 Tottenham: Lucas Bergvall scores own goal as Spurs lose first leg - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Lucas Bergvall's own goal led to a flat Tottenham losing the first leg of their Europa League last-16 tie at AZ Alkmaar.\nAnge Postecoglou's side only had one late shot on target - and only two inside AZ's box all night.\nThe difference ended up inadvertently being teenager Bergvall, who shinned an attempted clearance from Troy Parrott's cross into his own net.\nSpurs needed goalkeeper Guglielmo Vicario to come up with three big saves to keep them firmly in the tie - including to deny former Spurs striker Parrott.\nBut Tottenham will have to do without midfielder Rodrigo Bentancur in next Thursday's home leg after his third booking of the season.\nThe visitors created little of note in a muted display. Substitute Wilson Odobert's cross-shot was parried away by AZ keeper Rome-Jayden Owusu-Oduro and he headed over the bar right at the end.\nTo make Spurs' night even worse, striker Dominic Solanke - making his return after seven weeks out with a knee injury - had to be replaced 20 minutes after coming on and hobbled off the pitch.\nOne of the soundbites of Spurs' campaign has been Postecoglou's quote in September that he always wins a trophy in his second season with a team - a claim that is mostly accurate.\nBut Spurs will have to improve - starting with actually creating some good chances - next week if he is to have a chance of continuing that run.\nThe Europa League is Spurs' last chance of silverware this season. Fail to win the second leg and they will probably not even be in Europe next season, given they are currently 13th in the Premier League.\nAZ, who are sixth in the Dutch Eredivisie, were deserved victors and could have won by more.\nErnest Poku had four efforts, with three each for Republic of Ireland striker Parrott and substitute Denso Kasius.\nThe hosts' biggest chance to score a goal themselves came when Parrott, who left Spurs for £6.7m in the summer, was sent through on goal but denied by the foot of Vicario.\nBergvall was unfortunate to score the own goal when Parrott volleyed a ball across and the Tottenham midfielder badly sliced his clearance which Djed Spence was unable to head off the line.\nSpurs' chances were few and far between. Bergvall flashed a near-post header wide from a James Maddison corner. Son Heung-min had a shot blocked and Brennan Johnson, Son and Bergvall all missed the target from about 20 yards out.\nOdobert had an effort saved, although it may not have even been a shot, and should probably have done better when he headed over in the 95th minute.", "url": "https://www.bbc.co.uk/sport/football/live/cn52xd422ykt"}