{"authors": ["Adonis Storr", "www.facebook.com"], "date_download": "2025-04-26 04:22:49", "date_modify": "2025-04-26 04:22:49", "date_publish": "2025-03-03 13:32:21", "description": "Fan writer Adonis Storr says Leeds United CEO Angus Kinnear's impact will only be known after his departure.", "filename": "sport_football_articles_cvgpdzd99n8o_1745641369.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/12d0/live/f7c09700-f82f-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cvgpdzd99n8o_1745641369.html", "title": "Leeds United opinion: Angus Kinnear would leave a confusing legacy", "title_page": "Leeds United opinion: Angus Kinnear would leave a confusing legacy - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "As reported by the Daily Mail, external, Leeds CEO Angus Kinnear seems like he will be joining Everton at the end of this season.\nKinnear has had a turbulent time at United, and it has always been unclear precisely what decisions he was responsible for.\nOther leaders within the club have been assigned the responsibility for many of the major decisions during his tenure.\nLeeds peaked at ninth in the Premier League under Kinnear, but it was Marcelo Bielsa who was credited with that rise. And rightly so, Bielsa transformed the mid-table Championship squad he inherited.\nAnd ultimately Victor Orta was credited with the hiring of the Argentinian.\nOrta – a larger than life figure – was praised and criticised in equal measure during his time at Leeds. He brought Bielsa to the club, but for every Raphinha-type signing there was a Diego Llorente-type; and of course Jesse Marsch who failed spectacularly, was also Orta's man.\nAndrea Radrizzani's imprint on certain decisions could be more easily inferred. Six weeks after Leeds went on a much-criticised, post-season tour of Myanmar, Radrizzani's Eleven Sports signed a global rights deal to broadcast the Myanmar National League.\nPerhaps the clearest indication of Kinnear's input were his programme notes and his annual interview with the Square Ball podcast.\nThe now abandoned programme notes made national news in December 2021 when he branded calls for an independent football regulator as \"Maoist\".\nSome CEOs become synonymous with their brands. Kinnear's strategy of shirking the spotlight seems deliberate, perhaps to avoid the kind of scrutiny that Tottenham chairman Daniel Levy is currently experiencing.\nPerhaps only in Angus' absence will Leeds fans get an appreciation of the impact he had. Clearly Everton see the value of him.\nBut Kinnear's departure will mark the completion of 49ers Enterprises restructure, as they leave one of the last links to Radrizzani's ownership behind.", "url": "https://www.bbc.co.uk/sport/football/articles/cvgpdzd99n8o"}