{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:18:00", "date_modify": "2025-05-21 04:18:00", "date_publish": "2025-01-08 00:00:00", "description": "Listen to Sportsound commentary from Celtic Park and follow text updates of two Scottish Premiership fixtures.", "filename": "sport_football_live_cn8gw2njny9t_1747801080.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cn8gw2njny9t_1747801080.html", "title": "BBC Sport - BBC Sport", "title_page": "Scottish Premiership - Leaders Celtic among four teams in action - radio & text: BBC Sport - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cheerio\nThat'll do us for tonight.\nYou'll get more reaction, analysis and be able to give your views on our dedicated club pages throughout the night.\nWe'll be back tomorrow with coverage of Dundee v Rangers.\nG'night.\n'We believe Dalby is staying for the season' - Goodwin\nFT: Celtic 2-0 Dundee Utd\nOn January business, specifically Sam Dalby's position, Dundee United boss Jim Goodwin adds: \"There's constant dialogue there between ourselves and Wrexham.\n\"Sam has been terrific, we believe he is going to stay here for the remainder of the season.\n\"There's still a lot of time left in the window but we have to take Wrexham at their word that Sam is going to stay here and continue his development.\"\nOn potential incomings, Goodwin says: \"We've identified a couple of potential targets and we'll work hard behind the scenes to try and get one or two of those over the line.\"\nGoodwin pleased by United's effort\nFT: Celtic 2-0 Dundee Utd\nDundee United manager Jim Goodwin tells BBC Scotland: \"The players definitely weren't at 100% in terms of energy levels so the game plan had to be about conserving energy.\n\"It was working for large parts. We're disappointed with the first goal, I think we cause our own problems. I don't know if there was a handball in there but Luke McCowan has the shot, Jack Walton makes the save and I think it takes a really bad bounce in front of him.\n\"The players kept going that was the really pleasing aspect, they didn't throw the towel in. We had one or two opportunities to put the ball into dangerous areas but none of those opportunities fell kindly to us in the box.\n\"We can't have too many complaints about the result, the players gave absolutely everything.\n\"We have to dust ourselves down over the next 48 hours and put a good team on the park to go and win the game on Saturday.\"\nRodgers hails players for dealing with hectic schedule\nFT: Celtic 2-0 Dundee Utd\nCeltic manager Brendan Rodgers tells BBC Scotland: \"No matter how dominant you are you're going to have to defend for some of the spells.\n\"You have to deal with that and fairness to the players they did that really well. Then we get the second goal and put the game to bed.\n\"There are two teams playing in the game, you want to get into the areas. I think in the first half we could have crossed the ball a bit more.\n\"I can't fault the players, they're giving everything in what is a real demanding schedule. When you're the team having to take the game to the opponent, it takes a big big effort and I think the effort was there from the players.\n\"Once we weathered the storm we finished the game really well.\n\"I have to give huge credit to our players because to play how we want to play takes a lot of effort and energy and mobility.\n\"The game shows you all the time that you can't give very little and get a lot back, you have to give everything to the game.\"\nDeserved win but not as comfortable as seemed likely\nFT Celtic 2-0 Dundee United\nMartin Dowden\nBBC Sport Scotland at Celtic Park\nIt's another step towards the title for Celtic, who enjoy a handsome lead that's very unlikely to be bridged.\nThey looked on course for a routine, dominant win at half-time, but credit must go to Dundee United who asked a lot of questions after the break.\nThey are clearly not third in the table by accident.\nThat said, what tonight may have highlighted is a need for more quality options out wide for Celtic.\nThe absence of Nicolas Kuhn clearly made a difference to Celtic's ability to cut their opponents open.\nFULL-TIME Kilmarnock 0-0 Motherwell\nThe Kilmarnock players are incredibly frustrated. They should have won this game.\nIn the first half they had Brad Lyons' goal ruled out for offside, then their captain hit the bar amid other chances and good saves from Motherwell goalkeeper Aston Oxborough.\nMotherwell, who were abysmal in the first half, at least came to the party after the break. They might even have stolen it when Stephen O'Donnell was played through near the end.\nThe defender put his shot wide though. Motherwell will grab the point and bolt back up the M77.", "url": "https://www.bbc.com/sport/football/live/cn8gw2njny9t"}