{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:03:04", "date_modify": "2025-05-21 05:03:04", "date_publish": "2025-04-04 09:00:44", "description": "Chrissy McKaigue says it's vital for Derry that fitness doubt Brendan Rogers plays in the Ulster SFC opener against Donegal after he is named in the team.", "filename": "sport_articles_c1dr3rpqx5wo_1747803784.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0330/live/ad14bda0-1132-11f0-8874-0979deb646d0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c1dr3rpqx5wo_1747803784.html", "title": "Ulster SFC: Brendan Rogers' absence for Derry in Donegal opener would be 'massive'", "title_page": "Ulster SFC: Brendan Rogers' absence for Derry in Donegal opener would be 'massive' - Chrissy McKaigue - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Chrissy McKaigue says Brendan Rogers being ruled out of Derry's Ulster Championship opener against \"overwhelming favourites\" Donegal would be a massive blow for the Oak Leafers.\nRogers has been named at full-back for Sunday's Ballybofey contest which will be live on the live on BBC Two NI, BBC iPlayer and BBC Sport website but his fitness has been in some doubt after he was forced to miss Derry's final two Allianz Football League games as they eventually suffered relegation.\nPaddy Tally's struggling side are already minus former All-Stars Gareth McKinless and Conor McCluskey in addition to goalkeeper Odhran Lynch and Anton Tohill because of injury.\nCiaran McFaul, Lachlan Murray and Niall Loughlin have also been bothered by knocks in recent weeks although McFaul and Murray have been named in the starting team with Loughlin included in the substitutes.\nWith Lynch ruled out, goalkeeper Neill McNicholl is one of three championship debutants alongside Martin Bradley and Dan Higgins, who will partner Conor Glass in midfield.\n\"It [Rogers being ruled out) would be massive and possibly a game definer,\" said McKaigue over the fitness concerns in relation to his Slaughtneil club-mate.\n\"If Donegal play Michael Murphy from the start which you would imagine on the edge of the square, Brendan is either going to be needed there or he's going to be needed to play against a lot of potential Donegal midfield pairings, Ciaran Thompson, Michael Langan, Hugh McFadden and the list goes on.\n\"Donegal are very strong aerially and Brendan will be needed at some end of the pitch.\"", "url": "https://www.bbc.com/sport/articles/c1dr3rpqx5wo"}