{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:16:42", "date_modify": "2025-05-20 14:16:42", "date_publish": "2023-07-29 15:54:05", "description": "It is a relief that Keira Walsh's knee injury is not her ACL but her World Cup is still in the balance, says England's record goalscorer and BBC Sport pundit Ellen White.", "filename": "sport_football_66336118_1747750602.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/10465/production/_130416666_ellenwhitecolumn.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66336118_1747750602.html", "title": "Women's World Cup 2023: 'I just hope Keira Walsh still has a chance to shine' - Ellen White column", "title_page": "Women's World Cup 2023: 'I just hope Keira Walsh still has a chance to shine' - Ellen White column - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It is a relief to hear that Keira Walsh's knee injury is not to her anterior cruciate ligament, but her World Cup is still in the balance.\nAfter fearing the worst when she was hurt against Denmark, I am so pleased for her that it is not another ACL - the thing that everyone talks about and no-one wants - but we are still waiting to find out the full extent of what has happened.\nKeira will definitely miss England's final game in Group D, against China on Tuesday, which is disappointing for her, but hopefully the door is still open for her to play if we progress to the knockout stage.\nIt's a big boost for the team that she is not going home, because she is such a big influence on and off the pitch, and that suggests there is a chance she could feature again in this tournament.\nAssuming England reach the last 16, they play that tie on Monday, 7 August, while our quarter-final would be Saturday, 12 August.\nDepending on how bad Keira's injury is, it could become a race against the clock for her to play in either round but, if we were to make it as far as the semi-finals on Wednesday, 16 August, then you would still want to see her back for that game if it's at all possible.\nThere's always hope, and it would be amazing if she was still able to return at this World Cup because it should be her time to shine.\nI know exactly how gifted she is as a footballer from our time together with Manchester City and at international level, and this tournament was the chance for her to show just how good she is, on a global stage.\nKeira was one of England's best players, if not THE best, when we won last summer's European Championship and I feel like she has got even better since her world-record move to Barcelona shortly afterwards, which she fully deserved.\nShe has thrived in Catalonia, and came to Australia on the back of an amazing debut season that saw Barca win the Champions League. I've been looking forward so much to watching her shine for the Lionesses again.\nIt would be cruel if she does not get another opportunity and, for as long as she is sidelined, her absence leaves a huge void in this England team that I'm not quite sure how we will fill.\nI felt like the Euros was when everyone else really noticed and appreciated Keira's role as a 'number six' or holding midfielder and how influential she is for England.\nShe was pivotal for our system to work, really - she plays in such a key position for the team, and she does it so well.\nKeira is brilliant at receiving the ball under pressure and starting attacks, and her positional awareness is just unbelievably good, in and out of possession.\nYou might not notice, but she is so smart that she also has the ability, if she is marked, to take opposition players away and free up space for a centre-half like Alex Greenwood to drive forward.\nOn the ball, she is very clever herself too. I already knew how good she was, technically, from training with her day in, day out at City but she had quite a rigid role there.\nWhereas, at Barca, she is given more licence to go forward which has elevated her all-round game, without losing her defensive discipline which is so important for England.\nIt does feel like she is irreplaceable in the England team because we don't have anyone else quite like her.\nAt the Euros, all our play came through Keira and she linked everything up. I never really thought about what we would do without her, but Sarina Wiegman is the best coach in the world right now and is so thorough with her approach, I am sure she has got a Plan B.\nShe will have to make that call using the depth in her squad and trust someone to play in that position and, although the situation is sad for Keira, it is a chance for another player to step up.\nIt is going to be interesting to see what happens against China, because although we still need something to be sure of reaching the last 16, it is also the only chance to see what works without Keira before the knockout stage.\nWhoever does come into our midfield, I think it is important that we adapt to their style of play, rather than just saying 'you have to play exactly like Keira'. That's almost impossible, anyway.\nWe obviously have a system and a 4-3-3 shape that Sarina likes, but you have to use the characteristics of the individuals in the team too, and play to their strengths.\nLaura Coombs replaced Keira against Denmark and initially it seemed like she was going to take her role as the 'six', but later on it was Georgia Stanway who was staying deeper, which meant we missed some of her attacking ability.\nYou could ask more than one player to hold, but the danger there is that you affect the dynamic of the whole team, rather than just asking one player to adapt their game.\nOne possibility is if we keep Rachel Daly and Lauren James on the left-hand side, which worked so well against Denmark when Daly was flying forward from full-back and James was cutting inside.\nI already thought we needed more balance at the back when that happened, because sometimes Lucy Bronze was high up the pitch from right-back at the same time too, and we ended up getting exposed down that flank. The gaps and spaces we were leaving were too big.\nBut, If Bronze stays back while Daly goes forward, that's a shape that could work without Keira.\nOur back four becomes a back three and, with just one holding midfielder, we still have that security of having four at the back while allowing our other midfielders their freedom.\nThat discipline and diligence I spoke about earlier is still important though.\nThere was a point just after Coombs came on against Denmark where all three of our midfielders pushed forward at the same time, which cannot happen again.\nI love to see an attacking outlook but, as this tournament progresses, the opposition is going to get stronger and stronger and we need to make sure we always properly protect our defence when Keira is not available.\nIf we don't do that, we are going to get punished.\nEllen White was speaking to BBC Sport's Chris Bevan.", "url": "https://www.bbc.com/sport/football/66336118"}