{"authors": ["Matthew Henry", "www.facebook.com"], "date_download": "2025-05-21 05:32:06", "date_modify": "2025-05-21 05:32:06", "date_publish": "2025-04-02 18:21:50", "description": "Jos Buttler says he was motivated by \"a few months of pretty unenjoyable cricket\" after leading Gujarat Titans to an eight-wicket victory over Royal Challengers Bengaluru.", "filename": "sport_cricket_articles_c367p5590xzo_1747805527.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/bb1b/live/455bada0-0fec-11f0-8071-effa4d8e1d75.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c367p5590xzo_1747805527.html", "title": "IPL 2025: England's Jos Buttler hits 73 not out to lead Gujarat Titans to victory over RCB", "title_page": "IPL 2025: England's Jos Buttler hits 73 not out to lead Gujarat Titans to victory over RCB - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jos Buttler said he was motivated by \"a few months of pretty unenjoyable cricket\" and his mistakes behind the stumps as he led Gujarat Titans to an eight-wicket win against Royal Challengers Bengaluru in the Indian Premier League.\nButtler, who gave up the England white-ball captaincy after their Champions Trophy exit, accelerated after a careful start to make 73 not out and expertly steer home a chase of 170 with 13 balls to spare.\nBatting at number three, he took only nine from his first 10 balls before a pull for four and two sixes, the first a top-edge over the wicketkeeper, got him going.\nHe finished with five fours and six sixes in his 39-ball knock as he put on 75 with opener Sai Sudharsan and an unbroken 63 with Sherfane Rutherford.\nButtler's commanding innings came after he dropped RCB opener Phil Salt and missed a stumping chance to dismiss another England team-mate in Liam Livingstone, who top-scored with 54 in the hosts 169-8.\n\"I was pretty embarrassed,\" said Buttler, who made 54 and 39 in his previous two innings at this year's IPL.\n\"The only thing I can think of is I was trying to throw it [the catch] up a bit early [to celebrate]. I barely got a glove on it. It hit me in the chest.\n\"Due to that embarrassment I was pretty determined to score some runs.\"", "url": "https://www.bbc.com/sport/cricket/articles/c367p5590xzo"}