{"authors": ["Arthur Renard", "www.facebook.com"], "date_download": "2025-05-21 07:49:53", "date_modify": "2025-05-21 07:49:53", "date_publish": "2025-05-18 17:07:15", "description": "Ajax held a nine-point lead at the end of March, but PSV Eindhoven pipped them to the Eredivisie title. Former midfielder Wim Jonk tells BBC Sport about how it all unfolded.", "filename": "sport_football_articles_c74nz813yr0o_1747813793.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4d0b/live/42191f80-340c-11f0-96c3-cf669419a2b0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c74nz813yr0o_1747813793.html", "title": "A tale of nine points & the 99th minute", "title_page": "A tale of nine points & the 99th minute - how Ajax blew the Eredivisie title - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Six weeks ago it looked inevitable Ajax would win a record-extending 37th Eredivisie title.\nAjax have not laid their hands on the trophy since 2021-22, but a 2-0 win at second-placed PSV Eindhoven on 30 March sent them nine points clear.\nIt felt like any talk of a title race was done and dusted.\nPSV captain Luuk de Jong conceded that with seven games remaining they had to focus on securing second place.\n\"Nine points is too much - I don't think it's ever been made up with so few games left. We're focusing on that second Champions League spot,\" De Jong told ESPN after the game.\nFast forward one and a half months and PSV fans were going wild in their own stadium.\nPSV had just wrapped up a routine 4-1 win against Heracles when reports filtered through that Ajax had conceded a 99th-minute equaliser at 10-man Groningen.\nThose two results meant PSV remarkably climbed to the summit, one point above Ajax.\nPSV had won six games in succession since the hammer blow of defeat at the hands of Ajax, while their title rivals seemed to have let complacency slip in - dropping 10 points across four fixtures.\nAjax required a favour from Sparta Rotterdam on the final day of the season, but PSV secured a routine 3-1 win to ensure the title would remain in Eindhoven for another year.\nLike many football fans in Europe, former Ajax and PSV midfielder Wim Jonk started to follow the top-of-the-table battle more intensely as is became a tight race in the latter weeks.\n\"Ajax have come a long way and then managed to build up a big lead,\" said Jonk.\n\"But the moment you drop points the outside world will start talking and then the question is what will happen psychologically within the team?\n\"You could see it with Ajax - as the pressure mounted, their game started to freeze up. It's not about a lack of quality because there are some good players in that squad.\"\nJonk could see it particularly in the home games against Sparta Rotterdam and NEC Nijmegen, when Ajax performed below par.\n\"When something went wrong during the match, it looked like something switched in their minds - 'What's going on here?'\" added Jonk.\n\"That's where structure comes in - you need something solid to fall back on and from that structure, confidence grows again.\"\nAjax's capitulation only tells one half of the story, though.\nPSV's turnaround is made even more incredible by the fact they previously held a nine-point lead over Ajax in December.\nThe unexpected twists have somehow become a recurring pattern. In late October there were no signs this season would end up being such a rollercoaster.\nPSV won their first 10 games convincingly, just in the same impressive fashion that led them to the league title last season.\n\"Under [manager] Peter Bosz they played some fantastic football - by far the best team in the league at the time,\" said Jonk.\n\"Very dominant, high pressing - really entertaining to watch. I was curious to see whether that would carry on into the new season.\n\"In the beginning it actually did - in the first half of the campaign you could still see a lot of those same mechanisms.\"\nThe low point for PSV came in early March, when they lost 7-1 at home to Arsenal in the first leg of their Champions League last-16 tie.\nLater that month, PSV lost 2-0 at home against Ajax and were suddenly nine points adrift in the Eredivisie table.\n\"The question is then, is there still that hunger to set egos aside and fully commit to one shared goal?\" Jonk said.\n\"The moment you start to lose even a little bit of that, you know things can quickly start heading in the wrong direction.\n\"Of course a bit of luck plays a role, but in many ways you earn that luck. What matters most is winning your own games and what happens elsewhere is out of your control.\"\nPSV went on a winning run, but then there was one moment in which it almost slipped away from them, when they played at Robin van Persie's Feyenoord on 11 May.\nThe hosts cruised into a 2-0 lead by half-time and were on track move into second place, putting PSV's direct qualification for the Champions League in jeopardy.\nThe plot twist was symbolic of this season, but the second half provided a new turn of events. PSV came back to 2-2, before former Ajax winger Noa Lang scored the winner in the 99th minute.\nShortly after that match it was Ajax's turn.\nFrancesco Farioli's side fell to a 3-0 defeat against NEC Nijmegen - who had never previously won at Ajax in the league.\nStill, matters were in Ajax's hands when they travelled to Groningen three days later.\nBut the story of this match also came to a head in the 99th minute, as the home side, reduced to 10 men in the 93rd minute, stunned the league leaders with a late equaliser.\n\"What do you do when you're leading with just a few minutes to go? Do you drop deep or do you push up?\" said Jonk.\n\"Ajax started dropping back - instead of stepping forward - even while they were playing with an extra man.\n\"It's a pity, as the team doesn't reach the level it's capable of in those moments. Ajax clearly have experience and quality in their squad.\"\nDespite Ajax throwing away a healthy lead, Jonk believes they do still have plenty of positives to take from the season.\nJonk, who is assistant coach with the Netherlands, can see how the likes of Jorrel Hato, Kenneth Taylor, Brian Brobbey and Youri Baas have developed their game with all being called up to the national team in recent matches.\nAnd then there is former Liverpool skipper Jordan Henderson, who has been important in his role as a captain.\n\"Henderson is a leading player,\" said Jonk.\n\"You could see he had a difficult start at the club, but this season he's been much better. He is coming into his own game now the structure around him, especially defensively, has improved.\"\nSeveral Ajax players have indicated how England midfielder Henderson has been important off the pitch, too, with his dedication and professionalism helping a young Ajax team in their development.\nAfter a very difficult 2023-24 campaign, they seemed to be on their way to the title this season.\nRemarkable as well was that they won all their games against PSV and Feyenoord, but then started dropping points in the final few matches and losing the top spot in the penultimate game.\nJonk experienced a very close title race as an Ajax player in 1991, when they lost a crucial penultimate game 1-0 at SVV, who were fighting relegation.\nIn the end they lost the title to PSV on goal difference.\n\"In those final matches of the season, a huge amount of pressure can build on a team - especially when everything is on the line,\" Jonk said.\n\"Staying close-knit as a team is crucial and sometimes you need a bit of luck as well.\n\"I remember in the SVV-Ajax match that we created a lot of chances, but didn't score. Then we conceded one chance which went in. Those are the moments that just happen in football.\n\"You've seen enough of those in recent weeks, whether it was Inter against Barcelona or other matches where anything could happen.\"\nThis is all the more true for the Eredivisie 2024-25 season.\nThe plot twists were so unexpected that the Dutch league suddenly became one of the most talked-about in the footballing world.", "url": "https://www.bbc.com/sport/football/articles/c74nz813yr0o"}