{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:49:30", "date_modify": "2025-05-21 04:49:30", "date_publish": "2025-01-14 23:11:27", "description": "Cliftonville manager Jim Magilton dedicates Tuesday's dramatic BetMcLean Cup semi-final victory to his late defender Michael Newberry.", "filename": "sport_football_articles_clyzvl9e8lno_1747802970.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/43be/live/64c74630-d2cb-11ef-a95c-5b151e1edf12.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_clyzvl9e8lno_1747802970.html", "title": "Michael Newberry: Late cup win 'characterised' late defender", "title_page": "Michael Newberry: Late cup win 'characterised' late defender - Jim Magilton - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cliftonville manager Jim Magilton dedicated Tuesday's dramatic BetMcLean Cup semi-final victory to his late defender Michael Newberry.\nDestiny Ojo scored an extra-time winner against 10-man Larne, who had Shaun Want sent off in the second half but defended resolutely to keep Cliftonville at bay.\nWhile there were wild celebrations after Ojo's 117th minute goal and again at full-time, Magilton admitted it was a \"poignant\" night for his players.\n\"It was a really poignant night for us, and a sombre night,\" he said.\n\"Yes, we'll enjoy this but we travel to Newcastle on Wednesday to attend Michael Newberry's funeral on Thursday.\"\nHe said the performance \"characterised\" late Cliftonville defender Newberry, who passed away suddenly on 30 December.\n\"In terms of his team-mates going to the wire, showing their guts, showing their determination and character,\" Magilton added.\n\"We're going to go and share memories with his family and give him a good send off.\"\nCliftonville are back in Irish Premiership action on Saturday against Loughgall, and will face Glentoran in the BetMcLean Cup final on Sunday, 9 March.", "url": "https://www.bbc.com/sport/football/articles/clyzvl9e8lno"}