{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:10:22", "date_modify": "2025-05-21 07:10:22", "date_publish": "2025-03-30 10:26:42", "description": "Scott Bemand says his Ireland players are mindful of the task they face in Sunday's Six Nations game against an Italy who beat them a year ago.", "filename": "sport_rugby-union_articles_c0qne8jk23no_1747811422.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c490/live/78ca3d30-0d50-11f0-bc64-a767a4facb99.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c0qne8jk23no_1747811422.html", "title": "Women's Six Nations: Ireland expecting 'incredible Italy challenge'", "title_page": "Women's Six Nations: Ireland expecting 'incredible Italy challenge' - Bemand - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ireland coach Scott Bemand says his players are mindful of the \"incredible challenge\" they will face in Sunday's Women's Six Nations game in Parma against an Italy side who defeated them in last year's championship.\nThe Irish looked in potential Wooden Spoon territory a year ago after they lost in 27-21 to the Italians in round two at the RDS.\nSubsequent wins over Wales and Scotland secured a third-place championship finish that earned qualification for this year's World Cup but Bemand says he and his players have the height of respect for the Italians as they aim for Ireland's first away win in the competition since 2021.\nIreland go into Sunday's game after competing well against France in last weekend's opener in Belfast only to eventually lose out 27-15.\n\"Italy have got a more structured version of themselves these days. It used to be quite fun watching them as in anything could happen,\" said the Ireland coach.\n\"Now they've got a little bit more sensible with what they are trying to do. So we know that we're expecting a strong box-kick game and we've been preparing ourselves for that.\n\"Our aim, as ever, is to get our best game out there and if we do, we'll be alright but the Italians are certainly not going to roll over and make it easy for us.\"\nIreland followed their third-placed finish in last year's Six Nations with autumn wins over Australia and world champions New Zealand and Bemand feels his players now have a belief that wasn't there when they faced Italy a year ago amid the scar tissue from the 2023 Six Nations when the Irish lost all five of their games under previous coach Greg McWilliams.\n\"We said it after the game [against Italy]. You lost a game that you should have won and in the previous Six Nations they were losing games that they didn't deserve to win.\n\"There was a big performance step but almost with not having the permission or the confidence to do it. Now they are a group that think differently.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/c0qne8jk23no"}