{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 08:11:35", "date_modify": "2025-04-26 08:11:35", "date_publish": "2025-02-26 12:00:41", "description": "Bristol City have been charged with misconduct by the FA due to alleged derogatory chants about Cardiff City's owner Vincent Tan.", "filename": "sport_football_articles_cx2g56vdxnyo_1745655095.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ba92/live/84feff10-f436-11ef-8b93-e929161a3c61.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cx2g56vdxnyo_1745655095.html", "title": "Bristol City face FA misconduct charge over derogatory Vincent Tan chants", "title_page": "Bristol City face FA misconduct charge over derogatory Vincent Tan chants - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Bristol City have been charged with misconduct by the FA due to alleged derogatory chants about Cardiff City owner Vincent Tan.\nThe charge stems from two chants during the Championship match between the two sides on 6 October 2024 at Ashton Gate, which ended in a 1-1 draw.\nIn a statement released on Tuesday, the FA said it is alleged that the Robins failed to ensure their spectators avoid using offensive or indecent language in both halves of the game.\nThe statement, external continued: \"It's alleged the club failed to ensure their spectators and/or supporters (and anyone purporting to be supporters or followers) conduct themselves in an orderly fashion around both the 27th and 80th minutes, and don't use words or otherwise behave in an improper, offensive, abusive, indecent, or insulting way with either express or implied reference to gender and/or nationality and/or race and/or ethnic origin.\"\nBristol have until Friday, 14 March to respond to the charge. Both clubs have yet to make a statement on the matter.\nSeparately, an arrest was made and a teenager from South Gloucestershire was charged with a public order offence after disorder broke out ahead of the reverse fixture in Cardiff earlier this month.", "url": "https://www.bbc.co.uk/sport/football/articles/cx2g56vdxnyo"}