{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:02:34", "date_modify": "2025-05-21 05:02:34", "date_publish": "2025-01-05 14:48:25", "description": "Southampton 0-5 Brentford: What Taylor Harwood-Bellis said", "filename": "sport_football_articles_cy0neklv9q2o_1747803754.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/93a0/live/fec20360-cb73-11ef-b454-0d3064afa545.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy0neklv9q2o_1747803754.html", "title": "Southampton 0-5 Brentford: What Taylor Harwood-Bellis said", "title_page": "Southampton 0-5 Brentford: What Taylor Harwood-Bellis said - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Southampton defender Taylor Harwood-Bellis has been speaking to BBC Radio Solent following the 5-0 defeat against Brentford: \"It was out of the blue really. We trained really well this week and the manager has brought a lot of positivity in. We can see the things that we are working on in training.\n\"If we come out and we are not as aggressive as we are in training or not as intense, then that's what happens in the Premier League.\n\"All the new manager is about is being aggressive and intense, so when we don't execute that in whatever way that is then we can get punished against teams like that, who want to run in behind. If you don't stick with your people, they are going to score.\n\"The manager said at half-time that the last 15 minutes of the first half was better. If we are aggressive and win those second balls, you give yourselves the best chance of winning the game, but we started on the back foot straight away. I'm sure the manager will address that.\n\"He won't be too easy on us because of these things, and he is going to be right.\"\nOn Ivan Juric's impact since coming in: \"I think he is having an impact. We feel it. It's that sort of Italian mentality of being horrible to play against and defending hard, so conceding five goals is not on his agenda. That cannot happen in the way we play.\n\"It is on us - the characters in there - if we don't come out next week or the week after and show more of ourselves as players.\n\"It hurts my pride losing like that.\"", "url": "https://www.bbc.com/sport/football/articles/cy0neklv9q2o"}