{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:30:30", "date_modify": "2025-04-26 07:30:30", "date_publish": "2025-02-27 17:29:22", "description": "Dessers 'will try and learn' from Ferguson's Rangers knowledge", "filename": "sport_articles_c9q44ndw5nvo_1745652630.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0dea/live/d1a89560-f52b-11ef-9621-af4ff1a2bf4c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_c9q44ndw5nvo_1745652630.html", "title": "Dessers 'will try and learn' from Ferguson's Rangers knowledge", "title_page": "Dessers 'will try and learn' from Ferguson's Rangers knowledge - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Rangers striker Cyriel Dessers believes \"legend\" Barry Ferguson's knowledge of the club will benefit the team as they look to build on his debut victory.\nThe Nigeria international scored two in Rangers' 4-2 comeback win against Kilmarnock, Ferguson's first game in charge as interim boss.\n\"I see that he [Ferguson] is in the hall of fame and I know what he did for the club, five league titles, five Scottish Cups, all these things, so that speaks for itself,\" Dessers said.\n\"He's a big name at this club, a big personality and it's good that he's around now. He knows the club through and through, he knows what the fans want, what the club is all about, and he is just trying to bring that to us.\n\"Obviously, some guys have been around for a long time as well and they know it as well but I think it's good to hear it from him.\"\nFerguson was a club ambassador before he stepped in to replace Philippe Clement until the end of the season.\n\"He's a Rangers legend and with all the staff, we have some [former] players who have been very important for Rangers and they know the club, they know the little things, they know how the fans feel so that's also what they try to bring to the group,\" Dessers said.\n\"That's what we try to take from them, learn from that and try to convert it on the pitch.\"\nIt looked like a nightmare start for Ferguson as Rangers went 2-0 down early on before a fightback sparked by the first-half substitution of 21-year-old defender Clinton Nsiala.\n\"We have got his back, he doesn't need to worry about that,\" Dessers said of his team-mate.\nHe added: \"That's football. I think everybody in this dressing room has been in that situation before in his career.\n\"He's very young, I don't think he even has 10 professional games so he still has things to learn, but we see his quality every day and he'll be fine, he'll learn from this.\"", "url": "https://www.bbc.co.uk/sport/articles/c9q44ndw5nvo"}