{"authors": ["Pat Nevin", "www.facebook.com"], "date_download": "2025-05-21 07:15:02", "date_modify": "2025-05-21 07:15:02", "date_publish": "2025-05-20 11:04:18", "description": "Crystal Palace news: Eagles fans dare to dream after FA Cup win", "filename": "sport_football_articles_c98pplwgrzwo_1747811702.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b02a/live/f0ede030-355c-11f0-bf15-094eef773db0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c98pplwgrzwo_1747811702.html", "title": "Crystal Palace news: Eagles fans dare to dream after FA Cup win", "title_page": "Crystal Palace news: Eagles fans dare to dream after FA Cup win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "This is the time of the season when celebration, heartache and poignancy each hang around football grounds, like a warm misty haze. Just watch any of the play-off finals if you want to see the highest of highs and the lowest of lows from players and supporters alike.\nI am still reeling at the enormity of Crystal Palace outwitting the mighty Manchester City in the FA Cup final. The size of the upset is impressive, but the spectacle from the Palace fans equalled it.\nFans of clubs who are used to winning things can still put on a show, but to keep that singing, bouncing and dancing going for the entire match was a thing of beauty as well as a fitness test. Going ahead after 16 minutes helped the energy levels, but the 'Spirit of Selhurst' in the sunshine drenching Wembley for the entire day was spectacular.\nCity were unlucky. The brilliant Dean Henderson was man of the match but shouldn't have been on the pitch after handling outside his area. On what planet does Erling Haaland not have a clear goal scoring opportunity?\nOmar Marmoush had his penalty saved, but then I wouldn't have given a penalty in those circumstances anyway. Yes there was contact, but Silva initiated it by collapsing into the defender before the tackle, so I was delighted by Henderson's excellent save.\nThe true highlight in the widest sense was that in a season when the underdogs have barked loudly throughout, they showed there was a serious bite. Congratulations to the Eagles, you have kept the dreams of all other smaller clubs and their supporters alive.", "url": "https://www.bbc.com/sport/football/articles/c98pplwgrzwo"}