{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:17:07", "date_modify": "2025-05-21 05:17:07", "date_publish": "2025-04-03 16:54:22", "description": "Northamptonshire all-rounder Rob Keogh believes Darren Lehmann is the man to get the best out of their squad in the County Championship.", "filename": "sport_cricket_articles_cewg2ey8x8lo_1747804627.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/429e/live/a32e8de0-10a9-11f0-9af0-9909a653fc84.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cewg2ey8x8lo_1747804627.html", "title": "Rob Keogh: Coach Darren Lehmann offers 'fresh start', says Northants all-rounder", "title_page": "Rob Keogh: Coach Darren Lehmann offers 'fresh start', says Northants all-rounder - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Northamptonshire all-rounder Rob Keogh believes Darren Lehmann is the man to get the best out of their squad in this season's County Championship.\nThey finished fourth in Division Two last season after winning two and drawing nine of their 14 games, 56 points adrift of second-placed Yorkshire.\nBut they hope to mount a stronger promotion challenge in 2025.\nFormer Australia head coach Lehmann was appointed over the winter and has already set out his plans to establish a more entertaining brand of cricket from the team.\n\"It's a fresh start for me, a fresh start for everyone,\" Keogh, 33, told BBC Radio Northampton.\n\"He's not massively technical, but tactically he's brilliant. He wants us to be more savvy with the tactical side, how we play our cricket.\n\"(He talks about) working with what you've got, you're all good enough players, you're here for a reason, so let's work with that.\n\"It's about how to get the best out of me and how to get the best out of other players and in the short space (of time) of knowing him, it certainly feels like he's got that going already.\"", "url": "https://www.bbc.com/sport/cricket/articles/cewg2ey8x8lo"}