{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 08:03:05", "date_modify": "2025-05-21 08:03:05", "date_publish": "2025-01-13 13:18:33", "description": "Liverpool boss Arne Slot says Nottingham Forest '\"deserve'\" to be considered Premier League title contenders.", "filename": "sport_football_articles_c391nl9pz4ko_1747814585.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4fc2/live/8e3ad960-d1b2-11ef-bbe0-eb255759a6ac.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c391nl9pz4ko_1747814585.html", "title": "Nottingham Forest are Premier League title contenders, says Arne Slot", "title_page": "Nottingham Forest are Premier League title contenders, says Arne Slot - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Nottingham Forest \"deserve\" to be treated as title contenders before Liverpool's trip to the City Ground, says Arne Slot.\nNuno Espirito Santo's side are the only team to have beaten Liverpool in the Premier League this season following their 1-0 win at Anfield in September.\nTable-topping Liverpool travel to the City Ground on Tuesday (20:00 GMT) for the reverse fixture with Forest in third place, six points behind.\nAfter surviving relegation last season, Forest have lost just four times in 20 league matches this season.\n\"I've always said you can judge the table best halfway through the season,\" said Liverpool boss Slot.\n\"That moment is there now, so if Forest is then up there with us, with Arsenal, Chelsea and [Manchester] City and all the others, then they definitely are a team that is in competition with us and with the other teams.\n\"They deserve to be treated like this if you look at the way they play and if you look at their results.\"\nNuno, though, refused to discuss any title talk or a scenario which would see Forest as Liverpool's nearest challengers with a victory at the City Ground.\nForest have won their past six top-flight games and if they do so on Tuesday they will equal a club record of seven straight league victories, which was set in 1922.\nSpeaking on Monday, Nuno said: \"If we start thinking about ifs... it's if, if, if, if. That's why we always try to approach how we are going to prepare ourselves, how we are going to play the game. In the end of the game there will be no ifs.\n\"We try as much as possible to ignore what is around. We never change, it is the way we see things, it's the way we see the competition, it's the way we see life. Day-by-day, focus on our tasks. Tomorrow is another tough one.\n\"When we do things good we should be pleased, but too many compliments can distract us, so we don't want to pay too much attention.\"", "url": "https://www.bbc.com/sport/football/articles/c391nl9pz4ko"}