{"authors": ["Steven Sutcliffe", "www.facebook.com"], "date_download": "2025-04-26 04:38:30", "date_modify": "2025-04-26 04:38:30", "date_publish": "2025-02-28 10:28:17", "description": "What makes an FA Cup giant-killer? BBC Sport looks at some of Plymouth's heroes in the competition so far.", "filename": "sport_football_articles_ce988dzvel3o_1745642310.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/22f2/live/2e19d850-f571-11ef-896e-d7e7fb1719a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_ce988dzvel3o_1745642310.html", "title": "Plymouth Argyle: Where FA Cup giant-killers are made", "title_page": "Plymouth Argyle: Where FA Cup giant-killers are made - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Championship strugglers. A potential quadruple ended. The magic of the FA Cup restored.\nWhen Plymouth Argyle dumped Premier League leaders Liverpool out of the fourth round in February, they became this year's big FA Cup story.\nHaving already disposed of top-flight opposition in Brentford in the third round, Miron Muslic's team will need to defy the odds again on Saturday, when they travel to face a Manchester City side who are looking to reach their third consecutive final.\nAside from the financial benefits of the fifth-round tie, which are likely to provide somewhere in the region of £600,000 and £1m in extra revenue, it will be a chance for the Pilgrims' 7,800 travelling fans, their players and all associated with the club to dream of causing another monumental upset.\nBut what makes an FA Cup giant-killer? BBC Sport looks at some of Plymouth's heroes in the competition so far.\nThere were seven full internationals in the Plymouth side that conquered Liverpool, with 11 nationalities represented.\nWhile seven of the 15 players to contribute against Arne Slot's team were British, the Pilgrims defence had a distinctly European feel to it, with Julio Pleguezuelo, Maksym Talovierov, Tymoteusz Puchacz and Nikola Katic all starting.\nAnd while Ukraine defender Talovierov celebrated every tackle like he had scored a goal, his central defensive partner Katic also grabbed the headlines.\nThe 28-year-old started his career at HNK Stolac and was only appearing in his second game for Plymouth after joining them on loan from Zurich.\nBut he was a colossus, effectively nullifying the threat of Luis Diaz, Diogo Jota, Federico Chiesa and Darwin Nunez, losing a tooth in the process before swearing live on BBC One in the post-match interviews.\n\"I learned that in Scotland, so blame them,\" joked the Bosnia and Herzegovina international of his industrial language.\n\"We knew we had nothing to lose, they are probably the best team in the world at the moment.\n\"I'm not complaining. A tooth is easy to fix. If we had lost or conceded a goal it wouldn't have been possible to fix. The groundsman found it after the game. I have it at home and will keep it as a souvenir.\"\nKatic was one of Steven Gerrard's first signings as Rangers manager and helped them win the Scottish Premiership in 2021, but he credits the Anfield legend for helping him to transform into a leader on the pitch.\n\"It is one of my best characteristics and I owe that to Steven Gerrard, because when I went to Rangers I was very quiet and he made that out of me,\" Katic said.\n\"I like physical battles, headers, sliding tackles. The way people praise clean sheets here it is not the same in Europe. My wish is to stay in the UK until the end of my career.\"\nCallum Wright also has links to Gerrard and Liverpool.\nThe 24-year-old Argyle midfielder grew up idolising the former England international and, like Gerrard, attended Cardinal Heenan Catholic High School, which is famed for churning out footballers.\nBut unlike Gerrard, who enjoyed a 17-year career at the Merseyside club, Wright, who served as a mascot for the Reds, cut his teeth in the full-time game at Blackburn Rovers after being discarded by Everton as a 13-year-old.\n\"Callum came in as an under-16 player initially. He looked hungry and was a real inner-city footballer, the type who doesn't want to hold back, wants to show how good he is and the ability he has,\" Rovers' Under-23 boss Mike Sheron, who previously took charge of their youth sides, told BBC Sport.\n\"He wants to score goals, he's determined, he'll take the ball in tight areas, work and do the out of possession stuff. He is a good lad to have at Championship level and who knows how far he can go in the future.\"\nThe only disappointment for Sheron, who exchanged a warm greeting with Wright when the clubs recently met in the Championship, was that he did not stick around to develop at Ewood Park.\nWith the likes of Everton circling and tabling a bid reportedly worth more than £1m, he left Lancashire as a 17-year-old and instead joined Leicester City for an undisclosed fee.\n\"He was flying and had a purple patch for the Under 21s, scoring curlers in four or five games in a row, and I think he just got frustrated because Tony Mowbray [then manager], wasn't overly convinced he could make an impact on the first team at the time,\" added Sheron.\n\"He went to Leicester and it didn't really work for him but he has always been true to himself and just wanted to play, going to Cheltenham and Blackpool as well.\n\"I often say to young players, life sometimes won't go your way but what are you prepared to do about it? Moving to Plymouth, you could see that he wanted to develop his career. He has prioritised his football.\n\"I watched him in the fourth round, knowing he is a big Liverpool fan, so to beat them must have been fantastic for him. I was delighted for him - it is great to see his journey.\"\nPlymouth and Sierra Leone forward Mustapha Bundu has hardly followed a conventional career path.\nLeaving home aged 11 and joining the Craig Bellamy Academy - a charity set up by the former Wales striker - in the nation's capital, Freetown, set him on a route that encompassed stops at AGF Aarhus, Anderlecht, Copenhagen and Andorra before finding himself at Home Park on deadline day in the summer of 2023.\nBefore that, football and study took a teenage Bundu to the south west of England.\nA one-game run out in the South West Peninsula League led then Newquay boss Sash Wheatman to say it was like \"bringing on Ronaldo or Gareth Bale\" when he scored twice as a substitute against Ivybridge Town.\nHe also managed almost a goal a game in a season at Hereford and \"stood out a mile\" while at Hartpury college in Gloucester, according to assistant director of elite sport Marc Richards.\nBundu's rich potential in college and university football also drew the attention of Premier League and European clubs.\n\"Some of the things he was doing were a different level. He could win you a game on his own in 10 minutes,\" said Richards.\n\"Chelsea came to look at him and he had a 15-minute spell where he was unplayable. Their scout just looked over at me and said: 'He is unbelievable, we need to get him in.'\n\"In the national final we were 3-0 down and he scored a hat-trick before knocking in a Panenka penalty in a shootout. He was a phenomenal talent.\"\nWhile a trial with Chelsea's Under-21s and an invitation to spend a pre-season at Manchester City did not materialise in anything more concrete, Swedish side Ostersunds - then coached by current West Ham boss Graham Potter - also expressed an interest before Bundu moved to AGF in the Danish top flight.\n\"Mus always had the talent and was a really good lad but he could be so laid back at times,\" added Richards, who is hoping to watch his former student immediately after Hartpury's last-eight tie in the FA Vase against Erith & Belvedere on Saturday.\n\"Graham travelled all the way over to meet him in Newquay, which is quite a journey, and when he got to the arranged place Musa wasn't there. So I had to phone him and he was thinking about not attending because he wasn't feeling well.\n\"That was the slight frustration [at the time] because you always knew he had potential to be a top player. At that stage he maybe hadn't developed the drive he is showing now. Now he is playing more as a nine and against Liverpool he was breaking up play and doing all the ugly stuff as well.\"", "url": "https://www.bbc.co.uk/sport/football/articles/ce988dzvel3o"}