{"authors": ["Alastair Telfer", "www.facebook.com"], "date_download": "2025-05-21 05:34:09", "date_modify": "2025-05-21 05:34:09", "date_publish": "2025-01-31 19:00:09", "description": "New England captain Maro Itoje says losing is not what he is about as his side prepares to open their Six Nations campaign against Ireland on Saturday.", "filename": "sport_rugby-union_articles_cwy7w25zz1vo_1747805649.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/dc7e/live/498761a0-dff7-11ef-a319-fb4e7360c4ec.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cwy7w25zz1vo_1747805649.html", "title": "Six Nations 2025: England captain Maro Itoje says losing is not what he is about", "title_page": "Six Nations 2025: England captain Maro Itoje says losing is not what he is about - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "New England captain Maro Itoje says losing is not what he is about as his side prepare to open their Six Nations campaign against Ireland on Saturday.\nItoje replaced Jamie George as skipper earlier this month after England only won five of their 12 Tests in 2024.\nSteve Borthwick's side beat Ireland, who are hunting a historic third championship in a row, at Twickenham's Allianz Stadium last year and will be hoping to start positively in Dublin to help their bid for a first Six Nations title since 2020.\n\"I don't want to lose and losing is not what I am about,\" Itoje told the BBC's Rugby Union Weekly.\n\"There is no greater honour than winning with England. You win with your club and that is special, but winning with England is a different kettle of fish.\n\"I want this team to feel that and achieve that and I think we can.\"\nItoje led England to the Under-20 world title in 2014 but only stepped up to lead Saracens this season after previous captain Owen Farrell's departure to France.\nThe 30-year-old lock made his debut in England's 2016 Grand Slam-winning campaign and enjoyed a successful start to his international career under Eddie Jones, reaching the Rugby World Cup final in 2019.\nIn a 2021 book, Jones questioned whether Itoje was suited to captaincy, writing that the second row was \"very inward-looking\" and did not \"usually influence people off the field\" - a view Itoje later denied.\nCourtney Lawes, who captained England during their Australia tour in 2022, said Itoje is not a loud talker, external when it comes to pre-game team talks, but the new England captain is happy to hand over those duties to louder squad members.\n\"If there are swearing obligations I will hand that over to the 14 members of the team!\" Itoje added.\n\"Everyone has things to work on. I like to think I am a reasonably self-aware person and I think I am humble enough to acknowledge where I need support from others.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/cwy7w25zz1vo"}