{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:40:14", "date_modify": "2025-04-26 04:40:14", "date_publish": "2025-03-02 07:38:27", "description": "WBA lightweight champion Gervonta Davis says grease from his hair got into his eyes and made him take a knee during a controversial draw against Lamont Roach Jr.", "filename": "sport_boxing_articles_cp8lj8pl588o_1745642414.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3622/live/939e54a0-f731-11ef-8904-e5854759f0f9.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_boxing_articles_cp8lj8pl588o_1745642414.html", "title": "Gervonta Davis v Lamont Roach Jr: WBA lightweight fight ends in controversial majority draw", "title_page": "Gervonta Davis v Lamont Roach Jr: WBA lightweight fight ends in controversial majority draw - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Gervonta Davis retained his WBA lightweight title with a controversial majority draw against Lamont Roach Jr in New York.\nThe boxing superstar - who had won all 30 of his previous fights - voluntarily dropped to his knee in the ninth round of a scrappy affair with WBA super-featherweight champion Roach.\nBut the referee did not call it as a knockdown - and two judges later scored the contest 114-114, with a third giving it to Davis 115-113.\n\"If you voluntarily take a knee and the ref's not counting, that's a knockdown,\" Roach, 29, said. \"If that's a knockdown, I win the fight.\"\nAfter dropping to his knee - which did not follow a punch from Roach - Davis went to the ropes where his face was wiped by a towel.\nDavis, 30, said later he had \"just got my hair done two days ago\" and grease that had been put in his hair \"came into my face and it burned my eyes\".\nAfter the fight, four-weight world champion Terence Crawford claimed Roach - who has called for a rematch - had been \"robbed\".\n\"Roach won and that should have been called a knockdown. I [have] never seen someone take a knee and they don't count it as a knockdown,\" he posted on social media.\nOn the undercard, unbeaten Alberto Puello of the Dominican Republic beat Spain's Sandor Martin by split decision to retain his WBC light-welterweight title.\nTwo judges scored the fight to Puello 115-113 and 116-112, with a third giving it to Martin 115-113.", "url": "https://www.bbc.co.uk/sport/boxing/articles/cp8lj8pl588o"}