{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:48:59", "date_modify": "2025-04-26 03:48:59", "date_publish": "2025-03-05 14:03:26", "description": "Australia stars Glenn Maxwell and Alyssa Healy are among the big-name international players to put themselves forward for The Hundred draft.", "filename": "sport_cricket_articles_czx7wzql4r0o_1745639339.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/13a3/live/f8449720-f9bb-11ef-896e-d7e7fb1719a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_cricket_articles_czx7wzql4r0o_1745639339.html", "title": "The Hundred 2025: Glenn Maxwell and Alyssa Healy among star names in draft", "title_page": "The Hundred 2025: Glenn Maxwell and Alyssa Healy among star names in draft - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Australia stars Glenn Maxwell and Alyssa Healy are among the big-name international players to have put themselves forward for The Hundred draft.\nAll-rounder Maxwell and Women's Ashes winning captain Healy previously played in the 100-ball competition in 2022, for London Spirit and Northern Superchargers respectively.\nThe draft will take place on 12 March and Spirit will have the chance to bring Maxwell, who has a reserve price of £120,000, back to Lord's as they have the first men's pick.\nBirmingham Phoenix will pick first in the women's competition.\nDavid Warner is hoping to play in the tournament for the first time after going undrafted in 2024.\nHe joins a strong Australian contingent that also includes Leeds-born wicketkeeper Josh Inglis and leg-spinner Adam Zampa in the men's draft.\nBig-hitting West Indies trio Andre Russell, Kieron Pollard and Shimron Hetymer, South Africa fast bowler Anrich Nortje and New Zealand batter Rachin Ravindra are up for grabs too.\nAfghanistan left-arm wrist-spinner Noor Ahmad has the highest reserve price at £200,000.\nIn the women's draft, India wicketkeeper Richa Ghosh is available after stints with London Spirit and Birmingham Phoenix in the past two years.\nAfter taking a break from cricket to \"prioritise her well-being\", New Zealand captain Sophie Devine is also on the international draft list that includes Sri Lanka star Chamari Athapaththu and Australia seamer Kim Garth.\nEngland men's and women's players such as Rehan Ahmed, Sophia Dunkley, Jamie Overton, Reece Topley and Issy Wong are among the domestic potential draftees.\nThey feature alongside England legend James Anderson and young Lancashire batter Rocky Flintoff, son of former England all-rounder Andrew.\nThe Hundred begins on 5 August with a London derby double-header between London Spirit and Oval Invincibles at Lord's.", "url": "https://www.bbc.co.uk/sport/cricket/articles/czx7wzql4r0o"}