{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:45:33", "date_modify": "2025-05-21 03:45:33", "date_publish": "2025-02-01 09:36:45", "description": "'Aberdeen in talks over AC Milan's Marko Lazetic' - gossip", "filename": "sport_articles_cvglpw071z9o_1747799133.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7fb2/live/fa117050-e07f-11ef-a319-fb4e7360c4ec.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cvglpw071z9o_1747799133.html", "title": "'Aberdeen in talks over AC Milan's Marko Lazetic'", "title_page": "'Aberdeen in talks over AC Milan's Marko Lazetic' - gossip - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "AC Milan will recall Marko Lazetic from his loan to Backa Topola should they strike a loan with an option to buy deal with Aberdeen for the 21-year-old striker. (Sky Sports), external\nAberdeen are deep in talks with AC Milan about taking 21-year-old striker Marko Lazetic on loan. (Scottish Sun), external\nAberdeen, Cardiff City and Hull City are interested in 22-year-old Maccabi Tel-Aviv centre-back Tyrese Asante, who held talks with the Scottish Premiership club last summer. (Sky Sports), external\nAberdeen have denied reports that centre-half Slobodan Rubezic is set to sign for Sakaryaspor and that the 24-year-old is to fly out on Saturday, claiming there is no interest from the Turkish club. (Press & Journal), external\nRangers and Aberdeen have both held talks with 22-year-old Dundee midfielder Lyall Cameron over a pre-contract agreement to move from Dens Park this summer. (Football Insider), external\nAberdeen manager Jimmy Thelin says he will ideally watch a transfer target play live multiple times before deciding to launch a signing bid. (Press & Journal), external\nJeppe Okkels, the winger who has joined Aberdeen on loan from Preston North End, says his £3m switch from Elfsborg to Utrecht last January was ruined by a painful twisted testicle suffered while cycling that meant he only played four times in the Netherlands. (Scottish Sun), external", "url": "https://www.bbc.com/sport/articles/cvglpw071z9o"}