{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:55:34", "date_modify": "2025-05-20 11:55:34", "date_publish": "2023-08-05 15:18:17", "description": "Andrea Atzeni rides 18-1 chance Aberama Gold to victory in the Stewards' Cup before racing is abandoned at a soggy Glorious Goodwood.", "filename": "sport_horse-racing_66417055_1747742134.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/795A/production/_130666013_gettyimages-1594162757.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_horse-racing_66417055_1747742134.html", "title": "Glorious Goodwood results: Aberama Gold wins Stewards' Cup before racing abandoned", "title_page": "Glorious Goodwood results: Aberama Gold wins Stewards' Cup before racing abandoned - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Aberama Gold won the Stewards' Cup at a soggy Glorious Goodwood before the final three races were abandoned.\nThe 18-1 shot, ridden by Andrea Atzeni for trainer David O'Meara, handled the rain-drenched ground to triumph from Apollo One, Bielsa and Mr Wagyu.\nAberama Gold landed the Sky Bet Dash Handicap just a week earlier at York.\n\"It's hard going out there. The last furlong was the longest ever,\" said Atzeni, who is heading to Hong Kong for fresh opportunities.\nRacing was abandoned after the feature contest, run on the straight course, due to unsafe ground around the bend.\nAberama Gold, formerly trained by Keith Dalgleish until his retirement, was not inconvenienced by loose horse Rumstar, who had unshipped jockey Rhys Clutterbuck at the start.\nIt was another big handicap win for owner Evan Sutherland after the Ayr Gold Cup (Highland Colori, 2013) and Wokingham Stakes (Out Do, 2017).\nFrankie Dettori's bid for a last Goodwood winner before retiring later this year was dashed as Free Wind was fourth in the Lillie Langtry Stakes.\nTom Marquand, who won with a front-running ride on Quickthorn earlier in the week, repeated the trick on 25-1 chance Sumo Sam - trained by Paul and Oliver Cole - who could not be caught in the heavy conditions.\nMarquand, a late replacement for Neil Callan on Sumo Sam, finished the week as leading jockey with four wins while Ralph Beckett was top trainer.\nEarlier, the 9-4 favourite Sweet William was a convincing winner of the Summer Handicap under Robert Havlin for trainers John and Thady Gosden.\nSweet William is now around 5-1 favourite for the Ebor Handicap at York on 26 August.", "url": "https://www.bbc.com/sport/horse-racing/66417055"}