{"authors": ["Nigel Ringland", "www.facebook.com"], "date_download": "2025-04-26 06:15:46", "date_modify": "2025-04-26 06:15:46", "date_publish": "2025-03-01 21:19:35", "description": "Ireland women beat USA 2-1 to reach the final of the Nations Cup in Chile.", "filename": "sport_olympics_articles_c93ng77l78do_1745648146.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/326b/live/2c94d6f0-f6da-11ef-ba69-c78ed0ab1046.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_olympics_articles_c93ng77l78do_1745648146.html", "title": "Ireland women beat USA to make Nations Cup final", "title_page": "Ireland women beat USA to make Nations Cup final - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Ireland’s women are through to the final of the FIH Nations Cup after coming from behind to beat the USA 2-1 in Santiago, Chile.\nMadeleine Zimmer opened the scoring for the Americans but Roisin Upton equalised for Ireland with a penalty stroke and Katie Mullan’s superb solo effort proved to be the game winning goal.\nIreland will face Chile or New Zealand on Sunday with the winners clinching promotion to the top tier of world hockey, the FIH Pro League.\nIreland had kept three clean sheets in the pool stages of the tournament but that impressive streak was breached in the first quarter as the USA took the lead.\nA turnover in their own half by Ireland allowed Zimmer to run into the circle and fire the ball low, and into the far corner of Ayeisha McFerran’s net.\nIreland thought they had equalised just before the end of the opening quarter but Mikayla Power’s goal was disallowed after Mullan was adjudged not to have moved the ball the required five metres from a free hit before entering the circle.\nThe goal was not long in coming, however.\nIn a dominant second quarter, Upton converted a penalty stroke after an effort from Niamh Carey was blocked on the line by an American foot.\nThe third quarter was a tighter affair but was highlighted by Mullan’s goal.\nElena Neill’s superb ball into the circle was instantly controlled by Mullan, who then beat her defender and got the shot away and it ended up in the USA net.\nThe final 15 minutes were not without a scare or two for Ireland and they had to defend bravely after a five-minute yellow card to captain Sarah Hawkshaw and a two-minute green card to Mullan.\nIt’s the second consecutive year Ireland have reached the Nations Cup final. After losing to Spain they’ll be hoping for a different result on Sunday.\n“This was a fantastic team performance,” explained Mullan.\n“It was the first time we’d conceded a goal in the tournament to go one-nil but we came back to win and that shows the character and strength within our group and it sets us up well for the final.\n“It’s been a good tournament for us so far but we came here for one thing and we will go out and fight for that in the final.”", "url": "https://www.bbc.co.uk/sport/olympics/articles/c93ng77l78do"}