{"authors": ["Rob Staton", "www.facebook.com"], "date_download": "2025-05-21 06:30:55", "date_modify": "2025-05-21 06:30:55", "date_publish": "2025-03-31 21:48:37", "description": "Sheffield Wednesday fail to pay their players' wages for March due to cashflow problems suffered by owner Dejphon Chansiri.", "filename": "sport_football_articles_c24q31yl0lvo_1747809055.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2bd6/live/09b10010-0e76-11f0-8032-3f0d5e1fc161.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c24q31yl0lvo_1747809055.html", "title": "Sheffield Wednesday: Owls fail to pay wages of players for March due to cashflow issues for owner Dejphon Chansiri", "title_page": "Sheffield Wednesday: Owls fail to pay wages of players for March due to cashflow issues for owner Dejphon Chansiri - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Sheffield Wednesday have failed to pay their players' wages for March due to cashflow problems suffered by owner Dejphon Chansiri.\nThe club said it was a \"temporary issue\" due to debts owed to the 56-year-old Thai businessman, whose family control the Thai Union Group, the world's largest producer of canned tuna.\nWednesday are 12th in the Championship - five points outside the play-off places - and face Hull City at home on Saturday.\n\"Sheffield Wednesday can confirm a temporary issue with the payment of player salaries for the month of March,\" said a club statement.\n\"This has occurred as a result of significant sums of money owed to the chairman's businesses which has in turn impacted on the club's immediate cashflow.\n\"The chairman is working hard to resolve this situation at the earliest possible opportunity and in the meantime thanks everyone for their patience and understanding.\"\nThe Professional Footballers' Association are aware of the Owls' issues and are in touch with the club's players.\nChansiri headed up a Thai consortium which bought Wednesday from Milan Mandaric in January 2015, but his time in charge of the club has seen a number of financial challenges.\nIn July 2019, Wednesday sold their Hillsborough stadium to Chansiri for about £60m in ensure they did not breach spending rules.\nThen in October 2023, Chansiri asked fans to raise £2m to help the club pay an outstanding debt to HM Revenue and Customs (HMRC) and cover wages.\nLast November, the Owls were placed under a registration embargo by the EFL over amounts owed to HMRC.\nChansiri's stewardship of the club has been criticised by fans, who have protested at matches this season, while his relationship with manager Danny Rohl has become strained.\nA growing number of fans are angry and demanding answers after it emerged that, not for the first time during Chansiri's reign as Sheffield Wednesday owner, the Owls players have not been paid on time.\nMany are asking why the club sells season tickets in an early-bird window before Christmas yet by March, there isn't enough money to even pay wages?\nA statement claims it's down to \"significant sums of money\" being owed to Chansiri's other businesses, \"impacting immediate cashflow\".\nHowever, you get the sense patience for a lot of people has run out.\nThe club was placed under a second registration embargo in 12 months by the EFL last November over amounts owed to HM Revenue and Customs. Now this.\nHow financially sustainable is this club? What exactly is the future of Sheffield Wednesday? These are questions that need to be answered with more than just a statement. Fans are worried and some will feel embarrassed. They deserve answers.\nThis latest admittance will lead to growing calls for Chansiri to sell the club.\nThe Owls might be five points off the play-offs but they lack the solid base that typically accompanies teams challenging for the top flight. Fans dream of a Premier League return after 25 years but it's not realistic in this environment. The club is a long way off in terms of infrastructure and finances.\nIt's the latest reason why a talented young manager in Danny Rohl, the club's greatest asset, may leave amid reported interest from elsewhere.", "url": "https://www.bbc.com/sport/football/articles/c24q31yl0lvo"}