{"authors": ["Ian Westbrook", "www.facebook.com"], "date_download": "2025-05-21 06:05:24", "date_modify": "2025-05-21 06:05:24", "date_publish": "2024-12-24 15:36:19", "description": "Brentford news: Opinion - My moment of the year", "filename": "sport_football_articles_cr7vl4vkpj9o_1747807524.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3eee/live/caf4a690-f0d7-11ee-b0e1-b9dd5ac46984.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cr7vl4vkpj9o_1747807524.html", "title": "My moment of the year", "title_page": "Brentford news: Opinion - My moment of the year - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Brentford's moment of the year has to be when we scored in the first few seconds of a game for the third week in a row.\nYoane Wissa at Manchester City and Bryan Mbeumo at Tottenham had put us ahead within 25 seconds of the first whistle in each of those matches.\nSo, when we returned home to face West Ham the following week, nobody really expected another rapid start.\nWe all laughed when there were cries of 'shoot!' from the crowd within seconds of the kick-off against the Hammers. But, with only 37 seconds gone, that was exactly we did do as Mbeumo's hooked volley, from close to the penalty spot, found the back of the net.\nI was at all three games and the feelings ranged from shock at Manchester City, to shock and amazement at Spurs, to laughter against West Ham.\nNobody could believe we had done it again and that our opponents had not learned from our previous two games.\nThe only shame was that our fast start did not lead to a win in any of the above matches, with defeats at City and Spurs and a draw against the Hammers.\nWe were only a bit slower the following week, when Nathan Collins scored the opener against Wolves after 75 seconds, but at least we won that match.\nWe have gone on to score other goals straight from kick-offs this season but they have been when we have restarted the game after conceding, rather than right at the start.", "url": "https://www.bbc.com/sport/football/articles/cr7vl4vkpj9o"}