{"authors": ["Tyrone Smith", "www.facebook.com"], "date_download": "2025-05-21 07:34:13", "date_modify": "2025-05-21 07:34:13", "date_publish": "2025-05-20 14:24:29", "description": "'No regrets' - St Johnstone owners focused on 'making club great again'", "filename": "sport_articles_cy0kxg8d24go_1747812853.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8562/live/0d4cc470-3586-11f0-9b2c-138cad92aeb3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cy0kxg8d24go_1747812853.html", "title": "'No regrets' - St Johnstone owners focused on 'making club great again'", "title_page": "'No regrets' - St Johnstone owners focused on 'making club great again' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "St Johnstone chief executive Francis Smith says the club's American owner Adam Webb has \"no regrets at all\" about getting involved, despite his first season at the helm ending in relegation.\nUS businessman Adam Webb took control at McDiarmid Park last summer. However, despite replacing manager Craig Levein with Simo Valakari last October, the club finished bottom and will play in the second tier next season for the first time in 16 years.\n\"No regrets at all, Adam and the investors are focused on making this club great again,\" Smith told BBC Scotland.\n\"So they are going to work hard, the ones that are on the board will work with us other directors to make sure the club continues to be a sustainable model.\n\"We want to get through the [next] season without making too much of a loss because we want to make sure that when we come back to the Premiership we are focused and ready to fight for top six.\"\nSmith added: \"Nobody has made a boob, they bought the club, they said at the start they are in here for the long haul.\n\"They are here to rebuild St Johnstone, build the infrastructure, give us the tools to be a successful club.\n\"It won't be this rebuild every year after year. Now we are at the bottom, we will rebuild and make it sustainable for the future.\"\nSmith stressed the importance of getting promoted from the Championship at the first attempt and says Valakari will be given the tools to enable him to do that.\nSince winning a remarkable domestic cup double four years ago, it has been a steady decline for St Johnstone, culminating in this season's relegation.\n\"We can only assess what we have been involved in, so we can only assess from August to now,\" said Smith.\n\"We have given extra money where we can, we have appointed a manager who has an enthusiastic approach to football, but again maybe it comes down to past recruitment and things like that that. Maybe we have not had the best players or the best value players to sell on.\n\"St Johnstone is a club that needs to bring in youth players that become either good assets on the park or sellable assets to allow us to work as a good sustainable club, that is what St Johnstone do.\n\"We will probably post a profit again this year from the Premiership and then going into the Championship we will look probably to make that loss.\n\"But we are focused on rebuilding the club, we have been making all these little changes around the stadium and the infrastructure and things like that and we have obviously backed Simo in January, we brought players in – was that too late? Potentially it was.\"", "url": "https://www.bbc.com/sport/articles/cy0kxg8d24go"}