{"authors": ["Mandeep Sanghera", "www.facebook.com"], "date_download": "2025-05-21 05:17:21", "date_modify": "2025-05-21 05:17:21", "date_publish": "2025-04-03 16:40:06", "description": "Liverpool news: Arne Slot says Reds 'not working on theories' for title points target", "filename": "sport_football_articles_cz79wzgqxw0o_1747804641.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/db47/live/a30836a0-10a8-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cz79wzgqxw0o_1747804641.html", "title": "Liverpool news: Arne Slot says Reds 'not working on theories' for title points target", "title_page": "Liverpool news: Arne Slot says Reds 'not working on theories' for title points target - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It was a quick turnaround for Liverpool boss Arne Slot.\nHe barely had time to celebrate Wednesday night's derby win over Everton before he was chatting to the media on Thursday to look ahead to the league game at Fulham on Sunday.\nOne main talking point dominated proceedings and that was how Everton defender James Tarkowski escaped a red card for his challenge on Alexis Mac Allister.\nThe PGMOL has acknowledged it should have been a sending off and, while Slot has had his run-ins with officials this season, he was quite diplomatic when asked about the standard of refereeing in the Premier League.\nHowever, the Dutchman will not want a repeat of the decisions in the 2-2 draw against Fulham at Anfield earlier this season when Slot believes the Cottagers should have a had a player dismissed and that it was debateable if Reds left-back Andy Robertson should have been sent off.\n\"I think everywhere around the world mistakes are being made,\" added Slot. \"This is something in the league where I came from. We are all aiming for a league without mistakes.\n\"I am aiming for a season without me making one mistake in the line-ups I make, but unfortunately this will probably never happen - not with me and not with referee decisions.\n\"Mistakes are being made. If a referee makes a wrong decision, everybody will fall over it. If I make the wrong line-up, everybody will fall over it. I think it is quite an OK season for referees in England, actually.\"\nIn typical Slot style, he was also refusing to get carried away by his team's 12-point lead at the top of the Premier League with eight games left.\n\"We are not working on theories about how many points [this or that would be],\" he said. \"We are taking the challenge of Fulham on for Sunday, when we will have to be at our best again to get a result.\"", "url": "https://www.bbc.com/sport/football/articles/cz79wzgqxw0o"}