{"authors": ["Nick Hope", "www.facebook.com"], "date_download": "2025-05-19 14:41:32", "date_modify": "2025-05-19 14:41:32", "date_publish": "2017-07-23 15:30:01", "description": "Tom Daley believes he can still achieve his lifelong \"dream\" of becoming an Olympic champion after his world title success.", "filename": "sport_diving_40699069_1747665692.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/BE41/production/_97050784_tom_daley_edit_getty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_diving_40699069_1747665692.html", "title": "World Aquatics Championships: Tom Daley still dreams of Olympic gold", "title_page": "World Aquatics Championships: Tom Daley still dreams of Olympic gold - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Diver Tom Daley believes he can still achieve his lifelong \"dream\" of becoming an Olympic champion after his stunning World Championship title.\nMany felt his best chance had gone after his shock semi-final elimination at Rio 2016 and subsequent injuries.\nHowever, Daley beat Rio 2016 champion Aisen Chen of China with a stunning final routine to secure victory in a dramatic world 10m final on Saturday.\n\"An Olympic gold is the one thing I'm yet to win and it's my dream,\" he said.\nThe diver - who is now 23 - admits his Rio Olympic heartache was \"devastating\" and the \"lowest point\" of his career, but insists that world success will not make him complacent.\n\"Yes my score (590.95) would have been enough to win the Olympics last year, but if you ran this competition again today there's no guarantee of the same outcome,\" he said.\n\"I can't take it [victory] for granted and I'm going to go away and work twice as hard because getting to the top is hard, but staying there is harder.\"\nThe diver's last individual World Championship title was secured back in 2009 in Rome, , externalwhen Daley's tearful father gate-crashed the post-event news conference to demand a \"hug from my boy.\"\nRob Daley died in 2011 and his son was keen to reflect on the moment they shared together eight years earlier.\n\"This is my first press conference as a world champion since 2009 when it was a bit emotional with my dad,\" he said with a smile.\n\"I hope he would be proud of me today.\"\nSeveral of the world's leading men's 10m platform divers had been due to compete in the mixed 3m springboard competition but withdrew as there were just a couple of hours between the event.\nDaley decided to compete in both and warmed up for the individual 10m final with synchronised silver alongside Grace Reid.\n\"I think it helped a lot, because we kept everything so fun,\" revealed Daley.\n\"We were singing and dancing between the rounds and it worked as we got the silver so I thought 'well, let's try that in the 10m final.'\n\"Some of the volunteers must have thought I was mad, singing in the shower on my own, but I was in my own world.\"\nDaley - who married Dustin Lance Black in March - says his immediate focus is on his upcoming honeymoon.\nAfter a short time away he will return to training before a bid for a third successive individual Commonwealth Games title at Gold Coast 2018.\n\"The Commonwealths are a massive motivation and it's always a fun event to compete in,\" he told BBC Sport.\n\"I've won gold medals at the last two Games and it should be a good battle with the Australians in the synchronised event.\"\nAnalysis - Can Daley dominate diving?\nLeon Taylor - Olympic silver medallist, BBC diving commentator and Tom Daley's former mentor:\nTom Daley's achievement is just absolutely incredible because that is the highest-class diving final I have ever witnessed.\nTom didn't become a bad diver in Rio. He just had an awful day and it was a surprise because he is always so consistent but that never meant it was the end of him as a top competitor.\nHe is the hardest-working, most professional diver out there, who is doing so much even away from the pool - like yoga - to ensure he has the best chance of staying at the top for as long as possible.\nTechnically and mentally though, Tom still has it all, but you have to remember that the Chinese divers are still the dominant force in the sport.\nAlthough this result could put a seed of doubt into their minds, it could also motivate them even more, so it will be fascinating to see all the top divers battle it out over the next few years.", "url": "https://www.bbc.com/sport/diving/40699069"}