{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:37:45", "date_modify": "2025-05-20 14:37:45", "date_publish": "2023-07-28 14:35:47", "description": "Arsenal unveil a bronze statue of legendary former manager Arsene Wenger outside Emirates Stadium.", "filename": "sport_football_66341181_1747751865.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8707/production/_130576543_gettyimages-1576369746.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66341181_1747751865.html", "title": "Arsenal unveil Arsene Wenger bronze statue at Emirates Stadium", "title_page": "Arsenal unveil Arsene Wenger bronze statue at Emirates Stadium - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Arsenal have unveiled a bronze statue of legendary former manager Arsene Wenger outside Emirates Stadium.\nHe helped the Gunners to three Premier League titles and seven FA Cups during his reign from 1996 to 2018.\nThe Frenchman is lifting the Premier League trophy in the 3.5-metre statue outside the North Bank Stand.\nThe 73-year-old will be a guest of honour for Arsenal's home friendly against Monaco, another of his former clubs, on Wednesday.\nWenger, who now works for Fifa, is so synonymous with Arsenal's recent history that last season's title battle and second-placed finish under Mikel Arteta is their best Premier League campaign without Wenger in charge.\nHe managed 1,235 matches at Arsenal, most famously overseeing the only unbeaten Premier League campaign when Arsenal won the 2003-04 title.\nHe took them into the Champions League in 20 consecutive years. Next season will be their first campaign in the competition without Wenger in charge since the 1991-92 European Cup.\nArsenal executive vice-chairman Tim Lewis said: \"Arsene's contribution to, and achievements with, the club mark him out as the club's greatest manager.\n\"He treated the club and its supporters to many trophies and fantastic memories and brought a revolution in the running of the club, an unbeaten season and the move to Emirates Stadium.\n\"It is fitting, therefore, that as a mark of the club's enduring respect and gratitude a magnificent statue of Arsene now stands outside Emirates Stadium.\"\nHe joins five other Arsenal legends with statues outside the ground - Tony Adams, Dennis Bergkamp, Thierry Henry, Herbert Chapman and Ken Friar.\nArsenal boss Arteta, who was signed as a player by Wenger in 2011, said: \"It's such a great tribute that the club has done something special for Arsene that he fully deserves and merits.\n\"With a statue now at the stadium, Arsene can have that recognition and be here at our club forever.\n\"He chose me to be one of his players and selected me to be the captain of the club and that's something I will never forget.\"\nThe statue was created by sculptor Jim Guy.", "url": "https://www.bbc.com/sport/football/66341181"}