{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:07:35", "date_modify": "2025-05-19 15:07:35", "date_publish": "2015-02-23 17:34:44", "description": "Carlos Tevez and Alvaro Morata score as Juventus defeat Borussia Dortmund in the first leg of their Champions League tie.", "filename": "sport_football_31590794_1747667255.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81220000/jpg/_81220538_morata_ap.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31590794_1747667255.html", "title": "Juventus 2-1 Borussia Dortmund", "title_page": "Juventus 2-1 Borussia Dortmund - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Juventus had to settle for a narrow first-leg lead after missing several good chances against Borussia Dortmund in their Champions League last-16 tie.\nCarlos Tevez put the Italians ahead after Roman Weidenfeller spilled at his feet, but Dortmund soon struck back.\nMarco Reus exploited Giorgio Chiellini's slip to scamper in and shoot home just three minutes later.\nAlvaro Morata's careful finish put Juve back in front and the hosts could have stretched away in the second half.\nAfter the break, Tevez went close on three occasions, Chiellini rose unmarked to head over the top and Roberto Pereyra shot just wide.\nBut the Italians ultimately failed to exploit Dortmund's fragility and will take only a one-goal advantage to Germany.\nThe win took the Serie A champions' unbeaten home run to 47 games and they made the fast start that a simmering atmosphere at the Juventus Stadium demanded.\nWith defenders back in numbers there appeared little danger for Dortmund despite Morata escaping the attentions of his man on the left.\nBut the Spaniard's well-hit shot and Dortmund goalkeeper Weidenfeller's fumble presented Tevez with a simple finish five yards out.\nA woeful run of domestic form left them bottom of the Bundesliga at the start of 2015 but Dortmund have kept faith with a pressing game and their energy soon delivered parity.\nChiellini lost his footing as he attempted to control a routine ball forward and Reus, who has recently agreed a contract extension with the Germans,, external raced in on goal and coolly beat Gianluigi Buffon.\nThe visitors enjoyed more of the possession for the rest of the half but never looked secure at the back.\nLeonardo Bonucci headed over from a good position for Juventus, and Dortmund were caught out again by a swift counter-attack just before the break as Morata was left free to side-foot home from six yards.\nDortmund continued to be undermined as Weidenfeller and his defence wobbled through to the end of the tie but, with an away goal secured, they will hope the Westfalenstadion can inspire them to the quarter-finals.\nJuventus manager Massimiliano Allegri: \"In the domestic championship, we are used to having the ball for 70 percent of the game. \"We're not used to not having the ball and defending, but in the second half we did both. This match was a step forward for a team that wants to do well in Europe.\"", "url": "https://www.bbc.com/sport/football/31590794"}