{"authors": ["Holly Bacon", "www.facebook.com"], "date_download": "2025-05-21 06:35:44", "date_modify": "2025-05-21 06:35:44", "date_publish": "2024-12-24 10:21:43", "description": "Ange Postecoglou press conference: Nottingham Forest vs Tottenham preview", "filename": "sport_football_articles_cpq9yn1ge35o_1747809344.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f21e/live/f7d58710-6de1-11ef-8c32-f3c2bc7494c6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cpq9yn1ge35o_1747809344.html", "title": "Ange Postecoglou press conference: Nottingham Forest vs Tottenham preview", "title_page": "Ange Postecoglou press conference: Nottingham Forest vs Tottenham preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "On team news: \"From the game as far as we know no issues. Obviously Destiny [Udogie] was on the bench - he wasn't 100%. He should be right for the next game. [Rodrigo] Bentancur is available after his suspension.\"\nOn having Bentancur back after his suspension: \"It's good to have him back. He has been working hard at training. In terms of Boxing Day - we'll see. Just to have an extra body, what the core group of players have had to deal with over the last three weeks or so has been very demanding on them. Most of them have got through it pretty well without getting more injuries, thankfully for us. It'll be nice just to have some ability to rotate some players and even make substitutions in games that hopefully will help us.\"\nHe added that the club will try to make reinforcements in January: \"It's fair to say we are still a little bit short in a couple of areas and we need to reinforce. January is tricky in terms of what sort of players you can bring in. You want to bring in people who are going to make you stronger but the fact that were are still in the Carabao Cup semi final, still in Europe, the FA Cup, in all the competitions, it's not like our schedule is going to ease up at any stage. I think it makes sense we will try and reinforce, where and what number, we'll have to wait and see.\"\nPostecoglou said he wasn't \"angry\" at the questioning around his team's tactics following the 6-3 defeat to Liverpool: \"You don't get many managers who bounce into interviews after being beaten and feel cheery about it. It's fair to say I'm getting tired of the same questions and answering the same way. I just think people want to sort of poke the bear to see if I react and after a loss it's a lot easier for people to get a reaction out of me.\"\nHe added: \"I still feel like and I see that the players still have belief in what we're doing but it is difficult because it's a tough day for the supporters, it's a tough day for the players, all the people who work so hard at the club. From my perspective I take responsibility for that because I'm charting this course for us. I try and reiterate this, it's all hopefully for a greater purpose. That's my ultimate responsibility - to try and bring success to the club.\"\nOn being 11th in the table: \"There are circumstances with where we are at from the position in the table and a lot of that is down to both inconsistency in performance, sometimes inconsistency in games and inconsistency in the team we can put there. All those kind of things have damaged our ability to get into a stronger position in the league. I still think there's growth in the team during this period, I still think there's a lot of positive things within what we're doing. I'm not withstanding that we need to improve our position.\"", "url": "https://www.bbc.com/sport/football/articles/cpq9yn1ge35o"}