{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:45:03", "date_modify": "2025-05-20 14:45:03", "date_publish": "2023-07-27 20:12:59", "description": "LeBron James says his family is \"together, safe and healthy\", as son Bronny, 18, is discharged from hospital after suffering a cardiac arrest.", "filename": "sport_basketball_66332787_1747752303.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/14AAF/production/_130555648_gettyimages-1250055172.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_basketball_66332787_1747752303.html", "title": "LeBron James' son Bronny discharged from hospital after collapse", "title_page": "LeBron James' son Bronny discharged from hospital after collapse - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "LeBron James said his family was \"together, safe and healthy\", as son Bronny was discharged from hospital after suffering a cardiac arrest.\nThe 18-year-old collapsed on court while practising with his University of Southern California (USC) basketball team in Los Angeles on Monday.\nHe was discharged on Thursday, Cedars-Sinai Medical Center confirmed.\n\"I want to thank the countless people sending my family love and prayers,\" LA Lakers great James said.\n\"Everyone doing great. We have our family together, safe and healthy, and we feel your love,\" the four-time NBA champion added in a social media post on Thursday, shortly before the hospital issued a statement.\n\"Thanks to the swift and effective response by the USC athletics' medical staff, Bronny James was successfully treated for a sudden cardiac arrest,\" the hospital said.\n\"He arrived at Cedars-Sinai Medical Center fully conscious, neurologically intact and stable. Mr James was cared for promptly by highly-trained staff and has been discharged home, where he is resting.\n\"Although his workup will be ongoing, we are hopeful for his continued progress and are encouraged by his response, resilience, and his family and community support.\"\nEarlier this week, Twitter owner Elon Musk was called \"irresponsible\" for a tweet implying, without evidence, that a Covid vaccination might be involved.\nThe eldest of three siblings, Bronny has a younger brother, Bryce Maximus, 16, and sister, Zhuri, eight.\nHe joined the USC after carving a reputation as one of the top prospects in US high school basketball, and his famous father has previously spoken of extending his career to be able to play in the NBA with his son.", "url": "https://www.bbc.com/sport/basketball/66332787"}