{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:51:04", "date_modify": "2025-05-20 14:51:04", "date_publish": "2023-07-27 17:17:03", "description": "If Livi finish above 11th 'Martindale should get a statue'", "filename": "sport_articles_cp4nvqdxj8wo_1747752664.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/06f4/live/3fc620d0-2ca1-11ee-b1d7-8fdc93c2782e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cp4nvqdxj8wo_1747752664.html", "title": "If Livi finish above 11th 'Martindale should get a statue'", "title_page": "If Livi finish above 11th 'Martindale should get a statue' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "New season, same old story of Livingston defying the odds?\nDavid Martindale's squad is shorn of some mainstays this time round, with Nicky Devlin and Jack Fitzwater among those who have moved on, but the West Lothian men will again look to revel in their underdog status.\n“It’s eventful, no two seasons are the same, we have ups and downs and it’s an adventure,\" Livi fan Stuart Barrie told the BBC's Scottish football podcast.\n“We’ve still got a budget that Championship clubs would laugh at. We still feel lucky to be in the top flight and you can see that with the manager and the team at the start of the season, there’s a real drive to make this work and stay here.\n“I think 10th is punching above our weight, eighth is amazing, some of our fans were bitterly disappointed not to make top six and that’s two seasons in a row that we came close, that’s fairytale stuff for us.\n“We’ve got a threadbare squad and some of the players aren’t on fortunes, they could earn more in the Championship, so it’s huge for us to be at that level.\n“We live within our means, the club has a lot of really sensible people doing the right things and it’s run well and that just means anything above 11th, Martindale should get a statue for that.\"", "url": "https://www.bbc.com/sport/articles/cp4nvqdxj8wo"}