{"authors": ["Stephan Shemilt", "www.facebook.com"], "date_download": "2025-05-21 07:41:44", "date_modify": "2025-05-21 07:41:44", "date_publish": "2025-05-20 14:04:07", "description": "England men's cricket team do not want to feel out of touch with their fans, says head coach Brendon McCullum.", "filename": "sport_cricket_articles_clygg3pe6jeo_1747813304.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/aa41/live/342ac6b0-3580-11f0-9b2c-138cad92aeb3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_clygg3pe6jeo_1747813304.html", "title": "Brendon McCullum asks England to improve 'humility' before Zimbabwe Test", "title_page": "Brendon McCullum asks England to improve 'humility' before Zimbabwe Test - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Head coach Brendon McCullum has called on England to improve their \"humility\" as they begin a year that will define his spell in charge.\nEngland play a one-off Test against Zimbabwe at Trent Bridge on Thursday, before marquee series at home to India and away in Australia.\nThey do so after a mixed winter. McCullum's side won a Test series in New Zealand 2-1, but lost by the same scoreline in Pakistan and endured a wretched time in white-ball cricket.\nComments made by the players in the media have often come under scrutiny. In March, director of cricket Rob Key said the players need to \"stop talking rubbish\", while last month fast bowler Mark Wood admitted they can be \"a bit dumb\".\nSpeaking on Tuesday, New Zealander McCullum said: \"It's not just about what you do on the cricket field. It's how you carry yourself. It's how you interact with the public. It's the messaging that you give.\n\"The ability these guys have to be able to play on the biggest stage, under the brightest lights and the pressure that takes is one thing, but also the ability to be humble and show some humility and not feel out of touch with the general population is something I'd like to see us improve on.\"\nMcCullum and captain Ben Stokes took charge in 2022 and immediately revolutionised England's style and results. From one win in 17 Tests prior to the McCullum-Stokes regime, England won 10 of their next 11.\nAlthough they are second in the world rankings, England have developed a habit of producing sloppy performances. The final Test in each of their past three series - against Sri Lanka, Pakistan and New Zealand - have been dismal losses.\nIn addition, McCullum is yet to improve limited-overs results since he assumed control of those teams at the beginning of the year. England lost every match at the Champions Trophy in February.\n\"If we look at it at the start, people were excited by the way we played,\" said former New Zealand captain McCullum.\n\"They were enthralled by the freewheeling type of cricket and they felt - I'm guessing here- a sense of belonging to that type of group.\n\"With a bit of idle time, we get the opportunity to retrospectively look at things and see where things have been over the last few years, where we've come from, what we've achieved, opportunities we've let slip, and also looking at what we've done for the people that this team represents.\"\nAllied to the inconsistent results are the perception of the England team and some of the comments they make in the media.\nDuring the Champions Trophy they were criticised for not training enough by former England captain Kevin Pietersen, who pointed to their love of golf.\nWood said he was irritated by an external narrative of \"golf, golf, golf\", while Stokes said the idea their training is affected by too much golf is \"utter rubbish\".\nAny disconnect between England and some sections of their fans could also have been fuelled by comments in the media. Batters Ben Duckett and Harry Brook have most often been guilty of clumsy quotes.\nMcCullum has therefore aligned with Key's view that the players need to take greater care with their public comments. Individual conversations between management and players have taken place, rather than collective instructions given to the group.\n\"We've just got to be a bit smarter with some of our comments,\" said McCullum. \"What we say in that dressing room is often very different to what you expect to come out in a public forum.\n\"We've got we just got to be aware of that, smart enough to be able to make sure that we articulate things when we get the opportunity so that we don't we don't lose touch with the English people.\n\"We want them along for the ride, particularly in the next few series, which could be quite amazing. We want people to look back and say, 'Crikey, that team in the mid-2020s was a hell of a team that we loved following, and we felt as if we were a part of that journey they went on.'\"", "url": "https://www.bbc.com/sport/cricket/articles/clygg3pe6jeo"}