{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:04:54", "date_modify": "2025-04-26 07:04:54", "date_publish": "2025-02-28 00:00:00", "description": "All the latest football news and reaction as West Ham United beat relegation-threatened Leicester City in the Premier League plus build-up to the fifth-round of the FA Cup.", "filename": "sport_football_live_cn4887ny7vvt_1745651094.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cfed/live/2dc6b400-f5d9-11ef-896e-d7e7fb1719a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_cn4887ny7vvt_1745651094.html", "title": "Garnacho 'to pay for dinner for all the team' - FA Cup news conferences plus build-up", "title_page": "Garnacho 'to pay for dinner for all the team' - FA Cup news conferences plus build-up - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "That's all folks\nRight, we are leaving you now.\nPlease click on the links in the summary to get up to speed with today's main news.\nAnd don't forget to join us again for tonight's FA Cup tie at Villa Park (kick-off 20:00 GMT).\nOur live text coverage and radio commentary will start from around 19:00 - click here to follow.\nSee you then...\n'A great opportunity'\nAston Villa v Cardiff (Wed, 20:00 GMT)\nIan Taylor\nFormer Aston Villa midfielder speaking on BBC Radio 5 Live\nFormer player Ian Taylor begs to differ with Aston Villa manager Unai Emery:\n\"I think every manager says the same kind of thing going into a cup tie but I think us as fans look at it as a great opportunity to go even further in the competition.\n\"If you look at the other ties in the round, there are quite a few Premier League teams playing each other, and so will go out of the competition. We have a home tie against a Championship side so you're looking at it like we can go through to the next round.\"\nEmery says Villa 'not contenders' to win FA Cup\nAston Villa v Cardiff City (20:00 GMT)\nManager Unai Emery says Aston Villa are \"not a contender\" to win the FA Cup this season.\nVilla host Championship strugglers Cardiff City tonight for a place in the quarter-finals.\nLiverpool, Arsenal and Chelsea have already been knocked out and Villa showed their quality by beating Premier League rivals West Ham United and Tottenham in the previous two rounds.\nBut Emery said: \"We are not a contender in the FA Cup to win the title, but to try to compete in the competition and have a way to a trophy - and Europe is very important, and prestigious.\n\"Every club, players and coaches like trying for prestige. It could be the best way to qualify for Europe. We have three ways - the Premier League, the Champions League and the FA Cup.\"\nClick here to read the full story.\nVilla fan Robinson planning cup upset on return\nAston Villa v Cardiff City (20:00 GMT)\nMichael Pearlman\nBBC Sport Wales\nCardiff City top goalscorer Callum Robinson says he is relishing his return to Villa Park.\nThe Bluebirds travel to Aston Villa for the FA Cup fifth round as Robinson revisits the club who gave him his start in professional football.\nRobinson is a former youth team player at Villa who made four senior appearances for the club, including his debut in the Premier League.\n\"Now it is all about having fun and enjoying the night,\" the 30-year old told BBC Sport Wales.\nRobinson spent most of his childhood at Aston Villa and admits they are now the club he supports as he bids to dump them out of the FA Cup.\nClick here to read the full story.\nHutchinson out of Forest trip\nNottingham Forest v Ipswich (Mon, 19:30 GMT)\nIpswich Town\nA final word from Ipswich boss Kieran McKenna, who provided an update on Omari Hutchinson after the winger suffered a knee injury in Wednesday's defeat at Manchester United:\n\"It's not very, very serious but he will definitely miss the next game and possibly more. Very disappointing.\"\nHe added Kalvin Phillips is \"progressing will\" but he is \"not sure when he will be back\" and it is a \"day-by-day case\".\nFA Cup provides 'a nice change of focus and narrative'\nNottingham Forest v Ipswich (Mon, 19:30 GMT)\nIpswich Town\nKieran McKenna on the chance to become the first Ipswich side to reach the FA Cup quarter-final in over 30 years:\n\"We're looking forward to the game. A couple of earlier rounds have been a nice break from the Premier League action.\n\"It's a nice change of focus and narrative around the games and a nice progression for the group and for some of the players. We went from playing a League One team to a Championship team and a landmark in there for some of the players and us as a team\n\"Now we have the chance to play a Premier League team, a real challenge but a really good cup tie in a historic ground on a Monday night against a good side.\"\n'Players are looking forward to Monday night now'\nNottingham Forest v Ipswich (Mon, 19:30 GMT)\nIpswich Town\nIpswich boss Kieran McKenna on switching focus from their Premier League defeat at Manchester United: \"We had conversations this morning. Players had yesterday off after a late return on Wednesday night.\n\"They had yesterday to recover and we went through the game this morning and watched it back. We always go through the game in its entirety.\n\"We've been through all of it and looked at the areas that were most important and the players are looking forward to Monday night now.\"\n'All players fit and available' for Palace\nCrystal Palace v Millwall (Sat, 12:15 GMT)\nCrystal Palace\nCrystal Palace boss Oliver Glasner began with a team news update: \"All players are fit and available again. Marc Guehi is okay [after the win over Aston Villa on Tuesday]. It helped that we had one more day between these two games. The only change in the squad is Matheus Franca will be in the squad, and Caleb Kporha won't be, but all others are ready.\"\n'I would prefer Iwobi not to play 5-a-side with his friends'\nMan Utd v Fulham (Sun, 16:30 GMT)\nFulham\nFulham boss Marco Silva on Alex Iwobi admitting that he plays 5-a-side football in local matches during a podcast this week: \"He knows that he shouldn't but Alex being Alex is being as honest as possible during a podcast. I would prefer him to enjoy his friends in a different way rather than small games with his friends.\n\"There are many things to do in a different way but he's a lovely guy. He's a football player that lives his own life in a slightly different way, but sometimes I want him to keep his focus where he should and to protect him as well as I can because in the end the most important thing for him is his job for Fulham Football Club.\"\nPost\nHere's a quick question for you.\nFulham are one of a host of teams left in the FA Cup that have reached the final of the competition in the past.\nBut which club in the last 16, other than holders Manchester United or 2023 winners Manchester City, was the last one to win it?\nHere's a clue, it wasn't in this century...\n'Our ambition in the FA Cup is really big'\nMan Utd v Fulham (Sun, 16:30 GMT)\nFulham\nFulham boss Marco Silva on the FA Cup: \"We really like this competition. We want to be really serious in it. Our players have always been serious in their approach because we respect and love this competition.\n\"Our ambition in this competition is really big and we want to compete to be in the next round. It is good when I feel like this ambition and passion goes through all of the squad.\"\nSmith Rowe back in contention\nMan Utd v Fulham (Sun, 16:30 GMT)\nFulham\nFulham boss Marco Silva on team news: \"No fresh news about injuries. The same three players that have been out for a long period - Kenny Tete, Reiss Nelson and Harry Wilson - are still out.\n\"Emile Smith Rowe is back in training with the team. We have another session tomorrow and after that hopefully he will be in a condition to be in contention for the game.\"", "url": "https://www.bbc.co.uk/sport/football/live/cn4887ny7vvt"}