{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:48:39", "date_modify": "2025-05-21 03:48:39", "date_publish": "2025-01-06 00:00:00", "description": "All the latest football news including reaction and analysis to Liverpool's 2-2 draw with Manchester United plus Phil McNulty Q&A.", "filename": "sport_football_live_crmnylm2xv1t_1747799319.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_crmnylm2xv1t_1747799319.html", "title": "Football latest: Premier League build-up & Arteta news conference", "title_page": "Football latest: Premier League build-up & Arteta news conference - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "That's all from Arteta\nArsenal v Newcastle (Tue, 20:00 GMT)\nThat was short and sweet from Arteta.\nThe Arsenal boss confirmed Nwaneri is set to miss a 'few weeks' with a muscular injury and said he's hopeful that Havertz will return from illness to face Newcastle.\nOh, and he's still not happy about that penalty awarded to Brighton on Saturday.\nWhat will Arteta be asked about?\nArsenal v Newcastle (Tue, 20:00 GMT)\nArsenal\nWe're still waiting for Arteta.Supporters will be hoping for a fitness update on Nwaneri after he was forced off with a 'muscular injury' in the draw against Brighton, while there could be news on Sterling's fitness.\nArteta could also react to Liverpool's draw against Man Utd, which kept the Gunners within six points of the Reds.\nWhat would you ask Arteta, Gooners?\nget involved\n'Newcastle are yet to hit peak'\nPhil McNulty Q&A\nPhil McNulty\nBBC Sport chief football writer\nGraeme, Peterborough: Afternoon Phil. A quick question today. Is this the best Newcastle United we've seen? Have they peaked with the players they've got, or can you see more from the team in the future?\nAfternoon, Graeme. They are certainly are the best Newcastle United we have seen this season and manager Eddie Howe deserves a lot of credit for this.\nThey were indifferent and inconsistent early in the season but the utilisation of Sandro Tonali as a number six, which had been a problem position, has been transformational and we’ve seen Bruno Guimaraes hit something like his best form.\nAlexander Isak is a striker of the highest class while Anthony Gordon has also shaken off what looked to be an early season hangover from the disappointment of Euro 2024 and all that speculation about a move to Liverpool.\nThe return of key defender Sven Botman after a lengthy injury absence only adds to their strength.\nI do not see them having peaked. The pieces are falling into place and I can see them kicking on now. They must have a top four place in their sights as that is something definitely up for grabs in the Premier League this season.\nThey just need to make sure they hold on to all of their best players in this January transfer window.\n'Newcastle must wrap Isak in cotton wool'\nGlenn Murray\nFormer Brighton striker on BBC Football Daily\nNewcastle United are in a good vein of form and Eddie Howe sets his teams up to be defensively strong first and foremost.\nBut a lot of this run is down to one man - that is Alexander Isak.\nMy main worry all season for Newcastle is the fitness of their strikers. They don't seem to stay fit for a consistent amount of time.\nIf Callum Wilson or Isak are fit, I am sure they will score goals. But with Wilson injured right now, they need to wrap Isak in cotton wool.\nGuimaraes suspension a 'big blow'\nArsenal v Newcastle (Tue, 20:00 GMT)\nNewcastle United\nNewcastle United will be without midfielder Bruno Guimaraes for the first leg of their Carabao Cup semi-final against Arsenal on Tuesday.\nThe Brazilian picked up a yellow card in the quarter-final against Brentford triggering a one-match suspension against the Gunners.\nThe Magpies are in a rich vein of form, having won five on the bounce in the Premier League to take them up into 5th in the table but Howe admits his side will miss the former Lyon man.\n\"It’s a big blow, Bruno, one of his biggest strengths is he’s always there for you,\" said Howe.\n\"His appearance record has been brilliant for us, especially with the physical exertion is very good and he’s exceptional in every way.\n\"He’s a pivotal figure for us, he’s going to be a big miss. But we have big players who can fill his shoes as well. Whoever I choose in that position, we have quality players coming in.\"\nget involved\n'Pereira has injected freshness and momentum at Wolves'\nPhil McNulty Q&A\nPhil McNulty\nBBC Sport chief football writer\nGuy in Madrid: Hi Phil, the contrast in results from two Portuguese managers brought in late to pretty dire positions (Ruben Amorim and Vitor Pereira) is pretty stark (last night’s match with Manchester United getting a point at Liverpool being the exception). What has Pereira done that Amorim hasn’t? Been more pragmatic? Used a tight squad? Cheers.\nHello, Guy. I think Vitor Pereira has just injected freshness and momentum into a very talented squad that had lost its way under Gary O’Neil, while Ruben Amorim will be really heartened by the result at Liverpool yesterday – and don’t forget he won at Manchester City as well.\nI honestly think it is far too early to make judgements on either. They have barely got their feet under the table at Molineux and Old Trafford. Next season will give us a more accurate measure.\nArsenal set for testing run\nArsenal v Newcastle (Tue, 20:00 GMT)\nArsenal\nThe visit of Newcastle to the Emirates on Tuesday is the first of what looks to be a gruelling - and potentially pivotal - period for Arsenal.\nIncluding the game against the Magpies, Arsenal face a run of nine matches in 30 days across four competitions.\nIt would be enough to test any side, but particularly one that is missing its star player in Bukayo Saka. Want the good news, Gooners? You're at home in your next five matches.\nget involved\n'Cannot recall seeing a penalty like that'\nPhil McNulty Q&A\nPhil McNulty\nBBC Sport chief football writer\nGuy, Nottingham: Hi Phil. I don’t want to criticise any referees as they do a job where they are moaned about regardless of what they do. But what do you make of the Brighton penalty against Arsenal? I can’t understand why it was a penalty.\nHello, Guy. I am still really torn on this one as I cannot recall seeing a penalty given in this type of incident before, but referee Anthony Taylor clearly felt the clash of heads was a foul.\nOn balance, I can see why it was given but it was certainly a very unusual one and understand why it has become such a talking point.\nTeam news update\nWolves v Nott'm Forest (20:00 GMT)\nMatheus Cunha begins a two-game ban following an FA charge of misconduct for his involvement in a confrontation with Ipswich Town's security staff following Wolves' 2-1 defeat in December.\nWolves head coach Vitor Pereira told a press conference on Friday that Mario Lemina has a \"small injury\", while Andre will be assessed after sustaining a knock in the draw at Tottenham Hotspur.\nNottingham Forest defender Murillo is expected to be available after he was unable to complete the pre-match warm-up ahead of the win at Everton on 29 December.\nCallum Hudson-Odoi is also back in contention after missing the trip to Goodison Park due to injury.\nWolves 'ready to play with or without Cunha'\nWolves v Nott'm Forest (20:00 GMT)\nWolves\nIn his news conference last week, Vitor Pereira said his side must adapt without top scorer Matheus Cunha. \"We need to be ready to play with or without Cunha. We play as a team. I think we have players with different skills and qualities - but we will be ready.\"\n\"He knows that it was not a good reaction but I look for a player not only as a player, as a human being. Sometimes even me, I make mistakes. He knows that he made a mistake. Now is to not do it again [and] to try to keep the emotional balance and move forwards.\"", "url": "https://www.bbc.com/sport/football/live/crmnylm2xv1t"}