{"authors": ["Ffion Wynne", "www.facebook.com"], "date_download": "2025-05-20 13:32:17", "date_modify": "2025-05-20 13:32:17", "date_publish": "2023-08-01 16:59:59", "description": "Two-time Hundred finalists Southern Brave start their campaign with a dominant 27-run win over Trent Rockets.", "filename": "sport_cricket_66375743_1747747937.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/600E/production/_130609542_gettyimages-1585475433.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66375743_1747747937.html", "title": "The Hundred 2023: Southern Brave thrash Trent Rockets in tournament opener", "title_page": "The Hundred 2023: Southern Brave thrash Trent Rockets in tournament opener - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Southern Brave thrashed Trent Rockets by 27 runs in the opening game of The Hundred women's competition at Trent Bridge.\nIndia superstar Smriti Mandhana struck a sublime 55 from 36 balls in Brave's 157-6.\nRockets' chase started disastrously, with opener Bryony Smith run out first ball before slipping to 77-5.\nEngland all-rounder Nat Sciver-Brunt's powerful 31-ball 49 gave Rockets late hope, but they fell short on 130-7.\nTwo-time Hundred runners-up Brave were propelled by Mandhana and Danni Wyatt's opening stand of 65, before England's Maia Bouchier continued the acceleration with an entertaining 31 from 18 balls.\nRockets fought back at the end of the innings through the use of spin as Brave lost five wickets for just 31 runs.\nBut South Africa batter Chloe Tryon added an explosive 23 from just 10 balls to set up a winning total.\nRockets' innings failed to fire at any stage until Nat Sciver-Brunt was joined by India captain Harmanpreet Kaur.\nThey added 45 for the fourth wicket, but all-rounder Georgia Adams took the key scalp of Kaur for 22 to swing the momentum back in favour of Brave.\nAdams added the wicket of former England batter Fran Wilson to her tally, but debutant Mary Taylor, 18, was the star performer with the ball and finished with impressive figures of 3-18.\nBrave captain Anya Shrubsole had Nat Sciver-Brunt caught and bowled with 20 balls remaining to end Rockets' late rally, and ensured a dominant opening performance for her side.\nBrave will aim to continue their winning run against Welsh Fire on Friday 4 August while Rockets will be looking to bounce back against Birmingham Phoenix on Saturday 5 August.\nNat Sciver-Brunt has taken the headlines for many of the biggest stories in women's cricket in 2023 - her price tag of approximately £340,000 in the Women's Premier League in India, going on to win that competition, and following it with a Player of the Series performance in the women's Ashes.\nAnd in her first outing at The Hundred, she looked intent on creating a few more moments of magic.\nWith Rockets 21-3, Brave were comfortably on top but still never comfortable - not while Nat Sciver-Brunt was there.\nEven with 79 needed from just 30 balls, it looked possible as she smashed the next 22 runs in five balls.\nScoring down the ground and through the covers - one boundary was even hit while standing on one leg - the all-rounder looked a class apart on a pitch that was offering a considerable amount to the bowlers and a ball that had been swinging.\nBut when she hit one straight back to the hands of former international team-mate Shrubsole, it ensured Mandhana ended up with the Match Hero medal.\nMandhana's timing and elegance is somewhat in contrast to Sciver-Brunt's pure power, with even her sixes seeming to glide off the bat.\nShe started quite slowly, helped by plenty of wides from the Rockets bowlers, before accelerating and punishing the short balls with intent and aggression.\nBrave lost Sophia Dunkley in the draft but their opening partnership of Mandhana and Wyatt is one of the competition's most fearsome.\nAnd in this form, it looks unlikely that Rockets' bowlers will be the only ones on the receiving end of their onslaughts over the next month.\nTrent Rockets captain Nat Sciver-Brunt speaking to BBC Sport: \"It was a tough start. They batted pretty well but we probably missed our line and length a little. They made it difficult when we were batting. I thought we had a little sniff when I was going but when Anya [Shrubsole] got me.\n\"We just didn't get going quickly enough with the bat. We faced too many dots. If we turn those into ones the target is more achievable. It also doesn't help when you get run out first ball! There is plenty to work on.\n\"We'll get used to playing with different people as the tournament goes on. We've spoken about those bonds before the tournament.\"\nWelsh Fire bowler Alex Hartley on BBC Two: \"Today showed that Southern Brave know how to win.\n\"They've lost two finals but they have a winning formula and know how to win in any situation. I reckon they can do it this year.\"\nYou can watch Hundred matches on BBC Two and BBC iPlayer every Wednesday and Saturday throughout the competition, alongside both finals on Sunday, 27 August.", "url": "https://www.bbc.com/sport/cricket/66375743"}