{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:17:28", "date_modify": "2025-04-26 06:17:28", "date_publish": "2025-03-01 18:37:28", "description": "Marti Cifuentes says side need to learn from defeat against Sheffield United ahead of West Brom fixture.", "filename": "sport_football_articles_cvgwperpp9xo_1745648248.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1936/live/0fe059d0-f6cb-11ef-a811-cd286d96b2f6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cvgwperpp9xo_1745648248.html", "title": "Marti Cifuentes: QPR boss says his side need to learn from Blades loss", "title_page": "Marti Cifuentes: QPR boss says his side need to learn from Blades loss - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Queens Park Ranger's manager Marti Cifuentes says his side have to learn from defeat against Sheffield United before they face West Brom next weekend.\nSpeaking to BBC Radio London the Hoops manager said: \"We are going to play a quality side in West Brom who are pushing for the play-offs with an experienced manager.\n\"We need to learn from this one and keep improving in the areas where we know we can do better.\"\nQPR pushed the Blades hard in the second half as they searched for an equaliser but could not find a way to break the league's second-placed side down.\nCifuentes said: \"We are disappointed and sad. In many aspects I think we performed at a high level against a very good side. I think we really pushed to get a better result but despite we create more chances and controlled many parts of the game it was not enough.\n\"They scored a quality goal with a great strike but then we kept pushing and dominated large parts of the game. When you play against side's of the quality it is important not to make mistakes and the two goals were something we could have done better.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cvgwperpp9xo"}