{"authors": ["Jack Skelton", "www.facebook.com"], "date_download": "2025-05-21 04:26:44", "date_modify": "2025-05-21 04:26:44", "date_publish": "2025-04-05 23:10:42", "description": "Joe Joyce's boxing future is unclear after he lost by unanimous decision against Filip Hrgovic in Manchester.", "filename": "sport_boxing_articles_czd3llvqqevo_1747801604.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/998f/live/ce532d00-1270-11f0-8820-e379e51d3488.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_boxing_articles_czd3llvqqevo_1747801604.html", "title": "Joe Joyce beaten by Filip Hrgovic in Manchester to leave his boxing future in doubt", "title_page": "Joe Joyce beaten by Filip Hrgovic in Manchester to leave his boxing future in doubt - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Joe Joyce is facing serious questions about his boxing future following defeat by Filip Hrgovic at Manchester's Co-op Live Arena.\nCroatian Hrgovic, 32, won by unanimous decision after an absorbing 10-round heavyweight bout against the 39-year-old Joyce.\nBritain's Joyce, who looked sharp at times but allowed Hrgovic to take charge, has now lost four of his last five fights.\nAsked if he felt there was still more he could offer boxing, Joyce told DAZN: \"Yeah. Are you not entertained?\n\"It was a good fight, it was tough and he's a great fighter.\"\nHowever, his promoter Frank Warren said Joyce needs to have a \"real serious think about the future\".\nAfter being rocked early on, Joyce responded well and Hrgovic was cut after a clash of heads, but the Croatian, who won bronze at Rio 2016, landed the cleaner shots throughout the fight.\nThe judges scored it 98-92, 96-95 and 97-93 in favour of Hrgovic, who has now won 18 and lost one of his 19 bouts - that defeat coming last June against Daniel Dubois, who Joyce beat in 2020.\nJoyce, a silver medallist at the 2016 Rio Olympics, won his first 15 professional fights but was stopped twice by Zhilei Zhang in 2023 before losing to Derek Chisora last July.\nHe was meant to face Dillian Whyte in Manchester before his fellow Briton withdrew because of an injured hand.\n\"We'll all have a chat and see where we go from there,\" added Warren.\n\"It was a very close fight. Joe has been a great servant for British boxing and he's never in a boring fight.\"", "url": "https://www.bbc.com/sport/boxing/articles/czd3llvqqevo"}