{"authors": ["Pat Nevin", "www.facebook.com"], "date_download": "2025-04-26 03:56:28", "date_modify": "2025-04-26 03:56:28", "date_publish": "2025-03-04 15:09:30", "description": "Crystal Palace: Mateta injury against Millwall was not malicious", "filename": "sport_football_articles_cvge8peyer5o_1745639788.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/fb16/live/e2307870-f8d3-11ef-8a06-7ba4024a445c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cvge8peyer5o_1745639788.html", "title": "Crystal Palace: Mateta injury against Millwall was not malicious", "title_page": "Crystal Palace: Mateta injury against Millwall was not malicious  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The sickening injury to Crystal Palace's Jean-Philippe Mateta in the FA Cup game against Millwall was a hard watch. Fortunately he will be OK we hear, which is great news, but I also felt a little sympathy with the goalkeeper Liam Roberts.\nYes, he had to see red and he was clearly out of control and reckless, but I am convinced that it was in no way deliberate.\nCharging out of his goal, panicked and leading with his left foot he never once looked at Mateta, only the ball. Mateta similarly only had eyes for the ball and that's when the worst injuries happen because you don't brace for the impact at the last moment.\nGoalkeepers are being asked to do what they aren't great at, to come out of their areas to become players, rank amateurs against top professionals. I also wonder how reactions might have been different if Roberts had pulled out of making a challenge and Mateta had put the ball into an empty net, would everyone have been praising his safety-first approach or questioning his commitment?\nGone are the days when keepers were allowed to and indeed encouraged to \"clean out everyone and everything\" in front of them, ball, attackers or defenders, in the knowledge they would be over protected by the officials. I felt the physical pain of those \"over enthusiastic\" challenges myself over the years and it didn't feel fair then.\nMy sympathy comes from the fact that goalkeepers have to be incredibly brave and, more often, come off second best. Forwards usually lead with their boots in 50/50 challenges while the keepers are usually low with their hands and often their heads in the danger areas. Strikers are still encouraged to go in with full force on these occasions by their managers and many pundits, even when the keeper's head is in the danger zone.\nSo for every Schumacher v Battiston clash (here it is on YouTube, kids, external), or Roberts v Mateta, there are just as many serious fouls on the stoppers.\nChelsea's Petr Cech was horrifically injured against Reading and had to wear protective headgear for the rest of his career due to skull damage, he could have been killed. Many years ago in the FA Cup final, German keeper Bert Trautmann had his neck broken, and amazingly played on! There was a wonderful goalkeeper for Glasgow Celtic, Johnny Thompson, who tragically lost his life after a challenge with Rangers centre-forward Sam English. And there have been many more tragedies and near tragedies.\nSo yes, the Millwall goalkeeper had to be sent off but, because it wasn't deliberate, I cannot be angry with him however ever ugly it looked.", "url": "https://www.bbc.co.uk/sport/football/articles/cvge8peyer5o"}