{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:13:43", "date_modify": "2025-04-26 06:13:43", "date_publish": "2025-03-05 00:00:00", "description": "Manchester City's hopes of playing Champions League football next season were dealt a blow by a late West Ham equaliser.", "filename": "sport_football_live_c2kgvg2pd0zt_1745648023.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/369b/live/9d841cc0-fa0b-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_c2kgvg2pd0zt_1745648023.html", "title": "Man City denied by late West Ham leveller", "title_page": "Man City denied by late West Ham leveller - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Manchester City's hopes of playing Champions League football next season were dealt a blow by a late West Ham equaliser.\nKhadija Shaw thought she had sealed victory with a close-range finish after coming off the bench, but West Ham substitute Manuela Pavi clinched a well-deserved point for the hosts in the first minute of added time.\nThe draw meant City remain fourth in the Women's Super League table, but third-placed Arsenal have a point advantage and game in hand.\nGareth Taylor made six changes to his side but they struggled to get going as West Ham stifled their opponent's build-up play and created the better chances in the first half.\nThe visitors struggled to cope with West Ham's pressing and only a brilliant Ayaka Yamashita save denied Seraina Piubel, after Jill Roord was dispossessed in midfield, before she denied the home side's Swiss striker twice more following City turnovers.\nWest Ham began the second half much as they ended the first, but the introduction of striker Shaw on the hour mark sparked City into life.\nThe WSL's leading goalscorer this season forced Kinga Szemik into a smart save with her first touch, before attempting an audacious overhead kick moments later.\nCity debutant Laura Wienroither crashed a close-range effort against the crossbar after Shaw proved a nuisance at a set-piece, before the Jamaican striker gave City an 80th-minute lead after Mary Fowler's deep cross was flicked on by fellow substitute Vivianne Miedema.\nBut ninth-placed West Ham's spirited performance was rewarded in the final moments when Pavi gathered the ball on the left of the box and curled a strike into the bottom far corner.\nCity now turn their attention to a FA Women's Cup quarter-final meeting with Aston Villa on Sunday, while West Ham are not in action until they host Tottenham on 23 March.\nCity were not at their best in a 2-1 defeat of Tottenham Hotspur on Sunday and that was the case again in a match they really needed to win.\nRoord, Jess Park and Mary Fowler all returned to the starting XI after making an impact from the bench against Spurs, but they were unable to prevent West Ham from dominating the midfield battle during the first half.\nThough City did pose a threat on the break through wide players Kerolin and Lily Murphy, but they lacked the midfield control that has become the hallmark of Taylor's side.\nHe has previously argued any side in world football would struggle in the absence of world-class talents like Shaw, Lauren Hemp and Alex Greenwood, all of whom have missed large parts of this campaign.\nYet the fact City looked so much better after Shaw's introduction highlights a concern, not to mention their failure to hold on to what would have been a scarcely-deserved win.\nTaylor's side could find themselves seven points adrift of third place - the final Champions League qualification spot - by the time they next play in the WSL.\nYet, despite losing 11 of their previous 12 meetings with City, it should be no surprise West Ham rallied late. They came into the game having won four of their last five WSL home games - as many victories as across their previous 29 league matches on their own turf.\nRehanne Skinner's side led Arsenal 3-1 on Sunday, but conceded three times in six second-half minutes to lose 4-3. In the League Cup last month, they also pushed Chelsea in a 2-0 defeat.\nIt looked as though the absence of top scorer Viviane Asseyi - suspended due to an accumulation of yellow cards - would cost the Hammers, but Colombian forward Pavi stepped up to snatch the late leveller and spark wild celebrations at Chigwell Construction Stadium.", "url": "https://www.bbc.co.uk/sport/football/live/c2kgvg2pd0zt"}