{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:37:34", "date_modify": "2025-04-26 04:37:34", "date_publish": "2025-03-02 00:00:00", "description": "Follow live text updates from Sunday's SWPL games and watch live coverage of Rangers v Hearts and Hibernian v Celtic.", "filename": "sport_football_live_c2err8dg743t_1745642254.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a48c/live/05880f20-f5c5-11ef-896e-d7e7fb1719a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_c2err8dg743t_1745642254.html", "title": "BBC Sport - BBC Sport", "title_page": "SWPL - Watch Hibs v Celtic after Glasgow win and Rangers & Hearts draw: BBC Sport - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Goodnight\nRight I think that's enough for tonight. We'll have all the reaction over on our dedicated women's football page.\nPlus, you can catch all the highlights on Sportscene tomorrow night. It's on the BBC Scotland channel at 19:30.\nCatch you next weekend!\nPost\nFT: Hibernian 1-0 Celtic\nHibs striker Eilidh Adams tells BBC Alba: \"It's an enjoyable win. I was happy to score but for it to be the winning goal is even better. I'm happy I can help the team get the three points.\n\"I'm just trying to get myself in the box, that's where I'm supposed to be as a striker.\n\"Every game is very important so it's one game at a time for us. Everything seems to be going well so we'll just continue what we're doing and taking it game by game.\"\nFULL-TIME Hibernian 1-0 Celtic\nWell well well what a massive three points for Hibs!\nThey end the pre-split games joint top of the SWPL, who'd have been expecting that at the start of the season?\nPost\nHibernian 1-0 Celtic\nElena Sadiku is fuming on the touchline as Lucy Ashworth-Clifford's cross goes up and out.\nLauren Doran=Barr is the latest to go down with cramp.\nFour minutes of the 90 to play.", "url": "https://www.bbc.co.uk/sport/football/live/c2err8dg743t"}