{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:21:07", "date_modify": "2025-04-26 06:21:07", "date_publish": "2025-03-04 00:00:00", "description": "Brahim Diaz's brilliant winner gave Real Madrid a slender advantage after the first leg of their Champions League last-16 tie against rivals Atletico Madrid.", "filename": "sport_football_live_c86ppej278jt_1745648467.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c260/live/8ceac000-f941-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_c86ppej278jt_1745648467.html", "title": "Real Madrid 2-1 Atletico Madrid", "title_page": "Real Madrid 2-1 Atletico Madrid - Brahim Diaz nets winner in derby meeting - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Brahim Diaz scored a brilliant winner to give Real Madrid a slender advantage over city rivals Atletico after the first leg of their Champions League last-16 tie.\nRodrygo put the hosts ahead inside four minutes in the Bernabeu when he sprinted past Javi Galan and chopped inside the box before bending a wonderful hit past Jan Oblak.\nAtletico, though, quickly settled into the game and levelled in the 32nd minute with another wonderful goal.\nThe in-form Julian Alvarez picked up the ball on the left side of the box, wrongfooted Eduardo Camavinga and whipped a spectacular curling strike around Thibaut Courtois and in off the post.\nIt was the Argentine striker's seventh goal in nine appearances in the competition this season.\nBut it was Diaz, another former Manchester City player, who claimed the decisive goal in an electric Madrid derby.\nThe Spaniard sent Atletico defender Jose Gimenez to the floor as he skilfully waltzed into the box before driving a low shot into the far corner in the 55th minute.\nThe 25-year-old midfielder had stepped up in Jude Bellingham's absence, with the England international serving a one-game suspension after picking up his his third yellow card in the competition against Manchester City earlier this month.\nBellingham will be available for the defending European champions when they make the short trip to the Riyadh Air Metropolitano for the return on Wednesday, 12 March (20:00 GMT), with the winners likely to face Arsenal in the last eight after their 7-1 first-leg thrashing of PSV in Eindhoven.\nAtletico midfielder Conor Gallagher told TNT Sports: \"Real Madrid are a top team and I think we competed well. I think it was a decent performance.\n\"We would've liked to get a better result but it's all to play for in the next leg. We feel we can beat any team and with our fans behind us, it helps, and we'll be looking forward to it.\"\nThis was a Madrid derby defined by three moments of outstanding individual brilliance.\nFirst, it was Rodrygo. The Brazilian beat Galan for pace to sprint on to Federico Valverde's pass before cleverly cutting back to confidently sweep Real into an early lead.\nHe had a penalty appeal waved away moments later as he again got the better of Galan, who appeared to grab hold of Rodrygo and step across him in the box.\nAsked if Rodrygo was underrated, Carlo Ancelotti told TNT Sports: \"Not for us. Rodrygo for us, he helped us win the Champions League, he helped us a lot to win the Champions League in the last three years.\"\nBut the 24-year-old's opening strike was soon overshadowed by Alvarez's stunning effort. The Argentina international has hit a purple patch for Atletico in recent weeks and that continued as his audacious effort made it six goals in his last seven games.\nThe 25-year-old, who left Manchester City for £81m in the summer, has been Atletico's key figure in this campaign and his goal against Athletic Bilbao on Saturday moved them two points above Real - and one behind leaders Barcelona - in a tight La Liga title race.\nEngland international Gallagher said Alvarez's strike \"didn't surprise\" him.\nThe former Chelsea player, who came off the bench in the 64th minute, added: \"It was an unreal goal. It doesn't surprise me. He's playing with so much confidence, he's a top player and a top guy.\"\nBut Diego Simeone's men were unable to push on and claim a rare win at the Bernabeu as Diaz wrapped up victory for Real, linking up well with Vinicius Jr before his darting run into the box ended with a delightful finish.\nThe game seemed to lack the hostile atmosphere and aggression of a typical derby between them, with Diaz's celebration - jumping into the jubilant crowd - the only yellow card of the match.\nReal, who have won the previous five Champions League meetings against Atletico in knockout ties, had a late chance to claim a two-goal cushion for the second leg.\nBut Kylian Mbappe's poor ball to Vinicius Jr meant the Brazilian missed out on a tap-in.", "url": "https://www.bbc.co.uk/sport/football/live/c86ppej278jt"}