{"authors": ["Dan Wheeler", "www.facebook.com"], "date_download": "2025-05-20 13:09:53", "date_modify": "2025-05-20 13:09:53", "date_publish": "2023-08-02 13:46:35", "description": "Derby County boss Paul Warne says speculation over Max Bird's future will not get out of hand after Hull City's bid was rejected.", "filename": "sport_football_66383682_1747746593.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/103ED/production/_130614566_gettyimages-1579276027.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66383682_1747746593.html", "title": "Paul Warne: Derby County boss not expecting deal for Max Bird to become a 'drama' after Hull bid rejected", "title_page": "Paul Warne: Derby County boss not expecting deal for Max Bird to become a 'drama' after Hull bid rejected - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Derby County head coach Paul Warne says he does not think Max Bird's future will become a \"drama\" following the club's rejection of Hull's City's bid for the midfielder.\nHighly-rated Bird, 22, has been with the Rams his whole career, clocking up more than 150 appearances since 2017.\nWarne said the Tigers' offer \"fell significantly under\" Derby's valuation for the player.\n\"He likes the option of playing here in the Championship,\" Warne said.\nHull, managed by the Rams' former interim boss Liam Rosenior, are keen to bring in Bird, who was made vice-captain at Derby when Rosenior took temporary charge at Pride Park the start of last season.\nBut, Warne - who took over as the Rams permanent boss in September - says any potential deal remains a long way off.\n\"He hasn't given me any indication he wants to leave,\" Warne told BBC Radio Derby.\n\"I pulled Birdy straight away and told him (about Hull's offer). I told him it was nowhere near the valuation we had for him and it had been rejected. He said 'ok gaffer fine'\n\"He's trained really well and in a good place. We're trying to play him a bit higher up the pitch which will hopefully help us with the promotion bid and help me trying to convince him to stay.\n\"If it doesn't it it might put him in the shop window for better clubs that are currently looking at him.\n\"I don't think there's any drama as we don't have any intention of selling him unless there's a bid near our valuation.\"\nDespite Hull offering Bird the opportunity to play Championship football, Warne does not think the player is agitating to leave.\n\"No I don't think so. But, then in fairness, I don't want to leave but if Manchester United phone up then I'll be 'Look I've had a great time but I'm off',\" he added.\n\"So you have to understand it's football and players are pulled by certain things but I also understand Birdy has the talent to play at a higher level - as I have with loads of these players.\n\"These players do not want to be in League One. Birdy doesn't want to play in League One, nor should he, so I understand the pull of the Championship. But a deal to be made, everyone has to be happy.\"\n\"He hasn't given me any signals he wants to leave.\"\n\"I'd like to think if you turn up and watch you'll leave with a smile on your face more often than not.\"\nAs far as getting back to the Championship is concerned, Warne knows that \"everybody wants a promoted club\" but says although it would be a \"huge disappointment\" if they didn't do it this season, it \"wouldn't be a catastrophe\" or the \"end of the football club\".\n\"I see the dressing room no-one else sees. The absolute joy - that is priceless,\" said Warne, who won promotion to the second tier three times during his time as Rotherham boss.\n\"For me to be a very small part of something amazing - that could please the dressing room and the 30,000, plus 60,000 who can't come to every game, and the people who have the club in their soul - would be phenomenal.\n\"I want this group of players to have that.\"", "url": "https://www.bbc.com/sport/football/66383682"}