{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:42:46", "date_modify": "2025-04-26 07:42:46", "date_publish": "2025-02-26 19:10:42", "description": "Oguntibeju commits future to Glasgow", "filename": "sport_articles_c20dgx4lzrko_1745653366.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8464/live/3697e980-f46e-11ef-aeb3-bb556fdec0fe.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_c20dgx4lzrko_1745653366.html", "title": "Oguntibeju commits future to Glasgow", "title_page": "Oguntibeju commits future to Glasgow - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Glasgow second-row Jare Oguntibeju has continued his incredible rise in professional rugby by committing his future to Scotstoun club, penning his first pro contract.\nThe 22-year-old has impressed hugely on his four outings so far, scoring against Toulon in the Champion Cup, having only joined the club on a pro contract in the summer.\nBorn in South Africa, the 6ft 8ins lock spent his childhood in Edinburgh and had a trial spell at the capital club before joining Ealing Trailfinders.\nAfter picking up a bad knee injury playing for Scotland's Under-20s, he made his return playing in the Super Series for Stirling Wolves.\nBefore making his Glasgow bow, he also picked up a Scotland A cap in the game against Chile in November.\n\"I'm very grateful for the chance,\" Oguntibeju told club media. \"I didn't expect it all to happen so soon after arriving, but I'm really proud to have the chance to represent this club.\n\"I've really enjoyed it – I didn't expect to play as much as I have, but I've been blessed with the opportunity and Franco and the coaches have shown great trust in me this season so far.\n\"Positionally, all the second-rowers have been huge for me, whether that's someone like Scott [Cummings] with my defence or Max [Williamson] with lineout detail. Guys like Henco [Venter], the Fagersons, the whole pack, too – it's like a real family group.\"", "url": "https://www.bbc.co.uk/sport/articles/c20dgx4lzrko"}