{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:11:45", "date_modify": "2025-05-21 06:11:45", "date_publish": "2025-04-05 00:00:00", "description": "Shayden Morris' \"amazing\" strike gives Aberdeen a narrow Scottish Premiership victory over Ross County, continuing their recent renaissance in form.", "filename": "sport_football_live_c1dr5el93lrt_1747807905.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c1dr5el93lrt_1747807905.html", "title": "Ross County vs Aberdeen: Scottish Premiership report, reaction & stats", "title_page": "Ross County vs Aberdeen: Scottish Premiership report, reaction & stats - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "'A massive collective performance' - Gray\nFT: Rangers 0-2 Hibernian\nHibernian head coach David Gray tells BBC Scotland: \"It's huge. 2018 was the last time a Hibs team came here and won. The way we started the game was huge, the composure we showed and getting the goal.\n\"You put a game plan in place knowing Rangers are going to have a lot of the ball, so you have to be really disciplined without the ball. Every time there was a slight mistake, a teammate was there to bail them out. A massive collective performance - the subs came on and impacted the game.\n\"It's an incredible run and the players deserve all the credit for it. The big thing was trusting what we were doing. Not being too high when it's good and not being too low when it wasn't.\n\"I never stopped believing and it's been a huge collective effort from everyone involved.\n\"If we keep winning games, nobody can catch us and that's the mindset moving forwards.\"\nMcInnes pleased with 'efficient' Kilmarnock\nFT: Kilmarnock 2-0 Motherwell\nKilmarnock manager Derek McInnes tells BBC Scotland: \"Sometimes Scottish football just needs you to be efficient. Don't make mistakes. On the back of last week we needed to be that type of team.\n\"I thought we were the better team when they had 11 men, and I thought we were professional and efficient when they went down to 10 men.\n\"There was a lot of drama but we stayed professional and stayed calm and dealt with the game. The second goal allowed us to breathe a bit easier. And they only registered their first shot on target in the dying embers of the game.\n\"It's great to get a clean sheet and a few boys back who have been out for a long time. I thought it looked a bit more like us. Just be efficient, get on with the job and get the job done.\"\nMcInnes thought Kofi Balmer's red card challenge \"didn't look good\", pointing out he caught Fraser Murray around the knee.\nHe also believes Dominic Thompson's sending off should have stood, and was \"more of a red card\" than Balmer's.\nFerguson 'raging' and 'not scared to make changes'\nFT: Rangers 0-2 Hibernian\nRangers interim manager Barry Ferguson tells BBC Scotland: \"Angry, really angry in fact - that's the most simple way I can put it. There's no way I'm accepting that.\n\"I thought we started on the front foot before Hibs got the first goal. Another mistake from us. I said at half-time I need to see more, I want to see more aggression in our play and I never saw it. That's the thing I'm raging with.\n\"I'm not going to kid anybody on. Hibs deserved it. They tackled harder, ran harder and wanted it more. It's sore for me to say that.\n\"I'll take the responsibility. I pick the team and I need to go away with the players and have a long hard look in the mirror.\n\"This [season] is in real danger of just petering out. It's about pride. I know we're in the Europa League, but those are easy games to get up for.\n\"I will make changes, I'm not scared to make changes. I need a team that's willing to put their bodies on the line.\"\nCounty loss 'very similar' to previous defeat\nFT: Ross County 0-1 Aberdeen\nRoss County manager Don Cowie tells BBC Scotland: \"It was a tight game. We got done by a moment of real quality, a fantastic goal from Shayden Morris.\n\"We know the strength he possesses, pace. It was disappointing to concede a goal in that manner, but you recognise it's a very good goal.\n\"I dint't think there was too much in the game, lots of endeavour, lots of effort from both teams. Challenging conditions with the wind. It was very similar to the Dundee United game, I'm just frustrated we didn't create any real opportunities to hurt Aberdeen.\n\"We were in enough good areas but lacked that bit of quality.\"\nDefence delights Dundee's Docherty\nFT: Dundee 2-0 St Mirren\nDundee manager Tony Docherty tells BBC Sportsound: \"I'm absolutely delighted for the boys, I think they got the rewards for the effort they put in.\n\"The clean sheet's the most important thing. The two centre-backs in particular, I thought they were magnificent. They know if they can defend, we've got players in the team that will score and that's a great feeling.\n\"It just now gives us that platform. I'm not bothered about looking at the league table. The consistency of performance will get us out (of trouble).\"\nThelin heaps praise on match-winner Morris\nFT: Ross County 0-1 Aberdeen\nAberdeen manager Jimmy Thelin tells BBC Scotland: \"We were prepared for a difficult game. There was a lot of second balls. They are good at that, but we were really stable as a team. Everybody took responsibility. We kept them out for most of the game.\n\"It was difficult for us to create chances but I've looked at Shayden's goal and it's amazing.\n\"If you look at his journey this year, the assists and goals he gets, how he defends... It's good to see players take steps and grow. It's a lot of work from his side, he has a strong mentality, he pushes himself.\"\nBalmer sending off 'not a red card'\nFT: Kilmarnock 2-0 Motherwell\nMotherwell manager Michael Wimmer tells BBC Scotland: \"The game was killed after the red card, what can I say? We talked at half time about keeping it to 1-0. Then we might get the opportunity on the counter attack. But we defended a set piece badly.\n\"If this is a red card, then the one last week [Pape Gueye's challenge] in Aberdeen is a double red card. It's the same as last week, if there is a red card it's a different game.\n\"I can't understand the decision. Kofi [Balmer] wants to pass the ball, this is one movement, one swing. He has to clear the ball, so he has to swing.\n\"There's no movement, he's standing. For me, it's not a red card.\n\"I see the the guys in training and we need to bring that into the match. We don't have to always speak about top six, we also have an eye in the other direction, to be confident to get results now.\n\"It's difficult with 10 men so I can't blame the guys.\"\n'End product poor all over the pitch'\nFT: Dundee 2-0 St Mirren\nSt Mirren manager Stephen Robinson tells BBC Sportsound: \"We controlled the game but our quality was poor. We have three or four really good gilt-edged chances that we miss.\n\"There's a lot of good in it but the end product was poor all over the pitch. If your end product's poor and you make individual errors, which we did, we get punished for, then you lose football matches.\n\"The disappointment is the consistency, we haven't followed a great result up anytime this season. I can't ever fault the effort, I can't ever fault the desire of the players, we just lacked quality in that final third.\"\nBoyle enjoying 'buzz' at Hibs\nFT: Rangers 0-2 Hibernian\n\"We knew it would be tough and it was in spells but we rode that to get what we deserved, I feel,\" a delighted Martin Boyle tells BBC Scotland.\nBoyle, who scored Hibs' second goal at Ibrox, adds: \"We want to tie down that third spot and we're just taking it game by game.\"\nHibs are now unbeaten in 16 league games, winning 11.\n\"Incredible,\" says Boyle. \"We believe in the manager and the squad and the fans are fully behind us. The whole club is buzzing.\"", "url": "https://www.bbc.com/sport/football/live/c1dr5el93lrt"}