{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:50:05", "date_modify": "2025-05-20 13:50:05", "date_publish": "2023-07-31 19:11:25", "description": "Aberdeen sign Serbian centre-half Slobodan Rubezic from Novi Pazar for an undisclosed fee.", "filename": "sport_football_66347955_1747749005.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4A2D/production/_130598981_20788352.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66347955_1747749005.html", "title": "Slobodan Rubezic: Aberdeen sign centre-half from Novi Pazar", "title_page": "Slobodan Rubezic: Aberdeen sign centre-half from Novi Pazar - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Aberdeen have signed Serbian centre-half Slobodan Rubezic from Novi Pazar in his homeland for an undisclosed fee.\nThe 23-year-old, who stands at 6ft 4in, has agreed a three-year contract, with the option of a further 12 months.\nHe made 37 appearances last season for the side that finished sixth in Serbia's SuperLiga.\n\"Slobodan is a good old-fashioned defender, exactly what we need to bolster our defensive options\", said Aberdeen manager Barry Robson.\n\"He has had to be patient as we worked through the process, so I'm delighted to get this one finally over the line.\n\"Slobodan is a really driven and determined player who enjoys winning. He believes Aberdeen is the perfect environment for the next step in his footballing career and we look forward to working with him to help fulfil his personal aspirations, while also helping the club to achieve its ambitions next season.\"\nRubezic joined Novi Pazar from Bulgarian top-flight club Arda Kardzhali in January 2022.\nHe came through the youth ranks with Vojvodina Novi Sad before moving to Cukaricki, from whom he had a loan spell with Novi Pazar prior to a sixth-month spell in Bulgaria's top flight.\n\"I am very happy to have signed for such a big club and to now be playing in a country that loves football,\" he told the club website.\n\"I will do my talking on the field and will give everything I have for the team.\"", "url": "https://www.bbc.com/sport/football/66347955"}