{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:54:12", "date_modify": "2025-05-21 03:54:12", "date_publish": "2025-04-07 14:33:48", "description": "Jack Milne pens long-term Aberdeen extension", "filename": "sport_articles_cjr7y2g4nrdo_1747799652.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2c47/live/2fc58010-13bb-11f0-92ad-eb42d450dc76.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cjr7y2g4nrdo_1747799652.html", "title": "Jack Milne pens long-term Aberdeen extension", "title_page": "Jack Milne pens long-term Aberdeen extension - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jack Milne has signed a new deal with Aberdeen, keeping him at the club until at least 2029.\nThe 22-year-old's previous contract was due to expire in 2026.\nA central midfielder by trade, Milne has been converted into a defender at Pittodrie recently and is looking to stake a claim at the heart of the Dons' defence.\n\"Since our arrival at Aberdeen, Jack's potential was evident for us to see,\" manager Jimmy Thelin told club media.\n\"He is taking steps this year to continue his development and we believe this new contract will give him long-term stability and the ability to continue his progression in familiar surroundings, in an environment which should positively influence his future.\n\"Jack is determined to improve and play an important part for Aberdeen and we look forward to continuing our work alongside him.\"\nFollowing loan spells with Brechin City and Kelty Hearts, Milne broke into the first team in the 2023-24 season, featuring in the Dons' impressive European win over Eintracht Frankfurt.\n\"To be part of the manager's long-term plans is a very nice feeling and gives you confidence as a player,\" Milne said.\n\"I recognised early on, the way he wants the team to play, that I had the attributes to help the team in the long run. I am really looking forward to the future.\"", "url": "https://www.bbc.com/sport/articles/cjr7y2g4nrdo"}