{"authors": ["Iain Carter", "www.facebook.com"], "date_download": "2025-05-21 05:54:25", "date_modify": "2025-05-21 05:54:25", "date_publish": "2025-01-14 11:39:21", "description": "It is an indication of how much the golfing landscape is changing that Jon Rahm is starting his competitive year this week at the Hero Dubai Desert Classic, writes Iain Carter.", "filename": "sport_golf_articles_cj65kd4xr6ko_1747806865.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/aa42/live/ea80dc40-d268-11ef-9fd6-0be88a764111.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_golf_articles_cj65kd4xr6ko_1747806865.html", "title": "Jon Rahm in DP World Tour action in Dubai at start of Ryder Cup year", "title_page": "Jon Rahm in DP World Tour action in Dubai at start of Ryder Cup year - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It is an indication of how much the golfing landscape is changing that Jon Rahm is starting his competitive year this week at the Hero Dubai Desert Classic.\nThe former Masters champion is no stranger to success at this time of the year. The PGA Tour's west coast swing was fertile territory, with nearly half of his 11 victories on the US circuit coming in either January or February.\nSo the DP World Tour's traditional start in the Middle East never entered Rahm's radar until his lucrative move to the breakaway LIV tour at the end of 2023.\nIt was a switch that put him at odds with the establishment, but with an appeal pending against sanctions for playing LIV events without permission, the 30-year-old remains free to play European tour tournaments.\nThis means he will tee it up with Ryder Cup team-mates Rory McIlroy, Tommy Fleetwood and Viktor Hovland here in Dubai. \"When I was playing a full PGA Tour schedule a lot of my focus was on the west coast,\" Rahm told BBC Sport.\n\"Four years of university there, success in those events in Hawaii, Palm Springs, Torrey Pines, Pebble Beach and Phoenix, it was very difficult to justify not playing those, with how well I played every year.\"\nBut Rahm says his move to LIV has \"opened up my January\" and he is clearly keen to assert contentment with his move to the Saudi Arabia backed tour.\nThe Spaniard was regarded as a moody presence at various events last year when he struggled in the early majors and had to wait until July before posting his first win in one of LIV's 54-man tournaments.\nHe went on to become LIV's 2024 individual champion. But there was speculation that he had a form of \"buyer's remorse\" after signing for a reported $450m.\nHe insists otherwise and agreed with what English Legion XIII team-mate Tyrell Hatton recently stated in typically forthright and fruity fashion.\n\"I'm not going to use the same words that my good friend Tyrrell used,\" Rahm smiled. \"But what he said is the absolute truth.\"\nNonsense was the polite version.\n\"I don't know why some parts of the media felt like they needed to make it sound like I was unhappy,\" Rahm continued. \"I was comfortable with my decision and had an incredible year in LIV and had a lot of fun and it was enjoyable.\n\"If at any time I felt unhappy it was because I didn't enjoy some of the press conferences I had to do at some events. Maybe I hadn't played my best golf up until June, July.\n\"But the number one reason was my wife had an incredibly difficult pregnancy. It was weighing on me and things got a lot better in July.\n\"You can actually see a difference in me and in my golf game right from when we got better news.\n\"Starting the year it was a challenge. My wife was in bed rest, there was danger potentially for her and the baby. It was never a comfortable situation to be in.\n\"So when I was seeing those reports, was I upset? No, but I just wished they told the truth.\"\nRahm, of course, has millions of reasons to promote the LIV cause. He said: \"I have had a lot of people have reservations about LIV and then go and see an event in person and completely change their mindset.\"\nHe talks of his relief at finally winning last July at LIV's British event in Staffordshire. \"To make a big career change and still end up being successful in the first year right away, I think, it was very nice to accomplish.\n\"That first win at JCB was more relieving than anything else. To become the individual champion was fantastic but to be honest so much of our effort goes to the team and it is the team victories that I have come to enjoy a lot.\"\nAnd the ultimate team win would still come within the established golfing order. Tellingly, Rahm hopes his appeal against the DP World Tour punishments comes, as expected, after the Ryder Cup - a scenario that is convenient for all sides.\nBethpage in September will be his fourth Ryder Cup and he its still waiting for victory on the road. \"I haven't been there,\" he said.\n\"The last time was 2012 and from then on the home team has won by large margins, so clearly teams have become a lot better at defending their home turf.\n\"The golf course set up has become a lot different and Rory said it best in Italy when he said winning an away Ryder Cup has become one of the hardest things to do in golf.\n\"He is right. It would be incredible to be part of a team that wins away.\"\nIn the meantime golf needs to sort itself out. Back in April, Rahm told BBC Sport that he thought his move to LIV as the reigning Masters champion could prove \"a catalyst\" for a peace deal between the rival factions.\nThe sport still awaits. \"It's real hard to know what goes on behind closed doors,\" the burly Basque told reporters here. \"I think so many of us want some kind of resolution to come together.\n\"And get the best product possible for the consumer, which is what I think we're still in a position to do. But I think we're living in a golden era right now for golf, where the possibilities are endless.\n\"A big tour in Europe and worldwide and a massive tour, the PGA Tour. And you have another big product with LIV and now you're even adding the TGL (McIlroy and Tiger Woods' Tomorrow's Golf League).\"\n\"When it comes to golf, the possibilities are there right now. I think with the right minds put together, you can end up with a product, and I've been saying this all along, that could put golf at a different level in the world of sport.\"", "url": "https://www.bbc.com/sport/golf/articles/cj65kd4xr6ko"}