{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:34:48", "date_modify": "2025-05-21 04:34:48", "date_publish": "2025-04-05 00:00:00", "description": "Listen to live commentary and follow text updates from the third practice and qualifying sessions at the Japanese Grand Prix.", "filename": "sport_live_crewp2q71y4t_1747802088.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5087/live/d7b414f0-11ed-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_live_crewp2q71y4t_1747802088.html", "title": "Catch up on Japanese Grand Prix qualifying as Max Verstappen takes pole position", "title_page": "Catch up on Japanese Grand Prix qualifying as Max Verstappen takes pole position - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Post\nWith Max Verstappen on pole, the McLarens snapping at his heels, and the potential for unpredictable weather, tomorrow's Japanese Grand Prix is set up to be a good one.\nWe'll be back with build-up from 05:00 BST, with lights out at 06:00.\nSee you then.\nVerstappen pips Norris to Japanese Grand Prix pole - report\nAndrew Benson\nBBC F1 correspondent at Suzuka\nMax Verstappen stunned his own Red Bull team and rivals McLaren by grabbing pole position from Lando Norris for the Japanese Grand Prix.\nLagging behind the McLarens throughout the weekend, the world champion pipped Norris by 0.012 seconds with his final lap of the session.\nThe second McLaren of Oscar Piastri, fastest on the first laps of the session by 0.226secs from Verstappen, was third, ahead of Ferrari's Charles Leclerc.\nMercedes' George Russell took fifth, while Ferrari's Lewis Hamilton was eighth.\nWhen Piastri fell short of beating Verstappen with the final lap of the session, confirming the Dutchman's pole, the awe in the Red Bull garage was clear.\n\"That is insane,\" his race engineer Giampiero Lambiase said to Verstappen over the radio.\nRead the full report here.\n'I hope the rain comes'\nFerrari's Lewis Hamilton, who qualified eighth: \"Not good enough from my side. P8 is not great. We are running higher than I would like but everyone is in the same boat.\n\"Charles [Leclerc] did an amazing job. We went in different directions with set-up. I had a lot of understeer and just couldn't dial it up.\n\"I genuinely love the rain so I hope it comes tomorrow after a qualifying like that.\"\n'It's quite difficult to operate this car properly' - Tsunoda\nRed Bull's Yuki Tsunoda was knocked out of Q2 and will start in 15th, he told Sky Sports: \"[The wing level] was a bit different from Max [Verstappen] but at the same time it was the wing level I chose in the end, there was pace to go through to Q3 today, I just wasn't able to put it together in the end.\"\nOn his first weekend with the team: \"Surprisingly I think I feel OK in terms of pressure, in the last Q2 lap it was probably the most pressured time.\n\"I had the pace from FP3 so I didn't expect to end up like this today so it's a shame but at least the positive is I'm starting to understand the car.\n\"It's quite difficult to operate this car properly, it's more narrow than the Racing Bulls' car, but at least I feel confidence in the car and I know what to do in the future.\"\n'One of his best qualifying laps'\nRed Bull team principal Christian Horner, speaking to Sky Sports: \"We did not expect that. Outstanding.\n\"He [Max Verstappen] extracted every ounce of performance. He got the most out of it today and getting that pole position was completely against the form we had been seeing. A big lift for the team.\n\"That was one of his best laps in qualifying ever.\"\n'We’ve still got a great car for tomorrow and a fight for the win' - Piastri\nOscar Piastri in the McLaren will start on the second row in third, he said: \"I felt good through most of qualifying especially at the start of Q3, it was a good lap but it was just the last lap didn’t quite come together as I had wanted but incredibly tight margins so I think it’s all to play for tomorrow.\n\"We’ve got a great car and a little bit more left on the table at the end of the day so we will try again tomorrow.\"\nOn taking the challenge to Max Verstappen: \"We have got good pace, I think the others have not been as far away as people think, you never quite know with engine modes and stuff like that.\n\"This morning was pretty tight so it’s not a massive surprise. I think Max has done a great job to end up on pole but I think we’ve still got a great car for tomorrow and a fight for the win.\"\nOn the weather and the threat of rain: \"I don’t mind, our pace has been good in all conditions so far and I work on whatever comes, let’s see what we get.\"\n'Hats off to Verstappen'\nMcLaren's Lando Norris, who finished second quickest: \"Congrats to Max. He did a good job. Hats off as you have to credit when he did a lap that good. I am happy. Max did an amazing lap. For us both to be up there fighting for pole is good, but not enough.\n\"My lap was very good. I feel like if I was to go again I wouldn't be quicker. We were on the limit.\n\"No-one knows what the weather will do tomorrow. It will be a good race. I am excited for it.\"\n'This is a proper highlight for us' - Verstappen\nRed Bull’s Max Verstappen takes pole position for the fourth time in a row at the Japanese GP, he said: \"I am [surprised], we tried the best we could to get the best possible balance for the car but it wasn’t easy even in qualifying, but in every session we just kept on making little improvements.\n\"I think that’s where we made the difference and the last lap was just flat out, I mean around here being on the limit and maybe even a bit over it at places is incredibly rewarding.\"\nOn the circuit: \"It’s insane, a Formula 1 car around here in Sector One especially is unbelievable and with the new tarmac as well it gives you even more grip around here, it's even harder.\"\nOn the race on Sunday: \"This is a proper highlight for us to be back on pole here but we will look to tomorrow, there might be some rain around but we will do our very best.\"", "url": "https://www.bbc.com/sport/live/crewp2q71y4t"}