{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:52:51", "date_modify": "2025-05-21 07:52:51", "date_publish": "2025-01-30 23:06:29", "description": "Rangers 2-1 Union Saint-Galloise: What did the manager say?", "filename": "sport_articles_c74m1zw0xzvo_1747813971.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/526a/live/4ffdfce0-df5e-11ef-be62-217e5da8a772.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c74m1zw0xzvo_1747813971.html", "title": "Rangers 2-1 Union Saint-Galloise: What did the manager say?", "title_page": "Rangers 2-1 Union Saint-Galloise: What did the manager say? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Rangers manager Philippe Clement: \"It's a massive achievement for the whole squad. \"The whole squad was necessary.\n\"Leon King couldn't see anymore, Ross McCausland had to come on at full-back.\n\"We had to be very creative the last few months but we've done it brilliantly.\n\"Massive clubs with massive budgets have finished behind us, and around us, the achievement is only bigger by beating four of the seven top teams.\n\"It's not about me, I'm not in this story. You can write whatever you want, I know what we're doing with the club.\n\"We explained at the beginning of the season what this club needed, not my choice, the board's choice. The board asked me if I wanted to step into this very, very challenging project and I did and I do and I will be on the barricades for this club.\n\"It's good people start to see more and more, things a few months ago people maybe didn't believe.\n\"Qualification in this Europa League is one of these things. The club is on the right way. Is it fast enough to win everything? That's our ambition.\n\"We need to create this culture and more and more I see it. They know what it means to play for this club.\"", "url": "https://www.bbc.com/sport/articles/c74m1zw0xzvo"}