{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:47:16", "date_modify": "2025-05-21 03:47:16", "date_publish": "2025-04-07 17:17:39", "description": "Japanese winger Tatsuhiro Sakamoto agrees a new two-year contract with Coventry City.", "filename": "sport_football_articles_cwy7ddekxdzo_1747799236.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/479a/live/eec38910-13d1-11f0-8735-97934b501932.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cwy7ddekxdzo_1747799236.html", "title": "Tatsuhiro Sakamoto: Japan winger signs two-year Coventry contract", "title_page": "Tatsuhiro Sakamoto: Japan winger signs two-year Coventry contract - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Japanese winger Tatsuhiro Sakamoto has signed a new two-year contract with Coventry City.\nSakamoto, 28, who signed in July 2023 from KV Oostende when Mark Robins was still City boss, is now tied to the Sky Blues until the summer of 2027.\nHe has scored 11 goals in 72 games for City, three of which have come in his four months working under new boss Frank Lampard.\n\"I'm so happy to sign a new contract,\" he said. \"I am so happy and grateful.\n\"I was worried about a few things, because I have moved my family to the UK from Japan.\n\"It had been difficult because of my English, but the gaffer, coaches, my team-mates, the staff and the supporters have always helped helped me settle into this country and at this club. This is a reason why I wanted to stay.\"\nSakamoto became the first Asian player to sign for the Sky Blues when he arrived from Belgian side Oostende, after initially joining them on loan from Cerezo Osaka in his native Japan in January 2022.\nHe made his international debut in June 2021 in a World Cup qualifier against Tajikistan and has since won one further cap.\nLampard's City have slumped to seventh in the Championship after three defeats in their last four matches - but they are only a point off the play-off places with six games left.", "url": "https://www.bbc.com/sport/football/articles/cwy7ddekxdzo"}