{"authors": ["Laura Scott", "Frank Keogh", "www.facebook.com"], "date_download": "2025-05-21 06:25:49", "date_modify": "2025-05-21 06:25:49", "date_publish": "2025-03-31 11:48:51", "description": "Mr Incredible has been barred from running in Saturday's Grand National by the British Horseracing Authority.", "filename": "sport_horse-racing_articles_cvg7e2pe5q0o_1747808749.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6391/live/35ec8770-0e0e-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_horse-racing_articles_cvg7e2pe5q0o_1747808749.html", "title": "Grand National 2025: Mr Incredible barred from running in Aintree race by BHA", "title_page": "Grand National 2025: Mr Incredible barred from running in Aintree race by BHA - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Mr Incredible has been barred from running in Saturday's Grand National by the British Horseracing Authority (BHA).\nThe horse, trained in Scotland by Sandy Thomson, was an outsider for the 34-runner race at Aintree.\nMr Incredible was due to realise a long-term ambition of his owner, Winter Olympian James Manclark, to have a runner in the Grand National.\nBut he has not completed a race since March 2024 and has refused to race or pulled up in his last four runs.\n\"I am desperately frustrated, annoyed and sad,\" said Scottish trainer Thomson.\n\"James [Manclark] is pretty devastated, he has been trying to get this for three years and we found him a horse, and his health comes and goes. Our aim is now to get the horse to run next year.\"\nA BHA statement said: \"Each horse entered to take part in any race over the Grand National fences must undergo a review by the National Fence Review Panel, a highly experienced group including former jockeys, veterinarians, clerks of the course and stewards who carefully consider each horse's suitability to take part.\n\"The panel carefully assesses each horse's ability, fitness, recent form and overall readiness for its intended race and works closely with connections of any horse about which it has concerns before a decision on its participation is reached.\"\nIt is understood this is not an isolated case, with six horses not running in last year's race due to concerns raised by the panel.\nRacing's ruling body intervened in recent days, questioning whether Mr Incredible showed sufficient form during a recent race at Kelso, when he started but pulled up, even though connections had been pleased with the horse's performance.\nFor the past seven weeks the horse therapist Freddy Steele had been working with Mr Incredible.\nHe told BBC Sport the horse was showing \"progress\" at home and on the racecourse, and was responding well to the use of \"natural horsemanship\" techniques.\nMr Incredible's behaviour at Kelso was referred to the BHA by the stewards, who said he was \"unruly\" and appeared to pull himself up after the 14th fence.\nThe nine-year-old has won two of his 16 races and finished second four times.\nBut he has been pulled up in three of his past four contests and refused to race on the other occasion.\nDespite his unpredictable behaviour, Mr Incredible was runner-up in the Midlands Grand National last year when based with Irish champion trainer Willie Mullins.\nHe was considered one of the leading contenders for the 2024 National and was sent off at odds of 10-1 but dwelt at the start and unseated rider Brian Hayes at The Chair.\nMr Incredible had also unseated Hayes in the race 12 months earlier at the 24th fence after his saddle slipped.\n\"It was 100% the BHA's decision. We appealed it. Their concern was that he would disrupt the start,\" said Thomson.\n\"My defence was that he has never disrupted any start. Having got him started at Kelso I saw no reason why he wouldn't start in the Grand National, and having more horses around him would have helped.\n\"The other thing they said was about his recent form, but their criteria said they would take into account the last six runs and that included second in the Midlands National. It was a totally unsatisfactory situation.\"\nThe horse switched stables to join Thomson in December.\nOwner Manclark, 85, competed for Great Britain in the luge at the 1968 Winter Olympics in Grenoble, France.", "url": "https://www.bbc.com/sport/horse-racing/articles/cvg7e2pe5q0o"}