{"authors": ["Timothy Abraham", "www.facebook.com"], "date_download": "2025-05-21 03:44:42", "date_modify": "2025-05-21 03:44:42", "date_publish": "2025-04-06 15:35:51", "description": "England's Mimi Rhodes keeps her composure to win the Joburg Ladies Open in South Africa by one stroke for her second consecutive Ladies European Tour title.", "filename": "sport_golf_articles_c4grx481lwdo_1747799082.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d168/live/cb3a0c10-12f2-11f0-8bc5-d317b6dd5c85.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_golf_articles_c4grx481lwdo_1747799082.html", "title": "Joburg Open: England's Mimi Rhodes wins second Ladies European Tour title", "title_page": "Joburg Open: England's Mimi Rhodes wins second Ladies European Tour title - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England's Mimi Rhodes kept her composure as she won the Joburg Ladies Open in South Africa by one stroke for her second consecutive Ladies European Tour title.\nThe 23-year-old had started the day with a three-shot cushion and made three birdies as she carded a two-under round of 71 to finish top of the leaderboard at 14 under.\nSouth Africa's Casandra Alexander made a final-round 69 as she took Rhodes all the way to the final hole of the LET event.\n\"The nerves were really getting to me in the last couple of holes. We both hit birdies on 17 and walking down 18, I wanted to make sure I just didn't think ahead,\" Rhodes told the LET website, external.\n\"I just kept my focus out there and the play just went my way so really happy. Casandra did really well and kept the pressure on.\"\nRhodes' victory at the Modderfontein Golf Club in Johannesburg was the LET rookie's second consecutive title after victory in the Women's NSW Open in Australia last month.\n\"It's amazing to win in another country and for it to be my second in a row,\" Rhodes added.\n\"It's given me a huge amount of confidence for the rest of the season and my pro career.\n\"It's honestly a dream come true - and to be playing so well so early in my career, I'm lost for words. It's just amazing and I can't wait for the rest of the season.\"", "url": "https://www.bbc.com/sport/golf/articles/c4grx481lwdo"}