{"authors": ["Ffion Wynne", "www.facebook.com"], "date_download": "2025-05-21 04:12:48", "date_modify": "2025-05-21 04:12:48", "date_publish": "2025-02-01 13:02:30", "description": "BBC Test Match Special's Alex Hartley says that something has to change in England's camp, but also believes Heather Knight should stay as captain.", "filename": "sport_cricket_articles_crr0n0d70gdo_1747800768.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f88e/live/93534fe0-e09e-11ef-a319-fb4e7360c4ec.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_crr0n0d70gdo_1747800768.html", "title": "Women's Ashes 2025: Heather Knight is right to stay as captain, says Alex Hartley", "title_page": "Women's Ashes 2025: Heather Knight is right to stay as captain, says Alex Hartley - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Heather Knight is still the right person to lead England despite a 16-0 Ashes drubbing, says World Cup winner Alex Hartley.\nKnight and head coach Jon Lewis, 49, have both been under heavy pressure throughout England's miserable Women's Ashes campaign, which ended with an innings defeat in the one-off Test.\nAustralia won every match of the multi-format series - the first time that has been achieved - as England were completely outplayed in all areas.\nThere is mounting pressure on England's leadership, particularly head coach Lewis, as the Ashes humiliation follows a disappointing T20 World Cup campaign where they exited at the group stage, but Hartley reaffirmed her support of Knight.\n\"I don't know what the future holds for Jon Lewis but something has to change - whether that is captain, coach, leadership, management,\" Hartley said on the BBC Test Match Special podcast.\n\"But I genuinely believe Heather Knight is capable of taking this team forward.\n\"Heather will go home and reflect if her being captain is right for this team, but you can't make those decisions when you've stepped off the field after a Test match and you've lost a series 16-0.\n\"There will be a big part of her which says she doesn't want to do this any more but she might have a couple of weeks at home and weigh up whether she is the right person.\"\nKnight, 34, has been England captain since 2017 and has led them out 199 times in all formats.\nThe messaging from both Knight and Lewis, particularly at the beginning of the series, has come under scrutiny in Australia as the captain repeatedly told the media that England were \"pretty close\" to beating their opponents. Lewis' comments regarding Australia's climate benefits were also derided.\nThe humiliation in Australia is likely to see a review into the state of England's side and Hartley, who played for the team from 2016 to 2019, added that honest reflection is the only way to put things right.\n\"You can't get booted out of World Cups before the semi-final and lose the Ashes 16-0,\" she said.\n\"If it was men's cricket, you'd have to talk about change, so if it's women's cricket, you have to do the same.\n\"This tour might have been a wake-up call for England, seeing the differences between the two sides, but all of the bigwigs at the ECB need to get together and honestly reflect where this team is at.\"", "url": "https://www.bbc.com/sport/cricket/articles/crr0n0d70gdo"}