{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:35:08", "date_modify": "2025-05-20 13:35:08", "date_publish": "2023-08-01 17:51:39", "description": "Sheffield United 'reluctantly accept' a reported £20m offer from Marseille for Senegal striker Iliman Ndiaye.", "filename": "sport_football_66377243_1747748108.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3CDC/production/_130608551_gettyimages-1545887436.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66377243_1747748108.html", "title": "Iliman Ndiaye: Sheffield United 'reluctantly accept' Marseille's offer for Senegal striker", "title_page": "Iliman Ndiaye: Sheffield United 'reluctantly accept' Marseille's offer for Senegal striker - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Sheffield United have \"reluctantly accepted\" a reported £20m offer from Marseille for striker Iliman Ndiaye.\nThe Blades had offered a new contract to the 23-year-old, but he has instead opted to join the Ligue 1 club.\n\"Obviously, we wanted to keep Iliman,\" said Sheffield United chief Stephen Bettis.\nSenegal's Ndiaye was instrumental in the Blades promotion last season, scoring 14 goals and registering 11 assists in 46 Championship games.\nSheffield United were keen to keep hold of Ndiaye and confident of agreeing a new deal.\nBut he changed his mind deep into negotiations, with Blades manager Paul Heckingbottom adding the club had little choice but to sell with fewer than 12 months remaining on Ndiaye's contract.\n\"I wish Iliman well, my time here has been entwined with Iliman's,\" he added. \"We could've not sold him and run the risk of him leaving on a free transfer next season.\n\"Unfortunately for us and me, my job's to try and, while developing players, get the most competitive team on the pitch and in this instance it doesn't go hand in hand.\"\nNdiaye played for Marseille at youth level which was a big factor in his decision to move, according to Heckingbottom.\n\"It's his boyhood club, his dream club,\" said the Blades boss. \"Hopefully he goes on and has the time of his life similar to what Billy [Sharp] did when he came back to Sheffield United.\n\"That's the battle we were up against. That's the problem. Iliman turned down vast amounts of money last January to stay with us and help us get promoted so it's not about the money.\"\nNdiaye joined Boreham Wood in 2016 before signing for Sheffield United three years later, where he progressed through the club's development teams.\nHe made his debut in 2021-22, scoring twice against Peterborough on his debut and ending the season with seven goals in 35 appearances.\nHe has played 88 games in total for Sheffield United, scoring 22 goals.\nHeckingbottom says he has been told by owner Prince Abdullah the money raised from Ndiaye's sale will be reinvested in the squad.\n\"It's pointless trying to replace Iliman, so the thing what we have to do is replace him with players who do other things better than him,\" he said.\n\"I think it's important the money goes straight into the squad and we make sure that we get the most competitive team that we can.\"\nRob Staton, BBC Radio Sheffield\nSo the saga is over and not in the way anyone at Sheffield United hoped, or as of a couple of weeks ago, expected.\nDespite the pull of his boyhood club in France, Ndiaye was on the brink of signing a new contract at Bramall Lane. Then, something changed the situation. Now he has swapped the Premier League for Ligue 1 and Sheffield United have huge shoes to fill.It's also disappointing for fans and, less importantly, those of us who were looking forward to watching Ndiaye from the press box.\nHe is such a talent and waiting to see if he could have an impact in the best league in the world was exciting. He could've been the difference between two very different outcomes for United this year.\nNow, the challenge will be to find goal contributions from other players. As a talent, he is virtually irreplaceable. You'd have to spend tens of millions.Such is the modern game though. Even if the player initially wants to stay, so many people influence what actually happens.\nHis contract was running down. The club say they reluctantly accepted an offer from Marseille. Life goes on, but it's a bitter blow for the red side of Sheffield.", "url": "https://www.bbc.com/sport/football/66377243"}