{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:54:14", "date_modify": "2025-05-20 11:54:14", "date_publish": "2023-08-05 18:15:04", "description": "Newcastle: Anderson catches Howe's eye in pre-season", "filename": "sport_articles_cq52p8r5y05o_1747742054.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ddfb/live/61b81920-33bb-11ee-bd70-8d350626674e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cq52p8r5y05o_1747742054.html", "title": "Newcastle: Anderson catches Howe's eye in pre-season", "title_page": "Newcastle: Anderson catches Howe's eye in pre-season - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Harry De Cosemo, BBC Sport\nNewcastle boss Eddie Howe has admitted 20-year-old midfielder Elliot Anderson is in contention to start against Aston Villa after impressing in pre-season.\nAnderson played 90 minutes in the 2-0 victory over Fiorentina at St James’ Park on Saturday.\nHe also scored twice against Brighton in the Premier League Summer Series last week, and drew praise from his manager in his pre-match news conference on Friday.\nAfter the Fiorentina game, while making clear that nothing is set in stone, Howe again lauded the academy graduate.\n\"I think he has possibly had the best pre-season I’ve seen him have,\" Howe said. \"He is pushing - I want every player to believe they can play and deliver under pressure.\n\"He’s done that so far, but he’s got huge competition in the area he’s playing, whether that’s in midfield or out wide. I’ve got tough calls to make.\"\nHowe also said there is \"more to come\" from winger Anthony Gordon after he won Player of the Tournament as England won the under-21 European Championships.\n\"“Anthony had a good summer with England and has come back more confident,\" added Howe. \"I see a player with huge ability and I always think there is more to come from him so that is brilliant from my perspective.\n\"He’ll be going home kicking himself that he hasn’t scored two goals today.\"", "url": "https://www.bbc.com/sport/articles/cq52p8r5y05o"}