{"authors": ["Tom English", "www.facebook.com"], "date_download": "2025-04-26 07:28:24", "date_modify": "2025-04-26 07:28:24", "date_publish": "2025-02-27 18:58:03", "description": "The 'destructive imbalance' holding Scotland back", "filename": "sport_articles_cn4yyjpe4g9o_1745652504.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d282/live/78cc5f70-f53b-11ef-9e61-71ee71f26eb1.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cn4yyjpe4g9o_1745652504.html", "title": "The 'destructive imbalance' holding Scotland back", "title_page": "The 'destructive imbalance' holding Scotland back - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "At Twickenham on Saturday, Scotland went a full hour without scoring, from minute 19 to minute 79 when they almost snatched victory from the jaws of defeat.\nAgainst Ireland in round two it took them 41 minutes to register their first points while also going scoreless for 26 minutes later in the game. In the Six Nations opener against Italy they scored their third try in the 28th minute and didn't score again until the 61st.\nGoing without points for such long periods in Six Nations games is not new for Scotland, but it's part of why they're running to stand still - or maybe even sliding backwards depending on what happens in the final two weekends.\nLast season they didn't score after the 42nd minute against Wales (fine, they won, just about), didn't score for nearly 50 minutes against Italy (not fine, they lost) and went an hour without a score against Ireland in Dublin in a four-point match, which they also lost.\nIn 2023, they went vast chunks of time without scoring in defeats to France and Ireland. In 2022 they didn't score in the last 30 in a narrow loss in Cardiff, didn't score for 50 against France and didn't score for 33 and then 45 minutes against Ireland.\nApologies for the overload in numbers (more coming) but they're there to illustrate this is not new.\nThe subject of Scotland's attack came up on this week's BBC Scotland Rugby Podcast. In this championship, only France score the type of blistering tries that Scotland score, the one-phase wonders, the strikes from deep that have the stamp of genius upon them.\nScotland got three more of them at Twickenham, not that they provided any solace in the aftermath. The debate that should be had now centres around Scotland's one-track mind for the tryline and how they need to change their thinking.\nIt's in their DNA to turn down opportunities to kick for goal - drop-goals and penalties. They are all-in on attack. It's what makes them thrilling and deeply frustrating.\nIn 10 entries to England's 22 on Saturday they came away with zero points. Rugby is a game of psychology and pressure as much as anything else. Every repelled Scotland attack gave England belief.\nIt's past time that Scotland wisened up to their reality and brought an element of pragmatism and scoreboard pressure to their game.\nIn all those entries, what harm if they accepted once or twice that England's defence was strong, dropped into the pocket and took a drop goal, if they could? Get out of there with something instead of nothing.\nScotland, more than most, should do it because their breakdown has struggled (only France have conceded more turnovers) and their handling errors are the highest in the championship.\nA bit of nous is required, some leadership, a voice to say, 'You know what, we're 10-7 ahead (as they were against England), this attack is petering out, we might lose the ball, so let's try a drop goal to make it 13-7 and 16-7 and put the pressure on them'.\nIt's easy to look aghast at the statistics from Twickenham and wonder how Scotland contrived to lose that game. Three tries to one in the visitors' favour was just the start of it.\nMore possession and territory than England, nearly seven more attacking minutes, more than double the number of ball carries, more than three times the number of defenders beaten, more than four times the number of linebreaks.\nThese are stats to make a Scot weep, but they're a familiar story. There was nothing unusual about them at all.\nIn the loss to Ireland, Scotland had 57% possession, they had 20.3 attacking minutes to Ireland's 15.2, they had more carries, more metres gained, more defenders beaten.\nIreland had to make more tackles, missed more tackles, conceded more penalties and lost four lineouts to Scotland's one. And yet they won easily because they were more powerful, more canny and more ruthless.\nIn last season's controversial four-point loss to France at Murrayfield, Scotland were ahead on nearly all of the stats - 21.9 attacking minutes versus 17.9 for the away winners.\nThe defeat to Italy in Rome showed similar trends. Scotland were ahead in loads of metrics. Italy had 17 attacking minutes, Scotland had 25.\nWe could go back to previous seasons and find Six Nations-wrecking losses that told the same story. Nobody wants Scotland to remove the ambition from their game. With this backline, you couldn't even if you tried. But there's an imbalance in the way they score and it's destructive.\nInstead of a default set of going for touch from kickable penalty range, there are times when going for the posts is the sensible play.\nWith six minutes to go at Twickenham, Scotland had a penalty from very makeable range, even though Russell was off form with the placed ball. They went for touch, lost the lineout and exited with nothing.\nThree points then would have made it 16-13. Given the outrageous skill-set in this Scotland backline, they'd have fancied their chances to score a winning try from that position. Wise after the event? Not really. They scored a late try to win at Twickenham two years ago.\nAnd, of course, they scored late again on Saturday, but it wasn't enough this time, not when the conversion (from the incorrect spot, thanks to the referee) flew wide.\nThey wouldn't have needed it had some pragmatism entered their thinking in that 74th minute and in many of the attacking minutes that went before it.", "url": "https://www.bbc.co.uk/sport/articles/cn4yyjpe4g9o"}