{"authors": ["Simon Stone", "Phil McNulty", "www.facebook.com"], "date_download": "2025-05-21 05:47:58", "date_modify": "2025-05-21 05:47:58", "date_publish": "2025-01-31 18:19:03", "description": "Aston Villa are one of a number of clubs interested in Manchester United's out-of-favour striker Marcus Rashford.", "filename": "sport_football_articles_cx2pe137egqo_1747806478.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b5e2/live/887a25b0-dff6-11ef-a552-ef694361914c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cx2pe137egqo_1747806478.html", "title": "Marcus Rashford: Aston Villa interested in loan deal for Man Utd forward", "title_page": "Marcus Rashford: Aston Villa interested in loan deal for Man Utd forward - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Aston Villa are one of a number of clubs interested in Manchester United's out-of-favour striker Marcus Rashford.\nThe 27-year-old has not featured for United since being dropped by head coach Ruben Amorim for the Manchester derby on 12 December.\nAmorim said on Wednesday he felt his side would be better with Rashford in it, but the player had not met the standards he demands of his squad.\nRashford's representatives have met a number of leading European clubs over the past few weeks in an effort to gauge interest.\nWith the hours ticking down to Monday's 23:00 GMT deadline, numerous sources have confirmed Rashford's future is yet to be decided, amid significant interest from the Premier League and further afield.\nIt has not been entirely discounted that he could remain at Old Trafford, but a loan move is by far the most likely scenario at this stage.\nVilla are one of the clubs keen on the England international, although it is not known if there has been formal contact with United - or whether Rashford would want to make the move.\nVilla do have the carrot of being able to offer Champions League football in March following their top-eight finish in the league phase, although the same could also be said of Barcelona.\nThe La Liga giants are thought to be Rashford's preference, although there has been no clarity over their ability to strike a deal. A key element of a resolution with any club would be Rashford's wages - he is one of United's highest earners, with a salary in excess of £300,000 a week.\nAt a time of wider cost-cutting, senior United executives realise the importance of limiting the amount they will have to pay to subsidise any transfer, either on loan or permanent.", "url": "https://www.bbc.com/sport/football/articles/cx2pe137egqo"}