{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:50:36", "date_modify": "2025-05-21 07:50:36", "date_publish": "2025-02-08 00:00:00", "description": "Follow live text updates & radio commentary as Italy host Wales in the second weekend of the Six Nations.", "filename": "sport_rugby-union_live_c1m55llkmp9t_1747813836.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_live_c1m55llkmp9t_1747813836.html", "title": "Italy vs Wales LIVE: Six Nations rugby", "title_page": "Italy vs Wales LIVE: Six Nations rugby -  Result and reaction as Italy beat Wales in Rome - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Arrivederci from Rome\nFT: Italy 22-15 Wales\nWell that's it from a rain-soaked Rome.\nIt was hardly a battle fitting of the Colosseum, but one the hosts thoroughly deserved.\nAnge Capuozzo gave Italy the lead which they never looked like surrendering, despite a late Welsh rally.\nItaly head off into the night celebrating a first home win over Wales in 18 years, while Wales are left to digest a 14th successive Test defeat and an all-time lowest world ranking of 12th.\nNo doubt Warren Gatland is going to face more tough questions again this week.\nElsewhere, England against France gets under way very shortly - which you can follow here.\nEnjoy the rest of your weekend!\n'I can understand people's frustration' - Gatland\nFT: Italy 22-15 Wales\nWales head coach Warren Gatland told S4C: \"I know how hard we are working.\n\"I can understand people's frustration and we are frustrated and disappointed as well because we created opportunities but we have made mistakes and the penalty count was disappointing.\n\"As a coaching team and players they are not hard fixes but we need to make sure we focus in those key moments.\"\nPost\nFT: Italy 22-15 Wales\nJames Hook\nFormer Wales fly-half on BBC Radio Wales\nWales looked like a poorly coached team. We went into the game to kick but other than that there was no deception outside.\nWhen we did have the ball we did not get over the gain line. We looked lost and players looking around for others to do things and nothing was happening.\nThe scoreline flattered Wales and Italy were completely dominant.\nPost\nFT: Italy 22-15 Wales\nIan Gough\nFormer Wales international on BBC Radio Wales\nWales did not get it together at all. We were expecting a reaction but there was not one.\nIt is hard to see where they are going to go from here.\nWe have not shown anything and have gone backwards from last year's Six Nations.\n'Nothing is off the table' - Biggar\nFT: Italy 22-15 Wales\nFormer Wales fly-half Dan Biggar on ITV: \"If you look at the games they have lost in the last 12 months, today was the poorest performance in that run.\n\"It is hard to say because there are a lot of good people there but it is just not working. Whatever is going on Monday to Friday is not being transferred to the pitch on a Saturday.\n\"Wales have Ireland coming to Cardiff in two weeks time, they travel to Scotland and welcome England.\n\"This team looks one that is shot of belief and confidence. We keep getting asked the same questions but what are the answers. I am not quite sure. The curve has been downward.\"\nOn Warren Gatland's future, Biggar added: \"That is for people on a higher pay grade than me to decide. I don't think anything is off the table at the moment, it can't be. It can't carry on.\n\"It is such a shame because there are so many good people there who have had success previously but clearly what is happening there in the week is not working.\"", "url": "https://www.bbc.com/sport/rugby-union/live/c1m55llkmp9t"}