{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:13:31", "date_modify": "2025-04-26 04:13:31", "date_publish": "2025-03-04 11:38:54", "description": "Leicestershire re-sign Somerset all-rounder Ben Green on loan for the first seven matches of the 2025 County Championship.", "filename": "sport_cricket_articles_cn0jqjye9yeo_1745640811.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6e91/live/387f3b00-f8eb-11ef-8db4-815a70ccdd1d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_cricket_articles_cn0jqjye9yeo_1745640811.html", "title": "Ben Green: Leicestershire re-sign Somerset all-rounder in seven-game deal", "title_page": "Ben Green: Leicestershire re-sign Somerset all-rounder in seven-game deal - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Leicestershire have re-signed Somerset all-rounder Ben Green on loan for the first seven matches of the 2025 County Championship.\nThe 27-year-old made six Division Two appearances for the Foxes last summer, scoring 231 runs and taking 11 wickets.\nHe will be available for the season opener away to Glamorgan starting on 4 April, and can play up to and including the home game against Lancashire, starting on 23 May.\n\"I loved my spell with the club last season, so I'm excited to come back. The togetherness of the group was amazing, both players and coaches were incredibly welcoming and aligned in their vision,\" Green said.\n\"The first half of the Championship campaign can set the tone for the season, so my aim is to help build on the great cricket we played last year and contribute to more wins.\"\nGreen played for Somerset in the T20 Blast final last September but only scored six and failed to take a wicket as neighbours Gloucestershire lifted the trophy.\n\"It's absolutely vital that we explore ways of continuing to support our player's development when first XI opportunities are limited in a particular format. The loan system provides this and is mutually beneficial to all parties,\" said Somerset director of cricket Andy Hurry.\n\"We envisage Ben benefitting from time out in the middle during this loan spell in the early period of the season, and we look forward to welcoming him back ahead of our Vitality Blast campaign.\"", "url": "https://www.bbc.co.uk/sport/cricket/articles/cn0jqjye9yeo"}