{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:10:18", "date_modify": "2025-05-21 04:10:18", "date_publish": "2024-12-29 00:00:00", "description": "Myles Peart-Harris' stoppage-time winner sees Swansea City claim a dramatic victory over 10-man Luton Town.", "filename": "sport_football_live_cgj6wpx20g1t_1747800618.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cgj6wpx20g1t_1747800618.html", "title": "Swansea City 2-1 Luton Town: Myles Peart-Harris scores stoppage-time against 10-man Hatters", "title_page": "Swansea City 2-1 Luton Town: Myles Peart-Harris scores stoppage-time against 10-man Hatters - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Myles Peart-Harris' stoppage-time winner saw Swansea City claim a dramatic victory over 10-man Luton Town.\nLuton looked destined to secure just a fifth away point of the season despite teenager Joe Johnson seeing red for a second booking midway through the second half.\nBut on-loan Brentford midfielder Peart-Harris powered home a header to give Swansea a second home victory in three days.\nA ninth successive defeat on the road was tough on Luton, who were gifted an early lead when Carlton Morris volleyed home after an error from Swansea goalkeeper Lawrence Vigouroux.\nSwansea, who had hit the woodwork through Eom Ji-Sung, deservedly levelled before the break when a goalmouth scramble ended with Goncalo Franco tapping in from close range.\nLuton improved after the break until Johnson's dismissal handed Swansea late momentum, with the pressure eventually telling when Peart-Harris struck.\nVictory sees Swansea climb to ninth, four points adrift of the play-off places, while Luton are four points clear of the bottom three in 19th.\nThese two sides had drawn 1-1 at Luton just over three weeks ago, when Luton took an early lead thanks to a Swansea error.\nIt was the same story as Vigouroux's mishit pass went straight to Morris and the Luton skipper gobbled up his chance, taking one touch to control before guiding the ball into a vacant net from 15 yards.\nSwansea almost levelled when Thomas Kaminski spilled Matt Grimes' whipped cross but Eom could only prod a first-time effort against the post.\nLuke Williams' team kept asking questions, with Liam Cullen heading wide and Ronald's shot deflecting off target before the equaliser came.\nEom's corner was flicked on by Ben Cabango and, after Cullen's shot was blocked and Ronald's follow-up effort was parried by Kaminski, Franco was on hand to poke home his second goal in as many games.\nLuton asked more questions of Swansea after the break, with Mark McGuinness' effort deflecting wide before Marvelous Nakamba failed to capitalise on Cabango's loose touch in the area.\nSwansea head coach Luke Williams:\n\"We started the game in the correct way. We made an error and got punished for that, but I was really happy with the response to going behind.\n\"I think we deserved to be on level terms, no doubt, and the next big challenge for the group is when Luton go down to 10 men, to not rush and not try to score with every action.\n\"I think maybe foe the first few minutes we did that, but then we tried to play more calmly.\n\"We can all feel the anxiety because everyone wants us to score, they want us to get what we deserve. We coped with that in the correct way. A very mature performance and the lads got what they deserved in the end.\"\nLuton manager Rob Edwards:\n\"There have been games earlier on in this run we didn't deserve anything from, but the performances have been better recently away from home and we were the better team when the red card happened. We were in the ascendancy.\n\"But it was always going to be difficult with 10 men against Swansea who are the best team with the ball in the league. The lads gave everything and played well.\n\"He's got to be sure [with the red card]. We've gone in and spoken to him and the ref will stand by his decision.\n\"Joe is trying to get out of the way and I don't think there's any contact. I've looked at it back a few times. It's not Joe's fault, it's just an unfortunate moment.\"", "url": "https://www.bbc.com/sport/football/live/cgj6wpx20g1t"}