{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:46:36", "date_modify": "2025-05-21 07:46:36", "date_publish": "2025-03-28 08:00:22", "description": "Dungannon Swifts manager Rodney McAree says it would be \"a dream come true\" to lead his side to an Irish Cup final as they prepare to face Championship pacesetters Bangor at Seaview on Saturday.", "filename": "sport_articles_cz03kjndkvvo_1747813596.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/931b/live/fbca9050-0b24-11f0-88df-cbea984e02db.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cz03kjndkvvo_1747813596.html", "title": "Irish Cup: Reaching final would be 'a dream come true'", "title_page": "Irish Cup: Reaching final would be 'a dream come true' - Swifts boss McAree - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Dungannon Swifts manager Rodney McAree says managing his hometown club in an Irish Cup final would be \"a dream come true\".\nThe Stangmore Park club will face Championship leaders Bangor in the second of the semi-finals in this year's competition at Seaview on Saturday (17:30 GMT).\nMcAree was part of the side which went down to Linfield in a penalty shootout in the 2007 decider at Windsor Park and then guided his team to a League Cup success in 2018 during his first stint as Swifts boss.\n\"You always dreamt as a player about representing your club in the Irish Cup final which I was fortunate enough to do, even though we got beaten on penalty kicks that day,\" McAree told BBC Sport NI.\n\"Then when you take up the mantle of head coach, or any coaching role, you want to be involved in an Irish Cup final.\n\"It would be a dream come true if we were involved in it on the first Saturday in May but we know we have a lot of hard work to do to get there.\"\nMcAree's side sit fourth in the Irish Premiership table ahead of the upcoming five rounds of post-split fixtures and a cup final appearance and success would cap off what has been an exceptional season for the club so far.\n\"It would mean everything to me personally. Obviously I've grown up a mile from the ground. This is my club, this is where my heart is.\n\"It's a massive opportunity for the club to get to the final of a prestigious final like the Irish Cup and it's certainly one that we don't want to let pass us by.\"\nBangor were 3-1 victors over Premiership powerhouse Glentoran at the quarter-final stage earlier this month while Dungannon have claimed the scalps of fellow top flight outfits Coleraine and Carrick Rangers on their way to reaching the last four.\n\"Our mentality has to be right. It's going to be difficult, we're coming up against a Bangor side that are running away with the Championship,\" added McAree.\n\"We've had them watched on four occasions, I've watched them twice myself, so we feel as if we've done our homework.\n\"They have a lot of good players, a lot of threat. We saw what they did in the last round so we're well aware of the threats and the strengths that they have.\"", "url": "https://www.bbc.com/sport/articles/cz03kjndkvvo"}