{"authors": ["Jane Lewis", "www.facebook.com"], "date_download": "2025-04-26 07:29:54", "date_modify": "2025-04-26 07:29:54", "date_publish": "2025-02-27 18:08:51", "description": "'Manner of Motherwell win extremely well received'", "filename": "sport_articles_c3377vzvmdeo_1745652594.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4c3b/live/4c8daa90-f531-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_c3377vzvmdeo_1745652594.html", "title": "'Manner of Motherwell win extremely well received'", "title_page": "'Manner of Motherwell win extremely well received' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Michael Wimmer wants his Motherwell side to play with energy and desire. That was his message from day one.\nWhile we didn't see much of it in his first game in charge against Dundee United last weekend, it was a different story last night against United's city rivals.\nThe intensity, the press, the energy - it was there in bucketloads.\nIt wasn't just the passion from the Motherwell players that was on show. In his managerial home debut, Wimmer was fully invested, cutting an animated figure in his technical area.\nHe was extremely vocal, throwing his arms about with every kick of the ball, and the players seemed to respond positively to his spirited involvement.\nIt's still early days for Wimmer and even centre-back Dan Casey, on a high from scoring two brilliant goals against Dundee, said no one should be getting carried away… just yet.\nBut that win and performance was warmly welcomed by those inside Fir Park and supporters left the ground with a spring in their step.\nLittle wonder, as it ended a run of six league defeats. A win at any cost would have been welcomed, but it was the manner of the win that was extremely well received.\nAfter months of negativity around style of play and results, you could sense a real feeling of positivity around the club.\nWimmer told me pre-match he's still building a picture of his squad, but on last night's evidence he surely can't be far away from knowing his starting XI and most effective shape as Saturday's trip to face Rangers looms.", "url": "https://www.bbc.co.uk/sport/articles/c3377vzvmdeo"}