{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:09:12", "date_modify": "2025-05-21 06:09:12", "date_publish": "2025-01-14 10:32:37", "description": "Brentford vs Manchester City predictions: Chris Sutton on Premier League game", "filename": "sport_football_articles_c627j0d8997o_1747807752.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/561d/live/fbee38e0-d1d4-11ef-87df-d575b9a434a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c627j0d8997o_1747807752.html", "title": "Brentford vs Manchester City predictions: Chris Sutton on Premier League game", "title_page": "Brentford vs Manchester City predictions: Chris Sutton on Premier League game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "I was hoping Brentford would have a real go at the FA Cup this season, but they made a load of changes for their tie with Plymouth, and they ended up on the wrong end of the biggest shock of round three.\nI can understand Bees' manager Thomas Frank's point of view, because he can argue his side have a busy schedule with some tough fixtures coming up - after this game, they host Liverpool on Saturday and I am there for Radio 5 Live.\nHe decided to give some fringe players an opportunity to get a game and impress him, against a struggling Championship team who had not won an away game all season, but it did not work out.\nThe Bees started the season with such a strong home record but Saturday's defeat means they have lost their past three matches there.\nManchester City, meanwhile, are starting to build some better form again, and their big win over Salford City at the weekend was their third in a row.\nI was a bit surprised about the news Kyle Walker could be leaving City. He has not had the best of seasons, but he has probably been the best right-back the Premier League has seen.\nWalker has been a huge part of what City have achieved under Pep Guardiola and I would be sad to see him leave the Premier League if he does go abroad.\nIn terms of this game, I feel like City are on a bit of a roll. I've already done something which I promised I wouldn't do in Fantasy Football, which is put Erling Haaland back in my team, and captained him.\nIt was a masterstroke from myself, and my assistant, because he scored twice in their last Premier League game against West Ham.\nI am expecting Haaland to carry on his goalscoring form here, and I feel like City are going to edge it. I don't think it will be easy, though, and I cannot see them keeping a clean sheet.\nSutton's prediction: 1-2", "url": "https://www.bbc.com/sport/football/articles/c627j0d8997o"}