{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:51:43", "date_modify": "2025-04-26 06:51:43", "date_publish": "2025-02-28 17:37:55", "description": "Man Utd news: Harry Maguire on Rubem Amorim's 'brilliant' tactics", "filename": "sport_football_articles_cp8yvlle86jo_1745650303.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d87f/live/22cdefa0-f5fc-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cp8yvlle86jo_1745650303.html", "title": "Man Utd news: Harry Maguire on Rubem Amorim's 'brilliant' tactics", "title_page": "Man Utd news: Harry Maguire on Rubem Amorim's 'brilliant' tactics - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Manchester United's players \"believe\" in \"brilliant\" manager Ruben Amorim's tactics despite a difficult run of form, says defender and former captain Harry Maguire.\nThe Red Devils recorded their first win in four Premier league games with a hard-fought victory over Ipswich on Wednesday, with the post-match celebrations emphasising how important the result was for United.\n\"This group of players believes in Ruben's tactics,\" Maguire said. \"We know we probably need additions. We cant hide away from that. If we want to get back to winning titles, there will need to be additions to help the squad.\n\"Tactics is obviously a big thing because of the system we changed and play but if you analyse our games there are times when we are a back three, times when we are a back four and times when we are a back five. That's what happens in football generally these days.\n\"We have great belief in Ruben, his tactics and all his coaches.\"\nAmorim arrived in November after United paid £11m to recruit the 39-year-old from Portuguese club Sporting. However, despite impressive results away at Manchester City, Arsenal and Liverpool, the club have slipped from 13th in the Premier League when he arrived to 15th now.\n\"When he first came in, his ideas and energy was really refreshing,\" Maguire said. \"We just haven't picked up the results we needed to. The belief is still there and we know we can improve as players.\n\"He has been brilliant. Personally he has given me great belief and confidence to express myself and to go out and play my best football.\n\"With the right structure and players in his team, there is no doubt he has proved at Sporting that his team wins trophies and football matches. It is down to the players to buy into it and make sure you are part of it for the long term.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cp8yvlle86jo"}