{"authors": ["Matthew Henry", "www.facebook.com"], "date_download": "2025-05-20 14:32:54", "date_modify": "2025-05-20 14:32:54", "date_publish": "2023-07-28 19:10:05", "description": "Ex-England captain Michael Vaughan says some of Australia's batting on day two of the final Ashes Test was the worst he had ever seen from the tourists.", "filename": "sport_cricket_66337178_1747751574.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/169B/production/_130578750_gettyimages-1574503227.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66337178_1747751574.html", "title": "Ashes 2023: Australia's slow batting on day two \"the worst I've seen\" by tourists - Michael Vaughan", "title_page": "Ashes 2023: Australia's slow batting on day two \"the worst I've seen\" by tourists - Michael Vaughan - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ex-England captain Michael Vaughan said some of Australia's batting on day two of the final Ashes Test was the worst he had ever seen from the tourists.\nAustralia were dismissed for 295 at The Oval to take a lead of 12 - somewhat of a recovery from 185-7.\nThey resumed on 61-1 but scored just 54 runs in the morning session, leaving them exposed to a collapse after lunch.\n\"They are taking home the urn, but I've never seen Australia play with so much fear,\" Vaughan told Test Match Special.\n\"They are usually so aggressive and try to take the game forward.\"\nAustralia were dominated by England across the first three days of the fourth Test at Old Trafford but rain denied the hosts a chance to push for victory.\nThe result was a drawn Test, meaning Australia - 2-1 leaders in the series - are guaranteed to retain the Ashes, with England needing to win this week to prevent the tourists winning a series in the UK for the first time since 2001.\nFrom a position of strength overnight, Marnus Labuschagne dug in early on day two - scoring just seven runs from 59 balls before being caught at slip for nine from 82.\nOpener Usman Khawaja scored 47 runs from 157 balls - the pair combining for a stand of 42 runs in 26 overs.\n\"They have just sat in to bat a long period of time without remembering you have to put a bit of pressure on the bowlers,\" Vaughan said.\n\"This morning I thought it was the worst I've ever seen Australia bat in my time watching them. They never play like that.\"", "url": "https://www.bbc.com/sport/cricket/66337178"}