{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:32:33", "date_modify": "2025-05-20 14:32:33", "date_publish": "2023-07-28 21:38:30", "description": "Valencia beat Manchester United to clinch the Elite Section title at SuperCup NI while Northern Ireland and Co Londonderry also triumph.", "filename": "sport_football_66343917_1747751553.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/17955/production/_130579569_pablolopez.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66343917_1747751553.html", "title": "SuperCup NI: Valencia and County Londonderry among SuperCup NI winners", "title_page": "SuperCup NI: Valencia and County Londonderry among SuperCup NI winners - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Valencia beat Manchester United to clinch the Elite Section title at SuperCup NI while Northern Ireland and Co Londonderry also triumphed.\nThe Spaniards defeated United 4-2 at the Ballymena Showgrounds while Liverpool lost 3-0 to Hertha Berlin in the other game.\nNorthern Ireland won the Girls Premier Section title with a 4-0 victory over Surf Select in the final.\nCo Londonderry defeated Tigres UANL 1-0 in the Boys Premier Section decider.\nJacob Dallas scored the only goals as Marty Smith's team were crowned SuperCup NI champions for the first time.\nBernie Ferreira hit a brilliant hat-trick for Northern Ireland in their win over American side Surf Select in Ballyclare with Anastasija Stanyte also on target.\nValencia topped the Elite Section table with Man United bottom after the six-goal encounter on Friday night.\nGoals from Pablo Lopez and Otorbi put Valencia 2-0 in front before Louis Jackson pulled one back.\nOriol Marty and Otorbi struck for Valencia with James Scanlon grabbing a consolation goal for a United side which missed a penalty and had Finley McAllister sent off.\nThere was penalty heartbreak for Linfield in the Girls Junior Section final as they lost 6-5 to Surf Select in the shootout following a 2-2 draw.\nWest Ham repeated their tournament wins in 1996 and 1997 with a 6-0 victory over Co Antrim in the Boys Junior Section final.", "url": "https://www.bbc.com/sport/football/66343917"}