{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:02:14", "date_modify": "2025-05-21 05:02:14", "date_publish": "2025-01-14 22:24:24", "description": "Glentoran and Cliftonville book their places in the BetMcLean Cup final as late goals in both games secure extra-time victories over Crusaders and Larne respectively.", "filename": "sport_articles_cg45ld7440wo_1747803734.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cf5f/live/80bc4f70-d2d0-11ef-a95c-5b151e1edf12.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cg45ld7440wo_1747803734.html", "title": "BetMcLean Cup: Glens and Reds net late in extra-time to win semi-finals", "title_page": "BetMcLean Cup: Glens and Reds net late in extra-time to win semi-finals - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Glentoran and Cliftonville both scored dramatic late goals in extra-time in their respective semi-finals to book their place in the BetMcLean Cup decider on 9 March.\nKodi Lyons-Foster netted for the Glens at the Oval in the 115th minute and Jay Donnelly was on target five minutes later to ensure their side's passage after their last-four tie against Crusaders had ended 2-2 after 90 minutes.\nA double from Jordan Jenkins, the first a penalty, had the hosts 2-0 to the good at half-time but Stewart Nixon and Kieran Offord scored in the second half to draw the Crues level, before Declan Devine's side prevailed on a 4-2 scoreline after the additional half hour.\nDestiny Ojo was the matchwinner for Cliftonville as his 117th-minute goal proved decisive in a 1-0 victory over Larne at Inver Park.\nNeither side could break the deadlock in normal time, with Larne being reduced to 10 men in the second half when defender Shaun Want was sent-off for a rash lunge on Rory Hale.\nCliftonville last won the BetMcLean Cup in 2022 while the Glens have secured a shot at lifting the trophy for the first time since 2010 by making it 10 games unbeaten in all competitions by seeing off the Crues.\nThe east Belfast club have also advanced to the County Antrim Shield final in which they will play Larne on 21 January.\nJenkins drew first blood at the Oval in the 12th minute, coolly sending Jonny Tuffey the wrong way from the spot after Dylan Connolly was upended in the box by Jacob Blaney.\nThe forward struck again before the break, pouncing on a gift from the Crusaders' defence, the former Glenavon man cutting inside and unleashing a sumptuous long-range effort that left Tuffey grasping at thin air.\nNixon breathed life into the visitors' challenge just shy of the hour, showing quick thinking to lob James Singleton before calmly slotting home.\nThe comeback was complete when Offord muscled his way through the Glentoran rearguard to level the scores with 15 minutes left on the clock.\nDeep into extra-time, Lyons-Foster emerged as the unlikely hero for the east Belfast outfit. The defender rose highest to meet Daniel Amos' inviting free-kick, nodding home to send the home fans into raptures.\nIn a dramatic finale, Jay Donnelly put the seal on a remarkable semi-final, racing clear to tap into an empty net after Tuffey was caught upfield from a last-gasp corner.", "url": "https://www.bbc.com/sport/articles/cg45ld7440wo"}