{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:55:39", "date_modify": "2025-04-26 03:55:39", "date_publish": "2025-03-04 15:52:13", "description": "'No hiding place' for struggling Rangers - Colin Hendry", "filename": "sport_articles_cy05wj9x1jxo_1745639739.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/babb/live/10e492f0-f906-11ef-b5c1-27f306935cb2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cy05wj9x1jxo_1745639739.html", "title": "'No hiding place' for struggling Rangers", "title_page": "'No hiding place' for struggling Rangers - Colin Hendry - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Colin Hendry has echoed the sentiments of fellow former Rangers player Steven Naismith by stressing \"there is no hiding place\" for the current team.\nNaismith fears there are too many in Barry Ferguson's squad \"scared\" of the pressure and responsibility of representing the club, while Hendry says \"psychologically, you've got to be on top form\".\nThe former Scotland captain spent a season and a half at Ibrox from 1998, when they were the dominant team in the country, a stark contrast to the current climate.\nHendry admits the mental test of being \"at it all the time\" while playing for a club whose supporters demand success regardless of circumstances can be more challenging than the physical demands of performing.\n\"There is no hiding place,\" said Hendry. \"That's part of being part of Glasgow Rangers. That's how it works.\n\"When I came back from England and signed for Rangers, I used to try and describe that when I was playing the Premier League, week in, week out, I was in a boxing match. So physically, when you come out of that game, after your 90 minutes, you knew you'd been in a game.\n\"But when you come up to Rangers, and with the exception of 10 or 20% of the games that you play, you're in charge.\n\"Even away from home, you've got the majority of ball possession and psychologically you've got to be at it all the time.\n\"That was probably the main difference I found. Psychologically, you've got to be absolutely on top form. Physically, it wasn't as draining, it wasn't as demanding, but psychologically, you've got to be at it all the time because there's only space for one winner.\n\"For a team that's been beaten three times at Ibrox, then the pressure, of course, psychologically, builds up on each individual player because they'll be thinking the next game, the next game, the next game, and they've got to win the next game. And that's how it is.\"", "url": "https://www.bbc.co.uk/sport/articles/cy05wj9x1jxo"}