{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:22:49", "date_modify": "2025-04-26 06:22:49", "date_publish": "2025-03-04 00:00:00", "description": "Reading's League One play-off hopes suffer a setback as they are held to an uninspiring goalless draw at home to relegation-threatened Exeter.", "filename": "sport_football_live_cewkk7gqgrqt_1745648569.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/377c/live/468dea00-f5eb-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_cewkk7gqgrqt_1745648569.html", "title": "Reading 0-0 Exeter City", "title_page": "Reading 0-0 Exeter City - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Reading's League One play-off hopes suffered a setback as they were held to an uninspiring goalless draw at home to relegation-threatened Exeter.\nNeither side impressed in a scrappy and goalless first half but it was Exeter who provided more of a goal threat after the break.\nReading went into the game on a six-match unbeaten run, winning 2-1 at Wigan on Saturday to leave them just three points off the top six.\nExeter had sat three points above the relegation zone, having registered only one victory in their past 11 league outings.\nReading dominated the early stages but had little to show for their enterprise until Billy Bodin's angled drive forced a good save from City goalkeeper Joe Whitworth.\nBodin later saw a goal-bound volley, from Charlie Savage's superb cross to the far post, deflected wide.\nThe visitors offered little going forward before the break but were vastly improved in the second half, going close on a number of occasions.\nRyan Trevitt squandered two promising openings and a teasing Caleb Watts centre saw the attempted clearance of Royals defender Amadou Mbengue cannon against the home crossbar and away to safety.\nReading responded belatedly and almost snatched victory but for Whitworth's fine save to keep out a late Lewis Wing piledriver from long range.", "url": "https://www.bbc.co.uk/sport/football/live/cewkk7gqgrqt"}