{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:28:44", "date_modify": "2025-05-21 07:28:44", "date_publish": "2025-01-13 15:05:54", "description": "West Brom’s search for a new boss continues after efforts to appoint former Basel and Young Boys coach Raphael Wicky collapse.", "filename": "sport_football_articles_c4gwxzeqevwo_1747812524.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a429/live/e3a83da0-d1be-11ef-9fd6-0be88a764111.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c4gwxzeqevwo_1747812524.html", "title": "West Bromwich Albion: Raphael Wicky out of contention for head coach job", "title_page": "West Bromwich Albion: Raphael Wicky out of contention for head coach job - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "West Bromwich Albion‘s search for a new boss will continue after efforts to appoint former Basel and Young Boys coach Raphael Wicky collapsed.\nThe 47-year-old was the preferred candidate to succeed Carlos Corberan, who left The Hawthorns on Christmas Eve to take charge of his home town club Valencia in Spain.\nIt is understood that complications over assembling the coaching staff requested by Wicky brought an end to negotiations.\nThe former Switzerland international emerged as the leading contender for the West Brom vacancy after former Manchester United assistant manager Rene Hake was initially linked with the post.\nThe Baggies, who were thrashed 5-1 by Premier League side Bournemouth in the FA Cup third round on Saturday, have maintained their promotion credentials during their search for a new head coach.\nThey are unbeaten in three league games and are in the play-off spots in sixth place.\nSteve Hermon, BBC Radio WM\nOn Saturday morning, the understanding was that while the t's hadn't been crossed and the lower case i's hadn't been dotted, negotiations were at an advanced staged and the expectation was that Raphael Wicky would be appointed as the new Albion head coach in time for this weekend's Championship game at home to Stoke City.\nIt's a huge blow for the Baggies because the Swiss had been their preferred candidate following interviews with a shortlist of possibles.\nThe sticking point appears to have been over his backroom staff. Wicky wanted to bring two people with him and I understand the Baggies hierarchy were fully behind that but issues over the pair re-locating to the UK have caused talks to break down.\nThe head coach search has been led by Andrew Nestor and it was always intimated that speed was never the priority. However, approaching three weeks since Carlos Corberan's departure, it may now need to be.\nInterim head coach Chris Brunt, along with Damia Abella and Boaz Myhill have overseen five matches so far and aside from the heavy FA Cup defeat at Bournemouth this past weekend, they have done well in the circumstances.\nIt remains to be seen if this unexpected news re-opens the door for ex-Manchester United assistant Rene Hake, someone else who hasn't previously been interviewed or if Brunt and co will be getting the call to step back into the dugout one more time at The Hawthorns.", "url": "https://www.bbc.com/sport/football/articles/c4gwxzeqevwo"}