{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 08:01:15", "date_modify": "2025-05-21 08:01:15", "date_publish": "2025-05-19 16:33:21", "description": "Michelle Barraclough from Sunderland Til I Die talks about the upcoming 2025 Championship play-off final against Sheffield United.", "filename": "sport_articles_c39xj2y78npo_1747814475.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4610/live/db2dccf0-34cc-11f0-8947-7d6241f9fce9.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c39xj2y78npo_1747814475.html", "title": "Sunderland Til I Die fan dreams of saying 'It's finally us'", "title_page": "Sunderland Til I Die fan dreams of saying 'It's finally us' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "In one of the most memorable moments from Netflix show Sunderland Til I Die, fan Michelle Barraclough cried, \"Why is it never us celebrating? Why is it never us?\" after the 2019 League One play-off final loss to Charlton.\nSix years later, the Championship play-off final awaits the Black Cats this weekend.\nMichelle told BBC Radio Newcastle it'll \"probably\" be the greatest day of her life if Sunderland win against Sheffield United.\n\"Although we won against Wycombe, that was obviously the [2022] League One play-off, this is to get back where we belong, in the Premier League.\"\n\"And let's not forget,\" she added, \"this is the richest game in football. The winner receives £220m I believe. Something like that. Of course the loser gets nothing. So it really is the biggest game in football. The richest game in football. So this is a different level again isn't it?\"\n\"It was brilliant seeing them win against Wycombe getting into the Championship again but that was only half way. We really need this one to get back in the Premier League.\"\nRegis Le Bris' side secured their place in the Championship play-off final through a dramatic last second of extra-time winner from Dan Ballard.\n\"It's an absolute rollercoaster being a Sunderland fan,\" Michelle added.\n\"The amount of ups and downs but every time something like Tuesday night happens, it's worth it all. There's no feeling like it. No feeling in the world than when your team's winning.\n\"It's absolutely brilliant. You can't believe the difference it makes in the whole city. It lifts the whole city. The amount of people who were smiling and if it had gone the other way it would have been the opposite.\"\nMichelle is feeling optimistic ahead of Saturday's trip to Wembley.\n\"It's one of those games where you've literally got 50% chance of winning,\" she said.\n\"I think form goes out the window to be honest. We've just lost five league games and then won two games in the play-off. So what can I say?\n\"We're through to Wembley. We've got as much chance as Sheffield United. As far as I'm concerned we're in with a good shout.\"", "url": "https://www.bbc.com/sport/articles/c39xj2y78npo"}