{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:38:00", "date_modify": "2025-05-21 03:38:00", "date_publish": "2025-01-23 21:26:06", "description": "Chris Eubank Jr and Conor Benn's highly anticipated fight will be on 26 April at Tottenham Hotspur Stadium.", "filename": "sport_boxing_articles_c1m5zr08zdko_1747798680.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f4ab/live/16ea9f20-d9ce-11ef-85e4-2f835a169dbb.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_boxing_articles_c1m5zr08zdko_1747798680.html", "title": "Eubank Jr v Benn: Chris Eubank Jr and Conor Benn to fight on 26 April at Tottenham Hotspur Stadium", "title_page": "Eubank Jr v Benn: Chris Eubank Jr and Conor Benn to fight on 26 April at Tottenham Hotspur Stadium - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Chris Eubank Jr and Conor Benn's highly anticipated fight will be on 26 April at Tottenham Hotspur Stadium, Saudi boxing organiser Turki Alalshikh has announced.\nEarlier this month Alalshikh, who has organised some of the most high-profile fights in recent years as chairman of Saudi Arabia's general entertainment authority, confirmed a deal had been struck between the fighters.\nEnglishmen Eubank and Benn are bitter rivals and were due to meet in October 2022, 29 years after their revered fathers Chris Eubank Sr and Nigel Benn fought for a second time.\nHowever, that bout was called off after Benn failed a voluntary drug test, sparking a two-year battle with anti-doping authorities, which culminated in his suspension being lifted last November.\nThirty-five-year-old Eubank will be favourite against 28-year-old Benn, who steps up from the welterweight limit of 10st 7lb (147lb) for the fight.\nAlalshikh also confirmed some of the bouts on the undercard, including British light-heavyweight rivals Anthony Yarde and Lyndon Arthur completing their trilogy.\nArthur won the first meeting in 2020 with Yarde gaining revenge in 2021.\nBournemouth's Chris Billam-Smith faces American Brandon Glanton in his first contest since losing his WBO cruiserweight world title in a unification fight against WBA champion Gilberto Ramirez.\nFormer WBO light-middleweight champion Liam Smith, who has not fought since losing to Eubank in September 2023, takes on Ireland's Aaron McKenna, while British cruiserweights Viddal Riley and Cheavon Clarke will square off.", "url": "https://www.bbc.com/sport/boxing/articles/c1m5zr08zdko"}