{"authors": ["Sarah Holt", "www.facebook.com"], "date_download": "2025-05-21 07:36:52", "date_modify": "2025-05-21 07:36:52", "date_publish": "2025-01-22 10:03:49", "description": "McLaren's Lando Norris tells a new series of a BBC podcast that he has \"got everything it takes\" to mount another F1 title challenge.", "filename": "sport_formula1_articles_cwyelyg0yrpo_1747813012.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a918/live/5c041800-d255-11ef-afca-fd8d41ed4ae1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_formula1_articles_cwyelyg0yrpo_1747813012.html", "title": "Lando Norris 'ready to bring the fight to every race' in 2025", "title_page": "Lando Norris 'ready to bring the fight to every race' in 2025 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Lando Norris says he is \"ready to bring the fight to everyone\" having \"learned a lot\" during his breakthrough season in 2024.\nMcLaren's Norris had his first four Formula 1 grand prix wins as he finished second to Max Verstappen in the drivers' championship.\nThe 25-year-old Briton says missing out on the title to Dutchman Verstappen hurt, but that he's ready to come back stronger in 2025.\n\"When that realisation kind of sets in of 'it's gone', it's a tough one,\" Norris told the BBC podcast F1: Back at Base.\n\"This is what I've done since I was a kid, this is all I want to do. So, as soon as that kind of candle is gone and it's over, it hurts.\"\nNorris' second place was his highest finish in the drivers' standings after he narrowed the gap to Verstappen in the final phase of the season.\nHe ignited his title challenge with his maiden F1 victory at May's Miami Grand Prix and signed off the season with eight pole positions in addition to his four wins.\nNorris got within 47 points with four races to go but Verstappen's victory in Brazil gave him the opportunity to secure the title at the following race in Las Vegas.\n\"It's been a year where, actually, I've been pretty proud of my performance. Proud of performing under the pressure that we've been under, delivering when I have,\" Norris said in the podcast.\n\"I've made my mistakes and, at the same time, I've learned a lot from those mistakes.\n\"So for us to go into next year, going 'we have what it takes, we have a car'... I believe I'm a good enough driver and I've got everything it takes.\n\"I'm excited to go into 2025 knowing I've learned a lot, I've improved a lot and I'm ready to bring the fight to everyone.\n\"Confidence is something I've struggled with in the past and probably I've only built enough up throughout this season to go 'I'm confident that I'm a good enough driver to win a championship next year' and I can bring a fight to whoever wants to fight me for it.\"\nNorris was speaking in a new BBC podcast F1: Back at Base, How To Go Racing, which followed the McLaren and Aston Martin teams over the final 10 races of the 2024 season.\nThe series, narrated by American actor Josh Hartnett, goes inside the teams' factories, at Woking and Silverstone.\nThe podcast spoke to those at the heart of operations, including team leaders Andrea Stella and Zak Brown at McLaren, Mike Krack and Andy Cowell at Aston Martin and drivers Norris, Oscar Piastri, double world champion Fernando Alonso and Lance Stroll.\nAt McLaren, Norris and Piastri combined to bring the constructors' championship back to the team's Woking headquarters for the first time since 1998.\nPiastri, also a first time F1 winner in 2024, told the series: \"I feel like I've definitely improved from my rookie season.\n\"In qualifying, I've made life a bit more difficult for myself than I would like, but the positive in that has been that I've had the ability to come through in the races and make the ground back up.\n\"It's now a case of just getting everything together rather than trying to fill in some missing gaps, which I think was the case last season.\"\nTeam principal Stella has created a winning culture at McLaren, although he keeps the key to his success a closely guarded secret - and is already strategising for the new season ahead.\n\"It will be incredibly naive to think that because we achieved the constructor championship, now we deserve it for the future,\" Stella told the podcast.\n\"Something that you have to deserve by doing a good job and, in a way, by doing a better job than you have done in 2024, and it was important to discuss the many opportunities we have to do better.\n\"We have achieved the 2024 constructors' championship, but the performance advantage we had was 0.04% on average, and the points margin we had was 2%.\n\"Over 666 points in a season,, external these margins simply mean that if you don't do better next year, then you have to be ready to face a loss. We don't want to face a loss. We want to continue winning, therefore, we need to raise the bar for the future.\"\nThe eight-part series F1: Back at Base is available to listen to now on BBC Sounds and episodes will drop weekly via the 'F1 Chequered Flag' feed.", "url": "https://www.bbc.com/sport/formula1/articles/cwyelyg0yrpo"}