{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:56:50", "date_modify": "2025-05-21 03:56:50", "date_publish": "2025-01-15 11:00:54", "description": "Luton Town legend Mick Harford believes new boss Matt Bloomfield is \"totally prepared and ready\" to manage at Championship level.", "filename": "sport_football_articles_c1m5l1px7z0o_1747799810.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e2b2/live/1419c5e0-d2bd-11ef-87df-d575b9a434a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c1m5l1px7z0o_1747799810.html", "title": "Matt Bloomfield: New Luton boss ready for Championship", "title_page": "Matt Bloomfield: New Luton boss ready for Championship - Harford - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Luton Town legend Mick Harford believes new boss Matt Bloomfield is \"totally prepared and ready\" to manage at Championship level.\nThe Hatters appointed former Wycombe head coach Bloomfield on Tuesday on a three-and-a-half-year contract, succeeding Rob Edwards, who left Kenilworth Road last week.\nChief recruitment officer Harford will now be part of the process of trying to strengthen Bloomfield's squad, having already brought in forward Isaiah Jones from Middlesbrough prior to his appointment.\n\"We're absolutely delighted to get Matt on board,\" he told BBC Three Couinties Radio.\n\"Obviously there's a short-term job he's got to do, get us climbing the table and get some points on the board, and then he has to apply his wits and cleverness to sustaining the club in the Championship.\"\nBloomfield left Wycombe with the Chairboys second in League One and looking to reach the second tier of English football for only the second time in their history.\nHarford said Luton \"didn't really want to disrupt Wycombe\" at this stage of the season and thanked them for helping ease the process, which also saw coaches Richard Thomas and Lee Harrison move to Kenilworth Road, along with senior analyst Ben Cirne.\n\"It happened over the weekend in such a short space of time, normally it's a long process,\" he added.\nBloomfield has little time to settle in, with home games against Preston North End and Millwall on the next two Saturdays, and a midweek trip to Oxford United in between.\nImproving their away form is crucial for the 40-year-old, as he looks to end a run of 11 defeats in a row on the road in all competitions.\nThey have only scored nine goals in 13 away league games, with only Plymouth and Stoke scoring fewer, and conceded 28, taking just four points out of a possible 39.\nBut Bloomfield indicated his focus was also on tightening up their work at the other end of the pitch.\n\"Looking at the stats from the season so far, we've conceded too many goals. That's the stand-out. We need to tighten up,\" he said.\n\"First and foremost, we need to do some work on the out-of-possession shape. But I'm really respectful of the job Rob's done here previously, he's a fantastic manager, and got a really good group together.\n\"I'm really hoping we can bring a fresh energy and I'm looking forward to doing a good job here.\"\nBloomfield said he believes Luton and Wycombe had some shared values, which should help ease his transition into his new role.\n\"There are similarities between the two clubs, the heritage of Luton is about hard work, respect, grit, determination, delivering for the supporters.\n\"Wycombe stand for a lot of that as well so it felt comfortable to come to this football club.\n\"There are some very good footballers here and we're really looking forward to working with them. I'm sure we're going to reference the team at Wycombe. This is a new start and this is a very respectful group of players who we're really excited to work with.\"\nBloomfield said he would not pretend that he \"has all the answers\" to Luton's difficulties this season right from the outset.\nBut he is undaunted by Luton's current league position of 20th, just two points above the bottom three.\n\"When we took over at Colchester, we were fighting a relegation battle. We lived through that process and at one point during last season before Christmas, you could argue that where we [Wycombe] were in the league, we were in a relegation battle, though I never believed we were,\" he added.\n\"I don't get too caught up in the situation, or the perception of the situation. It's about taking each day as it comes, and having the best day you possibly can and backing that up with more good days.\n\"If we start to get results, points on the board, it will start snowballing and we can start to move forwards.\"", "url": "https://www.bbc.com/sport/football/articles/c1m5l1px7z0o"}