{"authors": ["Alex Howell", "www.facebook.com"], "date_download": "2025-05-21 04:40:47", "date_modify": "2025-05-21 04:40:47", "date_publish": "2025-04-03 09:04:50", "description": "Crystal Palace Q&A: What is to come from the rest of the season?", "filename": "sport_football_articles_c8epkdege20o_1747802447.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c08a/live/9348b490-0fdd-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c8epkdege20o_1747802447.html", "title": "Crystal Palace Q&A: What is to come from the rest of the season?", "title_page": "Crystal Palace Q&A: What is to come from the rest of the season? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Throughout Thursday, we are doing a special Q&A with BBC Sport football news reporter Alex Howell. In this first of three parts, he assesses what might be still to come this season and looks back at their FA Cup quarter-final success.\nJoe asked: Where will Crystal Palace end the season?\nThe road to Conference League via a strong finish and an unusually high number of Premier League clubs in Europe?\nThe road to glory via winning the FA Cup and then securing Europa League football?\nThe road to nowhere via an average finish after a tough run-in and no European football?\nAlex: These are the questions most who follow Crystal Palace are asking themselves. The FA Cup is definitely the most realistic route as it is 'only' two games from lifting the trophy and European qualification. I think most supporters would pick that route as it would end the trophy drought at Selhurst Park.\nThe other thing to take into account is that Palace's run-in for the rest of the season is exceptionally hard. In their last 10 league games, the Eagles have to face eight of the current top 10.\nPaul asked: Were you worried Crystal Palace might have been undercooked against Fulham on Saturday, after three weeks without a competitive game?\nAlex: The result shows that the break benefited Palace. Manager Oliver Glasner said his team felt rusty because of the three-week gap, but the most important factor was having Jean-Philippe Mateta back. The forward, although lacking match sharpness, is so key to the direct way Palace play and the time between the games allowed him to recover enough to be involved.\nGlasner makes a point of his teams being at peak fitness because of the intense style he demands, so having games in a row before the semi-final will help them to get to the level he wants.\nNot a Palace fan? Find and follow your team here\nAlan asked: Now that we are safe in the league, why don't we give some of the academy players some first-team appearances? There are already rumours that both Jesse Derry and Caleb Kporha are unhappy with their opportunities and are thought to be going elsewhere.\nAlex: It is always a fine balance of managing a squad for a manager. Young players should be given opportunities, not only for their development but fans love it too. The difficult part is that you have squad players who will see a youngster coming through and taking their potential minutes in the team.\nWith Derry, I think it is a case of a contract not being agreed and there are other clubs interested in him. It is always difficult for young players with talent who have options. Kporha, on the other hand, is getting close to agreeing a new deal. He has been around the squad all season and I know he has impressed the first-team players in training so looks to have a bright future.\nCome back later on Thursday for part two, where Alex will look at who might leave the club this summer.", "url": "https://www.bbc.com/sport/football/articles/c8epkdege20o"}