{"authors": ["Steve Sutcliffe", "www.facebook.com"], "date_download": "2025-05-21 07:32:55", "date_modify": "2025-05-21 07:32:55", "date_publish": "2025-01-13 17:37:17", "description": "Mark Selby produces a superb display to thrash Ali Carter 6-1 and advance to the last eight of the Masters at Alexandra Palace.", "filename": "sport_snooker_articles_cj3emekzzjvo_1747812775.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e541/live/657fd090-d1f6-11ef-a02c-b1a25ba77fd5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_snooker_articles_cj3emekzzjvo_1747812775.html", "title": "Masters snooker: Mark Selby thrashes Ali Carter to reach last eight", "title_page": "Masters snooker: Mark Selby thrashes Ali Carter to reach last eight - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Mark Selby produced a superb display to thrash Ali Carter 6-1 and advance to the last eight of the Masters at Alexandra Palace.\nThree-time champion Selby compiled breaks of 62, 108 and 93 as he reeled off the first four frames to head into the mid-session interval in complete control.\nWhile fellow Englishman Carter did get a frame on the board once play resumed, he was barely able to make any impression on the match, with Selby knocking in a sublime break of 126 before sealing his victory with a half-century.\n\"I played in the Championship League last week and felt I was hitting the ball quite well. It is nice to carry it on and bring it into a tournament as big as this,\" Selby told BBC Sport.\n\"You are only human and you can easily come out and collapse with this crowd. There is a lot of pressure out here.\"\nSelby will now face Mark Allen or Si Jiahui in the quarter-finals.\nEarlier on Monday, Ding Junhui edged past Mark Williams 6-5 in a final-frame decider to book his place in the next round against either Judd Trump or Barry Hawkins.\nWhile neither player was at their best in a fragmented opening to the match, the contest sparked into life after the mid-session interval.\nHaving made breaks of 57 and 70, Wales' two-time winner Williams led 3-2 before the momentum swung back towards his Chinese opponent, who enjoyed runs of 64 and 60.\nIn a see-saw encounter Williams compiled a sublime break of 136 to level and then pinched the ninth frame after Ding faltered on 66 to lead 5-4.\nHowever, the 2011 champion made a 76 to force an 11th frame after enjoying a fortuitous run of the balls, and then secured his win with a wonderful break of 90.\nSelby delivered arguably the performance of the first round so far in the way he comprehensively outplayed Carter.\nThe 41-year-old was excellent in the tactical exchanges and capitalised on almost every error from his fellow Englishman.\nThat was underlined in the second frame, when world number 11 Carter failed to cannon the brown while potting the green.\nIt ultimately left the door open for Selby to punish him by stealing the frame on the black.\nAnd from there, 'The Jester from Leicester' only grew stronger with his opponent visibly struggling.\nWhile Selby may have not reached the semi-finals of this event for over a decade, his British Open success earlier this season and recent performances at the Championship League suggest another big title may not be far away.", "url": "https://www.bbc.com/sport/snooker/articles/cj3emekzzjvo"}