{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:42:37", "date_modify": "2025-05-21 07:42:37", "date_publish": "2025-01-13 17:01:20", "description": "Manager Brendan Rodgers will not stand in the way of any player who wants to leave Celtic but says Kyogo Furuhashi is unaffected by speculation.", "filename": "sport_football_articles_cpwxrxr9kxeo_1747813357.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a81d/live/1eba2790-d1ca-11ef-9fd6-0be88a764111.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cpwxrxr9kxeo_1747813357.html", "title": "Celtic: Kyogo speculation does not worry Brendan Rodgers", "title_page": "Celtic: Kyogo speculation does not worry Brendan Rodgers - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manager Brendan Rodgers will not stand in the way of any player who wishes to leave Celtic but says striker Kyogo Furuhashi has not been affected by transfer speculation in January.\nThe Japan forward has been linked with Atlanta United and Major League Soccer apologised to Celtic last week after its website wrongly published a story saying a deal had been done.\nCeltic travel to Dundee on Tuesday looking to stretch their lead at the top of the Scottish Premiership to 18 points before Rangers play Aberdeen on Wednesday.\nKyogo scored twice in the 4-1 win at Ross County on Saturday and although the 29-year-old celebrated both finishes in muted fashion, Rodgers dismissed any significance.\n\"People will always look into something,\" the Northern Irishman said. \"He didn't celebrate enough, or he didn't do this or he didn't do that.\n\"I see him every day, I see his work, I see his intensity. Maybe he scores so much that he doesn't feel he has to celebrate madly all the time. Or maybe he was too cold.\n\"He's just the same guy. [There is] always speculation and we're not scared of the speculation and the gossip. He's fine and he will travel to Dundee.\"\nRodgers said it is only prudent for Celtic to have contingency plans for any bids that arrive for first-team players during the January transfer window.\n\"All these 'what if' scenarios, you have to be [prepared],\" he added.\n\"If a player doesn't want to be here, then go. At that point the club has to get the best possible deal. I don't see the point of keeping someone who doesn't want to be here.\n\"It's all eventualities we prepare for, whether it's injuries or transfers. You always have to be ready.\n\"But for him, he's happy, he's working well, scoring goals and enjoying his football.\"", "url": "https://www.bbc.com/sport/football/articles/cpwxrxr9kxeo"}