{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:16:35", "date_modify": "2025-04-26 04:16:35", "date_publish": "2025-03-04 08:50:31", "description": "San Diego FC vow to stop \"unacceptable\" homophobic chanting heard during their first home fixture in Major League Soccer.", "filename": "sport_football_articles_c1en0z715y9o_1745640995.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8cd2/live/3b1bc130-f8d2-11ef-8a06-7ba4024a445c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c1en0z715y9o_1745640995.html", "title": "San Diego FC condemn 'unacceptable' homophobic chanting during first MLS home fixture", "title_page": "San Diego FC condemn 'unacceptable' homophobic chanting during first MLS home fixture - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Major League Soccer side San Diego FC have said they will take action to stop the \"unacceptable\" homophobic chanting that occurred during their first home game in the division.\nSaturday's goalless draw against St Louis City, played in front of more than 34,000 fans at the Snapdragon Stadium, was marred by a one-word homophobic chant being repeated several times throughout the match.\nDuring the match, the club posted messages urging supporters to stop the \"offensive chanting\" and they have since followed up by saying: \"What took place during our first-ever home match does not reflect who we are as a club or the values we stand for.\n\"The sport of football brings people together and in San Diego that inclusive spirit thrives. The use of homophobic language in our stadium is completely unacceptable and will not be tolerated.\n\"San Diego FC is built on respect and the belief that soccer is for everyone.\"\nThe club said they will take \"immediate steps to address this behaviour\" and a \"details plan\" will be in place before their next home match.\nThe chant, which is widespread in the Mexican league, has seen Mexico's national team fined several times by Fifa.\nIt is typically aired when the opposition goalkeeper takes a goal-kick.\n\"The chant that was heard tonight is unacceptable,\" said San Diego head coach Mikey Varas.\n\"It's outside of our value system. It doesn't represent the players, myself or the club, and it certainly doesn't represent San Diego or Baja California. It's not a reflection of who we are.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c1en0z715y9o"}