{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:55:17", "date_modify": "2025-05-20 13:55:17", "date_publish": "2023-07-31 11:08:38", "description": "West Brom turn down a \"final\" offer from Luton Town for goalkeeper Alex Palmer, BBC WM reports.", "filename": "sport_football_66359552_1747749317.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/E8E3/production/_130591695_shutterstock_editorial_13713494bg.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66359552_1747749317.html", "title": "Alex Palmer: West Bromwich Albion reject Luton Town offer for keeper", "title_page": "Alex Palmer: West Bromwich Albion reject Luton Town offer for keeper - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "West Brom have turned down a \"final\" offer from Luton Town for goalkeeper Alex Palmer, BBC WM reports.\nThe 26-year-old had a two-match loan spell with the Hatters in March 2022, keeping a clean sheet against Coventry.\nHe established himself in Albion's first team last season, playing 25 games - including both against Luton.\n\"This was a situation I didn't expect. When these things happen, the club needs to show the right reaction,\" head coach Carlos Corberan said.\n\"The only thing I know is the club received the offer and moved it immediately to Alex. Now it is the moment where they are about waiting [for] the consequences, or the possibilities, of the offer, but it's totally out of my responsibilities.\"\nWest Brom - who lost 4-3 to Bolton in their final pre-season friendly - finished ninth in the Championship last season, three points outside the play-off places.\nSince then they have sold defender Dara O'Shea to Burnley and striker Karlan Grant has joined Cardiff on loan, with Brighton winger Jeremy Sarmiento the only incoming deal.\nCorberan's side begin the new campaign with an away game against Blackburn on Saturday, and he is keen to finalise his squad as soon as possible.\n\"I would like to have more clarity on the players we would like to have because some of the players I want are not here right now,\" he added.\n\"Some of the players that are here right now, maybe they move, which will add to the challenge we have to face.\"", "url": "https://www.bbc.com/sport/football/66359552"}