{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:38:59", "date_modify": "2025-04-26 04:38:59", "date_publish": "2025-03-01 00:00:00", "description": "Listen to Sportsound and follow live text updates of Saturday's Scottish football, including Rangers v Motherwell, Dundee v St Johnstone and St Mirren v Celtic.", "filename": "sport_football_live_cn522v4nw2pt_1745642339.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_cn522v4nw2pt_1745642339.html", "title": "BBC Sport - BBC Sport", "title_page": "Saturday's Scottish football - radio & text: BBC Sport - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Post\nFollowing a mammoth day of football, I need my bed.\nCheers for joining me as Celtic capitalised on Barry Ferguson's first defeat as Rangers interim manager on his return to Ibrox.\nElsewhere, we caught a big win for Ross County while Dundee and St Johnstone picked a point each.\nCatch you tomorrow when we'll do it all again.\n'Overachieving Buddies still have a top six chance' - Robinson\nFT: St Mirren 2-5 Celtic\nMore from Stephen Robinson: \"I don't think many teams press Celtic like that and create that many chances but we didn't take enough of them.\n\"That's probably been the story of our season. We can't afford a striker that gets 20 goals. There's very, very good points in that performance but we want to come out with three points.\"\n\"There's four games to play, 12 points to play for and that can make a huge difference in the standings. The top six is hard to get into.\n\"We've overachieved in the last two seasons, we know what we're missing but financially that's hard to do. To still be in the running it's very much a case of how many points we can pick up in the next four games.\"\n'The Celtic bench were very clear on penalty' - Robinson\nFT: St Mirren 2-5 Celtic\nStephen Robinson tells BBC Scotland his St Mirren side were denied \"a very clear penalty\" against Celtic.\n\"It's a penalty. It's very clear. The Celtic bench were very clear on it.\n\"It's not given, they go up the other end and score. Football is very cruel at times. The decision changes things but we still go and concede the goal. If you keep it at 3-2 and he doesn't give the penalty, the game is very much still alive.\"\nMcGregor 'felt his calf' - Rodgers\nFT: St Mirren 2-5 Celtic\nMore from Rodgers on some of the substitutions: \"Callum had felt his calf. He should be fine but we don't want to take any risks with him.\n\"Auston got a bang in the head and had to get five stitches. He should recover but Scales came in and did really well.\"\n'One of my favourite results this season' - Rodgers\nFT: St Mirren 2-5 Celtic\nCeltic manager Brendan Rodgers tells BBC Scotland the win against St Mirren \"was one of my favourite results of the season\".\n\"It's a brilliant three points for us. I think our attacking play was really strong. We were so good on a difficult surface, the players were technically very strong.\n\"I think it's one of my favourite results of the season coming to St Mirren who have had some really good performances against other teams.\n\"Yang's girlfriend is here at the moment so he's in a great feeling. I said to her interpreter to try and make sure she stays!\n\"He's a young player, he's growing and developing which is why it's about more than just performances and results, it's about the development of young players.\"\nMixed emotions for Buddies\nFT: St Mirren 2-5 Celtic\nKheredine Idessane\nBBC Scotland at the SMISA\nHome boss Stephen Robinson will no doubt have mixed emotions.\nHe will be feeling the bitter sting of defeat with disappointment but also knows his side contributed fully to a fabulous game of football.\nThey gave Celtic a real run for their money, drew several top-class saves from Denmark goalkeeper Schmeichel and will no doubt rue the concession of a needless penalty just before half-time that made their job even more tricky.\nThe energy, pressing and organisation of this St Mirren side caused Celtic a fair few problems and, if they can keep up the intensity in the run-up to the Premiership split, they will still fancy their chances of making the top six for a third consecutive season.\nCeltic 'clinical'\nFT: St Mirren 2-5 Celtic\nPat Bonner\nFormer Celtic goalkeeper on BBC Sportsound\nSt Mirren were always in it up until the final period in that game. Celtic in the last 25 minutes, and the changes Rodgers made, what an impact.\nYang was lightning when he came on. Maeda getting his goall too. I think in the last 25 minutes Celtic deserved it but St Mirren were always in it.\nThey had huge chances and that's the big difference between the two teams.", "url": "https://www.bbc.co.uk/sport/football/live/cn522v4nw2pt"}