{"authors": ["James Jones", "www.facebook.com"], "date_download": "2025-05-21 06:03:53", "date_modify": "2025-05-21 06:03:53", "date_publish": "2024-12-24 15:39:35", "description": "West Ham news: Opinion - fan's moment of the year", "filename": "sport_football_articles_ckg8l3x2235o_1747807433.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b0c2/live/79c50fe0-b62f-11ee-beb5-e1400df560f2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ckg8l3x2235o_1747807433.html", "title": "West Ham news: Opinion", "title_page": "West Ham news: Opinion - fan's moment of the year - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Unlike 2023, it has been tough to choose my West Ham moment of the year.\nIt's been a difficult 12 months. A glorious 2023 ended with us beating Manchester United and Arsenal and there was loads of optimism that we would follow it up with further progress.\nBut that just hasn't happened. Form fell off dramatically in the second half of last season and David Moyes left the club in the summer. Since then, with Julen Lopetegui at the helm there's been very little improvement.\nIn short, 2024 has been a very forgettable year for West Ham.\nBut there was one moment that will live long in the memory: the second-leg of the Europa League quarter-finals against Bayer Leverkusen in April.\nWe had a mountain to climb. Not just because we'd lost the first-leg 2-0 but because Xabi Alonso's side were on a 43-game unbeaten run and had just been crowned Bundesliga champions. They were literally unbeatable.\nBut in the first-half West Ham were magnificent. We had Leverkusen rattled and on the ropes. Michail Antonio put us 1-0 up in the 13th minute and London Stadium was absolutely rocking. Our attacking play was relentless. Defensively it didn't matter, there was barely any defending to be done. Leverkusen couldn't get the ball.\nFor 45 minutes there was a real belief that West Ham were about to pull off one of the biggest upsets in Europa League history. That might sound far-fetched, but having to overcome a two-goal deficit against a team that hadn't lost in almost an entire year requires a literal miracle.\nAs the game wore on, our players understandably got tired and Leverkusen started to threaten. Our hopes of reaching the semi-finals were short-lived but were replaced with the hope of at least beating Leverkusen. No one had managed it that season. But in true Leverkusen fashion, they levelled in the 89th minute and remained unbeaten.\nWe were out but we came some close to a historic win on the night. It was a performance we rarely witnessed under Moyes and are yet to see under Lopetegui. It was unbelievable.\nI'll never forget that night. Hopefully we'll have more of that to look forward to. One day...", "url": "https://www.bbc.com/sport/football/articles/ckg8l3x2235o"}