{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:35:37", "date_modify": "2025-04-26 04:35:37", "date_publish": "2025-02-28 12:21:05", "description": "Wing Tomi Lewis will make his first Scarlets appearance for nine months in Saturday's United Rugby Championship (URC) visit to face Ulster.", "filename": "sport_rugby-union_articles_c62zzdv996vo_1745642137.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/10b8/live/6351ab30-f5bf-11ef-9aa5-8f9f2163b0a2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_c62zzdv996vo_1745642137.html", "title": "United Rugby Championship: Scarlets wing Tomi Lewis back for Ulster trip", "title_page": "United Rugby Championship: Scarlets wing Tomi Lewis back for Ulster trip - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Wing Tomi Lewis will make his first Scarlets appearance for nine months in Saturday's United Rugby Championship (URC) trip to Ulster.\nLewis, 26, has not featured since rupturing his Achilles in last June's defeat to Dragons.\nHe is named in a side showing seven personnel changes from the loss out in Munster.\nMacs Page starts on the other wing, while there is new front row of Alec Hepburn, Ryan Elias and Sam Wainwright.\nElias takes over the captaincy in the continued absence of injured flanker Josh Macleod.\nLock Alex Craig starts alongside Sam Lousi, while Max Douglas switches to blind-side flanker in a back row that includes Dan Davis and Jarrod Taylor.\nWales squad centre Joe Roberts starts but Taine Plumtree misses out because of a head injury after the flanker was also released by national interim coach Matt Sherratt.\nScrum-half Conor McKee will make his competitive Ulster debut when he partners fly-half Jack Murphy.\nUlster go into the contest 14th in the table after losing seven of their 11 fixtures which include the most recent defeats by Italian sides Zebre and Benetton.\nThe Belfast-based side have not lost at home to a Welsh region since Scarlets defeated them in February 2016 and Ulster have won their last five league fixtures against Dwayne Peel's side.\nScarlets' only away victory this season was 25-19 against Cardiff at the Arms Park in October 2024 and they have not beaten an Irish province since Connacht visited Llanelli in March 2021.\nFor Scarlets assistant coach Jared Payne, the trip to Belfast will be a homecoming, with the former Ireland centre spending 10 years as a player and coach with Ulster.\n\"It will be my first time on the visiting team,\" said Payne.\n\"It will be good to go back, see a few old friends and obviously try and get one over on them as well.\n\"They have had their fair share of injuries this season, they are getting a few players back this week and knowing a few of the guys who are stepping back into the fold they are pretty competitive and will want to right the wrongs of the last few weeks.\n\"I am sure they are going to come out fighting and are going to be a dangerous team.\"", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/c62zzdv996vo"}