{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:59:06", "date_modify": "2025-05-21 06:59:06", "date_publish": "2025-01-22 16:06:52", "description": "The International Boxing Association asks Donald Trump's new administration to \"look into\" the sport's omission from the 2028 Los Angeles Olympics.", "filename": "sport_olympics_articles_c2479v9q86qo_1747810746.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a85a/live/73b3b6a0-d8c1-11ef-a303-a344a2a81285.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_olympics_articles_c2479v9q86qo_1747810746.html", "title": "2028 Olympics: IBA asks President Trump to 'look into' boxing's omission from LA Games", "title_page": "2028 Olympics: IBA asks President Trump to 'look into' boxing's omission from LA Games - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The International Boxing Association has asked United States president Donald Trump's new administration to \"look into\" the sport's omission from the 2028 Los Angeles Olympics.\nThe International Olympic Committee (IOC) suspended the IBA - which ran the Olympic Games' boxing programme - in 2019 because of concerns over its finances, governance, ethics, refereeing and judging.\nHaving failed to meet required reforms set out by the IOC, the IBA was stripped of its role - a decision upheld in April 2024 by the Court of Arbitration for Sport (Cas) following an appeal.\nThe IOC organised boxing at Tokyo 2020 and Paris 2024, and, though it says it will not do so at future Olympics, it remains hopeful the sport can be restored to the programme through a new international federation.\nAt present boxing is not part of the 2028 plans - but a final decision on its inclusion has not yet been made.\nWorld Boxing, which hopes to secure the recognition to run Olympic boxing, has already reached 60 members.\nBut the Russian-led IBA, which wants to re-establish its own governing status, has asked Trump, who took office as president of the United States for the second time on Monday, to help restore boxing to the Olympic programme.\n\"They [the IOC] have announced in the last 12 months that boxing will not be part of the Olympic program for LA28; it would be very much appreciated if your team could look in to this situation,\" an open letter from the IBA to Trump read.\n\"We sincerely hope that boxing will be part of the celebrations in the Los Angeles 2028 Olympics, and will indeed become a great showcase of genuine love to the sport from the American nation and fans worldwide.\"\nTrump, who enjoyed a brief foray in boxing promotion during the early 1990s, has been elected on a four-year term and will be in office when the Games are held in Los Angeles in 2028.", "url": "https://www.bbc.com/sport/olympics/articles/c2479v9q86qo"}