{"authors": ["Matthew Howarth", "www.facebook.com"], "date_download": "2025-05-21 06:25:18", "date_modify": "2025-05-21 06:25:18", "date_publish": "2025-01-04 15:38:33", "description": "Tottenham 1-2 Newcastle: Spurs in freefall", "filename": "sport_football_articles_cx2wzxw9dgeo_1747808718.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d445/live/6b6a85a0-cab1-11ef-8fb8-75874e244aea.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cx2wzxw9dgeo_1747808718.html", "title": "Tottenham 1-2 Newcastle: Spurs in freefall", "title_page": "Tottenham 1-2 Newcastle: Spurs in freefall - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ange Postecoglou's team could hardly have wished for a better start against in-form Newcastle, but Dominic Solanke's early goal was as good as it got against the Magpies.\nSpurs were behind seven minutes before half-time and despite an improved second-half display, they failed to trouble goalkeeper Martin Dubravka enough to salvage something from the game.\nSpurs were adamant Joelinton should have been penalised for handball in the build-up to Anthony Gordon's equaliser, but the officials deemed that the contact with Lucas Bergvall's pass was accidental and that the Brazilian's arm was in a natural position.\nTheir latest defeat means Spurs have picked up only five points from their last eight in the league, while their run of six home league matches without a win is their longest since an eight-game streak under Juande Ramos in 2008.\nThey have not kept a clean sheet in the Premier League since a 4-0 victory over Everton back in August - 10 matches ago.\nDebutant goalkeeper Brandon Austin could do little about Newcastle's two goals, while the introductions of Son Heung-min, James Maddison and Yves Bissouma with half an hour to play failed to turn the tide on another deeply frustrating afternoon for Postecoglou and his players.", "url": "https://www.bbc.com/sport/football/articles/cx2wzxw9dgeo"}