{"authors": ["Andrew Moon", "www.facebook.com"], "date_download": "2025-05-20 13:56:16", "date_modify": "2025-05-20 13:56:16", "date_publish": "2023-07-31 10:57:56", "description": "Is the 2023-24 season the one where Pompey fans can dare to dream of promotion? BBC Radio Solent commentator Andy Moon gives his thoughts and analysis.", "filename": "sport_football_66335292_1747749376.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0D6D/production/_130573430_shutterstock_editorial_13903208dt.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66335292_1747749376.html", "title": "Andrew Moon column: Is this the season Portsmouth make the promotion leap?", "title_page": "Andrew Moon column: Is this the season Portsmouth make the promotion leap? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Is this finally the year? That is the question Portsmouth fans have got sick of asking themselves in recent seasons.\nThis is a seventh campaign in League One but it feels like more, probably because Pompey have slipped further away from promotion in recent years.\nTheir summer recruitment has been very efficient. Every club says they want to get their business done early but John Mousinho and sporting director Richard Hughes actually managed to do it. Impressively so.\nThe majority was done before the preseason team-building trip to Spain and it is possible there will not be any further additions beyond the opening day of the season. This is almost unheard of at any level. As someone pointed out to me this week, if you sign a player on deadline day they've already missed more than 10% of your league season.\nThe signings have generally fitted the desired profile of young ascending players and the reliance on loans of the past few years has also come to an end.\nHowever, it is the quality rather than the timing of signings that really matters. Last summer may have been more chaotic but the late arrival of Colby Bishop was an inspired move and he was deservedly player of the season.\nPompey will once again need a significant scoring return from their talisman. The big questions about this team are the number of goals beyond Bishop and can they get him the service he needs? Anthony Scully and Gavin Whyte are eye-catching signings on the wing and will need to contribute. Christian Saydee is a good back-up option up front.\nMarlon Pack, Tom Lowery and Joe Morrell comprise a promotion-calibre midfield but they are not free scoring. The other attacking additions feel like 'wildcard' signings. The young trio of Terry Devlin, Kusini Yengi and loanee Abu Kamara have bundles of potential but can they deliver it this season? It feels a long time since Portsmouth unearthed an unknown gem in the transfer market.\nThe defence looks solid with two good options at both full-back positions and four good centre-backs. Ryley Towler will hope to build on an encouraging start to his Pompey career. The battle to play alongside him is intriguing. Regan Poole arrives from Lincoln and is proven at this level, but it would be foolish to write off Sean Raggett. He had been told he could leave a couple of years ago but went on to play nearly every game in the past two seasons.\nFor the first time since Craig MacGillivray was at Pompey the club have a permanent first-choice goalkeeper, with Will Norris arriving from Burnley after spending last season on loan at Peterborough. It would be harsh and wrong to judge him on Peterborough's play-off collapse at Sheffield Wednesday.", "url": "https://www.bbc.com/sport/football/66335292"}