{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:42:18", "date_modify": "2025-05-21 06:42:18", "date_publish": "2025-01-04 12:28:54", "description": "England’s Ben Duckett and Jacob Bethell featured as Melbourne Stars beat local rivals Melbourne Renegades by five wickets in the Big Bash League.", "filename": "sport_cricket_articles_c80v4n1zmz1o_1747809738.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e96f/live/5f862760-ca95-11ef-8aa7-690308ce7831.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c80v4n1zmz1o_1747809738.html", "title": "Big Bash League 2024-25 results: Ben Duckett's 67 helps Melbourne Stars to win over Melbourne Renegades", "title_page": "Big Bash League 2024-25 results: Ben Duckett's 67 helps Melbourne Stars to win over Melbourne Renegades - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A fine 67 from England's Ben Duckett helped Melbourne Stars to a five-wicket win over local Big Bash League rivals Melbourne Renegades.\nDuckett's international team-mate Jacob Bethell top scored with 49 as the Renegades posted 168-7, and he then took two good catches to dismiss Duckett and Marcus Stoinis late on in the Stars run chase.\nGlenn Maxwell and Hilton Cartwright shook off the loss of Duckett and Stoinis to see the Stars home with two deliveries to spare.\nBethell, who hit three fifties in his first three Tests for England on the recent tour of New Zealand, struck two sixes and four fours in his innings at the Melbourne Cricket Ground.\nBut after the dismissal of fellow England batter Dan Lawrence reduced the Stars to 41-3 off 5.2 overs, Duckett and Stoinis accelerated during a partnership of 81 until Duckett holed out to Bethell on the leg side after hitting four fours and three sixes.\nBethell then took an excellent low catch to get rid of Stoinis three deliveries later, but Maxwell and Cartwright piloted the Stars to only their second win of the season with Cartwright hitting Tom Rogers for a six and a four in the last over.\nDuckett and Bethell are part of England's squad for their white-ball tour of India later this month and then February's Champions Trophy.", "url": "https://www.bbc.com/sport/cricket/articles/c80v4n1zmz1o"}