{"authors": ["Matthew Cresswell", "www.facebook.com"], "date_download": "2025-05-21 04:33:57", "date_modify": "2025-05-21 04:33:57", "date_publish": "2025-04-04 20:05:42", "description": "Catalans book their place in the semi-finals of the 2025 Challenge Cup after an ill-tempered victory over Salford Red Devils.", "filename": "sport_rugby-league_articles_cly1j7v56r8o_1747802037.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ea00/live/e0aa98f0-1183-11f0-9a9e-afe4b53e7e1b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-league_articles_cly1j7v56r8o_1747802037.html", "title": "Challenge Cup: Catalans Dragons 20-12 Salford Red Devils", "title_page": "Challenge Cup: Catalans Dragons 20-12 Salford Red Devils - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Catalans Dragons became the first team to book their place in the semi-finals of the 2025 Challenge Cup in an ill-tempered and mistake-ridden victory against Salford Red Devils.\nTries from Nick Cotric, Arthur Romano, Elliott Whitehead - who was also sent to the sin-bin for a high tackle - and Theo Fages earned the hosts the win.\nJoe Shorrocks and Matty Foster replied for the Red Devils, whose cup run came to an end in adverse conditions after first-choice full-back Ryan Brierley pulled out through injury before kick-off.\nDragons will find out their opponents in the last four when the draw is made on Sunday, 6 April, live on BBC Two.\nCatalans winger Cotric opened the scoring in the first minute when he was adjudged to have scored in the corner, but full-back Sam Tomkins - making his 400th career appearance - missed his conversion attempt from the left touchline.\nThe hosts dominated the early stages, and when Alrix Da Costa was able to get his offload away to Tomkins, the 36-year-old broke clear and ran for the line but was held up by some good scrambling defence from the visitors.\nCatalans did get their second try of the match moments later when, after Salford half-back Jayden Nikorima's short restart was turned over by the hosts, Reimis Smith found Romano, who broke clear to touch down.\nIn an often gruelling first 40 minutes, Catalans' Whitehead was sent to the sin-bin for a late shot on Tiaki Chan - the son of Catalans general manager Alex Chan - who was forced off after a head injury assessment.\nNow with a man advantage, the Red Devils, who welcomed back captain Kallum Watkins and Chris Atkin, soon got on the board.\nChris Hill threw an excellent dummy before offloading one-handed to Shorrocks, who strolled under the sticks. Chris Hankinson added the extras to make it 8-6 at half-time.\nTwo minutes into the second-half Whitehead made up for his earlier misdemeanour when he collected a high kick and dotted down in the in-goal area to score his first try since returning to the club following an eight-year spell in the NRL with Canberra Raiders.\nShortly after, former Red Devils scrum-half Theo Fages dived over for the hosts when he expertly sidestepped the Salford defence as Catalans threatened to run away with the tie.\nBut after resisting waves of attacking play from the hosts, the talented Esan Marsters raced down the right and set up Foster - a last-minute inclusion after the injury to Brierley, who earlier this week opened up on the mental torment Salford's current financial woes had caused the squad - to score and reduce the arrears to eight points.\nIt proved too little too late for the visitors, but showed Salford's continued determination to make a fight of it this season after it was reported that Catalans had paid for their trip to Perpignan for tonight's fixture.", "url": "https://www.bbc.com/sport/rugby-league/articles/cly1j7v56r8o"}