{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:54:03", "date_modify": "2025-05-20 14:54:03", "date_publish": "2023-07-27 13:38:30", "description": "Great Britain's Duncan Scott takes silver and Tom Dean bronze in the men's 200m medley final, while Lauren Cox also wins a medal.", "filename": "sport_swimming_66327341_1747752843.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1268D/production/_130550457_gettyimages-1574074236.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_swimming_66327341_1747752843.html", "title": "World Aquatics Championships 2023: GB's Duncan Scott and Tom Dean take 200m medley silver and bronze", "title_page": "World Aquatics Championships 2023: GB's Duncan Scott and Tom Dean take 200m medley silver and bronze - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Great Britain's Duncan Scott won silver and Tom Dean took bronze in the men's 200m medley final at the World Aquatics Championships in Japan.\nScott, the Olympic silver medallist in the event, finished 1.13 secs behind Leon Marchand of France.\nEarlier, World Championship debutant Lauren Cox claimed bronze by just 0.08 seconds in the women's 50m backstroke.\nWorld 200m champion Matt Richards set a new British record of 47.45 secs as he came fifth in the 100m freestyle final.\nAfter five days in Fukuoka, Great Britain have now won five medals and matched the total they won at the 2022 World Championships.\nScott, 26, became the most decorated British athlete at a single Games when he claimed four medals in Tokyo two years ago, but missed last year's Worlds because of illness.\n\"I'm just really happy to be back in the mix,\" said Scott, who touched home in one minute and 55.95 seconds.\n\"I was hurting at 150m, more than I thought I would be, but to give myself a chance I knew I had to be there at 150m. I was really happy with that.\"\nOnly fellow Briton Dean, 23, swam a faster freestyle final leg as he fought back from last place after the first two legs to finish 0.12 secs behind his team-mate.\n\"I love being up there on the podium with my team-mates because we are really good mates,\" said Dean, who won silver behind Richards in Tuesday's 200m freestyle. \"It's a united front with everyone on this team.\"\nMarchand, 21, dominated the final to capture his third individual title at the championships after his world record showing in the 400m individual medley and 200m butterfly gold.\nBritish Olympic medallist Steve Parry, commenting on BBC Radio 5 Live, said: \"That was quite extraordinary. Leon Marchand will be the face of the Paris Olympics - he's won three golds and broke Michael Phelps' last remaining world record earlier in the week.\n\"I don't know how Scott and Dean got medals - Dean came from nowhere to get the bronze!\"\nThe Britons are expected to win another medal on Friday when they team up with the likes of 2015 world champion James Guy and Richards in the 4x200m freestyle relay.\nRichards, 20, knocked 0.2 secs off the British record he set in Wednesday's semi-final but missed out on a medal by just 0.03 seconds.\nAustralia's Kyle Chalmers took the gold with Jack Alexy of the United States finishing second and Maxime Grousset of France third.", "url": "https://www.bbc.com/sport/swimming/66327341"}