{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:44:13", "date_modify": "2025-05-21 03:44:13", "date_publish": "2025-02-01 17:38:28", "description": "Irish Cup holders Cliftonville beat Glenavon 3-2 in extra-time while Dungannon Swifts and Crusaders are also among the sixth-round winners.", "filename": "sport_articles_c5y73lljezgo_1747799053.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1800/live/4c6b8700-e0c1-11ef-80f0-273d2cd9a9c9.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c5y73lljezgo_1747799053.html", "title": "Irish Cup: Cliftonville edge Glenavon as Swifts and Crues progress", "title_page": "Irish Cup: Cliftonville edge Glenavon as Swifts and Crues progress - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Irish Cup holders Cliftonville beat Glenavon 3-2 in extra-time to earn a place in the quarter-finals.\nThe Lurgan Blues scored a last-gasp equaliser in normal time to make it 2-2 before Jonny Addis struck the winner.\nDungannon Swifts also needed extra-time overcome Coleraine as Tomas Galvin clinched a 2-1 victory.\nCrusaders saw off the stern challenge of Championship side Limavady United with a late 1-0 win at Seaview with Harry Jewitt-White the match winner with just two minutes left.\nCarrick Rangers had Seanan Clucas sent-off but they still prevailed 3-0 away against Ballinamallard while Loughgall won by the same scoreline as they eased past Dollingstown.\nBangor secured a 3-0 victory over Annagh United in a game which saw a player from each side dismissed as Ards beat Moyola Park 3-1.\nIn the opening 10 minutes both sides were denied by the woodwork with Michael O'Connor's powerful effort from a Peter Campbell corner hitting the crossbar and Joe Gormley's shot crashing off the left-hand post.\nThe home side would then be denied by the woodwork once again on the 25th minute when Jack Keaney nodded Rory Hale's corner towards goal with his header striking the bar before being cleared to safety by Campbell.\nBoth teams continued to have chances to break the deadlock with Barney McKeown making a crucial clearance off the line to divert Gormley's strike and David Odumosu producing a diving save at the other end to stop Niall Quinn's strike.\nCliftonville broke the deadlock in first-half additional time when Destiny Ojo held off multiple Glenavon defenders to connect with Hale's long clearance and travelled to near the by-line before passing back to Arran Pettifer, whose strike flew past Mark Byrne.\nAfter the restart, Campbell's free-kick was nodded home at the back post by O'Connor to level the game on the 57th minute.\nStopper Odumosu then made another huge save to deny another header from O'Connor with Gormley unable to keep his shot on target as both sides pushed for a goal.\nWith just three minutes left, the home side took the lead when Hale's stunning strike from 25-yards flew into the top left-hand corner.\nThe frantic nature of the game continued with Glenavon equalising once again through the last chance of the 90 minutes when Odumosu leapt to collect O'Connor's cross, but spilt the ball and the alert McKeown was able to take advantage of the mistake.\nAddis netted the winning goal in the second half of extra-time when he charged into the box and sent a strike into the roof of the net after substitute Axel Piesold did well to find the unmarked defender in the box.\nGoals from Gael Bigirimana and substitute Galvin helped Dungannon defeat Coleraine in extra-time to reach the last eight.\nThe home side opened the scoring in spectacular style after just seven minutes.\nThere appeared to be little on when Bigirimana picked the ball up 25 yards from goal but the midfielder had other ideas, firing an unstoppable shot high into the roof of the net past a helpless Rory Brown.\nColeraine responded positively to the early setback and Jamie McGonigle saw his header from a Lyndon Kane cross hacked off the line by Steven Scott.\nAnd the Dungannon defender was in the right place at the right time again seven minutes before the break when he cleared Ronan Doherty's goalbound shot off the line with Declan Dunne beaten.\nJamie Glackin forced a fine save out of Dunne while the Swifts' stopper had to be alert to keep out Matthew Shevlin's back heel.\nAt the other end, Rory Brown raced off his line to dispossess Kealan Dillon while John McGovern was inches away from connecting with Andrew Mitchell's cross with the goal at his mercy.\nThe visitors levelled eight minutes from the end of normal time when substitute McManus, who only joined the club on Friday, got on the end of a Jamie Glackin to divert the ball past Dunne.\nColeraine captain Lyndon Kane twice denied the Swifts with brave blocks either side of the end of normal time and the start of extra-time as the home side looked dangerous on the break.\nBut he was unable to prevent the Swifts reclaiming the lead in extra-time when Galvin seized on an Andy Mitchell ball into the box, rounded his marker and planted the ball low into the bottom corner of the goal for what proved to be the winner.\nCarrick eased into the quarter-finals thanks to a comfortable away victory over Championship side Ballinamallard United.\nCian O'Malley gave the visitors a first-half lead and Paul Heatley added a second before Carrick's Seanan Clucus was red-carded.\nHowever, Rangers went on to add a third through Luke McCullough.\nLoughgall put their Premiership struggles behind them by beating Dollingstown at Planters Park.\nOwen McConville's own goal set the Villagers on their way before goals from Robbie Norton and Jay Boyd.\nAidan Steele put Ards in front at Moyola Park but Patrick McLaughlin levelled before Conor Maxwell and Lee Newell secured victory for the Championship club.\nMatthew Ferguson gave Bangor the lead before their captain Lewis Harrison was dismissed in the first half.\nAnnagh's Lee Upton was also sent-off before Ben Aurthurs doubled the advantage and Michael Morgan added a third.", "url": "https://www.bbc.com/sport/articles/c5y73lljezgo"}