{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:33:52", "date_modify": "2025-05-20 12:33:52", "date_publish": "2023-08-04 09:25:32", "description": "Southampton defender Jack Stephens signs a new two-year contract with the Championship club.", "filename": "sport_football_66404469_1747744432.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/F856/production/_130647536_jackstepehnsrex1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66404469_1747744432.html", "title": "Jack Stephens: Southampton defender signs new two-year contract", "title_page": "Jack Stephens: Southampton defender signs new two-year contract - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Southampton defender Jack Stephens has signed a new two-year contract with the Championship club.\nThe 29-year-old has been at St Mary's since he was 17, when he moved from Plymouth Argyle, and has made 151 appearances so far for Saints.\nLast season the Cornish-born defender played 17 Premier League games as Southampton finished bottom to end an 11-year top flight stay.\nHis deal comes as Duje Caleta-Car and Tino Livramento leave the club.\nLivramento agreed a £40m deal to join Newcastle United on Thursday while Croatia defender Caleta-Car has signed for Lyon and there is still speculation linking Romeo Lavia with a move to Liverpool.\n\"I'm very pleased. It's nice to get it all sorted before the season starts and just allows me to focus on the football and hopefully have a positive season,\" Stephens told the club website., external\n\"I think over the summer there was a lot of uncertainty over what was going on.\n\"But I had some good conversations with the manager and he made it clear that he wanted me to stay and I've loved working with him these first few weeks.\n\"I'm really confident that we're going to have a good season, so it was an easy decision for me to sign the contract and I'm really happy.\"", "url": "https://www.bbc.com/sport/football/66404469"}