{"authors": ["Harry Poole", "www.facebook.com"], "date_download": "2025-05-21 07:15:44", "date_modify": "2025-05-21 07:15:44", "date_publish": "2025-05-20 10:50:39", "description": "Dan Evans beats fellow Briton Billy Harris in the first round of French Open qualifying to move a step closer to the main draw.", "filename": "sport_tennis_articles_cy4kkpylx8eo_1747811744.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8a90/live/62df6820-358b-11f0-9b2c-138cad92aeb3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_tennis_articles_cy4kkpylx8eo_1747811744.html", "title": "French Open 2025 qualifying: Dan Evans beats Billy Harris to move closer to main draw, Heather Watson out", "title_page": "French Open 2025 qualifying: Dan Evans beats Billy Harris to move closer to main draw, Heather Watson out - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Dan Evans beat fellow Briton Billy Harris in the first round of French Open qualifying to move a step closer to the main draw.\nThe 34-year-old Evans fought back from 5-2 down in the first set to beat Harris 7-5 6-3 in Paris.\nFran Jones also progressed in the women's competition, but Heather Watson's hopes of contesting an 11th French Open are over.\nWatson lost 7-6 (7-2) 6-2 to Australian Daria Saville, but Jones will face Japan's Mai Hontama in the second qualifying round after defeating Croatia's Lea Boskovic 6-2 6-3.\nJan Choinski exited in the opening round of men's qualifying, losing 6-4 7-6 (7-5) to Italian Giulio Zeppieri.\nPlayers have to come through three qualifying rounds to reach the main draw.\nThe French Open - the second Grand Slam of the year - begins on Sunday.\nKatie Boulter, Emma Raducanu and Sonay Kartal are already in the women's main draw, while Jack Draper, Jacob Fearnley and Cameron Norrie will contest the men's.\nEvans, ranked 215th in the world, is targeting a return to the top 100 after slipping down the rankings.\nIt is less than two years since he reached a career-high of 21 but, now in the twilight of his career, he has predominantly been playing his tennis on the ATP Challenger Tour, which sits below the main tour.\nEvans has won just one match in seven main-draw appearances in Paris and the first set against Harris threatened to quickly run away from him.\nBut, having gone down an early break, Evans held to stay in the match, before turning the set on its head to lead as the unforced errors crept in to Harris' game.\nAnd it was again Evans who finished the stronger in set two, closing out the match with another double break from 3-3 to complete a straight-set victory.\nHe will meet 311th-ranked French wildcard Clement Tabur next, with Romania's Filip Cristian Jianu or German Henri Squire - both ranked lower than Evans - possible opponents in the final round.\nJones, ranked 113th, produced a dominant display to see off Boskovic - losing serve for the first time when serving for the match before recovering to close it out at the second attempt.\nThe 24-year-old is aiming to qualify for the second overseas slam of her career, having reached the Australian Open main draw in 2021.\nAt the Strasburg Open, world number 10 Paula Badosa and former Wimbledon champion Elena Rybakina both reached the fourth round.\nSpain's Badosa progressed after opponent Marie Bouzkova retired, while 12th-ranked Kazakh Rybakina defeated Wang Xinyu 6-1 6-3.\nBritain's Raducanu resumes her tournament on Wednesday when she plays American Danielle Collins, with the winner set to face top seed Jessica Pegula or Anna Kalinskaya in the quarter-finals.", "url": "https://www.bbc.com/sport/tennis/articles/cy4kkpylx8eo"}