{"authors": ["Dan George", "www.facebook.com"], "date_download": "2025-05-21 06:03:41", "date_modify": "2025-05-21 06:03:41", "date_publish": "2025-04-01 15:50:57", "description": "Eastleigh goalkeeper Tommy Scott has described the experience of playing in the Baller League as \"a bit surreal.\"", "filename": "sport_football_articles_c9qwvd5x9xyo_1747807421.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e033/live/2da3fed0-0f09-11f0-9021-b1661f716c64.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c9qwvd5x9xyo_1747807421.html", "title": "Baller League: Eastleigh goalkeeper on playing in new competition", "title_page": "Baller League: Eastleigh goalkeeper on playing in new competition - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Eastleigh goalkeeper Tommy Scott has described the experience of playing in the new Baller League as \"a bit surreal\".\nThe 25-year-old has been part of the Deportrio side that is managed by Alan Shearer, Micah Richards and Gary Lineker.\n\"It's a new, exciting form of football,\" Scott told BBC Sport.\nBaller League is a six-a-side format that originated from Germany, set up by entrepreneur Felix Starck alongside footballers Mats Hummels and Lukas Podolski.\nThe UK league's president is influencer and Youtuber KSI, some of the managers include other online personalities as well as some footballing icons.\nGary Lineker, John Terry and Luis Figo have been lined up as team managers, while Micah Richards, Alan Shearer, Freddie Ljungberg, Jens Lehmann and Robert Pires have also been signed up as coaches.\nOn Saturday Scott was part of the Eastleigh squad that travelled away to Tamworth, he then on Monday made the trip to London where he started for Deportrio.\nThey took on and beat N5 FC - who is managed by Arsenal legends Lehmann, Pires and Ljungberg.\nAs they scored their fifth goal of Monday's game to go 5-3 up, coach Richards was seen sprinting onto the pitch in celebration.\n\"To be in and around these guys is a bit surreal,\" Scott said.\n\"You settle in to it though because I'm there to do the business on the pitch, having the people in and around it definitely brings in the attention.\n\"There's the Youtuber and influencers but also some legendary football players that draw another type of crowd, it involves everyone.\n\"It's completely different which is why a lot of people like it and a lot really don't, that's OK.\"\nScott signed for National League side Eastleigh in the summer of 2023.\nHe has previously played for Yeovil Town, Weymouth and before that had a professional deal with Southampton.\nThe Baller League games are set for every Monday until 2 June and are played in London at the Copper Box Arena.\nThe top four teams in the league will then qualify for the play-offs in mid-June, with two semi-finals and a final to decide a champion.\nPlayers are paid £400 per match and the teams are made up of recently retired professionals, futsal players, free agents and released academy players.\nThe process for Baller League began with a draft, which Scott was invited to.\nBut the Eastleigh keeper got involved after his club allowed him to accept an invitation directly from the league.\n\"I was approached by Baller League,\" He added.\n\"They told me to come along to the draft and see what happens and I said to the club [Eastleigh] that it had been proposed and I was going to go.\n\"I just went in based off my past clubs and didn't expect to get picked. The club were supportive of it and it was a chance for me to get a little bit extra. Eastleigh have been great which I'm very grateful for.\"\nThe Spitfires are currently 11th in the National League, six points off the league's play-off positions with six games remaining.\nThey are managed by former Southampton goalkeeper Kelvin Davis who was appointed in February 2024 and signed a new three-year deal a few months later in April.", "url": "https://www.bbc.com/sport/football/articles/c9qwvd5x9xyo"}