{"authors": ["Alex Brotherton", "www.facebook.com"], "date_download": "2025-05-21 07:42:54", "date_modify": "2025-05-21 07:42:54", "date_publish": "2025-03-28 10:31:45", "description": "After a golden age in the 1980s and 90s, Sampdoria have now been relegated to Serie C for the first time - where did it all go wrong?", "filename": "sport_football_articles_cqjdlverepeo_1747813374.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/88ee/live/39d75160-3098-11f0-ad02-b95db8a5d645.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cqjdlverepeo_1747813374.html", "title": "Scudetto to Serie C - where did it go wrong for Sampdoria?", "title_page": "From Scudetto to Serie C - where did it go wrong for Sampdoria? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Italy has more than its fair share of iconic football clubs. AC Milan. Inter Milan. Juventus. Napoli. Lazio. Roma. These institutions roll off the tongue.\nFor many English fans of Italian football, particularly those whose love of calcio can be traced back to Channel 4's 'Football Italia', Sampdoria belong on that list.\nIn the decade between 1984 and 1994 Sampdoria won six major titles, while modern greats Trevor Francis, Roberto Mancini, Gianluca Vialli, Ruud Gullit and David Platt all wore the club's iconic strip.\nThe Blucerchiati of that period acquired a cultural cachet that was hard to match.\nYet after years of turbulence Sampdoria, Serie A winners in 1991, have experienced the unthinkable - relegation to the Italian third tier for the first time in the club's history.\nWhere did it all go wrong?\nUnusually for a club with such a large cult following, Sampdoria are relative newcomers to the Italian football landscape.\nThe northern Italian port city of Genoa has a proud footballing heritage -Sampdoria's city rivals Genoa Cricket and Football Club were founded in 1893 and are the oldest active team in Italy.\nThe most recent of Genoa's nine top-flight titles came 21 years before Sampdoria were formed in 1946, following a merger of middling Genoese clubs Sampierdarenese and Andrea Doria.\nThat unification produced their iconic home shirts - the blue represents Andrea Doria while the white, red and black mid-section came from Sampierdarenese.\nSampdoria have always shared a ground - the Stadio Luigi Ferraris - with neighbours Genoa, but for 38 years did not enjoy the kind of success befitting of one of Italy's grandest arenas.\nEverything changed in 1984.\nBefore the 1984-85 season, Sampdoria's only honour was the 1966-67 second division title.\nYet over the next decade the club won the Coppa Italia four times - more than any other side during that period - were crowned Serie A champions, won the European Cup Winners' Cup and played in a European Cup final.\nAfter assuming the club presidency in 1979, Paolo Mantovani was the man who turned an unfashionable mid-table team into serial winners.\nHaving made his money in the oil business, Mantovani spent heavily but smartly to propel Sampdoria to unprecedented heights.\nBig names like Francis, Graeme Souness and Liam Brady were signed, but it was the recruitment of some of the best young Italian talents that really paid off.\nA 17-year-old Mancini arrived from Bologna in 1982, followed two years later by a 19-year-old Vialli from Cremonese.\nNicknamed the 'goal twins' because of their prolific attacking partnership, both scored in the second leg of the 1984-95 Coppa Italia final, the first major title in Sampdoria's history.\nMancini and Vialli first met at 16 playing for Italy's youth teams and formed a close friendship that characterised the unity in the Sampdoria squad.\n\"We have a relationship that goes way beyond friendship,\" Mancini said before Vialli's death from pancreatic cancer in 2023. \"He's almost like a brother to me.\"\nAlong with goalkeeper Gianluca Pagliuca, defender Pietro Vierchowod, attacking right-back Moreno Mannini, midfield anchor Fausto Pari and electric winger Attilio Lombardo, the duo formed the backbone of a team that won three more Coppa Italia titles - and the club's first and only Scudetto in 1990-91 under legendary manager Vujadin Boskov.\n\"Mantovani cultivated a remarkable camaraderie among a uniquely talented group,\" says Italian football writer Stephen Kasiewicz.\n\"Despite more lucrative offers the core of the team stayed together.\"\nBoskov's side won the European Cup Winners' Cup in 1990, and lost to Johan Cruyff's Barcelona 'dream team' in the European Cup final two years later.\nBut nothing lasts forever.\nMantovani's death in 1993 was \"the beginning of the end at Sampdoria\", according to Italian football journalist David Ferrini.\nHe added: \"Mantovani's reign attracted talent and kept them happy in Genoa, but his passing - combined with the hangover of the Scudetto success - meant that Sampdoria's best players became prime transfer targets.\"\nIn 1992 they had lost Vialli to Juventus for a then world record £12m, while Inter Milan paid £7m for Pagliuca in 1994, a record for a goalkeeper at the time.\nVierchowod joined Juventus 12 months later before Mancini followed Sven Goran Eriksson - who had replaced Boskov as manager in 1992 - to Lazio in 1997.\nExperienced stars Gullit and Platt joined for brief spells, but Sampdoria no longer had the same appeal they once did.\nEnrico Mantovani took over as president but failed to replicate his father's success - and a steady decline followed the Coppa Italia triumph of 1993-94. In 1999 the club were relegated to Serie B.\nThings improved under the presidency of local entrepreneur Riccardo Garrone, who guided them back to Serie A in 2003 and signed future cult heroes Fabio Quagliarella and Antonio Cassano.\nYet the highlights of the 21st Century have been losing the Coppa Italia final in 2008-09 and a fourth-place league finish the following year.\nOutspoken film producer Massimo Ferrero bought the club in 2014 - taking on its growing debts - but what followed was seven years of selling their best players, spending little on replacements and flirting with relegation on a regular basis.\n\"He seemed more concerned with bolstering his own image, as the bizarre star of his own one-man reality football show, than making sure Samp prospered,\" says Kasiewicz.\nIn December 2021 Ferrero was arrested and jailed as part of an investigation into corporate crimes and bankruptcy, unrelated to the club. He resigned as president.\n\"The club effectively ceased to function. It's been like a house of cards,\" says Nima Tavallaey, Italian football journalist and co-host of the Italian Football Podcast.\nWith no funds available and Ferrero refusing to relinquish control, Sampdoria narrowly avoided relegation from Serie A in 2022. But in 2023 they did go down, amid reports of unpaid player wages.\nWith the club staring down the barrel of bankruptcy and demotion to the fourth tier, a consortium led by former Leeds United owner Andrea Radrizzani and London-based financier Matteo Manfredi - and his company Gestio Capital - bought the club, although Radrizzani has since divested his shares.\nGestio Capital and its investors control 99.96% of the club, with investment vehicle Kickoff Ventures owning 58% of those shares.\nKickoff Ventures is owned by Singaporean businessman Joseph Tey Wei Jin, who was named in the 2015 Panama Papers.\nItalian World Cup winner Andrea Pirlo was hired as coach in 2023-24.\nAfter a dismal start to the campaign his side won seven of their final 11 games to secure a seventh-place finish in Serie B and a spot in the promotion play-offs, where they lost 2-0 to Palermo in the preliminary round.\nGestio invested about £45m during their first season, but things have not gone according to plan this term.\nThe month before Sampdoria's play-off exit Manfredi had described Pirlo as \"a key part of the project\" - yet three games into the current campaign he was dismissed following two defeats and a draw.\nAndrea Sottil replaced him and, although he oversaw a Coppa Italia penalty shootout victory against Genoa in the first Derby della Lanterna in two years, he was jettisoned too after just four wins in 14 games.\nLeonardo Semplici arrived in December but, with the club in the drop zone, a 3-0 home defeat by Frosinone at the end of March was the tipping point for the fans as patience with Semplici ran out.\nThe team bus carrying Semplici and his Sampdoria players was pelted by stones and flares by angry supporters after the match at the Luigi Ferraris Stadium.\nSemplici was relieved of his duties in April with Alberico Evani - the club's fourth coach of the season - tasked with keeping them up.\nThings began promisingly for Evani with club legend Attilio Lombardo in as assistant and another Sampdoria icon in Roberto Mancini helping in an unofficial capacity.\nEvani began with a 1-0 win over fellow strugglers Cittadella, but three draws, a defeat and just one win since then have not been enough to keep them up.\nFor Tavallaey, Sampdoria must now start again with a \"proper project\" in place to return the club to its former glories..\n\"They have to build a proper project with a proper sporting directorship and a proper manager to help them back to Serie A. They're a sleeping beauty.\"\nThis article was first published in March 2025.", "url": "https://www.bbc.com/sport/football/articles/cqjdlverepeo"}