{"authors": ["Gareth Vincent", "www.facebook.com"], "date_download": "2025-04-26 07:43:51", "date_modify": "2025-04-26 07:43:51", "date_publish": "2025-02-26 18:17:19", "description": "New director of football Richard Montague says Swansea City want a manager who is at the \"forefront of the game\" as they seek a long-term replacement for Luke Williams.", "filename": "sport_football_articles_c1mn5ylp4eko_1745653431.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/68d9/live/adbb68d0-f431-11ef-8241-abbb923a0925.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c1mn5ylp4eko_1745653431.html", "title": "Swansea City: Richard Montague seeks manager 'at forefront of game' to replace Luke Williams", "title_page": "Swansea City: Richard Montague seeks manager 'at forefront of game' to replace Luke Williams - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "New director of football Richard Montague says Swansea City want a manager who is at the \"forefront of the game\" as they seek a long-term replacement for Luke Williams.\nMontague is leading Swansea's managerial search having started work at the Championship club the day after Williams' 13-month reign came to an end last week.\nHe says the Swansea vacancy is \"incredibly attractive\" despite the club's struggles both on and off the pitch in recent seasons.\nAnd while informal discussions with potential bosses have started, Montague says there is no rush to make an appointment with Alan Sheehan in interim control at the Swansea.com Stadium.\nMontague said it is \"possible\" that Williams' permanent successor will not be in place before the end of the season, adding: \"All options are on the table at the moment. That's as honest as I can be.\"\n\"My thinking now is simply to make sure I am gathering as much relevant information on all the available candidates and what we actually want out of a head coach at Swansea, and trying to bring all of those factors together to help us make a decision,\" he explained.\n\"We are absolutely going to take our time with it – it will take as long as it takes – because this is a super important decision and we need to get it right.\n\"Having the right head coach is absolutely foundational to what we want to achieve.\"\nMontague says playing philosophy will be a key factor in the recruitment process.\nHe believes getting results through possession-based football \"has to be the goal\" for a club whose considerable successes in the last two decades have been based on that approach.\n\"The important bit for me is that we find somebody who, alongside vital things like character, how they engage with players and engage with supporters and how they are as a leader of the football club, is at the forefront of where the game is going,\" Montague said.\n\"It's somebody who can help us be true to our identity, which I think is so important. I have never come across a club that has such a strong identity in terms of playing style.\n\"We need to be at the forefront of what's going on in football, on the data side, the recruitment side, strength and conditioning, the medical side. That's the only way to get to where we want to get to.\n\"So as long as we have somebody who respects our traditions but also wants to drive the club forward tactically, that's fine with me, as long as that leads to us performing well on the pitch.\"\nSheehan, who won 11 points from seven games after Michael Duff's exit last season, looks set to remain at the helm for a handful of matches at least, with Swansea next in action at Preston North End on Tuesday, 4 March.\nMontague says offering Sheehan a long-term deal is an option for Swansea.\n\"I think it would be negligent to rule anything out at this stage,\" he said.\n\"I had a good week with Alan last week, he invited me into his process and we had a really strong performance. We need to see how that proceeds and how that progresses.\"\nMontague added that Swansea are \"casting the net wide\" as they assess options, with overseas managers among those being considered.", "url": "https://www.bbc.co.uk/sport/football/articles/c1mn5ylp4eko"}