{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:44:17", "date_modify": "2025-04-26 03:44:17", "date_publish": "2025-03-05 07:31:24", "description": "Liverpool transfer rumours: Rafael Leao, Jamie Gittens, Milos Kerkez, Darwin Nunez, Konstantinos Koulierakis", "filename": "sport_football_articles_cqjdqpqj518o_1745639057.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c043/live/ecb3f520-0913-11ef-82e8-cd354766a224.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cqjdqpqj518o_1745639057.html", "title": "Liverpool transfer rumours: Rafael Leao, Jamie Gittens, Milos Kerkez, Darwin Nunez, Konstantinos Koulierakis", "title_page": "Liverpool transfer rumours: Rafael Leao, Jamie Gittens, Milos Kerkez, Darwin Nunez, Konstantinos Koulierakis - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Liverpool are considering an approach for Portugal international Rafael Leao, 25, but the AC Milan forward is also wanted by Barcelona. (Teamtalk), external\nMeanwhile, the Reds are also interested in Borussia Dortmund's English winger Jamie Gittens, 20,with Chelsea, Manchester United and Tottenham also monitoring his situation. (Sky Germany - in German), external\nAt the back, Liverpool want Wolfsburg's Konstantinos Koulierakis, 21, but could face competition from Crystal Palace and Aston Villa for the Greece defender. (Caught Offside), external\nMilos Kerkez, 21, is expected to leave Bournemouth for a new challenge in the summer with the Reds keeping an eye on the Hungary left-back. (Fabrizio Romano), external\nFinally, Uruguay striker Darwin Nunez, 25, told Liverpool he was unhappy and wanted to leave in January but a switch to Saudi Pro League club Al-Hilal was blocked. (Football Insider), external\nWant more transfer stories? Read Wednesday's full gossip column", "url": "https://www.bbc.co.uk/sport/football/articles/cqjdqpqj518o"}