{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:11:43", "date_modify": "2025-05-19 15:11:43", "date_publish": "2017-07-04 16:13:23", "description": "Northern Ireland's netball team qualify for next year's Commonwealth Games after moving up to 10th in the world rankings.", "filename": "sport_netball_40497809_1747667503.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/11576/production/_96803017_nicele.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_netball_40497809_1747667503.html", "title": "Northern Ireland netballers secure Commonwealth Games qualification", "title_page": "Northern Ireland netballers secure Commonwealth Games qualification - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Northern Ireland's netball team have qualified for next year's Commonwealth Games in Australia.\nThe latest world rankings published on Tuesday saw Northern Ireland move up to 10th and inside the necessary top-12 position for Gold Coast qualification.\nVictory in the recent Quad Series in Lisburn against Barbados, Singapore and the Republic of Ireland helped ensure Northern Ireland's qualification.\nScotland also squeezed in as 12th qualifiers as Trinidad missed out.\nQualification confirmation came as a great relief to the Northern Ireland players with captain Caroline O'Hanlon admitting they had had an \"incredibly nervous wait\".\n\"There was great euphoria after beating Barbados in the Quad Series final and at least we knew we'd done all we could by winning that tournament but nobody was counting chickens,\" said the Armagh woman.\n\"We weren't just sure how the maths would work out when everything was factored in so hearing we've made it is a massive relief and breaking into the top 10 is the icing on the cake.\n\"The Commonwealths are the pinnacle for any netballer and after such a memorable experience at Glasgow 2014 we're delighted to be heading to Gold Coast next April.\"", "url": "https://www.bbc.com/sport/netball/40497809"}