{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:56:35", "date_modify": "2025-05-21 07:56:35", "date_publish": "2025-03-27 20:55:02", "description": "The NBA is looking into launching a 16-team European league with Fiba, the world governing body.", "filename": "sport_basketball_articles_clyd7l9q1xeo_1747814195.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3791/live/bae7ede0-0b4b-11f0-a1c6-cb97db47e74f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_basketball_articles_clyd7l9q1xeo_1747814195.html", "title": "NBA looks into starting European basketball league", "title_page": "NBA looks into starting European basketball league - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The NBA is looking into launching a new European league with Fiba, basketball's world governing body.\nThe initial plan is for a 16-team men's league, with 12 permanent teams and four who would have to qualify each year.\nThe NBA said: \"Under the plan being explored, the new league would be integrated into the current European basketball landscape, with teams also participating in their respective national leagues.\"\nThe NBA is the top league in the world, comprising teams from the US and Canada.\nEurope's best teams currently compete in the EuroLeague, which was started by Fiba but has been run by Euroleague Basketball since 2000.\nNBA commissioner Adam Silver said: \"We feel now is the time to move to that next stage.\n\"At our board meeting today there was enthusiastic support from our club owners about continuing to explore this opportunity.\"\nHe added \"literally nothing\" has been agreed, and did not say which teams may be involved.\nBut Fiba secretary general Andreas Zaglkis said there was \"untapped potential in European club basketball\".\nThe three most successful EuroLeague teams are Real Madrid, CSKA Moscow and current champions Panathinaikos.\nThe United Kingdom does not have any teams playing in it.\n\"In some cases what comes with those existing clubs are huge global brands,\" Silver said.\n\"In some cases those brands built through global soccer, not basketball, but we recognise there is a tremendous depth of interest in people rooting for those clubs, so that becomes very relevant as well.\"\nSilver added that games would be the European standard of 40 minutes, not 48 minutes like the NBA.", "url": "https://www.bbc.com/sport/basketball/articles/clyd7l9q1xeo"}