{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:33:13", "date_modify": "2025-04-26 06:33:13", "date_publish": "2025-02-27 07:21:58", "description": "Graeme McDowell says \"everyone is very optimistic\" about the future of golf amid ongoing talks between rival tours over bringing the game back together.", "filename": "sport_golf_articles_ce8vje3ldypo_1745649193.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8dce/live/60dd5330-f377-11ef-958e-8b9bf28c4572.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_golf_articles_ce8vje3ldypo_1745649193.html", "title": "Graeme McDowell upbeat on golf's future amid ongoing PGA Tour-LIV Golf talks", "title_page": "Graeme McDowell upbeat on golf's future amid ongoing PGA Tour-LIV Golf talks - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Former US Open champion Graeme McDowell says \"everyone is very optimistic\" about the future of golf amid ongoing talks between rival tours over bringing the game back together.\nLast week, the PGA Tour held \"constructive\" talks with LIV Golf and United States president Donald Trump over the \"reunification\" of the men's professional game.\nThe PGA Tour and DP World Tour first agreed a shock merger with LIV Golf's backers, the Saudi Public Investment Fund (PIF), in June 2023, but McDowell believes \"we're starting to turn the corner\".\n\"I'm really excited that things are going on to try and repair the damage that's been done and bring the best players in the world back together more often,\" the former world number four told BBC Sport NI.\n\"That's the key really, for the fans, for the sponsors and for TV, having the best players in the world coming together more often I think is something we all want.\n\"What that means and what that looks like is something we don't know but I think everyone is very optimistic and hopefully the future of golf is bright.\"\nThree-time Ryder Cup winner McDowell has been part of the LIV circuit since its formation in 2022.\nHaving been re-signed by Brooks Koepka's Smash GC team, one of the Northern Irishman's key objectives this year is to qualify for the Open Championship, which returns to Royal Portrush in July.\nMcDowell was the only player from Northern Ireland to make the cut when his home town staged the Open in 2019.\nThe 45-year-old's lifelong association with Royal Portrush has been strengthened further after a hole on the Valley Links course was named after him, which he said was a \"great honour\".\nIn terms of the Open, McDowell has several opportunities to secure his place in this year's field, starting with the International Series Macau on the Asian Tour in March, which has three qualifying spots up for grabs.\n\"It's extremely important to me [to qualify],\" said McDowell, whose last professional win came in February 2020.\n\"I've got a busy enough six months coming up but the major championships remain the most important events in the world.\n\"I've done all I can in the past three or four years to qualify for the Open and the US Open via the different routes and with the Open being at Portrush this year, it cranks up the intensity a little bit higher for me.\n\"I'm looking all over the world to see where there might be an opportunity and trying to go that extra mile to try and get into that tournament.\"", "url": "https://www.bbc.co.uk/sport/golf/articles/ce8vje3ldypo"}