{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:09:40", "date_modify": "2025-05-21 07:09:40", "date_publish": "2025-03-30 11:33:41", "description": "'Absolutely no way Rangers win that game under Philippe Clement'", "filename": "sport_articles_c8jelpzk2k7o_1747811380.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2ab8/live/4ccac460-f451-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c8jelpzk2k7o_1747811380.html", "title": "'Absolutely no way Rangers win that game under Philippe Clement'", "title_page": "'Absolutely no way Rangers win that game under Philippe Clement' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Rangers fans, we asked for your views after that dramatic win at Dens Park on Saturday.\nHere's what some of you had to say:\nWilliam: Difficult game to watch as a Rangers supporter, far too many errors, however what an exciting match! I feel Cyriel Dessers is unfairly criticised by Rangers fans as he gives 100% every game. Jack Butland has to go as he makes far too many errors for a Rangers goalie.\nMurray: Have to give credit to Barry Ferguson for making the changes but this team is a mess. I thought maybe Barry should get the job but not so sure now.\nRonnie: Incredible game, incredible result. Absolutely no way Rangers win that game under Philippe Clement. Barry rang the changes and the players rolled their sleeves up. Our three goals in the second half were brilliant. Yes defensively we were shocking and Dessers remains an enigma but we won the game and that's the main thing. Give Barry the job, he has us fighting for the jersey once again.\nSue: Rangers could easily have lost the game but somehow won it in a thrilling match. Butland proves yet again why he was never good enough at the top tier of football with a basic goalkeeping mistake plus he continues to slice the ball into touch when kicking out from his box. Ridvan Yilmaz's performance was laughable it was that bad. Credit to Dessers for his resilience but not the top striker that Rangers need.\nPeter: Here's a simple tactical change, play the first third of the game like you play last third. Get that urgency and effort on the go as soon as the first whistle blows. Stop continually going on the back foot through complacency early doors. Simple! You can do it lads.\nIan: We will continue to have these rollercoaster games as the defence is a shambles. We have players like James Tavernier, Jefte and Yilmaz who are soft and cannot defend, John Souttar is our only decent centre-half. These players will ensure Barry will not be manager.", "url": "https://www.bbc.com/sport/articles/c8jelpzk2k7o"}