{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:10:59", "date_modify": "2025-04-26 04:10:59", "date_publish": "2025-03-04 19:23:40", "description": "Arne Slot press conference: Paris St-Germain vs Liverpool preview", "filename": "sport_football_articles_cz61g3y3zj7o_1745640659.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a528/live/b7d03a00-4921-11ef-9e1c-3b4a473456a6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cz61g3y3zj7o_1745640659.html", "title": "Arne Slot press conference: Paris St-Germain vs Liverpool preview", "title_page": "Arne Slot press conference: Paris St-Germain vs Liverpool preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Cody Gakpo has travelled with the squad but Slot said he will be assessed before Wednesday's game: \"He was close to being ready to play again, but unfortunately on Monday he had to block a shot and felt a bit of pain again. We will judge how he is on Wednesday and if he can be part of the squad, but it will be a close call.\"\nAsked about the written reasons for his two-match touchline ban, stemming from his red card after the draw against Everton, being published by the Football Association on Tuesday: \"The moment it happened, I was quite emotional. I chose to go on the pitch instead of staying calm, staying inside and then talking to Michael [Oliver, referee]. Now, I don't have those same emotions any more so I think I should set a better example than I set back then and not go into the situation again.\"\nSlot said he sees PSG as \"one of the strongest teams in Europe\" and added: \"It's a great fixture to look forward to for everyone who loves football. Both teams have scored so many goals this season. They have quite similar playing styles.\"\nHe continued: \"Luis Enrique has done a lot of things really well over the past one and a half seasons. I assume he is happy with what he has created, not only a team performance but also individual performances. The quality [Ousmane] Dembele brings to the team is impressive. It's clear he's done a great job. They got to the Champions League semi-final last season and, in my opinion, this team is better than the one he managed last season.\"\nOn whether Liverpool are the best team in Europe: \"It's a nice compliment to get, but the best team in Europe has to win the Champions League and we are far away from that, starting with a difficult game tomorrow.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cz61g3y3zj7o"}