{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:42:04", "date_modify": "2025-05-20 14:42:04", "date_publish": "2023-07-28 08:37:18", "description": "Bury boss Andy Welsh says the club's competitive return to Gigg Lane is a chance to reunite the town.", "filename": "sport_football_66328285_1747752124.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/960F/production/_130551483_whatsappimage2023-07-27at16.55.58-1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66328285_1747752124.html", "title": "Bury: Competitive Gigg Lane return a chance to reunite town, says boss Andy Welsh", "title_page": "Bury: Competitive Gigg Lane return a chance to reunite town, says boss Andy Welsh - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Bury boss Andy Welsh says the club's competitive return to Gigg Lane is a chance to reunite the town.\nThe Shakers take on Glossop North End on Saturday in their first league game at their home ground since they were expelled by the English Football League in August 2019.\nPhoenix club Bury AFC and Bury FC were reunited in May 2023.\n\"It's going to be an emotional day for everybody involved,\" Welsh told BBC Radio Manchester.\n\"My job is to make sure everyone's emotions on the pitch and in the stands come together to bring an energy that means we're fighting for every ball and running ourselves into the ground.\"\nSince their expulsion, Bury FC did not play while Bury AFC entered the league pyramid at North West Counties Division One North level, eventually winning the division in their second season in existence.\nBury AFC finished fourth in the North West Counties Premier Division - the ninth tier of English football - last season.\nGigg Lane was brought back under the ownership of Bury fans in February 2022, 15 months after Bury FC entered administration, while a vote to merge the two clubs was eventually passed earlier this year.\nWelsh added: \"When anybody is feeling low about a result or performance or missed chance, the greater thought process for me as a manager, player and fan is that this club is back playing football.\n\"Everything needs to be put behind us and we need to look to the future, because this is going to be an immensely proud moment for everybody in the town that we've got the football club back.\"", "url": "https://www.bbc.com/sport/football/66328285"}