{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:07:19", "date_modify": "2025-05-21 07:07:19", "date_publish": "2025-01-22 15:14:52", "description": "Tottenham news: Opinion - 'Point the finger at Postecoglou or demand more from players?'", "filename": "sport_football_articles_cnvq15vgm2mo_1747811239.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d635/live/a97973f0-6e9b-11ef-b02d-c5f3b724a1ea.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cnvq15vgm2mo_1747811239.html", "title": "Opinion - 'Point the finger at Postecoglou or demand more from players?' - BBC Sport", "title_page": "Tottenham news: Opinion - 'Point the finger at Postecoglou or demand more from players?' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It is the manner in which Tottenham have been losing in that is concerning.\nThe backline has been really weak because of injuries and I do think that when they have their full line-up, they feel comfortable and confident in the game plan.\nAt the moment, there is Archie Gray trying his best, next to Djed Spence or Radu Dragusin and they are not able to play in the same way. These small changes can make you lose trust in what you are supposed to be doing.\nPostecoglou's body language also looks off. If you cast your mind back to when he first joined, he was very engaging in interviews and smiley. Now, he seems to have lost that character.\nThen there are the performances of his players. The least you can ask for when you are in a bad patch is for senior players to stand up and show leadership.\nCaptain Son Heung-min has not been great and neither has James Maddison. The big players of that squad, including Pape Sarr and Yves Bissouma, are not giving Postecoglou what he needs.\nInstead, he is relying on the younger players to give him the right attitude, so I am sure Postecoglou is disappointed.\nAt the beginning of the season, they looked really together - like they were having fun. That can easily slide away when things are not going so well, but it is actually when you need togetherness more than anything.\nWhy it has changed, I don't know. It could be down to a lack of confidence, perhaps if they are struggling to find a solution, or if they don't trust in the solution.\nDo we point the finger at Postecoglou? Or do we have to look at some of these players and demand more?\nYou cannot turn a blind eye to the results. The second leg of the Carabao Cup semi-final is quite far away, so if they do not get a result against Leicester, I am not sure he can hang on any longer.", "url": "https://www.bbc.com/sport/football/articles/cnvq15vgm2mo"}