{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:53:53", "date_modify": "2025-05-21 05:53:53", "date_publish": "2025-01-14 11:28:46", "description": "League Two promotion contenders Port Vale sign keeper Nathan Broome on loan from Championship side Swansea City.", "filename": "sport_football_articles_cx2pnd6n7gro_1747806833.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7a54/live/16eb4f50-d263-11ef-9dbb-9559c8b74d9b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cx2pnd6n7gro_1747806833.html", "title": "Nathan Broome: Port Vale sign Swansea City keeper on loan", "title_page": "Nathan Broome: Port Vale sign Swansea City keeper on loan - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Port Vale have made their fourth signing of the January transfer window by bringing in Swansea City goalkeeper Nathan Broome on loan for the rest of the season.\nThe 23-year-old Manchester-born England youth international follows the signing of Huddersfield Town left-back Jaheim Headley and teenage Crystal Palace loan striker Jemiah Umolu, who is also on loan for the second half of the campaign.\nDarren Moore's promotion-chasing League Two side also last week re-signed teenage midfielder Rhys Walters., external\nThe 19-year-old, who came through Vale's academy system, left at the end of last season when his contract expired, but he has now signed a three-and-a-half-year deal.\nConnor Ripley began the season as Vale's number one, but Ben Amos has kept goal for the past two matches.\n\"Nathan [Broome] is a goalkeeper with huge potential who already has experience in and around this level,\" said Moore. \"He will come in and immediately provide important competition for the goalkeeper position in Connor's absence.\n\"Once Connor returns from his paternity leave, he will take a number of weeks to get back to what we deem as match-ready, so having Nathan with us will prove vital for us as we progress into the second half of the campaign.\n\"We are all delighted to be welcoming Rhys [Walters] back to the club. He knows how well thought of he is here by the staff. We want him to see out the potential we all know he has. He will provide another option in the centre of the park.\n\"We're now looking forward to see Rhys work hard on the training ground to push for first-team football.\"\nVale, who were top of the table in early December, now sit fourth, 14 points behind leaders Walsall, having won just once in nine league games.\nAfter Saturday's postponement against Barrow, they are again scheduled to be at home this Saturday, against Newport County.", "url": "https://www.bbc.com/sport/football/articles/cx2pnd6n7gro"}