{"authors": ["Paul Grunill", "www.facebook.com"], "date_download": "2025-05-20 13:39:40", "date_modify": "2025-05-20 13:39:40", "date_publish": "2023-07-26 08:07:36", "description": "After Mark Wood's heroics for England, National Fast Bowling Academy coach Ian Pont says there will always be a 'need for speed' in cricket.", "filename": "sport_cricket_66300355_1747748380.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/158ED/production/_130510388_672bccc2-45e3-4593-b382-54f77b43224b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66300355_1747748380.html", "title": "Ian Pont: Coach at National Fast Bowling Academy on the benefits of raw pace", "title_page": "Ian Pont: Coach at National Fast Bowling Academy on the benefits of raw pace - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "One of the most thrilling aspects of this summer's Ashes series has been the sight of England fast bowler Mark Wood roaring in and shaking up Australia with deliveries clocked at well over 90mph.\nIt has evoked memories of some of the great names of the past 50 years, including Malcolm Marshall, Michael Holding, Dennis Lillee, Imran Khan, Waqar Younis and Allan Donald, and highlighted the extra dimension real pace can provide in terms of spectator entertainment.\nWhat are the reasons why some bowlers generate so much more speed than others? What are the additional stresses and strains bowling so quickly can put on the body?\nOne man who knows the answers to those, and other related questions, is Ian Pont, joint lead coach at the National Fast Bowling Academy (NFBA), based at Sawbridgeworth in Hertfordshire.\n\"The difference between (facing) 85 mph and 90mph is extraordinary,\" Pont told BBC Look East. \"The difference between 90mph and 95 is ridiculous.\n\"What speed does, providing you bowl it in the right place, is it unravels the world's best batting techniques.\"\nThe 61-year-old's playing career, which included spells with Essex and Nottinghamshire, lasted throughout the 1980s.\nBut he also had try-outs as a pitcher for Major League Baseball teams in the United States and tried his hand - and arm - at the javelin before turning to cricket coaching.\nA firm believer in biomechanics, he produced a book called The Fast Bowler's Bible in 2006 - \"It's not a Harry Potter novel but it's a really good read\", he told BBC Sport at the time.\nThe NFBA held its first winter sessions in 2018 with 68 bowlers in attendance, and that number is expected to be up to about 170 this year, and although the academy is not formally affiliated to the 18 first-class counties, its coaches are happy to work with their young seam bowling prospects.\n\"We set up the National Fast Bowlers Academy as a people's academy to give an opportunity to young fast bowlers, male or female, to come and get elite-level coaching which they may not normally have access to,\" Pont explained.\n\"The 18 first-class counties and minor counties do great work, but unless you are in that system, where do you get this expert coaching from?\"\nHe continued: \"We've currently got players on trial with first-class counties, playing second-team cricket, and we've already had two professionals from our group, so we are aiming to push people into first-class cricket where we can.\n\"We are five, 10 minutes from Stansted airport, we've got one player that flies in from Sweden to join us, we've had players from Denmark before now, we've had someone from Norway, so it truly is an international fast bowling academy.\"\nCath Dalton, who played for England A and later Ireland at international level, is another senior coach at the academy and believes recent advances in the women's game mean it is a great time for girls to look to improve their bowling skills.\n\"When I was under 11 (level), I didn't even know England Women had a cricket team,\" she said.\n\"Social media has changed that and we now have professional contracts in this country so we're seeing a real boom in women's cricket.\n\"We saw a fantastic (Women's) Ashes series. Hopefully we can keep encouraging girls to improve and go to the next level.\n\"We try to make sure every player that comes through our door, by the time they leave are a much better bowler, in terms of their biomechanics, their body movement, their action, that's really important when you're bowling fast.\n\"We're trying to make them faster and we upskill them with slower balls and yorkers. All the different variations.\n\"In the women's game, as well as the men's, we know how important it is to have variation.\"\nPont shares that view and has been excited to see Wood add some real fire to the England attack after being brought into the team for the third game of the Ashes series at Headingley.\n\"We saw the difference Mark Wood made as soon as he came into that England set-up. Australia were on the back foot and suddenly the game was completely different,\" he said.\n\"The way we have played our cricket - I know people hate this term Bazball, but we play this very aggressive, very positive, sometimes brilliant, sometimes brainless cricket, and that is so entertaining.\n\"The games are happening fast, they're over quickly, you can't switch the TV off and think it'll be the same in half an hour or an hour as it used to be back 30 years ago, the game moves so quickly and it's fun.\n\"Hopefully we're encouraging a new generation of cricketers to come to the fore.\"\nInterviews by BBC Look East's Jonathan Park", "url": "https://www.bbc.com/sport/cricket/66300355"}