{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:40:33", "date_modify": "2025-04-26 03:40:33", "date_publish": "2025-03-05 09:53:12", "description": "Newport County: Hat-trick hero Bobby Kamwa grateful for Nelson Jardim 'connection'", "filename": "sport_football_articles_cnvzmp6d8qdo_1745638833.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/461b/live/13474ec0-f98d-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cnvzmp6d8qdo_1745638833.html", "title": "Newport County: Hat-trick hero Bobby Kamwa grateful for Nelson Jardim 'connection'", "title_page": "Newport County: Hat-trick hero Bobby Kamwa grateful for Nelson Jardim 'connection' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Hat-trick hero Bobby Kamwa says he is grateful for his \"great connection\" with Newport County head coach Nelson Jardim.\nThe Cameroon-born forward joined the Exiles after leaving Burton Albion last summer and has featured in all but two of his side's 39 matches in all competitions this season.\nAnd the 24-year-old is thankful to Portuguese boss Jardim for sticking by him during his tougher spells in his debut campaign at Rodney Parade.\n\"It's been up and down but I've thoroughly enjoyed it,\" Kamwa said of his time at Newport so far.\n\"I'm going to give a special mention to the gaffer for sticking with me when things haven't gone well.\n\"I'm enjoying working with him. We've got a great connection and I try to repay the faith that he's put in me.\n\"The boys have been great with me and everyone works their socks off.\"\nKamwa netted three goals in the opening 30 minutes as Newport ended their three-game winless run by beating Gillingham 3-1 on Tuesday night.\nIt was the winger's second hat-trick of the season following his treble against MK Dons in December.\n\"Personally, I'm delighted. The team count on me and I've got a lot on my shoulders,\" he said.\n\"That's for me to prove to everyone that I can take the team forward and carry on helping the team to win games.\n\"Sometimes I can pull a lot of things out of my locker, so I'm buzzing.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cnvzmp6d8qdo"}