{"authors": ["Emma Smith", "www.facebook.com"], "date_download": "2025-05-20 11:43:02", "date_modify": "2025-05-20 11:43:02", "date_publish": "2023-08-06 16:16:15", "description": "The USA hoped to become the first team to win three successive Women's World Cup titles but made history of a very different kind.", "filename": "sport_football_66423211_1747741382.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1382D/production/_130671997_gettyimages-1596237275.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66423211_1747741382.html", "title": "Women's World Cup 2023: Why exit of holders USA was a predictable 'catastrophe'", "title_page": "Women's World Cup 2023: Why exit of holders USA was a predictable 'catastrophe' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The USA entered this Women's World Cup with the aim of becoming the first team to win it three times in succession.\nInstead, they failed to win even three matches at the tournament for the first time - a lacklustre performance culminating in an extraordinary and historic exit at the hands of Sweden on penalties.\nShock abounded even among the media ranks after the Americans' fate was sealed, a natural reaction when such a long-dominant team are dethroned.\nWorld champions in 2015. World champions in 2019. But now there is a new world order, and the USA will have to get used to it.\n\"A total disaster, to say the least,\" Ryan Tolmich, American soccer correspondent for Goal, told BBC Sport.\n\"I think most people here would have been totally stunned if they had actually won it, but going out so early is a historically bad result.\"\nIt is the first time the USA have finished a Women's World Cup lower than third place.\nTaking the Sweden game in isolation, it would be possible to think the USA were unfortunate. They dominated play, and were it not for Swedish keeper Zecira Musovic - player of the match with 11 saves - they would have progressed.\nThey could also point to the decisive penalty, scored by Sweden's Lina Hurtig. USA keeper Alyssa Naeher appeared to have clawed the ball away, however goal-line technology indicated it had just crossed the line. By millimetres, USA were out.\nBut they have not fallen short of expectations by millimetres. That gap is a chasm.\nIssues have included the tactics of head coach Vlatko Andonovski, whose direct football has attracted criticism for not getting the best out of the players available.\nHe switched formation from the 4-3-3 which produced unimpressive draws with Netherlands and Portugal to a 4-2-3-1 against Sweden, but it was too late. He is soon out of contract and seems unlikely to get another.\nThe USA have also been rocked by injuries to key players, with those affected including captain Becky Sauerbrunn, creative force Catarina Macario plus strikers Mallory Swanson and Christen Press.\nThere is also the issue of a generation of older players on which Andonovski has been too reliant. The 38-year-old Megan Rapinoe's final act of her World Cup career - which has included her winning it twice - was to blast her penalty well over the bar.\n\"It's a catastrophe,\" Jonathan Tannenwald of the Philadelphia Inquirer told the BBC's World Football Podcast. \"Obviously Andonovski will lose his job - he's out of contract anyway.\n\"The funny thing is, Andonovski was hired to have a generational overhaul, but the timing of the pandemic and the Olympics [Tokyo 2021] were a hindrance, he never got to take it all the way. Now, US Soccer are really going to have to clean house - they have an Olympics next year, [they are] possibly hosting the next World Cup, you don't want to stand around.\"\nInjuries led to square pegs in round holes, but the bigger problem was a lack of coherence. The front three of Sophia Smith, Trinity Rodman and Alex Morgan are among the greatest individual players in the world, but they never convinced as a working attacking unit.\n\"The USA is very much an imperfect team from front to bottom,\" said Tolmich. \"Their centre-back pool is weak, which means Julie Ertz drops back from midfield. Then, the midfield becomes weak. And then the attack has totally not been in sync, not finishing chances created through pure talent, but also not creating much else through actual good play.\n\"I don't think anyone who has followed along would say it's been a surprise to see them show some weaknesses, but I think everyone is surprised at just how bad it's been.\n\"The casual American fan that only watches big tournaments is confused, but this team is one that is missing up to five starters due to injury, and they are struggling to overcome that.\"\nIndeed, the fans are only now starting to get used to the USA's new straitened circumstances.\nTwo who were at Melbourne Rectangular Stadium on Sunday night, Esaam and Sonya, had rushed over from Orlando, Florida, on a 15-hour flight after realising they could miss out on seeing the USA play at this World Cup.\n\"We thought they were going to waltz right through to the final, so we were starting our trip in Auckland on 10 August,\" Esaam said.\n\"Then when we saw how poorly they were doing, we thought we should start our trip right now or we might not see them.\n\"We should have known, the world has caught up.\"\nAmerica and Kat from Portland, Oregon had been following the USA throughout this World Cup and had their tickets booked for Sydney where they expected their team to be facing South Africa in the last 16.\nSo they \"were refreshing the page for an hour\" to get tickets for Melbourne after their team's unexpected second place in Group E.\n\"Women's sport has come really far. I think other countries are getting more experience,\" said America. \"I think they should have different tactical iterations, I don't know if we have seen many versions of this team.\"\nUltimately, this seismic shift had been coming. At the Tokyo Olympics in 2021, Sweden beat USA 3-0. The European side may have won in very different style and circumstances two years later - but the signs were there.\n\"Everybody knows the world has closed the gap,\" New York Times world editor Andrew Das told the BBC after the draw with Portugal.\n\"Things are not the same as they used to be, when the US would hang nine or 10 on teams routinely - they do not win like that any more. The US has not scored six goals in a game for two years, which is something they used to do quite often.\n\"The idea of being the best team in the world is something that motivates them, but it may not be based in reality any more. That's something they have to come to terms with.\"\nThe USA's exit from the 2023 Women's World Cup will go down in history. Just not the history they have been used to making.", "url": "https://www.bbc.com/sport/football/66423211"}