{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:26:19", "date_modify": "2025-05-21 06:26:19", "date_publish": "2025-04-01 10:12:44", "description": "Coventry midfielder Jamie Allen says the 3-1 loss at Sheffield United won't \"knock them back\" in the hunt for a play-off spot.", "filename": "sport_football_articles_cglxk613zk6o_1747808779.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ab18/live/b4049ac0-0edc-11f0-991b-c5d1a973d814.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cglxk613zk6o_1747808779.html", "title": "Coventry City: Jamie Allen", "title_page": "Coventry City: Jamie Allen - Not easy to win 10 of 13 in Championship - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Coventry City midfielder Jamie Allen says their 3-1 loss at Sheffield United won't \"knock them back\" in the hunt for a play-off spot.\nThe Sky Blues have been on an excellent run of form - picking up 30 points from the last 39 available - and still remain fifth, two points clear in the top six after West Bromwich Albion and Bristol City also lost at the weekend.\n\"We've won 10 out of 13, it's not easy to do that in the Championship,\" Allen told BBC CWR.\n\"We just need to forget about this quickly now and focus on next Saturday.\"\nFrank Lampard's side face another tough test next when they welcome a Burnley side who are unbeaten in 26 games and have only conceded five goals in that time.\n\"We want to win every game, we know how hard this league is, it's tough every game you go into,\" Allen said.\n\"But we have the confidence we can win at any point so hopefully we have a good week's training and go again on Saturday.\n\"Hopefully we score a bit earlier and put a bit of pressure on them.\"\nThe 30-year-old has started the past two games and captained the side at Bramall Lane after being among the substitutes in the previous six matches.\n\"I always enjoy playing football, I'm there whenever the manager needs me and I'll try and do the best I can,\" he added.", "url": "https://www.bbc.com/sport/football/articles/cglxk613zk6o"}