{"authors": ["Peter Crutchley", "www.facebook.com"], "date_download": "2025-05-19 15:08:59", "date_modify": "2025-05-19 15:08:59", "date_publish": "2012-05-16 15:38:46", "description": "An insight into why riders are prepared to risk their lives in motorbike road racing", "filename": "sport_northern-ireland_18074816_1747667339.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/60281000/jpg/_60281412_cameron_donald.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_northern-ireland_18074816_1747667339.html", "title": "Inside the mind of the road racer", "title_page": "Inside the mind of the road racer - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "What is it that makes motorbike racers willing to risk their lives competing at speeds of over 200mph on public roads?\nThe North West 200 is Ireland's largest outdoor sporting event, attracting huge crowds as well as the biggest names in the sport to the north Antrim coast every May.\nFor local rider Michael Dunlop, a maiden victory at the event in 2008 should have been a moment of absolute elation, fulfilling a long held ambition.\nInstead he collapsed onto the track in tears. Michael had lost his father Robert Dunlop, killed in a crash at the same event a little over 36 hours previously.\nMichael had also lost his uncle, road racing legend Joey Dunlop in a racing tragedy in 2000. As he stood on the winners' podium, spectators and journalists alike marvelled at his courage and mental strength.\nBill Cole, a world-renowned peak performance coach based in California, has worked across more than 75 different sports, but he considers road racing to have unique mental demands.\n\"A motorcycle racer might be injured, maimed or killed while competing. It is this willingness to flirt with potential life-altering events, on the razor's edge, that distinguishes racers,\" he said.\nRoad racers would appear to be a different breed mentally. In psychological terms they are considered \"sensation seekers\".\n\"Riders love stressful activities for the release of epinephrine (adrenaline) and endorphins,\" Cole said.\nGuy Martin, who is racing at this year's North West 200, is philosophical about the risks involved in the sport and he feels the danger factor goes some way to explaining its popularity.\n\"We all know it's a dangerous sport and we accept that. Probably the danger element is the reason I do it - I like the buzz.\"\nSports psychologist Craig Mahoney, who has worked with competitors in a host of UK sports, considers that some of the traits that make an elite rider are innate and therefore self-selecting.\n\"People won't enter the sport in the first place if they have a fear of hurting themselves or a fear of dying,\" he said.\nThe riders who reach elite level are those who have been able to separate themselves from the realisation they may die, something that requires an unshakeable personal belief that they are outstanding riders.\nMahoney feels that Michael Dunlop's capacity to race at the highest level after the loss of his father was in part down to his ability to use the tragedy to motivate himself.\nWithin the motorbike fraternity, road racing is considered particularly daunting. Riders take a different approach on purpose-built circuits compared to roads where there is not the same margin for error.\nDespite the numerous safety procedures event organisers have put in place, the simple fact that trees and hedges are immovable objects, which the riders flash past at 200mph, means accidents, when they do happen, can be very serious.\nCurrent rider Michael Rutter provides an interesting perspective on this.\n\"When I take part in road racing I always leave a safety margin, I ride at 80%, whereas on circuits I never hold back.\"\nAs riders get older, start families and experience accidents, does their mental approach to racing change?\nVeteran rider Steve Plater regards injuries as an acceptable consequence of the sport. He endured more than 150 crashes during his career, of varying degrees of severity.\n\"I think a racer believes he is never going to crash. You have to just concentrate on doing the perfect race, the perfect lap, keeping your mind 100% focused,\" said Plater.\nSports psychologist Craig Mahoney feels that some riders become more cautious with age and start to consider the impact an injury or fatality would have on people around them.\nMultiple North West 200 winner Phillip McCallen was renowned throughout his career for having a fearless approach to road racing. He is now rider liaison officer at the North West 200, educating first-time riders and providing safety guidance on test drives around the nine mile circuit.\n\"My wife and I decided that there would be no family until I stopped racing so I suppose deep down we must have thought there was a risk,\" said McCallen.\nWhile mental strength and self-belief are clearly key components of a biker's make-up, superstition can also play a part.\nRoad racing icon Joey Dunlop always wore a red t-shirt and yellow crash helmet when competing.\nCarl Fogarty insists it was the \"luck of the Irish\" that helped him break his North West 200 hoodoo in 1993. Prior to then Fogarty had always endured bad luck at the event, but this changed when he heeded advice and wore something green on race day.\n\"I put a green vest under my leathers and won two races and broke the lap record. So I wore that vest in every race for the rest of my career and had to be cut out of it in 2000 when I crashed in Australia. But I had the vest stitched together and it is now mounted on the wall in my kitchen.\"\nFogarty is not surprised by the event's popularity and reflects on his years road racing in Ireland as the happiest period of his career.\n\"The North West 200 ticks all the boxes - a fantastic atmosphere, people are very friendly, crowds can get so close to the action,\" he said.\nWhen the crowds gather at the North West 200, almost close enough to touch the competitors with their programmes, the riders will be focused on one aim.\nAs Phillip McCallen said: \"My job was to win races. When I did that there was no greater feeling in the world.\"", "url": "https://www.bbc.com/sport/northern-ireland/18074816"}