{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:48:26", "date_modify": "2025-05-21 06:48:26", "date_publish": "2025-03-28 21:49:37", "description": "Barry win to boost play-off hopes and dent Newtown survival bid", "filename": "sport_football_articles_c20d01z8relo_1747810106.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/870c/live/c00c5130-0c13-11f0-a9ec-f38dd40b0146.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c20d01z8relo_1747810106.html", "title": "Barry win to boost play-off hopes and dent Newtown survival bid", "title_page": "Barry win to boost play-off hopes and dent Newtown survival bid - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Saturday, 29 March\nBala Town 0-0 Cardiff Met: Neither side managed to break the deadlock at Maes Tegid with Bala keeper Joel Torrance making a crucial save to deny Met's Lewis Rees late on. Bala's Dan Malone had already received his second yellow card of the game and was sent-off with nine minutes remaining.\nHaverfordwest County 1-1 Caernarfon Town: Honours ended even between the two sides battling for third spot. Ben Ahmun header from a corner seven minutes after the break put County ahead but Louis Lloyd levelled from the penalty spot two minutes later after he was fouled in the area. County remain third, five points ahead of Caernarfon.\nPenybont 1-0 The New Saints: Penybont sealed runners-up spot in the Cymru Premier after victory against already crowned champions The New Saints. Rhys Griffiths' team earned their second win of the season over Saints courtesy of James Crole's goal 17 minutes from time.\nFriday, 28 March\nBarry Town United 2-0 Newtown: Barry are top of the Play-Off Conference after a comfortable win over struggling Newtown, who are three points from safety in the relegation zone. Barry top scorer Ollie Hulbert gave the hosts the lead with a fine header from Owen Cuddihy's cross after 18 minutes. Their lead was doubled early in the second half when James Rainbird put the ball in his own net from another dangerous Cuddihy cross. Aaron Williams pulled a goal back in the final minute but it was too little too late for Callum McKenzie's side.\nAberystwyth Town 1-2 Flint Town United: Flint secured their Cymru Premier status for next season with victory against already relegated Aberystwyth. Ben Wynne and Elliott Reeves put Lee Fowler's side firmly in control before Niall Flint pulled a goal back for the hosts from the penalty spot with three minutes remaining.\nSaturday, 29 March\nBriton Ferry Llansawel 1-0 Connah's Quay Nomads: Ferry earned a crucial win and edged closer to retaining their Cymru Premier status while and damaging Nomads' play-off hopes. Substitute Luke Bowen scored with his first touch for the only goal of the game with 18 minutes remaining to put Andy Dyer's side six points clear of the relegation zone with two games remaining.", "url": "https://www.bbc.com/sport/football/articles/c20d01z8relo"}