{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:52:25", "date_modify": "2025-05-21 05:52:25", "date_publish": "2025-01-26 00:00:00", "description": "Manchester United moved to 12th in the Premier League after edging to a 1-0 win at Fulham.", "filename": "sport_football_live_c4gwe5qxq29t_1747806745.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c4gwe5qxq29t_1747806745.html", "title": "Fulham 0-1 Man Utd: Martinez's deflected strike gives visitors win in Premier League", "title_page": "Fulham 0-1 Man Utd: Martinez's deflected strike gives visitors win in Premier League - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Post\nTime for us to end it there.\nYou can read Gary Rose's report as Manchester United pick up a big three points away at Fulham.\nHere's some other things for you to read/challenge yourself with:\nPostecoglou unsure on future - but why do many Spurs fans blame Levy?\n'Never doubt Bryan' - Mbeumo 'Premier League's best' penalty taker\nWill Premier League get extra Champions League spot?\nWeekly football quiz: How did Arteta react to Lewis-Skelly red?\nYour next live football fix is on Monday evening and comes at the top of the Championship with Burnley hosting Leeds.\nWe'll be back during Monday with more Premier League reaction and build-up to the week's European action, plus all the latest transfer news as we enter the final week of the January window.\nIn a bit.\n'Tough to take'\nFT: Fulham 0-1 Man Utd\nFulham\nFulham boss Marco Silva, speaking to MOTD 2: \"It's a tough one to take. We were better than them and the dominant team. Or pressure was good, our reaction was good. Second half was a bit more balanced Our pressure wasn't so intense like the first half.\n\"A real lucky goal for them gave them the lead but our reaction was good. We had a good chance from a corner and a clearance on the line. We should have taken more from the game and we deserved more from the game.\n\"For Fulham nothing is easy and we need to work hard to get the luck our way.\"\n'We deserved more'\nFT: Fulham 0-1 Man Utd\nFulham\nFulham boss Marco Silva, speaking to TNT Sports: \"Frustration really with the result.\n\"Overall, in the game we deserved more and should have taken more from the game.\n\"One shot on target from Man Utd - a lucky deflection.\n\"We were the team that dominated more. We had two or three good moments to score, but I don't remember one dangerous moment from Man Utd.\n\"In the first half we were the better team, but in the second half it was more balanced.\n\"The game was a bit more balanced, and I wanted us to get on the front foot - a really lucky goal from them.\n\"After that, the reaction had to come from us, and they sat back with 10 players around the box.\n\"The level we are playing at we have to be clinical - if we don't, it is going to be difficult to win.\n\"It was not a good night for our attacking players. Let's hope in the next game it will be better.\"\nOn Harry Wilson's being injured: \"I don't know how long it's going to be. It was an impact [injury].\"\n'You need a bit of luck in football'\nFT: Fulham 0-1 Man Utd\nFulham\nFulham's Calvin Bassey, speaking to TNT Sports: \"I thought we deserved more. We controlled the game and it wasn't our day.\n\"You need a bit of luck in football and it didn't come our way today.\n\"We had a lot of chances, maybe in the final part at the end could have been better.\n\"They didn't create too much to trouble us. We were aware of their quality.\n\"I felt like we didn't create that much, clear chances.\"\n'After two months at Man Utd...I'm 50!'\nFT: Fulham 0-1 Man Utd\nManchester United\nManchester Untied boss Ruben Amorim to MOTD 2: \"That feeling of winning and three points is really important for us. You cannot see a great improvement in the team and that is a fact. But to win helps us to improve. We've had some lack of luck in some games. Today, was not the best match but we managed to win.\n\"The important thing is I have a clear idea of what I want to do. Sometimes I'm frustrated. We want to play a different style and we are going to play different style in the future.\"\nOn Harry Maguire: \"When we defend a little bit lower it's really good on Harry - he doesn't have to cover a lot of space.\"\nOn Toby Collyer's clearance off the line: \"He did it in practice one time. Toby saved our team today.\"\nOn turning 40 on Monday: \"It's not 40...I'm 50! After two months at Manchester United it's 50. It's a privilege to spend my 40th birthday here.\"\n'We need to improve a lot'\nFT: Fulham 0-1 Man Utd\nManchester United\nManchester United's Ruben Amorim, speaking to TNT Sports: \"Really important to have this feeling away from home. Great support from our away fans. Not a great game and no great chances.\n\"We tried to play our game, but we need to improve a lot. We hold the result in the end, and we closed the game - it is really important to win now.\"\nOn the clean sheet: \"Really important because clearly you are closer to winning games, and it gives you confidence. We didn't suffer too much today and that is a good sign. We scored, and we move onto the next game.\"\nOn Man Utd lacking goals: \"I think so, even in the second half we changed things and we lack some pace and power in front, but it is what it is. We need to have more ball to have more chances. We struggle a lot in these details. Winning helps us a lot to improve.\"\nOn the win helping morale: \"Let's take the feeling, but work really hard tomorrow - we need to win the next one.\"\nOn the transfer window: \"We have to cautious. The rules here and you know that we have to follow the rules, we have made mistakes in the past and we cannot do it now.\"\nOn away supporters: \"They deserve it. It is amazing and it is not normal. I know you guys are used to this environment here, but it is not normal. It is a big privilege to win for this club and give them wins. We want to give them wins and today we did it.\"\n'I was lucky'\nFT: Fulham 0-1 Man Utd\nManchester United\nMan Utd goalscorer Lisandro Martinez, speaking to TNT Sports: \"I think I was lucky, but an important win.\n\"I am happy with the way we won the game. It doesn't matter who scores - the most important is the three points.\n\"I am so happy because of this guy [Toby Collyer]. This guy is a big example for the young generation.\n\"He his working so hard everyday and he is so humble.\n\"It means a lot. Not only to the fans, but for us because we have suffered a lot.\n\"It is a hard win, this club the pressure is hard, but we are here. We know how difficult it is. Even a game like today we have to win and be humble after winning.\"", "url": "https://www.bbc.com/sport/football/live/c4gwe5qxq29t"}