{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:35:54", "date_modify": "2025-05-20 12:35:54", "date_publish": "2023-08-04 07:57:11", "description": "Fifa is investigating an official complaint that Zambia head coach Bruce Mwape sexually assaulted a player at the Women's World Cup.", "filename": "sport_football_66403292_1747744554.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/10DC8/production/_130646096_gettyimages-1582272089.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66403292_1747744554.html", "title": "Bruce Mwape: Fifa looking into official sexual misconduct complaint against Zambia head coach", "title_page": "Bruce Mwape: Fifa looking into official sexual misconduct complaint against Zambia head coach - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Fifa is investigating an official complaint that Zambia head coach Bruce Mwape sexually assaulted a player at the Women's World Cup.\nMwape is accused of rubbing his hands over the chest of one of his players during a training session in New Zealand on 29 July.\n\"A complaint has been received,\" a Fifa spokesperson said.\nBut the Football Association of Zambia (FAZ) said \"it has not received any such complaint\" and it is a \"surprise\".\nThe alleged incident is said to have taken place during a training session two days before their final group match against Costa Rica, which Zambia won 3-1 for their first victory at a World Cup.\nFifa's spokesperson added: \"Fifa takes any allegation of misconduct extremely seriously and has a clear process in place for anyone in football who wants to report an incident.\"\nZambia have returned home, having been eliminated after finishing third in Group C.\n\"All the training sessions for the Copper Queens [Zambia] were filmed by the FAZ media team and offers no such footage,\" the FAZ said.\n\"Additionally, a Fifa film crew attached to the Zambian team at the World Cup was present at all training sessions.\n\"We, however, wish to reassure the public that FAZ maintains the highest standards of integrity and transparency and always demands unwavering ethical conduct of the players and officials on and off the field of play.\n\"We therefore would not hesitate to take disciplinary measures and act on any misconduct once we are in receipt of an official complaint or when presented with evidence pertaining to an alleged incident.\"\nA New Zealand police spokesperson said: \"We were made aware of an alleged incident and after making initial enquiries, no further action was required to be taken.\"\nSexual abuse allegations against Mwape, who took charge in 2018, also emerged last year on social media. The FAZ said at the time that it had received no official complaint, but had opened an investigation, adding that \"we consider these allegations very serious\".\nMwape was repeatedly asked about those allegations at the World Cup but he denied any wrongdoing and insisted they were \"fake\".", "url": "https://www.bbc.com/sport/football/66403292"}