{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:15:14", "date_modify": "2025-05-21 07:15:14", "date_publish": "2025-03-29 07:17:42", "description": "Katie Taylor expects the winner of the Mikaela Mayer and Sandy Ryan rematch on Saturday to be decided by who makes the better adjustments.", "filename": "sport_boxing_articles_c86p6jw087qo_1747811714.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c9d4/live/ae354ec0-0cd2-11f0-9025-f3e7e963b60e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_boxing_articles_c86p6jw087qo_1747811714.html", "title": "Mikaela Mayer vs Sandy Ryan: Katie Taylor gives rematch prediction", "title_page": "Mikaela Mayer vs Sandy Ryan: Katie Taylor gives rematch prediction - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Irish superstar Katie Taylor expects Mikaela Mayer and Sandy Ryan to deliver another competitive fight and feels the fighter who makes the better adjustments will win Saturday's world title bout in Las Vegas.\nBriton Ryan has an opportunity to settle the score and regain the WBO welterweight title after she was outpointed by American Mayer, 34, in New York in September.\nThe fight was marred by Derby's Ryan, 31, being hit with red paint before leaving for the venue.\n\"The last fight was touch and go could have gone either way. Mikaela probably did deserve to win the fight maybe, but it was a very close fight,\" Taylor told the BBC 5 Live Boxing with Steve Bunce podcast.\nShe added: \"I think Sandy has had an amazing training camp this time, it's night and day between this training camp and the last training camp.\n\"I think that's going to make a huge difference going into this fight, she's in a much better place mentally.\n\"Mikaela is a super fighter too. I don't know who is going to win this fight. It's about who will make those adjustments.\"", "url": "https://www.bbc.com/sport/boxing/articles/c86p6jw087qo"}