{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:16:57", "date_modify": "2025-05-21 05:16:57", "date_publish": "2025-01-27 10:16:07", "description": "Tysie Gallagher's scheduled defence of her British and Commonwealth titles is postponed following the death of her partner's mother.", "filename": "sport_boxing_articles_crkeje8jgp5o_1747804617.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5154/live/8ab22a50-dc93-11ef-ad9c-6bfba0246f34.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_boxing_articles_crkeje8jgp5o_1747804617.html", "title": "Tysie Gallagher: Title defence put back after death of partner's mother", "title_page": "Tysie Gallagher: Title defence put back after death of partner's mother - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tysie Gallagher's scheduled defence of her British, Commonwealth and WBO international titles has been postponed following the death of her partner's mother.\nThe super-bantamweight from Luton was due to meet unbeaten Ebonie Jones on 7 February at Canon Medical Arena in Sheffield.\nBut the fight has been put back after Dianne Cleary was found dead at a house last week following what police described as \"an altercation\" in which another woman was injured.\nA 25-year-old man has been charged with her murder, and friends and family lit lanterns in her memory in the Lea Manor area of Luton at the weekend.\nIn a post on her Facebook page, Portsmouth boxer Jones said: \"Sometimes things in life are bigger than boxing and this is one of them.\n\"I just want to send my condolences to Tysie and her family at this moment.\"\nGallagher - whose partner Callum Cleary is a boxing coach - has a record of nine wins and two defeats since turning professional, and retained her titles by stopping Tori-Ellis Willetts in September.\nOn Sunday, she described Dianne Cleary as the \"most kind-hearted, caring, beautiful woman,\" on her Facebook page.\nShe added: \"The love and support from everybody speaks volumes for how many people's lives you touched and how much every single person who met you loved you so much.\"\nThe fight with Jones is now set to take place on 4 April in London.", "url": "https://www.bbc.com/sport/boxing/articles/crkeje8jgp5o"}