{"authors": ["Tom Mallows", "www.facebook.com"], "date_download": "2025-05-21 03:48:35", "date_modify": "2025-05-21 03:48:35", "date_publish": "2024-12-26 07:30:05", "description": "Australia Test debutant Sam Konstas hits a pulsating half-century on a thrilling opening day of the fourth Test against India.", "filename": "sport_cricket_articles_c4gp2jgyxxlo_1747799315.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c92a/live/5eabf000-c36e-11ef-aff0-072ce821b6ab.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c4gp2jgyxxlo_1747799315.html", "title": "Australia vs India: Sam Konstas hits half-century on debut to put hosts on top", "title_page": "Australia vs India: Sam Konstas hits half-century on debut to put hosts on top - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Teenager Sam Konstas hit a pulsating half-century on his Australia debut on a thrilling opening day of the fourth Test against India in Melbourne.\nThe 19-year-old opener, Australia men's youngest Test batting debutant since 1953, smashed 60 from 65 balls, featuring six fours and two sixes.\nKonstas was also involved in a heated confrontation with India's Virat Kohli, clashing shoulders with the India batter at the end of an over, before departing to a standing ovation after being trapped lbw by Ravindra Jadeja.\nFellow opener Usman Khawaja rediscovered his form, hitting a first half-century in 12 innings before departing for 57 after lunch.\nMarnus Labuschagne and Steve Smith then put on 83 for the fourth wicket as Australia pressed home their advantage in the evening session.\nBut Labuschagne's departure for 72 led to Australia losing three wickets for just nine runs, with the lively Bumrah removing Travis Head and Mitchell Marsh in quick succession.\nAkash Deep then took the late wicket of Alex Carey for 31 with the new ball, before the hosts closed out the day on 311-6.\nA crowd of more than 87,000 packed into the MCG for the traditional Boxing Day Test, which took place under cloudy skies but sweltering temperatures pushing close to 39 degrees.\nThe five-match series is level at 1-1, with both sides needing to win the series 3-1 to guarantee a place in the World Test Championship final.\nIt has been quite the rise for Konstas, who has only played 11 first-class matches and made his debut for New South Wales in 2023, less than two months after his 18th birthday.\nPitched straight into the action after skipper Pat Cummins won the toss and chose to bat, Konstas was engaged in a fascinating early battle with Bumrah, with the India pace bowler beating the bat four times in his first over.\nKonstas got off the mark at the start of Bumrah's second, before attempting a reverse ramp shot with just the 11th ball he had faced in Test cricket, much to the delight of the Melbourne crowd.\nThe teenager continued to show no fear, ramping Bumrah for four, six, four in the same over and attempting to charge Mohammed Siraj, prompting some choice words and a fiery stare from the India quick.\nHe then clashed shoulders with former India skipper Kohli at the end of the 10th over, with the players exchanging words before Khawaja and the two umpires calmed the situation down.\nKonstas was unruffled, smashing Bumrah for 18 in the next over and geeing up the crowd to keep up the noise, before reaching his fifty with two off Siraj.\nAn eventful 90-minute innings came to an end when he fell to Jadeja, but left the field to a rapturous reception.\nAustralia will be further encouraged by the return to form of Khawaja and Labuschagne, who both hit their highest scores of the series so far.\nSteve Smith also looks well set on 68, though Carey's late wicket leaves the Australia tail exposed and sets up a potentially pivotal first session on day two.\nOne of the images of the day was Kohli, 36, barging into Konstas after the Australian had clubbed the India bowlers around the ground.\nKohli appeared to change direction to make contact with Konstas, who was walking down the pitch to speak to his opening batting partner Khawaja.\nSpeaking to host broadcaster Seven Network, former Australia captain Ricky Ponting says Kohli was probably to blame.\n\"That man [Kohli] might have a few questions to answer,\" Ponting said.\n\"When you're out there batting, the batsman owns the wicket. The crease is his. Especially between overs like that.\"\nKonstas played down the incident at the end of the day, saying: \"I was just doing my gloves and I think he accidentally bumped me. But that's just cricket, the tension.\"\nThe International Cricket Council can suspend players for \"inappropriate physical contact\" if deemed serious enough, though it is not yet clear whether either player will face any further action.\nThat incident summed up what was set to be a chastening day for India, who grew visibly frustrated as the Australian top order collectively found form.\nBut that late burst of wickets, led by the irrepressible Bumrah, dragged the visitors back into the game.\nLabuschagne was looking well-placed to reach three figures before he charged spinner Washington Sundar, recalled in place of Shubman Gill, and clipped the ball straight to Kohli at mid-off.\nTravis Head, scorer of two centuries in his previous three innings, departed for a duck after shouldering arms to a Bumrah delivery that nipped back and clipped the top of his off stump.\nTwo overs later Marsh attempted a heave across the line but could only edge through to Carey for Bumrah's third wicket of the day and 24th of the series.\nDeep then made the most of a late burst with the new ball with a beauty of a delivery that feathered Carey's edge.\nAustralia batter Sam Konstas: \"It was quite surreal with the big crowd, the biggest crowd I've ever played before.\n\"I just played with freedom and backed myself. Lucky to get a few runs. A bit disappointed with the way I got out but hopefully we have got a bit of momentum for tomorrow.\"\nIndia batting coach Abhishek Nayar: \"A lot of credit to the way Sam played. The intent he showed sort of put us on the back foot.\n\"But it took a lot of character for our bowlers to stick in there. It wasn't the easiest conditions to bowl. At times like that it is important to stick to your plans and post-lunch we came back really strong.\"", "url": "https://www.bbc.com/sport/cricket/articles/c4gp2jgyxxlo"}