{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:54:12", "date_modify": "2025-05-21 06:54:12", "date_publish": "2024-12-24 08:21:06", "description": "Philadelphia 76ers star Joel Embiid is ejected from their 111-106 win against the San Antonio Spurs after confronting a referee.", "filename": "sport_basketball_articles_cx2nkvz58g5o_1747810452.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0eea/live/1d841f40-c1c9-11ef-aef9-ff41843be3bf.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_basketball_articles_cx2nkvz58g5o_1747810452.html", "title": "Joel Embiid ejection: Referee Jenna Schroeder ejects Philadelphia 76ers star after player confronts her", "title_page": "Joel Embiid ejection: Referee Jenna Schroeder ejects Philadelphia 76ers star after player confronts her - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Philadelphia 76ers star Joel Embiid was ejected from his team's 111-106 win against the San Antonio Spurs after confronting a referee.\nEmbiid was given a third foul against him by referee Jenna Schroeder when he charged Victor Wembanyama, knocking the Frenchman to the floor with two minutes and 59 seconds remaining of the first half.\nThe 76ers player argued the call with Schroeder and then had to be restrained from the official as he ripped off his protective face mask and continued his protests, leading to two technical fouls and his ejection from the match.\nEarlier on, Schroeder's decision to eject Philadelphia's Andre Drummond for two technical fouls following a challenge on Wembanyama had been overturned.\n\"It was a wild first half,\" 76ers coach Nick Nurse said.\nTyrese Maxey produced 32 points, 10 rebounds and eight assists to inspire Philadelphia to victory, while Wembanyama managed 26 points, nine rebounds and eight blocked shots.\nElsewhere, reigning NBA champions the Boston Celtics, who led by 15 points at half-time, suffered a 108-104 defeat by the Orlando Magic.\nTristan da Silva scored a team-high 18 points for Orlando against a Celtics team missing Jayson Tatum, who was unwell.\nShai Gilgeous-Alexander impressed as he scored 41 points to help Western Conference leaders Oklahoma City Thunder to a 123-105 win against the Washington Wizards.", "url": "https://www.bbc.com/sport/basketball/articles/cx2nkvz58g5o"}