{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:05:48", "date_modify": "2025-05-20 12:05:48", "date_publish": "2023-08-05 12:27:38", "description": "Germany head coach Martina Voss-Tecklenburg says she has no intention of quitting despite her side's shock World Cup exit.", "filename": "sport_football_66411766_1747742748.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/15708/production/_130661878_gettyimages-1591430696.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66411766_1747742748.html", "title": "Women's World Cup: Germany boss Martina Voss-Tecklenburg says she won't quit", "title_page": "Women's World Cup: Germany boss Martina Voss-Tecklenburg says she won't quit - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Germany head coach Martina Voss-Tecklenburg says she has no intention of quitting despite her side's shock early exit at the Women's World Cup.\nTwo-time winners Germany were knocked out in the group stages for the first time after a 1-1 draw with South Korea.\nVoss-Tecklenburg's contract runs until 2025.\n\"The easy thing is to run away when things get difficult in life,\" said Voss-Tecklenburg. \"I've never run away when things got tough.\"\nOn Friday she was given a vote of confidence by German FA president Bernd Neuendorf.\nGermany, ranked second in the world and one of the initial favourites for this year's tournament, won the World Cup in 2003 and 2007.\nTheir bid for a third title began with a 6-0 win over Morocco, but a 2-1 defeat to Colombia and draw with South Korea saw them exit at the first hurdle.\nVoss-Tecklenburg, who appeared in three World Cups for Germany as a player, has managed the national team since 2019, leading them to the European Championship final last year where they lost to England after extra time.\n\"I still have the firm belief to take the next steps in German women's football with everyone involved,\" the 55-year-old coach said.\n\"I will stay tenacious and strong.\"\nGermany's shock exit mirrors those of their men's side who have been eliminated at the group stage in the past two World Cups.\n\"It's not like we haven't been trying to address things,\" said German FA sporting director Joti Chatzialexiou, adding the German FA had \"consciously developed a project for the future of male and female football\" over the past five years.\n\"Due to our success in the female division, we may have rested on our laurels once or twice,\" said Chatzialexiou.", "url": "https://www.bbc.com/sport/football/66411766"}