{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:21:54", "date_modify": "2025-05-20 12:21:54", "date_publish": "2023-07-26 07:05:01", "description": "Before the third season of The Hundred begins, get to know Southern Brave and find out who their key players will be.", "filename": "sport_cricket_66228527_1747743714.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/110A8/production/_130500896_-8bc42f9a-2c97-4971-9afd-4396f77938fb.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66228527_1747743714.html", "title": "The Hundred 2023: Meet Southern Brave as Danni Wyatt & James Vince name players to watch", "title_page": "The Hundred 2023: Meet Southern Brave as Danni Wyatt & James Vince name players to watch - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "BBC Sport has collaborated with data analysts CricViz to look at the strengths and weaknesses of each side.\nMen's team\nBrave made some big moves during the off-season and have gone all out on overseas batters - New Zealander Finn Allen is a fast scorer and complements James Vince and Devon Conway at the top of the order, two batters who like to get set.\nLeus du Plooy impressed in an underwhelming Welsh Fire team last season and the Hungarian-South African left-hander brings much-needed quality to the middle order and allows Brave to pair left and right-handers should they wish to do so. Australian Tim David also returns to the south coast and will be hoping to deliver better returns than he did last season.\nTheir bowling was hampered by injury last term, but Chris Jordan and Tymal Mills return this year after spearheading the Brave attack to victory in 2021. Craig Overton's new-ball wicket-taking exploits in the Blast will complement Jordan and Mills, two bowlers that prefer bowling at the death. James Fuller has a great record at the Ageas Bowl with both bat and ball, bringing balance to Stephen Fleming's side.\nThe lack of experience in their spin duo, Rehan Ahmed and Jafer Chohan, could be an area that teams look to exploit.\nWomen's team\nSouthern Brave have once again recruited Indian superstar left-handed batter Smriti Mandhana to lead their batting line-up. She is once again joined by Danni Wyatt who is at the peak of her powers after a spellbinding Ashes series with the bat. The pair will be well complemented by the lower-order power of Chloe Tryon and the skill of Maia Bouchier who will make the back-to-back runners-up strong contenders with bat in hand.\nWith the ball, Brave will be looking to the new-ball swing of the soon-to-retire Anya Shrubsole and heir apparent Lauren Bell to make early inroads and rip the heart out of opposition batting orders. Expect to see Maitlan Brown and Freya Kemp applying pressure through the middle overs and exploiting the long boundaries of the Ageas Bowl to their favour.\nBBC Sport spoke to a player from each men's and women's team and asked them to pick two key players to watch and about their chances this year.\nSouthern Brave captain James Vince: \"I'll say Rehan Ahmed, he's sort of our main spinner this year so it will be a good opportunity. I'm also going to say Tim David, just because of how destructive he can be. He will play a big role if he comes in good form.\n\"I'm nice and positive ahead of the new competition. We didn't have our best year last season but we had to deal with a few injuries and setbacks. Hopefully, with a fully fit squad, which is very similar to the year when we won it in the first, we can get back there.\"\nSouthern Brave opener Danni Wyatt: \"The first one is Freya Kemp, definitely. She's been unlucky with her recent injury, but she's looking very, very good in the nets. I'm really excited to see how she can perform with the bat especially. If she can bowl a few overs for us, that would be a great bonus.\n\"Also Maia Bouchier, she's come on leaps and bounds over the last 12 months, so I'm really excited to see what she can bring to the table.\n\"We've got a very good chance again, we've got a very good squad. We've lost a great player in Sophia Dunkley but we've got the great addition of Chloe Tryon and Maitlan Brown who I've played with at Melbourne Renegades and I know how good of a player she is.\"", "url": "https://www.bbc.com/sport/cricket/66228527"}