{"authors": ["Andy Gray", "www.facebook.com"], "date_download": "2025-05-21 05:55:35", "date_modify": "2025-05-21 05:55:35", "date_publish": "2025-04-02 06:28:11", "description": "BBC Sport NI tells you what you need to know about Northern Ireland's Nations League games with Romania, from team news to where you can watch it.", "filename": "sport_articles_cr785my0egxo_1747806935.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cbb3/live/80c67990-0ed1-11f0-a3a0-a5d2188117fa.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cr785my0egxo_1747806935.html", "title": "Northern Ireland v Romania: All you need to know ahead of Nations League double header", "title_page": "Northern Ireland v Romania: All you need to know ahead of Nations League double header - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Northern Ireland are back in Nations League action with a double-header against Romania.\nTanya Oxtoby's side travel to Bucharest on Friday, 4 April, before the sides meet at Windsor Park on Tuesday.\nFrom coverage on BBC iPlayer to the form guide, here's all you need to know before the games.\nNorthern Ireland will be without key defender Laura Rafferty for the games after the 28-year-old picked up an injury while playing for Rangers.\nGlentoran midfielder Chloe McCarron is also missing through injury, while Casey Howe is a long-term absentee.\nIt is a stable squad for Tanya Oxtoby, with teenager striker Kascie Weir and experienced midfielder Nadene Caldwell retaining their places after being drafted into the panel in February.\nThe majority of Romania's squad play their football in their domestic league.\nOne of the few who ply their trade abroad is captain Florentina Olar, who plays for Fortuna Hjorring in Denmark.\nThe 39-year-old forward has won 180 caps and scored the first of her 24 goals in 2001 - when eight of Northern Ireland's squad weren't even born.\nNorthern Ireland have won one and lost one of their opening two fixtures in the Nations League.\nTheir campaign started with a 2-0 defeat by top seeds Poland in Gdansk as the hosts scored two quickfire goals.\nIt looked to be another disappointing night against Bosnia-Herzegovina, a side Northern Ireland twice defeated in Euro 2025 qualifying last year, as the visitors led 2-1 in the closing stages at Inver Park.\nHowever, captain Simone Magill stepped up with two late goals to clinch victory for Northern Ireland.\nRomania, on the other hand, have lost both of their two fixtures to the same opponents.\nA heavy 4-0 defeat in Bosnia was followed by a narrow 1-0 loss at home to Poland.", "url": "https://www.bbc.com/sport/articles/cr785my0egxo"}