{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:42:22", "date_modify": "2025-04-26 07:42:22", "date_publish": "2025-02-26 20:52:59", "description": "New Zealander Clayton McMillan will become Munster's new head coach this summer with the Chiefs boss signing a three-year deal at Thomond Park.", "filename": "sport_rugby-union_articles_c80y503zmg2o_1745653342.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3b83/live/514e4fe0-f481-11ef-96b5-cb16e833b61d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_c80y503zmg2o_1745653342.html", "title": "Irish Rugby: Munster name Chiefs boss Clayton McMillan as Graham Rowntree's successor at Thomond Park", "title_page": "Irish Rugby: Munster name Chiefs boss Clayton McMillan as Graham Rowntree's successor at Thomond Park - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "New Zealander Clayton McMillan will become Munster's new head coach this summer with the Chiefs boss signing a three-year deal at Thomond Park.\nThe Irish province have been under the interim control of Ian Costello since Graham Rowntree departed in October.\nCostello will now move into a newly created general manager position with attack coach Mike Prendergast becoming senior coach.\nMcMillan, who will arrive in July, became head coach at the Chiefs in 2021 and guided the side to three Super Rugby finals in four seasons.\nHe has also coached the Maori All Blacks and an All Blacks XV.\n\"I am humbled to be given the opportunity to lead Munster, an iconic club steeped in history,\" he told the province's official website.\n\"Leading the All Blacks XV against Munster last year gave me insight into the immense pride and passion of the club's players, staff and wider rugby community. It was an incredible atmosphere and left a lasting impression.\n\"I am excited by the club's ambition and core values. They align strongly with my own, and I look forward to joining the team in July.\"\nMunster are fifth in the United Rugby Championship and face La Rochelle in the Champions Cup last-16 in April.", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/c80y503zmg2o"}