{"authors": ["Frank Keogh", "www.facebook.com"], "date_download": "2025-05-21 05:29:05", "date_modify": "2025-05-21 05:29:05", "date_publish": "2025-04-03 10:01:22", "description": "Runners, riders, trainers and form - all the key details you need to know for Saturday's big race at Aintree.", "filename": "sport_horse-racing_articles_cn5xz39r05yo_1747805345.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/98e4/live/2b0c02a0-1079-11f0-ba12-8d27eb561761.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_horse-racing_articles_cn5xz39r05yo_1747805345.html", "title": "Grand National runners: Pinstickers' guide to 2025 Aintree race", "title_page": "Grand National runners: Pinstickers' guide to 2025 Aintree race - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Runners, riders, trainers and form - all the key details you need to know for Saturday's big race at Aintree.\nNote: Approximate odds may change.\n(Racecard number, horse, trainer, jockey, recent form, age, weight carried [ie 11st 12lb is top weight]. Form: F - Fell, P - Pulled up, U - Unseated rider.)\nVerdict: Lots with chances but Senior Chief could still be improving, while Hewick looks primed to run well.\n1 Senior Chief 2 Hewick 3 Stumptown 4 Iroko\nTrainer: Willie Mullins (IRE) Jockey: Paul Townend\nForm: 311-P8 Age: 9 Weight: 11-12\nConvincing victor last year, having won the Irish National 12 months earlier, and could well be in the shake-up again. Pinpointed two months ago by 20-time champion jockey AP McCoy - who advises the owner - as the pick of JP McManus' stellar squad. Would be the first horse carrying top weight to triumph since the legendary Red Rum in the 1970s.\nRating: 8/10 Odds: 6-1\nTrainer: Venetia Williams Jockey: Charlie Deutsch\nForm: F-1P66 Age: 11 Weight:11-9\nThrives in different conditions, at Haydock in the mud – scene of five of his seven career victories, including back-to-back runnings of the Betfair Chase. Past three runs have been disappointing. Owned by flamboyant former banker Rich Ricci, you might not get rich backing this one although trainer did triumph with 100-1 outsider Mon Mome in 2009.\nRating: 5/10 Odds: 125-1\nTrainer: Willie Mullins (IRE) Jockey: Patrick Mullins\nForm: 73-411 Age: 8 Weight: 11-8\nOwner Stewart Andrew clearly thinks he's a rocket - he eyed Cheltenham Gold Cup, but trainer preferred to go for the National. Would be an emotional winner as Andrew's wife Sadie died in December 2022, five days after watching Nick Rockett in his first race. A winner of the Thyestes Chase then Bobbyjo Chase, where Intense Raffles was runner-up, but that rival better off at the weights here. Jockey rides for trainer father.\nRating: 7/10 Odds: 25-1\nTrainer: John Joseph Hanlon (IRE) Jockey: Gavin Sheehan\nForm: 232571 Age: 10 Weight: 11-7\nAn £800 bargain buy who has won big races including the King George VI Chase, Bet365 Gold Cup, Galway Plate and American Grand National. Trainer, nicknamed 'Shark', has taken horse into local pub to celebrate victories, and believes he could be sent off favourite. Well backed in lead-up to race, would be suited by dry spell with good going right up his street.\nRating: 8/10 Odds: 10-1\nTrainer: Henry de Bromhead (IRE) Jockey: Rachael Blackmore\nForm: 443-26 Age: 12 Weight: 11-3\nLooked a potential winner last year in closing stages before finishing third. Triumphed in 2021 Cheltenham Gold Cup for trainer, who won National a month later with stablemate Minella Times as Rachael Blackmore became first female jockey to win the race. Could easily be prominent again for her although would be some effort to become only third horse to complete Gold Cup-National double.\nRating: 7/10 Odds: 33-1\nTrainer: Willie Mullins (IRE) Jockey: Sean O'Keeffe\nForm: 2-5351 Age: 11 Weight: 11-2\nShowed bundles of promise when winning the Supreme Novices' Hurdle at the Cheltenham Festival four years ago but much of that has been unfulfilled. Won for the first time in two years last time out at Thurles. Not the most obvious victor in trainer's talented team and no guarantee at all that he will appreciate this marathon distance.\nRating: 6/10 Odds: 66-1\nTrainer: Willie Mullins (IRE) Jockey: Jonathan Burke\nForm: 0-8P43 Age: 9 Weight: 11-2\nWhile powerful trainer has other hopefuls, including last year's winner, don't let this one go under the radar. Third under top weight to Intense Raffles in last year's Irish Grand National before winning Bet365 Gold Cup at Sandown. Breeding and form point to potential for big run. Minella horses take their name from a Tipperary family hotel run by racehorse trader John Nallen.\nRating: 7/10 Odds: 25-1\nTrainer: Gordon Elliott (IRE) Jockey: Jordan Gainford\nForm: U58708 Age: 11 Weight: 11-2\nBoasts some decent form including Irish Gold Cup win, when Minella Indo was second, albeit that was three years ago. Has run well at this meeting before, including a good second to Jonbon over shorter distance last year. Trainer seeking fourth victory in race, but suspicion is age, weight and longer trip may be against this one.\nRating: 6/10 Odds: 66-1\nTrainer: Gavin Cromwell (IRE) Jockey: Keith Donoghue\nForm: -U1111 Age: 11 Weight: 11-2\nSecured fourth straight victory of the season by winning Cross Country Chase at Cheltenham Festival in fine style last month. That is the same race Tiger Roll won before his 2018 and 2019 National triumphs. Stumptown's trainer went to town at Cheltenham by landing the Gold Cup with Inothewayurthinkin, who was then made hot favourite for this but skips the race.\nRating: 8/10 Odds: 8-1\nTrainer: Paul Nicholls Jockey: Freddie Gingell\nForm: 83-222 Age: 9 Weight: 11-1\nPart-owned by former Manchester United boss Sir Alex Ferguson, Hitman has been a bit hit and miss. Has a habit of coming second - finishing runner-up in 11 of his 26 races - and this distance is a real unknown. Talented 19-year-old jockey credits much of his success to his mother Kim who died in 2020 from cancer aged 43.\nRating: 5/10 Odds: 150-1\nTrainer: Nigel Twiston-Davies Jockey: Sam Twiston-Davies\nForm: 1P-132 Age: 9 Weight: 11-1\nJockey rides for trainer father, who has landed the race twice before. Winner of Midlands Grand National last year. Owner Bryan Burrough hoping for second success, 42 years after his colours were carried to victory by the Jenny Pitman-trained Corbiere. It's a tough ask but had a convincing victory over fences at Ascot earlier in season and stamina looks assured.\nRating: 7/10 Odds: 33-1\nTrainer: Paul Nicholls Jockey: James Reveley\nForm: 6-2383 Age: 10 Weight: 11-0\nForm has dipped since reaching top of his game two or three years ago. Won jump racing's festive showpiece, the King George VI Chase at Kempton, in 2022 and was second a year later. In between, finished runner-up in the Cheltenham Gold Cup. Will take a brave man or woman to pick this one after an 11-race losing run. Stable jockey rides Kandoo Kid.\nRating: 6/10 Odds: 50-1\nTrainer: Nicky Henderson Jockey: James Bowen\nForm: 9-5515 Age: 11 Weight: 10-13\nBit of an enigma. Was on a 10-race losing run when won well at Cheltenham on New Year's Day. Maybe he was just in the party mood. Green and gold colours of owner JP McManus look more likely to succeed elsewhere, although there is a breeding positive - Chantry House's sire Yeats was also dad to 2022 National winner Noble Yeats.\nRating: 6/10 Odds: 66-1\nTrainer: Paul Nicholls Jockey: Harry Skelton\nForm: 210-32 Age: 10 Weight: 10-12\nNamed after owner Max McNeill's late father and ex-professional golfer Ted, who was three under par through five holes to lead The Open at Royal Portrush in 1951. Will the gelding be above or below par? Fourth in the Scottish National two years ago but well behind Minella Cocooner and Nick Rockett in last season's Bet365 Gold Cup.\nRating: 6/10 Odds: 66-1\nTrainer: Gavin Cromwell (IRE) Jockey: Mark Walsh\nForm: 286411 Age: 8 Weight: 10-12\nAnother powerful weapon in the armoury of Cheltenham Gold Cup-winning trainer, who also has Stumptown and Vanillier. A beaten favourite for both the Galway Plate and Kerry National but form of his Leopardstown win in December reads well and now takes a big step up in trip. Named after a 1970s film about a 12th Century knight, could he put his rivals to the sword here?\nRating: 7/10 Odds: 12-1\nTrainer: Paul Nicholls Jockey: Harry Cobden\nForm: P23-18 Age: 9 Weight: 10-11\nDecent third in Topham Chase over National fences last year. Won Coral Gold Cup, formerly the Hennessy, at Newbury in November. Only one horse, Many Clouds, has gone on to also win the National, though trainer thinks he can do it. He won in 2012 with Neptune Collonges and says the grey Kandoo Kid is the \"ideal horse for the race\".\nRating: 7/10 Odds: 14-1\nTrainer: Tom Gibney (IRE) Jockey: JJ Slevin\nForm: 11-902 Age: 7 Weight: 10-10\nSounds like a deadly serious lottery, and has a deadly serious chance. Winner of the Irish Grand National last year. Nearly all of his races have been on soft or heavy ground. The grey runs in the 'double green' colours of owner-breeders Simon Munir and Isaac Souede. Showed his wellbeing when second, despite carrying more weight, to Nick Rockett at Fairyhouse in February.\nRating: 7/10 Odds: 10-1\nTrainer: Henry de Bromhead (IRE) Jockey: Darragh O'Keeffe\nForm: 1P-169 Age: 9 Weight: 10-10\nPulled up in last year's Irish National but marked himself out as a candidate for this race when winning well at Cheltenham in October. Subsequently sixth in the Coral Gold Cup at Newbury when he was staying on, which could be a good sign for the test ahead. Owned by the Lucky In Life Syndicate. Will the horse live up to their name?\nRating: 8/10 Odds: 25-1\nTrainer: Richard Phillips Jockey: Harry Bannister\nForm: F03106 Age: 11 Weight: 10-10\nPreviously based in Ireland, where he won the Midlands National last summer at Kilbeggan. Having second run for amiable Gloucestershire trainer, who does a nice line in impressions. He helped buy the horse with John Rosbotham, a friend of 55 years with whom he dreamed in the school playground of having a National runner, and it runs for a syndicate of 12 called the Dozen Dreamers.\nRating: 4/10 Odds: 100-1\nTrainer: Gordon Elliott (IRE) Jockey: Sam Ewing\nForm: 212433 Age: 7 Weight: 10-9\nFive of his six wins have come at roughly half the distance of this race. Looks an uphill task on the face of it, but interestingly mentioned as a potential surprise package by the trainer – who has won three times previously - when weights for the race were announced in February. Would probably benefit from soft ground.\nRating: 6/10 Odds: 100-1\nTrainer: Nigel Twiston-Davies Jockey: Tom Bellamy\nForm: 5-324P Age: 7 Weight: 10-9\nOwner David Proos hoping to go two better after his family silks were carried to third by Rinus in 1990. No forlorn hope based on his second to Kandoo Kid in Coral Gold Cup at Newbury. One for alliteration fans - could Broadway Boy follow Mon Mome, Party Politics and Red Rum as a nifty-sounding National winner for trainer, who has triumphed twice before?\nRating: 7/10 Odds: 66-1\nTrainer: Gordon Elliott (IRE) Jockey: Jody McGarvey\nForm: U50029 Age: 10 Weight: 10-9\nEleventh in last year's race, when hampered late on, having previously finished eighth and pulled up. Prominent on each occasion before fading. Winner of the Troytown Chase in 2023. Will probably be spotted towards the front again but takes a leap of faith to see him stay there and become only the fourth grey horse to win the National.\nRating: 6/10 Odds: 100-1\nTrainer: Michael Keady Jockey: Ciaran Gethings\nForm: F22999 Age: 8 Weight: 10-6\nRunner-up in the Kerry and Munster Nationals when trained by Willie Mullins but switched stables last month. Now based in the Flat racing capital of Newmarket. Trainer set up on his own five months ago and is looking for first win over jumps in biggest steeplechase of all. Has to be a doubt over whether this contender possesses the same ability and stamina as some of his rivals.\nRating: 4/10 Odds: 100-1\nTrainer: Nicky Henderson Jockey: Nico de Boinville\nForm: 141122 Age: 8 Weight: 10-6\nNovice chaser looking to break duck for trainer, who is one of the greats but has poor record in this race – with no win from 43 previous runners. Sound jumper who should like the ground. Need an omen? One of the owners, Paul Humphreys, was born on same day as Grand National legend Red Rum. Their syndicate once included the late John Sillett, Coventry City's FA Cup-winning manager.\nRating: 6/10 Odds: 25-1\nTrainer: Philip Hobbs and Johnson White Jockey: Micheal Nolan\nForm: 45U4-1 Age: 13 Weight: 10-6\nThe obstacles should not be an issue, having finished eighth and fourth in the past two runnings of the shorter Topham Chase over the National fences. However, this is a longer and stiffer task. No 13-year-old horse has won the National since Sergeant Murphy 102 years ago and hard to see an equine teenager being celebrated this time around.\nRating: 6/10 Odds: 150-1\nTrainer: Gordon Elliott (IRE) Jockey: Sean Bowen\nForm: -33713 Age: 10 Weight: 10-5\nThis race has been the long-term plan, says the trainer, who has been successful three times before. And he has been dealt a nice hand with the horse sneaking in towards the bottom of the weights. Rider is actually allergic to horses, but is on the verge of becoming British champion jockey and steps in for injured Jack Kennedy.\nRating: 6/10 Odds: 14-1\nTrainer: Ben Pauling Jockey: Beau Morgan\nForm: 5-2P77 Age: 10 Weight: 10-5\nA family affair as 20-year-old jockey rides horse owned by his mother Georgia. The expected sunny conditions should suit as six of his seven wins have come on good ground. Second in the Ultima Chase at last year's Cheltenham Festival, he ran three times over hurdles this season before finishing a distant seventh in the Grimthorpe Chase at Doncaster.\nRating: 6/10 Odds: 80-1\nTrainer: Gordon Elliott (IRE) Jockey: Danny Gilligan\nForm: 352P4B Age: 8 Weight: 10-4\nUnlikely to need a Duffle Coat on Merseyside this weekend with sunny spells forecast and temperatures expected to reach 18C. Unlikely too that this grey will prove good enough to triumph despite low weight. Runner-up in last summer's Galway Plate and has finished second several times but only managed to wrap up one win from his past 27 races.\nRating: 6/10 Odds: 100-1", "url": "https://www.bbc.com/sport/horse-racing/articles/cn5xz39r05yo"}