{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:05:26", "date_modify": "2025-05-20 14:05:26", "date_publish": "2023-07-30 19:10:11", "description": "Scotland head coach Tamsin Greenway is proud of how her inexperienced side are handling a steep learning curve at the Netball World Cup.", "filename": "sport_netball_66355465_1747749926.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/177C6/production/_130589169_gettyimages-1560459296.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_netball_66355465_1747749926.html", "title": "Netball World Cup 2023: Head coach Tamsin Greenway proud of Scotland progress", "title_page": "Netball World Cup 2023: Head coach Tamsin Greenway proud of Scotland progress - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Scotland head coach Tamsin Greenway is proud of how her inexperienced side are handling a steep learning curve at the Netball World Cup in South Africa.\nThe Scots finished third in Pool B to progress to the second group phase after a win over Barbados, either side of defeats to Malawi and England.\nGreenway's side joined the top two, and Australia, Tonga and Fiji in Pool F.\n\"I've been so proud with how some of the youngsters have stepped up,\" she said.\n\"We've got seven players in this team that are 23 and under - and we've got seven players that have never been to a World Cup.\n\"So we're mixing all these things together, whether it's tactical things, technical things, learning how to lead, how to create a culture, and we're learning about the game constantly.\n\"That's so important because you're playing different styles, you're playing back-to-back games, you're having to understand what your energy brings. There's so much to it.\"\nGreenway, who described the ranking system as a \"shambles\", is targeting a top-10 finish, which would be Scotland's highest placing since 1994.\n\"In sort of the modern era of the game, since everything's gone a bit more pro, we haven't finished in the top 10,\" she added.\n\"We've got an opportunity to do that. We've actually got a draw [where] that could happen. It might not but it could happen.\"", "url": "https://www.bbc.com/sport/netball/66355465"}