{"authors": ["Harry Poole", "www.facebook.com"], "date_download": "2025-05-21 05:40:05", "date_modify": "2025-05-21 05:40:05", "date_publish": "2025-02-08 23:43:42", "description": "The debate over the use of technology in football is nothing new - but in the FA Cup fourth round its absence has provided a frequent talking point.", "filename": "sport_football_articles_c0lzyk364zlo_1747806005.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a710/live/0cd04680-e66b-11ef-8a1f-0df9bb12c534.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c0lzyk364zlo_1747806005.html", "title": "FA Cup: Lack of video assistant referee technology felt in fourth round", "title_page": "FA Cup: Lack of video assistant referee technology felt in fourth round - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Football fans have become accustomed to debating the use of technology in the game over recent years - but in the FA Cup fourth round, its absence has provided a frequent talking point.\nWith video assistant referee technology only in use from the fifth round onwards this season, there have been a number of controversial incidents to dissect.\nAnd after incidents on Friday and Saturday, there was another on Sunday when Dominic Hyam's header was disallowed for offside in Blackburn's defeat by Wolves - when replays suggested he was onside.\n\"My initial thought was they'll check that,\" said ex-Rovers goalkeeper Paul Robinson on BBC Radio 5 Live.\n\"It looks extremely tight. If there was VAR they'd be drawing the lines.\"\nSome liked VAR's absence, such as Brighton boss Fabian Hurzeler, whose side might have had their winner against Chelsea disallowed for a Tariq Lamptey handball.\n\"But that's it. That's football,\" he told BBC Sport. \"With VAR, football is getting not that emotional like it was today.\n\"Everyone agrees with me that today was a great atmosphere. You can celebrate a goal because you are certain it's a goal. I'm happy it was like that.\"\nSome were less convinced, including his Chelsea counterpart Enzo Maresca - whose side might still be in the FA Cup with VAR.\n\"I think the handball is quite clear. In the last two or three days, there were many different moments in different games that, without VAR, sometimes are more complicated,\" said Maresca.\nHowever he added: \"Sometimes even with VAR, you never know if it's [going to be given as] handball or not. I don't know. This season we saw so many handballs and the VAR was not there.\"\nEven Manchester United boss Ruben Amorim admitted Harry Maguire's dramatic late winner against Leicester City in the round's first tie on Friday was offside and should not have stood.\nThere were several further high-profile incidents at the weekend, and there are still two games to be played over the next two days.\nSo, what's going on with VAR in the FA Cup - and why?\nThe Football Association confirmed in December that VAR technology would only be introduced from the fifth round onwards to ensure a \"consistent refereeing approach for all clubs taking part in the same stage of the competition\".\nBecause of infrastructure and operational costs, VAR had previously only been used at Premier League grounds, and at Wembley in the FA Cup semi-finals and final.\nThere have been 13 VAR mistakes in the Premier League so far this season - down from 20 at the same point last term - say league bosses.\nHowever, to confuse matters, goalline technology has been in use at Premier League and Championship grounds - where the infrastructure exists - in this year's competition, despite not being available everywhere.\nThat includes at St Andrew's, where Newcastle United beat Birmingham City after Joe Willock's controversial equaliser was judged to have crossed the line.\n\"I think it's refreshing they had no VAR and I wish they had this throughout the competition,\" former Newcastle goalkeeper Shay Given said on BBC One following that match.\n\"If there was any doubt, you have to give Birmingham the benefit of the doubt, but the linesman was adamant [that Willock's shot crossed the line].\"\nWill: Hilarious. Complain about handballs and offsides given with VAR, then complain when VAR isn't there to give handballs and offsides.\nAnon: It's almost like with no VAR, we've gone the other way. Just allow handballs to go. Officials have become too reliant.\nStu: Only two handballs in the build-up to Brighton goal, no problem.\nTom: Nice not having VAR. Back to the good old days of just having to accept the refs are humans and miss things. Only thing that should be at every ground is goalline technology.\nAlan: Disaster not having VAR. Why in some rounds of the FA Cup and not others? Leicester were knocked out because of not having VAR in use.", "url": "https://www.bbc.com/sport/football/articles/c0lzyk364zlo"}