{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:37:15", "date_modify": "2025-05-20 13:37:15", "date_publish": "2023-08-01 15:53:41", "description": "Tom Marquand and Quickthorn power to victory in the Goodwood Cup to deny Frankie Dettori a record-equalling sixth victory.", "filename": "sport_horse-racing_66377047_1747748235.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/06F4/production/_130608710_gettyimages-1219097089.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_horse-racing_66377047_1747748235.html", "title": "Goodwood Cup: Quickthorn powers to victory as Frankie Dettori misses out", "title_page": "Goodwood Cup: Quickthorn powers to victory as Frankie Dettori misses out - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tom Marquand and Quickthorn powered to victory in the Goodwood Cup on Tuesday.\nQuickthorn cruised to the front of the pack and had too much for the rest of the field in the Group 1 feature, which included Frankie Dettori on pre-race favourite Courage Mon Ami.\nVictory for Quickthorn, who was 16-1, denied 52-year-old Dettori, who is set to retire at the end of the season, a record sixth Goodwood Cup.\nMarquand said: \"He [Quickthorn] is warrior in his own right.\"\nSpeaking to ITV, he added: \"I've had a bit of fun on him before on some big days and he just loves bowling away and putting everyone else to the sword. It was an exceptional performance.\n\"There was no masterplan. Everybody knows what he is going to do and it's testament to him.\"\nMarquand had employed similar tactics on board Quickthorn in last season's Lonsdale Cup at York where he beat Coltrane by 14 lengths.\nEmily Dickinson finished second and Coltrane came third, while Dettori's Courage Mon Ami was sixth.\nThere was success for Dettori earlier on the opening day of Glorious Goodwood as he rode Kinross to a second win in the World Pool Lennox Stakes.\nKinross was challenged by Isaac Shelby until the final stages of the race before winning by a neck.", "url": "https://www.bbc.com/sport/horse-racing/66377047"}