{"authors": ["Harry Poole", "www.facebook.com"], "date_download": "2025-05-21 07:52:32", "date_modify": "2025-05-21 07:52:32", "date_publish": "2025-01-13 16:00:11", "description": "Sifan Hassan returns to the London Marathon in 2025 as all four reigning Olympic and Paralympic marathon champions take to the streets of the capital in April.", "filename": "sport_athletics_articles_ce3lw5nyx8wo_1747813952.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/436c/live/67db87d0-d11a-11ef-b86c-bd08dab7c7b4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_athletics_articles_ce3lw5nyx8wo_1747813952.html", "title": "London Marathon 2025: Sifan Hassan among reigning Olympic and Paralympic champions confirmed", "title_page": "London Marathon 2025: Sifan Hassan among reigning Olympic and Paralympic champions confirmed - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Sifan Hassan will return to the London Marathon in 2025 as all four reigning Olympic and Paralympic marathon champions take to the streets of the UK capital in April.\nDutch athlete Hassan made history as the first woman to win Olympic golds over 5,000m, 10,000m and the marathon during her career with victory over 26.2 miles at Paris 2024.\nThe 32-year-old produced a remarkable comeback to take victory in London on her debut over the marathon distance in 2023, and also won the Chicago Marathon that year.\n\"It feels so special to come back to the London Marathon. This is where I ran my very first marathon and began my journey in this incredible distance,\" Hassan said.\n\"London is also where I learned to be patient, to trust myself, and to keep pushing even when it feels impossible. It is a place where I grew, not just as an athlete, but as a person.\"\nHassan will be joined in London by Ethiopia's Olympic men's champion Tamirat Tola, and Paralympic champions Catherine Debrunner and Marcel Hug.\nThe 2025 London Marathon takes place on Sunday, 27 April.\nTwo years ago, an inexperienced Hassan looked like she would have to drop out of her marathon debut after stopping at the roadside mid-race to stretch out a hip injury while her rivals disappeared up the road.\nInstead, she reeled in the Tokyo Olympic marathon champion Peres Jepchirchir and the 2022 London champion Yalemzerf Yehualaw before sprinting to glory - but only after almost colliding with a support motorbike.\nHassan achieved her Olympic triumph last summer in similarly dramatic fashion.\nHaving already won bronze medals in both the 5,000m and 10,000m on the track - the events she won in Tokyo - she appeared to be fading in the marathon but recovered to produce another spectacular sprint finish.\n\"I don't think I'm the greatest because, if I think that, I'm not going to improve,\" Hassan said.\nDiscussing her future ambitions, she added: \"I want to try and run four marathons in one year and see how far I can go. Maybe closer to LA, I want to see how I can handle [that].\n\"I want to run personal bests on the track too. I have so many things in my head, I'm really crazy.\n\"Many athletes are good at one thing but they don't want to go out of their comfort zone. Nobody is perfect, I just want to try everything and see where I can go.\"", "url": "https://www.bbc.com/sport/athletics/articles/ce3lw5nyx8wo"}