{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:01:52", "date_modify": "2025-05-21 04:01:52", "date_publish": "2025-01-23 22:52:51", "description": "Manchester United v Rangers: What Clement said", "filename": "sport_articles_cj48ev4w0dro_1747800112.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e5ad/live/b91199c0-d9d3-11ef-85e4-2f835a169dbb.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cj48ev4w0dro_1747800112.html", "title": "Manchester United v Rangers: What Clement said", "title_page": "Manchester United v Rangers: What Clement said - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Rangers manager Philippe Clement: \"Everybody is disappointed that we lost after playing that kind of game so I am also.\n\"You want to win, you want to take the points that you deserve. I'm also very proud of what the team did today, following the tactics all the way, two changes at half-time, putting players in different positions. There were so many circumstances but the team stayed compact, I think in the first half we had the best chances to take the lead.\n\"We didn't stop believing in the second half even when we went behind, so it's really disappointing to concede the second goal. There's lots of positives in this young group, giving everything for the colours of this club.\n\"For the youngsters to come on this stage and be brave, a lot of congratulations to them and also the staff who have prepared them over the last weeks, months years. To come on the pitch and not be afraid, feel they are helped, secured, coached by the others - it's a massive experience for them.\n\"To get into the top eight we need to win again Union Saint-Gilloise and get luck in other results. To get in top 24, which was the ambition, we are very close but we are not there yet.\n\"It is about doing the things we have to do for this club and that is being ambitious.\"", "url": "https://www.bbc.com/sport/articles/cj48ev4w0dro"}