{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:14:15", "date_modify": "2025-05-21 05:14:15", "date_publish": "2025-04-05 00:00:00", "description": "Follow live text commentary, score updates and match stats from Millwall v Portsmouth in the Championship", "filename": "sport_football_live_c77nx10egj1t_1747804455.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/48d4/live/9c10ca60-1238-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c77nx10egj1t_1747804455.html", "title": "Millwall v Portsmouth: Championship stats & head-to-head", "title_page": "Millwall v Portsmouth: Championship stats & head-to-head - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Mihailo Ivanovic struck late to snatch a narrow victory for Millwall against Portsmouth and keep his side's Championship play-off hopes alive.\nThe Serbian's two headers, either side of Andre Dozzell's equaliser, sent the Lions within six points of sixth-placed Bristol City with six games of the season remaining.\nIvanovic nodded in George Honeyman's corner shortly before the hour after a tepid first half.\nPompey boss John Mousinho responded with a triple substitution and was rewarded when Dozzell smashed in on 80 minutes.\nBut Ivanovic popped up again with three minutes left to head in Caper De Norre's inch-perfect cross and seal all three points for the hosts, while Pompey have now lost 10 of their last 11 away games.\nThe game started at a frantic pace in the south London sun but chances were at a premium in the first half, with George Saville volleying wide and Japhet Tanganga heading over for the hosts.\nColby Bishop went closest for the visitors with a volley that forced a strong save from Millwall keeper Lukas Jensen.\nThe Lions lost Tanganga to an arm injury late in the first half, with Ryan Leonard on to replace the former Tottenham Hotspur defender, who left the pitch wearing a sling.\nMillwall took the lead just before the hour as Mihailo Ivanovic found space in the box to head into the far corner from Honeyman's corner.\nMatt Richie struck the post from close range as the visitors searched for the equaliser.\nThe hosts were causing the Portsmouth defence big problems at set-pieces and Pompey boss made a treble substitution with Harvey Blair, Christian Saydee and Marlon Pack introduced.\nAnd two of those were involved as the visitors soon equalised, Blair with the ball in before Saydee saw his shot blocked.\nIt fell to Dozzell, who fired through the bodies and past Jensen to level the score.\nBut with three minutes to go, Ivanovic popped up again to head in a pinpoint cross from De Norre.\nAlex Neil's side sit ninth in the table with six games remaining, with faint hopes of reaching the playoff spots.\nThey travel to Bramall Lane to face automatic-promotion chasers Sheffield United on Tuesday.\nWhile Portsmouth visit Coventry City the following day looking to improve their miserable away record, with just four points between them in 17th and Cardiff City in the drop zone.\nMillwall boss Alex Neil told BBC Radio London:\n\"I thought we deserved to win, first half we were really dominant without getting the goal I felt we really deserved, that was frustrating.\n\"At half time we spoke about final third decision making and making sure our strikers were stronger and a bit more aggressive.\n\"I thought both strikers were excellent in the second half and we deserved the win, we could have scored another couple after the second goal too.\n\"I think (Japhet) Tanganga might have broken his hand he couldn't move it, we'll get it x-rayed tonight and find out.\"\nPortsmouth boss John Mousinho told BBC Radio Solent:\n\"I'm incredibly frustrated. It feels like deja vu from three weeks ago at Preston and that's the most frustrating thing.\n\"After going a goal down we clicked into gear and started to play really well, which is a frustration anyway. We were far too predictable in the first half.\n\"I can accept us losing goals in a certain way but the way we conceded that second goal - we defended the set-play well until the second phase and left four v one at the back post.\n\"I can't understand how we're playing so well in certain moments and then really losing focus towards the back end of the game.\"", "url": "https://www.bbc.com/sport/football/live/c77nx10egj1t"}