{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:31:49", "date_modify": "2025-05-19 14:31:49", "date_publish": "2017-08-25 08:36:32", "description": "Wales women's results are \"a little bit disappointing\" but World Rugby has to address the gap between the best and the rest, says WRU's Geraint John.", "filename": "sport_rugby-union_41039663_1747665109.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/15CD6/production/_97520398_gettyimages-831054514.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_rugby-union_41039663_1747665109.html", "title": "Wales women: Geraint John 'bit disappointed' by World Cup results", "title_page": "Wales women: Geraint John 'bit disappointed' by World Cup results - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Welsh rugby's head of performance Geraint John admits being \"a little bit disappointed\" by Wales' results at the Women's Rugby World Cup.\nRowland Phillips' team face Ireland in the seventh place play-off in Belfast on Saturday, 26 August (14:00 BST).\n\"Our aim was always to finish in the top eight, but we'd have like to have finished a bit higher,\" said John.\nHe also believes World Rugby must address a growing gap between the top four countries and the rest.\nWales were drawn against New Zealand, Canada and Hong Kong in their pool, losing to the Black Ferns and Canucks.\nThey played Canada again in the fifth-place semi-final and were thrashed 52-0 - a contrast to their 15-0 loss in the pool stage against them.\n\"You don't want to lose by the amount we lost to Canada,\" said John, a former high performance manager at Canada Rugby.\n\"But I think the girls have performed well. I think we've shown there are some good quality players there.\n\"New Zealand were going to be either one or two in the world though we did exceptionally well against Canada in the pool game.\n\"Canada are not in the top four here, but you'd say they are a top-four side in the world. We probably had the toughest pool and beat Hong Kong.\n\"Maybe we're a little bit disappointed but we have an opportunity this weekend.\"\nJohn, who has also been Australia's director of sevens and sevens head coach, believes the dominance of England and New Zealand is a major issue for the 15-a-side game.\n\"There is a a gulf between the top four and the rest in the world and what we have to do in the union here is look at how we close that gap,\" he added.\n\"But I think also it's a World Rugby situation as well. They need to look at where the women's game is going because you have the sevens model and the 15s model as well.\n\"Two years ago I was in Australia and their budget for (women's) sevens is in the millions - and it's the same in Canada because it's an Olympic sport.\n\"Do they put that much into the 15-a-side game? Probably not. So I think it's something World Rugby has to look at.", "url": "https://www.bbc.com/sport/rugby-union/41039663"}