{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:36:01", "date_modify": "2025-04-26 04:36:01", "date_publish": "2025-02-28 11:57:53", "description": "Man Utd news: Fan views on Roy Keane's criticism of Bruno Fernandes", "filename": "sport_football_articles_cm2jj3dm9z0o_1745642161.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cm2jj3dm9z0o_1745642161.html", "title": "Man Utd news: Fan views on Roy Keane's criticism of Bruno Fernandes", "title_page": "Man Utd news: Fan views on Roy Keane's criticism of Bruno Fernandes - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "We asked for your views on Bruno Fernandes' leadership qualities as the captain of Manchester United.\nIt comes after ex-club captain Roy Keane said the playmaker is a \"talented player\" but \"leadership is action\" and that Fernandes is \"not a fighter\".\nHere are some of your comments:\nDave: No, Keane was not right on this occasion. There have been times that Bruno has had his strops, but recently he has been the only player fighting for the shirt! The other players need to follow his example. I dread to think what position we'd be in without Bruno!\nTony: Keane was correct. Bruno has very little self-control and is incapable of leadership. Erik ten Hag was right when he said today's players cannot accept criticism and with what they get paid, they warrant any just faultfinding. There are too many players that won't graft for 90 minutes. Unfortunately, most of them wear Manchester United shirts.\nAlan: He is United's best player and you can't fault his commitment and workrate. However, his style as captain isn't helping the team. He is too emotional and usually ends up agitated during games, which increases tension through the rest of the team. Part of the problem is there aren't any natural leaders in the squad - the only other option at present would be Harry Maguire.\nScott: Keane was correct in some ways, but very wrong in others. Fernandes can indeed be a polarising figure and does show his frustration (or wears his heart in his sleeve), but Ian Wright was bang on because, where would we be without him? The issue is that we need five or six more players with Bruno's desire, work ethic, never-say-die attitude and critically his ongoing availability. It's easy for Roy and other ex-players to criticise but they played in a massively successful team that had an abundance of leaders. How many of them can say, hand on heart, they would not react exactly the same way as Bruno if they were playing in this team?\nDan: Fernandes is probably the best option we have as captain as no-one else really shows any leadership qualities. I think it is certainly something we are lacking at the moment. It is probably best to stick with him until a leader is brought in or better established.", "url": "https://www.bbc.co.uk/sport/football/articles/cm2jj3dm9z0o"}