{"authors": ["Josh Lobley", "www.facebook.com"], "date_download": "2025-05-21 08:00:44", "date_modify": "2025-05-21 08:00:44", "date_publish": "2025-01-03 15:40:32", "description": "Andoni Iraola press conference: Bournemouth vs Everton preview", "filename": "sport_football_articles_clyx78gv2g5o_1747814444.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5908/live/85292f40-6de2-11ef-b970-9f202720b57a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_clyx78gv2g5o_1747814444.html", "title": "Andoni Iraola press conference: Bournemouth vs Everton preview", "title_page": "Andoni Iraola press conference: Bournemouth vs Everton preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Iraola confirmed midfielder Tyler Adams is likely to return, adding: \"He had a small thing, but he has been training with us this week.\"\nOn Saturday's opponents: \"They are playing much better lately. I expect it will be difficult. We have to be ready for their set-pieces - they have powerful aerial threat.\"\nHe spoke highly of youngster James Hill: \"[His throw-ins] are a great addition. It's a very difficult thing to defend. It's almost like a corner kick.\"\nWhen asked what Hill's best position is: \"He is a centre-back, but in training we have used him a lot as a number six. He has been very good in the minutes he has played there. It's good for him to have options.\"\nOn the Cherries' latest signing Matai Akinmboni: \"He is a very young left centre-back who is a very good prospect. We have signed him on a long contract thinking that he can develop with us and fulfil the qualities that he has. He comes from a situation where he has had two months of holiday. He will start training with the development squad and will integrate after with us.\"\nHe didn't give much away about other plans for this month's transfer window: \"You always need things but the key, for me, is adding players who have value. You have to be smart. We will see what happens.\"\nOn the potential departures of Max Aarons and Philip Billing, who have struggled for game time: \"If you ask them, they will probably say it depends on the options they have. I'm happy because I feel like they are contributing and being super professional.\"", "url": "https://www.bbc.com/sport/football/articles/clyx78gv2g5o"}