{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:41:29", "date_modify": "2025-05-21 06:41:29", "date_publish": "2025-01-22 18:05:43", "description": "Chelsea news: Fan views on what nobody is talking about but should be", "filename": "sport_football_articles_cr536y97gy5o_1747809689.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cr536y97gy5o_1747809689.html", "title": "Chelsea news: Fan views on what nobody is talking about but should be", "title_page": "Chelsea news: Fan views on what nobody is talking about but should be - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for you what one thing - good or bad - nobody is talking about at Chelsea but should be.\nHere are some of your comments:\nTom: No-one is talking about Cucurella. From a figure of fun to an integral and dangerous part of our team - he is now crucial to how we play. To top it off, he appears hugely popular in the dressing room. Given his past 12 months, I would say he has more than justified his price tag.\nYusuf: I definitely think something people are not talking about is the impact Cucurella has had this season, tactically and psychically. He has been silently transforming the team. His defensive solidity, improved ball progression and the surprising goal contributions are giving Enzo Maresca new tactical flexibility. He is so underrated and deserves more credibility for what he has done.\nStu: Ben Chilwell. One of the best left-backs in the Premier League on his day and a big part of our Champions League-winning team - and he now can't even get into the Conference League or cup teams. Does this say more about Maresca than Chilwell? He says Chilwell can't play his style, but the same could be said for a lot of first-team defenders. What is really going on?\nDeeq: The manager isn't fully utilising the squad at his disposal, especially considering the talent we have seen perform in the Conference League. His substitutions feel too reactive rather than proactive, with changes frequently made in the final stages of games when the result is already slipping away. A more strategic and timely use of substitutions could make a significant difference in turning games around or securing victories, rather than leaving it too late to influence the outcome. Additionally, team selection should prioritise form over cost, and those out of form should be dropped regardless of their price tag.", "url": "https://www.bbc.com/sport/football/articles/cr536y97gy5o"}