{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:10:22", "date_modify": "2025-05-21 04:10:22", "date_publish": "2024-12-29 00:00:00", "description": "Substitute Hamza Igamane's second-half double rescues a Scottish Premiership point for Rangers at Motherwell in a frantic game at Fir Park.", "filename": "sport_football_live_c20ez2ypyv5t_1747800622.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c20ez2ypyv5t_1747800622.html", "title": "Motherwell vs Rangers: Scottish Premiership report, reaction & stats", "title_page": "Motherwell vs Rangers: Scottish Premiership report, reaction & stats - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Substitute Hamza Igamane's second-half double rescued a Scottish Premiership point for Rangers at Motherwell in a frantic game at Fir Park.\nTwo goals down at half-time and staring back-to-back league defeats in the face before Thursday's Old Firm game at Ibrox, manager Phillipe Clement called on the Moroccan to make amends.\nHe did so clinically, first lashing in after the ball fell at his feet, before hauling second-place Rangers - who are now 14 points behind leaders Celtic - level with a sweet strike into the far corner.\nIt was quality which evaded the visitors in the first half, who were second-best to Motherwell.\n\"If you need to score three or four goals every time to win games, then it has to be much better,\" Clement told BBC Scotland. \"We can't do that every game.\n\"In the first half we conceded two goals we can never concede it that way. We put ourselves backwards and we made it difficult for ourselves.\"\nIt might seem churlish for Motherwell turn their nose at a point against Rangers, but they will feel three were well within their grasp here.\nIn the first 45, they outmuscled and outsmarted their visitors, particularly in the midfield and attack, and were ruthless in their finishing.\nIn Maswanhise, they have a real maverick. The skill he showed for his goal was superb and he often left a wretched Rangers defence in a spin.\nA spark of some sort was always likely to come from Rangers, but when it did, it wasn't as if Motherwell lay down and let them shine.\nThe fight, through the tired legs, was still there late on. All 100-odd minutes of it.\nThere will no doubt be a whack of disappointment at the first disallowed goal especially, where Watt was merely brushing against Butland, but it's another point in a fine Premiership campaign for Kettlewell's side.\nClement made seven changes to the side who beaten 2-1 by St Mirren on Boxing Day in search of a reaction. He didn't get it.\nInstead, his Rangers side were lethargic, limp and lacking confidence in a first-half where they were miles off it.\nChances were created but then, inexplicably swiftly squandered. Efforts which left many in the away end shaking their heads.\nThe welcoming of Celtic in a matter of days was undoubtedly on the mind, but, by failing to deal with the task at hand, the visit of the league leaders is even more daunting.\nIgamane has, once again, staked his claim to start that one. The substitute showed once more he knows his way to goal, unlike Cyriel Dessers and Danilo who missed multiple gilt-edged chances.\nMore questions for Clement, and more questions of the Belgian as the new year beckons.\nMotherwell manager Stuart Kettlewell: \"I'm immensely proud of the players and what they gave us again. The disappointment comes in our start to the second half.\n\"There's a wee bit of disappointment that it's only a point, but no disappointment in the personality, the character and what they showed.\n\"This was always going to be tough but I think we showed an unbelievable effort.\"\nRangers manager Phillipe Clement: \"I took some risks the last couple of weeks, but the squad needs to prove there is enough depth.\n\"It needs to be defensively much, much better than in the last two games.\n\"The fans are frustrated and I understand that because I am frustrated, everyone is frustrated losing these points.\"", "url": "https://www.bbc.com/sport/football/live/c20ez2ypyv5t"}