{"authors": ["Alex Howell", "www.facebook.com"], "date_download": "2025-05-20 14:43:01", "date_modify": "2025-05-20 14:43:01", "date_publish": "2023-07-28 12:17:37", "description": "Chelsea and England defender Ben Chilwell tells BBC Sport how Chelsea are preparing for the season ahead - and outlines his own ambitions.", "filename": "sport_football_66333245_1747752181.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/14D11/production/_130556258_benchilwell.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66333245_1747752181.html", "title": "Chelsea: Ben Chilwell on leadership and life under Mauricio Pochettino", "title_page": "Chelsea: Ben Chilwell on leadership and life under Mauricio Pochettino - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England defender Ben Chilwell says he's \"not going to run\" away from Chelsea after the club's struggles - and that being one of the most senior players makes him want to \"set an example\" to the young members of the squad.\nChelsea finished last season in the bottom half of the table for the first time since the 1995-96 season.\nIt was a season in which the club sacked managers Thomas Tuchel and Graham Potter while Bruno Saltor and Frank Lampard had interim stints in charge.\nHowever, it's a clean slate for everyone at Stamford Bridge following the appointment of Mauricio Pochettino.\nThe former Paris St-Germain and Tottenham manager has taken his young squad on a tour of the USA and full-back Chilwell, who signed a new contract in April, is the third oldest outfield player of the 29 players to travel.\n\"I've been told that quite a lot recently. I don't like hearing that at 26 years old,\" he joked.\nChelsea have a plan to sign young talent that have potential to be future stars of world football, while clearing out their bloated squad following a £600m spend in the past two transfer windows.\nIn the first pre-season match against Wrexham in North Carolina, the average age of the starting line-up was just over 19-years-old and Chilwell feels he has a responsibility to make sure that the young players understand the \"demand\" of playing for Chelsea.\n\"There's only a number of us that were here last season so we really feel more responsibility to be the leaders in the group, to help these younger players and lead by example on the pitch,\" Chilwell said.\n\"There's a lot of players here that are very talented but we also need to make sure that they know playing for Chelsea means that we do have to win trophies.\"\nOne of the players Chilwell wants to encourage is Ukraine winger Mykhailo Mudryk, 22, the £89m January signing whose performances - so far - have arguably failed to live up to expectation.\nChilwell says the undoubtedly talented forward has been \"on fire\" in training this summer.\n\"I just see endless bags of potential that haven't been fulfilled yet. I've told him that,\" Chilwell said.\n\"I want to try and help him fulfil that.\"\nPochettino has said that he is not going to name a club captain until he's had a chance to look at the players in his squad ahead of Chelsea's opening Premier League match against Liverpool on 13 August. But could Chilwell's leadership traits put him in the running?\n\"I would love to be captain. I'm sure you've had that answer off a few of the players,\" he said.\n\"I was captain of the youth team at Leicester and thoroughly enjoyed it. I think it brings the best out in me and my game, having a little bit more pressure and trying to help people around me. I think it's one of my strengths.\n\"I don't think you need an armband to be a leader though, so whether I get it or I don't I'll continue to do what I'm doing,\" he added.\nDuring his tenure as interim manager last season, Lampard said \"standards had dropped\" and the squad were not fit enough - and Chilwell says looking back, he agrees.\n\"Last season we weren't fit enough, if we're being honest. Obviously there were way too many injuries, personally and as a team, which potentially comes down to fitness levels.\"\nBut things are already changing under the new boss, who is renowned for making his players work hard in pre-season.\n\"This pre-season so far, seeing the way we're working, you can now look back and say 'I wasn't as fit last season as I am now',\" said Chilwell.\n\"The first week was a bit of a shock for everyone!\"\nBut the management skills of Pochettino and his staff are helping to shape a unified team too.\n\"They take a lot of time personally to talk to you. Not even about football things - family life, what you enjoy doing away from football, your favourite TV series, what book you're reading. They take a lot of time to get to know you personally, which makes you feel like you want to go that extra yard, do that extra run, because you feel like there's more of a personal connection.\"\nChilwell is determined to lead the club back to the top end of the table.\n\"I won the Champions League in my first season and after that, seeing the reaction that it brought around the club, I want to feel that again with Chelsea - not just in football but with Chelsea.\n\"I want to help Chelsea get back to winning titles and winning cups.\n\"I am not going to run when things are going badly. I want to be one of the reasons that helps us get back to the best.\"", "url": "https://www.bbc.com/sport/football/66333245"}