{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:16:07", "date_modify": "2025-05-21 04:16:07", "date_publish": "2025-04-05 18:34:30", "description": "Yorkshire captain Jonny Bairstow leads from the front to rally his side on day two of their County Championship clash with Hampshire.", "filename": "sport_cricket_articles_cx20wyx7l1yo_1747800967.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f51a/live/e74e2560-124f-11f0-a75c-b716eb718e3b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cx20wyx7l1yo_1747800967.html", "title": "County Championship: Yorkshire fight back but Hampshire on top", "title_page": "County Championship: Yorkshire fight back but Hampshire on top - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Yorkshire captain Jonny Bairstow led from the front to rally his side on day two of their County Championship clash with Hampshire.\nBairstow struck 56 in an innings which mixed good fortune and international level shot-making, as he and Adam Lyth put on 105 to turn the first-innings deficit into a 61-run lead by close.\nLyth ended the day unbeaten on 57, having scored his fifty in a career-slow 176 deliveries, and Brad Wheal took 4-41.\nBen Brown had earlier been left stranded on 49 as George Hill and Jack White both took three wickets each to stem Hampshire's advantage.\nIf the first day of captaincy had its struggles, the second was closer to ideal for Bairstow - other than an inside edge into his own groin.\nThe first wicket of the day was not from Bairstow's captaincy handbook, as Toby Albert was left flat-footed by Liam Dawson wanting a quick single and Will Luxton swooped to run him out.\nFrom then on, it was a 'bowl straight, hit the batter on the pads, and appeal' spell as the last four Hampshire wickets fell lbw – one for Dom Bess, one for White, one for Ben Coad, and one for Hill, who ended with 3-36.\nYorkshire had barely missed fast bowler Ben Cliff, who was absent with a damaged side.\nThat left Hampshire one run shy of a bonus point, and Brown stranded on 49 after a fine attacking innings marshalling the tail during his first match as club captain.\nBrown's disappointment would have been reversed as a potential two-day finish looked a distinct possibility when Brad Wheal whipped out two early wickets.\nFin Bean got an on drive very wrong to chip to mid-on, before James Wharton had the ball speared into his pads next ball. But Dawid Malan let the hat-trick ball sail past his off-stump.\nYorkshire barely put a foot wrong in the remaining 63 overs of the day as they slowly but surely cancelled out their deficit and created a foothold to turn the match around.\nLyth took 74 balls to reach double figures, with his first boundary not coming until the 61st over - the 123rd ball he had faced.\nAs in the first innings, Malan looked comfortable, reached the 30s and then failed to live up to his potential as he prodded behind off Wheal.\nAt 53-3, and still behind by 75 runs, Bairstow came to the crease and quickly unfurled a luscious cover drive. But there were three lives before he had reached 20.\nFirstly, Dawson spilled a caught and bowled, then Nick Gubbins had the ball bounce off his head and for six, before Gubbins' substitute Joe Weatherley dropped a tough diving catch with the following delivery.\nBut after that it was the typically pugnacious and determined Bairstow that stuck around to pick up his 102nd first-class half-century in 92 balls.\nHe was eventually bowled by Sonny Baker – who also dismissed him in the first innings – before Hill followed four balls later.\nLyth sluggishly reached 50 in 176 balls, but also lost Luxton - caught down the legside - before the close.", "url": "https://www.bbc.com/sport/cricket/articles/cx20wyx7l1yo"}