{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:33:39", "date_modify": "2025-05-19 15:33:39", "date_publish": "2017-07-04 08:49:40", "description": "Leicester City sign midfielder Vicente Iborra from Sevilla for a reported £10.5m.", "filename": "sport_football_40491372_1747668819.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5509/production/_96796712_iborra_getty2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_40491372_1747668819.html", "title": "Leicester sign midfielder Vicente Iborra from Sevilla", "title_page": "Leicester sign midfielder Vicente Iborra from Sevilla - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Leicester have signed Sevilla captain Vicente Iborra for an undisclosed fee, believed to be £10.5m.\nThe 29-year-old midfielder, who helped Sevilla win three successive Europa League titles after joining them in 2013, has signed a four-year deal.\nThe Spanish side announced a deal had been agreed, external earlier this week.\nIborra played against Leicester in both legs of the Champions League tie last season when the Foxes knocked out the La Liga side in last 16.\nHe has made 172 appearances for Sevilla, scoring 30 goals, since joining them from Levante.\nSpanish media have said the fee is in the region of 12 million euros (£10.5m).\n\"I'm starting to hit a certain age, trains pass and it was the moment to take it,\" Iborra told Sevilla's website., external\n\"Destiny is fickle, but it's a project that I find very attractive.\"\nThe defensive midfielder has been allowed to leave after the club re-signed Ever Banega from Inter Milan.\n\"Iborra has shown exemplary behaviour in his time at the club and has won the unanimous respect and love of all Sevilla fans,\" Sevilla said in a statement.\n\"His achievements with the club are colossal but he will also be remembered for his leadership on and off the pitch, and for the dignity with which he wore the captain's armband.\"", "url": "https://www.bbc.com/sport/football/40491372"}