{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:20:32", "date_modify": "2025-05-21 07:20:32", "date_publish": "2025-05-20 08:34:27", "description": "England wicketkeeper-batter Jonny Bairstow will replace Will Jacks at Mumbai Indians if they qualify for the play-off stages of the Indian Premier League.", "filename": "sport_cricket_articles_c2e337r9ejjo_1747812032.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3e16/live/9267d3f0-354c-11f0-b7a7-db7402bc2830.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c2e337r9ejjo_1747812032.html", "title": "Jonny Bairstow to replace Will Jacks at Mumbai Indians in IPL", "title_page": "Jonny Bairstow to replace Will Jacks at Mumbai Indians in IPL - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England wicketkeeper-batter Jonny Bairstow will replace compatriot Will Jacks at Mumbai Indians if they qualify for the play-off stages of the Indian Premier League.\nJacks is expected to return to England to play in the one-day series against the West Indies, which starts on Thursday, 29 May.\nThe IPL had to be paused amid political tension between India and Pakistan and the tournament's rescheduling resulted in it clashing with England's series.\nThe IPL resumed on Saturday and the play-offs begin on 29 May, with the final taking place on Tuesday, 3 June.\nMumbai Indians are in the fourth and final qualifying spot for the play-offs with two games left in the league phase.\nThey have also brought in English bowler Richard Gleeson and Sri Lanka all-rounder Charith Asalanka to replace South African duo Ryan Rickelton and Corbin Bosch, who are also leaving for international duty with their country prior to the play-offs.\nAn IPL statement said, external Yorkshire player Bairstow, 35, will join Mumbai Indians for 5.25 crore Indian rupees (£458,000), while Lancashire's Gleeson will join for 1 crore INR (£87,000).\nYorkshire said, external Bairstow would miss their next County Championship match against Nottinghamshire and up to two Vitality Blast games depending on Mumbai Indians' progress.\n\"Whilst it is naturally disappointing to lose Jonny for the next few weeks, the opportunity for him to play in the final stages of the IPL at this stage in his career is huge,\" said Yorkshire general manager of cricket Gavin Hamilton.\n\"Jonny has been open with us around his desire to play in the IPL from our very first conversation with him, and we'd like to wish him the best of luck in the coming weeks.\n\"We look forward to welcoming him back for the early stages of our Vitality Blast campaign.\"", "url": "https://www.bbc.com/sport/cricket/articles/c2e337r9ejjo"}