{"authors": ["Brent Pilnick", "www.facebook.com"], "date_download": "2025-05-21 04:55:06", "date_modify": "2025-05-21 04:55:06", "date_publish": "2025-04-04 14:55:21", "description": "Harlequins winger Rodrigo Isgro is banned for three weeks for a dangerous tackle on Bath winger Joe Cokanasiga.", "filename": "sport_rugby-union_articles_c4g8pj38j63o_1747803306.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c69c/live/72e01d10-1163-11f0-ba60-99b08c2860b3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c4g8pj38j63o_1747803306.html", "title": "Rodrigo Isgro: Harlequins winger banned for dangerous tackle", "title_page": "Rodrigo Isgro: Harlequins winger banned for dangerous tackle - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Harlequins winger Rodrigo Isgro has been banned for three weeks for a dangerous tackle on Bath winger Joe Cokanasiga.\nThe Argentina back was cited after being yellow-carded for the head-on-head contact in the fourth minute of the game.\nIsgro failed a head injury assessment while he was in the sin bin and did not return to the field of play.\nThe head injury means Isgro is unavailable for Saturday's European Champions Cup trip to Leinster, so that match will not count towards his suspension.\nAn independent disciplinary panel judged his tackle met the threshold for a red card and that his ban will begin next week, should Harlequins reach the Champions Cup quarter-final on 11 April.\nIt will then include the London side's Premiership game with Sale a week later.\nShould Quins be knocked out of Europe in Dublin on Saturday Isgro would also miss the following weekend's game with Leicester.\nIsgro can have his ban reduced by a week if he completes World Rugby's Coaching Intervention Programme - if he does not complete it and Quins are knocked out of Europe by Leinster he would also miss his side's Premiership game with Gloucester on 10 May.", "url": "https://www.bbc.com/sport/rugby-union/articles/c4g8pj38j63o"}