{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:44:57", "date_modify": "2025-04-26 06:44:57", "date_publish": "2025-03-01 15:59:27", "description": "Ireland prop Cian Healy says he is \"thankful\" for the 10 extra years in his career after announcing his retirement from the sport.", "filename": "sport_rugby-union_articles_c62xxyljwk6o_1745649897.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/823c/live/d24a7b70-f5bf-11ef-9aa5-8f9f2163b0a2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_c62xxyljwk6o_1745649897.html", "title": "Cian Healy: Retiring Irish prop grateful for 10 extra years after neck injury", "title_page": "Cian Healy: Retiring Irish prop grateful for 10 extra years after neck injury - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Ireland prop Cian Healy says he is \"thankful\" for the 10 extra years in his career after announcing his retirement from the sport.\nHealy, who is Ireland's record cap holder, will end his international career after the Six Nations and call time on Leinster at the end of the season.\nThe 37-year-old said he was \"grateful\" that he was still playing after a neck injury almost ended his career in 2015.\nHe lost movement in his right hand after a damaged disk in his neck, but he recovered and overtook Brian O'Driscoll as Ireland's most-capped player against Australia in November.\n\"After that I had a different approach to rugby and how I spent my time and how much effort I put into rugby,\" said Healy.\n\"When that's nearly been taken away from you, you get a little bit more thankful for those opportunities.\n\"You manage to enjoy it a little bit more and I've managed to squeeze 10 years of enjoying it a bit more.\n\"It's all been good since then. I've been up and down and all around the pecking order, but it's still better than not doing it.\"", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/c62xxyljwk6o"}