{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:25:55", "date_modify": "2025-05-20 14:25:55", "date_publish": "2023-07-29 12:01:13", "description": "England midfielder Keira Walsh did not suffer an anterior cruciate ligament injury against Denmark in the Women's World Cup.", "filename": "sport_football_66347697_1747751155.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/66D8/production/_130582362_gettyimages-1559607061.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66347697_1747751155.html", "title": "Women's World Cup: Keira Walsh injury is not ACL, scan shows", "title_page": "Women's World Cup: Keira Walsh injury is not ACL, scan shows - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England midfielder Keira Walsh did not suffer an anterior cruciate ligament injury against Denmark in the Women's World Cup.\nWalsh, 26, was taken off the pitch on a stretcher in England's 1-0 victory, prompting concerns she could miss the remainder of the tournament.\nBut a scan has allayed fears of an ACL injury for the Barcelona player, who is a key figure for England.\nShe will however miss Tuesday's final group game against China in Adelaide.\nThe Football Association said Walsh will remain at England's base camp near Terrigal beach during her recovery and her knee issue will \"continue to be assessed\".\nWalsh, who moved to Barcelona last summer for a women's world record transfer fee, played a crucial role in England's Euro 2022 title win, appearing in all but four minutes of their campaign.\nThe Lionesses are already without captain Leah Williamson and forward Beth Mead due to ACL injuries they suffered during the Women's Super League season, while attacking midfielder Fran Kirby is also sidelined with a knee problem.\nEngland can secure their place in the last 16 of the Women's World Cup on Tuesday and will progress as Group D winners if they avoid defeat by China.\nEmma Sanders, BBC Sport reporter in Australia\nAs soon as Walsh went down against Denmark and signalled to the dugout, clearly in pain, there were fears she would join Williamson and Mead as absentees with ACL injuries, considered one of the worst injuries you can suffer as a footballer.\nShe had tears in her eyes when she was taken off on a stretcher and the mood in the stadium was immediately dampened as fans watched on anxiously.\nThis will be welcome news for Lionesses' fans but they will remain anxious until learning the full extent of her injury.\nShe has long been considered one of England's most crucial players - the link between attack and defence, the one fulcrum switches play and who keeps everything secure in front of the back four.\nWalsh's quality became so renowned that she earned a world-record transfer move to Barcelona last summer after a Player of the Match performance in the Euro 2022 final.\nShe played such an integral role for England that many teams adapted their game plan to try to limit her involvement, something Denmark boss Lars Sondergaard admitted doing prior to her injury.\nEngland do not have many experienced midfield options they can replace her with aside from Aston Villa's Jordan Nobbs, who has 71 caps, but she is a far more attack-minded player.\nThere is still plenty of quality in Sarina Wiegman's squad but Walsh's absence would undeniably make England's challenge of winning their first Women's World Cup considerably tougher.", "url": "https://www.bbc.com/sport/football/66347697"}