{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:14:46", "date_modify": "2025-05-20 14:14:46", "date_publish": "2023-07-29 19:02:31", "description": "Catalans Dragons open up a four-point gap at the top of Super League with thumping victory over Salford.", "filename": "sport_rugby-league_66301909_1747750486.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/17E92/production/_130583979_6s4a8784.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-league_66301909_1747750486.html", "title": "Super League: Catalans Dragons 42-0 Salford Red Devils - Leaders open up four-point gap", "title_page": "Super League: Catalans Dragons 42-0 Salford Red Devils - Leaders open up four-point gap - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Catalans Dragons opened up a four-point gap at the top of Super League with victory over a Salford side beset by issues in the south of France.\nDragons took 19 minutes to post the first points but two Adam Keighran tries, plus scores from Tom Johnstone and Tyrone May built a half-time lead.\nJohnstone was set away for his second and Tiaki Chan extended the lead before Sam Tomkins added a seventh try.\nSalford failed to score a point and slipped to a fifth loss in a row.\nWhile Salford fell to a first scoreless league defeat since May 2021, with seven rounds left to play before the play-offs, Catalans are showing the kind of ruthlessness Steve McNamara hopes will take them one step further than 2021's Grand Final loss to St Helens.\nAgainst a Red Devils side without King Vuniyayawa after travel issues, and Tyler Dupree following his move to Wigan, there was no mercy once the deadlock had been broken against a spirited opponent.\nMicky McIlorum gave Catalans perfect service from dummy half, providing scores for Keighran and May, while Johnstone took his tally for Super League to 24 by taking a dink to the corner and finishing off a searing break.\nChan's try was the result of Mitchell Pearce and May combining in the halves, Tomkins also lurking with threat and crossing after Romain Navarrete's surge.\nSalford still created chances, with Brodie Croft and Ryan Brierley always a danger, but execution let them down in good areas, and Catalans winger Tom Davies was sin-binned when he halted one such break with Joe Burgess in flight.\nCatalans boss Steve McNamara:\n\"It was a very, very difficult match, especially in the first 25 minutes where Salford made it very hard for us.\n\"It was potentially a good day to play Salford for lots of reasons and I know their coach won't make excuses but they had an extremely difficult week.\n\"They are a dangerous team and they have hurt us on numerous occasions, scoring lots of points against us, so it was good to get the result.\n\"We had spoken about this before the game and our leaders, Mitchell Pearce, Sam Tomkins and Michael McIlorum were huge for us once again with their experience and control.\"\nSalford head coach Paul Rowley:\n\"The heat was really draining, but it's the same for both sides, it's just that Catalans coped better with the conditions.\n\"In conditions like this you need to be disciplined with the ball, but I thought we were just ill-disciplined and that led to a weight of possession, territory and ultimately the ill-discipline with the ball translated to ill-discipline in defence, because you are trying to rescue a situation in heat like this and something's got to give.\n\"The challenge for us going forward is to be mentally tougher and have more discipline with the ball which will translate into defence.\n\"We are not looking for any excuses over being down on numbers, we won't play the victim at all.\"\nCatalans: Tomkins; Davies, Ikuvalu, Keighran, Johnstone; May, Pearce; Navarrete, McIlorum, McMeeken, Seguier, Whitley, Garcia.\nInterchanges: Bousquet, Chan, Dezaria, Ma'u\nSalford: Brierley; Sio, Cross, Costello, Burgess; Croft, Atkin; Ormondroyd, Bourouh, Gerrard, Hellewell, Stone, Partington.\nInterchanges: Ackers, Dixon, Sidlow, Greenwood\nReferee: Marcus Griffiths.", "url": "https://www.bbc.com/sport/rugby-league/66301909"}