{"authors": ["Andrew Petrie", "www.facebook.com"], "date_download": "2025-04-26 07:30:06", "date_modify": "2025-04-26 07:30:06", "date_publish": "2025-02-27 17:59:51", "description": "Has Hibs striker Bowie earned Edinburgh derby start?", "filename": "sport_articles_c3w115lqx84o_1745652606.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2042/live/8c35df20-f534-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_c3w115lqx84o_1745652606.html", "title": "Has Hibs striker Bowie earned Edinburgh derby start?", "title_page": "Has Hibs striker Bowie earned Edinburgh derby start? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "While Hibs have scored the third-highest number of goals in the Premiership, they have lacked a consistent threat at the top end of the park.\nMykola Kuharevich has flattered to deceive in his second spell at the club, while 35-year-old Dwight Gayle admitted his \"body's breaking down\" and has spoken of this being his farewell campaign.\nThere is a shirt to be claimed up front and, with the league race entering the final straight, head coach David Gray might have found his man - Kieron Bowie.\nThe 22-year-old arrived last summer and made four substitute appearances, scoring once, before getting injured on Scotland Under-21 duty, much to the annoyance of Hibs fans.\nThey'd seen enough in that short spell to convince them the former Fulham forward could have a big season and now he's finally back fit, he's gone about proving them right.\nIn one of his first games back, he flicked on a throw-in for Rocky Bushiri to head in the winner against Ayr United and put them through the Scottish Cup quarter-finals.\nBowie then made his first start in last weekend's 2-1 win over Celtic. He was an absolute pest to the champions' defence, winning four fouls and battling in 19 total duels, 10 of which were in the air.\nNot yet fit enough to start two games in four days, he came off the bench against Dundee United to put Hibs ahead in the 90th minute, before fellow sub Junior Hoilett made sure of the win deep into stoppage time.\nIt was a fantastic finish too, running on to Nectar Triantis' through ball, sliding to get the shot away, and lashing it into the top corner with venom.\nCould Sunday's Edinburgh derby be the perfect stage for Bowie to properly announce himself as Hibs aim to extend a 14-game unbeaten streak?\nOf course, Kuharevich also got on the scoresheet against United, with a fine back-post header that levelled the scores at Tannadice. The Ukrainian has just four goals in 14 starts this season and Wednesday night was his first league start since November.\nGayle, who scored the winner at Tynecastle in the Boxing Day derby, also has just four goals, with his last strike coming against St Johnstone on 2 January.\nGray is sure to be tempted to partner Bowie with current captain and top marksman Martin Boyle (seven goals) after their impressive showing at home to Celtic but has mixed and matched his options well during this impressive run.", "url": "https://www.bbc.co.uk/sport/articles/c3w115lqx84o"}