{"authors": ["Brent Pilnick", "www.facebook.com"], "date_download": "2025-04-26 04:24:39", "date_modify": "2025-04-26 04:24:39", "date_publish": "2025-03-03 12:36:31", "description": "Plymouth boss Miron Muslic reflects on his side's FA Cup loss at Manchester City and his \"wonderful\" post-match meeting with Pep Guardiola.", "filename": "sport_football_articles_cq8y5wv0vp4o_1745641479.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1119/live/9b889210-f822-11ef-8e9e-47bc43726032.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cq8y5wv0vp4o_1745641479.html", "title": "Plymouth Argyle boss Miron Muslic on Manchester City's 'wonderful' Pep Guardiola", "title_page": "Plymouth Argyle boss Miron Muslic on Manchester City's 'wonderful' Pep Guardiola - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "\"He told me before kick-off, 'Miron, forget about the wine. I know you're not a drinker, but a Fanta is ready'.\"\nMost football managers pop a post-match cork with their counterparts.\nBut Plymouth Argyle head coach Miron Muslic popped open a can with Manchester City boss Pep Guardiola after Saturday's FA Cup fifth-round tie at Etihad Stadium.\nAfter his side shocked Liverpool in the previous round, Argyle's Austrian boss said he would celebrate with a bottle of the fizzy orange drink and some nachos.\nAnd someone had clearly told Guardiola.\n\"We spent almost 45 minutes after the game in his office so the Fanta was ready for me and a big, big bottle of Italian wine was there for the staff,\" Muslic told BBC Sport.\n\"We simply enjoyed the company and the hospitality of one of the greatest coaches in sports history. It was a wonderful experience.\"\nBefore his side's 3-1 loss to the seven-time Cup winners, Muslic had told how he revered the Spaniard as one of the best coaches in world football.\nPlymouth - who are second from bottom of the Championship - impressed in the defeat, taking the lead and only falling behind with 14 minutes to go against the reigning Premier League champions.\nIt brought to an end an amazing cup run for the second-tier strugglers, who won 1-0 at Brentford in the third round before upsetting runaway Premier League leaders Liverpool by the same score last month.\nAnd even though their careers could not be further apart - former Spain midfielder Guardiola has led Barcelona and City to Champions League glory while Muslic spent much of his time as a player in lower-league Austrian football before going into coaching - the Argyle boss says there was a strong connection between them.\n\"It was just a mix of everything because in this case we are still colleagues, even though this guy has won purely everything in world sport and I nothing,\" Muslic said.\n\"The whole staff was there and we just had a really beautiful time - when Pep is speaking, you have to listen and I think we all listened.\"\nMuslic hopes the connection he made can stand him and, more importantly, Argyle in good stead in future.\nThe Pilgrims have been a good staging post for a number of young Premier League players who have gone on to have good careers so forging a bond with a club such as Manchester City would be beneficial.\n\"It's football and this is a very small world and in the end a relationship and connections are very, very important,\" Muslic added.\n\"Good people are always easy to connect, so maybe this can be also a benefit for the future for Argyle.\"\nBut now the dust has settled on a famous FA Cup run, attention turns back to the league.\nThe Pilgrims opted to stay in the north of England after the cup tie rather than return home before their game at Hull City on Tuesday night.\nThe game has huge relegation ramifications for both sides - the Tigers are three points above Argyle and have a superior goal difference so defeat on Humberside would be a huge blow for Plymouth and Muslic.\nBut, should Argyle claim a first away league win this season, it would further boost the belief of a team that looked doomed when Wayne Rooney left as manager on New Year's Eve, with the side bottom of the table having won just once in 14 games.\n\"I'm very happy this beautiful journey is behind us so we can refocus and find the right balance again to bounce back,\" Muslic said.\nAnd he hopes for a repeat of the kind of result they produced after their previous cup tie, when they followed up beating Liverpool by thrashing Millwall 5-1.\n\"Just three days later we needed to rebalance ourselves after that historical win and historical day to face Millwall and to be again super competitive,\" Muslic recalled.\n\"The lads managed to do this in a very, very strong way and I think we need to have the same approach for Tuesday and also for Saturday.\n\"The FA Cup gave us a lot and we should take all these good things, the benefit of the FA Cup, into this competition [the Championship].\n\"If we can manage to do this, we will be again very hard to play.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cq8y5wv0vp4o"}