{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:59:36", "date_modify": "2025-05-21 05:59:36", "date_publish": "2025-01-31 14:01:07", "description": "Manchester United head coach Ruben Amorim says the club must \"take advantage\" of their academy by selling players.", "filename": "sport_football_articles_c0m1pgl4pr3o_1747807176.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8152/live/29412580-dfd8-11ef-8899-07ba6c6a90c6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c0m1pgl4pr3o_1747807176.html", "title": "Man Utd must 'take advantage' of academy sales, says boss Ruben Amorim", "title_page": "Man Utd must 'take advantage' of academy sales, says boss Ruben Amorim - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester United head coach Ruben Amorim says the club must \"take advantage\" of their academy to help their financial situation.\nThe Red Devils beat Romanian side FCSB 2-0 in the Europa League on Thursday, with goals from Kobbie Mainoo and Diogo Dalot.\nUnited's second goal came when academy product Alejandro Garnacho set-up Mainoo, who joined the club at the age of nine, to score.\nThe pair have both been linked with exits from Old Trafford, as selling them would significantly ease United's profit and sustainability outlook.\nWhile not specifically referring to Garnacho or Mainoo, Amorim says one advantage of a thriving academy is that players can be sold to raise funds.\n\"I want players like Kobbie [Mainoo] and [Alejandro] Garnacho,\" said Amorim.\n\"The focus is that we have to improve the academy and we have to bring more [players through].\n\"That is something that all of the clubs in England have to take advantage [of]. the players that come from the academy.\n\"To play, to feel the shirt and to sell. Our focus is to bring more, the rest I just want to prepare with both of them the next game.\"", "url": "https://www.bbc.com/sport/football/articles/c0m1pgl4pr3o"}