{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:09:32", "date_modify": "2025-05-21 04:09:32", "date_publish": "2025-04-06 13:22:58", "description": "Sheffield Wednesday manager Danny Rohl says his side showed enough desire to beat Hull City, despite their 1-0 defeat.", "filename": "sport_football_articles_cdde95edrpyo_1747800572.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6c4b/live/3a1ee450-12e1-11f0-b182-81b971f8bd66.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cdde95edrpyo_1747800572.html", "title": "Sheffield Wednesday: Danny Rohl pleased with players after tough week", "title_page": "Sheffield Wednesday: Danny Rohl pleased with players after tough week - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Sheffield Wednesday boss Danny Rohl said his side showed enough desire to beat Hull City, despite their 1-0 defeat on Saturday.\nCharlie Hughes scored a 94th-minute winner to ease the Tigers' Championship relegation fears.\nBut Rohl credited his players' effort in the game after they were not paid last week amid growing uncertainty at board level.\n\"Big credit to my team, to take this tough week, to stay here and go again, to fight again for our club,\" he told BBC Radio Sheffield.\n\"It took time to come into it, but in the second half it was one direction.\n\"It's hard, but the key message for me is that this team has big, big character and big, big belief. A lot of players take all the setbacks again and again and it makes me very proud.\"\nRohl said he never doubted his players' motivation, but also admitted the club is not ready for the play-offs this season, as they sit eight points adrift of sixth place.\n\"The motivation comes from the inner circle, there's no question mark. The emotional level was there - they want to fight, they want to go and do everything, but you can understand what it means for this group,\" he added.\n\"It makes no sense to speak about the play-offs. We should be honest, and we're not ready for the play-offs.\n\"We did an outstanding job and felt we were always close, but in the second half of the season in all these tight games, we could have won maybe six home games, but we didn't.\"", "url": "https://www.bbc.com/sport/football/articles/cdde95edrpyo"}