{"authors": ["Clive Lindsay", "www.facebook.com"], "date_download": "2025-05-20 11:42:28", "date_modify": "2025-05-20 11:42:28", "date_publish": "2023-08-06 14:05:35", "description": "St Mirren hand Stephen Robinson his first-ever win on a Scottish Premiership opening day - and first at Easter Road as a manager - as they win a thriller against Hibernian.", "filename": "sport_football_66194774_1747741348.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/D879/production/_130671455_olusanya2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66194774_1747741348.html", "title": "Hibernian 2-3 St Mirren: Late Alex Greive goal thwarts hosts' two-goal fightback", "title_page": "Hibernian 2-3 St Mirren: Late Alex Greive goal thwarts hosts' two-goal fightback - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Alex Greive settled a five-goal thriller as St Mirren thwarted Hibernian's late two-goal fightback to hand St Mirren's Stephen Robinson his first-ever win on a Scottish Premiership opening day - and first at Easter Road as a manager.\nFrom the moment Mark O'Hara slotted a 15th-minute penalty and Toyosi Olusanya sped clear to slot two minutes later, the hosts looked shell-shocked.\nLee Johnson's side recovered to come storming back after the break and substitute Adam Le Fondre's first Hibs goal and Christian Doidge's close-range finish looked to be sending the Edinburgh side into Thursday's Europa Conference League qualifier against Luzern in greater heart.\nBut Greg Kiltie's superb cross was headed home by New Zealand striker Greive to secure St Mirren a fourth consecutive win.\nHibs made a lively start, but the sunshine enveloping Easter Road was soon enveloped in clouds of home despair as St Mirren midfielder Greg Kiltie went down under a Joe Newell challenge.\nAfter a VAR check, referee Euan Anderson decided the midfielder got the slightest of touches on Kiltie's foot and O'Hara sent Marshall the wrong way from the penalty spot.\nShaken Hibs had no time to clear their heads as the St Mirren midfielder followed up his goal with a defence splitting pass that sent Olusanya speeding clear of the home defence to slot low under the goalkeeper.\nOlusanya had not expected to start, but the former Middlesbrough striker who was on loan to Arbroath last season was making the most of being a late replacement after Mikael Mandron was injured in the warm-up.\nIt was Doidge who inspired the comeback by superbly setting up veteran Le Fondre for a precise low finish before the Welsh striker was on hand to divert home Elie Youan's powered delivery.\nBoth sides had further chances in a storming finish, but it was Greive who was to win it for St Mirren.\nA tactical masterplan from Robinson and a stroke of luck combined to give the visitors the upper hand.\nThe luck came in the shape of the forced introduction of the speedy Olusanya and the Englishman exploited Hibs' lack of pace in central defence.\nSt Mirren also targeted Allan Delferriere, the former Standard Liege midfielder being asked to deputise at right-back, and it led to the out-of-sorts Belgian being withdrawn after only 29 minutes along with Josh Campbell.\nThose Hibs changes, and the introduction of 36-year-old journeyman Le Fondre, looked to be have swung a pulsating second half the way of Lee Johnson and his side.\nHowever, just when they looked like they were going to match their European Jekyll and Hyde act and take all three points, the frailties exposed by part-timers Inter Club D'Escaldes in Andorra came back to haunt them.\nFor St Mirren, the recovery mode continues after the dismal defeat by Montrose that started their season in the Viaplay Cup and ending a run of three straight losses at Easter Road will give them renewed belief that they can match last season's top-six finish.\nHibernian manager Lee Johnson: \"It was a poor start from us. We certainly weren't expecting it off a very good performance in Europe and the boys were well rested.\n\"The reality is we were not at the races and they were in that first 20-30 minutes and we found ourselves 2-0 down through sloppiness- a domino effect of errors. I don't like making subs in the first half because you're effectively admitting you got it wrong, or individuals aren't where they need to be, but something had to happen and it was a bit of a catalyst.\"\nSt Mirren manager Stephen Robinson: \"First half, we were excellent. To come here and dominate like we did, to create the chances we did, the game could potentially have been over before half-time.\n\"If Toyosi Olusanya gets fitter and keeps doing what he's good at, which is running in behind, he's going to scare a lot of defenders this season. Alex Greive will have been upset not to get a chance from the start and he comes on to score the winner. It shows how together we are as a squad.\"", "url": "https://www.bbc.com/sport/football/66194774"}