{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:42:08", "date_modify": "2025-05-20 11:42:08", "date_publish": "2023-08-06 18:54:47", "description": "Man Utd: Erik ten Hag praises resilience after late draw with Athletic Bilbao", "filename": "sport_articles_cg34dvmz4x9o_1747741328.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/556b/live/949862d0-348a-11ee-9a83-b3b28a08b871.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cg34dvmz4x9o_1747741328.html", "title": "Man Utd: Erik ten Hag praises resilience after late draw with Athletic Bilbao", "title_page": "Man Utd: Erik ten Hag praises resilience after late draw with Athletic Bilbao - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester United manager Erik ten Hag reflected on a \"good weekend\" as the Red Devils followed Saturday's win over Lens at Old Trafford with a 1-1 draw against Athletic Bilbao in Dublin.\nUnited needed a late Facundo Pellistri equaliser to avoid defeat by the Spanish side, but Ten Hag told MUTV, external that the last-gasp leveller showed the \"resilience\" of his team.\n\"We don’t give up, we fight until the end,\" he said. \"Finally, we got the equaliser and I thought it was justified.\n\"We wanted a good result to finish the pre-season well. We gave a stupid goal [away] and went down. It was a giveaway, but as a team we showed character and that’s what we need for the season.\"\nTen Hag continued: \"In one weekend, two times we are losing but you see this team has character and that’s what you need in a season as well. Sometimes you are down and then you have to show resilience and especially in such moments you need determination. We have shown that this weekend, it was a good weekend for us.\n\"[On Saturday] I thought it was a very good level, today I have seen also very good spells. I think the start of the game was also very good and we should have scored a goal to go up, because it was a great chance from Jadon Sancho. We had some good moments after that as well and it was stupid how we went down but as I said, we had a result and we came back so it was a good weekend for us.\"", "url": "https://www.bbc.com/sport/articles/cg34dvmz4x9o"}