{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:28:07", "date_modify": "2025-04-26 04:28:07", "date_publish": "2025-03-02 10:11:22", "description": "Ulster back row James McNabney says the side's 30-28 win over Scarlets on Saturday is \"absolutely crucial\" to keep their United Rugby Championship play-off hopes alive.", "filename": "sport_articles_cp8vklz5zexo_1745641687.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f3c3/live/aac2db80-f761-11ef-8fce-3183a71a7f8c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cp8vklz5zexo_1745641687.html", "title": "United Rugby Championship: Scarlets win means Ulster can still 'salvage' season says James McNabney", "title_page": "United Rugby Championship: Scarlets win means Ulster can still 'salvage' season says James McNabney - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Ulster back row James McNabney said the side's 30-28 win over Scarlets on Saturday was \"absolutely crucial\" to keeping their United Rugby Championship play-off hopes alive.\nRichie Murphy's side had fallen to 15th in the URC standings before the game and were behind in the closing minutes only for Alan O'Connor's late try to snatch the much-needed win.\nThe result saw Ulster rise just one place in the table, but they are now only two points off the play-off spots with six games remaining.\n\"If you look at the league table you would nearly think you're too far away to ever make anything of it,\" said McNabney.\n\"It hasn't gone our way, the season hasn't gone to plan.\n\"We think there's a chance we can salvage something out of this.\"\nThe turning point in the victory over the Scarlets came when the visitors were camped on the Ulster line seeking a try that would have moved them two scores ahead going into the final 10 minutes.\nInstead, the ball squirted out from the ruck, with McNabney on hand to grab it and then hack clear.\nWearing his school socks for the URC's 'Origin Round', the 22-year-old said it was the first time he had put boot to ball in a game since his days at Cambridge House.\n\"My [school] coach said 'I think you should just keep it in your hands and not bother kicking it.' That was the last time,\" he joked.\n\"Don't know if I'll do it again, but it was just what happened.\"\nBefore seeing off the Scarlets Ulster had lost their past two games, both against Italian opposition, and had not won at home in the league since October.\nMcNabney, though, said that the players' commitment has not wavered.\n\"It's all about the heart. When you keep getting beaten, you can't shy away from it,\" he added.\n\"You either ruin your season or you stand up to the fight. I think that's what we did.\n\"You have to keep at it, there's no option.\"", "url": "https://www.bbc.co.uk/sport/articles/cp8vklz5zexo"}