{"authors": ["Andy Gray", "www.facebook.com"], "date_download": "2025-05-21 07:49:29", "date_modify": "2025-05-21 07:49:29", "date_publish": "2025-01-22 07:32:01", "description": "Motorsport Ireland Rally Academy driver Josh McErlean tells BBC Sport NI about his journey to the top tier of the World Rally Championship.", "filename": "sport_motorsport_articles_cn0x0d4l843o_1747813769.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1a1e/live/d3c91a20-d2aa-11ef-8d91-a959e02deee1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_motorsport_articles_cn0x0d4l843o_1747813769.html", "title": "World Rally Championship: Josh McErlean on 'Formula 1 of rallying'", "title_page": "World Rally Championship: Josh McErlean on 'Formula 1 of rallying' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "When Josh McErlean first stepped into a rally car at the age of 11, his dream was to reach the World Rally Championship.\nNow, he is one of the 10 drivers in the world who are preparing to compete at the pinnacle of the sport this year.\nThe 25-year-old from Northern Ireland, who is part of Motorsport Ireland's Rally Academy, will drive a Ford Puma Rally1 for the M-Sport World Rally team.\n\"In terms of motorsport, it's basically the Formula 1 of world rallying,\" McErlean told BBC Sport NI.\n\"You can't get any further up. It's the top level and you are racing the best in the world.\"\nWhen he was a 15-year-old - two years before he could legally drive on a public road - McErlean claimed the Junior 1000 Rally Challenge series and won the 2019 Junior British Rally Championship title.\n\"All young drivers dream of this moment,\" he said as he reflected on his journey.\n\"It's become a reality now and I can't thank everyone enough for their support.\n\"We're in this position now and we have to make the most of it. It's going to be an exciting time ahead.\"\nAlthough plans to graduate to the top tier of the WRC were ramped up after Rally Japan in November, McErlean could not start his preparations until his drive was announced in December - just a month before the opening round in Monte Carlo from 23-26 January.\nBy his own admission \"preparations have been quick and fast\" as he gets up to speed in Rally1 machinery with visits to the team's factory and a test in Monte Carlo.\n\"We just have to short-cut the process so we get up to speed as quickly as possible,\" said McErlean, who will be co-driven by Eoin Treacy.\n\"It will become very real on the Thursday night of Monte Carlo when we are heading up the mountains into the snow.\n\"That will be a surreal moment but one we have to focus on. There's a job at hand and we have to be professional about it.\n\"It is our first year at this level and we will have to learn a lot as we go, but it's exciting to be shoulder to shoulder with the best drivers in the world.\"\nNobody would have blamed the Kilrea driver if he had wished to remain in the second-tier WRC to continue to learn his trade in the sport, but he says once the opportunity to step up presented itself, he had to take it \"with both hands\".\n\"It's probably the most stable time to go into Rally1 cars in the past five years.\n\"It has changed this year with the regulations as hybrid energy has gone out of the cars this year.\n\"It's basically a Rally2 car on steroids. There has also been a change of manufacturer in the tyre compounds from Pirelli to Hankook.\"\nM-Sport, which McErlean says is a \"close-knit family team\" is also the ideal learning environment for a young driver.\nThe Cumbria-based team have not only nurtured talents such as Adrien Fourmaux and Ott Tanak, but had front-running drivers on their books such as Sebastien Loeb, Sebastein Ogier and Craig Breen.\n\"Being in an environment like this is good,\" he added.\n\"They have been there and done it. The engineers are enthusiastic and want to win, and to do the best for everyone involved.\"\nCompeting in all 14 rounds of the WRC will take McErlean and co-driver Treacy all over the world. The season kicks off in the snow-covered mountains at the ionic Rally Monte Carlo.\nFrom there, he will drive between the snowbanks in Sweden, vast Kenyan landscapes and the smooth tarmac of the Canary Islands before more rugged terrain in Portugal, Sardinia and Greece before the end of June.\nThe high-speed gravel roads of Estonia and Finland follow, before a trip to South America for rallies in Paraguay and Chile, and then the Central European Rally.\nThe season ends with a round in Japan, in which McErlean competed last season, and a new rally in Saudi Arabia.\n\"There is so much that goes on behind the scenes,\" he said.\n\"Pacenotes is one thing, but working with engineers and communication is such a huge thing in professional sport. It's about trying to be as efficient as possible when it comes to that there.\n\"The physical and mental side is huge to deal with - the pressure from the junior championships right up to Rally1. It's quite incredible the steps you have to go to be ready.\"\n\"You don't know how often this comes around or how long it will last, either,\" he said.\n\"I think you have to enjoy the process as well as the journey.\n\"It might last forever, but you have to be positive and think the best when you are going through the hard times.\"\nIn terms of expectations, McErlean says his sole focus is to \"learn and enjoy it\".\nAgainst the might of manufacturers Hyundai and Toyota, M-Sport are known as the WRC's underdog team and given McErlean's inexperience he will likely fly under the radar throughout the season.\n\"You can use that to your advantage. You are going to some tough, technical rallies where attrition comes into it a lot.\n\"We're not going to go and drive round either, we want to and have to perform.\n\"We're at that level now and I want to do the best I can for everyone involved.\"", "url": "https://www.bbc.com/sport/motorsport/articles/cn0x0d4l843o"}