{"authors": ["Nizaar Kinsella", "www.facebook.com"], "date_download": "2025-05-21 06:02:32", "date_modify": "2025-05-21 06:02:32", "date_publish": "2025-04-01 16:41:41", "description": "Uefa will examine Chelsea's accounts, after the sale of its women's team to parent company BlueCo turned a pre-tax loss into profit.", "filename": "sport_football_articles_cvgpl0jnpego_1747807352.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d53c/live/d1463ce0-0f10-11f0-aaaa-c522a5fb13c3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cvgpl0jnpego_1747807352.html", "title": "Uefa to assess Chelsea accounts at end of season", "title_page": "Chelsea finances: Uefa to assess Chelsea accounts at end of season - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Uefa will assess Chelsea's sale of its women's team to parent company BlueCo at the end of the season.\nOn Monday, Chelsea reported a pre-tax profit of £128.4m for the year ending June 2024 - their first positive financial results under the ownership of Todd Boehly's Clearlake Capital consortium.\nThat was largely down to the \"repositioning\" of their highly successful women's team as a separate business from the men's team, and followed a similar move in their previous financial results - when the club sold two hotels to a sister company to keep them compliant with the Premier League's profit and sustainability rules (PSR).\nThe Blues have already been cleared of any PSR breaches in January, along with the other 19 top-flight clubs.\nThe current Premier League financial rules do not address associated party transactions (APTs), after clubs were unable to close the loophole after an AGM meeting in June.\nHowever, European football's governing body Uefa has more stringent Financial Fair Play rules which would discount APTs of all its members, including Chelsea's sale of its women's team and two hotels, which were sold for £76.6m during the 2022-23 season.\nThat would vastly weaken Chelsea's position over the three-year monitoring period, with Uefa allowing a maximum £75m loss compared to an £105m loss in the Premier League over the same spell.\nAll cases would have to be assessed individually by Uefa's independent panel. Punishments can come in the form of settlements or fines, but are unlikely to involve severe sporting sanctions.\nIn 2022, Paris St-Germain were among the clubs to face substantial fines for breaching Uefa's FFP rules and were ordered to pay £8.6m.\nChelsea are fourth in the Premier League with nine games left to play, so will likely qualify for one of Uefa's three main competitions and face scrutiny under its jurisdiction.\nThey also faced an £8.6m fine over historic FFP breaches under Roman Abramovich in 2023, which remain under investigation by the Premier League.\nFootball finance expert Kieran Maguire told BBC Sport:\nIt's certainly an unprecedented level of profit which we've not seen before. At the same time, nobody's quite certain how much a women's team is worth.\nChelsea had to submit their accounts to the Premier League by 31 December 2024. The Premier League had two weeks to review them to take things further and decided not to, so it must be satisfied.\nChelsea certainly benefit from being in a very upmarket part of London, so therefore the ability to sell those hotels as real estate assets is more beneficial to them.\nThere has been an enthusiasm from some club owners to outlaw this particular rule. It's not possible to sell your assets to yourself and book profits in the EFL. The rules under Uefa are complex and difficult to understand, but then again it's not guaranteed that Chelsea will be able to utilise these profits.\nUefa tends to fine clubs for breaching the financial rules as opposed to on-field penalties, so if I was a Nottingham Forest or Everton fan I suspect I would feel very aggrieved, because they have been punished severely in terms of historical points deductions for spending money, but spending far less money than Chelsea.\nBut the Premier League owners have decided to allow this particular feature and it does seem strange, but it's their ball and that's how they are choosing to play with it.", "url": "https://www.bbc.com/sport/football/articles/cvgpl0jnpego"}