{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:28:26", "date_modify": "2025-05-21 05:28:26", "date_publish": "2025-04-04 00:00:00", "description": "Listen to live commentary and follow text updates from the first practice and second practice sessions at the Japanese Grand Prix.", "filename": "sport_live_c17qzg5vg84t_1747805306.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/847c/live/8fd4bba0-111e-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_live_c17qzg5vg84t_1747805306.html", "title": "F1 Practice LIVE: Japanese Grand Prix 2025 latest times, results & radio from Suzuka", "title_page": "F1 Practice LIVE: Japanese Grand Prix 2025 latest times, results & radio from Suzuka - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Post\nThat's all from our coverage of Friday practice.\nLet's hope they figure out something to stop that grass from catching fire for tomorrow's final practice, which gets under way at the delightful time of 03:30 BST.\nSet your alarms and joins us then.\nDoohan crash as Suzuka practice stopped four times\nAndrew Benson\nBBC F1 correspondent\nAlpine's Jack Doohan suffered a high-speed crash as Friday practice at the Japanese Grand Prix was punctuated by four red-flag stoppages.\nThe Australian was uninjured in the crash, which initial impressions suggested was caused by the DRS overtaking aid still being open as he entered the 160mph first corner.\nAlpine have not commented on the cause of the incident, saying they are \"assessing\" it.\nDoohan's was the first of four incidents that led to the session being stopped, two of which were for the grass catching fire beside the track.\nMcLaren's Oscar Piastri ended up fastest from team-mate Lando Norris.\nRead the full report here.\n'A strange session'\nAlice Powell\nBritish racing driver on BBC Radio 5 Sports Extra\nThat was a very strange session with a variety of red flags in there.\nDisappointment for Jack Doohan and the Alpine team as they now hope to be able to get the car all fixed up for tomorrow.\nDelight for Oscar Piastri though as he sorted his problems out from first practice.\nPost\nIt will be busy times at Alpine as they look to get Jack Doohan's car ready for the weekend.\nIt hasn't yet been confirmed whether he himself will be fit enough to continue.\nPost\nFour red flags in that session, which prevented teams from getting some proper race simulation runs in.\nThe wind caused more problems than expected as it blew the sparks from underneath the cars on to the very dry grass, resulting in two of those four red flags.\nPost\nWe said the wind had picked up and it seems that has blown the sparks on to the grass, resulting in a fire.\nCrew with fire extinguishers have emerged now to put it out, but we've only got about 10 minutes left here.\n'The DRS was open'\nAlice Powell\nBritish racing driver on BBC Radio 5 Sports Extra\nThe DRS was open on Jack Doohan's crash. In F2 or F3, you would close that moments before braking. In F1 they can get away with cutting that margin even finer but it still needs to be closed before you hit the brakes for the corner. It does look like the DRS was open ever so slightly.", "url": "https://www.bbc.com/sport/live/c17qzg5vg84t"}