{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 08:06:39", "date_modify": "2025-04-26 08:06:39", "date_publish": "2025-02-26 14:28:32", "description": "Louie Barry returns to parent club Aston Villa to undergo rehabilitation after suffering a knee injury in Hull City's win at Sunderland.", "filename": "sport_football_articles_c2417m2lpe0o_1745654799.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cc45/live/7831d130-f44b-11ef-837a-fdc1fd381948.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c2417m2lpe0o_1745654799.html", "title": "Hull City: Loanee Louie Barry returns to Aston Villa after injury", "title_page": "Hull City: Loanee Louie Barry returns to Aston Villa after injury - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Louie Barry has returned to parent club Aston Villa to undergo rehabilitation after suffering a knee injury in Hull City's win at Sunderland.\nThe 21-year-old limped off after 41 minutes during the 1-0 victory at the Stadium of Light on Saturday.\nBarry, who has made four appearances for the Tigers since joining on loan in January, suffered damage to the cartilage in his knee, the club confirmed.\n\"The forward will return to his parent club Aston Villa to undergo rehabilitation, with the Tigers hopeful that he could feature for Ruben Selles' side again this season,\" Hull City said in a statement on the club website, external.\n\"We wish Louie all the best for his recovery.\"\nBefore signing for Championship relegation-battlers Hull until the end of the campaign, Barry had enjoyed a successful loan spell with League One promotion-chasers Stockport County.\nHe scored 15 goals and provided three assists for Stockport in 23 league appearances.\nHull are 21st in the Championship and three points above the relegation zone with 12 games remaining following a 1-0 defeat at Cardiff on Tuesday night.\n\"We brought in Louie with the idea to be a player that will make the difference for us, so it's a big blow,\" head coach Selles told BBC Radio Humberside.\n\"We will manage as we always do.\"\nBarry wrote on X: \"Absolutely gutted but I'll work hard to get back and help the team achieve our target.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c2417m2lpe0o"}