{"authors": ["Nat Hayward", "www.facebook.com"], "date_download": "2025-05-21 06:24:06", "date_modify": "2025-05-21 06:24:06", "date_publish": "2025-03-31 13:13:14", "description": "Nuno Espirito Santo press conference: Nottingham Forest vs Man Utd", "filename": "sport_football_articles_cvg9l45ygl1o_1747808646.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e1af/live/755718e0-4923-11ef-96a8-e710c6bfc866.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cvg9l45ygl1o_1747808646.html", "title": "Nuno Espirito Santo press conference: Nottingham Forest vs Man Utd", "title_page": "Nuno Espirito Santo press conference: Nottingham Forest vs Man Utd - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Nuno began by offering an update on Chris Wood's fitness: \"He's improving, getting better day by day. We have to assess him day by day. A big contusion so [it is] very painful.\"\nAsked if he had any other injury worries after the penalty shootout win over Brighton on Saturday in the quarter-finals of the FA Cup, he smiled and said: \"Of course we have. After we played extra time and a demanding game, we have to assess them all. I think we are recovering well. The joy and the happiness of coming through and playing at Wembley will for sure give us an extra run for tomorrow.\"\nOn the quick turnaround after playing 120 minutes at Amex Stadium: \"It's very difficult on the players but we see them and they are recovering well. They are always being positive so we are confident we can perform again against a good team. In this short turnaround, it is all about recovering. We're going to be OK.\"\nOn the reaction to the win: \"It was beautiful - everybody enjoyed. The fans enjoyed it and that is more important than anything. But it lasts so short and here we are again, focused on the game.\"\nHe was pleased for Ryan Yates scoring the winning penalty: \"It was a very special moment for him. It was incredible just to see his smile. Club captain, all his life here... he is over the moon.\"\nHowever, Nuno said the celebrations are over and Forest's attention has now totally switched: \"Total focus only on tomorrow. It's always the same approach. Tomorrow is the most important one.\"\nOn Forest's league position heading into the final stages of the season: \"We are delighted. We are delighted that we're going to play more matches and to have chances to perform, to improve and to grow as a club and a squad.\"\nOn the threat posed by visitors Manchester United?: \"You can see the quality of the players and quality of the squad. They have quality all over the pitch. They have good options and solutions.\"\nOn Callum Hudson-Odoi's form: \"He's improving. He has had some outstanding performances this season and is getting better and better. You have to have pleasure and enjoy who you work with and Callum is a happy boy playing and working with his team-mates.\"", "url": "https://www.bbc.com/sport/football/articles/cvg9l45ygl1o"}