{"authors": ["Sam Drury", "www.facebook.com"], "date_download": "2025-05-21 03:42:14", "date_modify": "2025-05-21 03:42:14", "date_publish": "2025-04-06 17:50:19", "description": "Liverpool are on the brink of the Premier League title after their 1-0 win at Leicester on Sunday - but when can they clinch it?", "filename": "sport_football_articles_cp91x70y209o_1747798934.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d4df/live/900abfb0-1e17-11f0-bf9d-b11f289319f9.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cp91x70y209o_1747798934.html", "title": "When can Liverpool win the 2024-25 Premier League title?", "title_page": "When can Liverpool win the 2024-25 Premier League title? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Liverpool are on the brink of the Premier League title and need just a point to seal it after Arsenal were held by Crystal Palace on Wednesday.\nArne Slot's side secured a sixth win in their past seven league games by beating Leicester 1-0 at the weekend.\nIt means the Reds will win a record-equalling 20th top-flight title if they avoid defeat against Tottenham at Anfield on Sunday (16:30 BST)\nThat would put the Merseysiders on 80 points, with second-placed Arsenal only able to reach 79 even if they won all of their remaining games.\nArsenal's draw with Palace means they can only level Liverpool's current points tally.\nThey are 12 points behind and only have 12 to play for, and with a vastly inferior goal difference.\nWe've all heard the accusations and whispers this season from rival fans, haven't we?\n'This Liverpool team isn't actually that great.' 'The Premier League is a poor league this season.' 'Liverpool's class of 2024-25 wouldn't have won the title in another season.'\nHow fair is this, though?\nFirstly, it has to be said Liverpool's usual rivals are not having their best seasons.\nDefending champions Manchester City are on track for their worst campaign under Pep Guardiola, Manchester United are set for their worst season in Premier League history, Arsenal are eight points adrift of their points tally at this stage of last season, while Tottenham and Chelsea have suffered their own struggles as well.\nIt's been a good season for Liverpool to hit full stride then. And Slot's men have certainly done that.\nEven if Arsenal were on the 77 points they had reached at this stage last season, Liverpool would still be two points ahead of them with a game in hand.\nArsenal's much-lauded Invincibles finished their title-winning campaign on 90 points in 2004. Slot's men need 12 points from five games to beat that.\nIn 32 Premier League seasons, only 14 sides have reached that mark and one of them - Manchester United in 1993-94 - did so in a 42-game season.\nLiverpool are also the only side to get 90-plus points and not win the title - doing so twice under Jurgen Klopp - meaning only 12 of the previous 31 league-winning sides posted 90 points or more.\nYou can only beat what is front of you and Liverpool have done just that in formidable style.", "url": "https://www.bbc.com/sport/football/articles/cp91x70y209o"}