{"authors": ["Jonty Colman", "www.facebook.com"], "date_download": "2025-05-21 08:03:08", "date_modify": "2025-05-21 08:03:08", "date_publish": "2025-05-19 15:38:18", "description": "Tottenham face Manchester United in this week's Europa League final in Bilbao, but how much is the match worth?", "filename": "sport_football_articles_c2e3glnnkp7o_1747814588.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/49d5/live/df1232e0-3236-11f0-8947-7d6241f9fce9.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c2e3glnnkp7o_1747814588.html", "title": "How much is the Europa League final worth?", "title_page": "Tottenham v Manchester United: How much is the Europa League final worth? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The winner of Wednesday's Europa League final between Tottenham and Manchester United could receive up to £54.4m.\nThat figure is a combination of prize money for winning the competition and for reaching the league phase for the 2025-26 Champions League.\nSpurs or United would be guaranteed about £21m, with additional prize money awarded based on league position and for victories and draws.\nThe figure of £54.4m does not include prize money earned beyond the Champions League's last 16.\nUnited have already earned £26.6m for their success in Europe's second-tier competition this season, while Tottenham's total prize money so far is about £26.5m.\nThe slight difference comes as United drew one more match than Tottenham and finished one place above them in the league phase.\nIncluded in the money both clubs have already won, Spurs and United received £5.9m each for reaching the final.\nOf the guaranteed £21m at stake in the Europa League final, just over £5m of that is simply for winning the competition.\nThe remainder is for securing qualification into the league phase of next season's Champions League.\nShould the winner enter next season's Champions League and lose all eight league games, their prize money will not increase much higher than the £15.9m qualification prize.\nWhat is more likely is the winning team would go on to win or draw league matches, which are all incentivised.\nThere are also bonuses based on league position and for every round after the league phase which a club reaches.\nThis article is the latest from BBC Sport's Ask Me Anything team.", "url": "https://www.bbc.com/sport/football/articles/c2e3glnnkp7o"}