{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:39:01", "date_modify": "2025-05-21 05:39:01", "date_publish": "2025-01-14 12:09:09", "description": "Central African Republic appoint former Liverpool, West Ham and Cameroon defender Rigobert Song as their new head coach.", "filename": "sport_football_articles_cy8pnlw84qvo_1747805941.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7c89/live/97991b00-d268-11ef-9dbb-9559c8b74d9b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy8pnlw84qvo_1747805941.html", "title": "Rigobert Song: Ex-Liverpool defender named Central African Republic head coach", "title_page": "Rigobert Song: Ex-Liverpool defender named Central African Republic head coach - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Liverpool and West Ham defender Rigobert Song has been appointed as the new head coach of Central African Republic (CAR).\nThe 48-year-old replaces Swiss coach Raoul Savoy, who was fired in October towards the end of CAR's unsuccessful 2025 Africa Cup of Nations (Afcon) qualifying campaign.\nSong, who played a record 137 games for Cameroon during a 17-year international career, previously spent two years in charge of his homeland.\nHe led the Indomitable Lions at the 2022 World Cup in Qatar and at last year's Africa Cup of Nations, where the side was knocked out in the last 16.\nSong has been without a managerial role since February 2024, when his contract was not renewed by Cameroon, and takes over one of the few remaining African nations which has never qualified for the Afcon finals.\nThe Wild Beasts came close to reaching the 2023 tournament but lost their final two qualifiers to drop out of contention.\nSong's first task, however, will be the 2026 World Cup qualification campaign which resumes in March with home games against Madagascar and Mali.\nCAR currently sit in fifth place in Group I with four points from four matches, five behind both leaders Comoros and second-placed Ghana.", "url": "https://www.bbc.com/sport/football/articles/cy8pnlw84qvo"}