{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:23:22", "date_modify": "2025-04-26 06:23:22", "date_publish": "2025-03-04 00:00:00", "description": "Joe Crowe scores an injury-time winner as Carrick Rangers defeat Larne 1-0 in the east Antrim derby at Taylors Avenue.", "filename": "sport_football_live_cedlley41e7t_1745648602.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9298/live/265bc560-f82d-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_cedlley41e7t_1745648602.html", "title": "Watch: Crowe scores injury-time winner against Larne", "title_page": "Watch: Crowe scores injury-time winner against Larne - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "FULL-TIME\nGlentoran 1-0 Ballymena United\nDespite Ballymena coming very close at the end Glentoran secure the three points thanks to a Nathaniel Ferris goal.\nResults elsewhere mean that Glenavon leapfrog Ballymena, who are now tenth.\nCLOSE!\nGlentoran 1-0 Ballymena United\nWhat a chance for Ballymena right at the death!\nJames Hood does well to keep possession when under pressure from Fuad Sule and whips it into the box with Stephen O'Donnell's header somehow stopped by Daniel Gyollai.\nFULL-TIME\nLoughgall 0-2 Glenavon\nAll over at Lakeview Park where Glenavon's revival under Paddy McLaughlin continues with a comfortable 2-0 win at Loughgall.\nChristopher Atherton opened the scoring for the visitors with his first league goal of the campaign after 18 minutes.\nAnd midfielder Jack Malone popped up unmarked in the Loughgall penalty area to head home his team's second from a pin point Peter Campbell cross.\nThe Lurgan Blues had chances to extend their lead against a Loughgall side who created little, bar an early header from Jordan Gibson.\nPost\nGlentoran 1-0 Ballymena United\nIt has started to absolutely chuck it down at the Oval as we approach the full-time whistle.\nBallymena are still pushing forward, but time is really running out.\nGOAL - Carrick 1-0 Larne\nJoe Crowe - 90+3mins\nWould you believe it, Carrick have stolen it at the death!\nAfter sustained pressure in and around the Larne box, Kyle Cherry fires in a low free-kick from the right that is back-heeled into the Larne goal by Crowe.", "url": "https://www.bbc.co.uk/sport/football/live/cedlley41e7t"}