{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:01:37", "date_modify": "2025-05-21 06:01:37", "date_publish": "2025-04-01 22:21:58", "description": "Glentoran move back into second place in the Irish Premiership thanks to a 2-1 victory over Coleraine at the Oval on Tuesday night.", "filename": "sport_articles_cgrgyvqk94go_1747807297.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3cc2/live/16214c90-0f40-11f0-801a-296f2b6075c3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cgrgyvqk94go_1747807297.html", "title": "Irish Premiership: Glentoran needed to 'stand up and be counted' says manager Declan Devine", "title_page": "Irish Premiership: Glentoran needed to 'stand up and be counted' says manager Declan Devine - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Glentoran moved back into second place in the Irish Premiership thanks to a 2-1 victory over Coleraine at the Oval on Tuesday night.\nBBC Sport NI caught up with both managers after the first post-split fixture for the top six sides.\nGlentoran boss Declan Devine on ending a run of five games without a win in all competitions: \"Our guys, even though there was a bit of anxiety over recent performances and results, we needed to stand up and be counted.\n\"I felt every single player that went on that pitch really gave a shift and really worked hard.\n\"That's testimony to the players, there's been nobody hurting more than them over the last couple of weeks.\"\nOn finishing the season with four away games: \"We're playing potentially at home for the last time this year.\n\"Our fans have been incredible right throughout the year in good times and bad times.\n\"They've stuck by us and really got behind us. The message tonight was to please send them home happy with three points.\"\nColeraine manager Dean Shiels on missed chances in the second half: \"It was unbelievable that we didn't come away scoring three or four.\n\"When you come to the Oval, it's very difficult to create as many clear cut chances as we did.\n\"It's very disappointing to come away with nothing.\"\nOn the fight for European play-off seeding in the top six: \"This is a year we're trying to finish as high up the table as we can.\n\"Every game is important, because it's so congested with ourselves and Dungannon and Crusaders.\n\"We know that one win can take you up one or two places. Every game is going to be difficult.\n\"We've four left, three at home, one away, and we'll keep fighting to the end.\"", "url": "https://www.bbc.com/sport/articles/cgrgyvqk94go"}