{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:42:47", "date_modify": "2025-05-20 14:42:47", "date_publish": "2023-07-25 16:21:32", "description": "McInnes keen for 'straightforward' cup route", "filename": "sport_articles_cjkvyerkn44o_1747752167.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/da46/live/47d79420-2b07-11ee-b1d7-8fdc93c2782e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cjkvyerkn44o_1747752167.html", "title": "McInnes keen for 'straightforward' cup route", "title_page": "McInnes keen for 'straightforward' cup route - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Kilmarnock manager Derek McInnes has stressed to his players the importance of maintaining their edge in every Viaplay Cup game as they prepare to host Raith Rovers.\nThe three group winners with the best records will be seeded for the second-round draw along with European qualifiers Celtic, Rangers, Aberdeen, Hearts and Hibernian.\nKillie are on the right track with two wins from two. Championship outfit Raith Rovers are in Ayrshire on Wednesday.\nMcInnes, whose side lost to eventual winners Celtic in the semi-finals last season, said, “Normally you play a cup tie you are in or out, it’s a one-off tie.\n“The group section throws it up and for those who are not used to it, you can’t go into these games thinking you have always got the fallback of another game.\n“For me the best way of us proceeding through the tournament is by winning the group.\n“There are no guarantees with that because it’s still going to be a tough draw if you get through anyway, but it could arguably be a tougher draw.\"\nLast season, Killie finished second in their group and had to travel to Tynecastle - which was a successful visit. But McInnes added, \"a home tie against another team would have been a far more straightforward way of getting through.\n“We stressed to the players the importance of Saturday’s win but it’s the same message for this game, if we can win the group then it goes a long way to ultimately progressing and hopefully getting to Hampden.”", "url": "https://www.bbc.com/sport/articles/cjkvyerkn44o"}