{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:35:43", "date_modify": "2025-04-26 04:35:43", "date_publish": "2025-02-28 12:11:34", "description": "West Bromwich Albion fan Ali Jones responds positively about owner Shilen Patel's honesty - 12 months on from his takeover.", "filename": "sport_football_articles_cedll3d875no_1745642143.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c565/live/f8401ee0-f5cc-11ef-85ee-0589f92b739a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cedll3d875no_1745642143.html", "title": "West Brom: Patel and Bilkul 'a breath of fresh air' says fans chief", "title_page": "West Brom: Patel and Bilkul 'a breath of fresh air' says fans chief - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Prominent West Bromwich Albion supporter Ali Jones is convinced the Baggies are now in the right hands despite the jolt of hearing quite just how much money the club lost last season.\nAlbion have reported losses of £33.9m for the 2023-24 campaign and owner Shilen Patel has already warned that the financial outlook for the next 12 months will remain a challenging one.\nAs the head of the Action4Albion campaign which brought all the Baggies' various supporter factions together, and eventually forced the previous Guochuan Lai ownership into selling, Jones has seen close-up the work that has been done by the Patels in effectively cleaning up their predecessor's mess.\n\"This time last year was the most relieved I had ever been in my life,\" Jones told BBC Sport. \"The football club, I and many love and adore, was in a critical condition, and very close to becoming insolvent.\n\"It was that bad the incoming owners had to put a £2.25m cash injection in to keep the club running from day one.\n\"Mr Patel and Bilkul Football have been a breath of fresh air. Communicative. Clear and honest with their strategy. Not only do they tell us what they are, they stick to what they say.\n\"They've been realistic in their goals and, in the 12 months since the takeover, they have made remarkable strides into turning Albion round from a deep nosedive to oblivion to steadily climbing back up to where we should be.\n\"It's one step at a time, and under this ownership the future is bright.\n\"We have things to navigate (profit and sustainability rules, for example) and there may be some decisions that fans may not agree with.\n\"But I have total confidence that these decisions will be for the long-term benefit of the club we all love. Thank you, Bilkul.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cedll3d875no"}