{"authors": ["Charlotte Robson", "www.facebook.com"], "date_download": "2025-05-21 06:08:36", "date_modify": "2025-05-21 06:08:36", "date_publish": "2025-03-31 11:33:44", "description": "Newcastle news: Opinion - Reflections on Carabao Cup trophy parade", "filename": "sport_football_articles_c9qwgz9ynedo_1747807716.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e2e4/live/2c881250-b62e-11ee-bc2f-cb5579b90709.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c9qwgz9ynedo_1747807716.html", "title": "Opinion - Reflections on Carabao Cup trophy parade - BBC Sport", "title_page": "Newcastle news: Opinion - Reflections on Carabao Cup trophy parade - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "On Friday night I drove through Newcastle city centre. The wind was picking up and the black and white flags that had been put into position all through the town - out of windows on multi-storey car parks, out of windows of department stores - were flying. But town was quiet. Everyone knew the party was on Saturday.\nAnd WHAT a party.\nA common thought in the head of every Newcastle United fan heads over the past 50 or so years has been: \"Can you imagine what it would be like if we actually won something?\"\nImagine no more.\nIt was like this: 300,000 people lining the streets to cheer our cup winners (around the total population of Newcastle city!). A mad scramble to have one of the open top buses pass its MOT. Our team captain, Bruno Guimaraes, smilingly offering profanities on stage as tens of thousands in the audience cheer and Eddie Howe laughs in the background. A drone show, capturing the Dan Burn header that has been etched into club's history books.\nIt was magic.\nThe energy in the whole city, for the whole day, was something you could almost grasp onto. Kids climbed onto the shoulders of the Sir Bobby Robson statue, up lampposts, onto bus shelters. All to catch a glimpse of the silverware we have waited so long for.\nThe players themselves looked like they were having the best time, leading us in chants, lifting the cup, and getting selfies with Ant and Dec.\nIt was the party we knew we would get eventually, and it surpassed all expectations.\nI know this is only the beginning for Newcastle United, but what a beginning it is.", "url": "https://www.bbc.com/sport/football/articles/c9qwgz9ynedo"}