{"authors": ["Pat Riddell", "www.facebook.com"], "date_download": "2025-04-26 07:56:14", "date_modify": "2025-04-26 07:56:14", "date_publish": "2025-02-25 12:24:05", "description": "Nottingham Forest news: Opinion - 'A fundamental problem' for Nuno", "filename": "sport_football_articles_c5y9707zje3o_1745654174.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2992/live/78122530-b62e-11ee-8f07-bbfdfa890097.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c5y9707zje3o_1745654174.html", "title": "Nottingham Forest news: Opinion", "title_page": "Nottingham Forest news: Opinion - 'A fundamental problem' for Nuno - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The question Nottingham Forest haven't really faced this season is: how do they progress? Given that the Reds still remain third in the Premier League, it's not an issue they've had to address.\nBut Sunday's first-half performance against Newcastle United, following away losses at Bournemouth and Fulham, suggest that long-term there is a fundamental problem they must face.\nSoaking up pressure, drawing the opposition in, and hitting teams on the break has served Forest very well in the Premier League. In reality, it's part of the club's DNA going back decades.\nForest's away form in the early part of the season - and they still maintain one of the best away records in the division - is what propelled them to the heady heights they find themselves in at the moment.\nHowever, meek performances at Manchester City, Arsenal and now Fulham and Newcastle in recent weeks prove the growing pains that we inevitably had to deal with.\nNuno, of course, will no doubt have a plan for the summer and pragmatism remains all-important for clubs seeking to break into the top six. Some questions aren't answered easily.\nAnd maybe the answer isn't necessarily dominating the ball: Liverpool comfortably beat Manchester City on Sunday with just 34% possession. Perhaps that era is in flux and Forest's usual defensive solidity and focus on quick transition doesn't need too much tweaking.\nBut giving up possession too easily definitely seemed counterintuitive on Sunday - leading to an unforgivable first-half 11-minute disaster - and imposing ourselves on the game definitely seems something our talented squad have proven to be capable of. The second-half performance certainly offered a glimpse of the Forest we've been used to this season.\nFor now, we know that our home form - combined with that inimitable atmosphere and a little bit of confidence - makes Wednesday's all-important game against Arsenal that little bit less daunting.", "url": "https://www.bbc.co.uk/sport/football/articles/c5y9707zje3o"}