{"authors": ["Hannah Rankin", "www.facebook.com"], "date_download": "2025-05-21 05:35:56", "date_modify": "2025-05-21 05:35:56", "date_publish": "2025-01-24 09:34:44", "description": "BBC Sport columnist Hannah Rankin says British world champion Ellie Scotney deserves more attention - and backs her to beat Mea Mottu on Saturday.", "filename": "sport_boxing_articles_cx2pqqxgg19o_1747805756.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3aba/live/388ca6f0-d8ca-11ef-bf89-cf1be2bb19ea.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_boxing_articles_cx2pqqxgg19o_1747805756.html", "title": "Hannah Rankin: 'Forget Misfits", "title_page": "Hannah Rankin: 'Forget Misfits - we should be talking about Ellie Scotney' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "I find it so disappointing that more people know about the influencer boxing Misfits show from last weekend than a unified world champion from Britain defending her belts against another unbeaten fighter on Saturday.\nMore people, including the media, should be talking about Ellie Scotney.\nThe IBF, WBO and Ring magazine super-bantamweight world champion from London is a phenomenal yet underrated fighter - a true superstar.\nShe faces Mea Motu on the undercard of light-welterweight Dalton Smith's European title fight against Walid Ouizz in Nottingham.\nI understand that boxing is a business and it all comes down to how many tickets a fighter can sell, but Ellie should have been given the main event slot.\nFor those who do not know much about her, Ellie is such a beautiful fighter to watch.\nShe has been matched quite hard throughout her career, has never taken the easy option and has some great names on her record.\nShe is poetry in motion - so fluid - and a fighter who can box rings around you for rounds upon rounds.\nSure, there are no stoppage wins on her record, but Ellie is never going to be a one-punch knockout artist. That's just not her style.\nNew Zealand's Motu also has a fantastic record and will be looking to do a number on the rising star.\nBut Ellie is a different class and she wants to unify and be undisputed in her division. I fully think she will achieve that.\nEllie is a real scholar of boxing and is always watching all the old fights.\nShe is a massive fan of Roberto Duran and Julio Cesar Chavez. We often spend hours on the phone just being geeky and talking about boxing.\nShe got to meet Duran for the first time last year and you could see on her social media how over the moon she was.\nHe is one of her absolute heroes - I am surprised she managed to hold her nerve and even ask him for a photo.\nLike me, Ellie's faith means a lot to her - it is what helped us connect when we first met. That god-fearing side really helps her with her training and drive to succeed.\nBut it also means that she is not one of those loud people out there shouting about herself.\nShe will never make a big fuss on social media or be aggressive in her interviews or when she is doing news conferences. It is just not in her nature.\nIt is to her detriment and why more people do not talk about her, but I would not change that about her. Ellie has always stayed true to herself despite her achievements.\nIn boxing it is so important to be yourself because eventually, if you're trying to be somebody you are not, you will get found out.", "url": "https://www.bbc.com/sport/boxing/articles/cx2pqqxgg19o"}