{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:08:24", "date_modify": "2025-05-21 06:08:24", "date_publish": "2025-02-08 17:44:55", "description": "Coventry 1-4 Ipswich: What Kieran McKenna said", "filename": "sport_football_articles_c87d2jzr7jvo_1747807704.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0a6b/live/61ff9880-e644-11ef-b751-69bf28e3f9d7.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c87d2jzr7jvo_1747807704.html", "title": "Coventry 1-4 Ipswich: What Kieran McKenna said", "title_page": "Coventry 1-4 Ipswich: What Kieran McKenna said  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ipswich boss Kieran McKenna spoke to BBC Match of the Day after Saturday's victory against Coventry: \"It's always a good sign [winning despite 11 changes] and it's how we have worked over the last few years where we train hard with the whole group and try to have two players challenging for any position - we have faith in the players to come in for any game.\n\"We have shown we can put in a good performance with a changed group and that's one of the big positives. It's a really good day for the group, Aston Villa next week is a challenge up from this.\"\nOn Jack Clarke, who scored twice and made one: \"We're delighted for Jack. He has really shown good signs. He joined us late in the [summer] window and has stepped up to the Premier League for the first time. But he's a really talented footballer, a good athlete and a good lad. He is making some progress and showed that today.\"\nOn goalkeeper Alex Palmer's debut following his £5m move from West Brom, he said: \"He did really well and it was the perfect opportunity to bring him in against an opponent that he has already faced this season. He stepped straight into the team and showed his quality.\"", "url": "https://www.bbc.com/sport/football/articles/c87d2jzr7jvo"}