{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:26:37", "date_modify": "2025-05-20 14:26:37", "date_publish": "2023-07-29 12:00:24", "description": "Beale's Brazil experienced helped seal Danilo deal", "filename": "sport_articles_czrg0mwd8lyo_1747751197.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/305b/live/578f6c50-2e07-11ee-999b-b74dedc428d3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_czrg0mwd8lyo_1747751197.html", "title": "Beale's Brazil experienced helped seal Danilo deal", "title_page": "Beale's Brazil experienced helped seal Danilo deal - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Danilo says manager Michael Beale's time spent in Brazil helped seal his transfer from Feyenoord to Rangers.\nThe 24-year-old Brazilian striker has signed a five-year contract after an undisclosed fee brought an end to his six years spent in Netherlands.\nBeale had a six-month spell as assistant to Rogerio Ceni at Sao Paulo and Danilo told Rangers TV that it led to \"great conversations\" as the Englishman looked to persuade him to move to Scotland.\n\"He shared his plans and how I will fit in with the squad with my qualities,\" he said. \"He spoke about how he was in Brazil and he can understand my country a little bit and where I come from, so it was great and it made me want to fight to join the club.\"\nDanilo, who was looking forward to playing in Saturday's friendly against Hoffenheim in Germany, is relishing \"a fresh start\" despite admitting he had never previously been to Scotland.\n\"I spoke with my wife and my agent and I think it is a great step for us to start somewhere new and, when Rangers came in, I thought it was a great opportunity for my future and for my development,\" he said.\n\"I am excited to see what the future can bring and I think Rangers is the right club for my development and I hope we can have success. The league in Holland is growing a lot and I came from the youths through to the first team and I think Scotland is a great step for me to achieve even more of my goals, so I am really glad that Rangers opened the door for me.\"", "url": "https://www.bbc.com/sport/articles/czrg0mwd8lyo"}