{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:35:50", "date_modify": "2025-04-26 04:35:50", "date_publish": "2025-02-28 12:08:45", "description": "Ospreys head coach Mark Jones believes his side and Wales will benefit from fly-half Dan Edwards returning for the trip to face Glasgow on Saturday.", "filename": "sport_rugby-union_articles_c5y0091r9jro_1745642150.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b85f/live/69932ce0-f54b-11ef-9acd-4337bb242d8e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_c5y0091r9jro_1745642150.html", "title": "URC: Wales fly-half Dan Edwards aims to impress on Ospreys return", "title_page": "URC: Wales fly-half Dan Edwards aims to impress on Ospreys return - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Ospreys head coach Mark Jones believes his side and Wales will benefit from fly-half Dan Edwards returning for the United Rugby Championship (URC) trip to face champions Glasgow on Saturday.\nEdwards, 21, made his Wales debut as a replacement in the 43-0 defeat by France before also coming off the bench in the 22-15 loss in Italy.\nInterim Wales head coach Matt Sherratt took over from Warren Gatland and left Edwards out of the squad for the 27-18 defeat against Ireland in favour of Gareth Anscombe and Jarrod Evans.\nSherratt has released Edwards this weekend, alongside hooker Sam Parry who starts and prop Ben Warren who is named on the replacements bench.\n\"It is good for us and Wales having Dan back this week in our squad,\" said Jones.\n\"When you are a young player, time in the saddle is important, particularly in a decision making position like half-back where they touch the ball more than anybody else.\"\nAn Ospreys debut for Fiji captain Waisea Nayacalevu has been delayed after the centre this week signed from Sale on a deal until the end of the season as cover for injured Wales centre Owen Watkin.\nNayacalevu, 34, has only had three training sessions since arriving on Monday and is now in line to make his first Ospreys appearance against Connacht on 22 March in Swansea.\nBoth Ospreys and Glasgow have 20 players unavailable this weekend because of injuries and international call-ups.\nFlanker Justin Tipuric will captain the side with Morgan Morse lining up at number eight.\nScrum-half Scott Whitlock, 20, is in line to make his debut from the bench with Reuben Morgan-Williams and Luke Davies missing.\nScotland international Adam Hastings lines up at full-back with Duncan Weir captaining the side from fly-half, while JP du Preez could make his first appearance in 650 days after completing his rehabilitation on a long-term knee injury.", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/c5y0091r9jro"}