{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:21:51", "date_modify": "2025-05-21 04:21:51", "date_publish": "2025-02-09 12:23:22", "description": "Truro City manager John Askey says he saw some of his players' best-ever performances in their 3-1 win at Hampton and Richmond.", "filename": "sport_football_articles_c62q648gz21o_1747801311.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/db7c/live/2599cf60-e6de-11ef-9c03-b5355c68e892.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c62q648gz21o_1747801311.html", "title": "Truro City boss John Askey hails players after win at Hampton and Richmond", "title_page": "Truro City boss John Askey hails players after win at Hampton and Richmond - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Truro City manager John Askey says he saw some of his players' best-ever performances in their 3-1 win at Hampton and Richmond.\nThe Tinners ended a three-game scoring drought away from home to consolidate National League South's final play-off place.\nThe win sees seventh-placed Truro go eight points clear of ninth-placed Hampton and six points behind leaders Dorking Wanderers.\nTom Harrison glanced a dominant Truro ahead after 25 minutes before new loan signing Luke Jephcott converted Jaze Kabia's 56th-minute cross to double the lead.\nHampton had Alex Wall sent off for his reaction after he had given away a penalty with 15 minutes to go and Kabia converted from 12 yards.\nAlfie Williams scored a consolation for the hosts with four minutes left as Truro won away for the first time since 21 December.\n\"I think we looked really strong today, there was a lot of really good performances,\" Askey told BBC Radio Cornwall.\n\"Some players I thought played the best football I've seen them play since I've been here.\n\"We looked strong against a good side and we just basically stopped them playing and dominated the game from start to finish.\"\nAskey added: \"I'm obviously disappointed with the goal we conceded, which was just sloppy, but to come here and put a performance on like that when there was so much on it, because it's like getting six points.\n\"It keeps them a big distance away from us now and there's one or two teams at the top that lost so we've got to keep going.\n\"If we put performances like that in then we're going to win more games than we we'll lose.\"", "url": "https://www.bbc.com/sport/football/articles/c62q648gz21o"}