{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:24:35", "date_modify": "2025-05-21 07:24:35", "date_publish": "2025-03-28 15:24:01", "description": "Marco Silva press conference: Fulham vs Crystal Palace preview", "filename": "sport_football_articles_c2040n61031o_1747812275.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9b67/live/608060b0-6de1-11ef-b970-9f202720b57a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c2040n61031o_1747812275.html", "title": "Marco Silva press conference: Fulham vs Crystal Palace preview", "title_page": "Marco Silva press conference: Fulham vs Crystal Palace preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Silva confirmed he has no new injuries to report but Reiss Nelson, Harry Wilson and Kenny Tete remain sidelined and will not be fit for Saturday.\nHe said the chance to reach Wembley is \"normal progression for a club doing the right things\", adding: \"It shows the progress we have been showing since our first season back in the Premier League. It shows really what we have been doing, not just in terms of performances but changing the mentality of the club and the players in every competition we play. We have changed completely the mindset for these competitions.\"\nOn reaching 500 games in management: \"I'm feeling very well. Preparing for a big game for us. Nothing feels really different than the previous one. It's a very nice number to be honest, but it's just another game that is really important. It's been a long journey, a special one. I'm proud of what I've been doing so far but I want much more to come and better things to come as well.\"\nAsked if he retains the same passion as when he began, Silva said: \"Probably even more. I'm more mature and more experienced. I'm the same person and same type of character but more mature than when I started.\"\nOn what he expects from Palace: \"They are a physical side, difficult to beat - always with that strong five at the back, two good midfielders with quality and three attackers. The details will make the difference. We have to be ruthless and create clear-cut chances.\"\nOn what it would mean for Fulham fans to reach a first domestic final in 50 years, should they progress through the quarter-finals and semi-finals: \"It will be a dream for them. Let's go step by step. We love them to dream but for us it does not make sense to think about the final if we are not strong enough in the quarter-final. We have to be strong enough tomorrow.\"", "url": "https://www.bbc.com/sport/football/articles/c2040n61031o"}