{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:53:55", "date_modify": "2025-05-19 14:53:55", "date_publish": "2017-07-13 10:30:26", "description": "Wakefield Trinity comfortably win at Widnes Vikings to move up to fourth place in the Super League table.", "filename": "sport_rugby-league_40574493_1747666435.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/AD74/production/_96940444_bill_tupou.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_rugby-league_40574493_1747666435.html", "title": "Super League: Widnes Vikings 8-36 Wakefield Trinity", "title_page": "Super League: Widnes Vikings 8-36 Wakefield Trinity - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Mason Caton-Brown and Bill Tupou scored two tries apiece as Wakefield Trinity easily won at Widnes Vikings to move up to fourth place in the Super League table.\nSam Williams and Tinirau Arona also scored for the visitors, while Liam Finn kicked a further 12 points.\nJoe Mellor scored Widnes' only try, with Stefan Marsh adding two goals.\nThe defeat was Widnes' third in a row, while Wakefield won for the second time in six matches in all competitions.\nWidnes' loss means they will finish in the bottom two and face four games away and three at home in the Qualifiers, as they fight to maintain their Super League status.\nAs well as scoring two tries, Tupou created two of the others for winger Caton-Brown in a dominant performance.\nMellor's fine solo try put the hosts ahead, but the visitors soon scored when Tupou made a superb break down the left and passed for Caton-Brown to dive over.\nVikings winger Ryan Ince was sin-binned for tackling Caton-Brown before he received the ball, and Wakefield went ahead later in the first half with Tupou collecting Finn's pass.\nWilliams added a further try in the first half as the away side went in with an 18-8 lead, and Wakefield dominated the second half as Arona went over in the corner, before Tupou set up Caton-Brown for his second try.\nTupou scored the final try of the match, as he sprinted past the Widnes defence from 50 metres out to seal the victory.\nWidnes Vikings coach Denis Betts:\n\"It was patchy stuff again. We started okay, got back into the game at 8-6 and it was pretty even and we were in the mix. Then we put ourselves under pressure.\n\"Our completion rate was atrocious, we just can't keep hold of the ball. Our skill in the game at times was average and it felt players were just trying to get through the game.\"\nWakefield Trinity coach Chris Chester:\n\"I'm really pleased and proud of the efforts over 22 rounds and it's all been about attitude, effort and desire and we had a hell of a lot of desire tonight.\n\"We scored some really fancy tries but what pleased myself and the rest of the staff was keeping them scoreless in the second half.\n\"We are peaking at the right time and we can hopefully take that confidence through to the Super 8s competition.\n\"If we get a result next week against St Helens it will mean four home fixtures which will be massive for us.\"\nWidnes: Thompson; Ince, Bridge, Runciman, Marsh; Mellor, Chase; Dudson, Heremaia, Buchanan, Houston, Whitley, Cahill.\nReplacements: Manuokafoa, O'Carroll, Johnstone, Olbison.\nWakefield: Grix; Jones-Bishop, Arundel, B. Tupou, Caton-Brown; Williams, Finn; Walker, Wood, Huby, Ashurst, Hadley, Arona.\nReplacements: Annakin, Hirst, Fifita, England.\nReferee: Chris Kendall", "url": "https://www.bbc.com/sport/rugby-league/40574493"}