{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:15:45", "date_modify": "2025-05-21 04:15:45", "date_publish": "2025-04-05 18:45:02", "description": "Reaction from Declan Caddell and Gary Haveron after Crusaders and Larne play out a dramatic 2-2 draw at Seaview.", "filename": "sport_articles_c793dzl8n1yo_1747800945.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/907b/live/f24e12b0-124d-11f0-a75c-b716eb718e3b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c793dzl8n1yo_1747800945.html", "title": "Larne 'massively frustrated' to draw with Crues - reaction", "title_page": "Irish Premiership: Larne 'massively frustrated' to draw with Crues - reaction - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "After a dramatic 2-2 draw at Seaview, where Crusaders fought back twice to claim a point against Larne, BBC Sport NI got the thoughts of Crues boss Declan Caddell and Larne manager Gary Haveron.\nCaddell on the result: \"At the end I was happy with a point considering we came from behind twice. The first half was a bit of a non-event, and we get done by a set-piece. Second half, we looked like the only team going to win it.\n\"We got the equaliser and then conceded straight after, but the boys showed a bit of character to get a goal back, so I'm proud of the performance.\"\nOn Stewart Nixon's late equaliser: \"It's a great strike and I'm so pleased for him this season has been a bit stop start for him it seems to be injury after injury, but he's been back a few weeks contributed against Glentoran and today gets the equaliser, it's good to see him with a smile back in his face.\"\nOn Jordan Stewart's late red card: \"I think it did warrant a red card, it was a bit reckless, but I have to see it back to see it clear.\"\nHaveron on the draw: \"Massively frustrated with the amount of chances we created. We got our noses in front and should have seen the game out. We should have killed the game off in the first half, but we allowed them to come back into it second half.\"", "url": "https://www.bbc.com/sport/articles/c793dzl8n1yo"}