{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:35:22", "date_modify": "2025-05-21 07:35:22", "date_publish": "2025-05-20 16:02:38", "description": "Warwickshire seek clarification from the Pakistan Cricket Board over the availability of pace bowler Hasan Ali.", "filename": "sport_cricket_articles_cd622j6200go_1747812922.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a054/live/14f68410-3593-11f0-8f95-179a79186756.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cd622j6200go_1747812922.html", "title": "Hasan Ali: Warwickshire seek clarification over paceman's availability", "title_page": "Hasan Ali: Warwickshire seek clarification over paceman's availability - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Warwickshire are seeking clarification from the Pakistan Cricket Board over the availability of pace bowler Hasan Ali.\nThe 30-year-old was due to play for the Bears from 29 May to the end of the season on an all-formats deal.\nBut he has been given a central contract by the PCB and is not now expected to be available until the T20 Blast game against Derbyshire on 8 June.\nThe club understands, though, that he will not be able to play in the County Championship matches against Somerset and Sussex, starting on 22 and 29 June.\nHe can play five more T20 matches in July but the club want to know if he will be allowed to return for the knockout pahse of the competition, should they progress from their group.\n\"We believed we had assurances he would not be involved with the Pakistan side this summer. But a change of management at the PCB has meant he's been given a central contract and won't be able to support us throughout the season as expected,\" said chief executive Stuart Cain.\n\"It's another example of the challenges clubs face in attracting quality overseas players.\n\"With the financial incentives associated with franchise cricket around the globe, and the expanded international schedule, it's very hard to find players that will both improve the squad and be available for the majority of the summer.\"\nWarwickshire are also going to be without Australia's Beau Webster for the initial stages of the T20 Blast after he was named in their squad for the World Test Championship final against South Africa and subsequent tour to the West Indies.\n\"Beau has settled in well at Edgbaston, making a big difference on and off the field, but his performances over the winter for Australia always meant this was a possibility,\" Cain added.\nWarwickshire are next in action on Friday for a Championship game against neighbours Worcestershire at New Road.", "url": "https://www.bbc.com/sport/cricket/articles/cd622j6200go"}