{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:08:11", "date_modify": "2025-05-21 07:08:11", "date_publish": "2025-03-27 23:12:43", "description": "Ireland head coach Scott Bemand says his side have no fresh injury concerns for their Women's Six Nations game against Italy on Sunday.", "filename": "sport_rugby-union_articles_c4g0nn14leno_1747811291.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/33fc/live/d7b0a790-0b60-11f0-ab73-b7a172bcbdf0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c4g0nn14leno_1747811291.html", "title": "Ireland 'in good health' for Italy encounter", "title_page": "Women's Six Nations: Ireland 'in good health' for Italy encounter - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ireland head coach Scott Bemand says his side are \"in good health\" ahead of their Six Nations meeting with Italy in Parma on Sunday.\nBemand's side came close to causing an upset in their opening game of the 2025 tournament in Belfast last weekend but in the end ran out 27-15 losers to France.\n\"We feel like we played a Test match but came through in reasonable health so a full squad to pick from pretty much,\" said the Ireland coach on Thursday.\n\"Stacey Flood came back from injury and was available for the first game, but we won't be moving and shaking too much.\n\"We've a good panel, the wider squad is competing hard and people have the opportunities to break in.\n\"The beauty of where we have got this group to over the last 18 months is that we can now tolerate work, can now tolerate big games against some sizeable athletic opposition. And the cost to us physically is, touch wood, fairly low cost at this point.\"\nWing Beibhinn Parsons and full-back Meabh Deely remain out through injury but both players could return to action later in the tournament.\nBemand explained that his squad have reflected on the mistakes they made against the French and are preparing to give of their best against the Italians.\n\"We have looked at some of the performance aspects of it and we got quite a lot wrong in the game, as did France. The first game of the Six Nations and it's our first game testing ourselves against this kind of opposition. We are coming in with higher standards for ourselves.\n\"So in that sense we do feel it was a missed opportunity. We got momentum coming from behind. We let them off the hook.\n\"As a group, we haven't shied away from that. I love the honesty of the girls, they're prepared to meet the challenge.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/c4g0nn14leno"}