{"authors": ["Jack Herrall", "www.facebook.com"], "date_download": "2025-05-20 14:46:05", "date_modify": "2025-05-20 14:46:05", "date_publish": "2023-07-27 16:57:09", "description": "Hibernian suffer a calamitous defeat at the hands of Andorran side Inter Club d'Escaldes in the first leg of their Europa Conference League second qualifying round tie.", "filename": "sport_football_66330843_1747752365.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/16085/production/_130554209_20801787.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66330843_1747752365.html", "title": "Inter Club D'Escaldes 2-1 Hibernian: Easter Road suffer shock defeat in Andorra", "title_page": "Inter Club D'Escaldes 2-1 Hibernian: Easter Road suffer shock defeat in Andorra - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Hibernian suffered a calamitous and embarrassing defeat at the hands of Andorran side Inter Club d'Escaldes in the first leg of their Europa Conference League second-round qualifier.\nLee Johnson's men fell behind to an Adria Gallego strike after questionable defending allowed the hosts to cut through their backline with ease.\nElie Youan was a lone bright spark during the first half but his side failed to find an equaliser in a bitterly disappointing return to continental competition.\nThe Scottish Premiership club's misery was compounded when David Marshall spilled a shot and Jean Luc tapped in from close range.\nHowever, a late Joe Newell free-kick does give Hibs some hope of salvaging the tie in the return leg at Easter Road - live on BBC Scotland next Thursday - with Djurgardens of Sweden or Switzerland's Luzern awaiting in next round.\nYouan and Josh Campbell saw a couple of early strikes go close before the hosts took the lead after a swift breakaway.\nAnder El Haddadi was afforded too much room down the right-hand side and slid the ball towards to the back post. It was converted by captain Gallego on the second attempt after it rebounded off of Marshall.\nA Youan cross was then blocked on the edge of the box but shouts for a Hibs penalty were promptly dismissed by the Finnish referee.\nA late first-half counter-attack put Elias Melkersen and Youan through against a sole defender but the former opted to shoot instead of pass and a tame effort deflected into the arms of the goalkeeper.\nOtger Canals' side were robust in the middle of the park, with Hibs' passes routinely misplaced and any crosses or set-pieces comfortably dealt with by the home defence.\nEl Haddadi inadvertently set up his side's second goal when his shot from a tight angle was inexplicably palmed into the path of the onrushing Jean Luc by Marshall.\nNewell's free-kick, in the first minute of injury time, managed to squirm through the wall to give Hibs some hope after a hugely disappointing performance.\nHibernian manager Lee Johnson: \"It was disappointing, wasn't it? I thought first half we were really, really poor. I don't know why, they had all the information in terms of what the opposition were like and that proved to be that.\n\"I don't want to give excuses because we just weren't good enough, but the altitude seemed a bit of a problem in terms of the lads getting a breath in.\n\"In the second half, we made the shape change and put Christian [Doidge] and Joe Newell on and I thought we were much better.\"", "url": "https://www.bbc.com/sport/football/66330843"}