{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:08:16", "date_modify": "2025-05-20 14:08:16", "date_publish": "2023-07-30 15:31:48", "description": "Glamorgan's 50 overs friendly away to Herefordshire eis ruined by rain after the home side had reached 93-4.", "filename": "sport_cricket_66351716_1747750096.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/12AC8/production/_130588467_cdf_190822_glamorgan_v_hampshire55.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66351716_1747750096.html", "title": "Glamorgan's Herefordshire friendly rained off", "title_page": "Glamorgan's Herefordshire friendly rained off - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Glamorgan's 50 overs friendly away to Herefordshire was ruined by rain after the home side had reached 93-4.\nNick Hammond's 27 was the top score for the National Counties side.\nJames Harris, Harry Podmore, Ben Morris and Ben Kellaway claimed a wicket apiece.\nGlamorgan fielded nine players with first team experience, but did not include any of the team which finished their Championship match at Derby on Friday.\nThere were senior debuts for seamer Ben Morris and batter Callum Nicholls, both aged 19.\nOpener Eddie Byrom made his return from a hip injury ahead of a likely place in the One Day Cup opener away to Worcestershire on Friday 4 August, while all-rounder Dan Douthwaite continued his comeback from injury ahead of Welsh Fire duties.\nHerefordshire lost openers Ben Chapman-Lilley and Conor Smith cheaply to the experienced pair of Harris, who was captaining the side, and Podmore.\nFormer Worcestershire batter and home captain Matt Pardoe was caught behind for 18 slashing at Morris, before Pears Academy player Ollie Walker got off the mark with a six from a free hit.\nHammond tried to lead the rebuilding before he was stumped by Alex Horton charging at Kellaway, but shortly afterwards the rain grew heavier and the umpires had to take the players off.\nIt came as a disappointment to both sides and to the hosts from the Eastnor club.\nMeanwhile the match between Wales National County and Warwickshire at Sudbrook was abandoned without a ball being bowled.", "url": "https://www.bbc.com/sport/cricket/66351716"}