{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:52:53", "date_modify": "2025-05-21 06:52:53", "date_publish": "2025-03-29 18:41:09", "description": "PFL Europe chief Dan Hardy says Jake Paul seems focused on boxing rather than trying his hand at MMA.", "filename": "sport_articles_ckg1220pxd7o_1747810373.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6a04/live/f6ff4650-0cc9-11f0-bd5c-75dd3ff67252.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_ckg1220pxd7o_1747810373.html", "title": "Jake Paul next fight: YouTuber turned boxer unlikely to fight in MMA, says PFL's Dan Hardy", "title_page": "Jake Paul next fight: YouTuber turned boxer unlikely to fight in MMA, says PFL's Dan Hardy - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jake Paul seems unlikely to ever fight in MMA despite signing a contract with the PFL, according to the league's Dan Hardy.\nYouTuber turned boxer Paul, 28, signed a deal with the PFL (Professional Fighters League) in 2023 which gave him the option to fight in MMA as well as perform an \"advisory\" role for the MMA promotion.\nHardy, who oversees the PFL's European events, was asked about the possibility of Paul transitioning in the near future.\n\"Do we ever see him in MMA? I don't think so,\" Hardy told MMA Fighting, external.\n\"He's pretty focused on boxing.\n\"It's a lot of work for him to cross over to mixed martial arts and he's not going to fight anybody that you've never heard of before.\n\"It's going to have to be a decent name or otherwise people won't watch it.\n\"Even old guys in MMA could still handle business, I think, with Jake Paul.\"\nPaul has mainly fought ex-MMA fighters in boxing and last year faced 58-year-old Mike Tyson in a drab contest.\nThe one defeat on his record was by Tommy Fury in February 2023.\nPaul has set up his own promotional company, Most Valuable Promotions, as a boxer and recently called out to two-time heavyweight world champion Anthony Joshua for a fight next year.\nJoshua's promoter Eddie Hearn ridiculed the match-up and Hardy says he now sees Paul as more of a promotional tool for the PFL rather than one of their star fighters.\n\"I'm not seeing him making any moves in that direction, certainly from my perspective,\" Hardy said.\n\"He called out Anthony Joshua the other day did he not? He's certainly making things interesting for the combat sports world.\n\"He's definitely a disruptor. That's the main purpose he's serving right now. He's a benefit to the PFL in that regard.\"", "url": "https://www.bbc.com/sport/articles/ckg1220pxd7o"}