{"authors": ["Matthew Howarth", "www.facebook.com"], "date_download": "2025-04-26 06:16:47", "date_modify": "2025-04-26 06:16:47", "date_publish": "2025-03-01 19:21:14", "description": "Bournemouth 1-1 Wolves (5-4 on pens): Cherries progress after VAR and spot-kick drama", "filename": "sport_football_articles_c0mw9jde3zwo_1745648207.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7125/live/db194980-f6d1-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c0mw9jde3zwo_1745648207.html", "title": "Bournemouth 1-1 Wolves (5-4 on pens): Cherries progress after VAR and spot-kick drama", "title_page": "Bournemouth 1-1 Wolves (5-4 on pens): Cherries progress after VAR and spot-kick drama - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Bournemouth are through to the last eight of the FA Cup for only the third time in their history - but only by the skin of their teeth after a dramatic afternoon at Vitality Stadium.\nDean Huijsen was first to miss his spot-kick in a tense penalty shootout, but Matt Doherty and Boubacar Traore failed to hit the target before Luis Sinisterra coolly converted to book the Cherries' place in the quarter-finals.\nThe home fans may have feared Bournemouth's failure to turn their dominance into further goals would come back to haunt them after Sam Johnstone pulled off fantastic saves to deny Sinisterra and Lewis Cook in extra time.\nThe Cherries also had goals from Milos Kerkez and Alex Scott ruled out - the former after an eight-minute video assistant referee (VAR) review - after Evanilson's first goal since December had put them ahead in the first half.\nMatheus Cunha's sensational strike restored parity in the second half and Wolves held on in extra time to force the shootout, but Andoni Iraola's side - who were beaten at home by Vitor Pereira's team in the Premier League last weekend - had the last laugh.\nHaving failed to reach the semi-finals in both 1957 and 2021, Bournemouth will now be aiming to go one step further and progress to the last four of the competition for the first time.", "url": "https://www.bbc.co.uk/sport/football/articles/c0mw9jde3zwo"}