{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:37:21", "date_modify": "2025-05-20 13:37:21", "date_publish": "2023-08-01 14:39:23", "description": "West Bromwich Albion sign former Sunderland, Fulham and Stoke striker Josh Maja on a three-year contract.", "filename": "sport_football_66373930_1747748241.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/D9DA/production/_130607755_gettyimages-1238980112.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66373930_1747748241.html", "title": "Josh Maja: West Brom sign ex-Sunderland, Fulham and Stoke striker", "title_page": "Josh Maja: West Brom sign ex-Sunderland, Fulham and Stoke striker - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "West Brom have made their second summer signing by bringing Josh Maja to the Championship club following his exit from French second-tier side Bordeaux.\nThe 24-year-old former Sunderland, Fulham and Stoke City striker has signed a three-year contract.\nFree agent Maja, who has joined four days before the start of the new season, follows last week's loan move for Brighton winger Jeremy Sarmiento.\nIt comes a day after rejecting Luton Town's bid for keeper Alex Palmer.\nMaja scored 16 goals and made six assists last season in helping Bordeaux to third in Ligue 2.\n\"The club has been tracking Josh for some time,\" said Baggies head of football operations Ian Pearce. \"We have again had to be patient, but Josh is the striker we wanted.\"\nAlbion, ninth in the Championship last season, start the new campaign on Saturday at Blackburn.\nThe Baggies remain without first-choice target man Daryl Dike, who they lost in April for up to nine months with a ruptured Achilles tendon.\n\"It was an important aim of ours to reinforce this position during the summer,\" said Albion head coach Carlos Corberan.\n\"Josh has international and Premier League experience. His skills compliment Brandon Thomas-Asante in a way which means they can play together or on their own. He drops deep to build attacks and also has good instincts in the box.\"\nPearce added: \"Josh's desire to play for Carlos helped us beat off significant competition from a number of other clubs.\"\nLondon-born Maja began his career with Sunderland before moving to Bordeaux in January 2019, since when he has also had loan moves back to England, to Fulham, in 2021, and Stoke City, in 2022.\nNigeria international Maja, who had turned down the offer of a new contract at Bordeaux, won his one cap in a friendly against Ukraine in September 2019.", "url": "https://www.bbc.com/sport/football/66373930"}