{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-05-20 14:08:57", "date_modify": "2025-05-20 14:08:57", "date_publish": "2023-07-30 11:21:26", "description": "Manchester United manager Erik ten Hag challenges his side to \"raise the bar\" and find \"consistency\" to achieve the targets he has set them.", "filename": "sport_football_66353364_1747750137.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9CE8/production/_130586104_gettyimages-1580365711.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66353364_1747750137.html", "title": "Manchester United: Erik ten Hag on Rasmus Hojlund, Andre Onana and Glazers", "title_page": "Manchester United: Erik ten Hag on Rasmus Hojlund, Andre Onana and Glazers - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester United manager Erik ten Hag has challenged his side to \"raise the bar\" and find \"consistency\" to achieve the targets he has set them.\nTen Hag has described his debut campaign in English football one of \"progress\" at Old Trafford.\nUnited ended their six-year wait for a trophy and secured a return to the Champions League with a third-place finish that has only been exceeded twice in the decade since Sir Alex Ferguson's retirement.\nBut along the way there were some bitter disappointments, including a 4-0 defeat at Brentford, a record 7-0 humiliation at Liverpool, a 3-0 loss to Sevilla and, finally, being beaten by Manchester City in the FA Cup final.\nThey have strengthened this summer with the arrivals of midfielder Mason Mount and goalkeeper Andre Onana, while a deal for Denmark striker Rasmus Hojlund has also been agreed that will take their summer spending to a minimum £166m.\nNegotiations around the sale of the club are still taking place so the Glazer family is likely to still be in charge when they start their new season against Wolves on 14 August.\nIn an extended interview in San Diego before his side's final US tour game against Borussia Dortmund in Las Vegas on Monday, Ten Hag addressed a number of topics as he prepares for his second season in English football.\nReflections on his first year in charge\n\"There are always surprises, some positive, some negative. As a manager, you have to deal with them, manage the situation and act. You learn always.\n\"All levels increased immensely and that was necessary. We were more dominant and created many chances.\n\"But still, we are not where we want to be. We have to raise the bar and go to the next levels.\"\nHow far he thinks the team has to progress\n\"Last season proved we can beat any opponent and don't have to fear anyone. But it also proved we can't do it on a consistent basis. That is the step we have to make.\"\nOn Harry Maguire dominating agenda like Cristiano Ronaldo did\n\"You can have that impression but I don't see it like that, not last year, not this year.\n\"We are building a project. We want to win trophies so we have to invest in the way we play, we have to invest in the team. And our focus is not on one player.\"\nThe impending arrival of Rasmus Hojlund\n\"I'm a long time in football. First we have to finish something, then we can talk. You have to keep calm and let the professionals do their work.\"\nReplacing David de Gea with Andre Onana\n\"He's a great goalkeeper and has a different profile. That's why we wanted to sign him. With him, something will change in our game.\"\nOn whether this is 'his' squad now\n\"I wouldn't call it an Erik ten Hag squad. It's the demands of top football. We either have to find players or increase the levels from those who are already there.\n\"Tours are good for team building, for new players to get the knowledge about the values and standards, on and off the field. It's helpful that the players we have signed are already here, integrating in the team and getting the social connections. Football is a team sport and you need partnerships.\"\nThe Saudi Pro League affecting English clubs over player talks\n\"There is some money over there and it attracts players. In Europe, it has an effect.\n\"But I don't see it in this moment as a problem for the Premier League because this is where the big players want to play. And that does not put it in competition with leagues like America or Saudi Arabia.\"\nWorking with the Glazer family\n\"My job is to improve the team, so I do my work to sign players and work on the way of play.\n\"That is my focus area and that's what I have done, so I don't get distracted from any strategic review.\n\"But we have a good information line. Most of the time it is through (chief executive) Richard Arnold or (football director) John Murtough. But sometimes we have direct contact.\"", "url": "https://www.bbc.com/sport/football/66353364"}