{"authors": ["Brian McLauchlin", "www.facebook.com"], "date_download": "2025-04-26 06:56:25", "date_modify": "2025-04-26 06:56:25", "date_publish": "2025-02-28 15:01:28", "description": "Ferguson on injury boosts, Tavernier milestone & Old Firm away fans", "filename": "sport_articles_cd7ee7r53r1o_1745650585.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0abd/live/492f6320-f5db-11ef-a452-97c9e2e951dd.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cd7ee7r53r1o_1745650585.html", "title": "Ferguson on injury boosts, Tavernier milestone & Old Firm away fans", "title_page": "Ferguson on injury boosts, Tavernier milestone & Old Firm away fans - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Leon Balogun, John Souttar and Dujon Sterling all trained on Friday and could be available for selection, with Ferguson saying: \"It was great to have them back as we're pretty light defensively. I will touch base with the medical team in the morning.\"\nOn his home debut: \"It is a proud moment but the focus isn't on me - I only care about getting my team getting results.\"\nFerguson praised James Tavernier's \"unbelievable achievement\" as the skipper prepares to make his 500th Rangers appearance on Saturday, saying: \"He never hides - he is always available to play. He was a real leader when he moved position midweek, that is what I want from my captain.\"\nThe Ibrox boss is delighted Rangers fans can attend the upcoming Old Firm derby at Celtic Park: \"It is something the fixture has missed. In an ideal world, there would be more, but I'm just glad our fans will be in the stadium.\"\nFerguson says it has been too easy for opposition teams at Ibrox in recent months, Rangers have been too \"timid\" and he wants them to be more \"dominant\", adding: \"You will see a different Rangers team, that is for sure.\"", "url": "https://www.bbc.co.uk/sport/articles/cd7ee7r53r1o"}