{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:15:10", "date_modify": "2025-05-21 06:15:10", "date_publish": "2025-04-01 10:45:08", "description": "Liverpool news: Fan views on issues under the radar", "filename": "sport_football_articles_c793nz5j814o_1747808110.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c793nz5j814o_1747808110.html", "title": "Liverpool news: Fan views on issues under the radar", "title_page": "Liverpool news: Fan views on issues under the radar - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for the one thing that is going under the radar at Liverpool.\nHere are some of your comments:\nTony: I'm pleased that Arne Slot has taken this team (Jurgen Klopp's team) and got us within a grasp of the title. But players will leave and retire and only then after Slot has to buy his own players, can we fully see his team and how they'll perform.\nCharlie: Has Slot got the motivational ability to match his technical expertise? I have every faith he does, but we aren't talking about how there are different skillsets for motivation and tactics. Tactical managers can lean on their captain for inspiration, but with our captain yet to renew, it is all on Slot. The end of the season will ask this question as tired legs will limit the tactical impact and instead, gutsy performances will be required.\nKen: The difficulty ratings of the remaining fixtures in comparison to Arsenal's show that talk of the title is premature. All talk about contracts etc need to be set aside and the whole club, including the fans, need to make one big final push during this run-in. It starts with Everton on Wednesday and they are owed one after their histrionics in the reverse fixture not so long ago.\nCallum: While people are on about the contract situation, no-one is really talking about the lack of depth that has proven costly recently.\nJamie: Next season we are going to have three keepers who should all be at first-choice level. It is obvious Caiomhin Kelleher will be sold in the summer and I'd assume Giorgi Mamardashvili will be our new back-up until Alisson calls it a day. Personally I don't know why Kelleher couldn't have been the keeper to take over when Alisson finishes. I've always thought Mamardashvili was just a pointless signing.\nAlastair: What happens in the summer happens. The title run-in is the most important thing now until the end of the season.\nTaylor: It's shocking that such a talented team with Virgil van Dijk and Ibou Konate have such a dismal record of scoring from corners and set-pieces. One goal scored from a corner could have given a different result against PSG and Newcastle but it appears as if the club are so confident of winning through goals from open play goals that there's no organised plan to score from corners.", "url": "https://www.bbc.com/sport/football/articles/c793nz5j814o"}