{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:34:23", "date_modify": "2025-05-21 05:34:23", "date_publish": "2025-04-02 15:35:04", "description": "Norwich boss Johannes Hoff Thorup says the Canaries are in a \"difficult position\" to reach the Championship play-offs but his side have belief.", "filename": "sport_football_articles_c9347qn3yzgo_1747805663.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f084/live/557b1090-0fd3-11f0-9f8d-f125b11f3e53.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c9347qn3yzgo_1747805663.html", "title": "Hard to reach play-offs but we believe - Thorup", "title_page": "Norwich City: Hard to reach play-offs but we believe - Thorup - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "On the race to try and reach the top six: \"We still know there is a very, very hard and difficult job to do to make it even more realistic but it starts with the next game.\"\nThorup continued: \"We definitely believe in ourselves because we think we are a good team and when we are at our best, we should be a team that can compete for play-off positions. Now we're in a little bit more difficult position but it's just a challenge and we are up for that.\"\nThere are no fresh injury concerns following the 1-0 win over West Bromwich Albion.\nMatej Jurasek continues to improve his strength and conditioning work to be Championship ready after missing five games with a thigh strain before returning to the bench last weekend.\nManchester City loanee Callum Doyle remains at Carrow Road despite suffering an injury. It's hoped he will be able to play a part in the final few games of the season.\nThorup praised goalkeeper Angus Gunn's performance on Saturday. He said: \"The two moments in the game we really needed him - he was there.\"\nOn bottom side Plymouth, Thorup says he's expecting a team who are very difficult to break down: \"It's for us to find the right balance so we can make good chances.\"\n\"Now it's clear who's fighting to stay in the league so it will not be an easy game for us,\" said Thorup.\nOn the fans making the journey: \"I was impressed even in pre-season with the amount of fans who travel to see us. It's impressive. Every time we play away we try and give them something to shout about and we appreciate them.\"", "url": "https://www.bbc.com/sport/football/articles/c9347qn3yzgo"}