{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:45:28", "date_modify": "2025-05-20 12:45:28", "date_publish": "2023-07-26 06:59:31", "description": "Larne manager Tiernan Lynch says his side's 3-0 defeat by Kosovo champions Ballkani in Pristina was \"a learning experience\" for his squad.", "filename": "sport_football_66307599_1747745128.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/F3A3/production/_130517326_ballkanifour.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66307599_1747745128.html", "title": "Ballkani 3-0 Larne: Tiernan Lynch laments 'tough night at the office' for Irish Premiership champions", "title_page": "Ballkani 3-0 Larne: Tiernan Lynch laments 'tough night at the office' for Irish Premiership champions - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Larne manager Tiernan Lynch says his side's 3-0 defeat by Ballkani in the first leg of their Europa Conference League second round qualifying tie was \"a tough night at the office\".\nGoals from Albion Rrahmani, Almir Kryeziu and Nazmi Gripshi put the Kosovo champions in control ahead of next week's second leg at Solitude.\n\"I'm not going to make excuses - on the night they were much better than us. We probably didn't defend as well as we expected but they are a top side,\" observed Lynch after the game.\nIrish Premiership champions Larne were under pressure for much of the game in a match played in hot and humid conditions in Pristina as their opponents played free flowing football and attacked in waves.\n\"They were very penetrative and went forward at every opportunity. They caused real problems, moved the ball around really well,\" added Lynch.\n\"They've been through to the group stages before and you can see they have a lot of quality in their team.\n\"It's a learning experience and we have to go away and look at the things that we didn't do so well and some of the things that we need to do better and improve on.\n\"We could have done better in certain areas and certain situations but I can't fault anyone in terms of effort or hunger or work ethic.\n\"After going a couple of goals down we lost a bit of confidence and we weren't as brave getting on the ball.\n\"Once we got on the ball there were opportunities there that we could have and should have done better.\"", "url": "https://www.bbc.com/sport/football/66307599"}