{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:55:37", "date_modify": "2025-05-21 04:55:37", "date_publish": "2025-04-04 14:30:16", "description": "Man Utd news: 'I don't want to be that guy here saying we need a lot of time' - Amorim", "filename": "sport_football_articles_c5y4g3j9nv3o_1747803337.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f55f/live/9cc91cc0-115a-11f0-9c64-93da9e1b4cb6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c5y4g3j9nv3o_1747803337.html", "title": "'I don't want to be that guy here saying we need a lot of time' - Amorim", "title_page": "Man Utd news: 'I don't want to be that guy here saying we need a lot of time' - Amorim - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester United boss Ruben Amorim says he \"cannot think\" they will need \"a lot of years\" before they are competing for the Premier League title again.\nIt has been 12 years since the club last lifted the league trophy and, after not finishing outside of the top two between 2006 and 2013, they have only finished within those positions twice since.\nAmorim has struggled to ignite their top-flight form since replacing Erik ten Hag earlier in the campaign and they find themselves languishing in 13th.\n\"I understand, I am not naive. I don't want to think we need a lot of years to be competitive, I cannot think like that,\" Amorim said.\n\"That is why I am putting pressure on myself. I know we are not going to be the biggest contender in the next year or two years. We are doing a lot of things, putting some standards in, sometimes we change players so they have to adjust to our new standards.\n\"I know it is difficult to do that in just one year, I know it is going to take time, but I will not think like that and say I need a lot of years. I cannot manage like that.\n\"We are preparing something we have to change next year. I am not saying we are going to win the title next year - I am not crazy. We are suffering a lot to be next year a lot better and that is our goal.\n\"I don't want to be that guy here saying we need a lot of time.\"\nManchester United face Manchester City on Sunday, looking to do the league double over them for the first time since the Sir Alex Ferguson era.\n\"The Premier League is so difficult. I have a lot of people saying Sir Alex Ferguson took three or four years to win something - it is not possible these days because you have to give three interviews before every game so the pressure is so much different,\" Amorim added.\n\"We are Manchester United. There are a lot of good things. No matter the pressure, we have to be there with the big ones.\"", "url": "https://www.bbc.com/sport/football/articles/c5y4g3j9nv3o"}