{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:43:21", "date_modify": "2025-05-21 05:43:21", "date_publish": "2025-02-01 00:00:00", "description": "Follow live text updates and build-up from UFC Saudi Arabia as Israel Adesanya vs Nassourdine Imavov & Michael Page vs Shara Magomedov in Saudi Arabia.", "filename": "sport_live_czepg31r7dnt_1747806201.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_live_czepg31r7dnt_1747806201.html", "title": "UFC LIVE: Reaction, UK times, fight card, MMA results, Adesanya vs Imavov & Magomedov vs Page", "title_page": "UFC LIVE: Reaction, UK times, fight card, MMA results, Adesanya vs Imavov & Magomedov vs Page - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "That's all folks\nI did say earlier that we might be wrapped up in time for Casualty... that's still over an hour away so you can also tune into Pointless Celebrities on BBC One.\nThanks for joining us tonight as Michael 'Venom' Page became the first person to defeat Sharabutdin Magomedov, claiming a unanimous decision victory.\nWe also saw Nassourdine Imavov condemn former two-time middleweight champion Israel Adesanya to a third successive defeat.\nA fine night of MMA!\nIf you missed any of the action then take a look at Paul Battison's report.\nHow far can Imavov go?\nImavov beats Adesanya by TKO\nWho saw that coming?\nI honestly thought we would see Israel Adesanya back to his best tonight. He looked confident and composed in the first round but it just fell apart so quickly in the second.\nNassourdine Imavov is only 29, can he be the next star of the middleweight division?\nThat's four successive wins now for Imavov and he's just taken out the number two ranked middleweight and former two-time champion in a way that only Alex Pereira had previously managed - TKO.\nPost\nImavov beats Adesanya by TKO\nLaura Sanko\nUFC commentator on TNT Sports\nHe's got stiff competition from Khamzat Chimaev [to fight for the title next] after what he did to Rob Whittaker. Depending on the winner, he really wants that rematch with Sean Strickland. He wants to go out there and write that wrong, if that is what ends up happening.\n'Now I'm going to challenge for the belt'\nImavov beats Adesanya by TKO\nNassourdine Imavov, speaking on TNT Sports: \"I feel so good, I said all week long I was in the perfect shape and I'm the better striker.\n\"Now I'm going to challenge for the belt.\n\"My confidence is coming from my family, my brother and my team. If you want one secret then surround yourself by people who love you and who you love. You will grow this way.\n\"We have been sharing the same goal for 10 years so I want to dedicate this victory to my brother because he has been with me all the way.\"\n'Belt always comes back around'\nIsrael Adesanya became the interim middleweight champion in his sixth bout under the UFC banner, beating Kelvin Gastelum in April 2019.\nJust six months later Adesanya claimed the unified belt via a second-round stoppage victory against Robert Whittaker to spark a new era in the division.\nThe Nigerian-born New Zealander made five successful defences before losing the title to old foe Alex Pereira. Adesanya did beat Brazil's Pereira to reclaim the belt in a rematch but subsequently lost it in his next fight against Sean Strickland.\nIn the midst of his first title reign, Adesanya also challenged Jan Blachowicz for the light-heavyweight belt, meaning his last 12 fights have all had a UFC championship on the line, but that run ends tonight.\n\"I'm kind of being selfish - I fight for my team, my family and my real fans, but this I'm doing for myself, it's really important to me,\" said Adesanya.\n\"I'm not chasing anything, I don't need anything. The belt always comes back around, I'm just doing what I love.\"\nPost\nAdesanya v Imavov\nWe've seen some epic walkouts from Israel Adesanya over the years, including a full choreographed dance.\nNone of that tonight, though, as he looks to take a step back in the direction of the middleweight title.\nIt's the first time in six years he has made the walk without a title being on the line.", "url": "https://www.bbc.com/sport/live/czepg31r7dnt"}