{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:39:32", "date_modify": "2025-04-26 03:39:32", "date_publish": "2025-03-04 20:21:27", "description": "Dallas Mavericks guard Kyrie Irving will miss the rest of the season after tearing the anterior cruciate ligament in his left knee.", "filename": "sport_basketball_articles_c0l14k7jzx0o_1745638772.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cf6c/live/65f84d60-f931-11ef-b5f1-abd941d42398.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_basketball_articles_c0l14k7jzx0o_1745638772.html", "title": "Kyrie Irving injury: Dallas Mavericks star ruled out rest of season with ACL injury", "title_page": "Kyrie Irving injury: Dallas Mavericks star ruled out rest of season with ACL injury - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The Dallas Mavericks' nine-time NBA All-Star Kyrie Irving will miss the rest of the season after tearing the anterior cruciate ligament in his left knee.\nIrving sustained the injury during Monday's 122-98 defeat against the Sacramento Kings in Texas.\nThe 32-year-old guard has been a regular fixture for Dallas this season, featuring in 50 of their 62 fixtures to help them to 10th in the Western Conference.\n\"Kai, you are resilient. Excellence, leadership and dedication is who you are. We know you'll come back stronger than ever,\" the Dallas Mavericks posted on X.\nAfter picking up the injury Irving hopped as he was helped back on to the court to convert two free throws before exiting the game.\nIt is the third high-profile NBA injury in three weeks after San Antonio Spurs star Victor Wembanyama - the number one draft pick in 2023 - was diagnosed with deep vein thrombosis in his right shoulder which will likely see him miss the rest of the season, while Philadelphia 76ers centre Joel Embiid is also out for the campaign with a knee injury.\nIrving has averaged 24.7 points, 4.8 rebounds and 4.6 assists this season.\nReserve guard Jaden Hardy also sustained an injury to his right ankle during the third quarter on Monday.\nIrving's injury is a further blow to Dallas' hopes of reaching the play-offs, with Anthony Davis, who only joined on 8 February in a trade from the LA Lakers, Dereck Lively II, Daniel Gafford and Caleb Martin also sidelined.", "url": "https://www.bbc.co.uk/sport/basketball/articles/c0l14k7jzx0o"}