{"authors": ["Mike Taylor", "www.facebook.com"], "date_download": "2025-05-21 04:40:48", "date_modify": "2025-05-21 04:40:48", "date_publish": "2025-04-03 09:04:22", "description": "Wolves news: Opinion - Mike Taylor on the season", "filename": "sport_football_articles_c39jnje72n8o_1747802448.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0e9c/live/c55109d0-4b64-11ef-aebc-6de4d31bf5cd.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c39jnje72n8o_1747802448.html", "title": "Opinion - Mike Taylor on the season - BBC Sport", "title_page": "Wolves news: Opinion - Mike Taylor on the season  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A caller to Tuesday evening's BBC Radio WM Football Phone-In, before Wolves beat West Ham, pointed out that at no stage this season have the Molineux side been out of the bottom four of the Premier League table. This really is as good as it has got.\nAn unexpected victory for Ipswich at Bournemouth may slightly temper Wolves' optimism, but they remain nine points above the relegation zone, and in recent weeks have been steadily pulling away.\nAfter Tuesday's jubilation, there is a sense of the club moving on, after months of labouring uphill and at times seeming to wallow in the misery of it all. Who knew 17th place could feel so good?\nIn the latest interesting long read on his Football Unfiltered Substack site,, external the well-informed journalist Johnny Phillips suggests there is a \"recognition\" from owners Fosun that \"something needs to change if Wolves are to break what seems like a cycle of under-investment in the transfer market followed by struggles on the pitch\". He also reports their wish to restore the sense of a unified club, the \"One Pack\" motif established while Nuno Espirito Santo was the head coach.\nThat sounds like the right way of thinking. To what degree the club's ownership has ever lost sight of the \"One Pack\" idea, only they can really know. It is hard to imagine they ever consciously turned against it. A uniting concept for a football club helps.\nA more prosaic thought is that the best way to pull a club together is to win some games, like they did under Nuno, and are now with Vitor Pereira.\nWhich came first, the concept or the results? If there is a realisation that restoring it will require sufficient expense, fine. As they have found in recent seasons, inadequate squad-building in the summer only makes for a costly rescue later on.\nAnyway, barring accident at Ipswich, there should be plenty of time for musing about all that. Pereira signed a relatively short contract when he arrived at the club, but it sounds like wherever Wolves are moving on towards, he is up for the journey. Joao Gomes signed a new deal this week.\nFor the second game running, they won with a Jorgen Strand Larsen goal rather than a Matheus Cunha goal. Cunha was on social media this week pledging his allegiance to the badge too, notwithstanding his interview in the Guardian the other day.\nWhen his suspension began, there was a fear of doom; now, before it ends, there is a sense of moving towards a new dawn, with or without him.\nListen to full BBC Radio WM commentary of Ipswich v Wolves at 15:00 BST on Saturday (95.6 FM)", "url": "https://www.bbc.com/sport/football/articles/c39jnje72n8o"}