{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 08:11:27", "date_modify": "2025-04-26 08:11:27", "date_publish": "2025-02-26 12:03:40", "description": "Newcastle United podcast: Eddie Howe on Lewis Miley", "filename": "sport_football_articles_cvgpez00j78o_1745655087.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d938/live/d724a270-f42e-11ef-9822-d3d66c578726.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cvgpez00j78o_1745655087.html", "title": "Newcastle United podcast: Eddie Howe on Lewis Miley", "title_page": "Newcastle United podcast: Eddie Howe on Lewis Miley - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Eddie Howe has backed Lewis Miley to be an \"outstanding\" player at Newcastle \"for a number of years\".\nMiley scored on Sunday in his first Premier League start of the season against Nottingham Forest, and Howe says the 18-year-old can achieve whatever he wants in the game, preferably at St James' Park.\n\"He can be anything - he could really solidify that position and be outstanding for us for a number of years,\" Howe said. \"He's going to need a bit of luck to do that - every player needs to stay fit and injury free - that's why we need to look after him.\n\"He can do a bit of everything, he's got the running capacity - the big lungs that enable him to physically produce what he needs to in those positions.\n\"H has all the technical and most importantly mental capabilities. He's played some huge games but played them like he would in training.\n\"He's very composed - one of our best technical players - so I see a bright future but he will have all the pitfalls that young players have. He needs to stay humble and level, concentrate on his training and listen to his coaches.\"\nAfter Miley missed the end of last season with a back injury and then fracturing his foot to be out for the start of this campaign, Howe stressed the importance of protecting the teenager's development.\n\"At 17 years old, he developed a back problem, which was a big blow for him,\" Howe said. \"We need to recognise that fact and look after him with the utmost care at this moment in his career.\n\"He has the look of a guy in his early 20s. He's filled out, looks stronger and quicker. He's still going through growth spurts and his body will be changing on a daily basis so we need to have that in mind all the time.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cvgpez00j78o"}