{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:32:39", "date_modify": "2025-05-21 07:32:39", "date_publish": "2025-03-29 00:00:00", "description": "Cyriel Dessers scores in stoppage-time as Rangers come from two behind to beat Dundee 4-3 in a pulsating Scottish Premiership game at Dens Park.", "filename": "sport_football_live_cvg1x1xpy2rt_1747812759.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cvg1x1xpy2rt_1747812759.html", "title": "Rangers edge Dundee in seven-goal Scottish Premiership thriller as Barry Ferguson laments 'old habits'", "title_page": "Rangers edge Dundee in seven-goal Scottish Premiership thriller as Barry Ferguson laments 'old habits' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ta-ra\nFT: Dundee 3-4 Rangers\nThat's where we'll leave it this evening, after Rangers win a seven-goal thriller at Dens Park.\nYou can read Nick McPheat's report above, or scroll back through this page to relive the action.\nUntil next time, goodbye.\n'We had more than enough opportunities' - Docherty\nFT: Dundee 3-4 Rangers\nDundee manager Tony Docherty tells Sky Sports: \"The emotion in the moment is real disappointment. We've done more than enough to take something from the game.\n\"It's something we need to learn from. Three goals should be enough to win a game. We've had more than enough opportunities. There's so much more we can do to prevent those Rangers goals.\n\"It was two teams trying to win the game, maybe that shows a bit of naivety [from us] on the pitch.\n\"It's a straight ball and Cyriel Dessers gets in. Hugely disappointing to lose a game in that manner. But I've got to reflect on my team's performance in a positive sense.\"\n'I saw old habits creeping in' - Ferguson\nFT: Dundee 3-4 Rangers\nRanger interim manager Barry Ferguson tells Sky Sports: \"Really happy with the three points, but I saw so many old habits creeping in. I'm not going to allow that to happen.\n\"We've got a full week now and that's something we'll look at. At stages of the game I was baffled.\n\"They showed character though, they never gave in. I just felt when we got the goal to go 3-2 that we could get three points.\n\"They were warned you have to be physical and match your opponent and we never did that in the first half. I made changes but I shouldn't have to.\n\"We can't be happy with the performance. I need to get to the bottom of it and I will get to the bottom of it.\n\"We need to sort a few things going forward before Hibs come to Ibrox.\n\"I felt towards the end, the momentum was with us and thankfully we got the winning goal.\n\"I felt Cyriel was unlucky with his chances. He gives you everything he's got. There are things he can improve, but he's up for it.\n\"I'm certain they would have lost it [a couple of months ago]. The guys are receptive, they understand parts of the game were way off what we expect.\n\"We rolled our sleeves up and got the result in the end.\"\n'We never make it easy' - Dessers\nFT: Dundee 3-4 Rangers\nRangers striker Cyriel Dessers tells Sky Sports: \"I'm still trying to fathom what just happened. It was a rollercoaster, a lot of pain for 91 minutes but to win this feels good.\n\"At two down it was very hard mentally, but we got back into the game and I knew something was possible.\n\"Unfortunately we have to show it too much how good we are at coming back.\n\"I just chipped it over the goalkeeper. He was a pain in the ass for me tonight, but pleased to beat him in the end.\n\"We never make it easy for ourselves, you need to give the first punch if you want to go far in Europe or win the league. That's something we need to learn, we need to start better.\"", "url": "https://www.bbc.com/sport/football/live/cvg1x1xpy2rt"}