{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:23:21", "date_modify": "2025-05-20 12:23:21", "date_publish": "2023-08-05 00:00:00", "description": "Reaction as Spain thrash Switzerland to reach the quarter-finals at the 2023 Women's World Cup.", "filename": "sport_live_football_65582983_1747743801.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/14010/production/_130663918_gettyimages-1593393279.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_football_65582983_1747743801.html", "title": "Switzerland vs Spain LIVE: Watch Fifa Women's World Cup score, commentary & updates from last 16 game", "title_page": "Switzerland vs Spain LIVE: Watch Fifa Women's World Cup score, commentary & updates from last 16 game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Post\nWhat a way to start the knockouts.\nJapan, who beat this Spain side 4-0 in the group stage, face Norway in today's other last-16 match.\nThat gets under way at 09:00 BST and we'll have live coverage of that game here, starting at 08:30.\nSee you later!\nSpain sweep into quarter-finals\nNeil Johnston\nBBC Sport at Eden Park\nSpain reached the quarter-finals of the Women's World Cup for the first time after producing an outstanding display of firepower in Auckland to send Switzerland out.\nLa Roja were beaten 4-0 in their final group game by Japan five days earlier in Wellington but bounced back in style to score four times during a dominant first half showing in front of 43,217 - a record crowd for a football match in New Zealand.\nAitana Bonmati swept the Spanish ahead before Switzerland equalised when Laia Codina, without looking up, hit a back pass past her own keeper and into the net from 10 yards inside her own half.\nSpain soon restored their lead through Alba Redondo's header before Barcelona midfielder Bonmati produced a classy finish to make it 3-1.\nIn an incredible opening half, Codina made up for her own goal by adding Spain's fourth after a scramble inside the box.\nThey added another after half-time through Jennifer Hermoso's clinical finish - her third goal of this tournament.\nRead the full report here\n'Going forwards they pose a threat'\nSwitzerland 1-5 Spain\nSteph Houghton\nManchester City defender on BBC One\nFor the last year or so, there has been a bit of a split in the Spain camp and a lot of players are missing from this squad - good players who play for Barcelona, high-quality players who play in the Champions League.\nThe best player in the world - Alexia Putellas - is on the bench.\nDid they get tested by Switzerland today? Probably not. It will be interesting defensively when they play Netherlands or South Africa - but certainly going forwards they pose a threat.\n'The Spain that we know'\nSwitzerland 1-5 Spain\nLaura Georges\nFormer France international on BBC One\nIt was the Spain that we know - that like to keep the ball, move around, work together as a team.\nThe difference between this Spain against Switzerland and the Spain we saw against Japan was that they were really precise with the ball, really accurate and really clinical in front of goal.\nThat made the difference.\nPost\nSwitzerland 1-5 Spain\nSome of Switzerland's players are in tears as their World Cup comes to an end but they can be proud of their run to the knockouts.\nA shame for goalkeeper Gaëlle Thalmann. She's made some good saves in this tournament and, at 37, this could be the last time we see her on the world stage.\n'A long time coming'\nSwitzerland 1-5 Spain\nSanny Rudravajhala\nReporting for 5 Live Sport\nIt’s quite incredible to think Spain have never won a tournament knock-out game before. They came mighty close against England at the Euros and since then have had the controversy around ‘las quince’ - the 15 players who demanded an end to the Jorge Vilda regime.\nThe Spain head coach remained in post, froze out the majority of those players and, in winning this tie, they’ll be on the road to replicating the success he’s had with the junior sides. He won eight medals in five years across U17 and U19 sides, so this has been a long time coming given this is his eighth year with the senior women’s side.", "url": "https://www.bbc.com/sport/live/football/65582983"}