{"authors": ["Katie Falkingham", "www.facebook.com"], "date_download": "2025-05-20 14:46:22", "date_modify": "2025-05-20 14:46:22", "date_publish": "2023-07-27 18:23:34", "description": "Jordan Henderson has joined Saudi Arabian club Al-Ettifaq, leaving much of the LGBTQ+ community disappointed in the former Liverpool captain.", "filename": "sport_football_66324791_1747752382.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3C2C/production/_130540451_gettyimages-1437568647.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66324791_1747752382.html", "title": "Jordan Henderson: Liverpool captain's Saudi Arabia move has 'tarnished his reputation' as LGBTQ+ ally", "title_page": "Jordan Henderson: Liverpool captain's Saudi Arabia move has 'tarnished his reputation' as LGBTQ+ ally - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Sometimes actions speak louder than words.\nIt is less than two years since Jordan Henderson wrote 900 words in the Liverpool matchday programme, expressing his support of Stonewall's Rainbow Laces campaign.\n\"I do believe when you see something that is clearly wrong and makes another human being feel excluded you should stand shoulder-to-shoulder with them,\" the Reds captain wrote.\nThey were words that solidified Henderson's status as an ally for the LGBTQ+ community. Today, they seem empty to some, leaving that same community wondering if there was ever any truth in what he wrote, after the England international joined the exodus to Saudi Arabia in signing a three-year deal at Al-Ettifaq.\nTo his critics his actions seem empty too, accepting a deal that will bring him a reported £700,000 per week, external in a nation where the people he claims to support are persecuted for being who they are.\nSame-sex sexual activity is illegal in Saudi Arabia, with the death penalty a possible punishment. There have also been \"consistent reports of discrimination and violence\" against LGBTQ+ people in the country, according to Human Rights Watch.\nThat Henderson would actively choose to move to Saudi Arabia has left some fans, such as Reds supporter Keith Spooner, feeling \"gutted\".\n\"On a personal level, I can understand there's financial reasons, there's personal reasons, there's game time, but I think as an advocate or an ally of people who are LGBT, whether it's in sport or life, there are knock-ons, repercussions of your actions, and his decision to go to Saudi Arabia and play there has definitely tarnished his reputation,\" he told BBC Sport.\nIn December 2020, Spooner - who came out as gay at the age of 17 - was \"completely caught off-guard\" when Henderson replied to a tweet, external in which the Reds fan told his club's captain how his wearing of a rainbow armband - often done to support LGBTQ+ causes - had \"meant the world\".\nHenderson told Spooner he would never walk alone - in a nod to Liverpool's anthem - in a tweet that has been liked by almost 30,000 people.\nIt is that same rainbow armband that is desaturated from colour to black and white for much of the promotional video Al-Ettifaq released announcing their new signing's arrival.\n\"Was that message an actual value that Jordan actually believed? Was it something that Liverpool Football Club believed? Or is it just a tick-box exercise?\" said Spooner, 27.\n\"It's getting to the stage where it's getting harder and harder to see whether or not these campaigns actually have value, or whether it is the case that these people are being told to make this comment or put out this tweet.\"\nHe added: \"The fact that he has now decided to move to Saudi, [given] their attitude to people like me, it does feel like part of what he would have said or previously spoken about in the past wasn't of true value, it wasn't the case that he truly believed it, so that's the big disappointment for me.\"\nHenderson has long been seen as one of the more socially conscious footballers, notably leading talks between Premier League captains on giving money to charities during the Covid-19 pandemic.\nIn 2021, the same year he was shortlisted for a football ally honour at the British LGBT Awards, Henderson wrote those programme notes before Liverpool's Premier League match against Southampton.\n\"Before I'm a footballer, I'm a parent, a husband, a son, a brother and a friend to the people in my life who matter so much to me,\" he wrote.\n\"The idea that any of them would feel excluded from playing or attending a football match, simply for being and identifying as who they are, blows my mind.\"\nThe father of two daughters, should Henderson's young family accompany him to Saudi Arabia he will be bringing his children up in a nation with a distinct lack of women's rights - not until 2018 were women allowed to drive, while Saudi women still experience significant discrimination and unequal treatment.\nThere is further criticism of Henderson's move, with former Aston Villa midfielder Thomas Hitzlsperger saying \"silly me\" after believing his support for the LGBTQ+ community was \"genuine\".\nAfter Henderson's departure from the Reds on Wednesday, Liverpool's LGBTQ+ fan group Kop Outs urged him to \"stand by your words as a professed ally & champion of #LGBT+ rights, of women's rights and of basic human dignity\".\nPride in Football, a network of LGBTQ+ fan groups, said in a statement: \"When you see someone who has been an ally so publicly transfer to a club in a country where LGBT+ people are attacked and imprisoned, it is disappointing.\n\"Good luck in Saudi Arabia Jordan, but you have lost the respect of so many people who valued you, and trusted you.\"\nTo date, Henderson has not addressed any of the criticism is facing. Should that moment come, many will be keen to hear what his latest words will be.\n\"I'd be interested to hear what Jordan Henderson has to say,\" said Spooner.\n\"Have his values changed? What does he think about the fact his rainbow armband is now blacked out?\n\"There is huge hypocrisy - but it's up to Jordan to answer those questions.\"", "url": "https://www.bbc.com/sport/football/66324791"}