{"authors": ["Nicola Pearson", "www.facebook.com"], "date_download": "2025-04-26 07:35:59", "date_modify": "2025-04-26 07:35:59", "date_publish": "2025-02-27 14:59:10", "description": "Unai Emery press conference: Aston Villa vs Cardiff City in the FA Cup", "filename": "sport_football_articles_c89yy012jq2o_1745652959.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6296/live/dbade4a0-4907-11ef-b74c-bb483a802c97.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c89yy012jq2o_1745652959.html", "title": "Unai Emery press conference: Aston Villa vs Cardiff City in the FA Cup", "title_page": "Unai Emery press conference: Aston Villa vs Cardiff City in the FA Cup  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Emery confirmed Pau Torres and Ross Barkley both remain out through injury, while Matty Cash is close and will be assessed on Thursday. Tyrone Mings, Emiliano Martinez, Amadou Onana, Boubacar Kamara and Donyell Malen are also all doubts for the game.\nOn the importance of the FA Cup and whether it possesses their best chance of obtaining European football next season: \"It's a way for a trophy and it's a way for Europe. The winner will play in the Europa League next year. We have three ways - Premier League, Champions League and FA Cup. We are not contenders for this trophy.\"\nAsked why, he said \"there are other teams with more options than us\" and added: \"To try to compete in this competition and to have a way for a trophy is very important. And then there is prestige. Every player, the club and the coaches would like one way of trying to get prestige as well.\"\nThe Villa boss insisted that, despite facing a Championship side, they have \"respect for the competition\" and \"respect every team that is competing in this round\".\nOn Villa's run in the competition and opportunity to reach the quarter finals: \"We are being consistent in this competition this year. At home against West Ham and Tottenham, we played a great two matches and we won. Tomorrow is another opportunity to keep being consistent. Our demands are in different ways, individually and collectively, to get confidence, to get comfortable and to try to transmit to our supporters our wishes in this competition.\nOn their busy schedule: \"We're focusing on every competition, focusing on each match and how the players are recovering after playing a lot of minutes. We're looking at how we can adapt the new players in our structure. This is the task we have now.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c89yy012jq2o"}