{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:58:06", "date_modify": "2025-05-21 04:58:06", "date_publish": "2025-01-31 22:05:25", "description": "Super League Basketball says it is prepared to break away from the British Basketball Federation amid discussions over the future.", "filename": "sport_basketball_articles_cvgekr51eljo_1747803486.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7e19/live/cfc205c0-e01c-11ef-b18b-851a01995a66.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_basketball_articles_cvgekr51eljo_1747803486.html", "title": "Super League Basketball prepared to split from British game's governing body", "title_page": "Super League Basketball prepared to split from British game's governing body - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Super League Basketball (SLB) says it is prepared to break away from the British Basketball Federation (BBF) after claiming to have been shut out from discussions over the future of Britain's men's professional basketball league.\nGoverning body the BBF announced on Wednesday it had granted preferred bidder status to a group led by Portland Trail Blazers president Marshall Glickman in its search for a long-term league operator.\nThe BBF said the tender process had \"entered a new phase\", with Glickman - alongside partners Chris Dillavou and Arjun Metre - entering an exclusive negotiating period.\nHowever, SLB - formed last summer to replace the British Basketball League which collapsed amid financial concerns - said it had not been consulted and was prepared to continue outside the BBF's jurisdiction.\nSLB chair Vaughn Millette told BBC Sport the league's nine clubs had \"engaged in good faith\" with the BBF last summer and, having been awarded an interim three-year licence to operate, \"understood then that a collaborative approach would be undertaken to secure a longer-term licence on behalf of the SLB\".\nMillette said: \"Following the BBF's decision to run an open invitation to tender for the long-term license to run the men's professional league in Great Britain, the SLB's shareholders and directors unanimously took the difficult decision to withdraw from the process after concerns were raised over the legality of the BBF's actions.\n\"Despite communicating these concerns to the BBF over a period of months, the SLB never received any substantive responses and the tender document did not allow for any changes to fees and conditions. This approach would have rendered the league un-investable.\"\nThe BBF told BBC Sport it disputed Millette's claims, pointing to a letter addressed to the SBL in December explaining that interested parties would be \"welcome to put forward any variations to the key terms that align with their vision\".\nIt also disputes the claim the BBF's approach was \"un-investable\" saying its preferred bidders have presented a business plan that can \"can elevate British basketball to the benefit of all stakeholders, including the existing clubs.\"\nThe BBF said it believed SLB would bid to become the long-term licensee and therefore deemed it inappropriate for SLB \"to be closely involved in defining the proposed terms and assessment criteria\".\n\"Despite the BBF's encouragement, SLB chose not to enter the process. That was their decision to make, but it was one which meant they would not be awarded a long-term licence,\" the BBF said.\n\"Now each club will decide whether it wishes to engage with the preferred bidder in order to understand and - if they wish - to negotiate what's on offer.\"", "url": "https://www.bbc.com/sport/basketball/articles/cvgekr51eljo"}