{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:13:55", "date_modify": "2025-05-20 13:13:55", "date_publish": "2023-08-01 05:20:19", "description": "Before The Hundred returns on 1 August, BBC Sport has worked with data analysts CricViz to assess how the eight men's teams are shaping up.", "filename": "sport_cricket_66317699_1747746835.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/A135/production/_130596214_-30222a56-c0a9-42cb-b37a-f36ce9de66f5.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66317699_1747746835.html", "title": "The Hundred 2023: How are the men's teams shaping up for the new tournament?", "title_page": "The Hundred 2023: How are the men's teams shaping up for the new tournament? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The third season of The Hundred starts on Tuesday with familiar faces returning to their sides and some joining new teams.\nBBC Sport asked data analysts CricViz to assess the strengths and weaknesses of the eight teams in the men's competition.\nThey have also looked at how each squad may be used throughout a game and the tournament to get you prepared for the four weeks ahead.\nPhoenix have the potential to field a fluid batting and bowling line-up with as many as five all-rounders in Moeen Ali, Liam Livingstone, Shadab Khan, Dan Mousley and Benny Howell.\nThat should allow Phoenix to adapt to conditions with four spinners alongside four pace options in the starting XI - this could be an advantage at Edgbaston, where spin dominated at times during the T20 Blast.\nNew signing Ben Duckett joins Moeen and potentially Mousley as left-handers in the batting line-up to complement right-handers Will Smeed, Livingstone and Shadab.\nConsistently pairing left and right-handers could be crucial in countering spin match-ups as well as taking advantage of the lop-sided boundary dimensions that we often see in The Hundred.\nFitness and availability is one factor that has affected Phoenix previously, particularly on the fast bowling front where the likes of Chris Woakes and Adam Milne have struggled for consistency, which has led to poor death-over returns at times.\nWoakes is likely to miss at least the first part of the tournament again having played for England in the final three Ashes Tests against Australia, with the last game having finished on Monday.\nSpirit are somewhat overwhelmed with options to open the batting, with Zak Crawley, Adam Rossington, Matthew Wade and Daniel Bell-Drummond all vying for spots at the top of the order.\nSpirit's lack of a true finisher to replace Kieron Pollard as a result of recruiting so many top-order batters could hurt them, and it is an area where newly appointed skipper Dan Lawrence and overseas star Daryl Mitchell will have to be at their best to repeat last season's finishes.\nAll-rounders Liam Dawson and Jordan Thompson impressed in 2022 and bring balance to the side - Dawson's left-arm spin is capable of tying down right-handers during all phases of the innings, while pace bowler Thompson's has a knack for consistently taking wickets.\nNathan Ellis and Mark Wood provide high-pace options for the Lord's outfit, but the fitness and availability of the England fast bowler - who played the final three Ashes Tests - is perhaps questionable.\nSpirit also had to make a last-minute change, with Dan Worrall replacing Olly Stone, who misses his third successive year through injury. Worrall has spent the season at Surrey so is acclimatised to English conditions but has rarely featured in white-ball cricket.\nLast year's runners-up Originals have firepower and depth throughout their batting line-up, but on the face of it they lack left-handed options with Tom Lammonby and Max Holden likely to warm the bench - this may bring both leg spin and left-arm spin into play for the opposition.\nThe counterpoint here is that right-handers Jos Buttler, Laurie Evans and Wayne Madsen have excellent records facing spinners who turn the ball away from them, capable of covering a potential threat.\nWanindu Hasaranga will be a big miss once again. The Sri Lanka spinner has been replaced by Pakistan leg-spinner Usama Mir, who impressed for Worcestershire in the T20 Blast, taking 14 wickets in nine games.\nThe Originals attack will be spearheaded by Josh Little and Richard Gleeson, two bowlers capable of bowling at high pace in all phases of the innings.\nLittle will miss the final three group games, before returning for the knockouts if Originals qualify. However in Pakistan's Zaman Khan they recruited a high-quality replacement, with the quick bowler taking 23 wickets in the T20 Blast for Derbyshire this season.\nTom Hartley's left-arm spin should tie down right-handed batters, while the all-round talents of seamers Jamie Overton and Paul Walter plus the off-spin of Ashton Turner bring different skillsets to skipper Buttler, who should have enough options to adapt to the opposition and conditions.\nSuperchargers added Matt Short and Tom Banton to their top order during the off season - and alongside Adam Lyth they should provide plenty of firepower.\nHowever, Superchargers had both the lowest average and strike-rate against leg spin last season, and the lack of a quality left-hander could hamper them, limiting the quick scoring of middle-order batters Adam Hose, Harry Brook and David Wiese.\nNew signing Reece Topley, who was with Oval Invincibles, brings some much-needed pace quality to the attack at the top and tail of the innings, as support to his England team-mate Adil Rashid.\nSuperchargers have all-round options elsewhere, although they will have to be smart to get the best out of the likes of Wayne Parnell, Wiese and Brydon Carse considering the quick-scoring nature of Headingley.\nThe Invincibles have plenty of firepower to exploit the small boundaries at The Oval. Will Jacks and Jason Roy should provide fast starts at the top, with left-hander Sam Curran and South Africa's Heinrich Klaasen capable of providing some big hitting during the middle overs.\nKent duo Sam Billings and Jordan Cox bring added depth to the batting alongside all-rounder Tom Curran who scored quickly at the back end last year. The form of Roy and Billings, both during the last Hundred season and since, may be of concern.\nQuality and variety runs through their bowling attack, with spinners Sunil Narine and Adam Zampa capable of turning the ball both ways and bamboozling batters.\nThe Curran brothers offer plenty of variation, with Sam's left-arm angle and mixture of yorkers and quick bouncers complemented by right-armer Tom's slower balls and hard lengths.\nTheir domestic bowling depth may come into question after losing Topley during the off season as well as Saqib Mahmood through injury recently. Surrey quick Gus Atkinson and Durham leg-spinner Nathan Sowter could be called upon after impressing on the domestic circuit this season.\nBrave made some big moves during the off season and have gone all out on overseas batters - New Zealander Finn Allen is a fast scorer and complements James Vince and Devon Conway at the top of the order, two batters who like to get set.\nLeus du Plooy impressed in an underwhelming Welsh Fire team, making 237 runs in two years, and the Hungarian-South African left-hander brings much-needed quality to the middle order, allowing Brave to pair left and right-handers should they wish to do so.\nAustralian Tim David also returns to the south coast and will be hoping to deliver better returns than his 84 runs in seven innings last season. David will depart on 20 August and be replaced by the all-round talents of New Zealand's Mitch Santner, who may play a big part if Brave are in contention heading into the final week.\nTheir bowling was hampered by injury last term, but Chris Jordan and Tymal Mills return after spearheading the Brave attack to victory in 2021 with a combined 17 wickets.\nCraig Overton's new-ball wicket-taking exploits in the Blast - 13 wickets in the six-over powerplay - will complement Jordan and Mills, two bowlers who prefer bowling at the death. James Fuller has a great record at the Ageas Bowl with both bat and ball, bringing balance to Stephen Fleming's side.\nThe lack of experience in their spin duo, Rehan Ahmed, 18, and Jafer Chohan, 21, could be an area teams look to exploit.\nDefending champions Rockets persisted with a left-right batting combination throughout 2022 and will be looking to do the same this year with Dawid Malan and Colin Munro complementing Alex Hales and Tom Kohler-Cadmore. This strategy suits the lopsided nature of Trent Bridge.\nThe likes of Samit Patel, skipper Lewis Gregory, Daniel Sams and Imad Wasim also provide plenty of firepower down the order.\nWith the ball, Rockets have plenty of variety with the capability to cover pretty much every bowling style in an XI depending on opposition.\nThe only area where they perhaps lack quality is at the death. However, last year they regularly took wickets and mixed up their bowlers to exploit conditions.\nThe late withdrawal of Afghanistan leg-spinner and number one-ranked T20 bowler Rashid Khan is a significant blow, but his replacement for the first three games Imad Wasim is used to conditions at Trent Bridge, having played for Nottinghamshire in the T20 Blast, and offers skills with bat and ball.\nHowever, New Zealand spinner Ish Sodhi, who will come in as planned for the fourth game onwards, offers less with the bat and in the field, and that may affect Rockets as the tournament progresses.\nFire added Stephen Eskinazi, Tom Abell and Glenn Phillips to their batting line-up during the draft, securing three high-quality batters who should be able to provide runs in the middle order, an area where they have severely lacked in the first two years.\nThe engine room should have the cushion of fast starts from Jonny Bairstow - depending on when he joins up after The Ashes - and Joe Clarke at the top, as well as hitting depth provided by the likes of David Willey, Shaheen Afridi and Roelof van der Merwe.\nThe lack of a high-quality left-hander is perhaps Fire's only major concern, particularly limiting their ability to exploit lopsided boundaries should the opportunity arise.\nThe draft also saw Fire add plenty of quality with the ball. Left-armers Shaheen and Willey should trouble batters with new-ball movement, and a high-pace combination of Pakistan's Shaheen and Haris Rauf should see an improvement at the death.\nFire will be hoping their finger spinners, like left-armer Van der Merwe and off-spinner Phillips, can make use of the square boundaries at Cardiff, although they could be hurt by the lack of a true frontline leg spinner who turns it both ways.", "url": "https://www.bbc.com/sport/cricket/66317699"}