{"authors": ["Steve Hermon", "www.facebook.com"], "date_download": "2025-04-26 06:54:14", "date_modify": "2025-04-26 06:54:14", "date_publish": "2025-02-28 16:13:11", "description": "BBC Radio WM's West Bromwich Albion reporter Steve Hermon says the Baggies' future may be brighter than some fear - despite a big £33.9m loss.", "filename": "sport_football_articles_cvgww2rdkmeo_1745650454.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/db87/live/ef6032c0-f5cb-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cvgww2rdkmeo_1745650454.html", "title": "West Bromwich Albion's future could be brighter than some fear", "title_page": "West Bromwich Albion's future could be brighter than some fear - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Many fans will see a £33.9m loss in a single financial year and be alarmed after all the talk about having to keep losses under £39m over a three-year period as part of the EFL's profit and sustainability rules.\nIt is absolutely an eye-watering amount. However, there is more to that figure than meets said watery eye.\nAnything spent on infrastructure and areas of the club such as the Academy or Women's team doesn't have to be included, so the actual losses are significantly lower. In the accounting world, they would be considered 'add-backs'.\nIt still means that the Baggies must act responsibly but, as seen with their transfer activity in the two windows that have followed, the club have been able to spend money on players.\nIt's also worth noting that this financial period ended just four months after Shilen Patel's takeover. And it's the first time in 22 years that Albion haven't received Premier League money, whether that's through being in the top flight or receiving parachute payments, which is the main cause for turnover dropping by more than half compared to the previous year.\nOn the positive side, they managed to decrease staff costs with several high-earning players departing at the end of last season.\nThe Baggies owner has said he arrived with 'eyes wide open', so none of this is a surprise. The club expecting to record another loss in the next financial year but crucially, don't expect to breach any financial rules.\nThe American is also continuing to show his commitment by bankrolling the club to the tune of £2m a month since completing the takeover.\nTony Mowbray's side still have eyes on the prize of a return to the Premier League. The future could be bright a lot sooner than some think.\nBBC Radio WM's Steve Hermon has been covering West Bromwich Albion's fortunes almost from the moment when the battle began to find new owners.", "url": "https://www.bbc.co.uk/sport/football/articles/cvgww2rdkmeo"}