{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:25:39", "date_modify": "2025-05-20 12:25:39", "date_publish": "2023-08-04 12:12:33", "description": "Derby County's huge support is a \"massive advantage\" as they look to win promotion from League One, says boss Paul Warne.", "filename": "sport_football_66405647_1747743939.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0252/production/_130649500_shutterstock_editorial_13271308cs.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66405647_1747743939.html", "title": "Paul Warne: Derby County boss says players must make most of fans advantage", "title_page": "Paul Warne: Derby County boss says players must make most of fans advantage - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Derby County's standing and huge support is a \"massive advantage\" that the players must make the most of as they look to win promotion from League One, says boss Paul Warne.\nThe Rams, who start the season at home against Wigan Athletic, missed out on the play-offs by one point last term.\nAttendances at Pride Park averaged 27,259, the highest in the third tier.\n\"I appreciate that in the betting [odds] we are up there,\" Warne told BBC Radio Derby.\n\"But we were up there last year and we finished seventh.\n\"It's a massive advantage for our players playing in front of that crowd at home and away. But I wouldn't say we are the out-and-out favourites.\"We are one of six or eight teams who currently look more likely to be up there but there is always a team you are not suspecting - and maybe two this year - and the league is a lot more open.\"\nThe Rams dropped out of the Championship in the 2021-22 season, finishing second from bottom after a season of financial turmoil which saw them deducted 21 points.Although they fell just short last term, Warne is confident they have the quality and backing to mount another promotion challenge this time around.He added: \"I do think we are a good team with a good squad and a massive following and I do know when teams come to Pride Park - as I did when I was a player - it's like 'wow, we have to be at our best to come away with anything'.\n\"We're the biggest team, as in we've got the biggest following. However there were three teams who finished above us in League One last season who we need to get past [Barnsley, Bolton and Peterborough] and they have strengthened again in the summer.\"There are teams like Oxford who I think will be very good this year. I keep speaking highly of them and think they will be top six for sure and then you have the usual suspects like Portsmouth and Charlton who are very big clubs.\"", "url": "https://www.bbc.com/sport/football/66405647"}