{"authors": ["Dan Roan", "www.facebook.com"], "date_download": "2025-04-26 06:53:04", "date_modify": "2025-04-26 06:53:04", "date_publish": "2025-02-28 16:49:45", "description": "The UK is set to host the men's Tour de France Grand Depart in 2027, BBC Sport has learned.", "filename": "sport_cycling_articles_cx2gyx704pvo_1745650384.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e7f9/live/e36b90f0-f5e8-11ef-9e7b-21c750c82d19.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_cycling_articles_cx2gyx704pvo_1745650384.html", "title": "Tour de France: Great Britain set to host Grand Depart of men's race in 2027", "title_page": "Tour de France: Great Britain set to host Grand Depart of men's race in 2027 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The Grand Depart of the men's Tour de France is set to return to Great Britain in 2027, BBC Sport has learned.\nBritain last hosted the start of the world's most famous cycling race in Yorkshire in 2014, when it began in Leeds, followed by stages finishing in Sheffield and London.\nAnd Edinburgh is now under consideration for the Grand Depart in 2027 for what would be only the third time the race has started in the UK.\nGB's first Grand Depart took place in London in 2007.\nDetails of the route are still being finalised, and advanced talks between British sports authorities and race organisers continue.\nBut according to well-placed sources, an official announcement could come as early as next month.\nFunding body UK Sport identified the 2027 Tour as one which could begin in Britain in a list of international event hosting targets last year, and has been in negotiations with race organisers ASO, alongside British Cycling.\nIn a statement, UK Sport said, \"We have made no secret of our ambition to host the Tour de France Grand Depart in Britain - to inspire more people to enjoy cycling and bring lasting benefits to communities.\n\"However, we respect this is a matter for the ASO and we remain committed to working hard to develop opportunities that can bring the joy of cycling to everyone.\"\nAccording to an official report, crowds at the roadside for the three English stages in 2014 totalled 4.8 million, with 3.5m individual spectators.\nThat helped generate an estimated £128m in total revenue, with £102m in Yorkshire alone.\nLast year's Grand Depart took place in Florence, Italy, with the 2026 race due to start in Spain in Barcelona.\nIn 2021, the British government said it was allocating millions of pounds to try to bring the Grand Depart back for the 2026 Tour with stages across England, Scotland and Wales, but the bid was then abandoned.\nTwo years later, Scotland Cycling also said it wanted to stage the race after the country hosted the UCI World Championships.\nThen in 2024 an Ireland bid to host the Grand Depart in either 2026 or 2027 was withdrawn.", "url": "https://www.bbc.co.uk/sport/cycling/articles/cx2gyx704pvo"}