{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:48:58", "date_modify": "2025-05-21 06:48:58", "date_publish": "2025-01-31 08:23:08", "description": "FCSB 0-2 Man Utd: Fan views on Europa League game", "filename": "sport_football_articles_cpvmd1r42l8o_1747810138.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cpvmd1r42l8o_1747810138.html", "title": "FCSB 0-2 Man Utd: Fan views on Europa League game", "title_page": "FCSB 0-2 Man Utd: Fan views on Europa League game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your thoughts after Thursday's Europa League game between FCSB and Manchester United.\nHere are some of your comments:\nPeter: Alejandro Garnacho and Kobbie Mainoo must not leave this team. When United were more aggressive in the second half, they looked much better. There is still a long way to go but things are looking better, and clean sheets give confidence to the whole team. Maybe it's a good time to bring in a couple more of the academy lads, rather than spending on highly-priced poor players.\nYusuf: Brilliant performance from United. We are the only team in the Europa League not to lose a game. Mainoo was fantastic on the left wing - he really adjusted to that position well. Rasmus Hojlund had a lot of chances to get on the scoresheet but none were successful. We struggled to score in the first half but were able to come back in the second half with some fantastic finishes from Diogo Dalot and Mainoo as well.\nAdam: I was left shaking my head in frustration at the end of the first period. However, the half-time tweaks were inspired and suddenly United took the game by the scruff of the neck and totally obliterated any resolve FCSB had left. Could this be a sign of things to come from Amorim's team? If so, the future is bright!\nMark: A performance that makes us happier - for once. Ruben Amorim made controlled substitutions, Mainoo in a new position worked and Garnacho has to stay unless it is ridiculous money.", "url": "https://www.bbc.com/sport/football/articles/cpvmd1r42l8o"}