{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:38:44", "date_modify": "2025-05-19 15:38:44", "date_publish": "2017-07-03 12:46:54", "description": "British and Irish Lions head coach Warren Gatland could take charge of New Zealand one day, says Sir Graham Henry.", "filename": "sport_rugby-union_40482238_1747669124.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/17BA3/production/_96778179_gats.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_rugby-union_40482238_1747669124.html", "title": "British and Irish Lions: Warren Gatland could coach All Blacks - Sir Graham Henry", "title_page": "British and Irish Lions: Warren Gatland could coach All Blacks - Sir Graham Henry - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "British and Irish Lions head coach Warren Gatland could take charge of New Zealand one day, says Sir Graham Henry.\nThe tourists' 24-21 victory in Wellington on Saturday was their first victory over the All Blacks since 1993.\nHenry, who steered the All Blacks to win the 2011 World Cup, believes Wales coach Gatland, 53, could follow in his footsteps with his native country.\n\"Warren's done a great job in getting them all together and he's possibly a future All Blacks coach,\" Henry said.\nCurrent New Zealand coach Steve Hansen guided the All Blacks to 2015 World Cup victory and is contracted until the end of the 2019 tournament.\nGatland was appointed Wales coach in 2007 and has also signed a deal to take them through to the 2019 World Cup.\nThe New Zealander also took a break to coach the Lions in 2013 when he led them to a 2-1 series win over Australia.\nGatland has also coached Ireland and was in charge at Wasps when they won the European Cup in 2004.\nHenry was the first overseas coach to take charge of Wales and also coached the Lions on their 2001 tour of Australia, when they lost the Test series 2-1.\n\"He [Warren] is one of the most experienced coaches in the world, he's had a long run with Wales and won a couple of Six Nations,\" Henry told BBC Radio 5 live's Sportsweek programme.", "url": "https://www.bbc.com/sport/rugby-union/40482238"}