{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:50:39", "date_modify": "2025-05-21 03:50:39", "date_publish": "2025-04-07 11:04:24", "description": "Newport County: Nelson Jardim apologises to County fans", "filename": "sport_football_articles_c8ep7lzwg1xo_1747799439.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d87f/live/aa8cfaf0-139b-11f0-b054-11b99aeb4b3e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c8ep7lzwg1xo_1747799439.html", "title": "Newport County: Nelson Jardim apologises to County fans", "title_page": "Newport County: Nelson Jardim apologises to County fans  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Nelson Jardim has apologised to Newport County fans for not acknowledging their support after Saturday's Carlisle capitulation, claiming he was caught up in a \"heated moment\" in the tunnel.\nJardim said it was the most frustrated he has felt all season on the road after the Exiles threw away a 2-0 lead to lose 3-2 to League Two's bottom side.\nNewport were 2-0 up inside 28 minutes through Kieron Evans and Bobby Kamwa, but United turned the game on its head with three second-half goals.\n\"First of all, I would like to apologise to our fans,\" said Jardim. \"They travelled in their numbers...\n\"As they will understand, being 2-0 up and then losing it in that way, in the way the goals happened, I had to ask a couple of questions and I was caught up in the tunnel.\"\nThe Portuguese coach said his \"heated moment\" kept him in the tunnel \"for a long period\", which led to him not going to acknowledge the supporters who had made the 560-mile round trip.\n\"It's not normal for me. I've been going every game, home and away, and thanking the fans because they've been great to us.\n\"But I think they will understand I wanted some answers.\n\"I was caught up in a heated moment which I'm not proud of, but sometimes the emotions just go through you and I have to fight for my club.\"\nCounty's second-half collapse at Brunton Park led to their fifth successive away defeat as Mark Hughes' side gave themselves a lifeline in the battle to beat the drop.\nAsked whether Saturday was the most frustrating away performance of the season, Jardim said, \"Definitely, yes.\n\"Every game is tough. Especially when you are 2-0 up away, you can never lose the game. It's not good enough.\n\"We started very well. It's just a pity because we again fell short when it came to defending duels, aerial balls...when it's a battle we always struggle.\"\nCounty, 17th in the table, now have three home games and two away matches left of a largely disappointing campaign.\nThey will be hoping for a first win in five matches when Colchester visit Rodney Parade on 12 April.", "url": "https://www.bbc.com/sport/football/articles/c8ep7lzwg1xo"}