{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:16:48", "date_modify": "2025-05-20 14:16:48", "date_publish": "2023-07-30 00:00:00", "description": "Watch BBC Two coverage live from Sunderland of the World Triathlon Series mixed relay", "filename": "sport_live_triathlon_66283990_1747750608.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/17095/production/_130575349_gettyimages-1537909112.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_triathlon_66283990_1747750608.html", "title": "World Triathlon Series LIVE: Watch BBC Two coverage live from the mixed relay in Sunderland", "title_page": "World Triathlon Series LIVE: Watch BBC Two coverage live from the mixed relay in Sunderland - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "How to get into triathlon\nBBC Sport\nWhy get into triathlon?\nTriathlon is a great way to get active by swimming, cycling and running, and it's fun and varied too.\nWho is it for?\nAll ages, from mini triathlons for kids to GO TRI, external beginner events. There are also a number of women-only events.\nWhat if I want a proper workout?\nTriathlon events come in a variety of course distances and mixing in a bit of competition will push your workout to the max.\nCan I take it to another level?\nIf you want to push it up a gear, consider joining a local club, external to take part in some structured training before racing.\nIs there a disability option?\nParatriathlon is very popular with many inclusive events and competitions that cater for most disabilities.\nLike running, swimming or cycling?\nFancy doing all three, one after the other? Triathlon is the sport for you!\nTriathlon mainly runs from May-September and there are loads of races and taster sessions to choose from. Find a comprehensive list of races via the British Triathlon event finder., external\nGo Tri, external is a fun way to get a taste without breaking the bank. Pool-based races are a great introduction to the sport if you are a first timer.\nUseful links", "url": "https://www.bbc.com/sport/live/triathlon/66283990"}