{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:19:16", "date_modify": "2025-05-20 13:19:16", "date_publish": "2023-08-03 00:00:00", "description": "England beat Australia to top Pool F at the Netball World Cup and Wales beat Trinidad and Tobago - follow live.", "filename": "sport_live_netball_65821467_1747747156.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1513C/production/_130623368_netball_getty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_netball_65821467_1747747156.html", "title": "Netball World Cup 2023 LIVE: Watch England v Australia score, commentary & updates", "title_page": "Netball World Cup 2023 LIVE: Watch England v Australia score, commentary & updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Goodbye!\nWell, I need a brew and a lie down after all of that.\nKeep across all the latest netball news here and until then we'll see you on Saturday for that huge England semi-final against Jamaica, New Zealand or South Africa.\nCan't wait, see you then.\n'To be down and to still come out on top feels really nice'\nFT: Australia 55-56 England\nBBC Sport\nEngland head coach Jess Thirlby speaking to BBC TV on a historic first World Cup win over Australia: \"It is a masively important moment for this group in particular.\n\"It adds to our confidence bank, but we know that we've got two games to come and it means nothing if we can't follow it up. But for today it is important to allow the players to celebrate that.\nOn how big the win really is:\n\"I'm not going to lie, it does feel nice. I think the fact that we were eight goals down, to then be pushed in the last 15 minutes and still come out on top...\n\"I don't think you can underestimate what that tells me about where the group are at mentally. That is the scary thing and that is what we need to focus on as we look forward to the semi finals.\nOn the in-game tactical changes:\n\"As a coaching team we were really confident in the areas where we might have the edge on those slides, particularly in quarters and not just the breaks.\n\"To be able to unleash for me for short periods of time havign seen how the game plays out, with the most respect to Mentor and Guscoth really wearing the team down.\n\"Both teams know each other so well, it is just what you do with that knowledge.\n'Everyone who came on had a huge impact'\nFT: Australia 55-56 England\nBBC Sport\nEngland centre Imogen Allison speaking to BBC TV:\n\"The team are feeling pretty good at the moment and it was a great performance from everyone.\n\"Every win is a confidence boost for us, and it is something that keeps us going day after day. So yes getting one over Australia is a good one.\n\"I don't have a preference [of position], because my coach is stood right next to me! I really enjoy them both, they are both very different, but it was good to get to play out at wing defence at the end there.\n\"We've had some games where we've been able to throw out different combinations, and that is why we were able to go and do it out there [today]. All the girls that came on had a huge impact.\n\"I think I'm just enjoying every moment, I'm just loving it and it is just a great experience.\"", "url": "https://www.bbc.com/sport/live/netball/65821467"}