{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:11:03", "date_modify": "2025-05-21 04:11:03", "date_publish": "2024-12-29 00:00:00", "description": "Steven Fletcher's late winner ensured Wrexham moved up to second in League One with victory over Wigan Athletic.", "filename": "sport_football_live_cy89y2wpl95t_1747800663.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cy89y2wpl95t_1747800663.html", "title": "Wrexham rise to second with Wigan win", "title_page": "Wrexham rise to second with Wigan win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wrexham rose to second in League One after extending their unbeaten league run to eight matches with a 2-1 victory over Wigan Athletic at the Stok Racecourse.\nThe Latics controlled proceedings early on without overly troubling the hosts who saw Paul Mullin fire a free-kick at Sam Tickle in an opening half of precious little goalmouth action.\nAfter surviving a scare from a Jensen Weir effort moments earlier, the hosts took the lead as Ryan Barnett's deflected strike beat Tickle.\nManchester United loanee Joe Hugill looked to have earned Shaun Maloney's side a point in north Wales when he headed Silko-Amari Thomas' cross beyond Mark Howard on 79 minutes.\nBut Steven Fletcher struck his third goal in four matches in the first minute of added time as Wrexham - who remain unbeaten on home turf in the league this term - sealed a dramatic victory.\nPhil Parkinson's side sit one point clear of Wycombe Wanderers following the Chairboys' 2-1 defeat at Charlton Athletic and one behind leaders Birmingham City - who have two games in hand.\nWigan drop to 16th after a ninth league loss of the campaign.\nWrexham boss Phil Parkinson:\n\"They're [Wigan] a good side, we knew that. They've got some dangerous players. Where we at our best? Probably not.\n\"In terms of sticking to the job and showing character, strength and personality, I think all of that was high.\n\"The mentality of the group is so strong, and that showed again today.\"\nWigan Athletic head coach Shaun Maloney:\n\"I can't say anything negative about the team. I think there were moments in both boxes that you can probably pick out, but the team were brilliant today.\n\"They're [Wrexham] just really dangerous with the long ball, you know their nines are going to cause a threat.\n\"I thought we were really good. Honestly, I can't ask any more of them. You never want to accept getting beat, but if there's ever a way you do, it's playing like that.\"", "url": "https://www.bbc.com/sport/football/live/cy89y2wpl95t"}