{"authors": ["Andy Gray", "www.facebook.com"], "date_download": "2025-05-21 04:33:31", "date_modify": "2025-05-21 04:33:31", "date_publish": "2025-04-04 20:54:42", "description": "Northern Ireland manager Tanya Oxtoby admits the second half of Friday's 1-1 draw in Romania in the Nations League \"wasn't good enough\".", "filename": "sport_football_articles_crld3e8072zo_1747802011.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5f2d/live/8ac10ec0-1196-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_crld3e8072zo_1747802011.html", "title": "Romania 1-1 Northern Ireland: Second half 'wasn't good enough' from NI", "title_page": "Romania 1-1 Northern Ireland: Second half 'wasn't good enough' from NI - Tanya Oxtoby - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Northern Ireland manager Tanya Oxtoby admits the second half performance in Friday's 1-1 draw in Romania \"wasn't good enough\".\nDanielle Maxwell's superb strike gave Northern Ireland the lead in the 33rd minute of the Nations League double-header, but the visitors gifted Romania an equaliser five minutes later.\nRomania could have won the game in injury time but goalscorer Mihaela Ciolacu struck the crossbar.\n\"We know that second-half performance wasn't good enough, and we'll learn from it and get better,\" Oxtoby told the Irish FA in Bucharest.\n\"We had enough controlled possession in the first half to ensure we have ourselves a comfortable lead, but we didn't do that.\n\"The second half was really transitional and we didn't control the game and from that point of view it's a little bit disappointing that we have allowed them right back in.\"\nSimone Magill and Rebecca Holloway had chances to open the scoring in Bucharest before Maxwell hit a superb opener - which Oxtoby said was a \"great strike\".\nHowever, Romania hit back when a defensive mix-up between Ellie Mason and Rachel Dugdale allowed Ciolacu to poke home the equaliser.\nNorthern Ireland dominated possession but struggled to create many clear-cut chances, and Romania should have won the game in the 91st minute when Ciolacu curled an effort off the woodwork.\nThe draw, along with Bosnia-Herzegovina's 5-1 defeat to unbeaten leaders Poland, means Oxtoby's side remain second in Group B1.\nRomania, who lost 4-0 in Bosnia-Herzegovina and then 1-0 at home to Poland, remain bottom of the group.\n\"We knew coming away to Romania was going to be difficult. I said it before the game, I thought they were really unlucky against Bosnia,\" Australian Oxtoby added.\n\"I thought they were the better team and their result against Poland shows how good a side they are.\"\nThe sides will meet again at Windsor Park on Tuesday and Oxtoby says \"we need to learn from nights like this\".\n\"There are areas of our game where we're strong, that we can continue to move forward with, but there are areas of our game that we need to continue to develop.\n\"This group is on a journey, we've said that all along.\n\"We started the game really well again and we'll be looking more of the same on Tuesday night.\"", "url": "https://www.bbc.com/sport/football/articles/crld3e8072zo"}