{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:57:34", "date_modify": "2025-05-21 04:57:34", "date_publish": "2025-04-04 13:14:54", "description": "Cricket Canada says it is \"actively monitoring\" the situation after captain Nicholas Kirton was arrested in the Caribbean.", "filename": "sport_cricket_articles_cx20w0667kgo_1747803454.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/173d/live/4bbc58b0-113c-11f0-8874-0979deb646d0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cx20w0667kgo_1747803454.html", "title": "Nicholas Kirton: Cricket Canada monitoring arrest of captain", "title_page": "Nicholas Kirton: Cricket Canada monitoring arrest of captain  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cricket Canada says it is \"actively monitoring\" the situation after captain Nicholas Kirton was arrested in the Caribbean.\nLocal reports say the 26-year-old was detained at Barbados Airport on Sunday on potential drugs charges.\n\"We are actively monitoring the situation and closely following developments as they unfold,\" Cricket Canada said in a statement.\n\"We take this matter seriously and remain steadfast in upholding the highest standards of integrity and accountability within the sport.\"\nBBC Sport has contacted Barbados police for comment.\nKirton was born in Barbados but is eligible to play for Canada through his mother.\nHe represented West Indies Under-19s before emigrating to Canada, making his international debut in a T20 match against Oman in 2019.\nThe batting all-rounder, who has played 21 one-day internationals and 28 T20Is, was appointed as captain in July 2024.\nCanada are preparing for the inaugural North American Cup - also featuring Cayman Islands, Bahamas, Bermuda and the United States - which begins in the Cayman Islands on 18 April.", "url": "https://www.bbc.com/sport/cricket/articles/cx20w0667kgo"}