{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:57:03", "date_modify": "2025-05-21 07:57:03", "date_publish": "2025-03-27 19:48:06", "description": "Cardiff City could be without top goalscorer Callum Robinson for Saturday's visit of Sheffield Wednesday.", "filename": "sport_football_articles_cwyg0zqd5xpo_1747814223.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7acc/live/007d0c20-0b36-11f0-b7b7-9d88d3000125.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cwyg0zqd5xpo_1747814223.html", "title": "Cardiff City: Callum Robinson a doubt for Sheffield Wednesday visit", "title_page": "Cardiff City: Callum Robinson a doubt for Sheffield Wednesday visit - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cardiff City could be without top goalscorer Callum Robinson for Saturday's visit of Sheffield Wednesday.\nThe Owls, who have the third best away record in the Championship, arrive in the Welsh capital with Cardiff just a point and a place outside of the relegation zone.\nThe absence of Robinson and another forward, Chris Willock, would be disappointing for Cardiff who do welcome back some players from injury, with winger Callum O'Dowda set to feature despite leaving Republic of Ireland duty with muscle tightness.\n\"We have a couple of knocks to Chris Willock and Callum Robinson, they potentially won't be available, but other than that, everyone is back,\" boss Omer Riza told BBC Sport Wales.\n\"Perry Ng has come back in now. David Turnbull, Alex Robertson, Will Alves and Ollie Tanner are training. Andy Rinomhota hasn't come back in yet from international duty.\n\"Callum O'Dowda felt a bit of tightness so it was better that he didn't go because of the risk there. He's doing well and is fit for Saturday. Tanner has been in non-contact for a few sessions but was in contact today. He'll be in contention to be in the squad.\n\"Anwar El Ghazi has been ill, he's got over that now and is training well.\"\nRiza expects a tough test from a Sheffield Wednesday side who have been much better on the road.\n\"They're a good side. They've got some attacking threats, they've got a good structure and good concepts in their game, in possession and out of possession in respect of pressing and controlling the game at times in possession. It'll be an interesting game,\" Riza added.\n\"We're looking forward to it, a home game and hopefully we'll have a good crowd behind the boys. We're expecting a good game.\"", "url": "https://www.bbc.com/sport/football/articles/cwyg0zqd5xpo"}