{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:37:22", "date_modify": "2025-04-26 03:37:22", "date_publish": "2025-03-08 00:00:00", "description": "John Eustace oversees his first win as Derby boss as they beat his old side Blackburn to move off the bottom of the Championship.", "filename": "sport_football_live_c5y9qyy0xvnt_1745638642.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9ddf/live/b5adbd60-fc45-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_c5y9qyy0xvnt_1745638642.html", "title": "Derby County 2-1 Blackburn Rovers: Rams move off bottom of Championship", "title_page": "Derby County 2-1 Blackburn Rovers: Rams move off bottom of Championship - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "John Eustace oversaw his first win as Derby County boss as they ended a 12-game winless league run and moved off the bottom of the Championship table by beating the Blackburn Rovers side he left just three weeks ago.\nTwo goals in the first seven minutes from a Rams side that had failed to score in their previous four matches – and who had only managed four in their past 12 league games - set them up for a much-needed win that dents Rovers' play-off hopes.\nCraig Forsyth opened the scoring from close range after the visitors failed to deal a free-kick floated into the box, and captain Ebou Adams scrambled home the second soon after.\nMakhtar Gueye came up with a thumping response for Blackburn just before the break and, while the visitors pressed for a second-half equaliser, Derby hung on for a win that moves them to within four points of safety.\nHaving endured three defeats in three games since taking charge, Eustace was looking to avoid becoming the first Rams boss to ever lose his first four league matches.\nReunions can so often be awkward, and Blackburn's first meeting with their former boss since he abandoned their push for promotion for a relegation battle with Derby was certainly that.\nThere were toy snakes being waved about by some Rovers fans, highlighting their displeasure with the way the 45-year-old left Ewood Park on 13 February.\nIt took just three minutes into his fourth match for Derby to get their first goal of the Eustace era, with Forsyth coming up with a sliding finish after Nat Phillips knocked a free-kick down into his path.\nA low cross from Marcus Harness minutes later, which Liam Thompson was first to meet before it bobbled to the feet of Jerry Yates before eventually falling to Adams to finish, helped send Pride Park into an early frenzy.\nBlackburn were without leading scorer Andreas Weimann, with the Austrian international's season ended by a knee injury suffered in last week's draw against Norwich, and it was his replacement, Yuki Ohashi, who helped pull a goal back before half-time.\nWhile the Japan international was foiled by the feet of Rams goalkeeper Jacob Widell Zetterstrom before the half-hour mark, he linked up with Tyrhys Dolan to tee up Gueye to slam home in the 40th minute.\nIt was only a moment earlier that Derby nearly had a third, with a poor pass from Dion Sanderson in his own box leaving goalkeeper Aynsley Pears to scramble and snatch the ball off Adams' toe when an empty net was at his mercy.\nOhashi sent a volley over early in the second half as Rovers searched for an equaliser, while Phillips sent a header off target at the other end.\nGueye remained a Rovers threat throughout as they attempted to salvage something from the game, which Derby could have made comfortable if Yates had managed to make meaningful contact when a late chance fell to him at the back post.\nDerby County boss John Eustace told BBC Radio Derby:\n\"This is the reason I came to the football club today - the fans were unbelievable, they were our 12th man. You can see what it's like when this place gets going and I was proud to be standing there as the head coach.\n\"It was about the team today. We had a difficult week - where three players (Lars-Jorgen Salvesen, Ryan Nyambe and Ben Osborn) who would have started but were injured through the week - and the group turned up yesterday and we had a new game plan.\n\"It's obviously an emotional day for everyone and it was a great effort by the fans, the players - this is the Derby County family and whatever happens from now until the end of the season we're going to build something special.\n\"I'm just glad we won a football game, it doesn't matter who it was against because it was really important that we show everyone that we are fully committed and want to do well for this football club.\"\nBlackburn Rovers head coach Valerien Ismael told BBC Radio Lancashire:\n\"I think the players are really disappointed about the result, they wanted it and maybe too much.\n\"We lost the game in the first seven minutes. We knew exactly what we would face, everything was set and I think that the first seven minutes was very difficult to manage.\n\"We had an injury (to Augustus Kargbo) and after that we changed the shape. It was much better, we had more control and had great chances, with Yuki to come back into the game earlier, and the goal from Pape [Gueye] after that gave us that momentum for the second half\n\"But the second half we were under control, it is clear, but Derby for sure played the game to waste time, to slow down the process, which is normal.\n\"But we were not very dangerous and I expected more crosses, more penetration, more shots on target and that is something we need to work on and learn from to do better next time.\"", "url": "https://www.bbc.co.uk/sport/football/live/c5y9qyy0xvnt"}