{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:43:55", "date_modify": "2025-05-21 06:43:55", "date_publish": "2025-03-30 21:10:18", "description": "Wolves striker Matheus Cunha suggests he could leave the club, Arsenal eye Sporting forward Viktor Gyokeres and Man City target AC Milan midfielder Tijjani Reijnders.", "filename": "sport_football_articles_c33znryzmpxo_1747809835.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0f8e/live/99778240-0da0-11f0-ba12-8d27eb561761.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c33znryzmpxo_1747809835.html", "title": "Football gossip: Cunha, Gyokeres, Reijnders, Eriksen, Doak, Delap, Ekitike", "title_page": "Football gossip: Cunha, Gyokeres, Reijnders, Eriksen, Doak, Delap, Ekitike - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wolves striker Matheus Cunha suggests he could leave the club, Arsenal eye Sporting forward Viktor Gyokeres and Man City target AC Milan midfielder Tijjani Reijnders.\nBrazil striker Matheus Cunha, 25, says he rebuffed offers to leave Wolves in the winter window, but has told the club he needs \"to take the next step\" in his career as he wants \"to fight for titles, for big things\". (Guardian), external\nArsenal could be a possible destination for Cunha, who has a £62.5m release clause, as new Gunners sporting director Andrea Berta helped sign the forward for Atletico Madrid in 2021. (Mail), external\nBerta has also been a long-term admirer of Sporting striker Viktor Gyokeres and the 26-year-old Sweden forward is a prominent candidate as Arsenal look to bolster their attacking options. (Athletic - subscription required), external\nAC Milan's Netherlands midfielder Tijjani Reijnders is a target for Manchester City this summer, although the 26-year-old recently signed a new deal which does not include a release clause. (Football Insider), external\nAjax are interested in re-signing Manchester United's Denmark midfielder Christian Eriksen, 33 - who started his professional career in Amsterdam - when his contract expires this summer. (Manchester Evening News, external)\nEverton are plotting a shock £25m move to sign Liverpool's Scotland winger Ben Doak, 19, who is currently on loan at Middlesbrough. (Sun, external)\nManchester United could hold an advantage in the race to sign Eintracht Frankfurt striker Hugo Ekitike as the 22-year-old France forward is a boyhood fan of the Old Trafford club. (Mirror), external\nIpswich Town chairman Mark Ashton refused to reveal if striker Liam Delap has a release clause in his contract but said the club are \"well protected\" when it comes to the 22-year-old England U21 attacker's deal. (East Anglian Daily Times), external\nBayern Munich are not expected to give Germany forward Thomas Muller a new contract beyond the summer, but the 35-year-old could move to the United States with Major League Soccer clubs interested in signing him. (Sky Sports Germany - in German), external", "url": "https://www.bbc.com/sport/football/articles/c33znryzmpxo"}