{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:58:32", "date_modify": "2025-05-21 04:58:32", "date_publish": "2025-01-14 17:10:08", "description": "Nottingham Forest news: Martin O'Neill on Champions League hopes", "filename": "sport_football_articles_cy8pnll1e96o_1747803512.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f8ae/live/3945fd40-d266-11ef-9dbb-9559c8b74d9b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy8pnll1e96o_1747803512.html", "title": "Nottingham Forest news: Martin O'Neill on Champions League hopes", "title_page": "Nottingham Forest news: Martin O'Neill on Champions League hopes - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Nottingham Forest player and manager Martin O'Neill says qualifying for the Champions League will become a \"distinct possibility\" for his former side if they beat Liverpool in Tuesday's Premier League game at the City Ground.\nSpeaking to BBC Radio Ulster, O'Neill said the absence of Manchester United and Tottenham in the upper echelons of the table strengthens Forest's chances.\n\"When they are so far adrift at this moment, then you have to start believing if you're a Forest fan that European football, maybe top six, is certainly a possibility,\" said O'Neill, a two-time European Cup winner with Forest.\n\"If they happen to win at home tonight, Champions League football, daft as it may seem or daft as it may have seemed at the start of the season, is a distinct possibility.\n\"They are sitting there after 20 games with 40 points. They've got more points now than they had all of last season. It's been a terrific achievement.\"\nHaving left Forest in 1981, O'Neill returned in 2019 when he was appointed manager. However, he was sacked after just five months.\n\"I wasn't there long enough to put the shoes into the room,\" he recalled. \"I was there for 19 games. Strangely enough we won the last three games.\n\"I came in a January period [but] I didn't spend a penny on a player. I wish now Mr [Evangelos] Maranakis, having forked out in the region of £400m the last couple of years, might have minded about 30 bob to buy a centre-half. It didn't materialise.\n\"It was 19 games - I wish I hadn't bothered.\"", "url": "https://www.bbc.com/sport/football/articles/cy8pnll1e96o"}