{"authors": ["Tyrone Smith", "www.facebook.com"], "date_download": "2025-05-21 04:38:18", "date_modify": "2025-05-21 04:38:18", "date_publish": "2025-04-04 16:00:49", "description": "'The trend is upwards' - Thelin pleased with Aberdeen progress", "filename": "sport_articles_cp8j3zw7k53o_1747802298.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/66e1/live/9edff430-116d-11f0-a3a8-cd0c869b6aeb.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cp8j3zw7k53o_1747802298.html", "title": "'The trend is upwards'", "title_page": "'The trend is upwards' - Thelin pleased with Aberdeen progress - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Aberdeen manager Jimmy Thelin believes his team are on an upward trend as they continue their European pursuit.\nThe fourth-place Dons, who have lost just one of their past eight games in all competitions, secured their top six-status last weekend and travel to play Ross County on Saturday.\n\"Things can change quickly but if you see the trend, how you perform over some games, there are always ups and downs but the trend I think is upwards and that is good for us in a really important part of the season now and the target we have for the season,\" said Thelin.\n\"We have focused a lot in the last month more about what we have to do as a team, especially when you have a lot of players in and out of the squad, and keep working with the identity, the responsibilities, how we can be a good collective team but still making the players individually grow.\n\"So I think the most important thing for us is to keep going and do our things really well and always have the respect of the opponent, their strengths and weaknesses, but still doing our things much better.\n\"I think we have seen some signs of that in the last games that we are more consistent in our actions and there is a better rhythm and more timing in the team.\"\nAberdeen clicked into gear with a 4-1 home win over Motherwell last time out and Thelin wants his side to build on \"a really strong collective effort and a shared mind on the pitch\".\nHe added: \"It was so nice to see also how they coached each other on the pitch, the responsibility they take.\n\"So I hope we can keep building on this and that is important for us in the long and short term.\"\nDutch defender Mats Knoester, meanwhile, is enjoying life with the Dons after his arrival from Hungarian side Ferencvaros during the winter transfer window.\nKnoester, who has established himself in the heart of the Aberdeen defence, said: \"I feel good, I feel happy on and off the pitch, it has been a good time so far.\n\"I just did the thing I always do and try to give my best performance. So far it has been working well and if the results are good of course it is very helpful as well.\"", "url": "https://www.bbc.com/sport/articles/cp8j3zw7k53o"}