{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:57:48", "date_modify": "2025-05-20 12:57:48", "date_publish": "2023-08-02 22:45:00", "description": "The Saudi Pro League's \"remarkable\" spending spree on new players is set to continue, according to one of its leading executives.", "filename": "sport_football_66387196_1747745868.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/CD20/production/_130621525_cr.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66387196_1747745868.html", "title": "Saudi Pro League: Cristiano Ronaldo, Jordan Henderson, Karim Benzema just the start", "title_page": "Saudi Pro League: Cristiano Ronaldo, Jordan Henderson, Karim Benzema just the start - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The Saudi Pro League's \"remarkable\" spending spree on players is set to continue, according to one of its leading executives.\n\"I think the budgets are in place for a number of years - you know, I don't see this slowing down,\" said British director Peter Hutton, who sits on the league's board.\nThe SPL has lured some of football's biggest names since five-time Ballon d'Or winner Cristiano Ronaldo joined in January from Manchester United.\nThey include former Real Madrid striker Karim Benzema, Liverpool's former captain Jordan Henderson and established players from Chelsea, Manchester City and Bayern Munich.\nIn addition, last month Al-Hilal made a world-record £259m bid for Paris St-Germain forward Kylian Mbappe.\nHutton, who has been a senior executive at Eurosport, ESPN, IMG & Facebook, said: \"I've worked in sport for 40 years and I've never seen a project as big, as ambitious and as determined to be a success.\"\nSpeaking to BBC sports editor Dan Roan in a wide-ranging interview for BBC Radio 5 Live's special 'The Saudi Story', he said it was \"not necessarily a bad thing\" if European football was not as strong as it has been.\nHutton also put the Saudi spending into context, saying \"it has got the world of sport talking but it's a quarter or a fifth of what Premier League clubs have spent this summer\".\nCity manager Pep Guardiola has said the Saudi Pro League's financial power has \"changed the market\" for transfers and elite clubs \"need to be aware of what is happening\", while Liverpool counterpart Jurgen Klopp has expressed concern about the transfer window closing late in Saudi.\nAccording to Transfermarkt, SPL clubs have spent 409m euros (£352m) so far this summer - the fifth-highest total in world football and more than Spain's La Liga's 254m euros (£218m). The Premier League leads the way with 1.37bn euros (£1.17bn) spent.\nAsked how big a threat the SPL is to the established powers in football, Hutton said: \"The investment from Saudi is remarkable. It's certainly been a big acceleration.\n\"This doesn't necessarily mean that Europe isn't going to be as strong in world football going forward. But I would say that's not necessarily a bad thing. It's good that football has strength around the world.\"\nSaudi Arabia has invested heavily in sport in recent years and has been accused of using events to 'sportswash' its reputation.\nThere are concerns over human rights and women's rights in the country, while same-sex sexual activity is illegal in Saudi Arabia, with the death penalty a possible punishment.\nHenderson's move to Al-Ettifaq drew criticism given his previous support of the LGBTQ+ community.\nResponding to these issues, Hutton said: \"The reason I got involved in the KSA [Kingdom of Saudi Arabia] was I saw some of the stuff that was happening on the ground.\n\"My wife works in women's football in Fifa, she was aware of what was happening in the kingdom. And you see that change, you see how much joy they're bringing to the local community.\n\"The changes in the role of women in Saudi community are remarkable and moving very fast. Clearly in Western eyes it could move a lot faster, but it has moved remarkably in the context of the history of the kingdom.\n\"I look at the evidence I see. You've now got 50,000 school girls playing football. You've got 1,000 women coaches. In 2018 there were 750 registered coaches. Now there are over 5,500.\n\"So you see that as evidence of change, and women's football development as part of societal change. That for me is the real attraction of this project.\n\"It's not just about headline players and big transfer fees and wages. It's also about the whole Saudi football infrastructure, whether that be women, youth football, creating a whole pyramid that really transforms the sport in the country.\"\nAsked when he expects the league to see a return on its considerable investment, Hutton says: \"I can see projections for income which are really strong in nine or 10 years' time.\n\"It's just important to see year-by-year increases and certainly the gates are up, TV revenues are up, sponsorship is up. I don't see why that should slow down.\n\"When Ronaldo signed for Al Nassr we suddenly had this interest from international broadcasters. Last year, we ended up in over 170 territories once Ronaldo signed.\n\"It's clearly something that's caught the imagination of broadcasters worldwide and that's been a really positive sign. I'd be confident we'll get a broadcast deal in the UK for this coming season.\"", "url": "https://www.bbc.com/sport/football/66387196"}