{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:42:15", "date_modify": "2025-05-21 05:42:15", "date_publish": "2025-04-04 00:00:00", "description": "The Republic of Ireland regroup from a sluggish first half to earn a crucial 4-0 win over Greece in the Uefa Women's Nations League game in Heraklion.", "filename": "sport_football_live_cvgq5m0dvrvt_1747806135.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cvgq5m0dvrvt_1747806135.html", "title": "Uefa Women's Nations League: Republic of Ireland recover from slow start to beat Greece 4-0", "title_page": "Uefa Women's Nations League: Republic of Ireland recover from slow start to beat Greece 4-0 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The Republic of Ireland regrouped from a sluggish first half to earn a crucial 4-0 win over Greece in the Uefa Women's Nations League in Heraklion.\nIreland manager Carla Ward's half-time changes proved crucial as substitute Marissa Sheva's deflected shot put the visitors ahead on 49 minutes in the League B Group 2 game.\nIrish captain Katie McCabe, who didn't start because of a niggle, set up the second in the 61st minute as her superb cross was volleyed goalwards by Leanne Kiernan and while Greece keeper Zoi Nasi produced a fine save, Kyra Carusa poked in the rebound.\nJessie Stapleton looped in a near-post header over Nasi for Ireland's third after a McCabe corner on 74 minutes while Amber Barrett celebrated her 50th international cap by adding the fourth in the final seconds.\nAfter the sobering 4-0 hammering by Slovenia in February, Ward had said three points were a must for the Irish but the visitors struggled badly for fluency in the first half with Greece looking the more purposeful side as they had the better of the chances.\nBut the half-time introductions of McCabe and Sunderland's Sheva sparked a more much energetic second half as Ireland took control with the Greeks scarcely threatening at all in the second 45 minutes.\nRepublic of Ireland boss Ward made four changes from the Slovenia defeat which included McCabe initially having to be content with a place on the bench as Blackburn Rovers' Tyler Toland was drafted into midfield.\nMegan Campbell replaced injured Everton player Heather Payne at full-back with Jessie Stapleton taking from Megan Connolly at centre-half and Leanne Kiernan coming into the attack Barrett dropped to the bench.\nBarrett's absence from the starting line-up meant that Carusa switched to the central striker role.\nHowever, the changes didn't work in the opening half as the 26th-ranked Irish looked disjointed against a lively home side who are only 61st in Fifa's ratings.\nWith Ireland having been caught on the break numerous times in Slovenia, the Greek intent was obvious as they attempted to move the ball quickly into the opposition's territory and also went direct on numerous occasions.\nVeatriki Sarri had already tested her Everton club-mate Courtney Brosnan before Ireland defender Anna Patten had to make a vital block as Eleni Saich went for goal from eight yards in the 20th minute.\nIreland's sloppy first half was summed up by Lucy Quinn losing possession on halfway to Sarri in the 33rd minutes with the Everton woman able to run unchallenged to the edge of the box before firing inches over.\nHowever, the visitors were transformed by the half-time changes although they needed a big element of luck to break the deadlock as Sheva's shot took a huge deflection off Eleni Markou which completely flatfooted keeper Zoi Nasi.\nMcCabe was then booked for a clumsy challenge on Matina Ntarzanou but the Arsenal star soon set up Ireland's second goal as Carusa couldn't miss after Nasi had only parried Kiernan's volley following the captain's outswinging cross.\nAs the Greeks suddenly looked deflated, Stapleton looped in the third goal from a header after McCabe's corner before Barrett rounded off Ireland's win in the final seconds.\nThe sides meet again in Dublin on Tuesday evening with the Irish still three points adrift of leaders Slovenia who maintained their 100% record in the group by earning a 3-0 home win over Turkey.", "url": "https://www.bbc.com/sport/football/live/cvgq5m0dvrvt"}