{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:13:44", "date_modify": "2025-05-21 05:13:44", "date_publish": "2025-04-05 00:00:00", "description": "Leeds United draw a third successive Championship game as Dan James rescues a point at lowly Luton Town.", "filename": "sport_football_live_cewg1d9zpwnt_1747804424.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/38ef/live/e2d1b3e0-1221-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cewg1d9zpwnt_1747804424.html", "title": "Luton Town 1-1 Leeds United: White draw third straight Championship game", "title_page": "Luton Town 1-1 Leeds United: White draw third straight Championship game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Daniel James' fine strike rescued a point for Leeds United at relegation-threatened Luton Town as the Whites missed a chance to claim top spot in the Championship.\nIsaiah Jones had volleyed the Hatters in front as they sought to build on a run of results that has lifted fans' hopes they can escape back-to-back relegations, but James produced a moment of quality to level.\nThe draw means Matt Bloomfield's side have now lost just one of their past six, although the loss of striker Elijah Adebayo to injury will be a worry to the Luton manager.\nLeeds knew a win in the early kick-off would mean leapfrogging Sheffield United into top spot, but Manor Solomon missed a great chance to win it late in the game.\nIt means Daniel Farke's side have now drawn three successive league matches and only won once in six games.\nThe result, and Burnley's win at Coventry, means that Leeds, having looked to be near certainties to win automatic promotion six weeks ago, are now reliant on Sheffield United or Burnley dropping points if they are to claim a top-two placing at the end of the season.\nFarke dropped goalkeeper Illan Meslier after a series of high-profile mistakes, drafting in Karl Darlow in his place.\nThe Wales international almost had an immediate impact when his accurate throw released Solomon down the wing. His cross found James but his header was too close to Luton goalkeeper Thomas Kaminski.\nLeeds went close again as Solomon's free-kick flashed through a crowd of players and struck the unsighted Junior Firpo, forcing Kaminski into a sharp save to prevent the ball sneaking inside his post.\nMoments later Luton were ahead, courtesy of Adebayo's persistence and Jordan Clark's accuracy. The big striker battled to win possession inside his own half and after holding off challenges as he strode forward, he slipped the ball to Clark.\nHis cross found Jones unmarked at the far post for a simple volleyed finish.\nThe Luton fans chanted \"Leeds are falling apart again\" but their joy was short-lived.\nJames pursued the ball after a corner had been cleared out to the right flank, and as he cut inside, Adebayo showed him the inside, on to his supposedly weaker left foot. That proved to be a mistake as James expertly picked out the far corner.\nLuton were hit by the departure of Adebayo early the second half, replaced by Tahith Chong, but shortly afterwards the impressive Thelo Aasgaard came close to winning the game for the home side, cutting on to his right foot and then shooting for the far corner, only for Darlow to pull off an impressive save.\nLeeds upped the tempo in the last 10 minutes, but when James produced a dangerous cross from the right, the ball bobbled on a sun-baked surface just as it reached Solomon, and the Tottenham Hotspur loanee fired wide from close range.\nLuton were also grateful for a fine tackle by Christ Makosso to deny Isaac Schmidt as the Yorkshire side threatened deep in stoppage time.\nLuton manager Matt Bloomfield told BBC Three Counties Radio:\n\"It's a performance to be proud of, and a point to be proud of, against extremely good opposition who we all expect to be in the Premier League next season.\n\"The resilience we showed out of position, the structure and discipline. We also created some good chances and the variety of our play was good, so there's a lot to be pleased about.\n\"Eli (Adebayo) was fantastic today, his work out of possession and the way he gives us a platform to build. Clicker (Jordan Clark) has a little bit of quality at the top end of the pitch and it was a nice finish from Izzy (Isaiah Jones) so it was a very good goal.\n\"He (Adebayo) twisted his knee and he has some ice on it so we're not sure where it's at, so it was right at that time to get on some fresh legs.\"\nLeeds manager Daniel Farke told BBC Radio Leeds:\n\"It's always difficult of course (to concede first) especially here at Luton. It's always easier for the away team to open the contest and use our strengths in counter-attacks.\n\"It always helps, instead of the other team being able to concentrate on being rock-solid, compact and good in defending, and you have to defend some counter-attacks, so it's a problem.\n\"I would like to be in the lead at some point in an away game, it would make our lives a bit easier. You can have wishes and dreams but they can't all happen in some periods of the season, so we just have to have reality and dig and grind out, and this was a hard-fought point.\"", "url": "https://www.bbc.com/sport/football/live/cewg1d9zpwnt"}