{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 08:15:41", "date_modify": "2025-04-26 08:15:41", "date_publish": "2025-02-26 10:36:22", "description": "Former Nottingham Forest boss Billy Davies says Reds fans should get their \"passports ready\" for European football next season.", "filename": "sport_football_articles_c4g7p56yd9ro_1745655341.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/de85/live/26df6ae0-f428-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c4g7p56yd9ro_1745655341.html", "title": "'Get your passports ready'", "title_page": "'Get your passports ready' - Billy Davies on Nottingham Forest's European hopes - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Former Nottingham Forest boss Billy Davies says Reds fans should get their \"passports ready\" for European football next season.\nDavies had two spells at Forest boss more than a decade ago, having previously guided their fierce East Midlands rivals Derby County to promotion to the Premier League.\nThe 60-year-old got Forest to the Championship play-offs twice in his first stint at the City Ground, with his second spell ending after a 5-0 defeat by Derby which left the Reds sitting just outside the top six in March 2014.\nNow more than a decade on, Forest are in their third successive season back in the Premier League, and have been transformed from relegation battlers to European hopefuls under boss Nuno Espirito Santo.\nDespite three defeats in their past four league games, the Reds remain third in the table and in the hunt for a return to European football for the first time in almost three decades.\n\"Forest fans, enjoy it and get your European passports ready,\" Davies told BBC East Midlands Today.\n\"Nuno has come in and done a great job. We have now seen the benefit of the £400m spent and wonderful support from the owner.\"\nDavies was back in Nottingham earlier this month for an 'evening with' show that included former members of his backroom staff, as well players who featured under him at Forest – including Wes Morgan and Lee Camp.\nBBC East Midlands Today also spoke to a number of fans about their memories of the Scot and his time with Forest.", "url": "https://www.bbc.co.uk/sport/football/articles/c4g7p56yd9ro"}