{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:32:38", "date_modify": "2025-04-26 03:32:38", "date_publish": "2025-03-08 00:00:00", "description": "Follow live text commentary, score updates and match stats from Nottingham Forest vs Manchester City in the Premier League", "filename": "sport_football_live_cz03d002zgxt_1745638358.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e9a1/live/bb681040-fc2a-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_cz03d002zgxt_1745638358.html", "title": "Nottingham Forest vs Man City: Premier League score, stats & updates", "title_page": "Nottingham Forest vs Man City: Premier League score, stats & updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Callum Hudson-Odoi scored late in the second half to earn Nottingham Forest a crucial Premier League victory over fellow Champions League hopefuls Manchester City at the City Ground.\nWith seven minutes of an otherwise uneventful contest remaining, Hudson-Odoi collected a magnificent Morgan Gibbs-White pass in his stride before beating City goalkeeper Ederson at his near post to send the home fans into ecstasy.\nIn a game billed as crucial in the race to earn a spot in Europe's premier club competition next season, City had the better opportunities before the interval but lacked the pace or ingenuity to breach the home side's dogged defence.\nA powerful Nico Gonzalez effort which struck the outside of Matz Sels' right-hand post was the high point of a drab first half, and there were few signs of improvement early in the second period despite Forest's greater urgency.\nAfter Nico Dominguez volleyed an Anthony Elanga cross straight at Ederson within seconds of the restart, Hudson-Odoi had a low effort tipped on to the post by the Brazilian midway through the second half.\nPep Guardiola introduced Kevin de Bruyne and Omar Marmoush with 20 minutes remaining but there was little in the way of goalmouth action in the latter stages until Hudson-Odoi's moment of inspiration.\nGuardiola and his players can have few complaints with the outcome as they slipped to a ninth league defeat of a tumultuous season - their joint-most in a single campaign under the Spaniard.\nThird-placed Forest move four points clear of City, who stay fourth but could be overtaken by Chelsea if the Blues beat struggling Leicester City on Sunday.\nFollow Saturday's live Premier League action\nIt was not a game that will live long in the memory, but this may well go down as one of the biggest results in what has been a sensational campaign for Forest.\nNuno Espirito Santo's side now have a seven-point advantage over sixth-placed Newcastle United in the table, with fifth spot likely to be enough to secure a place at Europe's top table for the first time since 1980-81.\nForest offered little as an attacking force before the break, but a defence that has conceded only 10 league goals at the City Ground this season rarely looked like being breached as the visitors struggled to turn their possession into meaningful opportunities.\nHaving kept Guardiola's side at bay in the first half, the home side grew in confidence in the second and Dominguez was first to test Ederson after the restart with a first-time shot from Elanga's lofted delivery.\nBut it was Hudson-Odoi who sparked the second half - which seemed destined to peter out into a forgettable stalemate - into life.\nThe 24-year-old was denied by a superb Ederson save after showing quick feet inside the area, but the City goalkeeper was unable to keep out his low drive 25 minutes later as Forest claimed their first top-flight victory since beating Brighton 7-0 on 1 February.\nCity are used to challenging for Premier League and Champions League honours at this stage of the season, but Guardiola's team are in serious danger of missing out on Europe's premier club competition for the first time since 2010.\nThe visitors dominated possession and created the only opportunities of a muted opening, but Erling Haaland was unable to test Sels after dispossessing Chris Wood on the edge of the Forest area and Gonzalez failed to hit the target with a fizzing strike.\nGuardiola was becoming increasingly frustrated with his team's lack of pace and penetration towards the end of the first half, gesticulating animatedly to his players to raise the tempo - but to little avail.\nThe closest the visitors came to scoring in the second half was through Mateo Kovacic, who sent a powerful strike agonisingly wide of the far post in the first minute of added time.\nEderson will be disappointed not to have kept out Hudson-Odoi's effort eight minutes earlier, getting a hand to the ball but failing to prevent the shot from creeping in at the near post.\nThis was the fifth time City have failed to score in a top-flight game this season - their worst tally under Guardiola since 2016-17.", "url": "https://www.bbc.co.uk/sport/football/live/cz03d002zgxt"}