{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:48:17", "date_modify": "2025-05-21 05:48:17", "date_publish": "2025-04-02 11:39:53", "description": "Southampton podcast: Aaron Ramsdale on Premier League points total", "filename": "sport_football_articles_c0kx8vmvnzgo_1747806497.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3f8f/live/e09fd860-0fb3-11f0-b775-419686450991.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c0kx8vmvnzgo_1747806497.html", "title": "Southampton podcast: Aaron Ramsdale on Premier League points total", "title_page": "Southampton podcast: Aaron Ramsdale on Premier League points total - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Aaron Ramsdale has said Southampton's aim is not to break the record for the lowest points tally in a Premier League season, and that they also want to end the season with a \"respectable points total\".\nDerby hold the record for the lowest total - 11 in the 2007-08 season - and Saints keeper Ramsdale told BBC Radio Solent: \"The manager and the team have mentioned it - we've had a few meetings.\n\"We got everyone in and made people aware that no-one will forget about it and that you've played a part of it.\n\"We all know the situation - it's definitely in our minds, but at the minute it's not weighing us down too much because we've got time on our hands.\n\"You don't just get away with it, it never leaves you. You still hear about the Derby team and never about the other teams with a few points more. We know what we have to do.\"\n\"The aim is to finish the season with a respectable points total - not just to get three points, but to get them as soon as possible and finish respectably with 19 or20 points.\"\nRamsdale joined the Saints in the summer from Arsenal and has started 21 Premier League games this season.\n\"It's not been easy,\" he added. \"The good thing about this team is the willingness to learn and improve.\n\"A lot of the lads are new to the Premier League and they want to stay here and feel what was felt in the Championship last year.\n\"We come in and see how hard everyone works. There's plenty of days when you're trying to pick people up or getting picked up yourself - but you're living it. We know more than anybody about how tough it's been.\n\"We're letting a lot of people down and it's a lonely place when you're out on the grass. The fans, with what they've been through, have been excellent.\"", "url": "https://www.bbc.com/sport/football/articles/c0kx8vmvnzgo"}