{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:36:23", "date_modify": "2025-05-21 04:36:23", "date_publish": "2025-01-18 00:00:00", "description": "Callum Robinson's two goals inspire Cardiff City to a convincing south Wales derby win over Swansea City that revitalised their bid for Championship survival.", "filename": "sport_football_live_cwy193jx1v8t_1747802183.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cwy193jx1v8t_1747802183.html", "title": "Cardiff City 3-0 Swansea City: Robinson leads Bluebirds to thumping win over Swans", "title_page": "Cardiff City 3-0 Swansea City: Robinson leads Bluebirds to thumping win over Swans - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Callum Robinson's two goals inspired Cardiff City to a convincing south Wales derby win over Swansea City that revitalised their bid for Championship survival.\nRobinson fired the home side in front 73 seconds into the second half with a superb turn and finish, before seizing on careless Swansea defending to score another less than four minutes later.\nA raucous home crowd was already in raptures by the time Dimitrios Goutas crashed in a header from a corner to put Cardiff on course for their biggest win in this fixture for 31 years.\nSwansea were a pale imitation of the team that had won five of the previous seven derbies, completely outplayed in the Welsh capital as the Bluebirds surged to only their fifth win in 14 attempts against their arch rivals.\nMore important than derby dominance, Cardiff's victory lifted them up to 20th in the Championship table, two points clear of the bottom three.\nSwansea, meanwhile, dropped down one place to 13th after a dismal performance.\nThe contrast in atmosphere between this game and any other at Cardiff City Stadium this season was difficult to overstate.\nGiven Cardiff's struggles towards the bottom of the Championship, the mood has understandably tended to be one of subdued apprehension. On this occasion, however, it was popping with noise.\nHundreds – perhaps as many as 1,000 – of the home fans had marched to the stadium in protest against the club's owners before the match, but once they were inside the ground their support was unwavering for a game which their rivals have dominated in recent years.\nCardiff's win here last season was their first in the fixture since 2021, halting a run of four successive victories for Swansea which had included the first and only two league doubles in the derby's 113-year history.\nThe Swans were aiming for a sixth win from eight derbies and, although they had plenty of possession, there was little between the teams during a tense goalless first half.\nCardiff, threatening as ever from set-pieces, had the better chances, with Calum Chambers volleying over and seeing another effort saved by Lawrence Vigouroux, who also held a weak effort from Robinson in a promising position.\nThe Bluebirds forward was more clinical 73 seconds into the second half, using his chest to control a cross by Ollie Tanner before hooking a low left-footed shot into the far corner.\nRobinson raised the roof as he scored Cardiff's second less than four minutes later, capitalising on Josh Tymon's misplaced pass meant for Harry Darling before guiding another assured finish into the bottom corner.\nWith that, Robinson became the first Cardiff player to score two goals in a south Wales derby since Michael Chopra in 2010.\nAn already memorable afternoon got even better for the home side when Goutas' thunderous header from Alex Robertson's corner went in off the crossbar.\nCardiff's supporters then shared a tender moment with Omer Riza, singing \"This one's for your dad\" after the Bluebirds manager had announced on Thursday night the death of his father.\nThe only sour note for Riza was his late red card for confronting Swansea midfielder Goncalo Franco on the pitch, a flashpoint which seemed to contribute to a post-match melee involving almost every player and coach on both sides.\nCardiff's supporters lapped it all up, rejoicing in a rare and utterly comprehensive victory over their oldest enemies.\nCardiff assistant coach Tom Ramasut:\n\"It was pretty cagey, we probably gave them too much time in the first 20 minutes. We had a few tweaks and it allowed us to put some pressure on them.\n\"We went into half-time and there was momentum growing in our favour. You could just sense in the dressing room there was a real momentum and real belief going into the second half.\n\"If you show that fight and togetherness, then we have plenty of quality to win the game. That's exactly what Callum Robinson did with some unbelievable touches to finish.\"\nSwansea head coach Luke Williams:\n\"I feel very disappointed that we started the game fine and then the performances just evaporate, fall off the edge of a cliff. That's really upsetting, really worrying. I believe it's the occasion.\n\"We have failed to perform at a consistent level but today, the stark change in our performance from probably half an hour in, we started to lose a grip of the game, we started to give away a lot of corners and free-kicks and then we suffered so badly.\n\"So many players suffered so badly and got worse as the game went on… I imagine it's a lot of to do with the atmosphere. I think the opposition could feel that and did a brilliant job to heap pressure on us when we felt weak.\"", "url": "https://www.bbc.com/sport/football/live/cwy193jx1v8t"}