{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:23:23", "date_modify": "2025-05-21 04:23:23", "date_publish": "2025-01-23 16:01:35", "description": "Relegation pressure weighing 'heavily' on St Johnstone - Valakari", "filename": "sport_articles_cd6426e3egwo_1747801403.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8f08/live/730b3500-d99a-11ef-941c-57ca5bda0a5e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cd6426e3egwo_1747801403.html", "title": "Relegation pressure weighing 'heavily' on St Johnstone", "title_page": "Relegation pressure weighing 'heavily' on St Johnstone - Valakari - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "St Johnstone manager Simo Valakari admits the pressure of a relegation battle is weighing heavily on his players.\nValakari's side are nine points adrift of second-bottom Hearts having only won four of their 23 matches this season.\nThe Perth side's 1-0 Scottish Cup fourth-round win over Motherwell last week was their first victory in 10 games and they host the Steelmen again this Saturday on league business.\n\"I've said it all the time, but we have put ourselves in that position,\" Valakari said.\n\"So it's our choice now, either we give up, this is too difficult, this is too heavy, too much pressure, or we take it as a challenge.\n\"We are here, and we need to get out of this. I want to see, we want to see, as a team, a club, the positives.\n\"I would not stay up for the challenge if I did not feel I have my players up for the challenge. I would not stay up for the challenge if I feel the club was not up for the challenge.\n\"So everyone is up for the challenge. And as I said, it's a very difficult situation. It weighs heavily on our shoulders, but that's part of football.\n\"I would like to use it the other way around. When you play to win the trophy, that weighs heavily on you. You need to handle that pressure as well. There's always pressure.\n\"Unfortunately for us, it's a negativity pressure, but we need to handle that as well.\"", "url": "https://www.bbc.com/sport/articles/cd6426e3egwo"}