{"authors": ["Ella Gibbs", "www.facebook.com"], "date_download": "2025-05-21 06:56:23", "date_modify": "2025-05-21 06:56:23", "date_publish": "2025-01-31 09:09:01", "description": "Head coach Richard Whiffin says a succesful 2025 U20 Six Nations campaign will see them \"pick up more wins\" than in 2024.", "filename": "sport_rugby-union_articles_c3rw7jqrrvgo_1747810583.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ddb/live/9b7233a0-dfa7-11ef-a319-fb4e7360c4ec.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c3rw7jqrrvgo_1747810583.html", "title": "U20 Six Nations 2025: Wales chase landmark win against one of the 'big three'", "title_page": "U20 Six Nations 2025: Wales chase landmark win against one of the 'big three' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Head coach Richard Whiffin says Wales' players are targeting a landmark win in the 2025 U20 Six Nations Championship.\nWhiffin's side won two games in last year's tournament - at home against Scotland and Italy - and he says a successful 2025 would see them \"pick up more wins\" than in the 2024 tournament.\nThey open their campaign away to France in Vannes on Saturday, 1 February (20:10 GMT) looking to improve on fifth place 12 months ago.\n\"We understand when we're in a battle, how to come out on the right side of those results and ultimately we want a scalp against one of the perceived bigger three teams,\" said Whiffin, who also understands where they can improve.\n\"We kept making similar mistakes around our discipline and giving easy outs to the opposition and those are things that we focused on in camp,\" he added.\nThe last time the U20s encountered the French side was in the July World Championships where Wales were beaten 29-11 to crush their hopes of reaching the semi-finals.\nHowever, Whiffin is confident for their opening Six Nations fixture in Brittany after a positive training camp.\n\"We've had a really good preparation week, in terms of getting the boys together in camp and building that cohesiveness and getting a good couple of games preparation under our belt against the Welsh Academies,\" Whiffin said.\n\"The story of last year was we got close, but we did not seal those wins. We spoke about it as a group being able to learn, how to win those closer games.\"\nThe French side has had their longest pre-match camp for an U20 Six Nations, underlining the threat they pose with some of their squad playing in France's elite Top 14 league each week.\n\"They're going to be dangerous whether they've got a week's prep or 100 days prep,\" Whiffin added.\n\"They've got a deep player base. We know whatever team they put out will be a challenge.\"\nLeicester Tigers' flanker Harry Beddall captains the Welsh side this year and after a training match against Warren Gatland's senior side last week, he says the U20s are also looking to improve on their passing skills.\n\"For us to be able to train against them and see the levels they're at is great, and as well expose us to a similar sort of way that France are going to play,\" said Beddall.\n\"The speed of the ball was probably a lot higher than we're used to but that's what we're going to experience against France.\"\nBeddall, who recently made his debut for Tigers in the Premier Cup, says captaining the Wales side is \"a massive honour\".\nHe also believes the World Championship loss against France in the summer will motivate the squad for their opening match of the new campaign.\n\"We talk about mindset, we've got to go there, going for a result and that's where we are at the moment,\" he said.\n\"We know we have to throw everything at them, and it's got to be a full 80-minute performance to get a result out in France.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/c3rw7jqrrvgo"}