{"authors": ["Tyrone Smith", "www.facebook.com"], "date_download": "2025-05-21 03:40:50", "date_modify": "2025-05-21 03:40:50", "date_publish": "2025-01-15 12:08:27", "description": "Dundee column: 'Grit added to style makes top six realistic'", "filename": "sport_articles_ce9n085mn4jo_1747798850.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/bdd1/live/37233be0-d338-11ef-9fd6-0be88a764111.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_ce9n085mn4jo_1747798850.html", "title": "'Grit added to style makes top six realistic'", "title_page": "Dundee column: 'Grit added to style makes top six realistic' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "I have always maintained that I have found Dundee one of the most entertaining teams to watch since Tony Docherty took charge in the summer of 2023.\nI associate them with an attractive style of play, as a front foot team that can set about things with a real swagger at times.\nOver the last few weeks it has been different, equally impressive traits - those of being gritty and gutsy - that have also come to the fore.\nWith a squad that has been stretched to the limits in recent times because of injury and illness, the Dark Blues players have gone to the well - and delivered big style.\nDocherty described Tuesday night's 3-3 draw with runaway league leaders Celtic as heroic - and it is hard to dispute that assessment, as they came within seconds of securing what would have been a famous victory.\nDespite the selection issues they have faced of late, Dundee have put together a very solid run of results.\nIt is now just one defeat in five games - a sequence which includes away wins at St Mirren and St Johnstone, as well as back to back draws against both halves of the Old Firm.\nAnd - despite what I have outlined above - they have continued to play some very decent football too.\nDundee are now seventh in the table, just two points off the top six.\nAnd you get a sense that if they can continue to perform the way they have been - as well as get all the players who are unavailable back - then there is no reason why they can't attack the second half of the season with a real sense of optimism about what the next few months can yield.", "url": "https://www.bbc.com/sport/articles/ce9n085mn4jo"}