{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:29:15", "date_modify": "2025-05-21 04:29:15", "date_publish": "2025-04-05 00:00:00", "description": "Follow live text and radio commentary of the 2025 Grand National from Aintree.", "filename": "sport_horse-racing_live_c4gregmmxkzt_1747801755.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2e3a/live/dbee67d0-1230-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_horse-racing_live_c4gregmmxkzt_1747801755.html", "title": "Grand National 2025: Nick Rockett wins at Aintree for Willie Mullins", "title_page": "Grand National 2025: Nick Rockett wins at Aintree for Willie Mullins - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Nick Rockett wins the 2025 Grand National\nTime for us to leave it there. Thank you for all your company on another Grand National day.\nTrainer Willie Mullins said: \"It was just like something out of a Disney film\" as son Patrick rode home winner Nick Rockett in the 2025 Grand National.\nYou can see how each of the 34 runners fared in the 177th running of the Grand National too.\nBroadway Boy continues to be assessed after walking into the horse ambulance following a fall in the Grand National.\nCelebre D’Allen also is being checked over after being pulled up during the race.\nSee you soon!\n'It has to be my greatest afternoon' - Willie Mullins\nMore from Willie Mullins talking to BBC Radio 5 Live: \"Patrick comes in every morning and runs the whole show. He matches all the horses and the riders every morning and I might come up and change one or two things but Patrick could take over. It just comes natural to him. He's very precise and concise about things. He knows what to do and when to do it. I am absolutely delighted for him.\"\nWith getting 1-2-3 - is it your greatest afternoon in the sport: \"It has to be. I actually wasn't thinking about the 1-2-3 - I was single-mindedly thinking about Patrick riding the winner and about Stewart and Sadie. I didn't realise that we'd finished third or fifth - I didn't look any further. Once we passed the winning post in front the rest didn't matter.\"\n'Like something out of a Disney film'\nMore from Grand National winning trainer Willie Mullins talking to BBC Radio 5 Live: \"You dream about winning big races here and there but the first race we saw growing up was the Grand National in black and white. We all lived every year for the horse you were going to back in the National - and the owners and trainers of the National runners were heroes in our game.\n\"I had multiple runners in the race and I said before the first I can't follow them all so I decided to follow the most important one and my son and then briefly glancing at the others. I was following him all the way round and making sure nobody fell in front of him, he didn't fall himself - not that I could do anything about it - but then I saw him putting in some jump at the Canal Turn. I said then 'this horse still has huge reserves left inside him'. I thought it was on and just negotiate your way through the race. Patrick just kept the whole thing together and was as cool as ice and it was just like something out of a Disney film - you just see and know what is going to happen. It was just surreal.\"\nPost\n17:00: Maghull Novices' Chase (Grade 1) 2m\nKalif Du Berlais' jockey Harry Cobden, speaking to Racing TV: \"Jumping was the name of the game there. He was good, long and quick. He's what you want, an out-and-out galloper.\n\"I can't believe how much he's improved this season and we're really looking forward to next season with him.\nOn Kandoo Kid: \"I was going as well on that circuit as I was the first. I was following I Am Maximus down the inside. As long as the horse is OK, we can go again.\"\n'I was speechless'\nGrand National winning trainer Willie Mullins talking to BBC Radio 5 Live: \"I am just about recovering. I am hoping to win the Grand National and hoping to get a horse your son can ride because he's such a tall, heavy guy so he can only ride about five horses in the race and one of them came free. I never for a moment dreamt that he'd win the race. I hoped that he won but I never put together what it would be like if he did win.\n\"From the third last fence onwards I thought it was on and coming towards the elbow I thought he was going to be beaten but Patrick told me afterwards that he didn't want to hit the front too soon because the soon gets very lazy in front. I was just speechless. I don't know if I gave him a cheer, I was just speechless. I just broke down completely. I did for about 20 minutes after. I just couldn't help it, I just completely lost it.\n\"To have one horse run in the National, but then to have one your son can ride is millions, millions, millions to one what happened today. It is just something else to be able to leg up your son in the greatest race of all time. You dream of winning it yourself but to dream of putting your son up - when he was born I said he couldn't be the jockey the size of him, but he's turned out to be a fantastic jockey.\"", "url": "https://www.bbc.com/sport/horse-racing/live/c4gregmmxkzt"}