{"authors": ["Ian Woodcock", "www.facebook.com"], "date_download": "2025-05-21 03:48:18", "date_modify": "2025-05-21 03:48:18", "date_publish": "2025-04-07 12:26:36", "description": "Sheffield United boss Chris Wilder calls the travelling fans who abused the players after Saturday's surprise 1-0 defeat at Oxford \"a joke\".", "filename": "sport_football_articles_cj45nd75202o_1747799298.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/18eb/live/eb4725a0-13a7-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cj45nd75202o_1747799298.html", "title": "Chris Wilder: Sheffield United boss calls fan abuse 'a disgrace'", "title_page": "Chris Wilder: Sheffield United boss calls fan abuse 'a disgrace' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Sheffield United manager Chris Wilder has described the abuse his players received from travelling fans after Saturday's surprise 1-0 defeat at Oxford United as \"a joke\".\nThe promotion-chasing Blades would have set a club record of seven successive away victories had they won and would have gone back to the top of the Championship if they had avoided defeat.\n\"I think it's an absolute disgrace to the players that represent the football club and what they have done this season,\" Wilder told BBC Radio Sheffield.\n\"I'm meeting it head on - it is a joke, it's a disgrace.\"\nThe Blades boss admitted his side were below-par at Oxford but believes the players who were within one victory of breaking a long-standing club record deserve better.\nHe added: \"If that's what you think of the players then when we do have the good days then don't be clapping, go home, be consistent.\n\"I appreciate all the support that we have had away from home and at home too, it's been outstanding.\n\"We'll need it on Tuesday night because we've got to lift the players because they're disappointed about what happened on Saturday.\n\"We had an opportunity of breaking a club record that has lasted about 350 years.\n\"We just weren't good enough and you know what? That's sometimes how football is. You can't put your finger on it. You can assess it and analyse it at half time and afterwards and you can be deeply disappointed as we all were.\"\nSaturday's result was just Oxford's second win in their past 12 games and leaves Wilder's men in second, one point behind leaders Burnley and one ahead of third-placed Leeds before Tuesday's visit of Millwall.\nAcross the whole of the Football League nobody has won more games away from home this season than the Blades, who, like Burnley, have 12 victories on the road.\nUnited suffered a dismal relegation from the Premier League in 2023-24, where they won just three games all season, and Wilder said his players did not deserve such a reaction after a rare defeat.\n\"The players are giving everything to get us to 85 points with six games to go,\" he added.\n\"If it was happening every other week or it was the group I inherited last season that were miles off it and just turned it in then I get that - but not this group. Don't do it to them and to me.\n\"The week before we were outstanding and we were just off it [on Saturday]. You can't put your finger on it.\"\nWilder believes playing Oxford away is a difficult game and that the Us should have beaten Middlesbrough in their previous game.\n\"We didn't deal with a long throw and, give credit to the opposition and the opposition's manager, they made it really difficult,\" he added.\n\"We had 75% possession and opportunities and we didn't find that quality, tempo or rhythm. It was made difficult by a slow pitch and the conditions but no excuses, we just didn't find that bit of quality, if we had then we'd have scored.\"\nBoyhood Blades supporter Wilder is looking to lead the club to a third promotion across two spells.\nHe suggested that Saturday's abuse was indicative of how people are in the present day.\n\"We have to own it and take it on the chin but it's just the world we live in now I suppose. Everyone wants us to win every game,\" the 57-year-old said.\n\"I think we'd all be incredibly rich if we knew the outcome of everything in life, not just on a football pitch. We could gamble on stocks and shares and bet... football isn't like that, there are no guarantees.\"\nHe believes Saturday's result and post-match incident will bring the group tighter together and that there will be \"a reaction\" against the Lions on Tuesday.\nWith six games of the regular season to go Wilder has called on the fans to get behind the team as they seek an immediate return to the Premier League.\n\"At its best Bramall Lane, as I have witnessed as a supporter, ballboy, player and manager, gives us a huge advantage and push. I've seen that in big games that we have won over the years,\" he said.\n\"I can't demand and force but I know what I would be doing if I was a supporter, I'd be getting right behind this team that would have been top now if we hadn't had two points deducted.\"", "url": "https://www.bbc.com/sport/football/articles/cj45nd75202o"}