{"authors": ["Ali Speechly", "www.facebook.com"], "date_download": "2025-05-21 07:22:03", "date_modify": "2025-05-21 07:22:03", "date_publish": "2025-05-20 07:51:41", "description": "Tottenham news: Opinion - 'Uncle Ange' dares fans to believe", "filename": "sport_football_articles_c98p535049ro_1747812123.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a33b/live/307e0f30-b62f-11ee-bc2f-cb5579b90709.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c98p535049ro_1747812123.html", "title": "'Uncle Ange' dares fans to believe", "title_page": "Tottenham news: Opinion - 'Uncle Ange' dares fans to believe - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Remember Mauricio Pochettino and his lemons?\nWhatever your personal feelings are about universal energy or manifesting positivity, Poch somehow got us to a Champions League final, so the lemons clearly worked for him.\nAs Ange Postecoglou prepares to go one step further and actually win a European trophy with Spurs, he will be encouraging his players to focus on the positives – and I think us fans need to do the same.\nWhether you love his approach or can't wait to see him leave, Ange is the man in charge for our date with destiny in Bilbao – and it might be time to admit that I have underestimated the strength of his relationship with the players.\nSeveral of the squad have opened up about the impact Ange has had on the dressing room, most recently Yves Bissouma, who has described his manager as like a dad or uncle to the players.\nUnity is integral to successful teams. Despite an abysmal domestic league campaign, the players maintain that it is their manager who has protected them, believed in them, and kept them together on and off the pitch.\nBoth sets of fans will feel anxious going into this final, but us Spurs fans need to stick together - just like our team.\nManchester United will feel they have history on their side. Well, apparently this is the year of the underdog, of trophyless teams having their names carved on to silverware, of victory against all odds, of dreams coming true.\nSo, if this is to be one of the last times we see Uncle Ange in charge at Spurs, we should let him inspire us to do more than just dream.\nWe must dare to believe we will win.", "url": "https://www.bbc.com/sport/football/articles/c98p535049ro"}