{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:42:37", "date_modify": "2025-05-21 04:42:37", "date_publish": "2025-01-23 14:33:01", "description": "Nuno Espirito Santo press conference: Bournemouth vs Nottingham Forest preview", "filename": "sport_football_articles_cx2pj2g0e1lo_1747802557.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e1af/live/755718e0-4923-11ef-96a8-e710c6bfc866.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cx2pj2g0e1lo_1747802557.html", "title": "Nuno Espirito Santo press conference: Bournemouth vs Nottingham Forest preview", "title_page": "Nuno Espirito Santo press conference: Bournemouth vs Nottingham Forest preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Nuno said winger Callum Hudson-Odoi was in \"a lot of pain\" when he was taken off with a tight groin in the first half of Sunday's win over Southampton and Forest \"have to asses if he will be available or not\".\nOn his team's eight-game unbeaten run: \"We are happy and satisfied with the performance of the players because they are committed, they work very hard, and we are competing very well. That's the big challenge ahead of us - to sustain this level of performance.\"\nHis team are exceeding his hopes from the start of the season, with Nuno stating: \"Nobody expected it. Nobody can predict the situation. It is due to the bond. They help each other not only in training but during the matches. Expectations are clearly there to see.\"\nNuno said Forest will prioritise keeping his current squad together over bringing players in: \"I think the club is working more than anything on the basic to keep our players here because this is the squad we have and these are the players that can solve all our problems. It's a very tricky market in terms of improvement so let's focus and keep our players here.\"\nHe did not comment on reported interest in Brentford's Yoanne Wissa or Wolves' Matheus Cunha but added: \"We only consider options to improve us as a squad because our players are performing very very well.\"\nOn defender Murillo signing a new deal until 2029: \"We are delighted that he will be long term at Forest. He is a player with immense talent who can improve immensely due to his age. As long as he keeps himself healthy and available he is going to be great.\"\nOn a potential new deal for top goalscorer Chris Wood: \"Things are going well I think but I cannot give much further detail on that.\"", "url": "https://www.bbc.com/sport/football/articles/cx2pj2g0e1lo"}