{"authors": ["Jack Herrall", "www.facebook.com"], "date_download": "2025-04-26 06:51:51", "date_modify": "2025-04-26 06:51:51", "date_publish": "2025-02-28 17:33:35", "description": "Mentality and fine margins key as Celtic edge closer to treble - Rodgers", "filename": "sport_articles_cj92elgwemgo_1745650311.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/37a5/live/59240890-f5ee-11ef-bd6e-cd71c2e1454a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cj92elgwemgo_1745650311.html", "title": "Mentality and fine margins key as Celtic edge closer to treble", "title_page": "Mentality and fine margins key as Celtic edge closer to treble - Rodgers - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Manager Brendan Rodgers says Celtic are always searching for fine margins and weren't fully content with their performance despite trouncing Aberdeen 5-1 in midweek.\n\"We've tried to set a standard of performance and I think the scoreline was fantastic,\" Rodgers said.\n\"When you come off against one of your big rivals up here and you can win 5-1 and still be not overly pleased with elements of the performance, then it shows you the standard that we demand.\n\"That's a good thing because you can always improve, even in a 5-1 win.\"\nCeltic face St Mirren on Saturday before a run of home fixtures against Hibernian, Rangers and Hearts that could see them edge closer to a domestic treble.\nRodgers added: \"The whole point was to get to this point of the season in the best place we possibly could.\n\"Now we arrive into a part of the season where we want to finish really strong.\"\nLooking ahead to the test they'll be posed by St Mirren, Rodgers praised \"outstanding coach and manager\" Stephen Robinson.\n\"His teams are very clear in how they play, they understand their roles, they make it really difficult for you,\" he said.\n\"But I felt the game earlier on in the season, we managed that aspect of it really well. You just have to do all the dirty bits of the game really well, all the stuff that doesn't get a lot of attention.\"", "url": "https://www.bbc.co.uk/sport/articles/cj92elgwemgo"}