{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:31:31", "date_modify": "2025-05-21 05:31:31", "date_publish": "2025-04-02 20:21:07", "description": "St Johnstone owner Adam Webb calls for expanded top flight", "filename": "sport_articles_c787dm172xxo_1747805491.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/87ad/live/c1ce5f50-0fff-11f0-a1fa-418fd4120440.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c787dm172xxo_1747805491.html", "title": "St Johnstone owner Adam Webb calls for expanded top flight", "title_page": "St Johnstone owner Adam Webb calls for expanded top flight - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "St Johnstone owner Adam Webb says an expanded Scottish Premiership is the best way forward.\nThe SPFL's working group will consider options for increasing or decreasing the number of clubs in the four leagues, but Webb believes returning to a 10-team top flight would be a \"huge mistake\" as he looked to move from 12 to 14 teams and growing to 16 in the future.\nWebb, whose side are five points adrift at the bottom of the table, told Sky Sports: \"I think the bar for good or bad when it comes to football, UK football and world football, is the English Premier League.\n\"They've got 20 clubs and while we're not the same size as England, obviously, and we're not going to have 20 clubs in our Premiership - what you want to do is edge closer to that.\n\"It is a more familiar system that is more geared towards success on the world stage and on the UK stage.\n\"From looking at the quality in the Championship this season, I can tell you we have two, three, four clubs for sure that would do just fine in the Premiership, and that's where we should be headed. We should be growing the Premiership.\n\"We should be going to a 14-team league very soon, and then five years later - as long as the quality in the Championship is sufficient - projecting to go to a 16-team league, and if you keep growing it on a gradual, very deliberate way, we can make sure that the quality is there.\n\"We absolutely need to have quality with every team in the Premiership, but that's the direction we should be going because it's better for Scotland, it's better for Scottish football.\"\nAny change would require the backing of 11 of the 12 Premiership clubs, eight out of 10 Championship teams and 15 of the 20 teams in Leagues One and Two.", "url": "https://www.bbc.com/sport/articles/c787dm172xxo"}