{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:48:56", "date_modify": "2025-05-21 06:48:56", "date_publish": "2025-01-31 08:23:21", "description": "Scottish gossip: Tierney, Igamane, Palma, Clark, Kimpioka, Orjasaeter, Armstrong", "filename": "sport_football_articles_c9qje4qx0x5o_1747810136.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/bf72/live/5d2db420-dfac-11ef-a819-277e390a7a08.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c9qje4qx0x5o_1747810136.html", "title": "Scottish gossip: Tierney, Igamane, Palma, Clark, Kimpioka, Orjasaeter, Armstrong", "title_page": "Scottish gossip: Tierney, Igamane, Palma, Clark, Kimpioka, Orjasaeter, Armstrong - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Arsenal have blocked Kieran Tierney from joining Celtic during January and the 27-year-old Scotland defender will stay at the Premier League club for the final six months of his contract to be part of their title push before returning to the Scottish champions in the summer. (Telegraph), external\nCeltic are looking at alternative left-back options as they believe Kieran Tierney will stay at Arsenal until the summer and will now enter the market for a player on loan until the end of the season. (Sky Sports), external\nSarpsborg have rejected Celtic's opening bid of £4.6m for winger Sondre Orjasaeter, but negotiations are continuing, with the Norwegian club valuing the 21-year-old at £7m. (Anthony Joseph on X), external\nOlympiakos are in talks about taking 25-year-old Celtic winger Luis Palma on loan but are hoping to persuade his parent club that an option to buy for £3.3m in the summer is not mandatory. (Sportime), external\nRangers, Derby County, Hull City and Swansea City are interested in taking Bobby Clark on loan, five months after the 19-year-old midfielder joined Red Bull Salzburg from Liverpool for £6m. (Daveockop), external\nAmid speculation linking him with a move away from Rangers after impressing early in his Ibrox career, 22-year-old striker Hamza Igamane says he is happy with the Scottish Premiership club and thanked his agents for choosing a league that suits him well. (Onze Mondial via Daily Record), external\nEverton signing Rangers striker Hamza Igamane is not happening in this transfer window. (David Anderson on X), external\nSheffield Wednesday have stepped up their efforts to sign Stuart Armstrong and are in talks with Vancouver Whitecaps about the 32-year-old Scotland midfielder. (Daily Record), external\nBenjamin Kimpioka's £200,00 transfer to Leuven has collapsed after talks between the St Johnstone striker and the Belgian club's manager, Chris Colemen, broke down after a deal between the two clubs was agreed earlier this week. (The Courier), external\nHeart of Midlothian would still like to add a creative, goalscoring forward after moves for Kilmarnock's Danny Armstrong and Tobol's Islam Chesnokov failed to progress, while left-sided defensive cover is also required. (Edinburgh Evening News), external\nDundee United have fielded enquiries from one Major League Soccer club, as well as clubs in Belgium, Romania and elsewhere in Scotland, for 24-year-old out-of-favour Kenya midfielder Richard Odada and have yet to receive any official approach for Kevin Holt, understood to be valued in the region of £100,000, after Derry City registered an informal interest. (The Courier), external\nAberdeen manager Jimmy Thelin admits more players could exit Pittodrie before the January transfer window closes as he bids to balance his squad and centre-back Angus MacDonald, who is out of contract at the end of the season, is attracting interest from England and overseas. (Press & Journal), external\nSwansea City are keeping close tabs on Dundee defender Luke Graham after receiving impressive feedback from the 20-year-old's first half of the season on loan to Falkirk. (Daily Record), external\nTony Docherty is \"relaxed\" about the way Dundee's squad has shaped up, but the manager is not ruling out any more business and is unaware of any outgoings despite reported interest in midfielder Lyall Cameron and Jordan McGhee. (The Courier), external\nRoss County manager Don Cowie insists he would be comfortable with his squad should he not add any further signings before the transfer deadline but does not rule out outgoings. (Press & Journal), external\nDunfermline Athletic are closing in on a deal for 20-year-old Scotland Under-21 centre-back Jeremiah Chilokoa-Mullen on loan from Leeds United and are also interested in taking 19-year-old Rangers winger Archie Stevens. (Daily Record), external\nFormer Cambridge United and Gillingham manager Mark Bonner is interested in replacing Stuart Kettlewell at Motherwell. (Daily Record), external\nFormer Rangers midfielder Kevin Thomson is set to return to the Ibrox club's academy in a coaching role. (Rangers Review), external\nRangers have earned a grand total of £8.9m from their Europa League campaign so far. (Daily Record), external", "url": "https://www.bbc.com/sport/football/articles/c9qje4qx0x5o"}