{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:38:37", "date_modify": "2025-05-21 07:38:37", "date_publish": "2025-03-28 12:00:44", "description": "Scarlets keep alive their United Rugby Championship play-off hopes and dent the Ospreys with victory in the first of a derby double-header.", "filename": "sport_rugby-union_articles_cpdedevvv59o_1747813117.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ff5b/live/16875c00-0cbc-11f0-bffd-fb98b4c4f9e8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cpdedevvv59o_1747813117.html", "title": "Scarlets 38-22 Ospreys: Dwayne Peel's side keep URC play-off hopes alive", "title_page": "Scarlets 38-22 Ospreys: Dwayne Peel's side keep URC play-off hopes alive - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Scarlets kept alive their United Rugby Championship play-off hopes and dented the Ospreys' chances with a bonus-point victory in the first of a derby double-header.\nIn front of 11,384 fans in Llanelli, Dwayne Peel's side recorded a first win against Ospreys since January 2022 with the six-try performance.\nOspreys opened up a 17-point lead in 15 minutes with tries from number eight Morgan Morris and full-back Iestyn Hopkins before the visitors were undone by ill discipline.\nHooker George McGuigan and scrum-half Kieran Hardy were shown yellow cards as Scarlets levelled the scores at half-time with a penalty try and further efforts from Blair Murray and Vaea Fifita.\nSecond-half scores from Wales trio Joe Roberts, Eddie James and Taine Plumtree sealed the win.\nOspreys fly-half Dan Edwards scored a fine try in a 12-point display but his side left Parc y Scarlets with nothing.\nScarlets and Ospreys are level on 33 points with both teams outside the top eight play-off places in 10th and 11th places respectively.\nThey will meet again in eight days with the European Challenge Cup last-16 tie in Swansea on Sunday, 6 April.\nStruggling Welsh rugby needs some positives with the precarious financial climate hitting this week as both sides recorded annual losses of more than £2m.\nA five-figure crowd should lift some spirits for an occasion that saw friends of 30 years go against each other in the shape of opposite head coaches Peel and Mark Jones, who were former Scarlets and Wales team-mates.\nJones' first game in charge was against Scarlets just before Christmas as Ospreys secured a dramatic last-gasp 23-22 victory with a Iestyn Hopkins try.\nThis defeat in Llanelli was just a second in nine games since he took over as head coach from Toby Booth.\nFull-back Hopkins was one of eight changes from the side that beat Connacht 43-40 with the back three of Jack Walsh, Keelan Giles and Daniel Kasende rested.\nWales captain Jac Morgan was back to lead the side with prop Gareth Thomas also starting, while Wales full-back Murray returned for Scarlets after recovering from a calf injury.\nWelsh singer Dafydd Iwan galvanised the crowd with his rousing rendition of 'Yma o Hyd'.\nThe Ospreys had been late arriving to the Llanelli ground because of an accident just outside the ground with the kick-off delayed by five minutes.\nIt was the Scarlets who were caught cold from the kick-off with a disastrous opening quarter which started with conceding a try after 49 seconds.\nWales wing Ellis Mee failed to take the restart before his horribly slicked kick set up an attacking line-out.\nOspreys originally lost the set-piece but a strong Morgan tackle on Scarlets lock Alex Craig saw the ball dislodged with Morris pouncing on possession to score.\nEdwards converted and slotted over a penalty before the visitors took advantage of another glaring error from the hosts.\nA break from Ospreys wing Luke Morgan allowed Hopkins to collect his own chip after Scarlets fly-half Ioan Lloyd inexplicably failed to gather possession.\nScarlets, with captain Josh Macleod disrupting the Ospreys' breakdown, finally woke up with a well-worked try for Murray following a long looping Lloyd pass.\nSouth African referee Griffin Brandon Colby then decided not to give a yellow card to Fifita for tackling Hopkins in the air.\nScarlets head coach Dwayne Peel: \"To say it was a ropey start from us would be an understatement.\n\"I don't think we looked like a rugby team for the first 15 minutes and it was error after error.\n\"I am proud of the resilience we showed and for the last 60 minutes we showed we were a good side and played in the right areas.\n\"When they had a few yellow cards we made them pay and that is what the game is about.\"\nOspreys head coach Mark Jones: \"We got off to an awesome start and were looking pretty good.\n\"I was pleased with the first 25 minutes especially coming away from home but discipline came into the game after that.\n\"The yellow cards changed the format of the game and Scarlets exploited the extra players really well and their execution was good.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/cpdedevvv59o"}