{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:55:50", "date_modify": "2025-04-26 07:55:50", "date_publish": "2025-02-25 12:33:07", "description": "Sheffield United boss Chris Wilder says 'nothing was decided' by defeat to Leeds United but wants a quick response from Blades.", "filename": "sport_football_articles_c86p330gy61o_1745654150.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e1eb/live/3ee1aaa0-f373-11ef-80a6-edca8054bafc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c86p330gy61o_1745654150.html", "title": "Sheffield United: Chris Wilder wants quick response to Leeds loss", "title_page": "Sheffield United: Chris Wilder wants quick response to Leeds loss - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Chris Wilder has backed his Sheffield United squad to bounce back from defeat by Leeds and keep their promotion push on track.\nThe second-placed Blades fell five points behind their Yorkshire rivals after conceding three goals in the final 18 minutes at Bramall Lane on Monday night, a scoreline which Wilder told BBC Radio Sheffield \"was a little harsh on us\".\nHe said: \"It was a disappointing end to a mainly positive evening for us - going toe-to-toe with the best team in the division.\n\"We started off superbly, on the front foot. We had big moments to go 2-0 up but didn't capitalise and they gradually grew into the game.\n\"They're a good side but I don't think we're a million miles off. There's a lot of encouragement from the performance. They have steamrollered everybody, they have swatted everybody away, they didn't swat us away.\"\nSheffield United lost to Leeds and Middlesbrough in the space of five days in October but responded with a 12-match unbeaten run until Christmas, winning 10 of those games, something Wilder wants his players to repeat, starting with a trip to QPR on Saturday (15:00 GMT).\n\"We've got to go again,\" he said. \"Sometimes you have got to say they had a bit more in the locker than us. We have to stay humble and work our way back into a performance and result on Saturday.\n\"Our reaction to disappointment has been outstanding all season. We've 12 games to go, we'll dust ourselves down and go again. There's a lot of points to be won.\n\"Leeds have put themselves in a fabulous position of course, but if we'd got a result we'd have said the same thing - there's still a lot of football to be played.\n\"The attitude is not chasing anybody down, the attitude is go and win the next game, which we have done on numerous occasions and it's what has put us in this position.\n\"There's still a lot to play for. We have to quickly get over it, the players have shown this season they can do that, and we need to do it again.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c86p330gy61o"}