{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:56:39", "date_modify": "2025-04-26 03:56:39", "date_publish": "2025-03-04 15:01:05", "description": "BBC Sport looks at a crucial stage of the SWPL season, captures what the pundits are saying and gives you the chance to have yours.", "filename": "sport_football_articles_c3w148v85x9o_1745639799.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/73c6/live/f44f7f50-f8e3-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c3w148v85x9o_1745639799.html", "title": "Is this the closest SWPL race ever?", "title_page": "Is this the closest SWPL race ever? Pundits have their say, have yours... - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The SWPL has reached its split after 22 rounds of fixtures and, with 10 games to go, a tight title race featuring clubs from Scotland's two largest cities beckons.\nThree points separate first from fourth and it may not just be points that decides who finishes as champions - goal difference may ultimately come into play.\nSecuring top spot of course secures the trophy but the runners-up will join the champions in next season's Women's Champions League second qualifying round.\nHere, BBC Sport looks at this crucial stage of the season and captures what the pundits are saying.\nGlasgow City, champions in 2023, lead the table on goal difference with Hibernian second.\nRangers, winners in 2022, are two points off the pace with reigning champions Celtic a point further behind.\nHearts are perhaps a bit too far back - five points behind Celtic and eight off the leaders - but could still have a big say on the destiny of the title, as could Motherwell.\nAll of these teams will play each other twice more before the season's end.\nAs far as goal difference is concerned, Rangers are out in front with 94, Glasgow City sitting on 80.\nThe next round of fixtures takes place on the weekend of Sunday, 16 March, with the top two going head to head in Glasgow. Celtic are away to Hearts and Rangers at Motherwell.\nCity visit Celtic on Friday, 28 March and, two days later, Rangers host Hearts while Hibernian are away to Motherwell.\nThe next meeting of Rangers and Celtic is on the midweek of 16 April, with the Edinburgh sides also meeting in that round and Motherwell visiting Glasgow City.\nHearts and Hibs host Glasgow City and Rangers, respectively, on 20 April and Celtic visit Motherwell.\nAnd, at the end of April, Celtic host Hearts, Well visit Hibs and Rangers welcome City as the reverse fixtures ensue.\nFour more rounds of games take place in May.\nSWPL fixtures\nGlasgow City assistant head coach Leanne Crichton\nIt's going to be really exciting.\nI'm just buzzing that we won against Motherwell on Sunday because it feels like there's so much pressure on every point and what feels like every goal you score.\nIt's going to be like that between now and the end of the season.\nHibs have been fantastic. There's no reason why they shouldn't be at the top. They've got that investment. They've got really good staff. They have a recipe and a plan there, that looks like they're going to be in the conversation right until the end.\nScotland captain Rachel Corsie\nHearts will be feeling a little bit hurt [after drawing 2-2 with Rangers having been two up]. Nonetheless, it is still a result that consolidates the fact they're in the mix.\nHearts will stay in contention because teams will drop points every weekend now with the split. It's incredibly exciting times.\nIf you have the belief that you're going to do it more than other teams, you're more likely to get it done. There's been title races that have been close and gone really close to the wire. It's just never had this many teams in the mix.", "url": "https://www.bbc.co.uk/sport/football/articles/c3w148v85x9o"}