{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:52:14", "date_modify": "2025-05-21 06:52:14", "date_publish": "2025-03-29 20:00:41", "description": "Leinster's understrength side produce a gutsy defensive effort to edge out the Sharks 10-7 in a hugely physical URC contest in Durban.", "filename": "sport_rugby-union_articles_c0jzpppv2j7o_1747810334.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3760/live/b03f5d50-0cd7-11f0-9025-f3e7e963b60e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c0jzpppv2j7o_1747810334.html", "title": "United Rugby Championship: Leaders Leinster battle to 10-7 win over Sharks in Durban", "title_page": "United Rugby Championship: Leaders Leinster battle to 10-7 win over Sharks in Durban - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Leinster's understrength side produced a gutsy defensive effort to edge out the Sharks 10-7 in a hugely physical United Rugby Championship contest in Durban.\nLeo Cullen's pacesetters lost for the first time this season when pipped in the final seconds by the Bulls in Pretoria last weekend but tries from Henry McErlean and Scott Penny proved enough for the Irish province to get back to winning ways as Bongi Mbonambi scored the Sharks' try.\nThe Sharks had a last-gasp penalty chance which if slotted would have secured a draw but skipper Siya Kolisi's gamble of telling Siya Masuku to kick for the corner didn't pay off as Leinster disrupted the subsequent line-out to earn a match-clinching turnover.\nProp Cian Healy was the only member of Ireland's Six Nations squad involved in Leinster's matchday squad with Jodie Barrett and RG Snyman also left out by Cullen.\nThe Sharks, meanwhile, included double World Cup-winning Springboks skipper Kolisi and former Leinster lock Jason Jenkins.\nLeinster's win moved them 12 points ahead at the top although Glasgow had the chance to reduce that to eight as they prepared to face the Bulls later on Saturday in the battle between the third and second-placed sides at Scotstoun.", "url": "https://www.bbc.com/sport/rugby-union/articles/c0jzpppv2j7o"}