{"authors": ["Andrew Benson", "www.facebook.com"], "date_download": "2025-04-26 07:33:10", "date_modify": "2025-04-26 07:33:10", "date_publish": "2025-02-27 16:21:05", "description": "Lewis Hamilton says he is \"really enjoying\" his new Ferrari as he sets the second-fastest time on day two of Formula 1 pre-season testing in Bahrain.", "filename": "sport_formula1_articles_c5yrr80x652o_1745652790.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cea1/live/1de105b0-f5a5-11ef-bcea-7b70a14a5556.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_formula1_articles_c5yrr80x652o_1745652790.html", "title": "F1 2025 pre-season testing: Lewis Hamilton 'really enjoying' with new Ferrari", "title_page": "F1 2025 pre-season testing: Lewis Hamilton 'really enjoying' with new Ferrari - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Lewis Hamilton said he was \"really enjoying\" his new Ferrari as he set the second-fastest time on day two of Formula 1 pre-season testing in Bahrain.\nThe seven-time champion, who has moved to the Italian team this year after 12 seasons with Mercedes, was pipped to fastest lap by 0.031 seconds by Williams' Carlos Sainz.\nCharles Leclerc, who took over the Ferrari from the seven-time champion for the post-lunch session, was third fastest, just 0.052secs behind Hamilton.\nHamilton said: \"I am really enjoying the car. We're slowly bonding. Yesterday was a so-so day, just OK. But we got through all our run-plan. I was not doing set-up changes or directing where I want the car to go.\n\"Today was a bit more getting to explore a bit my interaction with my engineer.\"\nBoth Sainz and Leclerc had spins during the say - Sainz's at Turn One and Leclerc's at the final corner - just as they were starting flying laps.\nMercedes drivers George Russell and Andrea Kimi Antonelli were fourth and fifth fastest.\nMcLaren's Oscar Piastri and Lando Norris were 13th and 14th fastest.\nPre-season testing is a notoriously unreliable indicator of actual competitive performance because factors such as fuel loads and engine modes are not revealed by the teams and have a major impact on performance.\nAnd despite Sainz's fastest time, Williams team principal James Vowles underlined that his team were not fast enough to compete at the front this year.\n\"The top four are the top four,\" Vowles said. \"McLaren, Ferrari, Red Bull and Mercedes have all done good work over the winter.\n\"The midfield is going to be very tight and if I'm getting it right, 0.1secs separates a lot of us.\"\nRed Bull's world champion Max Verstappen did not drive while team-mate Liam Lawson was in the car all day, ending up seventh fastest; Verstappen will drive on the final day on Friday.\nLeclerc said before running in the afternoon: \"It's only testing. Everyone is hiding their true performance but the feeling is pretty good. No bad surprises but too early to judge performances.\"\nNorris said in the news conference before driving in the second session: \"We have just tried to make the car quicker all round. Add more load. If we want to improve anything at the moment, it's the rear but the rest of it feels correct and feels in the same ball park.\n\"I don't think we are expecting to be a big step ahead of everyone. We are expecting to be close to Red Bull and Ferrari. If we are there from the off, that's the main thing.\"\nNeither McLaren driver did any short performance runs during Thursday's running.", "url": "https://www.bbc.co.uk/sport/formula1/articles/c5yrr80x652o"}