{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:47:29", "date_modify": "2025-05-21 04:47:29", "date_publish": "2025-01-14 22:40:24", "description": "EFL Trophy favourites Birmingham City reach the quarter-finals along with Bolton, Bradford, Cheltenham, Peterborough and Rotherham.", "filename": "sport_football_articles_c5ye5ej55gjo_1747802849.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3efd/live/80190860-d2c1-11ef-a51d-1132d6e1164b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c5ye5ej55gjo_1747802849.html", "title": "EFL Trophy round-up: Favourites Birmingham City lead charge to quarter-finals", "title_page": "EFL Trophy round-up: Favourites Birmingham City lead charge to quarter-finals  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "League One pacesetters and competition favourites Birmingham City booked their place in the quarter-finals of the EFL Trophy after edging past Swindon Town 2-1 at the County Ground.\nA second-half strike from Ayumu Yokoyama, his fourth for the club since signing from Japan's J League last summer, looked to have sent the Blues coasting towards the last eight.\nBut they had to survive a scare after Robins' striker Harry Smith first equalised then cancelled out his good work by putting through his own net with a minute of normal time remaining.\nChris Davies' in-form side find out their opponents in the last eight when the draw is made on Saturday, with the quarter-finals split into two northern and two southern ties.\nHolders Peterborough United shook off the disappointment of their FA Cup exit to Everton by reaffirming their fine record in this competition with a 4-2 win over Walsall.\nTwo goals from Swedish striker Gustav Lindgren, in only his second start for the club since signing on New Year's Day, and two from Malik Mothersille, the first from the penalty spot and the second from close range, proved enough to see off the League Two leaders.\nCheltenham Town struck early and late to secure a safe, if slightly nervy, passage into Saturday's draw in the southern section by beating Colchester United 2-1.\nTom Pett bagged his second goal for the club in the third minute before Lyle Taylor levelled matters for Colchester. With the match heading for penalties, George Miller stabbed home from a corner kick in the first minute of stoppage time to secure the win.\nTwo-time winners Bolton Wanderers ensured they will be in the northern side of the draw at the expense of Lincoln City, Aaron Collins's 13th goal of the campaign enough to separate the sides in a 1-0 victory.\nRotherham United also retained the chance of become the first side to have their name figure three times on the roll of honour after coming through at Chesterfield.\nThe Millers may have lost their 100% winning record in this season's competition – only Peterborough can still boast that – but they just about kept their nerve to win a penalty shootout 4-3 after being held to a goalless stalemate after 90 minutes.\nCameron Humphreys converted the winning spot-kick, slotting calmly home into the bottom-right corner after Chesterfield failed to put away two of their five penalties.", "url": "https://www.bbc.com/sport/football/articles/c5ye5ej55gjo"}