{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:14:28", "date_modify": "2025-05-20 12:14:28", "date_publish": "2023-08-04 15:12:31", "description": "England's World Cup countdown begins with their first warm-up match against Wales in Cardiff on Saturday - which players can force their way into the final squad?", "filename": "sport_rugby-union_66401014_1747743268.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/12D27/production/_130659077_-5c4ebb2d-68ef-499b-8fa7-4de2d9c6937c.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-union_66401014_1747743268.html", "title": "Wales v England: Which players need to impress most as England begin World Cup countdown?", "title_page": "Wales v England: Which players need to impress most as England begin World Cup countdown? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England's World Cup countdown begins in earnest on Saturday with their first warm-up match against Wales in Cardiff.\nDespite assistant coach Richard Wigglesworth stressing the fixture is not \"a selection shootout\", it is the last chance for players to impress before head coach Steve Borthwick picks his final 33-man squad on Monday morning.\nBorthwick indicated that the majority of his squad has been finalised with only \"one or two places\" still to be decided.\nSo which players need to cement their place in the final squad? And who needs a big performance to force their way into the starting XV for the opener against Argentina on 9 September in Marseille?\nMax Malins is the only player from the Premiership final in Saturday's starting XV as Borthwick chose to rest key personnel and give opportunities to some new faces.\nFlanker Tom Pearson will make his debut, while fellow uncapped forwards Theo Dan and Tom Willis are on the bench, and Leicester Tigers' George Martin wins his second cap two years after making his debut as a 19-year-old.\nAt the time, Eddie Jones described Martin as an \"old-fashioned six\" but added with time he may \"be able to play lock as well.\" Now, aged 22 and a Premiership winner, he gets his chance in the second row where his size and physicality should bolster England's forward power.\n\"In terms of how he plays the game and the way he hits tackles, not many players are at that standard,\" former England international Chris Ashton told the Rugby Union Weekly podcast.\nBath winger Joe Cokanasiga, who made a try-scoring debut against Japan in 2018 as a 21-year-old, is another player capped young by Jones who has struggled to maintain his spot in national squads.\nCokanasiga, who has 12 tries in 14 caps, made the 2019 World Cup squad and brings extra size and strength to the backs.\nAshton hopes England's coaching staff will use Cokanasiga, now 25, in the same way they deployed Fijian powerhouse Nemani Nadolo when they were working at Leicester.\n\"I am thinking England are going to use big Joe as a carry option,\" said Ashton, who played under Borthwick and assistant coaches Kevin Sinfield and Wigglesworth at Leicester.\n\"Get the ball in his hands - we've seen him too many times in an England shirt not get the ball and be used in the right way.\"\nBorthwick won the Premiership as head coach of Leicester Tigers in 2022 playing percentage rugby - which in simple terms means kicking the ball more than running it.\nOne player who struggled to fit into Borthwick's style of play during the Six Nations was Harlequins fly-half Marcus Smith who excels for his club playing an expansive style of running rugby.\nWith his inclusion against Wales alongside club team-mate Danny Care, is Borthwick trying to marry the two styles?\n\"If he [Smith] wants to be that starting 10 and a world-class international fly-half he needs to do both,\" Ugo Monye told the Rugby Union Weekly podcast.\n\"I think we will get a team who are set up to play first but understand if they are not going anywhere after the first two or three phases, then they have a brilliant kick-chase game to go to.\"\nWith Borthwick set to bring all three fly-halves currently in the squad to France, and Owen Farrell set to start as captain of the side, Smith may be a creative option off the bench ahead of George Ford.", "url": "https://www.bbc.com/sport/rugby-union/66401014"}