{"authors": ["Tino", "www.facebook.com"], "date_download": "2025-05-21 05:31:00", "date_modify": "2025-05-21 05:31:00", "date_publish": "2025-01-14 13:24:36", "description": "Celtic fan column: 'Will Kyogo stay for massive Champions League matches?'", "filename": "sport_articles_c1lvg24r4qpo_1747805460.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/81e5/live/627d2860-d279-11ef-87df-d575b9a434a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c1lvg24r4qpo_1747805460.html", "title": "Celtic fan column: 'Will Kyogo stay for massive Champions League matches?'", "title_page": "Celtic fan column: 'Will Kyogo stay for massive Champions League matches?' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "If Kyogo Furuhashi doesn't want to be at Celtic beyond this January transfer window then he's got a funny way of showing it.\nTwo goals in Dingwall on Sunday, followed by the obligatory dance in front of the travelling away support after the game rounded off yet another impressive day at the office for our talismanic striker.\nThe Japan striker turns 30 in under a weeks' time, and whether he sees his future elsewhere or not, there can be no doubting his commitment to the club at this moment in time while he remains Brendan Rodgers' number one striker.\nIt's a difficult month for managers with the inevitable speculation of who stays and who goes, but with massive Champions League games against Young Boys and Aston Villa on the horizon, there can be no doubt that Rodgers' will once again look to Kyogo to play a key role.\nThe recruitment team may well have earmarked potential alternatives, and in football you just never know, but as we near the halfway point of the window it would seem a high risk move to replace a player who's fast approaching 100 goals for the club.\nThe hope, personally, is that Kyogo continues to celebrate his birthday here in his adopted city of Glasgow for at least another year or so.\nElsewhere, fringe players Stephen Welsh and Odin Thiago Holm have already secured loan moves to Belgium and the USA respectively, and other exits – temporary or otherwise – are likely to follow in the coming weeks.\nHowever from a fans point of view, it's the potential of new arrivals that will always generate the most excitement.\nWill Rodgers' get the left winger that he seems to crave? Is a No.10 in his plans? And will we see another contender to Greg Taylor's throne arrive at the club?\nWe'll have those answers in a short couple of weeks, but in the meantime, the team continue to navigate the relentless fixture schedule that January has thrown up.\nTonight's clash with Dundee will be our fifth game of nine this month alone, and once again some smart squad management will be required to keep the players at optimal levels for the challenges that lie ahead.\nFollowing the blip at Ibrox (we've all agreed it's a blip, haven't we?) the side have responded in the best way possible with three league wins on the bounce – scoring nine goals, and conceding just one.\nIt'd be a bold move to bet against them making it four in a row at Dens Park, where a win would result in an incredible 18-point lead at the top of the table.\nOverall, it's a month that'll be judged just as importantly for what happens off the field as on it, and on that note lets hope for good news on all fronts over these next couple of weeks.", "url": "https://www.bbc.com/sport/articles/c1lvg24r4qpo"}