{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:36:21", "date_modify": "2025-04-26 07:36:21", "date_publish": "2025-02-27 14:35:44", "description": "BBC 72+: EFL Podcast's Jobi McAnuff says Blackburn's appointment of Valerien Ismael \"makes sense\" even if it might be considered unambitious.", "filename": "sport_football_articles_c5y2205lp01o_1745652981.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/42bd/live/77ba2160-f515-11ef-a276-596f7e6218f8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c5y2205lp01o_1745652981.html", "title": "Blackburn Rovers: Valerien Ismael 'ticks a lot of boxes' as new boss", "title_page": "Blackburn Rovers: Valerien Ismael 'ticks a lot of boxes' as new boss - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Valerien Ismael's appointment as Blackburn Rovers boss \"ticks a lot of boxes\" even if it might be considered unambitious, according to BBC EFL pundit Jobi McAnuff.\nThe 49-year-old Frenchman guided Barnsley to the Championship play-offs in 2021 before leaving for West Bromwich Albion, where he began by winning four of his first five games as the Baggies went unbeaten in their opening 10 league fixtures.\nHowever, he was sacked in January after 29 league games, winning one of his final seven matches in charge at The Hawthorns, and lasted little longer at Watford in the 2023-24 season, losing six of his final eight games to be sacked in March.\nMcAnuff told the BBC's 72+: EFL Podcast: \"I'm not underwhelmed - purely from a Blackburn ownership and recruitment model.\n\"It's a manager who's out of work, so they're clearly not going to have to pay anything.\n\"It's somebody who knows the division, how well he's done in his last couple of gigs is probably the concern for Rovers fans, but I would caveat that and say he had a pretty good start at West Brom and then things really tailed off.\n\"We're talking about a short impact, between now and the end of the season. His remit is to try and get that team in the play-offs.\"\nMcAnuff said similarities between Ismael's direct playing style and that of predecessor John Eustace might ease the transition.\n\"You know what he's all about, I look at the style of football, I think that's another tick.\n\"It's not somebody who is going to come in and change things dramatically from what John Eustace was doing – it's a group of players that will understand roughly what he wants to do.\n\"It ticks a lot of boxes. Is it the most ambitious signing? No, but it makes sense. It fits within the framework of where Blackburn are right now.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c5y2205lp01o"}