{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:09:59", "date_modify": "2025-04-26 04:09:59", "date_publish": "2025-03-02 18:51:47", "description": "Newcastle United will consider an appeal against the red card which will cost Anthony Gordon the chance to play in the Carabao Cup final.", "filename": "sport_football_articles_cy4ve8ll0yjo_1745640599.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a7b3/live/64237d90-f795-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cy4ve8ll0yjo_1745640599.html", "title": "Anthony Gordon: Newcastle United will consider red card appeal", "title_page": "Anthony Gordon: Newcastle United will consider red card appeal - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Newcastle will consider lodging an appeal against the red card which will cost Anthony Gordon the chance to play in the Carabao Cup final.\nThe Magpies forward was dismissed for shoving Brighton defender Jan Paul van Hecke's head in Sunday's 2-1 FA Cup fifth-round defeat.\nThat would mean a three-game ban for violent conduct, that will include the EFL Cup final against Liverpool on Sunday, 16 March.\nNewcastle also missed a key player, goalkeeper Nick Pope, through a red-card suspension for the 2023 final which they lost to Manchester United\n\"Of course. If we analyse the incident and feel there's grounds for that [an appeal], we will do without hesitation,\" said Magpies boss Eddie Howe.\n\"I'd need to see it, I can't sit here and give an honest opinion to that until I've done the work that you've done and looked at it.\n\"But knowing the player, I know there's no malice intended there.\"\nGordon has scored nine goals and provided six assists in 34 games this season, only behind 22-goal top scorer Alexander Isak.\nThe England international laughed at Van Hecke on the ground - before seeing the referee's red card.\n\"Petulance, that's all it was,\" said BBC Radio 5 Live summariser and ex-England goalkeeper Paul Robinson. \"Anthony Gordon felt hard done by that he didn't get a penalty [earlier on]. It is stupid from him.\n\"He knows he cannot get there and he has run into Van Hecke with two hands. It looked like frustration to me. He has pushed the Brighton defender with force.\"\nHowe added: \"He plays hard - I want him to play hard, I want him to be competitive, but I don't see an issue there at this moment.\n\"I think it would be very out of context with how he is generally, maybe a bit of frustration in the game that things weren't going our way, but I'd say that's not a common sight for me when Anthony plays.\"\nFormer England midfielder Danny Murphy said on BBC One: \"It was a moment of madness because the whistle had already gone [for offside] which he obviously heard.\n\"The whistle's gone and he just lashes out.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cy4ve8ll0yjo"}