{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:12:29", "date_modify": "2025-05-21 07:12:29", "date_publish": "2025-02-08 09:01:17", "description": "Southampton vs Burnley predictions: Chris Sutton on FA Cup tie", "filename": "sport_football_articles_cre8p2ppjl2o_1747811549.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/561d/live/fbee38e0-d1d4-11ef-87df-d575b9a434a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cre8p2ppjl2o_1747811549.html", "title": "Southampton vs Burnley predictions: Chris Sutton on FA Cup tie", "title_page": "Southampton vs Burnley predictions: Chris Sutton on FA Cup tie - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Burnley's defensive record is unbelievable, but they have got a problem at the other end of the pitch.\nThey do not score many goals and it appears there is an element of Burnley fans who are quite bored watching Scott Parker's team.\nTheir situation is the same as Leeds, in that they are one of four teams chasing one of the two automatic promotion spots in the Championship.\nAgain, they have got a midweek league game coming up, at Hull City on Wednesday, which will be their priority. I think Parker will make changes here and they will fall foul of that.\nSouthampton will not be complaining, because they have won so few games against anyone this season.\nSaints picked up a rare win at Ipswich last weekend, and at home they have managed only three victories in all competitions - Stoke City in the Carabao Cup, Everton in the league and Swansea City in the FA Cup third round.\nTo say they have momentum after beating Ipswich is probably pushing it, and they are still a long way adrift at the bottom of the table, but a decent FA Cup run would give their fans a bit of escapism in what has been a miserable season.\nSutton's prediction: 1-0", "url": "https://www.bbc.com/sport/football/articles/cre8p2ppjl2o"}