{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:37:41", "date_modify": "2025-05-20 14:37:41", "date_publish": "2023-07-28 13:52:00", "description": "Former South Africa Under-20 kicker Tinus de Beer has signed to fill the void at number 10 for Cardiff.", "filename": "sport_rugby-union_66338809_1747751861.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1427D/production/_130575528_gettyimages-1258778546.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-union_66338809_1747751861.html", "title": "Cardiff sign South African fly-half Tinus de Beer from Pumas", "title_page": "Cardiff sign South African fly-half Tinus de Beer from Pumas - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cardiff have completed the signing of South African fly-half Tinus de Beer.\nDe Beer has been a long-term target for the Arms Park team who have lost both Wales stand-offs Jarrod Evans and Rhys Priestland this summer.\nInitial efforts to sign the 27-year-old from Currie Cup side the Pumas were blocked by the Welsh Rugby Union, but the move has now come to fruition.\n\"I am extremely grateful to be here. It is a great club with great history and great culture,\" said De Beer.\n\"It is a club that strives on playing attractive rugby and a club that is ultimately looking to win games.\"\nHe added: \"I am here to play rugby, I'm not here for a vacation or to prove anyone wrong or right, I am here to work hard with the boys.\n\"In the URC I would love to make the play-offs so (long-term), keeping that in mind and working hard towards that goal.\"\nThe player's agency earlier confirmed, external De Beer has signed and arrived in Cardiff on Friday.\nDe Beer was once seen as a future Springbok when he was selected for South Africa Schools and then helped steer the Junior Boks to third place in the Under-20s World Cup in 2015.\nHe broke into the Bulls senior team and has been a regular in the Currie Cup ever since.\nFinding a new fly-half has been a priority for Cardiff this summer.", "url": "https://www.bbc.com/sport/rugby-union/66338809"}