{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:15:35", "date_modify": "2025-05-20 14:15:35", "date_publish": "2023-07-19 15:13:50", "description": "England's Stuart Broad becomes just the second pace bowler to take 600 wickets in Test cricket after removing Australia's Travis Head in the fourth Ashes Test.", "filename": "sport_cricket_66134032_1747750535.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/10614/production/_130429076_microsoftteams-image.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66134032_1747750535.html", "title": "The Ashes 2023: Stuart Broad becomes second pace bowler to take 600 Test wickets", "title_page": "The Ashes 2023: Stuart Broad becomes second pace bowler to take 600 Test wickets - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England's Stuart Broad has become just the second pace bowler to take 600 wickets in Test cricket.\nBroad, 36, reached the mark by removing Australia's Travis Head on day one of the fourth Ashes Test at Old Trafford.\nEngland team-mate James Anderson is the only other quick bowler to achieve the feat.\nBroad is fifth on the all-time list and Anderson third, with spinners Muttiah Muralitharan, Shane Warne and Anil Kumble completing the top five.\nNottinghamshire bowler Broad made his debut against Sri Lanka in Colombo 2007, going on to make 166 Test appearances to date and be part of four Ashes-winning sides.\nHe began the Old Trafford Test on 598 wickets but moved to 599 when he trapped Usman Khawaja lbw, before bringing up 600 when Head was caught by Joe Root on the boundary.\n\"Never in my dreams did I think this would be a thing,\" Broad told BBC Sport.\n\"Michael Vaughan was the skipper that gave me my first cap and my ultimate feeling there in Sri Lanka was never that this was the end game but instead that I wanted to win series and create memories.\n\"Some players feel like they have achieved what they wanted to after getting a Test cap and I've been fortunate enough to create memories. Never did I think I would be up there with the greats of the game.\"", "url": "https://www.bbc.com/sport/cricket/66134032"}