{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:54:48", "date_modify": "2025-05-21 07:54:48", "date_publish": "2025-01-22 09:22:59", "description": "Borussia Dortmund sack head coach Nuri Sahin following their Champions League defeat to Bologna.", "filename": "sport_football_articles_c07k18e39k1o_1747814088.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b68f/live/e212f3e0-d89e-11ef-993a-9dfb304c6a75.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c07k18e39k1o_1747814088.html", "title": "Champions League: Nuri Sahin sacked by Borussia Dortmund", "title_page": "Champions League: Nuri Sahin sacked by Borussia Dortmund - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Borussia Dortmund have sacked head coach Nuri Sahin after their Champions League defeat at Bologna.\nThe German side have lost four successive matches in all competitions since the winter break.\nThe 2-1 defeat against the Italian club on Tuesday was their third loss in this season's Champions League for last year's beaten finalists.\nIt means Dortmund must beat Shakhtar Donetsk in their final league phase game and hope other results go in their favour to automatically reach the last 16.\nA run of three domestic defeats to start 2025 has left them 10th in the Bundesliga, seven points outside the top four and in danger of failing to secure Champions League qualification next season.\nSahin, 36, who had two stints at the club as a player, said: \"Unfortunately, we have not managed to live up to Borussia Dortmund's sporting ambitions this season.\n\"I wish this special club all the best.\"\nSahin was appointed Dortmund boss in June 2024 as a replacement for Edin Terzic, who left following their Champions League final defeat to Real Madrid.\nas an assistant coach to Terzic at the start of 2024 alongside Sven Bender.\n\"We value Nuri Sahin and his work very much. We hoped for a long-term collaboration and until the end we had hoped we could achieve a sporting turnaround together,\" said Dortmund sporting director Lars Ricken.\n\"This decision hurts me personally, but it was unavoidable after the game in Bologna.\"", "url": "https://www.bbc.com/sport/football/articles/c07k18e39k1o"}