{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:55:25", "date_modify": "2025-05-21 03:55:25", "date_publish": "2025-01-15 10:54:18", "description": "Tottenham news: Ange Postecoglou on Dominic Solanke exceeding expectations", "filename": "sport_football_articles_ce8yxx8e5ego_1747799725.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a0c2/live/d364ce10-d32e-11ef-9bab-e1537b3d246b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ce8yxx8e5ego_1747799725.html", "title": "Tottenham news: Ange Postecoglou on Dominic Solanke exceeding expectations", "title_page": "Tottenham news: Ange Postecoglou on Dominic Solanke exceeding expectations - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tottenham boss Ange Postecoglou says Dominic Solanke has exceeded his expectations since arriving in the summer for £65m.\nSolanke, who signed from Bournemouth, has scored 11 goals in all competitions for Spurs and also provided six assists.\n\"I don't know who else was in for him,\" said Postecoglou. \"I'm just glad we got him.\n\"If you're trying to sign a striker with proven pedigree these days, it's pretty hard not to spend. Nothing is a sure thing, but I thought he was a real safe bet for us.\n\"We knew we were getting a proven Premier League striker who was going to fit into our style of play, which is the most important thing. But even in terms of what I was hoping for, he's exceeded that.\n\"Dom has been outstanding in the way he has carried the frontline for us during this period. We put a lot of demands on that position. It's not just him standing up there scoring goals - it's working hard for the team.\n\"I really think if Richy [Richarlison] was available, I think he [Solanke] would have been able to contribute even greater for us in terms of his output in goals.\n\"He's been great for us and I really feel there is more to him and his game. We'll be able to get more out of him if we can get him some help.\"\nRicharlison, who has been sidelined for two months with a hamstring injury, is expected to be named in the travelling matchday squad for Wednesday's north London derby.", "url": "https://www.bbc.com/sport/football/articles/ce8yxx8e5ego"}