{"authors": ["Brent Pilnick", "www.facebook.com"], "date_download": "2025-05-21 07:48:29", "date_modify": "2025-05-21 07:48:29", "date_publish": "2025-03-28 07:00:05", "description": "BBC Sport looks at the National League South title race as five teams vying for the top spot are separated by just three points.", "filename": "sport_football_articles_cx208g7l4y0o_1747813709.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1c26/live/73dceb60-0b07-11f0-93c7-431cc016c489.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cx208g7l4y0o_1747813709.html", "title": "Is this the closest title race in England?", "title_page": "National League South: Is this the closest title race in England? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "If Liverpool, Arsenal, Nottingham Forest, Chelsea and Manchester City were separated by just three points with six games to go, everyone would be saying how this could the greatest finish in Premier League history.\nBut drop from the glamour of the top flight to the sixth tier of English football... That is exactly what is going on now in National League South.\nIt is probably the closest league in England right now - maybe in Europe - as a mixture of teams you might have heard of - and some you might not - battle it out for one automatic promotion place and the best chance of home advantage in the play-offs.\nSo who will come out on top out of Worthing, Truro City, Eastbourne Borough, Dorking Wanderers and Torquay United in the race for a place in the National League?\n\"We always felt that if we could get through those first seven games with a half-sensible points return then it could potentially set us up for a positive end to the season,\" Worthing manager Chris Agutter tells BBC Radio Sussex.\nThe Rebels are top of the table - although they have seen a four-point lead with a game in hand all but wiped out thanks to successive losses against relegation-threatened Welling United and midtable Hornchurch in the past few days.\nBut the fact they are in first at all is something of a feat seeing as they started the season with six successive away games due to construction work at their Woodside Road ground.\nBut they took 11 points from a possible 18 on the road - their only loss was a 5-0 thrashing at their nearest rivals Truro City.\nWith four home matches in their final six fixtures, you would probably put Agutter's side down as favourites - although they still have to face three of the current top five.\n\"It felt like it wasn't as positive as what it could have been because we didn't win every game,\" he says, of his side's start to the season.\n\"But in terms of playing away from home and the travelling that we had to deal with, if you actually looked at it from a logical viewpoint you think, 'actually, that's a decent points return'.\n\"We had an unbelievable Christmas period where we played seven of the top eight and we took 30 points from 36, so that was the period really where we won a lot of six-pointers to put us into this position.\"\nSecond-placed Truro City are probably the National League South's surprise package this season.\nA year ago they were facing a run of 13 games in 28 days to end the season after flooding at their temporary home, but managed to secure a 16th-placed finish, nine points above the relegation zone.\nLast summer they lost manager Paul Wotton to nearest neighbours Torquay United and went and hired a man who has seen and done most things in the top end of non-league football - John Askey.\nHe has taken over a side that might have the lowest budget of the title chasers, but has the bounce of a brand new ground and relatively new owners.\nAnd the former Port Vale, Shrewsbury Town and Hartlepool United boss knows what it takes to go up at this level - he guided Macclesfield Town to the National League title in 2018 and led York City to promotion via the play-offs in National League North three years ago.\nBut, even in more than two decades as a manager, he has never known a title race quite like this one.\n\"You can probably go down to sixth position and everybody's got a good chance of getting the top place,\" he tells BBC Radio Cornwall.\n\"The only thing for ourselves is, compared with the other teams and apart from Worthing, it's in our hands.\n\"If we were to win all the six games, then we win the league. It's not as simple as that, but it is in our hands now.\n\"We know we've had a good season, no matter what happens, so there's probably less pressure on us than other teams, and I'm sure there'll be one or two twists and turns before the end of the season, even though there's only six games to go.\"\nOut of the sides gunning for promotion, Torquay United are the most recognisable.\nThe Gulls spent 87 years in the bottom two tiers of the English Football League before relegation in 2014.\nSince then they have had their fair share of lows - defeat in the 2021 National League promotion final on penalties was followed by relegation to the sixth tier for the second time in 2023.\nThen last year they went into administration after then-owner Clarke Osborne stopped funding the club.\nA consortium of local businessmen took over and rebuilt a squad that had just one player and no manager.\n\"This has been a year of drama for Torquay United and that's going to continue right down to the last kick of the ball on the last day of the season, it's extraordinary,\" co-chairman Michael Westcott tells BBC Sport.\n\"Our goal has always been financial sustainability, yet at the same time we're ambitious and we felt we'd assembled a squad that could certainly compete in this league, and what good looked like for us at the beginning of the season was to get into the play-offs.\"\nWestcott's chance meeting with ex-Gulls manager Neil Warnock ended with the former Sheffield United, Crystal Palace, Middlesbrough boss, to name just a few of his clubs, coming on board as an advisor.\nAnd with the club's rich league history and average crowds more than 1,500 higher than the next best side, Westcott feels Torquay have been the team to beat this season.\n\"I guess our legacy precedes us and people still see us as the big fish,\" he says.\n\"When teams come to Plainmoor they raise their game because they're playing in front of crowds that a lot of their players have never played in front of before and we're the scalp that anyone in our league wants to have.\n\"We've had to battle that but I think our league position reflects the budgets that we run.\n\"We might be perceived as a big club but we're by no means running the largest budget in the league, there are several teams that are running much larger budgets than we are, and that's because we want to run the club responsibly.\n\"We need the club to be financially sustainable so we don't ever go back to the place we found ourselves in February last year.\"\nSince the Covid-19 pandemic, National League South has seen some runaway winners.\nLast season Yeovil Town won the title by 11 points, while Ebbsfleet United were 20 points clear of second place in 2023 and Maidstone United finished first it by six points the year before.\nSo why is it so close this season?\n\"Genuinely I think it's a poor division,\" Dorking Wanderers manager and owner Marc White told BBC Radio Surrey.\nHis side are three points off the top of the table having been relegated from the National League last season.\n\"I think we're part of that poor division, I think we're not great. It's a very average league and average teams.\"\nBut is it really that bad? Not necessarily, according to Worthing fan Hayden Baker.\n\"It's weird to say it's a lower quality league this year because you don't have a team running away with it in the same way that's happened in our previous two seasons - Ebbsfleet battered this league, Yeovil battered this league,\" he tells BBC Sussex.\n\"The overall quality of the league is a lot more consistent across the entire divisions.\n\"I think the difference between a team in the top six and a team that's say 16th or 17th, really isn't a great deal any more.\n\"There's so much ambition across the league where I think every team feels like they've got some sort of right or some sort of ambition to get into the National League.\"\nEven if the quality of the football is not what it should be, the excitement of such a close title race makes up for it.\nWith so many sides in with a chance, who's to say who will be the title holder come the end of the season on 26 April.", "url": "https://www.bbc.com/sport/football/articles/cx208g7l4y0o"}