{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:27:52", "date_modify": "2025-04-26 04:27:52", "date_publish": "2025-03-03 10:43:12", "description": "Nottingham Forest vs Ipswich predictions: Chris Sutton on FA Cup game", "filename": "sport_football_articles_c8x441lyk9go_1745641672.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/561d/live/fbee38e0-d1d4-11ef-87df-d575b9a434a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c8x441lyk9go_1745641672.html", "title": "Nottingham Forest vs Ipswich predictions: Chris Sutton on FA Cup game", "title_page": "Nottingham Forest vs Ipswich predictions: Chris Sutton on FA Cup game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Ipswich boss Kieran McKenna made 11 changes when his side beat Coventry in round four and I suspect he will do something similar here.\nYou might have heard about 'Sutton's Super Computer', which were the calculations I did for the Monday Night Club this week, where I worked out the results of all the remaining Premier League fixtures.\nAccording to my secret formula, which is obviously extremely scientific, the Tractor Boys only have an outside chance of staying up. Along with Leicester, they were in my 'no-hopers' category.\nMaybe Ipswich can surprise me and go on an FA Cup run, but you have to fancy Nottingham Forest here.\nDefeat would just leave a grim fight against relegation for McKenna's side, so I feel for my daughter's teacher, Mr Fields, who regular readers will know follows the Tractor Boys, but not so much for my 5 Live colleague Ali Bruce-Ball, who is a phony Ipswich supporter - when I asked him, he could not remember the last time he went to watch them as a fan.\nOne thing I really can't stand are people like Bruce who attach themselves to a club which has a bit of success, claiming some tenuous link from the past.\nMy boyhood team, Forest, may make changes too because they are still in a good position for a Champions League spot, but I am backing Chris Wood to come off the bench and get us a winner.\nSutton's prediction: 2-1 after extra time\nListen to live commentary on BBC Radio 5 Live.", "url": "https://www.bbc.co.uk/sport/football/articles/c8x441lyk9go"}