{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:14:10", "date_modify": "2025-05-20 14:14:10", "date_publish": "2023-07-29 19:04:22", "description": "Demi Vollering is in a commanding position to win the Tour de France Femmes after a gruelling victory in the seventh stage.", "filename": "sport_cycling_66350733_1747750450.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3424/production/_130584331_gettyimages-1578765835.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cycling_66350733_1747750450.html", "title": "Tour de France Femmes: Demi Vollering wins stage seven to grab yellow jersey", "title_page": "Tour de France Femmes: Demi Vollering wins stage seven to grab yellow jersey - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Demi Vollering claimed victory on the seventh stage of the Tour de France Femmes to put herself in a strong position to win the yellow jersey.\nVollering powered through the mountain-top fog to win the 89.9km stage in two hours 52 minutes 43 seconds.\nThe Dutchwoman leads the overall standings by one minute 50 seconds from Poland's Katarzyna Niewiadoma with only the individual time trial left.\n\"I went full gas to the finish. I felt good. I kept pushing,\" Vollering said.\n\"I was nervous and the whole team was behind me and told me I could do it.\"\nVollering had been seventh heading into the stage from Lannemezan to Tourmalet Bagneres-de-Bigorre - a minute behind previous race leader and Worx team-mate Lotte Kopecky and 12 seconds drift of defending champion Annemiek van Vleuten.\nThe trio were part the group that pulled clear on the first of two tough climbs before Niewiadoma broke away in the final foggy 17km ascent of the Tourmalet.\nVollering and compatriot Van Vleuten initially declined to chase the leader in a tense stand-off before the former attacked on the approach to the skiing village of La Mongie.\nVollering reeled in Niewiadoma with six kilometres remaining and summoned enough energy to get herself over the line.", "url": "https://www.bbc.com/sport/cycling/66350733"}