{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:07:20", "date_modify": "2025-05-21 04:07:20", "date_publish": "2025-01-23 18:53:10", "description": "SA20 results: Joe Root out first ball to Chris Woakes but Paarl Royals beat Durban's Super Giants", "filename": "sport_cricket_articles_cvg49wxe2l4o_1747800440.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ba6b/live/07a31480-d9b9-11ef-abf7-8b2a99c77ef2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cvg49wxe2l4o_1747800440.html", "title": "SA20 results: Joe Root out first ball to Chris Woakes but Paarl Royals beat Durban's Super Giants", "title_page": "SA20 results: Joe Root out first ball to Chris Woakes but Paarl Royals beat Durban's Super Giants - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England's Joe Root was dismissed for a first-ball duck by Chris Woakes but Paarl Royals beat Durban's Super Giants by five wickets in the SA20.\nChashing 143 to win Root chased a wide delivery and was caught at slip in the first over.\nDespite that Royals made a fast start with Lhuan-dre Pretorius (25 off 13) and Rubin Hermann (44 off 22) finding regular boundaries, but both were dismissed to leave Royals 77-3.\nMitchell van Buuren (41 off 41) and David Miller (24 off 21) shared 59 for the fourth wicket to take control of the game but both were dismissed with seven and two required respectively.\nIndia legend Dinesh Karthik came to the crease and hit the winning runs as Royals won with 15 balls to spare.\nSuper Giants posted 142-7 with Quinton de Kock making 43 off 30 balls at the top of the order.\nAfghanistan's Mujeeb Ur Rahman claimed 2-23, while Root dismissed New Zealand's Kane Williamson in taking 1-18 from four overs.\nRoyals are top of the six-team table with 20 points and Super Giants sit bottom on eight points.", "url": "https://www.bbc.com/sport/cricket/articles/cvg49wxe2l4o"}