{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:35:30", "date_modify": "2025-04-26 04:35:30", "date_publish": "2025-03-02 00:00:00", "description": "Live text commentary and in-play clips from the SSE Arena as the Belfast Giants host the Glasgow Clan in the Elite League", "filename": "sport_ice-hockey_live_cdrxx1221kxt_1745642130.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f466/live/0b3ac110-f5cf-11ef-9e61-71ee71f26eb1.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_ice-hockey_live_cdrxx1221kxt_1745642130.html", "title": "Elite League Ice Hockey: Belfast Giants v Glasgow Clan", "title_page": "Elite League Ice Hockey: Belfast Giants v Glasgow Clan - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Clan beat Giants in overtime\nBelfast Giants 2-3 Glasgow Clan (after overtime)\nClan win thanks to a breakaway goal from Cole Ully but the Giants will be left scratching heads at how they coughed up a 2-0 lead at home heading into the final period.\nLack lustre performance from the league leaders in a title race that no one seems to want to grab hold off and go ahead and win.\nGiants last three league losses have been to the sides ranked 7th, 8th and 9th in the standings.\nThey’ll lead the league going into next weekend but it’s not looking comfortable anymore\nScoreless at the end of first period\nBelfast Giants 0-0 Glasgow Clan\nIt was a period that took a long time to spring to life and it did so with back-to-back powerplays for the Giants that they had some good looks on but failed to score.\nUp to the home team to lift the tempo in the second period.\nIt’s a Hockey Sunday in Belfast\nBelfast Giants v Glasgow Clan, 16:00 GMT\nThank-you for joining me at the SSE Arena in Belfast for this afternoon’s Elite League clash between the Belfast Giants and Glasgow Clan.\nAfter losing in Manchester on Friday, the league leaders, Belfast, watched on last night as Sheffield failed to take advantage after losing to Coventry although Nottingham maintained their recent good run of form beating Dundee.\nWith 12 games remaining the Giants lead is five points over Sheffield, who have played a game more, and six over Nottingham.\nSo this afternoon’s game gives the Giants a chance to bounce back after a poor road loss.\nGlasgow lie in seventh place, ten points clear of Manchester in ninth, so pretty secure in a play-off place.", "url": "https://www.bbc.co.uk/sport/ice-hockey/live/cdrxx1221kxt"}