{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:34:02", "date_modify": "2025-05-20 14:34:02", "date_publish": "2023-07-28 18:32:34", "description": "Tara Jane Stanley inspires York to a huge Women's Super League win over title rivals St Helens, just days after a cup loss.", "filename": "sport_rugby-league_66326059_1747751642.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7659/production/_130579203_pc2_4300.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-league_66326059_1747751642.html", "title": "Super League: St Helens 8-18 York Valkyrie - Stanley inspires revenge after cup loss", "title_page": "Super League: St Helens 8-18 York Valkyrie - Stanley inspires revenge after cup loss - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tara Jane Stanley stirred York's second-half fightback as St Helens were beaten to extend the lead at the top of Super League Group One to five points.\nSaints lead 8-0 at half-time thanks to a try from Jodie Cunningham and two Amy Taylor goals, despite Paige Travis' sin-binning early on.\nYork roared back in the second, scoring three tries without reply with Lacey Owen, Liv Gale and Stanley crossing.\nStanley kicked a late penalty to ensure revenge for last week's cup exit.\nThis win, less than a week after Saints edged a thrilling Challenge Cup semi-final by a single point, means York maintain their unbeaten Super League record and also marks a first win at the Totally WIcked Stadium after several defeats.\nSaints were the better side in the first-half, as Cunningham steamed through to give them a lead which was improved by a conversion and penalty goal by Taylor.\nWhatever boss Lindsay Anfield said at half-time had the desired effect for the Valkyrie though, with Stanley's quality to the fore.\nOwen took a pass from Sade Rihari and got the ball down, before a Stanley bomb forced an error from Phoebe Hook which Gale punished to score.\nStanley danced through to extend the lead thanks to Rihari's pass and then kicked two more goals to ensure the victory.\nSaints, perhaps feeling the hangover from the weekend, saw Pip Birchall go off with a finger injury while Emily Rudge and Cunningham were both walking wounded at the end after a hugely physical battle.\nSt Helens: Harris; Hook, E. Stott, McColm, Partington; Taylor, Gaskin; Hoyle, Jones, Crowl, Travis, Rudge, Cunningham\nInterchanges: Whitfield, D. Stott, Sams, Birchall\nYork Valkyrie: Stanley; Hyde, Renouf, Owen, Kershaw; Rihari, Gale; Akpa, Peach, Staveley, Andrade, L. Wood, J. Bell", "url": "https://www.bbc.com/sport/rugby-league/66326059"}