{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:59:47", "date_modify": "2025-05-19 14:59:47", "date_publish": "2017-07-03 21:00:39", "description": "Saturday's deciding Test in New Zealand could be as brutal as any the British and Irish Lions have faced, says Tadhg Furlong.", "filename": "sport_rugby-union_40486384_1747666787.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/170C9/production/_96790449_gettyimages-697125082.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_rugby-union_40486384_1747666787.html", "title": "British and Irish Lions: Ireland prop Furlong expects New Zealand backlash in third Test", "title_page": "British and Irish Lions: Ireland prop Furlong expects New Zealand backlash in third Test - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Saturday's third Test in New Zealand could be as brutal as any the British and Irish Lions have faced, says prop Tadhg Furlong.\nThe tourists' 24-21 victory in the second Test, their first over the All Blacks since 1993, set up the decider at Auckland's Eden Park.\nFurlong, part of the Ireland side who beat New Zealand in November, expects a backlash from Steve Hansen's side.\n\"When your pride is dented, you come out and are up for it,\" he said.\nFurlong was one of eight men in the initial Lions squad who helped end Ireland's 111-year wait for a win over the All Blacks with a 40-29 victory in Chicago last November.\nRory Best, Jack McGrath, CJ Stander, Robbie Henshaw, Conor Murray, Jared Payne and Johnny Sexton were also part of the victorious Irish team.\nBut New Zealand avenged that defeat with a bruising 21-9 win over Joe Schmidt's men in Dublin two weeks later.\n\"That match in Dublin, I remember coming off the pitch and being absolutely shattered,\" Furlong added. \"I was sore for days afterwards.\n\"It was one of the most brutal Test matches I've played in my short career. So we all expect to have the same thing again. And we've got to tee ourselves up for it.\"\nIt was a physical contest when New Zealand won in Dublin last November, with centre Henshaw forced off early on after a controversial high challenge by Sam Cane.\nIn the same match, Malakai Fekitoa was sin-binned for the All Blacks for a dangerous hit on Simon Zebo.\n\"I think you always fear the All Blacks in the way that if you don't get your stuff sorted, if you don't man up and meet them head on head it's a tough day at the office,\" added Furlong.\n\"They can score a try from anywhere. They're that dangerous. They've threats all over the park.\n\"If none of that works, they're just so damn consistent, and good at holding on to the ball. They're a tough team to beat.\n\"You have to keep attacking them, but it's easier said than done.\"\nFurlong will be going for three wins over the All Blacks in eight months as Hansen's side look to extend their unbeaten run at Eden Park to 40 games on Saturday.\nThe Lions, meanwhile, are bidding to secure only their second series win in New Zealand.", "url": "https://www.bbc.com/sport/rugby-union/40486384"}