{"authors": ["Martin Dowden", "www.facebook.com"], "date_download": "2025-05-21 05:24:30", "date_modify": "2025-05-21 05:24:30", "date_publish": "2025-04-03 14:19:44", "description": "McCann on", "filename": "sport_articles_cqj40x422dyo_1747805070.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5a88/live/df14f3c0-1091-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cqj40x422dyo_1747805070.html", "title": "McCann on", "title_page": "McCann on  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "McCann stressed that while many people perhaps looked at Barry Ferguson's CV and thought he might not be ready for the Rangers job, he has \"proved that wrong\".\nThe coaching team wanted to change the mindset among the squad and McCann believes they have achieved that.\nHe adds: \"There needs to be a real willingness to win. Sometimes you need to dig deep. Sometimes you have to go right to the end.\"\nMcCann says they have changed how Rangers attack but are still conceding goals and it is something they have to \"eradicate\", but the players are \"showing a wee bit of guts and determination\".\n\"A draw is not a good result at Rangers, domestically,\" he continued. \"The whole DNA of this club has not been lost on the four of us (the new coaching team). The players have embraced it.\"\nHe sensed the group towards the end of Philippe Clement's time \"lacked a bit of spark, energy, tempo and aggression in their play\" and that was something they looked to address quickly.\nMcCann praised the squad being \"accepting of changes made within a game and showing an ability to be adaptable,\" adding that Ferguson has shown he is prepared to adapt if things aren't working.\nVaclav Cerny is \"making good progress\" after missing the win at Dundee but the winger won't be risked before the Europa League quarter-final against Athletic Bilbao.", "url": "https://www.bbc.com/sport/articles/cqj40x422dyo"}