{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:33:55", "date_modify": "2025-05-20 12:33:55", "date_publish": "2023-08-04 09:25:13", "description": "Plymouth Argyle boss Steven Schumacher says his side have \"nothing to lose\" on their return to the Championship.", "filename": "sport_football_66403708_1747744435.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0CCA/production/_130647230_argylecelebratetitlegetty3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66403708_1747744435.html", "title": "Plymouth Argyle: 'Underdogs' have 'nothing to lose' on return to Championship", "title_page": "Plymouth Argyle: 'Underdogs' have 'nothing to lose' on return to Championship - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Plymouth Argyle boss Steven Schumacher says his side have \"nothing to lose\" on their return to the Championship.\nThe Pilgrims upset the odds to pip Ipswich Town and Sheffield Wednesday to the League One title last season and returned to the second tier for the first time since 2010.\nThey begin the campaign with Saturday's home game against Huddersfield Town.\n\"We know we're up against it, we know it's going to be a real tough league,\" Schumacher said.\n\"Everyone who I read and listen to say this is the strongest Championship we've had for a few years with the calibre of club that got relegated from the Premier League and the ones who went up from League One.\n\"So we know it's going to be difficult, but we've got nothing to lose, we're going to be positive and be brave and try and attack every game as best as we can.\"\nArgyle twice broke their transfer record last month as they spent more than £1m each on Bali Mumba and Morgan Whittaker, while another former loanee in Finn Azaz also re-joined the club this week on a season-long loan from Aston Villa.\nBut compared to the sums spent by their rivals, and the money the former Premier League sides have available to them in the form of parachute payments, Schumacher is realistic about where his club are in the Championship pecking order.\n\"We all understand where we sit financially on the pyramid, so naturally you're going to be the underdog,\" he added.\n\"I think last season we proved a lot of people wrong and no-one gave us a chance and always spoke about Sheffield Wednesday and Ipswich in particular and that was okay, we were comfortable being in that situation because we knew internally how good our players were.\n\"It's going to be the same this year, obviously we're playing against even bigger clubs than Sheffield Wednesday and Ipswich Town, so we've got to make sure we've got that same mentality.\n\"We know that we're going to have to work hard, we're going to have to be really well-organised when we haven't got the ball, but when we do we're going to have to be brave and express ourselves and have that confidence to show again how good we can be.\"", "url": "https://www.bbc.com/sport/football/66403708"}