{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:58:57", "date_modify": "2025-05-21 06:58:57", "date_publish": "2025-01-22 16:00:25", "description": "Lock Arthur Clark extends his contract with Gloucester, days after he was called up into the England squad for the first time.", "filename": "sport_rugby-union_articles_c20knny9506o_1747810737.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d11e/live/cd9b2060-d8c4-11ef-a303-a344a2a81285.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c20knny9506o_1747810737.html", "title": "Arthur Clark: Gloucester lock extends deal to stay with club", "title_page": "Arthur Clark: Gloucester lock extends deal to stay with club - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Lock Arthur Clark has extended his contract with Gloucester, days after he was called up into the England squad for the first time for the Six Nations.\nThe 23-year-old has made 35 appearances for the club since coming through their pathway as a junior and making his debut in 2022.\nUncapped Clark was brought into Steve Borthwick's team for the pre-tournament training camp on Monday following a number of injuries to the squad.\n\"I've enjoyed watching him grow since he's come out of school and I don't think he's anywhere near his ceiling yet,\" Gloucester director of rugby George Skivington told BBC Radio Gloucestershire.\n\"A real coup for us that he wants to stay at the club.\"\nClark's father Barry represented the Cherry and Whites during the 1980s and Skivington said the second row has \"deep roots\" at the club.\nHe has featured eight times for Gloucester so far this campaign, starting seven of those games, and also represented England A in November in their victory against Australia A.\nYet the call-up to England's senior squad represents another major step forward in Clark's career.\n\"He's earned the right to be there, he's had some great performances, he's a top bloke, he's very important for what we're doing here and hopefully he gets an opportunity - more than one opportunity,\" Skivington said.\n\"We knew he was there or thereabouts, I thought he might be in for a shot for the initial selection but he's been in great form for us. He's worked really hard, not just this year but over a number of years to get to the point he's at and I'm delighted for him.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/c20knny9506o"}