{"authors": ["David Mohan", "www.facebook.com"], "date_download": "2025-05-21 05:26:53", "date_modify": "2025-05-21 05:26:53", "date_publish": "2025-02-01 23:31:25", "description": "Colm Murphy produces a performance befitting of the occasion at the Ulster Hall on Saturday as he ripped through Tanzania's Kasimu Hamad Haji in three rounds to retain his Commonwealth silver featherweight title.", "filename": "sport_boxing_articles_clyn57r1ep2o_1747805213.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d6c2/live/4a104d90-e0f0-11ef-9f18-1194e9bcbc65.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_boxing_articles_clyn57r1ep2o_1747805213.html", "title": "Murphy defeats Haji to retain Commonwealth title", "title_page": "Nations Fight Night: Murphy defeats Haji to retain Commonwealth title - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Colm Murphy produced a performance befitting of the occasion at the Ulster Hall on Saturday as he ripped through Tanzania's Kasimu Hamad Haji in three rounds to retain his Commonwealth silver featherweight title.\nAs the headline attraction on the Nations Fight Night, there could have been some added nerves for south Belfast's 'Posh Boy', but he proved he was able to handle it and anything his livewire challenger had before his body assault ended the argument.\nWith 13 previous wins from as many contests as a pro, Murphy rode into the venue on the crest of a wave and there was no stopping him on the night, boxing with patience early and gradually wearing Haji down.\nThe visitor tried to ask questions in the second, but his moments were fleeting as the greater size and power of Murphy finally chopped him down in the third and there was no recovering as the challenger wore a resigned look as he failed to rise before the count of 10.\nA thrilling chief support saw Nathan Howells rip the Celtic super-featherweight title from John Cooney after an epic nine-round battle.\nHowells had one prior blemish in a fight for his national title, but there was no denying him this time as he recovered from a tough opener when Cooney had stung to completely take over.\nCooney, who looked on the brink of being stopped on a number of occasions as the relentless pressure of Howells was breaking him down.\nIn the end, it was a body shot that had the Belfast-based Cooney down and although he rose, a sustained follow-up attack left referee Darren Sarginson no option but to step in with Howells triumphant.\nAlso on the night, there was a comeback win for Belfast flyweight Connor Quinn over Sean Jackson, Jack O'Neill scored a first career knockout against Luke Fash while James Freeman, Charles McDonagh and Teo Alin all prevailed on the cards.", "url": "https://www.bbc.com/sport/boxing/articles/clyn57r1ep2o"}