{"authors": ["Paul Battison", "www.facebook.com"], "date_download": "2025-05-20 14:48:04", "date_modify": "2025-05-20 14:48:04", "date_publish": "2023-07-28 07:20:04", "description": "Bellator is set to host its second co-promotional event in six months with Japan's Rizin at the Saitama Super Arena on Saturday.", "filename": "sport_mixed-martial-arts_66304062_1747752484.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1504E/production/_130549068_22h38065.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_mixed-martial-arts_66304062_1747752484.html", "title": "Bellator v Rizin 2: Scott Coker says MMA is thriving again in Japan", "title_page": "Bellator v Rizin 2: Scott Coker says MMA is thriving again in Japan - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "As Bellator president Scott Coker sat in the Saitama Super Arena in Japan on New Year's Eve, he knew he was witnessing something special.\nBellator had teamed up with Japanese promotion Rizin for the country's annual martial arts show on 31 December, hosting a unique event which pitched fighters from each organisation against each other.\nSurrounded by 23,000 fans, including UFC great Khabib Nurmagomedov and boxing legend Manny Pacquiao, Coker describes the production value in Japan - which includes spectacular lights, pyrotechnics, and fighters making their walkouts in samurai armour - as being unlike anything he's ever experienced.\nCoker, 60, says he was witnessing the triumphant return of MMA in Japan.\n\"Think about where martial arts comes from - Asia, China, Korea - they all have different styles, but Japan really is a fighting culture,\" Coker told BBC Sport.\n\"They still have that spirit - what people call the Bushido spirit, inside. It's something really unique to this planet. In Japan martial arts is part of their culture, they love it and it's engrained in their DNA.\n\"For the first time on New Year's Eve six months ago, I was like, 'MMA is back in Japan now'. That event sold out in a day and a half.\"\n\"It's really good to see that finally the Japanese fans have come back to a brand they can relate to and would like to see grow because they're excited about the athletes and the events.\"\nSuch was the success of the event, the two promotions have joined forces again six months later to host another show.\nOn Saturday, once again at the Saitama Super Arena, in a suburb of the Japanese capital Tokyo, athletes from each promotion will compete on a 13-fight card which is headlined by a lightweight bout between Patricky 'Pitbull' Freire and Roberto de Souza.\nCoker was first introduced to martial arts in Japan when he went to a kickboxing show hosted by promotion K-1 in the 1990s.\nK-1 at the time was the world's premier kickboxing brand, while fellow Japanese promotion, Pride, was the biggest MMA promotion.\nPride's promotor, Nobuyuki Sakakibara, would later go on to establish Rizin in 2015.\n\"It was unbelievable because it was the first time I'd walked into a stadium that had 55,000 people there to watch a martial arts event,\" said Coker.\n\"I used to go to the Pride fights there, they were spectacular. I would say the best fighters in the world were not fighting for the UFC at that time, they were fighting for Pride.\n\"You're talking about Fedor Emelianenko in his prime. You're talking about Mark Coleman, Don Frye, all the legends that helped build the sport.\n\"No one else on the planet was packing stadiums like six, seven times a year like that. It was just nuts.\"\nAs the UFC grew in stature and popularity, its parent company would eventually purchase Pride in 2007, with the American promotion going on to acquire many of its top fighters.\nCoker says the absence of many top MMA fighters in Japan, combined with the ageing of K-1's kickboxing stars, caused a \"lull\" in martial arts in the country for a number of years, and he is delighted to see its popularity growing again.\nHe says the relationship Bellator has built with Rizin is part of Coker giving back to Japan for the role it played in growing MMA.\n\"When I think about us giving Sakibara help, supporting him and creating this relationship, we need Japan to be healthy in MMA,\" said Coker.\n\"We need a healthy martial arts business in Japan because this is where it all started, this is the birthplace.\"\nCoker and Sakibara's relationship first started in 2006 when Coker was in charge of an American MMA promotion called Strikeforce.\nStrikeforce had just sold out an event, headlined by Frank Shamrock and Cesar Gracie, at the Sap Centre in San Jose, California, and such was the success of the show, the arena was keen to host another as soon as possible.\nShamrock wasn't fit to fight again on short notice, so Sakibura sent over Alastair Overeem from Pride to to fight against Vitor Belfort in the main event.\nCoker says fellow MMA promotions can learn from the relationship he has built with Sakibura.\n\"We had this exchange which I think was really good for MMA,\" said Coker.\n\"I think competing against other leagues should be the way this is really done and we're gonna support it and hopefully one day you'll see a real World Cup of MMA fights.\n\"I'm hoping this [relationship with Rizin] can be the catalyst for something which could evolve in the future with all the different combat leagues who could do something like a World Cup.\"\nCoker adds for his idea to work, everyone would have to be involved, including the UFC.\n\"It's not the UFC's business model to do it, but at some point hopefully it would be amazing,\" he said.\n\"If everybody signs up it's not going to be us who holds the card back. We're not afraid to put our guys out there, it just has to be the right setting and time.\n\"We have obligations to our media partners and venues around the world, but if it does happen and somebody reached out, we would definitely say yes.\"", "url": "https://www.bbc.com/sport/mixed-martial-arts/66304062"}