{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:46:23", "date_modify": "2025-05-21 06:46:23", "date_publish": "2025-03-30 15:45:21", "description": "Leicester City 1-1 Tottenham Hotspur: What the managers said", "filename": "sport_football_articles_cpwz8kd7y9no_1747809983.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6f4e/live/bfe7d4c0-0d7d-11f0-a1c5-cd0d1898b025.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cpwz8kd7y9no_1747809983.html", "title": "Leicester City 1-1 Tottenham Hotspur: What the managers said", "title_page": "Leicester City 1-1 Tottenham Hotspur: What the managers said - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tottenham came from behind to end their five-match losing streak in the Women's Super League with a draw at Leicester City. Here is what the managers said after the game:\nLeicester boss Amandine Miquel speaking to Sky Sports:\n\"I think a draw is OK. We would have preferred to win but we could also lose it so we accept a point and continue for the next games.\n\"I felt we looked tired, I don't know if it was the sun or the international break. Players were tired and it was hard to follow the rhythm, less energy than last week but got the point so that is good.\n\"Unbeaten is better than anything but obviously frustrated not to get the second goal but happy to get the point and keep moving forward.\n\"We have to keep positive, work on what we can improve and make sure that for the next games we look a bit fresher.\"\nTottenham boss Robert Vilahamn speaking to Sky Sports:\n\"We got a point which is better than the last games we've had. Good football, create so many chances, had most of the possession. In one way we're doing a good game but we're not really there yet to manage to actually win the game but I'm actually really proud of how we played today.\n\"If you look at the team they don't have the best self confidence in the world, where we are in the table you can see that it's actually a really good team playing good football so that's why I'm actually quite calm about where we are because we are taking steps in the way we want to play.\n\"We started the last game against West Ham about how we want to look and how we want to play for the club and develop for next season. It was a good performance but not good attacking football against West Ham, today was better so I hope we can go to Aston Villa in a few weeks and actually win that game by scoring a few goals and looking like we did today.\"", "url": "https://www.bbc.com/sport/football/articles/cpwz8kd7y9no"}