{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:38:01", "date_modify": "2025-05-21 03:38:01", "date_publish": "2025-02-10 11:13:42", "description": "British heavyweights Dillian Whyte and Joe Joyce will compete in the headline bout at Manchester's Co-op Live Arena on Saturday, 5 April.", "filename": "sport_boxing_articles_cq5g1py750po_1747798681.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8253/live/7ced47a0-e6bc-11ef-a319-fb4e7360c4ec.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_boxing_articles_cq5g1py750po_1747798681.html", "title": "Dillian Whyte faces Joe Joyce in April & Anthony Cacace to fight Leigh Wood in May", "title_page": "Dillian Whyte faces Joe Joyce in April & Anthony Cacace to fight Leigh Wood in May - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Britons Dillian Whyte and Joe Joyce will headline a heavyweight-stacked card at Manchester's Co-op Live Arena on Saturday, 5 April.\nOlympian Delicious Orie will make his professional debut and former cruiserweight world champion Lawrence Okolie will take on Richard Riakporhe, who also moves up to heavyweight.\nIn another date on Queensberry Promotions' schedule, Belfast super-featherweight Anthony Cacace will face Leigh Wood in a battle between two former world champions at Nottingham's Motorpoint Arena on 10 May.\nLater that month, former undisputed light-welterweight champion Josh Taylor will move to welterweight to challenge WBO European title holder Ekow Essuman in Glasgow.\nScotsman Taylor has signed with promoter Frank Warren's stable for his first fight since losing a rematch to Jack Catterall in May 2024.\nThe April card will be the first Queensberry Promotions event shown on streaming platform Dazn, as part of a new multi-year deal.\n\"We are starting as we mean to go on and, as you might expect, the heavyweights will play a big, big part in 2025 and beyond,\" Warren said.\nWhyte and Joyce shared several light-hearted exchanges and insisted there was plenty of mutual respect at Monday's news conference at the Co-op Live Arena.\nJoyce is scheduled to fight Patrick Korte in Bournemouth on 1 March but is expected to cruise past the German, and vowed to then knock out former world-title challenger Whyte.\n\"The only man who can put coffee to sleep,\" Whyte replied. \"He's a great fighter but a boring guy.\"\nFormer WBO interim champion Joyce's world-title aspirations were derailed after back-to-back stoppage defeats by China's Zhilei Zhang in 2023. In July, the 39-year-old was dropped and outpointed by veteran Derek Chisora.\nWhyte has won 31 fights with three defeats, but 'the Body Snatcher' has not really been in a meaningful bout since he narrowly beat Jermaine Franklin on points in 2022.\nThe 36-year-old returned a positive drugs test before a rematch with Anthony Joshua in August 2024 was cancelled.\nHe resumed his career after an investigation found the \"adverse finding\" in a pre-fight test was caused by a contaminated supplement.\n\"I never said I'm the best fighter in the world but I come to fight,\" Whyte said.\n\"I'm here for my opportunity. The last year has been rough.\"\nCacace, 36, beat Joe Cordina to become world champion in Saudi Arabia in May 2024 before winning a non-title fight against Josh Warrington at Wembley Stadium in September.\nHe was due to face his mandatory challenger for the IBF title, Eduardo 'Sugar' Nunez, in his next bout but vacated his belt in pursuit of more lucrative fights.\nNottingham's Wood held the WBA featherweight title in 2023, but has not fought since beating Warrington in October 2023.\n\"They're two lovely guys but two unbelievable warriors. The fans are going to love this fight,\" Warren said.", "url": "https://www.bbc.com/sport/boxing/articles/cq5g1py750po"}