{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:17:19", "date_modify": "2025-05-21 06:17:19", "date_publish": "2025-03-31 08:28:22", "description": "Nottingham Forest news: Fan views on FA Cup victory over Brighton", "filename": "sport_football_articles_cn9v4l7y02jo_1747808239.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cn9v4l7y02jo_1747808239.html", "title": "Nottingham Forest news: Fan views on FA Cup victory over Brighton", "title_page": "Nottingham Forest news: Fan views on FA Cup victory over Brighton - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your views on Nottingham Forest's penalty shootout victory against Brighton in the quarter-finals of the FA Cup.\nHere are some of your comments:\nJohn: Brilliant defensive performance. Brilliant Matz Sels performance. The only negative, as we all know, is not converting chances without Chris Wood. That aside, superb organised performance and total commitment from everyone involved.\nSean: It wasn't the best game of football, and at times we hung on and defended well, but we're showing some real togetherness and mental strength, especially during that penalty shootout. It could've gone wrong after Neco Williams' miss, but we stuck to our jobs and got it done. And it had to be Ryan Yates scoring the goal to send us to Wembley. Perfect ending. Now we're all in the sea. Come on Forest!\nLuke: Forest are really good at doing what they do. That performance is our season in a microcosm. Nothing to fear in any of our opponents and Nuno continues to make this season better and better. What a time to be alive!\nMalcolm: Forest deserved this win for the superb team display and organisation. Nuno has got them working with great togetherness and they really fight for each other. Fantastic performance.\nMossy: It was a hill to climb, and again after an exhausting game Forest prevailed. Now we have 48 hours' rest to climb a mountain, and get a result against Manchester United.", "url": "https://www.bbc.com/sport/football/articles/cn9v4l7y02jo"}