{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:54:01", "date_modify": "2025-05-21 06:54:01", "date_publish": "2025-01-13 20:50:22", "description": "Premiership champions Larne bring in forward Harry Panayiotou until the end of the season.", "filename": "sport_football_articles_c62q9x6j30no_1747810441.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a7b8/live/201f8420-d1ef-11ef-a174-4f716b9e5ce9.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c62q9x6j30no_1747810441.html", "title": "Larne sign striker Panayiotou on short-term deal", "title_page": "Irish Premiership: Larne sign striker Panayiotou on short-term deal - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Premiership champions Larne have brought in forward Harry Panayiotou until the end of the season.\nThe 30-year-old Saint Kitts and Nevis international played under Larne's head of football Nathan Rooney at Bruno's Magpies before moving to Sirens FC in Malta last year.\nPanayiotou began his career at Leicester City and scored the winner against Leeds United on his senior debut in 2012.\nSpells at clubs in England, Scotland and Greece followed before he scored 12 goals in 37 appearances for Aldershot Town in the National League in the 2020/21 season.\n\"It's nice to get the move over the line, I've been speaking to the club for around a week or so and now that we've managed to get the deal over the line I'm buzzing,\" said Panayiotou, who has netted 12 times in his 38 caps for Saint Kitts and Nevis.\n\"As a player I'm a forward who can act as a bit of an all-rounder – I can come short but can also play long if required. I'm looking forward to getting the head down in training, getting sharper and hopefully getting some minutes when the Gaffer calls on me.\"\nPanayiotou's international clearance will not come through in time for Tuesday's BetMcLean Cup semi-final against Cliftonville but he will be available to face Glentoran in the Premiership on Saturday.\n\"I have previously worked with Harrison for a short period of time in the past and I know what he will be able to bring to our group in terms of experience, having played at similar levels in England and Scotland, alongside other leagues in Europe,\" said Rooney.\n\"As a player, he possesses good hold-up play for a centre-forward, while also being able to lead the line in terms of pressing really well with an ability to mix up his movements in the box which is something that is vital that our forward line continues to do.\"", "url": "https://www.bbc.com/sport/football/articles/c62q9x6j30no"}