{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:42:24", "date_modify": "2025-05-19 14:42:24", "date_publish": "2017-08-17 15:40:36", "description": "Irish Sports Minister Shane Ross criticises Pat Hickey's refusal to appear before a parliamentary body discussing the Rio Olympics tickets saga.", "filename": "sport_olympics_40966067_1747665744.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6372/production/_92985452_pathickey.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_olympics_40966067_1747665744.html", "title": "Pat Hickey: Sports Minister Ross criticises ex-OCI's president committee no-show", "title_page": "Pat Hickey: Sports Minister Ross criticises ex-OCI's president committee no-show - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Irish Sports Minister Shane Ross has criticised Pat Hickey's refusal to appear before a parliamentary committee discussing a report into last year's Olympic ticketing controversy.\nHickey was arrested by Rio police at the 2016 Games during an investigation into alleged illegal ticket sales.\nAn Irish Government-commissioned report into the affair has been published.\nHickey claimed the report contained \"inaccuracies\" but refused to appear before the committee on Thursday.\nIreland's former Olympic boss was charged by the Brazilian authorities on accusations of ticket touting, running a cartel and illicit marketing and though he returned to Ireland last December, he is still awaiting a trial date in Brazil.\nMr Ross said it was \"inconsistent\" that Ireland's former Olympic boss had given media statements in recent days but failed to discuss his involvement in alleged illegal ticket sales with the Irish Parliament's Committee on Transport, Tourism and Sport.\nJustice Moran's report found that deals between the Olympic Council of Ireland (OCI) and THG Sports, owned by Marcus Evans, and Pro10, a second company linked to the businessman, were more concerned with their commercial interests than the athletes, their friends, relatives and supporters.\nThe report also stated that after THG's bid to become the OCI's official ticket seller at the Games was rejected by Rio's organising committee, the appointment of Pro10 only disguised THG's continuing role.\nThe inquiry into Olympic tickets sales was sparked after Mr Hickey, the former OCI President, was arrested in his Rio hotel last August.\nHickey, THG and Pro10 have all denied wrongdoing and the former OCI president has vowed to clear his name.\n\"I respect the right of anybody not to self-incriminate, but I find it somewhat inconsistent to be able to go and answer questions to the media and not be able to come here,\" said Mr Ross, referring to recent media comments from Hickey.\n\"He did say there were inaccuracies in the report, which I don't accept. I think it would be useful if he would come here and explain his point of view and I don't think it would in any way prejudice his trial,\" the minister added.\nMr Hickey, who is hoping to return to his International Olympic Committee roles, also declined to co-operate with Judge Moran's investigation.", "url": "https://www.bbc.com/sport/olympics/40966067"}