{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:02:44", "date_modify": "2025-05-20 14:02:44", "date_publish": "2023-07-30 13:01:10", "description": "Findlay eyes Rangers upset for 'fantastic start to season'", "filename": "sport_articles_cv2nne0x7ldo_1747749764.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b0f0/live/4a6d8850-2ed8-11ee-999b-b74dedc428d3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cv2nne0x7ldo_1747749764.html", "title": "Findlay eyes Rangers upset for 'fantastic start to season'", "title_page": "Findlay eyes Rangers upset for 'fantastic start to season' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Kilmarnock can make it a \"fantastic start to the season\" by following up Viaplay Cup progress with an upset against Rangers in the Scottish Premiership opener, says Stuart Findlay.\nThe defender, who rejoined Killie this summer, netted for the second game in a row as Derek McInnes' men triumphed 2-1 at Albion Rovers to win Group F before they start the league campaign at home to the Ibrox side next weekend.\n“The Rangers game is obviously going to be a completely different challenge to what we’ve had in the League Cup where we’ve been the team making the play a lot,\" said Findlay.\n\"But the manager has got great experience over the years of playing against the Old Firm. I know for a fact he’ll set us up well and we’ll be tremendously hard to beat.\n\"If we can get a performance against Rangers and get something out of the game after topping the League Cup group then all of a sudden it’s a fantastic start to the season.\n\"Some of the performances haven’t been amazing in the League Cup, we know that, and we’re well aware of the standards we have to set ourselves.\n\"But now we’ve won the group if we can go and get something against Rangers we can look forward after a great start.\"", "url": "https://www.bbc.com/sport/articles/cv2nne0x7ldo"}