{"authors": ["Nat Hayward", "www.facebook.com"], "date_download": "2025-04-26 06:57:51", "date_modify": "2025-04-26 06:57:51", "date_publish": "2025-02-28 13:52:40", "description": "Ruben Amorim press conference: Man Utd vs Fulham", "filename": "sport_football_articles_crlxxlkrwrzo_1745650671.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/eec5/live/993cf210-a90a-11ef-a4fe-a3e9a6c5d640.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_crlxxlkrwrzo_1745650671.html", "title": "Ruben Amorim press conference: Man Utd vs Fulham", "title_page": "Ruben Amorim press conference: Man Utd vs Fulham - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Alejandro Garnacho has \"a knock\" but is expected to be fit and in contention for Sunday despite walking straight down the tunnel after his first-half substitution in Wednesday's win against Ipswich.\nOn the incident, Amorim said: \"He came to me, to my office. He went to the dressing room, watched the game, then went home. It is not an issue but I told him that at Manchester United, everything is an issue. At this club, perception is important. He will pay for dinner for all the team. That is it.\"\nOn former captain Roy Keane's criticism of current skipper Bruno Fernandes: \"I have a different opinion. Bruno is really important for us, especially for me. He is playing well in a difficult context - he always wants the responsibility. There is a lot of frustration. He wants to win and it is really hard to deal with that frustration. I think my opinion is more important than Roy Keane's because I am the coach.\"\nAmorim confirmed \"no-one different is back\" from injury and absent players are \"trying to recover to help us in the next games\".\nHe backed Patrick Dorgu and said the youngster will be a \"very important\" player for United after his error and red card against Ipswich: \"I don't need to say anything to him. He is frustrated and sad, but he is working [towards] the next games. He is going to be a very important player for us.\"\nOn summer recruitment plans: \"We need to make some deals to make some deals. We know the situation. We are changing a lot of things in our squad and the academy. We are working on a lot of things. We are preparing for next season, for sure.\"\nOn Andre Onana's form: \"He did some great saves that saved our team and sometimes [he has] some problems, but that is normal. I think if you look at our team you can find a lot of players with that issue. We just have to support Andre. We need to forget about the past and prepare for the future.\"", "url": "https://www.bbc.co.uk/sport/football/articles/crlxxlkrwrzo"}