{"authors": ["Emma Sanders", "www.facebook.com"], "date_download": "2025-05-20 11:52:39", "date_modify": "2025-05-20 11:52:39", "date_publish": "2023-08-06 00:47:00", "description": "England midfielder Keira Walsh could be available for their Women's World Cup last-16 tie with Nigeria on Monday if she \"recovers well\", says manager Sarina Wiegman.", "filename": "sport_football_66419943_1747741959.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6D71/production/_130671082_gettyimages-1595978348.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66419943_1747741959.html", "title": "Women's World Cup 2023: Keira Walsh could return for England's last-16 tie with Nigeria", "title_page": "Women's World Cup 2023: Keira Walsh could return for England's last-16 tie with Nigeria - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England midfielder Keira Walsh could make their Women's World Cup last-16 tie with Nigeria on Monday if she \"recovers well\" from Sunday's training session, manager Sarina Wiegman says.\nWalsh, 26, was taken off on a stretcher during the 1-0 win over Denmark on 28 July with a knee injury, which Wiegman confirmed was \"not ligament damage\".\nThe Barcelona midfielder trained with the squad at Central Coast Stadium before flying to Brisbane on Sunday.\n\"Keira's doing well,\" said Wiegman.\n\"She started her rehabilitation straight after we knew what was going on. She has been on the pitch training today and now we will wait to see how she recovers.\n\"If she does well, then she will be available for [Monday].\"\nThere were initial fears that Walsh had suffered a serious knee injury, but scans then ruled out anterior cruciate ligament damage.\n\"Everyone was in shock of course,\" said Wiegman. \"But then really quickly, the day after, we knew things weren't as bad as it looked and that people had thought.\"\nEngland have won all three matches at the Women's World Cup and face Nigeria for a place in the quarter-finals in Brisbane at 08:30 BST on Monday.\nFor last Tuesday's 6-1 win over China, Manchester United captain Katie Zelem made her first start in midfield and impressed alongside regular Georgia Stanway.\n\"Of course we want every player to be fit and available,\" added Wiegman. \"Keira wasn't available for the last match and we know what options we have in that position.\n\"Katie [Zelem] did really well against China and now Keira is back ,so that's really nice for the team. We know we have other options too. Keira is exceptional but other players can solve that.\"\nEngland defender Alex Greenwood said Walsh had been \"fine\" in camp during the last week despite having to miss their final group match.\n\"We obviously spent a few days apart when we played but she's Keira and was focused on her rehab,\" said Greenwood.\n\"She always had a smile on her face and we just supported her as team-mates as best we could.\"\nThere was plenty of speculation in the build-up to England's win over China about how they might replace Walsh, a key figure in their Euro 2022-winning side.\nWiegman switched formations, opting to play a back three, and included Zelem in midfield. It was hugely successful but the Dutchwoman would not give any clubs as to how England might set up against Nigeria.\n\"We have two options now - the way we have played and what we did against China, so we will take that into consideration. You will see tomorrow what we will do,\" said Wiegman.\nGreenwood added: \"In both formations, we're able to express ourselves. I think for the game and the challenge that lay ahead [against China], the back three worked. That proved in the game.\n\"Whatever formation we play, we're strong in all areas and we'll prepare for anything. But no, sorry, I'm not going to give you the answer.\"\nNigeria manager Randy Waldrum said his side had to prepare for both possible formations, which makes his \"job a little more challenging\".\n\"As a coach, I expect [Wiegman] to go with a back three as they played so well and I don't know why they would change that,\" said Waldrum.\n\"But we have to be prepared for both systems. It makes the job a little challenging as you don't have that much time and I'm sure England would have worked at both systems quite extensively.\"", "url": "https://www.bbc.com/sport/football/66419943"}