{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:04:03", "date_modify": "2025-05-21 04:04:03", "date_publish": "2025-04-04 06:18:12", "description": "Truro City captain Connor Riley-Lowe says his side's National League South title challenge has been \"incredible\".", "filename": "sport_football_articles_c0r5gz9rn95o_1747800243.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b6ed/live/6184a3b0-0fe7-11f0-8db5-3f4abea6b85e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c0r5gz9rn95o_1747800243.html", "title": "Truro City relishing 'incredible' title challenge", "title_page": "Truro City relishing 'incredible' title challenge - Connor Riley-Lowe - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Truro City captain Connor Riley-Lowe says his side's National League South title challenge has been \"incredible\".\nThe third-placed Tinners are three points off leaders Worthing ahead of a trip to the Sussex side on Saturday.\nIt comes less than a year after Truro had to play 13 games in the final four weeks of last season to stay up after a series of postponements at their temporary home grounds.\n\"A year ago we were playing two or three games in Gloucester a week,\" he tells BBC Radio Cornwall.\n\"It's incredible what's happened over the past year.\n\"We've said most of this year that no matter what we do not much will top staying up last year, just under the incredible circumstances.\n\"But if I'm honest, as the weeks go by this year almost does seem even more incredible than last year, just with the turnaround at the club and how everything's just seemed to go so smoothly and so well on the pitch.\"\nThat smoothness has come despite major upheaval on and off the field in the form of new owners, a new ground and a new manager.\nHaving taken over the club in late 2023, Truro's Canadian owners led City back to Truro after four years playing outside the county as they waited for their new ground to be built.\nThey would also have a new manager in charge on that opening day in August - the experienced John Askey was brought in after former boss Paul Wotton left to take over at nearest neighbours and promotion rivals Torquay United.\n\"It was a really tough one at the start of the year because throughout the summer we'd had a lot of change - we'd lost our manager and we'd got a new manager,\" says Riley-Lowe, who is close friends with England and Aston Villa striker Ollie Watkins after their time together at Exeter City's academy.\n\"We had come home to Cornwall and to our new stadium, we had a lot of new players come in, we had a couple of players leave, so I think looking back I would have bitten your hand off to be in the position we're in now.\"\nHe added: \"We all we all loved Paul, and he was a great manager for Truro, but he would be the first to say I think it was time to have a little bit of fresh ideas and a new manager.\n\"John has been brilliant, he's really, really good. He's very different to Paul, you probably couldn't get two polar opposite characters really, and two polar opposite types of managers.\n\"It is quite interesting because both managers seemed to be doing well this year, yet they've got such contradicting styles really.\n\"He's brought in some fresh faces and he's given us a little bit of a different outlook on how we can play.\n\"We've been on the front foot a lot more this year so it's been really good, really enjoyable.\"\nWith five games to go, just three points separate leaders Worthing from second-placed Dorking Wanders, Truro in third and fourth-placed Torquay United who all have 77 points.\nIt means City's trip to Worthing could be make-or-break for their hopes of the one automatic promotion spot given to the champions, especially as the Cornish club host Torquay on Good Friday.\nThey go into the game having lost once in their last 13 games and inflicted a season's-worst 5-0 defeat on Worthing when they visited Cornwall in late August.\n\"There's no shying away from that, it's a big game,\" said Riley-Lowe of his side's trip to Sussex.\n\"Obviously we're all looking forward to it, you'd rather be involved in these games than at this point last year where we were fighting for our lives and the feel going into those games is a lot different.\n\"I think it's two good teams going head to head, I think both teams are going to try and play the way that they have all season.\n\"We know Worthing are a very, very good footballing side and we've had a lot of joy from being on the front foot, so I think it'll be a good game for the neutrals and for the fans.\n\"I would say they're probably under a bit more pressure in terms of the game than us, but we're under no illusions that it's an important game and ultimately we 're going to go there to try and win.\"", "url": "https://www.bbc.com/sport/football/articles/c0r5gz9rn95o"}