{"authors": ["Martin Watt", "www.facebook.com"], "date_download": "2025-05-20 13:19:44", "date_modify": "2025-05-20 13:19:44", "date_publish": "2023-08-02 10:06:03", "description": "Brendan Rodgers inherits a treble-winning settled squad, so what will he bring to Celtic in his second spell as manager?", "filename": "sport_football_66340506_1747747184.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/124B3/production/_130613947_20806341.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66340506_1747747184.html", "title": "What will Brendan Rodgers' Celtic look like this season?", "title_page": "What will Brendan Rodgers' Celtic look like this season? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Meet the new boss, same as the old boss. Brendan Rodgers is back and a fresh era launches this weekend as he takes charge of his first competitive Celtic game second time around.\nThe Northern Irishman will be hoping for a smoother start than seven years ago when Celtic came a calamitous cropper in Gibraltar against a team containing a fireman, a policeman and a taxi driver.\nIf that red neck against Lincoln Red Imps in Champions League qualifying proved anything, it's that first impressions can be misleading.\nCeltic repaired the damage in the second leg and Rodgers swiftly set about conquering all he surveyed on the Scottish scene, finishing his debut season with an invincible treble before ending his reign - abruptly - in early 2019 with seven trophies out of seven as he was lured to Leicester.\nMaintaining domestic dominance and making inroads in the Champions League group stage is the challenge now facing the 50-year-old.\nHaving inherited a treble-winning squad from Ange Postecoglou, a rebuild was not required this summer but Rodgers has to cope with two surprise exits.\nTalented winger Jota, who contributed 15 goals and 12 assists last season, is the most significant loss, departing in a lucrative move to Saudi Arabia, while midfielder Aaron Mooy has retired at age 32 after 41 appearances in his single campaign.\nIn have come five new signings for a combined total of around £11.5m. As it stands, it's open to question whether Celtic are any stronger than last season.\nPolish centre-back Maik Nawrocki, who cost a reported £4.5m from Legia Warsaw, has arguably the strongest case for being ready-made for the first team, where he will look to displace Carl Starfelt. Regardless, Narwocki strengthens an area that needed reinforcing.\nCeltic clearly still have buying to do, including a new winger, but Rodgers has dampened supporters' hopes of the Jota fee being splurged on a mega-money signing.\n\"Everyone thinks that we might be bringing in a £15-20m player. The reality is that won't be the case. It's not what the club is based on. But that doesn't mean there's not talented players out there that we want,\" he told Sky Sports.\nPotential abounds in the club's four other new recruits. The 'buy young, develop, and sell on' model has served Celtic well in recent years and newly arrived wingers Hyun-jun Yang and Marco Tilio are both 21, while Odin Thiago Holm is 20 and fellow midfielder Kwon Hyeok-kyu 22.\nThe club's best bit of business this summer may well be extending the contract of talismanic striker Kyogo Furuhashi until 2027. Captain Callum McGregor and Daizen Maeda have also signed new deals, ensuring stability.\nRodgers couldn't boast as high a hit rate in the transfer market during his first Celtic spell as Postecoglou - but his coaching expertise shone through and he had the Midas touch in improving players.\nWhen the Northern Irishman took over in 2016, the general consensus was that Scott Brown was winding down his glory-laden career. Club captain or not, his legs were going, his time had passed.\nRodgers revitalised the midfielder, making him the beating heart of his team. Others such as McGregor, Kieran Tierney, James Forrest and Stuart Armstrong all thrived and kicked on under Rodgers too.\nMight the manager breathe new life into the career of Scotland midfielder David Turnbull, who has struggled to progress as expected since his move from Motherwell three years ago?\nTurnbull, now 24, made just nine starts under Postecoglou last term, but has looked bright, and netted twice, in friendlies this summer. Alexandro Bernabei has also had an impactful pre-season - can the Argentine be refined into a reliable left-back?\nEven regulars could benefit too from the Rodgers factor. Tireless forward Maeda's end product can often be erratic, but he played through the middle in the friendly defeat by Yokohama Marinos and netted a first-half hat-trick.\nBrown, now a manager himself at Fleetwood Town, credits Rodgers for \"taking everybody's game to a different level\" at Celtic with his coaching and attention to tactical minutiae.\n\"It was fitness wise and the understanding of the game as well,\" said Brown. \"It wasn't just turn up, play and hope for the best. It was properly tactically based on how we were going to outplay a team, how we were going to keep possession, create more chances. It was all small details but very, very good. Simple things won us games.\n\"We put teams under so much pressure high up the park that we didn't have to defend that much, they gave us the ball back because they were scared to play so went long.\"\nRodger's high-tempo, aggressive-pressing, attacking style isn't far removed from Postecoglou's. Though while the Australian opted for inverted full-backs, Rodgers prefers his to stay wide and take turns at bombing forward.\nThere is flexibility within Rodgers' 4-2-3-1 system, which becomes a 3-4-3 when his side attack. He favours outnumbering the opposition in midfield and requires dynamic players to carry out his game-plan. At Leicester, Jamie Vardy utilised his pace to play on the shoulder of defenders, a role Kyogo fits at Celtic.\nThe hostility from some Celtic fans that initially greeted Rodgers' return has largely dissipated. The atmosphere will be celebratory on Saturday when the manager greets a sell-out Celtic Park and the title flag is hoisted before the Premiership opener against Ross County.\nRodgers has had a dress rehearsal, receiving a warm welcome from a crowd of over 40,000 at Forrest's testimonial on Tuesday. He described it as feeling like being home with family, but noted that for the goodwill to last \"I need to prove myself again\".\nThe opportunities to do that come thick and fast. The Champions League group stage - Celtic go straight in for a second successive year - can wait for now.\nThe second weekend of the season sends Celtic to Pittodrie to face last season's third force Aberdeen. There's also a League Cup tie at Kilmarnock to be navigated before a first derby with rebuilt Rangers at Ibrox in early September.\nPast glories will count for little as Rodgers strives to deliver another period of success.", "url": "https://www.bbc.com/sport/football/66340506"}