{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:27:18", "date_modify": "2025-05-19 15:27:18", "date_publish": "2017-07-24 10:00:38", "description": "UK Athletics confirms it is to start talks about hosting the 2019 World Para-athletics Championships at London Stadium.", "filename": "sport_disability-sport_40703217_1747668438.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5C5A/production/_97024632_gettyimages-816398070.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_disability-sport_40703217_1747668438.html", "title": "World Para-athletics Championships 2019 could be back in London", "title_page": "World Para-athletics Championships 2019 could be back in London - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "London could host the World Para-athletics Championships again in 2019 after UK Athletics confirmed it is to start talks about a repeat bid.\nThe 2017 event finished on Sunday, and numerous athletes have called for the event to stay at London Stadium.\n\"We will begin discussions with partner organisations immediately to see if we can secure the necessary support,\" said UK Athletics chairman Richard Bowker.\nHe added that he believed \"that there is the will to make it happen\".\nThere is a September deadline to submit bids to host the next Worlds to the International Paralympic Committee.\nMore than 230,000 people attended this year's championships - more than in all eight of the previous championships combined.\nEd Warner, co-chair of London 2017, recently said he would \"love it back here in two years' time\".\nBritish Paralympic Association chairman Nick Webborn said: \"The BPA looks forward to both supporting and engaging with UK Athletics throughout this process.\n\"If we were to succeed, it would be a tremendous statement to the world and a huge opportunity for our athletes and the British public once again to enjoy world class Para-athletics in the best stadium in the world for it.\"", "url": "https://www.bbc.com/sport/disability-sport/40703217"}