{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:33:27", "date_modify": "2025-05-19 15:33:27", "date_publish": "2017-07-03 15:46:55", "description": "Peter Sagan wins stage three of the Tour de France via a sprint finish as Britain's Geraint Thomas retains the yellow jersey.", "filename": "sport_cycling_40486209_1747668807.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/73F8/production/_96788692_sagan.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_cycling_40486209_1747668807.html", "title": "Tour de France 2017: Peter Sagan wins stage three as Geraint Thomas retains overall lead", "title_page": "Tour de France 2017: Peter Sagan wins stage three as Geraint Thomas retains overall lead - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "World champion Peter Sagan won an uphill sprint to claim stage three of the Tour de France as Britain's Geraint Thomas retained the yellow jersey.\nSagan showed remarkable composure and skill to clip his foot back into his pedal after it slipped out as he started his sprint in the final 300m.\nThe 27-year-old Slovak held on to beat Australia's Michael Matthews.\nThomas finished two seconds adrift, alongside defending champion Chris Froome and the other race favourites.\nThe Team Sky duo lead the overall standings with Welshman Thomas 12 seconds ahead of team leader Froome, who is chasing a fourth Tour win in five years.\n\"There were no crashes, which was good, but it was a really hectic final,\" said Thomas. \"I'm happy to get through unscathed.\"\nThe uphill drag to the finish seemed perfect for Bora-Hansgrohe rider Sagan. At only 1.6km long it was tough enough to remove the pure sprinters from contention but not long enough to give the climbing specialists an advantage.\nSagan is a rider who falls neatly between the two and although there were at least a dozen riders who could have won the stage, none have the swagger and poise of Sagan.\nHe hit the front about 500m from the line and looked nonchalantly over his shoulder at his rivals, who were on the limit, while he barely seemed to be pedalling.\n\"It was a strange finale,\" said Sagan. \"Richie Porte went hard in the last 700-800m. I tried to catch him but when I caught him I saw how much was left, 400m. I said 'no, it's too much', so I relaxed a bit before going again.\"\nHowever, when the effort came, it almost proved his undoing. His right foot slipped off the pedal and although he had clipped back in within a fraction of a second, the momentum seemed to be lost.\nBut he kept calm and powered to his eighth Tour stage win and, although Marcel Kittel retains the green jersey, Sagan's victory showed he is the most likely to win the points classification for a joint record sixth consecutive year.\nHe laughed off questions about the pressure of being the stage favourite, adding: \"At the end I did unclip, I don't know why. I was thinking 'what's going on?' I was unlucky but I managed to go again and I won. I'm delighted.\"\nAmerican Nathan Brown, who was in the day's main breakaway, picked up enough points over the first three of the day's five categorised climbs to take the polka dot King of the Mountains jersey off his Cannondale-Drapac team-mate Taylor Phinney.\nAnd Mark Cavendish showed his sprinting prowess by winning the intermediate sprint from the peloton to pick up some minor points in the green jersey race.\nBut the real racing began in the final 40km as teams jostled for position before the day's final climb.\nBelgian riders Philippe Gilbert and Greg van Avermaet had both picked today as a possible stage win, while the general classification riders were wary of losing any seconds to their rivals.\nVan Avermaet was the most animated on the ascent of Cote des Religieuses in Longwy but it was his BMC Racing team-mate Porte who made the first big move of the riders chasing the overall Tour win.\nAustralian Porte said his move was not premeditated but he realised \"about 500m out it was a bit far\" for him to reach the finish in front.\nSpain's Alberto Contador, a two-time Tour winner, also briefly threatened, while Froome and Thomas remained vigilant without becoming too prominent.\nIn the end, Sagan proved too strong and they will all start stage four with the same time gaps.\nTuesday's fourth stage is a 207.5km race from Mondorf-les-Bains to Vittel and it is expected to end in a bunch sprint finish.\nThere will be live text commentary of stage four on the BBC Sport website, with live radio commentary from 14:30 BST.\nStage three result:\n1. Peter Sagan (Svk/Bora) 5hrs 07mins 19 secs\n2. Michael Matthews (Aus/Team Sunweb) Same time\n3. Dan Martin (Ire/Quick-Step Floors)\n4. Greg van Avermaet (Bel/BMC Racing)\n5. Alberto Bettiol (Ita/Cannondale-Drapac) +02secs\n6. Arnaud Demare (Fra/FDJ) Same time\n7. Jakob Fuglsang (Den/Astana)\n8. Geraint Thomas (GB/Team Sky)\n9. Chris Froome (GB/Team Sky)\n10. Rafal Majka (Pol/ Bora)\nGeneral classification after stage three:\n1. Geraint Thomas (GB/Team Sky) 10hrs 00mins 31secs\n2. Chris Froome (GB/Team Sky) +12secs\n3. Michael Matthews (Aus/Team Sunweb) Same time\n4. Peter Sagan (Svk/Bora) +13secs\n5. Edvald Boasson Hagen (Nor/Dimension Data) +16secs\n6. Pierre Latour (Fra/AG2R) +25secs\n7. Philippe Gilbert (Bel/Quick-Step) +30secs\n8. Michal Kwiatkowski (Pol/Team Sky) +32secs\n9. Tim Wellens (Bel/Lotto) Same time\n10. Nikias Arndt (Ger/Team Sunweb) +34secs\nSelected others:\n18. Simon Yates (GB/Orica-Scott) +45secs\n20. Richie Porte (Aus/BMC Racing) +47secs\n21. Nairo Quintana (Col/Movistar) +48secs\n24. Romain Bardet (Fra/AG2R) +51secs\n26. Fabio Aru (Ita/Astana) +53secs\n27. Alberto Contador (Spa/Trek-Segafredo) +54secs\n29. Jakob Fuglsang (Den/Astana) Same time", "url": "https://www.bbc.com/sport/cycling/40486209"}