{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:20:35", "date_modify": "2025-05-20 12:20:35", "date_publish": "2023-08-04 22:47:02", "description": "Andy Murray's defeat to Taylor Fritz is interrupted by climate protesters at the Citi Open in Washington.", "filename": "sport_tennis_66411613_1747743635.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/11B4E/production/_130662527_ca323cca214780902339e97a4d991d6b6ef75eac.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_tennis_66411613_1747743635.html", "title": "Citi Open: Andy Murray's defeat to Taylor Fritz interrupted by climate protesters", "title_page": "Citi Open: Andy Murray's defeat to Taylor Fritz interrupted by climate protesters - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Andy Murray's last-16 defeat to top seed Taylor Fritz was interrupted by climate protesters at the Citi Open in Washington DC.\nPlay was halted for five minutes in the first set as three giant tennis balls were thrown on to the court.\nThe protesters were then escorted from the stands before play resumed.\nMurray, 36, came from a break down to take the first set on a tie-break but Fritz fought back to win 6-7 (2-7) 6-3 6-4.\nMurray was playing in his first tournament since his second-round loss to Stefanos Tsitsipas at Wimbledon.\nAmerican world number nine Fritz entered the tournament in good form after winning the Atlanta Open last week for his sixth ATP career title.\nMurray started their match slowly, smashing his racket after going a break down, but fought back to 5-5 before taking the first set on a tie-break.\nFritz gained the upper hand to take the second set, before Murray had a chance to break for 4-2 in the third.\nBut the American saved the break points, before breaking Murray's serve in the next game and going on to claim victory after three hours on court.\nIn total, Fritz saved eight of nine Murray break points, including three in the final set.\n\"I feel like when I'm down those break points, sometimes the opponent might feel some added pressure to it,\" said Fritz.\n\"It's been feeling great because that's not always the case, so I'm really happy with how I've been playing these big points.\"\nMurray reflected on a close contest but indicated it was a painful defeat.\n\"He's one of the better hard court players in the world. I certainly had my chances to win today. So that's a positive,\" Murray said.\n\"But obviously you want to be getting through those matches. They were matches I have been used to winning. So it's frustrating right now.\"\nWhile Murray headed out, British number two Dan Evans beat Russia's Alexander Shevchenko 6-4 6-3 to reach the quarter-finals.\nThis week has seen a return to form for ninth seed Evans, after the 33-year-old suffered defeats in his opening matches at Queen's Club, Wimbledon and the Atlanta Open.", "url": "https://www.bbc.com/sport/tennis/66411613"}