{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:13:14", "date_modify": "2025-05-20 12:13:14", "date_publish": "2023-08-05 00:00:00", "description": "Relive the first Saturday of the EFL season, with action from the Championship, League One and League Two.", "filename": "sport_live_football_65930751_1747743194.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4AE8/production/_130667191_79ab67349f02c492b441464e4e4b30317f0e49a2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_football_65930751_1747743194.html", "title": "EFL LIVE: Relive Championship, League One & League Two action on first Saturday of season", "title_page": "EFL LIVE: Relive Championship, League One & League Two action on first Saturday of season - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "That's a wrap\n#bbcefl\nThe first Saturday of the EFL season is in the books and what a Saturday it has been!\nEach of the three divisions saw at least one team win by four goals or more on a brilliantly entertaining day.\nWe've got match reports from all of the games going live on the website now - so stay with us to recap anything you may have missed.\nThe weekend action isn't over though, not by a long shot.\nWe've got three more Championship games for you tomorrow, starting with a Midlands derby between last season's beaten play-off finalists Coventry and relegated Leicester City at 12:00 BST.\nHope you can join us then and thanks for your company today!\nget involved\nGet Involved\nUse #bbcefl, text 81111 (UK only - standard message rates apply) or WhatsApp on 03301231826\nAnon: Obviously not the best start for Wrexham but there's a whole season ahead in which to learn how to play at this level. Remember Sutton and Forest Green were recipients of similar negative comments early in their first season and they're both doing OK for themselves. As for my team, Blackburn, after an awful and demoralising transfer window I can't help but think maybe we'll be back in League One next season. Who knows, we may play Wrexham opening game...\nA football fan being philosophical and not losing their mind on the opening day? Surely not?!\nJoy at Home Park\nPlymouth 3-1 Huddersfield\nBrent Pilnick\nBBC Sport at Home Park\nThe Home Park faithful aren't leaving yet as they loudly hail their heroes.\nThey've been through the mill today - joy at an early goal, nervousness as the first half wore on and possibly a bit of despair as Huddersfield deservedly equalised.\nBut having seen one of the finest goals at this ground for many a year before a third soon after, the Argyle faithful are going home happy.\nFULL-TIME\nBlackburn 2-1 West Brom\nDebut goals from Dilan Markanday and Harry Leonard are enough to see Blackburn through in a game of two halves.\nIt was all Rovers in the games opening 45 minutes and they knocked the Baggies for six with a pair of quick goals.\nThe visitors came out fighting in the second and got one back through Matthew Phillips but they couldn't find an equaliser and Rovers survive.\nFULL-TIME\nWatford 4-0 QPR\nA dream start to the new season for Watford and an absolute nightmare from QPR who are hammered 4-0 at Vicarage Road.\nThe Hornets fired in front just 30 seconds after kick-off through Tom Dele-Bashiru and from then the floodgates opened with Imran Louza, Matheus Martins and Vakoun Bayo all finding the net.\nBack to the drawing board doesn't seem to be enough for QPR after that showing. Penny for Gareth Ainsworth's thoughts right now.", "url": "https://www.bbc.com/sport/live/football/65930751"}