{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:10:02", "date_modify": "2025-05-19 15:10:02", "date_publish": "2017-07-04 19:57:58", "description": "Damian Barton's reign as Derry football boss appears to be over after the county's GAA board asks for nominations for the post.", "filename": "sport_gaelic-games_40501701_1747667402.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/DC39/production/_96177365_damianbarton.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_gaelic-games_40501701_1747667402.html", "title": "Damian Barton's Derry reign appears over as county board calls for nominations for post", "title_page": "Damian Barton's Derry reign appears over as county board calls for nominations for post - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Damian Barton's reign as Derry football manager appears to be over after the county's GAA board asked for nominations for the post.\nA Derry board statement said Barton had been appointed in September 2015 \"for an agreed period of two years\".\n\"We would like to sincerely thank Damian, his management and all players who have represented their county during this period,\" it read.\nThe statement added that nominations for the job would be sought from clubs.\nBarton had a creditable first year in charge of Derry as his side reached the Dr McKenna Cup Final and also narrowly missed out on qualifying for the All-Ireland quarter-finals after losing by a point to eventual semi-finalists Tipperary in the last qualifying round.\nHowever despite that promising opening season, Barton's squad was badly depleted this year by the withdrawal of several experienced campaigners.\nThe under-strength Oak Leafers suffered relegation to Division Three of the Football League on points difference and then were well beaten by Tyrone in their opening Ulster SFC game for the second successive season.\nWhile they regrouped to beat Waterford in the qualifiers, Saturday's extra-time defeat by Mayo saw Derry exiting from the championship.\nBarton side were leading the Castlebar game up until a minute from the end of normal time but despite a brave effort, Derry had nothing left in extra time as Mayo eventually won 2-21 to 1-13.", "url": "https://www.bbc.com/sport/gaelic-games/40501701"}