{"authors": ["Chris Jones", "www.facebook.com"], "date_download": "2025-05-21 04:34:25", "date_modify": "2025-05-21 04:34:25", "date_publish": "2025-01-23 17:31:24", "description": "Scottish Rugby's performance director David Nucifora is set for a shock role on the British and Irish Lions staff for the upcoming tour of his native Australia.", "filename": "sport_rugby-union_articles_c5yd7jxxdxqo_1747802065.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/88ff/live/da6773f0-d9ac-11ef-a6db-29ca006e3088.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c5yd7jxxdxqo_1747802065.html", "title": "David Nucifora: Scottish Rugby's performance director set for role with British and Irish Lions", "title_page": "David Nucifora: Scottish Rugby's performance director set for role with British and Irish Lions - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Scottish Rugby's performance director David Nucifora is set for a shock role on the British and Irish Lions staff for the upcoming tour of his native Australia.\nNucifora worked closely with Lions coach Andy Farrell during his 10 years at Ireland, a spell which yielded four men's Six Nations titles.\nHe left Irish Rugby at the end of the 2023-2024 season before joining the Scottish Rugby Union (SRU) last August.\nIt's understood Nucifora will fulfil a similar performance role with the Lions and will be seconded from the SRU to join Farrell's team.\nHis knowledge of Australian rugby, as well as the home nations, is considered to be a major asset as the Lions look to win a Test series for the first time in 12 years.\nAfter winning the Rugby World Cup with the Wallabies in 1991, Nucifora coached the ACT Brumbies to great success in the 2000s and was general manager of the Australian Rugby Union High Performance Unit from 2009.\nFarrell has yet to officially confirm any of his coaching appointments, although strength and conditioning guru Aled Walters, who joined Ireland from England in the summer, is almost certainly set to be involved.", "url": "https://www.bbc.com/sport/rugby-union/articles/c5yd7jxxdxqo"}