{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:34:02", "date_modify": "2025-05-20 12:34:02", "date_publish": "2023-08-04 08:18:39", "description": "Ealing sign United States captain Kate Zackary from Premiership Women's Rugby rivals Exeter for the 2023-24 season.", "filename": "sport_rugby-union_66403699_1747744442.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/FC98/production/_130646646_katezackerysaracenssemigetty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-union_66403699_1747744442.html", "title": "Kate Zackary: Ealing sign Exeter's United States captain for 2023-24 season", "title_page": "Kate Zackary: Ealing sign Exeter's United States captain for 2023-24 season - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ealing have signed United States captain Kate Zackary from Premiership Women's Rugby rivals Exeter.\nThe 34-year-old had been a cornerstone of the Chiefs side since they were founded in 2020, helping them reach the last two Premier 15s finals and winning the last two Allianz Cups.\nShe has captained the United States since 2018 and gone to two World Cups.\n\"I'm looking forward to a new adventure with Trailfinders in their debut season with PWR,\" she told the Ealing website.\n\"Not long ago I came across the pond to join a newly created Exeter Chiefs, and I've enjoyed three very successful seasons in the UK.\n\"This fourth season is going to be filled with a lot of opportunity for growth and development as individuals, a team, a club, and as a community.\"\nZackary displayed her versatility while at the Chiefs, switching from a back-row forward to playing at centre and scoring 41 tries in 59 appearances.\n\"Kate is an exceptional rugby player with vast amounts of unique experience,\" said Ealing director of women's rugby Giselle Mather.\n\"She has played in the Premiership and at international level at both eight and 13 as well as having a decorated career in the 7s format of the game.\n\"She causes chaos for defences wherever she plays and her outstanding leadership experience adds yet another dimension to the impact she will have at Trailfinders.\"\nZackary was one of Exeter's first signings when the club was formed, and their head coach Susie Appleby was quick to praise her former player.\n\"Kate is an unbelievable athlete and player,\" she told the Exeter website.\n\"Her pace, distribution skills and tenacity around the breakdown made her a threat that is impossible for teams to ignore.\n\"We'd like to wish Kate all the very best on her move, a huge congratulations as she prepares to marry her partner Mandy later this month, and an enormous thank you, for trusting and believing in our vision, and for making Exeter your home over the past three years.\"", "url": "https://www.bbc.com/sport/rugby-union/66403699"}