{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:24:48", "date_modify": "2025-05-21 07:24:48", "date_publish": "2025-01-13 17:43:07", "description": "Notts County sign Sunderland defender Zak Johnson on loan for the rest of the season and Everton midfielder Charlie Whitaker on a six-month contract.", "filename": "sport_football_articles_c4gxvx12lwpo_1747812288.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8ca0/live/52d75e20-d1d5-11ef-858a-3ffeee956fe5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c4gxvx12lwpo_1747812288.html", "title": "Notts County agree deals for Zak Johnson and Charlie Whitaker", "title_page": "Notts County agree deals for Zak Johnson and Charlie Whitaker - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Notts County have signed Sunderland defender Zak Johnson on loan for the remainder of the season and young Everton midfielder Charlie Whitaker on a six-month contract.\nJohnson came off the bench in the Black Cats' FA Cup third round defeat to Stoke City on Saturday, his fourth senior appearance for the club after progressing through the Academy of Light.\nWhitaker, who has been with the Toffees since the age of 12 after starting out at Blackburn Rovers, has scored seven goals in nine PL2 games this season and arrives on a free transfer.\nThey both join a Magpies team currently sixth in League Two, just two points off the automatic promotion spots, but having lost players to injury over the festive period, including defenders Lucas Ness and Lewis Macari.\nJohnson's development as a prospect on Wearside earned him a call-up to the England Under 18s squad in 2023, and he went on to captain the Three Lions to victory in a match against Australia.\n\"With Lucas likely to miss the remainder of the season and Lewis facing a prolonged spell on the sidelines, it was important for us to add another defender to the squad to ensure we have adequate depth for the run-in,\" County's director Richard Montague told the club's website, external.\n\"Charlie is another young, high-potential player who we've been monitoring for some time. While we think he's best suited to central attacking areas, he's versatile and comfortable playing out wide.\nHe added: \"Charlie has demonstrated a genuine goal threat throughout his youth career and has the technical ability, pace and tenacity to be a real handful.\"\nSunderland's academy manager, Robin Nicholls, said: \"Zak is at a stage in his career where he has gained some excellent experiences, with two senior loans and a youth international selection under his belt.\"", "url": "https://www.bbc.com/sport/football/articles/c4gxvx12lwpo"}