{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:28:20", "date_modify": "2025-05-20 13:28:20", "date_publish": "2023-07-25 10:07:20", "description": "Tributes to Chris Bart-Williams: 'To know him was to love him'", "filename": "sport_articles_cev8nl9k9ppo_1747747700.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3fcf/live/cad08a20-2ad1-11ee-ab7a-9325f82431ee.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cev8nl9k9ppo_1747747700.html", "title": "Tributes to Chris Bart-Williams: 'To know him was to love him'", "title_page": "Tributes to Chris Bart-Williams: 'To know him was to love him' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tributes from across football have poured in for former Nottingham Forest midfielder Chris Bart-Williams, who has died at the age of 49.\nFormer Sheffield Wednesday striker Mark Bright has described Bart-Williams as \"a wonderfully gifted player, with a huge personality, and a very charismatic guy\".\nHe added: \"To know him was to love him, sending love to his family, friends and former team-mates.\"\nKevin Pressman, former Wednesday keeper, said: \"Devastating day, to hear the news of Trevor Francis passing and my former team-mate Chris Bart Williams, both taken so soon, RIP Trevor and Chris.\"\nFormer Forest goalkeeper Mark Crossley posted on Twitter: \"I'm so upset to hear the news of Trevor Francis passing and my former team mate Chris Bart Williams, both so young, it is so sad , RIP Trevor and Chris.\"\nEx-England striker Darren Bent, who played with Bart-Williams at Charlton, said: \"RIP my former team-mate Chris Bart-Williams, thoughts and prayers go out to his family and friends.\"\nFormer Coventry and Liverpool striker David Speedie tweeted: \"Just when I thought the day couldn't get any worse, I've heard the devastating news Chris Bart-Williams has passed away. My thoughts go out to the family and friends of Chris at this difficult time. RIP Chris.\"\nFormer Chelsea captain John Terry tweeted: \"RIP Bart Man\"", "url": "https://www.bbc.com/sport/articles/cev8nl9k9ppo"}