{"authors": ["Mandeep Sanghera", "www.facebook.com"], "date_download": "2025-05-21 05:38:22", "date_modify": "2025-05-21 05:38:22", "date_publish": "2025-01-31 16:33:48", "description": "Liverpool: Slot prepared for 'big one' against Bournemouth", "filename": "sport_football_articles_cy8p41d36qdo_1747805902.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0fd1/live/dfdbfe60-dfeb-11ef-be6c-9f3ec92972af.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy8p41d36qdo_1747805902.html", "title": "Liverpool: Slot prepared for 'big one' against Bournemouth", "title_page": "Liverpool: Slot prepared for 'big one' against Bournemouth - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Liverpool boss Arne Slot saying the club wanted Mohamed Salah to extend his contract was one of the main points from his news conference earlier but there was also plenty more from him.\nThe Dutchman also mentioned that he talks to Trent Alexander-Arnold and Virgil van Dijk about their futures as they, along with Salah, are also out of contract in the summer.\nSlot called his side's game at Bournemouth on Saturday the \"big one\" and it's no surprise as it could be a pivotal weekend in the Premier League title race.\nThe Reds could extend their lead to nine points at the top-flight summit with a win on the south coast before second-placed Arsenal take on Manchester City on Sunday.\nHowever, Slot knows beating an \"outstanding\" and in-form Bournemouth will be a tough task, even if he had the luxury of resting most of his first-team regulars for the Champions League game at PSV Eindhoven in midweek.\nApart from analysing Andoni Iraola's side himself, Slot has also spoken to Richard Hughes about a side the Liverpool sporting director played a significant part in assembling before moving to the Anfield club last summer.\nOn the team news front, Joe Gomez, Diogo Jota and Darwin Nunez are back in training but Slot will have to decide if they are ready for the Bournemouth game.", "url": "https://www.bbc.com/sport/football/articles/cy8p41d36qdo"}