{"authors": ["Jonathan Jurejko", "www.facebook.com"], "date_download": "2025-05-21 07:46:07", "date_modify": "2025-05-21 07:46:07", "date_publish": "2025-01-22 08:16:06", "description": "A clear double bounce in the Australian Open quarter-final between Iga Swiatek and Emma Navarro restarts the debate over tennis' use of video technology.", "filename": "sport_tennis_articles_cr46z6dy3xwo_1747813567.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5bb6/live/5392b9f0-d89b-11ef-9567-af1f21102465.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_tennis_articles_cr46z6dy3xwo_1747813567.html", "title": "Australian Open 2025: Double bounce in Iga Swiatek's win over Emma Navarro reignites debate about video technology", "title_page": "Australian Open 2025: Double bounce in Iga Swiatek's win over Emma Navarro reignites debate about video technology - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A clear double bounce in the Australian Open quarter-final between Iga Swiatek and Emma Navarro has reignited the debate over how tennis uses video technology.\nNavarro lost a point when she trailed 6-1 2-2 A-40 despite the ball bouncing twice in front of a stretching Swiatek, who went on to win 6-1 6-2.\nBecause Navarro continued playing, instead of immediately stopping the point, the American eighth seed was unable to challenge the call.\nThe Australian Open has introduced a video review system for the first time this year - but it can only be used on a point ending call or when a player stops play.\nAfterwards Navarro said the incident did not \"cause a momentum swing\" but still believes there should be a change to the system.\n\"I think we should be able to see it afterwards,\" Navarro said.\n\"It happened so fast. In the back of your head you're like, 'OK maybe I can still win the point even though it wasn't called'.\n\"It's going to be a downer if I stop the point and it turns out it wasn't a double bounce.\n\"It's tough.\"\nFive-time Grand Slam champion Swiatek said she \"wasn't sure\" if it was a double bounce after it was suggested she should have conceded the point.\n\"It was hard to say because I was full sprinting. I don't remember even seeing the contact point,\" said the Polish second seed.\n\"I don't know. Sometimes you don't really look when you hit the ball.\n\"I thought this is like the umpire's kind of job to call it. I was also waiting for the VAR, but I didn't see it so I just proceeded.\"", "url": "https://www.bbc.com/sport/tennis/articles/cr46z6dy3xwo"}