{"authors": ["Elizabeth Botcherby", "www.facebook.com"], "date_download": "2025-04-26 07:40:04", "date_modify": "2025-04-26 07:40:04", "date_publish": "2025-02-27 12:52:55", "description": "Michael Vaughan criticises England's persistence with selecting out-and-out fast bowlers following their 2025 Champions Trophy exit.", "filename": "sport_cricket_articles_c2411v19v5vo_1745653204.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a546/live/3d8dd1f0-f509-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_cricket_articles_c2411v19v5vo_1745653204.html", "title": "Michael Vaughan criticises England's over-reliance on fast bowlers", "title_page": "Michael Vaughan criticises England's over-reliance on fast bowlers - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Michael Vaughan has questioned England's over-reliance on selecting out-and-out fast bowlers following their group-stage exit from the Champions Trophy.\nEngland bowed out of the tournament on Wednesday after losing their must-win clash with Afghanistan by eight runs.\nJos Buttler's side fielded three 90mph bowlers - Jofra Archer, Mark Wood and Jamie Overton - and just one frontline spinner (Adil Rashid) in their bowling attack, and watched as Afghanistan posted a match-winning total of 325-7 after conceding 113 runs in the final 10 overs, six of which were bowled by pace.\nEarlier in the tournament, a three-pronged pace attack of Wood, Archer and Brydon Carse leaked 226 runs from 26.3 overs as Australia chased 352 to complete a five-wicket win.\nHowever, it is far from a new problem for England, according to Vaughan, who criticised the team's management for taking \"their eye off white-ball cricket\" since winning the 2019 World Cup and 2022 T20 World Cup.\nEngland failed to defend either title and have been \"all over the place\" in terms of selection and tactics, according to the former captain, with their need for speed in the bowling attack at the heart of their struggles.\nSpeaking on the Today programme, Vaughan added: \"There's no left-arm seam bowlers, no left-arm spin, no left-handed batters [and] we just seem to be all out in terms of pace.\n\"I don't know who that person is who's made the decision that it's all about pace in white-ball cricket.\n\"If you ask most batters around the world, of course you don't want to face 90mph, but if there's a place where you'd love to face 90mph, it's in the sub-continent.\n\"England have hit both India and [teams] in the Champions Trophy with a huge amount of pace and batters have been deflecting the ball to all parts.\"\nReflecting on England's previous successes with fast-medium bowlers as opposed to out-and-out quicks, Vaughan continued: \"I'll just go back to the 2019 World Cup final. I know it's different conditions but Chris Woakes and Liam Plunkett got 6-79 [and] they bowl around 82-84 mph.\n\"Recently, England have been hell-bent on making sure they're looking for that 90mph bowler.\n\"The England Lions tour of Australia - a young chap, Sonny Baker, bowled nicely, he bowled 90mph. He's been given a central contract, or a contract that England can manage.\n\"There's a lad at Essex called Sam Cook. He's 27, he bowls 82mph, he's got 311 wickets in county cricket at an average of 19. He was the pick of the bowlers on the Lions tour and he hasn't got that contract.\n\"It's a clear decision by the England management that it's all about pace.\n\"In the time I've been watching cricket, playing cricket, and involved in English cricket, Stuart Broad and Jimmy Anderson have been our best two bowlers. They don't bowl at 90mph.\"", "url": "https://www.bbc.co.uk/sport/cricket/articles/c2411v19v5vo"}