{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:48:03", "date_modify": "2025-05-21 03:48:03", "date_publish": "2025-04-07 16:25:16", "description": "Chelsea news: Fan views on Enzo Maresca's team rotation against Brentford", "filename": "sport_football_articles_cy70xk445lzo_1747799283.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy70xk445lzo_1747799283.html", "title": "Chelsea news: Fan views on Enzo Maresca's team rotation against Brentford", "title_page": "Chelsea news: Fan views on Enzo Maresca's team rotation against Brentford - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your views on Enzo Maresca rotating his Chelsea starting XI for Sunday's 0-0 draw at Brentford.\nHere are some of your comments:\nNick: Maresca said he wanted to \"start the game one way and finish another\". Fair enough after a tiring game only three days earlier. But surely that should have meant starting with the strongest XI, to try to get a goal or two ahead, and then finishing with the back-up players to manage the rest of the game.\nHugh: No he was not right! If you have injuries or a player is out of form, then yes you have to make changes. But that performance v Spurs was a move in the right direction - so he changes the team and destroys the momentum! Surely he can see that!\nFreddie: Jackson and Palmer have been out for weeks, we can't expect them to start two games in three days straight away. It is unfortunate we don't have a decent second striker (Guiu would have done lots better than Nkunku I'm sure) but we didn't concede and others dropped points. A bit of a limp end to the season but if we get fifth then we can go again after the Club World Cup.\nJohn: I love all these fans who think you can play your best team every game regardless of upcoming fixtures or players fitness and recovery levels. Enzo was quite right to rotate and look towards future games. There is no way it would have made sense to start Palmer and Jackson, both coming back from injuries. Assuming we need them for Ipswich, they can't manage three games in such a short time.\nRafael: Ridiculous choice. We all knew that this game was finished before it started once we saw the line-up. I'm surprised we left with a point. If you want to manage your best players minutes, start them to set the tempo and hopefully be up by half-time so that you can take them off in the second half. This is yet another example of Maresca throwing points away in must-win matches with a terrible line-up.\nChris: Surely the time to rotate is when we have secured a Champions League spot for next season, not now! Again, Maresca shows his lack of experience at this level.", "url": "https://www.bbc.com/sport/football/articles/cy70xk445lzo"}