{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 08:13:36", "date_modify": "2025-04-26 08:13:36", "date_publish": "2025-02-26 11:22:29", "description": "Australia left-arm spinner Matt Kuhnemann has his bowling action cleared, leaving him free to continue bowling.", "filename": "sport_cricket_articles_c4gdxy723ego_1745655216.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d951/live/9c567a70-f432-11ef-8241-abbb923a0925.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_cricket_articles_c4gdxy723ego_1745655216.html", "title": "Matt Kuhnemann: Australia spinner has bowling action cleared", "title_page": "Matt Kuhnemann: Australia spinner has bowling action cleared  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Australia left-arm spinner Matt Kuhnemann has had his bowling action cleared by the International Cricket Council (ICC).\nThe 28-year-old, who has played nine times for Australia, was reported for a suspect action during the second Test against Sri Lanka in Galle earlier this month.\nSubsequent independent testing has shown the bend in his elbow falls within the permitted 15 degrees, leaving him free to continue bowling.\n\"It was a disappointing way to finish what was such a successful Test series for Australia,\" Kuhnemann said in a statement on Thursday.\n\"I've never doubted my bowling action throughout my career and I'm always looking to improve the art of spin bowling in different conditions.\n\"I appreciated the professional manner in which testing was explained to me and then conducted.\"\nCricket Australia executive general manager Ben Oliver said: \"We are pleased for Matt that this matter is now resolved.\n\"It has been a challenging period for Matt. However, he has carried himself exceptionally well.\n\"He has had the full support of Australian cricket and he can now move forward to the next phase of his international career with great confidence.\"\nKuhnemann took 16 wickets in the two-Test series against Sri Lanka and has 25 in five Tests. He has also played four one-day internationals.", "url": "https://www.bbc.co.uk/sport/cricket/articles/c4gdxy723ego"}