{"authors": ["Ray Hunt", "www.facebook.com"], "date_download": "2025-04-26 07:56:15", "date_modify": "2025-04-26 07:56:15", "date_publish": "2025-02-25 12:23:45", "description": "Southampton news: Opinion - Aaron Ramsdale 'only player showing fight'", "filename": "sport_football_articles_c5y4w2exqg3o_1745654175.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/57d7/live/2bcb00b0-b62a-11ee-8f07-bbfdfa890097.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c5y4w2exqg3o_1745654175.html", "title": "Aaron Ramsdale 'only player showing fight'", "title_page": "Southampton news: Opinion -  Aaron Ramsdale 'only player showing fight' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Another week goes by, and another embarrassing defeat to report. This time, an even heavier thumping. A 4-0 home loss to Brighton & Hove Albion.\nThat now makes eight consecutive home defeats. Only the fourth Premier League team in history with that unwanted feat.\nWe are continuing to leak goals at an alarming rate. In six of those eight losses, we have conceded at least three goals - making it a grand total now of 14 times we have let in three or more in a game.\nIt is going from bad to worse and it appears lessons are not being learned. There is no sign of fight, and not a clue at any identity we are trying to achieve.#\nAnd yet, despite the misery, there is still one playing who is going above and beyond right now: Aaron Ramsdale. By far the best thing to come from this season.\nIt seems absurd that the goalkeeper is still your best-performing player in a match in which you concede four times. That's just how bad things are right now.\nDuring the Brighton defeat, Ramsdale made eight brilliant saves. Without his heroics this game could have easily been eight or nine.\nIn last week's encounter with Bournemouth, he once again stood out as the best of a bad bunch, stopping four of the seven shots faced - even one from his own defence.\nAs a team, we are letting him down. If only the rest of the team had his fight.\nHe deserves much better than us and he will have his pick of Premier League teams next season.\nHopefully it reignites his England chances.", "url": "https://www.bbc.co.uk/sport/football/articles/c5y4w2exqg3o"}