{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 08:13:31", "date_modify": "2025-04-26 08:13:31", "date_publish": "2025-02-26 11:23:46", "description": "Brighton podcast: Joao Pedro on victory over Bournemouth", "filename": "sport_football_articles_c1lpv9zz1eyo_1745655211.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4ec4/live/0c530670-f430-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c1lpv9zz1eyo_1745655211.html", "title": "Brighton podcast: Joao Pedro on victory over Bournemouth", "title_page": "Brighton podcast: Joao Pedro on victory over Bournemouth - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Brighton striker Joao Pedro says all of his Brighton teammates \"did a great job\" in Tuesday's win against Bournemouth, but they are unable to relax with 11 league games left and the FA Cup still to play for.\nSpeaking after the victory the Brazil forward said: \"We knew Bournemouth are a physical team - they have done very good this season. We knew we had to improve to win the second ball and everyone did a great job.\n\"You need to adapt game by game. Sometimes you play against teams who keep the ball but [Bournemouth] run and fight a lot - so you need to adapt.\"\nPedro's penalty gave the Seagulls an early lead and he praised his team-mates' role in allowing him to focus: \"The team give me a lot of confidence. I don't think around I just focus on what I have to do.\"\nBrighton travel to St James' Park on Sunday to face Newcastle in the FA Cup, and after winning there earlier in the season, Albion will be hoping for a similar result.\n\"We need to keep our heads and focus game by game. If we relax a little, everyone knows what happens in the Premier League so we need to prepare ourselves for the FA Cup and then move forward,\" Pedro added.\n\"The gaffer wants a lot from the FA Cup so we need to do well in it and the league as well.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c1lpv9zz1eyo"}