{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-05-21 06:22:25", "date_modify": "2025-05-21 06:22:25", "date_publish": "2025-03-31 14:24:27", "description": "Man Utd news: Ruben Amorim 'looking up' for remaining Premier League games", "filename": "sport_football_articles_c985yylzxw7o_1747808545.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/74d4/live/8d652d90-0e31-11f0-bc60-b5161e746446.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c985yylzxw7o_1747808545.html", "title": "Man Utd news: Ruben Amorim 'looking up' for remaining Premier League games", "title_page": "Man Utd news: Ruben Amorim 'looking up' for remaining Premier League games - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "In this season of turmoil at Manchester United, there has been a sense of unrelenting gloom around Old Trafford.\nAny positive performances have immediately been followed by negative ones. Good news has been followed by bad, and the shroud of off-field issues has hung heavily over the club.\nBut there were chinks of light emerging just before the international break.\nA four-match unbeaten run included a draw with Arsenal and defeat of Real Sociedad in the Europa League. Then on Friday, we had sight of Harry Maguire, Leny Yoro and Luke Shaw on the training ground.\nTuesday's trip to high-flying Nottingham Forest is a test of United's development and what their realistic aims are for the remainder of the campaign.\nUnited are 13th, seven points off Bournemouth and a place in the top half of the table.\nHead coach Ruben Amorim says his side are \"looking up\". In this weird season, where the Premier League could somehow claim 11 European berths, that is worthwhile.\nOne senses the outcome against Forest will provide energy to those claims, or condemn them to a more sobering reality and remind Amorim of just how much work is ahead of him.", "url": "https://www.bbc.com/sport/football/articles/c985yylzxw7o"}