{"authors": ["Alex Howell", "www.facebook.com"], "date_download": "2025-05-20 13:35:15", "date_modify": "2025-05-20 13:35:15", "date_publish": "2023-08-01 17:12:44", "description": "Chelsea boss Mauricio Pochettino says new signing Lesley Ugochukwu may still leave on loan after joining for £23m from Rennes.", "filename": "sport_football_66378341_1747748115.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/133EC/production/_130582887_gettyimages-1247290124.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66378341_1747748115.html", "title": "Lesley Ugochukwu: Chelsea sign Rennes midfielder on seven-year deal", "title_page": "Lesley Ugochukwu: Chelsea sign Rennes midfielder on seven-year deal - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manager Mauricio Pochettino says new signing Lesley Ugochukwu may go on loan after the midfielder joined Chelsea for 27m euros (£23.2m) from Rennes.\nUgochukwu has signed a seven-year deal but Pochettino has not yet decided the Frenchman's immediate future.\nThe 19-year-old has made 47 Ligue 1 appearances for Rennes and has also featured in the Europa League.\n\"We need to assess him when he starts training today and then in London after the tour,\" said Pochettino.\n\"He's a young, talented player. Now is the time to assess him until the end of the transfer window and see if he is going to be with us or maybe it can be a possibility to loan him.\"\nUgochukwu, whose deal has the option of another year, is yet to make his senior debut for France but has played for Les Bleus at under-17, under-18 and under-19 levels.\nHe could return to Ligue 1 for next season because the Blues' ownership group purchased a majority stake in Alsace club Strasbourg in June.\nChelsea have been pursuing Brighton midfielder Moises Caicedo throughout the transfer window - with a £80m bid rejected last week - and Pochettino has been calling for more experienced players to add to his squad.\nChelsea have a strategy of signing young talent with the potential to be future stars while clearing out their bloated squad following a £600m spend in the past two transfer windows.\nKai Havertz, Mateo Kovacic and Mason Mount have all departed this summer for Arsenal, Manchester City and Manchester United respectively, while N'Golo Kante, Kalidou Koulibaly and Edouard Mendy have moved to the Saudi Pro League.\nRuben Loftus-Cheek and Christian Pulisic both made the switch to Italian club AC Milan, while Conor Gallagher has been the subject of a £40m offer from West Ham United.\nChelsea have already added attackers Christopher Nkunku and Nicolas Jackson to their squad as well as Brazilian youngster Angelo Gabriel.\nUgochukwu will be the only new player to join up with the 29-man squad that is travelling in the US, but Pochettino is happy with the Blues' summer recruitment so far.\n\"No, I am not disappointed because when we joined we knew we would find this situation,\" the Argentine added.\n\"I am happy in the way the club is working. Of course, we are working hard to try to finish the squad as soon as possible.\n\"We all know in the last few weeks of the transfer window maybe some things are going to happen. Always it is better to have everything closed before - not only us, for different clubs also.\"", "url": "https://www.bbc.com/sport/football/66378341"}