{"authors": ["Shamoon Hafez", "www.facebook.com"], "date_download": "2025-04-26 04:34:39", "date_modify": "2025-04-26 04:34:39", "date_publish": "2025-02-28 12:56:12", "description": "FA Cup matches that take place during Ramadan will briefly pause to allow Muslim players to break their fast.", "filename": "sport_football_articles_crknng7307zo_1745642079.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e378/live/1635cc60-f5cd-11ef-85ee-0589f92b739a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_crknng7307zo_1745642079.html", "title": "FA Cup: Matches to pause for fasting Muslim players during Ramadan", "title_page": "FA Cup: Matches to pause for fasting Muslim players during Ramadan - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "FA Cup matches that take place during Ramadan will briefly pause to allow Muslim players to break their fast.\nThe Islamic holy month begins this weekend, with Manchester City's game against Plymouth on Saturday and Manchester United's match against Fulham the ties that could be affected.\nMuslims around the world will be fasting, meaning they abstain from consuming any food or drink during daylight hours.\nThe Football Association's fifth-round fact sheet states: \"Players observing Ramadan will be permitted a short pause in play to break their fast.\n\"An approximate time will be agreed when the pause will take place, and it will not be used as a team drinks break or tactical time-out.\"\nCity's game kicks-off at 17:45 GMT, with sunset taking place at 17:47, while United's game is a 16:30 kick-off the following day and the sun setting at 17:49.\nMuslim players that may be in action include City pair Omar Marmoush and Abdukodir Khuzanov, United defender Noussair Mazraoui and Fulham winger Adama Traore, while Plymouth manager Miron Muslic is also a Muslim.\nThe Premier League have issued similar directives during Ramadan in recent years, with players breaking their fast during a natural stoppage in play, such as a goal-kick, free-kick or throw-in.\nRamadan will take place from 1 to 30 March this year.\nThe FA Cup quarter-finals will take place on the weekend of 29 and 30 March.", "url": "https://www.bbc.co.uk/sport/football/articles/crknng7307zo"}