{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:42:17", "date_modify": "2025-05-21 07:42:17", "date_publish": "2025-03-28 10:34:33", "description": "Norwich City boss Johannes Hoff Thorup insists his side still believe they can make the Championship play-offs.", "filename": "sport_football_articles_c2kgkgd7ylqo_1747813337.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b802/live/ad20ab20-0bb9-11f0-9ca8-c5035ea95420.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c2kgkgd7ylqo_1747813337.html", "title": "Johannes Hoff Thorup: Norwich City boss believes play-offs still in reach", "title_page": "Johannes Hoff Thorup: Norwich City boss believes play-offs still in reach - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Norwich City boss Johannes Hoff Thorup insists his side still believe they can make the Championship play-offs despite failing to win any of their past four games.\nThe Canaries, who were beaten in the play-offs by Leeds United last term, are 13th in the table, eight points adrift of sixth-placed West Bromwich Albion, who they face at Carrow Road on Saturday.\nThey have eight games left to play and Opta's latest predicted final positions gives them only a 1% chance of finishing sixth.\n\"We know it's going to be difficult and we are probably not favourites to reach the play-offs at the moment, but many things can change - and they can change fast,\" Thorup told BBC Radio Norfolk.\n\"We are talking about a couple of wins in a row and then the picture can be completely different again. As long as there's a chance, we definitely have to fight for it and Saturday is probably not the worst time to start.\"\nAsked whether any of his players needed convincing it was still possible, the Dane replied: \"Some were talking about 'do we need six wins, seven wins, how many wins do we need to get up there?', so I don't have to convince them that we are fighting to the end.\n\"They are 100% thinking about it, 100% looking at how much we need and, based on that conversation, I don't think I have to do too much.\"\nThe Opta statistics predict that Norwich - who will have Scotland goalkeeper Angus Gunn back against West Brom - are most likely to finish 12th or 13th.\nNorwich were beaten by Sheffield Wednesday and Bristol City immediately before the international break, having previously drawn with Blackburn and Oxford United.\nFollowing the West Brom game, they face Plymouth (a), Sunderland (h), Burnley (a), Portsmouth (h), Millwall (a), Middlesbrough (a) and Cardiff (h).\nFour of those teams are above them in the table, with Sunderland and Burnley currently fourth and third - and the latter still pushing for automatic promotion.\n\"That's the best way, to have a schedule where we can really affect it now,\" said Thorup.\n\"We can really affect it by making sure we perform at a good level and making sure we get the results we want.\n\"We have had a couple of home games where we haven't been at our best - or when we have it's only been for half of it, or at least not the whole game - so we owe the fans a good experience.\"\nThorup travelled to the United States during the international break to spend time with majority shareholder Mark Attanasio.\nHe added: \"We discussed everything from strategy to player development, from how we do things now to how we should do them in the future, and (it was useful) also just to get some inspiration from each other and get a feeling of where we are as a team.\n\"We refer to a team - the USA team and the British team over here - because we do things together. It was a good way of just aligning everything.\n\"What I'm happy about with Mark, and also his son Mike, is just their understanding of what it takes to develop something. They have huge experience of doing that with the baseball franchise [the Milwaukee Brewers] they own, and have built a baseball club that is up there competing with the best.\"", "url": "https://www.bbc.com/sport/football/articles/c2kgkgd7ylqo"}