{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:50:59", "date_modify": "2025-05-20 12:50:59", "date_publish": "2023-08-05 00:00:00", "description": "Reaction and analysis after Wales beat England in a World Cup warm-up match at the Principality Stadium.", "filename": "sport_live_rugby-union_66376659_1747745459.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_rugby-union_66376659_1747745459.html", "title": "Reaction as Wales beat England 20-9 in Rugby World Cup warm-up", "title_page": "Reaction as Wales beat England 20-9 in Rugby World Cup warm-up - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Thank you and goodbye\nFT: Wales 20-9 England\nWell that was interesting.\nWarren Gatland was understandably beaming after that result and performance.\nThere were a few big displays from individuals - Jac Morgan, George North and Aaron Wainwright - and they were clinical with their chances.\nHowever it was their overall dominance in the second half which was most impressive.\nEngland, in contrast, could not go the distance. They should have been further ahead in the first half but conceded a shocking 22 turnovers.\nIt could make Steve Borthwick's life a little easier when it comes to picking his final 33 players for the World Cup on Monday.\nIt certainly sets things up nicely for the return match next Saturday in Twickenham.\nHope you'll join us again then.\n'You can't coach experience'\nFT: Wales 20-9 England\nWarren Gatland told Amazon Prime: \"I was a little bit apprehensive this morning as I wasn't quite sure how things were going to go. I know the players have been working hard and I was looking for a performance and it was a good start today.\n\"[Winning] wasn't important at all, it was the performance I was more interested in and I thought those guys out there gave us a performance, some really good individuals and I thought the last 20 minutes we just looked comfortable.\n\"I thought Aaron Wainwright was excellent, Jac Morgan was excellent, I thought our two second rows were outstanding. Scrums were a bit messy we need a bit more clarification around that and I thought young Sam Costellow grew into the game and he'll learn from that experience and the new caps were great. One of the things about test match rugby is you can't coach experience.\"\nBorthwick positive in defeat\nFT: Wales 20-9 England\nEngland head coach Steve Borthwick told Amazon Prime: \"In the first half we created lots of opportunities, we turned over too much ball in the opposition 22, we can't do that in Test rugby.\n\"Immediately there are some areas for improvement, but the positives were how many entries we got into the opposition's scoring zone.\n\"Credit to Wales in that 50-65 minute period, they were very, very good.\n\"Every one of these experiences will be positive for us as we build over the next few weeks to the World Cup.\"\n'It's been a special week'\nFT: Wales 20-9 England\nWales full-back Leigh Halfpenny told Amazon Prime: \"Whole thanks to the players, the staff, it's been absolutely outstanding all week and made it a really special occasion, I can't thank them enough.\n\"A special mention to the lads winning their first caps, a proud day for them and I'm delighted to get the win.\n\"It's beyond my wildest dreams [to get 100 caps].\n\"The dream as a kid was to play for Wales. I dreamed of getting one cap let alone 100. It hasn't quite sunk in to be honest, it's pretty surreal.\n\"It's been a bit of journey but so many people to thank but couldn't thank them all.\"\n'Full credit to the boys'\nFT: Wales 20-9 England\nWales captain Jac Morgan told Amazon Prime: \"It was a great day, a great game, we really dug in deep, especially after the training we've had over the last couple of weeks.\n\"It's nice to get on the field, perform and get that result.\n\"We knew if we worked hard and stuck together and stuck to what we've been talking about we'd get the result.\n\"We take a lot of credit in our defence, Mike Forshaw works us hard to be aggressive and I thought we did that today and managed to get the ball back from a few turnovers.\n\"We went in at half-time knowing that we had a bit more in us to be more aggressive defensively in that second half.\n\"It's been an honour to be able to captain the side, but there are a lot of leaders in that team and there's another game next week so we'll see how that goes.\"\n'Chastening for England'\nFT: Wales 20-9 England\nChris Jones\nBBC rugby union correspondent at Principality Stadium\nHaving experimented with selection, Wales boss Warren Gatland will be thoroughly satisfied with this performance and result, with the likes of Aaron Wainwright and Jac Morgan both looking the part in the back row and the bench making an impact.\nBut this was a chastening evening for England, and while Steve Borthwick says he knew the majority of his squad ahead of today’s game, this will have given him much to ponder.\nMuch like in the Six Nations, England dropped off a cliff in the second half and made a dozen entries into the 22 without managing a try.\nBut it’s early days, and by naming his final squad so early Borthwick will have a full month to build cohesion and combinations ahead of the World Cup.\nEngland ran out of ideas\nFT: Wales 20-9 England\nNicky Robinson\nFormer Wales international on BBC Radio Cymru\nEngland had no idea how to break Wales down, they tried kicking the ball but Wales were good in the air.\nWales had problems but you can't have a perfect game and they stopped England time and time again.\nIn attack the precision in Wales' play, not much possession but when they made breaks they scored and England couldn't score in the first half. Wales have to be pleased with that performance.", "url": "https://www.bbc.com/sport/live/rugby-union/66376659"}