{"authors": ["Jonty Colman", "www.facebook.com"], "date_download": "2025-05-20 14:44:43", "date_modify": "2025-05-20 14:44:43", "date_publish": "2023-07-27 19:04:17", "description": "All the drama and excitement from the opening day of the fifth Ashes Test at The Oval in digest format.", "filename": "sport_cricket_66326119_1747752283.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/43CB/production/_130555371_f273e3fad92b83da250bf68c39a33e4abb4baa8e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66326119_1747752283.html", "title": "Ashes digest: Steve Smith sets catching record and Mitchell Starc stuns Ben Stokes", "title_page": "Ashes digest: Steve Smith sets catching record and Mitchell Starc stuns Ben Stokes - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It was a hectic first day of the final Ashes Test at The Oval as England look to draw the series.\nPut in to bat by Australia, England made a typically quickfire 283, helped by Harry Brook's highest score of the series (85).\nIn reply, Australia ended the day on 61-1.\nHere are some of the key takeaways.\nIn a spell where England lost three wickets for just 11 runs midway through the morning session, falling from 62-0 to 73-3, Australia batter Steve Smith put himself in the Ashes history books when his catch off Pat Cummins' bowling removed England opener Zak Crawley for 22.\nSmith's catch in the slips was his 55th in Ashes Tests by a fielder, putting him top of the all-time list - one clear of former England all-rounder Sir Ian Botham. Smith went on to take his 56th later in the day to remove Brook on 85.\nIn what is likely to be Smith's final Ashes series in England, he has set a record that will take some beating, especially with England batter Joe Root being his nearest rival on 36, 20 behind Smith's tally.\n\"He's a real talent, he's right up there. Pietersen, for me, was England's best in the middle of the innings against all of the quality bowlers around the world. At times, they got him as well, but he dealt with them, and I'm looking at Harry Brook in a similar kind of way.\"\nThere was high praise on Test Match Special from England's 2005 Ashes-winning captain Michael Vaughan for his fellow Yorkshireman Brook.\nVaughan compared the right-hander to Kevin Pietersen because of Brook's ability to transfer pressure back onto the world's best bowlers.\nRead Vaughan's full reflection - and find out about Brook's mid-Ashes holiday to Ibiza - here.", "url": "https://www.bbc.com/sport/cricket/66326119"}