{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:50:28", "date_modify": "2025-05-21 07:50:28", "date_publish": "2025-01-30 20:42:13", "description": "Crystal Palace sign Jamaica defender Allyson Swaby from AC Milan, plus Chelsea defender Aniek Nouwen on loan.", "filename": "sport_football_articles_c4g343jzlq7o_1747813828.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3a8c/live/1ccf6d10-df48-11ef-a966-f7e4eae5fb03.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c4g343jzlq7o_1747813828.html", "title": "Allyson Swaby: Crystal Palace sign Jamaica defender from AC Milan before WSL transfer deadline", "title_page": "Allyson Swaby: Crystal Palace sign Jamaica defender from AC Milan before WSL transfer deadline - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Crystal Palace have signed Jamaica defender Allyson Swaby from Italian club AC Milan for an undisclosed fee.\nSwaby, 28, has played top-flight football in the United States and Italy and has committed to a two-and-a-half-year deal with Palace.\nPalace have also signed Chelsea defender Aniek Nouwen on loan for the remainder of the season.\nDefender Nouwen, 25, will be looking to return to football with the Eagles after recovering from an anterior cruciate ligament (ACL) injury which she sustained in late 2023.\nSwaby is the third permanent signing of the January window for Palace, following the arrivals of Canada forward Clarissa Larisey and Finland midfielder Ria Oling.\nSwaby's sister, Chantelle, plays as a midfielder for fellow Women's Super League side Leicester City.\nLaura Kaminski, the Palace manager, described the Jamaican as an \"excellent\" signing who would provide \"experience, leadership and real defensive quality\".\nThe Eagles, who were promoted as winners of the Championship last season, are bottom of the WSL and four points adrift of safety.\nKaminski added of Swaby, who has featured for her country at two World Cups: \"She's played at the highest level in both club and international football, and we're excited to see the impact she'll have here at Palace.\"", "url": "https://www.bbc.com/sport/football/articles/c4g343jzlq7o"}