{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:05:35", "date_modify": "2025-05-20 12:05:35", "date_publish": "2023-08-05 00:00:00", "description": "Relive the drama as Glentoran score late to edge Glenavon while newly promoted Loughgall ease to a 3-0 victory over Newry City.", "filename": "sport_live_football_66373198_1747742735.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_football_66373198_1747742735.html", "title": "Glentoran and Loughgall start with wins - as it happened", "title_page": "Glentoran and Loughgall start with wins - as it happened - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Bye for now\nGlentoran left it late - very late - to clinched a last-gasp victory over Glenavon to get their Premiership campaign off to a winning start.\nLoughgall produced the performance of the day as the the league newboys put three goals past Newry City at the Shopwgrounds.\nThat's all from us for now - thanks for your company.\nFULL-TIME\nGlenavon 0-1 Glentoran\nIt's all over after that late, late drama.\nJay Donnelly nips in from close range to stab home Shay McCartan's cross from the right wing in the ninth minute of added time.\nThe Glens goal finally arrived and they claim all three points to give Warren Feeney a winning league start as Glentoran manager.\nCLOSE!\nNewry City 0-3 Loughgall\nSubstitute Caolan McAleer paces down the right wing and into the box but the alert Barney McKeown blocks his resulting strike.\nThe away side now have a corner - can they make it count?\nSUBSTITUTIONS\nNewry City 0-3 Loughgall\nBoth teams are struggling to create chances here and as a result the managers have been substutions.\nThe away side have introduced Caolan McAleer and Robbie Norton for Alberto Balde and Andrew Hoey.\nMeanwhile, Gary Boyle brings on Adam Salley and Daniel Hughes for Lee Newell and Brian Healy.\n'Backs-to-the-wall stuff for Glenavon'\nGlenavon 0-0 Glentoran\nLiam Beckett\nSportsound summariser\nThat's the first real time it's been backs-to-the-wall stuff for Glenavon. Glentoran have upped the ante.\nIt's take a deep breath time for Gary Hamilton's team. It they come away with a draw it will be a very valubale point for them.\nHITS THE WOODWORK\nGlenavon 0-0 Glentoran\nJunior hits the right post for Glentoran!\nIt was a golden opportunity for the striker to open the scoring for the Belfast side - he was played in down the left wing by Niall McGinn but he couldn't guide his effort goalbound.\nFrustration for Glentoran and their travelling support.", "url": "https://www.bbc.com/sport/live/football/66373198"}