{"authors": ["Tyrese King", "www.facebook.com"], "date_download": "2025-05-21 06:26:27", "date_modify": "2025-05-21 06:26:27", "date_publish": "2025-04-01 09:59:50", "description": "Eddie Howe press conference: Newcastle vs Brentford preview", "filename": "sport_football_articles_c5yp3lzv1geo_1747808787.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3e34/live/3814b960-4923-11ef-9e1c-3b4a473456a6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c5yp3lzv1geo_1747808787.html", "title": "Eddie Howe press conference: Newcastle vs Brentford preview", "title_page": "Eddie Howe press conference: Newcastle vs Brentford preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "On how the international break impacted match preparations: \"We tried to do a lot of work in between. We trained really hard in Dubai and now that the group is back together we have tried to focus on the future, the next game.\"\nHowe reflecting on Carabao Cup win: \"The Liverpool game was a great performance, but we want to be consistent with our performances.\"\nOn the open-top bus parade: \"An amazing day - still some vivid memories of it. A massive thank you to everybody who turned up - as it was cold! Not everyone could get to Wembley and we know football is expensive to either to travel or to buy tickets for games. It shows the power football possesses. It can change people's mood, can change the city's mood, and I just think it was a great day for everyone connected in Newcastle.\"\nHowe said defender Sven Botman is \"not too bad\" after a minor knee operation and is expected back in May.\nWinger Anthony Gordon is now \"up and running\" after pulling out of the England squad with \"bruising on his thigh\" and is expected to be back training with the group within the next few days.\nHowe \"does not know\" whether Jamal Lascelles will return before the end of the season but the defender has started to take \"very small steps\" in light training.\nThe Magpies boss expects centre-back Fabian Schar to sign a new contract \"immediately if he hasn't already\".\nOn Brentford: \"We played them in the Carabao Cup so we know their strengths. Thomas [Frank] has done an incredible job. They are very good at set-plays, and their away form has really turned around. They are a really high-scoring team as well, so it should be a good game.\"\nOn Newcastle's ambitions for Champions League qualification: \"There is no doubting the power of Champions League football. It can be game-changing in terms of revenue - the competition itself and the changes you have to make to be ready for the competition, as we found out to our cost to some degree last year.\"\nHe added: \"Qualifying for that is going to be very difficult. There are 10 games left and a lot of teams are playing for those places. It's one of the tightest Premier Leagues we have seen a while, with not a lot separating us.\"", "url": "https://www.bbc.com/sport/football/articles/c5yp3lzv1geo"}