{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:20:03", "date_modify": "2025-04-26 04:20:03", "date_publish": "2025-03-03 16:01:18", "description": "Saracens sign tighthead prop Marcus Street from Exeter Chiefs in a deal which will start at the end of the season.", "filename": "sport_rugby-union_articles_cewkdqqxpj9o_1745641203.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/731d/live/91a54740-f843-11ef-b5bf-275f2ed479cc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_cewkdqqxpj9o_1745641203.html", "title": "Marcus Street: Saracens sign Exeter Chiefs prop for next season", "title_page": "Marcus Street: Saracens sign Exeter Chiefs prop for next season - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Saracens have signed tighthead prop Marcus Street from Exeter Chiefs in a deal which will start at the end of the season.\nThe 26-year-old, who has made 99 appearances for the Chiefs, has signed a multi-year contract with Sarries.\n\"I am excited for this move and to get started at Saracens,\" Street told Saracens' official club website., external\n\"I am looking forward to learning new skills and developing my game at this great club.\"\nDuring an eight-year spell at hometown club Exeter, Street has won the Premiership title, European Champions Cup, Premiership Rugby Cup and Anglo Welsh Cup.\n\"Marcus has gained a significant amount of experience in the Premiership for such a young player and we are certain that his best days lie ahead,\" Saracens director of rugby Mark McCall added.\n\"Chiefs is my childhood club, and I can honestly say it has been amazing to wear the shirt,\" Street told the Chiefs' website, external as his forthcoming departure was announced.\n\"I'm excited for the future, to see what change can bring me as it'll be good to be chucked into the deep end of a new environment.\"", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/cewkdqqxpj9o"}