{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:39:58", "date_modify": "2025-04-26 07:39:58", "date_publish": "2025-02-27 13:00:31", "description": "What did the pundits say about Ferguson's Rangers bow?", "filename": "sport_articles_c93nnkpd34wo_1745653198.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e0f4/live/1e64ede0-f504-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_c93nnkpd34wo_1745653198.html", "title": "What did the pundits say about Ferguson's Rangers bow?", "title_page": "What did the pundits say about Ferguson's Rangers bow? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Barry Ferguson's first game at the Rangers helm was laden with drama as his side fell two goals down in an abysmal start at Kilmarnock before roaring back for a 4-2 win.\nHere's what the experts made of it...\nBBC Scotland chief sportswriter Tom English\nKilmarnock will be kicking themselves – they could have been three or four ahead before the comeback. Rangers have dug themselves out of not a hole, but a crater given the way they were defending. Fair play to them for that.\nThey were resilient and played really well second half, got a lot of confidence going. But that defence is a nightmare. They can't get John Souttar and Leon Balogun back quickly enough.\nFormer Scotland striker James McFadden\nFerguson, Neil McCann and Billy Dodds were absolutely loving it at the end there.\nThey've come into an extremely difficult situation, so it's quite right they lap it up. Rangers looked stronger as the game went on, they didn't wither.\nFormer Scotland midfielder Leanne Crichton\nA phenomenal turnaround. It looked like it was going to be a disastrous start for the new management team.\nKilmarnock couldn't have produced a more blistering start but Rangers' response showed real character.", "url": "https://www.bbc.co.uk/sport/articles/c93nnkpd34wo"}