{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:17:20", "date_modify": "2025-05-21 06:17:20", "date_publish": "2025-03-31 08:20:30", "description": "Yeovil Town owner Martin Hellier steps down down from the chairmanship of the club, which he plans to sell, having suffered online abuse from some fans.", "filename": "sport_football_articles_cewglvdxpvxo_1747808240.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6b0f/live/0eb85740-0e06-11f0-988c-fd03b0c3b062.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cewglvdxpvxo_1747808240.html", "title": "Martin Hellier: Yeovil Town owner steps down as chairman after 'abuse'", "title_page": "Martin Hellier: Yeovil Town owner steps down as chairman after 'abuse' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Yeovil Town owner Martin Hellier has stepped down from the chairmanship of the club, having suffered online abuse from some fans.\nIn a statement on the Yeovil website, he said it had been \"a privilege\" to serve in the role, but shareholder Stuart Robins would take over as interim chairman while a new owner is found.\n\"I am proud of the significant changes made around the club, changes that I believe will benefit it for years to come,\" Hellier said.\n\"Helping the club regain its place in the National League was a key milestone, and while the journey has had its challenges, real progress has been made.\n\"However, due to the pressures placed on myself and my family, I have made the decision to step away from my role.\"\nThe businessman has been in charge at Huish Park for almost two years and funded his side's promotion back to the National League last season.\nThe Glovers - whose 16-season stay in the English Football League ended in 2019 - are currently 13th in the fifth tier.\n\"I fully intend to sell the club and leave as soon as a suitable buyer is found,\" Hellier said earlier in a statement on social media.\n\"It's simply not worth losing the money to be abused and my children abused and so on.\n\"I would ask in the meantime that you stop the endless online harassment and abuse. You've done enough, it's worked.\"\nThe relationship between Hellier and the fans has been uneasy for some time.\nA number of supporters, including unofficial podcast Gloverscast, have been banned from Huish Park for comments made on social media.\nThe banning orders led to a backlash from supporters on social media directed at Hellier, who responded with abusive posts of his own.\nYeovil fan Jonathan Hooper posted a picture of a letter he received from the club, telling him that he had been banned because of his comments online.\nBut, speaking to BBC Radio Five Live, he insisted he had not been abusive.\n\"In a way I expected it because I'd seen other fans getting similar letters before me,\" he said.\n\"The whole atmosphere around the club is becoming toxic. It's not a great place to be, but at the same time everything I have done has not been abusive.\n\"Yes, I have been critical but I haven't been aggressive, I haven't been abusive. It's a bit of a punch in the stomach, let's just say.\"\nHooper said he had also posted on social media to tell other fans to stop abusing Hellier.\n\"One day in particular his son was getting particular abuse and I did put a tweet out saying 'come on, this isn't fair to him or the family',\" added Hooper.", "url": "https://www.bbc.com/sport/football/articles/cewglvdxpvxo"}