{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:16:08", "date_modify": "2025-05-21 06:16:08", "date_publish": "2025-02-08 16:31:27", "description": "Leeds United and Millwall condemn \"tragedy chanting\" that took place during Saturday's FA Cup tie between the two clubs at Elland Road.", "filename": "sport_football_articles_c9d52glxj40o_1747808168.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3db8/live/628fc100-e638-11ef-ae1c-bf3b4f9afb5c.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c9d52glxj40o_1747808168.html", "title": "Leeds United: Championship club condemns 'vile' tragedy chanting during FA Cup tie with Millwall", "title_page": "Leeds United: Championship club condemns 'vile' tragedy chanting during FA Cup tie with Millwall - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Leeds United and Millwall have condemned \"tragedy chanting\" that took place during Saturday's FA Cup tie between the two clubs at Elland Road.\nMillwall reached the fifth round for the first time since the 2018-19 season after winning the all-Championship tie 2-0.\nFollowing the match, Leeds issued a statement condemning the \"vile\" chanting relating to the murders of Leeds fans Kevin Speight and Christopher Loftus before a Uefa Cup semi-final at Galatasaray in 2000.\n\"During today's FA Cup fourth-round tie with Millwall, we were extremely disappointed to hear vile chants relating to football tragedies from the away section at Elland Road,\" said the statement., external\n\"We know the impact this has on the families of Christopher Loftus and Kevin Speight, along with the whole fanbase of Leeds United.\n\"We will work with the police and Millwall Football Club to identify those involved, while we will also continue our efforts with the football authorities to help eradicate these chants from the game.\"\nWhen asked about the chanting during his post-match news conference, Leeds boss Daniel Farke said: \"During the game, I was so focused that I didn't hear [the chants].\n\"But in general, you know my attitude and there's nothing more stupid than the old quote, 'football is not about life or death, it's much more serious'. I think it's a stupid quote and has nothing to do with the values of the whole football world.\n\"The health of human beings is always much more important than just a football game.\n\"When something really sad happens with a tragedy, normally the whole football world stands together. If someone didn't reach those standards today - and again, I haven't heard it - it's important to look into this situation.\"\nMillwall also issued a statement, external following the game and said tragedy chanting had no place in football.\n\"The club strongly condemns all forms of football tragedy abuse and is appalled to receive reports of such chanting from a minority at today's FA Cup fixture against Leeds United,\" said the statement.\n\"Both clubs have suffered tragic losses to their respective families in recent history.\n\"Chanting about this is entirely unacceptable and will not be tolerated by the club or the governing bodies.\n\"It has no place in football and the club will work closely with Leeds United and authorities to identify those responsible.\n\"We all have a duty to ensure Millwall Football Club is represented proudly and responsibly at all times.\"", "url": "https://www.bbc.com/sport/football/articles/c9d52glxj40o"}