{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:34:03", "date_modify": "2025-05-21 04:34:03", "date_publish": "2025-04-05 00:00:00", "description": "Follow live text commentary and score from Saturday's fixtures across the EFL League One & League Two.", "filename": "sport_football_live_ce8mzep40pmt_1747802043.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_ce8mzep40pmt_1747802043.html", "title": "EFL League One & League Two LIVE: 24 fixtures including Wrexham v Burton Albion", "title_page": "EFL League One & League Two LIVE: 24 fixtures including Wrexham v Burton Albion - text commentary & score updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "See you soon!\n#bbcefl\nBirmingham's 6-2 dismantling of 10-man Barnsley, a thrilling 3-2 battle between Walsall and Port Vale, a solid Wrexham performance that puts them six clear in the automatic promotion spots - and that's just some of the highlights of today's action.\nThe League Two table has seen three different leaders this afternoon but it's who it ends with that matters.\nBradford City are now the team to beat and you can guarantee this is a promotion race that's still got plenty in it.\nThe big boys in the fourth division will be back on Saturday, but before that Chesterfield will be hosting Gillingham on Tuesday alongside a whole host of League One games to boot.\nIncluding perhaps Birmingham's promotion-winning game should Peterborough feel so obliging.\nJoin us for more then? You know you want to.\nBig week coming up for Blues after fine win\nFT: Birmingham 6-2 Barnsley\nTom Gayle\nFinal Score at St Andrews @ Knighthead Park\nFive different goalscorers with the biggest roar for the final strike from Lukas Jutkiewicz on his 352nd appearance for the club, in what is likely to be his farewell campaign in blue.\nWhat a coming week it could be for Chris Davies' side.\nVictory on Tuesday at Peterborough would secure promotion before they take on the same side at Wembley next Sunday in the league trophy final.\nStill no new manager bounce for Barnsley’s interim boss Conor Hourihane as his wait for a first managerial win.\nHe’ll have plenty to be proud of when dissecting this match whilst heading back up the M1.\nMomentum still with Addicks despite deflating draw\nFT: Charlton 2-2 Lincoln\nVaishali Bhardwaj\nBBC Final Score at The Valley\nWell, it’s disappointment ultimately for the Charlton fans.\nThey were cheering their team on and making plenty of noise especially in that second half as Nathan Jones’ side looked for a winner but there seemed to be an air of deflation at the final whistle.\nStill, Charlton remain unbeaten in their last nine home games and so they’ll feel like the momentum is most certainly still there as we head into the final few games of the season.\n'We are top of the league'\nFT: Bradford 2-0 Crewe\nAndy Kiwomya\nEx-Bradford forward and head of performance on BBC Radio Leeds\nIt is great to feel and great to see this atmosphere!\nWe are top of the league - it is great to feel that feeling and to be able to say we are at the top.\nThe way that Bradford have hit form just at the right time and you just have to enjoy it.\nYou need to embrace the good times as we have had so many frustrating ones over the years and look forward to the next few games.\n'A really dark period for Bristol Rovers'\nFT: Bolton 1-0 Bristol Rovers\nLee Mansell\nFormer Bristol Rovers midfielder on BBC Radio Bristol\nThe second half period I knew Bolton were going to get out their traps a little bit, and they wouldn't have been happy with their first half performance.\nWe are copy and paste of where we have been the past five games, and it is really disappointing. I'm just watching the substitutes doing their post-match running on the pitch now, and they are looking at the floor and kicking the ground - it has to be really hard to take for them.\nWhere is the light at the end of tunnel?\nAt this point were are not picking up wins or points, it is a really dark period for Bristol Rovers.\nBantams the new leaders after 119 days\n#bbcefl\nLeague Two saw some thrilling matches on this stunning April Saturday and here is how the table looks.\nThe game of the day saw Walsall take on Port Vale at The Bescot Stadium, with the Valiants running out 3-2 winners and all the goals coming in the first half.\nThe Saddlers' defeat means they are not top of the table for the first time in 119 days as Bradford move into pole position after their 2-0 win at home to Crewe.\nDoncaster Rovers' late, late two goals at Cheltenham see them stay in the hunt for an automatic promotion spot, with a game in hand still to boot too, they are in fourth just two points behind Walsall.\nAFC Wimbledon's win over Harrogate was a quiet 1-0 but an equally important three points to keep them in the chase.\nAt the other end, Tranmere's thumping 4-0 victory over Chesterfield sees them rise up to 21st dropping Accrington Stanley further into trouble.\nPromotion just one game away for Blues\n#bbcefl\nHere's how the League One table looks after another hectic day.\nBirmingham City's 6-2 win over Barnsley means they are now just two points away from winning automatic promotion to the Championship.\nThird-placed Wycombe's 1-0 defeat at Reading at lunchtime means they can now only get to 93 points, with Blues on 92.\nAnother five points will secure the title for Chris Davies' side with Wrexham able to achieve a maximum of 96 points.\nBolton's victory over Bristol Rovers lifts them back into the play-off spots, while it's as you were at the bottom in the fight for survival between the Gas and Burton Albion.\nFULL-TIME\nBirmingham 6-2 Barnsley\nAn emphatic victory for Birmingham and they are now just two points away from a return to the Championship at the first time of asking.\nBarnsley went down to 10 men but battled well to claw Blues back to 1-1 and then 3-2.\nBut the Tykes ran out of steam and Chris Davies' side ran away with it in the end to secure a 10th straight win on home soil.\nFULL-TIME\nBradford 2-0 Crewe\nGraham Alexander's men bounce back from their 2-0 loss at Port Vale on Tuesday.\nCrewe could not continue the buzz from their first win in six League Two games at home to Grimsby on Tuesday evening.\nThat is now no win in their last seven visits to Bradford as Calum Kavanagh added a goal and an assist to make it 10 and six for him in the league this season.", "url": "https://www.bbc.com/sport/football/live/ce8mzep40pmt"}