{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:06:48", "date_modify": "2025-05-20 14:06:48", "date_publish": "2023-07-30 20:09:55", "description": "Brentford 3-3 Aston Villa: Premier League Summer Series", "filename": "sport_articles_c51vv6qxd53o_1747750008.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e233/live/f276e8e0-2f12-11ee-999b-b74dedc428d3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c51vv6qxd53o_1747750008.html", "title": "Brentford 3-3 Aston Villa: Premier League Summer Series", "title_page": "Brentford 3-3 Aston Villa: Premier League Summer Series - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Stunning goals in a back-and-forth game - what happened?\nBrentford raced into a two-goal lead thanks to a finish from Bryan Mbeumo and a stunning Josh Dasilva strike from range. But Aston Villa's Ezri Konsa found the net in remarkable fashion when he dribbled from the edge of his own box into the Bees' penalty area to curl home and get Villa back into the game.\nUnai Emery's side turned the game with two goals in 10 minutes from Moussa Diaby and Matty Cash, enough to grab a 3-2 half-time lead. Shandon Baptiste restored parity halfway through the second period, as Brentford avoided defeat for the first time in the Premier League Summer Series following losses to Brighton and Fulham.\nWhat Thomas Frank said\n\"A fine start, two goals. The second half of the first half was disappointing. In that spell we are not good. We are too stretched. They played between the lines and opened us up. That's something we have to look into.\n\"Second half, much better. Much more balance. Overall throughout the game I liked our structure, our initiative. But we still need to be better on the ball, still too many simple mistakes on a touch, a decision or a pass and we need to do better overall, no doubt about that.\n\"The 50-50 duels was OK but I want to be better in that area.\n\"If you look at the whole Summer Series, five positive halves. I think that's good to go away with.\n\"Everyone got minutes one way or another apart from two youngsters.\"\nOn facing Lille in their final friendly on 5 August\n\"There have been a lot of positive things in these three games here. It's more to keep reinforcing that and probably nail the defensive side of it. I would love a clean sheet.\"", "url": "https://www.bbc.com/sport/articles/c51vv6qxd53o"}