{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:31:35", "date_modify": "2025-05-19 14:31:35", "date_publish": "2017-08-12 13:11:38", "description": "DIGIONLY", "filename": "sport_football_40903344_1747665095.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_40903344_1747665095.html", "title": "Saturday's League One reports", "title_page": "Saturday's League One reports - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "AFC Wimbledon 0-1 Shrewsbury Town\nAlex Rodman's early goal continued Shrewsbury's 100% start to the League One season as they beat AFC Wimbledon in an intense physical encounter.\nRodman found himself on the end of Shaun Whalley's cross in the sixth minute, heading the ball past George Long and into the bottom-right corner.\nWimbledon looked livelier in the second half and their best chance of an equaliser came from a Dean Parrett free-kick in the 56th minute but his effort sailed over.\nFatigue from Tuesday's 120-minute outing against Brentford in the EFL Cup showed as the home side struggled to find momentum in attack, failing to add to the point earned against Scunthorpe last weekend.\nPaul Hurst's side dominated possession early on, with Rodman and Whalley frequently firing the ball at Long, who coped with the barrage well.\nShrewsbury's attack was just as punishing in the second half and Carlton Morris looked to extend their lead but his attempt was halted by on-loan Sheffield United keeper Long.\nReport supplied by the Press Association.\nBlackburn Rovers 1-3 Doncaster Rovers\nA rampant second-half display from newly-promoted Doncaster earned them victory over recently-relegated Blackburn at Ewood Park.\nTony Mowbray's men were the architects of their own downfall, gifting John Marquis an opener, conceding a second from the penalty spot and a calamitous goalkeeping error resulted in a third.\nA consolation goal for Dominic Samuel could not lift spirits.\nAfter enjoying the majority of possession, Blackburn gifted an opener to the visitors in the first minute after the interval as Elliott Ward failed to control a simple pass and Marquis ran clear to slot home.\nCharlie Mulgrew brought down James Coppinger in the area midway through the half and Doncaster captain Coppinger fired the resulting penalty straight down the middle.\nTommy Rowe and Ben Gladwin both saw efforts well saved for Blackburn but Alfie May slotted a third Doncaster goal into an empty net after goalkeeper David Raya inexplicably headed a long ball straight to him.\nSamuel headed in his first goal for Rovers shortly afterwards but Doncaster claimed their first ever win at Ewood Park.\nReport supplied by the Press Association.\nBlackpool 1-0 MK Dons\nSean Longstaff's early strike was enough to secure newly-promoted Blackpool their first victory back in League One and defeat MK Dons.\nThe game was played with Blackpool Air Show taking place in the skies above Bloomfield Road and the hosts were soon flying high.\nThey were ahead after just five minutes when on-loan Newcastle midfielder Longstaff picked the ball up 15 yards out and rifled a right-footed shot low into the far corner.\nAnd the Seasiders had a chance to double the lead when Bright Osayi-Samuel broke inside the area but his square ball to Viv Solomon-Otabor was poor and the chance was lost.\nMK Dons had their best chance after 36 minutes when Ethan Ebanks-Landell rose highest to glance a header from six yards inches wide of the far post.\nThe visitors had goalkeeper Lee Nicholls to thank for keeping them in the game as he twice denied Osayi-Samuel from close range after 74 minutes.\nAnd his opposite number Ryan Allsop secured Blackpool the points by parrying away Kieran Agard's fierce late drive.\nReport supplied by the Press Association.\nBristol Rovers 1-4 Peterborough United\nJack Marriott scored a hat-trick as Peterborough made it maximum points from their opening two League One matches with an impressive victory at Bristol Rovers.\nPosh took a sixth-minute lead when Ryan Sweeney failed to clear a cross from Gwion Edwards and Marriott pounced to fire home from close range.\nA Junior Morais pass set up strike partner Marriott to score his second in the 55th minute and Steven Taylor forced the ball over the line for a third with 12 minutes remaining after Jack Baldwin had headed on a left-wing corner.\nRovers grabbed a consolation five minutes from time when substitute Rory Gaffney headed home a Lee Brown cross at the far post.\nBut Marriott completed his treble in time added on, tapping in a low left-wing cross from substitute Andrew Hughes.\nPosh had the better of the first half but survived a scare just before the break when Billy Bodin's left-footed drive from the edge of the box crashed against the crossbar.\nRovers also hit the woodwork in the second half through a looping header from substitute Ollie Clarke.\nReport supplied by the Press Association.\nGillingham 0-1 Bradford City\nDominic Poleon's first-half goal allowed Bradford to make it two wins from two in the new League One season as they ground out a narrow victory at Gillingham.\nThe hosts had striker Conor Wilkinson sent off for good measure as their search for a goal in the campaign goes on, while Poleon will be relieved his glaring miss just before half-time did not prove costly.\nBradford broke through when Alex Jones got to the byline and cut the ball back, with Poleon passing his shot first time into the bottom corner.\nHaving struggled to create openings, Gillingham finally threatened when Josh Parker forced Colin Doyle into a smart save from a tight angle on the left.\nPoleon then somehow missed an open goal after dispossessing Max Ehmer and rounding Tomas Holy while at the other end Parker was just as wasteful, as he stabbed wide from Luke O'Neill's cross.\nThe Gills' cause was not helped by Wilkinson's dismissal with 15 minutes left for a poor challenge on Timothee Dieng and substitute Liam Nash headed their last chance over.\nReport supplied by the Press Association.\nNorthampton Town 0-1 Fleetwood Town\nSubstitute Devante Cole's strike helped Fleetwood make it two wins out of two as they claimed a narrow win over Northampton at Sixfields.\nThe game appeared to be drifting towards a goalless draw when a fine finish from Cole sent the three points Fleetwood's way and condemned Northampton to a second straight defeat.\nThe visitors made the brighter start and almost had an early lead when Cian Bolger's header was blocked on the line before David Cornell beat away Jordy Hiwula's drive.\nBut Northampton responded strongly and should have gone into half-time ahead when, after Chris Long twice went close, Fleetwood goalkeeper Alex Cairns pulled off a sensational triple save to deny Aaron Pierre twice and then Billy Waters, all from close-range.\nClear-cut chances were harder to come by in a scrappy second half but the game's only goal arrived with 15 minutes remaining.\nTwo substitutes combined as Aiden O'Neill won the ball in midfield and fed Cole, who clinically beat Cornell to earn all three points.\nReport supplied by the Press Association.\nOxford United 3-0 Portsmouth\nOxford United made it two wins from two at the start of their League One campaign by beating Portsmouth at the Kassam Stadium.\nWes Thomas and Josh Ruffels were on target for the second week running, having both bagged in Oxford's season-opening victory at Oldham last week, while Gino van Kessel scored a brilliant individual goal.\nIt was the visitors who had the first sight at goal when Kyle Bennett tried his luck from 20 yards, which Simon Eastwood parried for a corner.\nJack Whatmough headed straight at the U's goalkeeper while Pompey forward Brett Pitman had a goal disallowed for a push in the back just before half-time.\nOxford capitalised on the let-off early in the second half when Thomas bundled in from three yards after Luke McGee failed to hold Christian Ribeiro's cross-shot.\nIt remained that way until the 82nd minute, when substitute Van Kessel, signed on loan from Slavia Prague, marked his introduction by beating two defenders and slamming home an angled drive.\nRuffels then slid in a third in the fourth minute of stoppage time to complete Pompey's miserable second half.\nReport supplied by the Press Association.\nPlymouth Argyle 2-0 Charlton Athletic\nJake Jervis bagged a second-half brace as promoted Plymouth overcame Charlton at Home Park to claim the first points of their League One campaign.\nArgyle were beaten by Peterborough in their season opener last week but Jervis' double ensured they bounced back in style.\nIt was the Addicks who had the first chance as skipper Chris Solly's thumping long-range drive was saved by Pilgrims goalkeeper Luke McCormick.\nMcCormick immediately bettered that stop with a brilliant reaction save to send striker Josh Magennis' close-range follow-up around the frame of the goal and safety.\nBen Amos matched his opposite number's efforts, going full stretch to fingertip Gary Sawyer's shot around the post.\nFrom Graham Carey's corner Amos also relied on instinct, using his feet to clear Jervis' first-timer off the line.\nBut Jervis would not be denied in the 54th minute, with the striker finishing at the far post after central defender Ryan Edwards nodded down Carey's corner.\nCarey continued to impress and went close with a thumping 30-yard rising drive that beat Amos for pace.\nIt was Jervis who made sure of the three points for Plymouth three minutes from time, going solo before smashing the ball past Amos from just outside the box.\nReport supplied by the Press Association.\nRochdale 1-1 Scunthorpe United\nRochdale and Scunthorpe cancelled each other out by trading second-half goals in a League One draw.\nThe home side enjoyed the greater share of possession in the opening period, but home goalkeeper Josh Lillis was busier than Scunthorpe counterpart Matt Gilks, who did not have a save to make in the opening 45 minutes.\nThe Rochdale goal came under threat when a misjudged back pass by Jamie Allen from the halfway line looked short of legs, presenting an opportunity for Paddy Madden. Fortunately for Keith Hill's side, Lillis read the danger early and raced out of his area, winning the crucial challenge for the ball.\nLillis also saved well when Reece Brown's poor header let Josh Morris in down the left flank.\nAfter the break, Dale improved with the introduction of striker Steven Davies and his diving header gave the home side the lead, the frontman meeting Ian Henderson's flick towards the back post.\nIt was a short-lived lead, however, as fellow sub Duane Holmes slipped a neat finish beneath Lillis.\nReport supplied by the Press Association.\nRotherham United 5-0 Southend United\nA brilliant first-half hat-trick from Kieffer Moore led Rotherham United to a scintillating thrashing of Southend in League One.\nThe Millers blew Phil Brown's men away in the opening 45 minutes in South Yorkshire, with Joe Newell adding a fine goal to Moore's treble and Ryan Williams notching after the break.\nMoore got the ball rolling in the 15th minute when he slotted home from Williams' pass and then 60 seconds later he added his second, tapping home Jamie Proctor's pinpoint cross.\nNewell made it 3-0 after only 23 minutes with the best goal of the lot as he fired beautifully into the far corner and then Moore became the first man to score a competitive hat-trick at the New York Stadium when he converted from 12 yards in first-half injury time.\nWilliams made it five just before the hour when another brilliant team move left him with the simplest of tap-ins.\nThe Millers threatened to equal their record home win but David Ball was denied by a good save from Mark Oxley while Southend were denied a late consolation when Marc-Antoine Fortune hit the post with the goal gaping.\nReport supplied by the Press Association.\nWalsall 2-1 Oldham Athletic\nErhun Oztumer's 90th-minute winner gave Walsall their first victory of the season as they beat Oldham at the Banks's Stadium.\nRyan McLaughlin gave Oldham a first-half lead but the Latics slipped to a third straight defeat as goals from Joe Edwards and Oztumer completed a Walsall turnaround.\nOldham took the lead on 32 minutes as McLaughlin's low cross evaded everyone in the box and trickled home.\nIt could have been 2-0 on the brink of half-time but Aaron Amadi-Holloway's 20-yard strike was clawed away by Walsall keeper Mark Gillespie.\nWalsall levelled as a corner broke to Edwards, 18 yards out, and his deflected drive found the bottom corner.\nIt was all Walsall from there as Oztumer nodded wide from close range and later struck the post from 20 yards, with Amadou Bakayoko firing the rebound wide from six yards.\nBut the Saddlers found the winner they deserved as James Wilson's flick-on from a long throw was prodded home by Oztumer from close range.\nOldham could have rescued a point deep into stoppage time but Tope Obadeyi's bullet header was superbly foiled by Gillespie's point-blank save.", "url": "https://www.bbc.com/sport/football/40903344"}