{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:00:59", "date_modify": "2025-05-21 05:00:59", "date_publish": "2024-12-25 09:53:33", "description": "La Liga strugglers Valencia appoint West Bromwich Albion boss Carlos Corberan as their new head coach.", "filename": "sport_football_articles_cm2vj5ky08mo_1747803659.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b925/live/8c700a40-c2a5-11ef-bd1d-71b0dcef379c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cm2vj5ky08mo_1747803659.html", "title": "Carlos Corberan: Valencia appoint West Bromwich Albion head coach", "title_page": "Carlos Corberan: Valencia appoint West Bromwich Albion head coach - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "La Liga strugglers Valencia have appointed West Bromwich Albion boss Carlos Corberan as their new head coach.\nValencia paid a release clause, believed to be between £3-4m, in the 41-year-old Spaniard's contract to allow him to leave Championship club Albion.\nCorberan has signed a deal until the end of the 2026-27 season with the Spanish club, who sacked head coach Ruben Baraja on Monday after just two wins in 17 league matches this season.\nIn a statement,, external Albion said Corberan was leaving \"with the club's gratitude and best wishes\".\nCoaches Chris Brunt, Damia Abella and Boaz Myhill will take caretaker charge of the Baggies while they search for a new coach.\nFormer Huddersfield Town boss Corberan was appointed by the Baggies in October 2022, leading them to a ninth-placed finish in his first season and fifth last term, as they lost to Southampton in the play-off semi-finals.\nHe has guided Albion to seventh place in the Championship table this season, just outside the play-off places on goals scored, despite claiming his playing budget had been reduced by 30%.\nCorberan had been linked with the recent managerial vacancy at Premier League side Southampton, but Saints chose Ivan Juric to replace the sacked Russell Martin.\nValencia, Corberan's hometown club, are four points from safety, sitting second-bottom of La Liga.\nIn Baraja's final game as manager, they drew 2-2 with Alaves on Sunday to move off the bottom of the table on goal difference.\nThey face reigning champions Real Madrid in their next league game on 3 January.\nWest Bromwich Albion left it late to deliver their Christmas Eve bombshell that Carlos Corberan was leaving to take over at Valencia.\nSanta Claus was well into his round when the announcement came at just 20 minutes to midnight.\nBut where does it now leave the club? And their now former head coach.\nGoing back to Spain to manage Valencia may prove to be a risk for 41-year-old Corberan.\nJust ask one of his predecessors in the job, Gary Neville!\nThe men from the Mestalla are in the relegation zone, have had financial difficulties and, since current Aston Villa boss Unai Emery left in 2012, only one manager has lasted longer than two years in charge.\nBut then there's Albion's own financial situation.\nCorberan's hands have been tied for most of his 26-month reign.\nHe was appointed as Steve Bruce's successor in October 2022 when chairman Guochuan Lai was still officially at the helm, but in name only, with presence and financial support completely non-existent. Yet Corberan organised a team who went from the relegation zone to just missing out on a 2022-23 Championship play-off place.\nThe following season, he did achieve a place in the top six, losing in the semis to Southampton, with whom he was also linked last week - again without a single penny for his recruitment team to spend.\nBut his coaching qualities came to the fore as he turned cast-offs such as Cedric Kipre and Alex Mowatt into vital members of his starting XI, which he has done again this season with Karlan Grant.\nDespite American businessman Shilen Patel's February takeover, the club's financial restrictions remain ongoing. Only last week it was revealed that the decreased wage budget back in the summer was actually as much as 30%, forcing the loss of several players.\nFor the Baggies, it's a blow in the short term – particularly the timing of it with three games to come in six days over the festive period. But it may be a move that suits all parties.\nCorberan gets to finally test himself in the top flight of an elite league, he gets a move close to his family and that vocal minority of Albion fans who've become tired of his football will get to see something different.\nHowever, that comes with a side warning of 'be careful what you wish for' because the job he has done in stabilising the club on the field during a period of utter turmoil cannot be understated and they're definitely in a better place compared with two years ago.\nHe should leave with the well wishes of the majority of Baggies supporters - and definitely will with those he worked with at the training ground because, as well as being a top coach, most importantly, he is a decent man.", "url": "https://www.bbc.com/sport/football/articles/cm2vj5ky08mo"}