{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:22:18", "date_modify": "2025-05-20 13:22:18", "date_publish": "2023-07-27 22:03:59", "description": "Bayern Munich are set for more Tottenham talks over Harry Kane and also want Brentford's David Raya, Chelsea are chasing Romeo Lavia, plus more.", "filename": "sport_66331139_1747747338.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4EC5/production/_130556102_harrykane.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_66331139_1747747338.html", "title": "Friday's gossip: Kane, Amrabat, Raya, Henderson, Lavia, Rodriguez", "title_page": "Friday's gossip: Kane, Amrabat, Raya, Henderson, Lavia, Rodriguez - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Bayern Munich executives are flying to London for a new round of talks with Tottenham over an £86m deal for England forward Harry Kane, who turns 30 on Friday. (Telegraph - subscription required), external\nParis St-Germain also believe they are in the mix to sign Kane if Tottenham choose to sell him. (Sky Sports), external\nManchester United are continuing to hold talks with Fiorentina over Morocco midfielder Sofyan Amrabat, 26, while they work on moving 30-year-old Brazilian Fred out of the club. (90min), external\nRB Leipzig are ready to set a deadline of 12 August, when they play in the German Super Cup, for Manchester City to complete a move for Croatia defender Josko Gvardiol, 21. (Mail), external\nNigeria striker Victor Osimhen, 24, is in talks with Napoli about extending his contract with the Italian champions. (Sky Sports Italia), external\nChelsea have suffered a blow in the transfer market with 29-year-old Argentina forward Paulo Dybala set to sign a new contract with Roma. (Tuttomercatoweb - in Italian), external\nBayern are interested in Brentford's Spain goalkeeper David Raya, 27, and 32-year-old compatriot David de Gea, who is a free agent after leaving Manchester United. (Times - subscription required), external\nItaly midfielder Marco Verratti, 30, is close to completing a move to Al Hilal from Paris St-Germain. (Fabrizio Romano), external", "url": "https://www.bbc.com/sport/66331139"}