{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:43:41", "date_modify": "2025-05-21 07:43:41", "date_publish": "2025-03-28 00:00:00", "description": "Chennai Super Kings face Royal Challengers Bengaluru in the IPL - follow live scores, radio commentary and updates.", "filename": "sport_cricket_live_ce30d7d64ndt_1747813421.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1d57/live/49192e20-0bf7-11f0-ba12-8d27eb561761.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_live_ce30d7d64ndt_1747813421.html", "title": "IPL 2025 LIVE: CSK vs RCB", "title_page": "IPL 2025 LIVE: CSK vs RCB - cricket score, radio commentary & updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Buttler back in action on Saturday\nGujarat Titans and Mumbai Indians both go in search of their first win of the season in Saturday's IPL fixture.\nMumbai were beaten by Chennai Super Kings in their first match while Gujarat Titans were edged out by Punjab Kings.\nJos Buttler is expected to feature for the Titans while Rohit Sharma, Will Jacks and Trent Boult will likely line up for Mumbai.\nThe match begins at 14:00 GMT.\nRCB comfortably beat CSK to earn second win\nRoyal Challengers Bengaluru made it two wins from two at the start of the Indian Premier League with 50-run victory over five-time champions Chennai Super Kings.\nRCB, still chasing their first IPL title, battled their way to 197-7 and then impressively restricted their opponents to 146-8.\nEngland opener Phil Salt provided a fast start with 32 from 16 balls while Virat Kohli played more conservatively for 31 from 30.\nSkipper Rajat Patidar was dropped twice en route to 51 from 32 and Tim David added a late boost with three sixes in the final over bowled by England international Sam Curran to end 22 not out from eight.\nDavid's Australia team-mate Josh Hazlewood then took two wickets in the second over of the chase and CSK never recovered.\nCurran struggled for eight from 13 balls until he hit England team-mate Liam Livingstone, who finished with 2-28, to long-on.\nNew Zealand batter Rachin Ravindra was the highest scorer with 41.", "url": "https://www.bbc.com/sport/cricket/live/ce30d7d64ndt"}