{"authors": ["Timothy Abraham", "www.facebook.com"], "date_download": "2025-05-21 03:40:57", "date_modify": "2025-05-21 03:40:57", "date_publish": "2025-04-06 22:25:04", "description": "Marc Leishman wins his first LIV Golf individual title as he beats Charl Schwartzel by one stroke in Miami - and sees off a host of other players warming up for the Masters.", "filename": "sport_golf_articles_c230n9nn40po_1747798857.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/479b/live/b8ca89b0-132e-11f0-a4be-07438a3933cb.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_golf_articles_c230n9nn40po_1747798857.html", "title": "LIV Miami: Marc Leishman wins first LIV Golf title as Sergio Garcia, Bryson DeChambeau and Jon Rahm warm up for Masters", "title_page": "LIV Miami: Marc Leishman wins first LIV Golf title as Sergio Garcia, Bryson DeChambeau and Jon Rahm warm up for Masters - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "LIV Miami, final leaderboard\n-6 M Leishman (Aus); -5 C Schwartzel (SA); -4 S Garcia (Spa); -3 C Ortiz (Mex); -2 B DeChambeau (US); -1 P Mickelson (US)\nSelected: +1 J Rahm (Spa); +7 D Johnson (US); +8 P Casey (Eng); +9 I Poulter (Eng)\nFinal leaderboard\nMarc Leishman won his first LIV Golf individual title as he beat Charl Schwartzel by one stroke in Miami - and saw off a host of other players warming up for the Masters.\nThe 41-year-old Australian, who will not be part of the LIV contingent in Augusta, made a four-under final round of 68 to finish at six under.\nLeishman had started the day three shots behind leader Bryson DeChambeau, but set the tone with a birdie at the first.\nHe then sunk birdies at the fourth, eighth, and 10th holes before eight pars helped him finish just ahead of South African Schwartzel, who carded 66 on the Blue Monster Course at Trump National Doral in Florida.\n\"I saw all the guys right behind me and I knew the holes I had to finish up on,\" Leishman said.\n\"I played probably some of my best golf I've ever played today.\"\nAmong the LIV players taking part at the Masters in addition to Schwartzel, former Masters champion Sergio Garcia was two shots behind Leishman at four under.\nUS Open champion DeChambeau finished a further two shot back at at two under while three-time Masters champion Phil Mickelson finished one under.\nJon Rahm, the 2023 Augusta winner, finished one over.", "url": "https://www.bbc.com/sport/golf/articles/c230n9nn40po"}