{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:31:24", "date_modify": "2025-05-21 06:31:24", "date_publish": "2025-03-31 19:33:36", "description": "American football sides Kansas City Chiefs and Green Bay Packers have been awarded marketing rights in the United Kingdom and Ireland.", "filename": "sport_american-football_articles_cx275lww9qxo_1747809084.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/63c8/live/36c45290-0e4a-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_american-football_articles_cx275lww9qxo_1747809084.html", "title": "Kansas City Chiefs: NFL giants expand marketing rights into UK and Ireland", "title_page": "Kansas City Chiefs: NFL giants expand marketing rights into UK and Ireland - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The Kansas City Chiefs and Green Bay Packers have been awarded marketing rights in the United Kingdom and Ireland as American football continues its expansion outside the USA.\nThe Chiefs were denied a historic 'three-peat' by the Philadelphia Eagles in February's Super Bowl and the Green Bay Packers\nThe NFL's Global Markets Program awards clubs international marketing rights to expand the profile of the sport through fan engagement, commercial opportunities and Flag Football.\nClark Hunt, chief executive and chairman of the Chiefs, said he was \"incredibly excited\" to expand into the new market.\n\"As the game grows globally, more and more fans from around the world are becoming a part of Chiefs Kingdom,\" he said.\n\"Kansas City has certainly made a name for itself in the global sports landscape, and we are proud to showcase our town and our team on the international stage.\"\nThe expansion in Ireland comes after it was announced a first regular-season NFL game will be played in Dublin in 2025, with the Pittsburgh Steelers named as the designated team.\nJude McAtamney made history for the New York Giants in November by becoming the first Irish-born placekicker to feature in a regular season NFL game since 1985.\nHenry Hodgson, NFL UK and Ireland general manager, said the island of Ireland was \"an important market\" for the growth of the sport.\n\"The Chiefs and the Packers are fantastic additions to our Global Markets Program teams in-market, providing continuous opportunities for fans to engage with our sport and with the NFL as we grow across the country,\" he said.", "url": "https://www.bbc.com/sport/american-football/articles/cx275lww9qxo"}