{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:34:12", "date_modify": "2025-05-21 07:34:12", "date_publish": "2025-05-20 14:25:49", "description": "Accrington Stanley confirm they will close their academy despite the offer of a grant by Hyndburn Council.", "filename": "sport_football_articles_cgegg14xn44o_1747812852.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0488/live/925a1ab0-3580-11f0-9f00-498a49351714.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cgegg14xn44o_1747812852.html", "title": "Accrington Stanley to close academy despite an offer of a £140,000 grant from council", "title_page": "Accrington Stanley to close academy despite an offer of a £140,000 grant from council - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Accrington Stanley have confirmed they will close their academy despite the offer of a grant by Hyndburn Council.\nThe League Two club previously announced it would be forced to close the academy as a cost-cutting measure.\nThat came amid a row with the council over the loss of revenue from the use of club facilities for non-matchday events after the council revoked its entertainment licence following noise complaints from neighbours.\nThe council had offered to put forward the £140,000 which it said in a statement would \"be the figure required to keep the academy operational for the next 12 months\" but the club has now turned down that offer.\n\"While we genuinely appreciate their offer, a detailed review of the club's financial situation and immediate challenges has made it clear that this support would not address the wider issues we are facing,\" a club statement said.\n\"During these discussions, the club outlined its ambitions and financial responsibilities, particularly as we look ahead to the 2025-26 season.\n\"After careful consideration, the board has concluded that continuing to operate the academy at this time is not a viable option, even with the council's proposed financial assistance.\"", "url": "https://www.bbc.com/sport/football/articles/cgegg14xn44o"}