{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:33:47", "date_modify": "2025-04-26 03:33:47", "date_publish": "2025-03-08 00:00:00", "description": "Joao Pedro scores a penalty in stoppage time to lead Brighton to victory over Fulham and strengthen their hopes of staking a claim for a Champions League berth.", "filename": "sport_football_live_c15qn552jgqt_1745638427.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f243/live/7b857de0-fc3f-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_c15qn552jgqt_1745638427.html", "title": "Brighton 2-1 Fulham: Brighton snatch late win over Fulham with Joao Pedro penalty", "title_page": "Brighton 2-1 Fulham: Brighton snatch late win over Fulham with Joao Pedro penalty - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Joao Pedro's stoppage-time penalty snatched Brighton victory over Fulham and strengthened their hopes of securing a Champions League berth.\nPedro won the penalty for his side after beating Fulham's Harrison Reed to the ball and taking a challenge on the back of the ankle.\nThe Brazilian dispatched the spot-kick into the corner to score for a third successive game - the first time he has achieved that feat in the Premier League - and deliver a crucial three points for the hosts.\nRaul Jimenez had put Fulham in front with a well-taken volley after some neat chest control at the far post but Brighton struck back six minutes later through Jan Paul van Hecke.\nBoth teams played 120 minutes when securing their place in the quarter-finals of the FA Cup last Sunday, with Brighton beating Newcastle and Fulham seeing off Manchester United, and fatigue may have played a part in a largely uneventful first half at Amex Stadium.\nBrighton showed a slight improvement in the second half and had two goals ruled out for offside before eventually grabbing the winner.\nThe victory moves Brighton up to sixth and just one point adrift of Manchester City who are fourth and in the final guaranteed Champions League spot.\nFulham, who had not lost against Brighton in nine previous encounters, stay ninth, four points further back.\nFulham's away form has been integral to their push for a European place - boasting the sixth-best record on the road in the division.\nAfter a slow start from both sides, Marco Silva's team provided the first real moment of quality when Alex Iwobi burst down the right flank and delivered an inviting cross for Jimenez to finish.\nUnfortunately that was the first and last moment of quality from the visitors on what has to be filed as an off day.\nFulham did not manage to muster another attempt on target as their five-match winning run away from home came to an end.\nThey struggled to get Jimenez further involved in the encounter with the Mexican's only other attempt flying wide.\nThe Cottagers have been tough to keep at bay on their travels, scoring in their past 13 Premier League games - including Jimenez's strike - while they have netted at least two in their past six away outings.\nA draw would have been regarded as a positive result against an in-form Brighton, but defeat dampens their hopes of pushing for a top-four finish.", "url": "https://www.bbc.co.uk/sport/football/live/c15qn552jgqt"}