{"authors": ["Alex Howell", "www.facebook.com"], "date_download": "2025-04-26 04:04:21", "date_modify": "2025-04-26 04:04:21", "date_publish": "2025-03-03 19:15:41", "description": "Jurrien Timber says Arsenal can \"change the narrative\" of their season if they can beat PSV Eindhoven in their Champions League last-16 tie.", "filename": "sport_football_articles_c8d413g088vo_1745640261.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ee23/live/893c3a00-f85c-11ef-8714-d3611ded0ada.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c8d413g088vo_1745640261.html", "title": "PSV v Arsenal: Gunners defender says club can change season's narrative in Champions League", "title_page": "PSV v Arsenal: Gunners defender says club can change season's narrative in Champions League - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Jurrien Timber says Arsenal can \"change the narrative\" of their season if they beat PSV Eindhoven in their Champions League last 16 tie.\nThe Gunners have suffered injuries to several of their key attackers with Kai Havertz and Gabriel Jesus ruled out for the season, while Bukayo Saka and Gabriel Martinelli have hamstring injuries to keep them on the sidelines.\nArsenal have failed to score in their last two matches and fallen 13 points behind leaders Liverpool at the top of the Premier League.\nHowever, they were one of the standout sides in the Champions League group phase, finishing third on 19 points and only conceding three goals.\nBefore Tuesday's first leg at PSV's Philips Stadium, Dutch defender Timber said: \"I think the motivation is there and it's an amazing league to play in. I think we showed as well in the group stages that we did really well and we have a good team.\n\"I think tomorrow is a beautiful game to change the narrative and to win.\"\nTimber has played 36 times for Arsenal this season after only making two Premier League appearances in the last campaign after suffering an anterior cruciate ligament injury on the opening day.\nAnd the 23-year-old does not think his side need to do anything complicated to get the good feeling back.\n\"I think we have so much quality in our group, of course we have a lot of injuries, especially up front, but it's a beautiful challenge for us to put our front players - or anyone - to score goals and hopefully we can show that,\" added Timber.\n\"We have to score tomorrow, we have to win and in the Champions League you only have two games, so you don't get second chances. So we have to go for it in this game.\"\nWithout their first-choice forwards, Arsenal have been criticised for their recent performances, but Timber remains excited for the challenge of taking on PSV.\n\"I don't think of it as a negative, but we have been through a lot - especially in the last couple of weeks,\" said the former Ajax player.\n\"But what I said is I think it is a challenge for us and we just have to take it. Tomorrow is beautiful game to show that - and we will definitely show that tomorrow.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c8d413g088vo"}