{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:02:31", "date_modify": "2025-05-21 05:02:31", "date_publish": "2025-01-14 22:19:30", "description": "The final round of games in the first phase of the Cymru Premier season remains unfinished after Tuesday's game between Connah's Quay Nomads and Bala Town is abandoned due to fog.", "filename": "sport_football_articles_c2k50ldp5wqo_1747803751.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d06e/live/71d13120-d2c5-11ef-af5d-07f6a75d4237.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c2k50ldp5wqo_1747803751.html", "title": "Cymru Premier: Top six hangs in balance as Nomads-Bala abandoned", "title_page": "Cymru Premier: Top six hangs in balance as Nomads-Bala abandoned  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The final round of games in the first phase of the Cymru Premier season remains unfinished after Tuesday's game between Connah's Quay Nomads and Bala Town was abandoned due to fog.\nAn emergency meeting of the Football Association of Wales National Leagues Board will take place on Wednesday morning to discuss the matter.\nConnah's Quay were leading 3-0 when the game was abandoned, the final match ahead of the mid-season league split.\nThe game at Flint's Essity Stadium was in doubt ahead of kick-off because of thick fog but eventually started 15 minutes late.\nNomads made an impressive start with Rhys Hughes scoring twice inside the opening nine minutes, with the first goal coming from an effort inside his own half.\nBen Nash scored a third to give the hosts a 3-0 interval lead.\nBut poor visibility resulted in a pause in play early in the second half and with half an hour of the game remaining.\nFollowing a delay of over half an hour referee Tom Owen abandoned the game.\nBoth Bala and Connah's Quay went into the game in the mix to secured a place in the Championship Conference for the second half of the season.", "url": "https://www.bbc.com/sport/football/articles/c2k50ldp5wqo"}