{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:19:32", "date_modify": "2025-05-21 06:19:32", "date_publish": "2025-04-01 00:00:00", "description": "Build-up to Tuesday's Premier League action plus manager news conferences with the latest on Trent Alexander-Arnold's future and Erling Haaland's ankle injury.", "filename": "sport_football_live_cwy7llp2vg9t_1747808372.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1a7b/live/b5dc0b50-0f07-11f0-ac9f-c37d6fd89579.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cwy7llp2vg9t_1747808372.html", "title": "Premier League build-up: Team news & manager news conferences", "title_page": "Premier League build-up: Team news & manager news conferences - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "What have we learned today?\nIt's been a busy Tuesday as we heard from a number of Premier League managers as league action returns after more than two weeks.\nBut two talking points stood out during the day as:\nArne Slot shrugged off transfer talks surrounding Trent Alexander-Arnold and instead said his focus is on having the Liverpool star back to full fitness.\nPep Guardiola also dropped the news that star striker Erling Haaland will be out injured for up to seven weeks, which could see him miss the FA Cup final if Manchester City make it.\nYou can browse through our summary points to catch up on all the other big stories from throughout the day, including team news and build-up tonight's three Premier League matches.\nWe also have live coverage of those games - Arsenal v Fulham, Wolves v West Ham and Nottingham Forest v Manchester United - coming up on the BBC Sports website that you can follow here.\nSutton's prediction: Wolves 1-1 West Ham\nWolves v West Ham (19:45 BST)\nWolves have got a nine-point cushion above the bottom three but they still have a bit of work to do to make sure they are completely safe.\nTheir best player Matheus Cunha is still suspended, and he is such a big miss. His recent comments about wanting to leave to win trophies are hardly much help to them either.\nWest Ham are only one place above Wolves, but are another eight points clear.\nTheir results have not been spectacular under Graham Potter but when I look at them, I do think they are improving - they came very close to beating Everton last time out, and actually deserved the three points there.\nI'd like to pick a winner but I am not sure that will get me anywhere - this game smells of a draw.\nSutton's prediction: 1-1\nFullkrug returns as Larsen passed fit\nWolves v West Ham (19:45 BST)\nWest Ham manager Graham Potter confirmed that German striker Niclas Fullkrug will be part of the Hammers travelling squad after almost three months out with a hamstring injury.\nFor Wolves, Jorgen Strand Larsen, who has scored nine league goals this campaign, is available despite missing Norway's matches in the international break due to a fracture in his hand.\nMatheus Cunha will be absent again as the Brazilian serves the third match of his four-game suspension.\nMeanwhile, Cunha's compatriot Joao Gomes will hope to celebrate the signing of a new five-year deal with a win.\nGomes' new contract, announced by Wolves today, also includes the option of a further year. The midfielder joined from Flamengo in 2023 and has made 80 appearances for Wolves.\nHammers aim to pull further away from Wolves\nWolves v West Ham (19:45 BST)\nWest Ham travel to Wolves with the sides sitting 16th and 17th respectively but separated by eight points with nine games to go.\nGraham Potter's side have lost only once in their past four games, winning two of them and are aiming for a fourth successive win over Wolves.\nWolves have collected 10 points from their last six league games - as many as they had accrued from their 12 previous matches.\nHowever, they have won just two of their past eight games at Molineux.\nTheir league games this season have produced 98 goals (40 scored and 58 conceded, the joint most of any side along with Tottenham.\nSutton's prediction: Arsenal 2-0 Fulham\nArsenal v Fulham (19:45 BST)\nArsenal's title hopes may only be faint but they have still got to try to exert a bit of pressure on Liverpool.\nWin this, and they are nine points behind the leaders before Arne Slot's side play again. I want to see Liverpool pushed, and no other result will do.\nIt won't be easy for Arsenal, though - I was at the reverse fixture at Craven Cottage in December, which finished 1-1, and that was a typical Fulham performance in that they were dangerous on the counter-attack.\nThey showed that day what a capable side they are, and they have several former Arsenal players in their squad who will want to prove a point again too.\nMarco Silva's side had a disappointing defeat at home to Crystal Palace in the FA Cup on Saturday, but they actually played really well in the first half of that game.\nIt's hard to know where some teams are at form wise, coming out of the international break, and if Arsenal are not at the races then Fulham are going to to cause them more problems this time.\nI actually think the Gunners will find a way to win this one, though.\nBukayo Saka's return after more than three months out will lift Emirates Stadium even if he starts the game on the bench and, if they need it, he will supply a spark whenever he gets on the pitch.\nSutton's prediction: 2-0\nArsenal looking to keep pace with Liverpool\nArsenal v Fulham (19:45 BST)\nArsenal edged Chelsea 1-0 before the international break to move 12 points behind Premier League leaders Liverpool and they will now hope to reduce that gap to a single digit as neighbours Fulham visit.\nMarco Silva's Fulham, meanwhile, are in eighth place and only three points behind fifth-placed Manchester City and four points behind Chelsea, in fourth.\nThe Gunners have never lost in 31 home league fixtures against Fulham (W24, D7).\nIt's the most home games one side has played against another without ever losing in English league history.\nHowever, Fulham have not won in any of their past three meetings (W1, D2).\nWith all three points tonight, they can equal their club record of five London derby league wins in a season, set in 1931-32 and matched in 1947-48 and 2000-01.\nSutton's prediction: Nottm Forest 1-0 Man Utd\nNottm Forest v Man Utd (20:00 BST)\nI am concerned how Nottingham Forest will cope without Chris Wood up front if he is out injured. At the moment it is not clear how serious his problem is.\nForest made quite a few changes against Brighton in the FA Cup over the weekend, and still got through without 'the Wood-chopper', but they really need him back as soon as possible.\nSpeaking as a Forest fan, it's especially annoying that he has picked up this injury while on international duty.\nNew Zealand have got an excellent cricket and rugby union team and I wish them every success at football, but do they really need Wood to get through their World Cup qualification campaign against the likes of Fiji and New Caledonia?\nI'd argue they don't need him, and that Wood is better than that. If I was from New Zealand, I'd probably have won about 700 caps, and there are greater priorities for Wood, which are to win the FA Cup and get Forest into next season's Champions League.\nIt will be harder for Forest without him, but I still think they can repeat their win at Old Trafford in December.\nSaturday's FA Cup win over Brighton was not exactly a thriller, but as we have seen plenty of times from Forest already this season, they are not here to entertain - they are here to get the job done.\nAs for Manchester United, it is a big end to the season for their boss Ruben Amorim.\nBruno Fernandes has carried them a bit recently in the league, and he is their best hope of getting a positive result here.\nI am not sure either side will be too bothered about having the ball, but Forest fans are happy for them to sit deep and play on the counter, even when they are at home, and they are really good at it.\nSutton's prediction: 1-0\nForest eye history as Man Utd visit\nNottm Forest v Man Utd (20:00 GMT)\nNottingham Forest are looking to complete their first league double over Manchester United since the 1991-92 campaign under Brian Clough, as Ruben Amorim's side make the trip to the City Ground tonight.\nChris Wood, Morgan Gibbs-White and Nikola Milenkovic scored as Nuno Espirito Santo's side edged United 3-2 at Old Trafford on 7 December.\nThird-placed Forest, who are unbeaten in five matches in all competitions and in eight games at home, are also looking to win consecutive home league games against the Red Devils for the first time since 1989-90.\nUnited, 13th, are looking for back-to-back wins in the Premier League for the first time this season.\nAmorim's side are on a four-match unbeaten run but are just one of the three sides yet to win back-to-back games in the league, along with strugglers Ipswich Town and Southampton.\n'Now it's 100% football and our target is clear'\nBrighton v Aston Villa (Wed, 19:45 BST)\nAston Villa\nMore from Aston Villa manager Unai Emery as they look to extend their winning run to five games in all competitions: “A lot of different circumstances we had this season - sometimes injuries, sometimes not getting our performances individually is the reality [behind inconsistency]. At the beginning of the season, we had some players, important players for us, who weren’t fit.\n“We are recovering some injured players, and I think the players are physically well. I don’t want to waste time with my decisions, with the players - everybody is ready and focused.\n“Now it’s 100% football. It’s the last two months and our target is clear. We have a lot of motivation for it but the players have to be very focused in the same way we are trying to set.”\n'We are going to try to achieve three points'\nBrighton v Aston Villa (Wed, 19:45 BST)\nAston Villa\nAston Villa manager Unai Emery on the race for Champions League qualification: \"Thirty-eight matches is when you are finishing and the table is fair for everybody. We are in the last part of the season and every point we achieved and lost before, now is the moment we have to identify how we are, focus on every match and the reality that Brighton have two points [more than us] in a European position.\n“To get Conference League, Europa League or Champions League is the consequences of how we are doing in the season. Brighton are there now and tomorrow is three points for them, three points for us or one point for each team.\n“We’re going to try and prepare to face the match, thinking to achieve the three points. We’re respecting them and being very demanding with how we can achieve it.”\n'We know how difficult last part of season will be'\nBrighton v Aston Villa (Wed, 19:45 BST)\nAston Villa\nAston Villa manager Unai Emery on approaching the final months of the season: “We are excited and demanding ourselves to be focused for the last two months in three competitions. We’re motivated to get our best performances collectively and try to reduce a lot of goals that we conceded.\n“In the last matches, we are getting better. Tomorrow is a very good test again for how we can be more consistent, playing at the level we want to achieve and in the level we are getting at the end of the season to play in the Premier League and achieve top seven, top six or top five.\n“There are a lot of teams there fighting for these positions. In the FA Cup we’re playing a semi-final and in the Champions League a quarter-final.\n\"It's amazing how we are approaching the last part of the season. But we are aware how difficult it is going to be and how much we have to get better.\"", "url": "https://www.bbc.com/sport/football/live/cwy7llp2vg9t"}