{"authors": ["Paul Battison", "www.facebook.com"], "date_download": "2025-05-20 15:02:55", "date_modify": "2025-05-20 15:02:55", "date_publish": "2023-07-27 11:22:35", "description": "After making a triumphant return from injury at UFC London, Tom Aspinall has got the attention of heavyweight champion Jon Jones.", "filename": "sport_mixed-martial-arts_66323853_1747753375.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/DB1E/production/_130549065_splitjones.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_mixed-martial-arts_66323853_1747753375.html", "title": "Tom Aspinall says he's 'affected' UFC heavyweight champion Jon Jones and is 'in his head'", "title_page": "Tom Aspinall says he's 'affected' UFC heavyweight champion Jon Jones and is 'in his head' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tom Aspinall had so many notifications after outclassing Marcin Tybura at UFC London that they crashed his phone.\nFootage shared by UFC president Dana White, in which he described Aspinall's performance as \"damn good\", went viral as the heavyweight made his triumphant return from a serious knee injury.\nThe dominant manor of victory - there is not a single mark on Aspinall's face as he conducts this interview - means there have been a lot of eyes on the Manchester fighter, illustrated by the 20,000 Instagram followers he gained in the following three days.\nBut, there is one person paying particularly close attention to Aspinall, and it is exactly what the 30-year-old wanted.\nThat is UFC heavyweight champion, and arguably the greatest mixed martial artist of all time, Jon Jones.\n\"I'm definitely in his head, it's pretty good. That was my aim,\" Aspinall tells BBC Sport.\n\"I wanted him to know I exist. I wanted him to know I'm a threat. I wanted to motivate him. I want him to want to fight me.\"\nAmerican Jones, 36, is also a former light-heavyweight champion and has lost only once in 29 fights - that sole blemish on his record being a disqualification loss in 2009 to Matt Hamill.\nIn a series of tweets which have now been deleted, Jones appeared to dismiss Aspinall, saying: \"Everyone's the next big thing until I beat them and then it's like, well, who was that guy anyway?\"\nAspinall says it \"feels good to be in his head\".\n\"I think it was pretty funny. I didn't know I could affect him so much mentally, so I'm pretty happy with that. It's good because - I'm not even joking - this time last week, I don't know if he knew that I existed,\" added Aspinall.\n\"He should be worried about me because I've not shown anything of what I can do yet.\"\nAspinall does not undersell the size of a potential heavyweight title bout with Jones.\n\"I think the UFC definitely want it and I'm imagining they would push for Wembley Stadium or something,\" said Aspinall.\n\"I think it would be the biggest UK fight ever and I think me and Jon Jones makes perfect sense if I get one more win.\"\nAspinall adds there are just two potential options before a fight with Jones - Russia's Sergei Pavlovich, or the winner of the fight between Frenchman Ciryl Gane and Sergey Spivak of Moldova, which takes place in Paris on 2 September.\nJones will also have to successfully defend his belt against former two-time champion Stipe Miocic in New York on 11 November to set up any potential clash with Aspinall.\nAspinall stopped Poland's Tybura in the first round at the O2 Arena - the same venue where he suffered a serious knee injury in defeat to Curtis Blaydes a year ago.\nFollowing the win, Aspinall spoke to various media before celebrating at an afterparty.\nIt wasn't until 5am the next morning that Aspinall got some time to himself, where he fell asleep in his hotel room, exhausted.\nWhen he woke up, he finally had time to reflect.\n\"I was just really happy but it was mainly relief. I feel like that was a must-win fight for me,\" said Aspinall.\n\"Obviously coming back from injury I had a lot of doubters, people thought I wouldn't be the same. It's one thing to think you're a lot better, and another to go and show somebody, and I just feel relief I could do it and everyone got to see it.\"\nIn preparation to fight Tybura, Aspinall says all he's done for the past six months is \"eat, train and sleep\".\nFollowing victory, he's begrudgingly allowed himself to relax.\n\"To be honest, I'm a little bit lost without routine, so I have to force myself to have a week off,\" said Aspinall.\n\"In the last two days I've been staying at home and spending time with my kids because I've not seen them properly.\n\"I've been going out my way to eat bad - I don't think I've had anything that's not junk food for the past two days. I've been having pizzas, kebabs, chips... I enjoyed it but I started feeling a bit sick last night.\"\nSince his victory, Aspinall has opened up more about the difficulties he faced in the aftermath of his knee injury.\n\"It was a tough year. It's hard to not be able to do what you love, and not have any goals,\" said Aspinall.\n\"[Having no goals] was the hardest bit for me. Even now, it's been three days since my fight and I'm thinking 'what's next'?\n\"I felt like I'd let everyone down and I struggled with that for a bit. I fell out with the sport for a few weeks. I didn't even watch it and I'm such a fan, [but] I didn't keep up with it on social media at all.\"\nIt wasn't until Aspinall had some friends over, who wanted to watch Gane against Tai Tuivasa last September, that his love for the sport reignited.\nAs Aspinall watched the heavyweights clash, he started to believe he could beat them.\nThat was the start of the shift in Aspinall's mentality.\n\"There's going to be a pre-injury Tom and a post-injury Tom, it's two different people,\" said Aspinall.\n\"I've convinced myself I'm going to be UFC heavyweight champion, simple as that.\n\"I believed it [before] but I had imposter syndrome, maybe. I was just kind of enjoying the journey and I think I was still in disbelief that I got to where I am.\n\"I feel like I'm starting again, it's a new bit of my career. This next seven, eight, nine years or whatever until I retire will be my best.\"", "url": "https://www.bbc.com/sport/mixed-martial-arts/66323853"}