{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:20:03", "date_modify": "2025-05-20 12:20:03", "date_publish": "2023-08-04 21:03:31", "description": "Wigan winger Abbas Miski scores four of his side's 12 tries to gain partial revenge on weakened Challenge Cup finalists Hull KR for last month's painful semi-final defeat.", "filename": "sport_rugby-league_66397938_1747743603.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2E32/production/_130662811_amiski.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-league_66397938_1747743603.html", "title": "Super League: Wigan 64-6 Hull KR - Abbas Miski leads way as Cup finalists ship 12 tries", "title_page": "Super League: Wigan 64-6 Hull KR - Abbas Miski leads way as Cup finalists ship 12 tries - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wigan gained partial revenge for their golden-point Challenge Cup semi-final loss to Hull KR as they destroyed a young, weakened Robins side.\nJust a week before Rovers go to Wembley, the rampant Warriors turned on the style to batter the visitors, just as they did six days ago to the other cup finalists Leigh Leopards.\nWinger Abbas Miski, with four, led the way in Wigan's 12-try romp.\nJai Field joined in the fun with three tries in the last 20 minutes.\nWigan's other five tries came from Joe Wardle, Toby King, prop Patrick Mago, with his first of the season, Harry Smith, who also kicked eight goals for an 18-point individual haul, and Wigan top-scorer Liam Marshall with the last of the night.\nJack Walker went over for the one Rovers try just before the break, improved by Rowan Milnes.\nSince being battered 46-4 in this corresponding fixture a year ago, Rovers had won three of the last four meetings between the two sides - and even the one Wigan triumph in that time was the golden-try 26-22 win at Craven Park in May.\nBut, once Wigan ran in five first-half tries to turn round with a 20-point advantage, there was no way back for a much-changed Rovers team, as they kept their powder dry for Wembley in eight days' time.\nRovers handed a starting place to academy player Louix Gorman and featured three more new faces brought in on short-term loan deals this week.\nOnly two players remained in the starting line-up from the side that put out Matt Peet's Warriors at Headingley two weeks ago to set up a first trip to Wembley since the 50-0 demolition by Leeds in 2015.\nOn a night when Wigan strengthened their grip on second place in Super League - and with Bevan French and fellow Aussie Field in this form - it was only ever a question of how many tries Wigan would score, how much they could improve their points difference - and who won their own private 'try of the night' contest.\nIn the end, the artful French's frenetic zig-zag burst from half-back and reverse offload for the grateful Miski's second try wide on the right was just shaded by the sheer pace and precision passing that got Smith under the posts for a superb team try straight after the break.\nAnd, although it tuned into a badly one-sided contest in the final quarter, Wigan at least stopped short of their Super League record 84-6 win over Rovers at Craven Park 10 years ago.\nWigan head coach Matt Peet:\n\"We did a professional job. It was a different sort of challenge for us and it was quite difficult to prepare the group.\n\"But I want to pay tribute to Hull KR who brought a young and spirited team. They lacked some cohesion and experience, but their performance was honourable. We had to earn our points with some great tries.\n\"There isn't a major flaw in Abbas Miski's game. He's worked so hard. He lets his rugby do the talking. He is just a great advert for perseverance and hard work. He showed the right attitude when he went to Newcastle and he is benefiting from that. He is such a well-rounded player.\nHull KR boss Willie Peters:\n\"The score didn't reflect the effort and how hard the guys competed. It came down to a bit of technical stuff but with Wigan being the quality side that they are, there was a high level of skill there and some really quality tries. It is all about learning for the young guys\n\"The players who weren't playing came into the dressing room before the game. That highlights the connection we've got within the group. They met for dinner beforehand and turned up together.\n\"That's really pleasing to see as a coach. We're heading into a massive game next week - and it's the teams who are most connected that win the big games.\"\nWigan: Field; Miski, King, Wardle, Marshall; French, Smith; Dupree, O'Neill, Ellis, Pearce-Paul, Farrell, Smithies.\nInterchanges: Cust, Mago, Hill, Nsemba.\nHull KR: Walker; Senior, Gorman, C Hall, Barley; Laulu-Togagae, Milnes; Storton, Rouge, Aydin, Johnson, Keinhorst, Hadley.\nInterchanges: Ellis, Tennison, Shaw, Thomas.\nReferee: Aaron Moore (RFL)", "url": "https://www.bbc.com/sport/rugby-league/66397938"}