{"authors": ["Mark Drury", "www.facebook.com"], "date_download": "2025-05-21 04:01:54", "date_modify": "2025-05-21 04:01:54", "date_publish": "2025-01-15 09:56:32", "description": "BBC Radio Tees' Mark Drury on the state of play for Middlesbrough at the halfway point of the January transfer window.", "filename": "sport_football_articles_cx2qpqn9n5jo_1747800114.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3bea/live/71583980-d326-11ef-87df-d575b9a434a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cx2qpqn9n5jo_1747800114.html", "title": "Middlesbrough: Teessiders play waiting game in search for missing spark", "title_page": "Middlesbrough: Teessiders play waiting game in search for missing spark - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "With half of January gone many Middlesbrough fans are looking for the club to kick-start a recruitment drive.\nBoro's flat performance in losing at home to Blackburn Rovers in the FA Cup on Saturday has added to a sense of drift that has been developing in recent weeks.\nMiddlesbrough are unbeaten in their last six Championship games, but four of those have been draws. Two came against struggling sides Boro would expect to beat in Plymouth Argyle and Cardiff City, while the 3-3 draw against Sheffield Wednesday on Boxing Day saw Michael Carrick's side surrender a 3-0 half-time lead.\nBoro want to do business this month and have a decision to make over Emmanuel Latte Lath who is the subject of an offer from MLS side Atlanta United which could total £20 million all told.\nBoro know there is Premier League interest in the striker but how long are they prepared to wait for offers to materialise? For Latte Lath's part, a move to the Premier League would be hard to turn down.\nIsaiah Jones joined fellow Championship side Luton Town last Friday and Liverpool loanee Ben Doak remains on Teesside despite offers for his services from Ipswich Town and Crystal Palace. Boro remain confident Doak is happy and wants to stay but have contingency plans in place.\nBoro's interest in Hull City defender Ryan Giles is part of a drive to reinvigorate the left-hand side of their attack.\nMichael Carrick is a big fan of the full-back who helped himself to 12 assists in Boro's play-off season two years ago. A deal has yet to be done though despite talks having taken place with the Tigers.\nThey also want to sign George Edmundson to a permanent deal. The central defender has been a big hit at The Riverside in the first-half of his season-long loan deal.\nHe's out of contract at Ipswich in the summer but the Tractor Boys are yet to give the green light to his move.\nIn many ways the situation is the same as it was at the start of the month. If Latte Lath leaves, then expect Boro to reinvest that money around the rest of the squad. If he stays, business will be quieter.\nWhichever way things go in the next fortnight, Boro fans need to see some spark return to their play before the huge meeting with derby rivals Sunderland on 3 February.", "url": "https://www.bbc.com/sport/football/articles/cx2qpqn9n5jo"}