{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:20:41", "date_modify": "2025-05-19 15:20:41", "date_publish": "2015-02-09 14:28:52", "description": "Bolton move up to 13th in the Championship as they come from behind to beat Fulham at the Macron Stadium.", "filename": "sport_football_31105894_1747668041.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/80923000/jpg/_80923012_neillennon.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31105894_1747668041.html", "title": "Bolton Wanderers 3-1 Fulham", "title_page": "Bolton Wanderers 3-1 Fulham - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Bolton came from a goal down to defeat Fulham, with on-loan Manchester United midfielder Saidy Janko scoring a spectacular debut goal.\nShaun Hutchinson gave the visitors the lead when he fired in from close range.\nWanderers equalised on the stroke of half-time when Janko's cross was headed home by Eidur Gudjohnsen, before the teenager scored his 25-yard stunner.\nAdam Le Fondre, on loan from Cardiff, completed victory when he capitalised on an error by Marcus Bettinelli.\nIt was a first victory in four games for Neil Lennon's side, who moved up to 13th in the Championship table, while Fulham drop to 18th.\nThe victory might have been more emphatic for Wanderers, who had a strong penalty appeal turned down in the first half when Josh Vela's shot was handled by Nikolay Bodurov.\nThe win was Bolton's first against the Cottagers in eight years, while Gudjohnsen's goal was his side's first against the Londoners in 640 minutes dating back to Ivan Klasnic's strike in 2009.\nBolton manager Neil Lennon:\n\"You would like to think (Janko) was happy but you never know with him because he is so level-headed.\n\"But he assists one and scores a miraculous goal really. Saidy has looked forward to this experience though he was a bit tentative when he first came in. You could see that in the first 20 minutes.\n\"But once he got up and running he was fine. The assist for the goal gave him a huge lift and with young players it is all about confidence.\n\"He tired towards the end, which was understandable, but he can be very satisfied with his debut.\"\nFulham manager Kit Symons:\n\"In the first half I thought we played some really good stuff and were far the better team.\n\"We should have come in leading quite comfortably but then concede a poor goal.\n\"Even then, if we approach the second half in the same manner we would be fine. But we just sat off them for some reason.\n\"We looked nervous on the ball, couldn't keep possession and when we did win it on the edge of our box we just kicked it rather than passing it out and we never got going.\"", "url": "https://www.bbc.com/sport/football/31105894"}