{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:50:34", "date_modify": "2025-04-26 03:50:34", "date_publish": "2025-03-05 12:37:32", "description": "Newcastle news: BBC Radio Newcastle on Alexander Isak's future", "filename": "sport_football_articles_c78eny2vxw6o_1745639434.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1dd8/live/04a9b890-f9a0-11ef-a629-ef88fbd35a13.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c78eny2vxw6o_1745639434.html", "title": "Newcastle news: BBC Radio Newcastle on Alexander Isak's future", "title_page": "Newcastle news: BBC Radio Newcastle on Alexander Isak's future - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Newcastle United should do all in their power to keep striker Alexander Isak.\nThat is the view of BBC Radio Newcastle presenter Simon Pryde, who discussed the topic in the latest episode of BBC Radio Newcastle's Total Sport Newcastle podcast.\nAfter the Magpies' latest financial report showed revenue gains compared with the previous year, chief executive Darren Eales reiterated the club's intention to be at \"the top table\" by retaining their best players.\nPryde agreed with the approach: \"You want your best players and you want to keep your best operators but you never know what is around the corner.\n\"You want to build your side around the best players.\n\"But we have been around football long enough to know there are no guarantees. If someone comes with a ridiculous offer that they can't turn down.\"\nIsak is the third top scorer in the Premier League this season, on 19, only behind Liverpool's Mohamed Salah and Manchester City's Erling Haaland.\nPryde says it is not just his ruthless finishing that makes him so important to Newcastle.\n\"How do you replace someone of that calibre?\" he said. \"This guy doesn't just score goals. This is a guy that creates goals too.\n\"But if he keeps playing the way he is, he will demand a lot more [money].\"", "url": "https://www.bbc.co.uk/sport/football/articles/c78eny2vxw6o"}