{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:29:03", "date_modify": "2025-05-20 14:29:03", "date_publish": "2023-07-29 00:00:00", "description": "Reaction after New Zealand score six tries to beat Australia 38-7 and retain the Rugby Championship.", "filename": "sport_live_rugby-union_66338006_1747751343.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/11380/production/_130582507_gettyimages-1562305912.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_rugby-union_66338006_1747751343.html", "title": "The Rugby Championship 2023: Australia v New Zealand live text updates and latest score as the All Blacks wrap up the title", "title_page": "The Rugby Championship 2023: Australia v New Zealand live text updates and latest score as the All Blacks wrap up the title - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Post\nFT: Australia 7-38 New Zealand\nThere we have it then, the All Blacks ultimately ease to victory over Australia to seal the Rugby Championship trophy with three wins out of three.\nThey scored in devastating bursts at the end of the first half and after the hour mark in the second to blow the Wallabies away.\nIan Foster's men are looking in fine form as they build towards the World Cup in France in September.\nAs for Australia, that's three defeats on the spin for new boss Eddie Jones. Not the start he would have wanted, but there is still time - although not much of it - to put things right.\nThanks for joining us!\nWallabies 'gutted' by defeat\nFT: Australia 7-38 New Zealand\nAustralia skipper Tate McDermott said his team were \"gutted\" by the defeat.\n\"It's just disappointing,\" he said.\n\"83,000 people turned up to support us and we didn’t give them much.\n\"When we’re direct we're at our best and we didn’t do that enough tonight,\" added McDermott, who took on captaincy duty following a serious looking injury to Allan Alaalatoa.\nRetaining trophy 'means everything'\nFT: Australia 7-38 New Zealand\nWinning captain Ardie Savea said he was proud to keep hold of the Bledisloe Cup.\nThe All Blacks continue their dominance of the trophy, which they have held since 2002.\n\"We talked about being alive and we thought that once we started moving and seeing space we could take it and we continued to do it.\n\"The Aussie forward pack were dominating as well and it was going back and forth.\n\"It means everything to have the Bledisloe Cup for another year.\"\n'Let down the crowd'\nFT: Australia 7-38 New Zealand\nAustralia prop Angus Bell thanked the crowd for coming out in their numbers, and said defeat was hard to take.\n\"We trained hard and we tried to put in a performance.\n\"We let down the crowd and let down Australia but they are a great team.\n\"We worked so hard and we have to come back next week.\n\"We will try harder, get better and come back again.\"\nA reminder that these two face each other again next week in Dunedin in the second Bledisloe Cup match.\n'We had fun out there'\nFT: Australia 7-38 New Zealand\nAll Blacks winger Will Jordan said he \"had fun out there\" in the post-match interviews - and you can see that in the way he plays.\n\"It's a good feeling. The boys have built well and when you come here it's a real challenge as the Wallabies were trying to be physical.\n\"There’s a good feeling in the group and we're building well.\n\"They fronted up well and it as about being patient.\n\"In the second half we got going and it was good fun out there.\"\nDisallowed try\nAustralia 7-38 New Zealand\nRichie Mo'unga thinks he has another!\nBut referee Wayne Barnes says no and looking at the replay you can see why.\nMo'unga chases his own kick but just pushes the covering Marika Koroibete before the Wallaby gathers the ball to stop him collecting it and it will be ruled out.\nA close call but Barnes was sure and made the decision quickly.\nPost\nAustralia 7-38 New Zealand\nAnother lesson in just how quickly the All Blacks can take a game away from the opposition completely.\nThey can accumulate points so swiftly - that was three tries in about eight minutes.\nThey had spent the opening 20 minutes of the half defending!\nThey are looking very good and a lot of teams will have a concerned look on their face watching this ahead of the World Cup.\nSin-bin Taniela Tupou (Australia)\nAustralia 7-19 New Zealand\nTaniela Tupou has been struggling for some time and the big man is finally replaced.\nIt looked like he should have gone off sooner to be honest, it looks like a rib injury and he's been grimacing after every action.\nAnd on that, they look at a replay of his final tackle on the pitch - it's deemed high and he is yellow-carded while sat on the bench.\nNot a great few minutes!", "url": "https://www.bbc.com/sport/live/rugby-union/66338006"}