{"authors": ["Amy Canavan", "www.facebook.com"], "date_download": "2025-04-26 07:55:40", "date_modify": "2025-04-26 07:55:40", "date_publish": "2025-02-25 12:45:33", "description": "'You never get sick of Scotland' - Gibson urges youngsters to 'embrace it'", "filename": "sport_articles_ckg1x8ejrn1o_1745654140.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a606/live/7ab378b0-f2fb-11ef-8d2a-918847665a3c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_ckg1x8ejrn1o_1745654140.html", "title": "'You never get sick of Scotland' - Gibson urges youngsters to 'embrace it'", "title_page": "'You never get sick of Scotland' - Gibson urges youngsters to 'embrace it' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "When Lee Gibson made her Scotland debut over seven years ago, Scotland team-mate Mia McAulay was still in primary school.\nSo it's safe to say the goalkeeper is one of the more experienced members of Michael McArdle's squad.\nThe Glasgow City shot-stopper survived McArdle's wholesale changes, where nine members of the squad who took on Finland in the failed Euro 2025 play-off final were omitted from this group to take on Austria and the Netherlands.\nSix uncapped players were named - including McAulay, who has since returned to Rangers - so what advice does the 33-year-old have for the fresh faces in camp?\n\"I'd just say embrace it,\" Gibson said before Scotland host the Dutch on Tuesday night.\n\"There's nothing better than coming into your national team, especially the A squad.\n\"I've been fortunate enough to be around it for quite a significant period of time now, and you don't get sick of it.\n\"There's nothing better than meeting up with the girls that come here. A lot of them become your really close friends and second family.\"\nWhile the family feel runs throughout the squad, Gibson added the \"goalkeeper's union here is excellent,\" after she was recently replaced by Eartha Cumings, before returning between the Scotland sticks at Josko Arena in Friday's defeat.\nGibson started the first leg of Scotland's play-off semi-final against Hungary, and kept a clean sheet, but was surprising replaced by Rosengard's Cumings for the return leg as well as the final against Finland.\nGibson admitted it was \"disappointing\" but says Cumings \"deserved the opportunity just as much\".\n\"Eartha had had an incredible season, and I back everybody that goes on that pitch that they're going to do a job. Eartha played really well,\" Gibson said.\n\"You need to make sure you can be resilient and try and push past that. I'm thankful that I've had another opportunity.\"", "url": "https://www.bbc.co.uk/sport/articles/ckg1x8ejrn1o"}