{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 15:05:18", "date_modify": "2025-05-20 15:05:18", "date_publish": "2023-07-27 09:53:09", "description": "Arsenal: Declan Rice in team 'so hungry to win'", "filename": "sport_articles_c25gp0pg4kyo_1747753518.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d543/live/15f096d0-2c62-11ee-b1c9-1dd55dd6407d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c25gp0pg4kyo_1747753518.html", "title": "Arsenal: Declan Rice in team 'so hungry to win'", "title_page": "Arsenal: Declan Rice in team 'so hungry to win' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Arsenal's investment in the squad during the summer transfer window could leave Manchester City \"in more trouble\" in the Premier League than they were last season.\nThat is the view of former Tottenham defender Stephen Kelly, after new record-signing Declan Rice said his aim was to \"win trophies\" with the Gunners.\nSpeaking to BBC Radio 5 Live's Football Daily podcast, Kelly said: \"It shows Declan Rice feels Arsenal are in a position in which they can challenge and really challenge for trophies.\n\"He’s got one under the belt at West Ham which he probably thought he wasn’t going to do, so he’s in a position now where he has actually won something, he’s got something over the line with that Europa Conference League trophy and now he goes into an Arsenal side that are just so hungry to win.\n\"I just feel they are missing a centre-forward. A centre-forward completes the puzzle and then you think City are in more trouble than they were last year because the energy Arsenal possess to go and press teams now high up the pitch I think is pretty frightening. Then you have the back up of Rice covering the ground, Thomas Partey if he plays, it just makes for a very exciting team.\"", "url": "https://www.bbc.com/sport/articles/c25gp0pg4kyo"}