{"authors": ["Dave Woods", "www.facebook.com"], "date_download": "2025-05-19 15:27:30", "date_modify": "2025-05-19 15:27:30", "date_publish": "2017-08-06 23:30:22", "description": "Toronto's Jack Bussey tells 5 live's Rugby League podcast he feared death after learning he had thyroid cancer - but was soon back playing.", "filename": "sport_rugby-league_40846295_1747668450.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5661/production/_97231122_jack_bussey3_bbcrex.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_rugby-league_40846295_1747668450.html", "title": "Jake Bussey: Toronto loose forward feared for life after cancer diagnosis", "title_page": "Jake Bussey: Toronto loose forward feared for life after cancer diagnosis - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Toronto Wolfpack rugby league forward Jack Bussey feared for his life after he was told he had thyroid cancer.\nBut only weeks after a diagnosis that threatened to shatter his world, the Englishman has made an astonishing recovery and is back playing.\nBussey, 24, was shocked as doctors decided to do tests on a lump in his throat when he had a viral infection.\n\"You hear the word and you think the worst,\" the loose forward, 24, told the BBC Radio 5 Live Rugby League podcast.\n\"At first, they didn't know what it was. Then after further tests, they confirmed it was cancerous.\n\"I didn't really take it as well as I could. I kind of bottled it up inside. I was scared.\n\"I couldn't comprehend what they were saying. I was thinking: Is my career over? Am I going to die?\n\"I was pretty scared at the time for my immediate future and my long-term future.\"\nBussey, who began his career with Featherstone and then moved to London Broncos before joining Toronto, had an operation in May to have the thyroid glands taken out, and surgeons told him the cancer had been removed.\nA month later he was back playing rugby league, resuming his role as one of the Toronto's key players as they push for an history-making promotion from League One at the first attempt.\n\"I have to take drugs every day for the rest of my life. But I'd rather take the drugs than have the cancer,\" Bussey said.\nWhen he was first diagnosed he kept his ordeal from his parents, his girlfriend and his team-mates.\n\"I only told my brother because I speak to him about everything,\" he said. \"But I didn't want them to worry about me. It was to protect them. I was putting on a brave face for them.\n\"Then I finally broke down at one of our training sessions when I was talking to one of the physios.\n\"The boys and the coaching staff couldn't have been better. I keep them in the loop now because they are like family to me.\n\"The doctor who performed the surgery on me said it's very unlikely to happen to someone like me. It's normally the over-50s - and normally females over 50 - who contract something like this.\"\nHe now has a permanent reminder of his cancer scare - a 10cm scar across his neck as a result of the operation.\n\"It looks like somebody has tried to cut my throat,\" he said. \"I've had a few comments on it. I actually don't mind it. At first I was trying to put oil on it every day to try to get the scar down, but now I'm bit proud to have it.\n\"Every time I look at it, I just think about what was in me and now its gone and I've battled it.\n\"Getting back on to the field just felt great.\"\nIt is likely that Bussey's eventful year will end in promotion to the Championship - one tier away from Super League.\nThe Canadians - rugby league's first transatlantic side - have only lost once this season in League One. Last weekend's 68-0 win at Workington put them three points clear at the top with only five games remaining.\nFour of those matches will be at home at the Lamport Stadium in Toronto in an atmosphere described as 'unique' by Bussey.\n\"It's crazy,\" he said. \"The matches themselves, I can't explain the experience, it's totally different.\n\"The crowd come in all the way through the game and afterwards they stay around. There's a DJ there, there's music going to get the crowd on their feet.\n\"They are getting used to the game now and they're picking up on what's good and what's bad and when there's a big hit they go crazy.\n\"I can only see it going forward in Canada. It's great.\"", "url": "https://www.bbc.com/sport/rugby-league/40846295"}