{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:11:13", "date_modify": "2025-05-21 04:11:13", "date_publish": "2024-12-29 00:00:00", "description": "Simon Murray scores two headers in Paisley to end Dundee's run of three straight Scottish Premiership defeats and finish 2024 on a high.", "filename": "sport_football_live_c3dxm2y5yvpt_1747800673.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c3dxm2y5yvpt_1747800673.html", "title": "St Mirren vs Dundee: Scottish Premiership report, reaction & stats", "title_page": "St Mirren vs Dundee: Scottish Premiership report, reaction & stats - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Dundee \"stood up to the critics\", says manager Tony Docherty, after Simon Murray scored two headers at St Mirren to end their run of three straight Scottish Premiership defeats and finish 2024 on a high.\nThe striker netted in each half either side of Toyosi Olusanya's equaliser as St Mirren suffered their first loss in four.\n\"There were some critics, and I asked the boys to stand up to that,\" Docherty told BBC Scotland. \"It's something that doesn't surprise me as it's something that we've done time and time again.\n\"When the chips are down and questions are asked, I've got a good dressing room in there. That's what spirit is all about.\"\nAfter a couple of consecutive wins by the same score line, St Mirren were on the wrong end of a 2-1. However, that does not tell the whole story.\nThe hosts dominated possession for the majority of the match and will feel as though they deserved more.\nOlusanya found himself in behind Dundee's backline just after half-time at 1-1, but lost balance and battered his effort into the wrong side of the side-netting.\nThe hosts then continued to threaten thereafter before Murray's second took the wind out of their sails.\nAlthough Stephen Robinson's side failed to back up the Boxing Day heroics that helped to shock Rangers, they will still finish 2024 inside the Premiership's top six.\nTony Docherty got his reward for a brave switch to a 3-4-3 formation as he opted to start with three number nines in Simon Murray, Seb Palmer-Houlden and Oluwaseun Adewumi.\nAlbeit an attacking XI on paper, Dundee struggled to gain control. St Mirren enjoyed more possession, had more shots and looked likelier before Murray's winner.\nHowever, despite surrendering control of the midfield, Docherty's decision to have his three strikers on the pitch paid off.\nMurray will rightfully get the headlines but Palmer-Houlden and Adewumi did a great job of occupying St Mirren's back three.\nThis forced the hosts' wing-backs to retreat, allowing more space for Finlay Robertson and Josh Mulligan to throw crosses into the box from wide areas.\nUltimately, both goals came from crosses and Dundee close 2024 with an important three points.\nSt Mirren manager Stephen Robinson: \"It's disappointing after the run we've been on.\n\"It's two second-phase set plays, I didn't see Dundee scoring. They went very direct, which is their prerogative in these conditions.\n\"These are the hard ones after the euphoria of the other night [against Rangers].\n\"It looked like a tired performance but we've been on a very good run. This doesn't take away that it's still one of the best starts [to a season] in a long, long time.\"\nDundee manager Tony Docherty: \"I'm massively proud of the players and the team.\n\"Within 20 minutes we lost both centre backs and the easiest thing for the players to do was to feel sorry for themselves but they dug out and got a result.\n\"At half-time I said: 'we need to do more, we need to win ugly,' and we did that.\n\"I couldn't be more proud of the players. Some wins are bigger than others and I think that's a big win.\"", "url": "https://www.bbc.com/sport/football/live/c3dxm2y5yvpt"}