{"authors": ["Emma Sanders", "www.facebook.com"], "date_download": "2025-05-21 03:47:26", "date_modify": "2025-05-21 03:47:26", "date_publish": "2025-02-01 09:01:23", "description": "Life in the WSL has been tough so far for Crystal Palace, but manager Laura Kaminski knew what was coming.", "filename": "sport_football_articles_c5y2dz8qq0jo_1747799246.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cb8d/live/4165c2d0-dffe-11ef-b1b3-51355c7a67fc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c5y2dz8qq0jo_1747799246.html", "title": "WSL: Crystal Palace manager Laura Kaminski on making memories", "title_page": "WSL: Crystal Palace manager Laura Kaminski on making memories - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Crystal Palace are enduring a tough start to life in the Women's Super League, but manager Laura Kaminski knew what was coming.\nHaving experienced England's top tier as an assistant coach at Tottenham, Kaminski is not new to its challenges.\nBut it is a first season in the WSL for Palace and last season's Championship winners have struggled with the step up, sitting bottom of the table with one victory in 12 matches.\n\"There were no surprises for me. I set the bar so there was no element of panic and I knew what was coming,\" Kaminski told BBC Sport.\n\"I researched everything I could. I knew it would be more difficult to stay up than it would be to get up.\n\"I think it would be one of the best achievements in the game if Crystal Palace manage to [stay up this season].\"\nDespite the gulf between England's top two tiers, the 37-year-old Kaminski has embraced this season's challenge.\n\"When you are at this level, it's more difficult. It's more pressured in terms of the complexity of the problem,\" added Kaminski.\n\"It's about making sure I am working at the right level. When you are not getting better – or there are not difficult days – you are not working at the right level.\n\"It's a bit gruelling while it's happening in the moment, but there are huge signs of progression.\n\"People ask me whether I predict games we can take points from, but that would mean I'm writing my team off against [other teams].\"\nThe Palace manager has worked her way up the pyramid from \"after-school clubs and Sunday mornings\" to the elite level.\nShe has taken inspiration from former Spurs bosses Karen Hills and Juan Carlos Amoros and believes in the fundamentals of grassroots football.\nAnd her values remain the same, no matter what level she coaches at.\n\"There must be a hunger to put your body on the line, to make big saves, to stop counter-attacks, to show pace, aggression and intensity,\" said Kaminski.\n\"Those are the things I love about football. I love it when players step up to be brilliant individually and when they score goals in the top bins!\n\"I watched many managers. People will always make mistakes so you can learn from them and turn that into your brand. I always knew I was capable - but I didn't rush.\n\"That has been key in ending up where I am now. I have taken my time. I just wanted to be on the grass and working with good players. Eventually it fell into place.\"\nAmid the gruelling day-to-day demands of being a WSL manager, Kaminski does allow a bit of fun.\nShe regularly checks in on her players, encouraging them to have hobbies outside football - something she says is crucial in helping them to focus.\n\"I enjoy humour but that doesn't affect my standards. All that does is foster and strengthen bonds. I think am a very approachable person,\" she said.\n\"I want players and staff, every day, to want to be here and know that they are valued. I want them to have great memories of this club.\n\"I never want to lose that. Those relationships and bonds are important and what keeps us fighting every week.\n\"It is as relevant now as when I was working in grassroots football. It's the core of what we do.\"\nKaminski insists she is only focused on this season at Palace.\nHowever, she hopes there is a bright future for the club and wants to repay them for the support they have showed in her personal development.\n\"We have a vision of staying up. We want to build a sustainable club that can cope at the top level of the women's game,\" said Kaminski.\n\"The club has already heavily invested in an academy for girls' football. In three years' time, if I see an academy graduate make their debut, I won't say I will 'clock off' but it means we have done a very good job.\n\"Every manager wants to win trophies and titles. I'd love to see Palace get in the pecking order for that and lift themselves up the table in the future.\n\"The club really does deserve for somebody – which is currently me – to commit to it fully. I am doing everything I can to be better to give back to the club.\"", "url": "https://www.bbc.com/sport/football/articles/c5y2dz8qq0jo"}