{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:27:05", "date_modify": "2025-05-21 05:27:05", "date_publish": "2025-04-03 11:22:40", "description": "Portsmouth boss John Mousinho says Pompey have deserved more points away from Fratton Park than they have earned this season.", "filename": "sport_football_articles_cewg2qdzzgyo_1747805225.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/86c1/live/bad62c40-107d-11f0-8c6c-d990c1c0e96b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cewg2qdzzgyo_1747805225.html", "title": "Portsmouth FC: Pompey deserved more away from home says Mousinho", "title_page": "Portsmouth FC: Pompey deserved more away from home says Mousinho - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "John Mousinho feels Pompey have deserved more points for their efforts on the road this season and hopes they can prove it in the final weeks of the campaign.\nThe Blues have lost nine of their past 10 games on their travels and taken only 10 points from 19 away games all season long - 23rd overall in the Championship.\nThey sit five points clear of the drop-zone ahead of a trip to Millwall on Saturday (15:00 BST) and visit Coventry, Norwich and Sheffield Wednesday before the end of the season, with three games at Fratton Park.\n\"I've felt we've definitely been in games,\" Mousinho told BBC Radio Solent.\n\"If I cast my mind back I think we deserved to probably win the game at Sheffield United, not just draw it, but we ended up losing.\n\"We beat Oxford, then we had the disappointment at Preston. That was probably the culmination of going 'we've been decent enough away from home but have not been picking up the points we deserve and need to pick up.'\n\"That's a big part of the frustration - we're in games. When we get blown away, we get blown away, hopefully we're on a better track now and have put steps in place to try and ensure that doesn't happen.\n\"We've been in games and we now need to convert those into points.\"", "url": "https://www.bbc.com/sport/football/articles/cewg2qdzzgyo"}