{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:31:22", "date_modify": "2025-05-21 07:31:22", "date_publish": "2025-03-29 00:00:00", "description": "Relive Saturday's Championship action as Swansea score an injury-time equaliser to draw with Leeds, while Burnley win.", "filename": "sport_football_live_cgq9l5jgn10t_1747812682.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cgq9l5jgn10t_1747812682.html", "title": "Championship: Leeds held by Swansea and miss out on going top; Burnley win - as it happened", "title_page": "Championship: Leeds held by Swansea and miss out on going top; Burnley win - as it happened - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Who'd be a goalkeeper?\nThat's as far as we go here today on another hectic Championship Saturday.\nLeeds missed the chance to go back to the top of the table after conceding a last minute equaliser to Swansea in a game where Whites goalkeeper Illan Meslier saved a penalty and then gifted the Swans a goal.\nSheffield United, who beat Coventry 3-1 on Friday, will have enjoyed the final score at Elland Road almost as much as any travelling away fan.\nDown at the bottom Luton gave their survival hopes a massive shot in the arm with a 1-0 win at fellow strugglers Hull City.\nWe'll be back on Tuesday with action from Leagues One and Two and then Derby v Preston from the Championship on Wednesday.\nIf you want to keep going with the football now then switch over here for the FA Cup quarter-final between Brighton and Nottingham Forest.\nCheers!\nComing up next...\nWe'll be back with another EFL live text on Tuesday night, where Leagues One and Two will take centre stage.\nChampionship action returns on Wednesday when struggling Derby host Preston.\nThe Rams have seen a few of the teams just above them in the fight to stay in the Championship slip up today and a fourth successive win would see them climb out of the bottom three.\nLeeds were rusty - Farke\nFT: Leeds 2-2 Swansea\nLeeds United manager Daniel Farke told BBC Radio Leeds:\n\"It was obvious to see what happened today. It was a typical first game after an international break, it was a scruffy game. We weren't at our best.\n\"The team was more or less not together for two weeks, we just had one training session.\n\"We spoke at half-time about shaking off the rustiness of the international break and we were much better in the second half.\n\"We reacted fantastically to their [first] equaliser. We found the next gear and the substitutions made an impact.\n\"We took the risk bringing Willy [Gnonto] on and it looked like it was written for him to score the winner.\"\n'The main thing is the win' - Parker\nFT: Burnley 1-0 Bristol City\nBurnley\nBurnley boss Scott Parker told BBC Radio Lancashire: \"The main thing is we won. We were exceptional for 45 minutes.\n\"We should go in two or three-nil up. We missed some big chances, but we created them and looked a real threat and a top team.\n\"In the second half, we had some big moments but didn't execute them.\n\"There is always - at 1-0, at the back end of the game - a worry. It's tricky because they have nothing to lose and load the top line with five or six players. The game can become a little bit edgy.\n\"But overall I am delighted with the way we performed. They are an in-form team and we knew it was going to be a tough test. I am really impressed with the way we performed.\"\n'A point is the least we deserved' - Sheehan\nFT: Leeds 2-2 Swansea\nSwansea City\nSwansea caretaker head coach Alan Sheehan told BBC Radio Wales: \"To come here and have an absolute nightmare start, we let the spaces become too big and then they are in our box, a couple of ricochets and it's a goal.\n\"Then after that, we get a penalty and miss it, another setback. How do we respond to that? We hit the post and it bounces back into the keeper's arms. How do you respond to that?\n\"Do you back off or go toe-to-toe with a team like this? We want to be able to go toe-to-toe in the right moments and be as brave as we can be.\n\"How we did it with the setbacks we had in this game, one point is the least we deserved coming to the best team in the division.\"\n'We were sloppy at times' - Manning\nFT: Burnley 1-0 Bristol City\nBristol City\nBristol City boss Liam Manning speaking to BBC Radio Bristol following his side's 1-0 defeat to Burnley at Turf Moor: \"You want to test yourself against a good team.\n\"I am proud of the lads for fighting to the end. The group have been terrific at that this season.\n\"Burnley are a very good side with great depth, but I know we are capable of playing better so that's why there is frustration there.\n\"We blocked shots, put our bodies on the line and kept going to the end but we were a sloppy at times and a bit careless with the ball.\n\"They created a lot of chances. As the games goes on, you think 'can we nick a point here', but it wasn't to be.\"\n'This is the first time I felt good' - Manhoef\nFT: Stoke 3-1 QPR\nStoke City\nStoke City's Million Manhoef told BBC Radio Stoke:\n\"This is the first time I've played 90 minutes. At the end of the game of course I felt tired but it's the first time for this and I'm very happy. This is the first time where I felt good.\n\"Also, I was sick for a week, my ankle was blown up so it was not how I wanted to come back but it's getting better and now I'm fit, happy to score and happy to play a good game from the start.\n\"I think since I came back I didn't play good from the start so I'm happy to have that back and now I want to keep going.\"\n'We probably need to be more clinical'\nFT: Middesbrough 2-1 Oxford\nOxford United\nOxford United manager Gary Rowett told BBC Radio Oxford: \"I think the frustration is we started the game really well. I thought the formation caused them a lot of problems early on.\n\"We score a goal and have three absolutely huge chances on the back of that.\n\"We probably need to be more clinical knowing that the forwards Middlesbrough have got, at some point there's an opportunity with the one bit of quality gets them back in the game.\"\n'We chased the game well' - Carrick\nFT: Middlesbrough 2-1 Oxford\nMiddlesbrough\nMiddlesbrough manager Michael Carrick told BBC Radio Tees:\n\"It was a good second half. Credit to the boys, it's not easy when you're having a slow one.\n\"It was a bit sticky, bit frustrating first half. We spoke about it at half-time, the importance of staying positive.\n\"It's easy to get down and frustrated and pick out the problems but I thought there were chances for us to create and we stayed positive and that's what I liked the most.\n\"I thought we chased the game well, controlled it, kept counter-pressing, kept the ball in their half and I thought we fully deserved the win in the second half.\"\n'Disappointing to lose on a set-play' - Neil\nFT: Sunderland 1-0 Millwall\nMillwall\nMillwall manager Alex Neil told BBC Radio London: \"It was a hard-fought game, I didn't think there was a lot in the game.\n\"The disappointing thing from our point of view is when you come to Sunderland, the last thing you should do is lose the game on a set-play.\n\"We're a big strong side and we didn't deal with it well enough, which cost us the match.\"\nLe Bris concerned penalty woes could haunt Black Cats\nFT: Sunderland 1-0 Millwall\nSunderland\nSunderland head coach Regis Le Bris talking to BBC Radio Newcastle about his side's penalty problems after Luke O'Nien saw his effort saved in the win over Millwall:\n\"It's tough. For the end of the game, the second goal would have been easier for us and we couldn't relax until the end.\n\"At the moment, our percentage of success is really low and we have to find a solution.\n\"This is the best situation to score and so far we only score one out of five.\n\"We'll talk about it next week because maybe we'll have a penalty shoot-out at the end of the season and if we work like that, the chances won't be high.\"\n'We can give it a late push' - Thorup\nFT: Norwich 1-0 West Brom\nNorwich City\nNorwich head coach Johannes Hoff Thorup told BBC Radio Norfolk: \"The players definitely think we can give it a late push and based on that, we needed a win.\n\"Knowing that we will be without a left-back for probably the rest of the season was one of the reasons behind the different approach because last time we played against West Brom, (Tom) Fellows on the right side created problems for us.\n\"When you decide to have a five in the backline instead of four, you probably lose a bit of intensity in the first line of your pressing game and that's what we had to accept and do what it takes to be compact as a team.\n\"At the end of the day, everyone just wants to see us win so we do what is necessary - it's not my favourite kind of football, but I'm not that stubborn, not to do what it takes once in a while to get a result.\"\n'We dealt with everything Blackburn threw at us'\nFT: Portsmouth 1-0 Blackburn\nPortsmouth\nPortsmouth manager John Mousinho speaking to BBC Radio Solent: “I’m delighted with the result and the performance was good in patches.\n“I thought we did about enough to win the game but there is plenty we could do better, the nervousness we displayed after going a goal up was probably married up with the occasion of how we have been the past few weeks.\n“I was furious with us before the international break, we were better today and we dealt with everything Blackburn threw at us.\n“There’s loads we can improve on but to be honest at this stage of the season it’s just about winning the game.”\n'We need to take more risks' - Ismael\nFT: Portsmouth 1-0 Blackburn\nBlackburn Rovers\nBlackburn Rovers boss Valerien Ismael speaking to BBC Radio Lancashire: “It was a big disappointment, especially how we approached the first half.\n“We knew it would be difficult at the beginning with the pressure and energy, the injury changed our rhythm early on.\n“We finished the first half better with some great chances and the second was better - we played with more confidence but we still need to believe more because we have the quality.\n“We need to be more dangerous on the ball, we need to take more risks, the last 15 minutes there were too many backwards and square passes.”\n'A cruel day for us' - Mowbray\nFT: Norwich 1-0 West Brom\nWest Bromwich Albion\nWest Brom boss Tony Mowbray told BBC WM: \"I thought the team played extremely well, as good as in my time here, with the control that we had. \"Norwich are a good team with some special individuals but we generally kept them pretty quiet, their keeper was forced to make more saves than ours. \"There's lot to be pleased with but what matters in football is the result at the end of the day and we're all left frustrated and disappointed. \"Sometimes you don't get what you deserve in football and we definitely didn't, it was a cruel day for us.\"\n'Incredibly proud of the performance' - Bloomfield\nFT: Hull City 0-1 Luton\nLuton Town\nLuton Town boss Matt Bloomfield told BBC Three Counties Radio:\n\"We've got to be incredibly proud of the performance today. We started well, hit the post and had a couple of good chances.\n\"Being the away side, there's a time when you're going to have to defend and we did that.\n\"The goal was obviously extremely fortunate but in terms of our performance, the endeavour, the way the boys are playing, the shape, there's a lot to be pleased and proud about.\n\"The fans want to see our boys' grit and determination. That's what our club stands for and they saw that today.\"", "url": "https://www.bbc.com/sport/football/live/cgq9l5jgn10t"}