{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:53:20", "date_modify": "2025-04-26 07:53:20", "date_publish": "2025-02-25 14:04:37", "description": "Graham Potter press conference: West Ham vs Leicester preview", "filename": "sport_football_articles_ckg8xxqp2nko_1745654000.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/414f/live/cdf05660-d19f-11ef-9fd6-0be88a764111.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_ckg8xxqp2nko_1745654000.html", "title": "Graham Potter press conference: West Ham vs Leicester preview", "title_page": "Graham Potter press conference: West Ham vs Leicester preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Potter was asked about the fitness of Vladimir Coufal and Lucas Paqueta: \"Both players are progressing but won't make the squad on Thursday. Vladi certainly has a chance for Newcastle and Lucas, we'll just have to see how he responds but certainly for Leicester no.\"\nOn Maximilian Kilman as a leader: \"It is something he can develop more. I am pretty sure that is how he has indicated it himself. If the team functions well and the environment is good, people become more able to lead. That is certainly the case with Max. He absolutely has the potential.\"\nOn Aaron Wan-Bissaka's form: \"He has been really impressive. I think the wing-back role helps him a lot. It brings the best out of him. He can do both sides of the game, he is working away and I am delighted to have him.\"\nOn the weekend off after the mid-week Leicester game: \"I think we will do a combination of a couple of things. We will make sure everyone is recovering properly and then we have time to build up to the next match. We will have to make sure we use the time wisely.\"\nOn Leicester: \"In the Premier League every game is complicated and tough. The opponent has always got something to fight for, always got something to prove, some quality against you. That is the case with Leicester, they will be looking to turn their fortunes around. That is how football is, it's great. Just when you think there is no way forward something can come up and just when you think you've got it cracked, something can come around and kick you. You have to have a respect and humility for the opponents which we have.\"", "url": "https://www.bbc.co.uk/sport/football/articles/ckg8xxqp2nko"}