{"authors": ["Emily Salley", "Emma Sanders", "www.facebook.com"], "date_download": "2025-05-21 05:26:36", "date_modify": "2025-05-21 05:26:36", "date_publish": "2025-01-31 20:45:58", "description": "It has been one of the biggest Women's Super League transfer windows in history - but what impact will Chelsea's spending have?", "filename": "sport_football_articles_c0lz9pz383jo_1747805196.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/400c/live/7812eee0-e010-11ef-a819-277e390a7a08.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c0lz9pz383jo_1747805196.html", "title": "What do Chelsea signings mean for Blues and rest of WSL?", "title_page": "What do Chelsea signings mean for Blues and rest of WSL? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It has been one of the biggest Women's Super League transfer windows in history - but what impact will Chelsea's spending have?\nThe WSL leaders have invested in their women's team and are reaping the rewards, picking up five successive league titles and competing in the Champions League.\nThey have strengthened even more in January, bringing in USA defender Naomi Girma for a world-record fee, and adding England midfielder Keira Walsh from Barcelona in another big-money move.\nChelsea's rivals will not be pleased at how successful a window the club have had.\nNot only have Chelsea added two world-class players to their ranks, they have managed to swoop under their rivals' noses to get them.\nWalsh had been pursued by Arsenal, who had a then-world record bid turned down by Barcelona in September, while Lyon had offered over $1m (£806,428) for Naomi Girma.\nTheir two additions are significant assets and will help them in search of a first Women's Champions League title.\nWhat is perhaps most pleasing for Chelsea is that they have proven how attractive the club is and it is not all about money, though clearly having the means to spend has helped.\nLyon offered Girma higher wages than Chelsea but the USA defender felt the intensity of the competition in the WSL - albeit Chelsea have a strong seven-point lead currently - was better and she was sold on their long-term ambitions.\nWith Girma and Mayra Ramirez, plus another big-money deal agreed to sign Walsh, Chelsea will have the WSL's three most expensive players on their payroll.\nFormer England captain Steph Houghton said she was \"undecided\" whether the fee paid for Girma was a \"good thing\".\n\"My worry is that it is going to be two or three teams that are buying the best players, so what happens to the rest of the league?\" Houghton said.\nLeicester City manager Amandine Miquel argued that the WSL could become similar to the French top division where Lyon have won 17 of the last 18 titles.\n\"I should think any club would love to have no limits and some coaches are lucky enough to be at clubs that have no limits. Good for them,\" Miquel said.\nHowever, Miquel recognised that Girma's hefty price tag could be a lesson that encourages other clubs to invest heavily in players to avoid being left behind.\n\"It's not ideal but it can also maybe give the other clubs intention to try and build the same thing,\" Miquel added.\nEx-England striker Ellen White added: \"Every team in the WSL needs to think 'do we want to be on this train or not?' because otherwise Chelsea will be running away with this for years.\"\nMeanwhile, Manchester United boss Marc Skinner said the world-record fee showed how far women's football has grown.\n\"I wasn't old enough to be able to remember the first million pounds men's transfer but it shows a significant growth and for me, someone who's been in the women's game for 20-plus years now, it's a great sign of growth,\" he said.", "url": "https://www.bbc.com/sport/football/articles/c0lz9pz383jo"}