{"authors": ["Nick Mashiter", "Mandeep Sanghera", "www.facebook.com"], "date_download": "2025-05-21 07:17:50", "date_modify": "2025-05-21 07:17:50", "date_publish": "2025-05-20 09:50:06", "description": "Leicester City are referred to an independent commission by the Premier League for an alleged breach of English Football League financial rules during the 2023-24 Championship season.", "filename": "sport_football_articles_cnv113m0n4qo_1747811870.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/369b/live/c57e6ef0-3562-11f0-bf15-094eef773db0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cnv113m0n4qo_1747811870.html", "title": "Leicester City referred to commission by Premier League over alleged EFL financial breaches", "title_page": "Leicester City referred to commission by Premier League over alleged EFL financial breaches - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Leicester City could face a future points deduction after being charged with an alleged breach of the English Football League's financial rules.\nThe Foxes have been referred to an independent commission after being charged by the Premier League for an alleged profit and sustainability (PSR) breach for the year 2023-24, when they were in the Championship.\nThe new charge follows a lengthy arbitration process over who holds jurisdiction over Leicester, with the club bouncing between the Championship and Premier League in recent seasons.\nA tribunal has now ruled the Premier League has the power to charge Leicester, who have been relegated from the top flight and will play in the Championship next season.\nThe timeline of the case should still come under the Premier League's 12-week fast-track process, meaning any possible points deduction, depending on the outcome of the case, could come in Leicester's season in the Championship in 2025-26.\nBut football finance expert Kieran Maguire told BBC Sport he believes it is unlikely a punishment would be imposed on Leicester while they are in the second tier because the Premier League and EFL are separate entities.\nThe independent commission will also assess two further alleged breaches by the Foxes; that they failed to provide accounts to the Premier League by 31 December, 2024, and that they did not \"provide full, complete and prompt assistance to the Premier League in response to the league's inquiries\".\nPremier League clubs cannot lose more than £105m over three years but the figure is reduced by £22m for every season a club spends outside the top flight.\nLeicester's latest accounts showed a loss of £19.4m for the period ending 30 June, 2024.\nIn their 2022-23 accounts Leicester confirmed an £89.7m loss while in the 12 months up to May 2022 they lost a club record £92.5m.\nThose figures do not take into account 'add backs' - costs such as building infrastructure and investing in women's football that the Premier League and EFL view as in general interests of clubs.\nLeicester, who this season have been relegated to the Championship for the second time in three years, said: \"The club intends to engage co-operatively in this matter now that the Premier League's jurisdiction has been established for the period ending FY24 [financial year 2024).\"\nIn April last year, Everton were docked two points after an independent commission found the club had breached PSR by £16.6m for the three-year period to 2022-23 having already been hit with a 10-point penalty - reduced to six on appeal - a few months before for a 2021-22 breach.\nNottingham Forest were also given a four-point deduction in March 2024 for a breach.\nAt the centre of the tribunal decision were two contrasting decisions.\nLeicester won an appeal in September 2024 against an alleged breach of Premier League PSR rules for the 2022-23 season.\nAn independent panel found the Premier League did not have the jurisdiction to punish the Foxes as the club had been relegated to the Championship when their accounting period ended on 30 June 2023.\nThe Premier League said at the time it was \"surprised and disappointed\" by the panel's decision, while Leicester said they had \"simply sought to ensure that the rules are applied based on how they are actually written\".\nTuesday's latest tribunal ruling said the jurisdiction decision on the 2022-23 case was wrong, but that it would not overturn it because it \"was not a perverse interpretation of the law\".\nThe Premier League tightened its rules, external in April so that clubs were still bound by its rules even if they were relegated.\nThe EFL said it noted the referral of Leicester to the independent commission, having passed the matter to the Premier League.\nFootball finance expert Kieran Maguire\nIt does look as if the Premier League will now pursue a commission for an alleged PSR breach for the three years ended 30 June 2024.\nThe EFL could, separately, pursue a similar case against Leicester for the three years ended 30 June 2025 should Leicester's financial results end up exceeding the EFL PSR limit, which will be £83m over that period.\nLeicester and Bournemouth have previously been found guilty of breaches of EFL PSR rules after they were promoted to the Premier League, and in both cases were given fines.\nHad Leicester accepted a points deduction at the start of the season in relation to historic breaches it would not have made much difference to their relegation battle, although they would have potentially finished 19th instead of 18th and received £3m less prize money from the Premier League.\nWhile the Premier League and EFL are in dispute over financial distribution, their willingness to co-operate more in terms of the rules and regulations relating to promoted and relegated clubs will make it more difficult for Leicester's original success in avoiding charges by either organisation harder to replicate.", "url": "https://www.bbc.com/sport/football/articles/cnv113m0n4qo"}