{"authors": ["Alex Howell", "www.facebook.com"], "date_download": "2025-05-20 14:30:19", "date_modify": "2025-05-20 14:30:19", "date_publish": "2023-07-29 07:36:37", "description": "Mikkel Damsgaard tells BBC Sport he is ready to put his \"frustrating\" first year behind him as he looks to help Brentford push for their European \"dream\".", "filename": "sport_football_66344229_1747751419.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/FAC5/production/_130579146_gettyimages-1572104334.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66344229_1747751419.html", "title": "Brentford: Mikkel Damsgaard aiming to help fill Ivan Toney void", "title_page": "Brentford: Mikkel Damsgaard aiming to help fill Ivan Toney void - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Mikkel Damsgaard says he is ready to put his \"frustrating\" first year behind him as he looks to help Brentford push for their European \"dream\".\nThe 23-year-old attacking midfielder signed for the Bees in August last year from Sampdoria for £12.6m.\nHe arrived with a burgeoning reputation - not least after his free-kick against England in the Euro 2020 semi-finals.\nHowever he had a difficult start to life in London after arriving following a significant period out injured.\nDamsgaard had been diagnosed with reactive arthritis, a condition that makes the joints swell after an infection in the body, the previous season.\nThe Denmark playmaker only stopped taking medication before the World Cup in November - but is feeling like he is back to his best as Brentford prepare for the new season in the United States as part of the Premier League Summer Series.\n\"It was a tough period, but I got over it. So I'm happy and healthy now and really happy to be playing football every day with no problems,\" he told BBC Sport.\n\"Physically I didn't feel good. Even though I was training every day and I didn't necessarily have any problems, it was just my mind was going faster than what my legs could move, so it is very difficult and very frustrating to make mistakes you don't usually make.\n\"It was also a big step from Italy to the Premier League and English football, and just the overall training level is so much harder and higher quality.\n\"So it's a big step and I had to have some time to get used to it. So, of course it was very frustrating for a while, but I think I developed a lot that year. I've got so much better now.\"\nBrentford finished ninth in the Premier League last season, just two points away from European qualification and Damsgaard says it was a positive experience to be part of the squad, even if things didn't going to plan personally.\n\"It was just amazing to be part of this team. Even though in the beginning it was frustrating, the football part of it.\n\"It's just a very fun team, very good guys and I feel like I have a genuine relationship with them,\" he added.\nNow his focus is on performing even better this coming season.\n\"You want to do better than last season and everybody dreams of playing in Europe,\" he said.\nIn the build up to the matches in pre-season, manager Thomas Frank has named Damsgaard as a key part of his Brentford plans this season.\nFrank is looking for players to step up as they will be without Ivan Toney, who scored 20 Premier League goals last season, until January following his ban for breaching FA betting rules.\n\"In Ivan we had a very solid player and we always knew what are were going to get from him, he's an amazing player,\" Damsgaard said.\n\"Of course it's going to hurt us for him to be out. But we also have some very good strikers with some other qualities that are ready to step in and fill the roles\n\"My hope for the season is to show I have improved a lot and create a lot more chances, score some goals and assists - really be an asset for the team. That's my goal. I'm just trying to be the best player I can be.\"", "url": "https://www.bbc.com/sport/football/66344229"}