{"authors": ["Elizabeth Hudson", "www.facebook.com"], "date_download": "2025-05-20 12:20:56", "date_modify": "2025-05-20 12:20:56", "date_publish": "2023-08-04 20:37:01", "description": "Faye Rogers wins Para Swimming World Championship gold - two years after being told her sporting career was over.", "filename": "sport_disability-sport_66407617_1747743656.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/06BE/production/_130662710_gettyimages-1592483270.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_disability-sport_66407617_1747743656.html", "title": "Para Swimming World Championships: Faye Rogers wins first global title", "title_page": "Para Swimming World Championships: Faye Rogers wins first global title - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "After being told she would never swim again, Faye Rogers defied the odds to win her first gold for Great Britain at the Para Swimming World Championships.\nThe 20-year-old was a competitive non-disabled swimmer before a car accident in 2021 led to an arm impairment.\nBut she discovered she was eligible for Para-swimming and set a new European record to win the S10 100m butterfly.\n\"I am so grateful to have the opportunity to do what I am doing,\" Rogers told BBC Sport in Manchester.\n\"Being on this journey makes the gold medal worthwhile.\"\nIt was one of two golds for Britain on the fifth night of competition with Bethany Firth retaining her title in a thrilling S14 200m individual medley final.\nRogers, who hails from Stockton-on-Tees but is based at the University of Aberdeen, where she studies biochemistry, had already won bronzes in the S10 400m freestyle and SM10 200m individual medley at her maiden World Championship.\nBut she has focused a lot of attention on the butterfly and her winning time of one minute 5.48 seconds beat the 1:06.94 European best she set earlier this year.\n\"When I first got injured, my consultant said I would never be able to swim and I would not be able to do butterfly at the level I had been. So to be here and still swimming and doing fly is crazy,\" Rogers added.\n\"I was adamant I was going to get back into swimming - it wasn't optional - but it became clear that the impairment was having an impact on my stroke so my coach asked about whether I had thought about Para swimming and here we are.\n\"I have worked really hard on my butterfly and while I was hoping for PBs and maybe a medal, to win three medals is way bigger than what I expected.\"\nNorthern Ireland's Firth was involved in a fierce battle with 16-year-old Aira Kinoshita of Japan in her final, winning by just 0.15 seconds for her second gold and third medal of the week, with British team-mate Poppy Maskill in third.\nThe 27-year-old Firth thanked her team for their support during the competition.\n\"A lot of people don't see what goes on behind the scenes, but it means a lot to be here to win gold and stand on the podium,\" she said.\n\"I had to dig deep, but I think having that competition and pushing the times on make it so much more exciting.\n\"Because I am older, we are working on a two-year programme so this was always a stepping stone into Paris and there is more to come.\"\nThere were also silvers for Grace Harvey (SB5 100m breaststroke), Alice Tai (S8 50m freestyle), Ellie Challis (S3 50m freestyle), Stephen Clegg (S12 100m freestyle) and newcomer Rhys Darbey (SM14 200m medley) while Toni Shaw took bronze in the S9 400m freestyle.", "url": "https://www.bbc.com/sport/disability-sport/66407617"}