{"authors": ["Phil McNulty", "www.facebook.com"], "date_download": "2025-05-21 05:43:47", "date_modify": "2025-05-21 05:43:47", "date_publish": "2025-04-02 23:34:51", "description": "Aston Villa's match-winners against Brighton prove they are reaping the rewards of their January business, writes Phil McNulty.", "filename": "sport_football_articles_cjr741wgyn9o_1747806227.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/47e0/live/17d44720-1019-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cjr741wgyn9o_1747806227.html", "title": "Aston Villa's ambition bucks January transfer trend in glory hunt", "title_page": "Aston Villa's ambition bucks January transfer trend in glory hunt - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Aston Villa and manager Unai Emery are reaping the rewards for bucking the trend that states the January transfer window is high risk and rarely offers value.\nIf proof were needed, it came in the vital 3-0 win at Brighton that pushed Villa towards the Premier League's top four - with an FA Cup semi-final against Crystal Palace at Wembley and a Champions League quarter-final with Paris St-Germain already on a packed agenda.\nVilla's second-half goals all came from players who arrived at the club in January, the perfect advert for a fiercely ambitious manager in Emery and the progressive thinking of co-owners Nassef Sawiris and Wes Edens.\nMarcus Rashford's renaissance since being rescued from exile at Manchester United was illustrated again when he broke the deadlock with his first Premier League goal for Villa, following his first strikes for the club in Sunday's FA Cup quarter-final win at Preston North End.\nMarco Asensio, on loan from PSG, doubled the lead with 12 minutes left before Donyell Malen, a £19m January acquisition from Borussia Dortmund, put the icing on the cake in front of Villa's ecstatic supporters right at the end of 10 minutes of added time.\nRashford may have claimed most of the spotlight with his re-emergence from the Old Trafford wilderness, but the experienced Asensio has had even more impact and provides Villa and Emery with a close acquaintance with the highest prizes at former club Real Madrid.\nThe 29-year-old Spain midfielder won La Liga and the Champions League on three occasions each with Real, also winning Ligue 1 and the Coupe de France with PSG before falling out of favour under coach Luis Enrique after scoring seven goals in 47 appearances.\nEmery has been a long-time admirer of Asensio and the midfielder has been high on his wish list. He was delivered in January to stunning effect.\nSince signing, the Spaniard has made 10 appearances for Villa with only four starts, but has scored eight goals, provided one assist and created 10 chances.\nAsensio has been instrumental in Villa's march to the Champions League quarter-final, scoring from the penalty spot after coming on as a substitute in the 3-1 last-16 first-leg win at Club Brugge.\nHe made an even more significant contribution in the second leg at Villa Park, scoring twice in a 3-0 victory after again coming on as a substitute.\nHe provided an impact off the bench once more at Brighton, sliding in a powerful finish to effectively seal the win that sees Villa leapfrog the Seagulls into seventh place in the Premier League.\nAsensio brings priceless big-match expertise to a Villa side that went into unknown territory in this season's Champions League, albeit under European specialist Emery - who won the Europa League three times at Sevilla, again at Villarreal and even guided Arsenal to the final in what is regarded as an unsuccessful time in north London.\nRashford has now made 11 appearances with six starts. The 27-year-old has three goals and has created 19 chances in 607 minutes on the pitch.\nMalen's Villa career has been more of a slow burner, but his confidence will be boosted by a fine substitute performance capped with a goal.\nThere was undoubtedly an element of gamble about Villa's work in January, but it is paying off as their season moves towards a potentially glorious conclusion fuelled by their work in this month.\nIt is a strategy reflected in results, with Villa's latest win putting them just three points behind fourth-placed Manchester City in the table with eight games left.\nBefore Rashford and Asensio made their league debuts, Villa had played 24 games, winning 10, drawing seven and losing seven with a points-per-game ratio of 1.54.\nIn the league games since, they have played six, won three, drawn two and lost one at 1.83 points per game - with both players making crucial contributions in the FA Cup and Champions League.\nIt remains to be seen if Villa can persuade - or indeed want - Asensio and Rashford to extend their stays, but the results in the short term are bringing rich dividends.\nIn a January window often characterised by panic buys and a desire to correct errors from the summer window, Villa have played it smart and can move towards the season's conclusion with huge optimism and expectation.", "url": "https://www.bbc.com/sport/football/articles/cjr741wgyn9o"}