{"authors": ["Scott McCarthy", "www.facebook.com"], "date_download": "2025-05-21 05:44:15", "date_modify": "2025-05-21 05:44:15", "date_publish": "2025-01-14 12:34:08", "description": "Brighton news: Opinion - Fabian Hurzeler praised after FA Cup victory", "filename": "sport_football_articles_cvgp3ryev10o_1747806255.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8a79/live/45186dc0-b628-11ee-8f07-bbfdfa890097.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cvgp3ryev10o_1747806255.html", "title": "Opinion - Fabian Hurzeler praised after FA Cup victory - BBC Sport", "title_page": "Brighton news: Opinion - Fabian Hurzeler praised after FA Cup victory - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "On a third round weekend featuring hardly any upsets, low crowds at a number of ties, and with the scandalous lack of replays still a talking point, some have proclaimed the magic of the FA Cup dead.\nTry telling that to Brighton fans, players, management - and in particular Solly March. The world's greatest cup competition remains just that after this weekend to those with Seagulls connections.\nOver 2,500 Albion supporters made the journey to Norwich on a day when rail replacement buses across Suffolk and Norfolk made getting there difficult.\nThey were rewarded by Fabian Hurzeler playing the strongest possible XI available to him. The youngest permanent manager in Premier League history he might be, but Hurzeler showed the sort of respect to the FA Cup which many of his older contemporaries should learn from.\nThe message from Hurzeler was clear - Brighton want to go far in this competition. The result of taking the game seriously was Georginio Rutter playing himself back into form with a brace and Julio Enciso ending a 20-month wait for an Albion goal. Both good FA Cup storylines in their own right for Brighton.\nBut the real magic came from March. Hurzeler introduced the popular homegrown winger from the bench on 71 minutes. It was just his second substitute appearance after 14 months out caused by the second ACL injury of his career, requiring two knee surgeries to fix.\nThere had been genuine fears March might not play again. Yet here he was, scoring an exquisite curling effort from outside the box with his first touch only three minutes after coming on. It was the sort of fairy tale moment the FA Cup specialises in.\nHurzeler said afterwards the goal and the celebrations which followed gave him goosebumps. Imagine how Herr Hurzeler will feel if March is the man bagging the winner at Wembley on 17th May.", "url": "https://www.bbc.com/sport/football/articles/cvgp3ryev10o"}