{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:43:46", "date_modify": "2025-05-20 12:43:46", "date_publish": "2023-08-03 14:02:49", "description": "Shrewsbury Town sign two players in one day - striker Max Mata from League of Ireland side Sligo Rovers and Port Vale defender Mal Benning.", "filename": "sport_football_66395746_1747745026.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/110FA/production/_130628896_gettyimages-1546725784.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66395746_1747745026.html", "title": "Shrewsbury Town sign striker Max Mata and defender Mal Benning", "title_page": "Shrewsbury Town sign striker Max Mata and defender Mal Benning - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Shrewsbury Town have made two signings by bringing in ex-Walsall, Mansfield and Port Vale defender Mal Benning plus New Zealand striker Max Mata from League of Ireland side Sligo Rovers.\nBenning, 29, had been in talks over a new deal at Shrews' fellow League One side Vale after two seasons in Burslem.\nHe has signed a one-year deal, while Mata arrives on a three-year contract, subject to international clearance.\nThe 23-year-old has scored 11 goals in 23 games for Sligo this season.\nMata, who has seven senior caps for the All Whites, started his career in his native New Zealand but also played in Switzerland, Estonia and America before moving to Ireland.\nBenning needs to play just seven more games to reach 400 senior appearances in a career that began at Walsall and also included two months on loan at York before moving on to Mansfield in 2015.\nShrewsbury, 12th in League One last season, have had a major summer upheaval, having parted company with manager Steve Cotterill, chief executive Brian Caldwell, and brought in Micky Moore as their first director of football, Matt Taylor as head coach and Marcus Bignot as his number two.\nThey have now made 11 signings heading into Saturday's opening game at home to Cheltenham Town.", "url": "https://www.bbc.com/sport/football/66395746"}