{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:55:10", "date_modify": "2025-04-26 06:55:10", "date_publish": "2025-02-28 15:42:24", "description": "Cliftonville midfielder Rory Hale says Saturday's Irish Cup quarter-final against Crusaders is a huge game for both sets of players.", "filename": "sport_articles_cvgeev90265o_1745650510.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/dbef/live/6e5a0380-f5ea-11ef-86a6-15c2bb2c0119.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cvgeev90265o_1745650510.html", "title": "'If you can't get up for this you shouldn't be playing' - Hale", "title_page": "Irish Cup: 'If you can't get up for this you shouldn't be playing' - Hale - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Cliftonville midfielder Rory Hale says the players involved in Saturday's Irish Cup quarter-final against derby rivals Crusaders at Seaview should require little motivating.\nThe Reds are aiming to successfully defend the trophy they won by defeating Linfield in last year's showpiece decider at Windsor Park.\n\"It's a massive game - away to Crusaders, Irish Cup quarter-final - if you can't get pumped up for those sort of games you shouldn't be playing football,\" Hale told BBC Sport NI.\nCliftonville go into the knockout meeting with their neighbours on the back of a 2-0 win over Glentoran last weekend, a result which has given them a boost after an inconsistent run of league form.\n\"We've got a bit of confidence from that win over the Glens and we hope we can bring it into Saturday,\" added the influential Reds midfielder.\nCrusaders, Irish Cup winners in both 2022 and 2023, have won six of their past seven matches in all competitions, a fact not lost on Cliftonville manager Jim Magilton.\n\"It's a mouth-watering tie against a team who are on a wonderful run - we're keen to overcome that because we're desperate to hang onto that trophy,\" said the Reds boss.\n\"It's one of those that when it comes out of the hat you recoil a little but for the neutral and for the Irish Cup it's a magnificent game.\n\"It's a quarter-final against your nearest rivals away from home and it's all hands to the pump. It's about showing that character and resilience that's in the team. It's a great tie to look forward to.\"\nCrusaders manager Declan Caddell meanwhile is a firm believer in the old adage that form goes out the window for derby ties.\n\"We've been on a good run of late, trying to build that momentum and we've been finding different ways to win, which is really pleasing.\n\"But momentum goes out the window when it's a north Belfast derby - it's a huge game of football and so much at stake for both teams.\n\"We'll both do our homework, both prepare well and the better team will come out on top on the day.\"\nSaturday's other Irish Cup quarter-finals see Carrick Rangers host Dungannon Swifts and Championship side Ards at home to Premiership strugglers Loughgall.", "url": "https://www.bbc.co.uk/sport/articles/cvgeev90265o"}