{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:36:06", "date_modify": "2025-04-26 07:36:06", "date_publish": "2025-02-27 14:51:56", "description": "Derby County loan midfielder David Ozoh has his season ended by a thigh injury.", "filename": "sport_football_articles_c0rzz7z9rjzo_1745652966.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/83cb/live/110168e0-f518-11ef-a276-596f7e6218f8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c0rzz7z9rjzo_1745652966.html", "title": "David Ozoh: Derby County loan midfielder out for rest of season", "title_page": "David Ozoh: Derby County loan midfielder out for rest of season  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Derby County midfielder David Ozoh has had his season ended by a thigh injury.\nThe on-loan Crystal Palace teenager was carried off the Pride Park pitch on a stretcher on Saturday after being hurt in the last minute of normal time against Millwall, who then went on to score a 95th-minute winner.\nHe was making just his fifth appearance since returning to action after four months out with hamstring and quad muscle problems.\nIt was also his first appearance under head coach John Eustace, who says losing the 19-year-old is a \"big blow to the group\".\n\"He is a fantastic player,\" Eustace told BBC Radio Derby. \"In my short period of working with him, you can see he has great qualities.\"\nOzoh was limited to just seven appearances in his first six months with the Rams, with his injury issues starting with a hamstring problem suffered in September.\nIn those seven matches, however, he established himself as an instant favourite among Rams fans for the way he influenced early performances on Derby's return to the Championship after two seasons in League One.\nAnd while Eustace will not be able to call on Ozoh on the pitch, the head coach says the teenager will still have a part to play off it.\nThe midfielder will stay with the second tier side, rather than return to Selhurst Park, as he recovers from his latest injury.\n\"He is a lovely lad and he will be great around the rest of the players now,\" Eustace said. \"We didn't want to lose him because of his manner and personality.\"\nMeanwhile, Eustace says the injury that forced centre-back Matt Clarke off against Millwall is \"not as bad\" as first feared.\nStill, Clarke is said to be \"touch and go\" to be in contention to feature in Saturday's match against Middlesbrough, the club he left in January to re-join the Rams for a third time.\nDerby, who have lost 10 matches in a 12-game winless run across all competitions since late December, are just one place and one point above rock bottom Luton Town.", "url": "https://www.bbc.co.uk/sport/football/articles/c0rzz7z9rjzo"}