{"authors": ["Matthew Howarth", "www.facebook.com"], "date_download": "2025-05-21 04:08:22", "date_modify": "2025-05-21 04:08:22", "date_publish": "2025-02-01 15:33:26", "description": "Nottingham Forest 7-0 Brighton: Seagulls pay price for defensive horror show", "filename": "sport_football_articles_c8051y0g340o_1747800502.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c02e/live/9ca9ed70-e0b1-11ef-8730-856886153d9d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c8051y0g340o_1747800502.html", "title": "Nottingham Forest 7-0 Brighton: Seagulls pay price for defensive horror show", "title_page": "Nottingham Forest 7-0 Brighton: Seagulls pay price for defensive horror show - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Fabian Hurzeler fielded an attacking team at the City ground, restoring Georginio Rutter and Yankuba Minteh to an XI that also featured Joao Pedro, Danny Welbeck and Kaoru Mitoma – who was the subject of a failed bid from Saudi club Al-Nassr late in the transfer window.\nBefore the game, Hurzeler said he wanted to \"dominate\" Forest and there was no shortage of attacking intent from the visitors early on – but those efforts were undermined by a defensive horror show.\nMorgan Gibbs-White and Anthony Elanga were given far too much space in the lead-up to Forest's first and third goals of the afternoon, while Gibbs-White also managed to outjump both Welbeck and Tariq Lamptey for the home side's second.\nHurzeler replaced Jack Hinshelwood, Mitoma and Pedro with Matt O'Riley, Simon Adingra and Diego Gomez at the interval, but if Brighton's fans thought things could only get better in the second half, they were wildly mistaken.\nElanga was allowed to dart into the penalty area unchallenged to set up Wood's second, while Lamptey can have few complaints at referee Simon Hooper's decision to point to the spot after dragging Gibbs-White to the floor just a few minutes later.\nVerbruggen's stoppage-time clearance into the feet of Jota Silva summed up a truly miserable afternoon for Brighton, who suffered their heaviest league defeat since a 9-0 loss at Middlesbrough on the opening day of the 1958-59 Second Division season.", "url": "https://www.bbc.com/sport/football/articles/c8051y0g340o"}