{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:55:13", "date_modify": "2025-05-21 06:55:13", "date_publish": "2025-03-29 16:10:59", "description": "Godwinson wins the Lincoln Handicap by a nose in a thrilling finish at Doncaster on the opening day of the 2025 British flat racing season.", "filename": "sport_horse-racing_articles_cvgwg2rvrkgo_1747810513.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/19bb/live/804fa5d0-0cb6-11f0-97e3-3568f3d0bae1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_horse-racing_articles_cvgwg2rvrkgo_1747810513.html", "title": "Doncaster results: Godwinson wins Lincoln Handicap by nose", "title_page": "Doncaster results: Godwinson wins Lincoln Handicap by nose - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Godwinson won the Lincoln Handicap by a nose in a thrilling finish at Doncaster on the opening day of the 2025 British flat racing season.\nRidden by Cieren Fallon for trainer William Haggas, Godwinson (17-2) made a late charge to pip two rivals - Oliver Show (22-1) and Orandi (13-2) - on the line.\nIn a packed field of 22 runners, Oliver Show and Orandi accelerated clear of the pack late on and looked set to battle it out for victory.\nBut Fallon timed his run to perfection aboard Godwinson to give Haggas his fifth career winner in the Lincoln and first since Addeybb in 2018.\n\"We'd have definitely been unlucky [if we didn't win],\" winning jockey Fallon told ITV Racing.\n\"He is a horse that has been working well and he's been unlucky. In the end, it went as well as we hoped...\n\"I always knew I was going to be very competitive. It was on the line, he got his head down.\"\nMr Professor, who won this race in 2024, finished 13th.\nEarlier at Doncaster, 50-1 shot Pearl Eye won the Spring Mile Handicap, ridden by Jason Watson for trainer Darryll Holland.\nThunder Roar (25-1) was initially given the victory when the two crossed the line, but the result was later reversed in Pearl Eye's favour.", "url": "https://www.bbc.com/sport/horse-racing/articles/cvgwg2rvrkgo"}