{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:48:04", "date_modify": "2025-05-21 07:48:04", "date_publish": "2025-05-18 19:06:30", "description": "Ospreys and Scarlets accuse the Welsh Rugby Union of making a U-turn after the governing body announced it will move away from a model of four evenly funded professional sides.", "filename": "sport_rugby-union_articles_cj42n4gyn4wo_1747813684.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cad1/live/503f8250-33d7-11f0-96c3-cf669419a2b0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cj42n4gyn4wo_1747813684.html", "title": "Ospreys and Scarlets accuse WRU of funding U-turn", "title_page": "Welsh rugby crisis: Ospreys and Scarlets accuse WRU of funding U-turn - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ospreys and Scarlets have accused the Welsh Rugby Union (WRU) of making a U-turn after the governing body announced it will move away from a model of four evenly funded professional sides.\nWRU bosses say they now intend to implement a new two-tier funding system, a decision which Ospreys and Scarlets say has \"created more destabilising and debilitating uncertainty in our game\".\nOspreys and Scarlets did not sign up to Welsh rugby's new Professional Rugby Agreement (PRA) by the deadline of 8 May.\nThe agreement was signed by Dragons and Cardiff, who were last month taken over by the WRU having served formal notification that they intended to enter administration.\nLast week Ospreys and Scarlets said they had asked the WRU for assurances that the takeover \"will not disproportionally benefit Cardiff and disadvantage the independent clubs\".\nAfter Ospreys and Scarlets had not signed, WRU have served a two-year notice on the current agreement that underpins the Welsh professional game.\nThat current PRA runs out in 2027 although it was due to be superseded by the new five-year deal.\nOn Sunday, the WRU released a statement saying that with those clubs not signing by the deadline set, it had therefore taken the \"difficult but necessary decision to issue the formal two-year notice to terminate the current PRA agreement in order, in particular, to proceed with its debt refinancing.\"\nThe governing body made the announcement amid reports it intends to cut a team from its professional tier.\nThe WRU has neither confirmed nor denied if cutting a team is part of its plans.\nThe Ospreys and Scarlets have joined forces in a statement to outline their thoughts.\nThe statement read: \"We are concerned and disappointed to read the WRU outlining a sudden change in its strategy of four equally-funded professional clubs in Wales.\"\n\"This U-turn has now created more destabilising and debilitating uncertainty in our game, with pertinent questions being asked by stakeholders across our clubs and within our communities regarding the future framework and landscape for professional rugby in Wales.\n\"The very foundations both the 'One Wales' strategy and new PRA (2025) are based upon have now changed dramatically and without full consultation.\n\"This goes back on recent commitments made to the clubs and to Welsh rugby fans.\n\"The future framework and landscape for professional rugby in Wales matters to us all.\"\nThe two Welsh regions urged the WRU to provide \"more clarity and detail\" on the decision.\nThe statement continued: \"We want to know the 'opportunity' that it wishes to seize and to inform us what the process will be for a new system and model for Welsh rugby and how they intend to deliver it.\n\"We need a unifying position and coherent strategy that allows us to continue to compete and grow as professional clubs in Wales.\n\"As professional clubs, we share the same passion, focus and hope for a better and more sustainable future for our game in Wales, which has been impacted significantly in recent years.\n\"We are key contributors to the success of Welsh rugby and remain committed to working constructively and collaboratively with the WRU to find solutions that support the game across our country and ensure a level playing field for all.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/cj42n4gyn4wo"}