{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:09:12", "date_modify": "2025-04-26 07:09:12", "date_publish": "2025-03-03 00:00:00", "description": "Nottingham Forest book an FA Cup quarter-final trip to Brighton with a penalty shootout win over Ipswich.", "filename": "sport_football_live_cly884qy9z9t_1745651352.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/db3d/live/8025cd60-f883-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_cly884qy9z9t_1745651352.html", "title": "Nottingham Forest 1-1 Ipswich: Matz Sels penalty shootout save sends Forest to quarter-finals", "title_page": "Nottingham Forest 1-1 Ipswich: Matz Sels penalty shootout save sends Forest to quarter-finals - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Nottingham Forest booked an FA Cup quarter-final trip to Brighton after a penalty shootout win over Ipswich.\nKeeper Matz Sels was the hero, saving Jack Taylor's low effort as the hosts went through 5-4 on spot-kicks after Ryan Yates had cancelled out visiting striker George Hirst's opener to force extra time.\nWatching England manager Thomas Tuchel - preparing for his first squad announcement next week before World Cup qualifiers with Albania and Latvia - may not have gleaned much from a dull game, which struggled to get going until the second half.\nTaylor's miss was the only one in the shootout, with the midfielder having also missed a penalty when Ipswich were upset by League Two AFC Wimbledon in the Carabao Cup in similar fashion back in August.\nForest also beat League One Exeter 4-2 in a shootout in the fourth round and victory continues their sensational season.\nTheir attention now turns to the Premier League and securing Champions League qualification. Nuno Espirito Santo's third-placed side host Manchester City on Saturday, with the reigning champions just a point behind in fourth spot, and a cluster of clubs chasing both of them.\n\"Every FA Cup draw we have to practice penalties,\" said Nuno. \"We kept the same order as Exeter.\n\"We did really well, they were good penalties. I believe it makes part of the game preparations. It's dedication.\n\"It's not nice [to watch] at all, anxiety, nervous, a mixture of emotions. I try not to watch and just wait for the noise.\"\nWhile playing in next season's Champions League is a dream, the FA Cup offers Forest a chance of a trophy and their first win in the competition since 1959.\nThey were marginally the better side as Ipswich, third bottom in the league, are now left to focus solely on their battle for survival.\nWith the last-eight draw providing a trip to Brighton, Kieran McKenna's side had hoped to add to their 1978 triumph despite their league woes, and claimed the opener at the City Ground.\nThe tie was brought to life eight minutes after the break when Sels tipped Sam Morsy's shot over and, from the resulting Ben Johnson corner, Hirst stooped to head in his third goal of the season.\nIt came in front of Scotland boss Steve Clarke with the uncapped forward eligible via his grandfather.\nIpswich's lead lasted just 15 minutes, though, as Yates levelled with a close-range header from Anthony Elanga's lovely cross.\nThe Forest skipper, who has spoken about his hopes for an England call-up, had a second disallowed for offside as his side poured forward.\nCallum Hudson-Odoi hit the bar for the hosts, but extra time came and went with Sels' save decisive and sending Forest through.\nIt was Forest's second successive penalty shootout win in the FA Cup after their fourth-round success at Exeter.\nThey were nerveless from the spot then and it was a repeat, ruthless show at the City Ground with five unstoppable penalties.\nBelgian Sels shone again, having saved Reece Cole's effort at Exeter for a 4-2 victory on spot-kicks.\nAlex Palmer in the Ipswich goal had no chance as Chris Wood, Morgan Gibbs-White, Elliot Anderson, Neco Williams and Hudson-Odoi rifled well-placed shots past him.\nAfter burying his effort – Forest's second penalty - Gibbs-White went to Sels in a show of unity, something which has been the cornerstone of the club's season so far.\nThe City Ground banded together to will the hosts over the line after they struggled to hit top gear during normal and extra time.\nFor Ipswich, it was a 16th trip to Forest without a victory, with their last coming in 1999. They have also been eliminated from each of their last 14 FA Cup ties against Premier League opponents since beating Blackburn Rovers in the 1995-96 campaign.\nTown boss McKenna confirmed defenders Axel Tuanzebe and Cameron Burgess suffered hamstring and calf injuries having come off at half-time, and will be doubts for Saturday's league game at Crystal Palace.\nBut he said: \"It was a high-quality shootout. The players will come in with renewed confidence with the way they competed, renewed belief in the squad and the way we are working.\n\"They will have good feelings from the performance. The biggest challenge is how we recover physically and how we recover for Saturday [at Palace].\n\"It's a really disappointing way to lose the game but it can happen in a penalty shootout. One team is going to be on the wrong end of a really tough way to lose the match.\"", "url": "https://www.bbc.co.uk/sport/football/live/cly884qy9z9t"}