{"authors": ["Stephan Shemilt", "www.facebook.com"], "date_download": "2025-05-21 04:41:13", "date_modify": "2025-05-21 04:41:13", "date_publish": "2025-04-03 08:55:14", "description": "Equalising pay of women and men in The Hundred is a realistic ambition, says Professional Cricketers' Association chief executive Daryl Mitchell.", "filename": "sport_cricket_articles_cgm8v24p3x0o_1747802473.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/142f/live/2b5658e0-1007-11f0-a851-e1dd6a174ba8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cgm8v24p3x0o_1747802473.html", "title": "The Hundred: Equal pay 'realistic', says Professional Cricketers' Association chief Daryl Mitchell", "title_page": "The Hundred: Equal pay 'realistic', says Professional Cricketers' Association chief Daryl Mitchell - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Equalising pay between women and men in The Hundred is a realistic ambition, according to Professional Cricketers' Association chief executive Daryl Mitchell.\nThe England and Wales Cricket Board (ECB) has not implemented a recommendation from the Independent Commission for Equity in Cricket for equal pay in the competition by this year.\nIndeed, the pay gap between top men's and women's players has widened from £75,000 to £135,000, a move that \"looks bad\", according to former England women's captain Heather Knight.\nBut there is optimism the pay gap will close after sales of stakes in the eight Hundred teams were agreed in February.\n\"There is work to do on the commercialisation of women's sport. It's probably the biggest growth area, not just in cricket, but any sport,\" Mitchell told BBC Sport.\n\"Hopefully, we'll be sat here in 10 years' time with a commercial reality that it's on an equal footing to men's sport, it's watched by similar numbers of people around the world and Sky pay the same amount they do for men's cricket. I don't see why that shouldn't be the ambition.\n\"Equal pay is a realistic ambition, certainly, and it should be the ambition to make it that way.\"\nThe large disparity between the top men's and women's players came as part of a salary increase designed to attract leading men's players to The Hundred.\nAlthough salaries increased across the board, it was the top men's bracket that was given the biggest hike, up from £125,000 to £200,000.\nThe sales of stakes in The Hundred franchises, worth around £520m, to private investors are likely to bring changes to the competition, including greater alignment to other leagues across the globe, more overseas players and bigger salaries.\nAlthough the ECB has extended the eight-week window for deals to be completed, they are still expected to go through.\nAnd Mitchell believes salaries will have to increase further if the ECB is to fulfil its aim of making The Hundred the second-biggest franchise tournament behind the Indian Premier League.\n\"There are some big players that have come into the room in terms of investing in The Hundred,\" said former Worcestershire captain Mitchell.\n\"The ambition is for The Hundred to be the second-best tournament, behind the IPL. If that's the case, salaries need to match those ambitions. That's what we'll be in discussions about.\"\nHundred salaries, along with regulations around no-objection certificates – the mechanism that permits English players to feature in overseas leagues – were a source of tension between the PCA and ECB at the end of last year.\nHowever, Mitchell says the two organisations have found more common ground on the issues during the early part of 2025.\nAnother focus for the players' body in recent years has been the domestic schedule, particularly the congested nature of the T20 Blast.\nThe Blast often requires players to feature in matches on back-to-back days or even pivot from the Blast to the County Championship with little turnaround time.\nIn the coming season, which begins on Friday, the 18 counties will review the structure and schedule of the domestic competitions, with the possibility of changes being introduced for the 2026 season.\nWith counties set for significant cash injections as a result of The Hundred sales, there is hope that commercial pressures on the schedule are alleviated.\nWhereas a high-performance review by Sir Andrew Strauss in 2022 was led by the ECB with the England men's team in mind, this will be led by the counties for the benefit of the 18 clubs.\nStrauss' review suggested a cut to 10 County Championship and Blast matches from the current 14, proposals rejected by the counties. A reduction to 12 matches in each could be more feasible.\n\"The reality is we need to create space in the calendar in order to get the right structure,\" said Mitchell. \"What that looks like, I'm not sure. If we go back to the high-performance review, the reaction from players was that was a little bit too far in terms of the amount that was being cut.\n\"Maybe it could be a small cut to either the Blast or Championship but the general feeling is to remove those back-to-back games in the Blast, those pinch-points in the season which have been difficult.\n\"If we get the commercials right in terms of when Blast games in particular are scheduled, on a Thursday or Friday night, hopefully it can have an advantage from that side of things. More revenue could be generated.\"", "url": "https://www.bbc.com/sport/cricket/articles/cgm8v24p3x0o"}