{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:06:32", "date_modify": "2025-05-21 06:06:32", "date_publish": "2025-04-01 14:02:24", "description": "Marco Gabbiadini says criticising Sunderland players for liking photos of Newcastle's cup win celebrations are \"nonsense\".", "filename": "sport_football_articles_cy48dwy7780o_1747807592.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c31e/live/ce13d690-0eed-11f0-9471-fd068d782b6b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy48dwy7780o_1747807592.html", "title": "Criticising Sunderland's Salis Abdul Samed & Jenson Seelt is 'nonsense'", "title_page": "Criticising Sunderland's Salis Abdul Samed & Jenson Seelt is 'nonsense' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Sunderland striker Marco Gabbiadini says criticising Black Cats players for liking social media photos of Newcastle United's League Cup victory celebrations are \"nonsense\".\nGabbiadini told BBC Radio Newcastle's Total Sport that those directing abuse at Salis Abdul Samed and Jenson Seelt following their bitter rivals' victory over Liverpool at Wembley should \"grow up\".\n\"I don't think it's something to get heated about. It's just a click on a mouse,\" he said. \"Really? Grow up.\n\"We don't know the background to this; they may be friends with these players. These players haven't been brought up in Sunderland or Newcastle and they are aware of the rivalry.\n\"But to be honest, truthfully - it's an absolute nonsense. Give yourselves a break.\n\"We're the oldies with social media but the more I see it the less I use it because within five or six comments it ends up being a slangfest.\n\"It's the equivalent walking past each other in the office and saying 'well done, it must have been a good day'.\n\"It's the social media version of that but it becomes public and becomes a big thing.\n\"If I bumped into Alan Shearer in a bar, you'd have say 'It's about time, I'm glad one of us has won something', - you just make small talk.\"", "url": "https://www.bbc.com/sport/football/articles/cy48dwy7780o"}