{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:30:52", "date_modify": "2025-05-21 06:30:52", "date_publish": "2025-03-31 22:03:24", "description": "New Zealand Rugby and Ineos reach a settlement agreement following their dispute over a sponsorship contract.", "filename": "sport_rugby-union_articles_ce92j2zg0ljo_1747809052.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7a31/live/0ff09560-e844-11ef-9e8a-870423bc5283.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_ce92j2zg0ljo_1747809052.html", "title": "New Zealand Rugby and Ineos reach settlement over sponsorship dispute", "title_page": "New Zealand Rugby and Ineos reach settlement over sponsorship dispute - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "New Zealand Rugby and Ineos have reached a settlement agreement following their dispute over a sponsorship contract.\nBritish-owned petrochemical firm Ineos, which holds a stake in Manchester United as part of its sport portfolio, walked away early from its sponsorship deal of New Zealand Rugby (NZR).\nIt was a move that led to legal action from the governing body.\nOn Monday, both parties issued a statement to say the issue has been resolved.\n\"New Zealand Rugby and Ineos can confirm that a settlement has been reached between the two parties,\" the joint statement read.\n\"Whilst the details remain confidential, both organisations are satisfied with the outcome and acknowledge a desire to now move forward.\"\nIneos, which is chaired by Sir Jim Ratcliffe, agreed in 2021 to become performance partner of NZR from 2022 to 2027.\nThe deal included Ineos branding on the back of playing shorts and on the front of training jerseys for the nation's teams, including three-time World Cup winners the All Blacks and six-time women's world champions the Black Ferns.\nHowever, NZR said in February that Ineos had \"failed to pay the first instalment of the 2025 sponsorship fee, confirming its decision to exit our six-year agreement\".\nCiting the struggling chemicals industry in Europe, because of \"high energy taxes and extreme carbon taxes\" along with \"the deindustrialisation of Europe\", Ineos said in a statement at the time: \"We have had to implement cost-saving measures across the business.\n\"We sought to reach a sensible agreement with the All Blacks to adjust our sponsorship in light of these challenges.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/ce92j2zg0ljo"}