{"authors": ["Ian Williams and Kelvin Kimathi", "www.facebook.com"], "date_download": "2025-04-26 04:06:29", "date_modify": "2025-04-26 04:06:29", "date_publish": "2025-03-03 16:34:49", "description": "Former South Africa striker Benni McCarthy has signed a two-year deal as the new head coach of Kenya.", "filename": "sport_football_articles_c234my8k9gno_1745640389.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/97c1/live/7798b7a0-f83f-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c234my8k9gno_1745640389.html", "title": "Benni McCarthy: New Kenya boss targets World Cup qualification", "title_page": "Benni McCarthy: New Kenya boss targets World Cup qualification - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Benni McCarthy has said Kenya can \"surprise a lot of people\" by qualifying for the 2026 World Cup after being appointed as the country's new head coach.\nThe South African has signed a two-year deal that will see him lead the Harambee Stars up to the 2027 Africa Cup of Nations - a tournament which will be held on home soil in East Africa, with Kenya, Tanzania and Uganda co-hosting.\nMcCarthy, 47, replaces interim coach Francis Kimanzi, who has been in charge since Turkish coach Engin Firat stepped down at the end of last year.\nHis first games will be this month's World Cup qualifiers away in The Gambia and at home against Gabon.\n\"Participating in the World Cup, it is one of the most special feelings in the world and I want to give them that,\" McCarthy told BBC Sport Africa.\n\"With the right mindset and dedication from the players, and the willingness to learn and willingness to give everything they've got for the course, I think we can surprise a lot of people by still qualifying for the World Cup.\"\nKenya are currently fourth out of six teams in Group F with five points from four games – five points behind leaders Ivory Coast.\nOnly the group winners qualify automatically for the tournament in Canada, Mexico and the USA. The four best runners-up from the nine groups will have a second chance via the play-offs.\nMcCarthy, who is South Africa's all-time record goalscorer, represented his nation at the 1998 and 2002 World Cups, but Kenya have never qualified for the competition.\nMcCarthy is among the most recognisable names in African football, having carved out a successful playing career in Europe.\nHe won Dutch league and cup titles with Ajax before repeating the trick in Portugal with Jose Mourinho's Porto, also adding the 2004 Champions League title to his trophy haul.\nThe former striker then spent five years in the Premier League with Blackburn Rovers and West Ham before finishing his playing days back in South Africa with Orlando Pirates.\nHe began his coaching career as an assistant with Belgian club Sint-Truiden before taking charge of both Cape Town City and AmaZulu in his homeland.\nMost recently, he was part of Erik ten Hag's backroom team at Manchester United.\n\"I was given an incredible opportunity to go work with one of the biggest and best clubs in the world,\" he said of his time at Old Trafford.\n\"I just felt the time was right now for me to go on and do what I love most, and that's to be manager and to help players grow.\n\"When this opportunity (to coach Kenya) came, I thought where better to give back to the continent that's given me everything?\"", "url": "https://www.bbc.co.uk/sport/football/articles/c234my8k9gno"}