{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:43:37", "date_modify": "2025-05-21 03:43:37", "date_publish": "2025-02-08 18:52:58", "description": "Irish super-featherweight boxer John Cooney dies after suffering a brain injury in last Saturday's defeat by Welshman Nathan Howells in Belfast.", "filename": "sport_boxing_articles_ckg0e4vvr08o_1747799017.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/47f9/live/d29b4950-e391-11ef-90ea-a53b659307b9.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_boxing_articles_ckg0e4vvr08o_1747799017.html", "title": "John Cooney: Irish boxer dies after suffering brain injury in Belfast fight", "title_page": "John Cooney: Irish boxer dies after suffering brain injury in Belfast fight - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Super-featherweight boxer John Cooney, 28, has died after his defeat by Welshman Nathan Howells in Belfast last Saturday.\nThe Irish boxer suffered an intracranial haemorrhage and had surgery to relieve pressure on his brain following the bout at the Ulster Hall.\nGalway man Cooney was assessed by the medical team in the ring before being taken out on a stretcher and transferred to the Royal Victoria Hospital in Belfast.\n\"It is with complete devastation that we have to announce that after a week of battling for his life John Cooney has sadly passed away,\" MHD Promotions said on behalf of the Cooney family.\n\"Mr and Mrs Cooney and his fiancee Emmaleen would like to thank the staff at Belfast's Royal Victoria Hospital who have worked tirelessly to save John's life and for everyone who has sent messages of support and prayers.\n\"He was a much-loved son, brother and partner and it will take us all a lifetime to forget how special he was. RIP John 'The Kid' Cooney.\"\nThe contest was stopped in the ninth round in what was Cooney's first defence of his Celtic super-featherweight title.\nThe Galway boxer won the Celtic title with a first-round win over Liam Gaynor in November 2023 at a sold-out 3Arena in Dublin, on the undercard of Katie Taylor's revenge win over Chantelle Cameron.\nCooney then spent a year out of the ring recovering from a hand injury before returning to beat Tampela Maharusi of Tanzania in October 2024 in London.", "url": "https://www.bbc.com/sport/boxing/articles/ckg0e4vvr08o"}