{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:27:12", "date_modify": "2025-04-26 06:27:12", "date_publish": "2025-02-28 18:56:24", "description": "Carlisle United owner Tom Piatak has faith in the \"experience and leadership\" of Mark Hughes to guide them to safety.", "filename": "sport_football_articles_cr52d4g0qr6o_1745648832.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/dd20/live/924fc930-f600-11ef-aa28-abbfea60ff44.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cr52d4g0qr6o_1745648832.html", "title": "Carlisle: Owner Tom Piatak sure Hughes will get Cumbrian side out of trouble", "title_page": "Carlisle: Owner Tom Piatak sure Hughes will get Cumbrian side out of trouble - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Carlisle United owner Tom Piatak is confident that head coach Mark Hughes is the right man to drag the team out of trouble at the bottom of League Two.\nAmerican Piatak appointed Hughes earlier this month as Carlisle's third boss of the season after Paul Simpson and Mike Williamson.\nHughes picked up his first win in charge at Barrow on Thursday in his fifth game in charge and Piatak believes the 61-year-old will make the difference in the fight to avoid relegation.\n\"I couldn't be more happy with who we have right now leading this fight,\" the Florida-based businessman told BBC Radio Cumbria.\n\"I'm confident he'll get us out of this.\"\nThe derby win moved Carlisle level on points with Morecambe and only two adrift of managerless Tranmere Rovers, who occupy 22nd spot with 13 games remaining.\nIt was a first victory since 25 January and breathes new life into their survival prospects.\nHughes came in after the transfer window had closed and Williamson had brought in 11 players before he was dismissed on deadline day.\nPiatak had shown his support for Williamson at a fans' forum in early January, but almost a month later he felt compelled to change.\n\"With the new players coming in, I expected different results,\" he said. \"It didn't happen.\n\"I expected us to progress further, that's why I made the decision. But with perfect knowledge I would have made it sooner.\"\nBut after discussions with sporting director Rob Clarkson, Hughes was a unanimous choice for the Brunton Park hotseat.\n\"As soon as Mark's name surfaced, we were all over that,\" he added.\n\"He is the perfect fit for the position we're in - his experience, his leadership and he commands the respect of the team.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cr52d4g0qr6o"}