{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:54:03", "date_modify": "2025-05-21 05:54:03", "date_publish": "2025-04-02 07:48:39", "description": "How are England, Scotland, Wales, Northern Ireland, and the Republic of Ireland shaping up in their Women's Nations League groups?", "filename": "sport_football_articles_cx2ez20qvdyo_1747806843.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4080/live/3309ad10-08cf-11f0-94d4-6f954f5dcfa3.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cx2ez20qvdyo_1747806843.html", "title": "Women's Nations League: How it stands as competition nears business end", "title_page": "Women's Nations League: How it stands as competition nears business end - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The business end of the Women's Nations League group stage is on the horizon and there's been mixed fortunes for England, Scotland, Wales, Northern Ireland and the Republic of Ireland across the opening four rounds of games.\nEngland enjoyed a bright first half of the tournament, picking up two wins and one draw, but had their unbeaten run ended by Belgium.\nRepublic of Ireland have three victories from their opening four matches while Northern Ireland have registered two wins, one draw and a defeat.\nHowever, Scotland and Wales remain winless.\nThe final block of group matches will take place on 30 May and 3 June.\nBBC Sport takes a look at the competition so far, what is up for grabs in the tournament and how England and Wales' preparations are going for this summer's Euros in Switzerland.\nThe league was launched in 2023, with the inaugural tournament offering qualification spots for the 2025 Women's European Championship.\nCountries have been placed into groups of three or four teams, across three different leagues, with promotion and relegation between the leagues depending on the match results.\nAnd there's a lot at stake.\nTeams are not only competing for the Nations League title, but their finishing position will also determine where they start in the league system for the European qualifiers for the 2027 Women's World Cup.\nEngland, Scotland and Wales are all in the top league - League A.\nScotland remain rooted to the bottom of Group A1, with four defeats in four matches.\nThey suffered two narrow losses in February - 1-0 in Austria and then 2-1 at home to the Netherlands - but fared less well against table-toppers Germany.\nThey lost 4-0 at Dundee United's Tannadice Park on 4 April before conceding five goals in 16 minutes en route to a 6-1 hammering in Frankfurt four days later.\nFrance remain unbeaten at the top of Group A2, registering victories over Norway (1-0 and 2-0), Iceland (3-2), and Switzerland (2-0).\nNext matches in Group A1 and A2\nGroup A1: 30 May - Germany v Netherlands, Scotland v Austria; 3 June - Austria v Germany, Netherlands v Scotland.\nGroup A2: 30 May - France v Switzerland, Norway v Iceland; 3 June - Iceland v France, Switzerland v Norway.\nEngland began their Group A3 campaign with an underwhelming 1-1 draw in Portugal, but looked closer to their best in their next match as Jess Park scored in a superb 1-0 win at Wembley over reigning world champions Spain.\nThe Lionesses, who will attempt to defend their European title in Switzerland this summer, made it back-to-back wins - going top of the table by beating Belgium 5-0 at Bristol City's Ashton Gate on 4 April.\nHowever, they were brought crashing back down to earth in Leuven, suffering a 3-2 defeat despite a stunning debut goal from teenager Michelle Agyemang and now find themselves in second place behind Spain.\nWales, who are preparing to compete in their first major women's tournament this summer, are four points adrift at the bottom of Group A4 and still waiting for their first win.\nThey lost 1-0 to Italy in their competition opener before responding with an impressive 1-1 draw at home to Sweden, courtesy of Kayleigh Barton's penalty equaliser.\nAnd they picked up another point against Sweden, drawing 1-1 in Gothenburg on 8 April, to bounce back well from a 2-1 defeat by Denmark at the Cardiff City Stadium four days earlier.\nNext matches in Group A3 and A4\nGroup A3: 30 May - England v Portugal, Belgium v Spain; 3 June - Spain v England, Portugal v Belgium.\nGroup A4: 30 May - Denmark v Wales, Italy v Sweden; 3 June - Wales v Italy, Sweden v Denmark.\nIn Group B1, Northern Ireland started with a 2-0 loss in Poland and were heading for another defeat before two late goals from Simone Magill gave them a dramatic 3-2 win over Bosnia-Herzegovina.\nAfter drawing 1-1 with Romania in Bucharest on 4 April, they won the reverse fixture at Windsor Park, completing a 1-0 victory courtesy of 18-year-old Kascie Weir's first international goal.\nRepublic of Ireland picked up their third win of the campaign, following up Friday's emphatic 4-0 win over Greece in Crete with a 2-1 victory over the same opponents in Dublin.\nIn February, Carla Ward's side beat Turkey 1-0 before being thrashed 4-0 in Slovenia.\nNext matches in Group B1 and B2\nGroup B1: 30 May - Northern Ireland v Poland, Romania v Bosnia-Herzegovina; 3 June - Bosnia-Herzegovina v Northern Ireland, Poland v Romania.\nGroup B2: 30 May - Turkey v Republic of Ireland, Slovenia v Greece; 3 June -Republic of Ireland v Slovenia, Greece v Turkey.\nThe group standings at the end of the Nations League determine which teams are placed in each league for the European qualifiers for the 2027 Women's World Cup.\nThere will be another draw in November 2025 to decide the groups within the three leagues.\nTeams who finish in the top two in each League A group stay in the top league for the World Cup qualifiers.\nThe top four teams in League B will be promoted.\nThird-placed teams from League A will have to play the second-placed teams from League B to decide which four teams claim the final League A spots.\nAt the end of the World Cup qualifiers, the four League A winners will qualify directly for the Women's World Cup. Other teams will be entered into the play-offs to claim the remaining spots.", "url": "https://www.bbc.com/sport/football/articles/cx2ez20qvdyo"}