{"authors": ["Brent Pilnick", "www.facebook.com"], "date_download": "2025-05-21 04:45:15", "date_modify": "2025-05-21 04:45:15", "date_publish": "2025-04-03 05:51:34", "description": "Cornwall head coach Mike Abbott says his players were keen to fulfil their fixtures despite uncertainty over the League One side's future.", "filename": "sport_rugby-league_articles_cx27l7rjg8eo_1747802715.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d307/live/ec154730-0fda-11f0-94e9-65dc0da473ff.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-league_articles_cx27l7rjg8eo_1747802715.html", "title": "Cornwall RLFC demise 'heartbreaking' says head coach", "title_page": "Cornwall RLFC demise 'heartbreaking' says head coach Mike Abbott - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cornwall RLFC head coach Mike Abbott says his players were keen to fulfil their fixtures before the League One side folded.\nCornwall went out of business on Wednesday after new owner Kenny Stone was unable to bring in new investment to the Penryn-based club.\nBut Abbott, who has been part of the coaching team since the club was founded in late 2021 and head coach since the 2023 season, says his players would have fulfilled Sunday's fixture at North Wales Crusaders.\n\"The players were still very much for the club,\" he told BBC Sport.\n\"They were willing to travel to Wales at the weekend and play and then sort of go about it then on a week to week basis to keep the club going and see if backers could come in, because phone calls were happening in the background.\n\"They were fully engaged on North Wales away this weekend and then we'll see from there.\"\nAbbott, like most of the team, had a full-time job as well as his rugby league commitments.\nHe only found out about Cornwall's demise when a colleague at the school where he is a deputy headteacher told him about the news after reading it online.\n\"I'm just concerned about the boys,\" added an emotional Abbott, who was keen to pay tribute to Sam Wickets, Ben Gregor, Sam Gilder and John Beach who had worked behind the scenes to keep the club going.\n\"Some of them have moved from Australia to play for the county and the commitment and effort they've put in, it's just gutting that that's not been matched by certain people at the club.\n\"The amount of work that goes on in the background week to week to get a rugby club to function and to get into the next game and get them ready after that game to the next one it's non-stop.\n\"They've all got full-time jobs as well, it's heartbreaking for them.\"", "url": "https://www.bbc.com/sport/rugby-league/articles/cx27l7rjg8eo"}