{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:22:54", "date_modify": "2025-05-21 06:22:54", "date_publish": "2025-03-31 14:03:14", "description": "Nottingham Forest news: Fan views on choice between Champions League qualification or winning FA Cup", "filename": "sport_football_articles_cde2nyzedejo_1747808574.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cde2nyzedejo_1747808574.html", "title": "Nottingham Forest news: Fan views on choice between Champions League qualification or winning FA Cup", "title_page": "Nottingham Forest news: Fan views on choice between Champions League qualification or winning FA Cup - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your views on whether Nottingham Forest should focus on trying to qualify for the Champions League or going all out to win the FA Cup.\nHere are some of your comments:\nNippa: There is no preference. You play the next game to win and get what you get at the end of it all!\nBen: I want to be an FA Cup romantic, but Champions League football would provide such a big windfall that it offers a much better opportunity for establishing a strong foundation for future success. But with Forest's current form, do we really have to choose?\nKris: Financially, the Champions League offers the better opportunities for the club, so it has to be that really. That said, win the FA Cup and its silverware and a Europa League place - which might be more winnable. A nice choice to have!\nSimon: I find it baffling that any fan would prefer top four over a cup win (I mean why not both? Can't believe as a Forest fan that I'm saying that!) Yes, European football brings in cash, but winning a cup is eternal. Look at the joy of Newcastle fans - they will remember this year more fondly than the year they made the top four.\nMick: If I was at Forest, I would want both. Win the cup and it's their first major trophy for a very long time. Qualify for the Champions League and it's a big increase in income and it's easier to retain players and attract new ones.\nRichard: I may be old-fashioned and I realise that in the end it's all about the millions that clubs get from the Champions League, but the glory of winning the iconic FA Cup at Wembley simply outdoes the possible European adventure.\nWhat do you think? Choose here", "url": "https://www.bbc.com/sport/football/articles/cde2nyzedejo"}