{"authors": ["Ged Scott and Steve Hermon", "www.facebook.com"], "date_download": "2025-04-26 04:38:50", "date_modify": "2025-04-26 04:38:50", "date_publish": "2025-02-28 10:01:15", "description": "West Bromwich Albion report a loss of £33.9m for 2023-24 - their first season after the loss of Premier League parachute payments.", "filename": "sport_football_articles_cq6yyvq60zmo_1745642330.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ce7b/live/7a3a2730-f5b2-11ef-a811-33641fc5bb1f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cq6yyvq60zmo_1745642330.html", "title": "Baggies report £33.9m loss for 2023-24 season", "title_page": "West Bromwich Albion: Baggies report £33.9m loss for 2023-24 season - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "West Bromwich Albion have reported a loss of £33.9m for the 2023-24 season.\nThe 12-month period ending 30 June 2024 covers the now American-owned Championship club's first season following the loss of their Premier League parachute payments.\nIt is the first time since Albion were first promoted in 2002 that they have not benefited from any Premier League funding, having since been a 'yo-yo club' , having gone up and down five times, as well as enjoying an unbroken top-flight run from 2010 to 2018.\nBut it is still a significant increase following the reported £11m loss for 2022-23 - and co-owner Shilen Patel already warns that there is a further loss expected for the current 2024-25 campaign.\nTurnover decreased from £56.7m in 2022-23 to £28.2m in 2023-24, caused chiefly by that ending of Premier League money after the customary two years' grace, as well as a fall in sponsorship income.\nThe announcement comes exactly a year to the day since Albion's takeover by Bilkul Football WBA – owned by Patel and his father Dr Kiran C Patel.\nTaking over from the unpopular Chinese ownership of Guochuan Lai, the Patels acquired an 87.8% shareholding in the parent company, West Bromwich Albion Group Ltd.\nBilkul has invested a further £25.3m since the takeover and the owners have also pledged continued funding to help Albion comply with the English Football League's profit and sustainability rules (PSR).\nOn the plus side, in a season when Albion did not change their managerial team, staff costs decreased from £45.9m to £42.9m.\nThe Baggies, now once more under the management of Tony Mowbray, following his surprise return to the club in January, currently sit fifth in the Championship, 19 points off an automatic promotion place after heading the table in September, but still on course to make the play-offs for a second straight season.\n\"It's important to recognise the time period these accounts cover,\" said Albion co-owner Shilen Patel, in a club statement. \"From the time of my takeover, subsequent to the January window, there was not a lot of opportunity to make substantial changes to the trajectory the club was on.\n\"Additionally, the losses don't exactly equate to profit and sustainability losses, so there are some differences. We've been working very hard to make sure that we identify every possible 'add-back'.\n\"In the coming year of accounts, we're also going to be facing heavy losses, but these are losses we have had the opportunity to mitigate through player trading, revenue generation and better management of accounts.\n\"We are, unfortunately, going to be looking at another year of losses in the 2024-25 season, but all of this is within the projected range.\n\"We'll need to continue to be savvy. However, with a little bit more clarity around the system under which we're going to be running the 2025-26 season, we can begin to plan more effectively.\n\"Our goal remains to be at the top of the Championship until we can break through to the Premier League. I think we continue to be on track to do that.\"\nBBC Radio WM's West Bromwich Albion reporter Steve Hermon\nMany fans will see a £33.9m loss in a single financial year and be alarmed after all the talk about having to keep losses under £39m over a three-year period as part of EFL profit and sustainability rules.\nIt is absolutely an eye-watering amount. But there is more to that figure than meets said watery eye.\nAnything spent on infrastructure and areas of the club such as the academy or women's team doesn't have to be included, so the actual losses in PSR terms are significantly lower. In the accounting world, it would be considered an 'add-back'.\nIn the two windows that have followed this reporting period, Albion have still been able to spend money on players to support a promotion bid.\nIt's also worth noting that this financial period ended just four months after Shilen Patel's takeover - and that it's the first time in 22 years that Albion haven't received any Premier League money.\nThe Baggies owner arrived with his 'eyes wide open', so none of this is a surprise and the club are expecting to record another loss in the next financial year but crucially, they don't expect to breach any financial rules.\nThe American is also continuing to show his commitment by bankrolling the club to the tune of £2m a month.", "url": "https://www.bbc.co.uk/sport/football/articles/cq6yyvq60zmo"}