{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:38:28", "date_modify": "2025-05-21 04:38:28", "date_publish": "2025-04-04 15:54:36", "description": "Newcastle news: Opinion - 'There is no reason they can't finish in the top five'", "filename": "sport_football_articles_ckgx075880vo_1747802308.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d635/live/a97973f0-6e9b-11ef-b02d-c5f3b724a1ea.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ckgx075880vo_1747802308.html", "title": "Opinion - 'There is no reason they can't finish in the top five' - BBC Sport", "title_page": "Newcastle news: Opinion - 'There is no reason they can't finish in the top five' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Newcastle are not in a bad spot at the moment to qualify for the Champions League and they have the key thing: momentum.\nThe city is buzzing still after the Carabao Cup win, and the players are too.\nQuestions were raised about how they would play against Brentford following the weekend's celebrations, but they came out with the three points.\nThey will be looking at their remaining fixtures against teams in and around them and know what they have to do to hold their position and secure a return to the Champions League.\nIf I cast my mind back to the first half of this season and I was questioning Newcastle - and so were many others - but it has ended up being a not so bad season!\nThey started with a few injuries at the back, but once they found the stability they have been used to seeing and that has brought them success in the past, they have been very good and hard to beat.\nThis has obviously been helped by players finding their form at the right time and Alexander Isak's ability to change games.\nThe surprise package has been Jacob Murphy, as no-one would have thought he would go on such a run of games and provide as many assists as he has to Isak. There was outside noise at the beginning of the season that Murphy isn't good enough to be at the club, but he has certainly changed a few people's mindsets now.\nFrom nowhere, or maybe just stability in personnel, Newcastle have found their belief and to every man in the cup final they were brilliant.\nIf they can put the same fight into the final part of the season, then there is no reason they can't finish in the top five.", "url": "https://www.bbc.com/sport/football/articles/ckgx075880vo"}