{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:59:10", "date_modify": "2025-05-20 14:59:10", "date_publish": "2023-07-24 18:12:19", "description": "Trevor Francis: John McGovern describes him as 'one of game's nice guys'", "filename": "sport_articles_c843pxkp143o_1747753150.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e2f7/live/50ba90c0-2a48-11ee-b1d7-8fdc93c2782e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c843pxkp143o_1747753150.html", "title": "Trevor Francis: John McGovern describes him as 'one of game's nice guys'", "title_page": "Trevor Francis: John McGovern describes him as 'one of game's nice guys' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Trevor Francis was \"one of the game's nice guys\", says former Nottingham Forest team-mate John McGovern.\nIt was announced on Monday that Francis, who became Britain's first £1m footballer when he signed for Nottingham Forest in 1979, had passed away at the age of 69.\nSpeaking to East Midlands Today, McGovern - who was part of the team that won the European Cup with Francis - said: \"It [the record transfer fee] puts a bit of pressure on your shoulders, but when you score the goal that wins you the European Cup in your first match in Europe then that eliminates any talk about a million-pound price tag.\n\"The manager tried to keep his feet on the ground the day he actually signed. One of the press men said to Trevor, ‘Where are you playing tomorrow?’ and the manager said, ‘He's playing in the third team’.\nTrevor laughed because he thought he was joking, but he wasn't and he did play in the third team the next day so that helped bring him back down to earth.\n\"Obviously it didn't take Trevor long to fit into the way we played football because he was playing in a very good side. When you come into a side with really good players, it helps you straight away, so there's no real time needed for you to fit in to styles of play and different positions.\n\"[He was] one of the game's nice guys and a real shock that he has passed away and I can only give my condolences to his family.\n\"A very sad day for Nottingham Forest Football Club.\"", "url": "https://www.bbc.com/sport/articles/c843pxkp143o"}