{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:41:39", "date_modify": "2025-05-20 12:41:39", "date_publish": "2023-08-03 15:43:21", "description": "Oxford United sign Liverpool forward Max Woltman for an undisclosed fee.", "filename": "sport_football_66392906_1747744899.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/08A6/production/_130641220_gettyimages-1419411886.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66392906_1747744899.html", "title": "Max Woltman: Oxford United sign Liverpool forward", "title_page": "Max Woltman: Oxford United sign Liverpool forward - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Oxford United have signed Liverpool forward Max Woltman for an undisclosed fee.\nThe 19-year-old has been on trial with the U's and spent the first half of last season on loan with Doncaster in League Two where he made 14 appearances.\n\"This is a big step forward for me and I'm really excited for the challenge,\" he told BBC Radio Oxford.\n\"Hopefully I can get a few goals, help the team and we can go for promotion.\"\nWoltman came through Liverpool's youth set-up and became a regular in their under-23 side in Premier League 2.\nHe signed his first professional contract with the club in 2021 and made his debut in the Champions League.\nLast week Oxford United head coach Liam Manning said he was keen to sign two-or-three more players before they kick-off their new League One campaign.\nHe believes Woltman is a good fit for his side: \"He is more of a development project than someone who can impact the team straight away,\" said Manning.\n\"But in terms of the personality, character and quality that he has shown us, he is the type of player that fits how we want to play.\"\nWoltman becomes Oxford's eighth signing of the summer and the third new forward through the doors at the Kassam Stadium.\nThe U's get their new League One campaign underway on Saturday away to Cambridge United.", "url": "https://www.bbc.com/sport/football/66392906"}