{"authors": ["Adonis Storr", "www.facebook.com"], "date_download": "2025-05-21 07:29:39", "date_modify": "2025-05-21 07:29:39", "date_publish": "2025-01-13 14:51:02", "description": "After a typical little burst of speed and chipped cross from Manor Solomon against Harrogate, Largie Ramazani converts the easiest of headers to score his fourth goal for Leeds.", "filename": "sport_football_articles_cyv473j7zm5o_1747812579.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0c9e/live/ae6934d0-d1de-11ef-9fd6-0be88a764111.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cyv473j7zm5o_1747812579.html", "title": "Opinion - Largie Ramazani's return a welcome boost - BBC Sport", "title_page": "Leeds United: Opinion - Largie Ramazani's return a welcome boost - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "After a typical little burst of speed and chipped cross from Manor Solomon on Saturday afternoon, Largie Ramazani converted the easiest of headers to score his fourth goal for Leeds.\nIt was a fine reward for the Belgian's work-rate throughout the game against Harrogate.\nRamazani's United career hasn't really taken off yet.\nFrustrated by an ankle ligament injury in October, his bright start of three goals and an assist in his first eight games was cut short.\nWhat the Whites have been missing was seen against Harrogate Town, energy, a directness when attacking and a hunger for goals.\nPer 90 minutes, only Joel Piroe has had more shots than Largie this season.\nIn a side that is accused of trying to pass the ball into the goal, he is one attacker who offers something different.\n\"It feels great to be back on the pitch and get a goal\" said Largie in a post-match interview, \"it was a frustrating period for me, obviously with the injury. I'm trying to get back my confidence and the form that I had.\"\nDaniel Farke was questioned why he didn't play youth players like Charlie Crew and Joe Gelhardt – who are going out on loan to get minutes.\nThe Leeds manager instead saw the cup game as a chance to give players returning from injury a run out.\n\"To have the feeling of being part of the group again after a long injury, to be back on the pitch, to have the first game under the belt – it is priceless\" said Farke following Saturday's game.\nAlong with others on the way back like Isaac Schmidt, Junior Firpo and Illia Gruev, Ramazani's return gives Leeds a welcome boost, heading into a tricky 2025, with only three points separating the top four of the Championship.", "url": "https://www.bbc.com/sport/football/articles/cyv473j7zm5o"}