{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:13:26", "date_modify": "2025-05-21 05:13:26", "date_publish": "2025-04-05 00:00:00", "description": "Lewis Baker's penalty earns struggling Stoke City a point as they drew 1-1 at Preston North End.", "filename": "sport_football_live_cvg7wvyjqg5t_1747804406.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6eab/live/e5de1210-1238-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cvg7wvyjqg5t_1747804406.html", "title": "Preston North End 1-1 Stoke City: Potters salvage draw at Preston with penalty", "title_page": "Preston North End 1-1 Stoke City: Potters salvage draw at Preston with penalty - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Lewis Baker's penalty was enough for Stoke City to salvage a point as the struggling Potters drew 1-1 at Preston North End.\nDespite starting the match slowly, the Lilywhites scored in the first 10 minutes through Kaine Kesler-Hayden's tap in.\nStoke midfielder Baker spurned two opportunities afterwards in the first half but the 29-year-old made up for it from the spot on the 75th minute mark after Ali Al-Hamadi was pulled in the box.\nIt proved to be a fiery ending to the match but neither side could find a winner which leaves Preston North End, with their 18th draw this campaign, dropping to 14th while Stoke drop down to 20th, two points from the bottom three.\nIn what was arguably a season-best performance last weekend against QPR, Stoke boss Mark Robins would've been hoping a similar level of performance but it was not to be against a well accustomed, rigid defensive display from Preston.\nMillion Manhoef played a starring role in the win last week so it was no surprise the visitors looked to him as an outlet in the early stages, with a couple of long balls pinned to the winger and he spurned a one-on-one opportunity in the fifth minute.\nIt made Preston's goal much more of a sucker punch as Aston Villa loanee Kesler-Hayden received a fortunate bounce from a Preston cross to tap the ball into bottom right corner inside 10 minutes.\nBaker had two good opportunities to equalise, the first in the 22nd minute as his quick footed strike from a swivel outside the box just went wide, and then he was unable to poke home Bae Jun-Ho's low cross at the back post.\nThe South Korea international slipped in left-back Eric Bocat to shoot a near miss in the first five minutes from the restart and the winger then headed over a brilliant cross by Manhoef after a good run at the back post minutes later.\nJun-Ho then spurned an effort as his shot in the box was saved superbly close range by Preston keeper David Cornell before Baker's curler was tipped out again by Cornell.\nStoke then swapped Jun-Ho for Al-Amadi and it proved to be a masterstroke by Robins as the striker, on loan from Ipswich, had a run into the box impeded by Lilywhites centre half Liam Lindsay to win a penalty, which Baker dispatched with 15 minutes to go.\nBuoyed by the equaliser, the Potters pushed on but Ben Wilmot's header in the 80th minute, guided just wide to the right of the goal, ended up being the best chance of a winner from either side.\nPreston North End manager Paul Heckingbottom told BBC Radio Lancashire:\n\"You take the point in the end. I don't think it's a penalty, [it was] really soft so disappointed we haven't got three but I don't think the performance deserved three so we'll take the point and move on.\n\"Start of the second half they got on top. I felt they won all the duels and we're going to face teams that are fighting to stay in the league.\n\"Cardiff, Plymouth, Hull away that's what we're going to face so really disappointed with that spell of the game and we weren't good enough to take the sting out of it.\"\nStoke manager Mark Robins told BBC Radio Stoke:\n\"I think we were brave. I thought we were the better team throughout the game. I thought we had the first real opportunity when Milly [Manhoef] went through and took one touch too many.\n\"If he can get that out from under his feet and finish then I think he scores but I'm not going to criticise the decision-making too much although it's the thing that cost us a little bit.\n\"We went behind to a rubbish goal which ended up taking a deflection and trickling into the back of the net.\n\"It's really disappointing to concede like that but knew we were in the game. It looked like we needed that little bit of impetus which we didn't get.\"", "url": "https://www.bbc.com/sport/football/live/cvg7wvyjqg5t"}