{"authors": ["Nick Hope", "www.facebook.com"], "date_download": "2025-05-19 15:24:24", "date_modify": "2025-05-19 15:24:24", "date_publish": "2017-07-22 14:08:48", "description": "Britain's Tom Daley produces a stunning performance to win gold in the individual 10m platform final at the World Championships.", "filename": "sport_diving_40693172_1747668264.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1314A/production/_97045187_daley_bbc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_diving_40693172_1747668264.html", "title": "World Aquatics Championships: Tom Daley wins gold in 10m platform", "title_page": "World Aquatics Championships: Tom Daley wins gold in 10m platform - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Britain's Tom Daley claimed his first individual World Championship gold for eight years with a stunning victory in the 10m platform final in Budapest.\nDaley, eliminated in the semi-finals of the same event at the Rio Olympics last year, dominated the final throughout.\nThe 23-year-old won with a score of 590.95, ahead of Olympic champion Chen Aisen of China (585.25). Fellow Briton Matty Lee finished 12th.\nEarlier, Daley won silver alongside Grace Reid in the mixed 3m springboard.\nThe pair totalled 308.04 for their five routines with China (323.70) winning gold and Canada (297.72) taking the bronze medal.\nDaley, who won his maiden world title at Rome 2009 when he was just 15 years old, led the standings in the 10m event from the first round. He then delivered five further stunning routines to secure gold.\n\"It's been such a tough year getting over that competition in Rio,\" said Daley.\n\"Today the Olympic champion was never going to let me have it easy but I wanted to fight until the very end and I really wanted to prove a point.\n\"I'm just so happy with the way it turned out. My score was a personal best and I think it would have got the gold last year at the Olympics.\n\"I saw Chen do his dive and all the Chinese divers cheer, so I thought 'Watch this one. You do that, I'm going to do it better'.\n\"I went into this weird competitive mode that I've never even been in before.\"\nBob Ballard, BBC Sport commentator:\nEight years, virtually to the day, since 15-year-old Tom Daley won the World Championship final in Rome, he is back on the top of the podium with an improved score from the 539.85 that brought him gold on that occasion. He needed a big last dive and pulled it off with a second three-figure score.\nThe dive list of the 23-year-old - the only survivor from the final of that outdoor event in Italy in 2009 - is very different to eight years ago, but the start was not. Four scores of over 90 in the first four rounds, including nailing the armstand that had caused him problems in the semi-final - and then the 100-plus score on the forward four and a half somersaults, signalled his desire to banish the memory of missing the Olympic final in Rio which followed record-breaking preliminaries.\nMatty Lee wasn't quite able to match the standards he reached in the semi-final - but many more experienced divers were not able to reach the final 12 at all and he will be one to watch at the European Championships in Scotland in just over a year from now.", "url": "https://www.bbc.com/sport/diving/40693172"}