{"authors": ["Mike Whalley", "www.facebook.com"], "date_download": "2025-04-26 06:18:51", "date_modify": "2025-04-26 06:18:51", "date_publish": "2025-03-01 07:17:40", "description": "Beating Australia would be a \"game-changer\" for women's rugby league in England, centre Amy Hardcastle says.", "filename": "sport_rugby-league_articles_cz611y5y66no_1745648331.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/35dd/live/b5fb7780-f55b-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-league_articles_cz611y5y66no_1745648331.html", "title": "England v Australia in Las Vegas: Amy Hardcastle previews Test", "title_page": "England v Australia in Las Vegas: Amy Hardcastle previews Test - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Beating Australia would be a \"game-changer\" for women's rugby league in England, centre Amy Hardcastle says.\nThe Jillaroos are the dominant force in the international game, winning the past three World Cups and losing just once since 2016.\nThat strength is also evident at club level, where the level of investment in the NRL Women's Premiership (NRLW) allows for a mixture of full-time and semi-professional players - while their counterparts in England's Women's Super League play either for expenses or for free.\nIt means Australia are strong favourites going into Saturday's Test against England in Las Vegas.\nNo English or British women's side has beaten Australia since 2002 - a run of five defeats - but St Helens' Hardcastle welcomes the challenge of toppling the world champions.\n\"Beating them, to me, would be the absolute game-changer,\" she says. \"And I think across the world, and across our country, it would change people's opinions. Think how powerful that can be for a women's team.\n\"It'd definitely change a lot moving forward, and I think a lot of doors would open for English women's rugby league.\"\nHardcastle, 35, is one of three players in the England squad - along with captain Jodie Cunningham and their St Helens club-mate Shona Hoyle - who featured in their last meeting with Australia, a 38-0 defeat at the 2017 World Cup.\nAsked if she felt England had a better squad now than they did then, Hardcastle adds: \"Yeah, absolutely.\n\"Seventeen years I've been in this squad and when I first started, we didn't really play many games. But now we're more consistent.\n\"The Super League's getting better. And I find the pool of girls and women we get to choose from now are better because we're not losing them to other sports, because our league's getting better.\n\"And with the opportunities there are with England, why wouldn't you want to be part of it?\n\"So I believe, especially going into the World Cup, we've got faster, stronger, fitter and cleverer in what we do. It's not that I've never believed before, but I believe we've got one of the best England squads to face the Jillaroos.\"\nEngland face an Australia side going through a degree of turbulence, with head coach Brad Donald stepping down in early February amid allegations he made a disparaging comment about a journalist in front of players.\nJess Skinner, who was Donald's assistant, has taken over as interim head coach.\n\"I believe you can have all the coaching and they bring what they do and their ways of thinking, but it's all about the players,\" Hardcastle said.\n\"When you're on the field, it's how you all connect. If you connect off the field, then you're going to bring that on the field as well.\"\nSaturday night's match, in line with NRLW rules, will be 70 minutes rather than the standard 80.\n\"I think that's to our advantage,\" Hardcastle said.\n\"We're used to pushing that extra 10 minutes and that's probably where the most energy battles are as well, so for us to play 70, we'll be hitting our peak. So I do believe that we've got a pure advantage there.\"", "url": "https://www.bbc.co.uk/sport/rugby-league/articles/cz611y5y66no"}