{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:44:08", "date_modify": "2025-05-20 11:44:08", "date_publish": "2023-08-06 16:05:59", "description": "Scottish Thistles captain Claire Maxwell announces her retirement from netball in the wake of her nation's Netball World Cup exit.", "filename": "sport_netball_66423615_1747741448.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/153F3/production/_130672078_gettyimages-1574074632.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_netball_66423615_1747741448.html", "title": "Claire Maxwell announces retirement after Scottish Thistles World Cup exit", "title_page": "Claire Maxwell announces retirement after Scottish Thistles World Cup exit - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Published\n6 August 2023\nScottish Thistles captain Claire Maxwell has announced her retirement from netball in the wake of her nation's World Cup exit.\nThe 34-year-old also calls time while holding the accolade of her country's most capped player with 128 appearances.\nScotland bowed out in South Africa on Saturday with a 10th-placed finish after defeat to Wales.\n\"As a young girl, playing for Scotland was a dream of mine,\" she said.\n\"To become the most capped player and captain of our national team is something I could never have imagined, and to have shared a small part of my time in the dress with my daughter has been an honour.\"\nThis summer's tournament was Maxwell's third World Cup, while she also represented her nation at two Commonwealth Games.\nHead coach Tamsin Greenway added: \"Claire has been the ultimate Thistle on and off the court.\n\"Her commitment to the team and the sport is unmatched, and she has been an inspiration to everyone around her. Her legacy will continue to inspire generations of Thistles players to come.\"\nNetball World Cup 2023: fixtures, scores and results\nHow to follow the Netball World Cup on the BBC\nRelated topics\nRelated internet links\nEngland Netball\nNetball Scotland\nNetball Northern Ireland\nThe BBC is not responsible for the content of external sites.", "url": "https://www.bbc.com/sport/netball/66423615"}