{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:38:06", "date_modify": "2025-04-26 03:38:06", "date_publish": "2025-03-08 00:00:00", "description": "Sonny Carey's brace leads Blackpool to an emphatic 3-0 away win against Barnsley in League One.", "filename": "sport_football_live_cvge7ggzq46t_1745638686.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/970d/live/7f442f40-f8ec-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_cvge7ggzq46t_1745638686.html", "title": "Barnsley 0-3 Blackpool", "title_page": "Barnsley 0-3 Blackpool: Sonny Carey scores twice for Seasiders - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Sonny Carey's brace led Blackpool to an emphatic 3-0 away win against Barnsley in League One.\nCarey's double and Ashley Fletcher's header in the second half moved Steve Bruce's side up to 11th while further doubt was cast over Barnsley's push for the play-offs.\nBlackpool started brightly at Oakwell and, following a fast break, Rob Apter drew a smart save from Jackson Smith with a stinging volley.\nBlackpool continued to push as Niall Ennis and Fletcher threatened.\nCarey had a hat-trick of chances towards the end of the first half but the Tangerines midfielder could not find the target.\nBarnsley started positively after the break, though Harry Tyrer was still to be tested, before Blackpool responded and opened the scoring in the 56th minute.\nCarey struck low and hard from the edge of the box, and Smith could not keep the effort from squeezing under him.\nFletcher then doubled the visitors' lead in the 64th minute. The former Barnsley forward rose highest at the back post to head in Albie Morgan's deep cross.\nCarey tapped home his second of the afternoon after 73 minutes after Smith denied Ennis from close range.\nMatch report supplied by PA Media.", "url": "https://www.bbc.co.uk/sport/football/live/cvge7ggzq46t"}