{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:11:54", "date_modify": "2025-05-21 06:11:54", "date_publish": "2025-01-31 13:24:15", "description": "Motherwell: Frail on Kettlewell exit, fan abuse & potential signings", "filename": "sport_articles_ckg0mjn7xzgo_1747807914.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/68ad/live/ecf32300-dfd5-11ef-8899-07ba6c6a90c6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_ckg0mjn7xzgo_1747807914.html", "title": "Frail on Kettlewell exit, fan abuse & potential signings", "title_page": "Motherwell: Frail on Kettlewell exit, fan abuse & potential signings - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Frail spoke to the his former boss on Thursday evening and says \"he is fine, he's doing well\".\nThe caretaker describes Kettlewell as \"an exciting young coach and manager\" and hopes he gets an opportunity to get back into the football soon \"if he wants one\".\nKettlewell had \"kept a lot to himself\", but Frail says he \"could see he wasn't himself most of the time\".\nFrail says of fans who levelled abuse at Kettlewell - they were \"a very small minority that have taken it a little bit too far\".\nHe adds: \"He's got three young boys and a young daughter and they love coming to the game. My two girls and my wife come to the game and they are glad it's not me on the end of things like that.\"\nFrail thinks Motherwell have \"a very strong fanbase\" and the \"community-led club\" would get behind whoever the new manager is and \"it is a great opportunity\".\nThe caretaker says the players were \"shocked\" and \"flat\" after the announcement but have been \"really positive\" in training.\nFrail says the players know they have underperformed and is looking for a positive response but knows facing Celtic is a \"challenge they will relish\".", "url": "https://www.bbc.com/sport/articles/ckg0mjn7xzgo"}