{"authors": ["Nick Webb", "www.facebook.com"], "date_download": "2025-05-20 14:29:17", "date_modify": "2025-05-20 14:29:17", "date_publish": "2023-07-28 16:10:08", "description": "Centuries from Luis Reece and Harry Came allow Derbyshire to bat out the final day easily and frustrate Glamorgan's promotion push.", "filename": "sport_cricket_66332604_1747751357.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/A6AB/production/_130576624_shutterstock_editorial_13898960az-1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66332604_1747751357.html", "title": "County Championship: Reece and Came earn Derbyshire draw against Glamorgan", "title_page": "County Championship: Reece and Came earn Derbyshire draw against Glamorgan - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Derbyshire openers Luis Reece and Harry Came batted through the final day to earn a draw and frustrate promotion hopefuls Glamorgan.\nReece (201 not out) and Came (141 not out) both hit career-bests in a record first-wicket stand, beating the 333 by Reece and Billy Godleman in 2017.\nGlamorgan's decision to enforce the follow-on did not pay off as Derbyshire reached 360-0.\nReece became the 20th Derbyshire player to score two 100s in a match.\nIt was the first time an opening stand topped 150 twice in a match for them, with barely a chance created by the visitors on the final day after they had induced a first-innings collapse by the hosts.\nGlamorgan moved temporarily into second place in the Division Two table with maximum bonus points, but having drawn 10 out of 11, they are likely to be overtaken again by Worcestershire whose match against Gloucestershire started a day later.\nBoth Glamorgan and the Pears have three matches remaining in September, while Sussex and Leicestershire, the other contenders for the second promotion place behind Durham, have four to play.\nMeanwhile Yorkshire's points deduction saw Derbyshire move off the foot of the table.\nResuming at 78-0, 125 runs in arrears, Reece and Came enjoyed an untroubled first session as they became the first opening pair to post two century stands at the county's headquarters.\nReece's hundred came off 177 balls with 11 fours as the Welsh county's bowlers looked weary on a placid pitch after playing two Championship games a day apart.\nCame reached a patient three figures off 233 balls with a rare display of aggression, lofting Mitch Swepson over long-off for his 12th four and shortly afterwards passing his previous best of 108.\nAfter long spells for spinners Swepson and Kiran Carlson, Glamorgan took the new ball with the openers still together, but there was no change of fortunes for the labouring attack.\nReece worked hard for nearly all his runs before passing his previous best of 184 and the 200 mark against some gentle offerings after tea, the highlight of which was right-arm spinner Billy Root bowling his final delivery with his left arm.\nBut no-one could deny the merit of Reece and Came's gritty efforts to save the draw.\nGlamorgan take on Herefordshire at Eastnor on Sunday, 30 July in a 50-overs match ahead of the One Day Cup, though they are not likely to field any of the Championship team, while Derbyshire face Lincolnshire at Lindum.\nDerbyshire Head of Cricket Mickey Arthur told BBC Radio Derby:\n\"It was in difficult circumstances, but I thought Reece and Came were outstanding, they played really well.\n\"They showed great powers of concentration and great hunger to make sure we got a draw out of the game, they've shown why we've invested in them for another two years (with new contracts).\n\"It's hard to force wins here, there's been one win in four-day cricket since I've been here when we lost to Worcestershire in arguably a game we should have won.\n\"We have to do something, I thought this wicket was going to do all sorts, it was green and it ended up being incredibly flat. If we want to meet the ambitions we have, we've got to be getting wins at home and we need a bit of help out of the wicket.\"\nGlamorgan coach Matthew Maynard told BBC Sport Wales:\n\"There aren't too many days through my career playing or coaching where I've not seen a wicket fall on the last day, but credit to Luis Reece and Harry Came, they batted very well and didn't give any opportunities.\n\"Credit to our lads who gave it everything after making Derby follow-on, full bonus points to go along with the draw, but disappointing we couldn't take wickets and get into the middle order.\n\"The best thing for this country going forward would be to finish a dead game at tea (on the final day by agreement), with due respect to Billy Root, no-one wants to an over of off-spin and left-arm in the same over but you can't break your seamers.\n\"We said at the start of the year we want to get to September challenging for promotion and that's where we're going to be.\"", "url": "https://www.bbc.com/sport/cricket/66332604"}