{"authors": ["Matthew Henry", "www.facebook.com"], "date_download": "2025-05-20 14:15:54", "date_modify": "2025-05-20 14:15:54", "date_publish": "2023-07-29 15:00:29", "description": "Zak Crawley and Ben Duckett have secured their place as England's openers long-term through their Ashes displays - the first pair to do so in 11 years of trying.", "filename": "sport_cricket_66349289_1747750554.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/BFF2/production/_130583194_openers.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66349289_1747750554.html", "title": "The Ashes 2023: Why Ben Duckett & Zak Crawley have ended England's revolving door of openers", "title_page": "The Ashes 2023: Why Ben Duckett & Zak Crawley have ended England's revolving door of openers - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Eleven years later and the debate is finally over - England have a settled opening partnership again.\nAfter more than a decade of chopping and changing, hiring and firing, Zak Crawley and Ben Duckett's performances in the men's Ashes have secured their place in England's XI.\nThe last England opening pair we could say that about were both made knights of the realm (Andrew Strauss and Alastair Cook).\nDuckett and Crawley began day three of the decisive fifth Ashes Test knowing the match was in the balance.\nThe crowd was nervous: 2-2 is a lot different from 3-1.\nBut for the third time in the series, Crawley began by cracking the first ball of the innings for four and the pair continued in their quest to bend everything we thought we knew about opening the batting.\nEngland were trailing by 12 runs on first innings. With Duckett also driving and clipping Starc to the fence, that deficit was wiped out within six balls.\nNot for the first time in the series, Australia seemingly had little idea what to do.\nA field that has been set back throughout the series was brought in for the first over. By the second, those in the front row of the Oval crowd had an Australian fielder for company again - Pat Cummins' hokey cokey in full swing.\nWhether in or out, Duckett still struck six fours from the first five overs, something no batter has done against Australia since the great South African Barry Richards in 1970.\nThe latest Duck-ley whirlwind came a day after Marnus Labuchagne played the slowest Australian innings against England since 1882 - all below the famous red-brick pavilion that thought it had seen it all.\nEngland's score reached 50 in 8.4 overs and passed the 54 Australia managed in the entire first session on day one in 47 minutes - human metronome Josh Hazlewood bamboozled into bowling leg-stump half-volleys.\nCrawley looks like a classical batter of old.\nIn his short shirt sleeves and sleeveless sweater, he stands tall and bobs at the knee before unfurling a cover drive from the textbook.\nHis partner is the anomaly - a year includes more full moons than Ben Duckett leaves.\nThe left-hander is squat, so much so his pads almost reach his hip. He pokes when others would shoulder arms, bursting into life when the bowler drops short.\nThat contrast in height, a difference of 10 inches, is troubling for even the most experienced of bowlers.\nA ball just full of a good length is defended by Duckett. A ball pitching in the same spot brings Crawley onto the front foot and is met by the booming drive.\nBowl slightly shorter and Crawley is troubled but left-handed Duckett's height means he can cut and pull.\n\"The bowlers have a three or four-yard difference where they need to bowl, especially when they are rotating the strike,\" said former England captain Michael Vaughan.\n\"Every other ball they are having to change their length by quite a good distance.\"\nDuckett has said previously he never thought he could open in a Test batting as he does. Crawley has seen repeated calls for him to be dropped ignored by those who matter - until this series, eye-catching hundreds were too rare among runs of low scores.\nTogether, in an era of total loyalty under Ben Stokes and Brendon McCullum, they have been given the chance to disprove those doubters.\nOf course, they are fortunate to have begun their partnership on the flat tracks of Pakistan and New Zealand.\nTheir first summer in England has seen far less swing and seam than the late 2010s - a period in which England went through openers like Chelsea go through football managers.\nBut Crawley's 189 in the washout at Old Trafford will go down as one of the great Ashes innings not to matter.\nAt The Oval on Saturday, the 25-year-old ended the series with a sparkling 73 from 76 balls to take his tally in the contest to 480 - the most by an England opener in a home Ashes this century.\nDuckett's series peaked at Lord's where he scored 98 and 83 in defeat, his 42 on day three his best score in four innings since.\nBut his career average as an opener sits at 47.95.\nOnly including those to have played as many as his 13 Tests, the list of those who can better that average is a collection of England's all-time greats - Herbert Sutcliffe, Len Hutton, Jack Hobbs, Dennis Amiss and Geoffrey Boycott.\nEngland could yet lose the fifth Test: they were 222-4 when Harry Brook fell in the afternoon session, 210 runs ahead.\nWin it and the platform of 79 in 17 overs, after a stand of 62 in 12 in the first innings, will be a big reason why.\nMoreover, Duckett and Crawley end the series having put on 359 runs together as a pair.\nThat is England's best record at the top of the order in an Ashes series since Cook and Strauss in 2010-11.\nSince Strauss retired in 2012, Nick Compton, Sam Robson, Adam Lyth, Rory Burns, Dom Sibley, Haseeb Hameed and Keaton Jennings all had their moments.\nBut Duckett and Crawley have closed the revolving door for a good while at least.", "url": "https://www.bbc.com/sport/cricket/66349289"}