{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:30:07", "date_modify": "2025-04-26 06:30:07", "date_publish": "2025-02-27 10:48:44", "description": "Brentford 1-1 Everton: Fan views", "filename": "sport_football_articles_c4g000480qjo_1745649007.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c4g000480qjo_1745649007.html", "title": "Brentford 1-1 Everton: Fan views", "title_page": "Brentford 1-1 Everton: Fan views - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "We asked for your views on Everton's Premier League draw at Brentford.\nHere are some of your comments:\nRichard: A typical David Moyes Everton performance. At times we were down but we were never out. Players out injured and Abdoulaye Doucoure not available for personal reasons but the players never gave up and got a very well deserved point. Moyes has given me my Everton back!\nGreg: We stuck at it and could have won it if we had someone who could finish. Anyone who thinks Beto is the answer is badly mistaken. Top marks to James Garner who was pulling the strings all game. Great to have him back. Moyes is doing a fantastic job.\nDan: On another day we win that. Three great chances for Beto and he could have slid Carlos Alcaraz in late on. But on the other hand, we could have lost that and before the Moyesiah's return, we probably would have. Good fightback and effort from the lads.\nLou: Great performance from Everton. Yes Ashley Young went down easily but the referee gave it on the pitch. There was no clear and obvious error so why is VAR getting involved? It's wonderful to not be looking over our shoulders and praying that there are three teams below us. Finally seeing a bit of light at the end of a very dark tunnel. Finally able to watch EFC play with a little confidence.\nIan: Beto, Beto, Beto - he has to put at least one of those chances away. Well done to the team to keep on fighting. A tough fixture that we should have won but came away with a good point.", "url": "https://www.bbc.co.uk/sport/football/articles/c4g000480qjo"}