{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:39:20", "date_modify": "2025-05-20 11:39:20", "date_publish": "2023-08-06 22:43:54", "description": "Mixed reaction to Dons goalless draw in Livingston", "filename": "sport_articles_crgjxz1yveko_1747741160.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9aee/live/36e72430-34a5-11ee-bde6-7ffba94c56ae.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_crgjxz1yveko_1747741160.html", "title": "Mixed reaction to Dons goalless draw in Livingston", "title_page": "Mixed reaction to Dons goalless draw in Livingston - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked what you thought of Aberdeen's opening-day draw away to Livingston and your reactions were mixed.\nBenjamin: A dull, physical game. Just the kind of thing to remind you what Scottish football is all about. Can't help but think the pitch quality could be better. I live in a country full of artificial pitches, but even in the fifth tier the pitches are better than at Livingston. Hopefully the Dons will have shooting boots on for Celtic next weekend.\nIan: It's just not good enough from Aberdeen, who have a huge budget in comparison where you would expect the Don's to win comfortable. I don't want to listen to excuses. Fans want action on the park.\nMark: One point away from home in a game that we’d probably have lost in the Goodwin days and players to come back from injury. No need for concern at this stage of the season, so let’s get Celtic out of the way and kick on.\nGregor: Terrible pitch that should be banned. Livi used their height and physicality and were on us whenever we got the ball. Needed fast accurate passes to get round them, but Duk was poor, as was Morris and Hayes. Teams might struggle here. Need better players in this window.\nRichard: It was concerning to see that Aberdeen had apparently no tactical answer to the way Livingston set up. We will have to play Livingston and other teams who will be out to stop us from playing and, if we can’t adapt and try to play around them by keeping it on the deck, we won’t get very far. So a disappointing start.\nNathan: We played right into Livingston's hands. We missed the midfield consistently and went long towards their defence, which averaged 6.5ft in height. We created absolutely nothing. I was one of the 4300 excited fans that made the journey, but the team sucked the excitement out of us. Barry Robson made one sub, which says a lot about how he feels about his squad.\nBill: The Livi match was a turgid performance by an Aberdeen team that doesn’t appear to have gelled together. Not surprising given the number of new signings. Livingston looked more like an NBA team than a squad of footballers. It wasn’t pretty to watch their style of play, but I suspect they’ll be an awkward team for many Premiership sides to play against.\nFred: Not an enjoyable game, but both teams put in a hard shift. I really thought we would win this fixture, but our strikers were off the pace. We should sign another proven goal scorer. The defence looked good. Next week will be an acid test with Celtic.\nBob: Shocking and worrying performance from the Dons. Barry Robson has his work cut out already. Needs to move away from 3-5-2 because it means no natural width.\nChristopher: A clean sheet and a point from what is typically a tough place for any team to go to. We'll take it and move on. No reason to panic yet.\nNiall: At a tricky venue with a dry all weather surface, the Dons looked a bit lacklustre with the hosts stifling any creativity in midfield. Duk had a number of chances but didn't have his shooting boots on. The defensive reshuffle looked solid enough. However, Barry Robson will be disappointed with lack of penetration and creativity to break down Livi.\nKieran: Livingston could only foul Aberdeen every time they tried to counter attack, slowing down the game any chance they had. Saying that, Aberdeen didn't seem massively up for the game.\nStuart: I know it’s only the first game, but huge concerns for the season ahead. Prove me wrong guys next Sunday v Celtic.\nAndy: It was pretty dire stuff. The Dons need to sign up some creativity as a matter of urgency. Having said that, I'm sure they will improve as the season progresses.", "url": "https://www.bbc.com/sport/articles/crgjxz1yveko"}