{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:51:32", "date_modify": "2025-05-20 13:51:32", "date_publish": "2023-07-31 17:39:33", "description": "Nottingham Forest: Steve Cooper post-match after PSV Eindhoven", "filename": "sport_articles_c51ddv1587vo_1747749092.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a0b5/live/00bba2e0-2fbf-11ee-b077-e926a82543c1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c51ddv1587vo_1747749092.html", "title": "Nottingham Forest: Steve Cooper post-match after PSV Eindhoven", "title_page": "Nottingham Forest: Steve Cooper post-match after PSV Eindhoven - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Nottingham Forest boss Steve Cooper has been analysing the 1-0 pre-season defeat to PSV Eindhoven on Sunday and has drawn positives from a \"fairly sound\" defensive display.\nSpeaking to the club's media, Cooper said: \"It's a bit more than getting minutes in the legs now that we're getting closer to the start of the season. Some players made their first starts in Aurier, Gibbs-White, Wood, and Ola Aina with his first game for the club. So it's still a bit of a mix-and-match group in terms of player status.\n\"With all of that in mind, I thought we were definitely better with the ball at times, we were certainly better than what we showed against Leeds.\n\"Apart from a really poor goal that we conceded, we've given a team that's going to play in Europe in the next couple of weeks not much, so defensively I thought we were fairly sound.\n\"It's positive to get more good players on the pitch. The more players we have available for games, the better. It was good to get Ola on the pitch, I thought he was excellent and showed some really good moments.\n\"To have Morgan back was great as well, to get him back up to speed. He did some good things in the first half and tired out a bit in the second half, which is normal.\n\"We've just got to keep building our way and keep building individual progress to try and get ourselves into a position where, in a couple of weeks, we're good to go.\"", "url": "https://www.bbc.com/sport/articles/c51ddv1587vo"}