{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:51:32", "date_modify": "2025-05-21 06:51:32", "date_publish": "2025-03-29 21:19:22", "description": "Bournemouth boss Andoni Iraola says he values winning the FA Cup above playing in Europe.", "filename": "sport_football_articles_cn0j0jkpydro_1747810292.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4698/live/591ad940-0bc5-11f0-9028-6b47f4f81c48.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cn0j0jkpydro_1747810292.html", "title": "FA Cup: Bournemouth boss Andoni Iraola values cup competition over Europe", "title_page": "FA Cup: Bournemouth boss Andoni Iraola values cup competition over Europe - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Bournemouth boss Andoni Iraola says he values winning the FA Cup above playing in Europe.\nThe Cherries host Manchester City in the quarter-finals of the competition on Sunday.\nThe FA Cup winners are guaranteed a place in the group stages of the Europa League the following season.\nIn an interview with Guillem Balague for BBC 5 Live's Football Daily, Iraola said: \"The FA Cup is, for me, much more important than playing in Europe. It's a title.\n\"Sometimes they talk about the cup competitions as a way to get into Europe. I don't care about Europe.\n\"We are playing in a final, we are fighting for a title. For me, it's much more important.\"\nBournemouth face a difficult task against seven-time FA Cup winners City, who were beaten in last year's final by rivals Manchester United.\nBut Iraola insists there is no reason to believe his side cannot beat Pep Guardiola's team and then go on to win the competition.\n\"I think we can win it,\" he added. \"Probably we are not the favourites, especially with the opposition we have in the quarter-finals but I think we have shown [we can win it].\n\"We are three games away from winning it. With a good day from our players, we can beat all the teams. I think we have a chance, probably not as big as City or Aston Villa, but I think we have our chance.\"\nAs a player, Iraola spent over a decade at Athletic Bilbao and came up against Guardiola's Barcelona side on several occasions, saying he \"lost many times\" against them.\nHaving been so dominant in recent years, City have had a more difficult season comparatively, having not been in the title race for the majority of it.\nIt has prompted suggestions that his style of football is no longer as effective as it was - something Iraola disputes.\n\"Pep Guardiola is the best manager I've known. I have no doubts,\" he said.\n\"There is a structure, organisation, multiple options, but at the end of the day, I think what he tries to do is put the player in the best scenario to let him shine.\"\nThe Bournemouth boss believes Guardiola sides are among the most difficult to prepare to play against, adding: \"Normally, against other teams, they normally play like this, they have these adaptations...\n\"With Pep, you have to analyse like, I don't know, nine or 10 different ways they can go.\n\"The last game we played against them, we prepared for a couple of main structures and straight away, in the third minute, we had to change everything.\n\"It's very challenging but it's the kind of challenge you are here for.\"\nOne of the players to have shone the most under Iraola this season is Dean Huijsen.\nThe 19-year-old has risen to prominence this term, swiftly developing into one of the standout defenders in the Premier League.\nHis form saw him called up by Spain for the first time this year and he has been linked with some of Europe's biggest clubs including Real Madrid, external.\n\"It's not been a surprise for us,\" Iraola said of Huijsen's form.\n\"I remember his first game against Nottingham Forest away against Chris Wood - he did a hell of a job and I think we started to realise, 'he's 19, but probably he's more ready than we expected in this moment'.\n\"He's had an amazing season. It's one of the best feelings as a manager when you feel like you've helped that player make a big jump in one season and put him in a position he would've arrived in anyway in any team or any competition.\n\"He would've found a way to get to the top level but it's a big reward for the staff, for the coaches.\n\"He still has a lot of room for improvement, which is a good thing for him, but I'm very happy for him.\"", "url": "https://www.bbc.com/sport/football/articles/cn0j0jkpydro"}