{"authors": ["Emma Smith", "www.facebook.com"], "date_download": "2025-05-20 13:46:27", "date_modify": "2025-05-20 13:46:27", "date_publish": "2023-07-31 14:32:29", "description": "By beating Canada 4-0 and qualifying for the last 16, it feels like Australia have finally arrived at their own party.", "filename": "sport_football_66363231_1747748787.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/170A1/production/_130596349_gettyimages-1582792146.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66363231_1747748787.html", "title": "2023 Women's World Cup: Co-hosts Australia avert 'disaster' to join their own party", "title_page": "2023 Women's World Cup: Co-hosts Australia avert 'disaster' to join their own party - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "As the fans in Melbourne roared their approval, the Australian players did a lap of honour. Katrina Gorry and Mackenzie Arnold jumped up and down in celebration, while Alanna Kennedy cried tears of joy.\nBy beating Canada 4-0 and qualifying for the last 16, it feels like Australia have finally arrived at their own party.\nAustralia would have followed 2023 Fifa Women's World Cup co-hosts New Zealand out at the group stage had they not won, in what could have been a hammer blow for national interest in their home tournament.\nThis had been called Australia's biggest ever game and they rose to the challenge, winning a World Cup game by four goals for the first time. What a time to do it.\n\"It was one of the most significant matches in the history of Australian football - male or female,\" former Australia player John Aloisi said on Channel 7. \"A home World Cup - if we had gone out, let's not underestimate, it would have been a disaster.\n\"You saw how the players were celebrating, you saw how the crowd were celebrating, what this does for Australian football is huge. And the girls deserve it - there was a lot of criticism thrown at the side but they stepped up when they needed to.\"\nAfter struggling to an opening win over Republic of Ireland, suffering a shock loss to Nigeria and with the ongoing soap opera around star striker Sam Kerr's fitness, it has been a tough start to Australia's home World Cup.\nOn Sunday, they watched as co-hosts New Zealand exited with a meek draw against Switzerland. A repeat in Melbourne could have been catastrophic.\n\"It would be deflating,\" Anna Harrington of the Australian Associated Press told BBC Sport. \"The longer the hosts are in, the more momentum you have.\n\"You look at these games - huge ticket sales, packing out games regardless of the hosts being there. You look at the Colombia games with big crowds. But it would take a shine off the tournament if the hosts get knocked out.\"\nInstead Australia came good. From the moment in the opening minutes when forward Mary Fowler charged down Canada defender Kadeisha Buchanan, the 27,000-strong Melbourne crowd were roaring their team along.\nThey erupted as Hayley Raso gave them the lead, even more so when Fowler appeared to have doubled the score. That joy turned to boos as the video assistant referee disallowed it for offside following a lengthy check.\nIt meant that when Raso did double the lead, there was a delayed reaction as fans did not want to be fooled again. It was only when Canada restarted the game that the real roar came.\nBy the end when Steph Catley made it four from the penalty spot, Melbourne was in pure party mode.\nLast summer England - who could be Australia's last-16 opponents depending on results - capitalised on hosting Euro 2022 with a tournament victory which has changed how women's football is seen in their country. The Matildas could still have their Lionesses moment.\nThe supporters certainly think so. Those in the Melbourne fan zone before the game say just hosting the World Cup has already had an impact on how women's football is perceived in Australia.\n\"Even if they don't win tonight, it has shown the world how much Australia is getting behind them,\" fan Simone Campbell told BBC Sport.\n\"Australia has all these sports, sometimes football gets pushed to the side, but events like this have shown there is interest.\n\"Look at Sydney where there was 80,000 people, tonight there will be another huge crowd. Australia have shown the Matildas they have a huge fanbase, more than what they expected.\"\n\"It's a great time to be a young woman in football in Australia,\" 16-year-old Claire Downie said. \"From three or four years ago I've seen huge improvements, heaps more people engaged in women's football over the last few years.\"\nEven if they went out to Canada, has this tournament made enough of an impact?\n\"Hell yeah,\" Downie said. \"Having a World Cup in Australia and New Zealand, that's crazy for us.\"\nFans in Adelaide watching the demolition of Canada were thrilled by the result and performance, and equally hopeful for the future.\n\"I was worried we weren't going to get through, mainly because of how we played against Nigeria,\" Danielle Krebs told BBC Sport. \"So it's incredible they played so well against the Olympic champions. It's not what I thought was going to happen.\n\"Soccer is not our national sport… Australia need to go far to have a lasting impact. If we had gone out in the group stages, it would have been devastating.\"\nMelody Pounsett is now confident the Matildas will go deep in the tournament.\n\"They can go all the way. Why not?! The home crowd and support has been amazing. Anything is now possible. They have been under so much pressure but if we can get Sam [Kerr] back on the pitch, Gorry and the rest of the team playing at their best, then we have every chance.\"\nWhile Australia's female national team is well established - competing at every World Cup since 1995 and now reaching the knockouts on the last five occasions - domestically it is less so. Only two of the 23 - Cortnee Vine and Clare Hunt - play in the A-League Women.\nThat is the legacy Australia will try to build off the back of this World Cup - and it it has more chance of success if the team goes a long way.\n\"You will have kids who take up football because of this World Cup,\" Harrington said before kick-off. \"The impact it has on the A-League Women will have to be seen. But nationally it has had a great impact.\n\"I've worked at games where there were a few thousand fans, then you had more than 80,000 against the Irish and 50,000 the other night [against Nigeria].\n\"But they need to get through for it to really kick on. If they go out tonight, it will be a disaster.\"\nDisaster has been averted. For now, the Australian party carries on.", "url": "https://www.bbc.com/sport/football/66363231"}