{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:40:42", "date_modify": "2025-05-19 14:40:42", "date_publish": "2017-08-04 14:15:04", "description": "US Open champion Stan Wawrinka will not defend his title because of a knee injury that will rule him out until next year.", "filename": "sport_tennis_40824969_1747665642.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3386/production/_97209131_wawrinka-index.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_tennis_40824969_1747665642.html", "title": "Stan Wawrinka: US Open champion to miss rest of year", "title_page": "Stan Wawrinka: US Open champion to miss rest of year - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "US Open champion Stan Wawrinka will not defend his title in New York later this month because of a knee injury.\nThe 32-year-old announced on Facebook he has had surgery on the problem and will return to action in 2018.\nLast month, the Swiss struggled and needed ice on his knee as he was knocked out in the first round of Wimbledon by Russia's Daniil Medvedev.\n\"I love this sport and I will work hard to get back to my top level and play many more years,\" said Wawrinka., external\nThis season, the three-time Grand Slam champion reached the final of the French Open and the semi-finals of the Australia Open.\nHe added: \"After talking with my team and doctor I had to make a difficult decision to undergo a medical intervention on my knee. This was the only solution to make sure I will be able to compete at the top level for many more years.\n\"This is obviously extremely disappointing, but I am already looking ahead and planning my recovery. I love this sport and I will work hard to get back to my top level and play many more years.\n\"I also want to take this opportunity to thank my fans for sending plenty of messages of support during the last couple of days. I will see you all in 2018.\"", "url": "https://www.bbc.com/sport/tennis/40824969"}