{"authors": ["Alasdair Lamont", "www.facebook.com"], "date_download": "2025-05-21 05:50:11", "date_modify": "2025-05-21 05:50:11", "date_publish": "2025-04-02 10:31:29", "description": "Ferguson has 'glaring defensive issues' to address", "filename": "sport_articles_c0m9zvp4w19o_1747806611.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0d54/live/adb42020-0fac-11f0-b234-07dc7691c360.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c0m9zvp4w19o_1747806611.html", "title": "Ferguson has 'glaring defensive issues' to address", "title_page": "Ferguson has 'glaring defensive issues' to address - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Rangers' 4-3 victory at Dens Park last weekend was as thrilling a game as you'll see in a long time and Barry Ferguson and his players do deserve credit for a comeback that appeared massively unlikely with 15 minutes to play.\nBut as sweet as it was for the travelling Rangers fans in the end, they were made to suffer for large parts of the game and Ferguson acknowledged afterwards his team had allowed \"old bad habits\" to creep back in to their play.\nWith a massive European tie against Athletic Bilbao on the horizon, Ferguson and his coaching staff have glaring defensive issues to address. The startling statistic of having gone 2-0 down in five of their past seven games underlines that.\nIndeed, the goals they shipped to Dundee meant that for the first time since April 1986 – the bad old days of the pre-Graeme Souness era – Rangers conceded two or more in the league for a fifth straight game.\nUnlike Souness, Ferguson cannot open a cheque book to sign a couple of England internationals to shore up a leaky backline, so the solution must come from within.\nDifferent formations and personnel have been tried with varying degrees of success, while Jack Butland has gifted a couple of goals to the opposition in recent weeks.\nAnother unwanted record attained recently was a fourth successive home defeat for the first time. With a buoyant Hibs visiting on Saturday, Rangers will have to have sharpened up defensively if that record is not to be extended.", "url": "https://www.bbc.com/sport/articles/c0m9zvp4w19o"}