{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:06:22", "date_modify": "2025-05-21 07:06:22", "date_publish": "2025-01-13 19:59:17", "description": "Tyrone legend Peter Canavan says All-Ireland Club Championship success for Errigan Ciaran would \"be as good as any title I've won personally\".", "filename": "sport_articles_czj37ejjnp9o_1747811182.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5b95/live/f9f30750-d1e3-11ef-80e5-9f0b215d3fef.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_czj37ejjnp9o_1747811182.html", "title": "Errigal Ciaran: All-Ireland would be 'as good as any title' Peter Canavan won as player", "title_page": "Errigal Ciaran: All-Ireland would be 'as good as any title' Peter Canavan won as player - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tyrone legend Peter Canavan says All-Ireland Club Championship success for Errigan Ciaran would \"be as good as any title I've won personally\".\nCanavan's sons, Ruairi and Darragh, are key players for the team and he is vice chairperson at the club.\nErrigal Ciaran are aiming to win their first All-Ireland club title and face Dublin outfit Cuala in the final at Croke Park on Sunday.\nDespite having an honours list that includes the 2003 and 2005 All-Ireland titles with Tyrone, six All-Stars and two Ulster titles with Errigal Ciaran as a player, Canavan says watching his club taste success against Cuala would be right up there.\n\"It's a massive occasion for the club and you are trying to go somewhere where we've never been before.\n\"That is big in itself, but look, that's a big if. We are coming up against a very good team in Cuala.\n\"If the boys perform to the way they can and if they give it everything they have, then you can't ask for anything more.\n\"If that is good enough, then that's good enough to get there and if it's not then we'll put our hands up.\"\nErrigal Ciaran booked their place in the All-Ireland decider with a dramatic 2-18 to 1-18 win in extra-time over Dr Crokes in the last four.\nCanavan's son Darragh finished with 1-6 and Ruairi also impressed with 0-7.\nThe 53-year-old admits he was \"all over the place\" while watching the semi-final against a Dr Crokes side who are two-time All-Ireland champions.\n\"It was nerve-wracking, it always is. You are nervous for them and the other lads, who are no different.\n\"It doesn't matter who scores them, as long as you get over the line, so hopefully we get the same result on Sunday.\"\nWith their semi-final win, Errigan Ciaran are the first club from Tyrone to ever reach the All-Ireland club decider.\nCanavan, who said he \"always hoped\" and it \"amazes\" him that it had never been achieved before now.\n\"We got close ourselves with a few Ulster club finals. Even Tyrone finals are brutally hard to win,\" he added.\n\"There are six or seven clubs in Tyrone who believe they are every bit as good as Errigal.\"\nAfter late drama in their semi-final, Canavan says the resilience shown by the Ballygawley side is \"heartening to see\" and they have the backing of the community.\n\"There is so much goodwill here for this group of boys.\n\"The way they have been winning games adds to that, where it looks as if they are gone but they come back and manage to find a way.\"", "url": "https://www.bbc.com/sport/articles/czj37ejjnp9o"}