{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:42:06", "date_modify": "2025-05-21 07:42:06", "date_publish": "2025-03-28 10:56:53", "description": "Bayern Munich say they \"reserve the right to take legal action,\" after Alphonso Davies returned from international duty with Canada with a torn anterior cruciate ligament (ACL).", "filename": "sport_football_articles_cx2e2e59k9xo_1747813326.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9fa1/live/606e0f10-0bbf-11f0-9ca8-c5035ea95420.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cx2e2e59k9xo_1747813326.html", "title": "Alphonso Davies injury: Bayern Munich accuse Canada Soccer of 'negligence'", "title_page": "Alphonso Davies injury: Bayern Munich accuse Canada Soccer of 'negligence' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Bayern Munich have accused Canada Soccer of negligence after Alphonso Davies returned from international duty with a torn anterior cruciate ligament (ACL).\nDefender Davies went off injured 12 minutes into Canada's 2-1 win against the United States in a Concacaf Nations League third-place play-off on Sunday.\nCanada Soccer initially gave the 24-year-old the all clear, but an examination on his return to Munich revealed the injury. The full-back is expected to be out for at least six months.\nDuring a press conference on Friday, Bayern sporting director Christoph Freund said Canada Soccer's decision to send Davies on a 12-hour flight to Germany before a thorough medical examination was conducted was \"borderline\" and \"negligent\".\nHe added: \"The way things went down was incorrect. We are the employer and also pay the players, so we will investigate.\"\nIn an interview with German tabloid newspaper Bild, Bayern CEO Jan-Christian Dreesen said the club wanted a \"complete clarification of the events\", accusing Canada Soccer of \"gross negligence\" and saying \"we reserve the right to take legal action\".\nHe continued: \"Sending an obviously injured player with a damaged knee on a twelve-hour intercontinental flight without a thorough medical assessment is, in our view, grossly negligent and a clear breach of medical duty of care.\n\"Phonzy [Davies] is not at fault, he's the captain and he wants to take responsibility. Canada as host nation of the 2026 World Cup has already qualified, you can't take risks with a player like him.\"\nA Canada Soccer spokesperson told BBC Sport: \"We further reviewed the circumstances related to the medical care provided to Alphonso Davies.\n\"Medical documentation confirms that proper care protocols were followed, and communication records show that our medical staff provided updates to Bayern Munich throughout the entire tournament.\n\"We spoke further with Bayern Munich today to provide them with context and details to address any misunderstandings. We are all focused on supporting Alphonso in the months ahead.\"\nDavies signed a new five-year contract with the club in February to end speculation linking him with a move to Real Madrid.\nBayern also lost French centre-back Dayot Upamecano to a long-term leg injury during the international break and remain without captain Manuel Neuer.", "url": "https://www.bbc.com/sport/football/articles/cx2e2e59k9xo"}