{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:29:00", "date_modify": "2025-04-26 04:29:00", "date_publish": "2025-03-02 08:24:57", "description": "Former world record holder Paula Radcliffe runs her first marathon for 10 years aged 51 in Tokyo and aims for Boston next.", "filename": "sport_athletics_articles_cn48q9z9x4eo_1745641740.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7ced/live/3c4d1330-f73b-11ef-9c7c-091eceaea8c7.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_athletics_articles_cn48q9z9x4eo_1745641740.html", "title": "Paula Radcliffe runs Tokyo Marathon aged 51 to make return after 10 years", "title_page": "Paula Radcliffe runs Tokyo Marathon aged 51 to make return after 10 years - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Former world record holder Paula Radcliffe ran her first competitive marathon in a decade on Sunday in Tokyo.\nRadcliffe, 51, finished in a time of two hours, 57 minutes and 26 seconds - 10 years after ending her glittering athletics career at the 2015 London Marathon.\nThe Briton held the world record for 16 years from 2003 with a time of 2:15:25 before it was broken by Kenya's Brigid Kosgei in 2019.\nAnd her former record was still faster than that recorded by Sunday's winner, Ethiopia's Sutume Asefa Kebede, who defended her Tokyo title in 2:16:31.\nKenya's Winfridah Moraa Moseti was second in 2:16:56, with Ethiopia's Hawi Feysa third in 2:17:00.\nThe men's race was won by Ethiopia's Tadese Takele in a time of 2:03:23 for his first major marathon title.\nEthiopia's Deresa Geleta was second in 2:03:51, with Kenya's Vincent Kipkemoi Ngetich third in 2:04:00.\nUganda's double Olympic track champion Joshua Cheptegei came ninth.\nRadcliffe will also take part in next month's Boston Marathon as she aims to compete in all six major marathons.\nShe recently told Athletics Weekly, external: \"I turned 50 last year, am now 51, and thinking about the goals I've got left one of those was always to tick off the six marathon majors.\n\"For most of my career it was five and then Tokyo was added so I never really had the opportunity to race Tokyo. And Boston I never did because it was so close to London.\"\nIn addition to London, Boston and Tokyo, the other major marathons are Berlin, Chicago and New York.", "url": "https://www.bbc.co.uk/sport/athletics/articles/cn48q9z9x4eo"}