{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-05-21 06:05:28", "date_modify": "2025-05-21 06:05:28", "date_publish": "2025-01-04 20:24:09", "description": "Has Saturday's 4-1 demolition of West Ham marked the return of the old Manchester City? 'Absolutely not' according to boss Pep Guardiola.", "filename": "sport_football_articles_cgl9w291x2do_1747807528.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/91a4/live/468d5da0-cad1-11ef-94df-33b0323b7c60.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cgl9w291x2do_1747807528.html", "title": "Man City 4-1 West Ham: Pep Guardiola says 'old Man City' have definitely not return yet", "title_page": "Man City 4-1 West Ham: Pep Guardiola says 'old Man City' have definitely not return yet - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Consecutive wins for the first time since October. Scoring four goals in a Premier League for the first time since August. Erling Haaland's first league double since September.\nHas Saturday's 4-1 demolition of West Ham marked the return of the old Manchester City? 'Absolutely not' according to boss Pep Guardiola.\nThe win leaves the defending champions sixth in the Premier League, just three points off third-placed Nottingham Forest, and offers welcome relief after a forgettable last couple of months.\nBut, when asked if the result was a sign of his team regaining the form most people are used to seeing from them - following a run of two wins from 10 games - the Spaniard was unequivocal in his response.\n\"No,\" Guardiola, said. \"You judge the results. Our performance was not good. We saw in many years our level. We are not at our level.\n\"Don't misunderstand me. I'm so happy. I will sleep better until the FA Cup [tie against Salford on 11 January].\n\"But he asked if the old Manchester City and the way we play is back? No. You have to know it. You watched the games for years. We're not at the level, come on.\n\"Of course there are an incredible lot of positives. But if you ask me the team is playing like it has played the years ago, no, absolutely not.\"\nGuardiola is a phenomenally hard task master.\nHis standards are exacting and he has driven City on when they have been in the midst of those long winning streaks that have been such a hallmark of his eight-and-a-half incredibly successful seasons at the club.\nYet the soul searching of the past few weeks has been so extensive, it did feel as though a comfortable win - even if West Ham did have some decent chances - was something to celebrate.\nWhile Guardiola rejected that theory, he was more expansive about Brazilian winger Savinho.\nA £30m arrival from fellow City Football Group club Troyes last summer, the 20-year-old has endured an inconsistent debut campaign.\nHowever, West Ham could not cope with his direct running. It was Savinho's cross that Coufal deflected into his own goal and another Haaland headed in for the second.\nSavinho also provided the through ball Haaland finished off for City's third, leading to fulsome praise from Guardiola.\n\"Having a left foot on the left side, like old fashioned vintage football, right in the right, left in the left, and these kinds of crosses helps the striker we have,\" he said.\n\"He has lot to improve. He is not aggressive enough without the ball and a little bit soft in many departments. But right now has something special and brilliant that helps the team a lot.\"", "url": "https://www.bbc.com/sport/football/articles/cgl9w291x2do"}