{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:44:50", "date_modify": "2025-05-21 06:44:50", "date_publish": "2025-03-30 17:54:29", "description": "Bournemouth 1-2 Man City: What Pep Guardiola said", "filename": "sport_football_articles_czrvg614d7ro_1747809890.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_czrvg614d7ro_1747809890.html", "title": "Bournemouth 1-2 Man City: What Pep Guardiola said", "title_page": "Bournemouth 1-2 Man City: What Pep Guardiola said - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Man City boss Pep Guardiola spoke to BBC Sport after today's victory: \"It was harder for them [Bournemouth]. We played an outstanding game and had incredible chances, missed a penalty. We conceded with one chance we gave away. Our approach was magnificent. Seven times in a row semi-final in the FA Cup, no team has done it and it will be difficult for any other to do what these legendary players, the new ones and the old ones, will have done.\"\nOn seven semi-finals in a row: \"It is unbelievable. The way we competed today compared to the way we played in the first game here [in the Premier League]. I was not good enough to overcome that situation then. We were sloppy for many games and I was not able to let them realise is what they have done today. For example Brighton was a difficult game, we didn't play our best but we fought. This is what had to happen\".\nOn Nico O'Reilly: \"He is an attacking midfielder. He is physical, he is strong. He is really, really good.\"\nOn what he changed at half-time: \"The first half we played with the same intensity as the second. The difference was that we played better with the ball with more composure - we were more calm. I said at half-time, we have the game in our hands.\"\nOn whether they will appoint a new penalty taker after Haaland's miss: \"Absolutely not. Against Brighton he scored.\"\nOn facing Nottingham Forest in the semi-final: \"Sometimes we've lost when we've performed well. In the home game we won 3-0 so when we lose one game it looks like a disaster. It's not true. They are third in the table, they are a very good team and we are pleased to play against them in Wembley with our fans.\"", "url": "https://www.bbc.com/sport/football/articles/czrvg614d7ro"}