{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:40:38", "date_modify": "2025-05-20 13:40:38", "date_publish": "2023-07-24 17:15:09", "description": "Ireland ease to a comfortable nine-wicket win over Jersey to edge closer to qualification for next year's Twenty20 World Cup.", "filename": "sport_cricket_66288924_1747748438.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/F80B/production/_130499436_jerseyirelandinbox.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66288924_1747748438.html", "title": "T20 World Cup Qualifier: Ireland defeat Jersey by nine wickets to edge closer to World Cup qualification", "title_page": "T20 World Cup Qualifier: Ireland defeat Jersey by nine wickets to edge closer to World Cup qualification - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ireland took another significant step towards qualification for the T20 World Cup by comfortably seeing off Jersey by nine wickets in Edinburgh on Monday.\nThe victory made it four wins from four matches for the Irish team with games against Germany on Thursday and hosts Scotland on Friday still to come.\nBarry McCarthy was the pick of the bowlers with 3-7 as Jersey were restricted to 78-9 off their 20 overs.\nPaul Stirling was unbeaten on 35 as Ireland reached 80-1 off 10.2 overs.\nThe Ireland captain and fellow opening batter Andrew Balbirnie put on 55 for the first wicket before the latter fell in the seventh over.\nStirling smashed one six and five fours as he accumulated his contribution off just 26 balls, while Balbirnie made 25 from 24 deliveries.\nLorcan Tucker was 14 not out when Ireland reached their target with 9.4 overs to spare.\nTeenager Asa Tribe was Jersey's leading run scorer with 26, the middle order batter being the only player in his team to reach double figures.\nHis side found themselves 25-5 midway through the seventh over, before rallying slightly to complete their 20 overs.\nIn addition to McCarthy's tally, Ben White took 2-10, with Josh Little ending with figures of 2-23.\nIreland are well on course to secure one of the top two places from the seven-team tournament which would see them advance to next year's World Cup in the USA and West Indies.", "url": "https://www.bbc.com/sport/cricket/66288924"}