{"authors": ["Brent Pilnick", "www.facebook.com"], "date_download": "2025-05-21 06:54:39", "date_modify": "2025-05-21 06:54:39", "date_publish": "2025-03-29 16:57:16", "description": "Greg Fisilau's last-minute try sees Exeter come from behind to beat Newcastle 17-15 to win the battle of the Premiership's bottom two sides.", "filename": "sport_rugby-union_articles_cy0drg4dyyko_1747810479.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f305/live/708d2990-0cc7-11f0-b574-b9ad208c1713.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cy0drg4dyyko_1747810479.html", "title": "Premiership: Exeter 17-15 Newcastle", "title_page": "Premiership: Exeter 17-15 Newcastle - Greg Fisilau scores late for Chiefs win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Greg Fisilau's last-minute try saw Exeter come from behind to beat Newcastle 17-15 to win the battle of the Premiership's bottom two sides.\nWill Rigg's early try for the hosts was cancelled out soon after by the Falcons' Joe Davis before team-mate Max Clark put his side in front.\nBut with Newcastle's Richard Palframan yellow carded Martin Moloney drew the scores level, only for Brett Connon's penalty to put Newcastle 15-12 up at the interval.\nNewcastle defended well as a scrappy second half produced few great scoring chances.\nBut in the final minute Exeter broke through the Falcons' stubborn defence as Fisilau went over in the corner.\nThe win was just a third of the season for Exeter as they closed the gap to eighth-placed Northampton to eight points.\nThe Falcons, who beat Exeter at Kingston Park earlier in the season, are now 10 points adrift at the bottom of the table.\nDespite being against a strong wind it took Exeter just seven minutes to break through - Rigg dotting down in the right corner as Exeter moved the width of the field after strong pressure had seen them win a line-out penalty in the left corner.\nBut young scrum-half Davis drew the scores level five minutes later when he intercepted a loose Ben Coen pass and raced in under the posts from 25 metres for a try on his first Premiership start.\nFifteen minutes after Newcastle - who had not won away from home since November 2022 - went ahead when Clark forced his way over following eight phases from a five-metre line-out in the Falcons' first sustained period in the Exeter red zone.\nDespite having the bulk of the first-half possession Exeter's attack struggled to create chances as the half wore on until Newcastle prop Palframan was sin-binned five minutes from half-time for an infringement in an Exeter line-out.\nTwo minutes later the Chiefs drew level as Moloney was forced over from a five-metre line-out before Connon kicked a long-range penalty on the stroke of half-time.\nExeter had half-chances to go ahead early in the second half, but each time they were thwarted either by their own errors or good defence from the visitors.\nThe Falcons - led by skipper Callum Chick - continued to defend well as the half wore on and almost went further ahead with nine minutes left but Connon's clever kick towards the left corner took a nasty bounce and evaded the onrushing Ben Stevenson.\nBut just as it looked as though Newcastle might hold on, Exeter struck.\nHaving laid siege in the Falcons' 22 Exeter lost the ball, but they regrouped in midfield and Kane James linked up with Harvey Skinner to break through before handing it on the Rusi Tuima and then Fisilau who went in - despite concerns there may have been a forward pass in the build up.\nExeter director of rugby Rob Baxter told BBC Radio Devon:\n\"Anybody watching will go 'how did we not score three or four tries?'\n\"We're making pretty critical breaks pretty much into their five-metre zone and then it's just that last little bit.\n\"That's going to be the hardest thing for us to work on, and also I think you could see we were trying to make passes and move the ball and get to space - the interception was a perfect example - it was a bit like a blind pass to space with an expectation that someone's going to be there.\n\"We came unstuck with that a little bit, we made passes to people who were getting tackled rather than, especially on turnovers, just going ourselves first or attacking the ball.\"\nNewcastle boss Steve Diamond told BBC Radio Newcastle:\n\"Like the first game up in Newcastle it was a close game - this one was decided by the officials.\n\"There was a clear act of foul play in the try and I don't know for the life of me why the VAR man doesn't have a look at it at least.\n\"If we're going to take foul play out of the game let's not just waste time and just look at forward passes and decide if a try's a try or not a try.\n\"So I'm disappointed with the officials, but fair play to Exeter, they kept going like we kept going and someone has to lose, and it was us today.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/cy0drg4dyyko"}