{"authors": ["Richard Petrie", "www.facebook.com"], "date_download": "2025-05-21 06:48:33", "date_modify": "2025-05-21 06:48:33", "date_publish": "2025-03-28 21:47:17", "description": "Ulster recover from a 17-0 early deficit to battle back and record a six-try 38-34 win over the Stormers in Friday's United Rugby Championship game at Kingspan Stadium.", "filename": "sport_rugby-union_articles_cp3y3nxg03ro_1747810113.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9814/live/3f284990-0c2a-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cp3y3nxg03ro_1747810113.html", "title": "United Rugby Championship: Ulster recover from big early deficit to defeat 14-man Stormers", "title_page": "United Rugby Championship: Ulster recover from big early deficit to defeat 14-man Stormers - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ulster recovered from a 17-0 deficit after just eight minutes to run in six tries, recording a battling 38-34 win over the Stormers in Friday's frantic United Rugby Championship encounter at Kingspan Stadium.\nTries from Evan Roos and Ben Loader helped the visitors to their sizeable early lead but Robert Baloucoune, Andrew Warwick and Jack Murphy's scores ensured the sides went in level at the interval.\nThe try-fest continued after the break, Stockdale crossing for the bonus-point try before the South African side had skipper Neethling Fouche sent-off for a dangerous challenge on Ben Carson.\nZac Ward and Stewart Moore also touched down for the Irish province, while Willie Engelbrecht and Roos scored tries for the Stormers to keep themselves within touching distance.\nFor Ulster it was the first time this season they have recorded three wins in a row. They move up to fifth position in the table to improve their chances of clinching a top eight-place, which would guarantee a spot in the end-of-season knockout stages and qualification for the Champions Cup.\nThe Stormers remain in contention too after picking up bonus points for scoring four tries and being within seven points and with four home games to come to complete their regular league campaign.\nThe Cape Town side took a second-minute lead when back-rower Roos raced away to score after the hosts had been turned over on their own 22, and Sacha Feinberg-Mngomezulu played him through a gaping hole in the Ulster defence.\nThe visiting fly-half added the extras and soon after executed a drop goal from long range to increase the lead to 10-0.\nThe South African side's superb start continued when Loader broke away to score after Dave McCann's pass in the tackle on halfway fell loose and was latched on to by the wing. Feinberg-Mngomezulu kicked the conversion from the right-hand touchline.\nUlster responded on 11 minutes as Baloucoune marked his return to action after an 11-month absence by going over in the corner after collecting Murphy's 20-yard spin pass.\nThe home side enjoyed the better of the possession and pressure thereafter in the first half and were rewarded when prop Warwick barged over from close range, Cooney adding the additional two points.\nFeinberg-Mngomezulu then steered a penalty from 35 metres wide after the ball fell off the tee - a let-off for Richie Murphy's side.\nThe Stormers number 10 was at the centre of the action again as he received a yellow card for taking out Baloucoune in full flight after the wing had kicked the ball forward into space.\nSoon after, Murphy crossed when the ball was spun to him on the left after Ulster rucked up close to the Stormers' line and he finished the move superbly.\nAfter the sides went in level at the break, Ulster got off to a storming start on the resumption by touching down for his side's bonus-point score.\nUlster opted for a tap and go at a penalty and worked the ball to the left, where Mike Lowry unselfishly passed to Stockdale who cantered over. Cooney was successful with his kick to put two between the sides.\nThe Stormers suffered a further setback when they had captain Fouche sent-off by referee Andrea Pairdi after he consulted with the Television Match Official [TMO].\nThe prop was adjudged to have committed a dangerous challenge to the head of centre Carson, who left the field injured.\nFeinberg-Mngomezulu reduced his team's arrears when he returned to the field after his 10 minutes in the bin, notching a second drop goal, this time firing between the sticks from 40 yards.\nThat proved to be only a brief respite, however, as Ulster scored try number five. Stockdale burst through the midfield before offloading to the right flank to flying replacement Ward, who sprinted over the line. Murphy had the simple task of adding the conversion from in front of the posts.\nThe Stormers were not finished though as substitute Engelbrecht darted in beside the posts, Feinberg-Mngomezulu adding the two points to put just four between the sides.\nUlster's sixth try came on the counter-attack, Lowry scorching down the right flank and passing to Nick Timoney, then Doak, then Moore who dashed over adjacent to the uprights. Doak's kick extended his side's advantage to 11 points.\nAgain, the Stormers came back strongly as Roos barged over from close range for his second of the night, the conversion bringing their side to within four.\nUlster hung on for a crucial win, however, the victory ensuring that the record of no South African side having ever won at the Kingspan Stadium continues.", "url": "https://www.bbc.com/sport/rugby-union/articles/cp3y3nxg03ro"}