{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:19:07", "date_modify": "2025-05-19 15:19:07", "date_publish": "2015-02-09 20:31:04", "description": "Shareholder Dave King has criticised the Rangers board over their decision to hold the club's EGM in London.", "filename": "sport_football_31327070_1747667947.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/80901000/jpg/_80901435_king6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31327070_1747667947.html", "title": "Rangers: Dave King critical of board over EGM venue decision", "title_page": "Rangers: Dave King critical of board over EGM venue decision - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Dave King insists the decision to hold Rangers' extraordinary general meeting in London is \"simply outrageous\".\nKing made his assessment before it was revealed the Millennium Gloucester Hotel would not now host the meeting.\nAnother venue in the \"London area\" is now being sought.\nKing said moving the meeting to a hotel that holds 500 at \"greater cost to the club and small shareholders,\" was \"simply outrageous by any standard of respect or corporate governance.\"\nAnd the Rangers shareholder, who called the EGM in the hope of ousting the current board, added: \"What is truly disappointing, albeit unsurprising, is the board's continued bitterness and antagonism towards the club's shareholders and supporters.\n\"The board's defiance of its own fans, customers and shareholders is clearly a matter that invokes passion in any Rangers supporter.\n\"The fact that the fans continue to demonstrate by vociferous but peaceful means is a credit to the fans collectively and to the club as a whole. It is truly humbling to evidence how fans have rallied round the club in this time of need.\"\nRangers revealed on Monday night that they have been forced to search for an alternative venue in London ahead of their EGM on 4 March.\nThe club insisted \"complaints and false information\" led the Millennium Gloucester Hotel to fear \"disruption to guests and neighbours\".\nRangers stated that: \"The board apologises for any inconvenience.\"", "url": "https://www.bbc.com/sport/football/31327070"}