{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:58:37", "date_modify": "2025-05-21 06:58:37", "date_publish": "2025-03-29 11:29:24", "description": "Stuart McCloskey jokes his team-mates tried to spoil his 200th Ulster cap as they need a huge comeback to beat the Stormers in the URC.", "filename": "sport_rugby-union_articles_cx2g2zd313wo_1747810717.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/bc13/live/cbd5d2d0-0c8f-11f0-ab43-87a6edcab0a9.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cx2g2zd313wo_1747810717.html", "title": "Stuart McCloskey: Centre jokes team-mates tried to spoil his 200th Ulster appearance", "title_page": "Stuart McCloskey: Centre jokes team-mates tried to spoil his 200th Ulster appearance - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Stuart McCloskey joked his team-mates had seemed determined to spoil his 200th Ulster appearance as the Irish province trailed 17-0 after only eight minutes before fighting back to beat the Stormers 38-34 in the United Rugby Championship.\n\"Tonight we decided to get ourselves in a big hole on my big night, the lads were telling me,\" laughed the centre when interviewed by BBC Sport NI after the game.\nUlster looked in huge trouble after tries from Evan Roos and Ben Loader gave the Stormers their sizeable lead but the home side fought back to notch six touchdowns as they clinched a third successive win to boost their hopes of achieving a play-offs spot.\n\"All you can do is look at each other smile and say 'start again',\" added the 32-year-old of the predicament Ulster found themselves in.\n\"There wasn't a great deal said when we went 17-0 down but we composed ourselves well and got ourselves back into the game and obviously a bit of ill-discipline by them helped us.\n\"I thought some of our attacking play tonight was the best it's been all year.\"\nNext up for Ulster in Sunday week's Investec Champions Cup last-16 contest against an in-form Bordeaux side.\nMcCloskey, who is contracted with the Irish province until the summer of 2027, knows full well Ulster will go into that game game as rank outsiders but says they can take \"a bit of momentum\" into that contest after three straight wins.\n\"We can throw caution to the wind [in Bordeaux] and throw it about because they are meant to be the best team about. I know we can score tries, it's just whether we can sort out some of the defensive stuff,\" added the centre who became the 11th player to reach 200 Ulster appearances.\nMcCloskey hailed the display of man of the match Jack Murphy whose performance at fly-half included scoring one of Ulster's tries.\n\"He has a great brain for it and at the age he is, he's miles ahead of what I was at that age and miles ahead of probably most players of that age,\" added McCloskey of the 20-year-old, who is a son of Ulster coach Richie Murphy.", "url": "https://www.bbc.com/sport/rugby-union/articles/cx2g2zd313wo"}