{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:37:39", "date_modify": "2025-05-20 12:37:39", "date_publish": "2023-08-03 20:43:42", "description": "Japan's Hinako Shibuno compiles a stunning 64 to lead after the opening day of the Women's Scottish Open at Dundonald Links.", "filename": "sport_golf_66401265_1747744659.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1452C/production/_130644238_gettyimages-1589424905.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_golf_66401265_1747744659.html", "title": "Women's Scottish Open: Japan's Hinako Shibuno leads at Dundonald Links after 64", "title_page": "Women's Scottish Open: Japan's Hinako Shibuno leads at Dundonald Links after 64 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Japan's Hinako Shibuno compiled a stunning 64 to lead after the opening day of the Women's Scottish Open at Dundonald Links.\nShibuno, who won the 2019 Women's Open, posted five birdies in her first seven holes to streak to the top of the leaderboard in fine style in Troon.\nSweden's Madelene Sagstrom (66) is her closest challenger, with Nicole Broch Estrup, Caroline Hedwall and Caroline Inglis (all 68) a further two adrift.\nLast week's Evian Championship winner Celine Boutier - runner-up in the Scottish Open 12 months ago - is another stroke back.\nLouise Duncan is the leading Scot after a 71, tied with England's Charley Hull.\nThey are one ahead of defending champion Ayaka Furue, whose 74 included double bogeys on the par-three 11th and 15th.\nThere were no such troubles for Shibuno, though, who showed no signs of a lingering finger injury that has hampered her in recent months.\n\"It's getting better,\" she said. \"It's healing now, my fingers and my upper body was a little tight, but my sequence is getting better.\n\"The ground is firm, firmer, than a normal course but if you hit low and solid, my finger is not getting hurt. So, I'm just being relaxed and more thinking about sequence, the swing.\"", "url": "https://www.bbc.com/sport/golf/66401265"}