{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:42:39", "date_modify": "2025-05-21 04:42:39", "date_publish": "2025-01-05 16:26:50", "description": "Ipswich Town complete the loan signing of former Everton and Norwich defender Ben Godfrey from Atalanta.", "filename": "sport_football_articles_cr56ye0l6p6o_1747802559.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/fb1c/live/5f566820-cb82-11ef-b454-0d3064afa545.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cr56ye0l6p6o_1747802559.html", "title": "Ben Godfrey: Ipswich sign defender on loan from Atalanta for rest of season", "title_page": "Ben Godfrey: Ipswich sign defender on loan from Atalanta for rest of season - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ipswich Town have completed the loan of defender Ben Godfrey from Atalanta.\nThe England international has joined the Premier League club on a deal until the end of the season, becoming their first signing of the January transfer window.\nThe 26-year-old has played just 22 minutes in Serie A since Atalanta signed him from Everton last summer for a fee in the region of £10m.\n\"I can't wait to meet the lads and get started,\" said Godfrey, who earned two England caps in 2021.\n\"I have really enjoyed speaking to the manager (Kieran McKenna) and to have the opportunity to work under him now is something I'm very excited about.\"\nGodfrey has played a further 71 minutes in his other four appearances in all competitions, which includes two outings in the Champions League.\nHe previously made 93 appearances for Everton after joining the club in a £25m move from Norwich in October 2020.\nGodfrey attended Ipswich's 2-2 draw at Fulham on Sunday, which means the Tractor Boys remain 18th in the Premier League, behind Wolves on goal difference.\n\"I've watched a lot of the games from the first half of the season and you can tell from those that the group is a tight one, full of players giving everything to achieve their goals,\" added Godfrey.\n\"I've not played as much as I would have liked so far this season, but I feel ready to contribute and am looking forward to getting out there.\"", "url": "https://www.bbc.com/sport/football/articles/cr56ye0l6p6o"}