{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:35:35", "date_modify": "2025-05-20 14:35:35", "date_publish": "2023-07-29 00:00:00", "description": "Watch live action from the World Triathlon Championship Series at Sunderland's Roker Beach.", "filename": "sport_live_triathlon_66314298_1747751735.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/B7ED/production/_130558074_gettyimages-1164921291.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_triathlon_66314298_1747751735.html", "title": "World Triathlon Series Sunderland LIVE: GB's Olivia Mathias and Barclay Izzard plus title-chasing Cassandre Beaugrand and Hayden Wilde", "title_page": "World Triathlon Series Sunderland LIVE: GB's Olivia Mathias and Barclay Izzard plus title-chasing Cassandre Beaugrand and Hayden Wilde - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "What is the World Triathlon Championship Series?\nBBC Sport\nThe World Triathlon Championship Series is World Triathlon's annual series of triathlon events used to crown an annual world champion since 2008.\nThe seven-event 2023 series concludes with the final in Pontevedra, Spain, with the penultimate race held here in Sunderland for the first time. Points from the Paris Olympics Test Event will also count.\nThe overall champion is decided by an athlete's best four results, plus the championship finals.\nWho to look out for\nBBC Sport\nThe latest stage of the World Triathlon Championship Series comes to Sunderland with a weekend of super-sprint eliminator and mixed relay races.\nOn Saturday, British trio Izzard Barclay, Max Stapley and Jack Willis are in action in the men’s super-sprint alongside series leader Vasco Vilaca of Portugal, New Zealand’s Hayden Wilde and 2022 World Champion Leo Bergere of France.\nOlivia Mathias, a silver medallist in the 2022 Commonwealth Games is GB’s only competitor in the female race.\nOn Sunday, Team GB are in action in the mixed relay headed by GB’s Beth Potter.\nHow to get into triathlon\nBBC Sport\nWhy get into triathlon?\nTriathlon is a great way to get active by swimming, cycling and running, and it's fun and varied too.\nWho is it for?\nAll ages, from mini triathlons for kids to GO TRI, external beginner events. There are also a number of women-only events.\nWhat if I want a proper workout?\nTriathlon events come in a variety of course distances and mixing in a bit of competition will push your workout to the max.\nCan I take it to another level?\nIf you want to push it up a gear, consider joining a local club, external to take part in some structured training before racing.\nIs there a disability option?\nParatriathlon is very popular with many inclusive events and competitions that cater for most disabilities.\nLike running, swimming or cycling?\nFancy doing all three, one after the other? Triathlon is the sport for you!\nTriathlon mainly runs from May-September and there are loads of races and taster sessions to choose from. Find a comprehensive list of races via the British Triathlon event finder., external\nGo Tri, external is a fun way to get a taste without breaking the bank. Pool-based races are a great introduction to the sport if you are a first timer.\nUseful links\nBritish Triathlon, external\nEngland Triathlon, external\nTriathlon Ireland, external\nTriathlon Scotland, external\nWelsh Triathlon, external\nBritish Paratriathlon, external", "url": "https://www.bbc.com/sport/live/triathlon/66314298"}