{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:34:56", "date_modify": "2025-04-26 04:34:56", "date_publish": "2025-02-28 12:40:47", "description": "Former Premier League referee David Coote is banned by Uefa until July 2026 after his conduct at Euro 2024.", "filename": "sport_football_articles_ce988kxrkpvo_1745642096.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ea67/live/9ec5d960-f5ca-11ef-9b68-05a34bb37cf3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_ce988kxrkpvo_1745642096.html", "title": "David Coote banned by Uefa after video on duty at Euro 2024", "title_page": "David Coote banned by Uefa after video on duty at Euro 2024  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Former Premier League referee David Coote has been banned by Uefa following his conduct around Euro 2024.\nCoote was sacked in December by Premier League refereeing body the Professional Game Match Officials Limited (PGMOL) following an investigation into his conduct.\nHe was initially suspended by the PGMOL on 11 November after a video circulated showing him making derogatory comments about Liverpool and their former manager Jurgen Klopp.\nA further investigation was opened by Uefa two days later after the Sun published photographs it says were taken during last summer's European Championship, alleging they appear to show Coote sniffing a white powder through a rolled up US bank note.\nThe 42-year-old was listed as a video assistant referee at the tournament in Germany.\nUefa says Coote had \"violated the basic rules of decent conduct\" and he was sanctioned for \"bringing the sport of football, and Uefa in particular, into disrepute\".\nHe is banned from officiating in European competitions until 30 June 2026.\nIn an interview with the Sun last month, Coote revealed he is gay and apologised for his actions.\nOn 27 November 2024, the Football Association opened a new investigation following an allegation that Coote had discussed giving a yellow card before a Championship match between Leeds and West Brom in 2019. He has always denied these allegations.", "url": "https://www.bbc.co.uk/sport/football/articles/ce988kxrkpvo"}