{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:44:45", "date_modify": "2025-05-21 06:44:45", "date_publish": "2025-03-31 00:00:00", "description": "Mumbai Indians face Kolkata Knight Riders in the IPL - follow live scores, radio commentary and updates.", "filename": "sport_cricket_live_c5yr4ney2kgt_1747809885.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8916/live/6c949cf0-089a-11f0-97d3-37df2b293ed1.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_live_c5yr4ney2kgt_1747809885.html", "title": "IPL 2025 LIVE: MI vs KKR", "title_page": "IPL 2025 LIVE: MI vs KKR - cricket score, radio commentary & updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ashwani stars as MI beat KKR\nIt was an easy win for MI as they wrapped up an eight-wicket victory against KKR with 43 balls to spare.\nAshwani Kumar was the star of the show on his IPL debut - take a look at our report to find out more.\nWe'll be back tomorrow with coverage of Lucknow Super Giants v Punjab Kings (15:00 BST).\nMumbai search for first win of IPL 2025\nFive-time champions Mumbai Indians are still searching for their first win of this year's Indian Premier League as they host Kolkata Knight Riders.\nMumbai were comfortably beaten by Chennai Super Kings and Gujarat Titans in their first two matches.\nDefending champions KKR lost the opening match against Royal Challengers Bengaluru but thrashed Rajasthan Royals last week.\nWill Jacks is back for Mumbai Indians while Moeen Ali has dropped out of the KKR line-up with Sunil Narine fit again.\nRohit Sharma has not been named in Mumbai's initial XI but looks likely to come in as an impact sub with Mumbai bowling first.\nFollow the IPL on the BBC\nThe 18th season of the Indian Premier is under way and you can follow all the action across the BBC.\nThere will be ball-by-ball commentary on more than 35 games on BBC Sounds, BBC Radio 5 Sports Extra and the BBC Sport website and app across the competition.\nYou'll be able to find those commentaries and all the latest news, reports and best stats on our Franchise Cricket page.\nIf social media is more your thing then the BBC Cricket Instagram, external and BBC Cricket WhatsApp, external accounts will keep you up to date.", "url": "https://www.bbc.com/sport/cricket/live/c5yr4ney2kgt"}