{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:13:06", "date_modify": "2025-05-20 14:13:06", "date_publish": "2023-07-26 11:36:55", "description": "Everton: Keane says new signings 'would be nice'", "filename": "sport_articles_cv2jv1rpey1o_1747750386.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/06e7/live/e714a740-2ba6-11ee-9e83-8d12211ac2f9.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cv2jv1rpey1o_1747750386.html", "title": "Everton: Keane says new signings 'would be nice'", "title_page": "Everton: Keane says new signings 'would be nice' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Shamoon Hafez, BBC Sport at the Toughsheet Community Stadium\nEverton defender Michael Keane says it \"would be nice\" for the club to make more summer signings as they aim to avoid another battle against relegation this season.\nThe Toffees escaped the drop on the final day last season by edging to victory over Bournemouth.\nSean Dyche has brought in full-back Ashley Young and winger Arnaut Danjuma, but desperately needs additions up front for a side that scored just 34 goals in 38 league games last term.\nReports in Italy suggest Atalanta have agreed a deal to sign Almeria striker El Bilal Toure, but the Toffees retain an interest, while they continue to pursue deals for Leeds' Wilfried Gnonto and Ajax forward Brian Brobbey.\n\"I don’t think it is easy, but I am sure they will be trying,\" Keane said after Tuesday's friendly goalless draw at Bolton. \"I think that is what the club is aiming to do.\n\"I think you could look at the squad and get better in a lot of positions, but we had periods where we struggled for goals.\n\"In the Premier League, you find it tough when that is the case, so I am sure they will be looking to bring more goals in. We hope Danjuma will give us that, but they will be looking for more as well.\"\nEverton spent a week training in the Alps, where the squad were put through their paces including Dyche's infamous 'Gaffer's Day' - a training session without balls and consisting of a large amount of running.\n\"It is not nice,\" said Keane. \"But you definitely feel good after it.\n\"It is a mental challenge, and there are times when you want to give up, but you just keep going, get back on that line, and run again.\n\"Everyone gave their best and everyone feels the benefits for it.\"", "url": "https://www.bbc.com/sport/articles/cv2jv1rpey1o"}