{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:50:59", "date_modify": "2025-05-20 14:50:59", "date_publish": "2023-07-25 00:00:00", "description": "Follow live text commentary as Switzerland face Norway in Group A of the 2023 Fifa Women's World Cup.", "filename": "sport_live_football_66158362_1747752659.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0B40/production/_130508820_whatsubject.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_football_66158362_1747752659.html", "title": "Fifa Women's World Cup LIVE: Switzerland vs Norway score, commentary & updates in Group A game", "title_page": "Fifa Women's World Cup LIVE: Switzerland vs Norway score, commentary & updates in Group A game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Post\nRight, that's it from us for today. Here's Neil Johnston's report on that goalless draw between Switzerland and Norway.\nSee you later!\n'Resilient'\nFT: Switzerland 0-0 Norway\nKim Little\nFormer Scotland midfielder on ITV1\nWhen Switzerland look back on this game they'll be proud of the performance.\nThey were resilient and well organised.\n'Not in Norway's hands'\nFT: Switzerland 0-0 Norway\nFran Kirby\nEngland forward on ITV1\nIt was a more positive performance from Norway but they did lack some conviction.\nIt's [qualification] not in their hands now.\nFor Switzerland, you could tell they were happy with the draw, they were much more conservative.\nPhilippines defeat co-hosts New Zealand\nAnd in the earlier Group A game, New Zealand missed a golden opportunity to edge closer to the knockout stages as the Philippines became the first debutants to pick up a win at this tournament.\nPost\nFT: Switzerland 0-0 Norway\nThis is how it looks in Group A after today's results. Switzerland are in control and will fancy their chances of getting a result against co-hosts New Zealand on Sunday to progress.\nMeanwhile, Norway face the Philippines in a huge deciding game on the same day.\nFULL-TIME\nSwitzerland 0-0 Norway\nAll over and it ends goalless as Norway go four matches without scoring at a major tournament.\nThe point means Switzerland need just a point from their final group game to progress, while nothing less than a win will do for Norway, and even that might not be enough.\nPost\nSwitzerland 0-0 Norway\nThere's four minutes of time added on.\nNorway need to find a winner or progression to the knockouts is out of their hands.\nSUBSTITUTION\nSwitzerland 0-0 Norway\nChanges for both sides as Vilde Bøe Risa and Thea Bjelde make way for Marit Bratberg Lund and Ingrid Engen for Norway.\nSeraina Piubel is replaced by Meriame Terchou for Switzerland.\nPost\nSwitzerland 0-0 Norway\nNorway are pushing for a winner and that's leaving them exposed at the back as Switzerland come forward down the left before Ramona Bachmann finds Seraina Piubel inside the box but her shot has the sting taken out of it by a challenge.\nPost\nSwitzerland 0-0 Norway\nNorway have a free kick on the left side of the box. It is a dangerous position and Caroline Graham Hansen goes for the near post but there's lots of Switzerland players there to clear.\nPost\nSwitzerland 0-0 Norway\nFrida Maanum cuts the ball back on the right but Caroline Graham Hansen can't get to it. Switzerland then break through Ana-Maria Crnogorcevic but her run is halted by a challenge right on the edge of the Norway box.\nPost\nSwitzerland 0-0 Norway\nA point would be a very good result for Switzerland, keeping them top of Group A, and it feels like they are taking a safety first approach now.\nPost\nSwitzerland 0-0 Norway\nVilde Bøe Risa drives over after a Norway corner is half cleared.\nNorway are finishing this game strongly, as they need to if they are to get a first win of the tournament.\n'Norway ramping up the pressure'\nSwitzerland 0-0 Norway\nLucy Ward\nFormer Leeds striker on ITV\nThalmann is the reason Switzerland still have a clean sheet.\nNorway are ramping up the pressure, especially down the right-hand side with Graham Hansen causing problems.\nShe's had a great impact since coming on.", "url": "https://www.bbc.com/sport/live/football/66158362"}