{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:50:31", "date_modify": "2025-05-21 04:50:31", "date_publish": "2025-01-14 22:59:51", "description": "Nottingham Forest 1-1 Liverpool: 'We can now aim a little higher' - Matz Sels reacts to draw", "filename": "sport_football_articles_cm29ml137l3o_1747803031.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b3c5/live/02fd8d60-d2cb-11ef-a95c-5b151e1edf12.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cm29ml137l3o_1747803031.html", "title": "Nottingham Forest 1-1 Liverpool: 'We can now aim a little higher'", "title_page": "Nottingham Forest 1-1 Liverpool: 'We can now aim a little higher' - Matz Sels reacts to draw - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Nottingham Forest goalkeeper Matz Sels, speaking to TNT Sports: \"One point is a good result for us. Before the game there was a lot of talk from everyone about 'if we win or if we lose' but this was a good scenario for us. We scored a quick goal but then we know it is a small advantage.\n\"In the second half we knew they would have more spaces between the lines. They are a very good team, they use that space and created a lot of chances. We are happy with the point and are looking forward to Sunday.\"\nOn his personal performance: \"First half I did not have a lot of work but always against these teams there are a few moments. In the last 20-25 minutes they had quite a few chances. It is important for me to be there to help the team to stay in the game.\n\"In the end everyone could see that people had cramps and pains which shows that everybody fought for it and we deserved the point. We need to continue looking forward.\"\nOn the talk around the team: \"We are of course enjoying it. We had just won six times in a row, which is something positive. We need to enjoy these moments.\n\"We said before the season that if we took 40 points as quick as possible that would be great and we are now on 41 with 17 games to go. We can now aim a little higher and see where we end up by the end of the season.\"", "url": "https://www.bbc.com/sport/football/articles/cm29ml137l3o"}