{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:50:22", "date_modify": "2025-05-21 07:50:22", "date_publish": "2024-12-23 15:29:26", "description": "Plymouth head coach Wayne Rooney says the club is in a good place to bolster their injury-hit squad when the transfer window opens next week.", "filename": "sport_football_articles_ce8eqrq3076o_1747813822.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4c0d/live/024ce930-c13f-11ef-a8c2-37ad53d91ed7.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ce8eqrq3076o_1747813822.html", "title": "Wayne Rooney: Plymouth Argyle boss aims to bolster squad", "title_page": "Wayne Rooney: Plymouth Argyle boss aims to bolster squad - but Morgan Whittaker not for sale - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Plymouth Argyle head coach Wayne Rooney said the club is in a good place to bolster their injury-hit squad when the January transfer window opens next week.\nThe Pilgrims are without forwards Muhamed Tijani, Ryan Hardie, Ibrahom Cissoko and Morgan Whittaker due to injuries.\nArgyle's medical staff are still assessing a groin injury on a fifth forward, Michael Obafemi, after the Burnley loanee limped off early in the 3-3 draw with Middlesbrough.\n\"There's one which we've had an eye on for a long time, certainly six months, who we're hopeful we can do,\" Rooney said ahead of the Boxing Day trip to Coventry City.\n\"Then there's other players we're trying to bring in which will help us.\n\"But we're not in a position to say they're close because they're not close at the minute.\n\"But we know the players we want to bring in, we've identified players and then back-up players to that, and back-up players to the back-up players.\n\"In January sometimes it takes longer. We hope we can get players in as soon as possible, if not we have to keep working.\"\nThe former England captain has to make a decision on the future of Andre Gray, currently the club's only fit senior centre forward, whose short-term deal runs out on 3 January.\n\"Of course there's discussions, there's talks with Andre and his agent,\" added Rooney.\n\"From our point of view we have to do the right thing for the football club.\n\"Andre's important for us, he's shown that when he's scored some really important goals for us.\n\"He's the one forward we've got fit, so I think that brings a little bit more importance to him.\"", "url": "https://www.bbc.com/sport/football/articles/ce8eqrq3076o"}