{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:56:59", "date_modify": "2025-05-21 06:56:59", "date_publish": "2025-01-22 16:39:42", "description": "Former Wales prop Adam Jones will join Warren Gatland's backroom staff for the 2025 Six Nations as a scrum consultant.", "filename": "sport_rugby-union_articles_cqjv7ypnnlro_1747810619.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8588/live/74370e10-d8da-11ef-a289-b3809f04eef2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cqjv7ypnnlro_1747810619.html", "title": "Six Nations 2025: Former Wales prop Adam Jones added to Warren Gatland coaching staff", "title_page": "Six Nations 2025: Former Wales prop Adam Jones added to Warren Gatland coaching staff - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Wales prop Adam Jones will join Warren Gatland's coaching staff for the 2025 Six Nations as a scrum consultant.\nJones, 43, is currently part of the Harlequins backroom staff as the scrum and transition coach and has been granted a secondment by his club.\nThis deal is for the tournament only with Jones linking up with Wales after Harlequins play Northampton in the Gallagher Premiership on Friday, 24 January.\nJones will return to the English club after the Six Nations finale against England on 15 March in Cardiff. Wales open their campaign against France in Paris on Friday, 31 January.\nJones will aid his former Ospreys coach Jonathan Humphreys, who is the current Wales forwards coach, but will also continue to help Harlequins remotely during the tournament.\nPsychology and human performance specialist Andy McCann has also been appointed to the backroom staff.\n\"First of all, I would like to thank Harlequins for the opportunity to join the Wales coaching setup for the Six Nations,\" said Jones.\n\"I'm looking forward to working with Gats [Warren Gatland] and Humphs [Jonathan Humphreys], who are two big influences on my career as a player.\n\"It's all moved quickly but I'm looking forward to it.\n\"It's going to be a challenge coming from the Gallagher Premiership and this is my first taste of coaching international rugby, so there will be learning process for me as well.\"\nAn independent review was held into Welsh rugby after a winless autumn campaign that extended Wales' losing international streak to a record 12 games.\nFollowing the findings which included anonymous feedback from current players, Welsh Rugby Union (WRU) chief executive Abi Tierney stated Gatland would keep his job for the Six Nations but his backroom staff would be bolstered.\n\"I'm delighted that Adam and Andy will be joining us for the Six Nations and I'd like to thank Harlequins for allowing Adam to take up this opportunity,\" said Gatland.\n\"With less than two weeks to our first game against France in Paris, we will be working hard as a group to maximise our preparation and start our campaign on a high.\"\nJones won 100 international caps with 95 games for Wales and five Tests for the British and Irish Lions on two tours.\nHe was awarded the first of his caps in 2003 against England and went on to win four Six Nations titles and compete in three World Cups.\nJones toured with the Lions in South Africa in 2009 and proved a cornerstone on the victorious series win in Australia four years later.\nHe starred for Neath and Ospreys, and played a season for Cardiff Blues before joining Harlequins in 2015.\nAfter combining coaching and playing duties, Jones announced his retirement in 2018 to take up a full-time coaching role at Quins, where he has helped props like Joe Marler, Kyle Sinckler and Fin Baxter.\n\"Representing your country as a player or a coach is a great honour,\" said Harlequins director of rugby Billy Millard.\n\"When we were informed of Adam's opportunity, we wanted to work collaboratively with him and the Welsh Rugby Union on a solution that catered for all.\n\"We have no doubt he'll benefit greatly from the exposure of coaching at international level and take learnings from the experience, while continuing to support Danny [Wilson] and the wider coaching staff throughout the Premiership Rugby Cup campaign.\"\nFormer Harlequins and Wales centre and current WRU board member Jamie Roberts benefitted from McCann's work in his playing days.\n'It's brilliant for the playing group to have someone of Andy's experience and wisdom to lean on during the upcoming Six Nations campaign,\" said Roberts.\n\"Having been around the camp for many years during Warren's first tenure, I know from experience that Andy's mental and motivational skillset played a pivotal role in supporting the growth, confidence, and performance of many of the household names of that generation.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/cqjv7ypnnlro"}