{"authors": ["Kal Sajad", "www.facebook.com"], "date_download": "2025-05-21 03:43:39", "date_modify": "2025-05-21 03:43:39", "date_publish": "2025-01-31 08:42:25", "description": "Adam Azim, who fights on Saturday, discusses how books, a media trainer and targeting a Pakistani audience is helping his boxing career.", "filename": "sport_boxing_articles_c6260910rzzo_1747799019.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/588e/live/583a0950-e89e-11ef-8d48-edb38b4e0413.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_boxing_articles_c6260910rzzo_1747799019.html", "title": "Adam Azim: British light-welterweight reflects on pro journey so far", "title_page": "Adam Azim: British light-welterweight reflects on pro journey so far - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "He is the flashy, backflipping, knockout sensation with the potential to become a global fighting superstar.\nBehind Adam Azim's trademark acrobatic celebration, which often follows a stoppage win, however, is a 22-year-old already hardened to the pitfalls of the boxing showbusiness.\n\"A lot of new people start coming in your life,\" the light-welterweight tells BBC Sport.\n\"People that just want to be there for who you are. Trying to squeeze in. I've had that a few times but now I have a very small circle.\"\nThe Slough-born boxer will headline Wembley Arena on Saturday against former world champion Sergey Lipinets.\nAs his star rises and inner-circle becomes smaller, a cautious Azim opts to choose his words more carefully.\n\"When I'm around my boys it's different, I'm Adam Azim, I can be myself,\" he says.\n\"But when I'm around the media, I'm not a kid and I have to be a mature person. Do these interviews wisely.\"\nUnder the tutelage of trainer Shane McGuigan, Azim stopped the experienced Ohara Davies in October.\nYet 'the Assassin' acknowledges that performances in the ring – no matter how spectacular - can only take you so far, and has made a conscious decision to sharpen his public image.\n\"I've been reading books, trying to better my English, and I've also been doing some media work to get better at doing interviews,\" he says.\nThe fondness for fiction, which began with Azim reading two Harry Potter books, is quite fitting of his endearing innocence, with ambition another of his clear attributes.\n\"My head is proper zoned in for this fight but, after that, hopefully I will take over the world,\" he adds.\nAzim is flying the flag for British-Pakistani boxers, alongside the likes of super-bantamweight Shabaz Masoud and middleweight Hamzah Sheeraz, who challenges for the world title in Saudi Arabia next month.\nAs part of his global domination plans, Azim's fight will be televised to audiences across Pakistan.\n\"It's good to target the Pakistani audience as a British-Pakistani and it's good for my profiles,\" he says.\n\"Inshallah, me and Hamzah both get the victories and open more doors.\"\nAzim hopes to make a \"massive statement\" by stopping 35-year-old Kazakh Lipinets and is \"one million percent\" sure of world-title glory in 2025.\n\"I want to keep building my bases in the ring and developing as a world class fighter,\" Azim says, mentioning IBF world champion Richardson Hitchins as a potential opponent.\nLipinets – who won the IBF light welterweight world title in 2017 before losing the belt in his next fight – is still a fringe world-level contender but a win for Azim is unlikely to put the division on notice.\nSettling the much-publicised domestic feud with the undefeated Dalton Smith, though, might be the perfect launchpad for Azim's world-title aspirations.\nThey were ordered to fight for Azim's European title last year but the champion vacated his belt instead.\nThere was renewed hope of a Smith-Azim showdown on the undercard of Conor Benn v Chris Eubank Jr on 26 April, but Azim will be fasting during the Islamic holy month of Ramadan from the end of February, which will impact his training preparations.\nIf both Azim and Smith fulfil their promise, an all-British blockbuster - maybe even for a world title - might make sense to take place a little later down the line.\nBoxing fans, however, are not so patient, and would rather find out who is the best in Britain before either man progresses to world honours.", "url": "https://www.bbc.com/sport/boxing/articles/c6260910rzzo"}