{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:07:21", "date_modify": "2025-05-21 04:07:21", "date_publish": "2025-02-01 00:00:00", "description": "Live text commentary from the National Football League as Armagh face Tyrone at the Athletic Grounds, followed by Donegal versus Dublin at Ballybofey.", "filename": "sport_live_cz6p1xldvy8t_1747800441.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_live_cz6p1xldvy8t_1747800441.html", "title": "National Football League: Donegal see off Dublin after Armagh beat Tyrone - as it happened", "title_page": "National Football League: Donegal see off Dublin after Armagh beat Tyrone - as it happened - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Final whistle\nFT: Donegal 0-20 Dublin 0-16\nThat is all from us after a good night's work for both Armagh and Donegal.\nArmagh got their first win of their Division One campaign with a dominant 1-23 to 0-19 victory against Tyrone.\nDonegal got their league campaign up and running with a 0-20 to 0-16 victory against Dublin.\nYou can read reports from both games as well as reaction on the BBC Sport website.\nWe will be back tomorrow with more football and hurling action.\nSee you then!\nArmagh 'sharper' than Tyrone in first half - O'Rourke\nFT: Armagh 1-23 Tyrone 0-19\nTyrone boss Malachy O'Rourke said that his side \"will learn an awful lot\" from their 1-23 to 0-19 defeat against All-Ireland champions Armagh at the Athletic Grounds.\nHaving beaten Derry in their opening Division One game, Tyrone struggled against the rampant Orchard County, particularly in the first half as they trailed 1-14 to 0-3 at half-time.\nThe Red Hands improved in the second half and reduced the deficit to seven, but O'Rourke admits their first half display was their undoing.\n\"They were sharper than us, they were quicker at moving the ball and we made a few mistakes,\" O'Rourke reflected.\n\"You have to take the positives, and we will learn an awful lot from that game tonight.\"\nGiven that it is still the early stages of the league campaign, O'Rourke did not feel the need to be overly critical of his team, especially given the calibre of opposition.\n\"Armagh at home, their first game back at home since they won the All-Ireland, they're always going to be up for it,\" he added.\n\"Armagh were beaten last week and people thought it was a disappointing performance. It's funny, a team that loses one weekend has a real focus to get back and win the next weekend.\n\"That is what we will be trying to do, it's just a matter of improving game to game and trying to get the performance levels better and get safe in the division. \"", "url": "https://www.bbc.com/sport/live/cz6p1xldvy8t"}