{"authors": ["Ian Woodcock", "www.facebook.com"], "date_download": "2025-05-21 05:57:21", "date_modify": "2025-05-21 05:57:21", "date_publish": "2025-04-01 17:22:24", "description": "After his latest costly mistake BBC Sport looks at whether it's time for Leeds to drop goalkeeper Illan Meslier.", "filename": "sport_football_articles_crkxd87y62ko_1747807041.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d98c/live/62d3a3e0-0f21-11f0-acc1-239a761fa7cf.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_crkxd87y62ko_1747807041.html", "title": "Illan Meslier: Is it time for Leeds United to make a change in goal?", "title_page": "Illan Meslier: Is it time for Leeds United to make a change in goal? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The boos rang out around Elland Road at full-time on Saturday as Swansea celebrated their late point at Leeds United.\nWhites goalkeeper Illan Meslier cut a disconsolate figure as he sought to collect his thoughts after another rollercoaster 90 minutes.\nThe much-criticised Frenchman had saved Josh Tymon's penalty in the first half to preserve Leeds' 1-0 advantage at the break but few in the ground were thinking of that come full-time.\nInstead it was how costly his latest error, dropping a corner under no pressure to allow Harry Darling to make it 1-1, could prove to be for their Premier League promotion hopes and whether the time has come for boss Daniel Farke to make a change in goal for the final seven league matches.\nHere is a look at the 25-year-old's season to date, what those close to the team think and who could take his place.\nMeslier initially joined Leeds on loan from Lorient in his home country in 2019, aged 19.\nSince getting his chance in February the following year he has spent the past five years as their first-choice goalkeeper.\nHe was a big part of Marcelo Bielsa's side who finished a highly creditable ninth in the Premier League in 2020-21 after making a permanent move to West Yorkshire after helping them to promotion in July 2020.\nOf Bielsa's successors only Sam Allardyce did not pick him during his brief and unsuccessful spell, as Leeds were relegated back to the Championship.\nSaturday's game against the Swans marked his 200th league appearance for the club.\nHowever, despite the penalty save, it proved to be a day to forget rather than celebrate in a season where high-profile mistakes have haunted him.\nFirst, he inexplicably misread the bounce of the ball to let in a last-minute equaliser at Sunderland in October and then in January he was at fault as Hull City came back from 3-1 down to draw 3-3.\nThat led many fans to suggest it was time for a change but, with the team well-placed, boss Farke stood by his man, saying it would be \"crazy\" to change his keeper.\nMeslier responded to that backing by keeping six successive clean sheets and, although he conceded an unfortunate own goal in the 3-1 win at promotion rivals Sheffield United in February, it looked like his mistakes would just be a footnote to a successful season.\nLeeds were five points clear at the top at the start of March, and seven ahead of Burnley in third.\nEvery Championship side that has been in that position after 34 games has gone on to win automatic promotion.\nHowever, one win from five games last month has allowed the Blades to go top and Meslier's latest faux pas has seen what patience remained seemingly run out.\nThe team at BBC Radio Leeds' Leeds United podcast Don't Go To Bed Just Yet were unanimous that it is time for Meslier to come out of the starting XI.\nKaiser Chiefs bassist and Leeds season ticket holder Simon Rix: \"It's just disappointing because, on this podcast at least, I think we all kind of want him to do well and backed him even when he's had bad moments and we feel like he's been a decent goalkeeper.\n\"You could make a highlights reel that looks amazing from Saturday's game because there's the penalty save and the save just before their first goal is a great save because he's unsighted.\n\"He looked to be having a great game and then the next thing he does is drop it on a Swansea player's foot. It's just bizarre. I can only think it is concentration.\n\"I think he's just got no credit in the bank now. He doesn't have the crowd on his side.\"\nBBC Radio Leeds' Leeds reporter Adam Pope: \"I think it's inexplicable. He was under no pressure. You can't defend it anymore.\n\"Maybe Farke sits down with (captain) Ethan Ampadu and asks him if the lads still trust Illan or if they want a change? The way it's going this could ruin Leeds' chances of automatic promotion.\"\nFormer Leeds player Aidy White on BBC Radio Leeds: \"It's one too many now. You can be forgiven for maybe one or two but the amount of games it has happened now… a huge decision has got to be made with seven games left.\n\"I think you've got to drop him now. Farke came out and supported him last time but how long can you keep trusting him for?\"\nIf Leeds are to make a change between the sticks then it is likely to be veteran Karl Darlow who is given the gloves.\nThe 34-year-old has made just two league appearances since joining from Newcastle in the summer of 2023, once as a sub after Meslier was sent off at Preston on 26 December that year and then in the 1-0 reverse at West Brom three days later when the number one was suspended.\nUnlike most number twos, Darlow has seen some action this season as he is first choice for Wales, where he plays alongside club team-mates Rodon, Ampadu and Dan James, so he would not be coming in cold if he were to be given a chance at relegation-threatened Luton on Saturday.\nHe also has experience of winning promotion from this division, having made 34 appearances as the Magpies won the Championship title in 2016-17.\nFarke refused to blame Meslier for Saturday's result and you feel that whatever decision he makes now, all eyes will be on whoever is between the posts for Leeds at Kenilworth Road this weekend.", "url": "https://www.bbc.com/sport/football/articles/crkxd87y62ko"}