{"authors": ["Phil Cartwright", "www.facebook.com"], "date_download": "2025-04-26 07:26:55", "date_modify": "2025-04-26 07:26:55", "date_publish": "2025-02-27 21:52:41", "description": "Hull KR continue their perfect start to the Super League season with a comfortable 42-0 home victory against winless Salford Red Devils.", "filename": "sport_rugby-league_articles_cd7edwexnd8o_1745652415.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2811/live/0bfb2820-f551-11ef-bf48-f1af4855b062.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-league_articles_cd7edwexnd8o_1745652415.html", "title": "Super League: Hull KR 42-0 Salford Red Devils", "title_page": "Super League: Hull KR 42-0 Salford Red Devils - Rovers score seven tries in convincing win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Hull KR continued their perfect start to the Super League season by scoring seven tries in a convincing home victory against below-par Salford Red Devils.\nRovers scored three times in the opening 13 minutes, after which their third successive Super League win - and a third consecutive loss for Salford - never looked in doubt.\nKelepi Tanginoa, Oliver Gildart and Tom Davies all touched down for last season's beaten Grand Finalists during a dominant opening spell.\nJack Broadbent went over shortly after the interval and Jai Whitbread crossed twice from close range, before Jez Litten's try rounded off the scoring.\nHowever, Hull KR's win was tinged with the disappointment of losing both full-back Niall Evalds and second-rower Rhyse Martin to early injuries.\nRovers were already without first-choice half-backs Tyrone May and reigning Man of Steel Mikey Lewis because of their respective injury problems.\nEvalds was involved for just over a minute of the match before he was caught by a high tackle by Jayden Nikorima, which resulted in a yellow card for the Salford man.\nWhile Evalds went off for a head injury assessment (HIA) which he subsequently failed, his replacement Tanginoa made an immediate impact, breaking through a couple of Salford tackles to score almost straight after his introduction.\nGildart and Davies then made the most of overlaps out wide to make it 16-0.\nIndiscipline did not help Salford's cause, with Danny Richardson - who took on goal-kicking duties after Martin was forced off with a knock - slotting through two penalties to extend the hosts' advantage to 20 points by half-time.\nBroadbent marked his 100th career appearance with a second-half try, the centre darting through a gap to run in from 25 metres, before Whitbread's double and a seventh Hull KR try from Litten completed the scoring.\nSalford, who had Chris Hill sin-binned late on for holding down a tackled player, endured a frustrating night and were well below their best.\nThey remain at the bottom of the table, their start to the campaign having been heavily disrupted by off-field matters, with a takeover deal being approved earlier this month.\nHull KR head coach Willie Peters told BBC Radio Humberside:\n\"I'm really happy with our performance. I was chasing that 'zero', that's what we want to do. To be able to do it against Salford, who do ask a lot of questions, is great for the players.\n\"They worked hard because we had a lot of adversity, losing Niall and Rhyse early in the game. At half-time, there was a possibility of Joe Burgess coming off but he toughed it out for the next 40 minutes, and Elliot [Minchella] came off with hamstring tightness.\n\"Our middles had to play massive minutes and were exceptional, Jez Litten came on and was outstanding and our halves did a great job. I'm really happy across the board.\"\nSalford head coach Paul Rowley told BBC Radio Manchester:\n\"It was probably one of the worst performances I've been involved with at this club. Everybody was looking for answers on the field but the first place everybody needs to look is at themselves and that includes me.\n\"We were fragile on both sides of the ball, but everything starts with defence and I thought our defence was as pathetic as it could get really. We've got to stick together and work this one out.\n\"It [the previous uncertainty surrounding the takeover] is a real thing, I can't dismiss it like it's not been there for four months. However, you can play the victim for a full season if you want but it's not going to do anybody any good. We're paid to play and coach rugby.\n\"We've got to kick that one off our back quickly and move on. It's a challenge, it's one we've got to face together but find the answers as quickly as possible.\"", "url": "https://www.bbc.co.uk/sport/rugby-league/articles/cd7edwexnd8o"}