{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:39:34", "date_modify": "2025-05-21 04:39:34", "date_publish": "2025-04-04 15:28:49", "description": "Marco Silva press conference: Fulham vs Liverpool", "filename": "sport_football_articles_czx1506lr6wo_1747802374.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9b67/live/608060b0-6de1-11ef-b970-9f202720b57a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_czx1506lr6wo_1747802374.html", "title": "Marco Silva press conference: Fulham vs Liverpool", "title_page": "Marco Silva press conference: Fulham vs Liverpool - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Kenny Tete is in contention to feature on Sunday for the first time since December with Silva confirming it is only \"a matter of time\" until he is in the matchday squad: \"It could be Liverpool, it could be other games - it will be my decision. Soon, we are going to see him involved in the squad list.\"\nForward Harry Wilson will also be back with the team \"soon\" after doing individual work on the grass: \"That's great news in terms of the wide attacking areas of the pitch, where you miss a player of his characteristics, who can help the team.\"\nOn bouncing back after defeat at Arsenal on Tuesday: \"We share the good moments and the good vibes together. When you don't achieve something important, like a football match we want to win, then you have to share the disappointment. But at the same time, we have to work quicker and prepare quicker for the next one - like we have done since the start of the season.\"\nOn how opponents Liverpool have adapted this season without Jurgen Klopp: \"It wasn't just any manager that left them - it was a manager who was there 10 years with a massive, massive impact on almost everything that was built in the football club. Jurgen was a very, very important piece and when the club went in a different direction, the impact of the manager is always going to be important. Slot has made that impact.\"\nHe added: \"They have been really consistent in the Premier League. You don't see them have too many down moments, and when they do, they are always able to react. It's not a coincidence that they have spent most of the time on top of the table. We can all agree, that if nothing very special happens, then they are going to have a celebration at the end of the season.\"\nOn what he expects from the match: \"It's going to be a game that demands us to be close to perfection. From our side, we need to fight really hard for the three points. We are in our own battle too. They want the three points to be closer to the title - we want our three points for our own battle.\"", "url": "https://www.bbc.com/sport/football/articles/czx1506lr6wo"}