{"authors": ["Nizaar Kinsella", "www.facebook.com"], "date_download": "2025-05-21 03:40:26", "date_modify": "2025-05-21 03:40:26", "date_publish": "2025-01-15 12:14:10", "description": "The defender returns to Stamford Bridge after four and a half months at Selhurst Park.", "filename": "sport_football_articles_crm7njpm9pzo_1747798826.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/13f4/live/2cc613b0-d339-11ef-b1bb-f56965424f3f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_crm7njpm9pzo_1747798826.html", "title": "Chelsea recall Trevoh Chalobah from Crystal Palace loan", "title_page": "Chelsea recall Trevoh Chalobah from Crystal Palace loan - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The move may be considered controversial given Palace had to withdraw Chalobah at short notice from their 1-0 FA Cup win over Stockport County on Sunday.\nPalace manager Oliver Glasner initially described the situation as a \"contractual issue\" before further explaining on Tuesday: \"He wants to stay here but it's a decision Chelsea can take.\"\nChalobah was a regular starter at Selhurst Park, making 14 appearances over his four-and-a-half-month spell in south London.\nThe central defender was previously considered surplus to requirements at Chelsea and trained away from the first team in a group nicknamed 'the bomb squad', a group of a dozen players unwanted by Chelsea, which included England internationals Raheem Sterling and Ben Chilwell.\nBut Chalobah has been reassured that he will play at Chelsea upon his return after having a conversation with sporting director Paul Winstanley before the option was exercised.\nChelsea believe he will re-acclimatise to west London more quickly than any new signing would given his connection to the club.\nHowever, Chalobah's long-term future beyond the summer remains in doubt as Chelsea have made him available for about £25m in the past three transfer windows and are likely to allow him to leave permanently in the summer.\nJosh Acheampong, 18, continues to be considered a first-team player after his recent breakthrough into the senior squad.", "url": "https://www.bbc.com/sport/football/articles/crm7njpm9pzo"}