{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:16:09", "date_modify": "2025-05-21 04:16:09", "date_publish": "2025-04-05 18:33:51", "description": "Gloucester beat Montpellier to set up a European Challenge Cup quarter-final against Premiership rivals Bath.", "filename": "sport_rugby-union_articles_cx257wqvg25o_1747800969.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7fff/live/26df5b10-1249-11f0-9d46-3377f28968f3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cx257wqvg25o_1747800969.html", "title": "European Challenge Cup: Montpellier 17-24 Gloucester: Visitors set up quarter-final with Bath", "title_page": "European Challenge Cup: Montpellier 17-24 Gloucester: Visitors set up quarter-final with Bath - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Gloucester beat Montpellier to set up a European Challenge Cup quarter-final against Premiership rivals Bath.\nThe Cherry and Whites recovered from a nightmare start where they conceded two tries in the opening nine minutes, to shut out the hosts in the second half in France.\nTries from Anthony Bouthier and Hugo Reus were cancelled out by scores from Freddie Thomas and Cameron Jordan, before Reus's penalty gave Montpellier a three-point lead at the break.\nGloucester went ahead for the first time in the match despite being a player down, with scrum-half Caolan Englefield in the sin-bin, as Ruan Ackermann's converted score gave the visitors a four-point lead.\nArgentina international Santiago Carreras completed a perfect day of kicking with a penalty on 80 minutes to seal the victory and send Gloucester into the quarter-finals.\nThe hosts took the lead inside six minutes as full-back Bouthier ran into the corner following a break forward from France international flanker Lenni Nouchi, with Reus converting.\nMontpellier doubled their lead three minutes later as they took advantage of a missed tackle, with Nouchi off-loading to fly-half Reus to dot down between the posts and convert his own try.\nGloucester responded well to going behind and began to take the game to their opponents.\nSkipper Lewis Ludlow thought he had hit back when he drove over after a strong maul from the visitors but saw his effort disallowed for obstruction.\nBut the Cherry and Whites were rewarded for their pressure soon after when Thomas powered over, with Carreras kicking the extras.\nJordan then finished a great carry by shaking off two challenges to power over the line and level the score.\nThe Premiership side rode a wave of pressure at the end of the half, with Reus kicking a penalty between the posts to regain the lead with the final act of the first half.\nEnglefield was shown a yellow card early in the second half for what was adjudged to be a deliberate knock-on, yet it was his side who pushed on despite the player disadvantage, before number eight Ackermann got on the scoresheet.\nChristian Wade knocked on Englefield's pass a metre out from the line as Gloucester spurred a golden opportunity to open up the lead with less than 10 minutes remaining on the clock.\nBut the Cherry and Whites continued to push deep into the game and sealed the victory, as Carreras made it four from four from the tee with the match-ending penalty.\nGloucester will visit the Recreation Ground and take on Premiership leaders Bath in the next round next weekend for a place in the final four.", "url": "https://www.bbc.com/sport/rugby-union/articles/cx257wqvg25o"}