{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:24:46", "date_modify": "2025-04-26 06:24:46", "date_publish": "2025-02-28 22:41:20", "description": "Glentoran manager Declan Devine laments his side's \"totally unacceptable performance\" in their shock 3-1 Irish Cup quarter-final defeat by Bangor.", "filename": "sport_articles_ce30qn04v7ko_1745648686.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e9ef/live/f2e08270-f624-11ef-bf3c-6bef5f502c94.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_ce30qn04v7ko_1745648686.html", "title": "Devine laments 'totally unacceptable performance'", "title_page": "Irish Cup: Glens boss Devine laments 'totally unacceptable performance'  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Glentoran manager Declan Devine lamented his side's \"totally unacceptable performance\" in their 3-1 Irish Cup quarter-final defeat by Bangor at Clandeboye Park.\nFirst-half goals from Ben Arthurs, Ben Cushnie and Lewis Harrison had the Championship leaders 3-0 ahead at the break and Charlie Lindsay's 70th-minute deflected strike proved to be a mere consolation.\n\"We warned the team that was possible here tonight. They obviously didn't take on board what I had to say and we apologise to the people who got behind us tonight,\" said an angry Glens boss after the game.\n\"Everything was missing in the first half - pride, passion, energy, quality on the ball, an ability to defend long balls.\n\"We warned them all week this was the potential of a good Bangor side and it's a really tough one to take. As a group we have to take a long hard look at ourselves.\"\nDevine went on to criticise the lack of \"fight\" shown by his players.\n\"We lost the fight, we didn't show enough fight, enough hunger and desire to represent the club tonight. That's the thing that has really riled me.\n\"The goals we gave away were really poor, horrendous goals. We panicked, we showed a real anxiety and nervousness about our defensive duties.\n\"We have nowhere near arrived yet, we have a lot of work to do and tonight proved that.\"", "url": "https://www.bbc.co.uk/sport/articles/ce30qn04v7ko"}