{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:50:22", "date_modify": "2025-05-21 03:50:22", "date_publish": "2025-04-07 11:17:36", "description": "Sheffield Wednesday confirm that the club's players and staff have now received their wages for March.", "filename": "sport_football_articles_cy48vnd0240o_1747799422.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3aaa/live/2d47f130-13a0-11f0-8c3e-ab5924cb0c94.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy48vnd0240o_1747799422.html", "title": "Sheffield Wednesday players and staff paid delayed March wages", "title_page": "Sheffield Wednesday players and staff paid delayed March wages - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Sheffield Wednesday have confirmed that the club's players and staff have now received their wages for March.\nSalaries were supposed to be paid last week, with the club saying it was a \"temporary issue\" due to debts owed to owner Dejphon Chansiri, whose family control the Thai Union Group, the world's largest producer of canned tuna.\nChansiri bought the Championship side from Milan Mandaric in 2015 but this was the latest in a long line of off-field issues in recent years.\nThe Owls have been placed under a registration embargo in each of the past two seasons amid financial problems.\nIn a two-line statement on their website,, external Wednesday said that \"salaries have been satisfied for the month of March\" and thanked everyone for their \"patience and understanding\".\nDanny Rohl's side are 13th in the Championship, eight points off the play-off places with six games of the season to go.\nRohl has been linked with a move to relegated Premier League side Southampton, who parted company with their head coach Ivan Juric on Monday.\nThe Owls visit fellow mid-table side Blackburn on Tuesday looking to end a run of three games without a win.", "url": "https://www.bbc.com/sport/football/articles/cy48vnd0240o"}