{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:39:11", "date_modify": "2025-05-20 13:39:11", "date_publish": "2023-08-01 14:55:46", "description": "Brighton: Lewis Dunk urges Moises Caicedo to stay amid Chelsea interest", "filename": "sport_articles_cpryw25ldv9o_1747748351.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2c9e/live/5c0ec800-307a-11ee-908b-dd239d20e2af.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cpryw25ldv9o_1747748351.html", "title": "Brighton: Lewis Dunk urges Moises Caicedo to stay amid Chelsea interest", "title_page": "Brighton: Lewis Dunk urges Moises Caicedo to stay amid Chelsea interest - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "George Cummins, BBC Sport\nBrighton captain Lewis Dunk has urged Moises Caicedo to stay for one more season at Amex Stadium.\nThe Ecuador midfielder has been linked with a move to Chelsea, but the Seagulls are standing firm on the fee they want for the 21-year-old.\nAlbion centre-back Dunk said: \"He is a young man, learning the game and it's a difficult situation to be in.\n\"As his captain, I couldn’t ask any more of him this pre-season. He has stuck in there, kept his head right, trained hard and played the game.\n\"I want him to stay. It's a massive advantage having him in the team. Having him in front of me makes my life so much easier.\n\"Hopefully he can stick around and we can hold on to him for another year. He will make us stronger. We are a stronger team with him in it. I hope he stays, but who knows what can happen?\"\nDunk added that Caicedo has handled the noise of being wanted by other clubs well.\nHe said: \"Of course it affects you, but it's the way you deal with it - and he has dealt with it in the right way.\n\"At the end of the day, it's up to two clubs to come to some sort of agreement to make a move. It can be a season here or a season there, but as a team we want to keep him on our side.\"", "url": "https://www.bbc.com/sport/articles/cpryw25ldv9o"}