{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:28:30", "date_modify": "2025-05-21 05:28:30", "date_publish": "2025-04-03 10:22:50", "description": "Glamorgan will give competitive debuts to England spinner Shoaib Bashir and Sri Lanka paceman Asitha Fernando in their opening Championship game against Leicestershire in Cardiff.", "filename": "sport_cricket_articles_cp8j7prz3n7o_1747805310.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ed2b/live/f68acb60-1073-11f0-ac9f-c37d6fd89579.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cp8j7prz3n7o_1747805310.html", "title": "County Championship: Shoaib Bashir and Asitha Fernando make Glamorgan debuts v Leicestershire", "title_page": "County Championship: Shoaib Bashir and Asitha Fernando make Glamorgan debuts v Leicestershire - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "County Championship Division Two: Glamorgan v Leicestershire\nVenue: Sophia Gardens, Cardiff Date: Thursday, 4 to Monday, 7 April TIme: 11:00 BST\nCoverage: Live commentary via BBC Sounds, BBC Sport website and app. Updates on BBC Radio Wales and BBC Radio Leicester.\nGlamorgan will give competitive debuts to England spinner Shoaib Bashir and Sri Lanka paceman Asitha Fernando in their opening Championship game against Leicestershire in Cardiff.\nBashir, 21, has joined on loan from Somerset for three matches as injury cover for Mason Crane.\nHe has played 15 Test matches but only 12 other first-class games.\nFernando, who has made 49 appearances across all formats for Sri Lanka, is with Glamorgan for at least two months.\nThey are the only two newcomers in the 13-man squad named by new coach Richard Dawson, although fast bowler Ned Leonard has now officially joined from Somerset after playing on loan in September 2024.\nLeicestershire are led by Australian Peter Handscomb, who takes over the four-day captaincy from Lewis Hill.", "url": "https://www.bbc.com/sport/cricket/articles/cp8j7prz3n7o"}