{"authors": ["Frank Keogh", "www.facebook.com"], "date_download": "2025-04-26 07:25:43", "date_modify": "2025-04-26 07:25:43", "date_publish": "2025-02-27 23:13:55", "description": "World number one Luke Humphries defeats world champion Luke Littler 6-4 to win night four of the Premier League in Exeter.", "filename": "sport_darts_articles_cqlyye7xyzpo_1745652343.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/fd82/live/58c7b2d0-f561-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_darts_articles_cqlyye7xyzpo_1745652343.html", "title": "Premier League Darts results: Luke Humphries beats Luke Littler for Exeter night win", "title_page": "Premier League Darts results: Luke Humphries beats Luke Littler for Exeter night win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "World number one Luke Humphries sealed his first Premier League win over Luke Littler with a 6-4 victory in the final on night four in Exeter to take control at the top of the table.\nHumphries, 30, came from 3-1 down to beat the 18-year-old, who had been in outstanding form in his earlier two matches despite suffering from a cold.\nIt was a second night win for league leader Humphries, who won the opener in Belfast before losing the Glasgow final to the teenager.\nLittler was runner-up to Humphries in the 2024 world final but beat him to win last year's Premier League.\nAnd this was Humphries' first win in seven Premier League matches against his fellow Englishman.\n\"Luke played fantastic tonight, he didn't play as great in the final but I managed to step on the gas, like I did in the other two games, right at the end of the game,\" said Humphries.\n\"Being sat on 15 points after four weeks, that's a dream start for me and hopefully I can keep pushing and keep reeling in the points to guarantee a spot in the top four, because that's all that really matters.\"\nHumphries hit two stunning checkouts - a 167 followed by a 116 - to snatch a 6-5 victory against Rob Cross in the semi-finals.\nLittler saw off Nathan Aspinall 6-2 with a 109 average, having topped 112 in his opening defeat of Stephen Bunting.\nThe teenager hit 10 maximums - a record in this best-of-11-leg Premier League format - in the 6-3 win over Bunting, who hit six 180s of his own.", "url": "https://www.bbc.co.uk/sport/darts/articles/cqlyye7xyzpo"}