{"authors": ["Paul McNicoll", "www.facebook.com"], "date_download": "2025-04-26 04:12:00", "date_modify": "2025-04-26 04:12:00", "date_publish": "2025-03-04 12:40:32", "description": "Dundee Utd fan voice: United 'need to be braver' if they want third place", "filename": "sport_articles_crew9gnwxqyo_1745640720.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c3cf/live/8fe91de0-f87b-11ef-896e-d7e7fb1719a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_crew9gnwxqyo_1745640720.html", "title": "United 'need to be braver' if they want third place", "title_page": "Dundee Utd fan voice: United 'need to be braver' if they want third place - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "After last Wednesday's chaos at Tannadice, United headed up the A90 to face an Aberdeen side as unpredictable as a Scottish summer.\nOne minute they're flying high, the next they've crash landed, and now they're desperately trying to take off again, all in the space of 29 games. They've got good players, but they're not always a good team. Still, this was never going to be easy.\nUnited were missing a few key men, but the first-half gameplan was executed to perfection: defend well, counter dangerously, and make the most of set-pieces. By half-time, things were looking rosy.\nThe second half? Not so much. I've no idea what was said in the dressing room, but what I saw was United setting up camp in their own box, playing what can only be described as a flat back nine.\nPredictably, Kevin Nisbet, who never misses a chance to score against United, pulled one back with 15 minutes to go. The equaliser arrived in the 91st minute, again from Nisbet, and truth be told it had been coming.\nA point at Pittodrie is usually a decent result, but when you're 2-0 up with 16 minutes left, it stings.\nMaybe the players sat too deep on their own, maybe it was the manager's plan, or maybe I'm not giving Aberdeen enough credit. Either way, United now head into a two-week break likely feeling a little flat.\nWith the Scottish Cup taking centre stage this weekend, our attention shifts to the small matter of yet another sold-out Dundee derby the following Sunday.\nIf United want third place, they'll need to be braver, a little better and far less cautious in this one, because there's a lot more than just bragging rights at stake.", "url": "https://www.bbc.co.uk/sport/articles/crew9gnwxqyo"}