{"authors": ["Neil Johnston", "www.facebook.com"], "date_download": "2025-05-20 12:26:52", "date_modify": "2025-05-20 12:26:52", "date_publish": "2023-07-25 06:23:26", "description": "Former winners Norway face an early exit from the Women's World Cup after a draw with Switzerland leaves them bottom of Group A.", "filename": "sport_football_66290034_1747744012.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/D6D9/production/_130510055_9f67a6f000c4b69570728625e177995f1cfc4e9f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66290034_1747744012.html", "title": "Switzerland 0-0 Norway: Former winners Norway in danger of early exit", "title_page": "Switzerland 0-0 Norway: Former winners Norway in danger of early exit - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former winners Norway are fighting to stay in the Women's World Cup after a draw against Switzerland left them bottom of Group A with one game to go.\nAfter being on the receiving end of a shock defeat by co-hosts New Zealand on the opening day, Hege Riise's side needed to respond but failed to score for the second straight game.\nThey lost star player Ada Hegerberg, who was named on the team sheet, moments before kick-off, the six-time Champions League winner walking down the tunnel amid reports she suffered a groin injury in the warm-up in Hamilton.\nThis was after Caroline Graham Hansen, another huge talent, did not make the starting line-up.\nNorway had their chances, with captain Maren Mjelde blazing over from close range before a header by Sophie Haug - Hegerberg's replacement - was clawed away by Switzerland keeper Gaelle Thalmann.\nSwitzerland, 2-0 winners over the Philippines in their first match, had chances of their own on a wet surface.\nAna-Maria Crnogorcevic fired narrowly over after creating space, while Nadine Riesen's awkward cross was just about kept out by keeper Aurora Mikalsen.\nAt the other end, Haug forced another fine save from Thalmann in the second half before substitute Graham Hansen had an attempt turned behind on a hugely frustrating night for Norway who could not make the breakthrough.\nNorway must defeat the Philippines in their final group game in Auckland on Sunday (08:00 BST) to stand any chance of going through.\nAt the same time Switzerland, who top the group with four points, play New Zealand in Dunedin.\nNorway came into this tournament tipped as one of the dark horses to go deep, yet the two-time European champions find themselves in danger of making an early exit.\nRiise's side breezed through qualifying, winning nine of their 10 matches, but, as happened at Euro 2022, they have struggled when it really matters.\nWhile they were disjointed and uninspiring against New Zealand at Eden Park, they at least posed more of an attacking threat against Switzerland as they carved out 12 chances without getting the all-important goal.\nThere were surprised looks from many Norway fans at the Waikato Stadium when Hegerberg walked down the tunnel moments before the game was due to start.\nThe Lyon forward and prolific scorer had taken part in the warm-up and emerged on to the pitch ready for the game.", "url": "https://www.bbc.com/sport/football/66290034"}