{"authors": ["Ronny Costello", "www.facebook.com"], "date_download": "2025-05-21 07:15:54", "date_modify": "2025-05-21 07:15:54", "date_publish": "2025-05-20 10:39:52", "description": "Dundee Utd fan voice: 'Fourth place, flying seats & farewell tears – a wild end to season'", "filename": "sport_articles_c201zve8m28o_1747811754.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2274/live/750689c0-34f5-11f0-8947-7d6241f9fce9.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c201zve8m28o_1747811754.html", "title": "'Fourth place, flying seats & farewell tears - a wild end to season'", "title_page": "Dundee Utd fan voice: 'Fourth place, flying seats & farewell tears – a wild end to season' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Saturday was up there. It had everything.\nUnited sealed fourth place and European football in our first season back in the big league, after starting the day in fifth and slipping to sixth at one point.\nGoals from Declan Gallagher and Sam Dalby completed a 2-1 comeback win over Aberdeen, leapfrogging them as they finished fifth - this alone should've been the headline.\nBut it wasn't. Because once again, a mindless idiot overshadowed everything.\nThe image of Jack MacKenzie with blood pouring from his face after being struck by a flying seat launched from the away end was sickening. That's not just bad behaviour - it's criminal.\nAnd while it's one person responsible, the impact is felt by everyone - MacKenzie, the fans, and the game itself.\nThis has to be a turning point as this time a player was genuinely hurt. Lifetime bans, legal consequences, stronger deterrents - nothing should be off the table.\nAnd as if that wasn't enough drama, the full-time whistle went and the fans poured on to the pitch. Emotions do this to you. Football does this to you.\nBut the consequences hit hard as our players, heroes to some, many pulling on that magnificent tangerine shirt for the final time, never got their deserved send-off. No lap of honour, no farewell wave. That stings.\nEspecially when you look at the names: Gallagher (immense again), Louis Moult, David Babunski, even Dalby – we don't know who'll be here next season. But they gave us pride back. They represented the shirt, fought for the club and were part of a brilliant season. They deserved that applause.\nAnd what about Jim Goodwin? Gorgeous Jim as we call him on the podcast. Two years ago he was a punchline. Now he's built a team that's hardworking, united (pun intended), and effective.\nFrom promotion to a top-four finish and for the first time in his career as a player or manager, European football. That's redemption.\nWe don't yet know if it'll be Europa League or Conference League as it all depends on the Scottish Cup final. But regardless, United are back in Europe.\nShame it ended with stitches and sirens instead of cheers and salutes but make no mistake – this club is on the rise again.", "url": "https://www.bbc.com/sport/articles/c201zve8m28o"}