{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:02:22", "date_modify": "2025-05-20 12:02:22", "date_publish": "2023-08-05 13:44:02", "description": "Great Britain maintain their fine start to the Cycling World Championships by winning five gold medals, two silvers and a bronze on day three.", "filename": "sport_cycling_66417081_1747742542.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/CC34/production/_130667225_screenshot2023-08-05215126.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cycling_66417081_1747742542.html", "title": "Cycling World Championships 2023: GB win five golds on day three including women's team pursuit", "title_page": "Cycling World Championships 2023: GB win five golds on day three including women's team pursuit - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Great Britain claimed an impressive haul of five gold medals, two silvers and a bronze on day three of the Cycling World Championships.\nKatie Archibald, Anna Morris, Josie Knight and Elinor Barker rode superbly in the final race of the evening to win a first British gold in the women's team pursuit since 2014.\nCharlie Hatton was the first British rider to take gold on Saturday in the men's mountain bike downhill.\nBritain's medal tally now stands at 22.\nAside from those successes, Sam Ruddock and Blaine Hunt also successfully defended their men's C1 and C5 1km para time-trial titles in Glasgow.\nAnd Jaco van Gass won gold in the men's C3 scratch race, finishing just ahead of compatriot Fin Graham for the second consecutive day.\nEarlier in the day Cat Ferguson took silver in the women's junior road race, while Laurie Greenland claimed a bronze behind Hatton.\nIn the women's team pursuit Britain were overwhelming favourites to win a first world title for nine years after taking the silver at Saint-Quentin-en-Yvelines near Paris in October and also finishing second at the Tokyo Olympics.\nAnd Archibald, who spoke poignantly about her grief following the death of her partner and fellow cyclist Rab Wardell in the build up to these championships, was given a rousing reception as the riders were announced.\nOnce on the track, the British quartet did not disappoint despite initially having to make up a slender deficit on a well organised New Zealand team.\nHowever, as the British team got stronger New Zealand eventually faltered when Michaela Drummond dropped away from the middle of their train, with the disruption helping the hosts eventually win by more than four seconds.\n\"You don't really [stay focused with that reception], it is all coming out now with this event,\" Archibald told BBC Sport.\n\"Someone was talking about imposter syndrome the other day and you almost have it the other way round, we almost see ourselves as the best in the world but we have not been on the top step since 2014.\n\"So to have that feeling validated feels good.\"\nRuddock gave Britain the perfect start to the evening despite having to watch on anxiously as Li Zhangyu rode last in the men's C1.\nBut he was soon able to punch the floor in delight when the world record holder was only able to post the third best time, with Li's compatriot Liang Weicong securing the silver medal.\nMeanwhile, Hunt was more than a second faster than American Christopher Murphy and Belgian Niels Verschaeren.", "url": "https://www.bbc.com/sport/cycling/66417081"}