{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:10:59", "date_modify": "2025-05-19 15:10:59", "date_publish": "2015-02-16 18:41:35", "description": "Rangers respond to a second London hotel refusing to host their general meeting by deciding to stage it at Ibrox.", "filename": "sport_football_31495586_1747667459.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81045000/jpg/_81045039_ibrox2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31495586_1747667459.html", "title": "Rangers will host EGM at Ibrox after two London hotels pull out", "title_page": "Rangers will host EGM at Ibrox after two London hotels pull out - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Rangers have responded to a second London hotel refusing to host their extraordinary general meeting (EGM) by deciding to stage it at Ibrox Stadium.\nEarlier, the Grange Tower Bridge Hotel decided against hosting the EGM, citing concerns for the \"comfort and security\" of guests and staff.\nRangers said in a statement on Wednesday morning that the hotel pulled out because of \"threats from persons unknown\".\nThe Ibrox date has yet to be confirmed.\nThe Scottish Championship club had been forced to find another venue for 4 March after the Millennium Gloucester Hotel in Kensington pulled out.\nRangers' statement continued: \"It is with regret that the board must announce that, following threats from persons unknown, the Grange Hotel at Tower Hill in London has informed the company that it is no longer willing to host the general meeting on 4 March 2015.\n\"Accordingly, the new venue for this general meeting will be Ibrox Stadium, in Glasgow, at a date to be determined.\n\"The original London venue was selected for the general meeting because the board felt that previous general meetings held at Ibrox had been disrupted by chanting and other shouting and accordingly had sought a business venue where a meeting could be held with more decorum.\"\nOn Tuesday morning, the club announced that the meeting had been switched to the new venue near the City of London, but Grange Hotels changed its mind later in the day.\nA spokesman for the hotel group said: \"There is no question when it comes to the comfort and security of our guests and staff.\n\"We do not compromise on this and therefore the Grange Tower Bridge Hotel has declined the opportunity to host the proposed Rangers FC EGM.\"\nThe EGM was called by shareholder Dave King, who hopes to oust the board.\nThe club suggested that \"complaints and false information\" led Millennium Gloucester management to fear \"disruption to guests and neighbours\" and said the directors \"continue to recommend that shareholders vote against the requisitioned resolutions\".", "url": "https://www.bbc.com/sport/football/31495586"}