{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:59:52", "date_modify": "2025-04-26 06:59:52", "date_publish": "2025-03-02 00:00:00", "description": "Chloe Kelly scores her first Arsenal goal as they produce a stunning fightback to edge West Ham in a seven-goal thriller in the Women's Super League.", "filename": "sport_football_live_c5y92p4gqlpt_1745650792.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2803/live/8d897750-f79c-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_c5y92p4gqlpt_1745650792.html", "title": "Arsenal 4-3 West Ham United: Chloe Kelly scores first Gunners goal since return in thriller", "title_page": "Arsenal 4-3 West Ham United: Chloe Kelly scores first Gunners goal since return in thriller - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Chloe Kelly helped Arsenal come from behind to edge victory in a seven-goal thriller at home to West Ham as they continued their push for a European qualification spot.\nAmber Tysiak scored twice – both goals coming from corners – by the time the clock had struck 12 minutes to give the Irons an unlikely early lead.\nThe first was a header, before she bundled home as the hosts failed to clear a goalmouth scramble.\nWest Ham continued to frustrate Arsenal, but new signing Kelly sparked the Gunners a minute before the break when she turned home a Mariona Caldentey delivery to get her first goal for the club in her second spell.\nShekiera Martinez seemed to have dashed Arsenal's hopes when she collected a Verena Hanshaw pass and fired past Daphne van Domselaar to make it 3-1 in the 51st minute.\nBut Arsenal responded superbly with two goals in as many minutes.\nKatie McCabe powered an expert finish past Kinga Szemik from a tight angle in the 56th minute and Leah Williamson nodded home from a corner to level.\nSpain forward Caldentey then found the bottom corner from a 62nd-minute penalty after Hammers defender Kirsty Smith handled in her own box.\nArsenal boss Renee Slegers said her side's comeback showed \"great strength and character\".\nShe told Sky Sports: \"I am very proud of the way that the girls kept calm and composed, found the solutions and kept digging in. That is why we are stood here with a win.\"\nArsenal pushed for further goals in an attempt to solidify their lead, and although none materialised they managed to prevent the visitors finding a way back.\n\"We scored three fantastic goals and caused a lot of problems. There are a lot of positives for us to take out of the game,\" added West Ham manager Rehanne Skinner.\n\"We were not prepared to let anything go, fighting for everything and got goals out of the game.\"\nThe result leaves Slegers' third-placed side with a two-point cushion over Manchester City, but eight points off leaders Chelsea. West Ham are ninth with 14 points - eight clear of bottom club Crystal Palace.\nFew would have expected an Arsenal side that thrashed Tottenham 5-0 in a their previous WSL game to be 2-0 down after just 12 minutes.\nBut two poorly-defended corners handed West Ham the lead and lit a spark which gave the Irons a clear sense of belief.\nMartinez tormented Williamson with her running up front, while Tysiak, Hanshaw and Camila Saez tracked all of Arsenal's long balls to perfection and closed down any attempts to break forward.\nWhen the Gunners did manage to find a way through, keeper Szemik was attentive and produced some excellent stops to keep her side's lead intact.\nKelly pulled one back and Arsenal emerged from half-time with a point to prove. Substitute Stina Blackstenius had a goal disallowed for offside before Martinez gave the visitors a two-goal advantage once again.\nWhat followed was a Gunners masterclass in determination and a newfound verve sparked by the desperation to avoid defeat.\nSlegers said Arsenal were in a situation where they had \"not been put in before\" since she took charge, but the way they claimed the success teaches them how to deal with \"hard times\".\n\"When we had positive momentum we were able to capitalise on it in the second half,\" she added.\nThree goals in six minutes delivered exactly what they required, leaving West Ham with no chance to recover between the repeated blows.\nGoing ahead changed the momentum entirely for Slegers' side. Where they were previously laboured in attack, they were now fluid with energy and threat.\nLosing will feel cruel for a West Ham side that battled valiantly, but Arsenal were just too strong when they eventually clicked and Kelly's strike will give the Manchester City loanee extra confidence after her return to the club where she started her career.", "url": "https://www.bbc.co.uk/sport/football/live/c5y92p4gqlpt"}