{"authors": ["Emma Smith", "www.facebook.com"], "date_download": "2025-05-20 12:08:39", "date_modify": "2025-05-20 12:08:39", "date_publish": "2023-08-05 10:44:41", "description": "Sweden progress to the quarter-finals of the Women's World Cup thanks to a penalty shootout win over the USA.", "filename": "sport_football_66414350_1747742919.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/97FB/production/_130670983_gettyimages-1596210836.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66414350_1747742919.html", "title": "Sweden 0-0 USA (pens: 5-4): World Cup holders knocked out on penalties", "title_page": "Sweden 0-0 USA (pens: 5-4): World Cup holders knocked out on penalties - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Reigning champions the USA are out of the Women's World Cup after being stunned by Sweden on penalties on a night of incredible drama in Melbourne.\nUSA dominated the 120 minutes but were denied by an inspired goalkeeping performance from Zecira Musovic as the match finished goalless.\nThe drama only ratcheted up further in the shootout. Three USA players missed, including their footballing icon Megan Rapinoe on her last appearance on the world stage, before Sweden won in remarkable circumstances.\nUSA keeper Alyssa Naeher appeared to have saved Lina Hurtig's effort at the second attempt, having pushed the initial effort up before clawing it out.\nBut after checking with the video assistant referee (VAR), referee Stephanie Frappart awarded the goal and sparked wild Sweden celebrations.\nUSA manager Vlatko Andonovski was not convinced the ball had crossed the line, despite technology confirming the goal.\n\"It's a tough moment,\" he said. \"It's a moment where it's hard to go through, where you hope it didn't cross the line. I see pictures and I still can't see it now, but proves how cruel this game can be.\"\nSweden go through to face Japan in the quarter-finals.\nThey were indebted to Musovic, who made 11 saves in a game where the USA looked more like the team which won the World Cup in 2015 and 2019 than the one which snuck through the group stage.\nBut they could not score and in the shootout Rapinoe, Sophia Smith and Kelley O'Hara all missed, Rapinoe with what is her final action at a World Cup as she has announced she will retire at the end of the year.\nIt condemns the USA to their worst performance at the tournament. They had never previously failed to make it to the semi-finals.\nUSA had not turned up to the World Cup party before Sunday. Flat and uninspired as they finished second in Group E while failing to win two first-stage matches for the first time in this competition, they have been subject to fierce criticism back home.\nManager Vlatko Andonovski had to make changes - especially as key midfielder Rose Lavelle was suspended for this game - and switched from 4-3-3 to 4-2-3-1 with two holding midfielders.\nIt worked a treat in the first half as they dominated play and were only denied the lead by Musovic and the crossbar.\nTrinity Rodman twice stung the gloves of Musovic before Lindsey Horan came even closer by rattling the woodwork with a header from a corner.\nUSA looked like a proud side stung into action by external criticism and internal knowledge that they have not been good enough so far. A ball recovery time of just six seconds in the first half was evidence of that.\nThey continued to make chances after the break, Horan and Alex Morgan denied by superb Musovic saves and Emily Sonnett shooting over from the edge of the area.\nBut they needed a goal to make their dominance count and, as they toiled for it, the crowd which had followed them to Melbourne were becoming more nervous as the game rolled on into extra time.\nThey continued to be denied by Musovic in the extra period as she saved from Morgan, Lynn Williams and Sophia Smith, with Andonovski sending on Rapinoe shortly before the 100th minute.\nThe 38-year-old has long been the team's defining symbol and inspiration - but here she blazed the fourth USA penalty wildly over the bar.\nSmith put well wide when the USA would have advanced if she scored, before O'Hara struck the post.\nThe dreams of the USA being the first nation to win three successive World Cups is over. Their reign as undisputed queens of the global women's game is also finished.\nSweden breezed through Group G with a 100% record. However, the four-time world champions are a big step up from South Africa, Italy and Argentina.\nSweden were reliant on Musovic, who spent most of last season as back-up for Women's Super League champions Chelsea - but she proved why she is number one for her country here.\nIn the 53th minute Horan's first-time shot following a low cross from the right seemed destined for the bottom corner, only for Musovic to make a brilliant low one-handed stop to her left despite being unsighted by Trinity Rodman stood in front of her.\nEven better came in the final seconds of normal time as Morgan headed down from point-blank range, only for Musovic to palm the ball way.\n\"I had a really good feeling before the game, there was a good feeling among the squad,\" said the 27-year-old afterwards.\n\"During the game you have to have each others' backs, we knew we were facing a really good team. I am extremely proud. \"To be able to perform in that way, it takes a lot of hard work that nobody sees. The reason I am a goalkeeper is to give our team the best chance to win the game. You just do what you do, it feels natural.\"\nSweden did get more of a measure of their opponents as the game wore on, but still had to defend deep as waves of USA attacks crashed upon them. They did not have their first shot on target until the 85th minute, Sofia Jakobsson firing straight at Naeher.\nUltimately they were reliant on Musovic to get them to penalties - when the greatest drama played out, and the once unbeatable USA were toppled.", "url": "https://www.bbc.com/sport/football/66414350"}