{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:47:00", "date_modify": "2025-05-20 13:47:00", "date_publish": "2023-07-31 14:19:19", "description": "Luton Town: Rob Edwards' journey to the Premier League", "filename": "sport_articles_c89rrrxj3l5o_1747748820.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/085a/live/e2b27bf0-2f93-11ee-999b-b74dedc428d3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c89rrrxj3l5o_1747748820.html", "title": "Luton Town: Rob Edwards' journey to the Premier League", "title_page": "Luton Town: Rob Edwards' journey to the Premier League - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Mark Sanderson, BBC Sport\nIn his first season in charge at Kenilworth Road, Rob Edwards achieved what the club's previous 21 managers had been unable to do - he took the club back to the top flight.\nIncredibly, promotion came just nine years after the Hatters were playing in non-league.\nLike Luton Town, Edwards has been on an upward trajectory over the last decade. The former Wales, Wolves, and Blackpool defender went into coaching aged just 30, after retiring from playing due to injury.\nThe 40-year-old has made a lasting impression on those he has managed since, who suggest there's yet more to come from their former coach.\nIn 2019, during his time as academy coach at Wolves he guided the Under-23s into the top tier of Premier League 2.\nGateshead midfielder Ed Francis was part of that Wolves Under-23 team, having also been coached by Edwards at Manchester City.\nFrancis said: \"It was only for about six weeks, but he made a real impression on me and was one of the main reasons I went to Wolves. Everyone he's coached will tell you about his man-management, he was so good for me. The culture he was able to create was through his ability to manage us as a group.\"\nFrancis points to Edwards' communication skills, which were vital when dealing with players with aspirations of reaching the first team.\n\"He always treats people well and is honest with them. Even those not playing regularly bought into what he was trying to achieve\" Francis added.\nThe young Wolves set up their opportunity to win the second division Premier League 2 title by beating Stoke - Francis getting the winner. They had to go to Manchester United and win to have any chance of securing the trophy. This looked far from likely after going 2-0 down to a strong United side featuring Angel Gomes, now a Lille player.\nFrancis recalls United having a great chance to go three up, yet Wolves pulled off a 3-2 victory: \"We probably shouldn't have won it, but we did. He [Edwards] seems to have that knack. The way that game went gave you goosebumps.\"\nRead the full BBC Sport feature here", "url": "https://www.bbc.com/sport/articles/c89rrrxj3l5o"}