{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:03:12", "date_modify": "2025-05-21 05:03:12", "date_publish": "2025-01-14 22:18:21", "description": "Brentford 2-2 Man City: 'We didn't cope with the physicality at the end' - Foden reacts to draw", "filename": "sport_football_articles_c9w5r9ll5xvo_1747803792.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e10a/live/59cd9410-d2c5-11ef-af5d-07f6a75d4237.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c9w5r9ll5xvo_1747803792.html", "title": "'We didn't cope with the physicality at the end' - Foden", "title_page": "Brentford 2-2 Man City: 'We didn't cope with the physicality at the end' - Foden reacts to draw - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester City midfielder Phil Foden, speaking to TNT Sports: \"We just looked tired at the end. The last 20, 30 minutes, we looked leggy and they put the pressure on and put longer balls into the box. We didn't cope with the physicality at the end.\n\"It's one of the toughest places to come and they give you different challenges. I was happy with the performance up until we went 1-0 up and then after that we let our performance slip and gave the ball away. It's something to learn from. They gave us a challenge today and we did the best we could.\"\nOn the number of games Man City have to play: \"We're used to it for many years, we've been playing the majority of the competitions and playing every three days so it's something the squad are quite used to, no excuses.\"\nOn Kevin de Bruyne's ball in for the first goal: \"We've built that combination now for years, I've been playing with him and training with him. Me and Kev's connection is good on the pitch. He gave me the perfect ball, I just had to help it on and I was delighted to see it hit the back of the net.\"", "url": "https://www.bbc.com/sport/football/articles/c9w5r9ll5xvo"}