{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:31:41", "date_modify": "2025-05-21 06:31:41", "date_publish": "2025-03-31 18:02:05", "description": "Nat Johnson replaces the injured Laura Rafferty in the Northern Ireland women's squad for their Nations League double-header against Romania.", "filename": "sport_football_articles_c9w8kl04y8yo_1747809101.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9951/live/2ae01760-0e5a-11f0-9fff-a7291b2e82a7.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c9w8kl04y8yo_1747809101.html", "title": "Northern Ireland women: Nat Johnson replaces injured Laura Rafferty for Nations League games", "title_page": "Northern Ireland women: Nat Johnson replaces injured Laura Rafferty for Nations League games - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Nat Johnson has been called up to the Northern Ireland women's squad for the Nations League double-header against Romania.\nThe Nottingham Forest full-back replaces injured Rangers defender Laura Rafferty in Tanya Oxtoby's 23-player group.\nJohnson, 31, has won three caps for NI, making her debut in a 1-0 win against Croatia in the Euro play-off second leg in October.\nNorthern Ireland face Romania in Bucharest on Friday, before a home game at Windsor Park against the same opposition on Tuesday, 8 April.\nOxtoby has also included 16-year-old goalkeeper Abbie Smith as a training player as the team prepare at Leicester City's training ground before flying to Romania on Wednesday.\nUnder-17 international Smith recently signed for Manchester City from Women's Premiership side Crusaders.\nLisburn Rangers 17-year-old goalkeeper Kate Smith will also join up with the squad as a training player next week.\nFormer England international Izzy Christiansen, as she did last month, has joined the coaching staff as NI target two wins which would keep them in contention for promotion from Group B1.", "url": "https://www.bbc.com/sport/football/articles/c9w8kl04y8yo"}