{"authors": ["Ged Scott", "www.facebook.com"], "date_download": "2025-05-20 12:38:13", "date_modify": "2025-05-20 12:38:13", "date_publish": "2023-08-03 18:41:47", "description": "England's Ben Foakes hits a ton but Surrey lose at home to Leicestershire in the One-Day Cup, while Notts skittle Essex and Yorks-Lancs is rained off.", "filename": "sport_cricket_66398868_1747744693.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/DD3A/production/_130643665_benf.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66398868_1747744693.html", "title": "One-Day Cup: Ben Foakes hits ton but Leicestershire beat Surrey - and Notts skittle Essex", "title_page": "One-Day Cup: Ben Foakes hits ton but Leicestershire beat Surrey - and Notts skittle Essex - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England's Ben Foakes hit his first century in white-ball cricket - but still could not prevent Surrey getting off to a losing start in the One-Day Cup.\nJust like Essex, who were hammered by 168 runs by Nottinghamshire at Chelmsford, Surrey also stumbled badly on home soil, being beaten by five wickets by Leicestershire, with 46 balls to spare at The Oval.\nFoakes hit 106 from 107 balls, including two sixes and nine fours, as Surrey recovered from 129-4 in the 23rd over to post what looked a competitive total of 325 all out.\nHe was backed by half-centuries from Ben Geddes (67) and Cameron Steel (50) as the hosts were finally bowled out with the penultimate ball of their final over, a fifth wicket for paceman Tom Scriven.\nDespite 57 from Peter Handscomb and a rapid 46 from skipper Lewis Hill, the Foxes looked far from assured of victory when they lost their fifth wicket in the 25th over.\nBut, from 183-5, South African Wiaan Mulder and Lincolnshire's Louis Kimber plundered an unbroken stand of 146, including a match-settling 21 off the 36th over bowled by Matthew Dunn.\nThat helped break their county's sixth-wicket record of 136 set by former Foxes coach Paul Nixon and ex-skipper Darren Maddy against Sussex at Hove 28 years ago.\nSurrey now face Middlesex in their next Group A game at Radlett on Saturday, while the Foxes return to action the following day against Kent at Beckenham.\nIt was even more one-sided in the other Group A game at Chelmsford, where Essex suffered their sixth highest runs defeat in List A cricket - a 168-run loss to Nottinghamshire.\nAfter Notts had collapsed from 107-0 to be bowled out for 237, Dane Paterson blasted through the young Essex side with 4-30, backed by the County Championship's in-form leading wicket-taker Brett Hutton (3-17).\nEssex were bowled out for just 69 in just 25.1 overs.\nAt 46-8, they looked like they might rewrite the Essex record books, the county's lowest List A score of 57 against a Glen Chapple-inspired Lancashire in the 1996 NatWest Cup final at Lord's.\nBut Essex were five wickets down inside 12 overs with only 31 on the board - and they continued to fall with great regularity.\nIt had been a similar tale earlier once Essex had broken a century first-wicket stand between Ben Slater (79) and 20-year-old rookie Ben Martindale, who made 55 on only his second first-team appearance.\nBut Notts lost their last nine wickets for just 66 runs as Aaron Beard tore through them with career-best List A figures of 4-32.\nThe Roses match between Yorkshire and Lancashire at Scarborough was an early victim of the weather.\nPlay was called off for the day before two o'clock at North Marine Road, to continue the Tykes' atrocious luck with the weather this summer.\nFollowing the loss of the final two days of last week's County Championship Division Two game with Durham at Scarborough, Yorkshire have now lost 40 per cent of their potential red-ball playing time in 2023.\n\"They're piling up on top of each other these disappointments,\" said Yorkshire head coach Ottis Gibson. \"Of course, there's nothing you can do about it, but it doesn't make it any less disappointing.\n\"All of yesterday in the hotel, when I saw the amount of rain falling on top of what had already fallen last week, I didn't think we'd have a chance.\n\"Then I came to the ground this morning, and the ground looked OK. But the wicket, the groundsman said that with the amount of rain we had yesterday that some water had seeped under the covers.\"\n\"It's unbelievably disappointing,\" said Lancashire One-Day Cup coach Graham Onions. \"It was a great crowd and a Roses match, but it was just water had got under the covers and made it unplayable.\n\"The foot-holes at one end were very wet. The groundsman tried his best to fill it in to make it hard, like you do during a four-day game. That could potentially have made a difference. But the rain came again.\"", "url": "https://www.bbc.com/sport/cricket/66398868"}