{"authors": ["Dan Austin", "www.facebook.com"], "date_download": "2025-05-21 06:35:02", "date_modify": "2025-05-21 06:35:02", "date_publish": "2024-12-24 07:48:04", "description": "The festive period is the busiest part of the football season across the UK.", "filename": "sport_football_articles_c5y4e1pmv20o_1747809302.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2038/live/f2eb7470-bd38-11ef-a0f2-fd81ae5962f4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c5y4e1pmv20o_1747809302.html", "title": "Do footballers train on Christmas Day in the Premier League and EFL?", "title_page": "Do footballers train on Christmas Day in the Premier League and EFL? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Most leagues in Europe have a one or two-week winter break around Christmas, when matches are paused and training schedules lightened.\nBut festive football has been an ironclad British institution for decades. And that means that, yes, most professional footballers will be training on Christmas Day.\n\"When you have your kids there playing with their new toys and you have to go training, that is a big sacrifice. It's not about money - it's just human nature,\" former Sheffield United, Tottenham and Fulham midfielder Michael Brown told the BBC.\nWith matches in the top-flight divisions in England, Scotland, Wales and Northern Ireland all scheduled for Boxing Day - as well as in the English lower leagues - a Christmas Day training session is the final opportunity managers have to help players maintain their fitness and work on a gameplan.\nFestive photos featuring players wearing Santa hats and reindeer noses are often posted online by clubs who are training on Christmas Day.\nChristmas Day sessions for teams playing at home on Boxing Day typically take place in the morning or early afternoon, before players go home to spend time with family later in the day.\nBut if a team is playing away from home on Boxing Day then things become more complicated.\nClubs often stay over at a hotel the night before away matches, especially in the case of an early kick-off time or a long distance to travel, meaning a coach journey or flight followed by a night in a hotel is common.\nDespite their evident privilege, some footballers find the time spent away from loved ones on Christmas Day difficult, as Brown admits.\n\"I won't lie, [training at Christmas] is psychologically a challenge not to feel a bit sorry for yourself,\" he said.\n\"Sometimes you think about everyone [else] having a good time, but you have to think how many people would swap with your position. You have to realise and think about what you are doing.\"\nNot every player has to turn up to work on Christmas Day, though. Teams who don't have a fixture scheduled for Boxing Day often give their squads the day off and train on the 26th instead.\nThis year, Arsenal winger Bukayo Saka was set to be one of the lucky ones.\n\"We're playing at home on the 27th so I haven't got to travel anywhere so it's perfect, I couldn't have asked for more from Santa,\" the England international told the BBC before he picked up a hamstring injury that will rule him out for \"many weeks\".\n\"I'll be able to have a Christmas dinner for the first time in a while so I'm looking forward to it. I'll spend it with my family so it's going to be nice.\n\"I have a little African twist in there. Some jollof rice, some pigs in blankets and then some turkey, a bit of gravy on the side, maybe one or two potatoes but no veggies. None of that. I'm happy with that to be fair.\"", "url": "https://www.bbc.com/sport/football/articles/c5y4e1pmv20o"}