{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:32:46", "date_modify": "2025-05-21 05:32:46", "date_publish": "2025-04-02 17:13:21", "description": "Blackburn Rovers owners Venky's do not want to sell the club and have not received any concrete offers to take over, BBC Radio Lancashire is told.", "filename": "sport_football_articles_c3ev8vx2dyko_1747805566.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f9e3/live/43b1c4a0-0fe0-11f0-8db5-3f4abea6b85e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c3ev8vx2dyko_1747805566.html", "title": "Blackburn Rovers: Owners Venky's 'do not want to sell club' senior club officials tell BBC", "title_page": "Blackburn Rovers: Owners Venky's 'do not want to sell club' senior club officials tell BBC - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Blackburn Rovers owners Venky's do not want to sell the club and have not received any concrete offers, the chief executive and chief operating officer have told BBC Radio Lancashire.\nVenky's, a company formed by the Rao family, took over at Ewood Park in 2010 from a trust set up in the name of former owner Jack Walker.\nSince then, the club were relegated from the Premier League and have played outside the top flight since.\nIn an interview with BBC Radio Lancashire, COO Suhail Pasha - who was speaking to the media for the first time during his 15-year association with Rovers - said the owners still wanted to support the club despite some fans voicing their frustration with the way it is run.\nAsked whether they would rather just walk away Pasha said: \"I can't answer the question because obviously they are the owners of the club.\n\"The last time myself and [CEO] Steve Waggott spoke, they didn't want to sell the football club. In fact, I think they want to try and support us in the best possible way.\"\nWhen asked whether a genuine offer had been made to buy the Championship club, Waggott replied: \"Not in my seven-and-a-half years.\n\"You get certain whispers from certain people who are saying 'there's American investors in town', the end result is always going to be - put an official offer in and show us the proof of funding.\"\nRovers are 11th in the Championship table and five points outside the play-off places heading into the final stages of the season.\nDespite being just outside the top six on points, however, Rovers have lost their past four games and are winless in six matches.\nWaggott, Pasha and head of football operations Rudy Gestede were speaking to BBC Radio Lancashire the week after the trio were asked by a collection of fan groups to stay away from the club's remaining games of the campaign.\nWith growing fan disillusionment over the club's position, Waggott still does not feel that Venky's will part with Rovers yet, but admitted that they may be tempted if the right offer is made.\n\"The way it stands presently I can't see them going anytime soon,\" Waggott added.\n\"Obviously, if there was an interest from another investor who put in a legitimate fully fledged offering that covered their time in the club that they felt was reasonable and fair, it's just like a footballer. Every player's up for sale. So clubs are up for sale.\"\nPasha said Blackburn's position in the table in comparison to a torrid 2023-24 campaign, in addition to Venky's sticking with the club, should offer some context towards their critics.\n\"If you asked our fans at the start of this season what they expected regarding the players in the squad that we had, most of the fans would have said we'll get relegated,\" Pasha added.\n\"But here we are sitting just five points off the play-offs. So it's a question for them [the owners] to answer. We're more than happy for them to come and be part of it. But I think that fans need to also appreciate that we have owners who are backing us.\"", "url": "https://www.bbc.com/sport/football/articles/c3ev8vx2dyko"}