{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:22:10", "date_modify": "2025-04-26 04:22:10", "date_publish": "2025-03-03 14:20:32", "description": "Glasgow City 4-0 Motherwell: What they said", "filename": "sport_articles_cvgdverkvy0o_1745641330.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a6c9/live/84530680-f83a-11ef-a8b4-b37546a32a57.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cvgdverkvy0o_1745641330.html", "title": "Glasgow City 4-0 Motherwell: What they said", "title_page": "Glasgow City 4-0 Motherwell: What they said - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Glasgow City manager Leanne Ross: \"Really pleased with the result today, we knew we were in for a tough game, Motherwell have done really well to get themselves in that top six this season, they've had some fantastic results and performances, we knew they were going to be difficult to break down, and that proved to be on the day.\n\"Every single game now is a must win, they're not going to be wins from now until the end of the season, but we're going into them saying that we must win them.\n\"We're going to give everything that we can to make sure that we put up the biggest fight possible to go and win this title, but we know it's going to be tough.\n\"Every single team that's in that top six is going to be doing exactly the same, the neutral is in for some exciting games to end the season.\"\nMotherwell assistant Colin Crichton: \"Disappointed with the result, we really believe that we could have come here and got something out of the match.\n\"In terms of how we performed, I thought we were excellent, the players were really, really good, the players that started, the players that finished, plenty of energy, press was good.\n\"If it goes 1-1 you can at least then run them a bit closer than we did, it's disappointing to then lose a second, at that point City are in control of the match but even still, I thought the players were absolutely fantastic, the energy they gave, real enthusiasm all over the park, and that's going to try and set us up now for the rest of the season.\"", "url": "https://www.bbc.co.uk/sport/articles/cvgdverkvy0o"}