{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:05:28", "date_modify": "2025-05-21 05:05:28", "date_publish": "2025-01-23 11:31:39", "description": "There's just 31 seconds on the clock when Leeds United winger Dan James' first time cross meets teammate Manor Solomon's feet to give them an early lead and help push them back to the top of the table.", "filename": "sport_football_articles_cdd9285leqdo_1747803928.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4aca/live/670c4e10-d977-11ef-a7bb-3fe4cd8ea938.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cdd9285leqdo_1747803928.html", "title": "Leeds United: 'I think I can get even better'", "title_page": "Leeds United: 'I think I can get even better' - Manor Solomon - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "There was only 31 seconds on the clock when Manor Solomon converted Dan James's first-time cross to give Leeds United the lead against Norwich City and help push them back to the top of the table.\nThe Whites went on to win the game 2-0, with James scoring the second goal.\nWhen asked about his stunning opening goal, the former Tottenham Hotspur player gave a lot of credit to the team synergy created on the training ground.\n\"When DJ [Dan James] plays, I know that I need to be switched on,\" Solomon told BBC Radio Leeds.\n\"When the ball is on the other flank, I know that I need to be inside because DJ is really fast.\n\"It was a great delivery and we opened the game really well.\"\nSolomon was an injury doubt for the match, having picked up a hamstring issue in the win over Sheffield Wednesday on Sunday, but the 25-year-old said he is feeling \"confident\".\n\"I'm feeling really good, I'm feeling like I'm back to myself,\" Solomon added.\n\"I think I can get even better and I just want to continue like this.\"", "url": "https://www.bbc.com/sport/football/articles/cdd9285leqdo"}