{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 08:00:16", "date_modify": "2025-04-26 08:00:16", "date_publish": "2025-02-25 10:49:37", "description": "Hibernian announce \"stand-out\" midfielder Jamie McGrath will join the club at the end of this season when his Aberdeen contract expires.", "filename": "sport_football_articles_czdnl4rr2n9o_1745654416.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/511a/live/946bafb0-f360-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_czdnl4rr2n9o_1745654416.html", "title": "Hibernian transfers: Midfielder Jamie McGrath to join when Aberdeen deal expires", "title_page": "Hibernian transfers: Midfielder Jamie McGrath to join when Aberdeen deal expires - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Hibernian have announced \"stand-out\" midfielder Jamie McGrath will join the club at the end of this season when his Aberdeen contract expires.\nMcGrath, 28, has agreed terms on a four-year deal at Easter Road. He signed for Aberdeen in August 2023, and has previously played for St Mirren and Dundee United in the Scottish Premiership.\nThe Republic of Ireland international - who is capable of playing out wide as well as through the middle - has scored 16 goals in 75 appearances for the Pittodrie club.\nHe was a key figure for Jimmy Thelin's side at the start of this season, but suffered a shoulder injury in January and has not featured in the past five matchday squads.\n\"We're delighted to have agreed a pre-contract with Jamie,\" Hibs head coach David Gray said. \"He's a player that we've admired for some time.\n\"He's a creative player that will add extra quality in our midfield and in the final third.\n\"It's clear to everyone that he's been a stand-out performer in the Scottish Premiership over the last few years, and his experience and character will add to our dressing room.\n\"We all look forward to working with Jamie in the summer.\"\nAberdeen say they were \"not prepared\" to offer McGrath the same length of contract as Hibs, despite the player being \"keen\" to stay.\nA statement on their official club website reads: \"Both Jamie, who will miss the rest of the season through injury, and his representative made it clear he was happy at Pittodrie, and was keen to stay, but we were not prepared to offer him a four-year extension.\n\"Everyone at Aberdeen respects Jamie's decision to look elsewhere, thanks him for his time at the club and wishes him all the best for his future career.\"", "url": "https://www.bbc.co.uk/sport/football/articles/czdnl4rr2n9o"}