{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:33:49", "date_modify": "2025-05-21 05:33:49", "date_publish": "2025-04-02 15:59:23", "description": "Scotland will be boosted by 'best ever' version of Cuthbert, says captain Corsie", "filename": "sport_articles_c20x6dl22l8o_1747805629.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9ded/live/61383f00-0f03-11f0-9021-b1661f716c64.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c20x6dl22l8o_1747805629.html", "title": "Scotland will be boosted by 'best ever' version of Cuthbert, says captain Corsie", "title_page": "Scotland will be boosted by 'best ever' version of Cuthbert, says captain Corsie - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "\"I'm not even going to say maybe, it was without doubt the best football I've seen her play.\"\nThat's just how well Scotland captain Rachel Corsie thinks midfielder Erin Cuthbert is currently performing.\nScotland host Germany in the first of a Nations League A double-header on Friday and will be bolstered by the returning Cuthbert, who missed their opening matches against Austria and Netherlands in February because of a rib problem. Both games ended in defeat for interim head coach Michael McArdle.\nCuthbert has been in fine form for WSL leaders Chelsea and helped them overturn a two-goal first-leg deficit to knock out Manchester City in the Women's Champions League quarter-finals last week.\n\"It's a boost with Erin back. I just saw her play the first 45 minutes at the weekend, and I was at Stamford Bridge on Thursday night,\" Corsie, who remains sidelined through injury, told the Behind the Goals podcast.\n\"I'm not even going to say maybe, it was without doubt best football I've seen her play. It's the efficiency of what she does, it's so effective.\n\"And she's sort of buzzing about, I know that she's feeling good; she knows that she's in a good bit of form, and she's enjoying it.\"\nThird in the Fifa rankings, Germany visit Tannadice on Friday night before the teams meet again in Wolfsburg four days later.\n\"We'll spend large parts of the game, I would think, against Germany under pressure,\" Corsie added.\n\"We've been in those games before, we've had a lot of games like that where we've shown we can compete and be really difficult to break down, so I would expect us to have to try and be really diligent and disciplined in that area of pitch.\"\nFormer Scotland midfielder Leanne Crichton echoed Corsie's sentiment that it will be a night of hard graft out of possession, saying: \"They'll need to be comfortable without the ball, that's the reality against the Germans.\"\nWith the first leg on Scottish soil, though, the sidelined skipper does see some reason to be hopeful.\nCorsie said: \"It's an advantage to be at home. I think that home game probably comes [with] a little extra optimism from my perspective because I just think, can we really try and push and get something out of that?\n\"I feel optimistic, I do.\"", "url": "https://www.bbc.com/sport/articles/c20x6dl22l8o"}