{"authors": ["David Currie", "www.facebook.com"], "date_download": "2025-05-21 04:56:42", "date_modify": "2025-05-21 04:56:42", "date_publish": "2025-04-04 13:35:59", "description": "Returning Stuart Findlay 'excited' to help Kilmarnock climb table", "filename": "sport_articles_c1egl05e0j8o_1747803402.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a9b0/live/8ed6eb20-1154-11f0-b448-235a3347d04a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c1egl05e0j8o_1747803402.html", "title": "Returning Stuart Findlay 'excited' to help Kilmarnock climb table", "title_page": "Returning Stuart Findlay 'excited' to help Kilmarnock climb table - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Stuart Findlay hopes his return to fitness can coincide with an upturn in Kilmarnock's form as they look to pull away from the Premiership relegation battle.\nDerek McInnes' side are 10th in the league, one point above Dundee in the play-off and six above bottom club St Johnstone with two matches until the split.\nKillie host Motherwell on Saturday and having come off the bench in last weekend's heavy defeat by St Mirren, Findlay is ready to make his first start in five months.\n\"I've trained well in the last couple of weeks, everything's going well,\" the 29-year-old defender said.\n\"It'll be between the manager and the physio staff if they think I'm ready to start.\n\"If they deem that I'm ready and the manager wants to select me, then happy days, but we'll see how that goes by the end of the week.\n\"I'm feeling good and I'm really excited to try and get back out there and start helping the team more than I've been able to in the last couple of months.\n\"It's a case of how can I help the team? How can everybody that's coming back from fitness help the team and get ourselves all together and put a good run of performances and results together between now and the end of the season?\"\nWhile Findlay was delighted to make his first appearance since suffering ligament damage against Dundee in November, he says the performance and result in Paisley was unacceptable.\n\"It was a massive personal milestone for me to get back into the playing squad,\" he said.\n\"It's been a long old road since I got injured at Dens. There's no point beating around the bush, it was definitely not the result or performance that we wanted.\n\"We've got a good opportunity back at home to get three points on the board and I think we're all ready to set the record straight after last week.\"", "url": "https://www.bbc.com/sport/articles/c1egl05e0j8o"}