{"authors": ["Um-E-Aymen Babar", "www.facebook.com"], "date_download": "2025-05-20 13:50:11", "date_modify": "2025-05-20 13:50:11", "date_publish": "2023-07-31 19:46:26", "description": "All the drama and excitement from day five of the fifth Ashes Test in digest format.", "filename": "sport_cricket_66367290_1747749011.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/CB1F/production/_130599915_broad.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66367290_1747749011.html", "title": "Ashes digest: Stuart Broad bows out after England's emphatic win", "title_page": "Ashes digest: Stuart Broad bows out after England's emphatic win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Stuart Broad once again stole the show on day five of the final Ashes Test at The Oval as England beat Australia by 49 runs to draw the series 2-2.\nIt was a fitting finale to an incredible series, with retiring England great Stuart Broad producing the perfect denouement to his fairytale career.\nThere was the reappearance of Broad's bail-switching antics which helped him dismiss Australia spinner Todd Murphy, before he picked up the winning wicket of Alex Carey and ran to embrace his old friend James Anderson.\nHere are some of the best takeaways from the final day.\nEngland's Chris Woakes and Moeen Ali helped break the partnership of Steve Smith and Travis Head as Australia collapsed from 264-4 to 294-8 in the space of eight overs.\nWoakes' first spell in the morning was 2-19 from six overs and his spell in the evening session was 2-26 from eight overs.\nThere are only two other England bowlers who have taken six or more wickets in three consecutive home Ashes Tests within the same series: Alec Bedser in 1953 and Jim Laker in 1956.\nDid anyone believe we would see the return of Stuart Broad's bails trick? And that it would actually work... again?\nBroad, who rearranged the bails in the first innings to bring about Marnus Labuschagne's demise, did the same to dismiss Todd Murphy during a stubborn partnership which was holding up England's victory charge.\nSurprisingly, it worked just as well as the first time too. Coaches, take notes...", "url": "https://www.bbc.com/sport/cricket/66367290"}