{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:19:12", "date_modify": "2025-05-21 07:19:12", "date_publish": "2025-03-30 00:00:00", "description": "A late own goal gives Aston Villa a potentially priceless win against Liverpool in their bid to avoid relegation from the Women's Super League.", "filename": "sport_football_live_cddy8v2612dt_1747811952.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/822d/live/5d8e0a90-0d75-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cddy8v2612dt_1747811952.html", "title": "Women's Super League", "title_page": "Liverpool 1-2 Aston Villa: Visitors earn valuable win in Women's Super League - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A late own goal gave Aston Villa a potentially priceless win against Liverpool in their bid to avoid relegation from the Women's Super League.\nLiverpool's Marie Hobinger converted a second-half penalty before Villa levelled through substitute Kirsty Hanson and Jenna Clark diverted a cross into her own net.\nLiverpool came closest to breaking the deadlock in the first half when Sophie Haug forced Sabrina D'Angelo to claw away her header, before Jasmine Matthews put the rebound over the bar when it looked easier to score.\nLucy Staniforth - making her first start for Villa since December because of injury - smashed an effort over the bar following the visitor's only attack of note before the break.\nMistakes have cost Villa too often this season and that was again the case at St Helens Stadium.\nCeri Holland was afforded the freedom of the Villa half to bear down on goal but was brought down by D'Angelo, allowing Hobinger to stroke the resulting penalty into the bottom left corner.\nVilla had more of the ball and almost hit back immediately, but Rachael Laws denied Chasity Grant after a Maz Pacheco cross found its way to the back post.\nThe visitor's persistence paid off 10 minutes later when substitute Hanson latched on to a pin-point Missy Bo Kearns ball over the top, rounded Laws and squeezed her finish past two players on the goalline.\nVilla continued to push and were rewarded when Ebony Salmon's low cross was converted past her own goalkeeper by Liverpool substitute Clark.\nVilla now have a four-point buffer on bottom-side Crystal Palace, who were beaten by Arsenal, and ended their seven game winless run in the WSL.\nManager Natalia Arroyo, who replaced interim boss Shaun Goater in January, earned her first win at the sixth time of asking.\n\"Today we showed the kind of team we can be – brave, aggressive, and that can deal with a goal when they concede which is the only mistake we made,\" said Arroyo.\n\"The faith that we showed was amazing, I'm very, very happy for them.\"\nAmber Whiteley began her spell as Liverpool interim boss with two league wins and an FA Cup quarter-final victory against Arsenal, but will now have to pick her side up from back-to-back WSL defeats.\nEarlier in the week she spoke of the club's aim to achieve a fifth-place finish, though they missed the chance to leapfrog Brighton.\nLiverpool appeared to run out of steam as the game progressed and Villa pushed, and once again made life difficult for themselves at the back.\nA third own goal in two games is far from ideal, neither is the lack of communication that resulted in Hanson peeling off the back of the defence to score.\nNow the euphoria of victories against Arsenal and Manchester United has subsided, Liverpool must regroup and get the basics right before they face Chelsea in the FA Cup semi-finals on 12 April.", "url": "https://www.bbc.com/sport/football/live/cddy8v2612dt"}