{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:00:57", "date_modify": "2025-05-21 06:00:57", "date_publish": "2025-04-01 23:02:53", "description": "Arsenal's Raheem Sterling and England and Chelsea's Lauren James are named on a five-player list recognising the most influential black people in British football.", "filename": "sport_football_articles_ckgr2xz6zr8o_1747807257.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f928/live/858cd640-0f08-11f0-b234-07dc7691c360.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ckgr2xz6zr8o_1747807257.html", "title": "Football Black List: Raheem Sterling and Lauren James recognised", "title_page": "Football Black List: Raheem Sterling and Lauren James recognised - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Arsenal's Raheem Sterling and Chelsea's Lauren James have been named on a five-player list recognising the most influential black people in British football.\nAston Villa and England's Tyrone Mings, Tottenham and Brazil's Richarlison and QPR's Kasha Petit are also named on the Football Black List for 2024.\nThe annual celebration, which began in 2008, recognises the efforts of black figures working in various areas of the game.\nNottingham Forest head coach Nuno Espirito Santo is among the inclusions in the coaching category.\nHe is joined by Port Vale boss Darren Moore, England Under-21 assistant head coach Ashley Cole, Watford Women's Renee Hector and Arsenal Women's Under-21s coach Carly Williams.\nThe lists are compiled across eight categories, including an 'ones to watch' category to identify talents under 30, are decided by a panel of experts with representatives from the Premier League, Professional Footballers' Association, League Managers' Association, EFL and anti-racism group Kick It Out.\nLeon Mann, co-founder of the Football Black List, said: \"The Football Black List once again serves as a reminder of the incredible impact black communities are making in football.\n\"It is also vital that while we celebrate the exceptional people on the list, we recognise the ongoing underrepresentation of black people away from playing - in the boardrooms, dugouts and leadership teams across the game.\n\"We must take this challenge on with urgency.\"", "url": "https://www.bbc.com/sport/football/articles/ckgr2xz6zr8o"}