{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:37:56", "date_modify": "2025-04-26 07:37:56", "date_publish": "2025-02-27 13:52:31", "description": "St Johnstone fan views on win over Ross County", "filename": "sport_articles_cd92q4lk4pxo_1745653076.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2ab8/live/4ccac460-f451-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cd92q4lk4pxo_1745653076.html", "title": "St Johnstone fan views on win over Ross County", "title_page": "St Johnstone fan views on win over Ross County - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "We asked you for your opinions on the 1-0 win over Ross County that narrowed St Johnstone's deficit at the bottom to three points.\nHere's what some of you had to say:\nHenri: Zach Mitchell, Makenzie Kirk and Stephen Duke-McKenna all put in an exceptionally good performance. We just need to channel our result and that energy into the game on Saturday to have any, albeit little, chance of staying up.\nStuart: A team who knew what they had to do went out and did everything correct. Really should have been over at half-time, if not for the County keeper. We clawed ourselves back in before a big game on Saturday. Mitchell and Daniels Balodis looked composed at the back, Duke-McKenna took his start well.\nGary: The worry for me is Saints only scored because of a mistake. All that possession and we couldn't score without a mistake. Dundee won't be so generous in the derby in Saturday. Hopefully Simo Valakari tries to play a more direct style.\nBrian: A testament to the manager that even considering the season we've suffered, fans are still very much behind Valakari and the team. His transparency and investment in the club, and Perth area, has been a breath of fresh air. Another big one on Saturday, but we're going with belief.\nPaul: A very encouraging display against a lacklustre County team who have an impressive away record. Mitchell, for me, was MOTM at centre-half and closely followed by the matchwinner Kirk.", "url": "https://www.bbc.co.uk/sport/articles/cd92q4lk4pxo"}