{"authors": ["Kieron Brady", "www.facebook.com"], "date_download": "2025-04-26 04:38:35", "date_modify": "2025-04-26 04:38:35", "date_publish": "2025-02-28 10:19:04", "description": "Former Sunderland midfielder Kieron Brady is unhappy with Regis Le Bris publicly stating this week that there is 'some fatigue' in his squad.", "filename": "sport_football_articles_cp8yyg107vro_1745642315.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d176/live/0fdbecb0-f5bd-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cp8yyg107vro_1745642315.html", "title": "Sunderland: Fatigue claim could come back to bite Regis Le Bris", "title_page": "Sunderland: Fatigue claim could come back to bite Regis Le Bris - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "If Wilson Isidor's header had gone in against Hull City we would not be having this conversation, but you don't have to be medically qualified to say by dint of his age, Chris Rigg is still physically developing and is being asked to do a job on a regular basis when he's very much at a developmental stage.\nTo that end, you can understand those changes allied with the demands placed upon you can have an impact.\nBut I just cannot countenance the idea of managers or coaches talking about a team being tired. A team cannot be tired.\nIndividuals have the experience of being fatigued but the concern is, and it's not just Sunderland, it's a part of football discourse and it's been used as an excuse.\nI don't often hear managers and coaches talk about tiredness in the aftermath of a victory or a good performance.\nI don't believe it's good management to make public commentary that your charges are reaching a critical point of the season and you are, albeit unintentionally, putting into their minds the thought that they're tired or fatigued.\nIf in individual or private conversations Regis Le Bris looks at data and it suggests that certain players are not fulfilling the types of figures they did earlier in the season, then he's within his rights to do that.\nBut I really don't see the benefits from managers or coaches wheeling out terms like fatigue and tiredness in the aftermath, for the most part, of adverse outcomes.", "url": "https://www.bbc.co.uk/sport/football/articles/cp8yyg107vro"}