{"authors": ["Tom English", "www.facebook.com"], "date_download": "2025-05-21 04:58:03", "date_modify": "2025-05-21 04:58:03", "date_publish": "2025-01-31 17:36:18", "description": "A spate of injuries has left Scotland without key players as Tom English looks forward to the Six Nations opener against a dangerous Italian side at Murrayfield.", "filename": "sport_rugby-union_articles_cdjd83k0vm9o_1747803483.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7b9c/live/c113b640-dff9-11ef-bd1b-d536627785f2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cdjd83k0vm9o_1747803483.html", "title": "How Scotland went from title contenders to worried about Italy", "title_page": "Six Nations 2025: How Scotland went from title contenders to worried about Italy - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "You'd think that after 25 years of messing with the emotions of Scottish rugby fans - all the false dawns, all the misplaced hope - the Gods of the Six Nations would be bored with them by now.\nBut, no, A few weeks ago, Gregor Townsend beamed brightly as he spoke about his largely injury-free squad. It was a time of wholesale optimism. Old sceptics, hard-bitten by a quarter of a century of nothingness, were beginning to turn. Maybe, just maybe, this was Scotland's year.\nBefore the week was done, Sione Tuipulotu was out of the tournament. The captain, the powerhouse, the playmaker, one of the great personalities of the team - gone.\nThen Scott Cummings got injured and Scotland's beast factor was reduced. If you want to contend in the Six Nations then you better bring as many heavies as you can find. Cummings was out and so was his understudy, Max Williamson, the young brute who showed up so wonderfully against the mighty Boks in the autumn.\nThe Gods haven't let up. Josh Bayliss would almost certainly have been in the squad against Italy, but Townsend lost him to injury last Sunday.\nDylan Richardson, who'd have been on the bench as back-up hooker, is on the casualty list. Dave Cherry is now first-choice. The last time Cherry, a good set-piece man but a shock inclusion, made any kind of noise with Scotland was when he fell down the stairs in the team hotel in Nice during the World Cup. He's not been seen since in the international arena.\nJonny Gray is in from the start by necessity. Gray hasn't played a Test match in two years, has only played three times since late October and hasn't played at all since mid-December.\nSo that hope from before? Hmm. Let's call it cautious optimism at best. Townsend still has an excellent team with a backline laden with world class, but it's not as good as it might have been - and what-might-have-been isn't cutting it anymore with Scotland. Injuries or no injuries.\nIf this was a rock band that Townsend was running instead of a rugby team then this would be the Now Or Never tour. It's his eighth Six Nations and, by his own admission, something needs to happen and soon.\nScotland are on the sweet spot in terms of age profile, caps won and experiences learned. It's a tad early to say now or never, but the broader point is correct. They don't have forever.\nThey start with Italy, a must-win against a team that beat them in Rome last time and which is largely unchanged since then. In the Six Nations a year ago, Italy beat Scotland and Wales, drew with France in Paris (France played with 14 for half the game and Italy hit the post from a penalty to win it in the last play) and only lost to England by three points.\nScoreboards don't lie, but they mislead. In 2023, in Murrayfield, Scotland won 26-14 with Blair Kinghorn scoring a hat-trick. The reality of that game was that with 79 minutes played the gap was only four in Scotland's favour and Italy were banging on their try-line to wipe it out.\nThey were under the posts and Murrayfield was on its feet, roaring in encouragement and fear. Scotland survived, broke away and scored down the other end. The 12-point gap didn't reflect their brush with the dark side.\nThe way we view Italy has changed - or ought to have changed. Some, perhaps subconsciously, still see them as a nailed-on win with only the margin up for discussion. That was the case for a long time, but not anymore.\nThey have class and power all over their team, they have clever creators, deadly finishers with dynamism and belligerence.\nScotland have lost more Six Nations games to Italy (eight) than all the other nations combined, so the warning signs are there, flashing blue. Would it be a massive surprise if Italy won? Not in the minds of anybody who's been paying attention to them.\nTownsend has injuries, but he's not wallowing. He has absolute faith in Stafford McDowall filling in for Tuipulotu and bringing some of his ball-carrying and defensive solidity to the party.\nMcDowall is not Tuipulotu but he's still a seriously accomplished footballer, a leader, a big presence who will relish a run in the team. Save for Cherry and the undercooked, but freakish unit, Gray, then this is an impressive Scotland team with an impactful bench.\nAnd they'll most likely need it. A recurring theme throughout last season's championship was Scotland's fast starts and slow finishes, the opening day hair-raiser against Wales being the classic illustration of that.\nIn points scored across the four quarters of games they went from first, to third, to joint fifth to sixth in the final quarter. For points conceded they were again at their weakest in the final quarter.\nTownsend has some terrific firepower on the bench. George Horne, Tom Jordan and Kyle Rowe can create things out of nothing. Gregor Brown, with his physicality and skill-set, could be a real breakout star. Jack Dempsey hasn't played a whole pile of rugby but his carrying and his intensity might be just the ticket to get Scotland over the line.\nIt could be nervous, it could be positively terrifying, but it's the Six Nations and it's back and it's a hell of a time to be alive.", "url": "https://www.bbc.com/sport/rugby-union/articles/cdjd83k0vm9o"}