{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:07:23", "date_modify": "2025-05-21 05:07:23", "date_publish": "2025-01-23 10:55:08", "description": "Newport County: Nelson Jardim wants players to be physical like Ronaldo", "filename": "sport_football_articles_cy7g5z76gkro_1747804043.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/187c/live/2b8cea60-d96e-11ef-902e-cf9b84dc1357.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy7g5z76gkro_1747804043.html", "title": "Newport County: Nelson Jardim wants players to be physical like Ronaldo", "title_page": "Newport County: Nelson Jardim wants players to be physical like Ronaldo - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Nelson Jardim agrees with former Wales captain Kevin Ratcliffe that his team need to be more physciaI and says they should take inspiration from two footballing greats.\nPortugese Jardim says fellow countrymen Cristiano Ronaldo and Pepe are fine examples of footballing physicality - as well as being excellent players.\nThe Newport County head coach says Ratcliffe's criticism has merit.\n\"You have to be physical and I am Portuguese and I used to see Cristiano Ronaldo and Pepe and they are good players and they are also physical, so I agree with him,\" said Jardim.\nNewport County will play 13 of their remaining 22 League Two games at home at Rodney Parade, beginning with the visit of Swindon Town on Friday.\nJardim welcomes that but has challenged his players to be more robust in their approach.\n\"There are a couple of variables,\" he added.\n\"One is genetics, second one is hard work and the third one is mentality as well because you can be big but away against big crowds you can go into your shell.\n\"So those are the areas that we are trying to improve these players and it is down to them to accept that and step up,\" Jardim said.", "url": "https://www.bbc.com/sport/football/articles/cy7g5z76gkro"}