{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:46:57", "date_modify": "2025-05-20 13:46:57", "date_publish": "2023-07-31 14:33:27", "description": "Top teams New Zealand and South Africa lose their star shooters to knee injuries at the Netball World Cup.", "filename": "sport_netball_66363650_1747748817.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1421B/production/_130595428_gettyimages-1564819019.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_netball_66363650_1747748817.html", "title": "Netball World Cup 2023: New Zealand's Grace Nweke and South Africa's Lenize Potgieter ruled out injured", "title_page": "Netball World Cup 2023: New Zealand's Grace Nweke and South Africa's Lenize Potgieter ruled out injured - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Two of the world's best teams lost their star shooters to knee injuries after New Zealand's Grace Nweke and South Africa's Lenize Potgieter were ruled out of the rest of the World Cup.\nNweke, 21, was set for a breakthrough tournament in Cape Town, South Africa.\nBut she was in tears after suffering the \"devastating\" injury in the Silver Ferns' win over Singapore on Sunday.\nPotgieter had missed the Proteas' first two matches but played against Jamaica on Sunday before being deemed unfit.\nReserve shooter Tiana Metuarau has been called up to replace Nweke, while Potgieter is replaced by Owethu Ngubane.\nPotgieter, 29, who has 89 caps and was playing in her third World Cup, wore heavy strapping to both knees as the host nation lost 67-49 to Jamaica.\nShe played three quarters but South Africa announced on Monday she would be unable to continue and could only watch from the sidelines as her team beat Trinidad and Tobago 69-28 in their opening match of the second pool phase of the competition.\nGoal shooter Nweke, who has 24 caps, was set for a breakthrough tournament after winning the ANZ Premiership with Northern Mystics but limped off court in tears in the third quarter of New Zealand's victory over Singapore.\nBut Silver Ferns head coach Noeline Taurua said it is not \"a blow\" to their hopes of retaining the title.\n\"Unsurprisingly, [for] a 21-year-old, when things don't quite work out, it's devastating for her,\" Taurua said.\n\"She'll probably take at least four or five days to understand in herself and her thinking what the next steps are going to be.\n\"There's a lot of love in there, but also she knows, it's quite a delicate position because she knows she can't be crying all the time because the team needs her too. We are taking it one day at time.\"\nA rule introduced for this tournament allows teams to take three reserves to the World Cup who can replace a team member should they get injured.\nMetuarau made her World Cup debut in her side's 83-34 victory over Wales on Monday - her seventh cap for the Silver Ferns - but said she felt almost \"guilty\" for playing at the expense of her \"good friend.\"\n\"It would be a disservice to fall down now and feel sorry for myself,\" said Metuarau.\n\"I know for her sake, I need to be able to stand on my own two feet, and not necessarily fill her shoes, but bring what I bring to the team.\"", "url": "https://www.bbc.com/sport/netball/66363650"}