{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:43:32", "date_modify": "2025-05-21 05:43:32", "date_publish": "2025-01-31 16:59:55", "description": "Former Crusaders Irish Cup winning defender Sean Ward gives his predictions for this weekend's Irish Cup sixth round ties.", "filename": "sport_articles_cgly6drp86po_1747806212.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a0fc/live/f6030f10-dff2-11ef-b989-9b0a61de45dd.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cgly6drp86po_1747806212.html", "title": "Who does Sean Ward think will progress in the Irish Cup?", "title_page": "Irish Cup: Who does Sean Ward think will progress in the Irish Cup? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Glentoran v Linfield (Friday, 19:45 GMT, live on BBC iPlayer & BBC Sport website from 19:30 GMT)\nDeclan Devine appears to have given his team a real buzz at present, securing the Country Antrim Shield and that taste of success. Linfield on the other hand, have failed to beat the Glens this year. I think this may be their moment.\nPrediction: 1-2 AET\nBallinamallard United v Carrick Rangers (Saturday, 15:00 GMT, coverage on Sportsound on BBC Sounds and BBC Radio Ulster)\nIt will be a difficult trip to Ferney Park for Carrick Rangers. A good cup run is very possible, given the quality and experience they have backing their side, but I won't expect them to have it easy.\nPrediction: 0-1\nDungannon Swifts v Coleraine (Saturday, 15:00 GMT, coverage on Sportsound on BBC Sounds and BBC Radio Ulster)\nBack-to-back fixtures are always difficult to call, especially following last week's 1-1 draw [in the Irish Premiership], with a last-minute Coleraine equaliser. Dungannon are the Premiership's surprise package of the year, with underrated quality throughout. Both sides tasted regional trophy success as of late and it'll be a difficult one to call. This one could go either way.\nPrediction: 2-1\nDollingstown v Loughgall (Saturday, 15:00 GMT, coverage on Sportsound on BBC Sounds and BBC Radio Ulster)\nA capable Dollingstown team, who will be hoping to secure promotion to the Championship. Loughgall were unfortunate not to get a result against the Glens [in the Irish Premiership] and now have a welcome distraction from their league campaign. It will be interesting to see how they cope with having the favourites tag.\nPrediction: 2-1\nCrusaders v Limavady United (Saturday, 15:00 GMT, coverage on Sportsound on BBC Sounds and BBC Radio Ulster)\nHaving knocked out Larne and being well placed in the Championship, this experienced Limavady side have every chance to shock Crusaders, however, I think the Crues, with the home advantage, will be in the hat for the next round.\nPrediction: 2-0\nCliftonville v Glenavon (Saturday, 15:00 GMT, coverage on Sportsound on BBC Sounds and BBC Radio Ulster)\nCliftonville have won one of their previous league fixtures. A side littered with talent, and they are the cup holders, however Glenavon are on the crest of a wave with four consecutive wins. A tough challenge at Solitude, but I think Glenavon will take the win.\nPrediction: 0-1\nBangor v Annagh United (Saturday, 15:00 GMT, coverage on Sportsound on BBC Sounds and BBC Radio Ulster)\nTwo sides that have a real expectation of promotion to the Premiership and are enjoying impressive league campaigns. Annagh have shown confidence in the last three league outings, however, I think Bangor will take it with a late winner.\nPrediction: 3-2\nMoyola Park v Ards (Saturday, 15:00 GMT, coverage on Sportsound on BBC Sounds and BBC Radio Ulster)\nBoth sides are showing inconsistent form, however, I think the Championship side will progress in the cup.\nPrediction: 1-2", "url": "https://www.bbc.com/sport/articles/cgly6drp86po"}