{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:28:15", "date_modify": "2025-05-21 05:28:15", "date_publish": "2025-04-03 10:34:34", "description": "Celtic Q&A: Will Rodgers extend stay? Should club re-sign O'Riley & Kyogo?", "filename": "sport_articles_cj0zjqdl55no_1747805295.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2f70/live/b39028c0-1076-11f0-ba12-8d27eb561761.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cj0zjqdl55no_1747805295.html", "title": "Celtic Q&A: Will Rodgers extend stay? Should club re-sign O'Riley & Kyogo?", "title_page": "Celtic Q&A: Will Rodgers extend stay? Should club re-sign O'Riley & Kyogo?  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "BBC Sport Scotland reporter Kheredine Idessane has been answering some of your questions on Celtic.\nPrentice asked: Do you think Brendan Rodgers will extend his contract this summer?\nKheredine answered: Yes, but on one condition. He'll have to be satisfied that the board continue to back his European ambitions.\nThe Parkhead money men loosened the purse strings last summer to pay for Adam Idah, Arne Engels and Auston Trusty. Largely offset, of course, by the sale of Matt O'Riley.\nJeffrey Schlupp and Jota arrived in January, but Rodgers was disappointed another striker wasn't brought in to replace Kyogo Furuhashi, even although Daizen Maeda has more than filled the gap in that sense.\nCeltic have to qualify for next season's Champions League, which means the transfer business will have to be done sharp in the summer.\nIf Rodgers doesn't feel comfortable with the quality, or speed, of the summer signings, that may well determine how long he sees himself at Celtic Park going forward.\nPeter asked: Should Celtic try to resign Matt O'Riley and Kyogo? Neither are getting game time with new clubs and could be bought for a fraction of the price we sold them, just like Jota.\nKheredine answered: There's little doubt Celtic would have both of them back, and in a heartbeat. The issue would more lie with the players themselves and whether they see a return to Scotland as the next step in their careers.\nKyogo left to try to get the attention of his national manager before next year's World Cup, feeling that the Scottish Premiership wasn't giving him enough of a platform.\nOdd, given two of his former Celtic team-mates - Maeda and Reo Hatate - have been in Japan squads. He also won't make any impression from the Rennes bench.\nO'Riley wanted to test himself in England's top flight, for which his all-round game and temperament seemed a natural fit.\nEarly injury cut his chances to impress at Brighton, and if he does move somewhere I suspect it may be on loan.\nI think O'Riley would far rather fight for his place at Brighton or move to another club in England or abroad.", "url": "https://www.bbc.com/sport/articles/cj0zjqdl55no"}