{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:43:20", "date_modify": "2025-05-21 03:43:20", "date_publish": "2025-01-08 09:43:19", "description": "England could be without Immanuel Feyi-Waboso for the Six Nations if Exeter wing opts for surgery on his shoulder.", "filename": "sport_rugby-union_articles_c77j2k5nezxo_1747799000.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/056e/live/ce316e80-ccf3-11ef-87df-d575b9a434a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c77j2k5nezxo_1747799000.html", "title": "Immanuel Feyi-Waboso: England wing could be ruled out of Six Nations", "title_page": "Immanuel Feyi-Waboso: England wing could be ruled out of Six Nations - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England could be without wing Immanuel Feyi-Waboso for the entire Six Nations as the Exeter star decides whether to undergo shoulder surgery.\nThe 22-year-old dislocated his shoulder in the defeat by Sale on 21 December, with Chiefs coach Rob Baxter warning at the time the injury was \"not ideal for ourselves or for England\".\nBaxter says the winger has surgery booked in for early next week, should he decide to undergo the procedure.\nIf Feyi-Waboso does have an operation he will miss all of the Six Nations, whereas if he opts not to have surgery, he could potentially participate in the final part of the tournament.\n\"It's an ongoing process at the moment involving Manny, our medical team and the England medical team,\" Baxter told BBC Radio Devon.\n\"The shoulder isn't going to rehab for the full Six Nations campaign. England go off into camp in not very long.\n\"He's barely started his rehab process really as the to-ing and fro-ing over whether he has his rehab is slowing both options down - it's slowing the operation process and the rehab process.\n\"The big thing at the minute is the decision will be made. It can go one way or the other and that will give him a clear reference point for what he is aiming for. Is it the end of the England Six Nations campaign? Or is it post-Six Nations, getting ready for a big end to the season that will help him drive his claim for the Lions if that's a possibility?\"\nEngland begin their Six Nations campaign against Ireland in Dublin on 1 February and end it with a trip to Cardiff to face Wales on 15 March.\nFeyi-Waboso's injury is one of the first for an England player since new contracts were brought in between the Rugby Football Union and Premiership clubs.\nThe winger is on an enhanced elite player squad contract, giving England the final say on when he plays and greater influence on medical matters under the new eight-year Professional Game Partnership between the RFU and top-tier clubs.\nBaxter says the decision on whether to operate or not is slower than it would have been had it been down solely to England.\n\"I think it certainly would have happened quicker, without doubt,\" he said.\n\"We had things booked, ready to go, decisions ready to be made a week ago. The process you have to go through now has certainly slowed things down.\n\"That doesn't mean, necessarily, that it's wrong, but it certainly slows things down.\"\nClub and country team-mate Henry Slade played through a shoulder injury last season, opting to have an operation after it worsened during England's summer tour of New Zealand.\nFeyi-Waboso's absence for at least the opening rounds of the Six Nations leaves England looking at alternatives in the back three with full-back George Furbank still recovering from a broken arm that is likely to rule him out of their tournament opener against Ireland at least.\nNorthampton's Ollie Sleightholme, who started against South Africa and Japan in the autumn after Feyi-Waboso suffered a concussion, could step in once again, with Sale's Tom Roebuck and Harlequins' Cadan Murley, who scored two tries in England A's win over second-string Australia side in November, also in contention.\nBristol's Gabriel Ibitoye, who is joint top of the Premiership's try-scoring charts, is out of action with a leg injury.\nFeyi-Waboso, who was nominated as World Rugby's breakthrough player of 2024, has scored five tries in eight Tests since making his England debut as a replacement against Italy last February.\nThe former Wales age-grade international, who was born in Cardiff but qualifies for England through family ties, has been touted for selection for the British and Irish Lions tour to Australia this summer.", "url": "https://www.bbc.com/sport/rugby-union/articles/c77j2k5nezxo"}