{"authors": ["Chris Bertram", "www.facebook.com"], "date_download": "2025-05-21 04:50:45", "date_modify": "2025-05-21 04:50:45", "date_publish": "2025-01-23 13:01:20", "description": "The Old Course is confirmed as the host of the Open Championship in 2027, 100 years after Bobby Jones' win in St Andrews.", "filename": "sport_golf_articles_ceve4rjedpdo_1747803045.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3dbd/live/4c271b40-d97f-11ef-ba6a-b744abd00a0a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_golf_articles_ceve4rjedpdo_1747803045.html", "title": "The Open: St Andrews Old Course to host in 2027", "title_page": "The Open: St Andrews Old Course to host in 2027 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The Old Course at St Andrews has been confirmed as the host of the Open Championship in 2027.\nThe announcement by the R&A maintains the five-year cycle the Old Course has had, with just one exception, since 1990.\nRoyal St George's was awarded the 2020 Open so the Old Course - widely regarded as the Home of Golf - could stage the 150th edition of the game's oldest major the following year.\nHowever, the Covid-19 pandemic meant the Claret Jug was contested on the Kent coast in 2021 before the championship returned to Fife in 2022.\nThat was the 30th time St Andrews had been the host - comfortably ahead of Prestwick with 24 - since it first did so in 1873.\nThe 2027 championship - from 15 to 18 July - will be the 100th anniversary of the great Bobby Jones' victory in The Open at St Andrews, where six years earlier he had torn up his scorecard after taking four shots to escape from a bunker on the 11th.\nFor the R&A to return The Open to St Andrews to the regular slot of years ending in a 5 or 0, as it had had since 1990, it would have had to host either just three years after it last did so - or seven.\nInstead the governing body has opted to retain the five-year cycle and awarded St Andrews the 155th Open, meaning it is also poised to host in 2032 and 2037.\n\"I'm looking forward to The Open's return to St Andrews every bit as much as the fans and the players,\" said new R&A chief executive Mark Darbon.\n\"There is something incredibly special about The Open being played on the Old Course and so many of the great champions have walked these fairways since the first staging.\n\"St Andrews generates a unique atmosphere for the fans and the players as well as providing an amazing spectacle on television and digitally for millions of viewers around the world.\"\nCameron Smith pipped Cameron Young and Rory McIlroy to the 150th Open title at St Andrews in 2022, when record crowds of 290,000 attended.\nThe compact course is not a natural venue for the huge championship The Open has become, but Jack Nicklaus - who like Tiger Woods has twice won the Claret Jug over the Old Course - said of it: \"If you're going to be a player that's remembered, you must win at St Andrews.\"\nRoyal Portrush in Northern Ireland will hold this year's championship with Royal Birkdale in Southport the stage in 2026.", "url": "https://www.bbc.com/sport/golf/articles/ceve4rjedpdo"}