{"authors": ["Adam Blackmore", "www.facebook.com"], "date_download": "2025-05-21 05:50:18", "date_modify": "2025-05-21 05:50:18", "date_publish": "2025-04-02 10:25:23", "description": "Southampton Q&A: Favourite Saints player and game", "filename": "sport_football_articles_c78jd96ne93o_1747806618.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/231a/live/4c6eb390-777f-11ef-b282-4535eb84fe4b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c78jd96ne93o_1747806618.html", "title": "Southampton Q&A: Favourite Saints player and game", "title_page": "Southampton Q&A: Favourite Saints player and game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "In the final part of our special Q&A with BBC Radio Solent's Adam Blackmore, he chats about his favourite current and former Southampton players and his favourite Saints moments throughout the years.\nChris asked: Have you got a favourite Saints player? Not necessarily the best - just someone you think sums up all that is good about the club?\nAdam answered: My favourite players of the current squad are Adam Lallana and Will Smallbone; Adam, because we have known each other so long and I love his attitude to the game and how he made the best of every bit of ability he has had, and Will because he is also homegrown and is a misunderstood player with a lot of ability. He is also a really good guy who has come through a lot in life and his career.\nMy favourite players of my two decades watching Saints are Rickie Lambert and Morgan Schneiderlin - two people I have a lot of time for and two I would consider good professional friends. Also, for his ability and for the role he played in a great team and period for the club, Sadio Mane.\nRob asked: It has been a shocker of a season so to cheer us up - outside of Wembley and West Bromwich Albion, tell us of a couple of games across the years that you fondly remember from your seat in the commentary box (Ronald Koeman running down the touchline, perhaps?)\nAdam answered: Hi Rob, I think the ones that got me euphoric in commentary have to stand out - League Cup semi-final at Liverpool, last season's Wembley play-off final and beating Inter Milan all stand out, as well as the day we all had at home to Coventry with promotion back to the Premier League achieved – all wonderful memories.\nCommentating on the fastest Premier League hat-trick ever also stands out and the fastest-ever goal in the Premier League - they are lovely archive moments for me personally to have experienced and created the archive sound for.", "url": "https://www.bbc.com/sport/football/articles/c78jd96ne93o"}