{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:32:08", "date_modify": "2025-04-26 06:32:08", "date_publish": "2025-02-27 08:31:08", "description": "The FA Cup fifth round takes place across four days as 16 teams battle for a place in the quarter-finals of the competition.", "filename": "sport_football_articles_cj0q8g8nd6do_1745649128.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/645b/live/40bfcfb0-ef71-11ef-a319-fb4e7360c4ec.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cj0q8g8nd6do_1745649128.html", "title": "FA Cup fifth round: Fixtures, TV coverage, how to follow on BBC and semi-automated offsides", "title_page": "FA Cup fifth round: Fixtures, TV coverage, how to follow on BBC and semi-automated offsides - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The FA Cup is down to the last 16 teams, with eight ties across four days which will see the video assistant referee (VAR) - as well as new offside technology - introduced at this stage.\nThe fifth round starts on Friday when Aston Villa - without a major trophy since 1996 - host Championship strugglers Cardiff City (20:00 GMT) for a place in the quarter-finals.\nThere are four ties on Saturday, including Championship club Plymouth Argyle - who upset Liverpool in the fourth round - at Manchester City (17:45).\nHolders Manchester United are at home to Fulham on Sunday (16:30) in one of three games being shown live on BBC platforms.\nThe eighth and final tie of the round sees Nottingham Forest play Ipswich Town at the City Ground on Monday (19:30).\nAll the games will be decided on the day.\nIf scores are level after 90 minutes then extra time will be played, with a penalty shootout to follow if the teams still cannot be separated.\nBBC Sport will have coverage of all eight ties.\nThe final takes place at Wembley on Saturday, 17 May.\nWith no VAR in operation, there were several controversial moments in the last round - not least when Manchester United's Harry Maguire headed an injury-time winner to seal a 2-1 win against Leicester City.\nMaguire appeared to be offside when Bruno Fernandes sent a free-kick towards the back post but the goal stood - and Leicester went out.\nEven United boss Ruben Amorim admitted his team's winning goal should not have stood.\nHowever, VAR will be introduced - as planned - from the fifth round onwards., external\nIt will be active across all eight ties including at Deepdale, where Preston host Championship rivals Burnley on Saturday.\nThis will include in-stadium VAR announcements, where match officials will announce their final decision in relation to reviewed incidents to provide \"improved clarity and understanding\" for fans and viewers.\nSemi-automated offside technology will also be used in all seven matches taking place at Premier League grounds.\nIt is the first time it will be used live in competitive matches in English football.\nThe system aims to remove some elements of human subjectivity by replacing decisions made by officials with automated ones taken by technology.\nIf successful, the Premier League will look to implement the technology before the end of this season.", "url": "https://www.bbc.co.uk/sport/football/articles/cj0q8g8nd6do"}