{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:33:37", "date_modify": "2025-05-20 14:33:37", "date_publish": "2023-07-28 17:55:24", "description": "Wales are left to rue a slow start to their Netball World Cup opener as they lose 61-50 to hosts South Africa.", "filename": "sport_netball_66340363_1747751617.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/14813/production/_130578938_gettyimages-1560219453.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_netball_66340363_1747751617.html", "title": "Netball World Cup 2023: South Africa 61-50 Wales", "title_page": "Netball World Cup 2023: South Africa 61-50 Wales - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wales suffered a frustrating opening to their Netball World Cup campaign as they lost 61-50 to hosts South Africa.\nThe Proteas, who are largely fully professional, leapt into a 18-9 lead in a physical first quarter in Cape Town against their part-time opponents.\nWelsh Feathers rallied in the second but still trailed 32-24 at half-time.\nSouth Africa edged further ahead to lead 47-37 going into the final quarter and finished strongly to win by an 11-point margin.\nWelsh Feathers coach Emily Handyside will rue the slow start that allowed South Africa to grab a commanding lead that they never relinquished, but will be encouraged by her side matching the Proteas from then on.\nWales confirmed their place at the tournament, qualifying for their first World Cup since 2015, with an unbeaten European qualifying campaign.\nThey next face Commonwealth Games silver medallists Jamaica on Saturday at 10:00 BST, before playing Sri Lanka at 08:00 BST on Sunday, 30 July in their final Group C match.\nWales captain Nia Jones on SABC: \"To be honest, the first quarter is what separated us in the end.\n\"We were really close, we won the second quarter which we were really happy with but it's just about keeping the score competitive at times.\n\"I think we've got loads of positives we can take into Jamaica tomorrow, but what an honour to play in this opening match against a team like South Africa, and we can take huge confidence from the long periods in that game where we were really competitive.\"", "url": "https://www.bbc.com/sport/netball/66340363"}