{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:21:40", "date_modify": "2025-04-26 04:21:40", "date_publish": "2025-03-03 14:26:12", "description": "Rangers 2-2 Hearts: What they said", "filename": "sport_articles_cp3yqxwnjx9o_1745641300.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9f57/live/6790b370-f83b-11ef-9241-f1bc6b2390b0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cp3yqxwnjx9o_1745641300.html", "title": "Rangers 2-2 Hearts: What they said", "title_page": "Rangers 2-2 Hearts: What they said - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Hearts manager Eva Olid: \"We started really, really good and we had to take that momentum to score more goals, we were really good in the first half in terms of energy.\nThe second half, we were good in the build up, but in final third, we missed that energy that we had in the first half.\n\"It's what happens with these teams, they change what they did and changed the match.\n\"We will try to win every match, and I think that we will get points against top teams in the last matches. We have a bigger squad. We have 21 players fit. We can rotate, and that will help us for this congestive end of the season.\"\nRangers manager Jo Potter: \"It's tough because after 45 minutes I'd have taken a draw, at the end of that we were well out of it, we weren't ourselves at all. You're looking to climb a mountain being 2-0 down against a decent Hearts team, at that point I'd have taken a point.\n\"But towards the end of the game, when you're pressing and you're on the ascendancy, you will feel a little bit aggrieved and the players do as well with their performance levels, but I'm hoping that's going to be a good point come the end of the season.\n\"Teams are going to come and do that to us, but we've got to be better at handling that situation, we should want teams to come and press us and be able to accept that pressure and break lines and be brave enough.\"", "url": "https://www.bbc.co.uk/sport/articles/cp3yqxwnjx9o"}