{"authors": ["Bobbie Jackson", "www.facebook.com"], "date_download": "2025-05-21 06:14:00", "date_modify": "2025-05-21 06:14:00", "date_publish": "2025-01-04 17:43:19", "description": "Analysis: Crystal Palace 1-1 Chelsea", "filename": "sport_football_articles_czjdzj42mdlo_1747808040.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3b77/live/038f16b0-cac2-11ef-bb47-87a9dea68aa1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_czjdzj42mdlo_1747808040.html", "title": "Analysis: Crystal Palace 1-1 Chelsea", "title_page": "Analysis: Crystal Palace 1-1 Chelsea - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Just a matter of weeks ago Chelsea were being touted as potential rivals to Liverpool in the Premier League title race, however, a disappointing end to 2024 and a sluggish start to 2025 has seen them fall well off the pace.\nEager to halt a three-game winless run - two defeats and a draw - Chelsea started positively at Crystal Palace with Cole Palmer finding the breakthrough after some fine work from Jadon Sancho to lay on the assist.\nIt felt inevitable that they would grab a second and maybe even a third or fourth as the chances continued to flow.\nHowever, Nicolas Jackson, Sancho, Enzo Fernandez, Moises Caicedo and Josh Acheampong all failed to take their opportunities leaving Chelsea with just a slim 1-0 lead at the break.\nPalace were vastly improved for the second period, limiting Chelsea's sight at goal and starting to create chances of their own.\nEberechi Eze gave the Blues a warning just four minutes after the restart when he dragged his effort wide and the game became a more open affair in the aftermath.\nDespite being one of the most potent sides in the division - only Liverpool and Tottenham have scored more than Chelsea's 39 - they just couldn't apply the required finishing touch.\nChelsea were punished in the closing stages when Jean-Philippe Mateta popped up with the equaliser.\nThe draw leaves Chelsea nine points adrift of Liverpool, who have a game in hand, and means they now need to adjust their goals to battling for a top four spot.", "url": "https://www.bbc.com/sport/football/articles/czjdzj42mdlo"}