{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:38:22", "date_modify": "2025-05-20 14:38:22", "date_publish": "2023-07-28 12:27:25", "description": "No play is possible on the final two days at Scarborough as Yorkshire's Championship game with Durham is abandoned as a draw.", "filename": "sport_cricket_66324525_1747751902.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1ABF/production/_130574860_shutterstock_editorial_14023981g.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66324525_1747751902.html", "title": "County Championship: Wet outfield ends Yorkshire game against Durham as draw", "title_page": "County Championship: Wet outfield ends Yorkshire game against Durham as draw - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The final day of the County Championship match between Yorkshire and Division Two leaders Durham at Scarborough was abandoned due to a wet outfield, resulting in a draw.\nDay three was called off for the same reason before heavy afternoon and early evening rain left the ground awash with puddles.\nUmpires Steve O'Shaughnessy - who has recovered from a bout of sickness which ruled him out of standing on day three - and Surendiran Shanmugam inspected the outfield on Friday morning.\nThey called for further inspections at 12:00pm and then again at 1:00pm before calling the game off.\nDurham had been due to resume on 106-1 in their first-innings, with Alex Lees 65 not out, replying to Yorkshire's 340 all out.\nInstead, the runaway leaders had to settle for eight points, one more than the home side.\nThe next round of Championship matches starts on 3 September when Yorkshire will host Derbyshire at North Marine Road, while Durham take on Sussex at the Riverside.\nYorkshire head coach Ottis Gibson:\n\"The frustration continues. I don't know what other words I can use to describe another rain-affected game. It's disappointing.\n\"We enjoy coming to Scarborough. It's one of the best pitches in the country, and Yorkshire now has the two best pitches in the country - Headingley and Scarborough.\n\"Batters like to bat here and bowlers see the ball carrying through nicely. Unfortunately we can't flick a switch and sort the weather out.\n\"Adam Lyth got another hundred. He thinks we should be playing all our games at Scarborough so he can get a hundred every game\"\nCoach Ryan Campbell told BBC Radio Newcastle:\n\"It's disappointing isn't it? I am new to all of this, but when you play at an out ground like Scarborough and you take cricket to the people, you want to play and put on a good show.\n\"Unfortunately the ground copped so much water...it is not surprising we couldn't get back out there. It's not that it was wet on top, it was soft and moving around under foot. We were batting so it wasn't an issue for us, but you don't want players getting injured.\n\"There's not much we can do about that, but this season we have dominated the competition so far and put ourselves in a position where, come September, we have such a lead, the rest are going to have to try and catch us.\"\nReport supplied by ECB Reporters' Network.", "url": "https://www.bbc.com/sport/cricket/66324525"}