{"authors": ["Jess Anderson", "www.facebook.com"], "date_download": "2025-05-20 14:58:54", "date_modify": "2025-05-20 14:58:54", "date_publish": "2023-07-27 05:35:46", "description": "As South Africa prepares to become the first African nation to host the Netball World Cup, shooter Lenize Potgieter tells BBC Sport what to expect.", "filename": "sport_netball_66289279_1747753134.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/B451/production/_130516164_gettyimages-1162615858.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_netball_66289279_1747753134.html", "title": "Netball World Cup 2023: South Africa ready to 'showcase' historic tournament", "title_page": "Netball World Cup 2023: South Africa ready to 'showcase' historic tournament - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "\"Chanting, feet stomping, drums, vuvuzelas, yelling, shouting, singing, dancing - a whole other level of loudness.\"\nThat is what South Africa shooter Lenize Potgieter says people can expect when the Netball World Cup begins on African soil for the first time on Friday.\nCountries from the continent have long competed at netball's top tournament, as well as Commonwealth Games - the other pinnacle event in the sport - but South Africa will make history in Cape Town when it hosts the 16th edition of the World Cup.\nPotgieter says now \"the time is right\" for her country to host the tournament.\n\"It's about making it known - for netball in South Africa to get out there to showcase what we have,\" the 29-year-old told BBC Sport.\n\"This World Cup is a great stepping stone to show that we can host, we are a great team, we do have the facilities, we do have the resources - it's just being given the chance to believe in us as well.\"\nIt means the tournament will have been hosted on every continent and when the host nation was announced in 2019, Netball South Africa chief executive Blanche de la Guerre said she hoped it would drive participation in netball and help to contribute positively to wider social issues.\n\"Hosting this World Cup will make more young girls in our country participate in the sport, especially young girls from the working class backgrounds,\" she said.\nSouth Africa have skirted around the periphery of the best netball teams in the world for many years but since prestigious Australian coach Norma Plummer took to the helm a decade ago the team have made strides towards netball powerhouses Australia, New Zealand, Jamaica and England.\n\"Now that we're competing with the best in the world, people notice us and that's the great thing about this timing,\" said Potgieter, who has 89 caps and will be playing in her third World Cup.\n\"If the country itself is not as good at netball, you won't get the fans or the spectators because they don't really know about it.\n\"The last World Cup we were fourth which was the best in 25 years and now everyone is looking forward to us getting a medal at this one. The eyes are on us finally.\"\nThe Proteas, who are still searching for their first World Cup podium since 1995 when they were runners-up, arrived in Cape Town earlier this month to begin their preparations and Potgieter says World Cup fever is starting to take hold of the city.\n\"It's started getting noisier with more people and the fan parks are built around the hotel and near the stadium,\" she said.\n\"The vibe is picking up every day and people all over the country have been messaging us and sending us videos saying how excited they are for the World Cup to be in South Africa.\n\"It's also very good for our economy and tourism - Cape Town is a beautiful part of the country. It's so pretty, it's clean, it's green. It is one of the most beautiful parts of southern Africa so people are in for a real treat.\"\nSouth Africa sit fifth in the world rankings but, boosted by a home crowd, the Proteas are expecting to put on a show and Potgieter says African crowds are unlike anything other nations are used to.\n\"We are used to playing in England and Australia where it's all claps and 'go girls, well done!' - those crowds are not used to this kind of African vibe,\" said Potgieter, who plays for Manchester Thunder.\nCape Town hosted the Quad Series in January as a warm-up to this summer's showpiece and Potgieter said teams had a taste of what was to come.\n\"There wasn't a lot of spectators but there was still a lot of noise and we were just like 'welcome to Africa - this is us',\" she said.\n\"I'm excited for people to experience that because I feel - and I'm probably biased - South Africa and Africa has the best spirit of all the countries.\n\"I don't know why but we just have that African spirit that binds us together. We're also so diverse we have togetherness and sisterhood - we just have that spirit within us, that brave spirit, that don't-give-up spirit.\"\nSouth Africa will take on Wales in their opening Pool C match on Friday at the Cape Town International Convention Centre and De la Guerre told South African radio station Cape Talk all tickets for the home nation's matches are sold out.\n\"Australia, New Zealand, England and Jamaica are [also] very popular,\" she added.", "url": "https://www.bbc.com/sport/netball/66289279"}