{"authors": ["Andy Gray", "www.facebook.com"], "date_download": "2025-05-21 04:20:16", "date_modify": "2025-05-21 04:20:16", "date_publish": "2025-04-05 14:41:08", "description": "Linfield lift the Gibson Cup for a record-extending 57th time after defeating rivals Glentoran 2-1 in the Irish Premiership at Windsor Park.", "filename": "sport_football_articles_clywkydke30o_1747801216.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/bac0/live/f88c2340-122c-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_clywkydke30o_1747801216.html", "title": "Linfield lift Irish Premiership: Blues celebrate title after Glentoran win", "title_page": "Linfield lift Irish Premiership: Blues celebrate title after Glentoran win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Linfield have lifted the Gibson Cup for a record-extending 57th time after defeating Glentoran 2-1 at Windsor Park.\nDavid Healy's side had secured the Irish Premiership title in March and, knowing a trophy presentation was to come, could enjoy the occasion against their fierce rivals.\nKirk Millar struck a first-half winner for Linfield after Jordan Jenkins had cancelled out Callumn Morrison's opener for the hosts.\nCaptain Jamie Mulgrew, himself winning his 11th Irish Premiership title, lifted the Gibson Cup as thousands of Linfield supporters enjoyed the celebrations at a sun-soaked Windsor Park.\n\"I'm full of adrenaline and emotion, it was a great day,\" Healy told BBC Sport NI.\n\"Our performance levels were pretty good and Glentoran made us work for it. All in all, the players and staff have been incredible this year. It's been hugely challenging, but I'm so pleased for them.\n\"The manner in which we won it this year was incredible. I couldn't be more proud of the players and the staff.\"\nIt has been a remarkable league campaign for Linfield, who ended Larne's two-year stint as champions in emphatic fashion.\nAs their rivals faltered, Linfield consistently collected points and became the first team to seal the title before the split - which occurs with five matches remaining.\nThe victory over Glentoran, who were unbeaten against the Blues this season in five outings, was the icing on the cake.\nIn a frantic first half, Morrison opened the scoring as he squeezed an effort past Glens goalkeeper Daniel Gyollai in the ninth minute, but Declan Devine's side hit back when Jordan Jenkins fired home in the 22nd minute.\nHowever, Linfield stalwart Millar restored Linfield's lead on the half-hour and the hosts, who spurned chances to extend their lead after the break, never looked back.\nSuch was their dominance, Linfield's lead at the full-time whistle over Glentoran stood at a mammoth 25 points.\nIt is a 57th Gibson Cup for Linfield, and no team has won their domestic league more times in world football than the Blues.", "url": "https://www.bbc.com/sport/football/articles/clywkydke30o"}