{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:35:17", "date_modify": "2025-05-21 06:35:17", "date_publish": "2025-01-31 08:47:16", "description": "Tottenham 3-0 Elfsborg: Fan views on Europa League game", "filename": "sport_football_articles_c8r530vekl4o_1747809317.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c8r530vekl4o_1747809317.html", "title": "Tottenham 3-0 Elfsborg: Fan views on Europa League game", "title_page": "Tottenham 3-0 Elfsborg: Fan views on Europa League game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your thoughts after Thursday's Europa League game between Tottenham and Elfsborg.\nHere are some of your comments:\nWilliam: That was so much more like it from Spurs! It was great to see three academy players make their mark, and potentially we have a new plan going forward with Dejan Kulusevski playing off the striker rather than on the wing. After a difficult season. Hopefully, the future is bright!\nEmma: It was very obvious the team were playing with fear. They had nothing in the locker to break the opposition down, who had a low block defensively. The young substitutes came on and played without fear. They brought life into a very dull game and got the crowd singing, as it felt like no one was in the stadium at times. They need to be better in the next round, but they got the job done eventually and that's all you can ask for.\nIan: I think Ange Postecoglou should be far more positive in his demeanour. Instead of complaining about injuries, he should be saying: \"These kids are the future - I wouldn't be picking them if they weren't good enough.\" He should be encouraging the crowd to get behind the kids and stop protesting. The negative atmosphere achieves nothing.\nDaz: And they say \"you can't win anything with kids\"...\nGeorge: Micky van de Ven is irreplaceable. It is so good to see him playing again and making a huge difference to the team.", "url": "https://www.bbc.com/sport/football/articles/c8r530vekl4o"}