{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:38:55", "date_modify": "2025-05-19 15:38:55", "date_publish": "2017-07-17 11:16:39", "description": "Four-time Olympic silver medallist Frankie Fredericks is suspended from athletics pending an ethics investigation.", "filename": "sport_athletics_40632465_1747669135.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1050B/production/_96972866_fredericks1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_athletics_40632465_1747669135.html", "title": "Frankie Fredericks: IAAF council member suspended pending ethics investigation", "title_page": "Frankie Fredericks: IAAF council member suspended pending ethics investigation - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "IAAF council member Frankie Fredericks has been provisionally suspended from athletics pending an investigation into a potential ethics violation, the sport's governing body said on Monday.\nThe Namibian is being investigated by the Athletics Integrity Unit (AIU) over payments he received from Papa Massata Diack, the son of ex-IAAF president Lamine Diack.\nIn March, French newspaper Le Monde claimed, external former sprinter Fredericks received a payment days before voting on the 2016 Olympics host city.\nThe four-time Olympic silver medallist says the payment was legitimate and related to his role in the promoting of several athletics events.\nHe told told Le Monde the payment had \"nothing whatsoever to do with the Olympic games\".\nFredericks stepped down from two key administrative roles in March following the accusations.\nHe quit as head of the evaluation commission for the 2024 Olympics, and left a taskforce helping Russia return to international competition.\nAs head of the IOC evaluation commission, Fredericks was to lead an inspection visit to 2024 candidate cities Los Angeles and Paris.\nIn his written judgement, the chairman of the IAAF Disciplinary Tribunal, Michael J Beloff, said Fredericks' suspension was not a presumption of guilt.", "url": "https://www.bbc.com/sport/athletics/40632465"}