{"authors": ["Bobbie Jackson", "www.facebook.com"], "date_download": "2025-05-20 14:18:56", "date_modify": "2025-05-20 14:18:56", "date_publish": "2023-07-30 06:05:11", "description": "Justin Gaethje stakes a claim for a lightweight title shot as he beats Dustin Poirier to win the symbolic BMF title in Salt Lake City.", "filename": "sport_mixed-martial-arts_66352444_1747750736.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1459E/production/_130585338_gettyimages-1579866598.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_mixed-martial-arts_66352444_1747750736.html", "title": "UFC 291: Justin Gaethje beats Dustin Poirier to stake lightweight title shot claim", "title_page": "UFC 291: Justin Gaethje beats Dustin Poirier to stake lightweight title shot claim - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Justin Gaethje beat Dustin Poirier by knockout to win the symbolic BMF title at UFC 291 in Salt Lake City, Utah - staking a claim for a shot at the lightweight belt.\nGaethje is the second winner of the BMF title and was handed the belt by former champion Jorge Masvidal.\nThe 34-year-old landed a right high-kick on Poirier, 34, to seal victory after one minute of the second round.\n\"I want to fight for the [lightweight] championship,\" Gaethje said.\n\"These guys are fighting in October and I want my chance. Win, lose or draw I'm going to give everything.\"\nLightweight champion Islam Makhachev makes the second defence of his title against Charles Oliveira at UFC 294 in Abu Dhabi on 21 October.\nFormer interim lightweight champion Gaethje - who has 25 wins from 29 fights, with 20 coming by knockout - could be given the chance to face the winner.\nGaethje lost to Poirier via a fourth-round TKO in 2018 but has vastly improved since that defeat and looked full of confidence at Delta Center.\nThe opening round was full off intensity, ensuring the bout lived up to its billing as Gaethje and Poirier landed some solid combinations.\nThat tempo continued in round two as chants for both fighters rang around the arena.\nWith one minute ticking over on the clock and in a manner reminiscent of Leon Edwards' victory against Kamaru Usman for the welterweight title at UFC 278 at the same venue, Gaethje landed a perfectly timed high-kick to drop Poirier to the canvas.\nPoirier was out cold as referee Herb Dean jumped in to prevent any further damage and Gaethje was soon back-flipping off the top of the octagon.\nGaethje said: \"I've never thrown it once [the head kick].\n\"Unlike any other sport on earth you rarely get a chance at redemption. When we take a loss you have to go home and sit with it. It eats away at us, so to come back and prove myself is great.\n\"Dustin [Poirier] is one of the greatest fighters on earth and I thank god I came out on the right side this time.\"\nIn the co-main event, Alex Pereira beat Jan Blachowicz by split decision on his light heavyweight debut to put himself in contention to fight for the vacant title.\nBlachowicz, 40, secured a takedown in the opening 30 seconds and, after taking Pereira's back and sinking in a body triangle, he went hunting for the neck.\nBut Pereira hung in, fighting the hands to defend several submission attempts and managing to see out the round without taking too much damage.\nPoland's Blachowicz, who drew with Magomed Ankalaev for the vacant light heavyweight title last time at UFC 282, looked out on his feet when round two began and was possibly affected by the altitude of Salt Lake City sitting 4,330 feet above sea level.\nFormer middleweight champion Pereira, 36, started to settle into his rhythm, landing some nasty leg kicks and finding his range with the hands.\nThe Brazilian, who weighed-in at 205.5lb but had swelled to north of 225lb by the time he stepped into the octagon, still looked fresh in the final round, defending takedowns and timing his shots to perfection.\nPereira said: \"It was a very hard fight but I think I was able to show you some of my ground game. Be patient with me because there is a lot more to come.\n\"My focus is always the belt. We've had conversations before about the belt and now I want to fight for it.\"\nThe \"business\" Pereira speaks of relates to middleweight champion Israel Adesanya, who beat Pereira to reclaim the title at UFC 287.\nFor now, it appears his focus is on becoming a two-weight UFC champion, with his sights set on the vacant light heavyweight title.\nJamahal Hill vacated the belt on 14 July to have surgery on an Achilles injury and Pereira could be in line to face former champion Jiri Prochazka.", "url": "https://www.bbc.com/sport/mixed-martial-arts/66352444"}