{"authors": ["Paul McNicoll", "www.facebook.com"], "date_download": "2025-05-21 06:11:52", "date_modify": "2025-05-21 06:11:52", "date_publish": "2025-04-01 12:52:04", "description": "Dundee Utd fan voice: 'Tough call' to make over 'puppetmaster' Ross Docherty contract", "filename": "sport_articles_cp8vl28q4yro_1747807912.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1dad/live/cc4211e0-0eef-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cp8vl28q4yro_1747807912.html", "title": "Dundee Utd fan voice: 'Tough call' to make over 'puppetmaster' Ross Docherty contract", "title_page": "Dundee Utd fan voice: 'Tough call' to make over 'puppetmaster' Ross Docherty contract - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A Sunday drive to Dingwall isn't the worst fate in the world, but let's be honest, Saturday would have been better. At least for a football fan like me.\nWhy the TV schedulers thought Ross County v Dundee United deserved the live treatment, I'll never know. But off I went.\nI won't say the first half was dreadful, but if it was your introduction to football, you'd probably find a new hobby.\nThe second half, however, was a different story, at least for United fans. We were the better team, secured all three points, and put ourselves on the brink of cementing a top-six spot.\nAfter the horror show that was the Dundee derby, I'd been mentally preparing for the worst. It felt like a must-win up in Dingwall, or the season might unravel faster than my willpower around a buffet.\nBut in the end, United did what needed to be done. Tight at the back, compact in midfield, and took our chances when they came. So what were we all so worried about?\nSpeaking of midfield, let's talk about Ross Docherty. When he plays, he's the guy. It's hard to pinpoint exactly why, but his influence is undeniable. Goals and assists? Not so much. But any United fan will tell you, when he's in the team, he pulls the strings. A Paisley puppetmaster, if you will.\nThe problem? He just cannot stay fit. It's the old now you see him, now you don't. As much as that frustrates the fans, it must drive him up the wall. It just seems to be niggle after niggle and United always feel like a weaker side without the 32-year-old.\nBut when he's healthy, he's the first name on the teamsheet. There's a big decision to be made on El Capitan in the next few weeks as he's out of contract this summer.\nIf you could guarantee he'd stay fit, the club would have handed him a new contract already, I've no doubt about that.\nBut, unfortunately, his greatest weakness isn't his passing, tackling, or even his goalscoring, it's simply his availability. And that's what makes this such a tough call for the club.", "url": "https://www.bbc.com/sport/articles/cp8vl28q4yro"}