{"authors": ["Ciara Fleming", "www.facebook.com"], "date_download": "2025-05-21 06:22:25", "date_modify": "2025-05-21 06:22:25", "date_publish": "2025-03-31 14:23:54", "description": "Kieran McKenna press conference: Bournemouth vs Ipswich preview", "filename": "sport_football_articles_cj45dx00ejyo_1747808545.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8a85/live/ac9e2280-490a-11ef-9e1c-3b4a473456a6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cj45dx00ejyo_1747808545.html", "title": "Kieran McKenna press conference: Bournemouth vs Ipswich preview", "title_page": "Kieran McKenna press conference: Bournemouth vs Ipswich preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "McKenna says the Cherries have attacked transitions \"better than anyone else in the league this season\" and Ipswich will have to \"find the right balance\" between imposing their game and managing Bournemouth's strengths.\nOn Andoni Iraola: \"He has done very well. It seems like a really good fit. They have done very well as a club over the past couple of seasons, and recruitment has been excellent. They have a clear identity and have got players that fit the profile of how they want to play.\"\nMcKenna says that during the international break players and staff have \"used the time well\" to reflect and recover ahead of the final stretch of the season.\nMcKenna confirmed that forward Conor Chaplin has trained with the rest of the squad and is \"not too far away\" from a return, while Axel Tuanzebe and Kalvin Phillips are among a group of players whose fitness will be determined by a late \"judgement call\".\nWhen asked whether winger Jadon Philogene will be used more on the left, McKenna said it is \"not impossible\" that he plays more minutes on the left as the season progresses, but the \"biggest area of need\" is for him to play on the right.\nWhen asked if he will be keeping an eye on 17th-placed Wolves' match against West Ham, McKenna said he will be \"saving my mental energy\" for the things he can control.\nOn whether Ipswich still believe they can survive the drop: \"There are 27 points to play for, nearly a quarter of the season left, so we know from that perspective we are still in the fight. We know things can change quickly this week with one or two positive results so there is absolutely that belief that we can compete until the end of the season.\"", "url": "https://www.bbc.com/sport/football/articles/cj45dx00ejyo"}