{"authors": ["Andy Gray", "www.facebook.com"], "date_download": "2025-05-20 14:11:12", "date_modify": "2025-05-20 14:11:12", "date_publish": "2023-07-30 07:24:54", "description": "Republic of Ireland manager Vera Pauw says both she and her players deserve clarity over her future as manager.", "filename": "sport_football_66352677_1747750272.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/869A/production/_130585443_inpho_02298694.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66352677_1747750272.html", "title": "Vera Pauw: Irish manager feels players deserve certainty over her future", "title_page": "Vera Pauw: Irish manager feels players deserve certainty over her future - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Republic of Ireland manager Vera Pauw says both she and her players deserve clarity over her future as manager.\nPauw's contract expires after the World Cup and she has expressed her desire to stay on, but the tournament build-up revolved around allegations over her conduct while managing Houston Dash.\nThe Republic, who cannot progress from Group B, face Nigeria on Monday.\n\"Yes,\" Pauw said in a one-word response when asked if both she and the players deserved to know about her future.\nWhen asked to elaborate and if she felt she had the backing of the players, Pauw added: \"My situation has not changed.\n\"I think we have a fantastic bond in our team. That has been shown all over the four years.\"\nThe Republic of Ireland's build-up to the tournament was dominated by allegations levelled at Pauw that she body shamed players and behaved inappropriately during her time in charge of Dash in 2018.\nThe Dutch manager said the allegations, which were first published in the Athletic in December before a fresh article with new allegations in July, were \"crap and nonsense\", adding \"how can you defend yourself against a lie?\".", "url": "https://www.bbc.com/sport/football/66352677"}