{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:50:32", "date_modify": "2025-05-21 07:50:32", "date_publish": "2025-01-22 07:21:11", "description": "Chairman Jim Gavin says that the remit for the Football Review Committee was to make Gaelic football the most exiting amateur sport in the world.", "filename": "sport_articles_c62qxvqv051o_1747813832.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3db9/live/9e1885c0-d8a7-11ef-993a-9dfb304c6a75.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c62qxvqv051o_1747813832.html", "title": "Gavin planning 'the most exciting amateur game in the world'", "title_page": "Allianz Football League: Jim Gavin planning 'the most exciting amateur game in the world'  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Chairman Jim Gavin says that the remit for the Football Review Committee was to make Gaelic football the most exiting amateur sport in the world to both watch and play ahead of the first round of the National Leagues this weekend.\nAt GAA congress back in November all of the Football Review Committee's wide-ranging proposed rule changes for the 2025 season were accepted with big majorities at the GAA Special Congress at Croke Park in November.\nNo motion received less than 73% backing with only 60% required for most motions.\nThese included the adoption of the new 40-metre arc which goalkeepers will have to kick beyond, teams having to maintain at least three outfield players in both halves at all times and two points being awarded for kicks over the bar from outside the arc.\nInitially the six-time All-Ireland winning manager Gavin was unsure about lending his expertise to the rule change committee but after discussions with GAA president Jarlath Burns opted to get involved.\n\"When I got the call from Jarlath (Burns) my first reaction was do I have the time for this? But when he explained what his vision for the game was and what vision the association had for their games I got involved,\" Gavin told BBC Sport NI's GAA Social podcast.\n\"With Jarlath and when we sat down we talked through the strategic plan for the association and started with the rule book that's the level we went to.\n\"The vision it has for itself is that Gaelic games and all four codes [Gaelic football, hurling, ladies football and camogie] will be the most exciting amateur games in the world to both play and to watch.\n\"Every time you look at these rule enhancements, you have to look at it through the prism of what the Football Review Committee [FRC] are trying to achieve.\n\"The remit was that Gaelic football, one of the four codes within the association will be the most exciting amateur game in the world to play and watch.\"", "url": "https://www.bbc.com/sport/articles/c62qxvqv051o"}