{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:12:10", "date_modify": "2025-05-21 06:12:10", "date_publish": "2025-01-04 18:00:05", "description": "Glentoran are drawn to face big Belfast rivals Linfield in the sixth round of the Irish Cup while holders Cliftonville will host Glenavon or Dundela.", "filename": "sport_articles_cx2yzw590vno_1747807930.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4ca6/live/927369a0-cac5-11ef-bb47-87a9dea68aa1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cx2yzw590vno_1747807930.html", "title": "Irish Cup: Glens draw Linfield in Irish Cup sixth round", "title_page": "Irish Cup: Glens draw Linfield in Irish Cup sixth round - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Glentoran have been drawn to face big Belfast rivals Linfield at the Oval in the draw for the sixth round of the Irish Cup.\nThe Glens will be aiming to take a further step towards a first Irish Cup success since 2020 and a 24th in their history while the Blues secured the last of their record 44 wins in the competition in 2021.\nThe east Belfast side has won three of the four meetings between the sides this season, with their Boxing Day encounter ending in a draw.\nDungannon Swifts will host Coleraine, while cup holders Cliftonville will take on either Glenavon or Dundela at Solitude.\nLimavady United's reward for their giantkilling victory over Larne is a trip to Seaview to face 2022 and 2023 winners Crusaders.\nCarrick Rangers will travel to Ferney Park to play Championship side Ballinamallard United, with Ards, conquerors of Ballymena United, away to the winner of the fifth round tie between Belfast Celtic and Moyola Park.\nAnnagh United, who saw off neighbours Portadown in round five, are away to Bangor and Dollingstown or Ballyclare Comrades will face Institute or Loughgall.\nThe ties will be played on Friday 31 January and Saturday 1 February.", "url": "https://www.bbc.com/sport/articles/cx2yzw590vno"}