{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:10:04", "date_modify": "2025-05-19 15:10:04", "date_publish": "2017-07-04 19:46:33", "description": "Stuart Broad says he is fit and ready to play a role in what he believes will be an attack-minded England Test side under Joe Root.", "filename": "sport_cricket_40499573_1747667404.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3624/production/_96806831_broad2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_cricket_40499573_1747667404.html", "title": "England v South Africa: Stuart Broad expects Joe Root's side to be 'attacking'", "title_page": "England v South Africa: Stuart Broad expects Joe Root's side to be 'attacking' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Stuart Broad says he is fit and ready to play a role in what he believes will be an attack-minded England Test side under new captain Joe Root.\nA heel injury had made Broad doubtful for the first Test against South Africa, starting at Lord's on Thursday.\nBut after playing in Nottinghamshire's One-Day Cup final win over Surrey on Saturday, he says he is raring to go.\n\"I pulled up really well and I'll train again this afternoon and tomorrow. I feel confident,\" said Broad.\n\"I got through the Lord's final with no problems and bowled Wednesday and Friday before that with no pain.\n\"I've been playing county cricket since early April, so I've got quite a lot of red ball and white ball cricket in. It was great to have the intensity of a Lord's final, to play in it but also to put my body to the test.\"\nYorkshire batsman Root was named as successor to Alastair Cook as Test captain five months ago but has had to wait for the chance to put his plans into practice as England embarked on successive limited-overs campaigns.\nWith a Test average of 52.80 and ranked third in the world, Root has already established himself as England's top performer with the bat.\nBut Broad believes the captaincy will take the 26-year-old \"to the next level, if he can go any higher\".\n\"He'll really thrive off the extra responsibility,\" Broad told Sky Sports News.\n\"He's an attacking cricketer, quite aggressive in the way he plays, so I think the team will take that sort of shape.\"\nYorkshire batsman Gary Ballance has been recalled to England's squad for the first Test with South Africa.\nThe Yorkshire left-hander, 27, mustered just 49 runs in his past six Test innings, the most recent of which was in October.\nHowever, he averages 101 in the County Championship this season and Broad has backed him to succeed.\n\"He's a fine player with an amazing Test record,\" added Broad. \"He'll be thrilled to be in the squad and looking to make an instant impact. He's such a talented player.\n\"His numbers have been incredible. He's been the star player in Division One of the County Championship and held the Yorkshire batting line-up together.\n\"He's a really strong character, and I don't think he'll find it particularly tough.\"\nUncapped Middlesex seamer Toby Roland-Jones and Hampshire spinner Liam Dawson are also in the 12-man squad.\nDawson made his debut in England's last Test, in Chennai, while Roland-Jones is hoping for his first cap on his home ground.\nSouth Africa head into Thursday's Test with a number of high-profile absentees, including captain Faf du Plessis, who is temporarily unavailable after the birth of his first child. Dean Elgar will skipper the tourists in his absence.\nThey are also without pace bowler Dale Steyn, who has not recovered from a shoulder injury, and former captain AB de Villiers, who is taking a break from Test cricket.\nHowever, seamer Vernon Philander has backed the Proteas to prosper.\n\"We've lost players in the past, and guys have stepped up,\" said Philander. \"It's an opportunity for someone else to step up and make a name for himself. That's the way we always see it.\"\nHaving claimed 71 wickets in 17 Tests so far, fast bowler Kagiso Rabada is one man of whom England will be wary.\n\"He's a phenomenal talent,\" said Philander of his 22-year-old team-mate. \"Every time he gets the ball in his hand he seems to want to run in faster, bowl faster and get wickets.\n\"He's got that never-say-die attitude about him, which is always exciting to have.\"\nSouth Africa last played a Test series in England in 2012, which they won 2-1. However, England were victorious in the most recent series between the sides, winning 2-1 in South Africa in 2015-16.", "url": "https://www.bbc.com/sport/cricket/40499573"}