{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:35:49", "date_modify": "2025-04-26 04:35:49", "date_publish": "2025-02-28 12:08:45", "description": "Sheffield United boss Chris Wilder says his side will embrace the rest of the Championship season and the challenge of securing promotion.", "filename": "sport_football_articles_cd655124z0no_1745642149.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f71f/live/6ff7b0f0-f5c9-11ef-9b68-05a34bb37cf3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cd655124z0no_1745642149.html", "title": "Chris Wilder: Sheffield United 'feel OK about themselves' despite Leeds loss", "title_page": "Chris Wilder: Sheffield United 'feel OK about themselves' despite Leeds loss - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Sheffield United should not feel too downhearted after Monday's defeat by Championship leaders Leeds, according to boss Chris Wilder.\nThe Blades conceded two late goals to lose 3-1 at Bramall Lane but remain in second place as they prepare to visit QPR on Saturday.\n\"I think about the game 24/7 so you think about your messages and attitude towards the players when they come back in,\" Wilder told BBC Radio Sheffield.\n\"From experience you go on their feelings and the vibe around the place and I asked the question: how are you feeling about yourselves?\n\"I don't want them to be jumping through hoops and delighted we got beaten but they're feeling OK about themselves, so I worked off the back of that and said they had every right to feel OK - we have to believe but not be arrogant about it which I would never let happen.\"\nWilder's side had won four successive league games before Monday's loss and are two points clear of third-placed Burnley, who they visit in April.\n\"There's a load of football to be played and a load of points to be won so let's get on with what we need to do,\" Wilder added.\n\"My message to the players and the supporters is embrace it and enjoy it.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cd655124z0no"}