{"authors": ["Bill Rice", "www.facebook.com"], "date_download": "2025-05-21 06:10:34", "date_modify": "2025-05-21 06:10:34", "date_publish": "2024-12-24 12:52:40", "description": "Man Utd news: Opinion - 'Patience is vital' for Amorim rebuild", "filename": "sport_football_articles_cjr2jx11x43o_1747807834.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5b79/live/a57b0450-3ae1-11ef-bbe0-29f79e992ddd.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cjr2jx11x43o_1747807834.html", "title": "'Patience is vital'", "title_page": "Man Utd news: Opinion - 'Patience is vital' for Amorim rebuild - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It's hard to imagine how the first few months of the season could have gone any worse for Manchester United.\nHaving ended the last campaign with an unexpected FA Cup win, they opted to stick with Erik ten Hag as manager, only to change their mind just three months and 11 games into the new Premier League season.\nIt was a costly mistake, with roughly £21m spent on sacking the Dutchman and his coaching staff, and paying the compensation to get Ruben Amorim out of Sporting.\nEven this early in his tenure it's clear how the Portuguese wants his team to operate in an aggressive 3-4-3 formation, but he doesn't have all the personnel he needs to perfect it, and that will more than likely take more than one window to fix.\nMarcus Rashford's future is the big one that needs resolving – and while Amorim appears to want him to stay, if he were to leave in January it would bring in much-needed funds for the manager to spend on his rebuild. Antony may also be sold, while Alejandro Garnacho is surely one the club want to keep.\nAnother centre-back, a left-back, a midfielder and a proven striker are sure to be on Amorim's wish list – with Sporting's Viktor Gyokeres and Napoli's Victor Osimhen among the names being mentioned.\nIf United can get a proven goalscorer in - and some of those problem positions rectified in 2025 - they can start to move up the Premier League table, but it may be two years before we can talk about them challenging for the big trophies again, so patience is vital.", "url": "https://www.bbc.com/sport/football/articles/cjr2jx11x43o"}