{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:09:27", "date_modify": "2025-05-21 06:09:27", "date_publish": "2025-03-31 10:49:35", "description": "Norwich City forward Josh Sargent has said he is not definitely leaving the Championship club at the end of the season.", "filename": "sport_football_articles_cdrglry8j6do_1747807767.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c546/live/877b4b90-0e12-11f0-a9c9-194143bfd12c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cdrglry8j6do_1747807767.html", "title": "Josh Sargent: Norwich forward not definitely leaving", "title_page": "Josh Sargent: Norwich forward not definitely leaving - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Norwich City forward Josh Sargent says he is not \"definitely leaving\" at the end of the season.\nThe USA international scored a 92nd-minute winner against West Bromwich Albion on Saturday as the Canaries ended a four-game winless run to keep alive their Championship play-off hopes and then looked to calm talk of an imminent exit from Carrow Road.\n\"It's my favourite goal of the season so far - just for the timing of it against a good opponent and it's the most relief I've had scoring a goal this season for sure,\" Sargent told BBC Radio Norfolk.\nThe 25-year-old is under contract until 2028 but has been linked with a move to the Premier League and also a potential reunion with former Norwich boss Daniel Farke at Leeds.\n\"I have a contract here at Norwich. I'm very happy, my family is very happy here so it's no way saying I'm gone,\" said Sargent.\n\"I'm very happy with the manager and the team. I was just trying to say there will be options but that's not to say I'm definitely leaving - that's a decision for my family and me to make and obviously the club has to agree to me leaving in the first place.\"", "url": "https://www.bbc.com/sport/football/articles/cdrglry8j6do"}