{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:43:10", "date_modify": "2025-05-21 07:43:10", "date_publish": "2025-03-28 10:09:49", "description": "Hampshire sign South African batter Dewald Brevis for the T20 Blast and County Championship.", "filename": "sport_cricket_articles_c8d4vng324eo_1747813390.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/726d/live/53883c40-0b28-11f0-ba86-65448d8fd3ed.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c8d4vng324eo_1747813390.html", "title": "Dewald Brevis: Hampshire sign South African batter for T20 season", "title_page": "Dewald Brevis: Hampshire sign South African batter for T20 season - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Hampshire have signed South African batter Dewald Brevis for their T20 Blast campaign.\nThe 21-year-old could also play in the County Championships for Hampshire - who finished runners-up to Surrey last season.\nDuring his career so far, Brevis has represented the Mumbai Indians in the IPL, MI New York in MLC and MI Cape Town.\nHe has also featured in the Caribbean Premier League and Abu Dhabi T10.\nHe joins his fellow countryman Lhuan-dre Pretorius who Hampshire signed in February.\n\"I'm hugely excited about joining Hampshire Hawks for the Vitality Blast this summer,\" Brevis said.\n\"The team has a great history in the competition, and I look forward to being a part of that.\n\"It's great we have Lhuan-dre with us as well and hopefully we can put on a good show and entertain the crowd at Utilita Bowl on our way to reaching Finals Day and lifting the trophy.\n\"I'm also looking forward to playing in the County Championship, the team were so close last year, and I hope I can help the club push for the title in 2025.\"\nBrevis impressed in the 2022 Under-19 World Cup where he scored 506 runs with two centuries and three fifties in six innings.", "url": "https://www.bbc.com/sport/cricket/articles/c8d4vng324eo"}