{"authors": ["Katie Stafford", "www.facebook.com"], "date_download": "2025-04-26 07:53:15", "date_modify": "2025-04-26 07:53:15", "date_publish": "2025-02-25 14:12:38", "description": "Ruben Amorim press conference: Man Utd vs Ipswich preview", "filename": "sport_football_articles_cgm1yym9314o_1745653995.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/eec5/live/993cf210-a90a-11ef-a4fe-a3e9a6c5d640.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cgm1yym9314o_1745653995.html", "title": "Ruben Amorim press conference: Man Utd vs Ipswich preview", "title_page": "Ruben Amorim press conference: Man Utd vs Ipswich preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "There are no new injury concerns but there are also no sidelined players who can recover in time.\nAmorim said the latest staff redundancies \"have a lot to do with the lack of success of the football team\" because it has resulted in a loss of earnings.\nHe described it as \"a difficult period inside the club and on the pitch\" but, as \"the engine\" of the club, the responsibility lies with them - the team.\nOn how hard it has been for him to manage: \"It's always hard for everybody. They see their friends and team-mates losing their jobs but, again, I have to focus on what I can do to help the club in this moment. We as a club have to understand what we did wrong to get in this situation.\"\nHe said \"it's hard enough to win football matches\" without the current external noise around the club and went on to call the last year \"very hard\" for everyone involved at Manchester United.\nOn the pressure to win home games: \"Every time you go to Old Trafford you feel the support until the end. I don't feel the pressure and we have to stop and think about the last game. It's a new game and it can be a new story.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cgm1yym9314o"}