{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:16:17", "date_modify": "2025-04-26 04:16:17", "date_publish": "2025-03-04 09:31:19", "description": "Newcastle news: Dan Burn says Magpies can still achieve season's goals", "filename": "sport_football_articles_cddyz96lpeeo_1745640977.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a80d/live/b453e250-f8da-11ef-9628-add78e51db09.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cddyz96lpeeo_1745640977.html", "title": "Newcastle news: Dan Burn says Magpies can still achieve season's goals", "title_page": "Newcastle news: Dan Burn says Magpies can still achieve season's goals - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Newcastle defender Dan Burn is confident the Magpies can still reach their goals this season if they \"click\" again like they did over the festive period.\nSunday's FA Cup defeat by Brighton was their third loss in their last five games at St James' Park, a stark contrast to the nine successive victories around the turn of the year.\n\"As inconsistent as we've been this season, we're still in a good position for what we want to achieve,\" said Burn. \"We're in the European places and, although the league is so tight, we just need to put another run together like the one we had over Christmas to cement that position.\n\"Then we've obviously got the final just around the corner too, which is a massive opportunity.\n\"We know that if we can just get that inconsistency together and click, we can be a really good team.\"\nFans had hoped the FA Cup would provide a further route to Wembley this season, given the absence of many of the 'bigger' Premier League teams by the fifth round.\n\"The fact we're seeing it as a big missed opportunity just shows where the club is at,\" added Burn. \"The gaffer has brought that in.\n\"I can't comment too much on what went on before the gaffer came in with the different ownership, but I definitely feel as though there's a real emphasis on the cups now and a real belief that we can get to the latter stages of whatever competition we're in.\n\"We want to get to the finals and when you get to within a game of the quarter-finals and then go out in extra time, it definitely feels like you've missed a chance to potentially do something special.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cddyz96lpeeo"}