{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:33:37", "date_modify": "2025-05-20 13:33:37", "date_publish": "2023-07-24 18:35:05", "description": "Premier League chief executive Richard Masters says he \"wouldn't be too concerned at the moment\" about Saudi Arabia's growing influence in football.", "filename": "sport_football_66296370_1747748017.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1032E/production/_130505366_gettyimages-1493211681.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66296370_1747748017.html", "title": "Premier League chief Richard Masters 'not too concerned' by Saudi Arabia influence", "title_page": "Premier League chief Richard Masters 'not too concerned' by Saudi Arabia influence - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Premier League chief executive Richard Masters says he \"wouldn't be too concerned at the moment\" about Saudi Arabia's growing influence in football.\nCristiano Ronaldo moved to the Saudi Pro League in January and a number of high-profile players have followed him this summer.\nAl-Hilal have also made a world record £259m bid for Paris St-Germain and France forward Kylian Mbappe.\n\"Something new is obviously happening,\" Masters told BBC Sport's Alex Howell.\n\"The Saudi Pro League have stated they want to be a top 10 league by 2030.\n\"They are investing in players and managers to try to raise the profile of the league and clubs.\n\"It has taken us 30 years to get to the position that we have in terms of profile, competitiveness and the revenue streams that we have.\n\"I wouldn't be too concerned at the moment but, obviously, Saudi Arabian clubs have as much right to purchase players as any other league does.\n\"In the end, the Premier League is a £6bn-a-year operation in terms of revenue and that money is spent reinvested into the pitch.\n\"All good competitions have to have revenue streams to back them up.\"\nBallon d'Or winner Karim Benzema left Real Madrid to join Al-Ittihad, who have also signed ex-Chelsea midfielder N'Golo Kante and Portuguese forward Jota from Celtic.\nThey have also made a bid of £40m for Liverpool's Brazilian midfielder Fabinho.\nBrazil forward Roberto Firmino, whose contract with Liverpool expired in the summer, has joined Al-Ahli, and they have also signed Senegal keeper Edouard Mendy from Chelsea and agreed a £30m deal for Manchester City winger Riyad Mahrez.\nFormer Rangers and Aston Villa boss Steven Gerrard has taken over as manager of Al-Ettifaq, who have agreed a deal to sign Liverpool captain Jordan Henderson for £12m plus add-ons.", "url": "https://www.bbc.com/sport/football/66296370"}