{"authors": ["Dominic Raynor", "www.facebook.com"], "date_download": "2025-05-19 15:16:23", "date_modify": "2025-05-19 15:16:23", "date_publish": "2015-03-03 11:26:15", "description": "Goals from Victor Moses and Mame Biram Diouf give Stoke victory as Everton's poor Premier League form continues.", "filename": "sport_football_31616988_1747667783.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81405000/jpg/_81405912_vmoses_g.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31616988_1747667783.html", "title": "Stoke City 2-0 Everton", "title_page": "Stoke City 2-0 Everton - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Goals from Victor Moses and Mame Biram Diouf gave Stoke victory as Everton's poor Premier League form continued.\nMoses powered a 32nd-minute header into the top corner from Phil Bardsley's excellent cross to open the scoring.\nDiouf then prodded in a late second for Mark Hughes' side after Marko Arnautovic's shot hit the post.\nDefeat leaves Everton with 28 points from 28 matches - their worst tally at this stage of a season in the Premier League era.\nWhile their run to the last 16 of the Europa League has been impressive, they have been unable to transfer that form to the league - and they sit six points above the relegation zone, having collected just 11 points from their last 16 league matches.\nStoke, though, are on course for their highest Premier League finish. Hughes's side ended last season in ninth, on 50 points, and are currently eighth, on 42 points, with 10 games to play.\nThey headed into Wednesday's match in good form having lost just three of their last 13 Premier League matches and Peter Crouch was restored to the starting line-up after his record-equalling 46th headed Premier League goal secured a 1-0 victory against Hull on Saturday.\nHowever, the former England striker found it difficult to get into the game as Everton enjoyed 64% possession early on and it was Darron Gibson - making his first start of the season as the Toffees coped with five games in a fortnight - who registered the first shot on target in a scrappy match.\n\"I'm not sure Europe is achievable but we will have a go.\"\nEverton manager Roberto Martinez: \"I did feel that as a team, we showed we had played a number of matches in a short period of time. The desire for the result was there but the legs couldn't get there.\n\"We have 10 games and we will treat them as finals. We are in this situation for many reasons but we are looking forward and up to get as high up in the table as we can.\n\"We are ready to face the challenge straight on. We haven't got the results that our performances deserve.\n\"For everyone at the club, it's the moment to get together and make sure we finish the season strongly. We need bit of luck and momentum but it's not been that type of season.\"", "url": "https://www.bbc.com/sport/football/31616988"}