{"authors": ["Adam Pope", "www.facebook.com"], "date_download": "2025-05-21 03:47:11", "date_modify": "2025-05-21 03:47:11", "date_publish": "2025-04-07 16:00:03", "description": "Leeds United boss Daniel Farke speaks to the media before Tuesday night's Championship trip to Middlesbrough.", "filename": "sport_football_articles_cd9l2x4q7zyo_1747799231.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5352/live/1ae84f50-13c6-11f0-9800-8d6673554c66.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cd9l2x4q7zyo_1747799231.html", "title": "Leeds United news: Boss Daniel Farke will not start Patrick Bamford at Middlesbrough", "title_page": "Leeds United news: Boss Daniel Farke will not start Patrick Bamford at Middlesbrough - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The German boss revealed defender Pascal Struijk (foot) will miss the game and Saturday's visit of Preston. If there is a fracture, his season will be over.\nMidfielder Joe Rothwell (calf) will hopefully be available for the final two games while Mateo Joseph has recovered from illness and is fit to play.\nIt would not be \"natural\" to play Patrick Bamford from the start at his former club Boro after his \"beneficial\" cameo against Luton - his first appearance in three months - but Farke said the striker's availability was \"always important\".\nFarke says it is vital the \"fire burns\" within supporters and players during the \"crunch time of the season\" but that Leeds have to \"stay calm and cool\".\nHe added he has to be \"more there for the players\" when they make mistakes and provide \"some coolness\" to \"protect my players\" from any negativity.\nThe Leeds boss labelled Middlesbrough a \"really good side\" but added: \"If we are ourselves we will be successful.\"\nFarke dismissed any notion of tiredness within the squad: \"I'm not a believer in speaking about tiredness because if you speak about it, you feel it. I look at Jaidon Anthony at Burnley who's played nearly every game but got a brace (at Coventry on Saturday).\"", "url": "https://www.bbc.com/sport/football/articles/cd9l2x4q7zyo"}