{"authors": ["Jane Lewis", "www.facebook.com"], "date_download": "2025-05-21 06:32:50", "date_modify": "2025-05-21 06:32:50", "date_publish": "2024-12-24 10:34:52", "description": "Glasgow City and Celtic dominate SWPL TOTW", "filename": "sport_articles_c5yd915w9geo_1747809170.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ddfd/live/d9189380-c147-11ef-aff0-072ce821b6ab.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c5yd915w9geo_1747809170.html", "title": "Glasgow City and Celtic dominate SWPL TOTW", "title_page": "Glasgow City and Celtic dominate SWPL TOTW - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Emily Mutch (Motherwell): Made some important saves which played a big part in her side picking up a big point against an in-form Hearts side.\nEmma Lawton (Celtic): Quick to react as she got on the end of rebounds on two occasions to add to her goal tally in the 5-0 win over Spartans. Full of intent all afternoon to race up the wing and provide an attacking outlet.\nKelly Clark (Celtic): A fine header to make life a bit more comfortable for Celtic against Spartans. Also did her well at the other end, making some timely blocks when the opposition threatened.\nSam van Diemen (Glasgow City): Didn't have a huge amount to do defensively, but the one time she had to be alert, the Dutch defender blocked the danger. Rose well for her header at the other end, helping City to a routine win over Dundee United.\nAmy Muir (Glasgow City): Opened City's account with a cracker of a volley. Was always looking to play out from the back, racing forward to set up attacks.\nKatie Lockwood (Glasgow City): Scored two very similar goals where reacting quickly was the name of the game. Also grabbed an assist.\nMichaela McAlonie (Hibs): Provided great energy and control in the middle of the park. Was quietly effective in helping her side to a brilliant and deserved win over Rangers.\nLucy Ashworth-Clifford (Celtic): Was in the thick of the action with pinpoint deliveries. Her ball in from the corner for Clark's goal was bang on the money. Came close on a few occasions, including her effort which hit the woodwork allowing Lawton to follow up for Celtic's opener.\nLisa Forrest (Glasgow City): The 18-year-old - who has signed a new contract until 2029 - was back in the City starting 11 and took her chance well with two goals. Her second strike, a first-time volley, was executed really well.\nSaoirse Noonan (Celtic): Really lively for Celtic as they retuned to league business. Scored two goals, including one from the penalty spot.", "url": "https://www.bbc.com/sport/articles/c5yd915w9geo"}