{"authors": ["Marissa Thomas", "www.facebook.com"], "date_download": "2025-05-21 07:27:10", "date_modify": "2025-05-21 07:27:10", "date_publish": "2025-03-28 14:00:39", "description": "Andoni Iraola press conference: Bournemouth vs Manchester City preview", "filename": "sport_football_articles_crknkxglr50o_1747812430.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3796/live/00c517c0-0bdd-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_crknkxglr50o_1747812430.html", "title": "Andoni Iraola press conference: Bournemouth vs Manchester City preview", "title_page": "Andoni Iraola press conference: Bournemouth vs Manchester City preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Iraola began by providing some good injury news: \"Marcos [Sensei] definitely cannot play 90 minutes but I think he is going to be in the squad. We've worked well with Marcos, with Julian [Araujo] and Adam [Smith] is starting to do some things with the group.\"\nOn the opportunity to reach the semi-finals of the FA Cup for the first time in Bournemouth's history: \"We have a big opportunity this weekend. We know the challenge, we know who we face but the reward is very big.\"\nIraola continued: \"I don't know if it is going to be enough to beat City but everyone has to give everything, the ones who play, the ones who don't play, us from the bench, the supporters. At the end, the reward for everyone is huge. When you face a competition with the chance to play at Wembley, for us this is something we have dreamed of.\"\nWhen asked whether he can achieve all of his management goals at Bournemouth, Iraola said: \"I want to do my job the best I can. I don't know how far we can go, where we will finish. I want to do my job the best I can. If I don't do the job very well, they will find someone else. I'm really happy here. We have a great opportunity to make history and it would be amazing for me personally, for the club to achieve new heights but we know that we have to be realistic. There are better teams than us and we have to fight against teams that are very good. We will try to give the best level we have.\"\nOn defender Dean Huijsen being linked with a potential transfer: \"We are not surprised, probably because he has now made his national team debut [with Spain], he has played well, probably they are talking more about him. He has been playing consistently and I think he has performed very well. He has faced very difficult forwards but we already knew he was a very good player when he came in the summer.\"\nOn the differences between the two sides since they last met in November: \"We arrive in different moments, there has been a transfer window and new signings. I hope we give the level or close to the level we gave that day because I think we played very well. It is the only way to have a chance. If we are not at close to our very best level, it is going to be very difficult.\"\nOn the Cherries' state-of-the-art new training facility at Canford Magna: \"Big change for us, it's very new, we still have to familiarise but obviously it is a big improvement for the team, for the club. The pitches are perfect, we have all the tools we need but at least we cannot use any other excuses now because we have the best tools.\"\nOn how the new facilities can take the club to another level: \"The most important thing for me is the pitches. The pitches are perfect. Everything around, the gym, the pools, the physio rooms, everything is top level.\"", "url": "https://www.bbc.com/sport/football/articles/crknkxglr50o"}