{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:44:04", "date_modify": "2025-05-21 06:44:04", "date_publish": "2025-03-30 19:29:46", "description": "Swansea City: A tale of two passes for 'top level' Joe Allen", "filename": "sport_football_articles_clyw31dkq5ko_1747809844.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2357/live/06d1dbd0-0d40-11f0-8aec-538548a4922f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_clyw31dkq5ko_1747809844.html", "title": "Swansea City: A tale of two passes for 'top level' Joe Allen", "title_page": "Swansea City: A tale of two passes for 'top level' Joe Allen  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Alan Sheehan paid tribute to Joe Allen's \"top level\" contribution to Swansea City's dramatic draw at Leeds United – at the end of the week in which the midfielder's error almost cost Wales in North Macedonia.\nAllen was in the headlines for the wrong reasons as his uncharacteristic misplaced pass led to North Macedonia's opening goal in Tuesday's World Cup qualifier in Skopje.\nBut Allen's blushes were saved thanks to David Brooks' last-gasp Wales equaliser – and there was further redemption for the Swansea veteran at Elland Road.\nSheehan's team were staring at what would have been a painful defeat after Wilfried Gnonto put Leeds 2-1 up in the closing stages of Saturday's Championship fixture.\nBut Allen, 35, then produced a moment of quality to beat Ao Tanaka before rolling the ball through for Zan Vipotnik to lash home Swansea's 96th-minute leveller.\n\"I suppose it's two passes this week,\" said Swansea caretaker head coach Sheehan.\n\"You are talking about the pass Joe made for Wales and then you are talking about that inch-perfect, weighted pass [for Vipotnik].\n\"This is the detail you are talking about. He is leaving that there in the 96th minute at Elland Road so he can hit it first time… that's top level.\n\"With some people, you'll need to take a touch there and then it changes. You are looking for those big moments and to be clinical like that.\"", "url": "https://www.bbc.com/sport/football/articles/clyw31dkq5ko"}