{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:49:57", "date_modify": "2025-05-21 03:49:57", "date_publish": "2025-04-07 11:43:52", "description": "Coventry City midfielder Matt Grimes says there is no \"disgrace\" in losing to the top three Championship teams.", "filename": "sport_football_articles_c2de4pyjlpno_1747799397.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2086/live/52c948a0-13a5-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c2de4pyjlpno_1747799397.html", "title": "Coventry City: 'No disgrace in losing to the top three'", "title_page": "Coventry City: 'No disgrace in losing to the top three' - Matt Grimes - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Matt Grimes says there is no \"disgrace\" in losing to the top three teams as Coventry City have suffered two successive defeats in the Championship.\nA 2-1 loss to Burnley on the weekend leaves the Sky Blues just outside the play-off places, having also experienced defeat to Sheffield United in their previous game.\nGrimes does not think the lost points are the result of pressure building on the Sky Blues after a club record run of nine wins in 10 games had thrust them back into the play-off equation.\n\"I think there's massive pressure on every game, not just the two defeats that we've had,\" Grimes told BBC Radio CWR.\n\"We've lost four in the last 14 games I think, and three of those have been against the top three. I don't think there's any disgrace in that.\n\"We've give everyone a good game and like any game that we lose, we'll be looking to bounce back.\"\nJaidon Anthony scored twice for the Clarets to take the win at the CBS Arena - but Grimes isn't looking to rue on any defensive frailties that might have supplied the forward his time to shine.\nAnthony's winner was something of a gift as miscommunication between goalkeeper Bradley Collins and defender Liam Kitching on the edge of the area in attempting to clear the ball, presented the Burnley forward with an unguarded net.\n\"Between now and then end of the season, we'll most likely concede another freak goal like that,\" Grimes said.\n\"You get on with it, you stick your chest out and crack on. It's part of the parcel of being a footballer. Another day, it could go either way.\"", "url": "https://www.bbc.com/sport/football/articles/c2de4pyjlpno"}