{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:58:41", "date_modify": "2025-05-21 07:58:41", "date_publish": "2024-12-23 10:55:28", "description": "Fabian Hurzeler press conference: Brighton vs Brentford preview", "filename": "sport_football_articles_c5yv9z3r2glo_1747814321.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0f5a/live/5ccfa4a0-4909-11ef-9e1c-3b4a473456a6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c5yv9z3r2glo_1747814321.html", "title": "Fabian Hurzeler press conference: Brighton vs Brentford preview", "title_page": "Fabian Hurzeler press conference: Brighton vs Brentford preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Adam Webster and Solly March could be part of the matchday squad on Friday.\nHurzeler hopes Mats Wieffer's leg injury \"is not too serious\", while all the other players came through Saturday's game unscathed.\nJan Paul van Hecke, who was accidentally kicked in the head by team-mate Carlos Baleba, \"has some swelling but will be fine\".\nHurzeler said \"we try to improve the players with every training session\" as he referenced having different coaches for the defence and attack. On not winning in five games, he added: \"We train a lot, we continue to train a lot. It is not a case of because we are not scoring a lot we train more.\"\nMore from Hurzeler on recent form: \"We see this [the game against Brentford] as an opportunity to get out of this circle of bad experiences. We need to try to play with more intensity and give the supporters a present.\"\nOn Brentford: \"They are really intense. They focus on things they can influence. For example, kick-off is a chance to score. A set-piece is a big chance to score. They really take care of small details.\"\nHe said they \"have to prepare for both\" a back four or five as Thomas Frank switches his side up regularly.\nDefender Veltman came through the West Ham game \"quite good,\" with Hurzeler adding: \"You already see his impact on the team.\"", "url": "https://www.bbc.com/sport/football/articles/c5yv9z3r2glo"}