{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:47:23", "date_modify": "2025-05-21 07:47:23", "date_publish": "2025-03-28 07:47:37", "description": "Skipper Amy Boyle's birthday celebrations will be on hold with Antrim facing Clare in the Division 1B Camogie League Final on Saturday.", "filename": "sport_articles_ckgn7wm74e2o_1747813643.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9376/live/eb1391d0-0afc-11f0-93c7-431cc016c489.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_ckgn7wm74e2o_1747813643.html", "title": "Amy Boyle: Antrim skipper's birthday celebrations on hold as Saffrons face Clare League decider", "title_page": "Amy Boyle: Antrim skipper's birthday celebrations on hold as Saffrons face Clare League decider - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Antrim camogie skipper Amy Boyle turns 25 on Friday but the captain's celebrations will be on hold with the Saffrons taking on Clare in the Division 1B Camogie League Final at Abbotstown on Saturday afternoon (14:00 GMT).\nVictory would secure Antrim a return to the top tier.\nGetting to work three out of five days from home in her banking job in Belfast has been conducive to a smooth build-up to the game, as it is to the lifestyle of an inter-county camogie player in general.\nAnd the Loughgiel Shamrocks club-woman is showing the benefits of it, driving her team forward as they have built steadily through the group phase to get to the decider.\nIt has been some turnaround for the Saffrons after a disappointing 2024 campaign.\nCarl McCormick and Martin Coulter took over the reins in difficult circumstances last year but their victory over senior side Wexford in round one of the League demonstrated Antrim's revival.\n\"Last year we got beat by 52 points by them. So that was a 53-point turnaround. So the whole thing, each match, it's just got better,\" says Boyle.\nThe skipper says an infusion of youth has helped to rejuvenate the Saffrons squad.\n\"We've got a lot of younger players through the panel this year. And there's been a few girls just couldn't commit other years have come on board.\n\"You see the difference of having a real strong panel, which is maybe something the last couple of years, we've been really light on our numbers. We've 29 players this year, which is really making a difference in our training as well.\"\nKatie Molloy, Cassie McArthur, Janey McIntosh and free-taker Dervla Cosgrove have all impressed this year after not being part of last year's squad.\nCamogie aficionados may recall Cosgrove scoring a 84-second hat-trick and four goals in total when Antrim's second string won the All-Ireland premier junior title in 2022.\nLast year was tough but Boyle was never going to desert the ranks despite the squad's struggles.\n\"When you have been on the panel a few years, you can see how rewarding it can be.\n\"Last year was maybe one of the more difficult years to be on the panel but you remember back to when we did win the All-Ireland and you're trying to let some of the younger girls that didn't experience it know that that's what inter-county can be.\"\nOperating at this level, weights are an important part of any conditioning programme now and as a diminutive player who has tended to do her best work in the hustle and bustle of the middle third, it is not something Boyle can afford to shirk.\n\"I've just had to come around to it. I'd still rather do the stick work and the running and stuff than the gym, which is maybe not my forte, but you have to do it.\"\nIn addition to her Antrim service, Boyle has helped her club to three successive Ulster titles which ended Slaughtneil's spell of provincial dominance.\nLoughgiel also reached the 2002 All-Ireland Club Final only to lose out to Sarsfields in a thriller.\nLooking more specifically at Saturday's contest, Boyle insists little can be gleaned from Antrim's 5-12 to 1-10 win over the Banner women last weekend in what was effectively a dead rubber with both sides resting several regulars having already secured spots in Saturday's final.\n\"We're under no illusions that it'll be a different Clare side we meet again. Clare have been a senior team now for a long time. They have plenty of experience.\"\nIrrespective of Saturday's result, Antrim will be playing in the Intermediate Championship this year but Boyle saying securing a return to the League's top tier for 2026 would be of big benefit to the team.\n\"We beat a lot of the teams that were playing in the senior so that's the hope that next year, if we were to win on Saturday, that you'd get up and get that experience in 1A, and those matches would stand to you in the long term.\"", "url": "https://www.bbc.com/sport/articles/ckgn7wm74e2o"}