{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:31:08", "date_modify": "2025-05-19 14:31:08", "date_publish": "2017-08-05 17:48:31", "description": "Scottish Rugby unveils a new £3.6m domestic league structure, spearheaded by a semi-professional six-team top tier.", "filename": "sport_rugby-union_40838389_1747665068.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/354A/production/_97224631_13474123.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_rugby-union_40838389_1747665068.html", "title": "Scottish Rugby: Semi-professional 'Super Six' league heads domestic overhaul", "title_page": "Scottish Rugby: Semi-professional 'Super Six' league heads domestic overhaul - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Scottish Rugby will introduce a six-team semi-professional league as part of a £3.6m overhaul of its domestic structure from 2019-20.\nThe \"Super Six\" will replace the BT Premiership, and sit directly above an amateur 12-team Championship.\nBelow this will come a new three-tier National League system.\nThe plans, unveiled at Saturday's annual general meeting, aim to close the gap between the club game and professional teams in Scotland.\nScottish Rugby is funding the restructuring with £3.6m of new investment over five years, and the changes will take effect in time for the 2019-20 season.\nAt present, the BT Premiership, the top tier of the Scottish club game, has 10 clubs, with the National One, Two and Three leagues featuring 12 clubs each.\nAll the Super Six teams will be overseen by the governing body's high performance department, which will allocate funding for head coaches, strength and conditioning, and analysis support. Funding costs for squads of 35 players will be split between Scottish Rugby and the clubs, with teams playing a 20-match season.\nWith franchises in the Super Six running for five years at a time, Scottish Rugby hopes teams in the Scottish Championship and national leagues \"can build stronger community ties and focus investment on developing their clubs in the absence of player payments\".\nClubs can apply to join the Super Six tier, but will be required to contribute their own investment \"to complement Scottish Rugby's financial support\".\n\"We wanted to create clear pathways for players, coaches and officials, alongside closing the gap between our domestic game and the professional teams so we can maximise the resources we have and allow talented players to develop in good environments and fulfil their potential.\n\"We want to see clubs invest in their infrastructures and future growth so the National Leagues will have amateur status and the Super Six will be where player payments make better sense.\n\"This is not a radical plan, it is simply overdue and we look forward to working with all the clubs in Scotland to deliver this new structure for the wider benefit of the game at large.\"", "url": "https://www.bbc.com/sport/rugby-union/40838389"}