{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:04:15", "date_modify": "2025-05-21 05:04:15", "date_publish": "2025-04-04 08:16:13", "description": "Crystal Palace news: Opinion - Fara Williams on whether Palace can hold on to their best players", "filename": "sport_football_articles_cn05dve7ndqo_1747803855.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d635/live/a97973f0-6e9b-11ef-b02d-c5f3b724a1ea.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cn05dve7ndqo_1747803855.html", "title": "Crystal Palace news: Opinion", "title_page": "Crystal Palace news: Opinion - Fara Williams on whether Palace can hold on to their best players  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A draw at Southampton was a surprising result for Crystal Palace but getting that late equaliser still showed the grit in Oliver Glasner's team.\nIt could have just been a defeat on the road but they kept themselves in the game and did enough to take home a point.\nNext up are rivals Brighton at Selhurst Park and the Seagulls will be well aware of Palace's form in 2025 and their threats in Eberechi Eze and Jean-Phillipe Mateta. It will be a difficult game for the travelling side.\nIt is always is difficult when these two sides meet because of the rivalry and passion, but this season both teams are pushing for a top 10 spot, which is exciting.\nI think this year in general has been exciting because the Premier League has been so wide open. The fact a team in 12th could still potentially finish in a European place shows that while of course, Palace are also in the FA Cup semi-finals.\nThe difficulty with having such a good season though is then holding on to your key players. We saw the interest in Marc Guehi last summer while Michael Olise left for Bayern Munich. Ultimately, Palace do lose talent to poachers.\nI am sure there will be eyes on Eze and Mateta this time around but they need to try and hold on to them.\nIf they cannot, then it means rebuilding again and that is difficult. Adding to what they already have now means they could build on what they have achieved in the second part of this season and climb the table next year.", "url": "https://www.bbc.com/sport/football/articles/cn05dve7ndqo"}