{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:24:34", "date_modify": "2025-05-21 06:24:34", "date_publish": "2025-02-08 14:46:59", "description": "Man Utd 2-1 Leicester: Fan views on FA Cup tie", "filename": "sport_football_articles_cpwxe775p7ro_1747808674.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cpwxe775p7ro_1747808674.html", "title": "Man Utd 2-1 Leicester: Fan views on FA Cup tie", "title_page": "Man Utd 2-1 Leicester: Fan views on FA Cup tie - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your views on Manchester United's match against Leicester in the FA Cup.\nHere are some of your comments:\nMan Utd fans\nJohn: Dreadful in first half with some improvement in the second. Overall a very poor display; poor passing, little skill and lacking enthusiasm.\nMac: Never seen so many passes given away, territory squandered and such an obvious lack of strategy. Second half and Garnacho were totally different but still had to wait for a goal to ignite the team. Very lucky to get the winner - offside all day but I'll take it.\nPeter: I've been watching United for over 60 years and the first half was the worst I have ever seen. A little better in the second half but no real threat. Even our second goal was apparently well offside.\nLeicester fans\nJimmy: Leicester were by far the better team, taking the game to United and causing lots of problems... then early in the second half made lots of stupid substitutions which disrupted the team tactics and shape Irrespective of United winning with a clearly offside goal, bad decisions cost us a lucrative place in the next round. Let's hope the Foxes show the same desire and passion to win for the remainder of the season.\nMark: We were cruising against a poor Manchester United until Van Nistelrooy took off Thomas and Ndidi. Garnacho coming on made all the difference and our genius manager takes the left-back, who was doing fine, off instead of the right-back, who was getting skinned. And don't forget the obligatory offside goal in favour of United (it wasn't even close, so how did the linesman miss it from a dead ball?)", "url": "https://www.bbc.com/sport/football/articles/cpwxe775p7ro"}