{"authors": ["Celestine Karoney and Fernando Duarte", "www.facebook.com"], "date_download": "2025-05-20 12:04:52", "date_modify": "2025-05-20 12:04:52", "date_publish": "2023-08-05 12:42:52", "description": "Barcelona’s Asisat Oshoala overcame her parents’ opposition to a career in sports to become one of the world’s best footballers and a role model for African women.", "filename": "sport_africa_66407312_1747742692.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/82EC/production/_130661533_gettyimages-1573914710.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_africa_66407312_1747742692.html", "title": "Women’s World Cup 2023: Asisat Oshoala’s journey from rebellious teenager to Africa's star player", "title_page": "Women’s World Cup 2023: Asisat Oshoala’s journey from rebellious teenager to Africa's star player - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Asisat Oshoala's father admits he did not want his daughter to become a footballer and used to scold her when she returned from playing with friends on the streets in Nigeria.\n\"We didn't see a bright future for her in football and my plan was to make sure all my children attained a high level of education and do better than us parents,\" Alhaji Oshoala told the BBC.\nBut he is now pleased his rebellious daughter persisted as Asisat became the first Nigerian footballer - male or female - to score in three different World Cup tournaments.\nThe Barcelona forward will be facing England on Monday, in the last 16 of the Fifa Women's World Cup and Alhaji said it has been a joy to see his daughter excel in the global tournament.\nShe did, however, raise a few eyebrows - including her father's - when she ripped off her shirt to celebrate her match-winning goal against the tournament co-hosts, Australia, in the group stages.\n\"My dad is not happy with my choice of celebration,\" she posted on Instagram, prompting fans to ask him to forgive her. They didn't need to worry though.\n\"It was an outpouring of emotions and it was not intentional. I am proud of my daughter,\" he said, without revealing the exact conversation. \"What I said to her is between my daughter and I.\"\nIn a 2022 documentary produced by football's world governing body Fifa, Asisat spoke of the tug of war between wanting her to continue her studies and become a lawyer and her passion for football.\n\"I realised I was good at playing football and wanted to do it at the highest level,\" she said.\n\"My parents didn't want me to play sports at all and sometimes there were big fights at home. I had to run to my grandmother's house to escape trouble.\"\nEventually Asisat's parents agreed to let her embrace her passion and even drop out of school to pursue a professional career in football after she was spotted playing among male counterparts in Lagos and referred to local club FC Robo. That was in 2009 when she was 15.\nEmmanuel Osahon, the club's owner and head coach told the BBC that Asisat's commitment to the game immediately stood out in training sessions.\n\"Asisat was very obedient and stubborn on the pitch. When she didn't score, she would refuse to eat,\" Osahon recalled.\nThe coach also said the player's success has inspired young Nigerian women footballers to follow in her footsteps.\n\"I now have more than 10 players aspiring to be the next Asisat Oshoala,\" he explained.\nAsisat played in Nigeria until 2015, when she was signed by Liverpool and moved abroad. She also played in China for two seasons before joining Barcelona in 2019.\nTwo years later, she became the first ever African woman footballer to win the Uefa Champions League.\nAsisat's struggle to persuade her family to let her become a footballer inspired her to open an all-girls football school in Lagos last year, the Asisat Oshoala Academy.\nOn its website, she says she is committed to paving the way for others: \"I have always strived to give back to the girls in my community and I believe this football academy will provide opportunities for more girls to excel through the combination of sport and education.\"\nHaving served her national team since 2014, Asisat has been voted African Women's Footballer of the Year a record five times.\nHer contributions have not been restricted to the pitch, however. She spoke openly about disputes with the Nigerian Football Federation about unpaid bonuses and allowances to the squad that marred the team's World Cup preparations.\n\"It's not always a good look to stage protests because all the players want to do is focus on the football,\" she told the BBC in June.\nNigeria have several Women's African Cup titles in their trophy room but their best World Cup finish was a quarter-final in 1999.\nThis year's tournament has already seen a fair share of surprising results, so Asisat and her team-mates are now entertaining the prospect of upsetting continental champions and title contenders England.\n\"Our team has a lot to offer, and the world has seen it [at the World Cup],\" she said in a pitchside interview after the game against Australia.\nWhat is certain is that her father will be glued to the TV set back home cheering on his daughter. \"Nothing can stop Nigeria now. They will win,\" he said.", "url": "https://www.bbc.com/sport/africa/66407312"}